Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/tutorial/appendix.po
Languages: ar, ru

source: Appendix
ar: مُلحقات
ru: Приложение

source: Interactive Mode
ar: الوضع التفاعلي
ru: Интерактивный режим

source: There are two variants of the interactive :term:`REPL`. The classic basic interpreter is supported on all platforms with minimal line control capabilities.
ru: Существует два варианта интерактивного :term:`REPL`. Классический базовый интерпретатор поддерживается на всех платформах с минимальными возможностями управления линией.

source: On Windows, or Unix-like systems with :mod:`curses` support, a new interactive shell is used by default. This one supports color, multiline editing, history browsing, and paste mode. To disable color, see :ref:`using-on-controlling-color` for details. Function keys provide some additional functionality. :kbd:`F1` enters the interactive help browser :mod:`pydoc`. :kbd:`F2` allows for browsing command-line history with neither output nor the :term:`>>>` and :term:`...` prompts. :kbd:`F3` enters "paste mode", which makes pasting larger blocks of code easier. Press :kbd:`F3` to return to the regular prompt.
ru: В Windows или Unix-подобных системах с поддержкой :mod:`curses` по умолчанию используется новая интерактивная оболочка. Он поддерживает цвет, многострочное редактирование, просмотр истории и режим вставки. Чтобы отключить цвет, подробности см. в разделе :ref:`using-on-controlling-color`. Функциональные клавиши предоставляют некоторые дополнительные функции. :kbd:`F1` открывает интерактивный браузер справки :mod:`pydoc`. :kbd:`F2` позволяет просматривать историю командной строки без вывода данных и без подсказок :term:`>>>` и :term:`...`. :kbd:`F3` переходит в «режим вставки», который упрощает вставку больших блоков кода. Нажмите :kbd:`F3`, чтобы вернуться к обычному приглашению.

source: When using the new interactive shell, exit the shell by typing :kbd:`exit` or :kbd:`quit`. Adding call parentheses after those commands is not required.
ru: При использовании новой интерактивной оболочки выйдите из нее, набрав :kbd:`exit` или :kbd:`quit`. Добавление скобок вызова после этих команд не требуется.

source: If the new interactive shell is not desired, it can be disabled via the :envvar:`PYTHON_BASIC_REPL` environment variable.
ru: Если новая интерактивная оболочка нежелательна, ее можно отключить с помощью переменной среды :envvar:`PYTHON_BASIC_REPL`.

source: Error Handling
ar: التعامل مع الأخطاء
ru: Обработка ошибок

source: When an error occurs, the interpreter prints an error message and a stack trace. In interactive mode, it then returns to the primary prompt; when input came from a file, it exits with a nonzero exit status after printing the stack trace. (Exceptions handled by an :keyword:`except` clause in a :keyword:`try` statement are not errors in this context.) Some errors are unconditionally fatal and cause an exit with a nonzero exit status; this applies to internal inconsistencies and some cases of running out of memory. All error messages are written to the standard error stream; normal output from executed commands is written to standard output.
ru: Когда возникает ошибка, интерпретатор выводит сообщение об ошибке и трассировку стека. В интерактивном режиме он затем возвращается к первичному запросу; когда ввод осуществляется из файла, он завершается с ненулевым кодом завершения после вывода трассировки стека. (Исключения, обрабатываемые фразой :keyword:`except` в инструкции :keyword:`try`, не являются ошибками в этом контексте.) Некоторые ошибки являются безусловно фатальными и приводят к завершению с ненулевым кодом завершения; это относится к внутренним несоответствиям и некоторым случаям исчерпания памяти. Все сообщения об ошибках записываются в поток стандартного вывода ошибок; нормальный вывод выполненных команд записывается в стандартный вывод.

source: Typing the interrupt character (usually :kbd:`Control-C` or :kbd:`Delete`) to the primary or secondary prompt cancels the input and returns to the primary prompt. [#]_ Typing an interrupt while a command is executing raises the :exc:`KeyboardInterrupt` exception, which may be handled by a :keyword:`try` statement.
ar: تؤدي كتابة رموز المقاطعة (عادتًا :kbd:`Control-C` أو :kbd:`Delete`) في الموجه الأساسي أو الثانوي إلى إلغاء المدخلات والعودة إلى الموجه الأساسي. [#] _ تؤدي كتابة المقاطعة أثناء تنفيذ الأمر إلى حدوث استثناء :exc:`KeyboardInterrupt`، والذي يمكن معالجته بواسطة عبارة :keyword:`try`.
ru: Ввод символа прерывания (обычно :kbd:`Control-C` или :kbd:`Delete`) в основном или вторичном запросе отменяет ввод и возвращает к основному запросу. [#]_ Ввод прерывания во время выполнения команды вызывает исключение :exc:`KeyboardInterrupt`, которое может быть обработано инструкцией :keyword:`try`.

source: Executable Python Scripts
ar: نصوص بايثون القابلة للتنفيذ
ru: Исполняемые Python скрипты

source: On BSD'ish Unix systems, Python scripts can be made directly executable, like shell scripts, by putting the line ::
ar: في أنظمة يونكس BSD'ish، يمكن جعل نصوص بايثون قابلة للتنفيذ بشكل مباشر مثل نصوص الصدفيَّة، عن طريق وضع السطر ::
ru: На BSD-подобных Unix-системах скрипты Python могут быть сделаны непосредственно исполняемыми, как скрипты командной оболочки, добавив строку ::

source: (assuming that the interpreter is on the user's :envvar:`PATH`) at the beginning of the script and giving the file an executable mode. The ``#!`` must be the first two characters of the file. On some platforms, this first line must end with a Unix-style line ending (``'\n'``), not a Windows (``'\r\n'``) line ending. Note that the hash, or pound, character, ``'#'``, is used to start a comment in Python.
ar: (هذا بافتراض أن المفسر موجود في الـ :envvar:`PATH` الخاص بالمُستخدم) يوضع السطر في بداية النص ويجب منح الملف وضع قابلية التنفيذ. يجب أن يكونا `` #! '' أول رمزين في الملف. في بعض الأنظمة يجب أن ينتهي هذا السطر الأول بنهاية سطر بنمط نهاية يونكس (``'\n'``)، وليس نهاية سطر ويندوز (``'\r\n'``). لاحظ أن رمز الهاش ``'#'` يُستخدم لبدء تعليق في بايثون.
ru: (предполагается, что интерпретатор находится в :envvar:`PATH`) в начало скрипта и дав файлу режим исполнения. ``#!`` должны быть первыми двумя символами файла. На некоторых платформах первая строка должна заканчиваться символом новой строки в стиле Unix (``'\n'``), а не символом новой строки Windows (``'\r\n'``). Обратите внимание, что символ хэша или решетки, ``'#'``, используется для начала комментария в Python.

source: The script can be given an executable mode, or permission, using the :program:`chmod` command.
ar: يمكن إعطاء النصوص وضع قابلية التنفيذ، أو إذن، باستخدام الأمر :program:`chmod`.
ru: Скрипту можно назначить режим исполнения или права доступа с помощью команды :program:`chmod`.

source: On Windows systems, there is no notion of an "executable mode". The Python installer automatically associates ``.py`` files with ``python.exe`` so that a double-click on a Python file will run it as a script. The extension can also be ``.pyw``, in that case, the console window that normally appears is suppressed.
ar: في أنظمة ويمندوز، لا يوجد مفهوم "وضع قابل للتنفيذ". إذ أن مثبِّت بايثون يربط ملفات ``.py`` تلقائيًا بـ"python.exe" بحيث يؤدي النقر المزدوج فوق ملف بايثون إلى تشغيله كبرنامج نصي. يمكن أن يكون الامتداد أيضًا ``.pyw``، في هذه الحالة يتم قمع نافذة لوحة الأوامر التي تظهر عادة.
ru: На системах Windows нет понятия "режима исполнения". Установщик Python автоматически ассоциирует файлы с расширением ``.py`` с ``python.exe``, так что двойной щелчок по файлу Python запустит его как скрипт. Расширение также может быть ``.pyw``, в этом случае окно консоли, которое обычно появляется, будет скрыто.

source: The Interactive Startup File
ar: ملف بدء التشغيل التفاعلي
ru: Файл интерактивного запуска

source: When you use Python interactively, it is frequently handy to have some standard commands executed every time the interpreter is started. You can do this by setting an environment variable named :envvar:`PYTHONSTARTUP` to the name of a file containing your start-up commands. This is similar to the :file:`.profile` feature of the Unix shells.
ar: عندما تستخدم بايثون بشكل تفاعلي، يكون من الأسهل في كثير من الأحيان تنفيذ بعض الأوامر القياسية في كل مرة يبدأ فيها المفسر. يمكنك فعل ذلك عن طريق تعيين متغير بيئة يسمى :envvar:`PYTHONSTARTUP` إلى اسم ملف يحتوي على أوامر بدء التشغيل الخاصة بك. هذا مشابه لميزة :file:`.profile` لصدفيات يونكس.
ru: При интерактивном использовании Python часто бывает удобно, чтобы некоторые стандартные команды выполнялись при каждом запуске интерпретатора. Вы можете сделать это, установив переменную окружения :envvar:`PYTHONSTARTUP` в имя файла, содержащего ваши команды запуска. Это похоже на функцию :file:`.profile` в оболочках Unix.

source: This file is only read in interactive sessions, not when Python reads commands from a script, and not when :file:`/dev/tty` is given as the explicit source of commands (which otherwise behaves like an interactive session). It is executed in the same namespace where interactive commands are executed, so that objects that it defines or imports can be used without qualification in the interactive session. You can also change the prompts ``sys.ps1`` and ``sys.ps2`` in this file.
ar: تتم قراءة هذا الملف فقط في الجلسات التفاعلية، وليس عندما تقرأ بايثون أوامر من نص برمجي، وليس عندما يُعطى :file:`/dev/tty` كمصدر صريح للأوامر (الذي بخلاف ذلك يتصرف كجلسة تفاعلية). يتم تنفيذها في نفس حيِّز الاسم حيث يتم تنفيذ الأوامر التفاعلية بحيث يمكن استخدام الكائنات التي تحددها أو تستوردها بدون تأهيل في الجلسة التفاعلية. يمكنك أيضًا تغيير العلامات ``sys.ps1`` و ``sys.ps2` في هذا الملف.
ru: Этот файл исполняется только в интерактивном режиме, а не при исполнении других файлов или при использовании :file:`/dev/tty` в качестве источника команд (который в других случаях работает как интерактивный режим). Файл исполняется в том же пространстве имен что и интерактивные команды, таким образом любые определенные в нем объекты или импорты напрямую доступны в интерактивной сессии. Вы также можете поменять вид первичного ``sys.ps1`` и вторичного ``sys.ps2`` приглашения ввода.

source: If you want to read an additional start-up file from the current directory, you can program this in the global start-up file using code like ``if os.path.isfile('.pythonrc.py'): exec(open('.pythonrc.py').read())``. If you want to use the startup file in a script, you must do this explicitly in the script::
ar: إذا كنت تريد قراءة ملف بدء تشغيل إضافي من الدليل الحالي، يمكنك برمجة هذا في ملف بدء التشغيل العام باستخدام رمز مثل `if os.path.isfile('.pythonrc.py'): exec(open('.pythonrc.py').read())``. إذا كنت تريد استخدام ملف بدء التشغيل داخل نص، يجب عليك القيام بذلك بشكل صريح في النص البرمجي:
ru: Если вы хотите использовать дополнительный файл настройки запуска из текущей директории, то запрограммируйте это в глобальном файле настроек через ``if os.path.isfile('.pythonrc.py'): exec(open('.pythonrc.py').read())``. Если вы хотите использовать файл настроек напряму в вашей программе, то используйте следующий код : ::

source: The Customization Modules
ar: وحدات التخصيص
ru: Модули настройки

source: Python provides two hooks to let you customize it: :index:`sitecustomize` and :index:`usercustomize`. To see how it works, you need first to find the location of your user site-packages directory. Start Python and run this code::
ru: Python предоставляет два хука, позволяющих настроить его: :index:`sitecustomize`и :index:`usercustomize`. Чтобы увидеть, как это работает, вам нужно сначала найти вашу папку site-package. Запустить Python и запустите этот код::

source: Now you can create a file named :file:`usercustomize.py` in that directory and put anything you want in it. It will affect every invocation of Python, unless it is started with the :option:`-s` option to disable the automatic import.
ar: يمكنك الآن إنشاء ملف باسم :file:`usercustomize.py` في هذا المجلد وضع أي شيء تريده فيه. سيؤثر ذلك على كل استدعاء لبايثون ما لم يبدأ بالخيار option:`-s` لتعطيل الاستيراد التلقائي.
ru: Теперь в можете создать в этой директории файл :file:`usercustomize.py` и добавить в него любой желаемый код. Он будет влиять на любой запуск Python, за исключением случаев когда использовалась опция :option:`-s` для отключения автоматического импорта.

source: :index:`sitecustomize` works in the same way, but is typically created by an administrator of the computer in the global site-packages directory, and is imported before :index:`usercustomize`. See the documentation of the :mod:`site` module for more details.
ru: :index:`sitecustomize`работает таким же образом, но обычно создается администратором компьютера в глобальном каталоге site-package и импортируется перед :index:`usercustomize`. Дополнительную информацию смотрите в документации модуля:mod:`site`

source: Footnotes
ar: الحواشي
ru: Сноски

source: A problem with the GNU Readline package may prevent this.
ar: قد تمنع مشكلة في حزمة GNU Readline هذا.
ru: Проблема с пакетом GNU Readline могут этому воспрепятствовать.
