Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/tutorial/classes.po
Languages: fa, pl, ru

source: This style of access is clear, concise, and convenient. The use of iterators pervades and unifies Python. Behind the scenes, the :keyword:`for` statement calls :func:`iter` on the container object. The function returns an iterator object that defines the method :meth:`~iterator.__next__` which accesses elements in the container one at a time. When there are no more elements, :meth:`~iterator.__next__` raises a :exc:`StopIteration` exception which tells the :keyword:`!for` loop to terminate. You can call the :meth:`~iterator.__next__` method using the :func:`next` built-in function; this example shows how it all works::
fa: این سبک دسترسی واضح، مختصر و راحت است. استفاده از تکرار کننده ها پایتون را فرا گرفته و یکپارچه می کند. در پشت صحنه، دستور :keyword:`for` :func:`iter` را روی شی کانتینر فراخوانی می کند. تابع یک شی تکرار کننده را برمی گرداند که متد :meth:`~iterator.__next__` را تعریف می کند که به عناصر موجود در کانتینر در یک زمان دسترسی پیدا می کند. هنگامی که هیچ عنصر دیگری وجود ندارد، :meth:`~iterator.__next__` یک استثنای :exc:`StopIteration` را ایجاد می کند که به حلقه :keyword:`!for` می گوید خاتمه یابد. با استفاده از تابع داخلی :func:`next` می توانید روش :meth:`~iterator.__next__` را فراخوانی کنید. این مثال نشان می دهد که چگونه همه چیز کار می کند::
pl: Ten styl dostępu jest jasny, zwięzły i wygodny. Użycie iterators przenika i ujednolica Python. Za kulisami, :keyword:`for` instrukcja wywołuje :func:`iter` na obiekcie kontenera. Obiekt funkcja zwracać i iterator definiują metodę :meth:`~iterator.__next__`, która uzyskuje dostęp do elementów w kontenerze jeden po drugim. Gdy nie ma więcej elementów, :meth:`~iterator.__next__` rzucić wyjątek :exc:`StopIteration`, który informuje pętlę :keyword:`!for` o zakończeniu. Metodę :meth:`~iterator.__next__` można wywołać za pomocą :func:`next` wbudowanej funkcja; ten przykład pokazuje, jak to wszystko działa::
ru: Этот стиль доступа ясен, краток и удобен. Использование итераторов пронизывает и унифицирует Python. За кулисами оператор :keyword:`for` вызывает :func:`iter` для объекта-контейнера. Функция возвращает объект итератора, который определяет метод :meth:`~iterator.__next__`, который обращается к элементам в контейнере по одному. Когда элементов больше нет, :meth:`~iterator.__next__` вызывает исключение :exc:`StopIteration`, которое сообщает циклу :keyword:`!for` о завершении цикла. Вы можете вызвать метод :meth:`~iterator.__next__`, используя встроенную функцию :func:`next`; этот пример показывает, как все это работает::

source: Having seen the mechanics behind the iterator protocol, it is easy to add iterator behavior to your classes. Define an :meth:`~container.__iter__` method which returns an object with a :meth:`~iterator.__next__` method. If the class defines :meth:`!__next__`, then :meth:`!__iter__` can just return ``self``::
fa: با مشاهده مکانیزم های پشت پروتکل تکرار کننده، اضافه کردن رفتار تکرار کننده به کلاس های خود آسان است. یک متد :meth:`~container.__iter__` تعریف کنید که یک شی را با متد :meth:`~iterator.__next__` برمی گرداند. اگر کلاس :meth:`!__next__` را تعریف کند، :meth:`!__iter__` فقط می تواند ``self``::
pl: Po zapoznaniu się z mechaniką stojącą za protokołem iterator, łatwo jest dodać iterator zachowanie do swoich klas. Zdefiniuj metodę :meth:`~container.__iter__`, która zwracać obiekt z metodą :meth:`~iterator.__next__`. Jeśli klasa definiuje :meth:`!__next__`, to :meth:`!__iter__` może po prostu zwracać ``self`` ::
ru: Познакомившись с механикой протокола итератора, вы легко сможете добавить поведение итератора в свои классы. Определите метод :meth:`~container.__iter__`, который возвращает объект с помощью метода :meth:`~iterator.__next__`. Если класс определяет :meth:`!__next__`, то :meth:`!__iter__` может просто вернуть ``self``::

source: class Reverse: """Iterator for looping over a sequence backwards.""" def __init__(self, data): self.data = data self.index = len(data) def __iter__(self): return self def __next__(self): if self.index == 0: raise StopIteration self.index = self.index - 1 return self.data[self.index]
pl: class Reverse: """iterator do zapętlania sekwencji wstecz. """ def __init__(self, dane): self.dane = dane self.indeks = len(dane) def __iter__(self): return self def __next__(self): if self.indeks == 0: raise StopIteration self.indeks = self.indeks - 1 return self.data[self.indeks]

source: Generators
fa: ژنراتورها
pl: Generatory
ru: Генераторы

source: :term:`Generators <generator>` are a simple and powerful tool for creating iterators. They are written like regular functions but use the :keyword:`yield` statement whenever they want to return data. Each time :func:`next` is called on it, the generator resumes where it left off (it remembers all the data values and which statement was last executed). An example shows that generators can be trivially easy to create::
fa: :term:`Generators <generator>` یک ابزار ساده و قدرتمند برای ایجاد تکرار کننده است. آنها مانند توابع معمولی نوشته می شوند اما هر زمان که بخواهند داده را برگردانند از دستور :keyword:`yield` استفاده می کنند. هر بار که :func:`next` بر روی آن فراخوانی می شود، ژنراتور از همان جایی که متوقف شده بود از سر گرفته می شود (همه مقادیر داده را به خاطر می آورد و آخرین دستوری که اجرا شده است). یک مثال نشان می دهد که ایجاد ژنراتورها بسیار ساده است:
pl: :term:`Generatory <generator>` są prostym i potężnym narzędziem do tworzenia iteratorów. Są one pisane jak zwykłe funkcje, ale używają instrukcji :keyword:`yield` za każdym razem, gdy chcą zwracać dane. Za każdym razem, gdy :func:`next` jest na nim wywoływany, generator wznawia działanie od miejsca, w którym zostało przerwane (pamięta wszystkie wartości danych i które instrukcje było ostatnio wykonywane). Przykład pokazuje, że tworzenie generatorów może być banalnie proste::
ru: :term:`Генераторы <generator>` — это простой и мощный инструмент для создания итераторов. Они написаны как обычные функции, но используют оператор :keyword:`yield` всякий раз, когда хотят вернуть данные. Каждый раз, когда на нем вызывается :func:`next`, генератор возобновляет работу с того места, где остановился (он запоминает все значения данных и то, какой оператор был выполнен последним). Пример показывает, что генераторы можно легко создать:

source: def reverse(data): for index in range(len(data)-1, -1, -1): yield data[index]
pl: def reverse(dane): for indeks in range(len(dane)-1, -1, -1): yield dane[indeks]

source: Anything that can be done with generators can also be done with class-based iterators as described in the previous section. What makes generators so compact is that the :meth:`~iterator.__iter__` and :meth:`~generator.__next__` methods are created automatically.
fa: هر کاری را که بتوان با ژنراتورها انجام داد، می‌تواند با تکرارکننده‌های مبتنی بر کلاس نیز همانطور که در بخش قبل توضیح داده شد، انجام داد. چیزی که ژنراتورها را بسیار فشرده می کند این است که متدهای :meth:`~iterator.__iter__` و :meth:`~generator.__next__` به طور خودکار ایجاد می شوند.
pl: Wszystko, co można zrobić za pomocą generatorów, można również zrobić za pomocą iteratorów opartych na klasach, jak opisano w poprzedniej sekcji. Kompaktowość generatorów polega na tym, że metody :meth:`~iterator.__iter__` i :meth:`~generator.__next__` są tworzone automatycznie.
ru: Все, что можно сделать с помощью генераторов, можно сделать и с помощью итераторов на основе классов, как описано в предыдущем разделе. Что делает генераторы такими компактными, так это то, что методы :meth:`~iterator.__iter__` и :meth:`~generator.__next__` создаются автоматически.

source: Another key feature is that the local variables and execution state are automatically saved between calls. This made the function easier to write and much more clear than an approach using instance variables like ``self.index`` and ``self.data``.
fa: یکی دیگر از ویژگی های کلیدی این است که متغیرهای محلی و وضعیت اجرا به طور خودکار بین تماس ها ذخیره می شوند. این کار نوشتن تابع را آسان‌تر و واضح‌تر از رویکردی با استفاده از متغیرهای نمونه مانند ``self.index`` و ``self.data`` کرد.
pl: Inną kluczową cechą jest to, że zmienne lokalne i stan wykonania są automatycznie zapisywane między wywołaniami. Sprawia to, że funkcja jest łatwiejszy do napisania i znacznie bardziej przejrzysty niż podejście wykorzystujące zmienne instancji, takie jak ``self.index`` i ``self.data``.
ru: Еще одной ключевой особенностью является то, что локальные переменные и состояние выполнения автоматически сохраняются между вызовами. Это сделало функцию более простой в написании и более понятной, чем подход с использованием переменных экземпляра, таких как self.index и self.data.

source: In addition to automatic method creation and saving program state, when generators terminate, they automatically raise :exc:`StopIteration`. In combination, these features make it easy to create iterators with no more effort than writing a regular function.
fa: علاوه بر ایجاد روش خودکار و ذخیره وضعیت برنامه، هنگامی که ژنراتورها خاتمه می یابند، به طور خودکار :exc:`StopIteration` را افزایش می دهند. در ترکیب، این ویژگی ها ایجاد تکرار کننده ها را بدون تلاش بیشتر از نوشتن یک تابع معمولی آسان می کند.
pl: Oprócz automatycznego tworzenia metod i zapisywania stanu programu, po zakończeniu generatory automatycznie rzucić :exc:`StopIteration` . W połączeniu, funkcje te ułatwiają tworzenie iteratorów bez większego wysiłku niż napisanie zwykłego funkcja.
ru: В дополнение к автоматическому созданию методов и сохранению состояния программы, когда генераторы завершают работу, они автоматически вызывают :exc:`StopIteration`. В сочетании эти функции позволяют легко создавать итераторы, не прилагая больше усилий, чем написание обычной функции.

source: Generator Expressions
fa: عبارات ژنراتور
pl: generator wyrażenia
ru: Генераторные выражения

source: Some simple generators can be coded succinctly as expressions using a syntax similar to list comprehensions but with parentheses instead of square brackets. These expressions are designed for situations where the generator is used right away by an enclosing function. Generator expressions are more compact but less versatile than full generator definitions and tend to be more memory friendly than equivalent list comprehensions.
fa: برخی از مولدهای ساده را می توان به طور خلاصه به عنوان عبارات با استفاده از نحوی شبیه به درک لیست اما با پرانتز به جای پرانتز کدگذاری کرد. این عبارات برای موقعیت هایی طراحی شده اند که ژنراتور بلافاصله توسط یک تابع محصور کننده استفاده می شود. عبارات ژنراتور نسبت به تعاریف کامل مولد فشرده تر اما تطبیق پذیری کمتری دارند و نسبت به درک لیست های معادل، حافظه دوستانه بیشتری دارند.
pl: Niektóre proste generatory mogą być kodowane w zwięzły sposób jako wyrażenia przy użyciu składni podobnej do list comprehensions, ale z nawiasami zamiast nawiasów kwadratowych. Wyrażenia te są przeznaczone do sytuacji, w których generator jest używane od razu przez otaczającą je funkcja. Wyrażenia generator są bardziej zwięzłe, ale mniej wszechstronne niż pełne definicje generator i zwykle są bardziej przyjazne dla pamięci niż równoważne wyrażenia listowe.
ru: Некоторые простые генераторы можно кратко закодировать как выражения, используя синтаксис, аналогичный синтаксису списков, но с круглыми скобками вместо квадратных. Эти выражения предназначены для ситуаций, когда генератор сразу же используется включающей функцией. Выражения-генераторы более компактны, но менее универсальны, чем полные определения генераторов, и, как правило, более удобны для памяти, чем эквивалентные определения списков.

source: Examples::
fa: مثال ها::
pl: Przykłady::
ru: Примеры::

source: >>> sum(i*i for i in range(10)) # sum of squares 285 >>> xvec = [10, 20, 30] >>> yvec = [7, 5, 3] >>> sum(x*y for x,y in zip(xvec, yvec)) # dot product 260 >>> unique_words = set(word for line in page for word in line.split()) >>> valedictorian = max((student.gpa, student.name) for student in graduates) >>> data = 'golf' >>> list(data[i] for i in range(len(data)-1, -1, -1)) ['f', 'l', 'o', 'g']
pl: >>> sum(i*i for i in range(10)) # suma kwadratów 285 >>> xvec = [10, 20, 30] >>> yvec = [7, 5, 3] >>> sum(x*y for x,y in zip(xvec, yvec)) # iloczyn skalarny 260 >>> unique_words = set(word for line in page for word in line.split()) >>> valedictorian = max((student.gpa, student.name) for student in graduates) >>> data = 'golf' >>> list(data[i] for i in range(len(data)-1, -1, -1)) ['f', 'l', 'o', 'g']

source: Footnotes
fa: پاورقی ها
pl: Przypisy
ru: Сноски

source: Except for one thing. Module objects have a secret read-only attribute called :attr:`~object.__dict__` which returns the dictionary used to implement the module's namespace; the name ``__dict__`` is an attribute but not a global name. Obviously, using this violates the abstraction of namespace implementation, and should be restricted to things like post-mortem debuggers.
fa: به جز یک چیز اشیاء ماژول دارای یک ویژگی مخفی فقط خواندنی به نام :attr:`~object.__dict__` هستند که فرهنگ لغت مورد استفاده برای پیاده سازی فضای نام ماژول را برمی گرداند. نام ``__dict__`` یک ویژگی است اما یک نام جهانی نیست. بدیهی است که استفاده از این انتزاع پیاده سازی فضای نام را نقض می کند و باید به مواردی مانند اشکال زدایی پس از مرگ محدود شود.
pl: Z wyjątkiem jednej rzeczy. Obiekty moduł mają tajną tylko do odczytu atrybut o nazwie :attr:`~object.__dict__`, która zwracać słownik służy do implementacji przestrzeni nazw moduł; nazwa ``__dict__`` jest atrybut, ale nie jest nazwą globalną. Oczywiście korzystanie z tego narusza abstrakcję implementacji przestrzeni nazw i powinno być ograniczone do takich rzeczy, jak debugery post-mortem.
ru: За исключением одного. Объекты модуля имеют секретный атрибут только для чтения, называемый :attr:`~object.__dict__`, который возвращает словарь, используемый для реализации пространства имен модуля; имя ``__dict__`` является атрибутом, а не глобальным именем. Очевидно, что использование этого нарушает абстракцию реализации пространства имен и должно быть ограничено такими вещами, как посмертные отладчики.

source: object
fa: شی
pl: obiekt
ru: объект

source: method
fa: روش
pl: metoda
ru: метод

source: name
fa: نام
pl: nazwa
ru: имя

source: mangling
fa: درهم ریختن
pl: maglowanie

source: >>> s = 'abc' >>> it = iter(s) >>> it <str_iterator object at 0x10c90e650> >>> next(it) 'a' >>> next(it) 'b' >>> next(it) 'c' >>> next(it) Traceback (most recent call last): File "<stdin>", line 1, in <module> next(it) StopIteration
fa: >>> s = 'abc' >>> آن = تکرار (ها) >>> آن را <str_iterator شی در 0x10c90e650> >>> بعدی (آن) 'a' >>> بعدی (آن) 'ب' >>> بعدی (آن) 'ج' >>> بعدی (آن) ردیابی (آخرین تماس اخیر): فایل "<stdin>", خط 1، در <module> بعدی (آن) توقف تکرار

source: >>> rev = Reverse('spam') >>> iter(rev) <__main__.Reverse object at 0x00A1DB50> >>> for char in rev: ... print(char) ... m a p s
fa: >>> rev = معکوس ('spam') >>> تکرار (شور) <__main__. معکوس شی در 0x00A1DB50> >>> برای کاراکتر در دور: ... چاپ (کارت) ... متر الف ص س
