Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/tutorial/classes.po
Languages: fa, pl, ru

source: For most purposes, in the simplest cases, you can think of the search for attributes inherited from a parent class as depth-first, left-to-right, not searching twice in the same class where there is an overlap in the hierarchy. Thus, if an attribute is not found in :class:`!DerivedClassName`, it is searched for in :class:`!Base1`, then (recursively) in the base classes of :class:`!Base1`, and if it was not found there, it was searched for in :class:`!Base2`, and so on.
fa: برای بیشتر اهداف، در ساده‌ترین موارد، می‌توانید جستجوی ویژگی‌های به ارث رسیده از یک کلاس والد را به‌عنوان depth-first، از چپ به راست در نظر بگیرید، نه دوبار جستجو در یک کلاس که در آن همپوشانی در سلسله مراتب وجود دارد. بنابراین، اگر یک ویژگی در :class:`!DerivedClassName` یافت نشد، در :class:`!Base1` جستجو می شود، سپس (به صورت بازگشتی) در کلاس های پایه :class:`!Base1`، و اگر در آنجا یافت نشد، در :class:`!Base2` و غیره جستجو می شود.
pl: Dla większości celów, w najprostszych przypadkach, można myśleć o wyszukiwaniu atrybut odziedziczonym po klasie nadrzędnej jako o wyszukiwaniu w głąb, od lewej do prawej, nie szukając dwa razy w tej samej klasie, gdy hierarchia się pokrywa. Tak więc, jeśli atrybut nie zostanie znaleziony w :class:`!DerivedClassName`, jest szukany w :class:`!Base1`, a następnie (rekurencyjnie) w klasach bazowych :class:`!Base1`, a jeśli nie zostanie tam znaleziony, jest szukany w :class:`!Base2` i tak dalej.
ru: Для большинства целей, в самых простых случаях, вы можете думать о поиске атрибутов, унаследованных от родительского класса, как о поиске в глубину, слева направо, а не о поиске дважды в одном и том же классе, где есть перекрытие в иерархии. Таким образом, если атрибут не найден в :class:`!DerivedClassName`, он ищется в :class:`!Base1`, затем (рекурсивно) в базовых классах :class:`!Base1`, и если он там не был найден, его искали в :class:`!Base2` и так далее.

source: In fact, it is slightly more complex than that; the method resolution order changes dynamically to support cooperative calls to :func:`super`. This approach is known in some other multiple-inheritance languages as call-next-method and is more powerful than the super call found in single-inheritance languages.
fa: در واقع، کمی پیچیده تر از آن است. ترتیب تفکیک روش به صورت پویا تغییر می کند تا از فراخوان های مشارکتی به :func:`super` پشتیبانی کند. این رویکرد در برخی دیگر از زبان‌های ارثی چندگانه به روش فراخوانی بعدی معروف است و قدرتمندتر از فراخوانی موجود در زبان‌های ارثی تک است.
pl: W rzeczywistości jest to nieco bardziej skomplikowane; kolejność rozwiązywania metod zmienia się dynamicznie, aby wspierać kooperacyjne wywołania :func:`super`. Podejście to jest znane w niektórych innych językach wielokrotnego dziedziczenia jako call-next-method i jest bardziej wydajne niż super wywołanie występujące w językach pojedynczego dziedziczenia.
ru: На самом деле все немного сложнее; порядок разрешения методов изменяется динамически для поддержки совместных вызовов :func:`super`. Этот подход известен в некоторых других языках с множественным наследованием как метод следующего вызова и является более мощным, чем супервызов, встречающийся в языках с одним наследованием.

source: Dynamic ordering is necessary because all cases of multiple inheritance exhibit one or more diamond relationships (where at least one of the parent classes can be accessed through multiple paths from the bottommost class). For example, all classes inherit from :class:`object`, so any case of multiple inheritance provides more than one path to reach :class:`object`. To keep the base classes from being accessed more than once, the dynamic algorithm linearizes the search order in a way that preserves the left-to-right ordering specified in each class, that calls each parent only once, and that is monotonic (meaning that a class can be subclassed without affecting the precedence order of its parents). Taken together, these properties make it possible to design reliable and extensible classes with multiple inheritance. For more detail, see :ref:`python_2.3_mro`.
fa: ترتیب پویا ضروری است زیرا همه موارد ارث چندگانه یک یا چند رابطه الماس را نشان می‌دهند (که در آن حداقل یکی از کلاس‌های والد از طریق چندین مسیر از پایین‌ترین کلاس قابل دسترسی است). برای مثال، همه کلاس‌ها از :class:`object` ارث می‌برند، بنابراین هر مورد وراثت چندگانه، بیش از یک مسیر را برای رسیدن به :class:`object` فراهم می‌کند. برای جلوگیری از دسترسی به کلاس های پایه بیش از یک بار، الگوریتم پویا ترتیب جستجو را به گونه ای خطی می کند که ترتیب چپ به راست مشخص شده در هر کلاس را حفظ می کند، که هر والد را فقط یک بار فراخوانی می کند، و این یکنواخت است (به این معنی که یک کلاس می تواند بدون تأثیر بر ترتیب اولویت والدینش, زیر طبقه بندی شود). در مجموع، این ویژگی ها طراحی کلاس های قابل اعتماد و توسعه پذیر با ارث چندگانه را ممکن می سازد. برای جزئیات بیشتر، به :ref:`python_2.3_mro` مراجعه کنید.
pl: Dynamiczne porządkowanie jest konieczne, ponieważ wszystkie przypadki wielokrotnego dziedziczenia wykazują jedną lub więcej relacji diamentowych (w których co najmniej jedna z klas nadrzędnych może być dostępna poprzez wiele ścieżek z najniższej klasy). Na przykład, wszystkie klasy dziedziczą z :class:`object`, więc każdy przypadek wielokrotnego dziedziczenia zapewnia więcej niż jedną ścieżkę dostępu do :class:`object`. Aby zapobiec wielokrotnemu dostępowi do klas bazowych, algorytm dynamiczny linearyzuje kolejność wyszukiwania w sposób, który zachowuje kolejność od lewej do prawej określoną w każdej klasie, która wywołuje każdego rodzica tylko raz i która jest monotoniczna (co oznacza, że klasa może być podklasowana bez wpływu na kolejność pierwszeństwa jej rodziców). Łącznie właściwości te umożliwiają projektowanie niezawodnych i rozszerzalnych klas z wielokrotnym dziedziczeniem. Więcej szczegółów można znaleźć na stronie :ref:`python_2.3_mro`.
ru: Динамическое упорядочение необходимо, поскольку все случаи множественного наследования демонстрируют одну или несколько ромбовидных связей (где хотя бы к одному из родительских классов можно получить доступ через несколько путей из самого нижнего класса). Например, все классы наследуются от :class:`object`, поэтому любой случай множественного наследования обеспечивает более одного пути для достижения :class:`object`. Чтобы предотвратить доступ к базовым классам более одного раза, динамический алгоритм линеаризует порядок поиска таким образом, чтобы сохранять порядок слева направо, указанный в каждом классе, который вызывает каждого родителя только один раз и является монотонным (это означает, что класс может быть подклассом, не затрагивая порядок приоритета его родителей). В совокупности эти свойства позволяют создавать надежные и расширяемые классы с множественным наследованием. Более подробную информацию см. в :ref:`python_2.3_mro`.

source: Private Variables
fa: متغیرهای خصوصی
pl: Zmienne prywatne
ru: Частные переменные

source: "Private" instance variables that cannot be accessed except from inside an object don't exist in Python. However, there is a convention that is followed by most Python code: a name prefixed with an underscore (e.g. ``_spam``) should be treated as a non-public part of the API (whether it is a function, a method or a data member). It should be considered an implementation detail and subject to change without notice.
fa: متغیرهای نمونه "خصوصی" که جز از داخل یک شی قابل دسترسی نیستند، در پایتون وجود ندارند. با این حال، قراردادی وجود دارد که اکثر کدهای پایتون از آن پیروی می کنند: نامی که پیشوند آن زیرخط است (مثلاً ``_spam``) باید به عنوان بخشی غیرعمومی از API در نظر گرفته شود (خواه یک تابع, یک متد یا یک عضو داده باشد). باید جزییات اجرایی در نظر گرفته شود و بدون اطلاع قبلی قابل تغییر باشد.
pl: "Prywatne" zmienne instancje, do których nie można uzyskać dostępu inaczej niż z wnętrza obiektu, nie istnieją w Python. Istnieje jednak konwencja, której przestrzega większość kodu Python: nazwa poprzedzona podkreśleniem (np. ``_spam``) powinna być traktowana jako niepubliczna część API (niezależnie od tego, czy jest to funkcja, metoda czy członek danych). Należy ją traktować jako szczegół implementacji i może ona ulec zmianie bez powiadomienia.
ru: «Частные» переменные экземпляра, к которым нельзя получить доступ, кроме как изнутри объекта, в Python не существуют. Однако существует соглашение, которому следует большая часть кода Python: имя с префиксом подчеркивания (например, ``_spam``) должно рассматриваться как закрытая часть API (будь то функция, метод или элемент данных). Это следует рассматривать как деталь реализации и может быть изменено без предварительного уведомления.

source: Since there is a valid use-case for class-private members (namely to avoid name clashes of names with names defined by subclasses), there is limited support for such a mechanism, called :dfn:`name mangling`. Any identifier of the form ``__spam`` (at least two leading underscores, at most one trailing underscore) is textually replaced with ``_classname__spam``, where ``classname`` is the current class name with leading underscore(s) stripped. This mangling is done without regard to the syntactic position of the identifier, as long as it occurs within the definition of a class.
fa: از آنجایی که یک مورد استفاده معتبر برای اعضای کلاس خصوصی وجود دارد (یعنی برای جلوگیری از تداخل نام نام‌ها با نام‌هایی که توسط کلاس‌های فرعی تعریف شده‌اند), پشتیبانی محدودی از چنین مکانیزمی به نام :dfn:`name mangling` وجود دارد. هر شناسه ای از فرم ``__spam`` (حداقل دو زیرخط اصلی, حداکثر یک زیرخط آخر) به صورت متنی با ``_classname__spam`` جایگزین می شود، که در آن ``classname`` نام کلاس فعلی با زیرخط(های) ابتدایی حذف شده است. این اختلاط بدون توجه به موقعیت نحوی شناسه انجام می شود، تا زمانی که در تعریف یک کلاس رخ دهد.
pl: Ponieważ istnieje uzasadniony przypadek użycia dla członków klasy-prywatnej (mianowicie, aby uniknąć kolizji nazw z nazwami zdefiniowanymi przez podklasa), istnieje ograniczone wsparcie dla takiego mechanizmu, zwanego :dfn:`name mangling`. Każdy identyfikator w postaci ``__spam`` (co najmniej dwa początkowe podkreślenia, co najwyżej jedno końcowe podkreślenie) jest tekstowo zastępowany przez ``_classname__spam``, gdzie ``classname`` jest bieżącą nazwą klasy z usuniętymi początkowymi podkreśleniami. Zamiana ta jest wykonywana bez względu na pozycję składniową identyfikatora, o ile występuje on w definicji klasy.
ru: Поскольку существует допустимый вариант использования частных членов класса (а именно, чтобы избежать конфликтов имен с именами, определенными подклассами), существует ограниченная поддержка такого механизма, называемого :dfn:`name mangling`. Любой идентификатор в форме ``__spam`` (минимум два начальных подчеркивания, максимум одно завершающее подчеркивание) текстуально заменяется на ``_classname__spam``, где ``classname`` — это имя текущего класса с начальным подчеркиванием(ями). раздет. Это искажение выполняется без учета синтаксической позиции идентификатора, если оно происходит внутри определения класса.

source: The :ref:`private name mangling specifications <private-name-mangling>` for details and special cases.
fa: :ref:`private name mangling specifications <private-name-mangling>` برای جزئیات و موارد خاص.
pl: Szczegółowe informacje i przypadki specjalne znajdują się w specyfikacji :ref:`private name mangling <private-name-mangling>`.
ru: :ref:`Спецификации искажения частных имен <private-name-mangling>` для получения подробной информации и особых случаев.

source: Name mangling is helpful for letting subclasses override methods without breaking intraclass method calls. For example::
fa: مخفی کردن نام برای اجازه دادن به زیر کلاس‌ها بدون شکستن فراخوانی‌های متد درون‌کلاسی، نادیده گرفته می‌شود. به عنوان مثال::
pl: Manipulowanie nazwami jest pomocne w umożliwieniu podklasa nadpisywania metod bez przerywania wywołań metod wewnątrzklasowych. Na przykład::
ru: Изменение имен полезно для того, чтобы позволить подклассам переопределять методы, не нарушая вызовы методов внутри класса. Например::

source: class Mapping: def __init__(self, iterable): self.items_list = [] self.__update(iterable) def update(self, iterable): for item in iterable: self.items_list.append(item) __update = update # private copy of original update() method class MappingSubclass(Mapping): def update(self, keys, values): # provides new signature for update() # but does not break __init__() for item in zip(keys, values): self.items_list.append(item)
pl: class Mapping: def __init__(self, iterable): self.przedmiot_lista = [] self.__update(iterable) def update(self, iterable): for przedmiot in iterable: self.przedmiot_lista.append(przedmiot) __update = update # prywatna kopia oryginalnej metody update() class MappingSubklasa(Mapping): def update(self, keys, values): # zapewnia nową sygnaturę dla update() # ale nie przerywa __init__() for item in zip(keys, values): self.items_list.append(item)

source: The above example would work even if ``MappingSubclass`` were to introduce a ``__update`` identifier since it is replaced with ``_Mapping__update`` in the ``Mapping`` class and ``_MappingSubclass__update`` in the ``MappingSubclass`` class respectively.
fa: مثال بالا حتی اگر ``MappingSubclass`` یک شناسه ``__update`` معرفی کند کار می کند زیرا به ترتیب با ``_Mapping__update`` در کلاس ``Mapping`` و ``_MappingSubclass__update`` در کلاس ``MappingSubclass`` جایگزین شده است.
pl: Powyższy przykład zadziała nawet wtedy, gdy ``MappingSubclass`` wprowadzi identyfikator ``__update``, ponieważ zostanie on zastąpiony odpowiednio ``_Mapping__update`` w klasie ``Mapping`` i ``_MappingSubclass__update`` w klasie ``MappingSubclass``.
ru: Приведенный выше пример будет работать, даже если в MappingSubclass будет введен идентификатор __update, поскольку он заменяется на _Mapping__update в классе Mapping и на _MappingSubclass__update в классе Mapping. MappingSubclass`` класс соответственно.

source: Note that the mangling rules are designed mostly to avoid accidents; it still is possible to access or modify a variable that is considered private. This can even be useful in special circumstances, such as in the debugger.
fa: توجه داشته باشید که قوانین انحراف بیشتر برای جلوگیری از حوادث طراحی شده اند. هنوز هم می توان به متغیری که خصوصی در نظر گرفته می شود دسترسی پیدا کرد یا تغییر داد. این حتی می‌تواند در شرایط خاص، مانند دیباگر، مفید باشد.
pl: Należy pamiętać, że reguły mieszania zostały zaprojektowane głównie w celu uniknięcia wypadków; nadal możliwy jest dostęp lub modyfikacja zmiennej, która jest uważana za prywatną. Może to być nawet przydatne w szczególnych okolicznościach, takich jak debugger.
ru: Обратите внимание, что правила искажения созданы главным образом для предотвращения несчастных случаев; по-прежнему возможно получить доступ к переменной, которая считается частной, или изменить ее. Это может быть даже полезно в особых случаях, например, в отладчике.

source: Notice that code passed to ``exec()`` or ``eval()`` does not consider the classname of the invoking class to be the current class; this is similar to the effect of the ``global`` statement, the effect of which is likewise restricted to code that is byte-compiled together. The same restriction applies to ``getattr()``, ``setattr()`` and ``delattr()``, as well as when referencing ``__dict__`` directly.
fa: توجه داشته باشید که کد ارسال شده به ``exec()`` یا ``eval()`` نام کلاس کلاس فراخوانی را کلاس فعلی در نظر نمی گیرد. این شبیه به اثر دستور ``global`` است، که اثر آن نیز محدود به کدهایی است که با هم کامپایل شده اند. همین محدودیت برای ``getattr()``، ``setattr()`` و ``delattr()``، و همچنین هنگام ارجاع مستقیم به ``__dict__`` اعمال می شود.
pl: Zauważ, że kod przekazany do ``exec()`` lub ``eval()`` nie uważa nazwy klasy wywołującej za bieżącą klasę; jest to podobne do efektu ``global`` instrukcja , którego efekt jest również ograniczony do kodu, który jest kompilowany bajtowo. To samo ograniczenie dotyczy ``getattr()``, ``setattr()`` i ``delattr()``, a także bezpośredniego odwoływania się do ``__dict__``.
ru: Обратите внимание, что код, переданный в ``exec()`` или ``eval()``, не считает имя вызывающего класса текущим классом; это похоже на эффект оператора global, эффект которого также ограничен кодом, компилируемым побайтово. То же ограничение применяется к ``getattr()``, ``setattr()`` и ``delattr()``, а также при прямой ссылке на ``__dict__``.

source: Odds and Ends
pl: Przypadki losowe

source: Sometimes it is useful to have a data type similar to the Pascal "record" or C "struct", bundling together a few named data items. The idiomatic approach is to use :mod:`dataclasses` for this purpose::
fa: گاهی اوقات مفید است که یک نوع داده شبیه به پاسکال "Record" یا C "struct" داشته باشید که چند مورد داده نامگذاری شده را با هم ترکیب می کند. رویکرد اصطلاحی استفاده از :mod:`dataclasses` برای این منظور است:
pl: Czasami przydatne jest posiadanie typu danych podobnego do "rekordu" Pascala lub "struktury" C, łączącego kilka nazwanych elementów danych. Idiomatycznym podejściem jest użycie w tym celu :mod:`dataclasses`::
ru: Иногда полезно иметь тип данных, похожий на «запись» Паскаля или «структуру» C, объединяющий несколько именованных элементов данных. Идиоматический подход заключается в использовании для этой цели :mod:`dataclasses`::

source: from dataclasses import dataclass @dataclass class Employee: name: str dept: str salary: int
pl: from dataclasses import dataclass @dataclass class Pracownik: imie: str dzial: str pensja: int

source: >>> john = Employee('john', 'computer lab', 1000) >>> john.dept 'computer lab' >>> john.salary 1000
pl: >>> stanislaw = Pracownik('stanislaw', 'pracownia komputerowa, 1000) >>> stanislaw.dzial 'pracownia komputerowa' >>> stanislaw.pensja 1000

source: A piece of Python code that expects a particular abstract data type can often be passed a class that emulates the methods of that data type instead. For instance, if you have a function that formats some data from a file object, you can define a class with methods :meth:`~io.TextIOBase.read` and :meth:`~io.TextIOBase.readline` that get the data from a string buffer instead, and pass it as an argument.
fa: قطعه ای از کد پایتون که انتظار یک نوع داده انتزاعی خاص را دارد، اغلب می تواند به کلاسی منتقل شود که به جای آن روش های آن نوع داده را شبیه سازی می کند. به عنوان مثال، اگر تابعی دارید که برخی از داده‌ها را از یک شی فایل قالب‌بندی می‌کند، می‌توانید کلاسی را با متدهای :meth:`~io.TextIOBase.read` و :meth:`~io.TextIOBase.readline` تعریف کنید که به جای آن داده‌ها را از یک بافر رشته‌ای دریافت کرده و به عنوان آرگومان ارسال کنید.
pl: Fragment kodu Python, który oczekuje określonego abstrakcyjnego typu danych, może często zostać przekazany klasie, która emuluje metody tego typu danych. Na przykład, jeśli masz klasę funkcja, która formatuje pewne dane z obiektu pliku, możesz zdefiniować klasę z metodami :meth:`~io.TextIOBase.read` i :meth:`~io.TextIOBase.readline`, które pobierają dane z bufora napis i przekazują je jako argument.
ru: Куску кода Python, которая ожидает определенный абстрактный тип данных, часто вместо этого можно передать класс, который эмулирует методы этого типа данных. Например, если у вас есть функция, которая форматирует некоторые данные из файлового объекта, вы можете определить класс с методами :meth:`~io.TextIOBase.read` и :meth:`~io.TextIOBase.readline`, которые получают вместо этого данные из строкового буфера и передать их в качестве аргумента.

source: :ref:`Instance method objects <instance-methods>` have attributes, too: :attr:`m.__self__ <method.__self__>` is the instance object with the method :meth:`!m`, and :attr:`m.__func__ <method.__func__>` is the :ref:`function object <user-defined-funcs>` corresponding to the method.
fa: :ref:`Instance method objects <instance-methods>` نیز ویژگی هایی دارد: :attr:`m.__self__ <method.__self__>` شی نمونه با متد :meth:`!m` است و :attr:`m.__func__ <method.__func__>` :ref:`function object <user-defined-funcs>` مربوط به متد است.
pl: :ref:`Obiekty metod instancji <instance-methods>` także mają atrybuty: :attr:`m.__self__ <method.__self__>` jest obiektem instancji z metodą :meth:`!m`, i :attr:`m.__func__ <method.__func__>` jest :ref:`obiektem funkcji <user-defined-funcs>` odpowiadającym metodzie.
ru: :ref:`Объекты метода экземпляра <instance-methods>` также имеют атрибуты: :attr:`m.__self__ <method.__self__>` — это объект экземпляра с методом :meth:`!m`, а :attr: `m.__func__ <method.__func__>` — это :ref:`объект функции <user-defined-funcs>`, соответствующий методу.

source: Iterators
fa: تکرار کننده ها
pl: Iteratory
ru: Итераторы

source: By now you have probably noticed that most container objects can be looped over using a :keyword:`for` statement::
fa: احتمالاً تا به حال متوجه شده اید که بیشتر اشیاء کانتینر را می توان با استفاده از دستور :keyword:`for` حلقه کرد:
pl: Prawdopodobnie zauważyłeś już, że większość obiektów kontenera można iterować za pomocą :keyword:`for` instrukcja ::
ru: К этому моменту вы, вероятно, заметили, что большинство объектов-контейнеров можно зациклить с помощью оператора :keyword:`for`::

source: for element in [1, 2, 3]: print(element) for element in (1, 2, 3): print(element) for key in {'one':1, 'two':2}: print(key) for char in "123": print(char) for line in open("myfile.txt"): print(line, end='')
pl: for element in [1, 2, 3]: print(element) for element in (1, 2, 3): print(element) for key in {'one':1, 'two':2}: print(key) for char in "123": print(char) for line in open("mojplik.txt"): print(line, end='')
