Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/tutorial/classes.po
Languages: fa, pl, ru

source: Class objects support two kinds of operations: attribute references and instantiation.
fa: اشیاء کلاس از دو نوع عملیات پشتیبانی می کنند: ارجاعات مشخصه و نمونه سازی.
pl: Obiekty klas obsługują dwa rodzaje operacji: odniesienia do atrybutów i tworzenie instancji.
ru: Объекты классов поддерживают два вида операций: ссылка на аттрибут и создание экземпляра.

source: *Attribute references* use the standard syntax used for all attribute references in Python: ``obj.name``. Valid attribute names are all the names that were in the class's namespace when the class object was created. So, if the class definition looked like this::
fa: *Attribute references* از نحو استاندارد مورد استفاده برای همه ارجاعات ویژگی در پایتون استفاده می کند: ``obj.name``. نام‌های مشخصه معتبر همه نام‌هایی هستند که در هنگام ایجاد شی کلاس در فضای نام کلاس وجود داشتند. بنابراین، اگر تعریف کلاس به این صورت بود:
pl: *Odniesienia do atrybutów* używają standardowej składni używanej dla wszystkich odniesień do atrybutów w Pythonie: ``obj.name``. Prawidłowe nazwy atrybutów to wszystkie nazwy, które znajdowały się w przestrzeni nazw klasy, gdy obiekt klasy został utworzony. Tak więc, jeśli definicja klasy wyglądała tak::
ru: *Ссылка на аттрибут* использует стандартный для получения аттрибутов в Python синтакисс: ``obj.name``. Верными аттрибутами считаются те имена, которые находились в пространстве имён класса во время создания объекта класса. Таким образом, если определение класса выглядит так::

source: class MyClass: """A simple example class""" i = 12345 def f(self): return 'hello world'
pl: class MyClass: """Prosta przykładowa klasa""" i = 12345 def f(self): return 'witaj świecie'

source: then ``MyClass.i`` and ``MyClass.f`` are valid attribute references, returning an integer and a function object, respectively. Class attributes can also be assigned to, so you can change the value of ``MyClass.i`` by assignment. :attr:`~type.__doc__` is also a valid attribute, returning the docstring belonging to the class: ``"A simple example class"``.
fa: سپس ``MyClass.i`` و ``MyClass.f`` مراجع مشخصه معتبری هستند که به ترتیب یک عدد صحیح و یک شی تابع را برمی‌گردانند. ویژگی های کلاس را نیز می توان به آن اختصاص داد، بنابراین می توانید مقدار ``MyClass.i`` را با انتساب تغییر دهید. :attr:`~type.__doc__` نیز یک ویژگی معتبر است که رشته مستند متعلق به کلاس: ``"A simple example class"`` را برمی گرداند.
pl: wtedy ``MyClass.i`` i ``MyClass.f`` są poprawnymi odniesieniami do atrybutów, zwracającymi odpowiednio liczbę całkowitą i funkcję. Do atrybutów klasowych można również przypisywać wartości, więc można zmienić wartość ``MyClass.i`` przez przypisanie. :attr:`~type.__doc__` jest również poprawnym atrybutem, zwracającym docstring należący do klasy: ``"Prosta przykładowa klasa"``.
ru: тогда MyClass.i и MyClass.f являются действительными ссылками на атрибуты, возвращающими целое число и объект функции соответственно. Атрибутам класса также можно назначать, поэтому вы можете изменить значение MyClass.i путем назначения. :attr:`~type.__doc__` также является допустимым атрибутом, возвращающим строку документации, принадлежащую классу: ``"Простой пример класса"``.

source: Class *instantiation* uses function notation. Just pretend that the class object is a parameterless function that returns a new instance of the class. For example (assuming the above class)::
fa: کلاس *instantiation* از نشانه گذاری تابع استفاده می کند. فقط وانمود کنید که شی کلاس یک تابع بدون پارامتر است که نمونه جدیدی از کلاس را برمی گرداند. به عنوان مثال (با فرض کلاس بالا):
pl: *Instancjonowanie* klasy używa notacji funkcji. Wystarczy udawać, że obiekt klasy jest bezparametrową funkcją, która zwraca nową instancję klasy. Na przykład (zakładając powyższą klasę)::
ru: *Создание экземпляра* класса использует синтаксис вызова функции. Просто притворитесь, что что объект класса --- это функция без параметров, которая возвращает новый экземпляр этого класса. Например (используя определённый выше класс)::

source: creates a new *instance* of the class and assigns this object to the local variable ``x``.
fa: یک *instance* جدید از کلاس ایجاد می کند و این شی را به متغیر محلی ``x`` اختصاص می دهد.
pl: tworzy nową *instancję* klasy i przypisuje ten obiekt do zmiennej lokalnej ``x``.
ru: определяет новый *экземпляр* класса и сохраняет этото объект в локальную переменную ``x``.

source: The instantiation operation ("calling" a class object) creates an empty object. Many classes like to create objects with instances customized to a specific initial state. Therefore a class may define a special method named :meth:`~object.__init__`, like this::
fa: عملیات نمونه سازی (" فراخوانی " یک شی کلاس) یک شی خالی ایجاد می کند. بسیاری از کلاس ها دوست دارند اشیایی را با نمونه های سفارشی شده برای یک حالت اولیه خاص ایجاد کنند. بنابراین یک کلاس ممکن است متد خاصی به نام :meth:`~object.__init__` را تعریف کند، مانند:
pl: Operacja instancjonowania („wywołanie” obiektu klasy) tworzy pusty obiekt. Wiele klas lubi tworzyć obiekty z instancjami dostosowanymi do określonego stanu początkowego. Dlatego klasa może zdefiniować specjalną metodę o nazwie :meth:`~object.__init__`, taką jak ta::
ru: Операция создания экземпляра («вызов» объекта класса) создает пустой объект. Многим классам нравится создавать объекты, экземпляры которых настроены под определенное начальное состояние. Поэтому класс может определить специальный метод с именем :meth:`~object.__init__`, например:

source: When a class defines an :meth:`~object.__init__` method, class instantiation automatically invokes :meth:`!__init__` for the newly created class instance. So in this example, a new, initialized instance can be obtained by::
fa: هنگامی که یک کلاس یک متد :meth:`~object.__init__` را تعریف می کند، نمونه سازی کلاس به طور خودکار :meth:`!__init__` را برای نمونه کلاس تازه ایجاد شده فراخوانی می کند. بنابراین در این مثال، یک نمونه جدید و مقداردهی اولیه را می توان با استفاده از:
pl: Gdy klasa definiuje metodę :meth:`~object.__init__`, instancjonowanie klasy automatycznie wywołuje :meth:`!__init__` dla nowo utworzonej instancji klasy. Tak więc w tym przykładzie nową, zainicjalizowaną instancję można uzyskać przez::
ru: Когда класс определяет метод :meth:`~object.__init__`, создание экземпляра класса автоматически вызывает :meth:`!__init__` для вновь созданного экземпляра класса. Итак, в этом примере новый инициализированный экземпляр можно получить следующим образом:

source: Of course, the :meth:`~object.__init__` method may have arguments for greater flexibility. In that case, arguments given to the class instantiation operator are passed on to :meth:`!__init__`. For example, ::
fa: البته روش :meth:`~object.__init__` ممکن است استدلال هایی برای انعطاف پذیری بیشتر داشته باشد. در آن صورت، آرگومان های داده شده به عملگر نمونه سازی کلاس به :meth:`!__init__` منتقل می شود. به عنوان مثال، ::
pl: Oczywiście metoda :meth:`~object.__init__` może mieć argumenty dla większej elastyczności. W takim przypadku argumenty podane operatorowi instancjonowania klasy są przekazywane do :meth:`!__init__`. Na przykład ::
ru: Конечно, метод :meth:`~object.__init__` может иметь аргументы для большей гибкости. В этом случае аргументы, переданные оператору создания экземпляра класса, передаются в :meth:`!__init__`. Например, ::

source: Instance Objects
fa: اشیاء نمونه
pl: Obiekty instancji
ru: Объекты экземпляров

source: Now what can we do with instance objects? The only operations understood by instance objects are attribute references. There are two kinds of valid attribute names: data attributes and methods.
fa: حالا با اشیاء نمونه چه کنیم؟ تنها عملیات درک شده توسط اشیاء نمونه، ارجاعات ویژگی هستند. دو نوع نام مشخصه معتبر وجود دارد: ویژگی های داده و روش ها.
pl: Co możemy zrobić z obiektami instancji? Jedynymi operacjami rozumianymi przez obiekty instancji są odniesienia do atrybutów. Istnieją dwa rodzaje poprawnych nazw atrybutów: atrybuty danych i metody.
ru: Что мы можем делать с объектами-экземплярами? Единственная операция, которую понимают объекты-экземпляры --- ссылка на аттрибут. Есть два вида верный имён атрибутов: атрибуты-данные и методы.

source: *data attributes* correspond to "instance variables" in Smalltalk, and to "data members" in C++. Data attributes need not be declared; like local variables, they spring into existence when they are first assigned to. For example, if ``x`` is the instance of :class:`!MyClass` created above, the following piece of code will print the value ``16``, without leaving a trace::
fa: *data attributes* با "متغیرهای نمونه" در Smalltalk و به "اعضای داده" در C++ مطابقت دارد. ویژگی های داده نیازی به اعلان ندارند. مانند متغیرهای محلی، زمانی که برای اولین بار به آنها اختصاص داده می شوند، به وجود می آیند. به عنوان مثال، اگر ``x`` نمونه ای از :class:`!MyClass` باشد که در بالا ایجاد شده است، کد زیر مقدار ``16`` را بدون گذاشتن ردی چاپ می کند:
pl: *Dane atrybut* odpowiadają "zmiennym instancji" i "członkom danych" w C++. Dane atrybut nie muszą być deklarowane; podobnie jak zmienne lokalne, powstają, gdy zostaną po raz pierwszy przypisane. Na przykład, jeśli ``x`` jest instancją :class:`!MyClass` utworzoną powyżej, poniższy fragment kodu wydrukuje wartość ``16``, bez pozostawiania śladu::
ru: *атрибуты данных* соответствуют «переменным экземпляра» в Smalltalk и «членам данных» в C++. Атрибуты данных не нужно объявлять; как и локальные переменные, они возникают, когда им впервые присваиваются значения. Например, если ``x`` является экземпляром :class:`!MyClass`, созданным выше, следующий фрагмент кода напечатает значение ``16``, не оставляя следов:

source: The other kind of instance attribute reference is a *method*. A method is a function that "belongs to" an object.
fa: نوع دیگر مرجع ویژگی نمونه *method* است. متد تابعی است که «متعلق به» یک شی است.
pl: Innym rodzajem odniesienia do atrybutu instancji jest *metoda*. Metoda to funkcja, która „należy” do obiektu.
ru: Другой вид ссылки на атрибут экземпляра — это *метод*. Метод — это функция, которая «принадлежит» объекту.

source: Valid method names of an instance object depend on its class. By definition, all attributes of a class that are function objects define corresponding methods of its instances. So in our example, ``x.f`` is a valid method reference, since ``MyClass.f`` is a function, but ``x.i`` is not, since ``MyClass.i`` is not. But ``x.f`` is not the same thing as ``MyClass.f`` --- it is a *method object*, not a function object.
fa: نام متدهای معتبر یک شیء نمونه به کلاس آن بستگی دارد. طبق تعریف، تمام ویژگی‌های یک کلاس که شی تابع هستند، متدهای مربوط به نمونه‌های آن را تعریف می‌کنند. بنابراین در مثال ما، ``x.f`` یک مرجع متد معتبر است، زیرا ``MyClass.f`` یک تابع است، اما ``x.i`` نیست، زیرا ``MyClass.i`` نیست. اما ``x.f`` مشابه ``MyClass.f`` نیست --- یک *method object* است نه یک شی تابع.
pl: Prawidłowe nazwy metod obiektu instancji zależą od jego klasy. Z definicji wszystkie atrybuty klasy, które są obiektami funkcji definiują odpowiednie metody jej instancji. Tak więc w naszym przykładzie, ``x.f`` jest poprawnym odwołaniem do metody, ponieważ ``MyClass.f`` jest funkcją, ale ``x.i`` nie jest, ponieważ ``MyClass.i`` nie jest. Ale ``x.f`` nie jest tym samym co ``MyClass.f`` --- jest *obiektem metody*, a nie obiektem funkcji.
ru: Методы, доступные для вызова у объекта, зависят от того, к какому классу он принадлежит. Все аттрибуты класса, являющиеся функциями, определяют методы экземпляров этого класса. В нашем примере ``x.f`` --- ссылка на метод, потому что ``MyClass.f`` --- это функция; в отличие от ``x.i`` --- потому что ``MyClass.i`` --- не функция. Но ``x.f`` --- не то же самое, что ``MyClass.f`` --- это *объект метода*, а не объект функции.

source: Method Objects
fa: اشیاء روش
pl: Obiekty metod
ru: Методы

source: Usually, a method is called right after it is bound::
fa: معمولاً یک متد بلافاصله پس از محدود شدن فراخوانی می شود:
pl: Zazwyczaj metoda jest wywoływana zaraz po jej powiązaniu::
ru: Обычно метод вызывается сразу после привязки::

source: In the :class:`!MyClass` example, this will return the string ``'hello world'``. However, it is not necessary to call a method right away: ``x.f`` is a method object, and can be stored away and called at a later time. For example::
fa: در مثال :class:`!MyClass`، این رشته ``'hello world'`` را برمی گرداند. با این حال، لازم نیست فوراً یک متد را فراخوانی کنید: ``x.f`` یک شی متد است و می‌توان آن را ذخیره کرد و در زمان دیگری فراخوانی کرد. به عنوان مثال::
pl: W przykładzie :class:`!MyClass` będzie to zwracać napis ``'hello world'`` . Nie jest jednak konieczne wywoływanie metody od razu: ``x.f`` jest obiektem metody i może być przechowywany i wywoływany później. Na przykład::
ru: В примере :class:`!MyClass` это вернет строку ``'hello world'``. Однако нет необходимости сразу вызывать метод: ``xf`` — это объект метода, его можно сохранить и вызвать позже. Например::

source: will continue to print ``hello world`` until the end of time.
fa: چاپ ``hello world`` تا پایان زمان ادامه خواهد داشت.
pl: będzie drukować ``hello world`` do końca czasu.
ru: эта программа будет печатать ``hello world``, пока вы её не остановите.

source: What exactly happens when a method is called? You may have noticed that ``x.f()`` was called without an argument above, even though the function definition for :meth:`!f` specified an argument. What happened to the argument? Surely Python raises an exception when a function that requires an argument is called without any --- even if the argument isn't actually used...
fa: وقتی یک متد فراخوانی می شود دقیقا چه اتفاقی می افتد؟ ممکن است متوجه شده باشید که ``x.f()`` بدون آرگومان در بالا فراخوانی شده است، حتی اگر تعریف تابع برای :meth:`!f` یک آرگومان را مشخص کرده باشد. بحث چه شد؟ مطمئنا پایتون یک استثنا ایجاد می کند زمانی که تابعی که به آرگومان نیاز دارد بدون هیچ --- فراخوانی شود، حتی اگر آرگومان در واقع استفاده نشده باشد...
pl: Co dokładnie dzieje się, gdy wywoływana jest metoda? Być może zauważyłeś, że ``x.f()`` został wywołany bez argument powyżej, mimo że definicja funkcja dla :meth:`!f` określała argument. Co się stało z argumentem? Z pewnością Python rzucić wyjątek, gdy funkcja, który wymaga argument jest wywoływany bez żadnego --- nawet jeśli argument nie jest faktycznie używany....
ru: Что именно происходит при вызове метода? Возможно, вы заметили, что ``xf()`` была вызвана без аргумента выше, хотя в определении функции для :meth:`!f` указан аргумент. Что случилось со спором? Конечно, Python вызывает исключение, когда функция, требующая аргумента, вызывается без каких-либо --- даже если аргумент на самом деле не используется...

source: Actually, you may have guessed the answer: the special thing about methods is that the instance object is passed as the first argument of the function. In our example, the call ``x.f()`` is exactly equivalent to ``MyClass.f(x)``. In general, calling a method with a list of *n* arguments is equivalent to calling the corresponding function with an argument list that is created by inserting the method's instance object before the first argument.
fa: در واقع، ممکن است پاسخ را حدس زده باشید: نکته ویژه در مورد متدها این است که شی نمونه به عنوان اولین آرگومان تابع ارسال می شود. در مثال ما، فراخوانی ``x.f()`` دقیقاً معادل ``MyClass.f(x)`` است. به طور کلی، فراخوانی یک متد با لیستی از آرگومان های *n* معادل فراخوانی تابع مربوطه با یک لیست آرگومان است که با قرار دادن شی نمونه متد قبل از اولین آرگومان ایجاد می شود.
pl: Właściwie, być może zgadłeś odpowiedź: szczególną rzeczą w metodach jest to, że obiekt instancji jest przekazywany jako pierwszy argument z funkcja. W naszym przykładzie wywołanie ``x.f()`` jest dokładnie równoważne wywołaniu ``MyClass.f(x)``. Ogólnie rzecz biorąc, wywołanie metody z listą *n* argument jest równoważne wywołaniu odpowiedniej funkcja z listą argument, która jest tworzona przez wstawienie obiektu instancji metody przed pierwszym argument.
ru: Как вы могли догадаться, метод отличается от функции тем, что в качестве первого аргумента ему передаётся экземпляр, к которому он был привязан. Например, ``x.f()`` --- то же самое, что ``MyClass.f(x)``. В общем случае, вызов метода с *n* аргументами эквивалентен вызову соответствующей функции из класса со списком аргументов, куда экземпляр, к которому привязан метод, подставлен на первое место.

source: In general, methods work as follows. When a non-data attribute of an instance is referenced, the instance's class is searched. If the name denotes a valid class attribute that is a function object, references to both the instance object and the function object are packed into a method object. When the method object is called with an argument list, a new argument list is constructed from the instance object and the argument list, and the function object is called with this new argument list.
fa: به طور کلی روش ها به شرح زیر عمل می کنند. هنگامی که یک ویژگی غیر داده ای از یک نمونه ارجاع داده می شود، کلاس نمونه جستجو می شود. اگر نام یک ویژگی کلاس معتبر را نشان می دهد که یک شی تابع است، ارجاعات به شی نمونه و شی تابع در یک شی متد بسته بندی می شوند. هنگامی که شی متد با یک لیست آرگومان فراخوانی می شود، یک لیست آرگومان جدید از شی نمونه و لیست آرگومان ساخته می شود و شی تابع با این لیست آرگومان جدید فراخوانی می شود.
pl: Ogólnie rzecz biorąc, metody działają w następujący sposób. Gdy odwoływane jest nie-dane atrybut instancji, wyszukiwana jest klasa instancji. Jeśli nazwa wskazuje na prawidłową klasę atrybut, która jest obiektem funkcja, odwołania zarówno do obiektu instancji, jak i obiektu funkcja są pakowane do obiektu metody. Gdy obiekt metody jest wywoływany z listą argument, nowa lista argument jest konstruowana z instancji obiektu i listy argument, a obiekt funkcja jest wywoływany z tą nową listą argument.
ru: В целом методы работают следующим образом. При ссылке на атрибут экземпляра, не являющийся данными, выполняется поиск класса экземпляра. Если имя обозначает допустимый атрибут класса, который является объектом функции, ссылки как на объект экземпляра, так и на объект функции упаковываются в объект метода. Когда объект метода вызывается со списком аргументов, новый список аргументов создается из объекта экземпляра и списка аргументов, и объект функции вызывается с этим новым списком аргументов.

source: Class and Instance Variables
fa: متغیرهای کلاس و نمونه
pl: Zmienne klas i instancji
ru: Переменные класса и экземпляра

source: Generally speaking, instance variables are for data unique to each instance and class variables are for attributes and methods shared by all instances of the class::
fa: به طور کلی، متغیرهای نمونه برای داده‌های منحصر به فرد برای هر نمونه و متغیرهای کلاس برای ویژگی‌ها و روش‌هایی هستند که توسط همه نمونه‌های کلاس به اشتراک گذاشته می‌شوند:
pl: Ogólnie rzecz biorąc, zmienne instancji są dla danych unikalnych dla każdej instancji, a zmienne klasy są dla atrybutów i metod współdzielonych przez wszystkie instancje klasy::
ru: В целом, переменные экземпляра хранят информацию, специфичную для каждого экземпляра, а переменные класса и методы описывают информацию и поведение, общие для всех экземпляров::

source: class Dog: kind = 'canine' # class variable shared by all instances def __init__(self, name): self.name = name # instance variable unique to each instance >>> d = Dog('Fido') >>> e = Dog('Buddy') >>> d.kind # shared by all dogs 'canine' >>> e.kind # shared by all dogs 'canine' >>> d.name # unique to d 'Fido' >>> e.name # unique to e 'Buddy'
pl: class Dog: kind = 'pies' # zmienna klasowa współdzielona przez wszystkie instancje def __init__(self, name): self.name = name # zmienna instancji unikalna dla każdej instancji >>> d = Dog('Fido') >>> e = Dog('Zito') >>> d.kind # współdzielona przez wszystkie psy 'pies' >>> e.kind # współdzielona przez wszystkie psy 'pies' >>> d.name # unikalna dla d 'Fido' >>> e.name # unikalna dla e 'Zito'

source: As discussed in :ref:`tut-object`, shared data can have possibly surprising effects with involving :term:`mutable` objects such as lists and dictionaries. For example, the *tricks* list in the following code should not be used as a class variable because just a single list would be shared by all *Dog* instances::
fa: همانطور که در :ref:`tut-object` بحث شد، داده های به اشتراک گذاشته شده می توانند اثرات شگفت انگیزی با درگیر کردن اشیاء :term:`mutable` مانند لیست ها و فرهنگ لغت داشته باشند. به عنوان مثال، لیست *tricks* در کد زیر نباید به عنوان یک متغیر کلاس استفاده شود زیرا فقط یک لیست تنها توسط تمام نمونه های *Dog* به اشتراک گذاشته می شود:
pl: Jak omówiono w :ref:`tut-object`, współdzielone dane mogą mieć zaskakujące efekty z udziałem :term:`mutable` obiektów takich jak listy i słownik. Na przykład, lista *sztuczki* w poniższym kodzie nie powinna być używana jako zmienna klasowa, ponieważ tylko jedna lista byłaby współdzielona przez wszystkie instancje klasy *Dog*::
ru: Как говорилось в :ref:`tut-object`, общие данные могут привести к неожиданным последствиям, если они :term:`мутабельные <мутабельный>`, как списки и словари. Например, в следующем примере список *tricks* не должен использоваться как переменная класса, потому что один и тот же список будет разделён между всеми экземплярами класса *Dog*::

source: class Dog: tricks = [] # mistaken use of a class variable def __init__(self, name): self.name = name def add_trick(self, trick): self.tricks.append(trick) >>> d = Dog('Fido') >>> e = Dog('Buddy') >>> d.add_trick('roll over') >>> e.add_trick('play dead') >>> d.tricks # unexpectedly shared by all dogs ['roll over', 'play dead']
pl: class Dog: tricks = [] # błędne użycie zmiennej klasowej def __init__(self, name): self.name = name def add_trick(self, trick): self.tricks.append(trick) >>> d = Dog('Fido') >>> e = Dog('Buddy') >>> d.add_trick('przewróć się') >>> e.add_trick('udawaj martwego') >>> d.tricks # nieoczekiwanie współdzielone przez wszystkie psy ['przewróć się', 'udawaj martwego']

source: Correct design of the class should use an instance variable instead::
fa: در طراحی صحیح کلاس باید از یک متغیر نمونه استفاده شود:
pl: Prawidłowy projekt klasy powinien zamiast tego używać zmiennej instancji::
ru: Правильнее будет сделать *tricks* перемнной каждого экземпляра::

source: class Dog: def __init__(self, name): self.name = name self.tricks = [] # creates a new empty list for each dog def add_trick(self, trick): self.tricks.append(trick) >>> d = Dog('Fido') >>> e = Dog('Buddy') >>> d.add_trick('roll over') >>> e.add_trick('play dead') >>> d.tricks ['roll over'] >>> e.tricks ['play dead']
pl: class Dog: def __init__(self, name): self.name = name self.tricks = [] # tworzy nową pustą listę dla każdego psa def add_trick(self, trick): self.tricks.append(trick) >>> d = Dog('Fido') >>> e = Dog('Zito') >>> d.add_trick('przewróć się') >>> e.add_trick('udawaj martwego') >>> d.tricks ['przewróć się'] >>> e.tricks ['udawaj martwego']

source: Random Remarks
fa: اظهارات تصادفی
pl: Uwagi losowe
ru: Полезно знать

source: If the same attribute name occurs in both an instance and in a class, then attribute lookup prioritizes the instance::
fa: اگر نام مشخصه یکسانی هم در یک نمونه و هم در یک کلاس وجود داشته باشد، جستجوی ویژگی، نمونه را اولویت بندی می کند::
pl: Jeśli ten sam atrybut występuje zarówno w instancji, jak i w klasie, wówczas wyszukiwanie atrybut nadaje priorytet instancji::
ru: Если в классе и в экземпляре встречаются аттрибуты с одинаковыми именем, используется аттрибут экземпляра::
