Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/tutorial/classes.po
Languages: fa, pl, ru

source: Classes
fa: کلاس ها
pl: Klasy
ru: Классы

source: Classes provide a means of bundling data and functionality together. Creating a new class creates a new *type* of object, allowing new *instances* of that type to be made. Each class instance can have attributes attached to it for maintaining its state. Class instances can also have methods (defined by its class) for modifying its state.
fa: کلاس‌ها وسیله‌ای برای جمع‌کردن داده‌ها و عملکرد با هم فراهم می‌کنند. ایجاد یک کلاس جدید، یک شیء *type* جدید ایجاد می کند، که اجازه می دهد *instances* جدید از آن نوع ساخته شود. هر نمونه کلاس می تواند ویژگی هایی را برای حفظ حالت خود به آن متصل کند. نمونه‌های کلاس همچنین می‌توانند متدهایی (که توسط کلاس آن تعریف می‌شوند) برای تغییر حالت آن داشته باشند.
pl: Klasy umożliwiają łączenie danych i funkcjonalności. Tworzenie nowej klasy, tworzy nowy *typ* obiektu, umożliwiając tworzenie nowych *instancji* tego typu. Do każdej instancji klasy można przypisać atrybuty służące do utrzymywania jej stanu. Instancje klas mogą również posiadać metody (zdefiniowane przez klasę) umożliwiające modyfikację ich stanu.
ru: Классы предоставляют средства для объединения данных с функциональностью. При создании нового класса создается новый *тип* объекта, что позволяет создавать новые *экземпляры* этого типа. Каждый экземпляр класса может иметь связанные с ним атрибуты, сохраняющие его состояние. Экземпляры класса также могут иметь методы (объявленные в классе), изменяющие его состояние.

source: Compared with other programming languages, Python's class mechanism adds classes with a minimum of new syntax and semantics. It is a mixture of the class mechanisms found in C++ and Modula-3. Python classes provide all the standard features of Object Oriented Programming: the class inheritance mechanism allows multiple base classes, a derived class can override any methods of its base class or classes, and a method can call the method of a base class with the same name. Objects can contain arbitrary amounts and kinds of data. As is true for modules, classes partake of the dynamic nature of Python: they are created at runtime, and can be modified further after creation.
fa: در مقایسه با سایر زبان‌های برنامه‌نویسی، مکانیسم کلاس پایتون کلاس‌هایی را با حداقل نحو و معنای جدید اضافه می‌کند. این ترکیبی از مکانیسم‌های کلاس موجود در C++ و Modula-3 است. کلاس‌های پایتون تمام ویژگی‌های استاندارد برنامه‌نویسی شی‌گرا را ارائه می‌کنند: مکانیسم وراثت کلاس به چندین کلاس پایه اجازه می‌دهد، یک کلاس مشتق شده می‌تواند هر روشی از کلاس یا کلاس‌های پایه خود را لغو کند، و یک متد می‌تواند متد یک کلاس پایه را با همان نام فراخوانی کند. اشیاء می توانند حاوی مقادیر دلخواه و انواع داده باشند. همانطور که برای ماژول ها صدق می کند، کلاس ها از ماهیت پویای پایتون سهیم هستند: آنها در زمان اجرا ایجاد می شوند و می توانند بعد از ایجاد تغییرات بیشتری داشته باشند.
pl: W porównaniu do innych języków programowania, w Pythonie, mechanizm dodawania nowych klas wymaga niewielkiej ilości nowej składni i semantyki. Jest to połączenie mechanizmu klas, które można znaleźć w C++ i Modula-3. Klasy w Pythonie dostarczają wszystkie standardowe cechy programowania obiektowego: mechanizm dziedziczenia klas pozwala na wiele klas bazowych, klasy pochodne mogą nadpisać każdą metodę klasy lub klas bazowych i metoda może wywołać metody klas bazowych o tej samej nazwie. Obiekty mogą zawierać dowolną ilość i rodzaj danych. Zarówno klasy jak i moduły są częścią dynamicznej natury Pythona: są tworzone w trakcie działania programu i mogą być modyfikowane później, po stworzeniu.
ru: В сравнении с другими языками программирования, механизм классов в Python добавляет классы с минимумом нового синтаксиса и семантики. Это смесь механизмов классов из C++ и Modula-3. Классы в Python предоставляют полный набор стандартных возможностей Объектно-Ориентированного Программирования: механизм наследования поддерживает множественные базовые классы, производные классы могут переопределять любые методы своего базового класса или классов, и методы могут вызывать методы базовых классов с такими же именами. Объекты могут содержать данные произвольного объема и вида. Как и в случае с модулями, классы обладают динамической природой в Python: они создаются во время выполнения и могут быть изменены позже после создания.

source: In C++ terminology, normally class members (including the data members) are *public* (except see below :ref:`tut-private`), and all member functions are *virtual*. As in Modula-3, there are no shorthands for referencing the object's members from its methods: the method function is declared with an explicit first argument representing the object, which is provided implicitly by the call. As in Smalltalk, classes themselves are objects. This provides semantics for importing and renaming. Unlike C++ and Modula-3, built-in types can be used as base classes for extension by the user. Also, like in C++, most built-in operators with special syntax (arithmetic operators, subscripting etc.) can be redefined for class instances.
fa: در اصطلاحات C++، معمولاً اعضای کلاس (شامل اعضای داده) *public* هستند (به جز نگاه کنید به زیر :ref:`tut-private`), و همه توابع عضو *virtual* هستند. همانطور که در Modula-3، هیچ کوتاه نویسی برای ارجاع اعضای شی از متدهای آن وجود ندارد: تابع متد با اولین آرگومان صریح که نشان دهنده شیء است، اعلام می شود که به طور ضمنی توسط فراخوانی ارائه می شود. همانطور که در Smalltalk، کلاس ها خود شی هستند. این امر معنایی را برای وارد کردن و تغییر نام فراهم می کند. برخلاف C++ و Modula-3، انواع داخلی می توانند به عنوان کلاس های پایه برای توسعه توسط کاربر استفاده شوند. همچنین، مانند C++، اکثر عملگرهای داخلی با نحو خاص (عملگرهای حسابی, اشتراک و غیره) می‌توانند برای نمونه‌های کلاس دوباره تعریف شوند.
pl: Korzystając z terminologii C++, składniki klas (także pola) są *publiczne* (z wyjątkiem zobacz poniżej :ref:`tut-private`), a wszystkie metody są *wirtualne*. Podobnie jak w Moduli-3, nie ma skrótów pozwalających na odnoszenie się do składników klas z ich metod: metoda jest deklarowana poprzez podanie wprost jako pierwszego argumentu obiektu, który w czasie wywołania metody zostanie jej przekazany niejawnie. Podobnie jak w Smalltalku, same klasy także są obiektami. Dostarcza nam to wyrażeń semantycznych pozwalających na importowanie i zmianę nazw klasy. Inaczej niż w C++ i Moduli-3 wbudowane typy mogą stanowić klasy, z których klasa użytkownika będzie dziedziczyć. Podobnie jak w C++, większość wbudowanych operatorów ze specjalną składnią (operatory arytmetyczne, indeksowanie) może być przedefiniowane przez instancje klasy.
ru: В терминологии C++, обычно члены класса (включая переменные) являются *public* (об исключениях читайте ниже :ref:`tut-private`), а все функции - *virtual*. Как и в Modula-3, здесь нет сокращений для ссылки на членов объекта из их методов: функция-метод объявляется с явным первым аргументом, представляющим объект, который неявно подставляется при вызове. Как и в Smalltalk, классы сами по себе являются объектами. Это обеспечивает семантику для импорта и переименования. В отличие от C++ и Modula-3, встроенные типы могут использоваться как базовые классы для расширения пользователем. Так же, как и в C++, большинство встроенных операторов со специальным синтаксисом (арифметические операторы, индексирование и т. д.) могут быть переопределены для экземпляров класса.

source: (Lacking universally accepted terminology to talk about classes, I will make occasional use of Smalltalk and C++ terms. I would use Modula-3 terms, since its object-oriented semantics are closer to those of Python than C++, but I expect that few readers have heard of it.)
fa: (به دلیل نداشتن اصطلاحات پذیرفته شده جهانی برای صحبت در مورد کلاس ها, من گهگاه از اصطلاحات Smalltalk و C++ استفاده می کنم. از اصطلاحات Modula-3 استفاده می کنم, زیرا معنایی شی گرا آن به زبان پایتون نزدیکتر از C++ است, اما انتظار دارم که تعداد کمی از خوانندگان درباره آن چیزی شنیده باشند.)
pl: (Z powodu braku ogólnie zaakceptowanej terminologii w kontekście klas, będę używał terminów ze Smalltalk i C++. Użyłbym Modula-3 ponieważ semantyka jego programowania obiektowego jest bliższa Pythonowi niż C++ ale zakładam, że mniej czytelników o nim słyszało.)
ru: (Не имея общепринятой терминологии, чтобы говорить о классах, я буду время от времени использовать термины Smalltalk и C++. Я бы использовал терминологию Modula-3, поскольку его объектно-ориентированная семантика ближе к Python, чем C+, но я думаю, что мало читателей слышали об этом.)

source: A Word About Names and Objects
fa: سخنی در مورد نام ها و اشیاء
pl: Kilka słów o nazwach i obiektach
ru: Несколько слов об именах и объектах

source: Objects have individuality, and multiple names (in multiple scopes) can be bound to the same object. This is known as aliasing in other languages. This is usually not appreciated on a first glance at Python, and can be safely ignored when dealing with immutable basic types (numbers, strings, tuples). However, aliasing has a possibly surprising effect on the semantics of Python code involving mutable objects such as lists, dictionaries, and most other types. This is usually used to the benefit of the program, since aliases behave like pointers in some respects. For example, passing an object is cheap since only a pointer is passed by the implementation; and if a function modifies an object passed as an argument, the caller will see the change --- this eliminates the need for two different argument passing mechanisms as in Pascal.
fa: اشیاء دارای فردیت هستند و نام های متعدد (در حوزه های متعدد) را می توان به یک شی محدود کرد. این در زبان های دیگر به نام مستعار شناخته می شود. معمولاً در نگاه اول پایتون به این موضوع توجهی نمی‌شود، و می‌توان با خیال راحت از انواع اولیه تغییرناپذیر (اعداد, رشته‌ها, تاپل‌ها) صرف نظر کرد. با این حال، نام مستعار یک اثر احتمالاً شگفت‌انگیز بر معنایی کد پایتون شامل اشیاء قابل تغییر مانند فهرست‌ها، دیکشنری‌ها و بسیاری از انواع دیگر دارد. این معمولاً به نفع برنامه استفاده می شود، زیرا نام مستعار در برخی موارد مانند اشاره گر عمل می کنند. به عنوان مثال، ارسال یک شی ارزان است زیرا تنها یک اشاره گر توسط پیاده سازی ارسال می شود. و اگر تابعی شیء ارسال شده به عنوان آرگومان را تغییر دهد، فراخواننده این تغییر را مشاهده خواهد کرد --- این امر نیاز به دو مکانیسم مختلف ارسال آرگومان مانند پاسکال را از بین می برد.
pl: Obiekty mają indywidualność, a wiele nazw (w wielu zakresach) może być powiązanych z tym samym obiektem. Jest to znane jako aliasing w innych językach. Zwykle nie jest to doceniane na pierwszy rzut oka w Pythonie i można je bezpiecznie zignorować, gdy mamy do czynienia z niezmiennymi typami podstawowymi (liczby, ciągi znaków, krotki). Jednak aliasing ma prawdopodobnie zaskakujący wpływ na semantykę kodu Pythona, który obejmuje zmienne obiekty, takie jak listy, słowniki i większość innych typów. Jest to zwykle wykorzystywane z korzyścią dla programu, ponieważ aliasy pod pewnymi względami zachowują się jak wskaźniki. Na przykład przekazanie obiektu jest tanie, ponieważ implementacja przekazuje tylko wskaźnik; a jeśli funkcja modyfikuje obiekt przekazany jako argument, wywołujący zobaczy zmianę --- eliminuje to potrzebę stosowania dwóch różnych mechanizmów przekazywania argumentów, jak w Pascalu.
ru: Объекты имеют индивидуальность, и множество имен (в разных областях видимости) могут быть связаны с одним объектом. В других языках это называется псевдонимами (aliasing). Обычно это не принимается во внимание при первом знакомстве с Python, и это можно спокойно игнорировать при работе с неизменяемыми основными типами (числами, строками, кортежами). Однако псевдонимы могут иметь неожиданный эффект на семантику кода Python, включающего изменяемые объекты, такие как списки, словари и большинство других типов. Это обычно используется в пользу программы, поскольку псевдонимы в некоторых отношениях ведут себя как указатели. Например, передача объекта обходится дешево, поскольку передается только указатель на него; и если функция изменяет объект, переданный в качестве аргумента, вызывающий объект увидит это изменение - это устраняет необходимость в двух различных механизмах передачи аргументов, как в Pascal.

source: Python Scopes and Namespaces
fa: دامنه ها و فضاهای نام پایتون
pl: Zasięgi widoczności i przestrzenie nazw w Pythonie
ru: Области видимости и пространства имен в Python

source: Before introducing classes, I first have to tell you something about Python's scope rules. Class definitions play some neat tricks with namespaces, and you need to know how scopes and namespaces work to fully understand what's going on. Incidentally, knowledge about this subject is useful for any advanced Python programmer.
fa: قبل از معرفی کلاس ها، ابتدا باید چیزی در مورد قوانین محدوده پایتون به شما بگویم. تعاریف کلاس‌ها چند ترفند ساده با فضاهای نام بازی می‌کنند، و شما باید بدانید که دامنه‌ها و فضاهای نام چگونه کار می‌کنند تا به طور کامل بفهمید که چه اتفاقی می‌افتد. اتفاقاً دانش این موضوع برای هر برنامه نویس پیشرفته پایتون مفید است.
pl: Przed wprowadzeniem klas, najpierw muszę powiedzieć ci coś o zasadach zakresu Pythona. Definicje klas stosują kilka zgrabnych sztuczek z przestrzeniami nazw, a żeby w pełni zrozumieć, co się dzieje, trzeba wiedzieć, jak działają zakresy i przestrzenie nazw.
ru: Прежде чем представить классы, я должен сначала рассказать кое-что о правилах области видимости в Python. Определения классов проделывают некоторые хитрые трюки с пространством имен, и вы должны знать, как работают области видимости и пространства имен, чтобы полностью понимать, что происходит. Кстати, эти знания полезны для любого продвинутого программиста на Python.

source: Let's begin with some definitions.
fa: بیایید با برخی از تعاریف شروع کنیم.
pl: Zacznijmy od kilku definicji.
ru: Давайте начнем с некоторых определений.

source: A *namespace* is a mapping from names to objects. Most namespaces are currently implemented as Python dictionaries, but that's normally not noticeable in any way (except for performance), and it may change in the future. Examples of namespaces are: the set of built-in names (containing functions such as :func:`abs`, and built-in exception names); the global names in a module; and the local names in a function invocation. In a sense the set of attributes of an object also form a namespace. The important thing to know about namespaces is that there is absolutely no relation between names in different namespaces; for instance, two different modules may both define a function ``maximize`` without confusion --- users of the modules must prefix it with the module name.
fa: *namespace* یک نقشه برداری از نام ها به اشیاء است. اکثر فضاهای نام در حال حاضر به عنوان فرهنگ لغت پایتون پیاده سازی می شوند، اما معمولاً به هیچ وجه (به جز عملکرد) قابل توجه نیست و ممکن است در آینده تغییر کند. نمونه هایی از فضاهای نام عبارتند از: مجموعه ای از نام های داخلی (شامل توابعی مانند :func:`abs` و نام های استثنای داخلی). نام های جهانی در یک ماژول؛ و نام های محلی در فراخوانی تابع. به یک معنا مجموعه صفات یک شی نیز یک فضای نام را تشکیل می دهد. نکته مهمی که باید در مورد فضاهای نام بدانید این است که مطلقاً هیچ رابطه ای بین نام ها در فضای نام های مختلف وجود ندارد. به عنوان مثال، دو ماژول مختلف ممکن است هر دو یک تابع ``maximize`` را بدون سردرگمی تعریف کنند --- کاربران ماژول ها باید آن را با نام ماژول پیشوند کنند.
pl: *Przestrzeń nazw* to odwzorowanie z nazw na obiekty. Większość przestrzeni nazw jest obecnie implementowana jako słowniki Pythona, ale to zwykle nie jest zauważalne w żaden sposób (z wyjątkiem wydajności), a to może się zmienić w przyszłości. Przykładami przestrzeni nazw są: zbiór nazw wbudowanych (zawierający funkcje np. :func:`abs` i nazwy wbudowanych wyjątków); nazwy globalne w module; oraz nazwy lokalne w wywołaniu funkcji. W pewnym sensie zbiór atrybutów obiektu również tworzy przestrzeń nazw. Ważną rzeczą, którą należy wiedzieć o przestrzeniach nazw, jest to, że nie ma absolutnie żadnych relacji między nazwami w różnych przestrzeniach nazw; na przykład, dwa różne moduły mogą zdefiniować funkcję ``maximize`` bez zamieszania --- użytkownicy modułów muszą poprzedzić go nazwą modułu.
ru: Пространство имен - это отображение имен на объекты. Большинство пространств имен в настоящее время реализованы как словари Python, но обычно это незаметно (за исключением производительности) и может измениться в будущем. Примерами пространств имен являются: набор встроенных имен (включая функции, такие как :func:`abs`, и встроенные имена исключений); глобальные имена в модуле; локальные имена в вызове функции. В некотором смысле набор атрибутов объекта тоже образует пространство имен. Важная деталь, которую нужно знать о пространствах имен - это то, что не совершенно никакой связи между именами из разных пространств имен; например, в двух разных модулях может быть определена функция ``maximize`` без какой-либо путаницы - пользователи модуля должны использовать имя модуля в качестве префикса при вызове функции.

source: By the way, I use the word *attribute* for any name following a dot --- for example, in the expression ``z.real``, ``real`` is an attribute of the object ``z``. Strictly speaking, references to names in modules are attribute references: in the expression ``modname.funcname``, ``modname`` is a module object and ``funcname`` is an attribute of it. In this case there happens to be a straightforward mapping between the module's attributes and the global names defined in the module: they share the same namespace! [#]_
fa: به هر حال، من از کلمه *attribute* برای هر نامی به دنبال نقطه استفاده می کنم --- به عنوان مثال، در عبارت ``z.real``، ``real`` یک ویژگی شی ``z`` است. به طور دقیق، ارجاع به نام ها در ماژول ها ارجاعات ویژگی هستند: در عبارت ``modname.funcname``، ``modname`` یک شی ماژول و ``funcname`` یک ویژگی آن است. در این مورد، نگاشت مستقیمی بین ویژگی‌های ماژول و نام‌های کلی تعریف‌شده در ماژول وجود دارد: آنها فضای نام یکسانی دارند! [#]_
pl: Nawiasem mówiąc, używam słowa *atrybut* dla każdej nazwy następującej po kropce --- na przykład w wyrażeniu ``z.real``, ``real`` jest atrybutem obiektu ``z``. Ściśle mówiąc, odniesienia do nazw w modułach są odniesieniami atrybutowymi: w wyrażeniu ``modname.funcname``, ``modname`` jest obiektem modułu, a ``funcname`` jest jego atrybutem. W tym przypadku istnieje proste odwzorowanie między atrybutami modułu i nazwami globalnymi zdefiniowanymi w module: mają tę samą przestrzeń nazw! [#]_
ru: Кстати, я использую слово *атрибут* для любого имени, следующего после точки --- например, в выражении ``z.real``, ``real`` - это атрибут объекта ``z``. Строго говоря, ссылки на имена в модулях являются ссылками на атрибуты: в выражении ``modname.funcname``, ``modname`` является объектом модуля, и ``funcname`` является его атрибутом. В этом случае выполняется прямое соответствие между атрибутами модуля и глобальными именами, объявленными в модуле: они используют одно и то же пространство имен! [#]_

source: Attributes may be read-only or writable. In the latter case, assignment to attributes is possible. Module attributes are writable: you can write ``modname.the_answer = 42``. Writable attributes may also be deleted with the :keyword:`del` statement. For example, ``del modname.the_answer`` will remove the attribute :attr:`!the_answer` from the object named by ``modname``.
fa: ویژگی ها ممکن است فقط خواندنی یا قابل نوشتن باشند. در حالت دوم، انتساب به صفات امکان پذیر است. ویژگی های ماژول قابل نوشتن هستند: می توانید ``modname.the_answer = 42`` بنویسید. ویژگی های قابل نوشتن نیز ممکن است با دستور :keyword:`del` حذف شوند. به عنوان مثال، ``del modname.the_answer`` ویژگی :attr:`!the_answer` را از شیء نامگذاری شده توسط ``modname`` حذف می کند.
pl: Atrybuty mogą być tylko do odczytu lub zapisywalne. W tym drugim przypadku możliwe jest przypisanie do atrybutu. Atrybuty modułu są zapisywalne: można zapisać ``modname.the_answer = 42``. Zapisywalne atrybuty można również usunąć za pomocą instrukcji :keyword:`del`. Na przykład, ``del modname.the_answer`` usunie atrybut :attr:`!the_answer` z obiektu o nazwie ``modname``.
ru: Атрибуты могут быть только-для-чтения или с возможностью записи. В последнем случае возможно присваивание атрибутам. Модульные атрибуты являются с возможностью записи: вы можете записать ``modname.the_answer = 42``. Атрибуты с возможностью записи также могут быть удалены с помощью инструкции :keyword:`del`. Например, ``del modname.the_answer`` удалит атрибут :attr:`!the_answer` из объекта, названного ``modname``.

source: Namespaces are created at different moments and have different lifetimes. The namespace containing the built-in names is created when the Python interpreter starts up, and is never deleted. The global namespace for a module is created when the module definition is read in; normally, module namespaces also last until the interpreter quits. The statements executed by the top-level invocation of the interpreter, either read from a script file or interactively, are considered part of a module called :mod:`__main__`, so they have their own global namespace. (The built-in names actually also live in a module; this is called :mod:`builtins`.)
fa: فضاهای نام در لحظات مختلف ایجاد می شوند و طول عمر متفاوتی دارند. فضای نام حاوی نام‌های داخلی با راه‌اندازی مفسر پایتون ایجاد می‌شود و هرگز حذف نمی‌شود. فضای نام جهانی برای یک ماژول زمانی ایجاد می شود که تعریف ماژول در آن خوانده شود. به طور معمول، فضاهای نام ماژول نیز تا زمانی که مفسر خارج شود باقی می ماند. عباراتی که توسط فراخوانی سطح بالای مفسر اجرا می شوند، چه از یک فایل اسکریپت خوانده شوند و چه به صورت تعاملی، بخشی از یک ماژول به نام :mod:`__main__` در نظر گرفته می شوند، بنابراین فضای نام جهانی خود را دارند. (نام های داخلی در واقع در یک ماژول نیز زندگی می کنند؛ این :mod:`builtins` نامیده می شود.)
pl: Przestrzenie nazw są tworzone w różnych momentach i mają różny czas życia. Przestrzeń nazw zawierająca nazwy wbudowane jest tworzona podczas uruchamiania interpretera Pythona i nigdy nie jest usuwana. Globalna przestrzeń nazw dla modułu jest tworzona, gdy wczytywana jest definicja modułu; zwykle przestrzenie nazw modułu również trwają do zakończenia działania interpretera. Instrukcje wykonywane przez wywołanie interpretera najwyższego poziomu, zarówno odczytane z pliku skryptu, jak i interaktywnie, są uważane za część modułu o nazwie :mod:`__main__`, więc mają swoją własną globalną przestrzeń nazw. (Nazwy wbudowane w rzeczywistości również znajdują się w module; nazwany jest on :mod:`builtins`).
ru: Пространства имен создаются в разное время и имеют разные периоды жизни. Пространство имен, содержащее встроенные имена, создается, когда интерпретатор Python начинает работу, и никогда не удаляется. Глобальное пространство имен для модуля создается, когда считывается определение модуля; обычно пространство имен модуля также сохраняется до тех пор, пока не закончится работа интерпретатора. Операторы, исполняемые на высшем уровне работы интерпретатора, либо считываемые из файла скрипта или интерактивно, считаются частью модуля :mod:`__main__`, поэтому относятся к собственному глобальному пространству имен. (Встроенные имена также существуют в модуле; он называется :mod:`builtins`.)
