Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/tutorial/classes.po
Languages: fa, pl, ru

source: The local namespace for a function is created when the function is called, and deleted when the function returns or raises an exception that is not handled within the function. (Actually, forgetting would be a better way to describe what actually happens.) Of course, recursive invocations each have their own local namespace.
fa: فضای نام محلی برای یک تابع هنگام فراخوانی تابع ایجاد می‌شود و زمانی که تابع استثنایی را که در تابع مدیریت نمی‌شود برمی‌گرداند یا ایجاد می‌کند، حذف می‌شود. (در واقع, فراموش کردن راه بهتری برای توصیف آنچه در واقع اتفاق می‌افتد خواهد بود.) البته، فراخوان‌های بازگشتی هر کدام فضای نام محلی خود را دارند.
pl: Lokalna przestrzeń nazw dla funkcji jest tworzona przy wywołaniu funkcji i usuwana, gdy funkcja zwraca wynik lub rzuca wyjątek, którego nie obsługuje. (Właściwie, zapominanie byłoby lepszym słowem na opisanie tego, co faktycznie się dzieje). Oczywiście, każde wywołanie rekurencyjne ma swoją własną lokalną przestrzeń nazw.
ru: Локальное пространство имен функции создается в момент вызова функции и удаляется, когда функция возвращает значение или вызывает исключение, не обрабатываемое внутри функции. (На самом деле, забывание было бы лучшим способом описать то, что происходит.) Разумеется, каждый рекурсивный вызов имеет свое собственное пространство имен.

source: A *scope* is a textual region of a Python program where a namespace is directly accessible. "Directly accessible" here means that an unqualified reference to a name attempts to find the name in the namespace.
fa: *scope* یک منطقه متنی از یک برنامه پایتون است که در آن فضای نام مستقیماً قابل دسترسی است. "دسترسی مستقیم" در اینجا به این معنی است که یک ارجاع غیرمجاز به یک نام سعی می کند نام را در فضای نام پیدا کند.
pl: *Zakres* to tekstowy obszar programu Python, w którym przestrzeń nazw jest bezpośrednio dostępna. „Bezpośrednio dostępna” oznacza tutaj, że niekwalifikowane odwołanie do nazwy próbuje znaleźć ją w przestrzeni nazw.
ru: *Область видимости* - это текстовая область программы на Python, в которой пространство имен находится в непосредственной доступности. "Непосредственная доступность" здесь означает, что обычная ссылка на имя пытается найти его в пространстве имен.

source: Although scopes are determined statically, they are used dynamically. At any time during execution, there are 3 or 4 nested scopes whose namespaces are directly accessible:
fa: اگرچه دامنه ها به صورت استاتیک تعیین می شوند، اما به صورت پویا مورد استفاده قرار می گیرند. در هر زمان در طول اجرا، 3 یا 4 محدوده تو در تو وجود دارد که فضای نام آنها مستقیماً قابل دسترسی است:
pl: Chociaż zakresy są określane statycznie, są używane dynamicznie. Cały czas w trakcie wykonywania programu istnieją 3 lub 4 zagnieżdżone zakresy, których przestrzenie nazw są bezpośrednio dostępne:
ru: Области видимости определяются статически, но используются динамично. В любой момент времени у программы есть 3 или 4 области видимости, вложенных друг в друга, имена которых непосредственно доступны:

source: the innermost scope, which is searched first, contains the local names
fa: درونی‌ترین محدوده، که ابتدا جستجو می‌شود، حاوی نام‌های محلی است
pl: najbardziej wewnętrzny zakres, który jest przeszukiwany jako pierwszy, zawiera nazwy lokalne
ru: внутренняя область видимости, которая просматривается в первую очередь и содержит локальные имена

source: the scopes of any enclosing functions, which are searched starting with the nearest enclosing scope, contain non-local, but also non-global names
fa: دامنه هر توابع محصور کننده ای که با شروع با نزدیک ترین محدوده محصور جستجو می شود، حاوی نام های غیر محلی، بلکه غیرکلی نیز می باشد.
pl: zakresy wszystkich otaczających funkcji, które są przeszukiwane począwszy od najbliższego otaczającego zakresu, zawierają nazwy nielokalne, ale także nieglobalne
ru: области любых вложенных функций, которые просматриваются, начиная с ближайшей вложенной области, содержат нелокальные, но и не глобальные имена

source: the next-to-last scope contains the current module's global names
fa: دامنه بعدی تا آخر شامل نام های سراسری ماژول فعلی است
pl: przedostatni zakres zawiera globalne nazwy bieżącego modułu
ru: предпоследняя область видимости, включающая глобальные имена текущего модуля

source: the outermost scope (searched last) is the namespace containing built-in names
fa: بیرونی ترین محدوده (آخرین جستجو شده) فضای نامی است که شامل نام های داخلی است
pl: najbardziej zewnętrznym zakresem (przeszukiwanym jako ostatni) jest przestrzeń nazw zawierająca nazwy wbudowane
ru: внешней областью видимости (просматривается последней) является пространство имен, содержащее встроенные имена

source: If a name is declared global, then all references and assignments go directly to the next-to-last scope containing the module's global names. To rebind variables found outside of the innermost scope, the :keyword:`nonlocal` statement can be used; if not declared nonlocal, those variables are read-only (an attempt to write to such a variable will simply create a *new* local variable in the innermost scope, leaving the identically named outer variable unchanged).
fa: اگر نامی جهانی اعلام شود، آنگاه همه ارجاعات و تخصیص ها مستقیماً به محدوده بعدی تا آخرین حاوی نام های جهانی ماژول می روند. برای اتصال مجدد متغیرهایی که خارج از درونی ترین محدوده یافت می شوند، می توان از دستور :keyword:`nonlocal` استفاده کرد. اگر غیرمحلی اعلام نشود، آن متغیرها فقط خواندنی هستند (تلاش برای نوشتن روی چنین متغیری به سادگی یک متغیر محلی *new* در درونی‌ترین محدوده ایجاد می‌کند و متغیر بیرونی با نام مشابه را بدون تغییر می‌گذارد).
pl: Jeśli nazwa jest zadeklarowana jako globalna, wtedy wszystkie referencje i przypisania przechodzą bezpośrednio do przedostatniego zakresu zawierającego globalne nazwy modułu. Aby ponownie powiązać zmienne znajdujące się poza najbardziej wewnętrznym zakresem, można użyć instrukcji :keyword:`nonlocal`; jeśli nie są zadeklarowane jako nielokalne, zmienne te są tylko do odczytu (próba zapisu do takiej zmiennej po prostu utworzy *nową* zmienną lokalną w najbardziej wewnętrznym zakresie, pozostawiając identycznie nazwaną zmienną zewnętrzną bez zmian).
ru: Если имя объявлено глобальным, то все ссылки и назначения передаются непосредственно в предпоследнюю область, содержащую глобальные имена модуля. Чтобы перепривязать переменные, найденные за пределами самой внутренней области видимости, можно использовать оператор :keyword:`nonlocal`; если они не объявлены нелокальными, эти переменные доступны только для чтения (попытка записи в такую ​​переменную просто создаст *новую* локальную переменную во внутренней области видимости, оставив внешнюю переменную с таким же именем неизменной).

source: Usually, the local scope references the local names of the (textually) current function. Outside functions, the local scope references the same namespace as the global scope: the module's namespace. Class definitions place yet another namespace in the local scope.
fa: معمولاً محدوده محلی به نام های محلی تابع فعلی (از نظر متنی) ارجاع می دهد. خارج از توابع، محدوده محلی به فضای نامی مشابه با دامنه جهانی ارجاع می دهد: فضای نام ماژول. تعاریف کلاس ها فضای نام دیگری را در محدوده محلی قرار می دهند.
pl: Zazwyczaj zakres lokalny odwołuje się do nazw lokalnych (tekstowo) bieżącej funkcji. Poza funkcjami, zakres lokalny odwołuje się do tej samej przestrzeni nazw, co zakres globalny: przestrzeni nazw modułu. Definicje klas umieszczają jeszcze jedną przestrzeń nazw w zakresie lokalnym.
ru: Как правило, локальная область видимости ссылается на локальные имена (буквально) текущей функции. За пределами функции локальная область видимости ссылается на то же пространство имен, что и глобальная область видимости: пространство имен модуля. Определение класса помещает еще одно пространство имен в локальную область видимости.

source: It is important to realize that scopes are determined textually: the global scope of a function defined in a module is that module's namespace, no matter from where or by what alias the function is called. On the other hand, the actual search for names is done dynamically, at run time --- however, the language definition is evolving towards static name resolution, at "compile" time, so don't rely on dynamic name resolution! (In fact, local variables are already determined statically.)
fa: مهم است که بدانیم دامنه ها به صورت متنی تعیین می شوند: محدوده جهانی یک تابع تعریف شده در یک ماژول، فضای نام آن ماژول است، مهم نیست که از کجا یا با چه نام مستعار تابع نامیده می شود. از سوی دیگر، جستجوی واقعی نام ها به صورت پویا و در زمان اجرا انجام می شود --- با این حال، تعریف زبان به سمت وضوح نام ثابت در زمان "کامپایل" در حال تکامل است، بنابراین به وضوح نام پویا تکیه نکنید! (در واقع, متغیرهای محلی قبلاً به صورت ایستا تعیین شده اند.)
pl: Ważne jest, aby zdać sobie sprawę, że zakresy są określane tekstowo: globalny zakres funkcji zdefiniowany w module jest przestrzenią nazw tego modułu, bez względu na to, skąd lub przez jaki alias funkcja jest wywoływana. Z drugiej strony, rzeczywiste wyszukiwanie nazw odbywa się dynamicznie, w czasie wykonywania --- jednak definicja języka ewoluuje w kierunku statycznego rozpoznawania nazw, w czasie „kompilacji”, więc nie należy polegać na dynamicznym rozpoznawaniu nazw! (W rzeczywistości zmienne lokalne są już określane statycznie).
ru: Важно понимать, что области видимости определяются буквально: глобальная область видимости функции, объявленной в модуле, относится к пространству имен этого модуля, независимо от того, откуда или по какому псевдониму эта функция вызывается. С другой стороны, фактический поиск имен выполняется динамически, во время выполнения кода - однако, определение языка развивается в направлении статического поиска значений имен, во время "компиляции", поэтому не полагайтесь на динамическое сопоставление имен. (Фактически локальные переменные уже определены статически.)

source: A special quirk of Python is that -- if no :keyword:`global` or :keyword:`nonlocal` statement is in effect -- assignments to names always go into the innermost scope. Assignments do not copy data --- they just bind names to objects. The same is true for deletions: the statement ``del x`` removes the binding of ``x`` from the namespace referenced by the local scope. In fact, all operations that introduce new names use the local scope: in particular, :keyword:`import` statements and function definitions bind the module or function name in the local scope.
fa: یک ویژگی خاص پایتون این است که -- اگر هیچ دستور :keyword:`global` یا :keyword:`nonlocal` در کار نباشد -- انتساب به نام ها همیشه در درونی ترین محدوده قرار می گیرد. تکالیف داده ها را کپی نمی کنند --- آنها فقط نام ها را به اشیا متصل می کنند. همین امر در مورد حذف ها نیز صادق است: عبارت ``del x`` اتصال ``x`` را از فضای نامی که توسط محدوده محلی ارجاع داده شده است حذف می کند. در واقع، تمام عملیاتی که نام‌های جدید معرفی می‌کنند، از محدوده محلی استفاده می‌کنند: به ویژه، عبارات :keyword:`import` و تعاریف تابع، نام ماژول یا تابع را در محدوده محلی متصل می‌کنند.
pl: Szczególnym dziwactwem Pythona jest to, że – jeśli nie działa instrukcja :keyword:`global` lub :keyword:`nonlocal` – przypisanie do nazw zawsze trafia do najbardziej wewnętrznego zakresu. Przypisania nie kopiują danych – po prostu wiążą nazwy z obiektami. To samo dotyczy usuwania: instrukcja ``del x`` usuwa wiązanie ``x`` z przestrzeni nazw, do której odwołuje się zakres lokalny. W rzeczywistości wszystkie operacje, które wprowadzają nowe nazwy, używają zakresu lokalnego: w szczególności instrukcje :keyword:`import` i definicje funkcji wiążą nazwę modułu lub funkcji w zakresie lokalnym.
ru: Особой причудой Python является то, что если не задействован оператор :keyword:`global`, то присваивания имен направлены в самую глубокую область видимости. Присваивания не копирует данные - они лишь связывают имена с объектами. То же верно и для удаления: оператор ``del x`` удаляет привязку ``x`` из пространства имен, на которое ссылается локальная область видимости. Фактически, все операции, которые вводят новые имена, используют локальную область видимости: в частности, оператор :keyword:`import` и объявления функций связывают имя модуля или функции в локальной области видимости.

source: The :keyword:`global` statement can be used to indicate that particular variables live in the global scope and should be rebound there; the :keyword:`nonlocal` statement indicates that particular variables live in an enclosing scope and should be rebound there.
fa: دستور :keyword:`global` را می توان برای نشان دادن اینکه متغیرهای خاص در محدوده جهانی زندگی می کنند و باید در آنجا بازگردند استفاده شود. عبارت :keyword:`nonlocal` نشان می دهد که متغیرهای خاص در یک محدوده محصور زندگی می کنند و باید در آنجا بازگردند.
pl: Instrukcja :keyword:`global` może być użyta do wskazania, że określone zmienne znajdują się w zakresie globalnym i powinny być tam ponownie wiązane; instrukcja :keyword:`nonlocal` wskazuje, że określone zmienne znajdują się w zakresie otaczającym i powinny być tam ponownie wiązane.
ru: Оператор :keyword:`global` может использоваться для того, чтобы указать, что конкретные переменные находятся в глобальной области видимости и должны передаваться оттуда; оператор :keyword:`nonlocal` указывает, что конкретные переменные находятся во вложенной области видимости и должны передаваться из нее.

source: Scopes and Namespaces Example
fa: مثال محدوده ها و فضاهای نام
pl: Przykład zakresów i przestrzeni nazw
ru: Пример Области видимости и Пространства имен

source: This is an example demonstrating how to reference the different scopes and namespaces, and how :keyword:`global` and :keyword:`nonlocal` affect variable binding::
fa: این مثالی است که نشان می‌دهد چگونه به دامنه‌ها و فضاهای نام مختلف ارجاع داده شود و چگونه :keyword:`global` و :keyword:`nonlocal` بر اتصال متغیر تأثیر می‌گذارند:
pl: Oto przykład pokazujący, jak odwoływać się do różnych zakresów i przestrzeni nazw oraz jak :keyword:`global` i :keyword:`nonlocal` wpływają na wiązanie zmiennych::
ru: Вот демонстрация того, как ссылаться на разные области видимости и пространства имен, и как :keyword:`global` и :keyword:`nonlocal` влияют на связывание переменных::

source: def scope_test(): def do_local(): spam = "local spam" def do_nonlocal(): nonlocal spam spam = "nonlocal spam" def do_global(): global spam spam = "global spam" spam = "test spam" do_local() print("After local assignment:", spam) do_nonlocal() print("After nonlocal assignment:", spam) do_global() print("After global assignment:", spam) scope_test() print("In global scope:", spam)
pl: def scope_test(): def do_local(): spam = "lokalna konserwa" def do_nonlocal(): nonlocal spam spam = "nielokalna konserwa" def do_global(): global spam spam = "globalna konserwa" spam = "testowa konserwa" do_local() print("Po przypisaniu lokalnym:", spam) do_nonlocal() print("Po przypisaniu nielokalnym:", spam) do_global() print("Po przypisaniu globalnym:", spam) scope_test() print("W globalnym zakresie:", spam)

source: The output of the example code is:
fa: خروجی کد مثال به صورت زیر است:
pl: Wyjście przykładowego kodu to:
ru: При выполнении кода будет выведено следующее:

source: After local assignment: test spam After nonlocal assignment: nonlocal spam After global assignment: nonlocal spam In global scope: global spam
fa: پس از انتساب محلی: هرزنامه را آزمایش کنید پس از تخصیص غیر محلی: هرزنامه غیرمحلی پس از تخصیص جهانی: هرزنامه غیر محلی در حوزه جهانی: هرزنامه جهانی
pl: Po przypisaniu lokalnym: testowa konserwa Po przypisaniu nielokalnym: nielokalna konserwa Po przypisaniu globalnym: nielokalna konserwa W globalnym zakresie: globalna konserwa
ru: После локального задания: проверка спама После нелокального назначения: нелокальный спам После глобального назначения: нелокальный спам В глобальном масштабе: глобальный спам

source: Note how the *local* assignment (which is default) didn't change *scope_test*\'s binding of *spam*. The :keyword:`nonlocal` assignment changed *scope_test*\'s binding of *spam*, and the :keyword:`global` assignment changed the module-level binding.
fa: توجه داشته باشید که چگونه تخصیص *local* (که پیش‌فرض است) پیوند *scope_test* را تغییر نداد. تخصیص :keyword:`nonlocal` اتصال *scope_test* به *spam* را تغییر داد و تخصیص :keyword:`global` اتصال سطح ماژول را تغییر داد.
pl: Zauważ, że *lokalne* przypisanie (które jest domyślne) nie zmieniło wiązania *spam* w *scope_test*. Przypisanie :keyword:`nonlocal` zmieniło wiązanie *spam* w *scope_test*, a przypisanie :keyword:`global` zmieniło wiązanie na poziomie modułu.
ru: Заметьте, как *локальное* присваивание (используемое по умолчанию) не изменяет привязку имени *spam* в *scope_test*. С другой стороны, присванивание с использованием ключевого слова :keyword:`nonlocal` изменило привязку имени *spam* в *scope test*, и присваиванием с использованием :keyword:`global` изменяет (или создаёт) привязку на уровне модуля.

source: You can also see that there was no previous binding for *spam* before the :keyword:`global` assignment.
fa: همچنین می توانید ببینید که قبل از تخصیص :keyword:`global`، هیچ اتصال قبلی برای *spam* وجود نداشت.
pl: Można również zauważyć, że nie było wcześniejszego powiązania dla *spam* przed przypisaniem :keyword:`global`.
ru: Стоит заметить, что до присваивания *spam* с использованием :keyword:`global` создало новую привязку --- её раньше не было в области видимости модуля.

source: A First Look at Classes
fa: نگاه اول به کلاس ها
pl: Pierwsze spojrzenie na klasy
ru: Первый взгляд на классы

source: Classes introduce a little bit of new syntax, three new object types, and some new semantics.
fa: کلاس ها کمی نحو جدید، سه نوع شیء جدید و برخی از معناشناسی جدید را معرفی می کنند.
pl: Klasy wprowadzają trochę nowej składni, trzy nowe typy obiektów i trochę nowej semantyki.
ru: Классы привносят немного нового синтаксиса, три новых типа объектов и новую семантику.

source: Class Definition Syntax
fa: نحو تعریف کلاس
pl: Składnia definicji klasy
ru: Синтаксис определения класса

source: The simplest form of class definition looks like this::
fa: ساده ترین شکل تعریف کلاس به صورت زیر است:
pl: Najprostsza forma definicji klasy wygląda następująco::
ru: Самая простая форма определения класса выглядит так::

source: class ClassName: <statement-1> . . . <statement-N>
fa: نام کلاس: <statement-1> . . . <statement-N>
pl: class ClassName: <instrukcja-1> . . . <instrukcja-N>

source: Class definitions, like function definitions (:keyword:`def` statements) must be executed before they have any effect. (You could conceivably place a class definition in a branch of an :keyword:`if` statement, or inside a function.)
fa: تعاریف کلاس، مانند تعاریف تابع (عبارات :keyword:`def`) باید قبل از اینکه اثری داشته باشند، اجرا شوند. (شما می توانید یک تعریف کلاس را در شاخه ای از دستور :keyword:`if` یا داخل یک تابع قرار دهید.)
pl: Definicje klas, podobnie jak definicje funkcji (instrukcje :keyword:`def`), muszą zostać wykonane, zanim będą miały jakikolwiek efekt. (Można sobie wyobrazić umieszczenie definicji klasy w gałęzi instrukcji :keyword:`if` lub wewnątrz funkcji.)
ru: Определение класса, как и определение функции (инструкция :keyword:`def`) должно быть выполнено перед тем, как оно вступит в силу. (Можно поместить определение класса в ветку инструкции :keyword:`if` или внутри функции.)

source: In practice, the statements inside a class definition will usually be function definitions, but other statements are allowed, and sometimes useful --- we'll come back to this later. The function definitions inside a class normally have a peculiar form of argument list, dictated by the calling conventions for methods --- again, this is explained later.
fa: در عمل، عبارات داخل تعریف کلاس معمولاً تعاریف تابع هستند، اما عبارات دیگر مجاز هستند و گاهی اوقات مفید هستند --- بعداً به این موضوع باز خواهیم گشت. تعاریف تابع در داخل یک کلاس معمولاً یک شکل خاص از فهرست آرگومان دارند که توسط قراردادهای فراخوانی متدها دیکته می شود --- دوباره، این بعداً توضیح داده می شود.
pl: W praktyce, instrukcje wewnątrz definicji klasy będą zwykle definicjami funkcji, ale inne instrukcje są dozwolone, a czasem przydatne --- wrócimy do tego później. Definicje funkcji wewnątrz klasy zwykle mają specyficzną formę listy argumentów, podyktowaną konwencjami wywoływania metod --- ponownie, zostanie to wyjaśnione później.
ru: На практике инструкции внутри определения класса --- это определения функций, но другие инструкции там тоже возможны и бывают полезны --- мы вернёмся к этому позже. Определения функций внутри класса имеют особый список параметров, определённый соглашениями вызова методов --- это тоже будет объяснено позже.

source: When a class definition is entered, a new namespace is created, and used as the local scope --- thus, all assignments to local variables go into this new namespace. In particular, function definitions bind the name of the new function here.
fa: هنگامی که یک تعریف کلاس وارد می شود، یک فضای نام جدید ایجاد می شود، و به عنوان محدوده محلی استفاده می شود --- بنابراین، تمام انتساب به متغیرهای محلی به این فضای نام جدید می رود. به طور خاص، تعاریف تابع نام تابع جدید را در اینجا پیوند می دهد.
pl: Po wejściu w definicję klasy tworzona jest nowa przestrzeń nazw i używana jako zakres lokalny --- a zatem wszystkie przypisania do zmiennych lokalnych trafiają do tej nowej przestrzeni nazw. W szczególności, definicje funkcji wiążą nazwę nowej funkcji w tej przestrzeni nazw.
ru: При входе в определение класса создаётся новое пространство имён, и оно используется в качестве локального. Поэтому все операции присваивания к локальным переменнам будут направлены в это новое пространство имён. В частности, определения функций привяжут функции к их именам именно в этом пространстве имён.

source: When a class definition is left normally (via the end), a *class object* is created. This is basically a wrapper around the contents of the namespace created by the class definition; we'll learn more about class objects in the next section. The original local scope (the one in effect just before the class definition was entered) is reinstated, and the class object is bound here to the class name given in the class definition header (:class:`!ClassName` in the example).
fa: هنگامی که یک تعریف کلاس به طور معمول (از طریق انتهای) باقی می ماند، یک *class object* ایجاد می شود. این اساساً یک بسته بندی در اطراف محتویات فضای نام ایجاد شده توسط تعریف کلاس است. در بخش بعدی در مورد اشیاء کلاس بیشتر خواهیم آموخت. محدوده محلی اصلی (محدوده ای که درست قبل از وارد کردن تعریف کلاس وجود داشت) بازیابی می شود، و شی کلاس در اینجا به نام کلاس ارائه شده در هدر تعریف کلاس (:class:`!ClassName` در مثال) محدود می شود.
pl: Kiedy definicja klasy jest opuszczana normalnie (przez koniec), tworzony jest *obiekt klasy*. Jest to w zasadzie opakowanie wokół zawartości przestrzeni nazw utworzonej przez definicję klasy; dowiemy się więcej o obiektach klas w następnej sekcji. Oryginalny zakres lokalny (ten, który obowiązywał tuż przed wprowadzeniem definicji klasy) zostaje przywrócony, a obiekt klasy jest powiązany z nazwą klasy podaną w nagłówku definicja klasy (:class:`!ClassName` w przykładzie).
ru: Когда определение класса обычно заканчивается (через конец), создается *объект класса*. По сути, это оболочка содержимого пространства имен, созданного определением класса; мы узнаем больше об объектах классов в следующем разделе. Исходная локальная область действия (которая действовала непосредственно перед вводом определения класса) восстанавливается, и объект класса привязывается здесь к имени класса, указанному в заголовке определения класса (:class:`!ClassName` в примере).

source: Class Objects
fa: اشیاء کلاس
pl: Obiekty klas
ru: Классы
