Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/tutorial/classes.po
Languages: fa, pl, ru

source: >>> class Warehouse: ... purpose = 'storage' ... region = 'west' ... >>> w1 = Warehouse() >>> print(w1.purpose, w1.region) storage west >>> w2 = Warehouse() >>> w2.region = 'east' >>> print(w2.purpose, w2.region) storage east
fa: >>> انبار کلاس: ... هدف = "ذخیره سازی" ... منطقه = "غرب" ... >>> w1 = انبار() >>> چاپ (w1.purpose, w1.region) انباری غرب >>> w2 = انبار() >>> w2.region = 'شرق' >>> چاپ (w2.purpose, w2.region) ذخیره سازی شرق
pl: >>> class Magazyn: ... cel = 'przechowywanie' ... region = 'zachód' ... >>> m1 = Magazyn() >>> print(m1.cel, m1.region) przechowywanie zachód >>> m2 = Magazyn() >>> m2.region = 'wschód' >>> print(m2.cel, m2.region) przechowywanie wschód

source: Data attributes may be referenced by methods as well as by ordinary users ("clients") of an object. In other words, classes are not usable to implement pure abstract data types. In fact, nothing in Python makes it possible to enforce data hiding --- it is all based upon convention. (On the other hand, the Python implementation, written in C, can completely hide implementation details and control access to an object if necessary; this can be used by extensions to Python written in C.)
fa: ویژگی های داده ممکن است توسط روش ها و همچنین توسط کاربران عادی ("مشتریان") یک شی ارجاع داده شوند. به عبارت دیگر، کلاس ها برای پیاده سازی انواع داده های انتزاعی خالص قابل استفاده نیستند. در واقع، هیچ چیز در پایتون امکان اعمال مخفی کردن داده ها را فراهم نمی کند --- همه اینها بر اساس قرارداد است. (از سوی دیگر, پیاده‌سازی پایتون که به زبان C نوشته شده است, می‌تواند جزئیات پیاده‌سازی را کاملاً مخفی کند و در صورت لزوم دسترسی به یک شی را کنترل کند؛ این می‌تواند توسط پسوندهای پایتون نوشته شده در C استفاده شود.)
pl: Do danych atrybut mogą odwoływać się zarówno metody, jak i zwykli użytkownicy ("klienci") obiektu. Innymi słowy, klasy nie nadają się do implementacji czysto abstrakcyjnych typów danych. W rzeczywistości nic w Python nie umożliwia wymuszenia ukrywania danych --- wszystko opiera się na konwencji. (Z drugiej strony, implementacja Python, napisana w C, może całkowicie ukryć szczegóły implementacji i kontrolować dostęp do obiektu, jeśli to konieczne; może to być wykorzystane przez rozszerzenia Python napisane w C).
ru: Атрибуты данных могут быть доступны как из методов, так и извне. Иными словами, с помощью классов нельзя создать чистые абстрактные типы данных. В Python нет инструментов для сокрытия данных --- внутренняя реализация объектов защищена от доступа только по договорённости. (Однако объекты, привнесённые в Python из расширений на C, могут скрывать все детали имплементации и контролировать доступ к объекту, елси нужно).

source: Clients should use data attributes with care --- clients may mess up invariants maintained by the methods by stamping on their data attributes. Note that clients may add data attributes of their own to an instance object without affecting the validity of the methods, as long as name conflicts are avoided --- again, a naming convention can save a lot of headaches here.
fa: مشتریان باید با احتیاط از ویژگی های داده استفاده کنند --- مشتریان ممکن است با مهر زدن بر روی ویژگی های داده خود، متغیرهای حفظ شده توسط روش ها را خراب کنند. توجه داشته باشید که کلاینت‌ها ممکن است ویژگی‌های داده خود را به یک شیء نمونه اضافه کنند، بدون اینکه بر اعتبار روش‌ها تأثیر بگذارد، تا زمانی که از تضاد نام اجتناب شود --- باز هم، یک قرارداد نام‌گذاری می‌تواند در اینجا سردردهای زیادی را نجات دهد.
pl: Klienci powinni używać danych atrybut z ostrożnością --- klienci mogą zepsuć niezmienniki utrzymywane przez metody poprzez stemplowanie ich danych atrybut. Należy pamiętać, że klienci mogą dodawać własne dane atrybut do obiektu instancji bez wpływu na ważność metod, o ile unika się konfliktów nazw --- ponownie, konwencja nazewnictwa może tutaj zaoszczędzić wiele problemow.
ru: Пользователи объектов должны обращаться к атрибутам с данными осторожно, так как они могут нарушить инварианты, сохраняемые внутри класса. Пользователи могут добавлять свои атрибуты с данными вдобавок к существующим у экземпляра, не нарушая работоспособность методов экземпляра, если избегать конфликтов имён. Тут также поможет договорённость об именовании атрибутов.

source: There is no shorthand for referencing data attributes (or other methods!) from within methods. I find that this actually increases the readability of methods: there is no chance of confusing local variables and instance variables when glancing through a method.
fa: هیچ مختصری برای ارجاع ویژگی های داده (یا روش های دیگر!) از درون متدها وجود ندارد. من متوجه شدم که این در واقع خوانایی روش ها را افزایش می دهد: هیچ شانسی برای اشتباه گرفتن متغیرهای محلی و متغیرهای نمونه در هنگام نگاه کردن به یک روش وجود ندارد.
pl: Nie ma skrótu do odwoływania się do danych atrybut (lub innych metod!) z poziomu metod. Uważam, że w rzeczywistości zwiększa to czytelność metod: nie ma szans na pomylenie zmiennych lokalnych i zmiennych instancji podczas przeglądania metody.
ru: Краткой записи для обращения к данным или методам экземпляра изнутри метода в Python нет. Как мне кажется, это улучшает читаемость методов: невозможно перепутать локальную переменную с переменной экземпляра, если пробежаться взглядом по методу.

source: Often, the first argument of a method is called ``self``. This is nothing more than a convention: the name ``self`` has absolutely no special meaning to Python. Note, however, that by not following the convention your code may be less readable to other Python programmers, and it is also conceivable that a *class browser* program might be written that relies upon such a convention.
fa: اغلب، اولین آرگومان یک متد ``self`` نامیده می شود. این چیزی بیش از یک قرارداد نیست: نام ``self`` مطلقاً معنای خاصی برای پایتون ندارد. البته توجه داشته باشید که با رعایت نکردن قرارداد ممکن است کد شما برای سایر برنامه نویسان پایتون کمتر قابل خواندن باشد و همچنین می توان تصور کرد که یک برنامه *class browser* ممکن است نوشته شود که بر چنین قراردادی متکی باشد.
pl: Często pierwsza argument metody jest nazywana ``self``. Jest to nic więcej niż konwencja: nazwa ``self`` nie ma absolutnie żadnego specjalnego znaczenia dla Python. Należy jednak pamiętać, że nieprzestrzeganie tej konwencji może sprawić, że kod będzie mniej czytelny dla innych programistów Python, a także możliwe jest napisanie programu *przeglądarki klas*, który opiera się na takiej konwencji.
ru: Первый аргумент метода часто называют ``self``. Это всего лишь общепринятая договорённость: ``self`` --- не ключевое слово и не имеет особого значения. Однако учтите, что при использовании другого имени можно запутать читателей вашего кода или автоматические анализаторы кода.

source: Any function object that is a class attribute defines a method for instances of that class. It is not necessary that the function definition is textually enclosed in the class definition: assigning a function object to a local variable in the class is also ok. For example::
fa: هر شیء تابعی که یک ویژگی کلاس است، متدی را برای نمونه هایی از آن کلاس تعریف می کند. لزومی ندارد که تعریف تابع به صورت متنی در تعریف کلاس باشد: تخصیص یک شی تابع به یک متغیر محلی در کلاس نیز مشکلی ندارد. به عنوان مثال::
pl: Każdy obiekt funkcja będący klasą atrybut definiuje metodę dla instancji tej klasy. Nie jest konieczne, aby definicja funkcja była tekstowo zawarta w definicja klasy: przypisanie obiektu funkcja do zmiennej lokalnej w klasie jest również w porządku. Na przykład::
ru: Любая функция, хранящаяся в качестве атрибута у класса, определяет метод для экземпляров этого класса. Само определение функции может быть размещено вне класса: присвоение функции к локальной переменной внутри класса делает то же самое. Например::

source: # Function defined outside the class def f1(self, x, y): return min(x, x+y) class C: f = f1 def g(self): return 'hello world' h = g
pl: # funkcja zdefiniowane poza klasą def f1(self, x, y): return min(x, x+y) class C: f = f1 def g(self): return 'hello world' h = g

source: Now ``f``, ``g`` and ``h`` are all attributes of class :class:`!C` that refer to function objects, and consequently they are all methods of instances of :class:`!C` --- ``h`` being exactly equivalent to ``g``. Note that this practice usually only serves to confuse the reader of a program.
fa: اکنون ``f``، ``g`` و ``h`` همگی ویژگی‌های کلاس :class:`!C` هستند که به اشیاء تابع اشاره می‌کنند، و در نتیجه همه روش‌هایی هستند که نمونه‌هایی از :class:`!C` --- ``h`` دقیقاً معادل ``g`` هستند. توجه داشته باشید که این عمل معمولا فقط باعث سردرگمی خواننده یک برنامه می شود.
pl: Teraz ``f``, ``g`` i ``h`` są wszystkie atrybut klasy :class:`!C`, które odnoszą się do obiektów funkcja, a w konsekwencji wszystkie są metodami instancji :class:`!C` --- ``h`` jest dokładnie równoważne ``g``. Zauważ, że ta praktyka zwykle służy jedynie do zmylenia czytelnika programu.
ru: Теперь ``f``, ``g`` и ``h`` являются атрибутами класса :class:`!C`, которые ссылаются на функциональные объекты, и, следовательно, все они являются методами экземпляров :class:`! C` --- ``h`` в точности эквивалентен ``g``. Обратите внимание, что такая практика обычно служит только для того, чтобы запутать читателя программы.

source: Methods may call other methods by using method attributes of the ``self`` argument::
fa: متدها ممکن است با استفاده از ویژگی های متد آرگومان ``self`` متدهای دیگر را فراخوانی کنند:
pl: Metody mogą wywoływać inne metody przy użyciu metody atrybut z ``self`` argument ::
ru: Методы могут вызывать другие методы того же экземпляра, используя аргумент ``self``::

source: class Bag: def __init__(self): self.data = [] def add(self, x): self.data.append(x) def addtwice(self, x): self.add(x) self.add(x)
pl: class Torba: def __init__(self): self.dane = [] def dodac(self, x): self.dane.append(x) def dodacDwaRazy(self, x): self.dodac(x) self.dodac(x)

source: Methods may reference global names in the same way as ordinary functions. The global scope associated with a method is the module containing its definition. (A class is never used as a global scope.) While one rarely encounters a good reason for using global data in a method, there are many legitimate uses of the global scope: for one thing, functions and modules imported into the global scope can be used by methods, as well as functions and classes defined in it. Usually, the class containing the method is itself defined in this global scope, and in the next section we'll find some good reasons why a method would want to reference its own class.
fa: متدها ممکن است مانند توابع معمولی به نام های سراسری ارجاع دهند. دامنه جهانی مرتبط با یک روش، ماژول حاوی تعریف آن است. (یک کلاس هرگز به عنوان یک دامنه جهانی استفاده نمی شود.) در حالی که به ندرت با دلیل موجهی برای استفاده از داده های سراسری در یک متد مواجه می شوید، استفاده های قانونی زیادی از دامنه جهانی وجود دارد: برای یک چیز، توابع و ماژول های وارد شده به دامنه جهانی را می توان توسط روش ها و همچنین توابع و کلاس های تعریف شده در آن استفاده کرد. معمولاً کلاسی که متد را در بر می گیرد، خود در این محدوده جهانی تعریف می شود، و در بخش بعدی دلایل خوبی برای اینکه یک متد بخواهد به کلاس خود ارجاع دهد، خواهیم یافت.
pl: Metody mogą odwoływać się do nazw globalnych w taki sam sposób jak zwykłe funkcje. Zakres globalny powiązany z metodą to moduł zawierający jej definicję. (Klasa nigdy nie jest używana jako zakres globalny.) Podczas gdy rzadko można napotkać dobry powód do używania danych globalnych w metodzie, istnieje wiele uzasadnionych zastosowań zakresu globalnego: po pierwsze, funkcja i moduł importowane do zakresu globalnego mogą być używane przez metody, a także funkcja i klasy w nim zdefiniowane. Zazwyczaj klasa zawierająca metodę sama jest zdefiniowana w tym globalnym zakresie, a w następnej sekcji znajdziemy kilka dobrych powodów, dla których metoda chciałaby odwoływać się do własnej klasy.
ru: Методы, как и обычные функции, могут ссылаться на глобальные переменные. Глобальная область видимости для метода --- это модуль, который содержит определение метода. (Класс никогда не становится глобальной областью видимости.) Очень редко есть хороший повод манипулировать глобальными данными, но глобальную область видимости можон использовать разумно по другим причинам: например, для доступа к глобальным функциям и классам, импортированным модулям. Обычно класс, содержащий данный метод, и сам определён в глобальной области видимости, и в следующем разделе мы узнаем, зачем методу может потребоваться сослаться на класс, где он определён.

source: Each value is an object, and therefore has a *class* (also called its *type*). It is stored as ``object.__class__``.
fa: هر مقدار یک شی است و بنابراین دارای یک *class* است (که *type* آن نیز نامیده می شود). به عنوان ``object.__class__`` ذخیره می شود.
pl: Każda wartość jest obiektem, a zatem ma *klasę* (zwaną również *typem*). Jest ona przechowywana jako ``object.__class__``.
ru: Любое значение в Python --- это объект, а значит относится к какому-то *классу* (который также называется его типом). Его можно получить как ``объект.__class__``.

source: Inheritance
fa: ارث
pl: Dziedziczenie
ru: Наследование

source: Of course, a language feature would not be worthy of the name "class" without supporting inheritance. The syntax for a derived class definition looks like this::
fa: البته، یک ویژگی زبان بدون پشتیبانی از وراثت شایسته نام "کلاس" نخواهد بود. نحو برای تعریف کلاس مشتق شده به صورت زیر است:
pl: Oczywiście funkcja językowa nie byłaby godna nazwy "klasa" bez obsługi dziedziczenia. Składnia pochodnej definicja klasy wygląda tak::
ru: Классы поддерживают *наследование*. Определение дочернего класса выглядит так::

source: The name :class:`!BaseClassName` must be defined in a namespace accessible from the scope containing the derived class definition. In place of a base class name, other arbitrary expressions are also allowed. This can be useful, for example, when the base class is defined in another module::
fa: نام :class:`!BaseClassName` باید در یک فضای نام قابل دسترسی از محدوده حاوی تعریف کلاس مشتق شده تعریف شود. به جای نام کلاس پایه، عبارات دلخواه دیگری نیز مجاز هستند. این می تواند مفید باشد، برای مثال، زمانی که کلاس پایه در ماژول دیگری تعریف شده است::
pl: Nazwa :class:`!BaseClassName` musi być zdefiniowana w przestrzeni nazw dostępnej z zakresu zawierającego pochodną definicja klasy. Zamiast nazwy klasa bazowa dozwolone są również inne dowolne wyrażenia. Może to być przydatne, na przykład, gdy klasa bazowa jest zdefiniowany w innym moduł::
ru: Имя :class:`!BaseClassName` должно быть определено в пространстве имен, доступном из области, содержащей определение производного класса. Вместо имени базового класса допускаются также другие произвольные выражения. Это может быть полезно, например, когда базовый класс определен в другом модуле:

source: Execution of a derived class definition proceeds the same as for a base class. When the class object is constructed, the base class is remembered. This is used for resolving attribute references: if a requested attribute is not found in the class, the search proceeds to look in the base class. This rule is applied recursively if the base class itself is derived from some other class.
fa: اجرای تعریف کلاس مشتق شده مانند کلاس پایه پیش می رود. هنگامی که شی کلاس ساخته می شود، کلاس پایه به خاطر سپرده می شود. این برای حل و فصل ارجاعات ویژگی استفاده می شود: اگر ویژگی درخواستی در کلاس یافت نشد، جستجو برای جستجو در کلاس پایه ادامه می یابد. اگر خود کلاس پایه از کلاس دیگری مشتق شده باشد، این قانون به صورت بازگشتی اعمال می شود.
pl: Wykonanie pochodnej definicja klasy przebiega tak samo, jak w przypadku klasa bazowa. Gdy konstruowany jest obiekt klasy, zapamiętywany jest klasa bazowa. Jest to wykorzystywane do rozwiązywania referencji atrybut: jeśli żądany atrybut nie zostanie znaleziony w klasie, wyszukiwanie jest kontynuowane w klasie bazowej. Ta reguła jest stosowana rekurencyjnie, jeśli sama klasa bazowa jest pochodną innej klasy.
ru: Определение дочернего класса выполняется так же, как и определение класса без родителей. Когда объект класса создаётся, он запоминает своего родителя. Это будет использоваться для разршения ссылок на атрибуты: если запрашиваемый атрибут не найден в классе, его поиск продолжится у родителя. Это правило применяется до тех пор, пока атрибут не будет найден (или пока цепочка наследования не закончится).

source: There's nothing special about instantiation of derived classes: ``DerivedClassName()`` creates a new instance of the class. Method references are resolved as follows: the corresponding class attribute is searched, descending down the chain of base classes if necessary, and the method reference is valid if this yields a function object.
fa: هیچ چیز خاصی در مورد نمونه سازی کلاس های مشتق شده وجود ندارد: ``DerivedClassName()`` یک نمونه جدید از کلاس ایجاد می کند. ارجاعات روش به صورت زیر حل می‌شوند: ویژگی کلاس مربوطه جستجو می‌شود، در صورت لزوم از زنجیره کلاس‌های پایه پایین می‌آید، و مرجع متد در صورتی معتبر است که یک شی تابع را به دست آورد.
pl: Nie ma nic specjalnego w instancjonowaniu klas pochodnych: ``DerivedClassName()`` tworzy nową instancję klasy. Odniesienia do metod są rozwiązywane w następujący sposób: odpowiednia klasa atrybut jest przeszukiwana, w razie potrzeby schodząc w dół łańcucha klas bazowych, a odniesienie do metody jest ważne, jeśli daje to obiekt funkcja.
ru: В создании экземпляров производных классов нет ничего особенного: DerivedClassName() создает новый экземпляр класса. Ссылки на методы разрешаются следующим образом: выполняется поиск соответствующего атрибута класса, при необходимости спускаясь вниз по цепочке базовых классов, и ссылка на метод действительна, если она дает объект функции.

source: Derived classes may override methods of their base classes. Because methods have no special privileges when calling other methods of the same object, a method of a base class that calls another method defined in the same base class may end up calling a method of a derived class that overrides it. (For C++ programmers: all methods in Python are effectively ``virtual``.)
fa: کلاس های مشتق شده ممکن است روش های کلاس های پایه خود را لغو کنند. از آنجایی که متدها هنگام فراخوانی متدهای دیگر یک شی، امتیاز خاصی ندارند، متدی از یک کلاس پایه که متد دیگری را که در همان کلاس پایه تعریف شده است فراخوانی می‌کند، ممکن است در نهایت متدی از یک کلاس مشتق شده را فراخوانی کند که آن را لغو می‌کند. (برای برنامه نویسان ++C: همه روش ها در پایتون به طور موثر ``virtual`` هستند.)
pl: Klasy pochodne mogą nadpisywać metody swoich klas bazowych. Ponieważ metody nie mają specjalnych przywilejów podczas wywoływania innych metod tego samego obiektu, metoda klasa bazowa, która wywołuje inną metodę zdefiniowaną w tym samym klasa bazowa może skończyć się wywołaniem metody klasy pochodnej, która ją nadpisuje. (Dla programistów C++: wszystkie metody w Python są efektywnie ``virtual``).
ru: Производные классы могут переопределять методы своих базовых классов. Поскольку методы не имеют специальных привилегий при вызове других методов того же объекта, метод базового класса, который вызывает другой метод, определенный в том же базовом классе, может в конечном итоге вызвать метод производного класса, который переопределяет его. (Для программистов C++: все методы Python фактически являются виртуальными.)

source: An overriding method in a derived class may in fact want to extend rather than simply replace the base class method of the same name. There is a simple way to call the base class method directly: just call ``BaseClassName.methodname(self, arguments)``. This is occasionally useful to clients as well. (Note that this only works if the base class is accessible as ``BaseClassName`` in the global scope.)
fa: یک متد overriding در یک کلاس مشتق شده ممکن است در واقع بخواهد به جای جایگزینی ساده متد کلاس پایه با همان نام، گسترش یابد. یک راه ساده برای فراخوانی مستقیم متد کلاس پایه وجود دارد: فقط ``BaseClassName.methodname(self, arguments)`` را فراخوانی کنید. این گاهی اوقات برای مشتریان نیز مفید است. (توجه داشته باشید که این فقط در صورتی کار می کند که کلاس پایه به عنوان ``BaseClassName`` در محدوده جهانی قابل دسترسی باشد.)
pl: Metoda nadrzędna w klasie pochodnej może w rzeczywistości chcieć rozszerzyć, a nie tylko zastąpić metodę klasa bazowa o tej samej nazwie. Istnieje prosty sposób na bezpośrednie wywołanie metody klasa bazowa: wystarczy wywołać ``BaseClassName.methodname(self, arguments)``. Jest to czasami przydatne również dla klientów. (Należy pamiętać, że działa to tylko wtedy, gdy klasa bazowa jest dostępna jako ``BaseClassName`` w zakresie globalnym).
ru: На самом деле переопределяющий метод в производном классе может расширять, а не просто заменять одноименный метод базового класса. Существует простой способ вызвать метод базового класса напрямую: просто вызовите ``BaseClassName.methodname(self, аргументы)``. Иногда это бывает полезно и для клиентов. (Обратите внимание, что это работает только в том случае, если базовый класс доступен как ``BaseClassName`` в глобальной области видимости.)

source: Python has two built-in functions that work with inheritance:
fa: پایتون دو تابع داخلی دارد که با وراثت کار می کنند:
pl: Python ma dwa wbudowane funkcje, które pracuja z dziedziczeniem:
ru: Python имеет две встроенные функции, которые работают с наследованием:

source: Use :func:`isinstance` to check an instance's type: ``isinstance(obj, int)`` will be ``True`` only if ``obj.__class__`` is :class:`int` or some class derived from :class:`int`.
fa: از :func:`isinstance` برای بررسی نوع نمونه استفاده کنید: ``isinstance(obj, int)`` فقط در صورتی ``True`` خواهد بود که ``obj.__class__`` :class:`int` یا کلاسی مشتق شده از :class:`int` باشد.
pl: Użyj :func:`isinstance` do sprawdzenia typu instancji: ``isinstance(obj, int)`` będzie ``True`` tylko wtedy, gdy ``obj.__class__`` jest :class:`int` lub jakąś klasą pochodną od :class:`int`.
ru: Используйте :func:`isinstance` для проверки типа экземпляра: ``isinstance(obj, int)`` будет ``True``, только если ``obj.__class__`` имеет значение :class:`int` или какой-либо производный класс из :class:`int`.

source: Use :func:`issubclass` to check class inheritance: ``issubclass(bool, int)`` is ``True`` since :class:`bool` is a subclass of :class:`int`. However, ``issubclass(float, int)`` is ``False`` since :class:`float` is not a subclass of :class:`int`.
fa: از :func:`issubclass` برای بررسی وراثت کلاس استفاده کنید: ``issubclass(bool, int)`` ``True`` است زیرا :class:`bool` زیر کلاس :class:`int` است. با این حال، ``issubclass(float, int)`` ``False`` است زیرا :class:`float` زیر کلاس :class:`int` نیست.
pl: Użyj :func:`issubclass` do sprawdzenia dziedziczenia klas: ``issubclass(bool, int)`` jest ``True``, ponieważ :class:`bool` jest podklasa z :class:`int`. Jednak ``issubclass(float, int)`` jest ``False``, ponieważ :class:`float` nie jest podklasa z :class:`int`.
ru: Используйте :func:`issubclass` для проверки наследования классов: ``issubclass(bool, int)`` имеет значение ``True``, поскольку :class:`bool` является подклассом :class:`int`. Однако ``issubclass(float, int)`` имеет значение ``False``, поскольку :class:`float` не является подклассом :class:`int`.

source: Multiple Inheritance
fa: ارث چندگانه
pl: Dziedziczenie wielokrotne
ru: Множественное наследование

source: Python supports a form of multiple inheritance as well. A class definition with multiple base classes looks like this::
fa: پایتون از فرمی از وراثت چندگانه نیز پشتیبانی می کند. یک تعریف کلاس با چندین کلاس پایه به صورت زیر است:
pl: Python obsługuje również dziedziczenie wielokrotne. Strona definicja klasy z wieloma klasami bazowymi wygląda tak::
ru: Python также поддерживает форму множественного наследования. Определение класса с несколькими базовыми классами выглядит следующим образом:

source: class DerivedClassName(Base1, Base2, Base3): <statement-1> . . . <statement-N>
pl: class NazwaKlasyPochodnej(Baza1, Baza2, Baza3): <statement-1> . . . <statement-N>
