Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/tutorial/controlflow.po
Languages: fa

source: The first statement of the function body can optionally be a string literal; this string literal is the function's documentation string, or :dfn:`docstring`. (More about docstrings can be found in the section :ref:`tut-docstrings`.) There are tools which use docstrings to automatically produce online or printed documentation, or to let the user interactively browse through code; it's good practice to include docstrings in code that you write, so make a habit of it.
fa: اولین دستور بدن تابع به صورت اختیاری می تواند یک رشته واقعی باشد. این رشته تحت اللفظی رشته مستندات تابع یا :dfn:`docstring` است. (اطلاعات بیشتر در مورد رشته‌های اسناد را می‌توانید در بخش :ref:`tut-docstrings` بیابید.) ابزارهایی وجود دارند که از رشته‌های اسنادی برای تولید خودکار اسناد آنلاین یا چاپی استفاده می‌کنند، یا به کاربر اجازه می‌دهند به صورت تعاملی کد را مرور کنند. این تمرین خوبی است که رشته‌های docstrings را در کدهایی که می‌نویسید قرار دهید، بنابراین عادت کنید.

source: The *execution* of a function introduces a new symbol table used for the local variables of the function. More precisely, all variable assignments in a function store the value in the local symbol table; whereas variable references first look in the local symbol table, then in the local symbol tables of enclosing functions, then in the global symbol table, and finally in the table of built-in names. Thus, global variables and variables of enclosing functions cannot be directly assigned a value within a function (unless, for global variables, named in a :keyword:`global` statement, or, for variables of enclosing functions, named in a :keyword:`nonlocal` statement), although they may be referenced.
fa: *execution* یک تابع یک جدول نماد جدید را معرفی می کند که برای متغیرهای محلی تابع استفاده می شود. به‌طور دقیق‌تر، همه تخصیص‌های متغیر در یک تابع، مقدار را در جدول نمادهای محلی ذخیره می‌کنند. در حالی که مراجع متغیر ابتدا در جدول نمادهای محلی، سپس در جداول نمادهای محلی توابع محصور، سپس در جدول نمادهای سراسری، و در نهایت در جدول نام‌های داخلی نگاه می‌کنند. بنابراین، متغیرهای سراسری و متغیرهای توابع محصور را نمی‌توان مستقیماً یک مقدار در یک تابع اختصاص داد (مگر اینکه برای متغیرهای سراسری, نام‌گذاری شده در یک دستور :keyword:`global`, یا برای متغیرهای توابع محصور, در یک عبارت :keyword:`nonlocal` نامگذاری شده باشد), اگرچه ممکن است به آنها ارجاع داده شود.

source: The actual parameters (arguments) to a function call are introduced in the local symbol table of the called function when it is called; thus, arguments are passed using *call by value* (where the *value* is always an object *reference*, not the value of the object). [#]_ When a function calls another function, or calls itself recursively, a new local symbol table is created for that call.
fa: هنگام فراخوانی تابع فراخوانی، پارامترهای واقعی (آگومان ها) در جدول نمادهای محلی تابع فراخوانی شده معرفی می شوند. بنابراین، آرگومان ها با استفاده از *call by value* ارسال می شوند (که در آن *value* همیشه یک شی *reference* است, نه مقدار شی). [#]_ وقتی یک تابع تابع دیگری را فراخوانی می کند، یا خود را به صورت بازگشتی فرا می خواند، یک جدول نماد محلی جدید برای آن فراخوانی ایجاد می شود.

source: A function definition associates the function name with the function object in the current symbol table. The interpreter recognizes the object pointed to by that name as a user-defined function. Other names can also point to that same function object and can also be used to access the function::
fa: یک تعریف تابع نام تابع را با شی تابع در جدول نماد فعلی مرتبط می کند. مفسر شی مورد اشاره با آن نام را به عنوان یک تابع تعریف شده توسط کاربر تشخیص می دهد. نام های دیگر نیز می توانند به همان شی تابع اشاره کنند و همچنین می توانند برای دسترسی به تابع استفاده شوند:

source: >>> fib <function fib at 10042ed0> >>> f = fib >>> f(100) 0 1 1 2 3 5 8 13 21 34 55 89
fa: >>> فیب <function fib در 10042ed0> >>> f = فیب >>> f(100) 0 1 1 2 3 5 8 13 21 34 55 89

source: Coming from other languages, you might object that ``fib`` is not a function but a procedure since it doesn't return a value. In fact, even functions without a :keyword:`return` statement do return a value, albeit a rather boring one. This value is called ``None`` (it's a built-in name). Writing the value ``None`` is normally suppressed by the interpreter if it would be the only value written. You can see it if you really want to using :func:`print`::
fa: از زبان های دیگر، ممکن است اعتراض کنید که ``fib`` یک تابع نیست بلکه یک رویه است زیرا مقداری را بر نمی گرداند. در واقع، حتی توابع بدون دستور :keyword:`return`، مقداری را برمی‌گردانند، البته نسبتاً خسته کننده. این مقدار ``None`` نامیده می شود (این یک نام داخلی است). نوشتن مقدار ``None`` معمولاً توسط مفسر سرکوب می شود اگر تنها مقدار نوشته شده باشد. اگر واقعاً می خواهید از :func:`print` استفاده کنید، می توانید آن را ببینید::

source: It is simple to write a function that returns a list of the numbers of the Fibonacci series, instead of printing it::
fa: نوشتن تابعی که لیستی از اعداد سری فیبوناچی را برمی گرداند، به جای چاپ کردن، ساده است:

source: This example, as usual, demonstrates some new Python features:
fa: این مثال، طبق معمول، برخی از ویژگی های جدید پایتون را نشان می دهد:

source: The :keyword:`return` statement returns with a value from a function. :keyword:`!return` without an expression argument returns ``None``. Falling off the end of a function also returns ``None``.
fa: دستور :keyword:`return` با مقداری از یک تابع برمی گردد. :keyword:`!return` بدون آرگومان عبارت ``None`` را برمی گرداند. افتادن انتهای یک تابع نیز ``None`` را برمی گرداند.

source: The statement ``result.append(a)`` calls a *method* of the list object ``result``. A method is a function that 'belongs' to an object and is named ``obj.methodname``, where ``obj`` is some object (this may be an expression), and ``methodname`` is the name of a method that is defined by the object's type. Different types define different methods. Methods of different types may have the same name without causing ambiguity. (It is possible to define your own object types and methods, using *classes*, see :ref:`tut-classes`) The method :meth:`!append` shown in the example is defined for list objects; it adds a new element at the end of the list. In this example it is equivalent to ``result = result + [a]``, but more efficient.
fa: عبارت ``result.append(a)`` یک *method* از شیء لیست را ``result`` فراخوانی می کند. متد تابعی است که به یک شی تعلق دارد و نام آن ``obj.methodname`` است، که در آن ``obj`` یک شی است (این ممکن است یک عبارت باشد), و ``methodname`` نام روشی است که با نوع شی تعریف می شود. انواع مختلف روش های مختلفی را تعریف می کنند. روش های انواع مختلف ممکن است بدون ایجاد ابهام، نام یکسانی داشته باشند. (این امکان وجود دارد که انواع شی و روش های خود را با استفاده از *classes* تعریف کنید, به :ref:`tut-classes` مراجعه کنید) روش :meth:`!append` نشان داده شده در مثال برای اشیاء لیست تعریف شده است. یک عنصر جدید در انتهای لیست اضافه می کند. در این مثال معادل ``result = result + [a]`` است، اما کارآمدتر است.

source: More on Defining Functions
fa: بیشتر در مورد تعریف توابع

source: It is also possible to define functions with a variable number of arguments. There are three forms, which can be combined.
fa: همچنین امکان تعریف توابع با تعداد متغیر آرگومان وجود دارد. سه شکل وجود دارد که می توان آنها را با هم ترکیب کرد.

source: Default Argument Values
fa: مقادیر آرگومان پیش فرض

source: The most useful form is to specify a default value for one or more arguments. This creates a function that can be called with fewer arguments than it is defined to allow. For example::
fa: مفیدترین شکل، تعیین یک مقدار پیش فرض برای یک یا چند آرگومان است. این تابعی را ایجاد می‌کند که می‌توان آن را با آرگومان‌های کمتری فراخوانی کرد. به عنوان مثال::

source: This function can be called in several ways:
fa: این تابع را می توان به چند روش فراخوانی کرد:

source: giving only the mandatory argument: ``ask_ok('Do you really want to quit?')``
fa: فقط آرگومان اجباری را ارائه می دهد: ``ask_ok('Do you really want to quit?')``

source: giving one of the optional arguments: ``ask_ok('OK to overwrite the file?', 2)``
fa: ارائه یکی از آرگومان های اختیاری: ``ask_ok('OK to overwrite the file?', 2)``

source: or even giving all arguments: ``ask_ok('OK to overwrite the file?', 2, 'Come on, only yes or no!')``
fa: یا حتی ارائه تمام آرگومان ها: ``ask_ok('OK to overwrite the file?', 2, 'Come on, only yes or no!')``

source: This example also introduces the :keyword:`in` keyword. This tests whether or not a sequence contains a certain value.
fa: این مثال همچنین کلمه کلیدی :keyword:`in` را معرفی می کند. این آزمایش می کند که آیا یک دنباله دارای مقدار خاصی است یا خیر.

source: The default values are evaluated at the point of function definition in the *defining* scope, so that ::
fa: مقادیر پیش فرض در نقطه تعریف تابع در محدوده *defining* ارزیابی می شوند، به طوری که::

source: will print ``5``.
fa: ``5`` را چاپ خواهد کرد.

source: **Important warning:** The default value is evaluated only once. This makes a difference when the default is a mutable object such as a list, dictionary, or instances of most classes. For example, the following function accumulates the arguments passed to it on subsequent calls::
fa: **Important warning:** مقدار پیش فرض فقط یک بار ارزیابی می شود. زمانی که پیش‌فرض یک شیء قابل تغییر مانند فهرست، فرهنگ لغت یا نمونه‌های بیشتر کلاس‌ها باشد، این تفاوت ایجاد می‌کند. به عنوان مثال، تابع زیر آرگومان های ارسال شده به آن را در فراخوانی های بعدی جمع می کند:

source: This will print ::
fa: این چاپ خواهد شد::

source: If you don't want the default to be shared between subsequent calls, you can write the function like this instead::
fa: اگر نمی‌خواهید پیش‌فرض بین تماس‌های بعدی به اشتراک گذاشته شود، می‌توانید تابع را به این صورت بنویسید:

source: Keyword Arguments
fa: آرگومان های کلیدواژه

source: Functions can also be called using :term:`keyword arguments <keyword argument>` of the form ``kwarg=value``. For instance, the following function::
fa: همچنین می توان توابع را با استفاده از :term:`keyword arguments <keyword argument>` از فرم ``kwarg=value`` فراخوانی کرد. به عنوان مثال، تابع زیر:

source: accepts one required argument (``voltage``) and three optional arguments (``state``, ``action``, and ``type``). This function can be called in any of the following ways::
fa: یک آرگومان مورد نیاز (``voltage``) و سه آرگومان اختیاری (``state``, ``action`` و ``type``) را می پذیرد. این تابع را می توان به یکی از روش های زیر فراخوانی کرد:

source: but all the following calls would be invalid::
fa: اما همه تماس های زیر نامعتبر خواهد بود:

source: parrot() # required argument missing parrot(voltage=5.0, 'dead') # non-keyword argument after a keyword argument parrot(110, voltage=220) # duplicate value for the same argument parrot(actor='John Cleese') # unknown keyword argument
fa: parrot() # آرگومان مورد نیاز گم شده است parrot(ولتاژ=5.0, 'مرده') # آرگومان غیرکلیدی بعد از آرگومان کلمه کلیدی parrot(110, ولتاژ=220) # مقدار تکراری برای همان آرگومان parrot(actor='John Cleese') # آرگومان کلیدواژه ناشناخته

source: In a function call, keyword arguments must follow positional arguments. All the keyword arguments passed must match one of the arguments accepted by the function (e.g. ``actor`` is not a valid argument for the ``parrot`` function), and their order is not important. This also includes non-optional arguments (e.g. ``parrot(voltage=1000)`` is valid too). No argument may receive a value more than once. Here's an example that fails due to this restriction::
fa: در فراخوانی تابع، آرگومان های کلیدواژه باید از آرگومان های موقعیتی پیروی کنند. همه آرگومان های کلمه کلیدی ارسال شده باید با یکی از آرگومان های پذیرفته شده توسط تابع مطابقت داشته باشند (مثلاً ``actor`` یک آرگومان معتبر برای تابع ``parrot`` نیست) و ترتیب آنها مهم نیست. این شامل آرگومان های غیر اختیاری نیز می شود (مثلاً ``parrot(voltage=1000)`` نیز معتبر است). هیچ آرگومانی ممکن است بیش از یک بار مقدار دریافت کند. در اینجا یک مثال وجود دارد که به دلیل این محدودیت ناموفق است:

source: >>> def function(a): ... pass ... >>> function(0, a=0) Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: function() got multiple values for argument 'a'
fa: >>> تابع def(a): ... بگذرد ... >>> تابع (0, a=0) ردیابی (آخرین تماس اخیر): فایل "<stdin>", خط 1، در <module> TypeError: function() چندین مقدار برای آرگومان 'a' دریافت کرد

source: When a final formal parameter of the form ``**name`` is present, it receives a dictionary (see :ref:`typesmapping`) containing all keyword arguments except for those corresponding to a formal parameter. This may be combined with a formal parameter of the form ``*name`` (described in the next subsection) which receives a :ref:`tuple <tut-tuples>` containing the positional arguments beyond the formal parameter list. (``*name`` must occur before ``**name``.) For example, if we define a function like this::
fa: هنگامی که یک پارامتر رسمی نهایی از فرم ``**name`` وجود دارد، یک فرهنگ لغت دریافت می کند (به :ref:`typesmapping` مراجعه کنید) که شامل همه آرگومان های کلیدواژه به جز آنهایی است که با یک پارامتر رسمی مطابقت دارند. این ممکن است با یک پارامتر رسمی از فرم ``*name`` (شرح شده در زیربخش بعدی) ترکیب شود که یک :ref:`tuple <tut-tuples>` حاوی آرگومان های موقعیتی فراتر از لیست پارامترهای رسمی را دریافت می کند. (``*name`` باید قبل از ``**name`` رخ دهد.) برای مثال، اگر تابعی را به این صورت تعریف کنیم:

source: It could be called like this::
fa: می توان آن را اینگونه نامید:

source: and of course it would print:
fa: و البته چاپ می کرد:

source: -- Do you have any Limburger ? -- I'm sorry, we're all out of Limburger It's very runny, sir. It's really very, VERY runny, sir. ---------------------------------------- shopkeeper : Michael Palin client : John Cleese sketch : Cheese Shop Sketch
fa: - آیا لیمبرگر دارید؟ - متاسفم، ما همه از لیمبرگر خارج شدیم خیلی آبریزش داره قربان واقعا خیلی خیلی آبریزش داره قربان. --------------------------------------- مغازه دار: مایکل پیلین مشتری: جان کلیس طرح : طرح فروشگاه پنیر

source: Note that the order in which the keyword arguments are printed is guaranteed to match the order in which they were provided in the function call.
fa: توجه داشته باشید که ترتیب چاپ آرگومان‌های کلیدواژه با ترتیبی که در فراخوانی تابع ارائه شده‌اند مطابقت دارد.

source: Special parameters
fa: پارامترهای خاص

source: By default, arguments may be passed to a Python function either by position or explicitly by keyword. For readability and performance, it makes sense to restrict the way arguments can be passed so that a developer need only look at the function definition to determine if items are passed by position, by position or keyword, or by keyword.
fa: به‌طور پیش‌فرض، آرگومان‌ها ممکن است به یک تابع پایتون بر اساس موقعیت یا صریحاً با کلمه کلیدی ارسال شوند. برای خوانایی و عملکرد، منطقی است که روش ارسال آرگومان‌ها را محدود کنیم، به طوری که یک توسعه‌دهنده فقط باید به تعریف تابع نگاه کند تا تعیین کند آیا موارد بر اساس موقعیت، موقعیت یا کلمه کلیدی یا کلیدواژه ارسال می‌شوند.

source: A function definition may look like:
fa: یک تعریف تابع ممکن است به صورت زیر باشد:

source: def f(pos1, pos2, /, pos_or_kwd, *, kwd1, kwd2): ----------- ---------- ---------- | | | | Positional or keyword | | - Keyword only -- Positional only
fa: def f(pos1, pos2, /, pos_or_kwd, *, kwd1, kwd2): ----------- --------- ---------- | | | | موقعیت یا کلمه کلیدی | | - فقط کلمه کلیدی -- فقط موقعیت

source: where ``/`` and ``*`` are optional. If used, these symbols indicate the kind of parameter by how the arguments may be passed to the function: positional-only, positional-or-keyword, and keyword-only. Keyword parameters are also referred to as named parameters.
fa: که در آن ``/`` و ``*`` اختیاری هستند. در صورت استفاده، این نمادها نوع پارامتر را با نحوه ارسال آرگومان ها به تابع نشان می دهند: فقط موقعیتی، کلمه کلیدی موقعیتی و فقط کلمه کلیدی. به پارامترهای کلیدواژه به عنوان پارامترهای نامگذاری شده نیز گفته می شود.

source: Positional-or-Keyword Arguments
fa: آرگومان های موقعیت یا کلیدواژه

source: If ``/`` and ``*`` are not present in the function definition, arguments may be passed to a function by position or by keyword.
fa: اگر ``/`` و ``*`` در تعریف تابع وجود نداشته باشند، ممکن است آرگومان ها بر اساس موقعیت یا کلیدواژه به یک تابع ارسال شوند.

source: Positional-Only Parameters
fa: پارامترهای فقط موقعیت

source: Looking at this in a bit more detail, it is possible to mark certain parameters as *positional-only*. If *positional-only*, the parameters' order matters, and the parameters cannot be passed by keyword. Positional-only parameters are placed before a ``/`` (forward-slash). The ``/`` is used to logically separate the positional-only parameters from the rest of the parameters. If there is no ``/`` in the function definition, there are no positional-only parameters.
fa: با نگاهی جزئی تر به این موضوع، می توان پارامترهای خاصی را به عنوان *positional-only* علامت گذاری کرد. اگر *positional-only*، ترتیب پارامترها مهم است و پارامترها نمی توانند با کلمه کلیدی منتقل شوند. پارامترهای فقط موقعیتی قبل از یک ``/`` قرار می‌گیرند (میز به جلو). ``/`` برای جداسازی منطقی پارامترهای فقط موقعیتی از بقیه پارامترها استفاده می شود. اگر ``/`` در تعریف تابع وجود نداشته باشد، هیچ پارامتر فقط موقعیتی وجود ندارد.

source: Parameters following the ``/`` may be *positional-or-keyword* or *keyword-only*.
fa: پارامترهای پس از ``/`` ممکن است *positional-or-keyword* یا *keyword-only* باشند.

source: Keyword-Only Arguments
fa: آرگومان های فقط کلمه کلیدی

source: To mark parameters as *keyword-only*, indicating the parameters must be passed by keyword argument, place an ``*`` in the arguments list just before the first *keyword-only* parameter.
fa: برای علامت گذاری پارامترها به عنوان *keyword-only*، که نشان می دهد پارامترها باید توسط آرگومان کلمه کلیدی ارسال شوند، یک ``*`` را در لیست آرگومان ها درست قبل از اولین پارامتر *keyword-only* قرار دهید.

source: Function Examples
fa: نمونه های تابع

source: Consider the following example function definitions paying close attention to the markers ``/`` and ``*``::
fa: تعاریف تابع مثال زیر را با توجه دقیق به نشانگرهای ``/`` و ``*`` در نظر بگیرید:

source: The first function definition, ``standard_arg``, the most familiar form, places no restrictions on the calling convention and arguments may be passed by position or keyword::
fa: اولین تعریف تابع، ``standard_arg``، آشناترین شکل، هیچ محدودیتی برای قرارداد فراخوانی قائل نیست و آرگومان ها ممکن است با موقعیت یا کلیدواژه منتقل شوند:

source: The second function ``pos_only_arg`` is restricted to only use positional parameters as there is a ``/`` in the function definition::
fa: تابع دوم ``pos_only_arg`` فقط به استفاده از پارامترهای موقعیتی محدود شده است زیرا یک ``/`` در تعریف تابع وجود دارد::

source: >>> pos_only_arg(1) 1 >>> pos_only_arg(arg=1) Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: pos_only_arg() got some positional-only arguments passed as keyword arguments: 'arg'
fa: >>> pos_only_arg (1) 1 >>> pos_only_arg(arg=1) ردیابی (آخرین تماس اخیر): فایل "<stdin>", خط 1، در <module> TypeError: pos_only_arg() برخی از آرگومان های فقط موقعیتی را به عنوان آرگومان های کلمه کلیدی ارسال کرد: 'arg'

source: The third function ``kwd_only_arg`` only allows keyword arguments as indicated by a ``*`` in the function definition::
fa: تابع سوم ``kwd_only_arg`` فقط به آرگومان های کلمه کلیدی اجازه می دهد که توسط یک ``*`` در تعریف تابع نشان داده شده است::

source: >>> kwd_only_arg(3) Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: kwd_only_arg() takes 0 positional arguments but 1 was given >>> kwd_only_arg(arg=3) 3
fa: >>> kwd_only_arg (3) ردیابی (آخرین تماس اخیر): فایل "<stdin>", خط 1، در <module> TypeError: kwd_only_arg() 0 آرگومان موقعیتی می گیرد اما 1 داده شده است >>> kwd_only_arg(arg=3) 3

source: And the last uses all three calling conventions in the same function definition::
fa: و آخرین از هر سه قرارداد فراخوانی در یک تعریف تابع استفاده می کند:

source: >>> combined_example(1, 2, 3) Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: combined_example() takes 2 positional arguments but 3 were given >>> combined_example(1, 2, kwd_only=3) 1 2 3 >>> combined_example(1, standard=2, kwd_only=3) 1 2 3 >>> combined_example(pos_only=1, standard=2, kwd_only=3) Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: combined_example() got some positional-only arguments passed as keyword arguments: 'pos_only'
fa: >>> ترکیبی_نمونه(1, 2, 3) ردیابی (آخرین تماس اخیر): فایل "<stdin>", خط 1، در <module> TypeError: Combined_example() 2 آرگومان موقعیتی می گیرد اما 3 آرگومان داده شده است >>> ترکیبی_نمونه(1, 2, kwd_only=3) 1 2 3 >>> ترکیبی_مثال (1, استاندارد=2, kwd_only=3) 1 2 3 >>> ترکیبی_نمونه(pos_only=1, استاندارد=2, kwd_only=3) ردیابی (آخرین تماس اخیر): فایل "<stdin>", خط 1، در <module> TypeError: Combined_example () چند آرگومان فقط موقعیتی به عنوان آرگومان های کلمه کلیدی ارسال کرد: 'pos_only'

source: Finally, consider this function definition which has a potential collision between the positional argument ``name`` and ``**kwds`` which has ``name`` as a key::
fa: در نهایت، این تعریف تابع را در نظر بگیرید که دارای برخورد بالقوه بین آرگومان موقعیتی ``name`` و ``**kwds`` است که دارای ``name`` به عنوان یک کلید است:

source: There is no possible call that will make it return ``True`` as the keyword ``'name'`` will always bind to the first parameter. For example::
fa: هیچ فراخوانی ممکنی وجود ندارد که باعث شود ``True`` برگردد زیرا کلمه کلیدی ``'name'`` همیشه به پارامتر اول متصل می شود. به عنوان مثال::

source: >>> foo(1, **{'name': 2}) Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: foo() got multiple values for argument 'name' >>>
fa: >>> foo(1, **{'name': 2}) ردیابی (آخرین تماس اخیر): فایل "<stdin>", خط 1، در <module> TypeError: foo() چندین مقدار برای آرگومان 'name' دریافت کرد >>>

source: But using ``/`` (positional only arguments), it is possible since it allows ``name`` as a positional argument and ``'name'`` as a key in the keyword arguments::
fa: اما با استفاده از ``/`` (فقط آرگومان های موقعیتی), این امکان وجود دارد زیرا به ``name`` به عنوان آرگومان موقعیتی و ``'name'`` به عنوان یک کلید در آرگومان های کلیدواژه اجازه می دهد:

source: In other words, the names of positional-only parameters can be used in ``**kwds`` without ambiguity.
fa: به عبارت دیگر، نام پارامترهای فقط موقعیتی را می توان در ``**kwds`` بدون ابهام استفاده کرد.

source: Recap
fa: خلاصه

source: The use case will determine which parameters to use in the function definition::
fa: مورد استفاده تعیین می کند که از کدام پارامترها در تعریف تابع استفاده شود:

source: As guidance:
fa: به عنوان راهنمایی:

source: Use positional-only if you want the name of the parameters to not be available to the user. This is useful when parameter names have no real meaning, if you want to enforce the order of the arguments when the function is called or if you need to take some positional parameters and arbitrary keywords.
fa: اگر می‌خواهید نام پارامترها در دسترس کاربر نباشد، فقط از موقعیتی استفاده کنید. این زمانی مفید است که نام پارامترها معنای واقعی نداشته باشند، اگر می‌خواهید ترتیب آرگومان‌ها را هنگام فراخوانی تابع اعمال کنید یا اگر نیاز به گرفتن برخی از پارامترهای موقعیتی و کلمات کلیدی دلخواه دارید.

source: Use keyword-only when names have meaning and the function definition is more understandable by being explicit with names or you want to prevent users relying on the position of the argument being passed.
fa: زمانی از کلمه کلیدی استفاده کنید که نام‌ها معنی داشته باشند و تعریف تابع با صریح بودن نام‌ها قابل درک‌تر باشد یا بخواهید از تکیه کاربران به موقعیت آرگومان ارسالی جلوگیری کنید.

source: For an API, use positional-only to prevent breaking API changes if the parameter's name is modified in the future.
fa: برای یک API، از فقط موقعیتی استفاده کنید تا در صورت تغییر نام پارامتر در آینده، از شکستن تغییرات API جلوگیری کنید.

source: Arbitrary Argument Lists
fa: فهرست های استدلال دلخواه
