Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/tutorial/controlflow.po
Languages: fa

source: Finally, the least frequently used option is to specify that a function can be called with an arbitrary number of arguments. These arguments will be wrapped up in a tuple (see :ref:`tut-tuples`). Before the variable number of arguments, zero or more normal arguments may occur. ::
fa: در نهایت، گزینه ای که کمتر مورد استفاده قرار می گیرد، تعیین این است که یک تابع را می توان با تعداد دلخواه آرگومان فراخوانی کرد. این آرگومان ها در یک تاپل جمع می شوند (به :ref:`tut-tuples` مراجعه کنید). قبل از تعداد متغیر آرگومان ها، ممکن است آرگومان های عادی صفر یا بیشتر رخ دهند. ::

source: Normally, these *variadic* arguments will be last in the list of formal parameters, because they scoop up all remaining input arguments that are passed to the function. Any formal parameters which occur after the ``*args`` parameter are 'keyword-only' arguments, meaning that they can only be used as keywords rather than positional arguments. ::
fa: به طور معمول، این آرگومان‌های *variadic* آخرین آرگومان‌های فهرست پارامترهای رسمی خواهند بود، زیرا همه آرگومان‌های ورودی باقی‌مانده را که به تابع ارسال می‌شوند، جمع‌آوری می‌کنند. هر پارامتر رسمی که بعد از پارامتر ``*args`` رخ می دهد، آرگومان های "فقط کلمه کلیدی" هستند، به این معنی که آنها فقط می توانند به عنوان کلمات کلیدی به جای آرگومان های موقعیتی استفاده شوند. ::

source: Unpacking Argument Lists
fa: باز کردن لیست های استدلال

source: The reverse situation occurs when the arguments are already in a list or tuple but need to be unpacked for a function call requiring separate positional arguments. For instance, the built-in :func:`range` function expects separate *start* and *stop* arguments. If they are not available separately, write the function call with the ``*``\ -operator to unpack the arguments out of a list or tuple::
fa: وضعیت معکوس زمانی اتفاق می‌افتد که آرگومان‌ها از قبل در یک لیست یا چند تایی هستند، اما برای فراخوانی تابعی که نیاز به آرگومان‌های موقعیتی جداگانه دارد، باید بسته‌بندی شوند. به عنوان مثال، تابع داخلی :func:`range` آرگومان های جداگانه *start* و *stop* را انتظار دارد. اگر آنها به طور جداگانه در دسترس نیستند، فراخوانی تابع را با عملگر ``*``\ - بنویسید تا آرگومان ها از یک لیست یا تاپل باز شوند::

source: In the same fashion, dictionaries can deliver keyword arguments with the ``**``\ -operator::
fa: به همین ترتیب، دیکشنری ها می توانند آرگومان های کلمه کلیدی را با ``**``\ -operator::

source: >>> def parrot(voltage, state='a stiff', action='voom'): ... print("-- This parrot wouldn't", action, end=' ') ... print("if you put", voltage, "volts through it.", end=' ') ... print("E's", state, "!") ... >>> d = {"voltage": "four million", "state": "bleedin' demised", "action": "VOOM"} >>> parrot(**d) -- This parrot wouldn't VOOM if you put four million volts through it. E's bleedin' demised !
fa: >>> def parrot (ولتاژ, حالت='a stiff', action='voom'): ... print("-- این طوطی نمی خواست", اقدام, پایان=' ') ... print("اگر قرار دهید", ولتاژ, "ولت از طریق آن.", پایان=' ') ... چاپ ("E's", State, "!") ... >>> d = {"ولتاژ": "چهار میلیون", "وضعیت": "بدون خونریزی", "عمل": "VOOM"} >>> طوطی (**d) - این طوطی اگر چهار میلیون ولت در آن قرار دهید صدای بلند نمی کند. E در حال خونریزی است!

source: Lambda Expressions
fa: عبارات لامبدا

source: Small anonymous functions can be created with the :keyword:`lambda` keyword. This function returns the sum of its two arguments: ``lambda a, b: a+b``. Lambda functions can be used wherever function objects are required. They are syntactically restricted to a single expression. Semantically, they are just syntactic sugar for a normal function definition. Like nested function definitions, lambda functions can reference variables from the containing scope::
fa: توابع ناشناس کوچک را می توان با کلمه کلیدی :keyword:`lambda` ایجاد کرد. این تابع مجموع دو آرگومان خود را برمی گرداند: ``lambda a, b: a+b``. توابع لامبدا را می توان در هر جایی که به اشیاء تابع مورد نیاز است استفاده کرد. آنها از نظر نحوی به یک عبارت محدود می شوند. از نظر معنایی، آنها فقط قند نحوی برای تعریف عملکرد عادی هستند. مانند تعاریف توابع تو در تو، توابع لامبدا می توانند به متغیرها از محدوده حاوی::

source: The above example uses a lambda expression to return a function. Another use is to pass a small function as an argument::
fa: مثال بالا از عبارت lambda برای برگرداندن یک تابع استفاده می کند. استفاده دیگر ارسال یک تابع کوچک به عنوان آرگومان است:

source: Documentation Strings
fa: رشته های مستندات

source: Here are some conventions about the content and formatting of documentation strings.
fa: در اینجا چند قرارداد در مورد محتوا و قالب بندی رشته های مستندات وجود دارد.

source: The first line should always be a short, concise summary of the object's purpose. For brevity, it should not explicitly state the object's name or type, since these are available by other means (except if the name happens to be a verb describing a function's operation). This line should begin with a capital letter and end with a period.
fa: خط اول همیشه باید خلاصه ای کوتاه و مختصر از هدف شی باشد. برای اختصار، نباید به صراحت نام یا نوع شیء را بیان کند، زیرا این موارد با ابزارهای دیگری در دسترس هستند (به جز اگر نام فعل توصیف کننده عملکرد یک تابع باشد). این خط باید با حرف بزرگ شروع شود و با نقطه پایان یابد.

source: If there are more lines in the documentation string, the second line should be blank, visually separating the summary from the rest of the description. The following lines should be one or more paragraphs describing the object's calling conventions, its side effects, etc.
fa: اگر خطوط بیشتری در رشته مستندات وجود دارد، خط دوم باید خالی باشد و خلاصه را از بقیه توضیحات جدا کند. خطوط زیر باید یک یا چند پاراگراف باشد که قراردادهای فراخوانی شیء، عوارض جانبی آن و غیره را توضیح دهد.

source: The Python parser does not strip indentation from multi-line string literals in Python, so tools that process documentation have to strip indentation if desired. This is done using the following convention. The first non-blank line *after* the first line of the string determines the amount of indentation for the entire documentation string. (We can't use the first line since it is generally adjacent to the string's opening quotes so its indentation is not apparent in the string literal.) Whitespace "equivalent" to this indentation is then stripped from the start of all lines of the string. Lines that are indented less should not occur, but if they occur all their leading whitespace should be stripped. Equivalence of whitespace should be tested after expansion of tabs (to 8 spaces, normally).
fa: تجزیه‌کننده پایتون تورفتگی را از رشته‌های چند خطی در پایتون حذف نمی‌کند، بنابراین ابزارهایی که مستندات را پردازش می‌کنند در صورت تمایل باید تورفتگی را حذف کنند. این کار با استفاده از قرارداد زیر انجام می شود. اولین خط غیر خالی *after* اولین خط رشته مقدار تورفتگی را برای کل رشته مستندات تعیین می کند. (ما نمی‌توانیم از خط اول استفاده کنیم, زیرا معمولاً در مجاورت نقل قول‌های ابتدایی رشته است, بنابراین تورفتگی آن در کلمه‌ی رشته مشخص نیست.) فضای سفید «معادل» این تورفتگی از ابتدای تمام خطوط رشته حذف می‌شود. خطوطی که تورفتگی کمتری دارند، نباید رخ دهند، اما اگر رخ دهند، تمام فضای سفید اصلی آنها باید حذف شود. معادل سازی فضای خالی باید پس از گسترش زبانه ها (به طور معمول به 8 فاصله) آزمایش شود.

source: Here is an example of a multi-line docstring::
fa: در اینجا یک نمونه از یک رشته مستند چند خطی آورده شده است:

source: >>> def my_function(): ... """Do nothing, but document it. ... ... No, really, it doesn't do anything. ... """ ... pass ... >>> print(my_function.__doc__) Do nothing, but document it. No, really, it doesn't do anything.
fa: >>> def my_function(): ... """ هیچ کاری انجام ندهید، اما آن را مستند کنید. ... ... نه واقعا هیچ کاری نمی کند. ...""" ... بگذرد ... >>> print(my_function.__doc__) هیچ کاری نکنید، اما آن را مستند کنید. نه واقعا هیچ کاری نمیکنه

source: Function Annotations
fa: حاشیه نویسی تابع

source: :ref:`Function annotations <function>` are completely optional metadata information about the types used by user-defined functions (see :pep:`3107` and :pep:`484` for more information).
fa: :ref:`Function annotations <function>` اطلاعات فراداده کاملاً اختیاری در مورد انواع استفاده شده توسط توابع تعریف شده توسط کاربر است (برای اطلاعات بیشتر به :pep:`3107` و :pep:`484` مراجعه کنید).

source: :term:`Annotations <function annotation>` are stored in the :attr:`!__annotations__` attribute of the function as a dictionary and have no effect on any other part of the function. Parameter annotations are defined by a colon after the parameter name, followed by an expression evaluating to the value of the annotation. Return annotations are defined by a literal ``->``, followed by an expression, between the parameter list and the colon denoting the end of the :keyword:`def` statement. The following example has a required argument, an optional argument, and the return value annotated::
fa: :term:`Annotations <function annotation>` در ویژگی :attr:`!__annotations__` تابع به عنوان یک فرهنگ لغت ذخیره می شود و هیچ تأثیری بر هیچ بخش دیگری از تابع ندارد. حاشیه نویسی پارامترها با یک دونقطه بعد از نام پارامتر و به دنبال آن عبارتی که ارزش حاشیه نویسی را ارزیابی می کند، تعریف می شود. حاشیه نویسی های بازگشتی با یک ``->`` تحت اللفظی تعریف می شوند و به دنبال آن عبارتی بین لیست پارامترها و دو نقطه که پایان عبارت :keyword:`def` را نشان می دهد. مثال زیر دارای یک آرگومان الزامی، یک آرگومان اختیاری و مقدار بازگشتی مشروح شده است:

source: >>> def f(ham: str, eggs: str = 'eggs') -> str: ... print("Annotations:", f.__annotations__) ... print("Arguments:", ham, eggs) ... return ham + ' and ' + eggs ... >>> f('spam') Annotations: {'ham': <class 'str'>, 'return': <class 'str'>, 'eggs': <class 'str'>} Arguments: spam eggs 'spam and eggs'
fa: >>> def f(ham: str, eggs: str = 'تخم مرغ') -> str: ... print("Anotations:", f.__annotations__) ... چاپ ("مدلال:", ژامبون, تخم مرغ) ... ژامبون + 'و' + تخم مرغ را برگردانید ... >>> f ('spam') حاشیه نویسی: {'ham': <class 'str'>, 'return': <class 'str'>, 'eggs': <class 'str'>} استدلال ها: تخم مرغ های اسپم "هرزنامه و تخم مرغ"

source: Intermezzo: Coding Style
fa: Intermezzo: سبک کدنویسی

source: Now that you are about to write longer, more complex pieces of Python, it is a good time to talk about *coding style*. Most languages can be written (or more concise, *formatted*) in different styles; some are more readable than others. Making it easy for others to read your code is always a good idea, and adopting a nice coding style helps tremendously for that.
fa: اکنون که می خواهید قطعات طولانی تر و پیچیده تری از پایتون بنویسید، زمان خوبی است که در مورد *coding style* صحبت کنید. اکثر زبان ها را می توان (یا مختصرتر, *formatted*) به سبک های مختلف نوشت. برخی از آنها خواناتر از دیگران هستند. آسان کردن خواندن کد شما برای دیگران همیشه یک ایده خوب است و اتخاذ یک سبک کدنویسی خوب کمک بزرگی به آن می کند.

source: For Python, :pep:`8` has emerged as the style guide that most projects adhere to; it promotes a very readable and eye-pleasing coding style. Every Python developer should read it at some point; here are the most important points extracted for you:
fa: برای پایتون، :pep:`8` به عنوان راهنمای سبکی ظاهر شده است که اکثر پروژه ها به آن پایبند هستند. این یک سبک کدنویسی بسیار خوانا و چشم نواز را ترویج می کند. هر توسعه دهنده پایتون باید آن را در نقطه ای بخواند. در اینجا مهمترین نکات استخراج شده برای شما آورده شده است:

source: Use 4-space indentation, and no tabs.
fa: از تورفتگی 4 فاصله و بدون زبانه استفاده کنید.

source: 4 spaces are a good compromise between small indentation (allows greater nesting depth) and large indentation (easier to read). Tabs introduce confusion, and are best left out.
fa: 4 فاصله بین تورفتگی کوچک (به عمق بیشتر لانه سازی اجازه می دهد) و فرورفتگی بزرگ (خواندن آسان تر) خوب است. برگه‌ها باعث سردرگمی می‌شوند و بهتر است کنار گذاشته شوند.

source: Wrap lines so that they don't exceed 79 characters.
fa: خطوط را طوری بپیچید که از 79 کاراکتر تجاوز نکنند.

source: This helps users with small displays and makes it possible to have several code files side-by-side on larger displays.
fa: این به کاربران با نمایشگرهای کوچک کمک می کند و امکان داشتن چندین فایل کد را در کنار هم در نمایشگرهای بزرگتر فراهم می کند.

source: Use blank lines to separate functions and classes, and larger blocks of code inside functions.
fa: از خطوط خالی برای جدا کردن توابع و کلاس ها و بلوک های بزرگتر کد در داخل توابع استفاده کنید.

source: When possible, put comments on a line of their own.
fa: در صورت امکان، نظرات خود را در یک خط قرار دهید.

source: Use docstrings.
fa: از Docstrings استفاده کنید.

source: Use spaces around operators and after commas, but not directly inside bracketing constructs: ``a = f(1, 2) + g(3, 4)``.
fa: از فضاهای اطراف عملگرها و بعد از کاما استفاده کنید، اما نه مستقیماً در ساختارهای براکت: ``a = f(1, 2) + g(3, 4)``.

source: Name your classes and functions consistently; the convention is to use ``UpperCamelCase`` for classes and ``lowercase_with_underscores`` for functions and methods. Always use ``self`` as the name for the first method argument (see :ref:`tut-firstclasses` for more on classes and methods).
fa: کلاس ها و توابع خود را به طور مداوم نام ببرید. قرارداد استفاده از ``UpperCamelCase`` برای کلاس ها و ``lowercase_with_underscores`` برای توابع و متدها است. همیشه از ``self`` به عنوان نام آرگومان متد اول استفاده کنید (برای اطلاعات بیشتر در مورد کلاس ها و متدها به :ref:`tut-firstclasses` مراجعه کنید).

source: Don't use fancy encodings if your code is meant to be used in international environments. Python's default, UTF-8, or even plain ASCII work best in any case.
fa: اگر قرار است کد شما در محیط های بین المللی استفاده شود، از رمزگذاری های فانتزی استفاده نکنید. پیش‌فرض پایتون، UTF-8 یا حتی ASCII ساده در هر صورت بهترین عملکرد را دارد.

source: Likewise, don't use non-ASCII characters in identifiers if there is only the slightest chance people speaking a different language will read or maintain the code.
fa: به همین ترتیب، اگر فقط کوچکترین احتمالی وجود دارد که افرادی که به زبان دیگری صحبت می کنند، کد را بخوانند یا حفظ کنند، از کاراکترهای غیر ASCII در شناسه ها استفاده نکنید.

source: Footnotes
fa: پاورقی ها

source: Actually, *call by object reference* would be a better description, since if a mutable object is passed, the caller will see any changes the callee makes to it (items inserted into a list).
fa: در واقع، *call by object reference* توصیف بهتری خواهد بود، زیرا اگر یک شیء قابل تغییر ارسال شود، تماس گیرنده هر تغییری را که تماس گیرنده در آن ایجاد می کند (موارد درج شده در یک لیست) مشاهده خواهد کرد.

source: statement
fa: بیانیه

source: for
fa: برای

source: documentation strings
fa: رشته های مستندسازی

source: docstrings
fa: رشته های مستند

source: * (asterisk)
fa: * (ستاره)

source: in function calls
fa: در فراخوانی تابع

source: function
fa: تابع

source: annotations
fa: حاشیه نویسی

source: function annotations
fa: حاشیه نویسی عملکرد

source: : (colon)
fa: : (دونقطه)

source: coding
fa: کد نویسی

source: style
fa: سبک
