Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/tutorial/controlflow.po
Languages: fa

source: More Control Flow Tools
fa: ابزارهای کنترل جریان بیشتر

source: As well as the :keyword:`while` statement just introduced, Python uses a few more that we will encounter in this chapter.
fa: علاوه بر دستور :keyword:`while` که به تازگی معرفی شد، پایتون از چند مورد دیگر نیز استفاده می کند که در این فصل با آن ها مواجه خواهیم شد.

source: :keyword:`!if` Statements
fa: بیانیه های :keyword:`!if`

source: Perhaps the most well-known statement type is the :keyword:`if` statement. For example::
fa: شاید شناخته شده ترین نوع عبارت عبارت :keyword:`if` باشد. به عنوان مثال::

source: >>> x = int(input("Please enter an integer: ")) Please enter an integer: 42 >>> if x < 0: ... x = 0 ... print('Negative changed to zero') ... elif x == 0: ... print('Zero') ... elif x == 1: ... print('Single') ... else: ... print('More') ... More
fa: >>> x = int(input("لطفا یک عدد صحیح وارد کنید:")) لطفا یک عدد صحیح وارد کنید: 42 >>> اگر x < 0: ... x = 0 ... چاپ ("منفی به صفر تغییر کرد") ... elif x == 0: ... چاپ ("صفر") ... elif x == 1: ... چاپ ("تک") ... دیگر: ... چاپ ("بیشتر") ... بیشتر

source: There can be zero or more :keyword:`elif` parts, and the :keyword:`else` part is optional. The keyword ':keyword:`!elif`' is short for 'else if', and is useful to avoid excessive indentation. An :keyword:`!if` ... :keyword:`!elif` ... :keyword:`!elif` ... sequence is a substitute for the ``switch`` or ``case`` statements found in other languages.
fa: ممکن است تعداد قطعات :keyword:`elif` صفر یا بیشتر باشد و قسمت :keyword:`else` اختیاری است. کلمه کلیدی ':keyword:`!elif`' مخفف 'alse if' است و برای جلوگیری از فرورفتگی بیش از حد مفید است. یک دنباله :keyword:`!if` ... :keyword:`!elif` ... :keyword:`!elif` ... جایگزینی برای دستورات ``switch`` یا ``case`` موجود در زبان های دیگر است.

source: If you're comparing the same value to several constants, or checking for specific types or attributes, you may also find the :keyword:`!match` statement useful. For more details see :ref:`tut-match`.
fa: اگر مقدار یکسانی را با چندین ثابت مقایسه می‌کنید، یا انواع یا ویژگی‌های خاصی را بررسی می‌کنید، ممکن است دستور :keyword:`!match` را نیز مفید بدانید. برای جزئیات بیشتر به :ref:`tut-match` مراجعه کنید.

source: :keyword:`!for` Statements
fa: بیانیه های :keyword:`!for`

source: The :keyword:`for` statement in Python differs a bit from what you may be used to in C or Pascal. Rather than always iterating over an arithmetic progression of numbers (like in Pascal), or giving the user the ability to define both the iteration step and halting condition (as C), Python's :keyword:`!for` statement iterates over the items of any sequence (a list or a string), in the order that they appear in the sequence. For example (no pun intended):
fa: دستور :keyword:`for` در پایتون با آنچه ممکن است در C یا پاسکال به آن عادت داشته باشید کمی متفاوت است. دستور :keyword:`!for` پایتون به جای اینکه همیشه روی یک پیشرفت حسابی اعداد تکرار شود (مانند پاسکال), یا به کاربر توانایی تعریف مرحله تکرار و شرط توقف (به عنوان C) را بدهد، عبارت :keyword:`!for` پایتون روی آیتم‌های هر دنباله (یک لیست یا یک رشته), به ترتیب ظاهر شدن آنها در دنباله تکرار می‌شود. به عنوان مثال (بدون جناس):

source: >>> # Measure some strings: >>> words = ['cat', 'window', 'defenestrate'] >>> for w in words: ... print(w, len(w)) ... cat 3 window 6 defenestrate 12
fa: >>> # تعدادی رشته را اندازه گیری کنید: >>> words = ['گربه', 'پنجره', 'دفاع'] >>> برای w در کلمات: ... چاپ (w, len(w)) ... گربه 3 پنجره 6 دفاع کردن 12

source: Code that modifies a collection while iterating over that same collection can be tricky to get right. Instead, it is usually more straight-forward to loop over a copy of the collection or to create a new collection::
fa: کدی که یک مجموعه را در حین تکرار روی همان مجموعه تغییر می‌دهد، می‌تواند برای درست کردن آن مشکل باشد. در عوض، معمولا ساده‌تر است که روی یک کپی از مجموعه حلقه بزنید یا یک مجموعه جدید ایجاد کنید:

source: The :func:`range` Function
fa: عملکرد :func:`range`

source: If you do need to iterate over a sequence of numbers, the built-in function :func:`range` comes in handy. It generates arithmetic progressions::
fa: اگر نیاز به تکرار بر روی یک دنباله از اعداد دارید، عملکرد داخلی :func:`range` مفید است. پیشرفت های حسابی را ایجاد می کند:

source: The given end point is never part of the generated sequence; ``range(10)`` generates 10 values, the legal indices for items of a sequence of length 10. It is possible to let the range start at another number, or to specify a different increment (even negative; sometimes this is called the 'step')::
fa: نقطه پایانی داده شده هرگز بخشی از توالی تولید شده نیست. ``range(10)`` 10 مقدار تولید می کند، شاخص های قانونی برای مواردی با یک دنباله به طول 10. می توان اجازه داد که محدوده از یک عدد دیگر شروع شود، یا یک افزایش متفاوت (حتی منفی، گاهی اوقات به این مرحله "گام" می گویند:

source: To iterate over the indices of a sequence, you can combine :func:`range` and :func:`len` as follows::
fa: برای تکرار بر روی شاخص های یک دنباله، می توانید :func:`range` و :func:`len` را به صورت زیر ترکیب کنید:

source: >>> a = ['Mary', 'had', 'a', 'little', 'lamb'] >>> for i in range(len(a)): ... print(i, a[i]) ... 0 Mary 1 had 2 a 3 little 4 lamb
fa: >>> a = ['مریم', 'داشت', 'a', 'کوچولو', 'بره'] >>> برای i در محدوده (len(a)): ... چاپ (i, a[i]) ... 0 مریم 1 داشت 2 الف 3 کم 4 بره

source: In most such cases, however, it is convenient to use the :func:`enumerate` function, see :ref:`tut-loopidioms`.
fa: با این حال، در بیشتر چنین مواردی، استفاده از عملکرد :func:`enumerate` راحت است، به :ref:`tut-loopidioms` مراجعه کنید.

source: A strange thing happens if you just print a range::
fa: اگر فقط یک محدوده را چاپ کنید یک اتفاق عجیب رخ می دهد::

source: In many ways the object returned by :func:`range` behaves as if it is a list, but in fact it isn't. It is an object which returns the successive items of the desired sequence when you iterate over it, but it doesn't really make the list, thus saving space.
fa: از بسیاری جهات، شی ای که توسط :func:`range` برگردانده می شود طوری رفتار می کند که انگار یک لیست است، اما در واقع اینطور نیست. این شیئی است که وقتی روی آن تکرار می‌کنید آیتم‌های متوالی دنباله مورد نظر را برمی‌گرداند، اما واقعاً در لیست قرار نمی‌گیرد، بنابراین در فضا صرفه‌جویی می‌شود.

source: We say such an object is :term:`iterable`, that is, suitable as a target for functions and constructs that expect something from which they can obtain successive items until the supply is exhausted. We have seen that the :keyword:`for` statement is such a construct, while an example of a function that takes an iterable is :func:`sum`::
fa: ما می گوییم چنین شی ای :term:`iterable` است، یعنی به عنوان یک هدف برای توابع و ساختارهایی که انتظار چیزی را دارند که می توانند موارد متوالی را از آن به دست آورند تا زمانی که عرضه تمام شود، مناسب است. ما دیدیم که دستور :keyword:`for` چنین ساختاری است، در حالی که نمونه ای از تابعی که یک تکرار پذیر می گیرد :func:`sum`::

source: Later we will see more functions that return iterables and take iterables as arguments. In chapter :ref:`tut-structures`, we will discuss in more detail about :func:`list`.
fa: بعداً توابع بیشتری را خواهیم دید که تکرارپذیرها را برمی‌گردانند و تکرارپذیرها را به عنوان آرگومان می‌گیرند. در فصل :ref:`tut-structures`، با جزئیات بیشتری در مورد :func:`list` بحث خواهیم کرد.

source: :keyword:`!break` and :keyword:`!continue` Statements
fa: بیانیه های :keyword:`!break` و :keyword:`!continue`

source: The :keyword:`break` statement breaks out of the innermost enclosing :keyword:`for` or :keyword:`while` loop::
fa: دستور :keyword:`break` از درونی ترین حلقه :keyword:`for` یا :keyword:`while` خارج می شود:

source: >>> for n in range(2, 10): ... for x in range(2, n): ... if n % x == 0: ... print(f"{n} equals {x} * {n//x}") ... break ... 4 equals 2 * 2 6 equals 2 * 3 8 equals 2 * 4 9 equals 3 * 3
fa: >>> برای n در محدوده (2, 10): ... برای x در محدوده (2, n): ... اگر n % x == 0: ... print(f"{n} برابر است با {x} * {n//x}") ... break ... 4 equals 2 * 2 6 برابر است با 2 * 3 8 equals 2 * 4 9 برابر 3 * 3 است

source: The :keyword:`continue` statement continues with the next iteration of the loop::
fa: دستور :keyword:`continue` با تکرار بعدی حلقه ادامه می یابد:

source: >>> for num in range(2, 10): ... if num % 2 == 0: ... print(f"Found an even number {num}") ... continue ... print(f"Found an odd number {num}") ... Found an even number 2 Found an odd number 3 Found an even number 4 Found an odd number 5 Found an even number 6 Found an odd number 7 Found an even number 8 Found an odd number 9
fa: >>> برای تعداد در محدوده (2, 10): ... اگر عدد % 2 == 0: ... print(f"یک عدد زوج پیدا شد {num}") ... ادامه ... print(f"یک عدد فرد پیدا شد {num}") ... عدد زوج 2 را پیدا کرد یک عدد فرد 3 پیدا کرد عدد زوج 4 را پیدا کرد یک عدد فرد 5 پیدا کرد عدد زوج 6 را پیدا کرد یک عدد فرد 7 پیدا کرد عدد زوج 8 را پیدا کرد یک عدد فرد 9 پیدا کرد

source: :keyword:`!else` Clauses on Loops
fa: بندهای :keyword:`!else` در حلقه ها

source: In a :keyword:`!for` or :keyword:`!while` loop the :keyword:`!break` statement may be paired with an :keyword:`!else` clause. If the loop finishes without executing the :keyword:`!break`, the :keyword:`!else` clause executes.
fa: در یک حلقه :keyword:`!for` یا :keyword:`!while`، دستور :keyword:`!break` ممکن است با یک عبارت :keyword:`!else` جفت شود. اگر حلقه بدون اجرای :keyword:`!break` تمام شود، بند :keyword:`!else` اجرا می شود.

source: In a :keyword:`for` loop, the :keyword:`!else` clause is executed after the loop finishes its final iteration, that is, if no break occurred.
fa: در یک حلقه :keyword:`for`، بند :keyword:`!else` پس از اتمام تکرار نهایی حلقه اجرا می شود، یعنی اگر شکستی رخ نداده باشد.

source: In a :keyword:`while` loop, it's executed after the loop's condition becomes false.
fa: در یک حلقه :keyword:`while`، پس از نادرست شدن شرط حلقه اجرا می شود.

source: In either kind of loop, the :keyword:`!else` clause is **not** executed if the loop was terminated by a :keyword:`break`. Of course, other ways of ending the loop early, such as a :keyword:`return` or a raised exception, will also skip execution of the :keyword:`else` clause.
fa: در هر نوع حلقه، بند :keyword:`!else` به صورت **not** اجرا می شود اگر حلقه توسط یک :keyword:`break` خاتمه یابد. البته، سایر روش‌های پایان دادن به حلقه زودهنگام، مانند :keyword:`return` یا استثناء افزایش‌یافته، از اجرای بند :keyword:`else` نیز صرفنظر می‌کنند.

source: This is exemplified in the following :keyword:`!for` loop, which searches for prime numbers::
fa: این مثال در حلقه :keyword:`!for` زیر است که اعداد اول را جستجو می کند:

source: >>> for n in range(2, 10): ... for x in range(2, n): ... if n % x == 0: ... print(n, 'equals', x, '*', n//x) ... break ... else: ... # loop fell through without finding a factor ... print(n, 'is a prime number') ... 2 is a prime number 3 is a prime number 4 equals 2 * 2 5 is a prime number 6 equals 2 * 3 7 is a prime number 8 equals 2 * 4 9 equals 3 * 3
fa: >>> برای n در محدوده (2, 10): ... برای x در محدوده (2, n): ... اگر n % x == 0: ... print(n, 'برابر', x, '*', n//x) ... break ... else: ... # loop fell through without finding a factor ... print(n, 'is a prime number') ... 2 is a prime number 3 is a prime number 4 equals 2 * 2 5 عدد اول است 6 برابر است با 2 * 3 7 is a prime number 8 equals 2 * 4 9 برابر 3 * 3 است

source: (Yes, this is the correct code. Look closely: the ``else`` clause belongs to the ``for`` loop, **not** the ``if`` statement.)
fa: (بله, این کد صحیح است. به دقت نگاه کنید: عبارت ``else`` متعلق به حلقه ``for``, **not** عبارت ``if`` است.)

source: One way to think of the else clause is to imagine it paired with the ``if`` inside the loop. As the loop executes, it will run a sequence like if/if/if/else. The ``if`` is inside the loop, encountered a number of times. If the condition is ever true, a ``break`` will happen. If the condition is never true, the ``else`` clause outside the loop will execute.
fa: یک راه برای فکر کردن به عبارت else این است که آن را با ``if`` در داخل حلقه جفت شده تصور کنید. همانطور که حلقه اجرا می شود، دنباله ای مانند if/if/if/else را اجرا می کند. ``if`` در داخل حلقه قرار دارد و چندین بار با آن مواجه شده است. اگر شرط همیشه درست باشد، یک ``break`` اتفاق می افتد. اگر شرط هرگز درست نباشد، عبارت ``else`` خارج از حلقه اجرا خواهد شد.

source: When used with a loop, the ``else`` clause has more in common with the ``else`` clause of a :keyword:`try` statement than it does with that of ``if`` statements: a ``try`` statement's ``else`` clause runs when no exception occurs, and a loop's ``else`` clause runs when no ``break`` occurs. For more on the ``try`` statement and exceptions, see :ref:`tut-handling`.
fa: هنگامی که با یک حلقه استفاده می شود، بند ``else`` شباهت بیشتری با بند ``else`` یک دستور :keyword:`try` دارد تا با عبارت ``if``: عبارت ``else`` یک دستور ``try`` زمانی اجرا می شود که هیچ استثنایی رخ نمی دهد، و ``try`` یک حلقه زمانی که هیچ استثنایی رخ نمی دهد اجرا می شود. برای اطلاعات بیشتر در مورد دستور ``try`` و استثناها، به :ref:`tut-handling` مراجعه کنید.

source: :keyword:`!pass` Statements
fa: بیانیه های :keyword:`!pass`

source: The :keyword:`pass` statement does nothing. It can be used when a statement is required syntactically but the program requires no action. For example::
fa: دستور :keyword:`pass` هیچ کاری انجام نمی دهد. زمانی می توان از آن استفاده کرد که یک دستور به صورت نحوی مورد نیاز باشد اما برنامه نیازی به هیچ اقدامی نداشته باشد. به عنوان مثال::

source: This is commonly used for creating minimal classes::
fa: این معمولا برای ایجاد کلاس های حداقل استفاده می شود:

source: Another place :keyword:`pass` can be used is as a place-holder for a function or conditional body when you are working on new code, allowing you to keep thinking at a more abstract level. The :keyword:`!pass` is silently ignored::
fa: مکان دیگری که می‌توان از :keyword:`pass` استفاده کرد، به‌عنوان نگه‌دارنده مکان برای یک تابع یا بدنه شرطی در هنگام کار بر روی کد جدید است که به شما امکان می‌دهد در سطح انتزاعی‌تری فکر کنید. :keyword:`!pass` بی سر و صدا نادیده گرفته می شود::

source: :keyword:`!match` Statements
fa: بیانیه های :keyword:`!match`

source: A :keyword:`match` statement takes an expression and compares its value to successive patterns given as one or more case blocks. This is superficially similar to a switch statement in C, Java or JavaScript (and many other languages), but it's more similar to pattern matching in languages like Rust or Haskell. Only the first pattern that matches gets executed and it can also extract components (sequence elements or object attributes) from the value into variables.
fa: یک دستور :keyword:`match` یک عبارت را می گیرد و مقدار آن را با الگوهای متوالی ارائه شده به عنوان یک یا چند بلوک case مقایسه می کند. این به طور سطحی شبیه به دستور سوئیچ در C، جاوا یا جاوا اسکریپت (و بسیاری از زبان‌های دیگر) است، اما بیشتر شبیه به تطبیق الگو در زبان‌هایی مانند Rust یا Haskell است. فقط اولین الگوی منطبق اجرا می شود و همچنین می تواند مؤلفه ها (عناصر دنباله یا ویژگی های شی) را از مقدار به متغیرها استخراج کند.

source: The simplest form compares a subject value against one or more literals::
fa: ساده ترین شکل یک مقدار موضوع را با یک یا چند کلمه مقایسه می کند:

source: Note the last block: the "variable name" ``_`` acts as a *wildcard* and never fails to match. If no case matches, none of the branches is executed.
fa: به آخرین بلوک توجه کنید: "نام متغیر" ``_`` به عنوان یک *wildcard* عمل می کند و هرگز با هم مطابقت ندارد. اگر هیچ موردی مطابقت نداشته باشد، هیچ یک از شاخه ها اجرا نمی شود.

source: You can combine several literals in a single pattern using ``|`` ("or")::
fa: با استفاده از ``|`` ("یا") می توانید چندین کلمه را در یک الگو ترکیب کنید:

source: case 401 | 403 | 404: return "Not allowed"
fa: مورد 401 | 403 | 404: بازگشت "مجاز نیست"

source: Patterns can look like unpacking assignments, and can be used to bind variables::
fa: الگوها می توانند شبیه به بازکردن تکالیف باشند و می توانند برای اتصال متغیرها استفاده شوند:

source: Study that one carefully! The first pattern has two literals, and can be thought of as an extension of the literal pattern shown above. But the next two patterns combine a literal and a variable, and the variable *binds* a value from the subject (``point``). The fourth pattern captures two values, which makes it conceptually similar to the unpacking assignment ``(x, y) = point``.
fa: آن یکی را با دقت مطالعه کنید! الگوی اول دارای دو حرف است و می‌توان آن را به‌عنوان بسط الگوی تحت اللفظی که در بالا نشان داده شده است در نظر گرفت. اما دو الگوی بعدی یک کلمه و یک متغیر و متغیر *binds* یک مقدار از موضوع (``point``) را ترکیب می‌کنند. الگوی چهارم دو مقدار را دریافت می کند، که آن را از نظر مفهومی شبیه به تخصیص باز کردن بسته بندی ``(x, y) = point`` می کند.

source: If you are using classes to structure your data you can use the class name followed by an argument list resembling a constructor, but with the ability to capture attributes into variables::
fa: اگر از کلاس‌ها برای ساختار دادن به داده‌های خود استفاده می‌کنید، می‌توانید از نام کلاس و به دنبال آن یک لیست آرگومان شبیه سازنده، اما با قابلیت ثبت ویژگی‌ها در متغیرها استفاده کنید:

source: You can use positional parameters with some builtin classes that provide an ordering for their attributes (e.g. dataclasses). You can also define a specific position for attributes in patterns by setting the ``__match_args__`` special attribute in your classes. If it's set to ("x", "y"), the following patterns are all equivalent (and all bind the ``y`` attribute to the ``var`` variable)::
fa: می‌توانید از پارامترهای موقعیتی با برخی کلاس‌های داخلی استفاده کنید که ترتیبی برای ویژگی‌های آن‌ها ارائه می‌کنند (مانند کلاس‌های داده). همچنین می توانید با تنظیم ویژگی خاص ``__match_args__`` در کلاس های خود، یک موقعیت خاص برای ویژگی ها در الگوها تعریف کنید. اگر روی ("x", "y" تنظیم شده باشد), الگوهای زیر همگی معادل هستند (و همه ویژگی ``y`` را به متغیر ``var`` متصل می کنند):

source: A recommended way to read patterns is to look at them as an extended form of what you would put on the left of an assignment, to understand which variables would be set to what. Only the standalone names (like ``var`` above) are assigned to by a match statement. Dotted names (like ``foo.bar``), attribute names (the ``x=`` and ``y=`` above) or class names (recognized by the "(...)" next to them like ``Point`` above) are never assigned to.
fa: یک روش توصیه شده برای خواندن الگوها این است که به آنها به عنوان شکلی بسط یافته از آنچه در سمت چپ یک تکلیف قرار می دهید نگاه کنید تا بفهمید که کدام متغیرها روی چه چیزی تنظیم می شوند. فقط نام‌های مستقل (مانند ``var`` در بالا) توسط یک بیانیه مطابقت به آنها اختصاص داده می‌شود. نام‌های نقطه‌دار (مانند ``foo.bar``), نام‌های ویژگی (``x=`` و ``y=`` در بالا) یا نام‌های کلاس (که با "(...)" در کنار آنها مانند ``Point`` در بالا شناسایی می‌شوند) هرگز به آنها اختصاص داده نمی‌شوند.

source: Patterns can be arbitrarily nested. For example, if we have a short list of Points, with ``__match_args__`` added, we could match it like this::
fa: الگوها را می توان خودسرانه تو در تو قرار داد. به عنوان مثال، اگر ما یک لیست کوتاه از نقاط، با اضافه شدن ``__match_args__`` داشته باشیم، می توانیم آن را به این صورت مطابقت دهیم:

source: We can add an ``if`` clause to a pattern, known as a "guard". If the guard is false, ``match`` goes on to try the next case block. Note that value capture happens before the guard is evaluated::
fa: ما می توانیم یک بند ``if`` به یک الگو اضافه کنیم که به عنوان "گارد" شناخته می شود. اگر گارد نادرست باشد، ``match`` بلاک کیس بعدی را امتحان می کند. توجه داشته باشید که گرفتن ارزش قبل از ارزیابی گارد اتفاق می افتد:

source: Several other key features of this statement:
fa: چند ویژگی کلیدی دیگر این بیانیه:

source: Like unpacking assignments, tuple and list patterns have exactly the same meaning and actually match arbitrary sequences. An important exception is that they don't match iterators or strings.
fa: مانند باز کردن تکالیف، الگوهای تاپل و فهرست دقیقاً معنای مشابهی دارند و در واقع با دنباله‌های دلخواه مطابقت دارند. یک استثنای مهم این است که آنها با تکرارگرها یا رشته ها مطابقت ندارند.

source: Sequence patterns support extended unpacking: ``[x, y, *rest]`` and ``(x, y, *rest)`` work similar to unpacking assignments. The name after ``*`` may also be ``_``, so ``(x, y, *_)`` matches a sequence of at least two items without binding the remaining items.
fa: الگوهای دنباله ای از باز کردن بسته بندی طولانی پشتیبانی می کنند: ``[x, y, *rest]`` و ``(x, y, *rest)`` مشابه وظایف باز کردن بسته بندی کار می کنند. نام پس از ``*`` نیز ممکن است ``_`` باشد، بنابراین ``(x, y, *_)`` با دنباله ای از حداقل دو مورد مطابقت دارد بدون اینکه موارد باقیمانده را متصل کند.

source: Mapping patterns: ``{"bandwidth": b, "latency": l}`` captures the ``"bandwidth"`` and ``"latency"`` values from a dictionary. Unlike sequence patterns, extra keys are ignored. An unpacking like ``**rest`` is also supported. (But ``**_`` would be redundant, so it is not allowed.)
fa: الگوهای نگاشت: ``{"bandwidth": b, "latency": l}`` مقادیر ``"bandwidth"`` و ``"latency"`` را از فرهنگ لغت می گیرد. برخلاف الگوهای توالی، کلیدهای اضافی نادیده گرفته می شوند. باز کردن بسته بندی مانند ``**rest`` نیز پشتیبانی می شود. (اما ``**_`` اضافی است, بنابراین مجاز نیست.)

source: Subpatterns may be captured using the ``as`` keyword::
fa: الگوهای فرعی ممکن است با استفاده از کلمه کلیدی ``as`` ثبت شوند:

source: case (Point(x1, y1), Point(x2, y2) as p2): ...
fa: مورد (نقطه(x1, y1), نقطه (x2, y2) به عنوان p2): ...

source: will capture the second element of the input as ``p2`` (as long as the input is a sequence of two points)
fa: عنصر دوم ورودی را به عنوان ``p2`` می گیرد (تا زمانی که ورودی دنباله ای از دو نقطه باشد)

source: Most literals are compared by equality, however the singletons ``True``, ``False`` and ``None`` are compared by identity.
fa: بیشتر لفظ‌ها با برابری مقایسه می‌شوند، با این حال تک‌تن‌های ``True``، ``False`` و ``None`` با هویت مقایسه می‌شوند.

source: Patterns may use named constants. These must be dotted names to prevent them from being interpreted as capture variable::
fa: الگوها ممکن است از ثابت های نامگذاری شده استفاده کنند. این نام‌ها باید نقطه‌دار باشند تا از تفسیر آنها به عنوان متغیر ضبط جلوگیری شود:

source: For a more detailed explanation and additional examples, you can look into :pep:`636` which is written in a tutorial format.
fa: برای توضیح دقیق تر و مثال های اضافی، می توانید به :pep:`636` که در قالب آموزشی نوشته شده است نگاه کنید.

source: Defining Functions
fa: تعریف توابع

source: We can create a function that writes the Fibonacci series to an arbitrary boundary::
fa: ما می توانیم تابعی ایجاد کنیم که سری فیبوناچی را روی یک مرز دلخواه بنویسد:

source: >>> def fib(n): # write Fibonacci series less than n ... """Print a Fibonacci series less than n.""" ... a, b = 0, 1 ... while a < n: ... print(a, end=' ') ... a, b = b, a+b ... print() ... >>> # Now call the function we just defined: >>> fib(2000) 0 1 1 2 3 5 8 13 21 34 55 89 144 233 377 610 987 1597
fa: >>> def fib(n): # سری فیبوناچی را کمتر از n بنویسید ... """چاپ یک سری فیبوناچی کمتر از n.""" ... a, b = 0, 1 ... در حالی که a < n: ... print(a, end=' ') ... a, b = b, a+b ... چاپ () ... >>> # حالا تابعی را که تعریف کردیم فراخوانی کنید: >>> fib (2000) 0 1 1 2 3 5 8 13 21 34 55 89 144 233 377 610 987 1597

source: The keyword :keyword:`def` introduces a function *definition*. It must be followed by the function name and the parenthesized list of formal parameters. The statements that form the body of the function start at the next line, and must be indented.
fa: کلمه کلیدی :keyword:`def` یک تابع *definition* را معرفی می کند. پس از آن باید نام تابع و لیست پارامترهای رسمی پرانتز شده باشد. عباراتی که بدنه تابع را تشکیل می دهند از خط بعدی شروع می شوند و باید تورفتگی داشته باشند.
