Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/tutorial/datastructures.po
Languages: fa

source: It is best to think of a dictionary as a set of *key: value* pairs, with the requirement that the keys are unique (within one dictionary). A pair of braces creates an empty dictionary: ``{}``. Placing a comma-separated list of key:value pairs within the braces adds initial key:value pairs to the dictionary; this is also the way dictionaries are written on output.
fa: بهتر است دیکشنری را مجموعه‌ای از جفت‌های *key: value* در نظر بگیرید، با این شرط که کلیدها منحصر به فرد باشند (در یک فرهنگ لغت). یک جفت بریس یک فرهنگ لغت خالی ایجاد می کند: ``{}``. قرار دادن یک لیست جدا شده با کاما از جفت های کلید:مقدار در داخل پرانتز، جفت های کلید:مقدار اولیه را به فرهنگ لغت اضافه می کند. این روشی است که دیکشنری ها روی خروجی نوشته می شوند.

source: The main operations on a dictionary are storing a value with some key and extracting the value given the key. It is also possible to delete a key:value pair with ``del``. If you store using a key that is already in use, the old value associated with that key is forgotten. It is an error to extract a value using a non-existent key.
fa: عملیات اصلی در یک فرهنگ لغت، ذخیره یک مقدار با مقداری کلید و استخراج مقدار داده شده کلید است. همچنین امکان حذف یک جفت کلید: ارزش با ``del`` وجود دارد. اگر با استفاده از کلیدی که قبلاً در حال استفاده است ذخیره کنید، مقدار قدیمی مرتبط با آن کلید فراموش می شود. استخراج یک مقدار با استفاده از کلیدی که وجود ندارد یک خطا است.

source: Performing ``list(d)`` on a dictionary returns a list of all the keys used in the dictionary, in insertion order (if you want it sorted, just use ``sorted(d)`` instead). To check whether a single key is in the dictionary, use the :keyword:`in` keyword.
fa: اجرای ``list(d)`` در دیکشنری فهرستی از تمام کلیدهای استفاده شده در فرهنگ لغت را به ترتیب درج برمی گرداند (اگر می خواهید مرتب شود, فقط از ``sorted(d)`` استفاده کنید). برای بررسی اینکه آیا یک کلید در فرهنگ لغت وجود دارد یا خیر، از کلمه کلیدی :keyword:`in` استفاده کنید.

source: Here is a small example using a dictionary::
fa: در اینجا یک مثال کوچک با استفاده از فرهنگ لغت آورده شده است:

source: The :func:`dict` constructor builds dictionaries directly from sequences of key-value pairs::
fa: سازنده :func:`dict` دیکشنری ها را مستقیماً از دنباله های جفت کلید-مقدار می سازد:

source: In addition, dict comprehensions can be used to create dictionaries from arbitrary key and value expressions::
fa: علاوه بر این، درک دیکت می تواند برای ایجاد فرهنگ لغت از عبارات کلیدی و مقادیر دلخواه استفاده شود:

source: When the keys are simple strings, it is sometimes easier to specify pairs using keyword arguments::
fa: وقتی کلیدها رشته های ساده ای هستند، گاهی اوقات تعیین جفت ها با استفاده از آرگومان های کلیدواژه آسان تر است:

source: Looping Techniques
fa: تکنیک های حلقه زدن

source: When looping through dictionaries, the key and corresponding value can be retrieved at the same time using the :meth:`~dict.items` method. ::
fa: هنگام حلقه زدن در فرهنگ لغت، کلید و مقدار مربوطه را می توان همزمان با استفاده از روش :meth:`~dict.items` بازیابی کرد. ::

source: >>> knights = {'gallahad': 'the pure', 'robin': 'the brave'} >>> for k, v in knights.items(): ... print(k, v) ... gallahad the pure robin the brave
fa: >>> شوالیه ها = {'gallahad': 'پاک', 'robin': 'شجاع'} >>> برای k, v در knights.items(): ... چاپ (k, v) ... گالاهاد ناب رابین شجاع

source: When looping through a sequence, the position index and corresponding value can be retrieved at the same time using the :func:`enumerate` function. ::
fa: هنگام حلقه زدن از طریق یک دنباله، شاخص موقعیت و مقدار مربوطه را می توان همزمان با استفاده از تابع :func:`enumerate` بازیابی کرد. ::

source: >>> for i, v in enumerate(['tic', 'tac', 'toe']): ... print(i, v) ... 0 tic 1 tac 2 toe
fa: >>> برای i, v در enumerate(['tic', 'tac', 'toe']): ... چاپ (i, v) ... 0 تیک 1 تاک 2 انگشت پا

source: To loop over two or more sequences at the same time, the entries can be paired with the :func:`zip` function. ::
fa: برای حلقه روی دو یا چند دنباله به طور همزمان، ورودی ها را می توان با تابع :func:`zip` جفت کرد. ::

source: >>> questions = ['name', 'quest', 'favorite color'] >>> answers = ['lancelot', 'the holy grail', 'blue'] >>> for q, a in zip(questions, answers): ... print('What is your {0}? It is {1}.'.format(q, a)) ... What is your name? It is lancelot. What is your quest? It is the holy grail. What is your favorite color? It is blue.
fa: >>> سوالات = ['نام', 'پرسش', 'رنگ مورد علاقه'] >>> پاسخ ها = ['Lancelot', 'Grail مقدس', 'Blue'] >>> برای q, a در zip (سوالات, پاسخ): ... print('{0} شما چیست؟ {1} است.'.format(q, a)) ... نام شما چیست؟ لانسلوت است. جستجوی شما چیست؟ جام مقدس است. رنگ مورد علاقه شما چیست؟ آبی است.

source: To loop over a sequence in reverse, first specify the sequence in a forward direction and then call the :func:`reversed` function. ::
fa: برای چرخش بر روی یک دنباله به صورت معکوس، ابتدا دنباله را در جهت جلو مشخص کنید و سپس تابع :func:`reversed` را فراخوانی کنید. ::

source: To loop over a sequence in sorted order, use the :func:`sorted` function which returns a new sorted list while leaving the source unaltered. ::
fa: برای حلقه زدن روی یک دنباله به ترتیب مرتب شده، از تابع :func:`sorted` استفاده کنید که یک لیست مرتب شده جدید را برمی گرداند در حالی که منبع را بدون تغییر باقی می گذارد. ::

source: Using :func:`set` on a sequence eliminates duplicate elements. The use of :func:`sorted` in combination with :func:`set` over a sequence is an idiomatic way to loop over unique elements of the sequence in sorted order. ::
fa: استفاده از :func:`set` روی یک دنباله، عناصر تکراری را حذف می کند. استفاده از :func:`sorted` در ترکیب با :func:`set` روی یک دنباله، روشی اصطلاحی برای حلقه زدن عناصر منحصر به فرد دنباله به ترتیب مرتب شده است. ::

source: It is sometimes tempting to change a list while you are looping over it; however, it is often simpler and safer to create a new list instead. ::
fa: گاهی اوقات وسوسه انگیز است که یک لیست را در حالی که در حال بررسی آن هستید تغییر دهید. با این حال، ایجاد یک لیست جدید اغلب ساده تر و ایمن تر است. ::

source: More on Conditions
fa: بیشتر در مورد شرایط

source: The conditions used in ``while`` and ``if`` statements can contain any operators, not just comparisons.
fa: شرایط استفاده شده در دستورات ``while`` و ``if`` می تواند شامل هر عملگر باشد، نه فقط مقایسه.

source: The comparison operators ``in`` and ``not in`` are membership tests that determine whether a value is in (or not in) a container. The operators ``is`` and ``is not`` compare whether two objects are really the same object. All comparison operators have the same priority, which is lower than that of all numerical operators.
fa: عملگرهای مقایسه ``in`` و ``not in`` تست های عضویت هستند که تعیین می کنند آیا یک مقدار در (یا نه) یک ظرف است. عملگرهای ``is`` و ``is not`` مقایسه می کنند که آیا دو شی واقعاً یک شی هستند یا خیر. همه عملگرهای مقایسه دارای اولویت یکسانی هستند که از همه عملگرهای عددی کمتر است.

source: Comparisons can be chained. For example, ``a < b == c`` tests whether ``a`` is less than ``b`` and moreover ``b`` equals ``c``.
fa: مقایسه ها را می توان زنجیره ای کرد. به عنوان مثال، ``a < b == c`` تست می کند که آیا ``a`` کمتر از ``b`` است و علاوه بر این، ``b`` برابر با ``c`` است.

source: Comparisons may be combined using the Boolean operators ``and`` and ``or``, and the outcome of a comparison (or of any other Boolean expression) may be negated with ``not``. These have lower priorities than comparison operators; between them, ``not`` has the highest priority and ``or`` the lowest, so that ``A and not B or C`` is equivalent to ``(A and (not B)) or C``. As always, parentheses can be used to express the desired composition.
fa: مقایسه ها ممکن است با استفاده از عملگرهای بولی ``and`` و ``or`` ترکیب شوند و نتیجه مقایسه (یا هر عبارت بولی دیگر) با ``not`` نفی شود. اینها نسبت به اپراتورهای مقایسه اولویت کمتری دارند. در بین آنها ``not`` بیشترین اولویت و ``or`` کمترین اولویت را دارد به طوری که ``A and not B or C`` معادل ``(A and (not B)) or C`` است. مثل همیشه می توان از پرانتز برای بیان ترکیب مورد نظر استفاده کرد.

source: The Boolean operators ``and`` and ``or`` are so-called *short-circuit* operators: their arguments are evaluated from left to right, and evaluation stops as soon as the outcome is determined. For example, if ``A`` and ``C`` are true but ``B`` is false, ``A and B and C`` does not evaluate the expression ``C``. When used as a general value and not as a Boolean, the return value of a short-circuit operator is the last evaluated argument.
fa: عملگرهای Boolean ``and`` و ``or`` اصطلاحاً عملگرهای *short-circuit* هستند: آرگومان های آنها از چپ به راست ارزیابی می شوند و به محض تعیین نتیجه ارزیابی متوقف می شود. به عنوان مثال، اگر ``A`` و ``C`` درست باشند اما ``B`` نادرست باشد، ``A and B and C`` عبارت ``C`` را ارزیابی نمی کند. هنگامی که به عنوان یک مقدار کلی و نه به عنوان یک بولی استفاده می شود، مقدار بازگشتی یک اپراتور اتصال کوتاه آخرین آرگومان ارزیابی شده است.

source: It is possible to assign the result of a comparison or other Boolean expression to a variable. For example, ::
fa: می توان نتیجه یک مقایسه یا عبارت بولی دیگر را به یک متغیر اختصاص داد. به عنوان مثال، ::

source: Note that in Python, unlike C, assignment inside expressions must be done explicitly with the :ref:`walrus operator <why-can-t-i-use-an-assignment-in-an-expression>` ``:=``. This avoids a common class of problems encountered in C programs: typing ``=`` in an expression when ``==`` was intended.
fa: توجه داشته باشید که در پایتون، برخلاف C، تخصیص درون عبارات باید به طور صریح با :ref:`walrus operator <why-can-t-i-use-an-assignment-in-an-expression>` ``:=`` انجام شود. با این کار از یک کلاس رایج از مشکلاتی که در برنامه‌های C با آن مواجه می‌شوید جلوگیری می‌شود: تایپ ``=`` در یک عبارت زمانی که ``==`` در نظر گرفته شده بود.

source: Comparing Sequences and Other Types
fa: مقایسه توالی ها و انواع دیگر

source: Sequence objects typically may be compared to other objects with the same sequence type. The comparison uses *lexicographical* ordering: first the first two items are compared, and if they differ this determines the outcome of the comparison; if they are equal, the next two items are compared, and so on, until either sequence is exhausted. If two items to be compared are themselves sequences of the same type, the lexicographical comparison is carried out recursively. If all items of two sequences compare equal, the sequences are considered equal. If one sequence is an initial sub-sequence of the other, the shorter sequence is the smaller (lesser) one. Lexicographical ordering for strings uses the Unicode code point number to order individual characters. Some examples of comparisons between sequences of the same type::
fa: اشیاء دنباله معمولاً ممکن است با اشیاء دیگر با همان نوع توالی مقایسه شوند. مقایسه از ترتیب *lexicographical* استفاده می کند: ابتدا دو مورد اول با هم مقایسه می شوند و اگر متفاوت باشند، نتیجه مقایسه را مشخص می کند. اگر مساوی باشند، دو مورد بعدی با هم مقایسه می شوند، و به همین ترتیب، تا زمانی که هر یک از دنباله ها تمام شود. اگر دو مورد برای مقایسه، خود توالی هایی از یک نوع باشند، مقایسه واژگانی به صورت بازگشتی انجام می شود. اگر همه آیتم های دو دنباله با هم برابر باشند، دنباله ها برابر در نظر گرفته می شوند. اگر یک دنباله زیر دنباله ابتدایی دیگری باشد، دنباله کوتاهتر کوچکتر (کوچکتر) است. ترتیب واژگانی رشته‌ها از شماره نقطه کد یونیکد برای مرتب کردن کاراکترها استفاده می‌کند. چند نمونه از مقایسه بین دنباله هایی از یک نوع::

source: Note that comparing objects of different types with ``<`` or ``>`` is legal provided that the objects have appropriate comparison methods. For example, mixed numeric types are compared according to their numeric value, so 0 equals 0.0, etc. Otherwise, rather than providing an arbitrary ordering, the interpreter will raise a :exc:`TypeError` exception.
fa: توجه داشته باشید که مقایسه اشیاء از انواع مختلف با ``<`` یا ``>`` قانونی است مشروط بر اینکه اشیاء دارای روش های مقایسه مناسب باشند. به عنوان مثال، انواع عددی مختلط با توجه به مقدار عددی آنها مقایسه می شوند، بنابراین 0 برابر با 0.0 و غیره است. در غیر این صورت، به جای ارائه یک ترتیب دلخواه، مفسر یک استثنا :exc:`TypeError` را ایجاد می کند.

source: Footnotes
fa: پاورقی ها

source: Other languages may return the mutated object, which allows method chaining, such as ``d->insert("a")->remove("b")->sort();``.
fa: زبان های دیگر ممکن است شی جهش یافته را برگردانند، که امکان زنجیره متد را فراهم می کند، مانند ``d->insert("a")->remove("b")->sort();``.
