Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/tutorial/datastructures.po
Languages: fa

source: Data Structures
fa: ساختارهای داده

source: This chapter describes some things you've learned about already in more detail, and adds some new things as well.
fa: این فصل برخی از چیزهایی را که قبلاً در مورد آنها آموخته اید را با جزئیات بیشتر توضیح می دهد و همچنین موارد جدیدی را اضافه می کند.

source: More on Lists
fa: اطلاعات بیشتر در مورد لیست ها

source: The list data type has some more methods. Here are all of the methods of list objects:
fa: نوع داده لیست روش های بیشتری دارد. در اینجا همه روش های لیست اشیاء آمده است:

source: Add an item to the end of the list. Similar to ``a[len(a):] = [x]``.
fa: یک مورد را به انتهای لیست اضافه کنید. مشابه ``a[len(a):] = [x]``.

source: Extend the list by appending all the items from the iterable. Similar to ``a[len(a):] = iterable``.
fa: لیست را با اضافه کردن همه موارد از تکرار شونده گسترش دهید. مشابه ``a[len(a):] = iterable``.

source: Insert an item at a given position. The first argument is the index of the element before which to insert, so ``a.insert(0, x)`` inserts at the front of the list, and ``a.insert(len(a), x)`` is equivalent to ``a.append(x)``.
fa: یک مورد را در یک موقعیت مشخص درج کنید. اولین آرگومان شاخص عنصری است که قبل از آن درج می شود، بنابراین ``a.insert(0, x)`` در جلوی لیست قرار می گیرد و ``a.insert(len(a), x)`` معادل ``a.append(x)`` است.

source: Remove the first item from the list whose value is equal to *x*. It raises a :exc:`ValueError` if there is no such item.
fa: اولین مورد را که مقدار آن برابر با *x* است را از لیست حذف کنید. اگر چنین موردی وجود نداشته باشد، یک :exc:`ValueError` را افزایش می دهد.

source: Remove the item at the given position in the list, and return it. If no index is specified, ``a.pop()`` removes and returns the last item in the list. It raises an :exc:`IndexError` if the list is empty or the index is outside the list range.
fa: مورد را در موقعیت داده شده در لیست بردارید و آن را برگردانید. اگر هیچ شاخصی مشخص نشده باشد، ``a.pop()`` آخرین مورد از لیست را حذف کرده و برمی گرداند. اگر لیست خالی باشد یا ایندکس خارج از محدوده لیست باشد، یک :exc:`IndexError` را افزایش می دهد.

source: Remove all items from the list. Similar to ``del a[:]``.
fa: تمام موارد را از لیست حذف کنید. مشابه ``del a[:]``.

source: Return zero-based index in the list of the first item whose value is equal to *x*. Raises a :exc:`ValueError` if there is no such item.
fa: شاخص مبتنی بر صفر را در لیست اولین موردی که مقدار آن برابر با *x* است، برگردانید. اگر چنین موردی وجود نداشته باشد، یک :exc:`ValueError` را افزایش می دهد.

source: The optional arguments *start* and *end* are interpreted as in the slice notation and are used to limit the search to a particular subsequence of the list. The returned index is computed relative to the beginning of the full sequence rather than the *start* argument.
fa: آرگومان های اختیاری *start* و *end* به صورت نماد برش تفسیر می شوند و برای محدود کردن جستجو به دنباله خاصی از لیست استفاده می شوند. شاخص برگشتی به جای آرگومان *start* نسبت به ابتدای دنباله کامل محاسبه می شود.

source: Return the number of times *x* appears in the list.
fa: تعداد دفعاتی که *x* در لیست ظاهر می شود را برگردانید.

source: Sort the items of the list in place (the arguments can be used for sort customization, see :func:`sorted` for their explanation).
fa: موارد لیست را در جای خود مرتب کنید (از آرگومان ها می توان برای سفارشی سازی مرتب سازی استفاده کرد, برای توضیح آنها به :func:`sorted` مراجعه کنید).

source: Reverse the elements of the list in place.
fa: عناصر لیست را در جای خود معکوس کنید.

source: Return a shallow copy of the list. Similar to ``a[:]``.
fa: یک کپی کم عمق از لیست را برگردانید. مشابه ``a[:]``.

source: An example that uses most of the list methods::
fa: مثالی که از اکثر متدهای لیست استفاده می کند:

source: You might have noticed that methods like ``insert``, ``remove`` or ``sort`` that only modify the list have no return value printed -- they return the default ``None``. [#]_ This is a design principle for all mutable data structures in Python.
fa: شاید متوجه شده باشید که روش‌هایی مانند ``insert``، ``remove`` یا ``sort`` که فقط فهرست را اصلاح می‌کنند، هیچ مقدار بازگشتی چاپ نشده‌اند -- آنها ``None`` پیش‌فرض را برمی‌گردانند. [#]_ این یک اصل طراحی برای تمام ساختارهای داده قابل تغییر در پایتون است.

source: Another thing you might notice is that not all data can be sorted or compared. For instance, ``[None, 'hello', 10]`` doesn't sort because integers can't be compared to strings and ``None`` can't be compared to other types. Also, there are some types that don't have a defined ordering relation. For example, ``3+4j < 5+7j`` isn't a valid comparison.
fa: نکته دیگری که ممکن است متوجه شوید این است که همه داده ها را نمی توان مرتب کرد یا مقایسه کرد. به عنوان مثال، ``[None, 'hello', 10]`` مرتب سازی نمی کند زیرا اعداد صحیح را نمی توان با رشته ها مقایسه کرد و ``None`` را نمی توان با انواع دیگر مقایسه کرد. همچنین، برخی از انواع وجود دارند که رابطه سفارشی مشخصی ندارند. برای مثال، ``3+4j < 5+7j`` مقایسه معتبری نیست.

source: Using Lists as Stacks
fa: استفاده از لیست ها به عنوان پشته

source: The list methods make it very easy to use a list as a stack, where the last element added is the first element retrieved ("last-in, first-out"). To add an item to the top of the stack, use :meth:`!append`. To retrieve an item from the top of the stack, use :meth:`!pop` without an explicit index. For example::
fa: روش های لیست استفاده از یک لیست را به عنوان پشته بسیار آسان می کند، جایی که آخرین عنصر اضافه شده، اولین عنصر بازیابی شده است ("آخرین ورود, اولین خروج"). برای افزودن یک آیتم به بالای پشته، از :meth:`!append` استفاده کنید. برای بازیابی یک آیتم از بالای پشته، از :meth:`!pop` بدون ایندکس صریح استفاده کنید. به عنوان مثال::

source: Using Lists as Queues
fa: استفاده از لیست ها به عنوان صف

source: It is also possible to use a list as a queue, where the first element added is the first element retrieved ("first-in, first-out"); however, lists are not efficient for this purpose. While appends and pops from the end of list are fast, doing inserts or pops from the beginning of a list is slow (because all of the other elements have to be shifted by one).
fa: همچنین می توان از یک لیست به عنوان صف استفاده کرد، که در آن اولین عنصر اضافه شده، اولین عنصر بازیابی شده است ("first-in, first-out"). با این حال، لیست ها برای این منظور کارآمد نیستند. در حالی که ضمیمه‌ها و پاپ‌ها از انتهای فهرست سریع هستند، انجام درج‌ها یا پاپ‌ها از ابتدای فهرست به کندی انجام می‌شود (زیرا همه عناصر دیگر باید با یک جابجا شوند).

source: To implement a queue, use :class:`collections.deque` which was designed to have fast appends and pops from both ends. For example::
fa: برای پیاده سازی یک صف، از :class:`collections.deque` استفاده کنید که به گونه ای طراحی شده است که دارای ضمائم سریع و پاپ از هر دو طرف باشد. به عنوان مثال::

source: List Comprehensions
fa: فهرست درک

source: List comprehensions provide a concise way to create lists. Common applications are to make new lists where each element is the result of some operations applied to each member of another sequence or iterable, or to create a subsequence of those elements that satisfy a certain condition.
fa: درک فهرست ها راهی مختصر برای ایجاد لیست ها فراهم می کند. برنامه های رایج عبارتند از ایجاد لیست های جدید که در آن هر عنصر نتیجه برخی از عملیات اعمال شده بر روی هر یک از اعضای یک دنباله دیگر یا قابل تکرار است، یا ایجاد دنباله ای از آن عناصر که شرایط خاصی را برآورده می کند.

source: For example, assume we want to create a list of squares, like::
fa: به عنوان مثال، فرض کنید می خواهیم لیستی از مربع ها ایجاد کنیم، مانند:

source: Note that this creates (or overwrites) a variable named ``x`` that still exists after the loop completes. We can calculate the list of squares without any side effects using::
fa: توجه داشته باشید که با این کار متغیری به نام ``x`` ایجاد می شود (یا بازنویسی می شود) که پس از اتمام حلقه همچنان وجود دارد. ما می توانیم لیست مربع ها را بدون هیچ گونه عوارض جانبی با استفاده از:

source: or, equivalently::
fa: یا به طور معادل::

source: which is more concise and readable.
fa: که مختصرتر و خواندنی تر است.

source: A list comprehension consists of brackets containing an expression followed by a :keyword:`!for` clause, then zero or more :keyword:`!for` or :keyword:`!if` clauses. The result will be a new list resulting from evaluating the expression in the context of the :keyword:`!for` and :keyword:`!if` clauses which follow it. For example, this listcomp combines the elements of two lists if they are not equal::
fa: درک لیست شامل براکت هایی است که شامل عبارتی به دنبال آن یک بند :keyword:`!for` و سپس صفر یا بیشتر عبارت :keyword:`!for` یا :keyword:`!if` است. نتیجه یک لیست جدید خواهد بود که از ارزیابی عبارت در متن بندهای :keyword:`!for` و :keyword:`!if` حاصل می شود. به عنوان مثال، این listcomp عناصر دو لیست را در صورتی که برابر نباشند ترکیب می کند:

source: and it's equivalent to::
fa: و معادل است با::

source: Note how the order of the :keyword:`for` and :keyword:`if` statements is the same in both these snippets.
fa: توجه داشته باشید که چگونه ترتیب دستورات :keyword:`for` و :keyword:`if` در هر دو قطعه یکسان است.

source: If the expression is a tuple (e.g. the ``(x, y)`` in the previous example), it must be parenthesized. ::
fa: اگر عبارت یک تاپلی باشد (مثلاً ``(x, y)`` در مثال قبلی), باید پرانتز شود. ::

source: >>> vec = [-4, -2, 0, 2, 4] >>> # create a new list with the values doubled >>> [x*2 for x in vec] [-8, -4, 0, 4, 8] >>> # filter the list to exclude negative numbers >>> [x for x in vec if x >= 0] [0, 2, 4] >>> # apply a function to all the elements >>> [abs(x) for x in vec] [4, 2, 0, 2, 4] >>> # call a method on each element >>> freshfruit = [' banana', ' loganberry ', 'passion fruit '] >>> [weapon.strip() for weapon in freshfruit] ['banana', 'loganberry', 'passion fruit'] >>> # create a list of 2-tuples like (number, square) >>> [(x, x**2) for x in range(6)] [(0, 0), (1, 1), (2, 4), (3, 9), (4, 16), (5, 25)] >>> # the tuple must be parenthesized, otherwise an error is raised >>> [x, x**2 for x in range(6)] File "<stdin>", line 1 [x, x**2 for x in range(6)] ^^^^^^^ SyntaxError: did you forget parentheses around the comprehension target? >>> # flatten a list using a listcomp with two 'for' >>> vec = [[1,2,3], [4,5,6], [7,8,9]] >>> [num for elem in vec for num in elem] [1, 2, 3, 4, 5, 6, 7, 8, 9]
fa: >>> vec = [-4, -2, 0, 2, 4] >>> # یک لیست جدید با مقادیر دو برابر شده ایجاد کنید >>> [x*2 for x in vec] [-8, -4, 0, 4, 8] >>> # filter the list to exclude negative numbers >>> [x for x in vec if x >= 0] [0, 2, 4] >>> # apply a function to all the elements >>> [abs(x) for x in vec] [4, 2, 0, 2, 4] >>> # call a method on each element >>> freshfruit = [' banana', ' loganberry ', 'passion fruit '] >>> [weapon.strip() for weapon in freshfruit] ['banana', 'loganberry', 'passion fruit'] >>> # create a list of 2-tuples like (number, square) >>> [(x, x**2) for x in range(6)] [(0, 0), (1, 1), (2, 4), (3, 9), (4, 16), (5, 25)] >>> # the tuple must be parenthesized, otherwise an error is raised >>> [x, x**2 for x in range(6)] File "<stdin>", line 1 [x, x**2 برای x در محدوده (6)] ^^^^^^^ SyntaxError: آیا پرانتزهای اطراف هدف درک مطلب را فراموش کرده اید؟ >>> # یک لیست را با استفاده از یک listcomp با دو "برای" مسطح کنید >>> vec = [[1,2,3], [4,5,6], [7,8,9]] >>> [num برای elem در vec برای num in elem] [1, 2, 3, 4, 5, 6, 7, 8, 9]

source: List comprehensions can contain complex expressions and nested functions::
fa: درک لیست می تواند شامل عبارات پیچیده و توابع تو در تو باشد:

source: Nested List Comprehensions
fa: درک لیست تودرتو

source: The initial expression in a list comprehension can be any arbitrary expression, including another list comprehension.
fa: عبارت اولیه در درک لیست می تواند هر عبارت دلخواه، از جمله درک لیست دیگری باشد.

source: Consider the following example of a 3x4 matrix implemented as a list of 3 lists of length 4::
fa: مثال زیر را از یک ماتریس 3x4 در نظر بگیرید که به صورت لیستی از 3 لیست با طول 4 پیاده سازی شده است:

source: The following list comprehension will transpose rows and columns::
fa: درک لیست زیر سطرها و ستون ها را جابجا می کند:

source: As we saw in the previous section, the inner list comprehension is evaluated in the context of the :keyword:`for` that follows it, so this example is equivalent to::
fa: همانطور که در بخش قبل دیدیم، درک فهرست داخلی در زمینه :keyword:`for` که به دنبال آن است، ارزیابی می شود، بنابراین این مثال معادل:

source: which, in turn, is the same as::
fa: که به نوبه خود همان است که:

source: In the real world, you should prefer built-in functions to complex flow statements. The :func:`zip` function would do a great job for this use case::
fa: در دنیای واقعی، شما باید توابع داخلی را به دستورات جریان پیچیده ترجیح دهید. تابع :func:`zip` کار بسیار خوبی برای این مورد استفاده می کند:

source: See :ref:`tut-unpacking-arguments` for details on the asterisk in this line.
fa: برای جزئیات بیشتر در مورد ستاره در این خط به :ref:`tut-unpacking-arguments` مراجعه کنید.

source: The :keyword:`!del` statement
fa: بیانیه :keyword:`!del`

source: There is a way to remove an item from a list given its index instead of its value: the :keyword:`del` statement. This differs from the :meth:`!pop` method which returns a value. The :keyword:`!del` statement can also be used to remove slices from a list or clear the entire list (which we did earlier by assignment of an empty list to the slice). For example::
fa: راهی برای حذف یک آیتم از فهرست با توجه به شاخص آن به جای مقدار آن وجود دارد: عبارت :keyword:`del`. این با روش :meth:`!pop` که مقداری را برمی گرداند متفاوت است. دستور :keyword:`!del` همچنین می تواند برای حذف برش ها از یک لیست یا پاک کردن کل لیست استفاده شود (که قبلاً با اختصاص یک لیست خالی به برش انجام دادیم). به عنوان مثال::

source: :keyword:`del` can also be used to delete entire variables::
fa: :keyword:`del` همچنین می تواند برای حذف کل متغیرها استفاده شود:

source: Referencing the name ``a`` hereafter is an error (at least until another value is assigned to it). We'll find other uses for :keyword:`del` later.
fa: ارجاع به نام ``a`` از این پس یک خطا است (حداقل تا زمانی که مقدار دیگری به آن اختصاص داده شود). ما بعداً کاربردهای دیگری برای :keyword:`del` پیدا خواهیم کرد.

source: We saw that lists and strings have many common properties, such as indexing and slicing operations. They are two examples of *sequence* data types (see :ref:`typesseq`). Since Python is an evolving language, other sequence data types may be added. There is also another standard sequence data type: the *tuple*.
fa: دیدیم که لیست‌ها و رشته‌ها ویژگی‌های مشترک زیادی دارند، مانند عملیات فهرست‌سازی و برش. آنها دو نمونه از انواع داده *sequence* هستند (به :ref:`typesseq` مراجعه کنید). از آنجایی که پایتون یک زبان در حال تکامل است، ممکن است انواع داده های توالی دیگری اضافه شود. نوع داده توالی استاندارد دیگری نیز وجود دارد: *tuple*.

source: A tuple consists of a number of values separated by commas, for instance::
fa: یک تاپل از تعدادی مقدار تشکیل شده است که با کاما از هم جدا شده اند، به عنوان مثال:

source: >>> t = 12345, 54321, 'hello!' >>> t[0] 12345 >>> t (12345, 54321, 'hello!') >>> # Tuples may be nested: >>> u = t, (1, 2, 3, 4, 5) >>> u ((12345, 54321, 'hello!'), (1, 2, 3, 4, 5)) >>> # Tuples are immutable: >>> t[0] = 88888 Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: 'tuple' object does not support item assignment >>> # but they can contain mutable objects: >>> v = ([1, 2, 3], [3, 2, 1]) >>> v ([1, 2, 3], [3, 2, 1])
fa: >>> t = 12345, 54321, 'سلام!' >>> t[0] 12345 >>> ت (12345, 54321, 'سلام!') >>> # تاپل ممکن است تو در تو باشد: >>> u = t, (1, 2, 3, 4, 5) >>> تو ((12345, 54321, 'سلام!')، (1, 2, 3, 4, 5)) >>> # تاپل تغییرناپذیر است: >>> t[0] = 88888 ردیابی (آخرین تماس اخیر): فایل "<stdin>", خط 1، در <module> TypeError: شیء 'tuple' از انتساب آیتم پشتیبانی نمی کند >>> # اما می توانند شامل اشیاء قابل تغییر باشند: >>> v = ([1, 2, 3], [3, 2, 1]) >>> v ([1, 2, 3], [3, 2, 1])

source: As you see, on output tuples are always enclosed in parentheses, so that nested tuples are interpreted correctly; they may be input with or without surrounding parentheses, although often parentheses are necessary anyway (if the tuple is part of a larger expression). It is not possible to assign to the individual items of a tuple, however it is possible to create tuples which contain mutable objects, such as lists.
fa: همانطور که می بینید، تاپل های خروجی همیشه در داخل پرانتز قرار می گیرند، به طوری که تاپل های تو در تو به درستی تفسیر می شوند. آنها ممکن است با یا بدون پرانتزهای اطراف وارد شوند، اگرچه اغلب پرانتزها به هر حال ضروری هستند (اگر تاپل بخشی از یک عبارت بزرگتر باشد). نمی‌توان به تک تک آیتم‌های یک تاپل اختصاص داد، با این حال می‌توان تاپل‌هایی ایجاد کرد که حاوی اشیاء قابل تغییر، مانند لیست‌ها هستند.

source: Though tuples may seem similar to lists, they are often used in different situations and for different purposes. Tuples are :term:`immutable`, and usually contain a heterogeneous sequence of elements that are accessed via unpacking (see later in this section) or indexing (or even by attribute in the case of :func:`namedtuples <collections.namedtuple>`). Lists are :term:`mutable`, and their elements are usually homogeneous and are accessed by iterating over the list.
fa: اگرچه تاپل ها ممکن است شبیه به لیست ها به نظر برسند، اما اغلب در موقعیت های مختلف و برای اهداف مختلف استفاده می شوند. تاپل ها :term:`immutable` هستند و معمولاً شامل یک توالی ناهمگن از عناصر هستند که از طریق باز کردن بسته بندی (به بعد در این بخش مراجعه کنید) یا نمایه سازی (یا حتی با ویژگی در مورد :func:`namedtuples <collections.namedtuple>`) قابل دسترسی هستند. لیست ها :term:`mutable` هستند و عناصر آنها معمولاً همگن هستند و با تکرار در لیست قابل دسترسی هستند.

source: A special problem is the construction of tuples containing 0 or 1 items: the syntax has some extra quirks to accommodate these. Empty tuples are constructed by an empty pair of parentheses; a tuple with one item is constructed by following a value with a comma (it is not sufficient to enclose a single value in parentheses). Ugly, but effective. For example::
fa: یک مشکل خاص ساخت تاپل هایی است که حاوی 0 یا 1 آیتم هستند: نحو دارای برخی ویژگی های عجیب و غریب برای جا دادن این موارد است. تاپل های خالی با یک جفت پرانتز خالی ساخته می شوند. یک تاپل با یک آیتم با دنبال کردن یک مقدار با کاما ساخته می‌شود (اینکه یک مقدار را در پرانتز قرار دهید کافی نیست). زشت، اما موثر. به عنوان مثال::

source: The statement ``t = 12345, 54321, 'hello!'`` is an example of *tuple packing*: the values ``12345``, ``54321`` and ``'hello!'`` are packed together in a tuple. The reverse operation is also possible::
fa: عبارت ``t = 12345, 54321, 'hello!'`` نمونه ای از *tuple packing* است: مقادیر ``12345``، ``54321`` و ``'hello!'`` در یک تاپیک با هم بسته بندی شده اند. عملیات معکوس نیز امکان پذیر است:

source: This is called, appropriately enough, *sequence unpacking* and works for any sequence on the right-hand side. Sequence unpacking requires that there are as many variables on the left side of the equals sign as there are elements in the sequence. Note that multiple assignment is really just a combination of tuple packing and sequence unpacking.
fa: این به اندازه کافی *sequence unpacking* نامیده می شود و برای هر دنباله ای در سمت راست کار می کند. باز کردن توالی مستلزم آن است که به تعداد عناصر موجود در دنباله، در سمت چپ علامت تساوی متغیر وجود داشته باشد. توجه داشته باشید که تخصیص چندگانه در واقع فقط ترکیبی از بسته بندی چندگانه و باز کردن توالی است.

source: Sets
fa: مجموعه ها

source: Python also includes a data type for *sets*. A set is an unordered collection with no duplicate elements. Basic uses include membership testing and eliminating duplicate entries. Set objects also support mathematical operations like union, intersection, difference, and symmetric difference.
fa: پایتون همچنین شامل یک نوع داده برای *sets* است. مجموعه یک مجموعه نامرتب و بدون عناصر تکراری است. کاربردهای اصلی شامل تست عضویت و حذف ورودی های تکراری است. اشیاء مجموعه همچنین از عملیات ریاضی مانند اتحاد، تقاطع، تفاوت و تفاوت متقارن پشتیبانی می کنند.

source: Curly braces or the :func:`set` function can be used to create sets. Note: to create an empty set you have to use ``set()``, not ``{}``; the latter creates an empty dictionary, a data structure that we discuss in the next section.
fa: برای ایجاد مجموعه می توان از بریس های فرفری یا تابع :func:`set` استفاده کرد. توجه: برای ایجاد یک مجموعه خالی باید از ``set()`` استفاده کنید نه ``{}``. دومی یک فرهنگ لغت خالی ایجاد می کند، یک ساختار داده که در بخش بعدی به آن می پردازیم.

source: Here is a brief demonstration::
fa: در اینجا یک نمایش کوتاه وجود دارد:

source: >>> basket = {'apple', 'orange', 'apple', 'pear', 'orange', 'banana'} >>> print(basket) # show that duplicates have been removed {'orange', 'banana', 'pear', 'apple'} >>> 'orange' in basket # fast membership testing True >>> 'crabgrass' in basket False >>> # Demonstrate set operations on unique letters from two words >>> >>> a = set('abracadabra') >>> b = set('alacazam') >>> a # unique letters in a {'a', 'r', 'b', 'c', 'd'} >>> a - b # letters in a but not in b {'r', 'd', 'b'} >>> a | b # letters in a or b or both {'a', 'c', 'r', 'd', 'b', 'm', 'z', 'l'} >>> a & b # letters in both a and b {'a', 'c'} >>> a ^ b # letters in a or b but not both {'r', 'd', 'b', 'm', 'z', 'l'}
fa: >>> سبد = {'سیب', 'پرتقال', 'سیب', 'گلابی', 'پرتقال', 'موز'} >>> print(basket) # نشان می دهد که موارد تکراری حذف شده اند {'پرتقال', 'موز', 'گلابی', 'سیب'} >>> 'نارنجی' در سبد # تست عضویت سریع درست است >>> 'خرچنگ' در سبد نادرست >>> # عملیات مجموعه را روی حروف منحصر به فرد از دو کلمه نشان دهید >>> >>> a = مجموعه ('abracadabra') >>> b = مجموعه ('alacazam') >>> یک # حرف منحصر به فرد در a {'a', 'r', 'b', 'c', 'd'} >>> a - b # حرف در a اما نه در b {'r', 'd', 'b'} >>> یک | b # حروف در a یا b یا هر دو {'a', 'c', 'r', 'd', 'b', 'm', 'z', 'l'} >>> a & b # حروف در هر دو a و b {'a', 'c'} >>> a ^ b # حروف a یا b اما نه هر دو {'r', 'd', 'b', 'm', 'z', 'l'}

source: Similarly to :ref:`list comprehensions <tut-listcomps>`, set comprehensions are also supported::
fa: مانند :ref:`list comprehensions <tut-listcomps>`، درک مجموعه نیز پشتیبانی می شود:

source: Dictionaries
fa: لغت نامه ها

source: Another useful data type built into Python is the *dictionary* (see :ref:`typesmapping`). Dictionaries are sometimes found in other languages as "associative memories" or "associative arrays". Unlike sequences, which are indexed by a range of numbers, dictionaries are indexed by *keys*, which can be any immutable type; strings and numbers can always be keys. Tuples can be used as keys if they contain only strings, numbers, or tuples; if a tuple contains any mutable object either directly or indirectly, it cannot be used as a key. You can't use lists as keys, since lists can be modified in place using index assignments, slice assignments, or methods like :meth:`!append` and :meth:`!extend`.
fa: نوع داده مفید دیگری که در پایتون تعبیه شده است، *dictionary* است (به :ref:`typesmapping` مراجعه کنید). واژه‌نامه‌ها گاهی در زبان‌های دیگر به‌عنوان «خاطرات انجمنی» یا «آرایه‌های انجمنی» یافت می‌شوند. بر خلاف دنباله‌ها که با طیفی از اعداد نمایه می‌شوند، لغتنامه‌ها با *keys* نمایه می‌شوند که می‌تواند هر نوع تغییرناپذیری باشد. رشته ها و اعداد همیشه می توانند کلید باشند. اگر تاپل ها فقط شامل رشته ها، اعداد یا تاپل ها باشند، می توانند به عنوان کلید استفاده شوند. اگر یک تاپل حاوی هر شیء قابل تغییر به طور مستقیم یا غیر مستقیم باشد، نمی توان از آن به عنوان کلید استفاده کرد. نمی‌توانید از فهرست‌ها به عنوان کلید استفاده کنید، زیرا فهرست‌ها را می‌توان با استفاده از تخصیص فهرست، تخصیص برش یا روش‌هایی مانند :meth:`!append` و :meth:`!extend` تغییر داد.
