Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/tutorial/errors.po
Languages: de, fa, hu, ru

source: Exception handlers don't just handle exceptions if they occur immediately in the try clause, but also if they occur inside functions that are called (even indirectly) in the try clause. For example::
hu: A kivételkezelők nem csak akkor kezelik a kivételeket, ha azok ténylegesen a try ágban szerepelnek, hanem akkor is, ha azok valamelyik try-ágban meghívott függvényben szerepelnek (akár közvetve is). Például::

source: Exception classes can be defined which do anything any other class can do, but are usually kept simple, often only offering a number of attributes that allow information about the error to be extracted by handlers for the exception. When creating a module that can raise several distinct errors, a common practice is to create a base class for exceptions defined by that module, and subclass that to create specific exception classes for different error conditions::
hu: Létre tudunk hozni kivétel osztályokat, amik ugyanazt csinálják, mint bármi más osztály, de általában egyszerűbbek, gyakran csak néhány jellemzőt kínálnak a hibáról, amik lehetővé teszik, hogy a hibára vonatkozó információkat a hibakezelők kinyerjék. Amikor egy olyan modult hozunk létre, ami sok különböző hibát tud dobni, egy bevett gyakorlat, hogy létrehozunk egy alaposztályt a modul által dobott hibáknak és egy alosztályt, ami létrehoz különböző hibosztályokat különböző hiba feltételekhez.
