Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/tutorial/errors.po
Languages: de, fa, hu, ru

source: Some objects define standard clean-up actions to be undertaken when the object is no longer needed, regardless of whether or not the operation using the object succeeded or failed. Look at the following example, which tries to open a file and print its contents to the screen. ::
de: Einige Objekte definieren Standardbereinigungsaktionen, die durchgeführt werden, wenn das Objekt nicht mehr benötigt wird, unabhängig davon, ob der Vorgang mit dem Objekt erfolgreich war oder fehlgeschlagen ist. Schauen Sie sich das folgende Beispiel an, in dem versucht wird, eine Datei zu öffnen und ihren Inhalt auf dem Bildschirm auszugeben. ::
fa: برخی از اشیاء اقدامات پاکسازی استانداردی را تعریف می‌کنند که باید در مواقعی که شی دیگر مورد نیاز نیست، انجام شود، صرف نظر از اینکه آیا عملیات با استفاده از شی موفقیت‌آمیز بوده یا ناموفق بوده است. به مثال زیر نگاه کنید، که سعی می کند یک فایل را باز کند و محتویات آن را روی صفحه چاپ کند. ::
hu: Pár objektum sztenderd tisztogató eljárásokat definiál arra az esetre, amikor az objektum szükségtelenné válik, tekintet nélkül arra, hogy az objektummal végzett dolgok sikeresen vagy sikertelenül zárultak. Nézzük a következő példát, amely meg próbál nyitni egy fájlt, és kiírni a tartalmát a képernyőre. ::
ru: Некоторые объекты определяют стандартные действия по уборке, которые применяются, когда объект больше не нужен. Рассмотрим пример кода, который открывает файл и печатает все строки из него. ::

source: The problem with this code is that it leaves the file open for an indeterminate amount of time after this part of the code has finished executing. This is not an issue in simple scripts, but can be a problem for larger applications. The :keyword:`with` statement allows objects like files to be used in a way that ensures they are always cleaned up promptly and correctly. ::
de: Das Problem bei diesem Code besteht darin, dass die Datei für eine unbestimmte Zeit geöffnet bleibt, nachdem die Ausführung dieses Teils des Codes abgeschlossen ist. Dies ist bei einfachen Skripten kein Problem, kann jedoch bei größeren Anwendungen ein Problem darstellen. Die :keyword:`with` Anweisung ermöglicht die Verwendung von Objekten wie Dateien auf eine Weise, die sicherstellt, dass sie stets zeitnah und korrekt bereinigt werden. ::
fa: مشکل این کد این است که پس از اتمام اجرای این قسمت از کد، فایل را برای مدت زمان نامشخصی باز می گذارد. این مشکل در اسکریپت های ساده نیست، اما می تواند برای برنامه های بزرگتر مشکل ساز باشد. دستور :keyword:`with` به اشیایی مانند فایل‌ها اجازه می‌دهد به گونه‌ای استفاده شوند که اطمینان حاصل شود که همیشه به‌درستی و به‌درستی پاک می‌شوند. ::
hu: Az a baj ezzel a kóddal, hogy a fájlt nyitva hagyja miután ez a kód végrehajtásra került. Ez nem jelent gondot egyszerűbb szkriptekben, de nagyobb alkalmazások esetén gondot okozhat. A :keyword:`with` utasítás lehetővé teszi olyan objektumok esetén, mint a fájlok, hogy olyan módon hasznájuk, amely lehetővé teszi, hogy mindig azonnal és megfelelő módon tisztogassunk. ::
ru: У этого кода есть недостаток: в результате файл остаётся открытым неопределённое количество времени. В небольших скриптах это не проблема, но в крупных приложениях может привести к неприятностям. Инструкция :keyword:`with` позволяет использовать объекты таким образом, чтобы они всегда очищали свои ресурсы незамедлительно и корректно.

source: After the statement is executed, the file *f* is always closed, even if a problem was encountered while processing the lines. Objects which, like files, provide predefined clean-up actions will indicate this in their documentation.
de: Nach Ausführung der Anweisung wird die Datei *f* immer geschlossen, auch wenn bei der Verarbeitung der Zeilen ein Problem aufgetreten ist. Objekte, die wie Dateien vordefinierte Bereinigungsaktionen bereitstellen, weisen in ihrer Dokumentation darauf hin.
fa: پس از اجرای دستور، فایل *f* همیشه بسته می شود، حتی اگر هنگام پردازش خطوط با مشکلی مواجه شود. اشیایی که مانند فایل‌ها، اقدامات پاکسازی از پیش تعریف شده را ارائه می‌کنند، این موضوع را در مستندات خود نشان می‌دهند.
hu: Miután az utasítás végrehajtódik, az *f* fájl mindig zárva lesz, akkor is, ha a sorok feldolgozása közben baj történt. Az olyan objektumok, mint amilyenek a fájlok, előre definiált tisztogató eljárásokkal rendelkeznek. Ezt a dokumentációjukból megtudhatjuk.
ru: После того, как код внутри :keyword:`!with` выполнился, файл *f* всегда будет закрыт, даже если при обработке строк возникла ошибка. О действиях по очистке ресурсов для объектов, которые, как файлы, их поддерживают, можно узнать в документации соответствующего класса.

source: Raising and Handling Multiple Unrelated Exceptions
fa: ایجاد و رسیدگی به استثناهای متعدد نامربوط

source: There are situations where it is necessary to report several exceptions that have occurred. This is often the case in concurrency frameworks, when several tasks may have failed in parallel, but there are also other use cases where it is desirable to continue execution and collect multiple errors rather than raise the first exception.
fa: شرایطی وجود دارد که لازم است چندین استثناء رخ داده گزارش شود. این اغلب در چارچوب‌های همزمانی اتفاق می‌افتد، زمانی که چندین کار ممکن است به طور موازی شکست بخورند، اما موارد استفاده دیگری نیز وجود دارد که در آن‌ها به جای مطرح کردن اولین استثنا، ادامه اجرا و جمع‌آوری خطاهای متعدد مطلوب است.

source: The builtin :exc:`ExceptionGroup` wraps a list of exception instances so that they can be raised together. It is an exception itself, so it can be caught like any other exception. ::
fa: :exc:`ExceptionGroup` داخلی فهرستی از موارد استثنا را می‌پیچد تا بتوان آنها را با هم افزایش داد. این خود یک استثنا است، بنابراین می توان آن را مانند هر استثنا دیگری گرفت. ::

source: >>> def f(): ... excs = [OSError('error 1'), SystemError('error 2')] ... raise ExceptionGroup('there were problems', excs) ... >>> f() + Exception Group Traceback (most recent call last): | File "<stdin>", line 1, in <module> | f() | ~^^ | File "<stdin>", line 3, in f | raise ExceptionGroup('there were problems', excs) | ExceptionGroup: there were problems (2 sub-exceptions) +-+---------------- 1 ---------------- | OSError: error 1 +---------------- 2 ---------------- | SystemError: error 2 +------------------------------------ >>> try: ... f() ... except Exception as e: ... print(f'caught {type(e)}: e') ... caught <class 'ExceptionGroup'>: e >>>
fa: >>> def f(): ... excs = [OSError('Error 1'), SystemError('Error 2')] ... رایز ExceptionGroup ("مشکلاتی وجود داشت", excs) ... >>> f() + ردیابی گروه استثنا (آخرین تماس): | فایل "<stdin>", خط 1، در <module> | f() | ~^^ | فایل "<stdin>", خط 3، در f | افزایش ExceptionGroup ("مشکلاتی وجود داشت", excs) | ExceptionGroup: مشکلاتی وجود داشت (2 استثناء فرعی) +-+---------------- 1 ----------------- | خطای OSE: خطای 1 +---------------- 2 ---------------- | خطای سیستم: خطای 2 +----------------------------------- >>> امتحان کنید: ... f() ... به جز استثنا به عنوان e: ... چاپ (f'caught {type(e)}: e') ... گرفتار <class 'ExceptionGroup'>: e >>>

source: By using ``except*`` instead of ``except``, we can selectively handle only the exceptions in the group that match a certain type. In the following example, which shows a nested exception group, each ``except*`` clause extracts from the group exceptions of a certain type while letting all other exceptions propagate to other clauses and eventually to be reraised. ::
fa: با استفاده از ``except*`` به جای ``except``، می‌توانیم به‌طور انتخابی فقط استثناهای گروه را که با یک نوع خاص مطابقت دارند، مدیریت کنیم. در مثال زیر، که یک گروه استثنای تودرتو را نشان می‌دهد، هر عبارت ``except*`` از استثناهای گروه یک نوع خاص استخراج می‌کند در حالی که اجازه می‌دهد همه استثناهای دیگر به بندهای دیگر انتشار یابند و در نهایت دوباره مطرح شوند. ::

source: >>> def f(): ... raise ExceptionGroup( ... "group1", ... [ ... OSError(1), ... SystemError(2), ... ExceptionGroup( ... "group2", ... [ ... OSError(3), ... RecursionError(4) ... ] ... ) ... ] ... ) ... >>> try: ... f() ... except* OSError as e: ... print("There were OSErrors") ... except* SystemError as e: ... print("There were SystemErrors") ... There were OSErrors There were SystemErrors + Exception Group Traceback (most recent call last): | File "<stdin>", line 2, in <module> | f() | ~^^ | File "<stdin>", line 2, in f | raise ExceptionGroup( | ...<12 lines>... | ) | ExceptionGroup: group1 (1 sub-exception) +-+---------------- 1 ---------------- | ExceptionGroup: group2 (1 sub-exception) +-+---------------- 1 ---------------- | RecursionError: 4 +------------------------------------ >>>
fa: >>> def f(): ... ExceptionGroup را افزایش دهید( ... "گروه 1", ... [ ... OSError(1) ... سیستم خطا (2), ... ExceptionGroup( ... "گروه 2", ... [ ... OSError(3), ... RecursionError (4) ...] ...) ...] ...) ... >>> امتحان کنید: ... f() به جز * OSError as e: ... print("There were OSErrors") ... except* SystemError به عنوان e: ... چاپ ("خطاهای سیستمی وجود داشت") ... خطاهای OSE وجود داشت خطاهای سیستمی وجود داشت + ردیابی گروه استثنا (آخرین تماس): | فایل "<stdin>", خط 2، در <module> | f() | ~^^ | فایل "<stdin>", خط 2، در f | افزایش ExceptionGroup( | ...<12 خط>... | ) | ExceptionGroup: group1 (1 زیر استثنا) +-+---------------- 1 ----------------- | ExceptionGroup: group2 (1 زیر استثنا) +-+---------------- 1 ----------------- | RecursionError: 4 +----------------------------------- >>>

source: Note that the exceptions nested in an exception group must be instances, not types. This is because in practice the exceptions would typically be ones that have already been raised and caught by the program, along the following pattern::
fa: توجه داشته باشید که استثناهای تو در تو در یک گروه استثنایی باید نمونه باشند، نه نوع. این به این دلیل است که در عمل استثناها معمولاً مواردی هستند که قبلاً توسط برنامه مطرح شده و در الگوی زیر ثبت شده اند:

source: Enriching Exceptions with Notes
fa: غنی سازی استثناها با یادداشت ها

source: When an exception is created in order to be raised, it is usually initialized with information that describes the error that has occurred. There are cases where it is useful to add information after the exception was caught. For this purpose, exceptions have a method ``add_note(note)`` that accepts a string and adds it to the exception's notes list. The standard traceback rendering includes all notes, in the order they were added, after the exception. ::
fa: هنگامی که یک استثنا ایجاد می شود تا مطرح شود، معمولاً با اطلاعاتی که خطای رخ داده را توصیف می کند مقداردهی اولیه می شود. مواردی وجود دارد که اضافه کردن اطلاعات پس از کشف استثنا مفید است. برای این منظور، استثناها دارای یک متد ``add_note(note)`` هستند که یک رشته را می پذیرد و آن را به لیست یادداشت های استثنا اضافه می کند. رندر استاندارد ردیابی شامل همه یادداشت‌ها، به ترتیبی که پس از استثنا اضافه شده‌اند، می‌شود. ::

source: >>> try: ... raise TypeError('bad type') ... except Exception as e: ... e.add_note('Add some information') ... e.add_note('Add some more information') ... raise ... Traceback (most recent call last): File "<stdin>", line 2, in <module> raise TypeError('bad type') TypeError: bad type Add some information Add some more information >>>
fa: >>> امتحان کنید: ... افزایش TypeError ('نوع بد') ... به جز استثنا به عنوان e: ... e.add_note('Add some information') ... e.add_note('اطلاعات بیشتری اضافه کنید') ... بالا بردن ... ردیابی (آخرین تماس اخیر): فایل "<stdin>", خط 2، در <module> افزایش TypeError ('نوع بد') TypeError: نوع بد مقداری اطلاعات اضافه کنید اطلاعات بیشتری اضافه کنید >>>

source: For example, when collecting exceptions into an exception group, we may want to add context information for the individual errors. In the following each exception in the group has a note indicating when this error has occurred. ::
fa: به عنوان مثال، هنگام جمع آوری استثناها در یک گروه استثنا، ممکن است بخواهیم اطلاعات زمینه را برای خطاهای فردی اضافه کنیم. در ادامه هر استثنا در گروه دارای یک یادداشت است که نشان می دهد چه زمانی این خطا رخ داده است. ::

source: >>> def f(): ... raise OSError('operation failed') ... >>> excs = [] >>> for i in range(3): ... try: ... f() ... except Exception as e: ... e.add_note(f'Happened in Iteration {i+1}') ... excs.append(e) ... >>> raise ExceptionGroup('We have some problems', excs) + Exception Group Traceback (most recent call last): | File "<stdin>", line 1, in <module> | raise ExceptionGroup('We have some problems', excs) | ExceptionGroup: We have some problems (3 sub-exceptions) +-+---------------- 1 ---------------- | Traceback (most recent call last): | File "<stdin>", line 3, in <module> | f() | ~^^ | File "<stdin>", line 2, in f | raise OSError('operation failed') | OSError: operation failed | Happened in Iteration 1 +---------------- 2 ---------------- | Traceback (most recent call last): | File "<stdin>", line 3, in <module> | f() | ~^^ | File "<stdin>", line 2, in f | raise OSError('operation failed') | OSError: operation failed | Happened in Iteration 2 +---------------- 3 ---------------- | Traceback (most recent call last): | File "<stdin>", line 3, in <module> | f() | ~^^ | File "<stdin>", line 2, in f | raise OSError('operation failed') | OSError: operation failed | Happened in Iteration 3 +------------------------------------ >>>
fa: >>> def f(): ... افزایش OSError ('عملیات ناموفق') ... >>> excs = [] >>> برای i در محدوده (3): ... سعی کنید: ... f() ... به جز استثنا به عنوان e: ... e.add_note(f'در تکرار {i+1}') ... excs.append(e) ... >>> افزایش ExceptionGroup ("ما مشکلاتی داریم", excs) + ردیابی گروه استثنا (آخرین تماس): | فایل "<stdin>", خط 1، در <module> | افزایش ExceptionGroup ("ما مشکلاتی داریم", excs) | ExceptionGroup: ما مشکلاتی داریم (3 استثناء فرعی) +-+---------------- 1 ----------------- | ردیابی (آخرین تماس اخیر): | فایل "<stdin>", خط 3، در <module> | f() | ~^^ | فایل "<stdin>", خط 2، در f | افزایش OSError ('عملیات ناموفق') | خطای OSE: عملیات انجام نشد | در تکرار 1 اتفاق افتاد +---------------- 2 ---------------- | ردیابی (آخرین تماس اخیر): | فایل "<stdin>", خط 3، در <module> | f() | ~^^ | فایل "<stdin>", خط 2، در f | افزایش OSError ('عملیات ناموفق') | خطای OSE: عملیات انجام نشد | در تکرار 2 اتفاق افتاد +---------------- 3 ---------------- | ردیابی (آخرین تماس اخیر): | فایل "<stdin>", خط 3، در <module> | f() | ~^^ | فایل "<stdin>", خط 2، در f | افزایش OSError ('عملیات ناموفق') | خطای OSE: عملیات انجام نشد | در تکرار 3 اتفاق افتاد +----------------------------------- >>>

source: Errors and Exceptions
de: Fehler und Ausnahmen
hu: Hibák és kivételek
ru: Ошибки и исключения

source: The parser repeats the offending line and displays a little 'arrow' pointing at the earliest point in the line where the error was detected. The error is caused by (or at least detected at) the token *preceding* the arrow: in the example, the error is detected at the function :func:`print`, since a colon (``':'``) is missing before it. File name and line number are printed so you know where to look in case the input came from a script.
de: Der Parser wiederholt die fehlerhafte Zeile und zeigt einen kleinen "Pfeil" an, der auf den frühesten Punkt in der Zeile zeigt, an dem der Fehler entdeckt wurde. Der Fehler wird durch das Token *vor* dem Pfeil verursacht (oder zumindest erkannt): Im Beispiel wird der Fehler bei der Funktion :func:`print`, erkannt, da ein Doppelpunkt (``':'``) davor fehlt. Dateiname und Zeilennummer werden ausgegeben, damit Sie wissen, wo Sie suchen müssen, falls die Eingabe von einem Skript stammt.
hu: Az elemző megismétli a hibás sort, és kitesz egy kis 'nyilat' amely a sorban előforduló legelsőnek észlelt hibára mutat. A hibát a nyilat *megelőző* szócska (token) okozza (vagy legalábbis itt észlelte az értelemező): a példában, a hibát a :func:`print` utasításnál észlelte, mivel a kettőspont (``':'``) hiányzik előle. A fájl neve és a sorszám kiíródik, így tudhatod, hol keressed, ha egy szkriptet futtattál.
ru: Парсер указывает на строку с ошибкой и отображает 'стрелку', указывающую на начало ошибки. Ошибка вызывается токеном, который находится *перед* стрелкой: в примере, ошибка обнаруживается на функции :func:`print`, потому что перед ней пропущено двоеточие (``':'``). Имя файла и номер линии тоже печатаются, чтобы можно было найти файл с ошибкой (если код выполняется из файла).

source: A class in an :keyword:`except` clause is compatible with an exception if it is the same class or a base class thereof (but not the other way around --- an *except clause* listing a derived class is not compatible with a base class). For example, the following code will print B, C, D in that order::
ru: Класс в пункте :keyword:`except` совместим с исключением, если это тот же класс или базовый класс (но не наоборот --- *пункт except *, содержащий производный класс, не совместим с базовым классом). Например, следующий код печатает B, C, D в указанном порядке::

source: When an exception occurs, it may have an associated value, also known as the exception's *argument*. The presence and type of the argument depend on the exception type.
hu: Ha kivétel lép fel, lehetnek hozzátartozó értékei, amelyeket a kivétel *argumentumának* is nevezünk. A megléte és a típusa a kivétel fajtájától is függ. Azokra a kivételtípusokra, amelyek argumentummal rendelkeznek, az except ág előírhat egy változót a kivétel neve (vagy a lista) után, amely felveszi az argumentum értékét, ahogy itt látható::
ru: Когда случается исключение, с ним может быть связано какое-то значение, так называемый *аргумент* исключения. Наличие и тип аргумента зависит от типа исключения.

source: If an exception has arguments, they are printed as the last part ('detail') of the message for unhandled exceptions.
hu: Ha a kivételnek argumentuma van, az mindíg utolsó részeként kerül a képernyőre.
ru: Если у необработанного исключения были аргументы, они печатаются в конце сообщения об ошибке.

source: The sole argument to :keyword:`raise` indicates the exception to be raised. This must be either an exception instance or an exception class (a class that derives from :class:`Exception`). If an exception class is passed, it will be implicitly instantiated by calling its constructor with no arguments::
hu: A :keyword:`raise` első argumentuma a kivétel neve amit létrehozunk. Az esetleges második argumentum adja meg a kivétel argumentumát.
ru: Единственный аргумент, принимаемый :keyword:`raise`, указывает на исключение, которое нужно породить. Тут можно указать либо *экземпляр* исключения, либо *класс* искючения (класс-потом :class:`Exception`). Если передаётся класс исклюения, экземпляр будет неявно создан с помощью вызова конструктора класса без аргументов::

source: Many standard modules define their own exceptions to report errors that may occur in functions they define. More information on classes is presented in chapter :ref:`tut-classes`.
hu: Sok -- a Pythonban megtalálható -- modul ezt használja a függvényekben előforduló esetleges hibák megjelenítésére.
ru: Многие модули из стандартной библиотеки определяют собственные исключения, чтобы сообщать об ошибках в функциях, которые они определяют. В главе :ref:`tut-classes` можно получить больше информации о классах.

source: The preceding part of the error message shows the context where the exception happened, in the form of a stack traceback. In general it contains a stack traceback listing source lines; however, it will not display lines read from standard input.
hu: Az ezt megelőző része a hibaüzenetnek megmutatja a szövegkörnyezetet -- ahol a kivétel történt -- egy veremvisszakövetés (stack backtrace) formájában. Általában ez veremvisszakövetést tartalamazza egy listában a forrás sorait. jóllehet, ez nem fog megjeleníteni a sztenderd bementeről kapott sorokat.

source: If an exception occurs during execution of the try clause, the rest of the clause is skipped. Then if its type matches the exception named after the :keyword:`except` keyword, the except clause is executed, and then execution continues after the :keyword:`try` statement.
hu: Ha kivétel lép fel a try-ág végrehajtása során, az ág maradék része nem hajtódik végre. Ekkor -- ha a típusa megegyezik az :keyword:`except` kulcsszó után megnevezett kivétellel, ez az expect-ág hajtódik végre, és ezután a végrehajtás a try--except blokk után folytatódik.

source: If an exception occurs which does not match the exception named in the except clause, it is passed on to outer :keyword:`try` statements; if no handler is found, it is an *unhandled exception* and execution stops with a message as shown above.
hu: Ha olyan kivétel lép fel, amely nem egyezik a az expect-ágban megnevezett utasítással, akkor a kivételt átadja egy külsőbb :keyword:`try` utasításnak. Ha nincs kezelve a kivétel, akkor ez egy *kezeletlen kivétel* a futás megáll egy utasítással, ahogy korábban láttuk.

source: A class in an :keyword:`except` clause is compatible with an exception if it is the same class or a base class thereof (but not the other way around --- an except clause listing a derived class is not compatible with a base class). For example, the following code will print B, C, D in that order::
hu: Egy osztály az :keyword:`except`-ágban egy osztály egyenértékű magával az osztállyal, vagy annak egy szülőosztályával (de a másik irány nem igaz --- egy except-ág, amely a származtatott osztályt tartalmazza nem egyenértékű a szülőösztállyal). Például a következő kód B, C, D betűket fogja kiírni ebben a sorrendben::

source: Note that if the except clauses were reversed (with ``except B`` first), it would have printed B, B, B --- the first matching except clause is triggered.
hu: Vegyük észre, hogyha az except-ágak fordított sorrendben szerepelnének (az ``except B`` lenne az első), B, B, B betűket írt volna ki --- az első illeszkedő ág hajtódik végre.

source: The last except clause may omit the exception name(s), to serve as a wildcard. Use this with extreme caution, since it is easy to mask a real programming error in this way! It can also be used to print an error message and then re-raise the exception (allowing a caller to handle the exception as well)::
hu: Az utolsó expect-ág esetén elhagyható a kivétel neve. Rendkívül óvatosan használjuk, mert elfedhet valódi programozási hibákat! Arra is használható, hogy kiírjunk egy hibaüzenetet, majd újra kivételdobást hajtsunk végre, (megengedve a hívónak, hogy lekezelje a kivételt)::

source: The :keyword:`try` ... :keyword:`except` statement has an optional *else clause*, which, when present, must follow all except clauses. It is useful for code that must be executed if the try clause does not raise an exception. For example::
hu: A :keyword:`try` ... :keyword:`except` utasításnak lehet egy *else-ága* is, amelyet -- ha létezik -- az összes except-ágnak meg kell előznie. Ez nagyon hasznos olyan kódokban, amelyeknek mindenképpen végre kell hajtódniuk, ha a try ágban nem lép fel kivétel. Például::

source: The except clause may specify a variable after the exception name. The variable is bound to an exception instance with the arguments stored in ``instance.args``. For convenience, the exception instance defines :meth:`__str__` so the arguments can be printed directly without having to reference ``.args``. One may also instantiate an exception first before raising it and add any attributes to it as desired. ::
hu: Ha kivétel lép fel, lehetnek hozzátartozó értékei, amelyeket a kivétel *argumentumának* is nevezünk. A megléte és a típusa a kivétel fajtájától is függ. Azokra a kivételtípusokra, amelyek argumentummal rendelkeznek, az except ág előírhat egy változót a kivétel neve (vagy a lista) után, amely felveszi az argumentum értékét, ahogy itt látható::
