Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/tutorial/errors.po
Languages: de, fa, hu, ru

source: Exception handlers do not handle only exceptions that occur immediately in the *try clause*, but also those that occur inside functions that are called (even indirectly) in the *try clause*. For example::
fa: کنترل‌کننده‌های استثنا فقط استثناهایی را که بلافاصله در *try clause* رخ می‌دهند، مدیریت نمی‌کنند، بلکه مواردی را که در داخل توابع رخ می‌دهند که (حتی غیرمستقیم) در *try clause* فراخوانی می‌شوند را نیز کنترل می‌کنند. به عنوان مثال::

source: >>> def this_fails(): ... x = 1/0 ... >>> try: ... this_fails() ... except ZeroDivisionError as err: ... print('Handling run-time error:', err) ... Handling run-time error: division by zero
fa: >>> def this_fails(): ... x = 1/0 ... >>> امتحان کنید: ... this_fails() ... به جز ZeroDivisionError به عنوان err: ... print('Handling time run error:', err) ... رسیدگی به خطای زمان اجرا: تقسیم بر صفر

source: Raising Exceptions
de: Auslösen von Ausnahmen
fa: افزایش استثنائات
hu: Kivételek létrehozása
ru: Порождение исключений

source: The :keyword:`raise` statement allows the programmer to force a specified exception to occur. For example::
de: Die :keyword:`raise` Anweisung ermöglicht es dem Programmierer, das Auftreten einer bestimmten Ausnahme zu erzwingen. Zum Beispiel::
fa: دستور :keyword:`raise` به برنامه نویس اجازه می دهد تا یک استثنا مشخص شده را مجبور به رخ دادن کند. به عنوان مثال::
hu: A :keyword:`raise` utasítás lehetővé teszi a programozó számára, hogy egy új, általa megadott kivételt hozzon létre. Például::
ru: Инструкция :keyword:`raise` позволяет программисту вызвать желаемое исключение. Например::

source: >>> raise NameError('HiThere') Traceback (most recent call last): File "<stdin>", line 1, in <module> raise NameError('HiThere') NameError: HiThere
fa: >>> افزایش NameError ('HiThere') ردیابی (آخرین تماس اخیر): فایل "<stdin>", خط 1، در <module> افزایش NameError ('HiThere') NameError: Hi There

source: The sole argument to :keyword:`raise` indicates the exception to be raised. This must be either an exception instance or an exception class (a class that derives from :class:`BaseException`, such as :exc:`Exception` or one of its subclasses). If an exception class is passed, it will be implicitly instantiated by calling its constructor with no arguments::
fa: تنها آرگومان :keyword:`raise` استثنایی را که باید مطرح شود را نشان می دهد. این باید یا یک نمونه استثنا باشد یا یک کلاس استثنا (کلاسی که از :class:`BaseException` مشتق شده است, مانند :exc:`Exception` یا یکی از زیر کلاس های آن). اگر یک کلاس استثنا ارسال شود، به طور ضمنی با فراخوانی سازنده آن بدون هیچ آرگومان نمونه سازی می شود::

source: If you need to determine whether an exception was raised but don't intend to handle it, a simpler form of the :keyword:`raise` statement allows you to re-raise the exception::
de: Wenn Sie feststellen müssen, ob eine Ausnahme ausgelöst wurde, aber nicht beabsichtigen, sie zu behandeln, können Sie mit einer einfacheren Form der :keyword:`raise` Anweisung die Ausnahme erneut auslösen::
fa: اگر باید تعیین کنید که آیا یک استثنا مطرح شده است یا خیر، اما قصد ندارید آن را مدیریت کنید، یک شکل ساده تر از عبارت :keyword:`raise` به شما اجازه می دهد تا استثنا را دوباره مطرح کنید:
hu: Ha meg akarod határozni, hogy létrejött-e egy kivétel, de nem szándokozod kezelni azt, akkor a :keyword:`raise` utasítás egyszerűbb formája lehetővé teszi, hogy újra kidobja a kivételt::
ru: Если вы хотите узнать, возникло исключение или нет, но не планируете его обрабатывать, есть более простая форма инструкции :keyword:`raise`. Она позволяет перепородить исключение::

source: >>> try: ... raise NameError('HiThere') ... except NameError: ... print('An exception flew by!') ... raise ... An exception flew by! Traceback (most recent call last): File "<stdin>", line 2, in <module> raise NameError('HiThere') NameError: HiThere
fa: >>> امتحان کنید: ... افزایش NameError ('HiThere') ... به جز NameError: ... چاپ ('یک استثنا به پایان رسید!') ... بالا بردن ... یک استثنا پرواز کرد! ردیابی (آخرین تماس اخیر): فایل "<stdin>", خط 2، در <module> افزایش NameError ('HiThere') NameError: Hi There

source: Exception Chaining
de: Verkettung von Ausnah
fa: استثناء زنجیر
ru: Композиция исключений

source: If an unhandled exception occurs inside an :keyword:`except` section, it will have the exception being handled attached to it and included in the error message::
fa: اگر یک استثنا کنترل نشده در یک بخش :keyword:`except` رخ دهد، این استثنا به آن پیوست شده و در پیام خطا گنجانده شده است:
ru: Если внутри секции :keyword:`except` возникает необработанное исключение, оно будет иметь прикрепленное к нему обрабатываемое исключение и будет включено в сообщение об ошибке::

source: >>> try: ... open("database.sqlite") ... except OSError: ... raise RuntimeError("unable to handle error") ... Traceback (most recent call last): File "<stdin>", line 2, in <module> open("database.sqlite") ~~~~^^^^^^^^^^^^^^^^^^^ FileNotFoundError: [Errno 2] No such file or directory: 'database.sqlite' During handling of the above exception, another exception occurred: Traceback (most recent call last): File "<stdin>", line 4, in <module> raise RuntimeError("unable to handle error") RuntimeError: unable to handle error
fa: >>> امتحان کنید: ... open("database.sqlite") ... به جز OSError: ... افزایش RuntimeError ("عدم کنترل خطا") ... ردیابی (آخرین تماس اخیر): فایل "<stdin>", خط 2، در <module> open("database.sqlite") ~~~~^^^^^^^^^^^^^^^^^^^ FileNotFoundError: [Errno 2] چنین فایل یا فهرستی وجود ندارد: 'database.sqlite' در حین رسیدگی به استثنای فوق، یک استثنا دیگر رخ داد: ردیابی (آخرین تماس اخیر): فایل "<stdin>", خط 4، در <module> افزایش RuntimeError ("عدم رسیدگی به خطا") RuntimeError: قادر به رسیدگی به خطا نیست

source: To indicate that an exception is a direct consequence of another, the :keyword:`raise` statement allows an optional :keyword:`from<raise>` clause::
fa: برای نشان دادن اینکه یک استثنا پیامد مستقیم دیگری است، دستور :keyword:`raise` یک عبارت :keyword:`from<raise>` اختیاری را مجاز می‌کند:
ru: Для указания того, что исключение является прямым следствием другого, инструкция :keyword:`raise` позволяет использовать необязательное ключевое слово :keyword:`from<raise>`::

source: This can be useful when you are transforming exceptions. For example::
de: Dies kann nützlich sein, wenn Sie Ausnahmen umwandeln wollen. Zum Beispiel::
fa: این می تواند زمانی مفید باشد که در حال تبدیل استثناها هستید. به عنوان مثال::
ru: Это может быть полезно при преобразовании одного исключения в другое. Например::

source: >>> def func(): ... raise ConnectionError ... >>> try: ... func() ... except ConnectionError as exc: ... raise RuntimeError('Failed to open database') from exc ... Traceback (most recent call last): File "<stdin>", line 2, in <module> func() ~~~~^^ File "<stdin>", line 2, in func ConnectionError The above exception was the direct cause of the following exception: Traceback (most recent call last): File "<stdin>", line 4, in <module> raise RuntimeError('Failed to open database') from exc RuntimeError: Failed to open database
fa: >>> def func(): ... افزایش ConnectionError ... >>> امتحان کنید: ... func() ... به جز ConnectionError به عنوان exc: ... RuntimeError ('باز کردن پایگاه داده انجام نشد') را از exc ... ردیابی (آخرین تماس اخیر): فایل "<stdin>", خط 2، در <module> func() ~~~~^^ فایل "<stdin>", خط 2، در تابع خطای اتصال استثناء فوق علت مستقیم استثناء زیر بود: ردیابی (آخرین تماس اخیر): فایل "<stdin>", خط 4، در <module> افزایش RuntimeError ('باز کردن پایگاه داده انجام نشد') از exc RuntimeError: دیتابیس باز نشد

source: It also allows disabling automatic exception chaining using the ``from None`` idiom::
fa: همچنین امکان غیرفعال کردن زنجیره استثنایی خودکار با استفاده از اصطلاح ``from None``::
ru: Оно также позволяет отключить автоматическое связывание исключений с использованием идиомы ``from None``::

source: >>> try: ... open('database.sqlite') ... except OSError: ... raise RuntimeError from None ... Traceback (most recent call last): File "<stdin>", line 4, in <module> raise RuntimeError from None RuntimeError
fa: >>> امتحان کنید: ... open('database.sqlite') ... به جز OSError: ... RuntimeError را از None بالا ببرید ... ردیابی (آخرین تماس اخیر): فایل "<stdin>", خط 4، در <module> RuntimeError را از None افزایش دهید خطای زمان اجرا

source: For more information about chaining mechanics, see :ref:`bltin-exceptions`.
de: eitere Informationen zur Verkettungsmechanik finden Sie unter :ref:`bltin-exceptions`.
fa: برای اطلاعات بیشتر در مورد مکانیک زنجیر، به :ref:`bltin-exceptions` مراجعه کنید.
ru: Для получения дополнительной информации о механизмах связывания, см. :ref:`bltin-exceptions`.

source: User-defined Exceptions
de: Benutzerdefinierte Ausnahmen
fa: استثناهای تعریف شده توسط کاربر
hu: Felhasználó által létrehozott kivételek
ru: Пользовательские исключения

source: Programs may name their own exceptions by creating a new exception class (see :ref:`tut-classes` for more about Python classes). Exceptions should typically be derived from the :exc:`Exception` class, either directly or indirectly.
de: Programme können ihre eigenen Ausnahmen benennen, indem sie eine neue Ausnahmeklasse erstellen (siehe :ref:`tut-classes` für mehr über Python-Klassen). Ausnahmen sollten in der Regel von der :exc:`Exception` Klasse abgeleitet werden, entweder direkt oder indirekt.
fa: برنامه ها ممکن است استثناهای خود را با ایجاد یک کلاس استثنای جدید نام گذاری کنند (برای اطلاعات بیشتر در مورد کلاس های پایتون به :ref:`tut-classes` مراجعه کنید). استثناها معمولاً باید به طور مستقیم یا غیر مستقیم از کلاس :exc:`Exception` مشتق شوند.
hu: A programok elnevezhetik a saját kivételeiket, ha karakterláncot rendelnek egy változóhoz, vagy egy új kivétel-osztályt hoznak létre. Például::
ru: Программы могут создавать собственные исключения, определив новый класс исключения (см. :ref:`tut-classes`, чтобы узнать больше про классы в Python). Исключения обычно наследуются от класса :exc:`Exception` напрямую или через класс-наследник :exc:`!Exception`.

source: Exception classes can be defined which do anything any other class can do, but are usually kept simple, often only offering a number of attributes that allow information about the error to be extracted by handlers for the exception.
de: Es können Ausnahmeklassen definiert werden, die alles tun können, was jede andere Klasse auch tun kann, aber sie sind in der Regel einfach gehalten und bieten oft nur eine Reihe von Attributen, die es ermöglichen, Informationen über den Fehler durch Handler für die Ausnahme zu extrahieren.
fa: کلاس های استثنا را می توان تعریف کرد که هر کلاس دیگری را انجام می دهد، اما معمولاً ساده نگه داشته می شوند، اغلب فقط تعدادی ویژگی ارائه می دهند که اجازه می دهد اطلاعات مربوط به خطا توسط کنترل کننده ها برای استثنا استخراج شود.
ru: Классы исключений могут быть определены таким образом, чтобы делать все то же самое, что и любой другой класс. Но обычно они остаются простыми, часто предлагая только несколько атрибутов, которые позволяют извлекать информацию об ошибке обработчиками исключений.

source: Most exceptions are defined with names that end in "Error", similar to the naming of the standard exceptions.
de: Die meisten Ausnahmen werden mit Namen definiert, die auf "Error" enden, ähnlich der Benennung der Standardausnahmen.
fa: اکثر استثناها با نام‌هایی تعریف می‌شوند که به «خطا» ختم می‌شوند، مشابه نام‌گذاری استثناهای استاندارد.
hu: A legtöbb kivétel "Error" végződésű névvel van definiálva, hasonlóan a szabványos kivételek nevéhez.
ru: Большинство исключений определены с именем, оканчивающимся на "Error", подобно стандартным исключениям.

source: Many standard modules define their own exceptions to report errors that may occur in functions they define.
fa: بسیاری از ماژول های استاندارد استثناهای خود را برای گزارش خطاهایی که ممکن است در توابعی که تعریف می کنند رخ دهد، تعریف می کنند.

source: Defining Clean-up Actions
de: Definition von Bereinigungsaktionen
fa: تعریف اقدامات پاکسازی
hu: Tisztogató eljárások definiálása
ru: Определение действий по уборке

source: The :keyword:`try` statement has another optional clause which is intended to define clean-up actions that must be executed under all circumstances. For example::
de: Die :keyword:`try` Anweisung enthält eine weitere optionale Klausel, die dazu dient, Bereinigungsaktionen zu definieren, die unter allen Umständen ausgeführt werden müssen. Zum Beispiel::
fa: دستور :keyword:`try` یک بند اختیاری دیگر دارد که برای تعریف اقدامات پاکسازی که باید تحت هر شرایطی اجرا شوند، در نظر گرفته شده است. به عنوان مثال::
hu: A :keyword:`try` utasításnak van egy másik opcionális ága, mely tisztogató műveletek létrehozására szolgál, amelyeket mindenképpen végre kell hajtani. Például::
ru: У инструкции :keyword:`try` есть ещё одна необязательная ветка, выполняющая "уборку", которая должна произойти независимо от того, произошло исключение или нет. Например::

source: >>> try: ... raise KeyboardInterrupt ... finally: ... print('Goodbye, world!') ... Goodbye, world! Traceback (most recent call last): File "<stdin>", line 2, in <module> raise KeyboardInterrupt KeyboardInterrupt
fa: >>> امتحان کنید: ... KeyboardInterrupt را افزایش دهید ... در نهایت: ... چاپ ("خداحافظ, دنیا!") ... خداحافظ ای دنیا! ردیابی (آخرین تماس اخیر): فایل "<stdin>", خط 2، در <module> افزایش وقفه صفحه کلید صفحه کلید وقفه

source: If a :keyword:`finally` clause is present, the :keyword:`!finally` clause will execute as the last task before the :keyword:`try` statement completes. The :keyword:`!finally` clause runs whether or not the :keyword:`!try` statement produces an exception. The following points discuss more complex cases when an exception occurs:
de: Wenn eine :keyword:`finally` Klausel vorhanden ist, wird die :keyword:`!finally` Klausel als letzte Aufgabe ausgeführt, bevor die :keyword:`try` Anweisung abgeschlossen wird. Die :keyword:`!finally` Klausel wird unabhängig davon ausgeführt, ob die :keyword:`!try` Anweisung eine Ausnahme erzeugt oder nicht. In den folgenden Punkten werden komplexere Fälle beim Auftreten einer Ausnahme behandelt:
fa: اگر یک بند :keyword:`finally` وجود داشته باشد، بند :keyword:`!finally` به عنوان آخرین کار قبل از تکمیل دستور :keyword:`try` اجرا می شود. بند :keyword:`!finally` اجرا می شود چه دستور :keyword:`!try` یک استثنا ایجاد کند یا نه. نکات زیر موارد پیچیده تری را که یک استثنا رخ می دهد مورد بحث قرار می دهد:
ru: Если ветка :keyword:`finally` присутствует, код в ней выполнится в последнюю очередь перед заверешением инструкции :keyword:`try`. Ветка :keyword:`!finally` выполняется независимо от того, произошло исключение или нет. Следующие пункты описывают более сложные случаи возникновения исключений:

source: If an exception occurs during execution of the :keyword:`!try` clause, the exception may be handled by an :keyword:`except` clause. If the exception is not handled by an :keyword:`!except` clause, the exception is re-raised after the :keyword:`!finally` clause has been executed.
de: Wenn während der Ausführung der :keyword:`!try` Klausel eine Ausnahme auftritt, kann die Ausnahme von einer :keyword:`except` Klausel behandelt werden. Wenn die Ausnahme nicht durch eine :keyword:`!except` Klausel behandelt wird, wird die Ausnahme erneut ausgelöst, nachdem die :keyword:`!finally` Klausel ausgeführt wurde.
fa: اگر یک استثنا در طول اجرای بند :keyword:`!try` رخ دهد، این استثنا ممکن است توسط یک بند :keyword:`except` مدیریت شود. اگر استثنا توسط یک بند :keyword:`!except` مدیریت نشود، پس از اجرای بند :keyword:`!finally`، استثنا دوباره مطرح می شود.
ru: Если исключение происходит в ветка :keyword:`!try`, оно может быть обработано в ветке :keyword:`except`. Если исключение не было обработано в ветке :keyword:`except`, оно порождается заново после того, как будет выполнен код в ветке :keyword:`finally`.

source: An exception could occur during execution of an :keyword:`!except` or :keyword:`!else` clause. Again, the exception is re-raised after the :keyword:`!finally` clause has been executed.
de: Während der Ausführung einer :keyword:`!except` oder :keyword:`!else` Klausel kann eine Ausnahme auftreten. Auch hier wird die Ausnahme erneut ausgelöst, nachdem die :keyword:`!finally` Klausel ausgeführt wurde.
fa: یک استثنا ممکن است در طول اجرای یک بند :keyword:`!except` یا :keyword:`!else` رخ دهد. مجدداً، پس از اجرای بند :keyword:`!finally`، استثنا دوباره مطرح می شود.
ru: Исключение может произойти в ветке :keyword:`!except` или :keyword:`!else`. Как и в предыдущем случае, исключение порождается заново после выполнения ветки :keyword:`!finally`.

source: If the :keyword:`!finally` clause executes a :keyword:`break`, :keyword:`continue` or :keyword:`return` statement, exceptions are not re-raised.
de: Wenn die :keyword:`!finally` Klausel eine :keyword:`break`, :keyword:`continue` oder :keyword:`return` Anweisung ausführt, werden Ausnahmen nicht erneut ausgelöst.
fa: اگر عبارت :keyword:`!finally` یک دستور :keyword:`break`، :keyword:`continue` یا :keyword:`return` را اجرا کند، استثناها دوباره مطرح نمی شوند.
ru: Если блок :keyword:`!finally` выполняет инструкцию :keyword:`break`, :keyword:`continue` или :keyword:`return`, исключения не возбуждаются повторно.

source: If the :keyword:`!try` statement reaches a :keyword:`break`, :keyword:`continue` or :keyword:`return` statement, the :keyword:`!finally` clause will execute just prior to the :keyword:`!break`, :keyword:`!continue` or :keyword:`!return` statement's execution.
de: Wenn die :keyword:`!try` Anweisung eine :keyword:`break`, :keyword:`continue` oder :keyword:`return` Anweisung erreicht, wird die :keyword:`!finally` Klausel direkt vor der Ausführung der :keyword:`!break`, :keyword:`!continue` oder :keyword:`!return`Anweisung ausgeführt.
fa: اگر دستور :keyword:`!try` به یک دستور :keyword:`break`، :keyword:`continue` یا :keyword:`return` برسد، عبارت :keyword:`!finally` درست قبل از اجرای دستور :keyword:`!break`، :keyword:`!continue` یا :keyword:`!return` اجرا می شود.
ru: Если внутри :keyword:`!try` выполняется инструкция keyword:`break`, :keyword:`continue` или :keyword:`return`, ветка :keyword:`!finally` выполнится прямо перет выполнением инструкции keyword:`!break`, :keyword:`!continue` или :keyword:`!return`.

source: If a :keyword:`!finally` clause includes a :keyword:`!return` statement, the returned value will be the one from the :keyword:`!finally` clause's :keyword:`!return` statement, not the value from the :keyword:`!try` clause's :keyword:`!return` statement.
de: Wenn eine :keyword:`!finally` Klausel eine :keyword:`!return` Anweisung enthält, ist der zurückgegebene Wert, der Wert aus der :keyword:`!finally` Anweisung der :keyword:`!return` Klausel und nicht der Wert aus der :keyword:`!try` Anweisung der :keyword:`!return` Klausel.
fa: اگر یک بند :keyword:`!finally` شامل یک دستور :keyword:`!return` باشد، مقدار بازگشتی عبارت :keyword:`!return` عبارت :keyword:`!finally` خواهد بود، نه مقدار دستور :keyword:`!return` بند :keyword:`!try`.
ru: Если ветка :keyword:`!finally` содержит инструкцию :keyword:`return`, функция, в которой находится код, вернёт значение из ветки :keyword:`!finally`, а не из ветки :keyword:`!try`.

source: For example::
de: Zum Beispiel::
fa: به عنوان مثال::
ru: Например::

source: A more complicated example::
de: Ein komplizierteres Beispiel::
fa: یک مثال پیچیده تر::
ru: Более сложный пример::

source: >>> def divide(x, y): ... try: ... result = x / y ... except ZeroDivisionError: ... print("division by zero!") ... else: ... print("result is", result) ... finally: ... print("executing finally clause") ... >>> divide(2, 1) result is 2.0 executing finally clause >>> divide(2, 0) division by zero! executing finally clause >>> divide("2", "1") executing finally clause Traceback (most recent call last): File "<stdin>", line 1, in <module> divide("2", "1") ~~~~~~^^^^^^^^^^ File "<stdin>", line 3, in divide result = x / y ~~^~~ TypeError: unsupported operand type(s) for /: 'str' and 'str'
fa: >>> def divide(x,y): ... سعی کنید: ... نتیجه = x / y ... به جز ZeroDivisionError: ... چاپ ("تقسیم بر صفر!") ... دیگر: ... چاپ ("نتیجه است", نتیجه) ... در نهایت: ... print("اجرای بند نهایی") ... >>> تقسیم (2, 1) نتیجه 2.0 است اجرای بند نهایی >>> تقسیم (2, 0) تقسیم بر صفر! اجرای بند نهایی >>> تقسیم ("2", "1") اجرای بند نهایی ردیابی (آخرین تماس اخیر): فایل "<stdin>", خط 1، در <module> تقسیم ("2", "1") ~~~~~~^^^^^^^^^^ فایل "<stdin>", خط 3، در تقسیم نتیجه = x / y ~~^~~ TypeError: نوع(های) عملوند پشتیبانی نشده برای /: 'str' و 'str'

source: As you can see, the :keyword:`finally` clause is executed in any event. The :exc:`TypeError` raised by dividing two strings is not handled by the :keyword:`except` clause and therefore re-raised after the :keyword:`!finally` clause has been executed.
de: Wie du sehen kannst, wird die :keyword:`finally` Klausel in jedem Fall ausgeführt. Der :exc:`TypeError`, ausgelöst durch die Teilung zweier Zeichenfolgenn wird von der :keyword:`except` Klausel nicht verarbeitet und daher nach Ausführung der :keyword:`!finally` Klausel erneut ausgelöst.
fa: همانطور که می بینید، بند :keyword:`finally` در هر صورت اجرا می شود. :exc:`TypeError` که با تقسیم دو رشته ایجاد می شود توسط بند :keyword:`except` مدیریت نمی شود و بنابراین پس از اجرای بند :keyword:`!finally` دوباره مطرح می شود.
ru: Как можно заметить, ветка :keyword:`finally` выполняется при любом исходе. Исключение :exc:`TypeError`, порождённое при делении двух строк, не обрабатывается веткой :keyword:`except` и порождается заново после выполнения блока :keyword:`finally`.

source: In real world applications, the :keyword:`finally` clause is useful for releasing external resources (such as files or network connections), regardless of whether the use of the resource was successful.
de: In realen Anwendungen ist die :keyword:`finally` Klausel nützlich, um externe Ressourcen (z. B. Dateien oder Netzwerkverbindungen) freizugeben, unabhängig davon, ob die Nutzung der Ressource erfolgreich war.
fa: در برنامه های کاربردی دنیای واقعی، بند :keyword:`finally` برای انتشار منابع خارجی (مانند فایل ها یا اتصالات شبکه), صرف نظر از اینکه استفاده از منبع موفقیت آمیز بوده است مفید است.
hu: A valódi alkalmazások esetén a :keyword:`finally`-ág akkor hasznos, ha külső erőforrásokat kell eleresztenünk (amilyenek a fájlok, vagy hálózati kapcsolatok), függetlenül attól, hogy az erőforrás felhasználása sikeres volt-e.
ru: В реальных приложениях ветка :keyword:`finally` может быть полезна для освобождения внешних ресурсов (например, файлов или сетевых соединений) независимо от того, было их использование успешным или нет.

source: Predefined Clean-up Actions
de: Vordefinierte Bereinigungsaktionen
fa: اقدامات پاکسازی از پیش تعریف شده
hu: Előre definiált tisztogató eljárások
ru: Предопределённые действие по уборке
