Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/tutorial/errors.po
Languages: de, fa, hu, ru

source: Until now error messages haven't been more than mentioned, but if you have tried out the examples you have probably seen some. There are (at least) two distinguishable kinds of errors: *syntax errors* and *exceptions*.
de: Bis jetzt wurden Fehlermeldungen nur erwähnt, aber wenn Sie die Beispiele ausprobiert haben, haben Sie wahrscheinlich einige gesehen. Es gibt (mindestens) zwei Arten von Fehlern, die man unterscheiden kann: *Syntaxfehler* und *Ausnahmen*.
fa: تا به حال پیام های خطا بیش از ذکر شده نبوده است، اما اگر نمونه هایی را امتحان کرده باشید احتمالاً برخی از آنها را دیده اید. (حداقل) دو نوع خطا قابل تشخیص وجود دارد: *syntax errors* و *exceptions*.
hu: Eddig csak említettük a hibajelzéseket, de ha kipróbáltad a példákat feltehetően láttál néhányat. Kétfajta megkülönböztetendő hibafajta van: *szintaktikai hiba (syntax error)* és *kivétel (exception)*.
ru: До настоящего момента мы только упоминали сообщения об ошибках, но если вы пробовали примеры с кодом, вы их встречали. Существует (по крайней мере) два различных типа ошибок: *синтаксические ошибки* и *исключения*

source: Syntax Errors
de: Syntax Fehler
fa: خطاهای نحوی
hu: Szintaktikai hibák
ru: Синтаксические ошибки

source: Syntax errors, also known as parsing errors, are perhaps the most common kind of complaint you get while you are still learning Python::
de: Syntaxfehler, auch bekannt als Parsing-Fehler, sind vielleicht die häufigste Art von Beschwerden, die man bekommt, wenn man Python noch lernt::
fa: خطاهای نحوی که به عنوان خطاهای تجزیه نیز شناخته می شوند، شاید رایج ترین نوع شکایتی باشند که در حین یادگیری پایتون دریافت می کنید::
hu: A szintaktikai hibák, vagy másképp elemzési hibák, talán a leggyakoribb hibaüzenetek, amíg tanulod a Pythont::
ru: Пока вы только изучаете Python, чаще всего вам будут попадаться синтаксически ошибки, или ошибки разбора (парсинга)::

source: >>> while True print('Hello world') File "<stdin>", line 1 while True print('Hello world') ^^^^^ SyntaxError: invalid syntax
fa: >>> while True print ("سلام دنیا") فایل "<stdin>", خط 1 while True print ("سلام دنیا") ^^^^^ SyntaxError: نحو نامعتبر است

source: The parser repeats the offending line and displays little arrows pointing at the token in the line where the error was detected. The error may be caused by the absence of a token *before* the indicated token. In the example, the error is detected at the function :func:`print`, since a colon (``':'``) is missing before it. File name and line number are printed so you know where to look in case the input came from a script.
fa: تجزیه کننده خط متخلف را تکرار می کند و فلش های کوچکی را نشان می دهد که به نشانه در خطی که خطا شناسایی شده است نشان می دهد. خطا ممکن است به دلیل عدم وجود رمز *before* نشانه نشان داده شده باشد. در مثال، خطا در تابع :func:`print` شناسایی می‌شود، زیرا یک دونقطه (``':'``) قبل از آن وجود ندارد. نام فایل و شماره خط چاپ شده است، بنابراین شما می دانید در صورتی که ورودی از یک اسکریپت باشد، کجا را جستجو کنید.

source: Exceptions
de: Ausnahmen
fa: استثنائات
hu: Kivételek
ru: Исключения

source: Even if a statement or expression is syntactically correct, it may cause an error when an attempt is made to execute it. Errors detected during execution are called *exceptions* and are not unconditionally fatal: you will soon learn how to handle them in Python programs. Most exceptions are not handled by programs, however, and result in error messages as shown here::
de: Auch wenn eine Anweisung oder ein Ausdruck syntaktisch korrekt ist, kann es zu einem Fehler kommen, wenn man versucht, sie auszuführen. Fehler, die während der Ausführung entdeckt werden, werden *Ausnahmen* genannt und sind nicht unbedingt fatal: Sie werden bald lernen, wie man sie in Python-Programmen behandelt. Die meisten Ausnahmen werden jedoch nicht von Programmen behandelt und führen zu Fehlermeldungen wie hier gezeigt::
fa: حتی اگر یک عبارت یا عبارت از نظر نحوی صحیح باشد، ممکن است هنگام تلاش برای اجرای آن خطا ایجاد کند. خطاهایی که در حین اجرا شناسایی می شوند *exceptions* نامیده می شوند و بی قید و شرط کشنده نیستند: به زودی یاد خواهید گرفت که چگونه آنها را در برنامه های پایتون مدیریت کنید. با این حال، اکثر استثناها توسط برنامه ها مدیریت نمی شوند و منجر به پیام های خطا می شوند که در اینجا نشان داده شده است:
hu: Ha egy állítás vagy kifejezés szintaktikailag helyes, akkor is okozhat hibát, ha megpróbáljuk végrehajtani. A végrehajtás során észlelt hibákat *kivételeknek (execptions)* nevezzük és nem feltétlenül végzetesek: nemsokára megtanulod, hogyan kezeld ezeket a Python programban. A legtöbb kivételt általában nem kezelik a programok, ekkor az alábbiakhoz hasonló hibaüzeneteket adnak::
ru: Даже если инструкция или выражение корректны синтаксически, они могут привести к ошибке при попытке их исполнить. Ошибки, появляющиеся во время выполнения программы, называются *исключениями*, и они не всегда фатальны: скоро вы узнаете, как их обрабатывать. Однако большинство исключений не обрабатываются программами и приводят к сообщениями об ошибке, как это::

source: >>> 10 * (1/0) Traceback (most recent call last): File "<stdin>", line 1, in <module> 10 * (1/0) ~^~ ZeroDivisionError: division by zero >>> 4 + spam*3 Traceback (most recent call last): File "<stdin>", line 1, in <module> 4 + spam*3 ^^^^ NameError: name 'spam' is not defined >>> '2' + 2 Traceback (most recent call last): File "<stdin>", line 1, in <module> '2' + 2 ~~~~^~~ TypeError: can only concatenate str (not "int") to str
fa: >>> 10 * (1/0) Traceback (most recent call last): File "<stdin>", line 1, in <module> 10 * (1/0) ~^~ ZeroDivisionError: تقسیم بر صفر >>> 4 + spam*3 Traceback (most recent call last): File "<stdin>", line 1, in <module> 4 + spam*3 ^^^^ NameError: نام "هرزنامه" تعریف نشده است >>> '2' + 2 ردیابی (آخرین تماس اخیر): فایل "<stdin>", خط 1، در <module> '2' + 2 ~~~~^~~ TypeError: فقط می تواند str (نه "int") را به str الحاق کند

source: The last line of the error message indicates what happened. Exceptions come in different types, and the type is printed as part of the message: the types in the example are :exc:`ZeroDivisionError`, :exc:`NameError` and :exc:`TypeError`. The string printed as the exception type is the name of the built-in exception that occurred. This is true for all built-in exceptions, but need not be true for user-defined exceptions (although it is a useful convention). Standard exception names are built-in identifiers (not reserved keywords).
de: In der letzten Zeile der Fehlermeldung steht, was passiert ist. Ausnahmen gibt es in verschiedenen Typen, und der Typ wird als Teil der Meldung ausgegeben: Die Typen im Beispiel sind :exc:`ZeroDivisionError`, :exc:`NameError` und :exc:`TypeError`. Die als Ausnahmetyp ausgegebene Zeichenkette ist der Name der aufgetretenen eingebauten Ausnahme. Dies gilt für alle eingebauten Ausnahmen, muss aber nicht für benutzerdefinierte Ausnahmen gelten (obwohl es eine nützliche Konvention ist). Standardausnahmenamen sind eingebaute Bezeichner (keine reservierten Schlüsselwörter).
fa: خط آخر پیام خطا نشان می دهد که چه اتفاقی افتاده است. استثناها انواع مختلفی دارند و نوع به عنوان بخشی از پیام چاپ می شود: انواع موجود در مثال :exc:`ZeroDivisionError`، :exc:`NameError` و :exc:`TypeError` هستند. رشته چاپ شده به عنوان نوع استثنا، نام استثنای داخلی است که رخ داده است. این برای همه استثناهای داخلی صادق است، اما لازم نیست برای استثناهای تعریف شده توسط کاربر صادق باشد (اگرچه این یک قرارداد مفید است). نام‌های استثنای استاندارد، شناسه‌های داخلی هستند (کلمات کلیدی رزرو شده نیستند).
hu: A hibaüzenetek utolsó sora mutatja, mi történt. Különböző típusú kivételeket kaphatunk, és a típus az üzenet részeként kerül kiíratásra: a típusok a példákban: :exc:`ZeroDivisionError` (nullával való osztás), :exc:`NameError` (név hiba) és :exc:`TypeError` (típussal kapcsolatos hiba). A kivétel típusaként kiírt szöveg a fellépő kivétel beépített (built-in) neve. Ez minden belső kivételre igaz, de nem feltétlenül igaz a felhasználó által definiált kivételekre (habár ez egy hasznos megállapodás). A szokásos kivételnevek belső azonosítók (nem fenntartott kulcsszavak).
ru: Последняя строка сообщения об ошибке указывает, что произошло. Исключения бывают разных типов, и тип исключения включён в сообщении: в примере вызваны ошибки типов :exc:`ZeroDivisionError`, :exc:`NameError` и :exc:`TypeError`. Строка, напечатанная в качестве типа исключения — это имя встроенного исключения, которое произошло. Так происходит для всех встроенных исключений, но пользовательские исключения могут печататься по-другому (но это полезное соглашение). Имена стандартных ошибок — встроенные идентификаторы (не зарезервированные ключевые слова, как :keyword:`if`).

source: The rest of the line provides detail based on the type of exception and what caused it.
de: Der Rest der Zeile enthält detaillierte Informationen über die Art der Ausnahme und deren Ursache.
fa: بقیه خط جزئیات را بر اساس نوع استثنا و آنچه باعث آن شده است ارائه می دهد.
hu: A sor fennmaradó része egy részletezés, amelynek alakja a kivétel fajtájától függ.
ru: Остаток строки содержит уточняющую информацию, которая зависит от типа исключения и от причины его возникновения.

source: The preceding part of the error message shows the context where the exception occurred, in the form of a stack traceback. In general it contains a stack traceback listing source lines; however, it will not display lines read from standard input.
de: Der vorangehende Teil der Fehlermeldung zeigt den Kontext, in dem die Ausnahme aufgetreten ist, in Form eines Stack-Tracebacks. Im Allgemeinen enthält er einen Stack-Traceback, der die Zeilen des Quellcodes auflistet; er zeigt jedoch keine Zeilen an, die von der Standardeingabe gelesen wurden.
fa: قسمت قبلی پیام خطا، زمینه ای را که در آن استثنا رخ داده است، به شکل پشته ردیابی نشان می دهد. به طور کلی شامل یک پشته ردیابی خطوط منبع است. با این حال، خطوط خوانده شده از ورودی استاندارد را نمایش نمی دهد.
ru: Начальная часть сообщения об ошибке показывает контекст, в котором произошло исключение, в виде трассировки стека — она показывает список строк исходного кода, через которые прошло исключение.

source: :ref:`bltin-exceptions` lists the built-in exceptions and their meanings.
de: :ref:`bltin-exceptions` listet die eingebauten Ausnahmen und ihre Bedeutungen auf.
fa: :ref:`bltin-exceptions` استثناهای داخلی و معانی آنها را فهرست می کند.
hu: A Python Library Reference felsorolja a belső kivételeket és a jelentéseiket.
ru: В разделе :ref:`bltin-exceptions` перечисле встроенные исключения и их смысл.

source: Handling Exceptions
de: Behandlung von Ausnahmen
fa: رسیدگی به استثناها
hu: Kivételek kezelése
ru: Обработка исключений

source: It is possible to write programs that handle selected exceptions. Look at the following example, which asks the user for input until a valid integer has been entered, but allows the user to interrupt the program (using :kbd:`Control-C` or whatever the operating system supports); note that a user-generated interruption is signalled by raising the :exc:`KeyboardInterrupt` exception. ::
de: Es ist möglich, Programme zu schreiben, die ausgewählte Ausnahmen behandeln. Schauen Sie sich das folgende Beispiel an, das den Benutzer zur Eingabe auffordert, bis ein gültiger Integer eingegeben wurde, dem Benutzer aber erlaubt, das Programm zu unterbrechen (mit :kbd:`Control-C` oder was auch immer das Betriebssystem unterstützt); beachten Sie, dass eine vom Benutzer erzeugte Unterbrechung durch das Auslösen der Ausnahme :exc:`KeyboardInterrupt` signalisiert wird. ::
fa: امکان نوشتن برنامه هایی وجود دارد که استثناهای انتخاب شده را مدیریت کنند. به مثال زیر نگاه کنید، که از کاربر درخواست ورودی می کند تا زمانی که یک عدد صحیح صحیح وارد شود، اما به کاربر اجازه می دهد برنامه را قطع کند (با استفاده از :kbd:`Control-C` یا هر چیزی که سیستم عامل پشتیبانی می کند). توجه داشته باشید که یک وقفه ایجاد شده توسط کاربر با بالا بردن استثنای :exc:`KeyboardInterrupt` علامت گذاری می شود. ::
hu: Van rá lehetőség, hogy olyan programokat írjunk, amik kezelik a különböző kivételeket (exception). Nézzük csak a következő példát, amely addig kérdezi a felhasználótól az értéket amíg egy egész számot nem ír be, de megengedi a felhasználónak, hogy megszakítsa a program futását (a :kbd:`Control-C` használatával, vagy amit az operációs rendszer támogat). Jegyezzük meg, hogy a felhasználó által létrehozott megszakítás :exc:`KeyboardInterrupt` kivételként lép fel. ::
ru: Можно сделать так, чтобы программа обрабатывала выбранные исключения. В следующем примере, программа спрашивает ввод у пользователя, пока он не введёт валидное число, но позволяет пользователю прервать программу (с помощью :kbd:`Control-C` или другого способа, зависит от операционной системы). Заметьте, что прерывание, вызываемое пользователем, сообщается с помощью исключения :exc:`KeyboardInterrupt`. ::

source: The :keyword:`try` statement works as follows.
de: Die :keyword:`try` Anweisung funktioniert wie folgt.
fa: دستور :keyword:`try` به صورت زیر عمل می کند.
hu: A :keyword:`try` utasítás a következőképpen működik.
ru: Инструкция :keyword:`try` работает следующим образом.

source: First, the *try clause* (the statement(s) between the :keyword:`try` and :keyword:`except` keywords) is executed.
de: Zuerst wird die *Try-Klausel* (Die Anweisung(en) zwischen den Schlüsselwörtern :keyword:`try` und :keyword:`except`) ausgeführt.
fa: ابتدا *try clause* (عبارت(های) بین کلمات کلیدی :keyword:`try` و :keyword:`except`) اجرا می شود.
hu: Először a *try-mellékág* hajtódik végre, azaz a :keyword:`try` és :keyword:`except` közötti utasítások.
ru: Первым делом, выполняется *ветка ``try``*, то есть инструкции между :keyword:`try` и :keyword:`except`.

source: If no exception occurs, the *except clause* is skipped and execution of the :keyword:`try` statement is finished.
de: Wenn keine Ausnahme auftritt, wird die *except-Klausel übersprungen und die Ausführung von der :keyword:`try` Anweisung beendet.
fa: اگر هیچ استثنایی رخ ندهد، *except clause* نادیده گرفته می شود و اجرای دستور :keyword:`try` به پایان می رسد.
hu: Ha nem lép fel kivétel, az *except-ágat* a program átugorja, és a :keyword:`try` utasítás befejeződik.
ru: Если исключение не возникает, *ветка ``except``* пропускается, и выполнение инструкции :keyword:`try` завершается.

source: If an exception occurs during execution of the :keyword:`try` clause, the rest of the clause is skipped. Then, if its type matches the exception named after the :keyword:`except` keyword, the *except clause* is executed, and then execution continues after the try/except block.
fa: اگر در حین اجرای بند :keyword:`try` استثنایی رخ دهد، بقیه بند حذف می شود. سپس، اگر نوع آن با استثنای نام‌گذاری شده پس از کلمه کلیدی :keyword:`except` مطابقت داشته باشد، *except clause* اجرا می‌شود و سپس اجرا بعد از بلوک try/except ادامه می‌یابد.
ru: Если исключение возникает во время выполнения пункта :keyword:`try` , остальная часть пункта пропускается. Затем, если его тип совпадает с именем исключения, указанным после ключевого слова :keyword:`except`, выполняется *пункт except*, а затем выполнение продолжается после блока try/except.

source: If an exception occurs which does not match the exception named in the *except clause*, it is passed on to outer :keyword:`try` statements; if no handler is found, it is an *unhandled exception* and execution stops with an error message.
fa: اگر استثنایی رخ دهد که با استثنای نام‌گذاری شده در *except clause* مطابقت نداشته باشد، به دستورات :keyword:`try` خارجی منتقل می‌شود. اگر کنترل کننده ای پیدا نشد، یک *unhandled exception* است و اجرا با یک پیام خطا متوقف می شود.

source: A :keyword:`try` statement may have more than one *except clause*, to specify handlers for different exceptions. At most one handler will be executed. Handlers only handle exceptions that occur in the corresponding *try clause*, not in other handlers of the same :keyword:`!try` statement. An *except clause* may name multiple exceptions as a parenthesized tuple, for example::
fa: یک دستور :keyword:`try` ممکن است بیش از یک *except clause* داشته باشد تا کنترل کننده هایی را برای استثناهای مختلف مشخص کند. حداکثر یک کنترل کننده اجرا خواهد شد. کنترل‌کننده‌ها فقط استثناهایی را که در *try clause* مربوطه رخ می‌دهند، کنترل می‌کنند، نه در سایر کنترل‌کننده‌های همان عبارت :keyword:`!try`. یک *except clause* ممکن است چندین استثنا را به عنوان یک تاپل پرانتز نامگذاری کند، به عنوان مثال:
ru: Инструкция :keyword:`try` может содержать более одного *пункта except*, чтобы указать обработчики для разных исключений. Будет выполнен только один обработчик. Обработчики обрабатывают только исключения, возникающие в соответствующем *пункте try*, а не в других обработчиках того же :keyword:`!try` выражения. *Пункт except* может указывать несколько исключений в виде кортежа в скобках, например::

source: ... except (RuntimeError, TypeError, NameError): ... pass
fa: ... به جز (RuntimeError, TypeError, NameError): ... بگذرد

source: A class in an :keyword:`except` clause matches exceptions which are instances of the class itself or one of its derived classes (but not the other way around --- an *except clause* listing a derived class does not match instances of its base classes). For example, the following code will print B, C, D in that order::
fa: یک کلاس در یک عبارت :keyword:`except` با استثناهایی مطابقت دارد که نمونه هایی از خود کلاس یا یکی از کلاس های مشتق شده آن هستند (اما نه برعکس --- یک *except clause* که یک کلاس مشتق شده را فهرست می کند با نمونه های کلاس های پایه آن مطابقت ندارد). به عنوان مثال، کد زیر B، C، D را به ترتیب چاپ می کند:

source: Note that if the *except clauses* were reversed (with ``except B`` first), it would have printed B, B, B --- the first matching *except clause* is triggered.
fa: توجه داشته باشید که اگر *except clauses* معکوس می شد (اول با ``except B``), B، B، B چاپ می شد --- اولین *except clause* منطبق فعال می شود.
ru: Обратите внимание, что если развернуть порядок обработчиков (поставив ``except B`` на первое место), код напечатает B, B, B --- сработает первый совпадающий *пункт except*.

source: When an exception occurs, it may have associated values, also known as the exception's *arguments*. The presence and types of the arguments depend on the exception type.
fa: هنگامی که یک استثنا رخ می دهد، ممکن است مقادیر مرتبطی داشته باشد که به نام *arguments* استثنا نیز شناخته می شود. وجود و انواع آرگومان ها به نوع استثنا بستگی دارد.

source: The *except clause* may specify a variable after the exception name. The variable is bound to the exception instance which typically has an ``args`` attribute that stores the arguments. For convenience, builtin exception types define :meth:`~object.__str__` to print all the arguments without explicitly accessing ``.args``. ::
fa: *except clause* ممکن است متغیری را بعد از نام استثنا مشخص کند. متغیر به نمونه استثنایی که معمولاً دارای یک ویژگی ``args`` است که آرگومان ها را ذخیره می کند، مقید است. برای راحتی، انواع استثناهای داخلی :meth:`~object.__str__` را برای چاپ تمام آرگومان‌ها بدون دسترسی صریح به ``.args`` تعریف می‌کنند. ::

source: >>> try: ... raise Exception('spam', 'eggs') ... except Exception as inst: ... print(type(inst)) # the exception type ... print(inst.args) # arguments stored in .args ... print(inst) # __str__ allows args to be printed directly, ... # but may be overridden in exception subclasses ... x, y = inst.args # unpack args ... print('x =', x) ... print('y =', y) ... <class 'Exception'> ('spam', 'eggs') ('spam', 'eggs') x = spam y = eggs
fa: >>> امتحان کنید: ... افزایش استثنا ("هرزنامه", "تخم مرغ") ... به جز استثنا به عنوان inst: ... print(type(inst)) # نوع استثنا ... print(inst.args) # آرگومان ذخیره شده در args ... print(inst) # __str__ اجازه می دهد که args به طور مستقیم چاپ شود، ... # اما ممکن است در زیر کلاس های استثنا لغو شود ... x, y = inst.args # unpack args ... چاپ ('x =', x) ... چاپ ('y =', y) ... <class 'Exception'> ("هرزنامه", "تخم مرغ") ("هرزنامه", "تخم مرغ") x = هرزنامه y = تخم مرغ

source: The exception's :meth:`~object.__str__` output is printed as the last part ('detail') of the message for unhandled exceptions.
fa: خروجی :meth:`~object.__str__` استثنا به عنوان آخرین بخش («جزئیات») پیام برای استثناهای کنترل نشده چاپ می شود.

source: :exc:`BaseException` is the common base class of all exceptions. One of its subclasses, :exc:`Exception`, is the base class of all the non-fatal exceptions. Exceptions which are not subclasses of :exc:`Exception` are not typically handled, because they are used to indicate that the program should terminate. They include :exc:`SystemExit` which is raised by :meth:`sys.exit` and :exc:`KeyboardInterrupt` which is raised when a user wishes to interrupt the program.
fa: :exc:`BaseException` کلاس پایه مشترک همه استثناها است. یکی از زیر کلاس های آن، :exc:`Exception`، کلاس پایه همه استثناهای غیر کشنده است. استثناهایی که زیر کلاس های :exc:`Exception` نیستند معمولاً رسیدگی نمی شوند، زیرا برای نشان دادن اینکه برنامه باید خاتمه یابد استفاده می شود. آنها شامل :exc:`SystemExit` است که توسط :meth:`sys.exit` افزایش می یابد و :exc:`KeyboardInterrupt` که زمانی که کاربر می خواهد برنامه را قطع کند، افزایش می یابد.

source: :exc:`Exception` can be used as a wildcard that catches (almost) everything. However, it is good practice to be as specific as possible with the types of exceptions that we intend to handle, and to allow any unexpected exceptions to propagate on.
fa: :exc:`Exception` می تواند به عنوان یک علامت عام استفاده شود که (تقریبا) همه چیز را می گیرد. با این حال، تمرین خوبی است که تا حد امکان در مورد انواع استثناهایی که قصد رسیدگی به آنها را داریم، خاص باشیم و اجازه دهیم هر استثنای غیرمنتظره ای در آن منتشر شود.

source: The most common pattern for handling :exc:`Exception` is to print or log the exception and then re-raise it (allowing a caller to handle the exception as well)::
fa: رایج‌ترین الگو برای مدیریت :exc:`Exception` چاپ یا ثبت استثنا و سپس بالا بردن مجدد آن است (به تماس‌گیرنده اجازه می‌دهد تا استثنا را نیز مدیریت کند):

source: The :keyword:`try` ... :keyword:`except` statement has an optional *else clause*, which, when present, must follow all *except clauses*. It is useful for code that must be executed if the *try clause* does not raise an exception. For example::
fa: دستور :keyword:`try` ... :keyword:`except` یک *else clause* اختیاری دارد که در صورت وجود، باید از تمام *except clauses* پیروی کند. اگر *try clause* استثنایی ایجاد نکند برای کدهایی مفید است که باید اجرا شوند. به عنوان مثال::
ru: У оператора :keyword:`try` ... :keyword:`except` есть опциональный блок *else*, который, если существует, должен следовать после всех блоков *except*. Его используют, когда нужно выполнить какой-то код, если блок *try* не породил исключение. Например::

source: The use of the :keyword:`!else` clause is better than adding additional code to the :keyword:`try` clause because it avoids accidentally catching an exception that wasn't raised by the code being protected by the :keyword:`!try` ... :keyword:`!except` statement.
de: Die Verwendung der :keyword:`!else` Klausel ist besser als das Hinzufügen von zusätzlichem Code zu der :keyword:`try` Klausel, weil dadurch vermieden wird, dass versehentlich eine Ausnahme abgefangen wird, die nicht durch den Code ausgelöst wurde, der durch die :keyword:`!try` ... :keyword:`!except` Anweisung geschützt wird.
fa: استفاده از بند :keyword:`!else` بهتر از افزودن کد اضافی به عبارت :keyword:`try` است زیرا از گرفتن تصادفی استثنایی که توسط کد محافظت شده توسط دستور :keyword:`!try` ... :keyword:`!except` ایجاد نشده است جلوگیری می کند.
ru: Использовать ветки :keyword:`!else` лучше, чем помещать дополнительный код в ветку :keyword:`try`, потому что не создаёт опасности поймать ошибку, которая произошла не непосредственно в защищаемом с помощью инструкции :keyword:`!try` ... :keyword:`!except` коде.
