Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/tutorial/inputoutput.po
Languages: fa, ru

source: There are several ways to present the output of a program; data can be printed in a human-readable form, or written to a file for future use. This chapter will discuss some of the possibilities.
fa: راه های مختلفی برای ارائه خروجی یک برنامه وجود دارد. داده ها را می توان به شکل قابل خواندن توسط انسان چاپ کرد یا برای استفاده در آینده در یک فایل نوشت. این فصل برخی از احتمالات را مورد بحث قرار خواهد داد.
ru: Есть несколько способов представить вывод программы. Данные могут быть напечатаны в человекочитаемом виде или записаны в файл для дальнейшего использования. В этой главе мы рассмотрим разные возможности ввода и вывода.

source: Fancier Output Formatting
fa: قالب بندی خروجی فانتزی
ru: Продвинутое форматирование выводв

source: So far we've encountered two ways of writing values: *expression statements* and the :func:`print` function. (A third way is using the :meth:`~io.TextIOBase.write` method of file objects; the standard output file can be referenced as ``sys.stdout``. See the Library Reference for more information on this.)
fa: تا کنون با دو روش برای نوشتن مقادیر مواجه شده‌ایم: *expression statements* و تابع :func:`print`. (روش سوم استفاده از روش :meth:`~io.TextIOBase.write` برای اشیاء فایل است؛ فایل خروجی استاندارد را می توان به عنوان ``sys.stdout`` ارجاع داد. برای اطلاعات بیشتر در این مورد به مرجع کتابخانه مراجعه کنید.)
ru: Пока мы столкнулись с двумя способами записи значений: *выражениями* и функцией :func:`print`. (Третий способ - использование метода :meth:`~io.TextIOBase.write` объектов файлов; на стандартный выходной файл можно ссылаться как на ``sys.stdout``. См. Справочник по библиотеке для получения дополнительной информации об этом.)

source: Often you'll want more control over the formatting of your output than simply printing space-separated values. There are several ways to format output.
fa: اغلب شما می خواهید کنترل بیشتری بر قالب بندی خروجی خود داشته باشید تا صرفاً چاپ مقادیر جدا شده از فضا. روش های مختلفی برای فرمت کردن خروجی وجود دارد.
ru: Часто вам захочется иметь больше контроля над выводом, а не просто выводить значения, разделённые пробелами. Есть несколько способов форматировать вывод.

source: To use :ref:`formatted string literals <tut-f-strings>`, begin a string with ``f`` or ``F`` before the opening quotation mark or triple quotation mark. Inside this string, you can write a Python expression between ``{`` and ``}`` characters that can refer to variables or literal values.
fa: برای استفاده از :ref:`formatted string literals <tut-f-strings>`، یک رشته را با ``f`` یا ``F`` قبل از گیومه آغازین یا علامت نقل قول سه گانه شروع کنید. در داخل این رشته، می‌توانید یک عبارت پایتون بین کاراکترهای ``{`` و ``}`` بنویسید که می‌تواند به متغیرها یا مقادیر واقعی اشاره کند.
ru: Чтобы использовать :ref`форматные литералы <tut-f-strings>` ("f-строки"), поставьте ``f`` или ``F`` перед открывающей одинарной или тройной кавычкой у строкового литерала. Внутри форматного литерала между символами ``{`` и ``}`` можно вставить выражение на Python. Оно может содержать переменные и другие литералы.

source: The :meth:`str.format` method of strings requires more manual effort. You'll still use ``{`` and ``}`` to mark where a variable will be substituted and can provide detailed formatting directives, but you'll also need to provide the information to be formatted. In the following code block there are two examples of how to format variables:
fa: روش :meth:`str.format` رشته ها به تلاش دستی بیشتری نیاز دارد. شما همچنان از ``{`` و ``}`` برای علامت‌گذاری جایی که متغیر جایگزین می‌شود و می‌تواند دستورالعمل‌های قالب‌بندی دقیق را ارائه کند، استفاده می‌کنید، اما همچنین باید اطلاعاتی را برای قالب‌بندی ارائه کنید. در بلوک کد زیر دو مثال از نحوه قالب بندی متغیرها وجود دارد:
ru: Метод строк :meth:`str.format` требует больше ручных усилий. Вы по-прежнему будете использовать ``{`` и ``}``, чтобы отметить, где будет подставлена ​​переменная, и сможете предоставить подробные директивы форматирования, но вам также необходимо будет предоставить информацию для форматирования. В следующем блоке кода приведены два примера форматирования переменных:

source: Notice how the ``yes_votes`` are padded with spaces and a negative sign only for negative numbers. The example also prints ``percentage`` multiplied by 100, with 2 decimal places and followed by a percent sign (see :ref:`formatspec` for details).
fa: توجه کنید که چگونه ``yes_votes`` با فاصله و علامت منفی فقط برای اعداد منفی پر شده است. این مثال همچنین ``percentage`` ضربدر 100، با 2 رقم اعشار و به دنبال آن علامت درصد چاپ می کند (برای جزئیات به :ref:`formatspec` مراجعه کنید).
ru: Обратите внимание, что ``yes_votes`` дополняется пробелами и отрицательным знаком только для отрицательных чисел. В примере также выводится ``процент``, умноженный на 100, с двумя десятичными знаками, за которым следует знак процента (подробности см. в :ref:`formatspec`).

source: Finally, you can do all the string handling yourself by using string slicing and concatenation operations to create any layout you can imagine. The string type has some methods that perform useful operations for padding strings to a given column width.
fa: در نهایت، می‌توانید با استفاده از عملیات برش و الحاق رشته‌ها برای ایجاد هر طرحی که می‌توانید تصور کنید، تمام مدیریت رشته را خودتان انجام دهید. نوع رشته دارای روش‌هایی است که عملیات مفیدی را برای قرار دادن رشته‌ها به عرض ستون معین انجام می‌دهد.
ru: Наконец, чтобы добиться любого желаемого результата, можно манипулировать строками самому с помощью срезов строки и операции конкатенации. Строковой тип данных поддерживает некоторые методы для некоторых полезных операций, например, для выравнивания строки до определённой длины.

source: When you don't need fancy output but just want a quick display of some variables for debugging purposes, you can convert any value to a string with the :func:`repr` or :func:`str` functions.
fa: هنگامی که به خروجی فانتزی نیاز ندارید اما فقط می خواهید یک نمایش سریع از برخی متغیرها برای اهداف اشکال زدایی داشته باشید، می توانید هر مقداری را با توابع :func:`repr` یا :func:`str` به رشته ای تبدیل کنید.
ru: Если вам не нужен шикарный вывод, а вы просто хотите вывести значения каких-то переменных для отладки, вы можете привести любое значение к строковому типу с помощью функций :func:`repr` или :func`str`.

source: The :func:`str` function is meant to return representations of values which are fairly human-readable, while :func:`repr` is meant to generate representations which can be read by the interpreter (or will force a :exc:`SyntaxError` if there is no equivalent syntax). For objects which don't have a particular representation for human consumption, :func:`str` will return the same value as :func:`repr`. Many values, such as numbers or structures like lists and dictionaries, have the same representation using either function. Strings, in particular, have two distinct representations.
fa: تابع :func:`str` برای برگرداندن نمایش‌هایی از مقادیری است که نسبتاً قابل خواندن توسط انسان هستند، در حالی که :func:`repr` برای تولید نمایش‌هایی است که می‌توانند توسط مفسر خوانده شوند (یا اگر دستوری معادل وجود نداشته باشد :exc:`SyntaxError` را مجبور می‌کند). برای اشیایی که نمایش خاصی برای مصرف انسان ندارند، :func:`str` همان مقدار :func:`repr` را برمی‌گرداند. بسیاری از مقادیر، مانند اعداد یا ساختارهایی مانند لیست ها و فرهنگ لغت ها، با استفاده از هر یک از تابع ها نمایش یکسانی دارند. رشته ها، به ویژه، دو نمایش مجزا دارند.
ru: Функция :func:`str` представляет значения, предназначенные для чтения человеком, тогда как :func:`repr` предназначена для создания представлений, которые понимает интерпретатор (или которые вызовут синтаксическую ошибку, если эквивалентного синтаксиса нет). Для объектов, которые нельзя представить в человекочитаемом виде, :func:`str` вернёт то же значение, что :func:`repr`. Многие значения, например, числа, списки, словари, представляются одинаково этими функциями. Строки, однако, имеют разное представление при использовании :func:`str` и :func:`repr`.

source: Some examples::
fa: چند نمونه::
ru: Несколько примеров::

source: >>> s = 'Hello, world.' >>> str(s) 'Hello, world.' >>> repr(s) "'Hello, world.'" >>> str(1/7) '0.14285714285714285' >>> x = 10 * 3.25 >>> y = 200 * 200 >>> s = 'The value of x is ' + repr(x) + ', and y is ' + repr(y) + '...' >>> print(s) The value of x is 32.5, and y is 40000... >>> # The repr() of a string adds string quotes and backslashes: >>> hello = 'hello, world\n' >>> hellos = repr(hello) >>> print(hellos) 'hello, world\n' >>> # The argument to repr() may be any Python object: >>> repr((x, y, ('spam', 'eggs'))) "(32.5, 40000, ('spam', 'eggs'))"
fa: >>> s = 'سلام, دنیا.' >>> خیابان(ها) "سلام, دنیا." >>> نماینده(های) ""سلام, دنیا." >>> خیابان (1/7) '0.14285714285714285' >>> x = 10 * 3.25 >>> y = 200 * 200 >>> s = 'مقدار x ' + repr(x) + ' است و y ' + repr(y) + '...' >>> چاپ(های) مقدار x 32.5 و y برابر 40000 است... >>> # repr() یک رشته نقل قول رشته و اسلش را اضافه می کند: >>> سلام = 'سلام, دنیا\n' >>> سلام = پاسخ (سلام) >>> چاپ (سلام) "سلام, دنیا\n" >>> # آرگومان repr() ممکن است هر شی پایتون باشد: >>> repr((x, y, ("هرزنامه", "تخم مرغ"))) "(32.5, 40000, ("هرزنامه", "تخم مرغ"))"

source: The :mod:`string` module contains a :class:`~string.Template` class that offers yet another way to substitute values into strings, using placeholders like ``$x`` and replacing them with values from a dictionary, but offers much less control of the formatting.
fa: ماژول :mod:`string` شامل یک کلاس :class:`~string.Template` است که راه دیگری را برای جایگزینی مقادیر به رشته ها، با استفاده از متغیرهایی مانند ``$x`` و جایگزینی آنها با مقادیر یک فرهنگ لغت ارائه می دهد، اما کنترل بسیار کمتری بر قالب بندی ارائه می دهد.
ru: Модуль :mod:`string` содержит класс :class:`string.Template`, который предоставляет ещё один способ подстановки значений в строки, используя заполнители, например, ``$x``, и и заменяя их с помощью значений из словаря, но даёт меньше контроля над форматированием.

source: Formatted String Literals
fa: رشته های قالب بندی شده
ru: Форматные литералы

source: :ref:`Formatted string literals <f-strings>` (also called f-strings for short) let you include the value of Python expressions inside a string by prefixing the string with ``f`` or ``F`` and writing expressions as ``{expression}``.
fa: :ref:`Formatted string literals <f-strings>` (که به اختصار رشته‌های f نیز نامیده می‌شود) به شما امکان می‌دهد با پیشوند رشته با ``f`` یا ``F`` و نوشتن عبارات به‌عنوان ``{expression}``، مقدار عبارات پایتون را در داخل یک رشته قرار دهید.
ru: :ref:`Форматные литералы <f-strings>` (также называемые "f-строками") позволяют вставить значение любого выражения на Python в строку, приписав ``f`` или ``F`` в начало строкового литерала и записывая каждое выражение как ``{выражение}``.

source: An optional format specifier can follow the expression. This allows greater control over how the value is formatted. The following example rounds pi to three places after the decimal::
fa: یک مشخص کننده فرمت اختیاری می تواند عبارت را دنبال کند. این اجازه می دهد تا کنترل بیشتری بر نحوه قالب بندی مقدار داشته باشید. مثال زیر پی را به سه مکان بعد از اعشار گرد می کند:
ru: За выражением может следовать необязательный спецификатор формата. Он позволяет точнее контролировать, как именно значение будет отформатировано. Например, так можно округлить число пи до трёх цифр после точки::

source: >>> import math >>> print(f'The value of pi is approximately {math.pi:.3f}.') The value of pi is approximately 3.142.
fa: >>> وارد کردن ریاضی >>> print(f'مقدار pi تقریباً {math.pi:.3f} است.') مقدار pi تقریباً 3.142 است.

source: Passing an integer after the ``':'`` will cause that field to be a minimum number of characters wide. This is useful for making columns line up. ::
fa: عبور یک عدد صحیح بعد از ``':'`` باعث می شود که آن فیلد حداقل تعداد کاراکترها را داشته باشد. این برای ایجاد ردیف ستون ها مفید است. ::
ru: Если передать целое число после ``':'``, можно указать минимальную длину этого поля. Это полезно для выравнивания столбцов. ::

source: >>> table = {'Sjoerd': 4127, 'Jack': 4098, 'Dcab': 7678} >>> for name, phone in table.items(): ... print(f'{name:10} ==> {phone:10d}') ... Sjoerd ==> 4127 Jack ==> 4098 Dcab ==> 7678
fa: >>> جدول = {'Sjoerd': 4127, 'Jack': 4098, 'Dcab': 7678} >>> برای نام, تلفن در table.items(): ... چاپ (f'{name:10} ==> {phone:10d}') ... Sjoerd ==> 4127 جک ==> 4098 Dcab ==> 7678

source: Other modifiers can be used to convert the value before it is formatted. ``'!a'`` applies :func:`ascii`, ``'!s'`` applies :func:`str`, and ``'!r'`` applies :func:`repr`::
fa: برای تبدیل مقدار قبل از قالب بندی می توان از اصلاح کننده های دیگر استفاده کرد. ``'!a'`` :func:`ascii` را اعمال می کند، ``'!s'`` :func:`str` را اعمال می کند و ``'!r'`` :func:`repr` را اعمال می کند::
ru: Другие модификаторы преобразуют значение перед форматированием. ``'!a'`` применяет :func:`ascii`, ``'!s'`` применяет :func:`str`, а ``'!r'`` применяет :func:`repr` к значению::

source: >>> animals = 'eels' >>> print(f'My hovercraft is full of {animals}.') My hovercraft is full of eels. >>> print(f'My hovercraft is full of {animals!r}.') My hovercraft is full of 'eels'.
fa: >>> حیوانات = 'مارماهی' >>> چاپ (f'Hovercraft من پر از {حیوانات} است.') هاورکرافت من پر از مارماهی است. >>> چاپ (f'Hovercraft من پر از {حیوانات!r} است.') هاورکرافت من پر از "مارماهی" است.

source: The ``=`` specifier can be used to expand an expression to the text of the expression, an equal sign, then the representation of the evaluated expression:
fa: مشخص کننده ``=`` را می توان برای گسترش یک عبارت به متن عبارت، علامت مساوی و سپس نمایش عبارت ارزیابی شده استفاده کرد:
ru: Спецификатор ``=`` может быть использован для расширения выражения в текст выражения, знак равенства, а затем представление вычисленного выражения.

source: See :ref:`self-documenting expressions <bpo-36817-whatsnew>` for more information on the ``=`` specifier. For a reference on these format specifications, see the reference guide for the :ref:`formatspec`.
fa: برای اطلاعات بیشتر در مورد مشخص کننده ``=`` به :ref:`self-documenting expressions <bpo-36817-whatsnew>` مراجعه کنید. برای مرجع در مورد این مشخصات فرمت، راهنمای مرجع :ref:`formatspec` را ببینید.
ru: См. :ref:`self-documenting expressions <bpo-36817-whatsnew>` для получения дополнительной информации о спецификаторе ``=``. Для ссылки на эти спецификации формата см. руководство по :ref:`formatspec`.

source: The String format() Method
fa: روش String format().
ru: Строковой метод format()

source: Basic usage of the :meth:`str.format` method looks like this::
fa: استفاده اصلی از روش :meth:`str.format` به این صورت است:
ru: Базовое использование :meth:`str.format` выглядит так::

source: >>> print('We are the {} who say "{}!"'.format('knights', 'Ni')) We are the knights who say "Ni!"
fa: >>> print('ما {}هایی هستیم که می گوییم "{}!"'.format('knights', 'Ni')) ما شوالیه هایی هستیم که می گوییم "نی!"

source: The brackets and characters within them (called format fields) are replaced with the objects passed into the :meth:`str.format` method. A number in the brackets can be used to refer to the position of the object passed into the :meth:`str.format` method. ::
fa: براکت ها و کاراکترهای درون آنها (که فیلدهای قالب نامیده می شوند) با اشیاء ارسال شده به روش :meth:`str.format` جایگزین می شوند. می توان از یک عدد در براکت ها برای اشاره به موقعیت شیء ارسال شده به روش :meth:`str.format` استفاده کرد. ::
ru: Фигурные скобки и символы между ними заменяются объектами, которые были переданы в метод :meth:`str.format`. Можно поместить внутри скобок число -- оно будет указывать на позицию объекта, переданного в :meth:`str.format`. ::

source: If keyword arguments are used in the :meth:`str.format` method, their values are referred to by using the name of the argument. ::
fa: اگر از آرگومان های کلیدواژه در روش :meth:`str.format` استفاده شود، مقادیر آنها با استفاده از نام آرگومان ارجاع داده می شود. ::
ru: Если в :meth:`str.format` используются именованные аргументы, к их значениям можно обратиться, используя вместо числа имя аргумента. ::

source: >>> print('This {food} is {adjective}.'.format( ... food='spam', adjective='absolutely horrible')) This spam is absolutely horrible.
fa: >>> print('This {food} {adjective} است.'.format( ... غذا='spam', صفت='بسیار وحشتناک')) این هرزنامه کاملا وحشتناک است.

source: Positional and keyword arguments can be arbitrarily combined::
fa: آرگومان های موقعیت و کلمه کلیدی را می توان به صورت دلخواه با هم ترکیب کرد:
ru: Позиционные и именованные аргументы могут быть использованы вместе произвольным образом::

source: >>> print('The story of {0}, {1}, and {other}.'.format('Bill', 'Manfred', ... other='Georg')) The story of Bill, Manfred, and Georg.
fa: >>> print('The story of {0}, {1}, and {other}.'.format('Bill', 'Manfred', ... other='Georg')) داستان بیل، مانفرد و جورج.

source: If you have a really long format string that you don't want to split up, it would be nice if you could reference the variables to be formatted by name instead of by position. This can be done by simply passing the dict and using square brackets ``'[]'`` to access the keys. ::
fa: اگر رشته‌ای با فرمت بسیار طولانی دارید که نمی‌خواهید آن را از هم جدا کنید، خوب است اگر بتوانید به متغیرها اشاره کنید که با نام قالب‌بندی شوند به جای موقعیت. این کار را می توان با عبور دادن دستور و استفاده از براکت های مربع ``'[]'`` برای دسترسی به کلیدها انجام داد. ::
ru: Если у вас есть очень длинная форматная строка, которую вы не хотите разделять, удобно ссылаться на переменные, используемые в форматировании, по имени, а не по позиции. Это можно сделать, если передать в качестве аргумента словарь и использовать квадратные скобки ``'[]'`` для доступа к ключам. ::

source: This could also be done by passing the ``table`` dictionary as keyword arguments with the ``**`` notation. ::
fa: این را می توان با ارسال فرهنگ لغت ``table`` به عنوان آرگومان های کلیدواژه با نماد ``**`` نیز انجام داد. ::
ru: Это также можно сделать, передавая словарь ``table`` в качестве именованных аргументов с помощью обозначения ``**``. ::

source: This is particularly useful in combination with the built-in function :func:`vars`, which returns a dictionary containing all local variables::
fa: این به ویژه در ترکیب با تابع داخلی :func:`vars` مفید است، که یک فرهنگ لغت حاوی تمام متغیرهای محلی را برمی گرداند:
ru: Это особенно полезно в сочетании со встроенной функцией :func:`vars`, которая возвращает словарь, содержащий все локальные переменные::

source: As an example, the following lines produce a tidily aligned set of columns giving integers and their squares and cubes::
fa: به عنوان مثال، خطوط زیر مجموعه ای منظم از ستون ها را ایجاد می کند که اعداد صحیح و مربع ها و مکعب های آنها را ارائه می دهد:
ru: Как пример, следующие строки создают аккуратно выровненный набор столбцов, содержащих целые числа и их квадраты и кубы::

source: >>> for x in range(1, 11): ... print('{0:2d} {1:3d} {2:4d}'.format(x, x*x, x*x*x)) ... 1 1 1 2 4 8 3 9 27 4 16 64 5 25 125 6 36 216 7 49 343 8 64 512 9 81 729 10 100 1000
fa: >>> برای x در محدوده (1, 11): ... print('{0:2d} {1:3d} {2:4d}'.format(x, x*x, x*x*x)) ... 1 1 1 2 4 8 3 9 27 4 16 64 5 25 125 6 36 216 7 49 343 8 64 512 9 81 729 10 100 1000

source: For a complete overview of string formatting with :meth:`str.format`, see :ref:`formatstrings`.
fa: برای یک نمای کلی از قالب بندی رشته با :meth:`str.format`، به :ref:`formatstrings` مراجعه کنید.
ru: Для полного обзова форматиорвания строк с помощью :meth:`str.format`, см. :ref:`formatstrings`.

source: Manual String Formatting
fa: قالب بندی رشته های دستی
ru: Ручное форматирование строк

source: Here's the same table of squares and cubes, formatted manually::
fa: در اینجا همان جدول مربع و مکعب است که به صورت دستی فرمت شده است:
ru: Ту же таблицу из квадратов и кубов можно было отформатировать вручную::

source: >>> for x in range(1, 11): ... print(repr(x).rjust(2), repr(x*x).rjust(3), end=' ') ... # Note use of 'end' on previous line ... print(repr(x*x*x).rjust(4)) ... 1 1 1 2 4 8 3 9 27 4 16 64 5 25 125 6 36 216 7 49 343 8 64 512 9 81 729 10 100 1000
fa: >>> برای x در محدوده (1, 11): ... print(repr(x).rjust(2), repr(x*x).rjust(3), end=' ') ... # Note use of 'end' on previous line ... print(repr(x*x*x).rjust(4)) ... 1 1 1 2 4 8 3 9 27 4 16 64 5 25 125 6 36 216 7 49 343 8 64 512 9 81 729 10 100 1000

source: (Note that the one space between each column was added by the way :func:`print` works: it always adds spaces between its arguments.)
fa: (توجه داشته باشید که یک فاصله بین هر ستون با روش کار :func:`print` اضافه شده است: همیشه بین آرگومان های خود فاصله اضافه می کند.)
ru: (Заметьте, что пробелы между столбцами были добавлены функцией :func:`print` как разделители между аргументами.)

source: The :meth:`str.rjust` method of string objects right-justifies a string in a field of a given width by padding it with spaces on the left. There are similar methods :meth:`str.ljust` and :meth:`str.center`. These methods do not write anything, they just return a new string. If the input string is too long, they don't truncate it, but return it unchanged; this will mess up your column lay-out but that's usually better than the alternative, which would be lying about a value. (If you really want truncation you can always add a slice operation, as in ``x.ljust(n)[:n]``.)
fa: روش :meth:`str.rjust` برای اشیاء رشته‌ای، رشته‌ای را در یک میدان با عرض معین با پر کردن آن با فاصله‌های سمت چپ توجیه می‌کند. روش های مشابه :meth:`str.ljust` و :meth:`str.center` وجود دارد. این متدها چیزی نمی نویسند، فقط یک رشته جدید برمی گردانند. اگر رشته ورودی خیلی طولانی باشد، آن را کوتاه نمی‌کنند، بلکه آن را بدون تغییر برمی‌گردانند. این طرح بندی ستون شما را به هم می زند، اما معمولاً بهتر از گزینه جایگزین است که در مورد یک مقدار دروغ می گوید. (اگر واقعاً می‌خواهید کوتاه‌سازی کنید, همیشه می‌توانید عملیات برش را مانند ``x.ljust(n)[:n]`` اضافه کنید.)
ru: Метод строк :meth:`str.rjust` выравнивает строку по правому краю до определённой длины, добавляя пробелы в наало. Существуют родственные методы :meth:`str.ljust` и :meth:`str.center`. Эти методы не меняют строку, а возвращают новую. Если данная строка слишком длинная, они не обрежут её, а вернут неизменной. Это испортит вывод, но это лучше, чем другой вариант --- показывать неверное значение (например, обрезать число). (Если вам хочется обрезать строку, всегда можно использовать срез: ``x.ljust(n)[:n]``.)

source: There is another method, :meth:`str.zfill`, which pads a numeric string on the left with zeros. It understands about plus and minus signs::
fa: روش دیگری به نام :meth:`str.zfill` وجود دارد که یک رشته عددی را در سمت چپ با صفر قرار می دهد. علائم مثبت و منفی را درک می کند:
ru: Есть ещё один метод, :meth:`str.zfill`, который выравнивает численную строку нулями. Он учитывает знак (``+`` или ``-``)::

source: Old string formatting
fa: قالب بندی رشته های قدیمی
ru: Старый способ форматирования строк

source: The % operator (modulo) can also be used for string formatting. Given ``format % values`` (where *format* is a string), ``%`` conversion specifications in *format* are replaced with zero or more elements of *values*. This operation is commonly known as string interpolation. For example::
fa: عملگر % (modulo) همچنین می تواند برای قالب بندی رشته استفاده شود. با توجه به ``format % values`` (که در آن *format* یک رشته است), مشخصات تبدیل ``%`` در *format* با عناصر صفر یا بیشتر از *values* جایگزین می شود. این عملیات معمولاً به عنوان درون یابی رشته ای شناخته می شود. به عنوان مثال::
ru: Оператор % (по модулю) также можно использовать для форматирования строк. Учитывая ``формат % значений`` (где *format* — это строка), спецификации преобразования ``%`` в *format* заменяются нулем или более элементами *values*. Эта операция широко известна как строковая интерполяция. Например::
