Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/tutorial/inputoutput.po
Languages: fa, ru

source: >>> import math >>> print('The value of pi is approximately %5.3f.' % math.pi) The value of pi is approximately 3.142.
fa: >>> وارد کردن ریاضی >>> print('مقدار pi تقریباً %5.3f است.' % math.pi) مقدار pi تقریباً 3.142 است.

source: More information can be found in the :ref:`old-string-formatting` section.
fa: اطلاعات بیشتر را می توانید در بخش :ref:`old-string-formatting` بیابید.
ru: Больше информации можно найти в разделе :ref:`old-string-formatting`.

source: Reading and Writing Files
fa: خواندن و نوشتن فایل ها
ru: Чтение и запись файлов

source: :func:`open` returns a :term:`file object`, and is most commonly used with two positional arguments and one keyword argument: ``open(filename, mode, encoding=None)``
fa: :func:`open` یک :term:`file object` برمی گرداند و بیشتر با دو آرگومان موقعیتی و یک آرگومان کلمه کلیدی استفاده می شود: ``open(filename, mode, encoding=None)``
ru: :func:`open` возвращает :term:`file object` и наиболее часто используется с двумя позиционными аргументами и одним именованным аргументом: ``open(filename, mode, encoding=None)``

source: The first argument is a string containing the filename. The second argument is another string containing a few characters describing the way in which the file will be used. *mode* can be ``'r'`` when the file will only be read, ``'w'`` for only writing (an existing file with the same name will be erased), and ``'a'`` opens the file for appending; any data written to the file is automatically added to the end. ``'r+'`` opens the file for both reading and writing. The *mode* argument is optional; ``'r'`` will be assumed if it's omitted.
fa: آرگومان اول رشته ای است که نام فایل را در خود دارد. آرگومان دوم رشته دیگری است که حاوی چند کاراکتر است که نحوه استفاده از فایل را توصیف می کند. *mode* می تواند ``'r'`` باشد زمانی که فایل فقط خوانده شود، ``'w'`` فقط برای نوشتن (فایل موجود با همین نام پاک می شود) و ``'a'`` فایل را برای الحاق باز می کند. هر داده ای که در فایل نوشته شده است به طور خودکار به انتها اضافه می شود. ``'r+'`` فایل را برای خواندن و نوشتن باز می کند. آرگومان *mode* اختیاری است. در صورت حذف ``'r'`` فرض می شود.
ru: Первый аргумент --- строка, содержащая имя файла. Второй аргумент --- строка, содержащая несколько символов, которые описывают, каким образом файл будет использован. *mode* может быть ``'r'`` для чтения (от английского *read*), ``'w'`` для записи (от английского *write*) (существующий файл с этим именем будет очищен), и ``'a'`` для добавления информации в конец файла (от английского *append*). ``r+`` открывает файл для чтения и записи одновременно. Аргумент *mode* необязательный, если режим не указан, он считается равным ``'r'``.

source: Normally, files are opened in :dfn:`text mode`, that means, you read and write strings from and to the file, which are encoded in a specific *encoding*. If *encoding* is not specified, the default is platform dependent (see :func:`open`). Because UTF-8 is the modern de-facto standard, ``encoding="utf-8"`` is recommended unless you know that you need to use a different encoding. Appending a ``'b'`` to the mode opens the file in :dfn:`binary mode`. Binary mode data is read and written as :class:`bytes` objects. You can not specify *encoding* when opening file in binary mode.
fa: معمولاً فایل‌ها در حالت :dfn:`text mode` باز می‌شوند، به این معنی که شما رشته‌هایی را از و به فایل می‌خوانید و می‌نویسید که در یک *encoding* کدگذاری شده‌اند. اگر *encoding* مشخص نشده باشد، پیش‌فرض به پلتفرم وابسته است (به :func:`open` مراجعه کنید). از آنجایی که UTF-8 استاندارد واقعی مدرن است، ``encoding="utf-8"`` توصیه می‌شود مگر اینکه بدانید که باید از رمزگذاری دیگری استفاده کنید. با افزودن یک ``'b'`` به حالت، فایل در :dfn:`حالت باینری` باز می‌شود. داده‌های حالت باینری به صورت اشیاء :class:`bytes` خوانده و نوشته می‌شوند. هنگام باز کردن فایل در حالت باینری نمی‌توانید *encoding* را مشخص کنید.
ru: Обычно файлы открываются в :dfn:`текстовом режиме`, что означает, что вы читаете и записываете строки из файла, которые закодированы в определенной кодировке. Если *encoding* не указана, то значение по умолчанию зависит от платформы (см. :func:`open`). Поскольку UTF-8 является современным стандартом де-факто, рекомендуется использовать ``encoding="utf-8"``, если вы не знаете, что вам нужно использовать другую кодировку. Добавление ``'b'`` к режиму открывает файл в :dfn:`бинарном режиме`. Данные в бинарном режиме читаются и записываются в виде объектов :class:`bytes`. Вы не можете указывать *encoding* при открытии файла в бинарном режиме.

source: In text mode, the default when reading is to convert platform-specific line endings (``\n`` on Unix, ``\r\n`` on Windows) to just ``\n``. When writing in text mode, the default is to convert occurrences of ``\n`` back to platform-specific line endings. This behind-the-scenes modification to file data is fine for text files, but will corrupt binary data like that in :file:`JPEG` or :file:`EXE` files. Be very careful to use binary mode when reading and writing such files.
fa: در حالت متنی، پیش‌فرض هنگام خواندن، تبدیل انتهای خطوط مخصوص پلتفرم (``\n`` در یونیکس, ``\r\n`` در ویندوز) فقط به ``\n`` است. هنگام نوشتن در حالت متنی، پیش‌فرض این است که رخدادهای ``\n`` را به انتهای خط‌های مخصوص پلتفرم تبدیل کنید. این تغییر پشت صحنه برای داده های فایل برای فایل های متنی مناسب است، اما داده های باینری مانند فایل های :file:`JPEG` یا :file:`EXE` را خراب می کند. هنگام خواندن و نوشتن چنین فایل هایی بسیار مراقب باشید که از حالت باینری استفاده کنید.
ru: В текстовом режиме поведение по умолчанию --- преобразовывать специфичные для платформы окончания строк (``\n`` на Unix, ``\r\n`` на Windows) в просто ``\n``. При записи в текстовом режиме происходит обратное --- ``\n`` превращаются в специфичные для платформы окончания строк. Такие изменения подходят для текстовых файлов, но испортят двоичные данные, например, :file:`JPEG` или :file:`EXE`. Будьте осторожны и используйте только двоичный режим при чтении и записи таких файлов.

source: It is good practice to use the :keyword:`with` keyword when dealing with file objects. The advantage is that the file is properly closed after its suite finishes, even if an exception is raised at some point. Using :keyword:`!with` is also much shorter than writing equivalent :keyword:`try`\ -\ :keyword:`finally` blocks::
fa: استفاده از کلمه کلیدی :keyword:`with` هنگام برخورد با اشیاء فایل تمرین خوبی است. مزیت این است که فایل پس از اتمام مجموعه به درستی بسته می شود، حتی اگر در نقطه ای استثنا مطرح شود. استفاده از :keyword:`!with` نیز بسیار کوتاهتر از نوشتن بلوک های معادل :keyword:`try`\ -\ :keyword:`finally` است::
ru: При работе с файлами использование конструкции :keyword:`with` --- хорошая практика. Преимущество в том, что файл точно будет закрыт после того, как его обработка завершена, даже если в какой-то момент было порождено исключение. Также код, использующий :keyword:`!with`, получается короче, чем эквивалентные блоки keyword:`try`\ -\ :keyword:`finally` ::

source: If you're not using the :keyword:`with` keyword, then you should call ``f.close()`` to close the file and immediately free up any system resources used by it.
fa: اگر از کلمه کلیدی :keyword:`with` استفاده نمی کنید، باید با ``f.close()`` تماس بگیرید تا فایل را ببندید و فوراً منابع سیستمی که توسط آن استفاده می شود آزاد کنید.
ru: Если вы не используете конструкцию :keyword:`with`, вам придётся вызвать ``f.close()``, чтобы закрыть файл и вернуть системные ресурсы, которые он использовал.

source: Calling ``f.write()`` without using the :keyword:`!with` keyword or calling ``f.close()`` **might** result in the arguments of ``f.write()`` not being completely written to the disk, even if the program exits successfully.
fa: فراخوانی ``f.write()`` بدون استفاده از کلمه کلیدی :keyword:`!with` یا فراخوانی ``f.close()`` **might** باعث می شود که آرگومان های ``f.write()`` به طور کامل روی دیسک نوشته نشود، حتی اگر برنامه با موفقیت خارج شود.
ru: Если вы вызовите ``f.write()`` , но забудете закрыть файл (с помощью :keyword:`!with` или вызова ``f.close()``), данные могут не до конца записаться на диск, даже если программа завершится нормально.

source: After a file object is closed, either by a :keyword:`with` statement or by calling ``f.close()``, attempts to use the file object will automatically fail. ::
fa: پس از بسته شدن یک شی فایل، یا با دستور :keyword:`with` یا با فراخوانی ``f.close()``، تلاش برای استفاده از شی فایل به طور خودکار شکست خواهد خورد. ::
ru: После того, как файловый объект закрывается либо с помощью инструкции :keyword:`with`, либо с помощью вызова ``f.close()``, попытки использовать этот файловый объект автоматически провалятся. ::

source: >>> f.close() >>> f.read() Traceback (most recent call last): File "<stdin>", line 1, in <module> ValueError: I/O operation on closed file.
fa: >>> f.close() >>> f.read() ردیابی (آخرین تماس اخیر): فایل "<stdin>", خط 1، در <module> ValueError: عملیات I/O روی فایل بسته.

source: Methods of File Objects
fa: روش های فایل اشیاء
ru: Методы файловых объектов

source: The rest of the examples in this section will assume that a file object called ``f`` has already been created.
fa: بقیه مثال های این بخش فرض می کنند که یک شی فایل به نام ``f`` قبلا ایجاد شده است.
ru: Примеры в данном разделе предполагают, что файловый объект ``f`` уже был создан.

source: To read a file's contents, call ``f.read(size)``, which reads some quantity of data and returns it as a string (in text mode) or bytes object (in binary mode). *size* is an optional numeric argument. When *size* is omitted or negative, the entire contents of the file will be read and returned; it's your problem if the file is twice as large as your machine's memory. Otherwise, at most *size* characters (in text mode) or *size* bytes (in binary mode) are read and returned. If the end of the file has been reached, ``f.read()`` will return an empty string (``''``). ::
fa: برای خواندن محتویات یک فایل، با ``f.read(size)`` تماس بگیرید، که مقداری از داده را می خواند و آن را به صورت رشته (در حالت متنی) یا شی بایت (در حالت باینری) برمی گرداند. *size* یک آرگومان عددی اختیاری است. هنگامی که *size* حذف یا منفی باشد، کل محتویات فایل خوانده شده و برگردانده می شود. اگر حجم فایل دو برابر حافظه دستگاه شما باشد، مشکل شماست. در غیر این صورت، حداکثر کاراکترهای *size* (در حالت متنی) یا *size* بایت (در حالت باینری) خوانده و برگردانده می شوند. اگر به پایان فایل رسیده باشد، ``f.read()`` یک رشته خالی (``''``) برمی گرداند. ::
ru: Чтобы прочитать содержимое файла, можно вызвать ``f.read(size)``, что прочтёт некоторое количество данных и вернёт их в виде строки (в текстовом режими) или объекта байтов (в двоичном режиме). *size* --- необязательный числовой аргумент. Если *size* опущен или отрицательный, всё содержимое файла будет прочитано и возвращено. К этому надо относиться осторожно, особенно если файл большой и может не поместиться в оперативную память. В противном случае не более *size* символов (в текстовом режиме) или *size* байтов (в двоичном режиме) будет прочитано и возвращено. Если достигнут конец файла, ``f.read()`` вернёт пустую строку (``''``). ::)

source: ``f.readline()`` reads a single line from the file; a newline character (``\n``) is left at the end of the string, and is only omitted on the last line of the file if the file doesn't end in a newline. This makes the return value unambiguous; if ``f.readline()`` returns an empty string, the end of the file has been reached, while a blank line is represented by ``'\n'``, a string containing only a single newline. ::
fa: ``f.readline()`` یک خط از فایل را می خواند. یک کاراکتر خط جدید (``\n``) در انتهای رشته باقی می‌ماند و تنها در صورتی که فایل به خط جدید ختم نشود، در آخرین خط فایل حذف می‌شود. این باعث می شود مقدار بازگشتی مبهم باشد. اگر ``f.readline()`` یک رشته خالی را برگرداند، به انتهای فایل رسیده است، در حالی که یک خط خالی با ``'\n'`` نشان داده می شود، رشته ای که فقط یک خط جدید دارد. ::
ru: ``f.readline()`` считывает одну строку из файла; символ перевода строки (``\n``) остаётся в конце строки и отсутствует только у последней строки, если она не кончается символом перевода строки. Это делает возвращаемое значение однозначным: если метод ``f.readline()`` вернул пустую строку, достигнут конец файла, а пустая строка представлена как ``'\n'`` --- строка, содержащая только символ перевода строки. ::

source: For reading lines from a file, you can loop over the file object. This is memory efficient, fast, and leads to simple code::
fa: برای خواندن خطوط از یک فایل، می توانید روی شی فایل حلقه بزنید. این حافظه کارآمد، سریع است و منجر به کدهای ساده می شود:
ru: Для чтения строк из файла можно пройтись циклом по файловому объекту. Это эффективно с точки зрения памяти, быстро и делает код проще::

source: >>> for line in f: ... print(line, end='') ... This is the first line of the file. Second line of the file
fa: >>> برای خط در f: ... چاپ (خط, پایان='') ... این خط اول فایل است. خط دوم فایل

source: If you want to read all the lines of a file in a list you can also use ``list(f)`` or ``f.readlines()``.
fa: اگر می خواهید تمام خطوط یک فایل را در یک لیست بخوانید، می توانید از ``list(f)`` یا ``f.readlines()`` نیز استفاده کنید.
ru: Если вам нужно прочитать все строки из файла в виде списка, можете использовать ``list(f)`` или ``f.readlines()``.

source: ``f.write(string)`` writes the contents of *string* to the file, returning the number of characters written. ::
fa: ``f.write(string)`` محتویات *string* را در فایل می نویسد و تعداد کاراکترهای نوشته شده را برمی گرداند. ::
ru: ``f.write(string)`` записывает содержимое ``string`` в файл и возвращает количество записанных символов. ::

source: Other types of objects need to be converted -- either to a string (in text mode) or a bytes object (in binary mode) -- before writing them::
fa: انواع دیگر اشیاء باید قبل از نوشتن آنها تبدیل شوند - یا به یک رشته (در حالت متنی) یا یک شی بایت (در حالت باینری) -
ru: Другие объекты нуждаются в преобразовании -- либо в строку (в текстовом режиме), либо в объект байтов (в двоичном режиме) -- перед записью::

source: ``f.tell()`` returns an integer giving the file object's current position in the file represented as number of bytes from the beginning of the file when in binary mode and an opaque number when in text mode.
fa: ``f.tell()`` یک عدد صحیح را برمی گرداند که موقعیت فعلی شی فایل را در فایل نشان می دهد که به صورت تعداد بایت از ابتدای فایل در حالت باینری و یک عدد مات در حالت متنی نمایش داده می شود.
ru: ``f.tell()`` возвращает целое число, указывающее на текущую позицию в файле и представленное как количество байт с начала файла в двоичном режиме и непрозрачное значение в текстовом режиме.

source: To change the file object's position, use ``f.seek(offset, whence)``. The position is computed from adding *offset* to a reference point; the reference point is selected by the *whence* argument. A *whence* value of 0 measures from the beginning of the file, 1 uses the current file position, and 2 uses the end of the file as the reference point. *whence* can be omitted and defaults to 0, using the beginning of the file as the reference point. ::
fa: برای تغییر موقعیت شی فایل، از ``f.seek(offset, whence)`` استفاده کنید. موقعیت از اضافه کردن *offset* به یک نقطه مرجع محاسبه می شود. نقطه مرجع توسط آرگومان *whence* انتخاب می شود. مقدار *whence* 0 از ابتدای فایل اندازه گیری می شود، 1 از موقعیت فعلی فایل استفاده می کند، و 2 از انتهای فایل به عنوان نقطه مرجع استفاده می کند. *whence* را می توان حذف کرد و با استفاده از ابتدای فایل به عنوان نقطه مرجع، 0 را پیش فرض قرار داد. ::
ru: Чтобы поменять позицию файлового объекта, используйте ``f.seek(offset, whence)``. Позиция будет посчитана путём добавления *offset* к некоторой точке отсчёта. Точка отсчёта выбрана аргументом *whence*. Значение 0 выберет точкой отсчёта начало файла, 1 выберет текущее положение, 2 выберет конец файла. *whence* может быть опущен, в таком случае его значение будет 0 и точкой отсчёта будет начало файла. ::

source: In text files (those opened without a ``b`` in the mode string), only seeks relative to the beginning of the file are allowed (the exception being seeking to the very file end with ``seek(0, 2)``) and the only valid *offset* values are those returned from the ``f.tell()``, or zero. Any other *offset* value produces undefined behaviour.
fa: در فایل‌های متنی (آنهایی که بدون ``b`` در رشته حالت باز می‌شوند), فقط جستجوهای مربوط به ابتدای فایل مجاز هستند (به استثنای جستجو تا انتهای فایل با ``seek(0, 2)``) و تنها مقادیر معتبر *offset* آنهایی هستند که از ``f.tell()`` یا صفر برگردانده می‌شوند. هر مقدار دیگر *offset* رفتار نامشخصی ایجاد می کند.
ru: В текстовых файлах (открытых в режиме без ``b`` в строке режима) разрешены прыжки только относительно начала файла и ровно в конец (``seek(0, 2)``), причём в качестве значения *offset* допускаются только числа, которые вернул метод ``f.tell()`` и 0. Любое другое значение для *offset* приведёт к неопределённому поведению.

source: File objects have some additional methods, such as :meth:`~io.IOBase.isatty` and :meth:`~io.IOBase.truncate` which are less frequently used; consult the Library Reference for a complete guide to file objects.
fa: اشیاء فایل دارای چند روش اضافی هستند، مانند :meth:`~io.IOBase.isatty` و :meth:`~io.IOBase.truncate` که کمتر مورد استفاده قرار می گیرند. برای راهنمایی کامل برای اشیاء فایل به مرجع کتابخانه مراجعه کنید.
ru: Файловые объекты имеют некоторые дополнительные методы, такие как :meth:`~io.IOBase.isatty` и :meth:`~io.IOBase.truncate`, которые используются реже; см. Справочник по библиотеке для полного руководства по файловым объектам.

source: Saving structured data with :mod:`json`
fa: ذخیره داده های ساخت یافته با :mod:`json`
ru: Сохранение структурированных данных с :mod:`json`

source: Strings can easily be written to and read from a file. Numbers take a bit more effort, since the :meth:`~io.TextIOBase.read` method only returns strings, which will have to be passed to a function like :func:`int`, which takes a string like ``'123'`` and returns its numeric value 123. When you want to save more complex data types like nested lists and dictionaries, parsing and serializing by hand becomes complicated.
fa: رشته ها را می توان به راحتی در یک فایل نوشت و از آن خواند. اعداد کمی تلاش بیشتری می‌برند، زیرا روش :meth:`~io.TextIOBase.read` فقط رشته‌ها را برمی‌گرداند، که باید به تابعی مانند :func:`int` منتقل شوند، که رشته‌ای مانند ``'123'`` را می‌گیرد و مقدار عددی آن را 123 برمی‌گرداند. وقتی می‌خواهید انواع داده‌های پیچیده‌تری مانند فهرست‌های تودرتو و فرهنگ‌های لغت را ذخیره کنید، تجزیه و سریال‌سازی با دست انجام می‌شود.
ru: Строки могут быть легко записаны в файл и считаны из него. Числа требуют немного больше усилий, так как метод :meth:`~io.TextIOBase.read` возвращает только строки, которые должны быть переданы в функцию, такую как :func:`int`, которая принимает строку, например, ``'123'``, и возвращает ее числовое значение 123. Когда вы хотите сохранить более сложные типы данных, такие как вложенные списки и словари, парсинг и сериализация вручную становятся сложными.

source: Rather than having users constantly writing and debugging code to save complicated data types to files, Python allows you to use the popular data interchange format called `JSON (JavaScript Object Notation) <https://json.org>`_. The standard module called :mod:`json` can take Python data hierarchies, and convert them to string representations; this process is called :dfn:`serializing`. Reconstructing the data from the string representation is called :dfn:`deserializing`. Between serializing and deserializing, the string representing the object may have been stored in a file or data, or sent over a network connection to some distant machine.
fa: پایتون به جای اینکه کاربران دائماً کد می نویسند و اشکال زدایی می کنند تا انواع داده های پیچیده را در فایل ها ذخیره کنند، به شما امکان می دهد از فرمت تبادل داده محبوب به نام `JSON (JavaScript Object Notation) <https://json.org>`_ استفاده کنید. ماژول استاندارد به نام :mod:`json` می تواند سلسله مراتب داده پایتون را بگیرد و آنها را به نمایش رشته تبدیل کند. این فرآیند :dfn:`serializing` نامیده می شود. بازسازی داده ها از نمایش رشته :dfn:`deserializing` نامیده می شود. بین سریال‌سازی و سریال‌زدایی، رشته‌ای که شی را نشان می‌دهد ممکن است در یک فایل یا داده ذخیره شده باشد یا از طریق یک اتصال شبکه به ماشینی دور ارسال شده باشد.
ru: Вместо того, чтобы заставлять пользователей постоянно писать и отлаживать код для сохранения сложных типов данных в файлах, Python позволяет использовать популярный формат обмена данными, называемый `JSON (JavaScript Object Notation) <https://json.org>`_. Стандартный модуль под названием :mod:`json` может принимать иерархии данных Python и преобразовывать их в строковые представления; этот процесс называется :dfn:`serializing`. Восстановление данных из строкового представления называется :dfn:`deserializing`. Между сериализацией и десериализацией строка, представляющая объект, могла быть сохранена в файле или данных или отправлена по сетевому соединению на какой-либо удаленный компьютер.

source: The JSON format is commonly used by modern applications to allow for data exchange. Many programmers are already familiar with it, which makes it a good choice for interoperability.
fa: فرمت JSON معمولاً توسط برنامه های مدرن استفاده می شود تا امکان تبادل داده ها را فراهم کند. بسیاری از برنامه نویسان در حال حاضر با آن آشنا هستند، که آن را به گزینه خوبی برای قابلیت همکاری تبدیل می کند.
ru: Формат JSON часто используется современными приложениями для передачи данных. Многие программисты уже знакомы с ним, что делает его хорошим форматом для взаимодействия с другими системами.

source: If you have an object ``x``, you can view its JSON string representation with a simple line of code::
fa: اگر یک شی ``x`` دارید، می توانید نمایش رشته JSON آن را با یک خط کد ساده مشاهده کنید:
ru: Если у вас есть объект ``x``, вы можете получить его строковое представление в формате JSON с помощью одной строки кода::

source: Another variant of the :func:`~json.dumps` function, called :func:`~json.dump`, simply serializes the object to a :term:`text file`. So if ``f`` is a :term:`text file` object opened for writing, we can do this::
fa: نوع دیگری از تابع :func:`~json.dumps`، به نام :func:`~json.dump`، به سادگی شی را به یک :term:`text file` سریال می کند. بنابراین اگر ``f`` یک شی :term:`text file` است که برای نوشتن باز شده است، می توانیم این کار را انجام دهیم:
ru: Другой вариант функции :func:`~json.dumps` -- :func:`~json.dump`, сериализует объект прямо в :term:`текстовый файл`. Так, если ``f`` -- :term:`файловый объект`, открытый для записи, можно сделать следующее::

source: To decode the object again, if ``f`` is a :term:`binary file` or :term:`text file` object which has been opened for reading::
fa: برای رمزگشایی مجدد شیء، اگر ``f`` یک شیء :term:`binary file` یا :term:`text file` باشد که برای خواندن باز شده است:
ru: Чтобы снова декодировать объект, если ``f`` - это объект :term:`binary file` или :term:`text file`, который был открыт для чтения::

source: JSON files must be encoded in UTF-8. Use ``encoding="utf-8"`` when opening JSON file as a :term:`text file` for both of reading and writing.
fa: فایل های JSON باید در UTF-8 کدگذاری شوند. هنگام باز کردن فایل JSON به عنوان :term:`text file` برای خواندن و نوشتن از ``encoding="utf-8"`` استفاده کنید.
ru: Файлы JSON должны быть закодированы в UTF-8. Используйте ``encoding="utf-8"`` при открытии файла JSON как :term:`text file` как для чтения, так и для записи.
