Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/tutorial/inputoutput.po
Languages: fa, ru

source: This simple serialization technique can handle lists and dictionaries, but serializing arbitrary class instances in JSON requires a bit of extra effort. The reference for the :mod:`json` module contains an explanation of this.
fa: این تکنیک سریال‌سازی ساده می‌تواند فهرست‌ها و دیکشنری‌ها را مدیریت کند، اما سریال‌سازی نمونه‌های کلاس دلخواه در JSON به کمی تلاش اضافی نیاز دارد. مرجع ماژول :mod:`json` توضیحی در این باره دارد.
ru: Такой простой способ сериализации работает со списками и словарями, но чтобы сериализовывать экземпляры произвольных классов в формате JSON, требуется чуть больше работы. Справка по модулю :mod:`json` расскажет, как это сделать.

source: :mod:`pickle` - the pickle module
fa: :mod:`pickle` - ماژول ترشی
ru: :mod:`pickle` -- "консервирование" объектов

source: Contrary to :ref:`JSON <tut-json>`, *pickle* is a protocol which allows the serialization of arbitrarily complex Python objects. As such, it is specific to Python and cannot be used to communicate with applications written in other languages. It is also insecure by default: deserializing pickle data coming from an untrusted source can execute arbitrary code, if the data was crafted by a skilled attacker.
fa: برخلاف :ref:`JSON <tut-json>`، *pickle* پروتکلی است که امکان سریال سازی اشیاء پیچیده پایتون را می دهد. به این ترتیب، مخصوص پایتون است و نمی توان از آن برای برقراری ارتباط با برنامه هایی که به زبان های دیگر نوشته شده اند استفاده کرد. همچنین به‌طور پیش‌فرض ناامن است: اگر داده‌ها توسط یک مهاجم ماهر ساخته شده باشند، داده‌های ترشی که از منبع نامعتبر به دست می‌آیند می‌توانند کد دلخواه را اجرا کنند.
ru: В отличие от :ref:`JSON <tut-json>`, *pickle* -- протокол, позволяющий сериализовывать и десериализовывать произвольные объекты в Python. Он специфичен для Python и не может быть использован для взаимодействия с приложениями, написанными на других языках. Ещё он небезопасен по умолчанию: десериализация данных в формате *pickle* из недоверенного источника может привести к выполнению произвольного кода, если данные сфабрикованы подкованным недоброжелателем.

source: formatted string literal
fa: رشته فرمت شده به معنای واقعی کلمه
ru: форматированный строковый литерал

source: interpolated string literal
fa: رشته درونیابی شده تحت اللفظی
ru: интерполированный строковый литерал

source: string
fa: رشته
ru: строка

source: formatted literal
fa: فرمت شده تحت اللفظی
ru: форматированный литерал

source: interpolated literal
fa: تحت اللفظی درون یابی شده
ru: интерполированный литерал

source: f-string
fa: رشته f
ru: f-строка

source: built-in function
fa: عملکرد داخلی
ru: встроенная функция

source: open
fa: باز کردن
ru: открыть

source: object
fa: شی
ru: объект

source: file
fa: فایل
ru: файл

source: module
fa: ماژول
ru: модуль

source: Input and Output
ru: Ввод и вывод

source: fstring
ru: f-строка
