Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/tutorial/interpreter.po
Languages: hu

source: Using the Python Interpreter
hu: A Python értelmező használata

source: Invoking the Interpreter
hu: Az értelmező elindítása

source: to the shell. [#]_ Since the choice of the directory where the interpreter lives is an installation option, other places are possible; check with your local Python guru or system administrator. (E.g., :file:`/usr/local/python` is a popular alternative location.)
hu: [#]_ Mivel a telepítés helye telepítési opció, más helyen is lehet a program; ha nem tudod az értelmezőt elindítani, kérj segítséget egy nagyobb tudású embertől. (Például a :file:`/usr/local/python` is egy gyakori hely.)

source: Typing an end-of-file character (:kbd:`Control-D` on Unix, :kbd:`Control-Z` on Windows) at the primary prompt causes the interpreter to exit with a zero exit status. If that doesn't work, you can exit the interpreter by typing the following command: ``quit()``.
hu: Fájlvége karaktert (:kbd:`Control-D` Unix-on, :kbd:`Control-Z` Windows-on) írva a Python elsődleges promptjába, az értelmező nulla kilépési státusszal (zero exit status) lép ki. Ha ez nem működik, akkor az értelmezőt a következő utasítással hagyhatod el: ``quit()``.

source: The interpreter operates somewhat like the Unix shell: when called with standard input connected to a tty device, it reads and executes commands interactively; when called with a file name argument or with a file as standard input, it reads and executes a *script* from that file.
hu: Az értelmező a UNIX shellhez hasonlóan működik: ha a szabváyos bemenettel van meghívva, akkor interaktívan olvas és hajt végre utasításokat; ha fájlnév argumentummal vagy egy fájllal, mint szabványos bemenettel hívjuk meg, akkor *szkript*-ként lefuttatja a megadott fájlt.

source: Some Python modules are also useful as scripts. These can be invoked using ``python -m module [arg] ...``, which executes the source file for *module* as if you had spelled out its full name on the command line.
hu: Némelyik Python modul önálló programként is használható, ha így hívod meg: ``python -m modul [arg] ...`` -- ez az utasítás végrehajtja a *modul* forráskódját.

source: When a script file is used, it is sometimes useful to be able to run the script and enter interactive mode afterwards. This can be done by passing :option:`-i` before the script.
hu: Sokszor hasznos, ha egy szkript-fájl futtatása után rögtön interaktív üzemmódba kerülünk. Ezt egyszerű elérni, a szkript neve előtt adjuk meg az :option:`-i` kapcsolót.

source: All command line options are described in :ref:`using-on-general`.
hu: Az összes parancssori kapcsoló leírása megtalálható itt: :ref:`using-on-general`.

source: Argument Passing
hu: Argumentum-átadás

source: When known to the interpreter, the script name and additional arguments thereafter are turned into a list of strings and assigned to the ``argv`` variable in the ``sys`` module. You can access this list by executing ``import sys``. The length of the list is at least one; when no script and no arguments are given, ``sys.argv[0]`` is an empty string. When the script name is given as ``'-'`` (meaning standard input), ``sys.argv[0]`` is set to ``'-'``. When :option:`-c` *command* is used, ``sys.argv[0]`` is set to ``'-c'``. When :option:`-m` *module* is used, ``sys.argv[0]`` is set to the full name of the located module. Options found after :option:`-c` *command* or :option:`-m` *module* are not consumed by the Python interpreter's option processing but left in ``sys.argv`` for the command or module to handle.
hu: Ha az értelmezőt szkript-fájllal indítjuk, akkor a szkript-fájl neve és a nevet esetleg követő argumentumok a ``sys`` modul ``argv`` változójához rendelődnek, ez egy karakterláncokból álló lista. Ennek hossza leglább 1; amennyiben sem szkrip-nevet, sem semmilyen argumentumot nem adunk meg, a ``sys.argv[0]`` változó értéke üres string lesz. Ha a szkript neveként ``'-'``-t adunk meg (ez a szabványos bemenetnek felel meg), ``sys.argv[0]`` értéke ``'-'`` lesz. Argumentumként :option:`-c` *parancs*-ot megadva ``sys.argv[0]`` értéke ``'-c'`` lesz. Ha a :option:`-m` *modul* formát hasznájuk, akkor a ``sys.argv[0]`` változóban a modul teljes neve kerül. A :option:`-c` *parancs* vagy a :option:`-m` *modul* után álló kapcsolókat az értelmező nem dolgozza fel, hanem a ``sys.argv``-ben eltárolva a *parancs*-ra vagy *modul*-ra hagyja annak feldolgozását.

source: Interactive Mode
hu: Interaktív (párbeszédes) mód

source: When commands are read from a tty, the interpreter is said to be in *interactive mode*. In this mode it prompts for the next command with the *primary prompt*, usually three greater-than signs (``>>>``); for continuation lines it prompts with the *secondary prompt*, by default three dots (``...``). The interpreter prints a welcome message stating its version number and a copyright notice before printing the first prompt:
hu: Amikor a parancs a tty-ről (pl. billentyűzet) érkezik, az értelmező úgynevezett *interaktív* (párbeszédes) üzemmódban működik. Ekkor az *elsődleges prompt* megjelenítésével kéri a következő parancs megadását. Az elsődleges prompt szokásosan három egymás után következő nagyobb-jel (``>>>``); a sorok folytatásához ezek a folytatólagos sorok -- a *másodlagos promptot* jeleníti meg, amelyek szokásos értéke három egymás után írt pont (``...``). Azt értelmező elindulásakor, mielőtt az elsődleges prompt megjelenne, egy üdvözlő-szöveget ír ki, amely tartalmazza az értelmező verziószámát és a jogi védettséget:

source: Continuation lines are needed when entering a multi-line construct. As an example, take a look at this :keyword:`if` statement::
hu: Folytatólagos sorok szükségesek, ha többsoros szerkezeteket írsz be. Például a következő :keyword:`if` utasítás esetén::

source: For more on interactive mode, see :ref:`tut-interac`.
hu: Az interaktív módról itt olvashatsz bővebben: :ref:`tut-interac`.

source: The Interpreter and Its Environment
hu: Az értelmező és környezete

source: Source Code Encoding
hu: A forráskód karakterkészlete

source: By default, Python source files are treated as encoded in UTF-8. In that encoding, characters of most languages in the world can be used simultaneously in string literals, identifiers and comments --- although the standard library only uses ASCII characters for identifiers, a convention that any portable code should follow. To display all these characters properly, your editor must recognize that the file is UTF-8, and it must use a font that supports all the characters in the file.
hu: Alapállapotban a Python forrásfájlokat UTF-8-as kódolásúnak tekintjük. Ebben a karakterkódolásban a legtöbb nyelv karakterei használhatóak egyszerre egy sztringben, változónévben és megjegyzésben. A standard könyvtár csak ASCII karaktereket használ változónévnek: ezt a megállapodást minden hordozható kódnak követnie kellete. Ahhoz, hogy az összes karakter helyesen jelenjen meg, az szövegszerkesztőnek fel kell ismernie, hogy a fájl UTF-8-as, és olyan betűtípust kell használnia, amely tartalmazza a fájlban szereplő összes karaktert.

source: To declare an encoding other than the default one, a special comment line should be added as the *first* line of the file. The syntax is as follows::
hu: Lehetséges ettől eltérő kódolást is megadni a forrásfájlban. Hogy ezt megtehessük, még egy speciális megjegyzés-sort helyezzünk a ``#!`` sor után, hogy definiáljuk a kódolást::

source: where *encoding* is one of the valid :mod:`codecs` supported by Python.
hu: A kódolás megadásával a forrásfájlban mindent *kódolás* kódolással kerül értelmezésre UTF-8 helyett. A lehetséges kódolások a Python Library Reference-ben találhatóak a :mod:`codecs` szakaszban.

source: For example, to declare that Windows-1252 encoding is to be used, the first line of your source code file should be::
hu: Példáuk, ha a kiválasztott szövegszerkesztő nem támogatja az UTF-8 kódolást, és más kódolásra, mondjuk Windows-1252 kódolásra van szükség, az alábbi írható::

source: Footnotes
hu: Lábjegyzet
