Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/tutorial/introduction.po
Languages: fa, hu, ru

source: Python strings cannot be changed --- they are :term:`immutable`. Therefore, assigning to an indexed position in the string results in an error::
fa: رشته های پایتون قابل تغییر نیستند --- آنها :term:`immutable` هستند. بنابراین، انتساب به یک موقعیت ایندکس شده در رشته منجر به خطا می شود::
hu: A Python karakterláncait nem lehet megváltoztatni azok :term:`immutable`-k. Ezért, ha egy adott indexű helyhez értéket rendelünk, hibát kapunk::
ru: Строки Python не могут быть изменены - они неизменяемы :term:`immutable`. Таким образом, присвоение значения индексированному положению в строке вызовет ошибку::

source: If you need a different string, you should create a new one::
fa: اگر به رشته دیگری نیاز دارید، باید رشته جدیدی ایجاد کنید:
hu: Ha másik karakterláncra van szükség, alkothatunk egy újat::
ru: Если вам нужна другая строка, вам следует создать новую::

source: The built-in function :func:`len` returns the length of a string::
fa: تابع داخلی :func:`len` طول یک رشته را برمی گرداند:
hu: A beépített :func:`len` függvény a karakterlánc hosszával tér vissza::
ru: Встроенная функция :func:`len` возвращает длину строки::

source: Strings are examples of *sequence types*, and support the common operations supported by such types.
fa: رشته ها نمونه هایی از *sequence types* هستند و از عملیات رایج پشتیبانی شده توسط چنین انواعی پشتیبانی می کنند.
ru: Строки это пример типа последовательности и они поддерживают общие операции, поддерживаемые для данного типа.

source: Strings support a large number of methods for basic transformations and searching.
fa: رشته ها از تعداد زیادی روش برای تبدیل های اساسی و جستجو پشتیبانی می کنند.
ru: Строки поддерживают большое количество методов для простых преобразований и поиска.

source: String literals that have embedded expressions.
fa: لفظ رشته ای که عبارات تعبیه شده دارند.
ru: Строковые литералы со встроенными выражениями.

source: Information about string formatting with :meth:`str.format`.
fa: اطلاعاتی در مورد قالب بندی رشته با :meth:`str.format`.
ru: Информацию о форматировании строк с использованием метода :meth:`str.format`.

source: The old formatting operations invoked when strings are the left operand of the ``%`` operator are described in more detail here.
fa: عملیات قالب‌بندی قدیمی که زمانی که رشته‌ها عملوند سمت چپ عملگر ``%`` هستند فراخوانی می‌شوند در اینجا با جزئیات بیشتری توضیح داده شده‌اند.
ru: Старые операции форматирования, вызываемые, когда строки находятся слево от операнда ``%``, описаны более подробно здесь.

source: Lists
fa: لیست ها
hu: Listák
ru: Списки

source: Python knows a number of *compound* data types, used to group together other values. The most versatile is the *list*, which can be written as a list of comma-separated values (items) between square brackets. Lists might contain items of different types, but usually the items all have the same type. ::
fa: پایتون تعدادی از انواع داده *compound* را می شناسد که برای گروه بندی مقادیر دیگر استفاده می شود. همه کاره ترین *list* است که می تواند به عنوان لیستی از مقادیر (اقلام) جدا شده با کاما بین پرانتز نوشته شود. فهرست ها ممکن است شامل مواردی از انواع مختلف باشند، اما معمولاً همه موارد دارای یک نوع هستند. ::
hu: A Python többfajta *összetett* adattípust ismer, amellyel több különböző értéket csoportosíthatunk. A legsokoldalúbb a *lista*, amelyet vesszőkkel elválasztott értékekként írhatunk be szögletes zárójelbe zárva. A lista elemeinek nem kell azonos típusúaknak lenniük, bár gyakran minden elem azonos típusú. ::
ru: Python знает несколько *составных* типов данных, используемых, чтобы сгруппировать другие значения. Самый универсальный это *список*, который может быть записан как список разделенных запятой значений (элементов) в квадратных скобках. Список может содержать в себе различные типы данных, но обычно они имеют одинаковый тип.::

source: Like strings (and all other built-in :term:`sequence` types), lists can be indexed and sliced::
fa: مانند رشته ها (و سایر انواع :term:`sequence` داخلی), لیست ها را می توان ایندکس و برش داد:
ru: Подобно строкам (и всем другим встроенным типам :term:`sequence`), списки можно индексировать и разбивать на части::

source: Lists also support operations like concatenation::
fa: لیست ها همچنین از عملیات هایی مانند الحاق::
hu: A listák az összefűzést is támogatják::
ru: Списки также поддерживают такие операции, как конкатенация::

source: Unlike strings, which are :term:`immutable`, lists are a :term:`mutable` type, i.e. it is possible to change their content::
fa: بر خلاف رشته ها که :term:`immutable` هستند، لیست ها از نوع :term:`mutable` هستند، یعنی می توان محتوای آنها را تغییر داد:
hu: A karakterláncokkal ellentétben -- amelyek :term:`immutable` adattípusok -- a listák :term:`mutable` adattípusok, azaz módosíthatjuk a tartalmát::
ru: В отличие от строк, которые являются неизменяемыми :term:`immutable`, списки это изменяемый тип :term:`mutable`, это значит, что их содержимое можно изменить.::

source: You can also add new items at the end of the list, by using the :meth:`!list.append` *method* (we will see more about methods later)::
ru: Вы также можете добавлять новые элементы в конец списка, используя *метод* :meth:`!list.append` (подробнее о методах мы поговорим позже)::

source: Simple assignment in Python never copies data. When you assign a list to a variable, the variable refers to the *existing list*. Any changes you make to the list through one variable will be seen through all other variables that refer to it.::
ru: Простое присваивание в Python никогда не копирует данные. Когда вы присваиваете список переменной, переменная ссылается на *существующий список*. Любые изменения, которые вы вносите в список через одну переменную, будут видны через все другие переменные, которые ссылаются на нее.::

source: All slice operations return a new list containing the requested elements. This means that the following slice returns a :ref:`shallow copy <shallow_vs_deep_copy>` of the list::
fa: تمام عملیات برش یک لیست جدید حاوی عناصر درخواستی را برمی گرداند. این بدان معنی است که برش زیر یک :ref:`shallow copy <shallow_vs_deep_copy>` از لیست را برمی گرداند:
ru: Все операции среза возвращают новый список, содержащий запрошенные элементы. Это означает, что следующий срез возвращает :ref:`shallow copy <shallow_vs_deep_copy>` списка::

source: Assignment to slices is also possible, and this can even change the size of the list or clear it entirely::
fa: تخصیص به برش ها نیز امکان پذیر است، و این حتی می تواند اندازه لیست را تغییر دهد یا آن را به طور کامل پاک کند::
hu: Akát szeletnek is adhatunk értéket, és ez akár a lista méretét is megváltoztathatja, vagy teljesen törölheti a tartalmát::
ru: Присвоение срезов также возможно, и это может как изменить размер списка, так и полностью его очистить.

source: The built-in function :func:`len` also applies to lists::
fa: تابع داخلی :func:`len` همچنین برای لیست ها اعمال می شود:
hu: A :func:`len` beépített függvény listákra is alkalmazható::
ru: Встроенныя функция :func:`len` также применима к спискам::

source: It is possible to nest lists (create lists containing other lists), for example::
fa: امکان تودرتو کردن لیست ها (ایجاد لیست های حاوی لیست های دیگر) وجود دارد، به عنوان مثال::
hu: Lehetséges a listákat egymásba ágyazni (olyan listákat létrehozni, amelyek újabb listákat tartalmaznak), például::
ru: Можно создать вложенный список (создать список, содержащий другие списки), например::

source: First Steps Towards Programming
fa: اولین قدم به سوی برنامه نویسی
hu: Első lépések a programozás felé
ru: Первые шаги в программировании

source: Of course, we can use Python for more complicated tasks than adding two and two together. For instance, we can write an initial sub-sequence of the `Fibonacci series <https://en.wikipedia.org/wiki/Fibonacci_sequence>`_ as follows::
ru: Конечно, мы можем использовать Python для более сложных задач, чем складывать два и два. Например, мы можем написать начальную подпоследовательность `ряда Фибоначчи <https://en.wikipedia.org/wiki/Fibonacci_sequence>`_ следующим образом::

source: This example introduces several new features.
fa: این مثال چندین ویژگی جدید را معرفی می کند.
hu: Ebben a példában a Python több új tulajdonságát megtaláljuk:
ru: Этот пример представляет несколько новых возможностей.

source: The first line contains a *multiple assignment*: the variables ``a`` and ``b`` simultaneously get the new values 0 and 1. On the last line this is used again, demonstrating that the expressions on the right-hand side are all evaluated first before any of the assignments take place. The right-hand side expressions are evaluated from the left to the right.
fa: خط اول حاوی یک *multiple assignment* است: متغیرهای ``a`` و ``b`` به طور همزمان مقادیر جدید 0 و 1 را دریافت می کنند. در خط آخر دوباره از این استفاده می شود و نشان می دهد که عبارات سمت راست قبل از انجام هر یک از تخصیص ها ابتدا ارزیابی می شوند. عبارات سمت راست از چپ به راست ارزیابی می شوند.
hu: Az első sor egy *többszörös értékadást* tartalmaz: ``a`` és ``b`` egyszerre veszi fel a 0 és 1 értékeket. Az utolsó sorban újból ezt használjuk, hogy megmutassuk, hogy előbb a jobboldal értékelődik ki, és csak azután megy végbe az értékadás. A jobboldali kifejezések jobbról balra értékelődnek ki.
ru: Первая строка содержит *множественное присваивание*: переменные ``a`` и ``b`` одновременно получают новые значения, 0 и 1. На последней строке это используется снова, демонстрируя, что выражения с правой стороны вычисляются первыми, до того, как произойдет любое присваивание. Выражение с правой стороны вычисляется слева направо.

source: The :keyword:`while` loop executes as long as the condition (here: ``a < 10``) remains true. In Python, like in C, any non-zero integer value is true; zero is false. The condition may also be a string or list value, in fact any sequence; anything with a non-zero length is true, empty sequences are false. The test used in the example is a simple comparison. The standard comparison operators are written the same as in C: ``<`` (less than), ``>`` (greater than), ``==`` (equal to), ``<=`` (less than or equal to), ``>=`` (greater than or equal to) and ``!=`` (not equal to).
fa: حلقه :keyword:`while` تا زمانی اجرا می شود که شرط (در اینجا: ``a < 10``) درست باقی بماند. در پایتون، مانند C، هر عدد صحیح غیر صفر درست است. صفر نادرست است شرط همچنین ممکن است یک مقدار رشته یا لیست، در واقع هر دنباله ای باشد. هر چیزی با طول غیر صفر درست است، دنباله های خالی نادرست هستند. تست استفاده شده در مثال یک مقایسه ساده است. عملگرهای مقایسه استاندارد مانند C نوشته می شوند: ``<`` (کمتر از)، ``>`` (بزرگتر از)، ``==`` (برابر)، ``<=`` (کمتر یا مساوی)، ``>=`` (بزرگتر یا مساوی) و ``!=`` (نه برابر).
ru: Цикл :keyword:`while` выполняется до тех пор, пока условие (здесь: ``a < 10``) остается истинным. В Python, как и в C, любое ненулевое целое значение равно true; ноль равен false. Условием также может быть строка или значение списка, фактически любая последовательность; все, что имеет ненулевую длину, является истинным, пустые последовательности - ложными. Тест, используемый в примере, представляет собой простое сравнение. Стандартные операторы сравнения записываются так же, как и в C: ``<`` (lменьше), ``>`` (больше), ``==`` (равно), ``<=`` (меньше или равно), ``>=`` (больше или равно) и ``!=`` (не равно).

source: The *body* of the loop is *indented*: indentation is Python's way of grouping statements. At the interactive prompt, you have to type a tab or space(s) for each indented line. In practice you will prepare more complicated input for Python with a text editor; all decent text editors have an auto-indent facility. When a compound statement is entered interactively, it must be followed by a blank line to indicate completion (since the parser cannot guess when you have typed the last line). Note that each line within a basic block must be indented by the same amount.
fa: *body* حلقه *indented* است: تورفتگی روش پایتون برای گروه بندی عبارات است. در اعلان تعاملی، باید یک برگه یا فاصله (ها) را برای هر خط تورفتگی تایپ کنید. در عمل با یک ویرایشگر متن ورودی پیچیده تری را برای پایتون آماده خواهید کرد. همه ویرایشگرهای متن مناسب دارای قابلیت تورفتگی خودکار هستند. هنگامی که یک عبارت ترکیبی به صورت تعاملی وارد می شود، باید یک خط خالی برای نشان دادن تکمیل شدن دنبال شود (زیرا تجزیه کننده نمی تواند حدس بزند که آخرین خط را چه زمانی تایپ کرده اید). توجه داشته باشید که هر خط در یک بلوک اصلی باید به همان میزان فرورفته باشد.
hu: A ciklus *magját beljebb húzzuk*: a behúzás a Python jelölése az utasítások csoportosítására. A Python alapértelmezett interaktív parancsértelmezőjében neked kell (néhány) szóközt beírnod minden behúzott sor elé. Gyakorlatban az összetettebb programkódokat úgyis szövegszerkesztővel fogod elkészíteni, a legtöbb szövegszerkesztőnek van eszköze az automatikus behúzásra. Ha egy összetett utasítást írunk be párbeszédes (interaktív) módban, azt egy üres sornak kell követnie (mivel az értelmező nem tudja kitalálni, lesz-e még újabb sor). Jegyezd meg, hogy minden sort ugyanannyival kell beljebb húzni. (Az IDLE integrált fejlesztői környezetben található parancsértelmező és az ipython nevű parancsértelmező automatikusan behúzza a ciklusmagot.)
ru: *Тело* цикла с *отступом*: Python использует отступы для группировки выражений. В командной строке ввода вы должны ввести Таб или пробелы для каждой строки с отступом. На практике вы будете подготавливать более сложный ввод для Python с помощью текстового редактора; все приличные текстовые редакторы имеет возможности автоматического отступа. Когда составной оператор вводится интерактивно, за ним должна следовать пустая строка, чтобы обозначить завершение (так как парсер не может знать когда вы напечатаете последнюю строку). Обратите внимание, что каждая линия внутри основного блока должна иметь одинаковый отступ.

source: The :func:`print` function writes the value of the argument(s) it is given. It differs from just writing the expression you want to write (as we did earlier in the calculator examples) in the way it handles multiple arguments, floating-point quantities, and strings. Strings are printed without quotes, and a space is inserted between items, so you can format things nicely, like this::
ru: Функция :func:`print` записывает значение переданных ей аргументов. Он отличается от простого написания выражения, которое вы хотите написать (как мы делали ранее в примерах калькулятора), тем, как он обрабатывает несколько аргументов, величины с плавающей запятой и строки. Строки печатаются без кавычек, а между элементами вставляется пробел, поэтому вы можете красиво форматировать, например:

source: The keyword argument *end* can be used to avoid the newline after the output, or end the output with a different string::
fa: آرگومان کلمه کلیدی *end* را می توان برای اجتناب از خط جدید بعد از خروجی استفاده کرد یا خروجی را با رشته ای متفاوت خاتمه داد:
hu: Az *end* kulcsszavas argumentum használható arra, hogy megakadályozzuk a print után az újsor kiírását, vagy mást írjunk ki a print végén::
ru: Ключевой аргумент *end* может использоваться, чтобы избежать новой строки после вывода, или закончить вывод другими строками::

source: Footnotes
fa: پاورقی ها
hu: Lábjegyzet
ru: Сноски

source: Since ``**`` has higher precedence than ``-``, ``-3**2`` will be interpreted as ``-(3**2)`` and thus result in ``-9``. To avoid this and get ``9``, you can use ``(-3)**2``.
fa: از آنجایی که ``**`` اولویت بیشتری نسبت به ``-`` دارد، ``-3**2`` به عنوان ``-(3**2)`` تفسیر می شود و بنابراین منجر به ``-9`` می شود. برای جلوگیری از این امر و دریافت ``9``، می توانید از ``(-3)**2`` استفاده کنید.
hu: Mivel a ``**`` nagyobb precedenciájú, mint a ``-``, a ``-3**2`` mint ``-(3**2)`` fog értelmezésre kerülni, így az eredmény ``-9``. Hogy ezt elkerüljük, és ``9``-et kapjunk, ``(-3)**2`` formában kell írni.
ru: Так как ``**`` имеет более высокий приоритет, чем ``-``, ``-3**2`` будет интерпретировано как ``-(3**2)`` и даст результат ``-9``. Чтобы этого избежать, и получить ``9``, вы можете использовать ``(-3)**2``.

source: Unlike other languages, special characters such as ``\n`` have the same meaning with both single (``'...'``) and double (``"..."``) quotes. The only difference between the two is that within single quotes you don't need to escape ``"`` (but you have to escape ``\'``) and vice versa.
fa: بر خلاف زبان های دیگر، کاراکترهای ویژه مانند ``\n`` با هر دو نقل قول تک (``'...'``) و دو (``"..."``) معنی یکسانی دارند. تنها تفاوت بین این دو این است که در داخل نقل قول های تک نیازی به فرار از ``"`` ندارید (اما باید از ``\'`` فرار کنید) و بالعکس.
hu: Más nyelvekkel szemben a speciális karakterek, mint a ``\n`` azonos jelentésűek mind egyszeres (``'...'``) mind dupla (``"..."``) idézőjelben. Az egyetlen különbség a kettő között, hogy az egyszeres idézőjelben nem kell levédeni a ``"`` jelet (de a ``\'`` jelet igen) és viszont.
ru: В отличае от других языков, специальные символы как ``\n`` имеют ожинаковое значение как с одинарными (``'...'``), так и с двойными (``"..."``) кавычками. Единственное отличие между ними - это то, что внутри одинарных кавычек вам не нужно обходить ``"`` (но вам нужно обходить ``\'``) и наоборот.

source: comment
ru: комментарий

source: String literals can span multiple lines. One way is using triple-quotes: ``"""..."""`` or ``'''...'''``. End of lines are automatically included in the string, but it's possible to prevent this by adding a ``\`` at the end of the line. The following example::
hu: A literális karakterláncok többsorosak is lehetnek. Egy lehetőség erre a hármas idézőjelek használata: ``"""..."""`` vagy ``'''...'''``. Ilyenkor az újsorok automatikusan belekerülnek a karakterláncba, de ez a viselkedés megszüntethető, ha a sor végére egy ``\``-t adsz. A következő példa ::

source: produces the following output (note that the initial newline is not included):
hu: az alábbi kimenetet adja (vedd észre, hogy az első sorban nincs soremelés):

source: The :func:`print` function writes the value of the argument(s) it is given. It differs from just writing the expression you want to write (as we did earlier in the calculator examples) in the way it handles multiple arguments, floating point quantities, and strings. Strings are printed without quotes, and a space is inserted between items, so you can format things nicely, like this::
hu: A :func:`print` függvény kiírja annak a kifejezésnek az értékét, amelyet megadtunk. Ez abban különbözik attól, mintha a kifejezést csak önmagában írnánk be (mint ahogy számológépként használtuk), ahogy a többszörös argumentumokat és a karakterláncokat kezeli. A karakterláncokat idézőjelek nélkül írja ki, és szóközöket illeszt az egyes tagok közé, így széppé teheted a kimenetet::
