Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/tutorial/introduction.po
Languages: fa, hu, ru

source: An Informal Introduction to Python
fa: معرفی غیر رسمی پایتون
hu: Kötetlen bevezető a Pythonba
ru: Неофициальное знакомство с Python

source: In the following examples, input and output are distinguished by the presence or absence of prompts (:term:`>>>` and :term:`...`): to repeat the example, you must type everything after the prompt, when the prompt appears; lines that do not begin with a prompt are output from the interpreter. Note that a secondary prompt on a line by itself in an example means you must type a blank line; this is used to end a multi-line command.
fa: در مثال‌های زیر، ورودی و خروجی با وجود یا عدم وجود اعلان‌ها (:term:`>>>` و :term:`...`) متمایز می‌شوند: برای تکرار مثال, باید همه چیز را بعد از دستور تایپ کنید, زمانی که اعلان ظاهر شد. خطوطی که با اعلان شروع نمی شوند از مفسر خروجی می شوند. توجه داشته باشید که یک دستور ثانویه روی یک خط به تنهایی در یک مثال به این معنی است که باید یک خط خالی تایپ کنید. این برای پایان دادن به یک فرمان چند خطی استفاده می شود.
hu: A következő példákban a kimenetet és a bemenetet az elsődleges és másodlagos promptok (``>>>`` és ``...``) meglétével, illetve hiányával különböztetjük meg. A példák kipróbálásához mindent be kell írnod a promptok után, amikor a prompt megjelenik; azok a sorok, amelyek előtt nincs prompt, a fordító kimenetei. Az önmagában álló másodlagos prompt a példa egyik sorában azt jelenti, hogy csak egy Újsort kell ütni; ez jelzi egy többsoros utasítás végét.
ru: В следующих примерах, ввод и вывод будет отличаться появлением или отсутствием приглашения (:term:`>>>` and :term:`...`): чтобы повторить пример, вы должны напечатать все, что следует после приглашения, когда он появляется; строки, которые не начинаются с приглашения, являются строками вывода интерпретатора. Обратите внимание, что вторичное приглашение на строке само по себе в примере означает, что вы должны сделать пропуск строки; это используется в многострочных командах.

source: You can toggle the display of prompts and output by clicking on ``>>>`` in the upper-right corner of an example box. If you hide the prompts and output for an example, then you can easily copy and paste the input lines into your interpreter.
fa: می توانید با کلیک بر روی ``>>>`` در گوشه سمت راست بالای یک کادر مثال, نمایش اعلان ها و خروجی ها را تغییر دهید. اگر اعلان ها و خروجی ها را برای مثال مخفی کنید, می توانید به راحتی خطوط ورودی را در مترجم خود کپی و جایگذاری کنید.
ru: Вы можете переключать отображение подсказок и вывода, нажав на ``>>>`` в правом верхнем углу окна примера. Если вы скроете подсказки и вывод для примера, вы можете легко скопировать и вставить строки ввода в свой интерпретатор.

source: Many of the examples in this manual, even those entered at the interactive prompt, include comments. Comments in Python start with the hash character, ``#``, and extend to the end of the physical line. A comment may appear at the start of a line or following whitespace or code, but not within a string literal. A hash character within a string literal is just a hash character. Since comments are to clarify code and are not interpreted by Python, they may be omitted when typing in examples.
fa: بسیاری از مثال‌های موجود در این راهنما، حتی نمونه‌هایی که در اعلان تعاملی وارد شده‌اند، شامل نظرات هستند. نظرات در پایتون با کاراکتر هش ``#`` شروع می شود و تا انتهای خط فیزیکی گسترش می یابد. یک نظر ممکن است در ابتدای یک خط یا پس از فضای خالی یا کد ظاهر شود، اما نه در یک رشته به معنای واقعی کلمه. یک کاراکتر هش در یک رشته واقعی فقط یک کاراکتر هش است. از آنجایی که کامنت‌ها برای شفاف‌سازی کد هستند و توسط پایتون تفسیر نمی‌شوند، ممکن است هنگام تایپ در مثال‌ها حذف شوند.
hu: Ennek a kézikönyvnek sok példájában -- még azokban is, amelyeket interaktív módon írtunk be -- szerepelnek megjegyzések. A Pythonban a megjegyzések kettőskereszttel (``'#'``) kezdődnek és a sor végéig tartanak. Egy megjegyzés lehet sor elején, vagy követhet szóközt, tabulátor-karaktert, de ha egy karakterlánc belsejébe teszed, az nem lesz megjegyzés (lásd a példában!). A kettőskereszt karakter egy karakterláncon belül csak egy kettőskeresztet jelent.
ru: Многие примеры в этом руководстве, даже те, что введены в интерактивную командную строку, включают комментарии. Комментарии в Python начинаются с хеш символа ``#`` и распространяются на всю строку. Комментарий может появиться в начале строки или после пробела или кода, но не внутри литерала строки. Хеш символ внутри строкового литерала это всего лишь хеш символ. Поскольку комментарии уточняют код и не интерпретируются Python, они могут быть пропущены в примерах.

source: Some examples::
fa: چند نمونه::
hu: Néhány példa::
ru: Несколько примеров::

source: Using Python as a Calculator
fa: استفاده از پایتون به عنوان ماشین حساب
hu: A Python használata számológépként
ru: Использование Python как калькулятор

source: Let's try some simple Python commands. Start the interpreter and wait for the primary prompt, ``>>>``. (It shouldn't take long.)
fa: بیایید چند دستور ساده پایتون را امتحان کنیم. مفسر را راه اندازی کنید و منتظر فرمان اولیه، ``>>>`` باشید. (نباید زیاد طول بکشد.)
hu: Próbáljunk ki néhány Python utasítást. Indítsuk el az értelmezőt, és várjuk meg az elsődleges promptot: ``>>>``. (Nem kell sokáig várni.)
ru: Давайте попробуем несколько простых комманд Python. Запустите интерпретатор и дождитесь первичного приглашения ``>>>``. (Это не должно быть долго.)

source: Numbers
fa: اعداد
hu: Számok
ru: Числа

source: The interpreter acts as a simple calculator: you can type an expression at it and it will write the value. Expression syntax is straightforward: the operators ``+``, ``-``, ``*`` and ``/`` can be used to perform arithmetic; parentheses (``()``) can be used for grouping. For example::
ru: Интерпретатор действует как простой калькулятор: вы можете ввести в него выражение, и он запишет значение. Синтаксис выражения прост: операторы `+`, `-`, `*` и `/` могут использоваться для выполнения арифметических действий; круглые скобки (`()`) могут использоваться для группировки. Например::

source: The integer numbers (e.g. ``2``, ``4``, ``20``) have type :class:`int`, the ones with a fractional part (e.g. ``5.0``, ``1.6``) have type :class:`float`. We will see more about numeric types later in the tutorial.
fa: اعداد صحیح (مانند ``2``, ``4``, ``20``) دارای نوع :class:`int` هستند، اعدادی که دارای قسمت کسری هستند (مانند ``5.0``, ``1.6``) دارای نوع :class:`float` هستند. در ادامه در آموزش بیشتر در مورد انواع عددی خواهیم دید.
hu: Az egész számok (pl. ``2``, ``4``, ``20``) :class:`int` típusúak, azok, amiknek törtrésze is van (e.g. ``5.0``, ``1.6``) a :class:`float` típusba. Az oktató további részében még többet tanulunk meg a típusokról.
ru: Целые числа (например ``2``, ``4``, ``20``) имеют тип :class:`int`, числа с дробной частью (например ``5.0``, ``1.6``) имеют тип :class:`float`. Позже в учебники мы увидим больше о числовых типах.

source: Division (``/``) always returns a float. To do :term:`floor division` and get an integer result you can use the ``//`` operator; to calculate the remainder you can use ``%``::
ru: Деление (``/``)всегда возвращает значение с плавающей точкой. Чтобы выполнить :term:`floor division` и получить целочисленный результат, вы можете использовать оператор ``//``; для вычисления остатка вы можете использовать ``%``::

source: With Python, it is possible to use the ``**`` operator to calculate powers [#]_::
fa: با پایتون، می توان از عملگر ``**`` برای محاسبه قدرت ها استفاده کرد [#]_::
hu: A Pythonban a ``**`` operátor használható a hatvány kiszámítására [#]_::
ru: В Python возможно использовать оператор ``**`` для расчета степеней [#]_::

source: The equal sign (``=``) is used to assign a value to a variable. Afterwards, no result is displayed before the next interactive prompt::
fa: علامت مساوی (``=``) برای تخصیص یک مقدار به یک متغیر استفاده می شود. پس از آن، هیچ نتیجه ای قبل از اعلان تعاملی بعدی نمایش داده نمی شود::
hu: A C-hez hasonlóan az egyenlőségjellel (``'='``) lehet értéket adni egy változónak. Az értékadás után az értelmező újabb utasításra vár, látszólag nem történik semmi::
ru: Знак равенства (``=``) используется для присвоения значения переменной. После этого, никакого результата не будет отображаться до следующего приглашения интерактивной командной строки::

source: If a variable is not "defined" (assigned a value), trying to use it will give you an error::
fa: اگر متغیری "تعریف" نشده باشد (مقدار اختصاص داده شده), تلاش برای استفاده از آن با خطای زیر مواجه می شود::
hu: Ha egy változó nincs definiálva (nincs érték rendelve hozzá), és használni próbáljuk, akkor hibaüzenetet kapunk::
ru: Если переменная не "определена" (присвоено значение), попытка ее использования приведет к ошибке::

source: There is full support for floating point; operators with mixed type operands convert the integer operand to floating point::
fa: پشتیبانی کامل از ممیز شناور وجود دارد. عملگرهایی با عملوندهای نوع مختلط، عملوند عدد صحیح را به ممیز شناور تبدیل می کنند:
hu: A programnyelv teljeskörűen támogatja a lebegőpontos számokat; azok a műveletek amelyeknél keverednek a típusok, az egészeket lebegőpontossá alakítják::
ru: Числа с плавающей точкой полностью поддерживаются; операторы с операндами смешанного типа конвертируют целочисленный операнд в число с плавающей точкой::

source: In interactive mode, the last printed expression is assigned to the variable ``_``. This means that when you are using Python as a desk calculator, it is somewhat easier to continue calculations, for example::
fa: در حالت تعاملی، آخرین عبارت چاپ شده به متغیر ``_`` اختصاص داده می شود. این بدان معنی است که وقتی از پایتون به عنوان یک ماشین حساب میز استفاده می کنید، ادامه محاسبات تا حدودی آسان تر است، به عنوان مثال:
hu: Interaktív módban az utoljára kiírt kifejezés értéke a ``_`` (alsóvonás) változóban van. Így, ha a Pythont asztali számológépként használod, akkor egyszerűbb folytatni a számolásokat, például::
ru: В интерактивном режиме, последнее отображенное выражение назначается переменной ``_``. Это значит, что когда вы используете Python как настольный калькулятор, несколько проще продолжать вычисления, например::

source: This variable should be treated as read-only by the user. Don't explicitly assign a value to it --- you would create an independent local variable with the same name masking the built-in variable with its magic behavior.
fa: این متغیر باید توسط کاربر فقط خواندنی باشد. صراحتاً مقداری به آن اختصاص ندهید --- می توانید یک متغیر محلی مستقل با همان نام ایجاد کنید که متغیر داخلی را با رفتار جادویی آن پوشانده است.
hu: Ezt a változót csak olvasható változóként kezelhetjük. Ne adjunk értéket neki, mert ha adunk, akkor létrehozunk egy független helyi változót azonos névvel, amely meggátolja a beépített változó elérését, amely mágikus módon viselkedik. (Ha egy globális változó nevével létrehozunk egy helyi változót, akkor az értelmező a helyit használja.)
ru: Эта переменная должна рассматриваться пользователем только для чтения. Не назначайте ей значения явно - вы создадите независимую локальную переменную с таким же именем, маскируя встроенную переменную магическим способом.

source: In addition to :class:`int` and :class:`float`, Python supports other types of numbers, such as :class:`~decimal.Decimal` and :class:`~fractions.Fraction`. Python also has built-in support for :ref:`complex numbers <typesnumeric>`, and uses the ``j`` or ``J`` suffix to indicate the imaginary part (e.g. ``3+5j``).
fa: علاوه بر :class:`int` و :class:`float`، پایتون از انواع دیگری از اعداد مانند :class:`~decimal.Decimal` و :class:`~fractions.Fraction` پشتیبانی می کند. پایتون همچنین از :ref:`complex numbers <typesnumeric>` پشتیبانی داخلی دارد و از پسوند ``j`` یا ``J`` برای نشان دادن قسمت خیالی (مثلاً ``3+5j``) استفاده می کند.
hu: Az :class:`int` és :class:`float` osztályokon felül a Python támogat egyéb typusokat is, mint például a :class:`~decimal.Decimal` és :class:`~fractions.Fraction`. A Python beépített támogatással rendelkezik a :ref:`komplex számok <typesnumeric>` tekintetében, és a ``j`` vagy ``J`` utótagot hasznája a képzetes rész jelölésére (pl. ``3+5j``, ``1j``).
ru: В дополнение к :class:`int` и :class:`float`, Python поддерживает другие типы чисел, такие, как :class:`~decimal.Decimal` и :class:`~fractions.Fraction`. Python также имеет встроенную поддержку :ref:` комплексных чисел <typesnumeric>`, и использует суффиксы ``j`` или ``J`` для отображения мниных частей (например ``3+5j``).

source: Text
ru: Текст

source: Python can manipulate text (represented by type :class:`str`, so-called "strings") as well as numbers. This includes characters "``!``", words "``rabbit``", names "``Paris``", sentences "``Got your back.``", etc. "``Yay! :)``". They can be enclosed in single quotes (``'...'``) or double quotes (``"..."``) with the same result [#]_.
ru: Python может манипулировать текстом (представленным типом :class:`str`, так называемыми "строками") также как и числами. Это включает символы "``!``", слова "``rabbit``", имена "``Paris``", предложения "``Got your back.``", и т.д. "``Yay! :)``". Они могут быть заключены в одинарные кавычки (``'...'``) или двойные кавычки (``"..."``) с тем же результатом [#]_.

source: To quote a quote, we need to "escape" it, by preceding it with ``\``. Alternatively, we can use the other type of quotation marks::
ru: Для цитирования цитаты нам нужно "экранировать" ее, предварительно добавив перед ней ``\``. В качестве альтернативы можно использовать другой тип кавычек::

source: In the Python shell, the string definition and output string can look different. The :func:`print` function produces a more readable output, by omitting the enclosing quotes and by printing escaped and special characters::
ru: В оболочке Python определение строки и строка вывода могут выглядеть по-разному. Функция :func:`print` обеспечивает более читаемый вывод, опуская заключительные кавычки и печатая экранированные и специальные символы::

source: If you don't want characters prefaced by ``\`` to be interpreted as special characters, you can use *raw strings* by adding an ``r`` before the first quote::
fa: اگر نمی‌خواهید کاراکترهای پیش‌گفتار ``\`` به عنوان کاراکترهای خاص تفسیر شوند، می‌توانید از *raw strings* با اضافه کردن یک ``r`` قبل از اولین نقل قول استفاده کنید:
hu: Ha nem akarod, hogy a ``\`` jellek kezdődő karakterek speciális karakterként értelmeződjenek, akkor *nyers karakterláncokat* használhatsz egy ``r``-et helyezve a kezdő idézőjel elé::
ru: Если вы не хотите символов с префиксом ``\``, которые будут интерпретированы как специальный символ, вы можете использовать *raw strings* добавив ``r`` перед первой кавычкой::

source: There is one subtle aspect to raw strings: a raw string may not end in an odd number of ``\`` characters; see :ref:`the FAQ entry <faq-programming-raw-string-backslash>` for more information and workarounds.
ru: Есть один тонкий момент в отношении необработанных строк: необработанная строка не может заканчиваться нечетным количеством символов ``\``; см. :ref:`запись в ЧаВо <faq-programming-raw-string-backslash>` для получения дополнительной информации и обходных путей.

source: String literals can span multiple lines. One way is using triple-quotes: ``"""..."""`` or ``'''...'''``. End of lines are automatically included in the string, but it's possible to prevent this by adding a ``\`` at the end of the line. In the following example, the initial newline is not included::
ru: Строковые литералы могут занимать несколько строк. Один из способов — использовать тройные кавычки: ``"""...."""`` или ``'''...'''``. Концы строк автоматически включаются в строку, но это можно предотвратить, добавив ``\`` в конце строки. В следующем примере начальная новая строка не включается:

source: Strings can be concatenated (glued together) with the ``+`` operator, and repeated with ``*``::
fa: رشته ها را می توان با عملگر ``+`` متصل کرد (به هم چسباند) و با ``*`` تکرار کرد:
hu: Karakterláncokat a ``+`` művelettel ragaszthatunk össze és ``*``-gal ismételhetünk. ::
ru: Строки могут быть объединены (склеены) с оператором ``+`` и повторены с помощью ``*``::

source: Two or more *string literals* (i.e. the ones enclosed between quotes) next to each other are automatically concatenated. ::
fa: دو یا چند *string literals* (یعنی آنهایی که بین نقل قول قرار می گیرند) در کنار یکدیگر به طور خودکار به هم متصل می شوند. ::
hu: Két egymást követő literális karakterláncot (azokat, amik idézőjelben vannak, és nem egy változóban, vagy nem egy függvény hoz létre) az értelmező magától összefűz::
ru: Два или более *строковых литералов* рядом друг с другом (т. е. те, которые заключены между кавычками) автоматически объединяются. ::

source: This feature is particularly useful when you want to break long strings::
fa: این ویژگی به ویژه زمانی مفید است که می خواهید رشته های طولانی را بشکنید:
hu: A literálisok összefűzése különösen hasznos hosszú sorok széttörésére::
ru: Эта возможность особенно полезна, когда вы хотите разбить длинную строку::

source: This only works with two literals though, not with variables or expressions::
fa: این فقط با دو حرف واقعی کار می کند، نه با متغیرها یا عبارات::
hu: De ez csak két literálissal működik, változóval vagy kifejezéssel nem::
ru: Это работает только со строковыми литералами, но не с переменными или выражениями::

source: If you want to concatenate variables or a variable and a literal, use ``+``::
fa: اگر می خواهید متغیرها یا یک متغیر و یک لفظ را به هم متصل کنید، از ``+`` استفاده کنید::
hu: Ha változókat akarsz összefűzni, vagy változót literálissal, használj ``+`` műveletet::
ru: Если вы хотите объединить переменные или переменную и литерал, используйте ``+``::

source: Strings can be *indexed* (subscripted), with the first character having index 0. There is no separate character type; a character is simply a string of size one::
fa: رشته ها می توانند *indexed* (مشترک) باشند که اولین کاراکتر دارای اندیس 0 باشد. هیچ نوع کاراکتر جداگانه ای وجود ندارد. یک کاراکتر به سادگی یک رشته با اندازه یک است:
hu: A karakterláncokat *indexelhetjük*, az első karakterhez tartozik a 0 index, a következőhöz az 1-es index és így tovább. Nincs külön karakter típus; egy karakter egyszerűen egy egy hosszúságú karakterlánc::
ru: Строки могут быть * индексированы* (подписаны), причем первый символ имеет индекс 0. Это не отдельный тип символа; символ - это просто строка размером в единицу::

source: Indices may also be negative numbers, to start counting from the right::
fa: شاخص ها نیز ممکن است اعداد منفی باشند، برای شروع شمارش از سمت راست:
hu: Az indexek negatívak is lehetnek, ilyenkor jobbról kezdünk el számolni::
ru: Индексы могут также иметь отрицательные значения и начинают отсчитываться справа::

source: Note that since -0 is the same as 0, negative indices start from -1.
fa: توجه داشته باشید که از آنجایی که -0 همان 0 است، شاخص های منفی از -1 شروع می شوند.
ru: Обратите внимание, что поскольку -0 равно 0, отрицательные индексы начинаются с -1.

source: In addition to indexing, *slicing* is also supported. While indexing is used to obtain individual characters, *slicing* allows you to obtain a substring::
ru: В дополнение к индексации также поддерживается *slicing*. В то время как индексация используется для получения отдельных символов, *slicing* позволяет получить подстроку::

source: Slice indices have useful defaults; an omitted first index defaults to zero, an omitted second index defaults to the size of the string being sliced. ::
fa: شاخص های برش دارای پیش فرض های مفیدی هستند. شاخص اول حذف شده به طور پیش فرض صفر است، شاخص دوم حذف شده به طور پیش فرض به اندازه رشته در حال برش است. ::
hu: A szeletek indexeinek hasznos alapértékei vannak; a kihagyott első index alapértéke 0, az elhagyott második index alapértéke a szeletelendő karakterlánc hossza::
ru: Индексы среза имеют полезные значения по умолчанию; опущенный первый индекс по умолчанию равен нулю, опущенный второй индекс по умолчанию равен размеру срезаемой строки. ::

source: Note how the start is always included, and the end always excluded. This makes sure that ``s[:i] + s[i:]`` is always equal to ``s``::
fa: توجه داشته باشید که چگونه شروع همیشه گنجانده می شود و پایان همیشه حذف می شود. این اطمینان حاصل می کند که ``s[:i] + s[i:]`` همیشه برابر با ``s`` است:
hu: A kezdő index mindig beleértendő az eredménybe, a végső index pedig nem. Ez teszi lehetővé, hogy ``s[:i] + s[i:]`` mindig egyenlő ``s``-el::
ru: Обратите внимание, что начало всегда включено, а конец всегда исключен. Это гарантирует, что ``s[:i] + s[i:]`` всегда равно ``s``::

source: One way to remember how slices work is to think of the indices as pointing *between* characters, with the left edge of the first character numbered 0. Then the right edge of the last character of a string of *n* characters has index *n*, for example::
fa: یکی از راه‌های به یاد آوردن نحوه کار برش‌ها این است که شاخص‌ها را به‌عنوان کاراکترهای *between* در نظر بگیرید، با لبه سمت چپ اولین کاراکتر با شماره 0. سپس لبه سمت راست آخرین کاراکتر یک رشته از کاراکترهای *n* دارای شاخص *n* است، برای مثال:
hu: Úgy a legkönnyebb megjegyezni hogy működnek a szeletek, ha azt képzeljük, hogy az indexek a karakterek *közé* mutatnak, az első karakter bal élét számozzuk nullának. Ekkor az *n* karakterből álló karakterlánc utolsó karakterének jobb éle az *n*, például::
ru: Один из способов запомнить как работают срезы - это думать о срезах, как об указателе *между* символами, где левый край первого символа равен 0. Тогда правый край последнего символа строки символов *n* имеет индекс *n*, например::

source: The first row of numbers gives the position of the indices 0...6 in the string; the second row gives the corresponding negative indices. The slice from *i* to *j* consists of all characters between the edges labeled *i* and *j*, respectively.
fa: ردیف اول اعداد موقعیت شاخص ها را 0...6 در رشته می دهد. ردیف دوم شاخص های منفی مربوطه را نشان می دهد. برش از *i* تا *j* شامل تمام کاراکترهای بین لبه‌های با برچسب *i* و *j* است.
hu: Az első sorban álló számok adják a 0...5 indexeket a karakterláncban; a második sor mutatja a megfelelő negatív indexeket. Az *i*-től *j*-ig terjedő szelet mindazokat a karaktereket tartalmazza, amelyek az *i* és *j* jelű élek között vannak.
ru: Первый ряд чисел обозначает положение индексов от 0...6 в строке; второй ряд дает соответствующие отрицательные индексы. Срез от *i* до *j* содержит все символы между краями помеченных *i* и *j*, соответственно.

source: For non-negative indices, the length of a slice is the difference of the indices, if both are within bounds. For example, the length of ``word[1:3]`` is 2.
fa: برای شاخص‌های غیرمنفی، در صورتی که هر دو در محدوده باشند، طول یک برش تفاوت شاخص‌ها است. به عنوان مثال، طول ``word[1:3]`` 2 است.
hu: A nem negatív indexek esetén a szelet hossza az indexek különbségével egyenlő, ha mindkettő a valódi szóhatárokon belül van. Például a ``szo[1:3]`` hossza 2.
ru: Для неотрицательных индексов длина среза - это разность индексов, если оба находятся в границах. Например, длина ``word[1:3]`` равна 2.

source: Attempting to use an index that is too large will result in an error::
fa: تلاش برای استفاده از شاخصی که خیلی بزرگ است با خطا مواجه می شود::
hu: Ha olyan indexet használunk, amely túl nagy, az eredmény hibát ad::
ru: Попытка использовать индекс, который является слишком большим, приведет к ошибке::

source: However, out of range slice indexes are handled gracefully when used for slicing::
fa: با این حال، شاخص‌های برش خارج از محدوده زمانی که برای برش استفاده می‌شوند، به خوبی مدیریت می‌شوند:
hu: Ellenben a tartományon kívüli indexek a szeletekben rugalmasan kezeli a Python nyelv::
ru: Однако, срез индексов вне диапазона изящно обрабатываетсяпри использовании::
