Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/tutorial/modules.po
Languages: fa

source: Modules
fa: ماژول ها

source: If you quit from the Python interpreter and enter it again, the definitions you have made (functions and variables) are lost. Therefore, if you want to write a somewhat longer program, you are better off using a text editor to prepare the input for the interpreter and running it with that file as input instead. This is known as creating a *script*. As your program gets longer, you may want to split it into several files for easier maintenance. You may also want to use a handy function that you've written in several programs without copying its definition into each program.
fa: اگر از مفسر پایتون خارج شوید و دوباره آن را وارد کنید، تعاریفی که ساخته اید (توابع و متغیرها) از بین می روند. بنابراین، اگر می‌خواهید یک برنامه طولانی‌تر بنویسید، بهتر است از یک ویرایشگر متن برای آماده کردن ورودی برای مفسر استفاده کنید و آن را با آن فایل به‌عنوان ورودی اجرا کنید. این به عنوان ایجاد *script* شناخته می شود. همانطور که برنامه شما طولانی تر می شود، ممکن است بخواهید برای نگهداری آسان تر آن را به چندین فایل تقسیم کنید. همچنین ممکن است بخواهید از یک تابع مفیدی که در چندین برنامه نوشته اید بدون کپی کردن تعریف آن در هر برنامه استفاده کنید.

source: To support this, Python has a way to put definitions in a file and use them in a script or in an interactive instance of the interpreter. Such a file is called a *module*; definitions from a module can be *imported* into other modules or into the *main* module (the collection of variables that you have access to in a script executed at the top level and in calculator mode).
fa: برای پشتیبانی از این موضوع، پایتون راهی برای قرار دادن تعاریف در یک فایل و استفاده از آنها در یک اسکریپت یا در یک نمونه تعاملی از مفسر دارد. چنین فایلی *module* نامیده می شود. تعاریف یک ماژول می تواند *imported* به ماژول های دیگر یا به ماژول *main* (مجموعه ای از متغیرهایی که در یک اسکریپت اجرا شده در سطح بالا و در حالت ماشین حساب به آنها دسترسی دارید) باشد.

source: A module is a file containing Python definitions and statements. The file name is the module name with the suffix :file:`.py` appended. Within a module, the module's name (as a string) is available as the value of the global variable ``__name__``. For instance, use your favorite text editor to create a file called :file:`fibo.py` in the current directory with the following contents::
fa: ماژول فایلی است که شامل تعاریف و عبارات پایتون است. نام فایل، نام ماژول با پسوند :file:`.py` است. در یک ماژول، نام ماژول (به عنوان یک رشته) به عنوان مقدار متغیر جهانی ``__name__`` در دسترس است. به عنوان مثال، از ویرایشگر متن مورد علاقه خود برای ایجاد فایلی به نام :file:`fibo.py` در فهرست فعلی با محتوای زیر استفاده کنید:

source: Now enter the Python interpreter and import this module with the following command::
fa: حالا مفسر پایتون را وارد کنید و این ماژول را با دستور زیر وارد کنید:

source: This does not add the names of the functions defined in ``fibo`` directly to the current :term:`namespace` (see :ref:`tut-scopes` for more details); it only adds the module name ``fibo`` there. Using the module name you can access the functions::
fa: این نام توابع تعریف شده در ``fibo`` را مستقیماً به :term:`namespace` فعلی اضافه نمی کند (برای جزئیات بیشتر به :ref:`tut-scopes` مراجعه کنید). فقط نام ماژول ``fibo`` را در آنجا اضافه می کند. با استفاده از نام ماژول می توانید به توابع دسترسی داشته باشید:

source: >>> fibo.fib(1000) 0 1 1 2 3 5 8 13 21 34 55 89 144 233 377 610 987 >>> fibo.fib2(100) [0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89] >>> fibo.__name__ 'fibo'
fa: >>> fibo.fib(1000) 0 1 1 2 3 5 8 13 21 34 55 89 144 233 377 610 987 >>> fibo.fib2 (100) [0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89] >>> fibo.__name__ "فیبو"

source: If you intend to use a function often you can assign it to a local name::
fa: اگر قصد دارید از یک تابع اغلب استفاده کنید، می توانید آن را به یک نام محلی اختصاص دهید:

source: More on Modules
fa: اطلاعات بیشتر در مورد ماژول ها

source: A module can contain executable statements as well as function definitions. These statements are intended to initialize the module. They are executed only the *first* time the module name is encountered in an import statement. [#]_ (They are also run if the file is executed as a script.)
fa: یک ماژول می تواند شامل دستورات اجرایی و همچنین تعاریف تابع باشد. این عبارات برای مقداردهی اولیه ماژول در نظر گرفته شده است. آنها فقط زمانی اجرا می شوند که نام ماژول در یک دستور import با نام *first* مواجه می شود. [#]_ (اگر فایل به صورت اسکریپت اجرا شود نیز اجرا می شوند.)

source: Each module has its own private namespace, which is used as the global namespace by all functions defined in the module. Thus, the author of a module can use global variables in the module without worrying about accidental clashes with a user's global variables. On the other hand, if you know what you are doing you can touch a module's global variables with the same notation used to refer to its functions, ``modname.itemname``.
fa: هر ماژول فضای نام خصوصی خود را دارد که به عنوان فضای نام جهانی توسط تمام توابع تعریف شده در ماژول استفاده می شود. بنابراین، نویسنده یک ماژول می تواند از متغیرهای سراسری در ماژول استفاده کند بدون اینکه نگران برخورد تصادفی با متغیرهای سراسری کاربر باشد. از سوی دیگر، اگر می‌دانید چه کار می‌کنید، می‌توانید متغیرهای سراسری یک ماژول را با همان نمادی که برای اشاره به عملکرد آن، ``modname.itemname`` استفاده می‌شود، لمس کنید.

source: Modules can import other modules. It is customary but not required to place all :keyword:`import` statements at the beginning of a module (or script, for that matter). The imported module names, if placed at the top level of a module (outside any functions or classes), are added to the module's global namespace.
fa: ماژول ها می توانند ماژول های دیگر را وارد کنند. قرار دادن تمام عبارات :keyword:`import` در ابتدای یک ماژول (یا اسکریپت) مرسوم است، اما لازم نیست. نام‌های ماژول وارد شده، اگر در سطح بالای یک ماژول (خارج از هر توابع یا کلاس) قرار گیرند، به فضای نام جهانی ماژول اضافه می‌شوند.

source: There is a variant of the :keyword:`import` statement that imports names from a module directly into the importing module's namespace. For example::
fa: گونه‌ای از عبارت :keyword:`import` وجود دارد که نام‌ها را از یک ماژول مستقیماً به فضای نام ماژول واردکننده وارد می‌کند. به عنوان مثال::

source: >>> from fibo import fib, fib2 >>> fib(500) 0 1 1 2 3 5 8 13 21 34 55 89 144 233 377
fa: >>> از fibo import fib, fib2 >>> fib (500) 0 1 1 2 3 5 8 13 21 34 55 89 144 233 377

source: This does not introduce the module name from which the imports are taken in the local namespace (so in the example, ``fibo`` is not defined).
fa: این نام ماژول را که واردات از آن در فضای نام محلی گرفته شده است معرفی نمی کند (بنابراین در مثال, ``fibo`` تعریف نشده است).

source: There is even a variant to import all names that a module defines::
fa: حتی یک نوع برای وارد کردن همه نام هایی که یک ماژول تعریف می کند وجود دارد:

source: >>> from fibo import * >>> fib(500) 0 1 1 2 3 5 8 13 21 34 55 89 144 233 377
fa: >>> از واردات فیبو * >>> fib (500) 0 1 1 2 3 5 8 13 21 34 55 89 144 233 377

source: This imports all names except those beginning with an underscore (``_``). In most cases Python programmers do not use this facility since it introduces an unknown set of names into the interpreter, possibly hiding some things you have already defined.
fa: این همه نام‌ها را وارد می‌کند، به جز نام‌هایی که با زیرخط (``_``) شروع می‌شوند. در بیشتر موارد برنامه نویسان پایتون از این امکان استفاده نمی کنند زیرا مجموعه ای ناشناخته از نام ها را در مفسر معرفی می کند و احتمالاً برخی از مواردی را که قبلاً تعریف کرده اید پنهان می کند.

source: Note that in general the practice of importing ``*`` from a module or package is frowned upon, since it often causes poorly readable code. However, it is okay to use it to save typing in interactive sessions.
fa: توجه داشته باشید که به طور کلی عمل وارد کردن ``*`` از یک ماژول یا بسته مورد انتقاد قرار می گیرد، زیرا اغلب باعث کدهای ناخوانا می شود. با این حال، استفاده از آن برای ذخیره تایپ در جلسات تعاملی اشکالی ندارد.

source: If the module name is followed by :keyword:`!as`, then the name following :keyword:`!as` is bound directly to the imported module.
fa: اگر نام ماژول با :keyword:`!as` دنبال شود، نام زیر :keyword:`!as` مستقیماً به ماژول وارد شده متصل می شود.

source: >>> import fibo as fib >>> fib.fib(500) 0 1 1 2 3 5 8 13 21 34 55 89 144 233 377
fa: >>> فیبو را به عنوان فیب وارد کنید >>> fib.fib(500) 0 1 1 2 3 5 8 13 21 34 55 89 144 233 377

source: This is effectively importing the module in the same way that ``import fibo`` will do, with the only difference of it being available as ``fib``.
fa: این عملاً ماژول را به همان روشی که ``import fibo`` انجام می دهد وارد می کند، با تنها تفاوت آن در دسترس بودن به عنوان ``fib``.

source: It can also be used when utilising :keyword:`from` with similar effects::
fa: همچنین می توان از آن در هنگام استفاده از :keyword:`from` با اثرات مشابه استفاده کرد:

source: >>> from fibo import fib as fibonacci >>> fibonacci(500) 0 1 1 2 3 5 8 13 21 34 55 89 144 233 377
fa: >>> از fibo import fib به عنوان فیبوناچی >>> فیبوناچی (500) 0 1 1 2 3 5 8 13 21 34 55 89 144 233 377

source: For efficiency reasons, each module is only imported once per interpreter session. Therefore, if you change your modules, you must restart the interpreter -- or, if it's just one module you want to test interactively, use :func:`importlib.reload`, e.g. ``import importlib; importlib.reload(modulename)``.
fa: به دلایل کارایی، هر ماژول فقط یک بار در هر جلسه مترجم وارد می شود. بنابراین، اگر ماژول‌های خود را تغییر می‌دهید، باید مفسر را مجدداً راه‌اندازی کنید - یا اگر فقط یک ماژول است که می‌خواهید به صورت تعاملی آزمایش کنید، از :func:`importlib.reload` استفاده کنید، به عنوان مثال. ``import importlib; importlib.reload(modulename)``.

source: Executing modules as scripts
fa: اجرای ماژول ها به صورت اسکریپت

source: When you run a Python module with ::
fa: وقتی ماژول پایتون را با ::

source: the code in the module will be executed, just as if you imported it, but with the ``__name__`` set to ``"__main__"``. That means that by adding this code at the end of your module::
fa: کد موجود در ماژول اجرا می شود، درست مثل اینکه شما آن را وارد کرده اید، اما با ``__name__`` روی ``"__main__"`` تنظیم شده است. یعنی با اضافه کردن این کد در انتهای ماژول:

source: you can make the file usable as a script as well as an importable module, because the code that parses the command line only runs if the module is executed as the "main" file:
fa: شما می توانید فایل را به عنوان یک اسکریپت و همچنین به عنوان یک ماژول قابل واردات قابل استفاده کنید، زیرا کدی که خط فرمان را تجزیه می کند تنها در صورتی اجرا می شود که ماژول به عنوان فایل "اصلی" اجرا شود:

source: If the module is imported, the code is not run::
fa: اگر ماژول وارد شود، کد اجرا نمی شود::

source: >>> import fibo >>>
fa: >>> واردات فیبو >>>

source: This is often used either to provide a convenient user interface to a module, or for testing purposes (running the module as a script executes a test suite).
fa: این اغلب برای ارائه یک رابط کاربری مناسب به یک ماژول یا برای اهداف آزمایشی استفاده می شود (اجرای ماژول به عنوان یک اسکریپت یک مجموعه آزمایشی را اجرا می کند).

source: The Module Search Path
fa: مسیر جستجوی ماژول

source: When a module named :mod:`!spam` is imported, the interpreter first searches for a built-in module with that name. These module names are listed in :data:`sys.builtin_module_names`. If not found, it then searches for a file named :file:`spam.py` in a list of directories given by the variable :data:`sys.path`. :data:`sys.path` is initialized from these locations:
fa: هنگامی که یک ماژول به نام :mod:`!spam` وارد می شود، مفسر ابتدا ماژول داخلی با آن نام را جستجو می کند. نام این ماژول ها در :data:`sys.builtin_module_names` ذکر شده است. اگر پیدا نشد، سپس فایلی به نام :file:`spam.py` را در فهرستی از دایرکتوری های ارائه شده توسط متغیر :data:`sys.path` جستجو می کند. :data:`sys.path` از این مکان ها مقداردهی اولیه می شود:

source: The directory containing the input script (or the current directory when no file is specified).
fa: دایرکتوری حاوی اسکریپت ورودی (یا دایرکتوری فعلی وقتی هیچ فایلی مشخص نشده است).

source: :envvar:`PYTHONPATH` (a list of directory names, with the same syntax as the shell variable :envvar:`PATH`).
fa: :envvar:`PYTHONPATH` (لیستی از نام دایرکتوری ها, با سینتکس مشابه با متغیر پوسته :envvar:`PATH`).

source: The installation-dependent default (by convention including a ``site-packages`` directory, handled by the :mod:`site` module).
fa: پیش‌فرض وابسته به نصب (طبق قرارداد شامل دایرکتوری ``site-packages`` که توسط ماژول :mod:`site` مدیریت می‌شود).

source: More details are at :ref:`sys-path-init`.
fa: جزئیات بیشتر در :ref:`sys-path-init` است.

source: On file systems which support symlinks, the directory containing the input script is calculated after the symlink is followed. In other words the directory containing the symlink is **not** added to the module search path.
fa: در سیستم های فایلی که از symlink ها پشتیبانی می کنند، دایرکتوری حاوی اسکریپت ورودی پس از دنبال کردن سیم پیوند محاسبه می شود. به عبارت دیگر دایرکتوری حاوی سیم پیوند **not** به مسیر جستجوی ماژول اضافه شده است.

source: After initialization, Python programs can modify :data:`sys.path`. The directory containing the script being run is placed at the beginning of the search path, ahead of the standard library path. This means that scripts in that directory will be loaded instead of modules of the same name in the library directory. This is an error unless the replacement is intended. See section :ref:`tut-standardmodules` for more information.
fa: پس از مقداردهی اولیه، برنامه های پایتون می توانند :data:`sys.path` را تغییر دهند. دایرکتوری حاوی اسکریپت در حال اجرا در ابتدای مسیر جستجو، جلوتر از مسیر استاندارد کتابخانه قرار می گیرد. این بدان معنی است که اسکریپت های موجود در آن دایرکتوری به جای ماژول هایی با همان نام در فهرست کتابخانه بارگذاری می شوند. این یک خطا است مگر اینکه جایگزینی در نظر گرفته شده باشد. برای اطلاعات بیشتر به بخش :ref:`tut-standardmodules` مراجعه کنید.

source: "Compiled" Python files
fa: فایل های پایتون "کامپایل شده".

source: To speed up loading modules, Python caches the compiled version of each module in the ``__pycache__`` directory under the name :file:`module.{version}.pyc`, where the version encodes the format of the compiled file; it generally contains the Python version number. For example, in CPython release 3.3 the compiled version of spam.py would be cached as ``__pycache__/spam.cpython-33.pyc``. This naming convention allows compiled modules from different releases and different versions of Python to coexist.
fa: برای سرعت بخشیدن به بارگذاری ماژول ها، پایتون نسخه کامپایل شده هر ماژول را در فهرست ``__pycache__`` تحت نام :file:`module.{version}.pyc` ذخیره می کند، جایی که نسخه فرمت فایل کامپایل شده را کد می کند. به طور کلی شامل شماره نسخه پایتون است. به عنوان مثال، در نسخه 3.3 CPython، نسخه کامپایل شده spam.py به عنوان ``__pycache__/spam.cpython-33.pyc`` ذخیره می شود. این قرارداد نام‌گذاری به ماژول‌های کامپایل‌شده از نسخه‌های مختلف و نسخه‌های مختلف پایتون اجازه می‌دهد که همزیستی کنند.

source: Python checks the modification date of the source against the compiled version to see if it's out of date and needs to be recompiled. This is a completely automatic process. Also, the compiled modules are platform-independent, so the same library can be shared among systems with different architectures.
fa: پایتون تاریخ اصلاح منبع را در برابر نسخه کامپایل شده بررسی می کند تا ببیند قدیمی است و نیاز به کامپایل مجدد دارد یا خیر. این یک فرآیند کاملاً خودکار است. همچنین، ماژول های کامپایل شده مستقل از پلتفرم هستند، بنابراین می توان یک کتابخانه را بین سیستم هایی با معماری های مختلف به اشتراک گذاشت.

source: Python does not check the cache in two circumstances. First, it always recompiles and does not store the result for the module that's loaded directly from the command line. Second, it does not check the cache if there is no source module. To support a non-source (compiled only) distribution, the compiled module must be in the source directory, and there must not be a source module.
fa: پایتون در دو حالت کش را بررسی نمی کند. اول، همیشه دوباره کامپایل می شود و نتیجه را برای ماژولی که مستقیماً از خط فرمان بارگذاری می شود ذخیره نمی کند. دوم اینکه اگر ماژول منبع وجود نداشته باشد، کش را بررسی نمی کند. برای پشتیبانی از توزیع غیر منبع (فقط کامپایل شده), ماژول کامپایل شده باید در دایرکتوری منبع باشد و ماژول منبع نباید وجود داشته باشد.

source: Some tips for experts:
fa: چند نکته برای کارشناسان:

source: You can use the :option:`-O` or :option:`-OO` switches on the Python command to reduce the size of a compiled module. The ``-O`` switch removes assert statements, the ``-OO`` switch removes both assert statements and __doc__ strings. Since some programs may rely on having these available, you should only use this option if you know what you're doing. "Optimized" modules have an ``opt-`` tag and are usually smaller. Future releases may change the effects of optimization.
fa: شما می توانید از سوئیچ های :option:`-O` یا :option:`-OO` در دستور پایتون برای کاهش اندازه یک ماژول کامپایل شده استفاده کنید. سوئیچ ``-O`` عبارات عنوان را حذف می کند، سوئیچ ``-OO`` هر دو دستورات و رشته های __doc__ را حذف می کند. از آنجایی که برخی از برنامه ها ممکن است به در دسترس بودن اینها متکی باشند، فقط در صورتی باید از این گزینه استفاده کنید که بدانید چه کاری انجام می دهید. ماژول های "بهینه" دارای یک برچسب ``opt-`` هستند و معمولا کوچکتر هستند. نسخه های آینده ممکن است اثرات بهینه سازی را تغییر دهند.

source: A program doesn't run any faster when it is read from a ``.pyc`` file than when it is read from a ``.py`` file; the only thing that's faster about ``.pyc`` files is the speed with which they are loaded.
fa: وقتی یک برنامه از یک فایل ``.pyc`` خوانده می شود سریعتر از زمانی که از یک فایل ``.py`` خوانده می شود، اجرا نمی شود. تنها چیزی که در مورد فایل های ``.pyc`` سریعتر است، سرعت بارگذاری آنها است.

source: The module :mod:`compileall` can create .pyc files for all modules in a directory.
fa: ماژول :mod:`compileall` می تواند فایل های .pyc را برای همه ماژول های یک دایرکتوری ایجاد کند.

source: There is more detail on this process, including a flow chart of the decisions, in :pep:`3147`.
fa: جزئیات بیشتری در مورد این فرآیند، از جمله نمودار جریان تصمیمات، در :pep:`3147` وجود دارد.

source: Standard Modules
fa: ماژول های استاندارد

source: Python comes with a library of standard modules, described in a separate document, the Python Library Reference ("Library Reference" hereafter). Some modules are built into the interpreter; these provide access to operations that are not part of the core of the language but are nevertheless built in, either for efficiency or to provide access to operating system primitives such as system calls. The set of such modules is a configuration option which also depends on the underlying platform. For example, the :mod:`winreg` module is only provided on Windows systems. One particular module deserves some attention: :mod:`sys`, which is built into every Python interpreter. The variables ``sys.ps1`` and ``sys.ps2`` define the strings used as primary and secondary prompts::
fa: پایتون با کتابخانه ای از ماژول های استاندارد ارائه می شود که در یک سند جداگانه به نام مرجع کتابخانه پایتون (از این به بعد "مرجع کتابخانه" توضیح داده شده است. برخی از ماژول ها در مفسر تعبیه شده اند. اینها دسترسی به عملیاتی را فراهم می کنند که بخشی از هسته زبان نیستند، اما با این وجود، برای کارایی یا برای دسترسی به سیستم عامل های اولیه مانند فراخوانی سیستم، ساخته شده اند. مجموعه ای از این ماژول ها یک گزینه پیکربندی است که به پلت فرم زیرین نیز بستگی دارد. به عنوان مثال، ماژول :mod:`winreg` فقط در سیستم های ویندوز ارائه می شود. یک ماژول خاص سزاوار توجه است: :mod:`sys` که در هر مفسر پایتون تعبیه شده است. متغیرهای ``sys.ps1`` و ``sys.ps2`` رشته های مورد استفاده را به عنوان دستورهای اولیه و ثانویه تعریف می کنند:

source: >>> import sys >>> sys.ps1 '>>> ' >>> sys.ps2 '... ' >>> sys.ps1 = 'C> ' C> print('Yuck!') Yuck! C>
fa: >>> سیستم را وارد کنید >>> sys.ps1 '>>>' >>> sys.ps2 '...' >>> sys.ps1 = 'C> ' C> print ('Yuck!') آخه! C>

source: These two variables are only defined if the interpreter is in interactive mode.
fa: این دو متغیر تنها در صورتی تعریف می شوند که مفسر در حالت تعاملی باشد.

source: The variable ``sys.path`` is a list of strings that determines the interpreter's search path for modules. It is initialized to a default path taken from the environment variable :envvar:`PYTHONPATH`, or from a built-in default if :envvar:`PYTHONPATH` is not set. You can modify it using standard list operations::
fa: متغیر ``sys.path`` لیستی از رشته ها است که مسیر جستجوی مفسر برای ماژول ها را تعیین می کند. این به یک مسیر پیش فرض گرفته شده از متغیر محیطی :envvar:`PYTHONPATH`، یا از یک پیش فرض داخلی اگر :envvar:`PYTHONPATH` تنظیم نشده باشد، مقداردهی اولیه می شود. شما می توانید آن را با استفاده از عملیات لیست استاندارد تغییر دهید:

source: The :func:`dir` Function
fa: عملکرد :func:`dir`

source: The built-in function :func:`dir` is used to find out which names a module defines. It returns a sorted list of strings::
fa: تابع داخلی :func:`dir` برای پیدا کردن نام هایی که یک ماژول تعریف می کند استفاده می شود. لیست مرتب شده ای از رشته ها را برمی گرداند::

source: Without arguments, :func:`dir` lists the names you have defined currently::
fa: بدون آرگومان، :func:`dir` نام هایی را که در حال حاضر تعریف کرده اید فهرست می کند:

source: Note that it lists all types of names: variables, modules, functions, etc.
fa: توجه داشته باشید که همه انواع نام ها را فهرست می کند: متغیرها، ماژول ها، توابع و غیره.

source: :func:`dir` does not list the names of built-in functions and variables. If you want a list of those, they are defined in the standard module :mod:`builtins`::
fa: :func:`dir` نام توابع و متغیرهای داخلی را فهرست نمی کند. اگر لیستی از آن ها را می خواهید، در ماژول استاندارد :mod:`builtins` تعریف شده اند:

source: Packages
fa: بسته ها

source: Packages are a way of structuring Python's module namespace by using "dotted module names". For example, the module name :mod:`!A.B` designates a submodule named ``B`` in a package named ``A``. Just like the use of modules saves the authors of different modules from having to worry about each other's global variable names, the use of dotted module names saves the authors of multi-module packages like NumPy or Pillow from having to worry about each other's module names.
fa: بسته‌ها روشی برای ساختاردهی فضای نام ماژول پایتون با استفاده از «نام‌های ماژول نقطه‌دار» هستند. به عنوان مثال، نام ماژول :mod:`!A.B` یک زیر ماژول به نام ``B`` را در بسته ای به نام ``A`` تعیین می کند. درست همانطور که استفاده از ماژول ها باعث می شود نویسندگان ماژول های مختلف نگران نام متغیرهای جهانی یکدیگر نباشند، استفاده از نام ماژول های نقطه دار باعث می شود نویسندگان بسته های چند ماژول مانند NumPy یا Pillow نگران نام ماژول های یکدیگر نباشند.
