Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/tutorial/modules.po
Languages: fa

source: Suppose you want to design a collection of modules (a "package") for the uniform handling of sound files and sound data. There are many different sound file formats (usually recognized by their extension, for example: :file:`.wav`, :file:`.aiff`, :file:`.au`), so you may need to create and maintain a growing collection of modules for the conversion between the various file formats. There are also many different operations you might want to perform on sound data (such as mixing, adding echo, applying an equalizer function, creating an artificial stereo effect), so in addition you will be writing a never-ending stream of modules to perform these operations. Here's a possible structure for your package (expressed in terms of a hierarchical filesystem):
fa: فرض کنید می خواهید مجموعه ای از ماژول ها (یک "بسته") برای مدیریت یکنواخت فایل های صوتی و داده های صوتی طراحی کنید. فرمت‌های فایل صوتی بسیار زیادی وجود دارد (معمولاً با پسوند آنها شناخته می‌شوند, به عنوان مثال: :file:`.wav`, :file:`.aiff`, :file:`.au`), بنابراین ممکن است نیاز به ایجاد و نگهداری مجموعه‌ای از ماژول‌ها برای تبدیل بین فرمت‌های مختلف فایل داشته باشید. همچنین بسیاری از عملیات‌های مختلفی وجود دارد که ممکن است بخواهید روی داده‌های صدا انجام دهید (مانند میکس کردن, افزودن اکو, اعمال یک عملکرد اکولایزر, ایجاد یک افکت استریو مصنوعی), بنابراین علاوه بر این، شما یک جریان بی‌پایان از ماژول‌ها را برای انجام این عملیات می‌نویسید. در اینجا یک ساختار ممکن برای بسته شما وجود دارد (که در قالب یک فایل سیستم سلسله مراتبی بیان می شود):

source: sound/ Top-level package __init__.py Initialize the sound package formats/ Subpackage for file format conversions __init__.py wavread.py wavwrite.py aiffread.py aiffwrite.py auread.py auwrite.py ... effects/ Subpackage for sound effects __init__.py echo.py surround.py reverse.py ... filters/ Subpackage for filters __init__.py equalizer.py vocoder.py karaoke.py ...
fa: صدا/ بسته سطح بالا __init__.py بسته صدا را راه اندازی کنید فرمت ها/ بسته فرعی برای تبدیل فرمت فایل __init__.py wavread.py wavwrite.py aiffread.py aiffwrite.py auread.py auwrite.py ... جلوه ها/ بسته فرعی برای جلوه های صوتی __init__.py echo.py surround.py reverse.py ... فیلترها/ بسته فرعی برای فیلترها __init__.py اکولایزر.py vocoder.py karaoke.py ...

source: When importing the package, Python searches through the directories on ``sys.path`` looking for the package subdirectory.
fa: هنگام وارد کردن بسته، پایتون از طریق دایرکتوری های موجود در ``sys.path`` به دنبال زیر شاخه بسته می گردد.

source: The :file:`__init__.py` files are required to make Python treat directories containing the file as packages (unless using a :term:`namespace package`, a relatively advanced feature). This prevents directories with a common name, such as ``string``, from unintentionally hiding valid modules that occur later on the module search path. In the simplest case, :file:`__init__.py` can just be an empty file, but it can also execute initialization code for the package or set the ``__all__`` variable, described later.
fa: فایل‌های :file:`__init__.py` مورد نیاز هستند تا پایتون دایرکتوری‌های حاوی فایل را به‌عنوان بسته‌ها در نظر بگیرد (مگر اینکه از :term:`namespace package` که یک ویژگی نسبتاً پیشرفته است استفاده کنید). این امر از پوشاندن ناخواسته ماژول‌های معتبری که بعداً در مسیر جستجوی ماژول رخ می‌دهند، دایرکتوری‌هایی با نام مشترک، مانند ``string``، جلوگیری می‌کند. در ساده‌ترین حالت، :file:`__init__.py` فقط می‌تواند یک فایل خالی باشد، اما همچنین می‌تواند کد اولیه را برای بسته اجرا کند یا متغیر ``__all__`` را که بعدا توضیح داده شد، تنظیم کند.

source: Users of the package can import individual modules from the package, for example::
fa: کاربران بسته می توانند ماژول های جداگانه را از بسته وارد کنند، به عنوان مثال:

source: This loads the submodule :mod:`!sound.effects.echo`. It must be referenced with its full name. ::
fa: این زیر ماژول :mod:`!sound.effects.echo` را بارگیری می کند. باید با نام کامل آن ارجاع داده شود. ::

source: An alternative way of importing the submodule is::
fa: یک راه جایگزین برای وارد کردن زیر ماژول این است:

source: This also loads the submodule :mod:`!echo`, and makes it available without its package prefix, so it can be used as follows::
fa: این همچنین زیر ماژول :mod:`!echo` را بارگیری می کند و آن را بدون پیشوند بسته در دسترس قرار می دهد، بنابراین می توان از آن به صورت زیر استفاده کرد:

source: Yet another variation is to import the desired function or variable directly::
fa: یک تغییر دیگر این است که تابع یا متغیر مورد نظر را مستقیما وارد کنید:

source: Again, this loads the submodule :mod:`!echo`, but this makes its function :func:`!echofilter` directly available::
fa: مجدداً، این زیر ماژول :mod:`!echo` را بارگیری می کند، اما عملکرد آن :func:`!echofilter` را مستقیماً در دسترس قرار می دهد:

source: Note that when using ``from package import item``, the item can be either a submodule (or subpackage) of the package, or some other name defined in the package, like a function, class or variable. The ``import`` statement first tests whether the item is defined in the package; if not, it assumes it is a module and attempts to load it. If it fails to find it, an :exc:`ImportError` exception is raised.
fa: توجه داشته باشید که هنگام استفاده از ``from package import item``، آیتم می تواند یک زیر ماژول (یا بسته فرعی) بسته باشد یا نام دیگری که در بسته تعریف شده است، مانند یک تابع، کلاس یا متغیر. دستور ``import`` ابتدا تست می کند که آیا آیتم در بسته تعریف شده است یا خیر. اگر نه، فرض می کند که یک ماژول است و سعی می کند آن را بارگذاری کند. اگر نتواند آن را پیدا کند، یک استثنا :exc:`ImportError` ایجاد می شود.

source: Contrarily, when using syntax like ``import item.subitem.subsubitem``, each item except for the last must be a package; the last item can be a module or a package but can't be a class or function or variable defined in the previous item.
fa: برعکس، هنگام استفاده از سینتکس مانند ``import item.subitem.subsubitem``، هر مورد به جز مورد آخر باید یک بسته باشد. آخرین مورد می تواند یک ماژول یا یک بسته باشد اما نمی تواند یک کلاس یا تابع یا متغیر تعریف شده در مورد قبلی باشد.

source: Importing \* From a Package
fa: وارد کردن \* از یک بسته

source: Now what happens when the user writes ``from sound.effects import *``? Ideally, one would hope that this somehow goes out to the filesystem, finds which submodules are present in the package, and imports them all. This could take a long time and importing sub-modules might have unwanted side-effects that should only happen when the sub-module is explicitly imported.
fa: حالا وقتی کاربر ``from sound.effects import *`` را می نویسد چه اتفاقی می افتد؟ در حالت ایده‌آل، می‌توان امیدوار بود که این به نحوی به سیستم فایل برود، زیر ماژول‌های موجود در بسته را بیابد و همه آنها را وارد کند. این ممکن است زمان زیادی طول بکشد و وارد کردن ماژول‌های فرعی ممکن است عوارض جانبی ناخواسته‌ای داشته باشد که فقط زمانی اتفاق می‌افتد که ماژول فرعی به صراحت وارد شده باشد.

source: The only solution is for the package author to provide an explicit index of the package. The :keyword:`import` statement uses the following convention: if a package's :file:`__init__.py` code defines a list named ``__all__``, it is taken to be the list of module names that should be imported when ``from package import *`` is encountered. It is up to the package author to keep this list up-to-date when a new version of the package is released. Package authors may also decide not to support it, if they don't see a use for importing \* from their package. For example, the file :file:`sound/effects/__init__.py` could contain the following code::
fa: تنها راه حل این است که نویسنده بسته یک نمایه صریح از بسته ارائه دهد. دستور :keyword:`import` از قرارداد زیر استفاده می کند: اگر کد :file:`__init__.py` بسته، لیستی به نام ``__all__`` را تعریف کند، به عنوان لیستی از نام ماژول ها در نظر گرفته می شود که باید در هنگام مواجهه با ``from package import *`` وارد شوند. این بر عهده نویسنده بسته است که این لیست را هنگام انتشار نسخه جدید بسته به روز نگه دارد. نویسندگان بسته همچنین ممکن است تصمیم بگیرند که از آن پشتیبانی نکنند، در صورتی که استفاده ای برای وارد کردن \* از بسته خود نمی بینند. به عنوان مثال، فایل :file:`sound/effects/__init__.py` می تواند حاوی کد زیر باشد:

source: This would mean that ``from sound.effects import *`` would import the three named submodules of the :mod:`!sound.effects` package.
fa: این بدان معنی است که ``from sound.effects import *`` سه زیر ماژول نامگذاری شده بسته :mod:`!sound.effects` را وارد می کند.

source: Be aware that submodules might become shadowed by locally defined names. For example, if you added a ``reverse`` function to the :file:`sound/effects/__init__.py` file, the ``from sound.effects import *`` would only import the two submodules ``echo`` and ``surround``, but *not* the ``reverse`` submodule, because it is shadowed by the locally defined ``reverse`` function::
fa: توجه داشته باشید که زیر ماژول‌ها ممکن است با نام‌هایی که به صورت محلی تعریف شده‌اند، تحت‌سایه شوند. به عنوان مثال، اگر یک تابع ``reverse`` را به فایل :file:`sound/effects/__init__.py` اضافه کنید، ``from sound.effects import *`` فقط دو زیرماژول ``echo`` و ``surround`` را وارد می کند، اما *not* زیرماژول ``reverse`` را وارد می کند، زیرا توسط تابع ``reverse`` که به صورت محلی تعریف شده سایه می اندازد:

source: If ``__all__`` is not defined, the statement ``from sound.effects import *`` does *not* import all submodules from the package :mod:`!sound.effects` into the current namespace; it only ensures that the package :mod:`!sound.effects` has been imported (possibly running any initialization code in :file:`__init__.py`) and then imports whatever names are defined in the package. This includes any names defined (and submodules explicitly loaded) by :file:`__init__.py`. It also includes any submodules of the package that were explicitly loaded by previous :keyword:`import` statements. Consider this code::
fa: اگر ``__all__`` تعریف نشده باشد، عبارت ``from sound.effects import *`` *not* همه زیر ماژول ها را از بسته :mod:`!sound.effects` به فضای نام فعلی وارد می کند. این فقط تضمین می کند که بسته :mod:`!sound.effects` وارد شده است (احتمالاً هر کد اولیه را در :file:`__init__.py` اجرا می کند) و سپس هر نامی را که در بسته تعریف شده است وارد می کند. این شامل هر نامی است که توسط :file:`__init__.py` تعریف شده است (و زیر ماژول هایی که به صراحت بارگذاری شده اند). همچنین شامل هر زیر ماژول بسته است که به صراحت توسط عبارات قبلی :keyword:`import` بارگذاری شده است. این کد را در نظر بگیرید::

source: In this example, the :mod:`!echo` and :mod:`!surround` modules are imported in the current namespace because they are defined in the :mod:`!sound.effects` package when the ``from...import`` statement is executed. (This also works when ``__all__`` is defined.)
fa: در این مثال، ماژول‌های :mod:`!echo` و :mod:`!surround` در فضای نام فعلی وارد می‌شوند زیرا در بسته :mod:`!sound.effects` هنگام اجرای دستور ``from...import`` تعریف شده‌اند. (هنگامی که ``__all__`` تعریف شده باشد این کار نیز کار می کند.)

source: Although certain modules are designed to export only names that follow certain patterns when you use ``import *``, it is still considered bad practice in production code.
fa: اگرچه ماژول‌های خاصی برای صادرات فقط نام‌هایی طراحی شده‌اند که در هنگام استفاده از ``import *`` از الگوهای خاصی پیروی می‌کنند، اما همچنان در کد تولید بد عمل می‌شود.

source: Remember, there is nothing wrong with using ``from package import specific_submodule``! In fact, this is the recommended notation unless the importing module needs to use submodules with the same name from different packages.
fa: به یاد داشته باشید، استفاده از ``from package import specific_submodule`` اشکالی ندارد! در واقع، این نماد توصیه شده است، مگر اینکه ماژول واردکننده نیاز به استفاده از ماژول های فرعی با همان نام از بسته های مختلف داشته باشد.

source: Intra-package References
fa: مراجع درون بسته

source: When packages are structured into subpackages (as with the :mod:`!sound` package in the example), you can use absolute imports to refer to submodules of siblings packages. For example, if the module :mod:`!sound.filters.vocoder` needs to use the :mod:`!echo` module in the :mod:`!sound.effects` package, it can use ``from sound.effects import echo``.
fa: هنگامی که بسته‌ها در بسته‌های فرعی ساختار می‌شوند (مانند بسته :mod:`!sound` در مثال), می‌توانید از import absolute برای ارجاع به زیر ماژول‌های بسته‌های خواهر و برادر استفاده کنید. به عنوان مثال، اگر ماژول :mod:`!sound.filters.vocoder` نیاز به استفاده از ماژول :mod:`!echo` در بسته :mod:`!sound.effects` داشته باشد، می تواند از ``from sound.effects import echo`` استفاده کند.

source: You can also write relative imports, with the ``from module import name`` form of import statement. These imports use leading dots to indicate the current and parent packages involved in the relative import. From the :mod:`!surround` module for example, you might use::
fa: شما همچنین می توانید واردات نسبی را با فرم بیانیه واردات ``from module import name`` بنویسید. این واردات از نقاط پیشرو برای نشان دادن بسته های فعلی و والد درگیر در واردات نسبی استفاده می کند. برای مثال از ماژول :mod:`!surround`، ممکن است از:

source: Note that relative imports are based on the name of the current module. Since the name of the main module is always ``"__main__"``, modules intended for use as the main module of a Python application must always use absolute imports.
fa: توجه داشته باشید که واردات نسبی بر اساس نام ماژول فعلی است. از آنجایی که نام ماژول اصلی همیشه ``"__main__"`` است، ماژول هایی که برای استفاده به عنوان ماژول اصلی برنامه پایتون در نظر گرفته شده اند باید همیشه از واردات مطلق استفاده کنند.

source: Packages in Multiple Directories
fa: بسته‌ها در فهرست‌های چندگانه

source: Packages support one more special attribute, :attr:`~module.__path__`. This is initialized to be a :term:`sequence` of strings containing the name of the directory holding the package's :file:`__init__.py` before the code in that file is executed. This variable can be modified; doing so affects future searches for modules and subpackages contained in the package.
fa: بسته ها از یک ویژگی خاص دیگر، :attr:`~module.__path__` پشتیبانی می کنند. این به صورت :term:`sequence` از رشته‌های حاوی نام دایرکتوری حاوی :file:`__init__.py` بسته اولیه قبل از اجرای کد موجود در آن فایل است. این متغیر قابل تغییر است. انجام این کار بر جستجوهای آینده برای ماژول ها و بسته های فرعی موجود در بسته تأثیر می گذارد.

source: While this feature is not often needed, it can be used to extend the set of modules found in a package.
fa: در حالی که این ویژگی اغلب مورد نیاز نیست، می توان از آن برای گسترش مجموعه ماژول های موجود در یک بسته استفاده کرد.

source: Footnotes
fa: پاورقی ها

source: In fact function definitions are also 'statements' that are 'executed'; the execution of a module-level function definition adds the function name to the module's global namespace.
fa: در واقع تعاریف تابع نیز «گزاره‌هایی» هستند که «اجرا می‌شوند». اجرای یک تعریف تابع در سطح ماژول، نام تابع را به فضای نام جهانی ماژول اضافه می کند.

source: module
fa: ماژول

source: search
fa: جستجو کنید

source: path
fa: مسیر

source: sys
fa: سیستم

source: builtins
fa: سازه ها
