Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/tutorial/stdlib.po
Languages: fa, pl, ru

source: Brief Tour of the Standard Library
fa: گشت مختصری از کتابخانه استاندارد
pl: Krótka wycieczka po Bibliotece Standardowej
ru: Краткий обзор стандартной библиотеки

source: Operating System Interface
fa: رابط سیستم عامل
pl: Interfejs Systemu Operacyjnego
ru: Интерфейс к операционной системе

source: The :mod:`os` module provides dozens of functions for interacting with the operating system::
fa: ماژول :mod:`os` ده ها عملکرد را برای تعامل با سیستم عامل ارائه می دهد:
pl: Moduł :mod:`os` udostępnia wiele funkcji do interakcji z systemem operacyjnym::
ru: Модуль :mod:`os` предоставляет десятки функций для взаимодействия с операционной системой::

source: >>> import os >>> os.getcwd() # Return the current working directory 'C:\\Python313' >>> os.chdir('/server/accesslogs') # Change current working directory >>> os.system('mkdir today') # Run the command mkdir in the system shell 0
pl: >>> import os >>> os.getcwd() # Zwróć aktualny folder roboczy 'C:\\Python313' >>> os.chdir('/server/accesslogs') # Zmień aktualny folder roboczy >>> os.system('mkdir today') # Uruchom komendę mkdir w powłoce 0

source: Be sure to use the ``import os`` style instead of ``from os import *``. This will keep :func:`os.open` from shadowing the built-in :func:`open` function which operates much differently.
fa: حتما از سبک ``import os`` به جای ``from os import *`` استفاده کنید. این امر باعث می‌شود که :func:`os.open` روی عملکرد داخلی :func:`open` که بسیار متفاوت عمل می‌کند سایه نزند.
pl: Upewnij się, że używasz stylu ``import os``, a nie ``from os import *``. W tym drugim przypadku funkcja :func:`os.open` przesłoni wbudowaną funkcję :func:`open`, która działa w skrajnie inny sposób.
ru: Импортируйте модуль как ``import os``, а не ``from os import *``, иначе функция :func:`os.open` переопределит встроенную функцию :func:`open`, а они работают по-разному.

source: The built-in :func:`dir` and :func:`help` functions are useful as interactive aids for working with large modules like :mod:`os`::
fa: توابع داخلی :func:`dir` و :func:`help` به عنوان کمک های تعاملی برای کار با ماژول های بزرگ مانند :mod:`os` مفید هستند:
pl: Wbudowane funkcje :func:`dir` i :func:`help`, są przydatne jako interaktywne pomoce do pracy z dużymi modułami, takimi jak :mod:`os`::
ru: Встроенные функции :func:`dir` и :func:`help` полезны при интерактивном взаимодействии с большими модулями, в том числе с :mod:`os`::

source: >>> import os >>> dir(os) <returns a list of all module functions> >>> help(os) <returns an extensive manual page created from the module's docstrings>
fa: >>> import OS >>> کارگردان <لیستی از تمام توابع ماژول را برمی گرداند> >>> کمک(ها) <صفحه دستی گسترده ای را که از رشته های اسناد ماژول ایجاد شده است برمی گرداند>
pl: >>> import os >>> dir(os) <zwraca listę wszystkich funkcji modułu> >>> help(os) <zwraca pełną instrukcję utworzoną z dokumentacji modułu>

source: For daily file and directory management tasks, the :mod:`shutil` module provides a higher level interface that is easier to use::
fa: برای کارهای روزانه مدیریت فایل و دایرکتوری، ماژول :mod:`shutil` رابط سطح بالاتری را ارائه می دهد که استفاده از آن آسان تر است:
pl: Do codziennego zarządzania plikami i katalogami, moduł :mod:`shutil` zapewnia interfejs wyższego poziomu, który jest łatwiejszy w użyciu::
ru: Модуль :mod:`shutils` предоставляет лёгкий в использовании высокоуровневый интерфейс для ежедневных задач управления файлами и папками::

source: File Wildcards
fa: فایل‌های عجایب
pl: Symbole wieloznaczne plików
ru: Шаблоны для имён файлов

source: The :mod:`glob` module provides a function for making file lists from directory wildcard searches::
fa: ماژول :mod:`glob` عملکردی را برای ایجاد لیست فایل ها از جستجوهای عام دایرکتوری ارائه می دهد:
pl: Moduł :mod:`glob` udostępnia funkcję do tworzenia list plików korzystając z wyszukiwania na symbolach wieloznacznych::
ru: Модуль :mod:`glob` предоставляет функцию для получения списка имён файлов по указанному шаблону::

source: Command Line Arguments
fa: آرگومان های خط فرمان
pl: Argumenty linii polecenia
ru: Аргументы командной строки

source: Common utility scripts often need to process command line arguments. These arguments are stored in the :mod:`sys` module's *argv* attribute as a list. For instance, let's take the following :file:`demo.py` file::
fa: اسکریپت های کاربردی رایج اغلب نیاز به پردازش آرگومان های خط فرمان دارند. این آرگومان ها در ویژگی *argv* ماژول :mod:`sys` به عنوان یک لیست ذخیره می شوند. به عنوان مثال، اجازه دهید فایل :file:`demo.py` زیر را در نظر بگیریم:
pl: Typowe skrypty narzędziowe często wymagają przetwarzania argumentów wiersza poleceń. Te argumenty są przechowywane w atrybucie *argv* modułu :mod:`sys` jako lista. Na przykład, weźmy następujący plik :file:`demo.py`::
ru: Обычные сценарии утилит часто требуют обработки аргументов командной строки. Эти аргументы хранятся в атрибуте *argv* модуля :mod:`sys` в виде списка. К примеру, рассмотрим следующий файл :file:`demo.py`::

source: # File demo.py import sys print(sys.argv)
pl: # Plik demo.py import sys print(sys.argv)

source: Here is the output from running ``python demo.py one two three`` at the command line::
fa: در اینجا خروجی اجرای ``python demo.py one two three`` در خط فرمان است:
pl: Oto wynik uruchomienia ``python demo.py one two three`` w wierszu poleceń::
ru: Вот результат выполнения ``python demo.py one two three`` в командной строке::

source: The :mod:`argparse` module provides a more sophisticated mechanism to process command line arguments. The following script extracts one or more filenames and an optional number of lines to be displayed::
fa: ماژول :mod:`argparse` مکانیزم پیچیده تری برای پردازش آرگومان های خط فرمان فراهم می کند. اسکریپت زیر یک یا چند نام فایل و تعداد اختیاری خطوط را برای نمایش استخراج می کند:
pl: Moduł :mod:`argparse` zapewnia bardziej wyrafinowane mechanizmy do przetwarzania argumentów wiersza poleceń. Poniższy skrypt wyodrębnia jedną lub więcej nazw plików i opcjonalną liczbę linii do wyświetlenia::
ru: Модуль :mod:`argparse` предоставляет более утончённый механизм обработки аргументов командной строки. Следующий скрипт получает одно или более имя файла и необязательное количество строк, которые нужно вывести::

source: import argparse parser = argparse.ArgumentParser( prog='top', description='Show top lines from each file') parser.add_argument('filenames', nargs='+') parser.add_argument('-l', '--lines', type=int, default=10) args = parser.parse_args() print(args)
pl: import argparse parser = argparse.ArgumentParser( prog='top', description='Wypisz początkowe linie każdego z plików') parser.add_argument('filenames', nargs='+') parser.add_argument('-l', '--lines', type=int, default=10) args = parser.parse_args() print(args)

source: When run at the command line with ``python top.py --lines=5 alpha.txt beta.txt``, the script sets ``args.lines`` to ``5`` and ``args.filenames`` to ``['alpha.txt', 'beta.txt']``.
fa: هنگامی که در خط فرمان با ``python top.py --lines=5 alpha.txt beta.txt`` اجرا می شود، اسکریپت ``args.lines`` را به ``5`` و ``args.filenames`` را به ``['alpha.txt', 'beta.txt']`` تنظیم می کند.
pl: Po uruchomieniu w wierszu poleceń ``python top.py --lines=5 alpha.txt beta.txt``, skrypt ustawia ``args.lines`` na ``5`` i ``args.filenames`` na ``['alpha.txt', 'beta.txt']``.
ru: При запуске из командной строки как ``python top.py --lines=5 alpha.txt beta.txt`` скрипт установит ``args.lines`` в 5, а ``args.filenames`` в ``['alpha.txt', 'beta.txt']``.

source: Error Output Redirection and Program Termination
fa: خطا در تغییر مسیر خروجی و خاتمه برنامه
pl: Przekierowanie wyjścia błędu i zakończenie programu
ru: Перенаправление вывода ошибок и завершение программы

source: The :mod:`sys` module also has attributes for *stdin*, *stdout*, and *stderr*. The latter is useful for emitting warnings and error messages to make them visible even when *stdout* has been redirected::
fa: ماژول :mod:`sys` همچنین دارای ویژگی هایی برای *stdin*، *stdout* و *stderr* است. مورد دوم برای ارسال اخطارها و پیام های خطا مفید است تا آنها را حتی زمانی که *stdout* هدایت شده است قابل مشاهده کند:
pl: Moduł :mod:`sys` ma również atrybuty dla *stdin*, *stdout* i *stderr* (standardowe wejście, standardowe wyjście i standardowe wyjście błędu). To ostatnie jest przydatne do emitowania ostrzeżeń i komunikatów o błędach, aby były widoczne nawet wtedy, gdy *stdout* został przekierowany::
ru: Модуль :mod:`sys` содержит аттрибуты *stdin*, *stdout* и *stderr*. Последний полезен для печати предупреждений и сообщений об ошибках, чтобы показать их даже в тех случаях, когда *stdout* был перенаправлен::

source: >>> sys.stderr.write('Warning, log file not found starting a new one\n') Warning, log file not found starting a new one
fa: >>> sys.stderr.write('هشدار, فایل لاگ پیدا نشد و یک فایل جدید شروع می شود\n') اخطار، فایل log با شروع یک فایل جدید پیدا نشد
pl: >>> sys.stderr.write('Ostrzeżenie, nie odnaleziono pliku rejestru, tworzę nowy plik\n') Ostrzeżenie, nie odnaleziono pliku rejestru, tworzę nowy plik

source: The most direct way to terminate a script is to use ``sys.exit()``.
fa: مستقیم ترین راه برای پایان دادن به یک اسکریپت استفاده از ``sys.exit()`` است.
pl: Najbardziej bezpośrednim sposobem na zakończenie skryptu jest użycie ``sys.exit()``.
ru: Самый простой способ завершить программу -- вызвать ``sys.exit()``.

source: String Pattern Matching
fa: تطبیق الگوی رشته
pl: Dopasowywanie wzorców w napisach
ru: Сравнение строки с шаблоном

source: The :mod:`re` module provides regular expression tools for advanced string processing. For complex matching and manipulation, regular expressions offer succinct, optimized solutions::
fa: ماژول :mod:`re` ابزارهای بیان منظم را برای پردازش رشته های پیشرفته فراهم می کند. برای تطبیق و دستکاری پیچیده، عبارات منظم راه حل های مختصر و بهینه ارائه می دهند:
pl: Moduł :mod:`re` zapewnia narzędzia wyrażeń regularnych do zaawansowanego przetwarzania napisów. W przypadku złożonych operacji dopasowywania i manipulacji na ciągach znaków, wyrażenia regularne pozwalają na zwięzłe, zoptymalizowane rozwiązania::
ru: Модуль :mod:`re` предоставляет инструменты для работы с регулярными выражениями для продвинутой обработки строк. Регулярные выражения предоставляют краткие, оптимизированные решения для сложных манипуляций с текстом::

source: >>> import re >>> re.findall(r'\bf[a-z]*', 'which foot or hand fell fastest') ['foot', 'fell', 'fastest'] >>> re.sub(r'(\b[a-z]+) \1', r'\1', 'cat in the the hat') 'cat in the hat'
pl: >>> import re >>> re.findall(r'\bf[a-z]*', 'która stopa lub ręka upadła najszybciej') ['stopa', 'upadła', 'najszybciej'] >>> re.sub(r'(\b[a-z]+) \1', r'\1', 'kot w kapeluszu') 'kot w kapeluszu'

source: When only simple capabilities are needed, string methods are preferred because they are easier to read and debug::
fa: هنگامی که فقط به قابلیت های ساده نیاز است، روش های رشته ای ترجیح داده می شوند زیرا خواندن و اشکال زدایی آنها آسان تر است::
pl: Gdy potrzebne są tylko proste funkcje, preferowane są funkcje standardowe napisów, ponieważ są łatwiejsze do odczytania i debugowania::
ru: Если вам нужны только простые действия, методвы строк предпочтительней, потому что их проще читать и отлаживать::

source: >>> 'tea for too'.replace('too', 'two') 'tea for two'
pl: >>> 'herbata dla dwa'.replace('dwa', 'dwojga') 'herbata dla dwojga'

source: Mathematics
fa: ریاضیات
pl: Funkcje matematyczne
ru: Математика

source: The :mod:`math` module gives access to the underlying C library functions for floating-point math::
fa: ماژول :mod:`math` به توابع کتابخانه زیرین C برای ریاضیات ممیز شناور دسترسی می دهد:
pl: Moduł :mod:`math` zapewnia dostęp do funkcji bazujących na standardzie języka C dla obliczeń zmiennoprzecinkowych::

source: The :mod:`random` module provides tools for making random selections::
fa: ماژول :mod:`random` ابزارهایی را برای انتخاب تصادفی فراهم می کند:
pl: Moduł :mod:`random` dostarcza narzędzi do dokonywania wyborów losowych::
ru: Модуль :mod:`random` предоставляет инструменты для создания случайных выборок::

source: >>> import random >>> random.choice(['apple', 'pear', 'banana']) 'apple' >>> random.sample(range(100), 10) # sampling without replacement [30, 83, 16, 4, 8, 81, 41, 50, 18, 33] >>> random.random() # random float from the interval [0.0, 1.0) 0.17970987693706186 >>> random.randrange(6) # random integer chosen from range(6) 4
pl: >>> import random >>> random.choice(['jabłko', 'gruszka', 'banan']) 'jabłko' >>> random.sample(range(100), 10) # próbkowanie bez zwracania [30, 83, 16, 4, 8, 81, 41, 50, 18, 33] >>> random.random() # losowa liczba zmiennoprzecinkowa z przedziału [0.0, 1.0) 0.17970987693706186 >>> random.randrange(6) # losowa liczba całkowita wybrana z range(6) 4

source: The :mod:`statistics` module calculates basic statistical properties (the mean, median, variance, etc.) of numeric data::
fa: ماژول :mod:`statistics` ویژگی های آماری پایه (میانگین, میانه, واریانس و غیره) داده های عددی را محاسبه می کند:
pl: Moduł :mod:`statistics` oblicza podstawowe wskaźniki statystyczne (średnią, medianę, wariancję itp.) z danych liczbowych::
ru: Модуль :mod:`statistics: позволяет вычислять базовые статистические величины (среднее, медиану, стандартное отколнение и т. п.) для числовых данных::

source: >>> import statistics >>> data = [2.75, 1.75, 1.25, 0.25, 0.5, 1.25, 3.5] >>> statistics.mean(data) 1.6071428571428572 >>> statistics.median(data) 1.25 >>> statistics.variance(data) 1.3720238095238095
pl: >>> import statistics >>> dane = [2.75, 1.75, 1.25, 0.25, 0.5, 1.25, 3.5] >>> statistics.mean(dane) 1.6071428571428572 >>> statistics.median(dane) 1.25 >>> statistics.variance(dane) 1.3720238095238095

source: The SciPy project <https://scipy.org> has many other modules for numerical computations.
fa: پروژه SciPy <https://scipy.org> دارای بسیاری از ماژول های دیگر برای محاسبات عددی است.
pl: Projekt SciPy <https://scipy.org> posiada wiele innych modułów służących do obliczeń numerycznych.
ru: Проект SciPy <https://scipy.org> содержит большое количество других модулей для численных вычислений.

source: Internet Access
fa: دسترسی به اینترنت
pl: Dostęp do internetu
ru: Доступ в интернет

source: There are a number of modules for accessing the internet and processing internet protocols. Two of the simplest are :mod:`urllib.request` for retrieving data from URLs and :mod:`smtplib` for sending mail::
fa: تعدادی ماژول برای دسترسی به اینترنت و پردازش پروتکل های اینترنتی وجود دارد. دو مورد از ساده ترین آنها :mod:`urllib.request` برای بازیابی داده ها از URL ها و :mod:`smtplib` برای ارسال نامه هستند:
pl: Istnieje wiele modułów umożliwiających dostęp do Internetu i przetwarzanie protokołów internetowych. Dwa z najprostszych to :mod:`urllib.request` do pobierania danych z adresów URL i :mod:`smtplib` do wysyłania poczty::
ru: Есть несколько модулей, предназначенных для доступа в интернет и работы с его протоколами. Два самых простых модуля -- :mod:`urllib.request` для получения данных по URL и :mod:`smtplib` для отправки электронной почты::

source: >>> from urllib.request import urlopen >>> with urlopen('http://worldtimeapi.org/api/timezone/etc/UTC.txt') as response: ... for line in response: ... line = line.decode() # Convert bytes to a str ... if line.startswith('datetime'): ... print(line.rstrip()) # Remove trailing newline ... datetime: 2022-01-01T01:36:47.689215+00:00 >>> import smtplib >>> server = smtplib.SMTP('localhost') >>> server.sendmail('soothsayer@example.org', 'jcaesar@example.org', ... """To: jcaesar@example.org ... From: soothsayer@example.org ... ... Beware the Ides of March. ... """) >>> server.quit()
fa: >>> از urllib.request import urlopen >>> با urlopen('http://worldtimeapi.org/api/timezone/etc/UTC.txt') به عنوان پاسخ: ... برای خط در پاسخ: ... line = line.decode() # تبدیل بایت ها به str ... if line.startswith('datetime'): ... print(line.rstrip()) # حذف آخرین خط جدید ... تاریخ: 2022-01-01T01:36:47.689215+00:00 >>> وارد کردن smtplib >>> سرور = smtplib.SMTP('localhost') >>> server.sendmail('soothsayer@example.org', 'jcaesar@example.org', ... """به: jcaesar@example.org ... از: soothsayer@example.org ... ... مراقب ایدهای ماه مارس باشید. ... """) >>> server.quit()
pl: >>> from urllib.request import urlopen >>> with urlopen('http://worldtimeapi.org/api/timezone/etc/UTC.txt') as response: ... for line in response: ... line = line.decode() # Konwersja bajtów na str ... if line.startswith('datetime'): ... print(line.rstrip()) # Usunięcie końcowego znaku nowej linii ... datetime: 2022-01-01T01:36:47.689215+00:00 >>> import smtplib >>> server = smtplib.SMTP('localhost') >>> server.sendmail('przepowiadacz@example.org', 'jcezar@example.org', ... """To: jcezar@example.org ... From: przepowiadacz@example.org ... ... Strzeż się Idów Marcowych. ... """) >>> server.quit()

source: (Note that the second example needs a mailserver running on localhost.)
fa: (توجه داشته باشید که مثال دوم نیاز به یک میل سرور دارد که روی لوکال هاست اجرا می شود.)
pl: (Zauważ, że drugi przykład wymaga serwera pocztowego działającego lokalnie pod adresem `localhost`).
ru: (Заметьте, что для второго примера на ``localhost`` должен быть запущен почтовый сервер.)

source: Dates and Times
pl: Daty i czas
ru: Дата и время

source: The :mod:`datetime` module supplies classes for manipulating dates and times in both simple and complex ways. While date and time arithmetic is supported, the focus of the implementation is on efficient member extraction for output formatting and manipulation. The module also supports objects that are timezone aware. ::
fa: ماژول :mod:`datetime` کلاس هایی را برای دستکاری تاریخ ها و زمان ها به دو روش ساده و پیچیده فراهم می کند. در حالی که محاسبات تاریخ و زمان پشتیبانی می شود، تمرکز پیاده سازی بر استخراج کارآمد اعضا برای قالب بندی و دستکاری خروجی است. این ماژول همچنین از اشیایی که از منطقه زمانی آگاه هستند پشتیبانی می کند. ::
pl: Moduł :mod:`datetime` dostarcza klasy do manipulowania datami i godzinami zarówno w prosty, jak i złożony sposób. Podczas gdy obsługiwana jest arytmetyka daty i czasu, implementacja koncentruje się na wydajnym wyodrębnianiu danych w celu formatowania i manipulacji. Moduł obsługuje również obiekty uwzględniające strefę czasową ::
ru: Модуль :mod:`datetime` предоставляет классы для манипуляции датой и временем простыми и сложными способами. Арифметика с датами и временем поддерживается, но модуль уделяет больше внимания эффективному доступу к полям для форматирования и манипуляций. Модуль также поддерживает объекты с информацией о временных зонах. ::

source: >>> # dates are easily constructed and formatted >>> from datetime import date >>> now = date.today() >>> now datetime.date(2003, 12, 2) >>> now.strftime("%m-%d-%y. %d %b %Y is a %A on the %d day of %B.") '12-02-03. 02 Dec 2003 is a Tuesday on the 02 day of December.' >>> # dates support calendar arithmetic >>> birthday = date(1964, 7, 31) >>> age = now - birthday >>> age.days 14368
pl: >>> # daty są łatwo konstruowane i formatowane >>> from datetime import date >>> teraz = date.today() >>> teraz datetime.date(2024, 11, 25) >>> teraz.strftime("%m-%d-%y. %d %b %Y jest %A w %d dniu %B.") '11-25-24. 25 Listopada 2024 to Poniedziałek dnia 25 Listopada . >>> # daty obsługują arytmetykę kalendarza >>> urodziny = date(1964, 7, 31) >>> wiek = teraz - birthday >>> wiek.days 14368

source: Data Compression
fa: فشرده سازی داده ها
pl: Kompresja Danych
ru: Сжатие данных

source: Common data archiving and compression formats are directly supported by modules including: :mod:`zlib`, :mod:`gzip`, :mod:`bz2`, :mod:`lzma`, :mod:`zipfile` and :mod:`tarfile`. ::
fa: فرمت‌های رایج بایگانی و فشرده‌سازی داده‌ها مستقیماً توسط ماژول‌هایی از جمله: :mod:`zlib`، :mod:`gzip`، :mod:`bz2`، :mod:`lzma`، :mod:`zipfile` و :mod:`tarfile` پشتیبانی می‌شوند. ::
pl: Popularne formaty archiwizacji i kompresji danych są bezpośrednio obsługiwane przez moduły, w tym: :mod:`zlib`, :mod:`gzip`, :mod:`bz2`, :mod:`lzma`, :mod:`zipfile` i :mod:`tarfile`:
ru: Популярные форматы архивирования и сжатия напрямую поддерживаются в стандартной библиотеке, в том числе в модулях :mod:`zlib`, :mod:`gzip`, :mod:`bz2`, :mod:`lzma`, :mod:`zipfile` и :mod:`tarfile`. ::

source: >>> import zlib >>> s = b'witch which has which witches wrist watch' >>> len(s) 41 >>> t = zlib.compress(s) >>> len(t) 37 >>> zlib.decompress(t) b'witch which has which witches wrist watch' >>> zlib.crc32(s) 226805979
pl: >>> import zlib >>> s = b'ktora czarownica ma zegarek na nadgarstku czarownicy' >>> len(s) 52 >>> t = zlib.compress(s) >>> len(t) 49 >>> zlib.decompress(t) b'która czarownica ma zegarek na nadgarstku czarownicy' >>> zlib.crc32(s) 2301872819

source: Performance Measurement
fa: اندازه گیری عملکرد
pl: Mierzenie wydajności
ru: Измерение производительности

source: Some Python users develop a deep interest in knowing the relative performance of different approaches to the same problem. Python provides a measurement tool that answers those questions immediately.
fa: برخی از کاربران پایتون علاقه عمیقی به دانستن عملکرد نسبی رویکردهای مختلف برای یک مشکل دارند. پایتون یک ابزار اندازه گیری ارائه می دهد که بلافاصله به این سوالات پاسخ می دهد.
pl: Niektórzy użytkownicy Python są głęboko zainteresowani poznaniem względnej wydajności różnych podejść do tego samego problemu. Python zapewnia narzędzie pomiarowe, które natychmiast odpowiada na te pytania.
ru: Некоторым разработчикам весьма интересно, какой из подходов к решению задачи выигрывает по производительности. Python предоставляет инструмент для удовлетворения такого любопытства.

source: For example, it may be tempting to use the tuple packing and unpacking feature instead of the traditional approach to swapping arguments. The :mod:`timeit` module quickly demonstrates a modest performance advantage::
fa: به عنوان مثال، ممکن است استفاده از ویژگی بسته بندی و باز کردن بسته بندی به جای رویکرد سنتی برای تعویض آرگومان ها وسوسه انگیز باشد. ماژول :mod:`timeit` به سرعت یک مزیت عملکرد متوسط ​​را نشان می دهد:
pl: Na przykład kuszące może być użycie funkcji pakowania i rozpakowywania krotka zamiast tradycyjnego podejścia do zamiany argument. Moduł :mod:`timeit` szybko pokazuje skromną przewagę wydajności::
ru: Например, может быть заманчивым использовать распаковку и упаковку кортежей вместо традиционного подхода к обмену значений между переменными. Модуль :mod:`timeit` быстро показывает скромное преимущество в производительности::

source: In contrast to :mod:`timeit`'s fine level of granularity, the :mod:`profile` and :mod:`pstats` modules provide tools for identifying time critical sections in larger blocks of code.
fa: برخلاف سطح دقیق دانه‌بندی :mod:`timeit`، ماژول‌های :mod:`profile` و :mod:`pstats` ابزارهایی را برای شناسایی بخش‌های حساس زمانی در بلوک‌های بزرگ‌تر کد ارائه می‌کنند.
pl: W przeciwieństwie do dokładnego poziomu szczegółowości :mod:`timeit`, moduły :mod:`profile` i :mod:`pstats` zapewniają narzędzia do identyfikacji sekcji krytycznych czasowo w większych blok kodu.
ru: В отличие от высокого уровня точности :mod:`timeit`, модули :mod:`profile` и :mod:`pstats` предоставляют инструменты для нахождения самых времязатратных участков в более крупных блоках кода.

source: Quality Control
fa: کنترل کیفیت
pl: Kontrola jakości
ru: Контроль качества

source: One approach for developing high quality software is to write tests for each function as it is developed and to run those tests frequently during the development process.
fa: یکی از روش‌های توسعه نرم‌افزار با کیفیت بالا، نوشتن تست‌ها برای هر عملکرد در حین توسعه و اجرای مکرر آن تست‌ها در طول فرآیند توسعه است.
pl: Jednym z podejść do tworzenia wysokiej jakości oprogramowania jest pisanie testów dla każdej funkcj w trakcie jego tworzenia i częste uruchamianie tych testów podczas rozwoju.
ru: Один из подходов к разработке программного обеспечения высокого качества -- писать тесты во время написания каждой функции и регулярно запускать их в процессе разработки.
