Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/tutorial/stdlib.po
Languages: fa, pl, ru

source: The :mod:`doctest` module provides a tool for scanning a module and validating tests embedded in a program's docstrings. Test construction is as simple as cutting-and-pasting a typical call along with its results into the docstring. This improves the documentation by providing the user with an example and it allows the doctest module to make sure the code remains true to the documentation::
fa: ماژول :mod:`doctest` ابزاری را برای اسکن یک ماژول و اعتبارسنجی تست‌های تعبیه‌شده در رشته‌های اسناد برنامه فراهم می‌کند. ساخت تست به سادگی برش و چسباندن یک تماس معمولی همراه با نتایج آن در رشته مستندسازی است. این با ارائه یک مثال به کاربر، مستندات را بهبود می‌بخشد و به ماژول doctest اجازه می‌دهد تا مطمئن شود که کد به مستندات صادق است::
pl: Moduł :mod:`doctest` zapewnia narzędzie do skanowania strony moduł i sprawdzania poprawności testów osadzonych w dokumentacji programu. Konstrukcja testu jest tak prosta, jak wycięcie i wklejenie typowego wywołania wraz z jego wynikami do docstring. Poprawia to dokumentację poprzez dostarczenie użytkownikowi przykładu i pozwala doctestowi moduł upewnić się, że kod pozostaje prawda zgodny z dokumentacją::
ru: Модуль :mod:`doctest` предоставляет инструмент для анализа модуля и валидации тестов, встроенных в строки документации программы. Создать тест просто: скопируйте и вставьте типичный пример вызова функции или класса и его результат. Это улучшает документацию, показывая пользователю кода пример того, как использовать сущность, и позволяет модулю :mod:`doctest` убедиться, что код работает в соответствии с документацией::

source: def average(values): """Computes the arithmetic mean of a list of numbers. >>> print(average([20, 30, 70])) 40.0 """ return sum(values) / len(values) import doctest doctest.testmod() # automatically validate the embedded tests
pl: def średnia(values): """Oblicza średnią arytmetyczną listy liczb. >>> print(średnia([20, 30, 70])) 40.0 """ return sum(values) / len(values) import doctest doctest.testmod() # automatycznie waliduje wbudowane testy

source: The :mod:`unittest` module is not as effortless as the :mod:`doctest` module, but it allows a more comprehensive set of tests to be maintained in a separate file::
fa: ماژول :mod:`unittest` به آسانی ماژول :mod:`doctest` نیست، اما اجازه می دهد مجموعه جامع تری از تست ها در یک فایل جداگانه نگهداری شود:
pl: Moduł :mod:`unittest` nie jest tak łatwy w użytku jak moduł :mod:`doctest` , ale pozwala na przechowywanie bardziej kompleksowego zestawu testów w osobnym pliku::
ru: Модуль :mod:`unittest` не так просто в использовании, как :mod:`doctest`, но позволяет поддерживать более полный набор тестов в отдельном файле::

source: import unittest class TestStatisticalFunctions(unittest.TestCase): def test_average(self): self.assertEqual(average([20, 30, 70]), 40.0) self.assertEqual(round(average([1, 5, 7]), 1), 4.3) with self.assertRaises(ZeroDivisionError): average([]) with self.assertRaises(TypeError): average(20, 30, 70) unittest.main() # Calling from the command line invokes all tests
pl: import unittest class TestFunkcjiStatystycznych(unittest.TestCase): def test_srednia(self): self.assertEqual(srednia([20, 30, 70]), 40.0) self.assertEqual(round(srednia([1, 5, 7]), 1), 4.3) with self.assertRaises(ZeroDivisionError): srednia([]) with self.assertRaises(TypeError): srednia(20, 30, 70) unittest.main() # Wywołanie z wiersza poleceń uruchamia wszystkie testy

source: Batteries Included
fa: باتری های گنجانده شده است
pl: Dostarczone z bateriami
ru: Батарейки прилагаются

source: Python has a "batteries included" philosophy. This is best seen through the sophisticated and robust capabilities of its larger packages. For example:
fa: پایتون یک فلسفه "شامل باتری" دارد. این به خوبی از طریق قابلیت های پیچیده و قوی بسته های بزرگتر آن قابل مشاهده است. به عنوان مثال:
pl: Python trzyma się filozofii "dostarczone z bateriami". Można to najłatwiej ujrzeć w zaawansowanych możliwościach jego większych pakietów. Dla przykładu:
ru: Python придерживается философии "батарейки включены в комплект" ("batteries included"). Это можно заметить по нетривиальным и крепким возможностям, которые предоставляет его стандартная библиотека. Например::

source: The :mod:`xmlrpc.client` and :mod:`xmlrpc.server` modules make implementing remote procedure calls into an almost trivial task. Despite the modules' names, no direct knowledge or handling of XML is needed.
fa: ماژول‌های :mod:`xmlrpc.client` و :mod:`xmlrpc.server` اجرای فراخوانی‌های رویه از راه دور را به یک کار تقریباً بی‌اهمیت تبدیل می‌کنند. با وجود نام ماژول ها، هیچ دانش یا مدیریت مستقیم XML مورد نیاز نیست.
pl: Moduły :mod:`xmlrpc.client` i :mod:`xmlrpc.server` sprawiają, że implementacja zdalnych wywołań procedur staje się niemal trywialnym zadaniem. Pomimo nazw moduł', nie jest wymagana bezpośrednia znajomość lub obsługa XML.
ru: Модули :mod:`xmlrpc.client` и :mod:`xmlrpc.server` делают реализацию удалённого вызова процедур почти тривиальной задачей. Несмотря на имя модулей, не требуется прямого знания или обработки XML.

source: The :mod:`email` package is a library for managing email messages, including MIME and other :rfc:`2822`-based message documents. Unlike :mod:`smtplib` and :mod:`poplib` which actually send and receive messages, the email package has a complete toolset for building or decoding complex message structures (including attachments) and for implementing internet encoding and header protocols.
fa: بسته :mod:`email` کتابخانه ای برای مدیریت پیام های ایمیل، از جمله MIME و سایر اسناد پیام مبتنی بر :rfc:`2822` است. برخلاف :mod:`smtplib` و :mod:`poplib` که در واقع پیام‌ها را ارسال و دریافت می‌کنند، بسته ایمیل دارای یک مجموعه ابزار کامل برای ساخت یا رمزگشایی ساختارهای پیام پیچیده (از جمله پیوست‌ها) و برای اجرای کدگذاری اینترنتی و پروتکل‌های هدر است.
pl: Pakiet :mod:`email` jest biblioteką do zarządzania wiadomościami e-mail, w tym MIME i innymi dokumentami wiadomości opartymi na :rfc:`2822`. W przeciwieństwie do :mod:`smtplib` i :mod:`poplib`, które faktycznie wysyłają i odbierają wiadomości, pakiet e-mail posiada kompletny zestaw narzędzi do tworzenia lub dekodowania złożonych struktur wiadomości (w tym załączników) oraz do implementacji internetowych protokołów kodowania i nagłówków.
ru: Пакет :mod:`email` -- библиотека для управления сообщениями электронной почты, включая MIME и другие документы сообщений, основанные на :rfc:`2822`. В отличие от модулей :mod:`smtplib` и :mod:`poplib`, которые предназначены именно для отправки и получения сообщений, в пакете *email* содержится набор инструментов для создания и анализа сообщений со сложной структурой (например сообщений с вложениями) и и имплементации протоколов кодировки и заголовков.

source: The :mod:`json` package provides robust support for parsing this popular data interchange format. The :mod:`csv` module supports direct reading and writing of files in Comma-Separated Value format, commonly supported by databases and spreadsheets. XML processing is supported by the :mod:`xml.etree.ElementTree`, :mod:`xml.dom` and :mod:`xml.sax` packages. Together, these modules and packages greatly simplify data interchange between Python applications and other tools.
fa: بسته :mod:`json` پشتیبانی قوی برای تجزیه این فرمت تبادل داده محبوب فراهم می کند. ماژول :mod:`csv` از خواندن و نوشتن مستقیم فایل ها با فرمت مقدار جدا شده با کاما پشتیبانی می کند که معمولاً توسط پایگاه های داده و صفحات گسترده پشتیبانی می شود. پردازش XML توسط بسته های :mod:`xml.etree.ElementTree`، :mod:`xml.dom` و :mod:`xml.sax` پشتیبانی می شود. این ماژول‌ها و بسته‌ها با هم تبادل داده‌ها را بین برنامه‌های پایتون و ابزارهای دیگر بسیار ساده می‌کنند.
pl: Pakiet :mod:`json` zapewnia solidne wsparcie dla analizowania tego popularnego formatu wymiany danych. Pakiet :mod:`csv` moduł obsługuje bezpośredni odczyt i zapis plików w formacie Comma-Separated Value (.csv), powszechnie obsługiwanym przez bazy danych i arkusze kalkulacyjne. Przetwarzanie XML jest obsługiwane przez pakiety :mod:`xml.etree.ElementTree`, :mod:`xml.dom` i :mod:`xml.sax`. Razem te moduły i pakiety znacznie upraszczają wymianę danych między Python aplikacja i innymi narzędziami.
ru: Пакет :mod:`json` предоставляет поддержку сериализации и десериализации данных в этом популярном формате. Модуль :mod:`csv` поддерживает прямые чтение и запись файлов в формате CSV (Comma-Separated Value), который часто поддерживают базы данных и электронные таблицы. Обработка XML осуществляется пакетами :mod:`xml.etree.ElementTree`, :mod:`xml.dom` и :mod:`xml.sax`. В совокупности все эти модули и пакеты значительно упрощают обмен данными между приложениями, написанными на Python, и другими инструментами.

source: The :mod:`sqlite3` module is a wrapper for the SQLite database library, providing a persistent database that can be updated and accessed using slightly nonstandard SQL syntax.
fa: ماژول :mod:`sqlite3` پوششی برای کتابخانه پایگاه داده SQLite است که یک پایگاه داده پایدار را ارائه می دهد که می تواند با استفاده از نحو کمی غیر استاندارد SQL به روز شود و به آن دسترسی داشت.
pl: Moduł :mod:`sqlite3` jest opakowaniem dla biblioteki bazy danych SQLite, zapewniając trwałą bazę danych, która może być aktualizowana i dostępna przy użyciu nieco niestandardowej składni SQL.
ru: Модуль :mod:`sqlite3` -- обёртка над библиотекой для работы с базами данных SQLite. Она предоставляет сохраняемую базу данных, с которой можно взаимодействовать, используя немного нестандартный вариант языка SQL.

source: Internationalization is supported by a number of modules including :mod:`gettext`, :mod:`locale`, and the :mod:`codecs` package.
fa: بین المللی سازی توسط تعدادی ماژول از جمله :mod:`gettext`، :mod:`locale` و بسته :mod:`codecs` پشتیبانی می شود.
pl: Internacjonalizacja jest wspierana przez kilka moduł, w tym :mod:`gettext`, :mod:`locale` i :mod:`codecs`.
ru: Интернационализация поддерживается несколькими модулями, включая :mod:`gettext`, :mod:`locale` и пакетом :mod:`codecs`.

source: built-in function
fa: عملکرد داخلی
pl: funkcja wbudowana
ru: встроенная функция

source: help
fa: کمک کند
pl: pomoc
ru: помощь

source: The :mod:`math` module gives access to the underlying C library functions for floating point math::
ru: Модуль :mod:`math` даёт доступ к функциям библиотеки C, работающим с числами с плавающей точкой::
