Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/tutorial/venv.po
Languages: fa, ru

source: Virtual Environments and Packages
fa: بسته ها و محیط های مجازی
ru: Виртуальное окружение и пакеты

source: Introduction
fa: مقدمه
ru: Введение

source: Python applications will often use packages and modules that don't come as part of the standard library. Applications will sometimes need a specific version of a library, because the application may require that a particular bug has been fixed or the application may be written using an obsolete version of the library's interface.
fa: برنامه های کاربردی پایتون اغلب از بسته ها و ماژول هایی استفاده می کنند که به عنوان بخشی از کتابخانه استاندارد نیستند. برنامه‌ها گاهی به نسخه خاصی از کتابخانه نیاز دارند، زیرا ممکن است برنامه نیاز به رفع اشکال خاصی داشته باشد یا ممکن است برنامه با استفاده از نسخه منسوخ شده رابط کتابخانه نوشته شود.
ru: Приложения Python часто используют пакеты и модули, не входящие в стандартную библиотеку. Иногда приложению необходима конкретная версия библиотеки, в которой устранена определенная ошибка, или же приложение написано с помощью устаревшей версии библиотечного интерфейса.

source: This means it may not be possible for one Python installation to meet the requirements of every application. If application A needs version 1.0 of a particular module but application B needs version 2.0, then the requirements are in conflict and installing either version 1.0 or 2.0 will leave one application unable to run.
fa: این بدان معناست که ممکن است یک نصب پایتون نتواند الزامات هر برنامه را برآورده کند. اگر برنامه A به نسخه 1.0 یک ماژول خاص نیاز دارد اما برنامه B به نسخه 2.0 نیاز دارد، الزامات در تضاد هستند و نصب نسخه 1.0 یا 2.0 باعث می شود که یک برنامه قادر به اجرا نباشد.
ru: Это означает, что конкретная установка Python может быть непригодной одновременно для двух или более приложений. Например, приложению А нужна версия 1.0 конкретного модуля, а приложению B нужна версия 2.0. Эти требования противоречат друг другу, и установка либо версии 1.0 либо 2.0 не годится одновременно для обоих приложений .

source: The solution for this problem is to create a :term:`virtual environment`, a self-contained directory tree that contains a Python installation for a particular version of Python, plus a number of additional packages.
fa: راه حل این مشکل ایجاد یک :term:`virtual environment` است، یک درخت دایرکتوری مستقل که شامل نصب پایتون برای یک نسخه خاص از پایتون، به علاوه تعدادی بسته اضافی است.
ru: Для разрешения конфликта создается :term:`виртуальное окружение` (:term:`virtual environment`), автономное дерево директорий, содержащее установку нужной версии Python, а также ряд дополнительных пакетов.

source: Different applications can then use different virtual environments. To resolve the earlier example of conflicting requirements, application A can have its own virtual environment with version 1.0 installed while application B has another virtual environment with version 2.0. If application B requires a library be upgraded to version 3.0, this will not affect application A's environment.
fa: سپس برنامه های مختلف می توانند از محیط های مجازی مختلف استفاده کنند. برای حل مثال قبلی از الزامات متناقض، برنامه A می تواند محیط مجازی خود را با نسخه 1.0 نصب شده داشته باشد در حالی که برنامه B دارای محیط مجازی دیگری با نسخه 2.0 است. اگر برنامه B نیاز به ارتقاء کتابخانه به نسخه 3.0 داشته باشد، این روی محیط برنامه A تأثیری نخواهد داشت.
ru: Разные приложения используют разные виртуальные окружения. В приведенном примере приложение А может использовать созданное для него виртуальное окружение с версией 1.0 нужного модуля, а приложение В исполняться в другом виртуальном окружении с версией 2.0 того же модуля. Если позднее приложению В потребуется обновить библиотеку до версии 3.0, то это никак не повлияет на виртуальное окружение приложения А.

source: Creating Virtual Environments
fa: ایجاد محیط های مجازی
ru: Создание виртуального окружения

source: The module used to create and manage virtual environments is called :mod:`venv`. :mod:`venv` will usually install the most recent version of Python that you have available. If you have multiple versions of Python on your system, you can select a specific Python version by running ``python3`` or whichever version you want.
ru: Для создания и управления виртуальными окружениями используется модуль :mod:’venv’. По умолчанию :mod:’venv’ устанавливает самую последнюю доступную версию Python. Если в вашей системе есть несколько версий Python, то можно выбрать конкретную версию Python, запустив, например, ``python3``.

source: To create a virtual environment, decide upon a directory where you want to place it, and run the :mod:`venv` module as a script with the directory path::
fa: برای ایجاد یک محیط مجازی، دایرکتوری را که می‌خواهید در آن قرار دهید، انتخاب کنید و ماژول :mod:`venv` را به عنوان یک اسکریپت با مسیر دایرکتوری اجرا کنید:
ru: Чтобы создать виртуальное окружение, определитесь с каталогом, в котором вы хотите разместить его, и запустите модуль :mod:’venv в виде сценария с указание пути к этому каталогу::

source: This will create the ``tutorial-env`` directory if it doesn't exist, and also create directories inside it containing a copy of the Python interpreter and various supporting files.
ru: Это создаст каталог ``tutorial-env``, если его не существует, а также создаст внутри него каталоги, содержащие копию интерпретатора Python и различные вспомогательные файлы.

source: A common directory location for a virtual environment is ``.venv``. This name keeps the directory typically hidden in your shell and thus out of the way while giving it a name that explains why the directory exists. It also prevents clashing with ``.env`` environment variable definition files that some tooling supports.
fa: یک مکان دایرکتوری رایج برای یک محیط مجازی ``.venv`` است. این نام، دایرکتوری را معمولاً در پوسته شما پنهان نگه می‌دارد و در نتیجه نامی به آن می‌دهد که دلیل وجود دایرکتوری را توضیح می‌دهد. همچنین از برخورد با فایل‌های تعریف متغیر محیطی ``.env`` که برخی ابزارها پشتیبانی می‌کنند جلوگیری می‌کند.
ru: Общепринятым расположением каталога для виртуального окружения является ``.venv``. Это имя позволяет сохранить каталог, обычно скрытый в оболочке и, таким образом, не мешающий работе, а также дать ему имя, которое объясняет, почему каталог существует. Оно также предотвращает конфликт с файлами определения переменной окружения ``.env``, которые поддерживаются некоторыми инструментами.

source: Once you've created a virtual environment, you may activate it.
fa: هنگامی که یک محیط مجازی ایجاد کردید، می توانید آن را فعال کنید.
ru: После создания виртуального окружения его можно активировать.

source: On Windows, run::
fa: در ویندوز اجرا کنید::
ru: На Windows-машине запустите::

source: On Unix or MacOS, run::
fa: در یونیکس یا MacOS، اجرا کنید::
ru: На Unix или MacOS выполните::

source: (This script is written for the bash shell. If you use the :program:`csh` or :program:`fish` shells, there are alternate ``activate.csh`` and ``activate.fish`` scripts you should use instead.)
fa: (این اسکریپت برای پوسته bash نوشته شده است. اگر از پوسته های :program:`csh` یا :program:`fish` استفاده می کنید, اسکریپت های جایگزین ``activate.csh`` و ``activate.fish`` وجود دارد که باید به جای آن استفاده کنید.)
ru: (Этот скрипт использует оболочку bash. Для оболочек :program:`csh` или :program:`fish` надо использовать скрипты ``activate.csh`` и ``activate.fish`` соответственно).

source: Activating the virtual environment will change your shell's prompt to show what virtual environment you're using, and modify the environment so that running ``python`` will get you that particular version and installation of Python. For example:
fa: فعال کردن محیط مجازی، درخواست پوسته شما را تغییر می‌دهد تا نشان دهد از چه محیط مجازی استفاده می‌کنید و محیط را طوری تغییر می‌دهد که اجرای ``python`` آن نسخه خاص و نصب پایتون را برای شما به ارمغان بیاورد. به عنوان مثال:
ru: В результате активирования виртуального окружения prompt оболочки будет указывать имя используемого виртуального окружения, а команда ``python`` в окружении запустит установленную версию Python. Например:

source: To deactivate a virtual environment, type::
ru: Для деактивации виртуального окружения введите::

source: into the terminal.
ru: в терминал.

source: Managing Packages with pip
fa: مدیریت بسته ها با پیپ
ru: Управление пакетами с помощью pip

source: You can install, upgrade, and remove packages using a program called :program:`pip`. By default ``pip`` will install packages from the `Python Package Index <https://pypi.org>`_. You can browse the Python Package Index by going to it in your web browser.
ru: Вы можете устанавливать, обновлять и удалять пакеты с помощью программы, называемой :program:`pip`. По умолчанию ``pip`` будет устанавливать пакеты из `указателя пакетов Python <https://pypi.org>`_. Вы можете просматривать указатель пакетов Python, перейдя к нему в веб-браузере.

source: ``pip`` has a number of subcommands: "install", "uninstall", "freeze", etc. (Consult the :ref:`installing-index` guide for complete documentation for ``pip``.)
fa: ``pip`` تعدادی دستور فرعی دارد: "install"، "uninstall"، "freeze", و غیره (برای مستندات کامل ``pip`` به راهنمای :ref:`installing-index` مراجعه کنید.)
ru: ``pip`` имеет несколько подкоманд: "install", "uninstall", "freeze" и т.д. (Подробную документацию по ``pip`` см. в руководстве :ref:`installing-index`.)

source: You can install the latest version of a package by specifying a package's name:
fa: می توانید آخرین نسخه یک بسته را با تعیین نام بسته نصب کنید:
ru: Для установки последней версии некоторого пакета просто укажите его имя:

source: You can also install a specific version of a package by giving the package name followed by ``==`` and the version number:
fa: همچنین می توانید با دادن نام بسته و سپس ``==`` و شماره نسخه، نسخه خاصی از یک بسته را نصب کنید:
ru: Для установки другой версии нужно после имени пакета ввести ``==`` и номер версии:

source: If you re-run this command, ``pip`` will notice that the requested version is already installed and do nothing. You can supply a different version number to get that version, or you can run ``python -m pip install --upgrade`` to upgrade the package to the latest version:
ru: Если вы повторно запустите эту команду, ``pip`` заметит, что запрошенная версия уже установлена и ничего не сделает. Вы можете указать другой номер версии, чтобы получить эту версию, или можете запустить ``python -m pip install --upgrade``, чтобы обновить пакет до последней версии.

source: ``python -m pip uninstall`` followed by one or more package names will remove the packages from the virtual environment.
ru: ``python -m pip uninstall`` с последующим указанием одного или нескольких имен пакетов удалит пакеты из виртуального окружения.

source: ``python -m pip show`` will display information about a particular package:
ru: ``python -m pip show`` отобразит информацию о конкретном пакете:

source: ``python -m pip list`` will display all of the packages installed in the virtual environment:
ru: ``python -m pip list`` отобразит все установленные пакеты в виртуальном окружении:

source: ``python -m pip freeze`` will produce a similar list of the installed packages, but the output uses the format that ``python -m pip install`` expects. A common convention is to put this list in a ``requirements.txt`` file:
ru: ``python -m pip freeze`` выведет аналогичный список установленных пакетов, но вывод будет в формате, который ожидает ``python -m pip install``. Общепринятой практикой является помещение этого списка в файл ``requirements.txt``:

source: The ``requirements.txt`` can then be committed to version control and shipped as part of an application. Users can then install all the necessary packages with ``install -r``:
fa: سپس ``requirements.txt`` می تواند به کنترل نسخه متعهد شود و به عنوان بخشی از یک برنامه ارسال شود. سپس کاربران می توانند تمام بسته های لازم را با ``install -r`` نصب کنند:
ru: Файл ``requirements.txt`` может быть зафиксирован (committed) в конфигурационном управлении (version control) и тем самым поставляться как часть приложения. Далее пользователь устанавливает все необходимые приложению пакеты командой ``install -r``:

source: ``pip`` has many more options. Consult the :ref:`installing-index` guide for complete documentation for ``pip``. When you've written a package and want to make it available on the Python Package Index, consult the `Python packaging user guide`_.
ru: ``pip`` имеет много других опций. Для полной документации по ``pip`` обратитесь к руководству :ref:`installing-index`. Если вы написали пакет и хотите сделать его доступным в указателе пакетов Python, обратитесь к `руководству пользователя по упаковке в Python`_.
