Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/tutorial/whatnow.po
Languages: fa

source: What Now?
fa: حالا چی؟

source: Reading this tutorial has probably reinforced your interest in using Python --- you should be eager to apply Python to solving your real-world problems. Where should you go to learn more?
fa: خواندن این آموزش احتمالاً علاقه شما را به استفاده از پایتون تقویت کرده است --- باید مشتاق استفاده از پایتون برای حل مشکلات دنیای واقعی خود باشید. برای کسب اطلاعات بیشتر به کجا باید مراجعه کرد؟

source: This tutorial is part of Python's documentation set. Some other documents in the set are:
fa: این آموزش بخشی از مجموعه مستندات پایتون است. برخی دیگر از اسناد این مجموعه عبارتند از:

source: You should browse through this manual, which gives complete (though terse) reference material about types, functions, and the modules in the standard library. The standard Python distribution includes a *lot* of additional code. There are modules to read Unix mailboxes, retrieve documents via HTTP, generate random numbers, parse command-line options, compress data, and many other tasks. Skimming through the Library Reference will give you an idea of what's available.
fa: شما باید از طریق این راهنما مرور کنید، که مطالب مرجع کامل (هر چند مختصر) در مورد انواع، عملکردها و ماژول های موجود در کتابخانه استاندارد ارائه می دهد. توزیع استاندارد پایتون شامل کد اضافی *lot* است. ماژول هایی برای خواندن صندوق های پستی یونیکس، بازیابی اسناد از طریق HTTP، تولید اعداد تصادفی، تجزیه گزینه های خط فرمان، فشرده سازی داده ها و بسیاری از کارهای دیگر وجود دارد. مروری بر مرجع کتابخانه به شما ایده ای از آنچه در دسترس است می دهد.

source: :ref:`installing-index` explains how to install additional modules written by other Python users.
fa: :ref:`installing-index` نحوه نصب ماژول های اضافی نوشته شده توسط سایر کاربران پایتون را توضیح می دهد.

source: :ref:`reference-index`: A detailed explanation of Python's syntax and semantics. It's heavy reading, but is useful as a complete guide to the language itself.
fa: :ref:`reference-index`: توضیح مفصلی از نحو و معناشناسی پایتون. خواندن آن سنگین است، اما به عنوان یک راهنمای کامل برای خود زبان مفید است.

source: More Python resources:
fa: منابع بیشتر پایتون:

source: https://www.python.org: The major Python web site. It contains code, documentation, and pointers to Python-related pages around the web.
fa: https://www.python.org: وب سایت اصلی پایتون. این شامل کد، اسناد و اشاره گر به صفحات مرتبط با پایتون در سراسر وب است.

source: https://docs.python.org: Fast access to Python's documentation.
fa: https://docs.python.org: دسترسی سریع به اسناد پایتون.

source: https://pypi.org: The Python Package Index, previously also nicknamed the Cheese Shop [#]_, is an index of user-created Python modules that are available for download. Once you begin releasing code, you can register it here so that others can find it.
fa: https://pypi.org: فهرست بسته Python که قبلاً با نام مستعار Cheese Shop [#]_ نیز شناخته می شد، فهرستی از ماژول های Python ساخته شده توسط کاربر است که برای دانلود در دسترس هستند. هنگامی که شروع به انتشار کد کردید، می توانید آن را در اینجا ثبت کنید تا دیگران بتوانند آن را پیدا کنند.

source: https://code.activestate.com/recipes/langs/python/: The Python Cookbook is a sizable collection of code examples, larger modules, and useful scripts. Particularly notable contributions are collected in a book also titled Python Cookbook (O'Reilly & Associates, ISBN 0-596-00797-3.)
fa: https://code.activestate.com/recipes/langs/python/: کتاب آشپزی پایتون مجموعه قابل توجهی از نمونه های کد، ماژول های بزرگتر و اسکریپت های مفید است. مشارکت‌های قابل‌توجهی در کتابی با عنوان کتاب آشپزی پایتون (O'Reilly & Associates, ISBN 0-596-00797-3) جمع‌آوری شده است.

source: https://pyvideo.org collects links to Python-related videos from conferences and user-group meetings.
fa: https://pyvideo.org پیوندهایی را به ویدیوهای مرتبط با پایتون از کنفرانس ها و جلسات گروه کاربر جمع آوری می کند.

source: https://scipy.org: The Scientific Python project includes modules for fast array computations and manipulations plus a host of packages for such things as linear algebra, Fourier transforms, non-linear solvers, random number distributions, statistical analysis and the like.
fa: https://scipy.org: پروژه علمی پایتون شامل ماژول هایی برای محاسبات و دستکاری آرایه های سریع به علاوه مجموعه ای از بسته ها برای مواردی مانند جبر خطی، تبدیل فوریه، حل کننده های غیر خطی، توزیع اعداد تصادفی، تجزیه و تحلیل آماری و موارد مشابه است.

source: For Python-related questions and problem reports, you can post to the newsgroup :newsgroup:`comp.lang.python`, or send them to the mailing list at python-list@python.org. The newsgroup and mailing list are gatewayed, so messages posted to one will automatically be forwarded to the other. There are hundreds of postings a day, asking (and answering) questions, suggesting new features, and announcing new modules. Mailing list archives are available at https://mail.python.org/pipermail/.
fa: برای سؤالات مرتبط با پایتون و گزارش مشکلات، می‌توانید به گروه خبری :newsgroup:`comp.lang.python` پست کنید، یا آنها را به فهرست پستی به آدرس python-list@python.org ارسال کنید. گروه خبری و لیست پستی دارای دروازه هستند، بنابراین پیام های ارسال شده به یکی به طور خودکار به دیگری ارسال می شود. صدها پست در روز وجود دارد که سوالاتی را مطرح می کنند (و پاسخ می دهند), ویژگی های جدید را پیشنهاد می کنند و ماژول های جدید را اعلام می کنند. آرشیو لیست پستی در https://mail.python.org/pipermail/ موجود است.

source: Before posting, be sure to check the list of :ref:`Frequently Asked Questions <faq-index>` (also called the FAQ). The FAQ answers many of the questions that come up again and again, and may already contain the solution for your problem.
fa: قبل از ارسال، حتماً لیست :ref:`Frequently Asked Questions <faq-index>` (که به آن پرسش و پاسخ نیز گفته می شود) را بررسی کنید. سؤالات متداول به بسیاری از سؤالاتی که بارها و بارها مطرح می شوند پاسخ می دهد و ممکن است قبلاً حاوی راه حلی برای مشکل شما باشد.

source: Footnotes
fa: پاورقی ها

source: "Cheese Shop" is a Monty Python's sketch: a customer enters a cheese shop, but whatever cheese he asks for, the clerk says it's missing.
fa: «پنیرفروشی» یک طرح مونتی پایتون است: مشتری وارد پنیر فروشی می شود، اما هر چه پنیر بخواهد، منشی می گوید گم شده است.
