Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/howto/argparse-optparse.po
Languages: ru

source: Handling positional arguments.
ru: Обработка позиционных аргументов.

source: Supporting subcommands.
ru: Поддержка подкоманд.

source: Allowing alternative option prefixes like ``+`` and ``/``.
ru: Разрешение альтернативных префиксов опций, таких как ``+`` и ``/``.

source: Handling zero-or-more and one-or-more style arguments.
ru: Обработка аргументов стиля «ноль или более» и «один или более».

source: Producing more informative usage messages.
ru: Создание более информативных сообщений об использовании.

source: Providing a much simpler interface for custom ``type`` and ``action``.
ru: Предоставление гораздо более простого интерфейса для пользовательских типов и действий.

source: Originally, the :mod:`argparse` module attempted to maintain compatibility with :mod:`optparse`. However, the fundamental design differences between supporting declarative command line option processing (while leaving positional argument processing to application code), and supporting both named options and positional arguments in the declarative interface mean that the API has diverged from that of ``optparse`` over time.
ru: Первоначально модуль :mod:`argparse` пытался поддерживать совместимость с :mod:`optparse`. Однако фундаментальные различия в дизайне между поддержкой декларативной обработки параметров командной строки (оставляя обработку позиционных аргументов коду приложения) и поддержкой как именованных параметров, так и позиционных аргументов в декларативном интерфейсе означают, что API отличается от API optparse. через некоторое время.

source: Replace all :meth:`optparse.OptionParser.add_option` calls with :meth:`ArgumentParser.add_argument` calls.
ru: Замените все вызовы :meth:`optparse.OptionParser.add_option` на вызовы :meth:`ArgumentParser.add_argument`.

source: Replace ``(options, args) = parser.parse_args()`` with ``args = parser.parse_args()`` and add additional :meth:`ArgumentParser.add_argument` calls for the positional arguments. Keep in mind that what was previously called ``options``, now in the :mod:`argparse` context is called ``args``.
ru: Замените ``(options, args) = parser.parse_args()`` на ``args = parser.parse_args()`` и добавьте дополнительные вызовы :meth:`ArgumentParser.add_argument` для позиционных аргументов. Имейте в виду, что то, что раньше называлось ``options``, теперь в контексте :mod:`argparse` называется ``args``.

source: Replace :meth:`optparse.OptionParser.disable_interspersed_args` by using :meth:`~ArgumentParser.parse_intermixed_args` instead of :meth:`~ArgumentParser.parse_args`.
ru: Замените :meth:`optparse.OptionParser.disable_interspersed_args`, используя :meth:`~ArgumentParser.parse_intermixed_args` вместо :meth:`~ArgumentParser.parse_args`.

source: Replace callback actions and the ``callback_*`` keyword arguments with ``type`` or ``action`` arguments.
ru: Замените действия обратного вызова и аргументы ключевого слова ``callback_*`` на аргументы ``type`` или ``action``.

source: Replace string names for ``type`` keyword arguments with the corresponding type objects (e.g. int, float, complex, etc).
ru: Замените имена строк для аргументов ключевого слова ``type`` соответствующими объектами типа (например, int, float, complex и т. д.).

source: Replace :class:`optparse.Values` with :class:`Namespace` and :exc:`optparse.OptionError` and :exc:`optparse.OptionValueError` with :exc:`ArgumentError`.
ru: Замените :class:`optparse.Values` на :class:`Namespace` и :exc:`optparse.OptionError` и :exc:`optparse.OptionValueError` на :exc:`ArgumentError`.

source: Replace strings with implicit arguments such as ``%default`` or ``%prog`` with the standard Python syntax to use dictionaries to format strings, that is, ``%(default)s`` and ``%(prog)s``.
ru: Замените строки неявными аргументами, такими как `` %д efault`` или `` %p rog`` со стандартным синтаксисом Python для использования словарей для форматирования строк, то есть `` %(по умолчанию)с `` и `` %(прог)с ``.

source: Replace the OptionParser constructor ``version`` argument with a call to ``parser.add_argument('--version', action='version', version='<the version>')``.
ru: Замените аргумент ``version`` конструктора OptionParser вызовом ``parser.add_argument('--version', action='version', version='<the version>')``.
