Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/howto/descriptor.po
Languages: ru

source: The :meth:`object.__new__` method takes care of creating instances that have slots instead of an instance dictionary. Here is a rough simulation in pure Python:
ru: Метод :meth:`object.__new__` заботится о создании экземпляров, имеющих слоты вместо словаря экземпляров. Вот грубое моделирование на чистом Python:

source: To use the simulation in a real class, just inherit from :class:`!Object` and set the :term:`metaclass` to :class:`Type`:
ru: Чтобы использовать симуляцию в реальном классе, просто наследуйте от :class:`!Object` и установите для :term:`metaclass` значение :class:`Type`:

source: At this point, the metaclass has loaded member objects for *x* and *y*::
ru: На этом этапе метакласс загрузил объекты-члены для *x* и *y*::

source: When instances are created, they have a ``slot_values`` list where the attributes are stored:
ru: Когда экземпляры создаются, у них есть список ``slot_values``, в котором хранятся атрибуты:

source: Misspelled or unassigned attributes will raise an exception:
ru: Неправильно написанные или неназначенные атрибуты вызовут исключение:
