Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/howto/descriptor.po
Languages: ru

source: Descriptor Guide
ru: Руководство по дескрипторам

source: Author
ru: Автор

source: Contact
ru: Контакт

source: Contents
ru: Содержание

source: :term:`Descriptors <descriptor>` let objects customize attribute lookup, storage, and deletion.
ru: :term:`Дескрипторы <дескриптор>` позволяют объектам настраивать поиск, хранение и удаление атрибутов.

source: This guide has four major sections:
ru: Данное руководство состоит из четырех основных разделов:

source: The "primer" gives a basic overview, moving gently from simple examples, adding one feature at a time. Start here if you're new to descriptors.
ru: В «Букваре» дается базовый обзор, плавно переходя от простых примеров к добавлению одной функции за раз. Если вы новичок в дескрипторах, начните здесь.

source: The second section shows a complete, practical descriptor example. If you already know the basics, start there.
ru: Во втором разделе показан полный практический пример дескриптора. Если вы уже знаете основы, начните с них.

source: The third section provides a more technical tutorial that goes into the detailed mechanics of how descriptors work. Most people don't need this level of detail.
ru: Третий раздел представляет собой более техническое руководство, в котором подробно описывается механизм работы дескрипторов. Большинству людей не нужен такой уровень детализации.

source: The last section has pure Python equivalents for built-in descriptors that are written in C. Read this if you're curious about how functions turn into bound methods or about the implementation of common tools like :func:`classmethod`, :func:`staticmethod`, :func:`property`, and :term:`__slots__`.
ru: В последнем разделе приведены эквиваленты встроенных дескрипторов, написанных на C, на чистом Python. Прочтите это, если вам интересно, как функции превращаются в связанные методы или о реализации общих инструментов, таких как :func:`classmethod`, :func: `staticmethod`, :func:`property` и :term:`__slots__`.

source: Primer
ru: Первый

source: In this primer, we start with the most basic possible example and then we'll add new capabilities one by one.
ru: В этом руководстве мы начнем с самого простого примера, а затем будем добавлять новые возможности одну за другой.

source: Simple example: A descriptor that returns a constant
ru: Простой пример: дескриптор, возвращающий константу.

source: The :class:`!Ten` class is a descriptor whose :meth:`~object.__get__` method always returns the constant ``10``:
ru: Класс :class:`!Ten` — это дескриптор, метод :meth:`~object.__get__` всегда возвращает константу ``10``:

source: To use the descriptor, it must be stored as a class variable in another class:
ru: Чтобы использовать дескриптор, его необходимо сохранить как переменную класса в другом классе:

source: An interactive session shows the difference between normal attribute lookup and descriptor lookup:
ru: Интерактивный сеанс показывает разницу между обычным поиском по атрибуту и ​​поиском по дескриптору:

source: In the ``a.x`` attribute lookup, the dot operator finds ``'x': 5`` in the class dictionary. In the ``a.y`` lookup, the dot operator finds a descriptor instance, recognized by its ``__get__`` method. Calling that method returns ``10``.
ru: При поиске атрибута ``ax`` оператор точки находит ``'x': 5`` в словаре класса. При поиске ``ay`` оператор точки находит экземпляр дескриптора, распознаваемый его методом ``__get__``. Вызов этого метода возвращает ``10``.

source: Note that the value ``10`` is not stored in either the class dictionary or the instance dictionary. Instead, the value ``10`` is computed on demand.
ru: Обратите внимание, что значение «10» не сохраняется ни в словаре класса, ни в словаре экземпляра. Вместо этого значение «10» вычисляется по требованию.

source: This example shows how a simple descriptor works, but it isn't very useful. For retrieving constants, normal attribute lookup would be better.
ru: Этот пример показывает, как работает простой дескриптор, но он бесполезен. Для получения констант лучше использовать обычный поиск по атрибутам.

source: In the next section, we'll create something more useful, a dynamic lookup.
ru: В следующем разделе мы создадим нечто более полезное — динамический поиск.

source: Dynamic lookups
ru: Динамические поиски

source: Interesting descriptors typically run computations instead of returning constants:
ru: Интересные дескрипторы обычно выполняют вычисления вместо возврата констант:

source: An interactive session shows that the lookup is dynamic — it computes different, updated answers each time::
ru: Интерактивный сеанс показывает, что поиск является динамическим — каждый раз вычисляет разные, обновленные ответы:

source: Besides showing how descriptors can run computations, this example also reveals the purpose of the parameters to :meth:`~object.__get__`. The *self* parameter is *size*, an instance of *DirectorySize*. The *obj* parameter is either *g* or *s*, an instance of *Directory*. It is the *obj* parameter that lets the :meth:`~object.__get__` method learn the target directory. The *objtype* parameter is the class *Directory*.
ru: Помимо демонстрации того, как дескрипторы могут выполнять вычисления, этот пример также раскрывает назначение параметров :meth:`~object.__get__`. Параметр *self* — это *size*, экземпляр *DirectorySize*. Параметр *obj* — это либо *g*, либо *s*, экземпляр *Directory*. Это параметр *obj*, который позволяет методу :meth:`~object.__get__` узнать целевой каталог. Параметр *objtype* — это класс *Directory*.

source: Managed attributes
ru: Управляемые атрибуты

source: A popular use for descriptors is managing access to instance data. The descriptor is assigned to a public attribute in the class dictionary while the actual data is stored as a private attribute in the instance dictionary. The descriptor's :meth:`~object.__get__` and :meth:`~object.__set__` methods are triggered when the public attribute is accessed.
ru: Популярное использование дескрипторов — управление доступом к данным экземпляра. Дескриптор присваивается общедоступному атрибуту в словаре класса, а фактические данные сохраняются как частный атрибут в словаре экземпляра. Методы :meth:`~object.__get__` и :meth:`~object.__set__` дескриптора запускаются при доступе к общедоступному атрибуту.

source: In the following example, *age* is the public attribute and *_age* is the private attribute. When the public attribute is accessed, the descriptor logs the lookup or update:
ru: В следующем примере *age* является общедоступным атрибутом, а *_age* — закрытым атрибутом. При доступе к общедоступному атрибуту дескриптор регистрирует поиск или обновление:

source: An interactive session shows that all access to the managed attribute *age* is logged, but that the regular attribute *name* is not logged:
ru: Интерактивный сеанс показывает, что весь доступ к управляемому атрибуту *age* протоколируется, но обычный атрибут *name* не регистрируется:

source: One major issue with this example is that the private name *_age* is hardwired in the *LoggedAgeAccess* class. That means that each instance can only have one logged attribute and that its name is unchangeable. In the next example, we'll fix that problem.
ru: Одна из основных проблем этого примера заключается в том, что частное имя *_age* жестко закреплено в классе *LoggedAgeAccess*. Это означает, что каждый экземпляр может иметь только один регистрируемый атрибут и его имя невозможно изменить. В следующем примере мы исправим эту проблему.

source: Customized names
ru: Индивидуальные имена

source: When a class uses descriptors, it can inform each descriptor about which variable name was used.
ru: Когда класс использует дескрипторы, он может сообщить каждому дескриптору, какое имя переменной было использовано.

source: In this example, the :class:`!Person` class has two descriptor instances, *name* and *age*. When the :class:`!Person` class is defined, it makes a callback to :meth:`~object.__set_name__` in *LoggedAccess* so that the field names can be recorded, giving each descriptor its own *public_name* and *private_name*:
ru: В этом примере класс :class:`!Person` имеет два экземпляра дескриптора: *name* и *age*. Когда класс :class:`!Person` определен, он выполняет обратный вызов :meth:`~object.__set_name__` в *LoggedAccess*, чтобы можно было записать имена полей, присваивая каждому дескриптору свои собственные *public_name* и * частное_имя*:

source: An interactive session shows that the :class:`!Person` class has called :meth:`~object.__set_name__` so that the field names would be recorded. Here we call :func:`vars` to look up the descriptor without triggering it:
ru: Интерактивный сеанс показывает, что класс :class:`!Person` вызвал :meth:`~object.__set_name__`, чтобы были записаны имена полей. Здесь мы вызываем :func:`vars` для поиска дескриптора без его запуска:

source: The new class now logs access to both *name* and *age*:
ru: Новый класс теперь регистрирует доступ как к *name*, так и к *age*:

source: The two *Person* instances contain only the private names:
ru: Два экземпляра *Person* содержат только частные имена:

source: Closing thoughts
ru: Заключительные мысли

source: A :term:`descriptor` is what we call any object that defines :meth:`~object.__get__`, :meth:`~object.__set__`, or :meth:`~object.__delete__`.
ru: :term:`дескриптор` — это то, что мы называем любым объектом, который определяет :meth:`~object.__get__`, :meth:`~object.__set__` или :meth:`~object.__delete__`.

source: Optionally, descriptors can have a :meth:`~object.__set_name__` method. This is only used in cases where a descriptor needs to know either the class where it was created or the name of class variable it was assigned to. (This method, if present, is called even if the class is not a descriptor.)
ru: Опционально, дескрипторы могут иметь метод :meth:`~object.__set_name__`. Это используется только в тех случаях, когда дескриптору необходимо знать либо класс, в котором он был создан, либо имя переменной класса, которой он был присвоен. (Этот метод, если он присутствует, вызывается, даже если класс не является дескриптором.)

source: Descriptors get invoked by the dot operator during attribute lookup. If a descriptor is accessed indirectly with ``vars(some_class)[descriptor_name]``, the descriptor instance is returned without invoking it.
ru: Дескрипторы вызываются оператором точки во время поиска атрибута. Если доступ к дескриптору осуществляется косвенно с помощью ``vars(some_class)[descriptor_name]``, экземпляр дескриптора возвращается без его вызова.

source: Descriptors only work when used as class variables. When put in instances, they have no effect.
ru: Дескрипторы работают только при использовании в качестве переменных класса. Когда они помещены в экземпляры, они не имеют никакого эффекта.

source: The main motivation for descriptors is to provide a hook allowing objects stored in class variables to control what happens during attribute lookup.
ru: Основная мотивация использования дескрипторов — предоставить возможность объектам, хранящимся в переменных класса, контролировать то, что происходит во время поиска атрибутов.

source: Traditionally, the calling class controls what happens during lookup. Descriptors invert that relationship and allow the data being looked-up to have a say in the matter.
ru: Традиционно вызывающий класс управляет тем, что происходит во время поиска. Дескрипторы инвертируют эту связь и позволяют искомым данным иметь право голоса в этом вопросе.

source: Descriptors are used throughout the language. It is how functions turn into bound methods. Common tools like :func:`classmethod`, :func:`staticmethod`, :func:`property`, and :func:`functools.cached_property` are all implemented as descriptors.
ru: Дескрипторы используются во всем языке. Именно так функции превращаются в связанные методы. Общие инструменты, такие как :func:`classmethod`, :func:`staticmethod`, :func:`property` и :func:`functools.cached_property`, реализованы как дескрипторы.

source: Complete Practical Example
ru: Полный практический пример

source: In this example, we create a practical and powerful tool for locating notoriously hard to find data corruption bugs.
ru: В этом примере мы создаем практичный и мощный инструмент для обнаружения заведомо трудно обнаруживаемых ошибок, повреждающих данные.

source: Validator class
ru: Класс валидатора

source: A validator is a descriptor for managed attribute access. Prior to storing any data, it verifies that the new value meets various type and range restrictions. If those restrictions aren't met, it raises an exception to prevent data corruption at its source.
ru: Валидатор — это дескриптор для доступа к управляемым атрибутам. Прежде чем сохранять какие-либо данные, он проверяет, соответствует ли новое значение различным ограничениям типа и диапазона. Если эти ограничения не соблюдаются, создается исключение, чтобы предотвратить повреждение данных в их источнике.

source: This :class:`!Validator` class is both an :term:`abstract base class` and a managed attribute descriptor:
ru: Этот класс :class:`!Validator` является одновременно :term:`абстрактным базовым классом` и дескриптором управляемого атрибута:

source: Custom validators need to inherit from :class:`!Validator` and must supply a :meth:`!validate` method to test various restrictions as needed.
ru: Пользовательские валидаторы должны наследовать от :class:`!Validator` и должны предоставлять метод :meth:`!validate` для проверки различных ограничений по мере необходимости.

source: Custom validators
ru: Пользовательские валидаторы

source: Here are three practical data validation utilities:
ru: Вот три практические утилиты проверки данных:

source: :class:`!OneOf` verifies that a value is one of a restricted set of options.
ru: :class:`!OneOf` проверяет, что значение является одним из ограниченного набора параметров.

source: :class:`!Number` verifies that a value is either an :class:`int` or :class:`float`. Optionally, it verifies that a value is between a given minimum or maximum.
ru: :class:`!Number` проверяет, что значение является либо :class:`int`, либо :class:`float`. При необходимости он проверяет, находится ли значение между заданным минимумом или максимумом.

source: :class:`!String` verifies that a value is a :class:`str`. Optionally, it validates a given minimum or maximum length. It can validate a user-defined `predicate <https://en.wikipedia.org/wiki/Predicate_(mathematical_logic)>`_ as well.
ru: :class:`!String` проверяет, что значение является :class:`str`. При необходимости он проверяет заданную минимальную или максимальную длину. Он также может проверять определенный пользователем `предикат <https://en.wikipedia.org/wiki/Predicate_(mathematical_logic)>`_.

source: Practical application
ru: Практическое применение

source: Here's how the data validators can be used in a real class:
ru: Вот как валидаторы данных можно использовать в реальном классе:

source: The descriptors prevent invalid instances from being created:
ru: Дескрипторы предотвращают создание недопустимых экземпляров:

source: Technical Tutorial
ru: Техническое руководство

source: What follows is a more technical tutorial for the mechanics and details of how descriptors work.
ru: Далее следует более техническое руководство по механике и подробностям работы дескрипторов.

source: Abstract
ru: Абстракция

source: Defines descriptors, summarizes the protocol, and shows how descriptors are called. Provides an example showing how object relational mappings work.
ru: Определяет дескрипторы, обобщает протокол и показывает, как вызываются дескрипторы. Содержит пример, показывающий, как работают реляционные сопоставления объектов.

source: Learning about descriptors not only provides access to a larger toolset, it creates a deeper understanding of how Python works.
ru: Изучение дескрипторов не только обеспечивает доступ к более широкому набору инструментов, но и дает более глубокое понимание того, как работает Python.

source: Definition and introduction
ru: Определение и введение

source: In general, a descriptor is an attribute value that has one of the methods in the descriptor protocol. Those methods are :meth:`~object.__get__`, :meth:`~object.__set__`, and :meth:`~object.__delete__`. If any of those methods are defined for an attribute, it is said to be a :term:`descriptor`.
ru: В общем, дескриптор — это значение атрибута, которое имеет один из методов протокола дескриптора. Этими методами являются :meth:`~object.__get__`, :meth:`~object.__set__` и :meth:`~object.__delete__`. Если для атрибута определен какой-либо из этих методов, он называется :term:`дескриптором`.

source: The default behavior for attribute access is to get, set, or delete the attribute from an object's dictionary. For instance, ``a.x`` has a lookup chain starting with ``a.__dict__['x']``, then ``type(a).__dict__['x']``, and continuing through the method resolution order of ``type(a)``. If the looked-up value is an object defining one of the descriptor methods, then Python may override the default behavior and invoke the descriptor method instead. Where this occurs in the precedence chain depends on which descriptor methods were defined.
ru: Поведение по умолчанию для доступа к атрибуту — получение, установка или удаление атрибута из словаря объекта. Например, ``ax`` имеет цепочку поиска, начинающуюся с ``a.__dict__['x']``, затем ``type(a).__dict__['x']`` и продолжающуюся до разрешения метода. порядок ``type(a)``. Если искомое значение является объектом, определяющим один из методов дескриптора, то Python может переопределить поведение по умолчанию и вместо этого вызвать метод дескриптора. Где это происходит в цепочке приоритетов, зависит от того, какие методы дескриптора были определены.

source: Descriptors are a powerful, general purpose protocol. They are the mechanism behind properties, methods, static methods, class methods, and :func:`super`. They are used throughout Python itself. Descriptors simplify the underlying C code and offer a flexible set of new tools for everyday Python programs.
ru: Дескрипторы — это мощный протокол общего назначения. Они являются механизмом свойств, методов, статических методов, методов классов и :func:`super`. Они используются во всем Python. Дескрипторы упрощают базовый код C и предлагают гибкий набор новых инструментов для повседневных программ Python.

source: Descriptor protocol
ru: Протокол дескриптора

source: That is all there is to it. Define any of these methods and an object is considered a descriptor and can override default behavior upon being looked up as an attribute.
ru: Вот и все. Определите любой из этих методов, и объект будет считаться дескриптором и может переопределить поведение по умолчанию при поиске в качестве атрибута.

source: If an object defines :meth:`~object.__set__` or :meth:`~object.__delete__`, it is considered a data descriptor. Descriptors that only define :meth:`~object.__get__` are called non-data descriptors (they are often used for methods but other uses are possible).
ru: Если объект определяет :meth:`~object.__set__` или :meth:`~object.__delete__`, он считается дескриптором данных. Дескрипторы, которые определяют только :meth:`~object.__get__`, называются дескрипторами, не относящимися к данным (они часто используются для методов, но возможны и другие варианты использования).

source: Data and non-data descriptors differ in how overrides are calculated with respect to entries in an instance's dictionary. If an instance's dictionary has an entry with the same name as a data descriptor, the data descriptor takes precedence. If an instance's dictionary has an entry with the same name as a non-data descriptor, the dictionary entry takes precedence.
ru: Дескрипторы данных и не данных различаются тем, как переопределения вычисляются по отношению к записям в словаре экземпляра. Если в словаре экземпляра есть запись с тем же именем, что и у дескриптора данных, дескриптор данных имеет приоритет. Если в словаре экземпляра есть запись с тем же именем, что и у дескриптора, не являющегося данными, запись словаря имеет приоритет.

source: To make a read-only data descriptor, define both :meth:`~object.__get__` and :meth:`~object.__set__` with the :meth:`~object.__set__` raising an :exc:`AttributeError` when called. Defining the :meth:`~object.__set__` method with an exception raising placeholder is enough to make it a data descriptor.
ru: Чтобы создать дескриптор данных, доступный только для чтения, определите :meth:`~object.__get__` и :meth:`~object.__set__` с помощью :meth:`~object.__set__`, вызывающего :exc:`AttributeError`, когда называется. Определить метод :meth:`~object.__set__` с заполнителем, вызывающим исключение, достаточно, чтобы сделать его дескриптором данных.

source: Overview of descriptor invocation
ru: Обзор вызова дескриптора

source: A descriptor can be called directly with ``desc.__get__(obj)`` or ``desc.__get__(None, cls)``.
ru: Дескриптор можно вызвать напрямую с помощью ``desc.__get__(obj)`` или ``desc.__get__(None, cls)``.

source: But it is more common for a descriptor to be invoked automatically from attribute access.
ru: Но чаще всего дескриптор вызывается автоматически при доступе к атрибуту.

source: The expression ``obj.x`` looks up the attribute ``x`` in the chain of namespaces for ``obj``. If the search finds a descriptor outside of the instance :attr:`~object.__dict__`, its :meth:`~object.__get__` method is invoked according to the precedence rules listed below.
ru: Выражение ``obj.x`` ищет атрибут ``x`` в цепочке пространств имен для ``obj``. Если поиск находит дескриптор за пределами экземпляра :attr:`~object.__dict__`, его метод :meth:`~object.__get__` вызывается в соответствии с правилами приоритета, перечисленными ниже.

source: The details of invocation depend on whether ``obj`` is an object, class, or instance of super.
ru: Детали вызова зависят от того, является ли obj объектом, классом или экземпляром super.

source: Invocation from an instance
ru: Вызов из экземпляра

source: Instance lookup scans through a chain of namespaces giving data descriptors the highest priority, followed by instance variables, then non-data descriptors, then class variables, and lastly :meth:`~object.__getattr__` if it is provided.
ru: Поиск экземпляра сканирует цепочку пространств имен, отдавая наивысший приоритет дескрипторам данных, за которыми следуют переменные экземпляра, затем дескрипторы, не относящиеся к данным, затем переменные класса и, наконец, :meth:`~object.__getattr__`, если он предоставлен.

source: If a descriptor is found for ``a.x``, then it is invoked with: ``desc.__get__(a, type(a))``.
ru: Если для ``ax`` найден дескриптор, он вызывается с помощью: ``desc.__get__(a, type(a))``.

source: The logic for a dotted lookup is in :meth:`object.__getattribute__`. Here is a pure Python equivalent:
ru: Логика точечного поиска находится в :meth:`object.__getattribute__`. Вот чистый эквивалент Python:

source: Note, there is no :meth:`~object.__getattr__` hook in the :meth:`~object.__getattribute__` code. That is why calling :meth:`~object.__getattribute__` directly or with ``super().__getattribute__`` will bypass :meth:`~object.__getattr__` entirely.
ru: Поиск экземпляра сканирует цепочку пространств имен, отдавая наивысший приоритет дескрипторам данных, за которыми следуют переменные экземпляра, затем дескрипторы, не относящиеся к данным, затем переменные класса и, наконец, :meth:`~object.__getattr__`, если он предоставлен.
