Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/howto/descriptor.po
Languages: ru

source: Instead, it is the dot operator and the :func:`getattr` function that are responsible for invoking :meth:`~object.__getattr__` whenever :meth:`~object.__getattribute__` raises an :exc:`AttributeError`. Their logic is encapsulated in a helper function:
ru: Вместо этого оператор точки и функция :func:`getattr` отвечают за вызов :meth:`~object.__getattr__` всякий раз, когда :meth:`~object.__getattribute__` вызывает :exc:`AttributeError`. Их логика инкапсулирована во вспомогательной функции:

source: Invocation from a class
ru: Вызов из класса

source: The logic for a dotted lookup such as ``A.x`` is in :meth:`!type.__getattribute__`. The steps are similar to those for :meth:`!object.__getattribute__` but the instance dictionary lookup is replaced by a search through the class's :term:`method resolution order`.
ru: Логика точечного поиска, такого как ``Ax``, находится в :meth:`!type.__getattribute__`. Шаги аналогичны шагам для :meth:`!object.__getattribute__`, но поиск в словаре экземпляра заменяется поиском по :term:`порядку разрешения методов` класса.

source: If a descriptor is found, it is invoked with ``desc.__get__(None, A)``.
ru: Если дескриптор найден, он вызывается с помощью ``desc.__get__(None, A)``.

source: The full C implementation can be found in :c:func:`!type_getattro` and :c:func:`!_PyType_Lookup` in :source:`Objects/typeobject.c`.
ru: Полную реализацию C можно найти в :c:func:`!type_getattro` и :c:func:`!_PyType_Lookup` в :source:`Objects/typeobject.c`.

source: Invocation from super
ru: Призыв от супер

source: The logic for super's dotted lookup is in the :meth:`~object.__getattribute__` method for object returned by :func:`super`.
ru: Логика точечного поиска super находится в методе :meth:`~object.__getattribute__` для объекта, возвращаемого :func:`super`.

source: A dotted lookup such as ``super(A, obj).m`` searches ``obj.__class__.__mro__`` for the base class ``B`` immediately following ``A`` and then returns ``B.__dict__['m'].__get__(obj, A)``. If not a descriptor, ``m`` is returned unchanged.
ru: Поиск с точкой, такой как ``super(A, obj).m``, ищет в ``obj.__class__.__mro__`` базовый класс ``B`` сразу после ``A`` и затем возвращает ``B. __dict__['m'].__get__(obj, A)``. Если это не дескриптор, ``m`` возвращается без изменений.

source: The full C implementation can be found in :c:func:`!super_getattro` in :source:`Objects/typeobject.c`. A pure Python equivalent can be found in `Guido's Tutorial <https://www.python.org/download/releases/2.2.3/descrintro/#cooperation>`_.
ru: Полную реализацию C можно найти в :c:func:`!super_getattro` в :source:`Objects/typeobject.c`. Эквивалент на чистом Python можно найти в `Guido's Tutorial <https://www.python.org/download/releases/2.2.3/descrintro/#cooperation>`_.

source: Summary of invocation logic
ru: Краткое описание логики вызова

source: The mechanism for descriptors is embedded in the :meth:`~object.__getattribute__` methods for :class:`object`, :class:`type`, and :func:`super`.
ru: Механизм дескрипторов встроен в методы :meth:`~object.__getattribute__` для :class:`object`, :class:`type` и :func:`super`.

source: The important points to remember are:
ru: Важные моменты, которые следует запомнить:

source: Descriptors are invoked by the :meth:`~object.__getattribute__` method.
ru: Дескрипторы вызываются методом :meth:`~object.__getattribute__`.

source: Classes inherit this machinery from :class:`object`, :class:`type`, or :func:`super`.
ru: Классы наследуют этот механизм от :class:`object`, :class:`type` или :func:`super`.

source: Overriding :meth:`~object.__getattribute__` prevents automatic descriptor calls because all the descriptor logic is in that method.
ru: Переопределение :meth:`~object.__getattribute__` предотвращает автоматические вызовы дескриптора, поскольку вся логика дескриптора находится в этом методе.

source: :meth:`!object.__getattribute__` and :meth:`!type.__getattribute__` make different calls to :meth:`~object.__get__`. The first includes the instance and may include the class. The second puts in ``None`` for the instance and always includes the class.
ru: :meth:`!object.__getattribute__` и :meth:`!type.__getattribute__` выполняют разные вызовы :meth:`~object.__get__`. Первый включает экземпляр и может включать класс. Второй устанавливает значение None для экземпляра и всегда включает класс.

source: Data descriptors always override instance dictionaries.
ru: Дескрипторы данных всегда переопределяют словари экземпляров.

source: Non-data descriptors may be overridden by instance dictionaries.
ru: Дескрипторы, не являющиеся данными, могут быть переопределены словарями экземпляров.

source: Automatic name notification
ru: Автоматическое уведомление об имени

source: Sometimes it is desirable for a descriptor to know what class variable name it was assigned to. When a new class is created, the :class:`type` metaclass scans the dictionary of the new class. If any of the entries are descriptors and if they define :meth:`~object.__set_name__`, that method is called with two arguments. The *owner* is the class where the descriptor is used, and the *name* is the class variable the descriptor was assigned to.
ru: Иногда желательно, чтобы дескриптор знал, какое имя переменной класса ему присвоено. Когда создается новый класс, метакласс :class:`type` сканирует словарь нового класса. Если какие-либо записи являются дескрипторами и определяют :meth:`~object.__set_name__`, этот метод вызывается с двумя аргументами. *владелец* — это класс, в котором используется дескриптор, а *имя* — это переменная класса, которой был назначен дескриптор.

source: The implementation details are in :c:func:`!type_new` and :c:func:`!set_names` in :source:`Objects/typeobject.c`.
ru: Детали реализации находятся в :c:func:`!type_new` и :c:func:`!set_names` в :source:`Objects/typeobject.c`.

source: Since the update logic is in :meth:`!type.__new__`, notifications only take place at the time of class creation. If descriptors are added to the class afterwards, :meth:`~object.__set_name__` will need to be called manually.
ru: Поскольку логика обновления находится в :meth:`!type.__new__`, уведомления происходят только во время создания класса. Если впоследствии к классу будут добавлены дескрипторы, :meth:`~object.__set_name__` нужно будет вызывать вручную.

source: ORM example
ru: Пример ORM

source: The following code is a simplified skeleton showing how data descriptors could be used to implement an `object relational mapping <https://en.wikipedia.org/wiki/Object%E2%80%93relational_mapping>`_.
ru: Следующий код представляет собой упрощенный скелет, показывающий, как можно использовать дескрипторы данных для реализации реляционного сопоставления объектов <https://en.wikipedia.org/wiki/Object. %И 2%80%93реляционное_отображение>`_.

source: The essential idea is that the data is stored in an external database. The Python instances only hold keys to the database's tables. Descriptors take care of lookups or updates:
ru: Основная идея заключается в том, что данные хранятся во внешней базе данных. Экземпляры Python содержат только ключи к таблицам базы данных. Дескрипторы заботятся о поиске или обновлении:

source: We can use the :class:`!Field` class to define `models <https://en.wikipedia.org/wiki/Database_model>`_ that describe the schema for each table in a database:
ru: Мы можем использовать класс :class:`!Field` для определения `моделей <https://en.wikipedia.org/wiki/Database_model>`_, которые описывают схему для каждой таблицы в базе данных:

source: To use the models, first connect to the database::
ru: Чтобы использовать модели, сначала подключитесь к базе данных:

source: An interactive session shows how data is retrieved from the database and how it can be updated:
ru: Интерактивный сеанс показывает, как данные извлекаются из базы данных и как их можно обновить:

source: Pure Python Equivalents
ru: Эквиваленты чистого Python

source: The descriptor protocol is simple and offers exciting possibilities. Several use cases are so common that they have been prepackaged into built-in tools. Properties, bound methods, static methods, class methods, and \_\_slots\_\_ are all based on the descriptor protocol.
ru: Протокол дескриптора прост и предлагает потрясающие возможности. Некоторые варианты использования настолько распространены, что они были встроены во встроенные инструменты. Свойства, связанные методы, статические методы, методы класса и \_\_slots\_\_ — все они основаны на протоколе дескрипторов.

source: Properties
ru: Свойства

source: Calling :func:`property` is a succinct way of building a data descriptor that triggers a function call upon access to an attribute. Its signature is::
ru: Вызов :func:`property` — это краткий способ создания дескриптора данных, который запускает вызов функции при доступе к атрибуту. Его подпись::

source: The documentation shows a typical use to define a managed attribute ``x``:
ru: В документации показано типичное использование для определения управляемого атрибута «x»:

source: To see how :func:`property` is implemented in terms of the descriptor protocol, here is a pure Python equivalent that implements most of the core functionality:
ru: Чтобы увидеть, как :func:`property` реализуется с точки зрения протокола дескриптора, вот чистый эквивалент Python, который реализует большую часть основных функций:

source: The :func:`property` builtin helps whenever a user interface has granted attribute access and then subsequent changes require the intervention of a method.
ru: Встроенная функция :func:`property` помогает, когда пользовательский интерфейс предоставил доступ к атрибуту, а затем последующие изменения требуют вмешательства метода.

source: For instance, a spreadsheet class may grant access to a cell value through ``Cell('b10').value``. Subsequent improvements to the program require the cell to be recalculated on every access; however, the programmer does not want to affect existing client code accessing the attribute directly. The solution is to wrap access to the value attribute in a property data descriptor:
ru: Например, класс электронной таблицы может предоставить доступ к значению ячейки через ``Cell('b10').value``. Последующие улучшения программы требуют перерасчета ячейки при каждом доступе; однако программист не хочет влиять на существующий клиентский код, обращаясь к атрибуту напрямую. Решение состоит в том, чтобы обернуть доступ к атрибуту значения в дескриптор данных свойства:

source: Either the built-in :func:`property` or our :func:`!Property` equivalent would work in this example.
ru: В этом примере будет работать либо встроенный :func:`property`, либо наш эквивалент :func:`!Property`.

source: Functions and methods
ru: Функции и методы

source: Python's object oriented features are built upon a function based environment. Using non-data descriptors, the two are merged seamlessly.
ru: Объектно-ориентированные функции Python построены на среде, основанной на функциях. Используя дескрипторы, не являющиеся данными, они легко объединяются.

source: Functions stored in class dictionaries get turned into methods when invoked. Methods only differ from regular functions in that the object instance is prepended to the other arguments. By convention, the instance is called *self* but could be called *this* or any other variable name.
ru: Функции, хранящиеся в словарях классов, при вызове превращаются в методы. Методы отличаются от обычных функций только тем, что экземпляр объекта добавляется к другим аргументам. По соглашению экземпляр называется *self*, но может называться *this* или любым другим именем переменной.

source: Methods can be created manually with :class:`types.MethodType` which is roughly equivalent to:
ru: Методы можно создавать вручную с помощью :class:`types.MethodType`, что примерно эквивалентно:

source: To support automatic creation of methods, functions include the :meth:`~object.__get__` method for binding methods during attribute access. This means that functions are non-data descriptors that return bound methods during dotted lookup from an instance. Here's how it works:
ru: Для поддержки автоматического создания методов функции включают метод :meth:`~object.__get__` для привязки методов во время доступа к атрибутам. Это означает, что функции не являются дескрипторами данных, которые возвращают связанные методы во время точечного поиска из экземпляра. Вот как это работает:

source: Running the following class in the interpreter shows how the function descriptor works in practice:
ru: Запуск следующего класса в интерпретаторе показывает, как на практике работает дескриптор функции:

source: The function has a :term:`qualified name` attribute to support introspection:
ru: Функция имеет атрибут :term:`qualified name` для поддержки самоанализа:

source: Accessing the function through the class dictionary does not invoke :meth:`~object.__get__`. Instead, it just returns the underlying function object::
ru: Доступ к функции через словарь классов не вызывает :meth:`~object.__get__`. Вместо этого он просто возвращает базовый объект функции::

source: Dotted access from a class calls :meth:`~object.__get__` which just returns the underlying function unchanged::
ru: Доступ к точке из класса вызывает :meth:`~object.__get__`, который просто возвращает базовую функцию без изменений::

source: The interesting behavior occurs during dotted access from an instance. The dotted lookup calls :meth:`~object.__get__` which returns a bound method object::
ru: Интересное поведение происходит во время точечного доступа из экземпляра. Точечный поиск вызывает :meth:`~object.__get__`, который возвращает привязанный объект метода::

source: Internally, the bound method stores the underlying function and the bound instance::
ru: Внутри связанный метод хранит базовую функцию и связанный экземпляр::

source: If you have ever wondered where *self* comes from in regular methods or where *cls* comes from in class methods, this is it!
ru: Если вы когда-нибудь задавались вопросом, откуда берется *self* в обычных методах или откуда берется *cls* в методах класса, то вот оно!

source: Kinds of methods
ru: Виды методов

source: Non-data descriptors provide a simple mechanism for variations on the usual patterns of binding functions into methods.
ru: Дескрипторы, не являющиеся данными, предоставляют простой механизм для вариаций обычных шаблонов привязки функций к методам.

source: To recap, functions have a :meth:`~object.__get__` method so that they can be converted to a method when accessed as attributes. The non-data descriptor transforms an ``obj.f(*args)`` call into ``f(obj, *args)``. Calling ``cls.f(*args)`` becomes ``f(*args)``.
ru: Напомним, что функции имеют метод :meth:`~object.__get__`, поэтому их можно преобразовать в метод при доступе в качестве атрибутов. Дескриптор, не являющийся данными, преобразует вызов ``obj.f(*args)`` в ``f(obj, *args)``. Вызов ``cls.f(*args)`` становится ``f(*args)``.

source: This chart summarizes the binding and its two most useful variants:
ru: Эта диаграмма суммирует привязку и два ее наиболее полезных варианта:

source: Transformation
ru: Трансформация

source: Called from an object
ru: Вызывается из объекта

source: Called from a class
ru: Звонок из класса

source: function
ru: функция

source: Static methods
ru: Статические методы

source: Static methods return the underlying function without changes. Calling either ``c.f`` or ``C.f`` is the equivalent of a direct lookup into ``object.__getattribute__(c, "f")`` or ``object.__getattribute__(C, "f")``. As a result, the function becomes identically accessible from either an object or a class.
ru: Статические методы возвращают базовую функцию без изменений. Вызов ``cf`` или ``Cf`` эквивалентен прямому поиску в ``object.__getattribute__(c, "f")`` или ``object.__getattribute__(C, "f")`` . В результате функция становится одинаково доступной как из объекта, так и из класса.

source: Good candidates for static methods are methods that do not reference the ``self`` variable.
ru: Хорошими кандидатами для статических методов являются методы, которые не ссылаются на переменную self.

source: For instance, a statistics package may include a container class for experimental data. The class provides normal methods for computing the average, mean, median, and other descriptive statistics that depend on the data. However, there may be useful functions which are conceptually related but do not depend on the data. For instance, ``erf(x)`` is handy conversion routine that comes up in statistical work but does not directly depend on a particular dataset. It can be called either from an object or the class: ``s.erf(1.5) --> 0.9332`` or ``Sample.erf(1.5) --> 0.9332``.
ru: Например, пакет статистики может включать класс-контейнер для экспериментальных данных. Класс предоставляет обычные методы для вычисления среднего, среднего, медианного и других описательных статистических данных, которые зависят от данных. Однако могут быть полезные функции, которые концептуально связаны, но не зависят от данных. Например, erf(x) — это удобная процедура преобразования, которая используется в статистических работах, но не зависит напрямую от конкретного набора данных. Его можно вызвать либо из объекта, либо из класса: ``s.erf(1.5) --> 0.9332`` или ``Sample.erf(1.5) --> 0.9332``.

source: Since static methods return the underlying function with no changes, the example calls are unexciting:
ru: Поскольку статические методы возвращают базовую функцию без изменений, примеры вызовов неинтересны:

source: Using the non-data descriptor protocol, a pure Python version of :func:`staticmethod` would look like this:
ru: Используя протокол дескриптора без данных, версия :func:`staticmethod` на чистом Python будет выглядеть так:

source: The :func:`functools.update_wrapper` call adds a ``__wrapped__`` attribute that refers to the underlying function. Also it carries forward the attributes necessary to make the wrapper look like the wrapped function: :attr:`~function.__name__`, :attr:`~function.__qualname__`, :attr:`~function.__doc__`, and :attr:`~function.__annotations__`.
ru: Вызов :func:`functools.update_wrapper` добавляет атрибут ``__wrapped__``, который ссылается на базовую функцию. Также он переносит атрибуты, необходимые для того, чтобы оболочка выглядела как завернутая функция: :attr:`~function.__name__`, :attr:`~function.__qualname__`, :attr:`~function.__doc__` и :attr :`~function.__annotations__`.

source: Class methods
ru: Методы класса

source: Unlike static methods, class methods prepend the class reference to the argument list before calling the function. This format is the same for whether the caller is an object or a class:
ru: В отличие от статических методов, методы класса добавляют ссылку на класс в список аргументов перед вызовом функции. Этот формат одинаков для того, является ли вызывающий объект объектом или классом:

source: This behavior is useful whenever the method only needs to have a class reference and does not rely on data stored in a specific instance. One use for class methods is to create alternate class constructors. For example, the classmethod :func:`dict.fromkeys` creates a new dictionary from a list of keys. The pure Python equivalent is:
ru: Такое поведение полезно, когда методу требуется только ссылка на класс и он не полагается на данные, хранящиеся в конкретном экземпляре. Одним из применений методов класса является создание альтернативных конструкторов классов. Например, метод класса :func:`dict.fromkeys` создает новый словарь из списка ключей. Чистый эквивалент Python:

source: Now a new dictionary of unique keys can be constructed like this:
ru: Теперь новый словарь уникальных ключей можно создать следующим образом:

source: Using the non-data descriptor protocol, a pure Python version of :func:`classmethod` would look like this:
ru: Используя протокол дескриптора без данных, версия :func:`classmethod` на чистом Python будет выглядеть так:

source: The :func:`functools.update_wrapper` call in ``ClassMethod`` adds a ``__wrapped__`` attribute that refers to the underlying function. Also it carries forward the attributes necessary to make the wrapper look like the wrapped function: :attr:`~function.__name__`, :attr:`~function.__qualname__`, :attr:`~function.__doc__`, and :attr:`~function.__annotations__`.
ru: Вызов :func:`functools.update_wrapper` в ``ClassMethod`` добавляет атрибут ``__wrapped__``, который ссылается на базовую функцию. Также он переносит атрибуты, необходимые для того, чтобы оболочка выглядела как завернутая функция: :attr:`~function.__name__`, :attr:`~function.__qualname__`, :attr:`~function.__doc__` и :attr :`~function.__annotations__`.

source: Member objects and __slots__
ru: Объекты-члены и __slots__

source: When a class defines ``__slots__``, it replaces instance dictionaries with a fixed-length array of slot values. From a user point of view that has several effects:
ru: Когда класс определяет ``__slots__``, он заменяет словари экземпляров массивом значений слотов фиксированной длины. С точки зрения пользователя это имеет несколько эффектов:

source: 1. Provides immediate detection of bugs due to misspelled attribute assignments. Only attribute names specified in ``__slots__`` are allowed:
ru: 1. Обеспечивает немедленное обнаружение ошибок из-за неправильного назначения атрибутов. Разрешены только имена атрибутов, указанные в ``__slots__``:

source: 2. Helps create immutable objects where descriptors manage access to private attributes stored in ``__slots__``:
ru: 2. Помогает создавать неизменяемые объекты, в которых дескрипторы управляют доступом к частным атрибутам, хранящимся в ``__slots__``:

source: 3. Saves memory. On a 64-bit Linux build, an instance with two attributes takes 48 bytes with ``__slots__`` and 152 bytes without. This `flyweight design pattern <https://en.wikipedia.org/wiki/Flyweight_pattern>`_ likely only matters when a large number of instances are going to be created.
ru: 3. Экономит память. В 64-битной сборке Linux экземпляр с двумя атрибутами занимает 48 байт с ``__slots__`` и 152 байта без него. Этот `шаблон проектирования легковеса <https://en.wikipedia.org/wiki/Flyweight_pattern>`_, вероятно, имеет значение только тогда, когда будет создано большое количество экземпляров.

source: 4. Improves speed. Reading instance variables is 35% faster with ``__slots__`` (as measured with Python 3.10 on an Apple M1 processor).
ru: 4. Улучшает скорость. Чтение переменных экземпляра происходит на 35 % быстрее с помощью ``__slots__`` (по измерениям с помощью Python 3.10 на процессоре Apple M1).

source: 5. Blocks tools like :func:`functools.cached_property` which require an instance dictionary to function correctly:
ru: 5. Блокирует такие инструменты, как :func:`functools.cached_property`, для правильной работы которых требуется словарь экземпляра:

source: It is not possible to create an exact drop-in pure Python version of ``__slots__`` because it requires direct access to C structures and control over object memory allocation. However, we can build a mostly faithful simulation where the actual C structure for slots is emulated by a private ``_slotvalues`` list. Reads and writes to that private structure are managed by member descriptors:
ru: Невозможно создать точную версию ``__slots__`` на чистом Python, поскольку для этого требуется прямой доступ к структурам C и контроль над распределением памяти объекта. Тем не менее, мы можем построить наиболее точную симуляцию, в которой фактическая структура C для слотов эмулируется частным списком ``_slotvalues``. Чтение и запись в эту частную структуру управляются дескрипторами членов:

source: The :meth:`!type.__new__` method takes care of adding member objects to class variables:
ru: Метод :meth:`!type.__new__` заботится о добавлении объектов-членов в переменные класса:
