Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/howto/enum.po
Languages: es_es

source: An :class:`Enum` is a set of symbolic names bound to unique values. They are similar to global variables, but they offer a more useful :func:`repr`, grouping, type-safety, and a few other features.
es_es: :class:`Enum` es un conjunto de nombres simbólicos vinculados a valores únicos. Son similares a las variables globales, pero ofrecen un :func:`repr` más útil, agrupación, seguridad de tipos y algunas otras características.

source: They are most useful when you have a variable that can take one of a limited selection of values. For example, the days of the week::
es_es: Son más útiles cuando se tiene una variable que puede tomar uno de una selección limitada de valores. Por ejemplo, los días de la semana::

source: >>> from enum import Enum >>> class Weekday(Enum): ... MONDAY = 1 ... TUESDAY = 2 ... WEDNESDAY = 3 ... THURSDAY = 4 ... FRIDAY = 5 ... SATURDAY = 6 ... SUNDAY = 7
es_es: >>> from enum import Enum >>> class Día de la semana(Enum): ... LUNES = 1 ... MARTES = 2 ... MIÉRCOLES = 3 ... JUEVES = 4 ... VIERNES = 5 ... SÁBADO = 6 ... DOMINGO = 7

source: Or perhaps the RGB primary colors::
es_es: O quizás los colores primarios RGB::

source: >>> from enum import Enum >>> class Color(Enum): ... RED = 1 ... GREEN = 2 ... BLUE = 3
es_es: >>> from enum import Enum >>> class Color(Enum): ... ROJO = 1 ... VERDE = 2 ... AZUL = 3

source: As you can see, creating an :class:`Enum` is as simple as writing a class that inherits from :class:`Enum` itself.
es_es: Como puede ver, crear un :class:`Enum` es tan sencillo como escribir una clase que herede del propio :class:`Enum`.

source: Case of Enum Members
es_es: Caso de los miembros Enum

source: Because Enums are used to represent constants, and to help avoid issues with name clashes between mixin-class methods/attributes and enum names, we strongly recommend using UPPER_CASE names for members, and will be using that style in our examples.
es_es: Debido a que los Enums se utilizan para representar constantes, y para ayudar a evitar problemas de conflictos de nombres entre los métodos/atributos de la clase mixin y los nombres de los enum, recomendamos encarecidamente utilizar nombres en MAYÚSCULAS para los miembros, y utilizaremos ese estilo en nuestros ejemplos.

source: Depending on the nature of the enum a member's value may or may not be important, but either way that value can be used to get the corresponding member::
es_es: Dependiendo de la naturaleza del enum el valor de un miembro puede o no ser importante, pero en cualquier caso ese valor se puede utilizar para obtener el miembro correspondiente::

source: >>> Weekday(3) <Weekday.WEDNESDAY: 3>
es_es: >>> Día de la semana(3) <Weekday.WEDNESDAY: 3>

source: As you can see, the ``repr()`` of a member shows the enum name, the member name, and the value. The ``str()`` of a member shows only the enum name and member name::
es_es: Como puede ver, el ``repr()`` de un miembro muestra el nombre del enum, el nombre del miembro y el valor. El ``str()`` de un miembro sólo muestra el nombre del enum y el nombre del miembro::

source: >>> print(Weekday.THURSDAY) Weekday.THURSDAY
es_es: >>> print(Día.JUEVES) Día.JUEVES

source: The *type* of an enumeration member is the enum it belongs to::
es_es: El *tipo* de un miembro de enumeración es el enum al que pertenece::

source: >>> type(Weekday.MONDAY) <enum 'Weekday'> >>> isinstance(Weekday.FRIDAY, Weekday) True
es_es: >>> type(DiaSemana.LUNES) <enum 'Weekday'> >>> isinstance(DíaSemana.VIERNES, DíaSemana) True

source: Enum members have an attribute that contains just their :attr:`!name`::
es_es: Los miembros de Enum tienen un atributo que contiene sólo su :attr:`!name`::

source: >>> print(Weekday.TUESDAY.name) TUESDAY
es_es: >>> print(Día.MARTES.nombre) MARTES

source: Likewise, they have an attribute for their :attr:`!value`::
es_es: Asimismo, disponen de un atributo para su :attr:`!value`::

source: Unlike many languages that treat enumerations solely as name/value pairs, Python Enums can have behavior added. For example, :class:`datetime.date` has two methods for returning the weekday: :meth:`~datetime.date.weekday` and :meth:`~datetime.date.isoweekday`. The difference is that one of them counts from 0-6 and the other from 1-7. Rather than keep track of that ourselves we can add a method to the :class:`!Weekday` enum to extract the day from the :class:`~datetime.date` instance and return the matching enum member::
es_es: A diferencia de muchos lenguajes que tratan las enumeraciones únicamente como pares nombre/valor, a los Enums de Python se les puede añadir comportamiento. Por ejemplo, :class:`datetime.date` tiene dos métodos para devolver el día de la semana: :meth:`~datetime.date.weekday` y :meth:`~datetime.date.isoweekday`. La diferencia es que uno de ellos cuenta de 0 -6 y el otro de 1 -7. En lugar de llevar la cuenta nosotros mismos, podemos añadir un método al enum :class:`!Weekday` para extraer el día de la instancia :class:`~datetime.date` y devolver el miembro del enum que corresponda::

source: The complete :class:`!Weekday` enum now looks like this::
es_es: El enum :class:`!Weekday` completo tiene ahora este aspecto::

source: >>> class Weekday(Enum): ... MONDAY = 1 ... TUESDAY = 2 ... WEDNESDAY = 3 ... THURSDAY = 4 ... FRIDAY = 5 ... SATURDAY = 6 ... SUNDAY = 7 ... # ... @classmethod ... def from_date(cls, date): ... return cls(date.isoweekday())
es_es: >>> class Día de la semana(Enum): ... LUNES = 1 ... MARTES = 2 ... MIÉRCOLES = 3 ... JUEVES = 4 ... VIERNES = 5 ... SÁBADO = 6 ... DOMINGO = 7 ... # ... @classmethod ... def from_date(cls, date): ... return cls(date.isoweekday())

source: Now we can find out what today is! Observe::
es_es: ¡Ahora podemos averiguar qué día es hoy! Observa::

source: Of course, if you're reading this on some other day, you'll see that day instead.
es_es: Por supuesto, si estás leyendo esto otro día, verás ese día en su lugar.

source: This :class:`!Weekday` enum is great if our variable only needs one day, but what if we need several? Maybe we're writing a function to plot chores during a week, and don't want to use a :class:`list` -- we could use a different type of :class:`Enum`::
es_es: Este enum :class:`!Weekday` está muy bien si nuestra variable sólo necesita un día, pero ¿y si necesitamos varios? Tal vez estamos escribiendo una función para trazar las tareas durante una semana, y no queremos utilizar un :class:`list` -- podríamos utilizar un tipo diferente de :class:`Enum`::

source: >>> from enum import Flag >>> class Weekday(Flag): ... MONDAY = 1 ... TUESDAY = 2 ... WEDNESDAY = 4 ... THURSDAY = 8 ... FRIDAY = 16 ... SATURDAY = 32 ... SUNDAY = 64
es_es: >>> from enum import Flag >>> class Día de la semana(Bandera): ... LUNES = 1 ... MARTES = 2 ... MIÉRCOLES = 4 ... JUEVES = 8 ... VIERNES = 16 ... SÁBADO = 32 ... DOMINGO = 64

source: We've changed two things: we're inherited from :class:`Flag`, and the values are all powers of 2.
es_es: Hemos cambiado dos cosas: heredamos de :class:`Flag`, y los valores son todos potencias de 2.

source: Just like the original :class:`!Weekday` enum above, we can have a single selection::
es_es: Al igual que el original :class:`!Weekday` enum anterior, podemos tener una sola selección::

source: But :class:`Flag` also allows us to combine several members into a single variable::
es_es: Pero :class:`Flag` también nos permite combinar varios miembros en una sola variable::

source: You can even iterate over a :class:`Flag` variable::
es_es: Incluso puede iterar sobre una variable :class:`Flag`::

source: >>> for day in weekend: ... print(day) Weekday.SATURDAY Weekday.SUNDAY
es_es: >>> para día en fin de semana ... print(day) Día.SÁBADO Día.DOMINGO

source: Okay, let's get some chores set up::
es_es: Bueno, vamos a hacer algunas tareas::

source: And a function to display the chores for a given day::
es_es: Y una función para mostrar las tareas de un día determinado::

source: In cases where the actual values of the members do not matter, you can save yourself some work and use :func:`auto` for the values::
es_es: En los casos en que los valores reales de los miembros no importan, puede ahorrarse algo de trabajo y utilizar :func:`auto` para los valores::

source: >>> from enum import auto >>> class Weekday(Flag): ... MONDAY = auto() ... TUESDAY = auto() ... WEDNESDAY = auto() ... THURSDAY = auto() ... FRIDAY = auto() ... SATURDAY = auto() ... SUNDAY = auto() ... WEEKEND = SATURDAY | SUNDAY
es_es: >>> from enum import auto >>> class Día de la semana(Bandera): ... LUNES = auto() ... MARTES = auto() ... MIÉRCOLES = auto() ... JUEVES = auto() ... VIERNES = auto() ... SÁBADO = auto() ... DOMINGO = auto() ... FIN DE SEMANA = SÁBADO | DOMINGO

source: Programmatic access to enumeration members and their attributes
es_es: Acceso programático a los miembros de la enumeración y sus atributos

source: Sometimes it's useful to access members in enumerations programmatically (i.e. situations where ``Color.RED`` won't do because the exact color is not known at program-writing time). ``Enum`` allows such access::
es_es: A veces es útil acceder a los miembros de las enumeraciones mediante programación (es decir, en situaciones en las que ``Color.RED`` no sirve porque no se conoce el color exacto en el momento de escribir el programa). ``Enum`` permite este tipo de acceso::

source: If you want to access enum members by *name*, use item access::
es_es: Si desea acceder a los miembros del enum por *nombre*, utilice item access::

source: >>> Color['RED'] <Color.RED: 1> >>> Color['GREEN'] <Color.GREEN: 2>
es_es: >>> Color['RED'] <Color.RED: 1> >>> Color['VERDE'] <Color.GREEN: 2>

source: If you have an enum member and need its :attr:`!name` or :attr:`!value`::
es_es: Si tienes un miembro enum y necesitas su :attr:`!name` o :attr:`!value`::

source: Duplicating enum members and values
es_es: Duplicación de miembros y valores de enum

source: Having two enum members with the same name is invalid::
es_es: Tener dos miembros de enum con el mismo nombre no es válido::

source: However, an enum member can have other names associated with it. Given two entries ``A`` and ``B`` with the same value (and ``A`` defined first), ``B`` is an alias for the member ``A``. By-value lookup of the value of ``A`` will return the member ``A``. By-name lookup of ``A`` will return the member ``A``. By-name lookup of ``B`` will also return the member ``A``::
es_es: Sin embargo, un miembro de un enum puede tener asociados otros nombres. Dadas dos entradas ``A`` y ``B`` con el mismo valor (y ``A`` definido en primer lugar), ``B`` es un alias para el miembro ``A``. La búsqueda por valor del valor de ``A`` devolverá el miembro ``A``. La búsqueda por nombre de ``A`` devolverá el miembro ``A``. La búsqueda por nombre de ``B`` también devolverá el miembro ``A``::

source: Attempting to create a member with the same name as an already defined attribute (another member, a method, etc.) or attempting to create an attribute with the same name as a member is not allowed.
es_es: No está permitido intentar crear un miembro con el mismo nombre que un atributo ya definido (otro miembro, un método, etc.) ni intentar crear un atributo con el mismo nombre que un miembro.

source: Ensuring unique enumeration values
es_es: Garantizar valores de enumeración únicos

source: By default, enumerations allow multiple names as aliases for the same value. When this behavior isn't desired, you can use the :func:`unique` decorator::
es_es: Por defecto, las enumeraciones permiten múltiples nombres como alias para el mismo valor. Cuando no se desea este comportamiento, se puede utilizar el decorador :func:`unique`::

source: >>> from enum import Enum, unique >>> @unique ... class Mistake(Enum): ... ONE = 1 ... TWO = 2 ... THREE = 3 ... FOUR = 3 ... Traceback (most recent call last): ... ValueError: duplicate values found in <enum 'Mistake'>: FOUR -> THREE
es_es: >>> from enum import Enum, unique >>> @único ... clase Error(Enum): ... UNICO = 1 ... DOS = 2 ... TRES = 3 ... CUATRO = 3 ... Traceback (última llamada más reciente): ... ValueError: valores duplicados encontrados en <enum 'Mistake'>: CUATRO -> TRES

source: Using automatic values
es_es: Utilización de valores automáticos

source: If the exact value is unimportant you can use :class:`auto`::
es_es: Si el valor exacto no es importante, puede utilizar :class:`auto`::

source: >>> from enum import Enum, auto >>> class Color(Enum): ... RED = auto() ... BLUE = auto() ... GREEN = auto() ... >>> [member.value for member in Color] [1, 2, 3]
es_es: >>> from enum import Enum, auto >>> class Color(Enum): ... RED = auto() ... AZUL = auto() ... VERDE = auto() ... >>> [miembro.valor para miembro en Color] [1, 2, 3]

source: The values are chosen by :func:`~Enum._generate_next_value_`, which can be overridden::
es_es: Los valores son elegidos por :func:`~Enum._generate_next_value_`, que puede ser anulado::

source: >>> class AutoName(Enum): ... @staticmethod ... def _generate_next_value_(name, start, count, last_values): ... return name ... >>> class Ordinal(AutoName): ... NORTH = auto() ... SOUTH = auto() ... EAST = auto() ... WEST = auto() ... >>> [member.value for member in Ordinal] ['NORTH', 'SOUTH', 'EAST', 'WEST']
es_es: >>> class AutoNombre(Enum): ... @métodoestático ... def _generate_next_value_(name, start, count, last_values): ... return nombre ... >>> class Ordinal(AutoNombre): ... NORTE = auto() ... SUR = auto() ... ESTE = auto() ... OESTE = auto() ... >>> [miembro.valor para miembro en Ordinal] ['NORTE', 'SUR', 'ESTE', 'OESTE']

source: The :meth:`~Enum._generate_next_value_` method must be defined before any members.
es_es: El método :meth:`~Enum._generate_next_value_` debe definirse antes que cualquier miembro.

source: Iteration
es_es: Iteración

source: Iterating over the members of an enum does not provide the aliases::
es_es: Iterar sobre los miembros de un enum no proporciona los alias::

source: Note that the aliases ``Shape.ALIAS_FOR_SQUARE`` and ``Weekday.WEEKEND`` aren't shown.
es_es: Tenga en cuenta que los alias ``Shape.ALIAS_FOR_SQUARE`` y ``Weekday.WEEKEND`` no se muestran.

source: The special attribute ``__members__`` is a read-only ordered mapping of names to members. It includes all names defined in the enumeration, including the aliases::
es_es: El atributo especial ``__members__`` es una asignación ordenada de sólo lectura de nombres a miembros. Incluye todos los nombres definidos en la enumeración, incluidos los alias::

source: The ``__members__`` attribute can be used for detailed programmatic access to the enumeration members. For example, finding all the aliases::
es_es: El atributo ``__members__`` puede utilizarse para un acceso programático detallado a los miembros de la enumeración. Por ejemplo, para encontrar todos los alias::

source: Aliases for flags include values with multiple flags set, such as ``3``, and no flags set, i.e. ``0``.
es_es: Los alias de las banderas incluyen valores con múltiples banderas establecidas, como ``3``, y sin banderas establecidas, es decir, ``0``.

source: Comparisons
es_es: Comparaciones

source: Enumeration members are compared by identity::
es_es: Los miembros de la enumeración se comparan por identidad::

source: >>> Color.RED is Color.RED True >>> Color.RED is Color.BLUE False >>> Color.RED is not Color.BLUE True
es_es: >>> Color.ROJO es Color.ROJO Verdadero >>> Color.ROJO es Color.AZUL Falso >>> Color.ROJO no es Color.AZUL Verdadero

source: Ordered comparisons between enumeration values are *not* supported. Enum members are not integers (but see `IntEnum`_ below)::
es_es: Las comparaciones ordenadas entre valores de enumeración *no* están soportadas. Los miembros de la enumeración no son enteros (pero véase `IntEnum`_ más abajo)::

source: >>> Color.RED < Color.BLUE Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: '<' not supported between instances of 'Color' and 'Color'
es_es: >>> Color.ROJO < Color.AZUL Traceback (última llamada más reciente): File "<stdin>", line 1, in <module> TypeError: '<' no se admite entre instancias de 'Color' y 'Color'

source: Equality comparisons are defined though::
es_es: Las comparaciones de igualdad se definen mediante::

source: >>> Color.BLUE == Color.RED False >>> Color.BLUE != Color.RED True >>> Color.BLUE == Color.BLUE True
es_es: >>> Color.AZUL == Color.ROJO False >>> Color.AZUL != Color.ROJO True >>> Color.AZUL == Color.AZUL Verdadero

source: Comparisons against non-enumeration values will always compare not equal (again, :class:`IntEnum` was explicitly designed to behave differently, see below)::
es_es: Las comparaciones contra valores no enumerativos siempre compararán no iguales (de nuevo, :class:`IntEnum` se diseñó explícitamente para comportarse de forma diferente, ver más abajo)::

source: >>> Color.BLUE == 2 False
es_es: >>> Color.AZUL == 2 Falso

source: It is possible to reload modules -- if a reloaded module contains enums, they will be recreated, and the new members may not compare identical/equal to the original members.
es_es: Es posible recargar módulos -- si un módulo recargado contiene enums, éstos serán recreados, y los nuevos miembros pueden no comparar idénticos/iguales a los miembros originales.

source: Allowed members and attributes of enumerations
es_es: Miembros y atributos permitidos de las enumeraciones

source: Most of the examples above use integers for enumeration values. Using integers is short and handy (and provided by default by the `Functional API`_), but not strictly enforced. In the vast majority of use-cases, one doesn't care what the actual value of an enumeration is. But if the value *is* important, enumerations can have arbitrary values.
es_es: La mayoría de los ejemplos anteriores utilizan números enteros para los valores de enumeración. El uso de números enteros es breve y práctico (y la `API funcional`_ lo proporciona por defecto), pero no es estrictamente obligatorio. En la gran mayoría de los casos de uso, a uno no le importa cuál es el valor real de una enumeración. Pero si el valor *es* importante, las enumeraciones pueden tener valores arbitrarios.

source: Enumerations are Python classes, and can have methods and special methods as usual. If we have this enumeration::
es_es: Las enumeraciones son clases de Python, y pueden tener métodos y métodos especiales como es habitual. Si tenemos esta enumeración::

source: >>> class Mood(Enum): ... FUNKY = 1 ... HAPPY = 3 ... ... def describe(self): ... # self is the member here ... return self.name, self.value ... ... def __str__(self): ... return 'my custom str! {0}'.format(self.value) ... ... @classmethod ... def favorite_mood(cls): ... # cls here is the enumeration ... return cls.HAPPY ...
es_es: >>> class Mood(Enum): ... FUNKY = 1 ... HAPPY = 3 ... ... def describe(self): ... # self es el miembro aquí ... return self.name, self.value ... ... def __str__(self): ... return '¡mi cadena personalizada! {0}'.format(self.value) ... ... @classmethod ... def favorite_mood(cls): ... # cls aquí es la enumeración ... return cls.HAPPY ...

source: Then::
es_es: Entonces::

source: The rules for what is allowed are as follows: names that start and end with a single underscore are reserved by enum and cannot be used; all other attributes defined within an enumeration will become members of this enumeration, with the exception of special methods (:meth:`~object.__str__`, :meth:`~object.__add__`, etc.), descriptors (methods are also descriptors), and variable names listed in :attr:`~Enum._ignore_`.
es_es: Las reglas para lo que está permitido son las siguientes: los nombres que empiezan y terminan con un solo guión bajo están reservados por enum y no se pueden utilizar; todos los demás atributos definidos dentro de una enumeración se convertirán en miembros de esta enumeración, a excepción de los métodos especiales (:meth:`~object.__str__`, :meth:`~object.__add__`, etc.), los descriptores (los métodos también son descriptores) y los nombres de variables enumerados en :attr:`~Enum._ignore_`.

source: Note: if your enumeration defines :meth:`~object.__new__` and/or :meth:`~object.__init__`, any value(s) given to the enum member will be passed into those methods. See `Planet`_ for an example.
es_es: Nota: si su enumeración define :meth:`~object.__new__` y/o :meth:`~object.__init__`, cualquier valor(es) dado al miembro de la enumeración se pasará a esos métodos. Ver `Planet`_ para un ejemplo.

source: The :meth:`~object.__new__` method, if defined, is used during creation of the Enum members; it is then replaced by Enum's :meth:`~object.__new__` which is used after class creation for lookup of existing members. See :ref:`new-vs-init` for more details.
es_es: El método :meth:`~object.__new__`, si está definido, se utiliza durante la creación de los miembros de Enum; después se sustituye por :meth:`~object.__new__` de Enum que se utiliza después de la creación de la clase para buscar los miembros existentes. Véase :ref:`new-vs-init` para más detalles.

source: Restricted Enum subclassing
es_es: Subclasificación restringida de Enum

source: A new :class:`Enum` class must have one base enum class, up to one concrete data type, and as many :class:`object`-based mixin classes as needed. The order of these base classes is::
es_es: Una nueva clase :class:`Enum` debe tener una clase enum base, hasta un tipo de datos concreto y tantas clases mixtas basadas en :class:`object` como sean necesarias. El orden de estas clases base es::

source: Also, subclassing an enumeration is allowed only if the enumeration does not define any members. So this is forbidden::
es_es: Además, subclasificar una enumeración sólo está permitido si la enumeración no define ningún miembro. Así que esto está prohibido::

source: But this is allowed::
es_es: Pero esto está permitido::

source: Allowing subclassing of enums that define members would lead to a violation of some important invariants of types and instances. On the other hand, it makes sense to allow sharing some common behavior between a group of enumerations. (See `OrderedEnum`_ for an example.)
es_es: Permitir la subclasificación de enumeraciones que definen miembros llevaría a una violación de algunas invariantes importantes de tipos e instancias. Por otro lado, tiene sentido permitir compartir algún comportamiento común entre un grupo de enumeraciones. (Ver un ejemplo en `OrderedEnum`_ ).

source: Dataclass support
es_es: Soporte de clases de datos

source: When inheriting from a :class:`~dataclasses.dataclass`, the :meth:`~Enum.__repr__` omits the inherited class' name. For example::
es_es: Cuando se hereda de :class:`~dataclasses.dataclass`, :meth:`~Enum.__repr__` omite el nombre de la clase heredada. Por ejemplo::

source: Use the :func:`!dataclass` argument ``repr=False`` to use the standard :func:`repr`.
es_es: Utilice el argumento :func:`!dataclass` ``repr=False`` para utilizar el estándar :func:`repr`.

source: Only the dataclass fields are shown in the value area, not the dataclass' name.
es_es: Sólo se muestran los campos de la clase de datos en el área de valores, no el nombre de la clase de datos.

source: Pickling
es_es: Decapado

source: Enumerations can be pickled and unpickled::
es_es: Las enumeraciones pueden plantear problemas o no::

source: The usual restrictions for pickling apply: picklable enums must be defined in the top level of a module, since unpickling requires them to be importable from that module.
es_es: Se aplican las restricciones habituales para el pickling: los enums picklable deben definirse en el nivel superior de un módulo, ya que el unpickling requiere que sean importables desde ese módulo.
