Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/howto/enum.po
Languages: es_es

source: :meth:`~Enum._generate_next_value_` -- used by the `Functional API`_ and by :class:`auto` to get an appropriate value for an enum member; may be overridden
es_es: :meth:`~Enum._generate_next_value_` -- utilizado por la `Functional API`_ y por :class:`auto` para obtener un valor apropiado para un miembro de enum; se puede sobrescribir

source: For standard :class:`Enum` classes the next value chosen is the last value seen incremented by one.
es_es: Para las clases estándar :class:`Enum` el siguiente valor elegido es el último valor visto incrementado en uno.

source: For :class:`Flag` classes the next value chosen will be the next highest power-of-two, regardless of the last value seen.
es_es: Para las clases :class:`Flag` el siguiente valor elegido será la siguiente potencia de dos más alta, independientemente del último valor visto.

source: To help keep Python 2 / Python 3 code in sync an :attr:`~Enum._order_` attribute can be provided. It will be checked against the actual order of the enumeration and raise an error if the two do not match::
es_es: Para ayudar a mantener el código Python 2 / Python 3 en sincronía se puede proporcionar un atributo :attr:`~Enum._order_`. Se cotejará con el orden real de la enumeración y generará un error si ambos no coinciden::

source: >>> class Color(Enum): ... _order_ = 'RED GREEN BLUE' ... RED = 1 ... BLUE = 3 ... GREEN = 2 ... Traceback (most recent call last): ... TypeError: member order does not match _order_: ['RED', 'BLUE', 'GREEN'] ['RED', 'GREEN', 'BLUE']
es_es: >>> class Color(Enum): ... _order_ = 'ROJO VERDE AZUL' ... ROJO = 1 ... AZUL = 3 ... VERDE = 2 ... Traceback (última llamada más reciente): ... TypeError: member order does not match _order_: ['ROJO', 'AZUL', 'VERDE'] ['ROJO', 'VERDE', 'AZUL']

source: In Python 2 code the :attr:`~Enum._order_` attribute is necessary as definition order is lost before it can be recorded.
es_es: En el código Python 2 el atributo :attr:`~Enum._order_` es necesario ya que la orden de definición se pierde antes de poder ser registrada.

source: :ref:`Private names <private-name-mangling>` are not converted to enum members, but remain normal attributes.
es_es: :ref:`Private names <private-name-mangling>` no se convierten en miembros de enum, sino que siguen siendo atributos normales.

source: ``Enum`` member type
es_es: ``Enum`` tipo de miembro

source: Enum members are instances of their enum class, and are normally accessed as ``EnumClass.member``. In certain situations, such as writing custom enum behavior, being able to access one member directly from another is useful, and is supported; however, in order to avoid name clashes between member names and attributes/methods from mixed-in classes, upper-case names are strongly recommended.
es_es: Los miembros de una enum son instancias de su clase enum y normalmente se accede a ellos como ``EnumClass.member``. En ciertas situaciones, como al escribir un comportamiento de enum personalizado, es útil poder acceder a un miembro directamente desde otro, y está soportado; sin embargo, para evitar conflictos de nombres entre nombres de miembros y atributos/métodos de clases mezcladas, se recomiendan encarecidamente los nombres en mayúsculas.

source: Creating members that are mixed with other data types
es_es: Creación de miembros mezclados con otros tipos de datos

source: When subclassing other data types, such as :class:`int` or :class:`str`, with an :class:`Enum`, all values after the ``=`` are passed to that data type's constructor. For example::
es_es: Al subclasificar otros tipos de datos, como :class:`int` o :class:`str`, con un :class:`Enum`, todos los valores posteriores a ``=`` se pasan al constructor de ese tipo de datos. Por ejemplo::

source: Boolean value of ``Enum`` classes and members
es_es: Valor booleano de las clases y miembros de ``Enum``

source: Enum classes that are mixed with non-:class:`Enum` types (such as :class:`int`, :class:`str`, etc.) are evaluated according to the mixed-in type's rules; otherwise, all members evaluate as :data:`True`. To make your own enum's boolean evaluation depend on the member's value add the following to your class::
es_es: Las clases Enum que se mezclan con tipos que no son:class:`Enum` (como :class:`int`, :class:`str`, etc.) se evalúan según las reglas del tipo mezclado; de lo contrario, todos los miembros se evalúan como :data:`True`. Para hacer que la evaluación booleana de su propio enum dependa del valor del miembro, añada lo siguiente a su clase::

source: Plain :class:`Enum` classes always evaluate as :data:`True`.
es_es: Las clases simples de :class:`Enum` siempre se evalúan como :data:`True`.

source: ``Enum`` classes with methods
es_es: ``Enum`` clases con métodos

source: If you give your enum subclass extra methods, like the `Planet`_ class below, those methods will show up in a :func:`dir` of the member, but not of the class::
es_es: Si le das a tu subclase enum métodos extra, como la clase `Planet`_ de abajo, esos métodos aparecerán en un :func:`dir` del miembro, pero no de la clase::

source: Combining members of ``Flag``
es_es: Combinación de miembros de ``Flag``

source: Iterating over a combination of :class:`Flag` members will only return the members that are comprised of a single bit::
es_es: Al iterar sobre una combinación de miembros de :class:`Flag` sólo se devolverán los miembros que estén formados por un único bit::

source: >>> class Color(Flag): ... RED = auto() ... GREEN = auto() ... BLUE = auto() ... MAGENTA = RED | BLUE ... YELLOW = RED | GREEN ... CYAN = GREEN | BLUE ... >>> Color(3) # named combination <Color.YELLOW: 3> >>> Color(7) # not named combination <Color.RED|GREEN|BLUE: 7>
es_es: >>> class Color(Flag): ... ROJO = auto() ... VERDE = auto() ... AZUL = auto() ... MAGENTA = ROJO | AZUL ... AMARILLO = ROJO | VERDE ... CIAN = VERDE | AZUL ... >>> Color(3) # combinación con nombre <Color.YELLOW: 3> >>> Color(7) # combinación sin nombre <Color.ROJO|GREEN|AZUL: 7>

source: ``Flag`` and ``IntFlag`` minutia
es_es: ``Flag`` y ``IntFlag`` minucias

source: Using the following snippet for our examples::
es_es: Utilizando el siguiente fragmento para nuestros ejemplos::

source: >>> class Color(IntFlag): ... BLACK = 0 ... RED = 1 ... GREEN = 2 ... BLUE = 4 ... PURPLE = RED | BLUE ... WHITE = RED | GREEN | BLUE ...
es_es: >>> class Color(IntFlag): ... NEGRO = 0 ... ROJO = 1 ... VERDE = 2 ... AZUL = 4 ... MORADO = ROJO | AZUL ... BLANCO = ROJO | VERDE | AZUL ...

source: the following are true:
es_es: lo siguiente es cierto:

source: single-bit flags are canonical
es_es: las banderas de un solo bit son canónicas

source: multi-bit and zero-bit flags are aliases
es_es: las banderas de varios bits y de cero bits son alias

source: only canonical flags are returned during iteration::
es_es: sólo se devuelven las banderas canónicas durante la iteración::

source: >>> list(Color.WHITE) [<Color.RED: 1>, <Color.GREEN: 2>, <Color.BLUE: 4>]
es_es: >>> list(Color.BLANCO) [<Color.RED: 1>, <Color.GREEN: 2>, <Color.BLUE: 4>]

source: negating a flag or flag set returns a new flag/flag set with the corresponding positive integer value::
es_es: la negación de una bandera o conjunto de banderas devuelve una nueva bandera/conjunto de banderas con el correspondiente valor entero positivo::

source: >>> Color.BLUE <Color.BLUE: 4> >>> ~Color.BLUE <Color.RED|GREEN: 3>
es_es: >>> Color.AZUL <Color.BLUE: 4> >>> ~Color.BLUE <Color.RED|GREEN: 3>

source: names of pseudo-flags are constructed from their members' names::
es_es: los nombres de las pseudobanderas se construyen a partir de los nombres de sus miembros::

source: >>> (Color.RED | Color.GREEN).name 'RED|GREEN' >>> class Perm(IntFlag): ... R = 4 ... W = 2 ... X = 1 ... >>> (Perm.R & Perm.W).name is None # effectively Perm(0) True
es_es: >>> (Color.ROJO | Color.VERDE).name 'ROJO|VERDE' >>> class Perm(IntFlag): ... R = 4 ... W = 2 ... X = 1 ... >>> (Perm.R & Perm.W).name es None # efectivamente Perm(0) True

source: multi-bit flags, aka aliases, can be returned from operations::
es_es: las banderas multibit, alias, pueden ser devueltas por las operaciones::

source: >>> Color.RED | Color.BLUE <Color.PURPLE: 5> >>> Color(7) # or Color(-1) <Color.WHITE: 7> >>> Color(0) <Color.BLACK: 0>
es_es: >>> Color.ROJO | Color.AZUL <Color.PURPURA: 5> >>> Color(7) # or Color(-1) <Color.BLANCO: 7> >>> Color(0) < Color.NEGRO: 0>

source: membership / containment checking: zero-valued flags are always considered to be contained::
es_es: comprobación de pertenencia/contención: las banderas de valor cero siempre se consideran contenidas::

source: >>> Color.BLACK in Color.WHITE True
es_es: >>> Color.NEGRO en Color.BLANCO Verdadero

source: otherwise, only if all bits of one flag are in the other flag will True be returned::
es_es: de lo contrario, sólo si todos los bits de una bandera están en la otra bandera se devolverá True::

source: >>> Color.PURPLE in Color.WHITE True >>> Color.GREEN in Color.PURPLE False
es_es: >>> Color.PURPURA en Color.BLANCO Verdadero >>> Color.VERDE en Color.PURPURA Falso

source: There is a new boundary mechanism that controls how out-of-range / invalid bits are handled: ``STRICT``, ``CONFORM``, ``EJECT``, and ``KEEP``:
es_es: Existe un nuevo mecanismo de límites que controla cómo se gestionan los bits fuera de rango / no válidos: ``STRICT``, ``CONFORM``, ``EJECT``, y ``KEEP``:

source: STRICT --> raises an exception when presented with invalid values
es_es: STRICT --> lanza una excepción cuando se presentan valores no válidos

source: CONFORM --> discards any invalid bits
es_es: CONFORM --> descarta los bits no válidos

source: EJECT --> lose Flag status and become a normal int with the given value
es_es: EJECT --> pierde el estado Flag y se convierte en un int normal con el valor dado

source: KEEP --> keep the extra bits
es_es: KEEP --> mantener los bits adicionales

source: keeps Flag status and extra bits
es_es: mantiene el estado del indicador y los bits adicionales

source: extra bits do not show up in iteration
es_es: los bits adicionales no aparecen en la iteración

source: extra bits do show up in repr() and str()
es_es: los bits adicionales aparecen en repr() y str()

source: The default for Flag is ``STRICT``, the default for ``IntFlag`` is ``EJECT``, and the default for ``_convert_`` is ``KEEP`` (see ``ssl.Options`` for an example of when ``KEEP`` is needed).
es_es: El valor predeterminado para Flag es ``STRICT``, el valor predeterminado para ``IntFlag`` es ``EJECT``, y el valor predeterminado para ``_convert_`` es ``KEEP`` (consulte ``ssl.Options`` para ver un ejemplo de cuándo se necesita ``KEEP`` ).

source: How are Enums and Flags different?
es_es: ¿En qué se diferencian los Enums y los Flags?

source: Enums have a custom metaclass that affects many aspects of both derived :class:`Enum` classes and their instances (members).
es_es: Los Enums tienen una metaclase personalizada que afecta a muchos aspectos tanto de las clases derivadas :class:`Enum` como de sus instancias (miembros).

source: Enum Classes
es_es: Clases Enum

source: The :class:`EnumType` metaclass is responsible for providing the :meth:`~object.__contains__`, :meth:`~object.__dir__`, :meth:`~object.__iter__` and other methods that allow one to do things with an :class:`Enum` class that fail on a typical class, such as ``list(Color)`` or ``some_enum_var in Color``. :class:`EnumType` is responsible for ensuring that various other methods on the final :class:`Enum` class are correct (such as :meth:`~object.__new__`, :meth:`~object.__getnewargs__`, :meth:`~object.__str__` and :meth:`~object.__repr__`).
es_es: La metaclase :class:`EnumType` es responsable de proporcionar los métodos :meth:`~object.__contains__`, :meth:`~object.__dir__`, :meth:`~object.__iter__` y otros que permiten hacer cosas con una clase :class:`Enum` que fallan en una clase típica, como ``list(Color)`` o ``some_enum_var in Color``. :class:`EnumType` es responsable de asegurar que varios otros métodos en la clase final :class:`Enum` sean correctos (como :meth:`~object.__new__`, :meth:`~object.__getnewargs__`, :meth:`~object.__str__` y :meth:`~object.__repr__`).

source: Flag Classes
es_es: Clases de banderas

source: Flags have an expanded view of aliasing: to be canonical, the value of a flag needs to be a power-of-two value, and not a duplicate name. So, in addition to the :class:`Enum` definition of alias, a flag with no value (a.k.a. ``0``) or with more than one power-of-two value (e.g. ``3``) is considered an alias.
es_es: Las banderas tienen una visión ampliada de los alias: para ser canónica, el valor de una bandera debe ser un valor de potencia de dos, y no un nombre duplicado. Así, además de la definición de alias de :class:`Enum`, una bandera sin valor (también conocida como ``0``) o con más de un valor de potencia de dos (por ejemplo, ``3``) se considera un alias.

source: Enum Members (aka instances)
es_es: Miembros de Enum (también conocidos como instancias)

source: The most interesting thing about enum members is that they are singletons. :class:`EnumType` creates them all while it is creating the enum class itself, and then puts a custom :meth:`~object.__new__` in place to ensure that no new ones are ever instantiated by returning only the existing member instances.
es_es: Lo más interesante de los miembros de enum es que son singletons. :class:`EnumType` los crea todos mientras crea la propia clase enum y, a continuación, coloca un :meth:`~object.__new__` personalizado para garantizar que nunca se instancien nuevos miembros devolviendo sólo las instancias de los miembros existentes.

source: Flag Members
es_es: Abanderados

source: Flag members can be iterated over just like the :class:`Flag` class, and only the canonical members will be returned. For example::
es_es: Se puede iterar sobre los miembros de la bandera igual que en la clase :class:`Flag`, y sólo se devolverán los miembros canónicos. Por ejemplo::

source: (Note that ``BLACK``, ``PURPLE``, and ``WHITE`` do not show up.)
es_es: (Observe que ``BLACK``, ``PURPLE`` y ``WHITE`` no aparecen).

source: Inverting a flag member returns the corresponding positive value, rather than a negative value --- for example::
es_es: Invertir un miembro de la bandera devuelve el valor positivo correspondiente, en lugar de un valor negativo --- por ejemplo::

source: Flag members have a length corresponding to the number of power-of-two values they contain. For example::
es_es: Los indicadores tienen una longitud correspondiente al número de potencias de dos que contienen. Por ejemplo::

source: While :class:`Enum`, :class:`IntEnum`, :class:`StrEnum`, :class:`Flag`, and :class:`IntFlag` are expected to cover the majority of use-cases, they cannot cover them all. Here are recipes for some different types of enumerations that can be used directly, or as examples for creating one's own.
es_es: Aunque se espera que :class:`Enum`, :class:`IntEnum`, :class:`StrEnum`, :class:`Flag`, y :class:`IntFlag` cubran la mayoría de los casos de uso, no pueden abarcarlos todos. A continuación se presentan recetas para algunos tipos diferentes de enumeraciones que pueden utilizarse directamente, o como ejemplos para crear las propias.

source: Omitting values
es_es: Omisión de valores

source: In many use-cases, one doesn't care what the actual value of an enumeration is. There are several ways to define this type of simple enumeration:
es_es: En muchos casos de uso, a uno no le importa cuál es el valor real de una enumeración. Hay varias formas de definir este tipo de enumeración simple:

source: use instances of :class:`auto` for the value
es_es: utilizar instancias de :class:`auto` para el valor

source: use instances of :class:`object` as the value
es_es: utilizar instancias de :class:`object` como valor

source: use a descriptive string as the value
es_es: utilizar una cadena descriptiva como valor

source: use a tuple as the value and a custom :meth:`~object.__new__` to replace the tuple with an :class:`int` value
es_es: utilizar una tupla como valor y un :meth:`~object.__new__` personalizado para sustituir la tupla por un valor :class:`int`

source: Using any of these methods signifies to the user that these values are not important, and also enables one to add, remove, or reorder members without having to renumber the remaining members.
es_es: El uso de cualquiera de estos métodos indica al usuario que estos valores no son importantes, y también permite añadir, eliminar o reordenar miembros sin tener que renumerar el resto de miembros.

source: Using :class:`auto`
es_es: Utilizando :class:`auto`

source: Using :class:`auto` would look like::
es_es: Utilizando :class:`auto` quedaría así::

source: >>> class Color(Enum): ... RED = auto() ... BLUE = auto() ... GREEN = auto() ... >>> Color.GREEN <Color.GREEN: 3>
es_es: >>> class Color(Enum): ... RED = auto() ... AZUL = auto() ... VERDE = auto() ... >>> Color.VERDE <Color.VERDE: 3>

source: Using :class:`object`
es_es: Utilizando :class:`object`

source: Using :class:`object` would look like::
es_es: Utilizando :class:`object` quedaría así::

source: >>> class Color(Enum): ... RED = object() ... GREEN = object() ... BLUE = object() ... >>> Color.GREEN <Color.GREEN: <object object at 0x...>>
es_es: >>> class Color(Enum): ... ROJO = object() ... VERDE = object() ... AZUL = object() ... >>> Color.VERDE <Color.VERDE: <object object at 0x...>>

source: This is also a good example of why you might want to write your own :meth:`~object.__repr__`::
es_es: Este es también un buen ejemplo de por qué le conviene escribir su propia :meth:`~object.__repr__`::

source: >>> class Color(Enum): ... RED = object() ... GREEN = object() ... BLUE = object() ... def __repr__(self): ... return "<%s.%s>" % (self.__class__.__name__, self._name_) ... >>> Color.GREEN <Color.GREEN>
es_es: >>> class Color(Enum): ... ROJO = object() ... VERDE = object() ... AZUL = object() ... def __repr__(self): ... return "<%s.%s>" % (self.__class__.__name__, self._name_) ... >>> Color.VERDE <Color.VERDE>

source: Using a descriptive string
es_es: Utilizar una cadena descriptiva

source: Using a string as the value would look like::
es_es: Utilizando una cadena como valor quedaría así::

source: >>> class Color(Enum): ... RED = 'stop' ... GREEN = 'go' ... BLUE = 'too fast!' ... >>> Color.GREEN <Color.GREEN: 'go'>
es_es: >>> class Color(Enum): ... ROJO = 'stop' ... VERDE = 'go' ... AZUL = '¡demasiado rápido! ... >>> Color.VERDE <Color.VERDE: 'go'>

source: Using a custom :meth:`~object.__new__`
es_es: Utilizar un :meth:`~object.__new__`

source: Using an auto-numbering :meth:`~object.__new__` would look like::
es_es: Utilizando una numeración automática :meth:`~object.__new__` quedaría así::

source: >>> class AutoNumber(Enum): ... def __new__(cls): ... value = len(cls.__members__) + 1 ... obj = object.__new__(cls) ... obj._value_ = value ... return obj ... >>> class Color(AutoNumber): ... RED = () ... GREEN = () ... BLUE = () ... >>> Color.GREEN <Color.GREEN: 2>
es_es: >>> class AutoNumber(Enum): ... def __new__(cls): ... value = len(cls.__members__) + 1 ... obj = object.__new__(cls) ... obj._value_ = value ... return obj ... >>> class Color(AutoNumber): ... ROJO = () ... VERDE = () ... AZUL = () ... >>> Color.VERDE <Color.VERDE: 2>

source: To make a more general purpose ``AutoNumber``, add ``*args`` to the signature::
es_es: Para hacer un uso más general de ``AutoNumber``, añada ``*args`` a la firma::

source: >>> class AutoNumber(Enum): ... def __new__(cls, *args): # this is the only change from above ... value = len(cls.__members__) + 1 ... obj = object.__new__(cls) ... obj._value_ = value ... return obj ...
es_es: >>> class AutoNumber(Enum): ... def __new__(cls, *args): # este es el único cambio ... value = len(cls.__members__) + 1 ... obj = object.__new__(cls) ... obj._value_ = value ... return obj ...

source: Then when you inherit from ``AutoNumber`` you can write your own ``__init__`` to handle any extra arguments::
es_es: Entonces cuando heredes de ``AutoNumber`` puedes escribir tu propio ``__init__`` para manejar cualquier argumento extra::

source: >>> class Swatch(AutoNumber): ... def __init__(self, pantone='unknown'): ... self.pantone = pantone ... AUBURN = '3497' ... SEA_GREEN = '1246' ... BLEACHED_CORAL = () # New color, no Pantone code yet! ... >>> Swatch.SEA_GREEN <Swatch.SEA_GREEN: 2> >>> Swatch.SEA_GREEN.pantone '1246' >>> Swatch.BLEACHED_CORAL.pantone 'unknown'
es_es: >>> class Swatch(AutoNumber): ... def __init__(self, pantone='desconocido'): ... self.pantone = pantone ... AUBURN = '3497' ... VERDE_MAR = '1246' ... BLEACHED_CORAL = () # ¡Nuevo color, aún sin código Pantone! ... >>> Swatch.VERDE_MAR <Swatch.VERDE_MAR: 2> >>> Swatch.VERDE_MAR.pantone '1246' >>> Swatch.BLEACHED_CORAL.pantone 'unknown'

source: The :meth:`~object.__new__` method, if defined, is used during creation of the Enum members; it is then replaced by Enum's :meth:`~object.__new__` which is used after class creation for lookup of existing members.
es_es: El método :meth:`~object.__new__`, si está definido, se utiliza durante la creación de los miembros de Enum; después se sustituye por :meth:`~object.__new__` de Enum, que se utiliza tras la creación de la clase para buscar los miembros existentes.

source: *Do not* call ``super().__new__()``, as the lookup-only ``__new__`` is the one that is found; instead, use the data type directly -- e.g.::
es_es: *No* llame a ``super().__new__()``, ya que la búsqueda sólo ``__new__`` es la que se encuentra; en su lugar, utilice el tipo de datos directamente -- por ejemplo::

source: An ordered enumeration that is not based on :class:`IntEnum` and so maintains the normal :class:`Enum` invariants (such as not being comparable to other enumerations)::
es_es: Una enumeración ordenada que no se basa en :class:`IntEnum` y, por tanto, mantiene las invariantes normales de :class:`Enum` (como no ser comparable con otras enumeraciones)::

source: Raises an error if a duplicate member value is found instead of creating an alias::
es_es: Genera un error si se encuentra un valor de miembro duplicado en lugar de crear un alias::

source: >>> class DuplicateFreeEnum(Enum): ... def __init__(self, *args): ... cls = self.__class__ ... if any(self.value == e.value for e in cls): ... a = self.name ... e = cls(self.value).name ... raise ValueError( ... "aliases not allowed in DuplicateFreeEnum: %r --> %r" ... % (a, e)) ... >>> class Color(DuplicateFreeEnum): ... RED = 1 ... GREEN = 2 ... BLUE = 3 ... GRENE = 2 ... Traceback (most recent call last): ... ValueError: aliases not allowed in DuplicateFreeEnum: 'GRENE' --> 'GREEN'
es_es: >>> class DuplicateFreeEnum(Enum): ... def __init__(self, *args): ... cls = self.__class__ ... if any(self.value == e.value for e in cls): ... a = self.name ... e = cls(self.value).name ... raise ValueError( ... "alias no permitidos en DuplicateFreeEnum: %r --> %r" ... % (a, e)) ... >>> class Color(DuplicateFreeEnum): ... ROJO = 1 ... VERDE = 2 ... AZUL = 3 ... VERDE = 2 ... Traceback (última llamada más reciente): ... ValueError: aliases not allowed in DuplicateFreeEnum: 'GRENE' --> 'GREEN'

source: This is a useful example for subclassing Enum to add or change other behaviors as well as disallowing aliases. If the only desired change is disallowing aliases, the :func:`unique` decorator can be used instead.
es_es: Este es un ejemplo útil para subclasificar Enum para añadir o cambiar otros comportamientos, así como para no permitir alias. Si el único cambio deseado es no permitir alias, se puede utilizar el decorador :func:`unique`.

source: Planet
es_es: Planeta
