Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/howto/enum.po
Languages: es_es

source: If :meth:`~object.__new__` or :meth:`~object.__init__` is defined, the value of the enum member will be passed to those methods::
es_es: Si se define :meth:`~object.__new__` o :meth:`~object.__init__`, el valor del miembro del enum se pasará a esos métodos::

source: >>> class Planet(Enum): ... MERCURY = (3.303e+23, 2.4397e6) ... VENUS = (4.869e+24, 6.0518e6) ... EARTH = (5.976e+24, 6.37814e6) ... MARS = (6.421e+23, 3.3972e6) ... JUPITER = (1.9e+27, 7.1492e7) ... SATURN = (5.688e+26, 6.0268e7) ... URANUS = (8.686e+25, 2.5559e7) ... NEPTUNE = (1.024e+26, 2.4746e7) ... def __init__(self, mass, radius): ... self.mass = mass # in kilograms ... self.radius = radius # in meters ... @property ... def surface_gravity(self): ... # universal gravitational constant (m3 kg-1 s-2) ... G = 6.67300E-11 ... return G * self.mass / (self.radius * self.radius) ... >>> Planet.EARTH.value (5.976e+24, 6378140.0) >>> Planet.EARTH.surface_gravity 9.802652743337129
es_es: >>> class Planet(Enum): ... MERCURIO = (3.303e+23, 2.4397e6) ... VENUS = (4.869e+24, 6.0518e6) ... TIERRA = (5,976e+24, 6,37814e6) ... MARTE = (6,421e+23, 3,3972e6) ... JÚPITER = (1,9e+27, 7,1492e7) ... SATURNO = (5,688e+26, 6,0268e7) ... URANO = (8,686e+25, 2,5559e7) ... NEPTUNO = (1.024e+26, 2.4746e7) ... def __init__(self, mass, radius): ... self.mass = masa # en kilogramos ... self.radio = radio # en metros ... @propiedad ... def surface_gravity(self): ... # constante gravitatoria universal (m3 kg-1 s-2) ... G = 6.67300E-11 ... return G * masa propia / (radio propio * radio propio) ... >>> Planeta.TIERRA.valor (5.976e+24, 6378140.0) >>> Planet.EARTH.surface_gravity 9.802652743337129

source: An example to show the :attr:`~Enum._ignore_` attribute in use::
es_es: Un ejemplo para mostrar el atributo :attr:`~Enum._ignore_` en uso::

source: Subclassing EnumType
es_es: Subclasificación de EnumType

source: While most enum needs can be met by customizing :class:`Enum` subclasses, either with class decorators or custom functions, :class:`EnumType` can be subclassed to provide a different Enum experience.
es_es: Mientras que la mayoría de las necesidades de enum se pueden satisfacer personalizando las subclases de :class:`Enum`, ya sea con decoradores de clase o funciones personalizadas, :class:`EnumType` se puede subclasificar para proporcionar una experiencia Enum diferente.
