Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/howto/enum.po
Languages: es_es

source: With pickle protocol version 4 it is possible to easily pickle enums nested in other classes.
es_es: Con la versión 4 del protocolo pickle es posible recoger fácilmente enums anidados en otras clases.

source: It is possible to modify how enum members are pickled/unpickled by defining :meth:`~object.__reduce_ex__` in the enumeration class. The default method is by-value, but enums with complicated values may want to use by-name::
es_es: Es posible modificar la forma en que los miembros de la enumeración se seleccionan/deseleccionan definiendo :meth:`~object.__reduce_ex__` en la clase de enumeración. El método por defecto es by-value, pero los enum con valores complicados pueden querer usar by-name::

source: Using by-name for flags is not recommended, as unnamed aliases will not unpickle.
es_es: No se recomienda utilizar by-name para las banderas, ya que los alias sin nombre no se despicarán.

source: Functional API
es_es: API funcional

source: The :class:`Enum` class is callable, providing the following functional API::
es_es: Se puede invocar la clase :class:`Enum`, proporcionando la siguiente API funcional::

source: The semantics of this API resemble :class:`~collections.namedtuple`. The first argument of the call to :class:`Enum` is the name of the enumeration.
es_es: La semántica de esta API es similar a la de :class:`~collections.namedtuple`. El primer argumento de la llamada a :class:`Enum` es el nombre de la enumeración.

source: The second argument is the *source* of enumeration member names. It can be a whitespace-separated string of names, a sequence of names, a sequence of 2-tuples with key/value pairs, or a mapping (e.g. dictionary) of names to values. The last two options enable assigning arbitrary values to enumerations; the others auto-assign increasing integers starting with 1 (use the ``start`` parameter to specify a different starting value). A new class derived from :class:`Enum` is returned. In other words, the above assignment to :class:`!Animal` is equivalent to::
es_es: El segundo argumento es la *fuente* de los nombres de los miembros de la enumeración. Puede ser una cadena de nombres separada por espacios en blanco, una secuencia de nombres, una secuencia de 2-tuplas con pares clave/valor o un mapeo (por ejemplo, un diccionario) de nombres a valores. Las dos últimas opciones permiten asignar valores arbitrarios a las enumeraciones; las demás autoasignan enteros crecientes empezando por 1 (utilice el parámetro ``start`` para especificar un valor inicial diferente). Se devuelve una nueva clase derivada de :class:`Enum`. En otras palabras, la asignación anterior a :class:`!Animal` es equivalente a::

source: >>> class Animal(Enum): ... ANT = 1 ... BEE = 2 ... CAT = 3 ... DOG = 4 ...
es_es: >>> class Animal(Enum): ... HORMIGA = 1 ... ABEJA = 2 ... GATO = 3 ... PERRO = 4 ...

source: The reason for defaulting to ``1`` as the starting number and not ``0`` is that ``0`` is ``False`` in a boolean sense, but by default enum members all evaluate to ``True``.
es_es: La razón por la que ``1`` es el número de inicio y no ``0`` es que ``0`` es ``False`` en un sentido booleano, pero por defecto todos los miembros del enum se evalúan a ``True``.

source: Pickling enums created with the functional API can be tricky as frame stack implementation details are used to try and figure out which module the enumeration is being created in (e.g. it will fail if you use a utility function in a separate module, and also may not work on IronPython or Jython). The solution is to specify the module name explicitly as follows::
es_es: La recolección de enumeraciones creadas con la API funcional puede ser complicada, ya que los detalles de implementación de la pila de marcos se utilizan para tratar de averiguar en qué módulo se está creando la enumeración (por ejemplo, fallará si se utiliza una función de utilidad en un módulo separado, y también puede no funcionar en IronPython o Jython). La solución es especificar el nombre del módulo explícitamente de la siguiente manera::

source: If ``module`` is not supplied, and Enum cannot determine what it is, the new Enum members will not be unpicklable; to keep errors closer to the source, pickling will be disabled.
es_es: Si no se proporciona ``module``, y Enum no puede determinar qué es, los nuevos miembros de Enum no serán unpicklable; para mantener los errores más cerca de la fuente, se desactivará el pickling.

source: The new pickle protocol 4 also, in some circumstances, relies on :attr:`~type.__qualname__` being set to the location where pickle will be able to find the class. For example, if the class was made available in class SomeData in the global scope::
es_es: El nuevo protocolo pickle 4 también, en algunas circunstancias, depende de que :attr:`~type.__qualname__` se establezca en la ubicación donde pickle podrá encontrar la clase. Por ejemplo, si la clase se puso a disposición en la clase SomeData en el ámbito global::

source: The complete signature is::
es_es: La firma completa es::

source: *value*: What the new enum class will record as its name.
es_es: *value*: Lo que la nueva clase enum registrará como nombre.

source: *names*: The enum members. This can be a whitespace- or comma-separated string (values will start at 1 unless otherwise specified)::
es_es: *names*: Los miembros del enum. Puede ser una cadena separada por comas o por espacios en blanco (los valores empezarán en 1 a menos que se especifique lo contrario)::

source: 'RED GREEN BLUE' | 'RED,GREEN,BLUE' | 'RED, GREEN, BLUE'
es_es: 'ROJO VERDE AZUL' | 'ROJO,VERDE,AZUL' | 'ROJO, VERDE, AZUL'

source: or an iterator of names::
es_es: o un iterador de nombres::

source: ['RED', 'GREEN', 'BLUE']
es_es: ['ROJO', 'VERDE', 'AZUL']

source: or an iterator of (name, value) pairs::
es_es: o un iterador de pares (nombre, valor)::

source: [('CYAN', 4), ('MAGENTA', 5), ('YELLOW', 6)]
es_es: [('CIAN', 4), ('MAGENTA', 5), ('AMARILLO', 6)]

source: or a mapping::
es_es: o un mapeo::

source: {'CHARTREUSE': 7, 'SEA_GREEN': 11, 'ROSEMARY': 42}
es_es: {'CHARTREUSE': 7, 'VERDE_MAR': 11, 'ROSEMARY': 42}

source: *module*: name of module where new enum class can be found.
es_es: *module*: nombre del módulo donde se encuentra la nueva clase enum.

source: *qualname*: where in module new enum class can be found.
es_es: *qualname*: dónde en el módulo se puede encontrar la nueva clase enum.

source: *type*: type to mix in to new enum class.
es_es: *type*: tipo para mezclar en la nueva clase enum.

source: *start*: number to start counting at if only names are passed in.
es_es: *start*: número para empezar a contar si sólo se pasan nombres.

source: The *start* parameter was added.
es_es: Se ha añadido el parámetro *start*.

source: Derived Enumerations
es_es: Enumeraciones derivadas

source: The first variation of :class:`Enum` that is provided is also a subclass of :class:`int`. Members of an :class:`IntEnum` can be compared to integers; by extension, integer enumerations of different types can also be compared to each other::
es_es: La primera variación de :class:`Enum` que se proporciona es también una subclase de :class:`int`. Los miembros de un :class:`IntEnum` pueden compararse con enteros; por extensión, las enumeraciones de enteros de diferentes tipos también pueden compararse entre sí::

source: However, they still can't be compared to standard :class:`Enum` enumerations::
es_es: Sin embargo, siguen sin poder compararse con las enumeraciones estándar de :class:`Enum`::

source: >>> class Shape(IntEnum): ... CIRCLE = 1 ... SQUARE = 2 ... >>> class Color(Enum): ... RED = 1 ... GREEN = 2 ... >>> Shape.CIRCLE == Color.RED False
es_es: >>> class Forma(IntEnum): ... CIRCULO = 1 ... CUADRADO = 2 ... >>> class Color(Enum): ... ROJO = 1 ... VERDE = 2 ... >>> Shape.CIRCLE == Color.RED False

source: :class:`IntEnum` values behave like integers in other ways you'd expect::
es_es: :class:`IntEnum` se comportan como enteros en otros aspectos que cabría esperar::

source: The second variation of :class:`Enum` that is provided is also a subclass of :class:`str`. Members of a :class:`StrEnum` can be compared to strings; by extension, string enumerations of different types can also be compared to each other.
es_es: La segunda variación de :class:`Enum` que se proporciona también es una subclase de :class:`str`. Los miembros de un :class:`StrEnum` pueden compararse con cadenas; por extensión, las enumeraciones de cadenas de diferentes tipos también pueden compararse entre sí.

source: The next variation of :class:`Enum` provided, :class:`IntFlag`, is also based on :class:`int`. The difference being :class:`IntFlag` members can be combined using the bitwise operators (&, \|, ^, ~) and the result is still an :class:`IntFlag` member, if possible. Like :class:`IntEnum`, :class:`IntFlag` members are also integers and can be used wherever an :class:`int` is used.
es_es: La siguiente variación de :class:`Enum` proporcionada, :class:`IntFlag`, también se basa en :class:`int`. La diferencia es que los miembros de :class:`IntFlag` pueden combinarse utilizando los operadores bit a bit (&, ||, ^, ~) y el resultado sigue siendo un miembro de :class:`IntFlag`, si es posible. Al igual que :class:`IntEnum`, los miembros de :class:`IntFlag` también son enteros y pueden utilizarse siempre que se utilice :class:`int`.

source: Any operation on an :class:`IntFlag` member besides the bit-wise operations will lose the :class:`IntFlag` membership.
es_es: Cualquier operación sobre un miembro de :class:`IntFlag` además de las operaciones bit a bit perderá la pertenencia a :class:`IntFlag`.

source: Bit-wise operations that result in invalid :class:`IntFlag` values will lose the :class:`IntFlag` membership. See :class:`FlagBoundary` for details.
es_es: Las operaciones bit a bit que resulten en valores no válidos de :class:`IntFlag` perderán la pertenencia a :class:`IntFlag`. Ver :class:`FlagBoundary` para más detalles.

source: Sample :class:`IntFlag` class::
es_es: Clase de muestra :class:`IntFlag`::

source: It is also possible to name the combinations::
es_es: También es posible nombrar las combinaciones::

source: Named combinations are considered aliases. Aliases do not show up during iteration, but can be returned from by-value lookups.
es_es: Las combinaciones con nombre se consideran alias. Los alias no se muestran durante la iteración, pero pueden devolverse desde búsquedas por valor.

source: Another important difference between :class:`IntFlag` and :class:`Enum` is that if no flags are set (the value is 0), its boolean evaluation is :data:`False`::
es_es: Otra diferencia importante entre :class:`IntFlag` y :class:`Enum` es que si no hay banderas (el valor es 0), su evaluación booleana es :data:`False`::

source: Because :class:`IntFlag` members are also subclasses of :class:`int` they can be combined with them (but may lose :class:`IntFlag` membership::
es_es: Dado que los miembros de :class:`IntFlag` también son subclases de :class:`int`, pueden combinarse con ellos (pero pueden perder la pertenencia a :class:`IntFlag`::

source: The negation operator, ``~``, always returns an :class:`IntFlag` member with a positive value::
es_es: El operador de negación, ``~``, siempre devuelve un miembro de :class:`IntFlag` con valor positivo::

source: >>> (~Perm.X).value == (Perm.R|Perm.W).value == 6 True
es_es: >>> (~Perm.X).valor == (Perm.R|Perm.W).valor == 6 Verdadero

source: :class:`IntFlag` members can also be iterated over::
es_es: :class:`IntFlag` también se puede iterar sobre::

source: Flag
es_es: Bandera

source: The last variation is :class:`Flag`. Like :class:`IntFlag`, :class:`Flag` members can be combined using the bitwise operators (&, \|, ^, ~). Unlike :class:`IntFlag`, they cannot be combined with, nor compared against, any other :class:`Flag` enumeration, nor :class:`int`. While it is possible to specify the values directly it is recommended to use :class:`auto` as the value and let :class:`Flag` select an appropriate value.
es_es: La última variante es :class:`Flag`. Al igual que :class:`IntFlag`, los miembros de :class:`Flag` pueden combinarse utilizando los operadores bit a bit (&, ||, ^, ~). A diferencia de :class:`IntFlag`, no pueden combinarse ni compararse con ninguna otra enumeración de :class:`Flag`, ni con :class:`int`. Aunque es posible especificar los valores directamente, se recomienda utilizar :class:`auto` como valor y dejar que :class:`Flag` seleccione un valor apropiado.

source: Like :class:`IntFlag`, if a combination of :class:`Flag` members results in no flags being set, the boolean evaluation is :data:`False`::
es_es: Al igual que :class:`IntFlag`, si una combinación de los miembros de :class:`Flag` da como resultado que no se activa ningún indicador, la evaluación booleana es :data:`False`::

source: >>> from enum import Flag, auto >>> class Color(Flag): ... RED = auto() ... BLUE = auto() ... GREEN = auto() ... >>> Color.RED & Color.GREEN <Color: 0> >>> bool(Color.RED & Color.GREEN) False
es_es: >>> from enum import Flag, auto >>> class Color(Flag): ... RED = auto() ... AZUL = auto() ... VERDE = auto() ... >>> Color.ROJO & Color.VERDE <Color: 0> >>> bool(Color.ROJO & Color.VERDE) Falso

source: Individual flags should have values that are powers of two (1, 2, 4, 8, ...), while combinations of flags will not::
es_es: Las banderas individuales deben tener valores que sean potencias de dos (1, 2, 4, 8, ...), mientras que las combinaciones de banderas no::

source: >>> class Color(Flag): ... RED = auto() ... BLUE = auto() ... GREEN = auto() ... WHITE = RED | BLUE | GREEN ... >>> Color.WHITE <Color.WHITE: 7>
es_es: >>> class Color(Flag): ... ROJO = auto() ... AZUL = auto() ... VERDE = auto() ... BLANCO = ROJO | AZUL | VERDE ... >>> Color.BLANCO <Color.WHITE: 7>

source: Giving a name to the "no flags set" condition does not change its boolean value::
es_es: Dar un nombre a la condición"no flags set" no cambia su valor booleano::

source: >>> class Color(Flag): ... BLACK = 0 ... RED = auto() ... BLUE = auto() ... GREEN = auto() ... >>> Color.BLACK <Color.BLACK: 0> >>> bool(Color.BLACK) False
es_es: >>> class Color(Flag): ... NEGRO = 0 ... ROJO = auto() ... AZUL = auto() ... VERDE = auto() ... >>> Color.NEGRO <Color.BLACK: 0> >>> bool(Color.NEGRO) Falso

source: :class:`Flag` members can also be iterated over::
es_es: :class:`Flag` también se puede iterar sobre::

source: >>> purple = Color.RED | Color.BLUE >>> list(purple) [<Color.RED: 1>, <Color.BLUE: 2>]
es_es: >>> púrpura = Color.ROJO | Color.AZUL >>> list(purple) [<Color.RED: 1>, <Color.BLUE: 2>]

source: For the majority of new code, :class:`Enum` and :class:`Flag` are strongly recommended, since :class:`IntEnum` and :class:`IntFlag` break some semantic promises of an enumeration (by being comparable to integers, and thus by transitivity to other unrelated enumerations). :class:`IntEnum` and :class:`IntFlag` should be used only in cases where :class:`Enum` and :class:`Flag` will not do; for example, when integer constants are replaced with enumerations, or for interoperability with other systems.
es_es: Para la mayoría del código nuevo, se recomiendan encarecidamente :class:`Enum` y :class:`Flag`, ya que :class:`IntEnum` y :class:`IntFlag` rompen algunas promesas semánticas de una enumeración (al ser comparables a números enteros y, por tanto, por transitividad a otras enumeraciones no relacionadas). :class:`IntEnum` y :class:`IntFlag` deben utilizarse sólo en los casos en que :class:`Enum` y :class:`Flag` no sirvan; por ejemplo, cuando las constantes enteras se sustituyan por enumeraciones, o por interoperabilidad con otros sistemas.

source: Others
es_es: Otros

source: While :class:`IntEnum` is part of the :mod:`enum` module, it would be very simple to implement independently::
es_es: Aunque :class:`IntEnum` forma parte del módulo :mod:`enum`, sería muy sencillo implementarlo de forma independiente::

source: This demonstrates how similar derived enumerations can be defined; for example a :class:`!FloatEnum` that mixes in :class:`float` instead of :class:`int`.
es_es: Esto demuestra cómo se pueden definir enumeraciones derivadas similares; por ejemplo, una :class:`!FloatEnum` que mezcla en :class:`float` en lugar de :class:`int`.

source: Some rules:
es_es: Algunas reglas:

source: When subclassing :class:`Enum`, mix-in types must appear before :class:`Enum` itself in the sequence of bases, as in the :class:`IntEnum` example above.
es_es: Al subclasificar :class:`Enum`, los tipos mixtos deben aparecer antes que el propio :class:`Enum` en la secuencia de bases, como en el ejemplo anterior de :class:`IntEnum`.

source: Mix-in types must be subclassable. For example, :class:`bool` and :class:`range` are not subclassable and will throw an error during Enum creation if used as the mix-in type.
es_es: Los tipos mix-in deben ser subclasificables. Por ejemplo, :class:`bool` y :class:`range` no son subclasificables y arrojarán un error durante la creación de Enum si se utilizan como tipo mix-in.

source: While :class:`Enum` can have members of any type, once you mix in an additional type, all the members must have values of that type, e.g. :class:`int` above. This restriction does not apply to mix-ins which only add methods and don't specify another type.
es_es: Mientras que :class:`Enum` puede tener miembros de cualquier tipo, una vez que se mezcla en un tipo adicional, todos los miembros deben tener valores de ese tipo, por ejemplo, :class:`int` arriba. Esta restricción no se aplica a las mezclas que sólo añaden métodos y no especifican otro tipo.

source: When another data type is mixed in, the :attr:`~Enum.value` attribute is *not the same* as the enum member itself, although it is equivalent and will compare equal.
es_es: Cuando se mezcla otro tipo de datos, el atributo :attr:`~Enum.value` *no es el mismo* que el propio miembro del enum, aunque es equivalente y se comparará igual.

source: A ``data type`` is a mixin that defines :meth:`~object.__new__`, or a :class:`~dataclasses.dataclass`
es_es: Un ``data type`` es un mixin que define :meth:`~object.__new__`, o un :class:`~dataclasses.dataclass`

source: %-style formatting: ``%s`` and ``%r`` call the :class:`Enum` class's :meth:`~object.__str__` and :meth:`~object.__repr__` respectively; other codes (such as ``%i`` or ``%h`` for IntEnum) treat the enum member as its mixed-in type.
es_es: %-sformateo del tipo: ``%s`` y ``%r`` llaman a los :meth:`~object.__str__` y :meth:`~object.__repr__` de la clase :class:`Enum` respectivamente; otros códigos (como ``%i`` o ``%h`` para IntEnum) tratan al miembro del enum como su tipo mixto.

source: :ref:`Formatted string literals <f-strings>`, :meth:`str.format`, and :func:`format` will use the enum's :meth:`~object.__str__` method.
es_es: :ref:`Formatted string literals <f-strings>`, :meth:`str.format`, y :func:`format` utilizarán el método :meth:`~object.__str__` del enum.

source: Because :class:`IntEnum`, :class:`IntFlag`, and :class:`StrEnum` are designed to be drop-in replacements for existing constants, their :meth:`~object.__str__` method has been reset to their data types' :meth:`~object.__str__` method.
es_es: Dado que :class:`IntEnum`, :class:`IntFlag`, y :class:`StrEnum` se han diseñado para sustituir a las constantes existentes, su método :meth:`~object.__str__` se ha reajustado al método :meth:`~object.__str__` de sus tipos de datos.

source: When to use :meth:`~object.__new__` vs. :meth:`~object.__init__`
es_es: Cuándo utilizar :meth:`~object.__new__` vs. :meth:`~object.__init__`

source: :meth:`~object.__new__` must be used whenever you want to customize the actual value of the :class:`Enum` member. Any other modifications may go in either :meth:`~object.__new__` or :meth:`~object.__init__`, with :meth:`~object.__init__` being preferred.
es_es: :meth:`~object.__new__` debe utilizarse siempre que se desee personalizar el valor real del miembro :class:`Enum`. Cualquier otra modificación puede ir en :meth:`~object.__new__` o :meth:`~object.__init__`, siendo preferible :meth:`~object.__init__`.

source: For example, if you want to pass several items to the constructor, but only want one of them to be the value::
es_es: Por ejemplo, si quieres pasar varios elementos al constructor, pero sólo quieres que uno de ellos sea el valor::

source: >>> class Coordinate(bytes, Enum): ... """ ... Coordinate with binary codes that can be indexed by the int code. ... """ ... def __new__(cls, value, label, unit): ... obj = bytes.__new__(cls, [value]) ... obj._value_ = value ... obj.label = label ... obj.unit = unit ... return obj ... PX = (0, 'P.X', 'km') ... PY = (1, 'P.Y', 'km') ... VX = (2, 'V.X', 'km/s') ... VY = (3, 'V.Y', 'km/s') ... >>> print(Coordinate['PY']) Coordinate.PY >>> print(Coordinate(3)) Coordinate.VY
es_es: >>> class Coordinate(bytes, Enum): ... """ ... Coordenada con códigos binarios indexables por el código int. ... """ ... def __new__(cls, value, label, unit): ... obj = bytes.__new__(cls, [value]) ... obj._value_ = value ... obj.label = label ... obj.unit = unit ... return obj ... PX = (0, 'P.X', 'km') ... PY = (1, 'P.Y', 'km') ... VX = (2, 'V.X', 'km/s') ... VY = (3, 'V.Y', 'km/s') ... >>> print(Coordinate['PY']) Coordinate.PY >>> print(Coordinate(3)) Coordinate.VY

source: *Do not* call ``super().__new__()``, as the lookup-only ``__new__`` is the one that is found; instead, use the data type directly.
es_es: *No* llame a ``super().__new__()``, ya que la búsqueda ``__new__`` es la que se encuentra; en su lugar, utilice el tipo de datos directamente.

source: Finer Points
es_es: Puntos más delicados

source: Supported ``__dunder__`` names
es_es: Nombres compatibles ``__dunder__``

source: :attr:`~enum.EnumType.__members__` is a read-only ordered mapping of ``member_name``:``member`` items. It is only available on the class.
es_es: :attr:`~enum.EnumType.__members__` es una asignación ordenada de sólo lectura de los elementos ``member_name``:``member``. Sólo está disponible en la clase

source: :meth:`~object.__new__`, if specified, must create and return the enum members; it is also a very good idea to set the member's :attr:`~Enum._value_` appropriately. Once all the members are created it is no longer used.
es_es: :meth:`~object.__new__`, si se especifica, debe crear y devolver los miembros del enum; también es una muy buena idea establecer el :attr:`~Enum._value_` del miembro apropiadamente. Una vez creados todos los miembros ya no se utiliza.

source: Supported ``_sunder_`` names
es_es: Nombres compatibles ``_sunder_``

source: :attr:`~Enum._name_` -- name of the member
es_es: :attr:`~Enum._name_` -- nombre del miembro

source: :attr:`~Enum._value_` -- value of the member; can be set / modified in ``__new__``
es_es: :attr:`~Enum._value_` -- valor del miembro; puede establecerse / modificarse en ``__new__``

source: :meth:`~Enum._missing_` -- a lookup function used when a value is not found; may be overridden
es_es: :meth:`~Enum._missing_` -- una función de búsqueda que se utiliza cuando no se encuentra un valor; puede sobrescribirse

source: :attr:`~Enum._ignore_` -- a list of names, either as a :class:`list` or a :class:`str`, that will not be transformed into members, and will be removed from the final class
es_es: :attr:`~Enum._ignore_` -- una lista de nombres, ya sea como :class:`list` o :class:`str`, que no serán transformados en miembros, y serán eliminados de la clase final.

source: :attr:`~Enum._order_` -- used in Python 2/3 code to ensure member order is consistent (class attribute, removed during class creation)
es_es: :attr:`~Enum._order_` -- usado en código Python 2/3 para asegurar que el orden de los miembros es consistente (atributo de clase, eliminado durante la creación de la clase)
