Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/howto/free-threading-extensions.po
Languages: ru

source: C API Extension Support for Free Threading
ru: Поддержка расширения C API для свободной многопоточности

source: Starting with the 3.13 release, CPython has experimental support for running with the :term:`global interpreter lock` (GIL) disabled in a configuration called :term:`free threading`. This document describes how to adapt C API extensions to support free threading.
ru: Начиная с версии 3.13, CPython имеет экспериментальную поддержку работы с отключенной :term:`глобальной блокировкой интерпретатора` (GIL) в конфигурации под названием :term:`free threading`. В этом документе описывается, как адаптировать расширения C API для поддержки свободной многопоточности.

source: Identifying the Free-Threaded Build in C
ru: Идентификация сборки со свободным потоком на C

source: The CPython C API exposes the ``Py_GIL_DISABLED`` macro: in the free-threaded build it's defined to ``1``, and in the regular build it's not defined. You can use it to enable code that only runs under the free-threaded build::
ru: API CPython C предоставляет макрос Py_GIL_DISABLED: в сборке со свободным потоком он определен как «1», а в обычной сборке он не определен. Вы можете использовать его, чтобы включить код, который работает только в сборке со свободным потоком::

source: Module Initialization
ru: Инициализация модуля

source: Extension modules need to explicitly indicate that they support running with the GIL disabled; otherwise importing the extension will raise a warning and enable the GIL at runtime.
ru: Модули расширения должны явно указать, что они поддерживают работу с отключенным GIL; в противном случае импорт расширения вызовет предупреждение и включит GIL во время выполнения.

source: There are two ways to indicate that an extension module supports running with the GIL disabled depending on whether the extension uses multi-phase or single-phase initialization.
ru: Существует два способа указать, что модуль расширения поддерживает работу с отключенным GIL, в зависимости от того, использует ли расширение многофазную или однофазную инициализацию.

source: Multi-Phase Initialization
ru: Многофазная инициализация

source: Extensions that use multi-phase initialization (i.e., :c:func:`PyModuleDef_Init`) should add a :c:data:`Py_mod_gil` slot in the module definition. If your extension supports older versions of CPython, you should guard the slot with a :c:data:`PY_VERSION_HEX` check.
ru: Расширения, использующие многофазную инициализацию (т. е. :c:func:`PyModuleDef_Init`), должны добавить слот :c:data:`Py_mod_gil` в определение модуля. Если ваше расширение поддерживает более старые версии CPython, вам следует защитить слот проверкой :c:data:`PY_VERSION_HEX`.

source: Single-Phase Initialization
ru: Однофазная инициализация

source: Extensions that use single-phase initialization (i.e., :c:func:`PyModule_Create`) should call :c:func:`PyUnstable_Module_SetGIL` to indicate that they support running with the GIL disabled. The function is only defined in the free-threaded build, so you should guard the call with ``#ifdef Py_GIL_DISABLED`` to avoid compilation errors in the regular build.
ru: Расширения, использующие однофазную инициализацию (т. е. :c:func:`PyModule_Create`), должны вызывать :c:func:`PyUnstable_Module_SetGIL`, чтобы указать, что они поддерживают работу с отключенным GIL. Функция определена только в сборке со свободным потоком, поэтому вам следует защитить вызов с помощью ``#ifdef Py_GIL_DISABLED``, чтобы избежать ошибок компиляции в обычной сборке.

source: General API Guidelines
ru: Общие рекомендации по API

source: Most of the C API is thread-safe, but there are some exceptions.
ru: Большая часть C API является поточно-ориентированной, но есть и некоторые исключения.

source: **Struct Fields**: Accessing fields in Python C API objects or structs directly is not thread-safe if the field may be concurrently modified.
ru: **Поля структуры**: прямой доступ к полям в объектах или структурах Python C API не является потокобезопасным, если поле может быть одновременно изменено.

source: **Macros**: Accessor macros like :c:macro:`PyList_GET_ITEM` and :c:macro:`PyList_SET_ITEM` do not perform any error checking or locking. These macros are not thread-safe if the container object may be modified concurrently.
ru: **Макросы**: Макросы доступа, такие как :c:macro:`PyList_GET_ITEM` и :c:macro:`PyList_SET_ITEM`, не выполняют никакой проверки ошибок или блокировки. Эти макросы не являются потокобезопасными, если объект-контейнер может быть изменен одновременно.

source: **Borrowed References**: C API functions that return :term:`borrowed references <borrowed reference>` may not be thread-safe if the containing object is modified concurrently. See the section on :ref:`borrowed references <borrowed-references>` for more information.
ru: **Заимствованные ссылки**: функции C API, которые возвращают :term:`заимствованные ссылки <заимствованная ссылка>`, могут быть не поточно-ориентированными, если содержащий их объект изменяется одновременно. Дополнительную информацию смотрите в разделе :ref:`заимствованные ссылки <borrowed-references>`.

source: Container Thread Safety
ru: Безопасность потоков контейнеров

source: Containers like :c:struct:`PyListObject`, :c:struct:`PyDictObject`, and :c:struct:`PySetObject` perform internal locking in the free-threaded build. For example, the :c:func:`PyList_Append` will lock the list before appending an item.
ru: Контейнеры, такие как :c:struct:`PyListObject`, :c:struct:`PyDictObject` и :c:struct:`PySetObject`, выполняют внутреннюю блокировку в свободнопоточной сборке. Например, :c:func:`PyList_Append` заблокирует список перед добавлением элемента.

source: A notable exception is :c:func:`PyDict_Next`, which does not lock the dictionary. You should use :c:macro:`Py_BEGIN_CRITICAL_SECTION` to protect the dictionary while iterating over it if the dictionary may be concurrently modified::
ru: Заметным исключением является :c:func:`PyDict_Next`, который не блокирует словарь. Вы должны использовать :c:macro:`Py_BEGIN_CRITICAL_SECTION` для защиты словаря во время итерации по нему, если словарь может быть одновременно изменен::

source: Borrowed References
ru: Заимствованные ссылки

source: Some C API functions return :term:`borrowed references <borrowed reference>`. These APIs are not thread-safe if the containing object is modified concurrently. For example, it's not safe to use :c:func:`PyList_GetItem` if the list may be modified concurrently.
ru: Некоторые функции C API возвращают :term:`заимствованные ссылки <заимствованная ссылка>`. Эти API не являются потокобезопасными, если содержащий их объект изменяется одновременно. Например, небезопасно использовать :c:func:`PyList_GetItem`, если список может быть изменен одновременно.

source: The following table lists some borrowed reference APIs and their replacements that return :term:`strong references <strong reference>`.
ru: В следующей таблице перечислены некоторые заимствованные справочные API и их замены, которые возвращают :term:`strong references <strong reference>`.

source: Borrowed reference API
ru: Заимствованный эталонный API

source: Strong reference API
ru: Надежный эталонный API

source: none (see :ref:`PyDict_Next`)
ru: нет (см. :ref:`PyDict_Next`)

source: Not all APIs that return borrowed references are problematic. For example, :c:func:`PyTuple_GetItem` is safe because tuples are immutable. Similarly, not all uses of the above APIs are problematic. For example, :c:func:`PyDict_GetItem` is often used for parsing keyword argument dictionaries in function calls; those keyword argument dictionaries are effectively private (not accessible by other threads), so using borrowed references in that context is safe.
ru: Не все API, возвращающие заимствованные ссылки, являются проблематичными. Например, :c:func:`PyTuple_GetItem` безопасен, поскольку кортежи неизменяемы. Аналогично, не все способы использования вышеуказанных API являются проблематичными. Например, :c:func:`PyDict_GetItem` часто используется для анализа словарей аргументов ключевых слов в вызовах функций; эти словари аргументов ключевых слов фактически являются частными (не доступны другим потокам), поэтому использование заимствованных ссылок в этом контексте безопасно.

source: Some of these functions were added in Python 3.13. You can use the `pythoncapi-compat <https://github.com/python/pythoncapi-compat>`_ package to provide implementations of these functions for older Python versions.
ru: Некоторые из этих функций были добавлены в Python 3.13. Вы можете использовать пакет `pythoncapi-compat <https://github.com/python/pythoncapi-compat>`_, чтобы предоставить реализации этих функций для более старых версий Python.

source: Memory Allocation APIs
ru: API распределения памяти

source: Python's memory management C API provides functions in three different :ref:`allocation domains <allocator-domains>`: "raw", "mem", and "object". For thread-safety, the free-threaded build requires that only Python objects are allocated using the object domain, and that all Python object are allocated using that domain. This differs from the prior Python versions, where this was only a best practice and not a hard requirement.
ru: API C управления памятью Python предоставляет функции в трех различных :ref:`доменах распределения <allocator-domains>`: «raw», «mem» и «object». В целях безопасности потоков при сборке со свободным потоком требуется, чтобы только объекты Python выделялись с использованием объектного домена и чтобы все объекты Python размещались с использованием этого домена. Это отличается от предыдущих версий Python, где это было лишь рекомендуемой практикой, а не жестким требованием.

source: Search for uses of :c:func:`PyObject_Malloc` in your extension and check that the allocated memory is used for Python objects. Use :c:func:`PyMem_Malloc` to allocate buffers instead of :c:func:`PyObject_Malloc`.
ru: Найдите использование :c:func:`PyObject_Malloc` в вашем расширении и проверьте, используется ли выделенная память для объектов Python. Используйте :c:func:`PyMem_Malloc` для выделения буферов вместо :c:func:`PyObject_Malloc`.

source: Thread State and GIL APIs
ru: Состояние потока и GIL API

source: Python provides a set of functions and macros to manage thread state and the GIL, such as:
ru: Python предоставляет набор функций и макросов для управления состоянием потока и GIL, например:

source: :c:func:`PyGILState_Ensure` and :c:func:`PyGILState_Release`
ru: :c:func:`PyGILState_Ensure` и :c:func:`PyGILState_Release`

source: :c:func:`PyEval_SaveThread` and :c:func:`PyEval_RestoreThread`
ru: :c:func:`PyEval_SaveThread` и :c:func:`PyEval_RestoreThread`

source: :c:macro:`Py_BEGIN_ALLOW_THREADS` and :c:macro:`Py_END_ALLOW_THREADS`
ru: :c:macro:`Py_BEGIN_ALLOW_THREADS` и :c:macro:`Py_END_ALLOW_THREADS`

source: These functions should still be used in the free-threaded build to manage thread state even when the :term:`GIL` is disabled. For example, if you create a thread outside of Python, you must call :c:func:`PyGILState_Ensure` before calling into the Python API to ensure that the thread has a valid Python thread state.
ru: Эти функции по-прежнему следует использовать в сборке со свободным потоком для управления состоянием потока, даже если :term:`GIL` отключен. Например, если вы создаете поток вне Python, вы должны вызвать :c:func:`PyGILState_Ensure` перед вызовом API Python, чтобы убедиться, что поток имеет допустимое состояние потока Python.

source: You should continue to call :c:func:`PyEval_SaveThread` or :c:macro:`Py_BEGIN_ALLOW_THREADS` around blocking operations, such as I/O or lock acquisitions, to allow other threads to run the :term:`cyclic garbage collector <garbage collection>`.
ru: Вам следует продолжать вызывать :c:func:`PyEval_SaveThread` или :c:macro:`Py_BEGIN_ALLOW_THREADS` для операций блокировки, таких как ввод-вывод или получение блокировок, чтобы позволить другим потокам запускать :term:`циклический сборщик мусора < сбор мусора>`.

source: Protecting Internal Extension State
ru: Защита состояния внутреннего расширения

source: Your extension may have internal state that was previously protected by the GIL. You may need to add locking to protect this state. The approach will depend on your extension, but some common patterns include:
ru: Ваше расширение может иметь внутреннее состояние, которое ранее было защищено GIL. Возможно, вам придется добавить блокировку для защиты этого состояния. Подход будет зависеть от вашего расширения, но некоторые общие шаблоны включают в себя:

source: **Caches**: global caches are a common source of shared state. Consider using a lock to protect the cache or disabling it in the free-threaded build if the cache is not critical for performance.
ru: **Кэши**: глобальные кеши являются распространенным источником общего состояния. Рассмотрите возможность использования блокировки для защиты кеша или ее отключения в сборке со свободным потоком, если кеш не критичен для производительности.

source: **Global State**: global state may need to be protected by a lock or moved to thread local storage. C11 and C++11 provide the ``thread_local`` or ``_Thread_local`` for `thread-local storage <https://en.cppreference.com/w/c/language/storage_duration>`_.
ru: **Глобальное состояние**: возможно, глобальное состояние необходимо защитить блокировкой или перенести в локальное хранилище потока. C11 и C++11 предоставляют ``thread_local`` или ``_Thread_local`` для ``thread-local Storage <https://en.cppreference.com/w/c/language/storage_duration>`_.

source: Building Extensions for the Free-Threaded Build
ru: Создание расширений для свободнопоточной сборки

source: C API extensions need to be built specifically for the free-threaded build. The wheels, shared libraries, and binaries are indicated by a ``t`` suffix.
ru: Расширения C API необходимо создавать специально для сборки со свободной резьбой. Колеса, общие библиотеки и двоичные файлы обозначаются суффиксом «t».

source: `pypa/manylinux <https://github.com/pypa/manylinux>`_ supports the free-threaded build, with the ``t`` suffix, such as ``python3.13t``.
ru: `pypa/manylinux <https://github.com/pypa/manylinux>`_ поддерживает сборку со свободным потоком с суффиксом ``t``, например ``python3.13t``.

source: `pypa/cibuildwheel <https://github.com/pypa/cibuildwheel>`_ supports the free-threaded build if you set `CIBW_FREE_THREADED_SUPPORT <https://cibuildwheel.pypa.io/en/stable/options/#free-threaded-support>`_.
ru: `pypa/cibuildwheel <https://github.com/pypa/cibuildwheel>`_ поддерживает сборку со свободным потоком, если вы установите `CIBW_FREE_THREADED_SUPPORT <https://cibuildwheel.pypa.io/en/stable/options/#free- поддержка резьбы>`_.

source: Limited C API and Stable ABI
ru: Ограниченный API C и стабильный ABI

source: The free-threaded build does not currently support the :ref:`Limited C API <limited-c-api>` or the stable ABI. If you use `setuptools <https://setuptools.pypa.io/en/latest/setuptools.html>`_ to build your extension and currently set ``py_limited_api=True`` you can use ``py_limited_api=not sysconfig.get_config_var("Py_GIL_DISABLED")`` to opt out of the limited API when building with the free-threaded build.
ru: Сборка со свободным потоком в настоящее время не поддерживает :ref:`Limited C API <limited-c-api>` или стабильный ABI. Если вы используете `setuptools <https://setuptools.pypa.io/en/latest/setuptools.html>`_ для сборки вашего расширения и в настоящее время установлено ``py_limited_api=True``, вы можете использовать ``py_limited_api=not sysconfig. get_config_var("Py_GIL_DISABLED")``, чтобы отказаться от ограниченного API при сборке с использованием свободнопоточной сборки.

source: You will need to build separate wheels specifically for the free-threaded build. If you currently use the stable ABI, you can continue to build a single wheel for multiple non-free-threaded Python versions.
ru: Вам нужно будет построить отдельные колеса специально для сборки со свободной резьбой. Если вы в настоящее время используете стабильную версию ABI, вы можете продолжать создавать одно колесо для нескольких версий Python с несвободной резьбой.

source: Due to a limitation of the official Windows installer, you will need to manually define ``Py_GIL_DISABLED=1`` when building extensions from source.
ru: Из-за ограничений официального установщика Windows вам нужно будет вручную определить Py_GIL_DISABLED=1 при сборке расширений из исходного кода.

source: `Porting Extension Modules to Support Free-Threading <https://py-free-threading.github.io/porting/>`_: A community-maintained porting guide for extension authors.
ru: `Портирование модулей расширения для поддержки свободной многопоточности <https://py-free-threading.github.io/porting/>`_: поддерживаемое сообществом руководство по портированию для авторов расширений.
