Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/howto/functional.po
Languages: es_es, ru

source: :func:`~itertools.groupby` assumes that the underlying iterable's contents will already be sorted based on the key. Note that the returned iterators also use the underlying iterable, so you have to consume the results of iterator-1 before requesting iterator-2 and its corresponding key.
es_es: :func:`~itertools.groupby` asume que el contenido del iterable subyacente ya estará ordenado en base a la clave. Ten en cuenta que los iteradores devueltos también utilizan el iterable subyacente, por lo que tienes que consumir los resultados del iterador-1 antes de solicitar el iterador-2 y su clave correspondiente.
ru: :func:`~itertools.groupby` предполагает, что содержимое базовой итерации уже отсортировано на основе ключа. Обратите внимание, что возвращаемые итераторы также используют базовый итератор, поэтому вам необходимо использовать результаты итератора-1 перед запросом итератора-2 и соответствующего ему ключа.

source: The functools module
es_es: El módulo functools
ru: Модуль functools

source: The :mod:`functools` module contains some higher-order functions. A **higher-order function** takes one or more functions as input and returns a new function. The most useful tool in this module is the :func:`functools.partial` function.
es_es: El módulo :mod:`functools` contiene algunas funciones de orden superior. Una **función de orden superior** toma una o más funciones como entrada y devuelve una nueva función. La herramienta más útil de este módulo es la función :func:`functools.partial`.

source: For programs written in a functional style, you'll sometimes want to construct variants of existing functions that have some of the parameters filled in. Consider a Python function ``f(a, b, c)``; you may wish to create a new function ``g(b, c)`` that's equivalent to ``f(1, b, c)``; you're filling in a value for one of ``f()``'s parameters. This is called "partial function application".
es_es: Para programas escritos en un estilo funcional, a veces querrá construir variantes de funciones existentes que tengan algunos de los parámetros rellenados. Considere una función de Python ``f(a, b, c)``; puede que desee crear una nueva función ``g(b, c)`` que sea equivalente a ``f(1, b, c)``; está rellenando un valor para uno de los parámetros de ``f()``. Esto se llama "aplicación parcial de la función".
ru: Для программ, написанных в функциональном стиле, вам иногда потребуется создать варианты существующих функций, в которых некоторые параметры будут заполнены. Рассмотрим функцию Python ``f(a, b, c)``; вы можете создать новую функцию ``g(b, c)``, эквивалентную ``f(1, b, c)``; вы вводите значение для одного из параметров ``f()``. Это называется «приложение частичной функции».

source: The constructor for :func:`~functools.partial` takes the arguments ``(function, arg1, arg2, ..., kwarg1=value1, kwarg2=value2)``. The resulting object is callable, so you can just call it to invoke ``function`` with the filled-in arguments.
es_es: El constructor de :func:`~functools.partial` toma los argumentos ``(function, arg1, arg2, ..., kwarg1=value1, kwarg2=value2)``. El objeto resultante es invocable, por lo que puede llamarlo para invocar ``function`` con los argumentos introducidos.
ru: Конструктор :func:`~functools.partial` принимает аргументы ``(function, arg1, arg2, ..., kwarg1=value1, kwarg2=value2)``. Полученный объект является вызываемым, поэтому вы можете просто вызвать его для вызова ``функции`` с заполненными аргументами.

source: Here's a small but realistic example::
es_es: He aquí un ejemplo pequeño pero realista::
ru: Вот небольшой, но реалистичный пример:

source: :func:`functools.reduce(func, iter, [initial_value]) <functools.reduce>` cumulatively performs an operation on all the iterable's elements and, therefore, can't be applied to infinite iterables. *func* must be a function that takes two elements and returns a single value. :func:`functools.reduce` takes the first two elements A and B returned by the iterator and calculates ``func(A, B)``. It then requests the third element, C, calculates ``func(func(A, B), C)``, combines this result with the fourth element returned, and continues until the iterable is exhausted. If the iterable returns no values at all, a :exc:`TypeError` exception is raised. If the initial value is supplied, it's used as a starting point and ``func(initial_value, A)`` is the first calculation. ::
es_es: :func:`functools.reduce(func, iter, [valor_inicial]) <functools.reduce>` realiza acumulativamente una operación sobre todos los elementos del iterable y, por tanto, no puede aplicarse a iterables infinitos. *func* debe ser una función que tome dos elementos y devuelva un único valor. :func:`functools.reduce` toma los dos primeros elementos A y B devueltos por el iterador y calcula ``func(A, B)``. A continuación, solicita el tercer elemento, C, calcula ``func(func(A, B), C)``, combina este resultado con el cuarto elemento devuelto, y continúa hasta agotar el iterable. Si el iterable no devuelve ningún valor, se lanza una excepción :exc:`TypeError`. Si se proporciona el valor inicial, se utiliza como punto de partida y ``func(initial_value, A)`` es el primer cálculo. ::
ru: :func:`functools.reduce(func, iter, [initial_value]) <functools.reduce>` кумулятивно выполняет операцию над всеми элементами итерируемого объекта и, следовательно, не может применяться к бесконечным итерируемым объектам. *func* должна быть функцией, которая принимает два элемента и возвращает одно значение. :func:`functools.reduce` принимает первые два элемента A и B, возвращенные итератором, и вычисляет ``func(A, B)``. Затем он запрашивает третий элемент C, вычисляет ``func(func(A, B), C)``, объединяет этот результат с возвращенным четвертым элементом и продолжает до тех пор, пока итерация не будет исчерпана. Если итерируемый объект вообще не возвращает никаких значений, возникает исключение :exc:`TypeError`. Если указано начальное значение, оно используется в качестве отправной точки, а func(initial_value, A) — это первый расчет. ::

source: If you use :func:`operator.add` with :func:`functools.reduce`, you'll add up all the elements of the iterable. This case is so common that there's a special built-in called :func:`sum` to compute it:
es_es: Si utiliza :func:`operator.add` con :func:`functools.reduce`, sumará todos los elementos del iterable. Este caso es tan común que existe un built-in especial llamado :func:`sum` para calcularlo:
ru: Если вы используете :func:`operator.add` с :func:`functools.reduce`, вы добавите все элементы итерируемого объекта. Этот случай настолько распространен, что для его вычисления существует специальная встроенная функция :func:`sum`:

source: For many uses of :func:`functools.reduce`, though, it can be clearer to just write the obvious :keyword:`for` loop::
es_es: Para muchos usos de :func:`functools.reduce`, sin embargo, puede ser más claro escribir simplemente el bucle obvio :keyword:`for`::
ru: Однако во многих случаях использования :func:`functools.reduce` может быть проще написать очевидный цикл :keyword:`for`::

source: A related function is :func:`itertools.accumulate(iterable, func=operator.add) <itertools.accumulate>`. It performs the same calculation, but instead of returning only the final result, :func:`~itertools.accumulate` returns an iterator that also yields each partial result::
es_es: Una función relacionada es :func:`itertools.accumulate(iterable, func=operator.add) <itertools.accumulate>`. Realiza el mismo cálculo, pero en lugar de devolver sólo el resultado final, :func:`~itertools.accumulate` devuelve un iterador que también devuelve cada resultado parcial::

source: The operator module
es_es: El módulo operador
ru: Модуль оператора

source: The :mod:`operator` module was mentioned earlier. It contains a set of functions corresponding to Python's operators. These functions are often useful in functional-style code because they save you from writing trivial functions that perform a single operation.
es_es: Ya se ha mencionado el módulo :mod:`operator`. Contiene un conjunto de funciones correspondientes a los operadores de Python. Estas funciones suelen ser útiles en el código de estilo funcional porque te ahorran escribir funciones triviales que realizan una única operación.
ru: Модуль :mod:`operator` уже упоминался ранее. Он содержит набор функций, соответствующих операторам Python. Эти функции часто полезны в коде функционального стиля, поскольку они избавляют вас от написания тривиальных функций, выполняющих одну операцию.

source: Some of the functions in this module are:
es_es: Algunas de las funciones de este módulo son:
ru: Вот некоторые из функций этого модуля:

source: Math operations: ``add()``, ``sub()``, ``mul()``, ``floordiv()``, ``abs()``, ...
es_es: Operaciones matemáticas: ``add()``, ``sub()``, ``mul()``, ``floordiv()``, ``abs()``, ...
ru: Математические операции: ``add()``, ``sub()``, ``mul()``, ``floordiv()``, ``abs()``, ...

source: Logical operations: ``not_()``, ``truth()``.
es_es: Operaciones lógicas: ``not_()``, ``truth()``.
ru: Логические операции: ``not_()``, ``truth()``.

source: Bitwise operations: ``and_()``, ``or_()``, ``invert()``.
es_es: Operaciones bit a bit: ``and_()``, ``or_()``, ``invert()``.
ru: Побитовые операции: ``and_()``, ``or_()``, ``invert()``.

source: Comparisons: ``eq()``, ``ne()``, ``lt()``, ``le()``, ``gt()``, and ``ge()``.
es_es: Comparaciones: ``eq()``, ``ne()``, ``lt()``, ``le()``, ``gt()``, y ``ge()``.
ru: Сравнения: ``eq()``, ``ne()``, ``lt()``, ``le()``, ``gt()`` и ``ge()``.

source: Object identity: ``is_()``, ``is_not()``.
es_es: Identidad del objeto: ``is_()``, ``is_not()``.
ru: Идентификация объекта: ``is_()``, ``is_not()``.

source: Consult the operator module's documentation for a complete list.
es_es: Consulte la documentación del módulo operador para obtener una lista completa.
ru: Полный список см. в документации модуля оператора.

source: Small functions and the lambda expression
es_es: Pequeñas funciones y la expresión lambda
ru: Маленькие функции и лямбда-выражение

source: When writing functional-style programs, you'll often need little functions that act as predicates or that combine elements in some way.
es_es: Al escribir programas de estilo funcional, a menudo necesitarás pequeñas funciones que actúen como predicados o que combinen elementos de alguna manera.
ru: При написании программ в функциональном стиле вам часто понадобятся небольшие функции, которые действуют как предикаты или каким-либо образом объединяют элементы.

source: If there's a Python built-in or a module function that's suitable, you don't need to define a new function at all::
es_es: Si existe una función incorporada en Python o en un módulo que sea adecuada, no es necesario definir una nueva función::
ru: Если есть встроенная функция Python или подходящая функция модуля, вам вообще не нужно определять новую функцию::

source: If the function you need doesn't exist, you need to write it. One way to write small functions is to use the :keyword:`lambda` expression. ``lambda`` takes a number of parameters and an expression combining these parameters, and creates an anonymous function that returns the value of the expression::
es_es: Si la función que necesitas no existe, tienes que escribirla. Una forma de escribir pequeñas funciones es utilizar la expresión :keyword:`lambda`. ``lambda`` toma una serie de parámetros y una expresión que combina estos parámetros, y crea una función anónima que devuelve el valor de la expresión::
ru: Если нужная вам функция не существует, вам нужно ее написать. Один из способов написания небольших функций — использовать выражение :keyword:`lambda`. ``лямбда`` принимает ряд параметров и выражение, объединяющее эти параметры, и создает анонимную функцию, которая возвращает значение выражения::

source: An alternative is to just use the ``def`` statement and define a function in the usual way::
es_es: Una alternativa es utilizar simplemente la sentencia ``def`` y definir una función de la forma habitual::
ru: Альтернативой является использование оператора ``def`` и определение функции обычным способом:

source: Which alternative is preferable? That's a style question; my usual course is to avoid using ``lambda``.
es_es: ¿Qué alternativa es preferible? Es una cuestión de estilo; yo suelo evitar el uso de ``lambda``.
ru: Какая альтернатива предпочтительнее? Это вопрос стиля; мой обычный курс — избегать использования «лямбда».

source: One reason for my preference is that ``lambda`` is quite limited in the functions it can define. The result has to be computable as a single expression, which means you can't have multiway ``if... elif... else`` comparisons or ``try... except`` statements. If you try to do too much in a ``lambda`` statement, you'll end up with an overly complicated expression that's hard to read. Quick, what's the following code doing? ::
es_es: Una de las razones de mi preferencia es que ``lambda`` está bastante limitado en las funciones que puede definir. El resultado tiene que ser computable como una única expresión, lo que significa que no se pueden hacer comparaciones multidireccionales en ``if... elif... else`` o sentencias ``try... except``. Si intentas hacer demasiado en una sentencia ``lambda``, acabarás con una expresión demasiado complicada y difícil de leer. Rápido, ¿qué está haciendo el siguiente código? ::
ru: Одна из причин моего предпочтения заключается в том, что лямбда весьма ограничена в функциях, которые она может определить. Результат должен быть вычислен как одно выражение, а это означает, что вы не можете использовать многосторонние сравнения ``if... elif... else`` или ``try... кроме`` операторов. Если вы попытаетесь сделать слишком много в операторе ``лямбда``, вы получите слишком сложное выражение, которое будет трудно читать. Быстро, что делает следующий код? ::

source: You can figure it out, but it takes time to disentangle the expression to figure out what's going on. Using a short nested ``def`` statements makes things a little bit better::
es_es: Puedes averiguarlo, pero lleva tiempo desentrañar la expresión para saber qué está pasando. El uso de un corto anidada ``def`` declaraciones hace las cosas un poco mejor::
ru: Разобраться в этом можно, но нужно время, чтобы распутать выражение и понять, что происходит. Использование коротких вложенных операторов ``def`` делает ситуацию немного лучше:

source: But it would be best of all if I had simply used a ``for`` loop::
es_es: Pero lo mejor de todo sería que hubiera utilizado simplemente un bucle ``for``::
ru: Но было бы лучше, если бы я просто использовал цикл for::

source: Or the :func:`sum` built-in and a generator expression::
es_es: O el :func:`sum` incorporado y una expresión generadora::
ru: Или встроенная функция :func:`sum` и выражение-генератор::

source: Many uses of :func:`functools.reduce` are clearer when written as ``for`` loops.
es_es: Muchos usos de :func:`functools.reduce` son más claros cuando se escriben como bucles ``for``.
ru: Многие варианты использования :func:`functools.reduce` становятся более понятными, если они записаны как циклы ``for``.

source: Fredrik Lundh once suggested the following set of rules for refactoring uses of ``lambda``:
es_es: Fredrik Lundh sugirió en una ocasión el siguiente conjunto de reglas para refactorizar los usos de ``lambda``:
ru: Фредрик Лунд однажды предложил следующий набор правил для рефакторинга использования лямбды:

source: Write a lambda function.
es_es: Escribe una función lambda.
ru: Напишите лямбда-функцию.

source: Write a comment explaining what the heck that lambda does.
es_es: Escribe un comentario explicando qué demonios hace esa lambda.
ru: Напишите комментарий, объясняющий, какого черта делает эта лямбда.

source: Study the comment for a while, and think of a name that captures the essence of the comment.
es_es: Estudia el comentario durante un rato y piensa en un nombre que capte la esencia del comentario.
ru: Изучите комментарий некоторое время и придумайте название, которое бы отражало суть комментария.

source: Convert the lambda to a def statement, using that name.
es_es: Convierte la lambda en una sentencia def, utilizando ese nombre.
ru: Преобразуйте лямбду в оператор def, используя это имя.

source: Remove the comment.
es_es: Elimina el comentario.
ru: Удалить комментарий.

source: I really like these rules, but you're free to disagree about whether this lambda-free style is better.
es_es: A mí me gustan mucho estas reglas, pero eres libre de discrepar sobre si este estilo sin lambda es mejor.
ru: Мне очень нравятся эти правила, но вы можете не согласиться с тем, лучше ли этот стиль без лямбда-выражений.

source: Revision History and Acknowledgements
es_es: Historial de revisiones y agradecimientos
ru: История изменений и благодарности

source: The author would like to thank the following people for offering suggestions, corrections and assistance with various drafts of this article: Ian Bicking, Nick Coghlan, Nick Efford, Raymond Hettinger, Jim Jewett, Mike Krell, Leandro Lameiro, Jussi Salmela, Collin Winter, Blake Winton.
es_es: El autor desea agradecer a las siguientes personas sus sugerencias, correcciones y ayuda en varios borradores de este artículo: Ian Bicking, Nick Coghlan, Nick Efford, Raymond Hettinger, Jim Jewett, Mike Krell, Leandro Lameiro, Jussi Salmela, Collin Winter, Blake Winton.
ru: Автор хотел бы поблагодарить следующих людей за предложения, исправления и помощь в различных черновиках этой статьи: Иэна Бикинга, Ника Коглана, Ника Эффорда, Рэймонда Хеттингера, Джима Джуэтта, Майка Крелла, Леандро Ламейро, Юсси Салмела, Коллина Уинтера, Блейк Уинтон.

source: Version 0.1: posted June 30 2006.
es_es: Versión 0.1: publicada el 30 de junio de 2006.
ru: Версия 0.1: опубликована 30 июня 2006 г.

source: Version 0.11: posted July 1 2006. Typo fixes.
es_es: Versión 0.11: publicada el 1 de julio de 2006. Corrección de erratas.
ru: Версия 0.11: опубликована 1 июля 2006 г. Исправлены опечатки.

source: Version 0.2: posted July 10 2006. Merged genexp and listcomp sections into one. Typo fixes.
es_es: Versión 0.2: publicada el 10 de julio de 2006. Fusionadas las secciones genexp y listcomp en una sola. Corrección de erratas.
ru: Версия 0.2: опубликовано 10 июля 2006 г. Разделы genexp и listcomp объединены в один. Исправлены опечатки.

source: Version 0.21: Added more references suggested on the tutor mailing list.
es_es: Versión 0.21: Añadidas más referencias sugeridas en la lista de correo de tutores.
ru: Версия 0.21: В список рассылки репетиторов добавлено больше ссылок.

source: Version 0.30: Adds a section on the ``functional`` module written by Collin Winter; adds short section on the operator module; a few other edits.
es_es: Versión 0.30: Añade una sección sobre el módulo ``functional`` escrita por Collin Winter; añade una breve sección sobre el módulo operador; algunas otras modificaciones.
ru: Версия 0.30: Добавлен раздел о ``функциональном'' модуле, написанный Коллином Уинтером; добавляет краткий раздел по операторскому модулю; еще несколько правок.

source: References
es_es: Referencias

source: **Structure and Interpretation of Computer Programs**, by Harold Abelson and Gerald Jay Sussman with Julie Sussman. The book can be found at https://mitpress.mit.edu/sicp. In this classic textbook of computer science, chapters 2 and 3 discuss the use of sequences and streams to organize the data flow inside a program. The book uses Scheme for its examples, but many of the design approaches described in these chapters are applicable to functional-style Python code.
es_es: **Estructura e interpretación de programas informáticos**, de Harold Abelson y Gerald Jay Sussman con Julie Sussman. El libro puede encontrarse en https://mitpress.mit.edu/sicp. En este libro de texto clásico de informática, los capítulos 2 y 3 tratan sobre el uso de secuencias y flujos para organizar el flujo de datos dentro de un programa. El libro utiliza Scheme para sus ejemplos, pero muchos de los enfoques de diseño descritos en estos capítulos son aplicables al código Python de estilo funcional.

source: https://www.defmacro.org/ramblings/fp.html: A general introduction to functional programming that uses Java examples and has a lengthy historical introduction.
es_es: https://www.defmacro.org/ramblings/fp.html: Una introducción general a la programación funcional que utiliza ejemplos de Java y tiene una larga introducción histórica.
ru: https://www.defmacro.org/ramblings/fp.html: Общее введение в функциональное программирование, в котором используются примеры Java и имеется подробное историческое введение.

source: https://en.wikipedia.org/wiki/Functional_programming: General Wikipedia entry describing functional programming.
es_es: https://en.wikipedia.org/wiki/Functional_programming: Entrada general de Wikipedia que describe la programación funcional.
ru: https://en.wikipedia.org/wiki/Functional_programming: общая запись в Википедии, описывающая функциональное программирование.

source: https://en.wikipedia.org/wiki/Coroutine: Entry for coroutines.
es_es: https://en.wikipedia.org/wiki/Coroutine: Entrada para coroutines.
ru: https://en.wikipedia.org/wiki/Coroutine: запись для сопрограмм.

source: https://en.wikipedia.org/wiki/Currying: Entry for the concept of currying.
es_es: https://en.wikipedia.org/wiki/Currying: Entrada para el concepto de currificación.
ru: https://en.wikipedia.org/wiki/Currying: запись о концепции каррирования.

source: https://gnosis.cx/TPiP/: The first chapter of David Mertz's book :title-reference:`Text Processing in Python` discusses functional programming for text processing, in the section titled "Utilizing Higher-Order Functions in Text Processing".
es_es: https://gnosis.cx/TPiP/: El primer capítulo del libro de David Mertz :title-reference:`Text Processing in Python` trata sobre la programación funcional para el procesamiento de textos, en la sección titulada "Utilizing Higher-Order Functions in Text Processing".
ru: https://gnosis.cx/TPiP/: В первой главе книги Дэвида Мерца :title-reference:`Обработка текста в Python` обсуждается функциональное программирование для обработки текста в разделе «Использование функций высшего порядка в обработке текста». .

source: Mertz also wrote a 3-part series of articles on functional programming for IBM's DeveloperWorks site; see `part 1 <https://developer.ibm.com/articles/l-prog/>`__, `part 2 <https://developer.ibm.com/tutorials/l-prog2/>`__, and `part 3 <https://developer.ibm.com/tutorials/l-prog3/>`__,
es_es: Mertz también escribió una serie de 3 artículos sobre programación funcional para el sitio DeveloperWorks de IBM; véase `part 1 <https://developer.ibm.com/articles/l-prog/>`__, `part 2 <https://developer.ibm.com/tutorials/l-prog2/>`__, y `part 3 <https://developer.ibm.com/tutorials/l-prog3/>`__,
ru: Мерц также написал серию статей из трех частей по функциональному программированию для сайта IBM DeveloperWorks; см. `часть 1 <https://developer.ibm.com/articles/l-prog/>`__, `часть 2 <https://developer.ibm.com/tutorials/l-prog2/>`__ и `часть 3 <https://developer.ibm.com/tutorials/l-prog3/>`__,

source: Python documentation
es_es: Documentación sobre Python
ru: Документация Python

source: Documentation for the :mod:`itertools` module.
es_es: Documentación del módulo :mod:`itertools`.
ru: Документация к модулю :mod:`itertools`.

source: Documentation for the :mod:`functools` module.
es_es: Documentación del módulo :mod:`functools`.
ru: Документация к модулю :mod:`functools`

source: Documentation for the :mod:`operator` module.
es_es: Documentación del módulo :mod:`operator`.
ru: Документация к модулю :mod:`operator`

source: :pep:`289`: "Generator Expressions"
es_es: :pep:`289`: "Expresiones del generador"
ru: :pep:`289`: "Генераторные выражения"
