Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/howto/functional.po
Languages: es_es, ru

source: :func:`enumerate(iter, start=0) <enumerate>` counts off the elements in the iterable returning 2-tuples containing the count (from *start*) and each element. ::
es_es: :func:`enumerate(iter, start=0) <enumerate>` cuenta los elementos del iterable devolviendo 2-tuplas que contienen la cuenta (desde *start*) y cada elemento. ::
ru: :func:`enumerate(iter, start=0) <enumerate>` подсчитывает элементы в итерации, возвращая 2-кортежи, содержащие счетчик (из *start*) и каждый элемент. ::

source: :func:`enumerate` is often used when looping through a list and recording the indexes at which certain conditions are met::
es_es: :func:`enumerate` se utiliza a menudo para recorrer una lista y registrar los índices en los que se cumplen determinadas condiciones::
ru: :func:`enumerate` часто используется при циклическом просмотре списка и записи индексов, при которых выполняются определенные условия::

source: :func:`sorted(iterable, key=None, reverse=False) <sorted>` collects all the elements of the iterable into a list, sorts the list, and returns the sorted result. The *key* and *reverse* arguments are passed through to the constructed list's :meth:`~list.sort` method. ::
es_es: :func:`sorted(iterable, key=None, reverse=False) <sorted>` recoge todos los elementos del iterable en una lista, ordena la lista y devuelve el resultado ordenado. Los argumentos *key* y *reverse* se pasan al método :meth:`~list.sort` de la lista construida. ::
ru: :func:`sorted(iterable, key=None,verse=False) <sorted>` собирает все элементы итерируемого объекта в список, сортирует его и возвращает отсортированный результат. Аргументы *key* и *reverse* передаются в метод :meth:`~list.sort` созданного списка. ::

source: (For a more detailed discussion of sorting, see the :ref:`sortinghowto`.)
es_es: (Para un análisis más detallado de la clasificación, ver :ref:`sortinghowto`.)
ru: (Более подробное обсуждение сортировки см. в разделе :ref:`sortinghowto`.)

source: The :func:`any(iter) <any>` and :func:`all(iter) <all>` built-ins look at the truth values of an iterable's contents. :func:`any` returns ``True`` if any element in the iterable is a true value, and :func:`all` returns ``True`` if all of the elements are true values:
es_es: Las funciones :func:`any(iter) <any>` y :func:`all(iter) <all>` buscan los valores verdaderos del contenido de un iterable. :func:`any` devuelve ``True`` si cualquier elemento del iterable es un valor verdadero, y :func:`all` devuelve ``True`` si todos los elementos son valores verdaderos:
ru: Встроенные функции :func:`any(iter) <any>` и :func:`all(iter) <all>` проверяют истинностные значения содержимого итерируемого объекта. :func:`any` возвращает ``True``, если какой-либо элемент в итерируемом объекте является истинным значением, а :func:`all` возвращает ``True``, если все элементы являются истинными значениями:

source: :func:`zip(iterA, iterB, ...) <zip>` takes one element from each iterable and returns them in a tuple::
es_es: :func:`zip(iterA, iterB, ...) <zip>` toma un elemento de cada iterable y los devuelve en una tupla::
ru: :func:`zip(iterA, iterB, ...) <zip>` берет по одному элементу из каждой итерации и возвращает их в кортеже::

source: It doesn't construct an in-memory list and exhaust all the input iterators before returning; instead tuples are constructed and returned only if they're requested. (The technical term for this behaviour is `lazy evaluation <https://en.wikipedia.org/wiki/Lazy_evaluation>`__.)
es_es: No construye una lista en memoria y agota todos los iteradores de entrada antes de devolver; en su lugar, las tuplas se construyen y devuelven sólo si se solicitan. (El término técnico para este comportamiento es `lazy evaluation <https://en.wikipedia.org/wiki/Lazy_evaluation>`__.)
ru: Он не создает список в памяти и не исчерпывает все входные итераторы перед возвратом; вместо этого кортежи создаются и возвращаются только в том случае, если они запрошены. (Технический термин для такого поведения — `ленивая оценка <https://en.wikipedia.org/wiki/Lazy_evaluation>`__.)

source: This iterator is intended to be used with iterables that are all of the same length. If the iterables are of different lengths, the resulting stream will be the same length as the shortest iterable. ::
es_es: Este iterador está pensado para ser utilizado con iterables que tengan todos la misma longitud. Si los iterables tienen longitudes diferentes, el flujo resultante tendrá la misma longitud que el iterable más corto. ::
ru: Этот итератор предназначен для использования с итерациями одинаковой длины. Если итерации имеют разную длину, результирующий поток будет той же длины, что и самая короткая итерация. ::

source: You should avoid doing this, though, because an element may be taken from the longer iterators and discarded. This means you can't go on to use the iterators further because you risk skipping a discarded element.
es_es: Sin embargo, debes evitar hacer esto, porque un elemento puede ser tomado de los iteradores más largos y descartado. Esto significa que no puedes seguir utilizando los iteradores porque corres el riesgo de saltarte un elemento descartado.
ru: Однако вам следует избегать этого, поскольку элемент может быть взят из более длинных итераторов и отброшен. Это означает, что вы не можете использовать итераторы дальше, потому что рискуете пропустить отброшенный элемент.

source: The itertools module
es_es: El módulo itertools
ru: Модуль itertools

source: The :mod:`itertools` module contains a number of commonly used iterators as well as functions for combining several iterators. This section will introduce the module's contents by showing small examples.
es_es: El módulo :mod:`itertools` contiene una serie de iteradores de uso común, así como funciones para combinar varios iteradores. Esta sección introducirá el contenido del módulo mostrando pequeños ejemplos.
ru: Модуль :mod:`itertools` содержит ряд часто используемых итераторов, а также функции для объединения нескольких итераторов. В этом разделе будет представлено содержимое модуля на небольших примерах.

source: The module's functions fall into a few broad classes:
es_es: Las funciones del módulo se dividen en varias clases generales:
ru: Функции модуля делятся на несколько широких классов:

source: Functions that create a new iterator based on an existing iterator.
es_es: Funciones que crean un nuevo iterador basado en un iterador existente.
ru: Функции, создающие новый итератор на основе существующего итератора.

source: Functions for treating an iterator's elements as function arguments.
es_es: Funciones para tratar los elementos de un iterador como argumentos de función.
ru: Функции для обработки элементов итератора как аргументов функции.

source: Functions for selecting portions of an iterator's output.
es_es: Funciones para seleccionar partes de la salida de un iterador.
ru: Функции для выбора частей вывода итератора.

source: A function for grouping an iterator's output.
es_es: Función para agrupar la salida de un iterador.
ru: Функция для группировки вывода итератора.

source: Creating new iterators
es_es: Creación de nuevos iteradores
ru: Создание новых итераторов

source: :func:`itertools.count(start, step) <itertools.count>` returns an infinite stream of evenly spaced values. You can optionally supply the starting number, which defaults to 0, and the interval between numbers, which defaults to 1::
es_es: :func:`itertools.count(start, step) <itertools.count>` devuelve un flujo infinito de valores espaciados uniformemente. Puede proporcionar opcionalmente el número inicial, que por defecto es 0, y el intervalo entre números, que por defecto es 1::
ru: :func:`itertools.count(start, Step) <itertools.count>` возвращает бесконечный поток равномерно распределенных значений. При желании вы можете указать начальный номер, который по умолчанию равен 0, и интервал между числами, который по умолчанию равен 1::

source: :func:`itertools.cycle(iter) <itertools.cycle>` saves a copy of the contents of a provided iterable and returns a new iterator that returns its elements from first to last. The new iterator will repeat these elements infinitely. ::
es_es: :func:`itertools.cycle(iter) <itertools.cycle>` guarda una copia del contenido de un iterable proporcionado y devuelve un nuevo iterador que devuelve sus elementos del primero al último. El nuevo iterador repetirá estos elementos infinitamente. ::
ru: :func:`itertools.cycle(iter) <itertools.cycle>` сохраняет копию содержимого предоставленной итерации и возвращает новый итератор, который возвращает его элементы от первого до последнего. Новый итератор будет повторять эти элементы бесконечно. ::

source: :func:`itertools.repeat(elem, [n]) <itertools.repeat>` returns the provided element *n* times, or returns the element endlessly if *n* is not provided. ::
es_es: :func:`itertools.repeat(elem, [n]) <itertools.repeat>` devuelve el elemento proporcionado *n* veces, o devuelve el elemento sin fin si *n* no se proporciona. ::
ru: :func:`itertools.repeat(elem, [n]) <itertools.repeat>` возвращает предоставленный элемент *n* раз или возвращает элемент бесконечно, если *n* не указано. ::

source: :func:`itertools.chain(iterA, iterB, ...) <itertools.chain>` takes an arbitrary number of iterables as input, and returns all the elements of the first iterator, then all the elements of the second, and so on, until all of the iterables have been exhausted. ::
es_es: :func:`itertools.chain(iterA, iterB, ...) <itertools.chain>` toma un número arbitrario de iterables como entrada, y devuelve todos los elementos del primer iterador, luego todos los elementos del segundo, y así sucesivamente, hasta agotar todos los iterables. ::
ru: :func:`itertools.chain(iterA, iterB, ...) <itertools.chain>` принимает на вход произвольное количество итераций и возвращает все элементы первого итератора, затем все элементы второго и и так далее, пока все итерации не будут исчерпаны. ::

source: :func:`itertools.islice(iter, [start], stop, [step]) <itertools.islice>` returns a stream that's a slice of the iterator. With a single *stop* argument, it will return the first *stop* elements. If you supply a starting index, you'll get *stop-start* elements, and if you supply a value for *step*, elements will be skipped accordingly. Unlike Python's string and list slicing, you can't use negative values for *start*, *stop*, or *step*. ::
es_es: :func:`itertools.islice(iter, [start], stop, [step]) <itertools.islice>` devuelve un flujo que es un corte del iterador. Con un único argumento *stop*, devolverá los primeros elementos *stop*. Si proporcionas un índice inicial, obtendrás los elementos *stop-start*, y si proporcionas un valor para *step*, los elementos se saltarán en consecuencia. A diferencia del corte de cadenas y listas de Python, no se pueden usar valores negativos para *start*, *stop* o *step*. ::
ru: :func:`itertools.islice(iter, [start], stop, [step]) <itertools.islice>` возвращает поток, который является частью итератора. С единственным аргументом *stop* он вернет первые элементы *stop*. Если вы укажете начальный индекс, вы получите элементы *stop-start*, а если вы укажете значение для *step*, элементы будут соответственно пропущены. В отличие от разделения строк и списков в Python, вы не можете использовать отрицательные значения для *start*, *stop* или *step*. ::

source: :func:`itertools.tee(iter, [n]) <itertools.tee>` replicates an iterator; it returns *n* independent iterators that will all return the contents of the source iterator. If you don't supply a value for *n*, the default is 2. Replicating iterators requires saving some of the contents of the source iterator, so this can consume significant memory if the iterator is large and one of the new iterators is consumed more than the others. ::
es_es: :func:`itertools.tee(iter, [n]) <itertools.tee>` replica un iterador; devuelve *n* iteradores independientes que devolverán todos el contenido del iterador fuente. Si no se proporciona un valor para *n*, el valor por defecto es 2. Replicar iteradores requiere guardar algunos de los contenidos del iterador fuente, por lo que puede consumir bastante memoria si el iterador es grande y uno de los nuevos iteradores se consume más que los otros. ::
ru: :func:`itertools.tee(iter, [n]) <itertools.tee>` копирует итератор; он возвращает *n* независимых итераторов, которые возвращают содержимое исходного итератора. Если вы не указали значение для *n*, значением по умолчанию будет 2. Репликация итераторов требует сохранения части содержимого исходного итератора, поэтому это может занять значительный объем памяти, если итератор большой и используется один из новых итераторов. больше, чем другие. ::

source: Calling functions on elements
es_es: Llamada a funciones sobre elementos
ru: Вызов функций для элементов

source: The :mod:`operator` module contains a set of functions corresponding to Python's operators. Some examples are :func:`operator.add(a, b) <operator.add>` (adds two values), :func:`operator.ne(a, b) <operator.ne>` (same as ``a != b``), and :func:`operator.attrgetter('id') <operator.attrgetter>` (returns a callable that fetches the ``.id`` attribute).
es_es: El módulo :mod:`operator` contiene un conjunto de funciones correspondientes a los operadores de Python. Algunos ejemplos son :func:`operator.add(a, b) <operator.add>` (añade dos valores), :func:`operator.ne(a, b) <operator.ne>` (igual que ``a != b``), y :func:`operator.attrgetter('id') <operator.attrgetter>` (devuelve una llamada que obtiene el atributo ``.id`` ).
ru: Модуль :mod:`operator` содержит набор функций, соответствующих операторам Python. Некоторые примеры: :func:`operator.add(a, b) <operator.add>` (добавляет два значения), :func:`operator.ne(a, b) <operator.ne>` (то же самое, что `` a != b``) и :func:`operator.attrgetter('id') <operator.attrgetter>` (возвращает вызываемый объект, который извлекает атрибут ``.id``).

source: :func:`itertools.starmap(func, iter) <itertools.starmap>` assumes that the iterable will return a stream of tuples, and calls *func* using these tuples as the arguments::
es_es: :func:`itertools.starmap(func, iter) <itertools.starmap>` asume que el iterable devolverá un flujo de tuplas, y llama a *func* usando estas tuplas como argumentos::
ru: :func:`itertools.starmap(func, iter) <itertools.starmap>` предполагает, что итерируемый объект вернет поток кортежей, и вызывает *func*, используя эти кортежи в качестве аргументов::

source: Selecting elements
es_es: Seleccionar elementos
ru: Выбор элементов

source: Another group of functions chooses a subset of an iterator's elements based on a predicate.
es_es: Otro grupo de funciones elige un subconjunto de elementos de un iterador basándose en un predicado.
ru: Другая группа функций выбирает подмножество элементов итератора на основе предиката.

source: :func:`itertools.filterfalse(predicate, iter) <itertools.filterfalse>` is the opposite of :func:`filter`, returning all elements for which the predicate returns false::
es_es: :func:`itertools.filterfalse(predicate, iter) <itertools.filterfalse>` es lo contrario de :func:`filter`, devolviendo todos los elementos para los que el predicado devuelve falso::
ru: :func:`itertools.filterfalse(predicate, iter) <itertools.filterfalse>` является противоположностью :func:`filter`, возвращая все элементы, для которых предикат возвращает false::

source: :func:`itertools.takewhile(predicate, iter) <itertools.takewhile>` returns elements for as long as the predicate returns true. Once the predicate returns false, the iterator will signal the end of its results. ::
es_es: :func:`itertools.takewhile(predicado, iter) <itertools.takewhile>` devuelve elementos mientras el predicado sea verdadero. Una vez que el predicado devuelva falso, el iterador señalará el final de sus resultados. ::
ru: :func:`itertools.take while(predicate, iter) <itertools.take while>` возвращает элементы до тех пор, пока предикат возвращает true. Как только предикат вернет false, итератор сообщит об окончании своих результатов. ::

source: :func:`itertools.dropwhile(predicate, iter) <itertools.dropwhile>` discards elements while the predicate returns true, and then returns the rest of the iterable's results. ::
es_es: :func:`itertools.dropwhile(predicate, iter) <itertools.dropwhile>` descarta elementos mientras el predicado devuelva verdadero, y luego devuelve el resto de resultados del iterable. ::
ru: :func:`itertools.drop while(predicate, iter) <itertools.drop while>` отбрасывает элементы, пока предикат возвращает true, а затем возвращает остальные результаты итерации. ::

source: :func:`itertools.compress(data, selectors) <itertools.compress>` takes two iterators and returns only those elements of *data* for which the corresponding element of *selectors* is true, stopping whenever either one is exhausted::
es_es: :func:`itertools.compress(data, selectors) <itertools.compress>` toma dos iteradores y devuelve sólo aquellos elementos de *data* para los que el elemento correspondiente de *selectors* es verdadero, deteniéndose cuando cualquiera de ellos se agota::
ru: :func:`itertools.compress(data, selectors) <itertools.compress>` принимает два итератора и возвращает только те элементы *data*, для которых соответствующий элемент *selectors* является истинным, останавливаясь всякий раз, когда любой из них исчерпан::

source: Combinatoric functions
es_es: Funciones combinatorias
ru: Комбинаторные функции

source: The :func:`itertools.combinations(iterable, r) <itertools.combinations>` returns an iterator giving all possible *r*-tuple combinations of the elements contained in *iterable*. ::
es_es: La función :func:`itertools.combinations(iterable, r) <itertools.combinations>` devuelve un iterador con todas las combinaciones posibles de *r*-tuplas de los elementos contenidos en *iterable*. ::
ru: :func:`itertools.combinations(iterable, r) <itertools.combinations>` возвращает итератор, дающий все возможные комбинации *r*-кортежей элементов, содержащихся в *iterable*. ::

source: The elements within each tuple remain in the same order as *iterable* returned them. For example, the number 1 is always before 2, 3, 4, or 5 in the examples above. A similar function, :func:`itertools.permutations(iterable, r=None) <itertools.permutations>`, removes this constraint on the order, returning all possible arrangements of length *r*::
es_es: Los elementos dentro de cada tupla permanecen en el mismo orden en que *iterable* los devolvió. Por ejemplo, el número 1 siempre está antes que 2, 3, 4 o 5 en los ejemplos anteriores. Una función similar, :func:`itertools.permutations(iterable, r=None) <itertools.permutations>`, elimina esta restricción en el orden, devolviendo todos los posibles arreglos de longitud *r*::
ru: Элементы внутри каждого кортежа остаются в том же порядке, в котором их вернул *iterable*. Например, в приведенных выше примерах число 1 всегда предшествует 2, 3, 4 или 5. Аналогичная функция, :func:`itertools.permutations(iterable, r=None) <itertools.permutations>`, удаляет это ограничение на порядок, возвращая все возможные варианты длины *r*::

source: If you don't supply a value for *r* the length of the iterable is used, meaning that all the elements are permuted.
es_es: Si no proporciona un valor para *r* se utiliza la longitud del iterable, lo que significa que todos los elementos se permutan.
ru: Если вы не указали значение для *r*, используется длина итерации, что означает, что все элементы переставляются.

source: Note that these functions produce all of the possible combinations by position and don't require that the contents of *iterable* are unique::
es_es: Tenga en cuenta que estas funciones producen todas las combinaciones posibles por posición y no requieren que el contenido de *iterable* sea único::
ru: Обратите внимание, что эти функции создают все возможные комбинации по позиции и не требуют, чтобы содержимое *iterable* было уникальным::

source: The identical tuple ``('a', 'a', 'b')`` occurs twice, but the two 'a' strings came from different positions.
es_es: La misma tupla ``('a', 'a', 'b')`` aparece dos veces, pero las dos cadenas "a" proceden de posiciones diferentes.
ru: Идентичный кортеж ``('a', 'a', 'b')`` встречается дважды, но две строки 'a' находятся в разных позициях.

source: The :func:`itertools.combinations_with_replacement(iterable, r) <itertools.combinations_with_replacement>` function relaxes a different constraint: elements can be repeated within a single tuple. Conceptually an element is selected for the first position of each tuple and then is replaced before the second element is selected. ::
es_es: La función :func:`itertools.combinations_with_replacement(iterable, r) <itertools.combinations_with_replacement>` relaja una restricción diferente: los elementos pueden repetirse dentro de una misma tupla. Conceptualmente se selecciona un elemento para la primera posición de cada tupla y luego se sustituye antes de seleccionar el segundo elemento. ::
ru: Функция :func:`itertools.combinations_with_replacement(iterable, r) <itertools.combinations_with_replacement>` ослабляет другое ограничение: элементы могут повторяться в пределах одного кортежа. Концептуально элемент выбирается для первой позиции каждого кортежа, а затем заменяется перед выбором второго элемента. ::

source: Grouping elements
es_es: Agrupación de elementos
ru: Группировка элементов

source: The last function I'll discuss, :func:`itertools.groupby(iter, key_func=None) <itertools.groupby>`, is the most complicated. ``key_func(elem)`` is a function that can compute a key value for each element returned by the iterable. If you don't supply a key function, the key is simply each element itself.
es_es: La última función que voy a discutir, :func:`itertools.groupby(iter, key_func=None) <itertools.groupby>`, es la más complicada. ``key_func(elem)`` es una función que puede calcular un valor clave para cada elemento devuelto por el iterable. Si no se proporciona una función clave, la clave es simplemente cada elemento.
ru: Последняя функция, которую я обсужу, :func:`itertools.groupby(iter, key_func=None) <itertools.groupby>`, является самой сложной. ``key_func(elem)`` — это функция, которая может вычислять значение ключа для каждого элемента, возвращаемого итерацией. Если вы не указали ключевую функцию, то ключом будет просто каждый элемент.

source: :func:`~itertools.groupby` collects all the consecutive elements from the underlying iterable that have the same key value, and returns a stream of 2-tuples containing a key value and an iterator for the elements with that key.
es_es: :func:`~itertools.groupby` recoge todos los elementos consecutivos del iterable subyacente que tienen el mismo valor clave, y devuelve un flujo de 2-tuplas que contiene un valor clave y un iterador para los elementos con esa clave.
ru: :func:`~itertools.groupby` собирает все последовательные элементы базовой итерации, имеющие одинаковое значение ключа, и возвращает поток из двух кортежей, содержащих значение ключа и итератор для элементов с этим ключом.
