Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/howto/functional.po
Languages: es_es, ru

source: Debugging is simplified because functions are generally small and clearly specified. When a program doesn't work, each function is an interface point where you can check that the data are correct. You can look at the intermediate inputs and outputs to quickly isolate the function that's responsible for a bug.
es_es: La depuración se simplifica porque las funciones suelen ser pequeñas y estar claramente especificadas. Cuando un programa no funciona, cada función es un punto de interfaz en el que puedes comprobar que los datos son correctos. Puedes mirar las entradas y salidas intermedias para aislar rápidamente la función responsable de un fallo.
ru: Отладка упрощается, поскольку функции обычно небольшие и четко определены. Когда программа не работает, каждая функция является точкой интерфейса, где вы можете проверить правильность данных. Вы можете просмотреть промежуточные входы и выходы, чтобы быстро определить функцию, ответственную за ошибку.

source: Testing is easier because each function is a potential subject for a unit test. Functions don't depend on system state that needs to be replicated before running a test; instead you only have to synthesize the right input and then check that the output matches expectations.
es_es: Probar es más fácil porque cada función es un tema potencial para una prueba unitaria. Las funciones no dependen de un estado del sistema que haya que replicar antes de ejecutar una prueba, sino que basta con sintetizar la entrada correcta y comprobar que la salida coincide con las expectativas.
ru: Тестирование проще, поскольку каждая функция является потенциальным объектом модульного теста. Функции не зависят от состояния системы, которое необходимо воспроизвести перед запуском теста; вместо этого вам нужно всего лишь синтезировать правильные входные данные, а затем проверить, соответствуют ли выходные данные ожиданиям.

source: Composability
es_es: Composibilidad
ru: Компонуемость

source: As you work on a functional-style program, you'll write a number of functions with varying inputs and outputs. Some of these functions will be unavoidably specialized to a particular application, but others will be useful in a wide variety of programs. For example, a function that takes a directory path and returns all the XML files in the directory, or a function that takes a filename and returns its contents, can be applied to many different situations.
es_es: A medida que trabaje en un programa de estilo funcional, escribirá una serie de funciones con entradas y salidas variables. Algunas de estas funciones serán inevitablemente especializadas para una aplicación particular, pero otras serán útiles en una amplia variedad de programas. Por ejemplo, una función que toma una ruta de directorio y devuelve todos los archivos XML del directorio, o una función que toma un nombre de archivo y devuelve su contenido, pueden aplicarse a muchas situaciones diferentes.
ru: Работая над программой функционального стиля, вы будете писать ряд функций с разными входными и выходными данными. Некоторые из этих функций неизбежно будут специализированы для конкретного приложения, но другие будут полезны в самых разных программах. Например, функция, которая принимает путь к каталогу и возвращает все XML-файлы в каталоге, или функция, которая принимает имя файла и возвращает его содержимое, может применяться во многих различных ситуациях.

source: Over time you'll form a personal library of utilities. Often you'll assemble new programs by arranging existing functions in a new configuration and writing a few functions specialized for the current task.
es_es: Con el tiempo formarás una biblioteca personal de utilidades. A menudo montarás nuevos programas organizando las funciones existentes en una nueva configuración y escribiendo unas cuantas funciones especializadas para la tarea actual.
ru: Со временем у вас сформируется личная библиотека утилит. Часто вы собираете новые программы, компонуя существующие функции в новой конфигурации и записывая несколько функций, специально предназначенных для текущей задачи.

source: Iterators
es_es: Iteradores
ru: Итераторы

source: I'll start by looking at a Python language feature that's an important foundation for writing functional-style programs: iterators.
es_es: Empezaré analizando una característica del lenguaje Python que es una base importante para escribir programas de estilo funcional: los iteradores.
ru: Я начну с рассмотрения возможности языка Python, которая является важной основой для написания программ функционального стиля: итераторов.

source: An iterator is an object representing a stream of data; this object returns the data one element at a time. A Python iterator must support a method called :meth:`~iterator.__next__` that takes no arguments and always returns the next element of the stream. If there are no more elements in the stream, :meth:`~iterator.__next__` must raise the :exc:`StopIteration` exception. Iterators don't have to be finite, though; it's perfectly reasonable to write an iterator that produces an infinite stream of data.
es_es: Un iterador es un objeto que representa un flujo de datos; este objeto devuelve los datos de uno en uno. Un iterador de Python debe soportar un método llamado :meth:`~iterator.__next__` que no toma argumentos y siempre devuelve el siguiente elemento del flujo. Si no hay más elementos en el flujo, :meth:`~iterator.__next__` debe lanzar la excepción :exc:`StopIteration`. Sin embargo, los iteradores no tienen que ser finitos; es perfectamente razonable escribir un iterador que produzca un flujo infinito de datos.
ru: Итератор — это объект, представляющий поток данных; этот объект возвращает данные по одному элементу за раз. Итератор Python должен поддерживать метод :meth:`~iterator.__next__`, который не принимает аргументов и всегда возвращает следующий элемент потока. Если в потоке больше нет элементов, :meth:`~iterator.__next__` должен вызвать исключение :exc:`StopIteration`. Однако итераторы не обязательно должны быть конечными; вполне разумно написать итератор, создающий бесконечный поток данных.

source: The built-in :func:`iter` function takes an arbitrary object and tries to return an iterator that will return the object's contents or elements, raising :exc:`TypeError` if the object doesn't support iteration. Several of Python's built-in data types support iteration, the most common being lists and dictionaries. An object is called :term:`iterable` if you can get an iterator for it.
es_es: La función incorporada :func:`iter` toma un objeto arbitrario e intenta devolver un iterador que devolverá los contenidos o elementos del objeto, mostrando :exc:`TypeError` si el objeto no soporta iteración. Varios de los tipos de datos incorporados en Python soportan la iteración, siendo los más comunes las listas y los diccionarios. Un objeto se llama :term:`iterable` si puedes obtener un iterador para él.
ru: Встроенная функция :func:`iter` принимает произвольный объект и пытается вернуть итератор, который вернет содержимое или элементы объекта, вызывая :exc:`TypeError`, если объект не поддерживает итерацию. Некоторые встроенные типы данных Python поддерживают итерацию, наиболее распространенными из которых являются списки и словари. Объект называется :term:`iterable`, если вы можете получить для него итератор.

source: You can experiment with the iteration interface manually:
es_es: Puede experimentar con la interfaz de iteración manualmente:
ru: Вы можете поэкспериментировать с интерфейсом итерации вручную:

source: Python expects iterable objects in several different contexts, the most important being the :keyword:`for` statement. In the statement ``for X in Y``, Y must be an iterator or some object for which :func:`iter` can create an iterator. These two statements are equivalent::
es_es: Python espera objetos iterables en varios contextos diferentes, siendo el más importante la sentencia :keyword:`for`. En la sentencia ``for X in Y``, Y debe ser un iterador o algún objeto para el que :func:`iter` pueda crear un iterador. Estas dos sentencias son equivalentes::
ru: Python ожидает итерации объектов в нескольких различных контекстах, наиболее важным из которых является оператор :keyword:`for`. В утверждении ``for X in Y`` Y должен быть итератором или каким-либо объектом, для которого :func:`iter` может создать итератор. Эти два утверждения эквивалентны:

source: Iterators can be materialized as lists or tuples by using the :func:`list` or :func:`tuple` constructor functions:
es_es: Los iteradores pueden materializarse como listas o tuplas utilizando las funciones constructoras :func:`list` o :func:`tuple`:
ru: Итераторы можно материализовать в виде списков или кортежей с помощью функций-конструкторов :func:`list` или :func:`tuple`:

source: Sequence unpacking also supports iterators: if you know an iterator will return N elements, you can unpack them into an N-tuple:
es_es: El desempaquetado de secuencias también admite iteradores: si sabe que un iterador devolverá N elementos, puede desempaquetarlos en una N-tupla:
ru: Распаковка последовательностей также поддерживает итераторы: если вы знаете, что итератор вернет N элементов, вы можете распаковать их в N-кортеж:

source: Built-in functions such as :func:`max` and :func:`min` can take a single iterator argument and will return the largest or smallest element. The ``"in"`` and ``"not in"`` operators also support iterators: ``X in iterator`` is true if X is found in the stream returned by the iterator. You'll run into obvious problems if the iterator is infinite; :func:`max`, :func:`min` will never return, and if the element X never appears in the stream, the ``"in"`` and ``"not in"`` operators won't return either.
es_es: Las funciones incorporadas como :func:`max` y :func:`min` pueden tomar un único argumento iterador y devolverán el elemento mayor o menor. Los operadores ``"in"`` y ``"not in"`` también admiten iteradores: ``X in iterator`` es verdadero si X se encuentra en el flujo devuelto por el iterador. Se encontrará con problemas obvios si el iterador es infinito; :func:`max`, :func:`min` nunca devolverán, y si el elemento X nunca aparece en el flujo, los operadores ``"in"`` y ``"not in"`` tampoco devolverán.
ru: Встроенные функции, такие как :func:`max` и :func:`min`, могут принимать один аргумент итератора и возвращать самый большой или наименьший элемент. Операторы «in» и «not in» также поддерживают итераторы: «X в итераторе» имеет значение true, если X найден в потоке, возвращаемом итератором. Вы столкнетесь с очевидными проблемами, если итератор бесконечен; :func:`max`, :func:`min` никогда не вернется, и если элемент X никогда не появляется в потоке, операторы ``"in"`` и ``"not in"`` не вернут результат. или.

source: Note that you can only go forward in an iterator; there's no way to get the previous element, reset the iterator, or make a copy of it. Iterator objects can optionally provide these additional capabilities, but the iterator protocol only specifies the :meth:`~iterator.__next__` method. Functions may therefore consume all of the iterator's output, and if you need to do something different with the same stream, you'll have to create a new iterator.
es_es: Ten en cuenta que sólo puedes avanzar en un iterador; no hay forma de obtener el elemento anterior, reiniciar el iterador o hacer una copia de él. Los objetos iteradores pueden proporcionar opcionalmente estas capacidades adicionales, pero el protocolo de iteradores sólo especifica el método :meth:`~iterator.__next__`. Por lo tanto, las funciones pueden consumir toda la salida del iterador, y si necesitas hacer algo diferente con el mismo flujo, tendrás que crear un nuevo iterador.
ru: Обратите внимание, что вы можете двигаться вперед только в итераторе; нет возможности получить предыдущий элемент, сбросить итератор или сделать его копию. Объекты итератора могут дополнительно предоставлять эти дополнительные возможности, но протокол итератора определяет только метод :meth:`~iterator.__next__`. Таким образом, функции могут использовать весь вывод итератора, и если вам нужно сделать что-то другое с тем же потоком, вам придется создать новый итератор.

source: Data Types That Support Iterators
es_es: Tipos de datos que admiten iteradores
ru: Типы данных, поддерживающие итераторы

source: We've already seen how lists and tuples support iterators. In fact, any Python sequence type, such as strings, will automatically support creation of an iterator.
es_es: Ya hemos visto cómo las listas y las tuplas soportan iteradores. De hecho, cualquier tipo de secuencia de Python, como las cadenas, soportará automáticamente la creación de un iterador.
ru: Мы уже видели, как списки и кортежи поддерживают итераторы. Фактически, любой тип последовательности Python, например строки, автоматически поддерживает создание итератора.

source: Calling :func:`iter` on a dictionary returns an iterator that will loop over the dictionary's keys::
es_es: Al llamar a :func:`iter` sobre un diccionario se obtiene un iterador que recorrerá las claves del diccionario::
ru: Вызов :func:`iter` для словаря возвращает итератор, который будет перебирать ключи словаря::

source: Note that starting with Python 3.7, dictionary iteration order is guaranteed to be the same as the insertion order. In earlier versions, the behaviour was unspecified and could vary between implementations.
es_es: Ten en cuenta que a partir de Python 3.7, se garantiza que el orden de iteración del diccionario es el mismo que el orden de inserción. En versiones anteriores, el comportamiento no estaba especificado y podía variar entre implementaciones.
ru: Обратите внимание, что начиная с Python 3.7 порядок итерации словаря гарантированно совпадает с порядком вставки. В более ранних версиях поведение не было указано и могло различаться в зависимости от реализации.

source: Applying :func:`iter` to a dictionary always loops over the keys, but dictionaries have methods that return other iterators. If you want to iterate over values or key/value pairs, you can explicitly call the :meth:`~dict.values` or :meth:`~dict.items` methods to get an appropriate iterator.
es_es: La aplicación de :func:`iter` a un diccionario siempre itera sobre las claves, pero los diccionarios tienen métodos que devuelven otros iteradores. Si desea iterar sobre valores o pares clave/valor, puede llamar explícitamente a los métodos :meth:`~dict.values` o :meth:`~dict.items` para obtener un iterador apropiado.
ru: Применение :func:`iter` к словарю всегда циклически перебирает ключи, но словари имеют методы, которые возвращают другие итераторы. Если вы хотите перебирать значения или пары ключ/значение, вы можете явно вызвать методы :meth:`~dict.values` или :meth:`~dict.items`, чтобы получить соответствующий итератор.

source: The :func:`dict` constructor can accept an iterator that returns a finite stream of ``(key, value)`` tuples:
es_es: El constructor :func:`dict` puede aceptar un iterador que devuelva un flujo finito de tuplas ``(key, value)``:
ru: Конструктор :func:`dict` может принимать итератор, который возвращает конечный поток кортежей ``(ключ, значение)``:

source: Files also support iteration by calling the :meth:`~io.TextIOBase.readline` method until there are no more lines in the file. This means you can read each line of a file like this::
es_es: Los archivos también admiten la iteración llamando al método :meth:`~io.TextIOBase.readline` hasta que no haya más líneas en el archivo. Esto significa que puede leer cada línea de un archivo de la siguiente manera::
ru: Файлы также поддерживают итерацию, вызывая метод :meth:`~io.TextIOBase.readline` до тех пор, пока в файле не останется строк. Это означает, что вы можете прочитать каждую строку файла следующим образом:

source: Sets can take their contents from an iterable and let you iterate over the set's elements::
es_es: Los conjuntos pueden tomar su contenido de un iterable y te permiten iterar sobre los elementos del conjunto::
ru: Наборы могут брать свое содержимое из итерируемого объекта и позволять вам перебирать элементы набора:

source: Generator expressions and list comprehensions
es_es: Expresiones generadoras y comprensión de listas
ru: Выражения-генераторы и понимание списков

source: Two common operations on an iterator's output are 1) performing some operation for every element, 2) selecting a subset of elements that meet some condition. For example, given a list of strings, you might want to strip off trailing whitespace from each line or extract all the strings containing a given substring.
es_es: Dos operaciones comunes en la salida de un iterador son 1) realizar alguna operación para cada elemento, 2) seleccionar un subconjunto de elementos que cumplan alguna condición. Por ejemplo, dada una lista de cadenas, es posible que desee eliminar los espacios en blanco al final de cada línea o extraer todas las cadenas que contengan una subcadena determinada.
ru: Две распространенные операции над выходными данными итератора: 1) выполнение некоторой операции для каждого элемента, 2) выбор подмножества элементов, соответствующих некоторому условию. Например, если у вас есть список строк, вы можете захотеть удалить конечные пробелы из каждой строки или извлечь все строки, содержащие данную подстроку.

source: List comprehensions and generator expressions (short form: "listcomps" and "genexps") are a concise notation for such operations, borrowed from the functional programming language Haskell (https://www.haskell.org/). You can strip all the whitespace from a stream of strings with the following code::
es_es: Las comprensiones de listas y las expresiones generadoras (abreviadas: "listcomps" y "genexps") son una notación concisa para este tipo de operaciones, tomada del lenguaje de programación funcional Haskell (https://www.haskell.org/). Puede eliminar todos los espacios en blanco de un flujo de cadenas con el siguiente código::
ru: Понимание списков и выражения-генераторы (краткая форма: «listcomps» и «genexps») представляют собой краткую запись таких операций, заимствованную из функционального языка программирования Haskell (https://www.haskell.org/). Вы можете удалить все пробелы из потока строк с помощью следующего кода:

source: You can select only certain elements by adding an ``"if"`` condition::
es_es: Puede seleccionar sólo determinados elementos añadiendo una condición ``"if"``::
ru: Вы можете выбрать только определенные элементы, добавив условие ``if'``:

source: With a list comprehension, you get back a Python list; ``stripped_list`` is a list containing the resulting lines, not an iterator. Generator expressions return an iterator that computes the values as necessary, not needing to materialize all the values at once. This means that list comprehensions aren't useful if you're working with iterators that return an infinite stream or a very large amount of data. Generator expressions are preferable in these situations.
es_es: Con una comprensión de lista, se devuelve una lista de Python; ``stripped_list`` es una lista que contiene las líneas resultantes, no un iterador. Las expresiones generadoras devuelven un iterador que computa los valores según sea necesario, sin necesidad de materializar todos los valores a la vez. Esto significa que las comprensiones de lista no son útiles si se trabaja con iteradores que devuelven un flujo infinito o una cantidad muy grande de datos. En estas situaciones son preferibles las expresiones generadoras.
ru: Благодаря пониманию списка вы получаете список Python; ``striped_list`` — это список, содержащий результирующие строки, а не итератор. Выражения-генераторы возвращают итератор, который вычисляет значения по мере необходимости, без необходимости материализовать все значения одновременно. Это означает, что понимание списков бесполезно, если вы работаете с итераторами, которые возвращают бесконечный поток или очень большой объем данных. В таких ситуациях предпочтительнее использовать выражения-генераторы.

source: Generator expressions are surrounded by parentheses ("()") and list comprehensions are surrounded by square brackets ("[]"). Generator expressions have the form::
es_es: Las expresiones generadoras van entre paréntesis ("()") y las comprensiones de listas van entre corchetes ("[]"). Las expresiones generadas tienen la forma::
ru: Выражения генератора заключаются в круглые скобки («()»), а выражения списков заключаются в квадратные скобки («[]»). Выражения генератора имеют вид::

source: Again, for a list comprehension only the outside brackets are different (square brackets instead of parentheses).
es_es: De nuevo, para una comprensión de lista sólo los paréntesis exteriores son diferentes (corchetes en lugar de paréntesis).
ru: Опять же, для понимания списка различаются только внешние скобки (квадратные скобки вместо круглых).

source: The elements of the generated output will be the successive values of ``expression``. The ``if`` clauses are all optional; if present, ``expression`` is only evaluated and added to the result when ``condition`` is true.
es_es: Los elementos de la salida generada serán los valores sucesivos de ``expression``. Las cláusulas de ``if`` son todas opcionales; si están presentes, ``expression`` sólo se evalúa y se añade al resultado cuando ``condition`` es verdadero.
ru: Элементами сгенерированного вывода будут последовательные значения выражения. Все предложения ``if`` не являются обязательными; если оно присутствует, выражение оценивается и добавляется к результату только тогда, когда условие истинно.

source: Generator expressions always have to be written inside parentheses, but the parentheses signalling a function call also count. If you want to create an iterator that will be immediately passed to a function you can write::
es_es: Las expresiones del generador siempre deben escribirse dentro de paréntesis, pero los paréntesis que indican una llamada a función también cuentan. Si quieres crear un iterador que será pasado inmediatamente a una función puedes escribir::
ru: Выражения-генераторы всегда должны быть записаны в круглых скобках, но скобки, сигнализирующие о вызове функции, также учитываются. Если вы хотите создать итератор, который будет немедленно передан в функцию, вы можете написать::

source: The ``for...in`` clauses contain the sequences to be iterated over. The sequences do not have to be the same length, because they are iterated over from left to right, **not** in parallel. For each element in ``sequence1``, ``sequence2`` is looped over from the beginning. ``sequence3`` is then looped over for each resulting pair of elements from ``sequence1`` and ``sequence2``.
es_es: Las cláusulas ``for...in`` contienen las secuencias sobre las que se va a iterar. No es necesario que las secuencias tengan la misma longitud, ya que se itera sobre ellas de izquierda a derecha, **no** en paralelo. Para cada elemento de ``sequence1``, se repite ``sequence2`` desde el principio. A continuación, se repite ``sequence3`` para cada par de elementos resultantes de ``sequence1`` y ``sequence2``.
ru: Предложения ``for...in`` содержат последовательности, которые необходимо перебрать. Последовательности не обязательно должны быть одинаковой длины, поскольку они повторяются слева направо, а не **параллельно**. Для каждого элемента в ``sequence1`` ``sequence2`` выполняется циклически с самого начала. Затем ``sequence3`` обрабатывается в цикле для каждой результирующей пары элементов из ``sequence1`` и ``sequence2``.

source: To put it another way, a list comprehension or generator expression is equivalent to the following Python code::
es_es: Dicho de otro modo, una expresión de comprensión de lista o generador equivale al siguiente código Python::
ru: Другими словами, выражение списка или выражение-генератор эквивалентно следующему коду Python:
