Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/howto/functional.po
Languages: es_es, ru

source: :pep:`342`: "Coroutines via Enhanced Generators" describes the new generator features in Python 2.5.
es_es: :pep:`342`: "Coroutines via Enhanced Generators" describe las nuevas características de los generadores en Python 2.5.
ru: :pep:`342`: «Сопрограммы через расширенные генераторы» описывают новые функции генератора в Python 2.5.

source: General
ru: Главное

source: Python-specific
ru: Специфичный для Python
