Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/howto/functional.po
Languages: es_es, ru

source: This means that when there are multiple ``for...in`` clauses but no ``if`` clauses, the length of the resulting output will be equal to the product of the lengths of all the sequences. If you have two lists of length 3, the output list is 9 elements long:
es_es: Esto significa que cuando hay varias cláusulas ``for...in`` pero ninguna ``if``, la longitud de la salida resultante será igual al producto de las longitudes de todas las secuencias. Si tiene dos listas de longitud 3, la lista de salida tendrá 9 elementos:
ru: Это означает, что если имеется несколько предложений for...in, но нет предложений if, длина результирующего вывода будет равна произведению длин всех последовательностей. Если у вас есть два списка длиной 3, выходной список будет состоять из 9 элементов:

source: To avoid introducing an ambiguity into Python's grammar, if ``expression`` is creating a tuple, it must be surrounded with parentheses. The first list comprehension below is a syntax error, while the second one is correct::
es_es: Para evitar introducir una ambigüedad en la gramática de Python, si ``expression`` está creando una tupla, debe ir rodeada de paréntesis. La primera comprensión de lista a continuación es un error de sintaxis, mientras que la segunda es correcta::
ru: Чтобы избежать двусмысленности в грамматике Python, если «выражение» создает кортеж, оно должно быть заключено в круглые скобки. Первое понимание списка ниже является синтаксической ошибкой, а второе правильно::

source: Generators
es_es: Generadores
ru: Генераторы

source: Generators are a special class of functions that simplify the task of writing iterators. Regular functions compute a value and return it, but generators return an iterator that returns a stream of values.
es_es: Los generadores son una clase especial de funciones que simplifican la tarea de escribir iteradores. Las funciones normales calculan un valor y lo devuelven, pero los generadores devuelven un iterador que retorna un flujo de valores.
ru: Генераторы — это особый класс функций, упрощающий задачу написания итераторов. Обычные функции вычисляют значение и возвращают его, но генераторы возвращают итератор, возвращающий поток значений.

source: You're doubtless familiar with how regular function calls work in Python or C. When you call a function, it gets a private namespace where its local variables are created. When the function reaches a ``return`` statement, the local variables are destroyed and the value is returned to the caller. A later call to the same function creates a new private namespace and a fresh set of local variables. But, what if the local variables weren't thrown away on exiting a function? What if you could later resume the function where it left off? This is what generators provide; they can be thought of as resumable functions.
es_es: Sin duda estás familiarizado con cómo funcionan las llamadas a funciones normales en Python o C. Cuando llamas a una función, ésta obtiene un espacio de nombres privado donde se crean sus variables locales. Cuando la función llega a una sentencia ``return``, las variables locales se destruyen y el valor se devuelve a quien la llamó. Una llamada posterior a la misma función crea un nuevo espacio de nombres privado y un nuevo conjunto de variables locales. Pero, ¿qué pasaría si las variables locales no se eliminaran al salir de una función? ¿Qué pasaría si pudieras reanudar la función donde la dejaste? Esto es lo que proporcionan los generadores; se puede pensar en ellos como funciones reanudables.
ru: Вы, несомненно, знакомы с тем, как работают обычные вызовы функций в Python или C. Когда вы вызываете функцию, она получает частное пространство имен, в котором создаются ее локальные переменные. Когда функция достигает оператора return, локальные переменные уничтожаются и значение возвращается вызывающей стороне. Более поздний вызов той же функции создает новое частное пространство имен и новый набор локальных переменных. Но что, если бы локальные переменные не удалялись при выходе из функции? Что, если бы вы могли позже возобновить выполнение функции с того места, где она остановилась? Это то, что обеспечивают генераторы; их можно рассматривать как возобновляемые функции.

source: Here's the simplest example of a generator function:
es_es: He aquí el ejemplo más sencillo de una función generadora:
ru: Вот простейший пример функции-генератора:

source: Any function containing a :keyword:`yield` keyword is a generator function; this is detected by Python's :term:`bytecode` compiler which compiles the function specially as a result.
es_es: Cualquier función que contenga una palabra clave :keyword:`yield` es una función generadora; esto es detectado por el compilador :term:`bytecode` de Python que compila la función especialmente como resultado.
ru: Любая функция, содержащая ключевое слово :keyword:`yield`, является функцией-генератором; это обнаруживается компилятором :term:`bytecode` Python, который в результате специально компилирует функцию.

source: When you call a generator function, it doesn't return a single value; instead it returns a generator object that supports the iterator protocol. On executing the ``yield`` expression, the generator outputs the value of ``i``, similar to a ``return`` statement. The big difference between ``yield`` and a ``return`` statement is that on reaching a ``yield`` the generator's state of execution is suspended and local variables are preserved. On the next call to the generator's :meth:`~generator.__next__` method, the function will resume executing.
es_es: Cuando se llama a una función generadora, ésta no devuelve un único valor, sino un objeto generador compatible con el protocolo iterador. Al ejecutar la expresión ``yield``, el generador devuelve el valor de ``i``, de forma similar a una sentencia ``return``. La gran diferencia entre ``yield`` y una sentencia ``return`` es que al llegar a ``yield`` se suspende el estado de ejecución del generador y se conservan las variables locales. En la siguiente llamada al método :meth:`~generator.__next__` del generador, la función reanudará su ejecución.
ru: Когда вы вызываете функцию-генератор, она не возвращает ни одного значения; вместо этого он возвращает объект-генератор, поддерживающий протокол итератора. При выполнении выражения «yield» генератор выводит значение «i», аналогично оператору «return». Большая разница между оператором "yield" и оператором "return" состоит в том, что при достижении "yield" состояние выполнения генератора приостанавливается, а локальные переменные сохраняются. При следующем вызове метода генератора :meth:`~generator.__next__` функция возобновит выполнение.

source: Here's a sample usage of the ``generate_ints()`` generator:
es_es: He aquí un ejemplo de utilización del generador ``generate_ints()``:
ru: Вот пример использования генератора ``generate_ints()``:

source: You could equally write ``for i in generate_ints(5)``, or ``a, b, c = generate_ints(3)``.
es_es: También podría escribir ``for i in generate_ints(5)``, o ``a, b, c = generate_ints(3)``.
ru: Вы также можете написать ``for i ingenerate_ints(5)`` или ``a,b,c =generate_ints(3)``.

source: Inside a generator function, ``return value`` causes ``StopIteration(value)`` to be raised from the :meth:`~generator.__next__` method. Once this happens, or the bottom of the function is reached, the procession of values ends and the generator cannot yield any further values.
es_es: Dentro de una función generadora, ``return value`` hace que ``StopIteration(value)`` se eleve desde el método :meth:`~generator.__next__`. Una vez que esto sucede, o se alcanza el fondo de la función, la procesión de valores termina y el generador no puede producir más valores.
ru: Внутри функции-генератора ``возвращаемое значение`` вызывает вызов ``StopIteration(value)`` из метода :meth:`~generator.__next__`. Как только это произойдет или будет достигнута нижняя часть функции, обработка значений закончится, и генератор не сможет выдавать дальнейшие значения.

source: You could achieve the effect of generators manually by writing your own class and storing all the local variables of the generator as instance variables. For example, returning a list of integers could be done by setting ``self.count`` to 0, and having the :meth:`~iterator.__next__` method increment ``self.count`` and return it. However, for a moderately complicated generator, writing a corresponding class can be much messier.
es_es: Puedes conseguir el efecto de los generadores manualmente escribiendo tu propia clase y almacenando todas las variables locales del generador como variables de instancia. Por ejemplo, devolver una lista de enteros podría hacerse estableciendo ``self.count`` a 0, y haciendo que el método :meth:`~iterator.__next__` incremente ``self.count`` y lo devuelva. Sin embargo, para un generador moderadamente complicado, escribir la clase correspondiente puede ser mucho más complicado.
ru: Эффекта генераторов можно добиться вручную, написав собственный класс и сохранив все локальные переменные генератора как переменные экземпляра. Например, возврат списка целых чисел можно выполнить, установив для ``self.count`` значение 0, а метод :meth:`~iterator.__next__` увеличит ``self.count`` и вернет его. Однако для генератора средней сложности написание соответствующего класса может оказаться гораздо более запутанным.

source: The test suite included with Python's library, :source:`Lib/test/test_generators.py`, contains a number of more interesting examples. Here's one generator that implements an in-order traversal of a tree using generators recursively. ::
es_es: El conjunto de pruebas incluido con la biblioteca de Python, :source:`Lib/test/test_generators.py`, contiene varios ejemplos más interesantes. Aquí hay un generador que implementa un recorrido en-orden de un árbol usando generadores recursivamente. ::
ru: Набор тестов, включенный в библиотеку Python, :source:`Lib/test/test_generators.py`, содержит ряд более интересных примеров. Вот один генератор, который реализует обход дерева по порядку, используя рекурсивные генераторы. ::

source: Two other examples in ``test_generators.py`` produce solutions for the N-Queens problem (placing N queens on an NxN chess board so that no queen threatens another) and the Knight's Tour (finding a route that takes a knight to every square of an NxN chessboard without visiting any square twice).
es_es: Otros dos ejemplos en ``test_generators.py`` producen soluciones para el problema de las N reinas (colocar N reinas en un tablero de ajedrez NxN de forma que ninguna reina amenace a otra) y el recorrido del caballo (encontrar una ruta que lleve a un caballo a cada casilla de un tablero de ajedrez NxN sin visitar ninguna casilla dos veces).
ru: Два других примера в ``test_generators.py`` дают решения проблемы N-ферзей (размещение N ферзей на шахматной доске NxN так, чтобы ни один ферзь не угрожал другому) и тура коня (поиск маршрута, который приведет коня на каждое поле). шахматной доски NxN, не посещая ни одну клетку дважды).

source: Passing values into a generator
es_es: Pasar valores a un generador
ru: Передача значений в генератор

source: In Python 2.4 and earlier, generators only produced output. Once a generator's code was invoked to create an iterator, there was no way to pass any new information into the function when its execution is resumed. You could hack together this ability by making the generator look at a global variable or by passing in some mutable object that callers then modify, but these approaches are messy.
es_es: En Python 2.4 y anteriores, los generadores sólo producían salida. Una vez que el código de un generador era invocado para crear un iterador, no había forma de pasar nueva información a la función cuando se reanudaba su ejecución. Se podía piratear esta capacidad haciendo que el generador mirara una variable global o pasando algún objeto mutable que los invocadores modificaran, pero estos enfoques son complicados.
ru: В Python 2.4 и более ранних версиях генераторы производили только выходные данные. После того, как код генератора был вызван для создания итератора, не было возможности передать какую-либо новую информацию в функцию при возобновлении ее выполнения. Вы могли бы взломать эту возможность, заставив генератор просматривать глобальную переменную или передав некоторый изменяемый объект, который затем модифицируют вызывающие объекты, но эти подходы являются грязными.

source: In Python 2.5 there's a simple way to pass values into a generator. :keyword:`yield` became an expression, returning a value that can be assigned to a variable or otherwise operated on::
es_es: En Python 2.5 hay una forma sencilla de pasar valores a un generador. :keyword:`yield` se convirtió en una expresión, devolviendo un valor que se puede asignar a una variable u operar de otra forma::
ru: В Python 2.5 есть простой способ передачи значений в генератор. :keyword:`yield` стал выражением, возвращающим значение, которое можно присвоить переменной или иным образом обработать::

source: I recommend that you **always** put parentheses around a ``yield`` expression when you're doing something with the returned value, as in the above example. The parentheses aren't always necessary, but it's easier to always add them instead of having to remember when they're needed.
es_es: Te recomiendo que **siempre** pongas paréntesis alrededor de una expresión ``yield`` cuando estés haciendo algo con el valor devuelto, como en el ejemplo anterior. Los paréntesis no siempre son necesarios, pero es más fácil añadirlos siempre en lugar de tener que recordar cuándo son necesarios.
ru: Я рекомендую вам **всегда** заключать в скобки выражение ``yield``, когда вы что-то делаете с возвращаемым значением, как в приведенном выше примере. Круглые скобки не всегда необходимы, но их проще всегда добавлять, чем запоминать, когда они потребуются.

source: (:pep:`342` explains the exact rules, which are that a ``yield``-expression must always be parenthesized except when it occurs at the top-level expression on the right-hand side of an assignment. This means you can write ``val = yield i`` but have to use parentheses when there's an operation, as in ``val = (yield i) + 12``.)
es_es: (:pep:`342` explica las reglas exactas, que son que un ``yield``-expression must always be parenthesized except when it occurs at the top-level expression on the right-hand side of an assignment. This means you can write ``val = yield i`` pero tiene que usar paréntesis cuando hay una operación, como en ``val = (yield i) + 12``.)
ru: (:pep:`342` объясняет точные правила, которые заключаются в том, что выражение ``yield`` всегда должно быть заключено в круглые скобки, за исключением случаев, когда оно встречается в выражении верхнего уровня в правой части присваивания. Это означает, что вы можно написать ``val = yield i``, но при выполнении операции придется использовать круглые скобки, как в ``val = (yield i) + 12``.)

source: Values are sent into a generator by calling its :meth:`send(value) <generator.send>` method. This method resumes the generator's code and the ``yield`` expression returns the specified value. If the regular :meth:`~generator.__next__` method is called, the ``yield`` returns ``None``.
es_es: Los valores se envían a un generador llamando a su método :meth:`send(value) <generator.send>`. Este método reanuda el código del generador y la expresión ``yield`` devuelve el valor especificado. Si se llama al método :meth:`~generator.__next__` regular, el ``yield`` devuelve ``None``.
ru: Значения отправляются в генератор путем вызова его метода :meth:`send(value) <generator.send>`. Этот метод возобновляет выполнение кода генератора, и выражение доходности возвращает указанное значение. Если вызывается обычный метод :meth:`~generator.__next__`, ``yield`` возвращает ``None``.

source: Here's a simple counter that increments by 1 and allows changing the value of the internal counter.
es_es: Aquí hay un contador simple que se incrementa en 1 y permite cambiar el valor del contador interno.
ru: Вот простой счетчик, который увеличивается на 1 и позволяет изменять значение внутреннего счетчика.

source: And here's an example of changing the counter:
es_es: Y aquí tienes un ejemplo de cambio de contador:
ru: А вот пример изменения счетчика:

source: Because ``yield`` will often be returning ``None``, you should always check for this case. Don't just use its value in expressions unless you're sure that the :meth:`~generator.send` method will be the only method used to resume your generator function.
es_es: Debido a que ``yield`` a menudo devolverá ``None``, siempre debes comprobar este caso. No utilices su valor sin más en expresiones a menos que estés seguro de que el método :meth:`~generator.send` será el único utilizado para reanudar tu función generadora.
ru: Поскольку «yield» часто возвращает «None», вам всегда следует проверять этот случай. Не используйте его значение в выражениях, если вы не уверены, что метод :meth:`~generator.send` будет единственным методом, используемым для возобновления функции генератора.

source: In addition to :meth:`~generator.send`, there are two other methods on generators:
es_es: Además de :meth:`~generator.send`, existen otros dos métodos sobre generadores:
ru: Помимо :meth:`~generator.send`, в генераторах есть еще два метода:

source: :meth:`throw(value) <generator.throw>` is used to raise an exception inside the generator; the exception is raised by the ``yield`` expression where the generator's execution is paused.
es_es: :meth:`throw(value) <generator.throw>` se utiliza para lanzar una excepción dentro del generador; la excepción es lanzada por la expresión ``yield`` donde se pausa la ejecución del generador.
ru: :meth:`throw(value) <generator.throw>` используется для вызова исключения внутри генератора; исключение вызывается выражением «yield», где выполнение генератора приостанавливается.

source: :meth:`~generator.close` raises a :exc:`GeneratorExit` exception inside the generator to terminate the iteration. On receiving this exception, the generator's code must either raise :exc:`GeneratorExit` or :exc:`StopIteration`; catching the exception and doing anything else is illegal and will trigger a :exc:`RuntimeError`. :meth:`~generator.close` will also be called by Python's garbage collector when the generator is garbage-collected.
es_es: :meth:`~generator.close` lanza una excepción :exc:`GeneratorExit` dentro del generador para terminar la iteración. Al recibir esta excepción, el código del generador debe lanzar :exc:`GeneratorExit` o :exc:`StopIteration`; capturar la excepción y hacer cualquier otra cosa es ilegal y provocará una :exc:`RuntimeError`. :meth:`~generator.close` también será llamada por el recolector de basura de Python cuando el generador sea recolectado.
ru: :meth:`~generator.close` вызывает исключение :exc:`GeneratorExit` внутри генератора для завершения итерации. При получении этого исключения код генератора должен либо вызвать :exc:`GeneratorExit`, либо :exc:`StopIteration`; перехват исключения и выполнение чего-либо еще является незаконным и вызовет ошибку :exc:`RuntimeError`. :meth:`~generator.close` также будет вызываться сборщиком мусора Python, когда генератор выполняет сбор мусора.

source: If you need to run cleanup code when a :exc:`GeneratorExit` occurs, I suggest using a ``try: ... finally:`` suite instead of catching :exc:`GeneratorExit`.
es_es: Si necesita ejecutar código de limpieza cuando se produce un :exc:`GeneratorExit`, le sugiero que utilice un conjunto ``try: ... finally:`` en lugar de capturar :exc:`GeneratorExit`.
ru: Если вам нужно запустить код очистки при возникновении :exc:`GeneratorExit`, я предлагаю использовать ``try: ...finally:`` вместо перехвата :exc:`GeneratorExit`.

source: The cumulative effect of these changes is to turn generators from one-way producers of information into both producers and consumers.
es_es: El efecto acumulativo de estos cambios es que los generadores pasan de ser productores unidireccionales de información a ser a la vez productores y consumidores.
ru: Совокупный эффект этих изменений состоит в том, чтобы превратить генераторов из односторонних производителей информации в производителей и потребителей.

source: Generators also become **coroutines**, a more generalized form of subroutines. Subroutines are entered at one point and exited at another point (the top of the function, and a ``return`` statement), but coroutines can be entered, exited, and resumed at many different points (the ``yield`` statements).
es_es: Los generadores también se convierten en **corrutinas**, una forma más generalizada de subrutinas. Las subrutinas se introducen en un punto y se salen en otro (la parte superior de la función y una sentencia ``return`` ), pero las corrutinas pueden introducirse, salirse y reanudarse en muchos puntos diferentes (las sentencias ``yield`` ).
ru: Генераторы также становятся **сопрограммами**, более обобщенной формой подпрограмм. Вход в подпрограммы осуществляется в одной точке, а выход из них — в другой (верхняя часть функции и оператор return), но вход в сопрограммы, выход из них и возобновление могут осуществляться во многих разных точках (операторы return ).

source: Built-in functions
es_es: Funciones integradas
ru: Встроенные функции

source: Let's look in more detail at built-in functions often used with iterators.
es_es: Veamos con más detalle las funciones incorporadas que se utilizan a menudo con los iteradores.
ru: Давайте более подробно рассмотрим встроенные функции, часто используемые с итераторами.

source: Two of Python's built-in functions, :func:`map` and :func:`filter` duplicate the features of generator expressions:
es_es: Dos de las funciones incorporadas de Python, :func:`map` y :func:`filter` duplican las características de las expresiones generadoras:
ru: Две встроенные функции Python, :func:`map` и :func:`filter`, дублируют функции выражений-генераторов:

source: :func:`map(f, iterA, iterB, ...) <map>` returns an iterator over the sequence
es_es: :func:`map(f, iterA, iterB, ...) <map>` devuelve un iterador sobre la secuencia
ru: :func:`map(f, iterA, iterB, ...) <map>` возвращает итератор по последовательности

source: You can of course achieve the same effect with a list comprehension.
es_es: Por supuesto, puede conseguir el mismo efecto con la comprensión de una lista.
ru: Конечно, вы можете добиться того же эффекта, используя понимание списка.

source: :func:`filter(predicate, iter) <filter>` returns an iterator over all the sequence elements that meet a certain condition, and is similarly duplicated by list comprehensions. A **predicate** is a function that returns the truth value of some condition; for use with :func:`filter`, the predicate must take a single value.
es_es: :func:`filter(predicate, iter) <filter>` devuelve un iterador sobre todos los elementos de la secuencia que cumplen una determinada condición, y es duplicado de forma similar por las comprensiones de listas. Un **predicado** es una función que devuelve el valor de verdad de alguna condición; para su uso con :func:`filter`, el predicado debe tomar un único valor.
ru: :func:`filter(predicate, iter) <filter>` возвращает итератор по всем элементам последовательности, которые соответствуют определенному условию, и аналогичным образом дублируется при понимании списка. **Предикат** — это функция, возвращающая истинное значение некоторого условия; для использования с :func:`filter` предикат должен принимать одно значение.

source: This can also be written as a list comprehension:
es_es: También se puede escribir como comprensión de una lista:
ru: Это также можно записать как понимание списка:
