Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/howto/functional.po
Languages: es_es, ru

source: Functional Programming HOWTO
es_es: Programación funcional CÓMO
ru: Руководство по функциональному программированию

source: Author
es_es: Autor
ru: Автор

source: Release
es_es: Publique
ru: Релиз

source: In this document, we'll take a tour of Python's features suitable for implementing programs in a functional style. After an introduction to the concepts of functional programming, we'll look at language features such as :term:`iterator`\s and :term:`generator`\s and relevant library modules such as :mod:`itertools` and :mod:`functools`.
es_es: En este documento, haremos un recorrido por las características de Python adecuadas para implementar programas en un estilo funcional. Después de una introducción a los conceptos de programación funcional, veremos características del lenguaje como :term:`iterator`s y :term:`generator`s y módulos de librerías relevantes como :mod:`itertools` y :mod:`functools`.
ru: В этом документе мы рассмотрим возможности Python, подходящие для реализации программ в функциональном стиле. После знакомства с концепциями функционального программирования мы рассмотрим такие возможности языка, как :term:`iterator`\s и :term:`generator`\s, а также соответствующие библиотечные модули, такие как :mod:`itertools` и : мод: `functools`.

source: Introduction
es_es: Introducción
ru: Введение

source: This section explains the basic concept of functional programming; if you're just interested in learning about Python language features, skip to the next section on :ref:`functional-howto-iterators`.
es_es: Esta sección explica el concepto básico de programación funcional; si sólo estás interesado en conocer las características del lenguaje Python, pasa a la siguiente sección en :ref:`functional-howto-iterators`.
ru: В этом разделе объясняются основные понятия функционального программирования; Если вам просто интересно узнать о возможностях языка Python, перейдите к следующему разделу: :ref:`functional-howto-iterators`.

source: Programming languages support decomposing problems in several different ways:
es_es: Los lenguajes de programación permiten descomponer los problemas de distintas maneras:
ru: Языки программирования поддерживают декомпозицию задач несколькими различными способами:

source: Most programming languages are **procedural**: programs are lists of instructions that tell the computer what to do with the program's input. C, Pascal, and even Unix shells are procedural languages.
es_es: La mayoría de los lenguajes de programación son **procedimentales**: los programas son listas de instrucciones que indican al ordenador qué hacer con la entrada del programa. C, Pascal e incluso los shells de Unix son lenguajes procedimentales.
ru: Большинство языков программирования являются **процедурными**: программы представляют собой списки инструкций, которые сообщают компьютеру, что делать с входными данными программы. C, Pascal и даже оболочки Unix являются процедурными языками.

source: In **declarative** languages, you write a specification that describes the problem to be solved, and the language implementation figures out how to perform the computation efficiently. SQL is the declarative language you're most likely to be familiar with; a SQL query describes the data set you want to retrieve, and the SQL engine decides whether to scan tables or use indexes, which subclauses should be performed first, etc.
es_es: En los lenguajes **declarativos**, se escribe una especificación que describe el problema que hay que resolver y la implementación del lenguaje determina cómo realizar el cálculo de forma eficiente. SQL es el lenguaje declarativo con el que probablemente estés más familiarizado; una consulta SQL describe el conjunto de datos que quieres recuperar, y el motor SQL decide si escanear tablas o utilizar índices, qué subcláusulas deben ejecutarse primero, etc.
ru: В **декларативных** языках вы пишете спецификацию, описывающую решаемую проблему, а реализация языка определяет, как эффективно выполнить вычисления. SQL — это декларативный язык, с которым вы, скорее всего, знакомы; SQL-запрос описывает набор данных, который вы хотите получить, а механизм SQL решает, сканировать ли таблицы или использовать индексы, какие подпункты следует выполнить в первую очередь и т. д.

source: **Object-oriented** programs manipulate collections of objects. Objects have internal state and support methods that query or modify this internal state in some way. Smalltalk and Java are object-oriented languages. C++ and Python are languages that support object-oriented programming, but don't force the use of object-oriented features.
es_es: **Los programas orientados a objetos** manipulan colecciones de objetos. Los objetos tienen un estado interno y admiten métodos que consultan o modifican este estado interno de alguna manera. Smalltalk y Java son lenguajes orientados a objetos. C++ y Python son lenguajes que soportan la programación orientada a objetos, pero no fuerzan el uso de características orientadas a objetos.
ru: **Объектно-ориентированные** программы манипулируют коллекциями объектов. Объекты имеют внутреннее состояние и поддерживают методы, которые каким-либо образом запрашивают или изменяют это внутреннее состояние. Smalltalk и Java — объектно-ориентированные языки. C++ и Python — это языки, которые поддерживают объектно-ориентированное программирование, но не требуют принудительного использования объектно-ориентированных функций.

source: **Functional** programming decomposes a problem into a set of functions. Ideally, functions only take inputs and produce outputs, and don't have any internal state that affects the output produced for a given input. Well-known functional languages include the ML family (Standard ML, OCaml, and other variants) and Haskell.
es_es: **La programación funcional** descompone un problema en un conjunto de funciones. Idealmente, las funciones sólo reciben entradas y producen salidas, y no tienen ningún estado interno que afecte a la salida producida para una entrada dada. Los lenguajes funcionales más conocidos son la familia ML (Standard ML, OCaml y otras variantes) y Haskell.
ru: **Функциональное** программирование разлагает задачу на набор функций. В идеале функции только принимают входные данные и производят выходные данные и не имеют какого-либо внутреннего состояния, которое влияет на выходные данные, создаваемые для данного ввода. К хорошо известным функциональным языкам относятся семейство ML (Standard ML, OCaml и другие варианты) и Haskell.

source: The designers of some computer languages choose to emphasize one particular approach to programming. This often makes it difficult to write programs that use a different approach. Other languages are multi-paradigm languages that support several different approaches. Lisp, C++, and Python are multi-paradigm; you can write programs or libraries that are largely procedural, object-oriented, or functional in all of these languages. In a large program, different sections might be written using different approaches; the GUI might be object-oriented while the processing logic is procedural or functional, for example.
es_es: Los diseñadores de algunos lenguajes informáticos optan por hacer hincapié en un enfoque concreto de la programación. Esto suele dificultar la escritura de programas que utilicen un enfoque diferente. Otros lenguajes son multiparadigma y admiten varios enfoques diferentes. Lisp, C++ y Python son multiparadigma; puede escribir programas o bibliotecas que sean en gran medida procedimentales, orientados a objetos o funcionales en todos estos lenguajes. En un programa grande, las diferentes secciones pueden estar escritas con diferentes enfoques; la interfaz gráfica de usuario puede estar orientada a objetos, mientras que la lógica de procesamiento es procedimental o funcional, por ejemplo.
ru: Разработчики некоторых компьютерных языков предпочитают подчеркивать один конкретный подход к программированию. Это часто затрудняет написание программ, использующих другой подход. Другие языки являются мультипарадигмальными языками, поддерживающими несколько различных подходов. Lisp, C++ и Python являются мультипарадигмальными; на всех этих языках вы можете писать программы или библиотеки, которые в основном являются процедурными, объектно-ориентированными или функциональными. В большой программе разные разделы могут быть написаны с использованием разных подходов; Например, графический интерфейс пользователя может быть объектно-ориентированным, тогда как логика обработки является процедурной или функциональной.

source: In a functional program, input flows through a set of functions. Each function operates on its input and produces some output. Functional style discourages functions with side effects that modify internal state or make other changes that aren't visible in the function's return value. Functions that have no side effects at all are called **purely functional**. Avoiding side effects means not using data structures that get updated as a program runs; every function's output must only depend on its input.
es_es: En un programa funcional, la entrada fluye a través de un conjunto de funciones. Cada función opera sobre su entrada y produce una salida. El estilo funcional desaconseja las funciones con efectos secundarios que modifican el estado interno o realizan otros cambios que no son visibles en el valor de retorno de la función. Las funciones que no tienen ningún efecto secundario se denominan **puramente funcionales**. Evitar los efectos secundarios significa no utilizar estructuras de datos que se actualizan a medida que se ejecuta un programa; la salida de cada función sólo debe depender de su entrada.
ru: В функциональной программе ввод осуществляется через набор функций. Каждая функция оперирует своим входом и выдает некоторый результат. Функциональный стиль не поощряет функции с побочными эффектами, которые изменяют внутреннее состояние или вносят другие изменения, которые не видны в возвращаемом значении функции. Функции, которые вообще не имеют побочных эффектов, называются **чисто функциональными**. Избегать побочных эффектов означает не использовать структуры данных, которые обновляются по мере запуска программы; вывод каждой функции должен зависеть только от ее ввода.

source: Some languages are very strict about purity and don't even have assignment statements such as ``a=3`` or ``c = a + b``, but it's difficult to avoid all side effects, such as printing to the screen or writing to a disk file. Another example is a call to the :func:`print` or :func:`time.sleep` function, neither of which returns a useful value. Both are called only for their side effects of sending some text to the screen or pausing execution for a second.
es_es: Algunos lenguajes son muy estrictos con la pureza y ni siquiera tienen sentencias de asignación como ``a=3`` o ``c = a + b``, pero es difícil evitar todos los efectos secundarios, como imprimir en la pantalla o escribir en un archivo de disco. Otro ejemplo es una llamada a la función :func:`print` o :func:`time.sleep`, ninguna de las cuales devuelve un valor útil. Ambas son llamadas sólo por sus efectos secundarios de enviar algún texto a la pantalla o pausar la ejecución por un segundo.
ru: Некоторые языки очень строги в отношении чистоты и даже не имеют операторов присваивания, таких как ``a=3`` или ``c = a + b``, но трудно избежать всех побочных эффектов, таких как вывод на экран. или запись в файл на диске. Другой пример — вызов функции :func:`print` или :func:`time.sleep`, ни одна из которых не возвращает полезное значение. Оба вызываются только из-за побочных эффектов отправки некоторого текста на экран или приостановки выполнения на секунду.

source: Python programs written in functional style usually won't go to the extreme of avoiding all I/O or all assignments; instead, they'll provide a functional-appearing interface but will use non-functional features internally. For example, the implementation of a function will still use assignments to local variables, but won't modify global variables or have other side effects.
es_es: Los programas Python escritos en estilo funcional normalmente no irán al extremo de evitar todas las E/S o todas las asignaciones; en su lugar, proporcionarán una interfaz de apariencia funcional pero usarán características no funcionales internamente. Por ejemplo, la implementación de una función seguirá usando asignaciones a variables locales, pero no modificará variables globales ni tendrá otros efectos secundarios.
ru: Программы Python, написанные в функциональном стиле, обычно не доходят до крайности, избегая всех операций ввода-вывода или всех присваиваний; вместо этого они будут предоставлять функциональный интерфейс, но будут использовать нефункциональные функции внутри. Например, реализация функции по-прежнему будет использовать присвоения локальным переменным, но не будет изменять глобальные переменные и не будет иметь других побочных эффектов.

source: Functional programming can be considered the opposite of object-oriented programming. Objects are little capsules containing some internal state along with a collection of method calls that let you modify this state, and programs consist of making the right set of state changes. Functional programming wants to avoid state changes as much as possible and works with data flowing between functions. In Python you might combine the two approaches by writing functions that take and return instances representing objects in your application (e-mail messages, transactions, etc.).
es_es: La programación funcional puede considerarse lo contrario de la programación orientada a objetos. Los objetos son pequeñas cápsulas que contienen cierto estado interno junto con una colección de llamadas a métodos que permiten modificar este estado, y los programas consisten en realizar el conjunto adecuado de cambios de estado. La programación funcional quiere evitar los cambios de estado tanto como sea posible y trabaja con datos que fluyen entre funciones. En Python puedes combinar los dos enfoques escribiendo funciones que toman y devuelven instancias que representan objetos en tu aplicación (mensajes de correo electrónico, transacciones, etc.).
ru: Функциональное программирование можно считать противоположностью объектно-ориентированного программирования. Объекты — это маленькие капсулы, содержащие некоторое внутреннее состояние вместе с набором вызовов методов, которые позволяют вам изменять это состояние, а программы состоят из внесения правильного набора изменений состояния. Функциональное программирование стремится максимально избежать изменений состояния и работает с данными, передаваемыми между функциями. В Python вы можете объединить два подхода, написав функции, которые принимают и возвращают экземпляры, представляющие объекты вашего приложения (сообщения электронной почты, транзакции и т. д.).

source: Functional design may seem like an odd constraint to work under. Why should you avoid objects and side effects? There are theoretical and practical advantages to the functional style:
es_es: El diseño funcional puede parecer una restricción extraña con la que trabajar. ¿Por qué evitar los objetos y los efectos secundarios? El estilo funcional tiene ventajas teóricas y prácticas:
ru: Функциональный дизайн может показаться странным ограничением для работы. Почему вам следует избегать объектов и побочных эффектов? Функциональный стиль имеет теоретические и практические преимущества:

source: Formal provability.
es_es: Probabilidad formal.
ru: Формальная доказуемость.

source: Modularity.
es_es: Modularidad.
ru: Модульность.

source: Composability.
es_es: Composibilidad.
ru: Компонуемость.

source: Ease of debugging and testing.
es_es: Facilidad de depuración y comprobación.
ru: Простота отладки и тестирования.

source: Formal provability
es_es: Probabilidad formal
ru: Формальная доказуемость

source: A theoretical benefit is that it's easier to construct a mathematical proof that a functional program is correct.
es_es: Una ventaja teórica es que es más fácil construir una prueba matemática de que un programa funcional es correcto.
ru: Теоретическое преимущество состоит в том, что легче построить математическое доказательство правильности функциональной программы.

source: For a long time researchers have been interested in finding ways to mathematically prove programs correct. This is different from testing a program on numerous inputs and concluding that its output is usually correct, or reading a program's source code and concluding that the code looks right; the goal is instead a rigorous proof that a program produces the right result for all possible inputs.
es_es: Desde hace mucho tiempo, los investigadores se interesan por demostrar matemáticamente que los programas son correctos. No se trata de probar un programa con numerosas entradas y concluir que su salida suele ser correcta, o de leer el código fuente de un programa y concluir que el código parece correcto; el objetivo es una prueba rigurosa de que un programa produce el resultado correcto para todas las entradas posibles.
ru: В течение долгого времени исследователи были заинтересованы в поиске способов математически доказать правильность программ. Это отличается от тестирования программы на множестве входных данных и вывода о том, что ее выходные данные обычно верны, или от чтения исходного кода программы и заключения, что код выглядит правильно; вместо этого целью является строгое доказательство того, что программа выдает правильный результат для всех возможных входных данных.

source: The technique used to prove programs correct is to write down **invariants**, properties of the input data and of the program's variables that are always true. For each line of code, you then show that if invariants X and Y are true **before** the line is executed, the slightly different invariants X' and Y' are true **after** the line is executed. This continues until you reach the end of the program, at which point the invariants should match the desired conditions on the program's output.
es_es: La técnica utilizada para demostrar que los programas son correctos consiste en escribir **invariantes**, propiedades de los datos de entrada y de las variables del programa que siempre son ciertas. Para cada línea de código, se demuestra que si las invariantes X e Y son verdaderas **antes** de que se ejecute la línea, las invariantes X' e Y', ligeramente diferentes, son verdaderas **después** de que se ejecute la línea. Esto continúa hasta llegar al final del programa, momento en el que los invariantes deben coincidir con las condiciones deseadas en la salida del programa.
ru: Техника, используемая для доказательства правильности программы, заключается в записи **инвариантов**, свойств входных данных и переменных программы, которые всегда верны. Затем для каждой строки кода вы показываете, что если инварианты X и Y истинны **до** выполнения строки, то слегка отличающиеся инварианты X' и Y' являются истинными **после** выполнения строки. Это продолжается до тех пор, пока вы не достигнете конца программы, после чего инварианты должны соответствовать желаемым условиям на выходе программы.

source: Functional programming's avoidance of assignments arose because assignments are difficult to handle with this technique; assignments can break invariants that were true before the assignment without producing any new invariants that can be propagated onward.
es_es: La programación funcional evita las asignaciones porque son difíciles de manejar con esta técnica; las asignaciones pueden romper invariantes que eran verdaderas antes de la asignación sin producir nuevas invariantes que puedan propagarse.
ru: Избегание присваиваний в функциональном программировании возникло потому, что с помощью этого метода трудно справиться с заданиями; Присваивания могут нарушать инварианты, которые были истинными до присваивания, не создавая при этом новых инвариантов, которые можно было бы распространять дальше.

source: Unfortunately, proving programs correct is largely impractical and not relevant to Python software. Even trivial programs require proofs that are several pages long; the proof of correctness for a moderately complicated program would be enormous, and few or none of the programs you use daily (the Python interpreter, your XML parser, your web browser) could be proven correct. Even if you wrote down or generated a proof, there would then be the question of verifying the proof; maybe there's an error in it, and you wrongly believe you've proved the program correct.
es_es: Desafortunadamente, probar la corrección de los programas es poco práctico y no es relevante para el software Python. Incluso los programas triviales requieren demostraciones de varias páginas; la demostración de la corrección de un programa medianamente complicado sería enorme, y pocos o ninguno de los programas que usas a diario (el intérprete de Python, tu analizador XML, tu navegador web) podrían demostrarse correctos. Incluso si escribiera o generara una prueba, luego estaría la cuestión de verificar la prueba; tal vez haya un error en ella, y usted crea erróneamente que ha demostrado que el programa es correcto.
ru: К сожалению, проверка правильности программ во многом непрактична и не имеет отношения к программному обеспечению Python. Даже тривиальные программы требуют доказательств длиной в несколько страниц; доказательство правильности программы средней сложности будет огромным, и лишь немногие или ни одна из программ, которые вы используете ежедневно (интерпретатор Python, ваш анализатор XML, ваш веб-браузер), не может быть доказана корректной. Даже если вы записали или создали доказательство, тогда встанет вопрос о проверке доказательства; возможно, в ней есть ошибка, и вы ошибочно полагаете, что доказали правильность программы.

source: Modularity
es_es: Modularidad
ru: Модульность

source: A more practical benefit of functional programming is that it forces you to break apart your problem into small pieces. Programs are more modular as a result. It's easier to specify and write a small function that does one thing than a large function that performs a complicated transformation. Small functions are also easier to read and to check for errors.
es_es: Una ventaja más práctica de la programación funcional es que obliga a dividir el problema en pequeños fragmentos. Como resultado, los programas son más modulares. Es más fácil especificar y escribir una función pequeña que haga una cosa que una función grande que realice una transformación complicada. Las funciones pequeñas también son más fáciles de leer y de comprobar en busca de errores.
ru: Более практическое преимущество функционального программирования состоит в том, что оно заставляет вас разбивать проблему на мелкие части. В результате программы становятся более модульными. Легче определить и написать небольшую функцию, выполняющую одно действие, чем большую функцию, выполняющую сложное преобразование. Маленькие функции также легче читать и проверять на наличие ошибок.

source: Ease of debugging and testing
es_es: Facilidad de depuración y pruebas
ru: Простота отладки и тестирования

source: Testing and debugging a functional-style program is easier.
es_es: Probar y depurar un programa de estilo funcional es más fácil.
ru: Тестировать и отлаживать программу функционального стиля проще.
