Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/howto/instrumentation.po
Languages: ru

source: Instrumenting CPython with DTrace and SystemTap
ru: Инструментирование CPython с помощью DTrace и SystemTap

source: author
ru: автор

source: DTrace and SystemTap are monitoring tools, each providing a way to inspect what the processes on a computer system are doing. They both use domain-specific languages allowing a user to write scripts which:
ru: DTrace и SystemTap — это инструменты мониторинга, каждый из которых позволяет проверить, что делают процессы в компьютерной системе. Оба они используют языки, специфичные для предметной области, что позволяет пользователю писать сценарии, которые:

source: filter which processes are to be observed
ru: фильтровать, какие процессы следует наблюдать

source: gather data from the processes of interest
ru: собирать данные о интересующих процессах

source: generate reports on the data
ru: генерировать отчеты по данным

source: As of Python 3.6, CPython can be built with embedded "markers", also known as "probes", that can be observed by a DTrace or SystemTap script, making it easier to monitor what the CPython processes on a system are doing.
ru: Начиная с Python 3.6, CPython может быть построен со встроенными «маркерами», также известными как «зонды», которые можно наблюдать с помощью сценария DTrace или SystemTap, что упрощает мониторинг того, что делают процессы CPython в системе.

source: DTrace markers are implementation details of the CPython interpreter. No guarantees are made about probe compatibility between versions of CPython. DTrace scripts can stop working or work incorrectly without warning when changing CPython versions.
ru: Маркеры DTrace — это детали реализации интерпретатора CPython. Никаких гарантий совместимости зондов между версиями CPython не предоставляется. Скрипты DTrace могут перестать работать или работать некорректно без предупреждения при смене версии CPython.

source: Enabling the static markers
ru: Включение статических маркеров

source: macOS comes with built-in support for DTrace. On Linux, in order to build CPython with the embedded markers for SystemTap, the SystemTap development tools must be installed.
ru: macOS поставляется со встроенной поддержкой DTrace. В Linux для сборки CPython со встроенными маркерами для SystemTap необходимо установить инструменты разработки SystemTap.

source: On a Linux machine, this can be done via::
ru: На машине Linux это можно сделать через:

source: or::
ru: или::

source: CPython must then be :option:`configured with the --with-dtrace option <--with-dtrace>`:
ru: Затем CPython должен быть :option:`настроен с помощью опции --with-dtrace <--with-dtrace>`:

source: checking for --with-dtrace... yes
ru: проверка --with-dtrace... да

source: On macOS, you can list available DTrace probes by running a Python process in the background and listing all probes made available by the Python provider::
ru: В macOS вы можете просмотреть список доступных зондов DTrace, запустив процесс Python в фоновом режиме и выведя список всех зондов, доступных провайдером Python:

source: On Linux, you can verify if the SystemTap static markers are present in the built binary by seeing if it contains a ".note.stapsdt" section.
ru: В Linux вы можете проверить, присутствуют ли статические маркеры SystemTap во встроенном двоичном файле, проверив, содержит ли он раздел «.note.stapsdt».

source: If you've built Python as a shared library (with the :option:`--enable-shared` configure option), you need to look instead within the shared library. For example::
ru: Если вы создали Python как общую библиотеку (с опцией настройки :option:`--enable-shared`), вам нужно вместо этого просмотреть общую библиотеку. Например::

source: $ readelf -S libpython3.3dm.so.1.0 | grep .note.stapsdt [29] .note.stapsdt NOTE 0000000000000000 00365b68
ru: Если вы создали Python как общую библиотеку (с опцией настройки :option:`--enable-shared`), вам нужно вместо этого просмотреть общую библиотеку. Например::

source: Sufficiently modern readelf can print the metadata::
ru: Достаточно современный readelf может распечатать метаданные::

source: The above metadata contains information for SystemTap describing how it can patch strategically placed machine code instructions to enable the tracing hooks used by a SystemTap script.
ru: Приведенные выше метаданные содержат информацию для SystemTap, описывающую, как он может исправить стратегически расположенные инструкции машинного кода, чтобы включить перехватчики трассировки, используемые сценарием SystemTap.

source: Static DTrace probes
ru: Статические зонды DTrace

source: The following example DTrace script can be used to show the call/return hierarchy of a Python script, only tracing within the invocation of a function called "start". In other words, import-time function invocations are not going to be listed:
ru: Следующий пример сценария DTrace можно использовать для отображения иерархии вызовов/возвратов сценария Python, отслеживая только вызов функции с именем «start». Другими словами, вызовы функций во время импорта не будут перечислены:

source: It can be invoked like this::
ru: Его можно вызвать следующим образом::

source: The output looks like this:
ru: Вывод выглядит следующим образом:

source: Static SystemTap markers
ru: Статические маркеры SystemTap

source: The low-level way to use the SystemTap integration is to use the static markers directly. This requires you to explicitly state the binary file containing them.
ru: Низкоуровневый способ использования интеграции SystemTap — напрямую использовать статические маркеры. Для этого вам необходимо явно указать содержащий их двоичный файл.

source: For example, this SystemTap script can be used to show the call/return hierarchy of a Python script:
ru: Например, этот сценарий SystemTap можно использовать для отображения иерархии вызовов/возвратов сценария Python:

source: where the columns are:
ru: где столбцы:

source: time in microseconds since start of script
ru: время в микросекундах с момента запуска скрипта

source: name of executable
ru: имя исполняемого файла

source: PID of process
ru: PID процесса

source: and the remainder indicates the call/return hierarchy as the script executes.
ru: а остаток указывает иерархию вызовов/возвратов при выполнении сценария.

source: For a :option:`--enable-shared` build of CPython, the markers are contained within the libpython shared library, and the probe's dotted path needs to reflect this. For example, this line from the above example:
ru: Для сборки CPython :option:`--enable-shared` маркеры содержатся в общей библиотеке libpython, и это должно отражаться в пунктирном пути зонда. Например, эта строка из приведенного выше примера:

source: should instead read:
ru: вместо этого следует читать:

source: (assuming a :ref:`debug build <debug-build>` of CPython 3.6)
ru: (при условии, что имеется :ref:`отладочная сборка <debug-build>` CPython 3.6)

source: Available static markers
ru: Доступные статические маркеры

source: This marker indicates that execution of a Python function has begun. It is only triggered for pure-Python (bytecode) functions.
ru: Этот маркер указывает, что началось выполнение функции Python. Он срабатывает только для функций чистого Python (байт-код).

source: The filename, function name, and line number are provided back to the tracing script as positional arguments, which must be accessed using ``$arg1``, ``$arg2``, ``$arg3``:
ru: Имя файла, имя функции и номер строки передаются обратно в скрипт трассировки в качестве позиционных аргументов, доступ к которым осуществляется с помощью ``$arg1``, ``$arg2``, ``$arg3``:

source: This marker is the converse of :c:func:`!function__entry`, and indicates that execution of a Python function has ended (either via ``return``, or via an exception). It is only triggered for pure-Python (bytecode) functions.
ru: Этот маркер является обратным :c:func:`!function__entry` и указывает, что выполнение функции Python завершилось (либо через ``return``, либо через исключение). Он срабатывает только для функций чистого Python (байт-код).

source: The arguments are the same as for :c:func:`!function__entry`
ru: Аргументы те же, что и для :c:func:`!function__entry`

source: This marker indicates a Python line is about to be executed. It is the equivalent of line-by-line tracing with a Python profiler. It is not triggered within C functions.
ru: Этот маркер указывает на то, что строка Python скоро будет выполнена. Это эквивалент построчной трассировки с помощью профилировщика Python. Он не запускается в функциях C.

source: The arguments are the same as for :c:func:`!function__entry`.
ru: Аргументы те же, что и для :c:func:`!function__entry`.

source: Fires when the Python interpreter starts a garbage collection cycle. ``arg0`` is the generation to scan, like :func:`gc.collect`.
ru: Срабатывает, когда интерпретатор Python запускает цикл сборки мусора. ``arg0`` — это поколение для сканирования, например :func:`gc.collect`.

source: Fires when the Python interpreter finishes a garbage collection cycle. ``arg0`` is the number of collected objects.
ru: Срабатывает, когда интерпретатор Python завершает цикл сборки мусора. ``arg0`` — количество собранных объектов.

source: Fires before :mod:`importlib` attempts to find and load the module. ``arg0`` is the module name.
ru: Срабатывает до того, как :mod:`importlib` попытается найти и загрузить модуль. ``arg0`` — это имя модуля.

source: Fires after :mod:`importlib`'s find_and_load function is called. ``arg0`` is the module name, ``arg1`` indicates if module was successfully loaded.
ru: Срабатывает после вызова функции find_and_load в :mod:`importlib`. ``arg0`` — это имя модуля, ``arg1`` указывает, был ли модуль успешно загружен.

source: Fires when :func:`sys.audit` or :c:func:`PySys_Audit` is called. ``arg0`` is the event name as C string, ``arg1`` is a :c:type:`PyObject` pointer to a tuple object.
ru: Срабатывает при вызове :func:`sys.audit` или :c:func:`PySys_Audit`. arg0 — это имя события в виде строки C, arg1 — это указатель :c:type:`PyObject` на объект-кортеж.

source: SystemTap Tapsets
ru: Смесители SystemTap

source: The higher-level way to use the SystemTap integration is to use a "tapset": SystemTap's equivalent of a library, which hides some of the lower-level details of the static markers.
ru: Более высокоуровневый способ использования интеграции SystemTap — использовать «tapset»: эквивалент библиотеки SystemTap, который скрывает некоторые низкоуровневые детали статических маркеров.

source: Here is a tapset file, based on a non-shared build of CPython:
ru: Вот файл набора касаний, основанный на частной сборке CPython:

source: If this file is installed in SystemTap's tapset directory (e.g. ``/usr/share/systemtap/tapset``), then these additional probepoints become available:
ru: Если этот файл установлен в каталоге Tapset SystemTap (например, ``/usr/share/systemtap/tapset``), тогда становятся доступными следующие дополнительные точки проверки:

source: This probe point indicates that execution of a Python function has begun. It is only triggered for pure-Python (bytecode) functions.
ru: Эта точка проверки указывает на то, что началось выполнение функции Python. Он срабатывает только для функций чистого Python (байт-код).

source: This probe point is the converse of ``python.function.return``, and indicates that execution of a Python function has ended (either via ``return``, or via an exception). It is only triggered for pure-Python (bytecode) functions.
ru: Эта точка проверки является обратной точкой ``python.function.return`` и указывает, что выполнение функции Python закончилось (либо через ``return``, либо через исключение). Он срабатывает только для функций чистого Python (байт-код).

source: Examples
ru: Примеры

source: This SystemTap script uses the tapset above to more cleanly implement the example given above of tracing the Python function-call hierarchy, without needing to directly name the static markers:
ru: Этот сценарий SystemTap использует приведенный выше набор тапов для более четкой реализации приведенного выше примера отслеживания иерархии вызовов функций Python без необходимости напрямую называть статические маркеры:

source: The following script uses the tapset above to provide a top-like view of all running CPython code, showing the top 20 most frequently entered bytecode frames, each second, across the whole system:
ru: Следующий скрипт использует указанный выше набор тапов для обеспечения верхнего вида всего работающего кода CPython, показывая 20 наиболее часто вводимых кадров байт-кода каждую секунду во всей системе:
