Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/howto/logging-cookbook.po
Languages: ru

source: The code should work with recent releases of any of ``PySide6``, ``PyQt6``, ``PySide2`` or ``PyQt5``. You should be able to adapt the approach to earlier versions of Qt. Please refer to the comments in the code snippet for more detailed information.
ru: Код должен работать с последними выпусками любого из PySide6, PyQt6, PySide2 или PyQt5. Вы сможете адаптировать этот подход к более ранним версиям Qt. Для получения более подробной информации обратитесь к комментариям во фрагменте кода.

source: Logging to syslog with RFC5424 support
ru: Запись в системный журнал с поддержкой RFC5424.

source: Although :rfc:`5424` dates from 2009, most syslog servers are configured by default to use the older :rfc:`3164`, which hails from 2001. When ``logging`` was added to Python in 2003, it supported the earlier (and only existing) protocol at the time. Since RFC5424 came out, as there has not been widespread deployment of it in syslog servers, the :class:`~logging.handlers.SysLogHandler` functionality has not been updated.
ru: Хотя :rfc:`5424` датируется 2009 годом, большинство серверов системного журнала по умолчанию настроены на использование более старого :rfc:`3164`, который родом из 2001 года. Когда в 2003 году в Python было добавлено :rfc:`3164`, оно поддерживало более ранний (и единственный существовавший на тот момент) протокол. С момента выхода RFC5424, поскольку он не получил широкого распространения на серверах системного журнала, функциональность :class:`~logging.handlers.SysLogHandler` не обновлялась.

source: RFC 5424 contains some useful features such as support for structured data, and if you need to be able to log to a syslog server with support for it, you can do so with a subclassed handler which looks something like this::
ru: RFC 5424 содержит некоторые полезные функции, такие как поддержка структурированных данных, и если вам нужно иметь возможность войти на сервер системного журнала с его поддержкой, вы можете сделать это с помощью обработчика подкласса, который выглядит примерно так:

source: You'll need to be familiar with RFC 5424 to fully understand the above code, and it may be that you have slightly different needs (e.g. for how you pass structural data to the log). Nevertheless, the above should be adaptable to your speciric needs. With the above handler, you'd pass structured data using something like this::
ru: Вам необходимо знать RFC 5424, чтобы полностью понять приведенный выше код, и возможно, у вас несколько другие потребности (например, в том, как вы передаете структурные данные в журнал). Тем не менее, вышеизложенное должно быть адаптировано к вашим конкретным потребностям. С помощью приведенного выше обработчика вы передаете структурированные данные, используя что-то вроде этого::

source: How to treat a logger like an output stream
ru: Как относиться к регистратору как к выходному потоку

source: Sometimes, you need to interface to a third-party API which expects a file-like object to write to, but you want to direct the API's output to a logger. You can do this using a class which wraps a logger with a file-like API. Here's a short script illustrating such a class:
ru: Иногда вам необходимо подключиться к стороннему API, который ожидает записи в файлоподобный объект, но вы хотите направить выходные данные API в регистратор. Вы можете сделать это, используя класс, который обертывает регистратор файловым API. Вот короткий скрипт, иллюстрирующий такой класс:

source: When this script is run, it prints
ru: Когда этот скрипт запускается, он печатает

source: INFO:demo:An INFO message DEBUG:demo:A DEBUG message
ru: INFO:demo:Информационное сообщение DEBUG:demo:Сообщение DEBUG

source: You could also use ``LoggerWriter`` to redirect ``sys.stdout`` and ``sys.stderr`` by doing something like this:
ru: Вы также можете использовать LoggerWriter для перенаправления sys.stdout и sys.stderr, выполнив что-то вроде этого:

source: You should do this *after* configuring logging for your needs. In the above example, the :func:`~logging.basicConfig` call does this (using the ``sys.stderr`` value *before* it is overwritten by a ``LoggerWriter`` instance). Then, you'd get this kind of result:
ru: Вы должны сделать это *после* настройки ведения журнала для своих нужд. В приведенном выше примере это делает вызов :func:`~logging.basicConfig` (используя значение ``sys.stderr`` *до* того, как оно будет перезаписано экземпляром ``LoggerWriter``). Тогда вы получите такой результат:

source: Of course, the examples above show output according to the format used by :func:`~logging.basicConfig`, but you can use a different formatter when you configure logging.
ru: Конечно, приведенные выше примеры показывают вывод в соответствии с форматом, используемым :func:`~logging.basicConfig`, но при настройке ведения журнала вы можете использовать другой форматтер.

source: Note that with the above scheme, you are somewhat at the mercy of buffering and the sequence of write calls which you are intercepting. For example, with the definition of ``LoggerWriter`` above, if you have the snippet
ru: Обратите внимание, что в приведенной выше схеме вы в некоторой степени зависите от буферизации и последовательности вызовов записи, которые вы перехватываете. Например, с определением ``LoggerWriter`` выше, если у вас есть фрагмент

source: then running the script results in
ru: затем запуск скрипта приводит к

source: As you can see, this output isn't ideal. That's because the underlying code which writes to ``sys.stderr`` makes multiple writes, each of which results in a separate logged line (for example, the last three lines above). To get around this problem, you need to buffer things and only output log lines when newlines are seen. Let's use a slightly better implementation of ``LoggerWriter``:
ru: Как видите, этот результат не идеален. Это связано с тем, что базовый код, который записывает в ``sys.stderr``, выполняет несколько операций записи, каждая из которых приводит к отдельной записываемой строке (например, последние три строки выше). Чтобы обойти эту проблему, вам нужно буферизовать данные и выводить строки журнала только при появлении новых строк. Давайте воспользуемся немного лучшей реализацией LoggerWriter:

source: This just buffers up stuff until a newline is seen, and then logs complete lines. With this approach, you get better output:
ru: Это просто буферизует данные до тех пор, пока не появится новая строка, а затем записывает полные строки. При таком подходе вы получите лучший результат:

source: Patterns to avoid
ru: Шаблоны, которых следует избегать

source: Although the preceding sections have described ways of doing things you might need to do or deal with, it is worth mentioning some usage patterns which are *unhelpful*, and which should therefore be avoided in most cases. The following sections are in no particular order.
ru: Хотя в предыдущих разделах были описаны способы выполнения действий, которые вам могут понадобиться или с которыми вам придется иметь дело, стоит упомянуть некоторые шаблоны использования, которые *бесполезны* и которых поэтому следует избегать в большинстве случаев. Следующие разделы расположены в произвольном порядке.

source: Opening the same log file multiple times
ru: Открытие одного и того же файла журнала несколько раз

source: On Windows, you will generally not be able to open the same file multiple times as this will lead to a "file is in use by another process" error. However, on POSIX platforms you'll not get any errors if you open the same file multiple times. This could be done accidentally, for example by:
ru: В Windows вы, как правило, не сможете открыть один и тот же файл несколько раз, поскольку это приведет к ошибке «файл используется другим процессом». Однако на платформах POSIX вы не получите никаких ошибок, если откроете один и тот же файл несколько раз. Это может быть сделано случайно, например:

source: Adding a file handler more than once which references the same file (e.g. by a copy/paste/forget-to-change error).
ru: Добавление обработчика файла более одного раза, который ссылается на один и тот же файл (например, из-за ошибки копирования/вставки/забытия изменения).

source: Opening two files that look different, as they have different names, but are the same because one is a symbolic link to the other.
ru: Открытие двух файлов, которые выглядят по-разному, поскольку имеют разные имена, но одинаковы, поскольку один является символической ссылкой на другой.

source: Forking a process, following which both parent and child have a reference to the same file. This might be through use of the :mod:`multiprocessing` module, for example.
ru: Формирование процесса, после которого и родительский, и дочерний процесс имеют ссылку на один и тот же файл. Это может быть сделано, например, с помощью модуля :mod:`multiprocessing`.

source: Opening a file multiple times might *appear* to work most of the time, but can lead to a number of problems in practice:
ru: Открытие файла несколько раз может *казаться* эффективным в большинстве случаев, но на практике может привести к ряду проблем:

source: Logging output can be garbled because multiple threads or processes try to write to the same file. Although logging guards against concurrent use of the same handler instance by multiple threads, there is no such protection if concurrent writes are attempted by two different threads using two different handler instances which happen to point to the same file.
ru: Вывод журнала может быть искажен, поскольку несколько потоков или процессов пытаются выполнить запись в один и тот же файл. Хотя ведение журнала защищает от одновременного использования одного и того же экземпляра обработчика несколькими потоками, такой защиты не существует, если одновременная запись выполняется двумя разными потоками с использованием двух разных экземпляров обработчика, которые указывают на один и тот же файл.

source: An attempt to delete a file (e.g. during file rotation) silently fails, because there is another reference pointing to it. This can lead to confusion and wasted debugging time - log entries end up in unexpected places, or are lost altogether. Or a file that was supposed to be moved remains in place, and grows in size unexpectedly despite size-based rotation being supposedly in place.
ru: Попытка удалить файл (например, во время ротации файла) терпит неудачу, поскольку на него указывает другая ссылка. Это может привести к путанице и потере времени на отладку — записи журнала оказываются в неожиданных местах или вообще теряются. Или файл, который должен был быть перемещен, остается на месте и неожиданно увеличивается в размере, несмотря на предположительное вращение на основе размера.

source: Use the techniques outlined in :ref:`multiple-processes` to circumvent such issues.
ru: Используйте методы, описанные в :ref:`multiple-processes`, чтобы обойти такие проблемы.

source: Using loggers as attributes in a class or passing them as parameters
ru: Использование регистраторов в качестве атрибутов класса или передача их в качестве параметров.

source: While there might be unusual cases where you'll need to do this, in general there is no point because loggers are singletons. Code can always access a given logger instance by name using ``logging.getLogger(name)``, so passing instances around and holding them as instance attributes is pointless. Note that in other languages such as Java and C#, loggers are often static class attributes. However, this pattern doesn't make sense in Python, where the module (and not the class) is the unit of software decomposition.
ru: Хотя могут быть необычные случаи, когда вам придется это делать, в целом в этом нет смысла, поскольку регистраторы являются одиночными. Код всегда может получить доступ к данному экземпляру регистратора по имени, используя ``logging.getLogger(name)``, поэтому передача экземпляров и сохранение их в качестве атрибутов экземпляра бессмысленна. Обратите внимание, что в других языках, таких как Java и C#, средства ведения журнала часто являются атрибутами статического класса. Однако этот шаблон не имеет смысла в Python, где единицей декомпозиции программного обеспечения является модуль (а не класс).

source: Adding handlers other than :class:`~logging.NullHandler` to a logger in a library
ru: Добавление обработчиков, отличных от :class:`~logging.NullHandler`, в регистратор в библиотеке.

source: Configuring logging by adding handlers, formatters and filters is the responsibility of the application developer, not the library developer. If you are maintaining a library, ensure that you don't add handlers to any of your loggers other than a :class:`~logging.NullHandler` instance.
ru: Настройка ведения журнала путем добавления обработчиков, средств форматирования и фильтров является обязанностью разработчика приложения, а не разработчика библиотеки. Если вы поддерживаете библиотеку, убедитесь, что вы не добавляете обработчики ни в один из ваших регистраторов, кроме экземпляра :class:`~logging.NullHandler`.

source: Creating a lot of loggers
ru: Создание большого количества логгеров

source: Loggers are singletons that are never freed during a script execution, and so creating lots of loggers will use up memory which can't then be freed. Rather than create a logger per e.g. file processed or network connection made, use the :ref:`existing mechanisms <context-info>` for passing contextual information into your logs and restrict the loggers created to those describing areas within your application (generally modules, but occasionally slightly more fine-grained than that).
ru: Регистраторы — это одиночные элементы, которые никогда не освобождаются во время выполнения сценария, поэтому создание большого количества регистраторов приведет к использованию памяти, которую затем невозможно освободить. Вместо того, чтобы создавать регистратор, например, для каждого обработанного файла или установленного сетевого подключения, используйте существующие механизмы <context-info>` для передачи контекстной информации в ваши журналы и ограничьте создаваемые регистраторы теми, которые описывают области вашего приложения (обычно модули , но иногда немного более детально).

source: Other resources
ru: Другие ресурсы

source: Module :mod:`logging`
ru: Модуль :mod:`logging`

source: API reference for the logging module.
ru: Ссылка на API для модуля ведения журнала.

source: Module :mod:`logging.config`
ru: Модуль :mod:`logging.config`

source: Configuration API for the logging module.
ru: API конфигурации для модуля журналирования.

source: Module :mod:`logging.handlers`
ru: Модуль :mod:`logging.handlers`

source: Useful handlers included with the logging module.
ru: Полезные обработчики, включенные в модуль журналирования.
