Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/howto/logging-cookbook.po
Languages: ru

source: If you can't refer to the callable directly in the configuration (e.g. if it lives in a different module, and you can't import it directly where the configuration dictionary is), you can use the form ``ext://...`` as described in :ref:`logging-config-dict-externalobj`. For example, you could have used the text ``'ext://__main__.MyFilter'`` instead of ``MyFilter`` in the above example.
ru: Если вы не можете сослаться на вызываемый объект непосредственно в конфигурации (например, если он находится в другом модуле, и вы не можете импортировать его непосредственно туда, где находится словарь конфигурации), вы можете использовать форму ext://. ..`` как описано в :ref:`logging-config-dict-externalobj`. Например, вы могли бы использовать текст ext://__main__.MyFilter вместо MyFilter в приведенном выше примере.

source: As well as for filters, this technique can also be used to configure custom handlers and formatters. See :ref:`logging-config-dict-userdef` for more information on how logging supports using user-defined objects in its configuration, and see the other cookbook recipe :ref:`custom-handlers` above.
ru: Помимо фильтров, этот метод также можно использовать для настройки пользовательских обработчиков и средств форматирования. См. :ref:`logging-config-dict-userdef` для получения дополнительной информации о том, как ведение журнала поддерживает использование определяемых пользователем объектов в своей конфигурации, а также см. другой рецепт кулинарной книги :ref:`custom-handlers` выше.

source: Customized exception formatting
ru: Настраиваемое форматирование исключений

source: There might be times when you want to do customized exception formatting - for argument's sake, let's say you want exactly one line per logged event, even when exception information is present. You can do this with a custom formatter class, as shown in the following example::
ru: Могут быть случаи, когда вы захотите настроить форматирование исключений — в качестве аргумента, скажем, вам нужна ровно одна строка для каждого зарегистрированного события, даже если информация об исключении присутствует. Вы можете сделать это с помощью специального класса форматирования, как показано в следующем примере:

source: When run, this produces a file with exactly two lines:
ru: При запуске создается файл ровно с двумя строками:

source: While the above treatment is simplistic, it points the way to how exception information can be formatted to your liking. The :mod:`traceback` module may be helpful for more specialized needs.
ru: Хотя приведенная выше трактовка упрощена, она указывает путь к тому, как информацию об исключении можно отформатировать по своему вкусу. Модуль :mod:`traceback` может быть полезен для более специализированных нужд.

source: Speaking logging messages
ru: Озвучивание сообщений журнала

source: There might be situations when it is desirable to have logging messages rendered in an audible rather than a visible format. This is easy to do if you have text-to-speech (TTS) functionality available in your system, even if it doesn't have a Python binding. Most TTS systems have a command line program you can run, and this can be invoked from a handler using :mod:`subprocess`. It's assumed here that TTS command line programs won't expect to interact with users or take a long time to complete, and that the frequency of logged messages will be not so high as to swamp the user with messages, and that it's acceptable to have the messages spoken one at a time rather than concurrently, The example implementation below waits for one message to be spoken before the next is processed, and this might cause other handlers to be kept waiting. Here is a short example showing the approach, which assumes that the ``espeak`` TTS package is available::
ru: Могут возникнуть ситуации, когда желательно, чтобы сообщения журнала отображались в звуковом, а не в видимом формате. Это легко сделать, если в вашей системе доступна функция преобразования текста в речь (TTS), даже если она не имеет привязки к Python. Большинство систем TTS имеют программу командной строки, которую вы можете запустить, и ее можно вызвать из обработчика с помощью :mod:`subprocess`. Здесь предполагается, что программы командной строки TTS не будут взаимодействовать с пользователями и не будут требовать много времени для завершения, и что частота регистрируемых сообщений не будет настолько высокой, чтобы перегружать пользователя сообщениями, и что допустимо иметь сообщения произносятся по одному, а не одновременно. В приведенном ниже примере реализации ожидается произнесение одного сообщения, прежде чем будет обработано следующее, и это может привести к тому, что другие обработчики будут продолжать ждать. Вот краткий пример, показывающий подход, который предполагает, что доступен пакет TTS ``espeak``:

source: When run, this script should say "Hello" and then "Goodbye" in a female voice.
ru: При запуске этот скрипт должен сказать «Привет», а затем «До свидания» женским голосом.

source: The above approach can, of course, be adapted to other TTS systems and even other systems altogether which can process messages via external programs run from a command line.
ru: Вышеупомянутый подход, конечно, может быть адаптирован к другим системам TTS и даже к другим системам в целом, которые могут обрабатывать сообщения с помощью внешних программ, запускаемых из командной строки.

source: Buffering logging messages and outputting them conditionally
ru: Буферизация сообщений журнала и их условный вывод

source: There might be situations where you want to log messages in a temporary area and only output them if a certain condition occurs. For example, you may want to start logging debug events in a function, and if the function completes without errors, you don't want to clutter the log with the collected debug information, but if there is an error, you want all the debug information to be output as well as the error.
ru: Могут возникнуть ситуации, когда вы захотите регистрировать сообщения во временной области и выводить их только в случае возникновения определенного условия. Например, вы можете захотеть начать регистрацию событий отладки в функции, и если функция завершается без ошибок, вы не хотите загромождать журнал собранной отладочной информацией, но если есть ошибка, вы хотите, чтобы вся отладочная информация информация для вывода, а также ошибка.

source: Here is an example which shows how you could do this using a decorator for your functions where you want logging to behave this way. It makes use of the :class:`logging.handlers.MemoryHandler`, which allows buffering of logged events until some condition occurs, at which point the buffered events are ``flushed`` - passed to another handler (the ``target`` handler) for processing. By default, the ``MemoryHandler`` flushed when its buffer gets filled up or an event whose level is greater than or equal to a specified threshold is seen. You can use this recipe with a more specialised subclass of ``MemoryHandler`` if you want custom flushing behavior.
ru: Вот пример, который показывает, как вы можете сделать это, используя декоратор для ваших функций, где вы хотите, чтобы журналирование велось таким образом. Он использует :class:`logging.handlers.MemoryHandler`, который позволяет буферизовать зарегистрированные события до тех пор, пока не возникнет какое-либо условие, после чего буферизованные события ``сбрасываются`` - передаются другому обработчику (``target``). ` обработчик) для обработки. По умолчанию MemoryHandler сбрасывается, когда его буфер заполняется или наблюдается событие, уровень которого превышает или равен указанному пороговому значению. Вы можете использовать этот рецепт с более специализированным подклассом MemoryHandler, если хотите настроить поведение очистки.

source: The example script has a simple function, ``foo``, which just cycles through all the logging levels, writing to ``sys.stderr`` to say what level it's about to log at, and then actually logging a message at that level. You can pass a parameter to ``foo`` which, if true, will log at ERROR and CRITICAL levels - otherwise, it only logs at DEBUG, INFO and WARNING levels.
ru: В примере сценария есть простая функция ``foo``, которая просто циклически проходит все уровни журналирования, записывая в ``sys.stderr``, чтобы сообщить, на каком уровне он собирается войти, а затем фактически регистрирует сообщение на этом уровне. уровень. Вы можете передать параметр ``foo``, который, если он равен true, будет регистрироваться на уровнях ОШИБКА и КРИТИЧЕСКИЙ - в противном случае он будет регистрироваться только на уровнях ОТЛАДКА, ИНФОРМАЦИЯ и ПРЕДУПРЕЖДЕНИЕ.

source: The script just arranges to decorate ``foo`` with a decorator which will do the conditional logging that's required. The decorator takes a logger as a parameter and attaches a memory handler for the duration of the call to the decorated function. The decorator can be additionally parameterised using a target handler, a level at which flushing should occur, and a capacity for the buffer (number of records buffered). These default to a :class:`~logging.StreamHandler` which writes to ``sys.stderr``, ``logging.ERROR`` and ``100`` respectively.
ru: Скрипт просто украшает ``foo`` декоратором, который будет выполнять необходимую условную регистрацию. Декоратор принимает регистратор в качестве параметра и присоединяет обработчик памяти на время вызова декорируемой функции. Декоратор может быть дополнительно параметризован с помощью целевого обработчика, уровня, на котором должна произойти очистка, и емкости буфера (количества записей в буфере). По умолчанию это :class:`~logging.StreamHandler`, который записывает в ``sys.stderr``, ``logging.ERROR`` и ``100`` соответственно.

source: Here's the script::
ru: Вот скрипт::

source: When this script is run, the following output should be observed:
ru: При запуске этого сценария должен наблюдаться следующий вывод:

source: As you can see, actual logging output only occurs when an event is logged whose severity is ERROR or greater, but in that case, any previous events at lower severities are also logged.
ru: Как вы можете видеть, фактические выходные данные журнала происходят только тогда, когда регистрируется событие, серьезность которого равна ОШИБКА или выше, но в этом случае также регистрируются любые предыдущие события с более низким уровнем серьезности.

source: You can of course use the conventional means of decoration::
ru: Можно, конечно, использовать и обычные средства декора:

source: Sending logging messages to email, with buffering
ru: Отправка сообщений журнала на электронную почту с буферизацией

source: To illustrate how you can send log messages via email, so that a set number of messages are sent per email, you can subclass :class:`~logging.handlers.BufferingHandler`. In the following example, which you can adapt to suit your specific needs, a simple test harness is provided which allows you to run the script with command line arguments specifying what you typically need to send things via SMTP. (Run the downloaded script with the ``-h`` argument to see the required and optional arguments.)
ru: Чтобы проиллюстрировать, как вы можете отправлять сообщения журнала по электронной почте, чтобы определенное количество сообщений отправлялось по электронной почте, вы можете создать подкласс :class:`~logging.handlers.BufferingHandler`. В следующем примере, который вы можете адаптировать в соответствии со своими конкретными потребностями, представлена ​​простая тестовая программа, которая позволяет запускать сценарий с аргументами командной строки, определяющими, что вам обычно нужно для отправки данных через SMTP. (Запустите загруженный скрипт с аргументом ``-h``, чтобы увидеть обязательные и необязательные аргументы.)

source: If you run this script and your SMTP server is correctly set up, you should find that it sends eleven emails to the addressee you specify. The first ten emails will each have ten log messages, and the eleventh will have two messages. That makes up 102 messages as specified in the script.
ru: Если вы запустите этот сценарий и ваш SMTP-сервер настроен правильно, вы обнаружите, что он отправляет одиннадцать электронных писем указанному вами адресату. Первые десять электронных писем будут содержать по десять сообщений журнала, а одиннадцатое — по два сообщения. Это составляет 102 сообщения, как указано в сценарии.

source: Formatting times using UTC (GMT) via configuration
ru: Форматирование времени с использованием UTC (GMT) через конфигурацию

source: Sometimes you want to format times using UTC, which can be done using a class such as ``UTCFormatter``, shown below::
ru: Иногда вам нужно отформатировать время с использованием UTC, что можно сделать с помощью такого класса, как UTCFormatter, показанного ниже:

source: and you can then use the ``UTCFormatter`` in your code instead of :class:`~logging.Formatter`. If you want to do that via configuration, you can use the :func:`~logging.config.dictConfig` API with an approach illustrated by the following complete example::
ru: и затем вы можете использовать ``UTCFormatter`` в своем коде вместо :class:`~logging.Formatter`. Если вы хотите сделать это через конфигурацию, вы можете использовать API :func:`~logging.config.dictConfig` с подходом, иллюстрируемым следующим полным примером:

source: When this script is run, it should print something like:
ru: Когда этот скрипт запускается, он должен напечатать что-то вроде:

source: showing how the time is formatted both as local time and UTC, one for each handler.
ru: показывая, как время форматируется как местное время, так и в формате UTC, по одному для каждого обработчика.

source: Using a context manager for selective logging
ru: Использование контекстного менеджера для выборочного ведения журнала

source: There are times when it would be useful to temporarily change the logging configuration and revert it back after doing something. For this, a context manager is the most obvious way of saving and restoring the logging context. Here is a simple example of such a context manager, which allows you to optionally change the logging level and add a logging handler purely in the scope of the context manager::
ru: Бывают случаи, когда было бы полезно временно изменить конфигурацию журналирования и вернуть ее обратно после каких-либо действий. Для этого менеджер контекста является наиболее очевидным способом сохранения и восстановления контекста журналирования. Вот простой пример такого контекстного менеджера, который позволяет при желании изменить уровень ведения журнала и добавить обработчик журналирования исключительно в рамках контекстного менеджера:

source: If you specify a level value, the logger's level is set to that value in the scope of the with block covered by the context manager. If you specify a handler, it is added to the logger on entry to the block and removed on exit from the block. You can also ask the manager to close the handler for you on block exit - you could do this if you don't need the handler any more.
ru: Если вы укажете значение уровня, уровень средства ведения журнала будет установлен на это значение в области действия блока with, охватываемого диспетчером контекста. Если вы укажете обработчик, он будет добавлен в логгер при входе в блок и удален при выходе из блока. Вы также можете попросить менеджера закрыть для вас обработчик при выходе из блока — вы можете сделать это, если обработчик вам больше не нужен.

source: To illustrate how it works, we can add the following block of code to the above::
ru: Чтобы проиллюстрировать, как это работает, мы можем добавить следующий блок кода к приведенному выше:

source: We initially set the logger's level to ``INFO``, so message #1 appears and message #2 doesn't. We then change the level to ``DEBUG`` temporarily in the following ``with`` block, and so message #3 appears. After the block exits, the logger's level is restored to ``INFO`` and so message #4 doesn't appear. In the next ``with`` block, we set the level to ``DEBUG`` again but also add a handler writing to ``sys.stdout``. Thus, message #5 appears twice on the console (once via ``stderr`` and once via ``stdout``). After the ``with`` statement's completion, the status is as it was before so message #6 appears (like message #1) whereas message #7 doesn't (just like message #2).
ru: Изначально мы установили уровень регистратора «INFO», поэтому сообщение №1 появляется, а сообщение №2 – нет. Затем мы временно меняем уровень на DEBUG в следующем блоке with, и появляется сообщение №3. После выхода из блока уровень логгера восстанавливается до INFO, поэтому сообщение №4 не появляется. В следующем блоке with мы снова устанавливаем уровень DEBUG, но также добавляем обработчик записи в sys.stdout. Таким образом, сообщение №5 появляется на консоли дважды (один раз через stderr и один раз через stdout). После завершения оператора ``with`` статус остается прежним, поэтому появляется сообщение №6 (как и сообщение №1), а сообщение №7 – нет (как и сообщение №2).

source: If we run the resulting script, the result is as follows:
ru: Если мы запустим полученный скрипт, результат будет следующим:

source: If we run it again, but pipe ``stderr`` to ``/dev/null``, we see the following, which is the only message written to ``stdout``:
ru: Если мы запустим его снова, но перенаправим ``stderr`` в ``/dev/null``, мы увидим следующее, единственное сообщение, записанное в ``stdout``:

source: Once again, but piping ``stdout`` to ``/dev/null``, we get:
ru: Еще раз, но передав ``stdout`` в ``/dev/null``, мы получим:

source: In this case, the message #5 printed to ``stdout`` doesn't appear, as expected.
ru: В этом случае сообщение №5, выведенное на стандартный вывод, не появляется, как ожидалось.

source: Of course, the approach described here can be generalised, for example to attach logging filters temporarily. Note that the above code works in Python 2 as well as Python 3.
ru: Конечно, описанный здесь подход можно обобщить, например временно присоединить фильтры журналирования. Обратите внимание, что приведенный выше код работает как в Python 2, так и в Python 3.

source: A CLI application starter template
ru: Начальный шаблон приложения CLI

source: Here's an example which shows how you can:
ru: Вот пример, который показывает, как вы можете:

source: Use a logging level based on command-line arguments
ru: Используйте уровень ведения журнала на основе аргументов командной строки.

source: Dispatch to multiple subcommands in separate files, all logging at the same level in a consistent way
ru: Отправка нескольким подкомандам в отдельных файлах, все они последовательно регистрируются на одном уровне.

source: Make use of simple, minimal configuration
ru: Используйте простую минимальную конфигурацию

source: Suppose we have a command-line application whose job is to stop, start or restart some services. This could be organised for the purposes of illustration as a file ``app.py`` that is the main script for the application, with individual commands implemented in ``start.py``, ``stop.py`` and ``restart.py``. Suppose further that we want to control the verbosity of the application via a command-line argument, defaulting to ``logging.INFO``. Here's one way that ``app.py`` could be written::
ru: Предположим, у нас есть приложение командной строки, задача которого — остановить, запустить или перезапустить некоторые службы. В целях иллюстрации это можно организовать в виде файла ``app.py``, который является основным сценарием приложения, с отдельными командами, реализованными в ``start.py``, ``stop.py`` и `` `restart.py``. Предположим далее, что мы хотим контролировать уровень детализации приложения с помощью аргумента командной строки, по умолчанию равного ``logging.INFO``. Вот один из способов записи ``app.py``:

source: And the ``start``, ``stop`` and ``restart`` commands can be implemented in separate modules, like so for starting::
ru: А команды ``start``, ``stop`` и ``restart`` могут быть реализованы в отдельных модулях, например, для запуска:

source: and thus for stopping::
ru: и, таким образом, для остановки::

source: and similarly for restarting::
ru: и аналогично для перезапуска::

source: If we run this application with the default log level, we get output like this:
ru: Если мы запустим это приложение с уровнем журнала по умолчанию, мы получим такой вывод:

source: The first word is the logging level, and the second word is the module or package name of the place where the event was logged.
ru: Первое слово — это уровень регистрации, а второе слово — это имя модуля или пакета того места, где было зарегистрировано событие.

source: If we change the logging level, then we can change the information sent to the log. For example, if we want more information:
ru: Если мы изменим уровень журналирования, то мы сможем изменить информацию, отправляемую в журнал. Например, если нам нужна дополнительная информация:

source: And if we want less:
ru: А если мы хотим меньше:

source: In this case, the commands don't print anything to the console, since nothing at ``WARNING`` level or above is logged by them.
ru: В этом случае команды ничего не выводят на консоль, поскольку ничего на уровне «ПРЕДУПРЕЖДЕНИЕ» или выше они не регистрируют.

source: A Qt GUI for logging
ru: Qt GUI для ведения журналов

source: A question that comes up from time to time is about how to log to a GUI application. The `Qt <https://www.qt.io/>`_ framework is a popular cross-platform UI framework with Python bindings using :pypi:`PySide2` or :pypi:`PyQt5` libraries.
ru: Время от времени возникает вопрос о том, как войти в приложение с графическим интерфейсом. Фреймворк `Qt <https://www.qt.io/>`_ — это популярный кроссплатформенный фреймворк пользовательского интерфейса с привязками Python, использующими библиотеки :pypi:`PySide2` или :pypi:`PyQt5`.

source: The following example shows how to log to a Qt GUI. This introduces a simple ``QtHandler`` class which takes a callable, which should be a slot in the main thread that does GUI updates. A worker thread is also created to show how you can log to the GUI from both the UI itself (via a button for manual logging) as well as a worker thread doing work in the background (here, just logging messages at random levels with random short delays in between).
ru: В следующем примере показано, как войти в графический интерфейс Qt. Здесь представлен простой класс QtHandler, который принимает вызываемый объект, который должен представлять собой слот в основном потоке, выполняющий обновления графического интерфейса. Также создается рабочий поток, чтобы показать, как можно войти в графический интерфейс как из самого пользовательского интерфейса (с помощью кнопки для ведения журнала вручную), так и из рабочего потока, выполняющего работу в фоновом режиме (здесь просто регистрируются сообщения на случайных уровнях со случайным короткие задержки между ними).

source: The worker thread is implemented using Qt's ``QThread`` class rather than the :mod:`threading` module, as there are circumstances where one has to use ``QThread``, which offers better integration with other ``Qt`` components.
ru: Рабочий поток реализован с использованием класса ``QThread`` Qt, а не модуля :mod:`threading`, так как в некоторых случаях приходится использовать ``QThread``, который обеспечивает лучшую интеграцию с другими ``Qt``. компоненты.
