Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/howto/logging-cookbook.po
Languages: ru

source: Logging Cookbook
ru: Кулинарная книга по логированию

source: Author
ru: Автор

source: Vinay Sajip <vinay_sajip at red-dove dot com>
ru: Винай Саджип <vinay_sajip на red-dove dot com>

source: This page contains a number of recipes related to logging, which have been found useful in the past. For links to tutorial and reference information, please see :ref:`cookbook-ref-links`.
ru: Эта страница содержит ряд рецептов, связанных с ведением журнала, которые были признаны полезными в прошлом. Ссылки на учебные пособия и справочную информацию можно найти в разделе :ref:`cookbook-ref-links`.

source: Using logging in multiple modules
ru: Использование входа в несколько модулей

source: Multiple calls to ``logging.getLogger('someLogger')`` return a reference to the same logger object. This is true not only within the same module, but also across modules as long as it is in the same Python interpreter process. It is true for references to the same object; additionally, application code can define and configure a parent logger in one module and create (but not configure) a child logger in a separate module, and all logger calls to the child will pass up to the parent. Here is a main module::
ru: Множественные вызовы logging.getLogger('someLogger') возвращают ссылку на один и тот же объект журнала. Это справедливо не только в пределах одного и того же модуля, но и между модулями, если они находятся в одном и том же процессе интерпретатора Python. Это верно для ссылок на один и тот же объект; кроме того, код приложения может определить и настроить родительский регистратор в одном модуле и создать (но не настроить) дочерний регистратор в отдельном модуле, и все вызовы дочернего регистратора будут передаваться родительскому. Вот основной модуль:

source: Here is the auxiliary module::
ru: Вот вспомогательный модуль::

source: The output looks like this:
ru: Вывод выглядит следующим образом:

source: Logging from multiple threads
ru: Ведение журнала из нескольких потоков

source: Logging from multiple threads requires no special effort. The following example shows logging from the main (initial) thread and another thread::
ru: Ведение журнала из нескольких потоков не требует особых усилий. В следующем примере показано ведение журнала из основного (начального) потока и другого потока::

source: When run, the script should print something like the following:
ru: При запуске скрипт должен напечатать что-то вроде следующего:

source: This shows the logging output interspersed as one might expect. This approach works for more threads than shown here, of course.
ru: Это показывает, что выходные данные журнала чередуются, как и следовало ожидать. Конечно, этот подход работает для большего количества потоков, чем показано здесь.

source: Multiple handlers and formatters
ru: Несколько обработчиков и форматтеров

source: Loggers are plain Python objects. The :meth:`~Logger.addHandler` method has no minimum or maximum quota for the number of handlers you may add. Sometimes it will be beneficial for an application to log all messages of all severities to a text file while simultaneously logging errors or above to the console. To set this up, simply configure the appropriate handlers. The logging calls in the application code will remain unchanged. Here is a slight modification to the previous simple module-based configuration example::
ru: Регистраторы — это простые объекты Python. Метод :meth:`~Logger.addHandler` не имеет минимальной или максимальной квоты на количество добавляемых обработчиков. Иногда приложению будет полезно записывать все сообщения всех уровней серьезности в текстовый файл, одновременно регистрируя ошибки или выше на консоли. Чтобы это настроить, просто настройте соответствующие обработчики. Вызовы журналирования в коде приложения останутся неизменными. Вот небольшая модификация предыдущего примера простой конфигурации на основе модуля:

source: Notice that the 'application' code does not care about multiple handlers. All that changed was the addition and configuration of a new handler named *fh*.
ru: Обратите внимание, что код «приложения» не заботится о нескольких обработчиках. Все, что изменилось, — это добавление и настройка нового обработчика с именем *fh*.

source: The ability to create new handlers with higher- or lower-severity filters can be very helpful when writing and testing an application. Instead of using many ``print`` statements for debugging, use ``logger.debug``: Unlike the print statements, which you will have to delete or comment out later, the logger.debug statements can remain intact in the source code and remain dormant until you need them again. At that time, the only change that needs to happen is to modify the severity level of the logger and/or handler to debug.
ru: Возможность создавать новые обработчики с фильтрами более высокой или низкой важности может оказаться очень полезной при написании и тестировании приложения. Вместо использования множества операторов print для отладки используйте logger.debug: в отличие от операторов печати, которые вам придется удалить или закомментировать позже, операторы logger.debug могут остаться нетронутыми в исходном коде. и оставаться бездействующими до тех пор, пока они вам снова не понадобятся. В этот момент единственное изменение, которое необходимо сделать, — это изменить уровень серьезности средства ведения журнала и/или обработчика для отладки.

source: Logging to multiple destinations
ru: Возможность создавать новые обработчики с фильтрами более высокой или низкой важности может оказаться очень полезной при написании и тестировании приложения. Вместо использования множества операторов print для отладки используйте logger.debug: в отличие от операторов печати, которые вам придется удалить или закомментировать позже, операторы logger.debug могут остаться нетронутыми в исходном коде. и оставаться бездействующими до тех пор, пока они вам снова не понадобятся. В этот момент единственное изменение, которое необходимо сделать, — это изменить уровень серьезности средства ведения журнала и/или обработчика для отладки.

source: Let's say you want to log to console and file with different message formats and in differing circumstances. Say you want to log messages with levels of DEBUG and higher to file, and those messages at level INFO and higher to the console. Let's also assume that the file should contain timestamps, but the console messages should not. Here's how you can achieve this::
ru: Допустим, вы хотите войти в консоль и файл с разными форматами сообщений и в разных обстоятельствах. Допустим, вы хотите регистрировать сообщения с уровнем DEBUG и выше в файле, а сообщения с уровнем INFO и выше — на консоли. Предположим также, что файл должен содержать метки времени, а сообщения консоли — нет. Вот как вы можете этого добиться:

source: When you run this, on the console you will see
ru: Когда вы запустите это, на консоли вы увидите

source: and in the file you will see something like
ru: и в файле вы увидите что-то вроде

source: As you can see, the DEBUG message only shows up in the file. The other messages are sent to both destinations.
ru: Как видите, сообщение DEBUG отображается только в файле. Остальные сообщения отправляются в оба места назначения.

source: This example uses console and file handlers, but you can use any number and combination of handlers you choose.
ru: В этом примере используются обработчики консоли и файлов, но вы можете использовать любое количество и комбинацию обработчиков по вашему выбору.

source: Note that the above choice of log filename ``/tmp/myapp.log`` implies use of a standard location for temporary files on POSIX systems. On Windows, you may need to choose a different directory name for the log - just ensure that the directory exists and that you have the permissions to create and update files in it.
ru: Обратите внимание, что приведенный выше выбор имени файла журнала ``/tmp/myapp.log`` подразумевает использование стандартного местоположения для временных файлов в системах POSIX. В Windows вам может потребоваться выбрать другое имя каталога для журнала — просто убедитесь, что каталог существует и что у вас есть разрешения на создание и обновление файлов в нем.

source: Custom handling of levels
ru: Пользовательская обработка уровней

source: Sometimes, you might want to do something slightly different from the standard handling of levels in handlers, where all levels above a threshold get processed by a handler. To do this, you need to use filters. Let's look at a scenario where you want to arrange things as follows:
ru: Иногда вам может потребоваться сделать что-то немного отличное от стандартной обработки уровней в обработчиках, где все уровни выше порогового значения обрабатываются обработчиком. Для этого нужно использовать фильтры. Давайте рассмотрим сценарий, в котором вы хотите организовать все следующим образом:

source: Send messages of severity ``INFO`` and ``WARNING`` to ``sys.stdout``
ru: Отправлять сообщения серьезности ``INFO`` и ``WARNING`` в ``sys.stdout``.

source: Send messages of severity ``ERROR`` and above to ``sys.stderr``
ru: Отправлять сообщения уровня серьезности ``ERROR`` и выше в ``sys.stderr``.

source: Send messages of severity ``DEBUG`` and above to file ``app.log``
ru: Отправлять сообщения уровня серьезности ``DEBUG`` и выше в файл ``app.log``.

source: Suppose you configure logging with the following JSON:
ru: Предположим, вы настраиваете ведение журнала с помощью следующего JSON:

source: This configuration does *almost* what we want, except that ``sys.stdout`` would show messages of severity ``ERROR`` and only events of this severity and higher will be tracked as well as ``INFO`` and ``WARNING`` messages. To prevent this, we can set up a filter which excludes those messages and add it to the relevant handler. This can be configured by adding a ``filters`` section parallel to ``formatters`` and ``handlers``:
ru: Эта конфигурация делает *почти* то, что мы хотим, за исключением того, что ``sys.stdout`` будет отображать сообщения серьезности ``ERROR``, и будут отслеживаться только события этой серьезности и выше, а также ``INFO`` и `` Сообщения «ПРЕДУПРЕЖДЕНИЕ». Чтобы предотвратить это, мы можем настроить фильтр, исключающий эти сообщения, и добавить его в соответствующий обработчик. Это можно настроить, добавив раздел ``filters`` параллельно с ``formatters`` и ``handlers``:

source: and changing the section on the ``stdout`` handler to add it:
ru: и изменив раздел обработчика ``stdout``, чтобы добавить его:

source: A filter is just a function, so we can define the ``filter_maker`` (a factory function) as follows:
ru: Фильтр — это просто функция, поэтому мы можем определить «filter_maker» (фабричную функцию) следующим образом:

source: This converts the string argument passed in to a numeric level, and returns a function which only returns ``True`` if the level of the passed in record is at or below the specified level. Note that in this example I have defined the ``filter_maker`` in a test script ``main.py`` that I run from the command line, so its module will be ``__main__`` - hence the ``__main__.filter_maker`` in the filter configuration. You will need to change that if you define it in a different module.
ru: Это преобразует переданный строковый аргумент в числовой уровень и возвращает функцию, которая возвращает ``True`` только в том случае, если уровень переданной записи находится на указанном уровне или ниже. Обратите внимание, что в этом примере я определил ``filter_maker`` в тестовом скрипте ``main.py``, который запускаю из командной строки, поэтому его модулем будет ``__main__`` - отсюда и ``__main__". filter_maker`` в конфигурации фильтра. Вам нужно будет изменить это, если вы определите его в другом модуле.

source: With the filter added, we can run ``main.py``, which in full is:
ru: Добавив фильтр, мы можем запустить ``main.py``, который полностью будет выглядеть так:

source: And after running it like this:
ru: И после запуска вот так:

source: We can see the results are as expected:
ru: Мы видим, что результаты соответствуют ожиданиям:

source: Configuration server example
ru: Пример сервера конфигурации

source: Here is an example of a module using the logging configuration server::
ru: Вот пример модуля, использующего сервер конфигурации журналирования:

source: And here is a script that takes a filename and sends that file to the server, properly preceded with the binary-encoded length, as the new logging configuration::
ru: А вот сценарий, который принимает имя файла и отправляет этот файл на сервер, которому предшествует длина в двоичном коде, в качестве новой конфигурации журналирования:

source: Dealing with handlers that block
ru: Работа с обработчиками, которые блокируют

source: Sometimes you have to get your logging handlers to do their work without blocking the thread you're logging from. This is common in web applications, though of course it also occurs in other scenarios.
ru: Иногда вам нужно заставить обработчики журналирования выполнять свою работу, не блокируя поток, из которого вы регистрируетесь. Это часто встречается в веб-приложениях, хотя, конечно, встречается и в других сценариях.

source: A common culprit which demonstrates sluggish behaviour is the :class:`SMTPHandler`: sending emails can take a long time, for a number of reasons outside the developer's control (for example, a poorly performing mail or network infrastructure). But almost any network-based handler can block: Even a :class:`SocketHandler` operation may do a DNS query under the hood which is too slow (and this query can be deep in the socket library code, below the Python layer, and outside your control).
ru: Распространенной причиной медленного поведения является :class:`SMTPHandler`: отправка электронных писем может занять много времени по ряду причин, не зависящих от разработчика (например, плохая работа почтовой или сетевой инфраструктуры). Но почти любой сетевой обработчик может блокировать: даже операция :class:`SocketHandler` может выполнять слишком медленный DNS-запрос (и этот запрос может находиться глубоко в коде библиотеки сокетов, ниже уровня Python, и вне вашего контроля).

source: One solution is to use a two-part approach. For the first part, attach only a :class:`QueueHandler` to those loggers which are accessed from performance-critical threads. They simply write to their queue, which can be sized to a large enough capacity or initialized with no upper bound to their size. The write to the queue will typically be accepted quickly, though you will probably need to catch the :exc:`queue.Full` exception as a precaution in your code. If you are a library developer who has performance-critical threads in their code, be sure to document this (together with a suggestion to attach only ``QueueHandlers`` to your loggers) for the benefit of other developers who will use your code.
ru: Одним из решений является использование двухэтапного подхода. В первой части прикрепите только :class:`QueueHandler` к тем логгерам, к которым обращаются из потоков, критичных к производительности. Они просто пишут в свою очередь, размер которой может быть достаточно большим или инициализироваться без верхней границы ее размера. Запись в очередь обычно принимается быстро, хотя вам, вероятно, придется перехватить исключение :exc:`queue.Full` в качестве меры предосторожности в вашем коде. Если вы разработчик библиотек, в коде которых есть потоки, критичные к производительности, обязательно задокументируйте это (вместе с предложением прикреплять к вашим регистраторам только QueueHandlers) для пользы других разработчиков, которые будут использовать ваш код.

source: The second part of the solution is :class:`QueueListener`, which has been designed as the counterpart to :class:`QueueHandler`. A :class:`QueueListener` is very simple: it's passed a queue and some handlers, and it fires up an internal thread which listens to its queue for LogRecords sent from ``QueueHandlers`` (or any other source of ``LogRecords``, for that matter). The ``LogRecords`` are removed from the queue and passed to the handlers for processing.
ru: Вторая часть решения — :class:`QueueListener`, который был разработан как аналог :class:`QueueHandler`. :class:`QueueListener` очень прост: он передает очередь и несколько обработчиков и запускает внутренний поток, который прослушивает свою очередь на предмет LogRecords, отправленных из ``QueueHandlers`` (или любого другого источника ``LogRecords`) ', если уж на то пошло). LogRecords удаляются из очереди и передаются обработчикам для обработки.

source: The advantage of having a separate :class:`QueueListener` class is that you can use the same instance to service multiple ``QueueHandlers``. This is more resource-friendly than, say, having threaded versions of the existing handler classes, which would eat up one thread per handler for no particular benefit.
ru: Преимущество наличия отдельного класса :class:`QueueListener` заключается в том, что вы можете использовать один и тот же экземпляр для обслуживания нескольких QueueHandlers``. Это более экономично, чем, скажем, использование многопоточных версий существующих классов-обработчиков, которые съедали бы один поток на каждый обработчик без какой-либо особой выгоды.

source: An example of using these two classes follows (imports omitted)::
ru: Ниже приведен пример использования этих двух классов (импорт опущен):

source: which, when run, will produce:
ru: который при запуске выдаст:

source: Although the earlier discussion wasn't specifically talking about async code, but rather about slow logging handlers, it should be noted that when logging from async code, network and even file handlers could lead to problems (blocking the event loop) because some logging is done from :mod:`asyncio` internals. It might be best, if any async code is used in an application, to use the above approach for logging, so that any blocking code runs only in the ``QueueListener`` thread.
ru: Хотя в предыдущем обсуждении конкретно говорилось не об асинхронном коде, а скорее об обработчиках медленного журналирования, следует отметить, что при журналировании из асинхронного кода сетевые и даже файловые обработчики могут привести к проблемам (блокировке цикла событий), поскольку некоторые журналы сделано из внутренних компонентов :mod:`asyncio`. Если в приложении используется какой-либо асинхронный код, возможно, лучше всего использовать описанный выше подход для журналирования, чтобы любой код блокировки выполнялся только в потоке QueueListener.

source: Prior to Python 3.5, the :class:`QueueListener` always passed every message received from the queue to every handler it was initialized with. (This was because it was assumed that level filtering was all done on the other side, where the queue is filled.) From 3.5 onwards, this behaviour can be changed by passing a keyword argument ``respect_handler_level=True`` to the listener's constructor. When this is done, the listener compares the level of each message with the handler's level, and only passes a message to a handler if it's appropriate to do so.
ru: До Python 3.5 :class:`QueueListener` всегда передавал каждое сообщение, полученное из очереди, каждому обработчику, с помощью которого он был инициализирован. (Это произошло потому, что предполагалось, что вся фильтрация уровней выполняется на другой стороне, где очередь заполнена.) Начиная с версии 3.5, это поведение можно изменить, передав аргумент ключевого слова ``respect_handler_level=True`` в конструктор слушателя. . Когда это будет сделано, прослушиватель сравнивает уровень каждого сообщения с уровнем обработчика и передает сообщение обработчику только в том случае, если это уместно.

source: Sending and receiving logging events across a network
ru: Отправка и получение событий журнала по сети

source: Let's say you want to send logging events across a network, and handle them at the receiving end. A simple way of doing this is attaching a :class:`SocketHandler` instance to the root logger at the sending end::
ru: Допустим, вы хотите отправлять события регистрации по сети и обрабатывать их на принимающей стороне. Простой способ сделать это — прикрепить экземпляр :class:`SocketHandler` к корневому регистратору на передающей стороне:

source: At the receiving end, you can set up a receiver using the :mod:`socketserver` module. Here is a basic working example::
ru: На принимающей стороне вы можете настроить получателя с помощью модуля :mod:`socketserver`. Вот базовый рабочий пример:

source: First run the server, and then the client. On the client side, nothing is printed on the console; on the server side, you should see something like:
ru: Сначала запустите сервер, а затем клиент. На стороне клиента на консоли ничего не выводится; на стороне сервера вы должны увидеть что-то вроде:

source: Note that there are some security issues with pickle in some scenarios. If these affect you, you can use an alternative serialization scheme by overriding the :meth:`~SocketHandler.makePickle` method and implementing your alternative there, as well as adapting the above script to use your alternative serialization.
ru: Обратите внимание, что в некоторых сценариях при использовании Pickle возникают некоторые проблемы с безопасностью. Если это вас затрагивает, вы можете использовать альтернативную схему сериализации, переопределив метод :meth:`~SocketHandler.makePickle` и реализовав там свою альтернативу, а также адаптировав приведенный выше сценарий для использования вашей альтернативной сериализации.

source: Running a logging socket listener in production
ru: Запуск прослушивателя сокетов журналирования в рабочей среде

source: To run a logging listener in production, you may need to use a process-management tool such as `Supervisor <http://supervisord.org/>`_. `Here is a Gist <socket-listener-gist_>`__ which provides the bare-bones files to run the above functionality using Supervisor. It consists of the following files:
ru: Чтобы запустить прослушиватель журналов в рабочей среде, вам может потребоваться использовать инструмент управления процессами, например `Supervisor <http://supervisord.org/>`_. `Вот Gist <socket-listener-gist_>`__, который предоставляет базовые файлы для запуска вышеуказанных функций с помощью Supervisor. Он состоит из следующих файлов:

source: File
ru: Файл

source: Purpose
ru: Предназначение

source: A Bash script to prepare the environment for testing
ru: Скрипт Bash для подготовки среды к тестированию.

source: The Supervisor configuration file, which has entries for the listener and a multi-process web application
ru: Файл конфигурации Supervisor, содержащий записи для прослушивателя и многопроцессного веб-приложения.

source: A Bash script to ensure that Supervisor is running with the above configuration
ru: Сценарий Bash, гарантирующий, что Supervisor работает с указанной выше конфигурацией.

source: The socket listener program which receives log events and records them to a file
ru: Программа-прослушиватель сокетов, которая получает события журнала и записывает их в файл.

source: A simple web application which performs logging via a socket connected to the listener
ru: Простое веб-приложение, которое выполняет журналирование через сокет, подключенный к прослушивателю.

source: A JSON configuration file for the web application
ru: Файл конфигурации JSON для веб-приложения.

source: A Python script to exercise the web application
ru: Скрипт Python для работы с веб-приложением.
