Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/howto/logging-cookbook.po
Languages: ru

source: In the example, the main process spawns a listener process and some worker processes. Each of the main process, the listener and the workers have three separate configurations (the workers all share the same configuration). We can see logging in the main process, how the workers log to a QueueHandler and how the listener implements a QueueListener and a more complex logging configuration, and arranges to dispatch events received via the queue to the handlers specified in the configuration. Note that these configurations are purely illustrative, but you should be able to adapt this example to your own scenario.
ru: В этом примере основной процесс порождает процесс-слушатель и несколько рабочих процессов. Каждый основной процесс, прослушиватель и рабочие имеют три отдельные конфигурации (все рабочие имеют одну и ту же конфигурацию). Мы можем увидеть ведение журнала в основном процессе, как рабочие регистрируются в QueueHandler и как прослушиватель реализует QueueListener и более сложную конфигурацию журналирования, а также организует отправку событий, полученных через очередь, обработчикам, указанным в конфигурации. Обратите внимание, что эти конфигурации являются чисто иллюстративными, но вы сможете адаптировать этот пример к своему собственному сценарию.

source: Here's the script - the docstrings and the comments hopefully explain how it works::
ru: Вот скрипт - мы надеемся, что строки документации и комментарии объясняют, как он работает::

source: Inserting a BOM into messages sent to a SysLogHandler
ru: Вставка спецификации в сообщения, отправляемые в SysLogHandler

source: :rfc:`5424` requires that a Unicode message be sent to a syslog daemon as a set of bytes which have the following structure: an optional pure-ASCII component, followed by a UTF-8 Byte Order Mark (BOM), followed by Unicode encoded using UTF-8. (See the :rfc:`relevant section of the specification <5424#section-6>`.)
ru: :rfc:`5424` требует, чтобы сообщение Unicode было отправлено демону системного журнала в виде набора байтов, которые имеют следующую структуру: необязательный компонент чистого ASCII, за которым следует метка порядка байтов UTF-8 (BOM), за которой следует Юникод в кодировке UTF-8. (См. :rfc:`соответствующий раздел спецификации <5424#section-6>`.)

source: In Python 3.1, code was added to :class:`~logging.handlers.SysLogHandler` to insert a BOM into the message, but unfortunately, it was implemented incorrectly, with the BOM appearing at the beginning of the message and hence not allowing any pure-ASCII component to appear before it.
ru: В Python 3.1 в :class:`~logging.handlers.SysLogHandler` был добавлен код для вставки спецификации в сообщение, но, к сожалению, он был реализован неправильно: спецификация появлялась в начале сообщения и, следовательно, не допускала никаких действий. перед ним появится компонент чистого ASCII.

source: As this behaviour is broken, the incorrect BOM insertion code is being removed from Python 3.2.4 and later. However, it is not being replaced, and if you want to produce :rfc:`5424`-compliant messages which include a BOM, an optional pure-ASCII sequence before it and arbitrary Unicode after it, encoded using UTF-8, then you need to do the following:
ru: Поскольку такое поведение нарушено, неправильный код вставки спецификации удаляется из Python 3.2.4 и более поздних версий. Однако он не заменяется, и если вы хотите создавать сообщения, соответствующие :rfc:`5424`, которые включают спецификацию, необязательную последовательность чистого ASCII перед ней и произвольный Unicode после нее, закодированный с использованием UTF-8, тогда вы необходимо сделать следующее:

source: Attach a :class:`~logging.Formatter` instance to your :class:`~logging.handlers.SysLogHandler` instance, with a format string such as::
ru: Прикрепите экземпляр :class:`~logging.Formatter` к вашему экземпляру :class:`~logging.handlers.SysLogHandler` со строкой формата, например:

source: 'ASCII section\ufeffUnicode section'
ru: 'Раздел ASCII\ufeffРаздел Unicode'

source: The Unicode code point U+FEFF, when encoded using UTF-8, will be encoded as a UTF-8 BOM -- the byte-string ``b'\xef\xbb\xbf'``.
ru: Кодовая точка Unicode U+FEFF при кодировке с использованием UTF-8 будет закодирована как спецификация UTF-8 — строка байтов ``b'\xef\xbb\xbf'``.

source: Replace the ASCII section with whatever placeholders you like, but make sure that the data that appears in there after substitution is always ASCII (that way, it will remain unchanged after UTF-8 encoding).
ru: Замените раздел ASCII любыми заполнителями, которые вам нравятся, но убедитесь, что данные, которые появляются там после замены, всегда являются ASCII (таким образом, они останутся неизменными после кодирования UTF-8).

source: Replace the Unicode section with whatever placeholders you like; if the data which appears there after substitution contains characters outside the ASCII range, that's fine -- it will be encoded using UTF-8.
ru: Замените раздел Unicode любыми заполнителями, которые вам нравятся; если данные, которые появляются там после замены, содержат символы вне диапазона ASCII, это нормально — они будут закодированы с использованием UTF-8.

source: The formatted message *will* be encoded using UTF-8 encoding by ``SysLogHandler``. If you follow the above rules, you should be able to produce :rfc:`5424`-compliant messages. If you don't, logging may not complain, but your messages will not be RFC 5424-compliant, and your syslog daemon may complain.
ru: Отформатированное сообщение *будет* закодировано с использованием кодировки UTF-8 с помощью ``SysLogHandler``. Если вы будете следовать приведенным выше правилам, вы сможете создавать сообщения, соответствующие стандарту :rfc:`5424`. Если вы этого не сделаете, журналирование может не жаловаться, но ваши сообщения не будут соответствовать RFC 5424, и ваш демон системного журнала может жаловаться.

source: Implementing structured logging
ru: Реализация структурированного логирования

source: Although most logging messages are intended for reading by humans, and thus not readily machine-parseable, there might be circumstances where you want to output messages in a structured format which *is* capable of being parsed by a program (without needing complex regular expressions to parse the log message). This is straightforward to achieve using the logging package. There are a number of ways in which this could be achieved, but the following is a simple approach which uses JSON to serialise the event in a machine-parseable manner::
ru: Хотя большинство сообщений журнала предназначены для чтения людьми и, следовательно, не поддаются машинному анализу, могут возникнуть обстоятельства, когда вы захотите выводить сообщения в структурированном формате, который *может* быть проанализирован программой (без необходимости использования сложных регулярных выражений). для анализа сообщения журнала). Этого легко добиться с помощью пакета журналирования. Этого можно добиться несколькими способами, но ниже приведен простой подход, который использует JSON для сериализации события машинным анализом:

source: If the above script is run, it prints:
ru: Если приведенный выше сценарий запускается, он печатает:

source: Note that the order of items might be different according to the version of Python used.
ru: Обратите внимание, что порядок элементов может отличаться в зависимости от используемой версии Python.

source: If you need more specialised processing, you can use a custom JSON encoder, as in the following complete example::
ru: Если вам нужна более специализированная обработка, вы можете использовать собственный кодировщик JSON, как показано в следующем полном примере:

source: When the above script is run, it prints:
ru: Когда приведенный выше сценарий запускается, он печатает:

source: Customizing handlers with :func:`dictConfig`
ru: Настройка обработчиков с помощью :func:`dictConfig`

source: There are times when you want to customize logging handlers in particular ways, and if you use :func:`dictConfig` you may be able to do this without subclassing. As an example, consider that you may want to set the ownership of a log file. On POSIX, this is easily done using :func:`shutil.chown`, but the file handlers in the stdlib don't offer built-in support. You can customize handler creation using a plain function such as::
ru: Бывают случаи, когда вам нужно настроить обработчики журналирования определенным образом, и если вы используете :func:`dictConfig`, вы сможете сделать это без создания подклассов. В качестве примера предположим, что вы можете установить владельца файла журнала. В POSIX это легко сделать с помощью :func:`shutil.chown`, но обработчики файлов в стандартной библиотеке не имеют встроенной поддержки. Вы можете настроить создание обработчика, используя простую функцию, например:

source: You can then specify, in a logging configuration passed to :func:`dictConfig`, that a logging handler be created by calling this function::
ru: Затем вы можете указать в конфигурации журналирования, переданной в :func:`dictConfig`, что обработчик журналирования должен быть создан путем вызова этой функции::

source: In this example I am setting the ownership using the ``pulse`` user and group, just for the purposes of illustration. Putting it together into a working script, ``chowntest.py``::
ru: В этом примере я устанавливаю владельца, используя пользователя и группу «pulse», просто в целях иллюстрации. Собираем все это в рабочий скрипт ``chowntest.py``::

source: To run this, you will probably need to run as ``root``:
ru: Чтобы запустить это, вам, вероятно, потребуется запустить от имени root:

source: Note that this example uses Python 3.3 because that's where :func:`shutil.chown` makes an appearance. This approach should work with any Python version that supports :func:`dictConfig` - namely, Python 2.7, 3.2 or later. With pre-3.3 versions, you would need to implement the actual ownership change using e.g. :func:`os.chown`.
ru: Обратите внимание, что в этом примере используется Python 3.3, потому что именно здесь появляется :func:`shutil.chown`. Этот подход должен работать с любой версией Python, поддерживающей :func:`dictConfig`, а именно с Python 2.7, 3.2 или новее. В версиях до 3.3 вам необходимо будет реализовать фактическую смену владельца, например, с помощью :func:`os.chown`.

source: In practice, the handler-creating function may be in a utility module somewhere in your project. Instead of the line in the configuration::
ru: На практике функция создания обработчика может находиться в служебном модуле где-нибудь в вашем проекте. Вместо строки в конфигурации::

source: you could use e.g.::
ru: вы можете использовать, например::

source: where ``project.util`` can be replaced with the actual name of the package where the function resides. In the above working script, using ``'ext://__main__.owned_file_handler'`` should work. Here, the actual callable is resolved by :func:`dictConfig` from the ``ext://`` specification.
ru: где ``project.util`` можно заменить фактическим именем пакета, в котором находится функция. В приведенном выше рабочем сценарии использование ext://__main__.owned_file_handler должно работать. Здесь фактический вызываемый объект разрешается с помощью :func:`dictConfig` из спецификации ``ext://``.

source: This example hopefully also points the way to how you could implement other types of file change - e.g. setting specific POSIX permission bits - in the same way, using :func:`os.chmod`.
ru: Мы надеемся, что этот пример также указывает на то, как вы могли бы реализовать другие типы изменений файлов - например, установку определенных битов разрешений POSIX - таким же образом, используя :func:`os.chmod`.

source: Of course, the approach could also be extended to types of handler other than a :class:`~logging.FileHandler` - for example, one of the rotating file handlers, or a different type of handler altogether.
ru: Конечно, этот подход также можно распространить на типы обработчиков, отличные от :class:`~logging.FileHandler` - например, один из обработчиков вращающихся файлов или вообще другой тип обработчика.

source: Using particular formatting styles throughout your application
ru: Использование определенных стилей форматирования в вашем приложении

source: In Python 3.2, the :class:`~logging.Formatter` gained a ``style`` keyword parameter which, while defaulting to ``%`` for backward compatibility, allowed the specification of ``{`` or ``$`` to support the formatting approaches supported by :meth:`str.format` and :class:`string.Template`. Note that this governs the formatting of logging messages for final output to logs, and is completely orthogonal to how an individual logging message is constructed.
ru: В Python 3.2 :class:`~logging.Formatter` получил параметр ключевого слова ``style``, который, хотя по умолчанию для ``%`` для обратной совместимости, позволял указывать ``{`` или ``$ `` для поддержки подходов к форматированию, поддерживаемых :meth:`str.format` и :class:`string.Template`. Обратите внимание, что это определяет форматирование сообщений журнала для окончательного вывода в журналы и полностью соответствует тому, как создается отдельное сообщение журнала.

source: Logging calls (:meth:`~Logger.debug`, :meth:`~Logger.info` etc.) only take positional parameters for the actual logging message itself, with keyword parameters used only for determining options for how to handle the logging call (e.g. the ``exc_info`` keyword parameter to indicate that traceback information should be logged, or the ``extra`` keyword parameter to indicate additional contextual information to be added to the log). So you cannot directly make logging calls using :meth:`str.format` or :class:`string.Template` syntax, because internally the logging package uses %-formatting to merge the format string and the variable arguments. There would be no changing this while preserving backward compatibility, since all logging calls which are out there in existing code will be using %-format strings.
ru: Вызовы ведения журнала (:meth:`~Logger.debug`, :meth:`~Logger.info` и т. д.) принимают только позиционные параметры для самого фактического сообщения журнала, а параметры ключевых слов используются только для определения вариантов обработки журнала. вызов (например, параметр ключевого слова ``exc_info``, чтобы указать, что информация трассировки должна быть зарегистрирована, или параметр ключевого слова ``extra``, чтобы указать дополнительную контекстную информацию, которая должна быть добавлена ​​в журнал). Таким образом, вы не можете напрямую выполнять вызовы журналирования, используя синтаксис :meth:`str.format` или :class:`string.Template`, поскольку внутри пакета журналирования используется %-f форматирование для объединения строки формата и аргументов переменной. Это не будет изменено при сохранении обратной совместимости, поскольку все вызовы журналирования, которые есть в существующем коде, будут использовать %-f форматировать строки.

source: There have been suggestions to associate format styles with specific loggers, but that approach also runs into backward compatibility problems because any existing code could be using a given logger name and using %-formatting.
ru: Были предложения связать стили формата с конкретными регистраторами, но этот подход также сталкивается с проблемами обратной совместимости, поскольку любой существующий код может использовать данное имя регистратора и использовать %-f форматирование.

source: For logging to work interoperably between any third-party libraries and your code, decisions about formatting need to be made at the level of the individual logging call. This opens up a couple of ways in which alternative formatting styles can be accommodated.
ru: Чтобы журналирование работало между любыми сторонними библиотеками и вашим кодом, решения о форматировании должны приниматься на уровне отдельного вызова журнала. Это открывает несколько способов использования альтернативных стилей форматирования.

source: Using LogRecord factories
ru: Использование фабрик LogRecord

source: In Python 3.2, along with the :class:`~logging.Formatter` changes mentioned above, the logging package gained the ability to allow users to set their own :class:`LogRecord` subclasses, using the :func:`setLogRecordFactory` function. You can use this to set your own subclass of :class:`LogRecord`, which does the Right Thing by overriding the :meth:`~LogRecord.getMessage` method. The base class implementation of this method is where the ``msg % args`` formatting happens, and where you can substitute your alternate formatting; however, you should be careful to support all formatting styles and allow %-formatting as the default, to ensure interoperability with other code. Care should also be taken to call ``str(self.msg)``, just as the base implementation does.
ru: В Python 3.2, наряду с упомянутыми выше изменениями :class:`~logging.Formatter`, пакет журналирования получил возможность позволять пользователям устанавливать свои собственные подклассы :class:`LogRecord`, используя функцию :func:`setLogRecordFactory`. . Вы можете использовать это, чтобы установить свой собственный подкласс :class:`LogRecord`, который делает правильные вещи, переопределяя метод :meth:`~LogRecord.getMessage`. Реализация этого метода в базовом классе - это место, где происходит форматирование ``msg % args``, и где вы можете заменить альтернативное форматирование; однако вы должны быть осторожны, чтобы поддерживать все стили форматирования и разрешить %-f ormatting по умолчанию, чтобы обеспечить совместимость с другим кодом. Также следует позаботиться о вызове ``str(self.msg)``, как это делает базовая реализация.

source: Refer to the reference documentation on :func:`setLogRecordFactory` and :class:`LogRecord` for more information.
ru: Для получения дополнительной информации обратитесь к справочной документации по :func:`setLogRecordFactory` и :class:`LogRecord`.

source: Using custom message objects
ru: Использование пользовательских объектов сообщений

source: There is another, perhaps simpler way that you can use {}- and $- formatting to construct your individual log messages. You may recall (from :ref:`arbitrary-object-messages`) that when logging you can use an arbitrary object as a message format string, and that the logging package will call :func:`str` on that object to get the actual format string. Consider the following two classes::
ru: Существует другой, возможно, более простой способ использования форматирования {}- и $- для создания индивидуальных сообщений журнала. Вы, возможно, помните (из :ref:`prompt-object-messages`), что при регистрации вы можете использовать произвольный объект в качестве строки формата сообщения, и что пакет регистрации будет вызывать :func:`str` для этого объекта, чтобы получить фактическая строка формата. Рассмотрим следующие два класса:

source: Either of these can be used in place of a format string, to allow {}- or $-formatting to be used to build the actual "message" part which appears in the formatted log output in place of “%(message)s” or “{message}” or “$message”. If you find it a little unwieldy to use the class names whenever you want to log something, you can make it more palatable if you use an alias such as ``M`` or ``_`` for the message (or perhaps ``__``, if you are using ``_`` for localization).
ru: Любой из них можно использовать вместо строки формата, чтобы можно было использовать форматирование {} или $ для построения фактической части «сообщения», которая появляется в выводе форматированного журнала вместо « %(сообщение)с ” или “{message}” или “$message”. Если вам кажется немного громоздким использовать имена классов всякий раз, когда вы хотите что-то записать, вы можете сделать это более удобным, если вы используете псевдоним, такой как ``M`` или ``_`` для сообщения (или, возможно, ``M`` или ``_`` для сообщения (или, возможно, ``M`` или ``_`` для сообщения (или, возможно, `__``, если вы используете ``_`` для локализации).

source: Examples of this approach are given below. Firstly, formatting with :meth:`str.format`::
ru: Примеры такого подхода приведены ниже. Во-первых, форматирование с помощью :meth:`str.format`::

source: Secondly, formatting with :class:`string.Template`::
ru: Во-вторых, форматирование с помощью :class:`string.Template`::

source: One thing to note is that you pay no significant performance penalty with this approach: the actual formatting happens not when you make the logging call, but when (and if) the logged message is actually about to be output to a log by a handler. So the only slightly unusual thing which might trip you up is that the parentheses go around the format string and the arguments, not just the format string. That’s because the __ notation is just syntax sugar for a constructor call to one of the :samp:`{XXX}Message` classes shown above.
ru: Следует отметить одну вещь: при таком подходе вы не платите значительного снижения производительности: фактическое форматирование происходит не тогда, когда вы делаете вызов журнала, а когда (и если) зарегистрированное сообщение действительно собирается быть выведено в журнал обработчиком. Итак, единственная немного необычная вещь, которая может вас сбить с толку, это то, что круглые скобки заключают в себя строку формата и аргументы, а не только строку формата. Это потому, что нотация __ — это всего лишь синтаксический сахар для вызова конструктора одного из классов :samp:`{XXX}Message`, показанных выше.

source: Configuring filters with :func:`dictConfig`
ru: Настройка фильтров с помощью :func:`dictConfig`

source: You *can* configure filters using :func:`~logging.config.dictConfig`, though it might not be obvious at first glance how to do it (hence this recipe). Since :class:`~logging.Filter` is the only filter class included in the standard library, and it is unlikely to cater to many requirements (it's only there as a base class), you will typically need to define your own :class:`~logging.Filter` subclass with an overridden :meth:`~logging.Filter.filter` method. To do this, specify the ``()`` key in the configuration dictionary for the filter, specifying a callable which will be used to create the filter (a class is the most obvious, but you can provide any callable which returns a :class:`~logging.Filter` instance). Here is a complete example::
ru: Вы *можете* настроить фильтры с помощью :func:`~logging.config.dictConfig`, хотя на первый взгляд может быть неочевидно, как это сделать (отсюда и этот рецепт). Поскольку :class:`~logging.Filter` — единственный класс фильтра, включенный в стандартную библиотеку, и он вряд ли будет удовлетворять многим требованиям (он существует только в качестве базового класса), вам обычно потребуется определить свой собственный :class. Подкласс :`~logging.Filter` с переопределенным методом :meth:`~logging.Filter.filter`. Для этого укажите ключ ``()`` в словаре конфигурации для фильтра, указав вызываемый объект, который будет использоваться для создания фильтра (класс является наиболее очевидным, но вы можете предоставить любой вызываемый объект, который возвращает : class:`~logging.Filter` экземпляр). Вот полный пример:

source: This example shows how you can pass configuration data to the callable which constructs the instance, in the form of keyword parameters. When run, the above script will print:
ru: В этом примере показано, как можно передать данные конфигурации вызываемому объекту, который создает экземпляр, в форме параметров ключевого слова. При запуске приведенный выше сценарий выведет:

source: changed: hello
ru: изменено: привет

source: which shows that the filter is working as configured.
ru: который показывает, что фильтр работает так, как настроено.

source: A couple of extra points to note:
ru: Еще пара моментов, на которые стоит обратить внимание:
