Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/howto/logging-cookbook.po
Languages: ru

source: Sometimes you want to let a log file grow to a certain size, then open a new file and log to that. You may want to keep a certain number of these files, and when that many files have been created, rotate the files so that the number of files and the size of the files both remain bounded. For this usage pattern, the logging package provides a :class:`RotatingFileHandler`::
ru: Иногда вам нужно позволить файлу журнала вырасти до определенного размера, а затем открыть новый файл и войти в него. Возможно, вы захотите сохранить определенное количество этих файлов, а когда будет создано такое количество файлов, поверните их так, чтобы количество файлов и размер файлов оставались ограниченными. Для этого шаблона использования пакет журналирования предоставляет :class:`RotatingFileHandler`::

source: The result should be 6 separate files, each with part of the log history for the application:
ru: В результате должно получиться 6 отдельных файлов, каждый из которых содержит часть истории журнала приложения:

source: The most current file is always :file:`logging_rotatingfile_example.out`, and each time it reaches the size limit it is renamed with the suffix ``.1``. Each of the existing backup files is renamed to increment the suffix (``.1`` becomes ``.2``, etc.) and the ``.6`` file is erased.
ru: Самым последним файлом всегда является :file:`logging_rotatingfile_example.out`, и каждый раз, когда он достигает предела размера, он переименовывается с суффиксом ``.1``. Каждый из существующих файлов резервных копий переименовывается с увеличением суффикса («.1» становится «.2» и т. д.), а файл «.6» удаляется.

source: Obviously this example sets the log length much too small as an extreme example. You would want to set *maxBytes* to an appropriate value.
ru: Очевидно, что в этом примере длина журнала слишком мала, что является крайним примером. Вы хотели бы установить для *maxBytes* подходящее значение.

source: Use of alternative formatting styles
ru: Использование альтернативных стилей форматирования

source: When logging was added to the Python standard library, the only way of formatting messages with variable content was to use the %-formatting method. Since then, Python has gained two new formatting approaches: :class:`string.Template` (added in Python 2.4) and :meth:`str.format` (added in Python 2.6).
ru: Когда в стандартную библиотеку Python было добавлено журналирование, единственным способом форматирования сообщений с переменным содержимым было использование метода %-f метод форматирования. С тех пор в Python появилось два новых подхода к форматированию: :class:`string.Template` (добавлен в Python 2.4) и :meth:`str.format` (добавлен в Python 2.6).

source: Logging (as of 3.2) provides improved support for these two additional formatting styles. The :class:`Formatter` class been enhanced to take an additional, optional keyword parameter named ``style``. This defaults to ``'%'``, but other possible values are ``'{'`` and ``'$'``, which correspond to the other two formatting styles. Backwards compatibility is maintained by default (as you would expect), but by explicitly specifying a style parameter, you get the ability to specify format strings which work with :meth:`str.format` or :class:`string.Template`. Here's an example console session to show the possibilities:
ru: Ведение журнала (начиная с версии 3.2) обеспечивает улучшенную поддержку этих двух дополнительных стилей форматирования. Класс :class:`Formatter` был улучшен и теперь принимает дополнительный необязательный параметр ключевого слова с именем ``style``. По умолчанию это ``'%'``, но другими возможными значениями являются ``'{'`` и ``'$'``, которые соответствуют двум другим стилям форматирования. Обратная совместимость поддерживается по умолчанию (как и следовало ожидать), но, явно указав параметр стиля, вы получаете возможность указывать строки формата, которые работают с :meth:`str.format` или :class:`string.Template`. Вот пример сеанса консоли, демонстрирующий возможности:

source: Note that the formatting of logging messages for final output to logs is completely independent of how an individual logging message is constructed. That can still use %-formatting, as shown here::
ru: Обратите внимание, что форматирование сообщений журнала для окончательного вывода в журналы полностью не зависит от того, как создается отдельное сообщение журнала. Это все еще можно использовать %-f форматирование, как показано здесь::

source: Logging calls (``logger.debug()``, ``logger.info()`` etc.) only take positional parameters for the actual logging message itself, with keyword parameters used only for determining options for how to handle the actual logging call (e.g. the ``exc_info`` keyword parameter to indicate that traceback information should be logged, or the ``extra`` keyword parameter to indicate additional contextual information to be added to the log). So you cannot directly make logging calls using :meth:`str.format` or :class:`string.Template` syntax, because internally the logging package uses %-formatting to merge the format string and the variable arguments. There would be no changing this while preserving backward compatibility, since all logging calls which are out there in existing code will be using %-format strings.
ru: Вызовы журналирования (``logger.debug()``, ``logger.info()`` и т. д.) принимают только позиционные параметры для фактического сообщения журнала, а параметры ключевых слов используются только для определения вариантов обработки фактического сообщения. вызов регистрации (например, параметр ключевого слова exc_info, указывающий, что информация обратной трассировки должна регистрироваться, или параметр ключевого слова extra, указывающий дополнительную контекстную информацию, которая должна быть добавлена ​​в журнал). Таким образом, вы не можете напрямую выполнять вызовы журналирования, используя синтаксис :meth:`str.format` или :class:`string.Template`, поскольку внутри пакета журналирования используется %-f форматирование для объединения строки формата и аргументов переменной. Это не будет изменено при сохранении обратной совместимости, поскольку все вызовы журналирования, которые есть в существующем коде, будут использовать %-f форматировать строки.

source: There is, however, a way that you can use {}- and $- formatting to construct your individual log messages. Recall that for a message you can use an arbitrary object as a message format string, and that the logging package will call ``str()`` on that object to get the actual format string. Consider the following two classes::
ru: Однако существует способ использовать форматирование {}- и $- для создания индивидуальных сообщений журнала. Напомним, что для сообщения вы можете использовать произвольный объект в качестве строки формата сообщения, и что пакет журналирования будет вызывать ``str()`` для этого объекта, чтобы получить фактическую строку формата. Рассмотрим следующие два класса:

source: Either of these can be used in place of a format string, to allow {}- or $-formatting to be used to build the actual "message" part which appears in the formatted log output in place of "%(message)s" or "{message}" or "$message". It's a little unwieldy to use the class names whenever you want to log something, but it's quite palatable if you use an alias such as __ (double underscore --- not to be confused with _, the single underscore used as a synonym/alias for :func:`gettext.gettext` or its brethren).
ru: Любой из них можно использовать вместо строки формата, чтобы разрешить использование {}- или $-форматирования для создания фактической части «сообщения», которая появляется в выводе форматированного журнала вместо « %(сообщение)с " или "{message}" или "$message". Немного громоздко использовать имена классов всякий раз, когда вы хотите что-то записать в журнал, но это вполне приемлемо, если вы используете псевдоним, такой как __ (двойное подчеркивание --- не путают с _, единственным подчеркиванием, используемым как синоним/псевдоним для :func:`gettext.gettext` или его собратьев).

source: The above classes are not included in Python, though they're easy enough to copy and paste into your own code. They can be used as follows (assuming that they're declared in a module called ``wherever``):
ru: Вышеупомянутые классы не включены в Python, хотя их достаточно легко скопировать и вставить в свой код. Их можно использовать следующим образом (при условии, что они объявлены в модуле под названием «wherever»):

source: While the above examples use ``print()`` to show how the formatting works, you would of course use ``logger.debug()`` or similar to actually log using this approach.
ru: Хотя в приведенных выше примерах используется print(), чтобы показать, как работает форматирование, вы, конечно, можете использовать logger.debug() или что-то подобное, чтобы фактически вести журнал с использованием этого подхода.

source: One thing to note is that you pay no significant performance penalty with this approach: the actual formatting happens not when you make the logging call, but when (and if) the logged message is actually about to be output to a log by a handler. So the only slightly unusual thing which might trip you up is that the parentheses go around the format string and the arguments, not just the format string. That's because the __ notation is just syntax sugar for a constructor call to one of the :samp:`{XXX}Message` classes.
ru: Следует отметить одну вещь: при таком подходе вы не платите значительного снижения производительности: фактическое форматирование происходит не тогда, когда вы делаете вызов журнала, а когда (и если) зарегистрированное сообщение действительно собирается быть выведено в журнал обработчиком. Итак, единственная немного необычная вещь, которая может вас сбить с толку, это то, что круглые скобки заключают в себя строку формата и аргументы, а не только строку формата. Это потому, что обозначение __ — это всего лишь синтаксический сахар для вызова конструктора одного из классов :samp:`{XXX}Message`.

source: If you prefer, you can use a :class:`LoggerAdapter` to achieve a similar effect to the above, as in the following example::
ru: Если вы предпочитаете, вы можете использовать :class:`LoggerAdapter` для достижения эффекта, аналогичного приведенному выше, как в следующем примере:

source: The above script should log the message ``Hello, world!`` when run with Python 3.8 or later.
ru: Приведенный выше сценарий должен регистрировать сообщение «Hello, world!» при запуске с Python 3.8 или более поздней версии.

source: Customizing ``LogRecord``
ru: Настройка ``LogRecord``

source: Every logging event is represented by a :class:`LogRecord` instance. When an event is logged and not filtered out by a logger's level, a :class:`LogRecord` is created, populated with information about the event and then passed to the handlers for that logger (and its ancestors, up to and including the logger where further propagation up the hierarchy is disabled). Before Python 3.2, there were only two places where this creation was done:
ru: Каждое событие регистрации представлено экземпляром :class:`LogRecord`. Когда событие регистрируется и не отфильтровывается на уровне регистратора, создается :class:`LogRecord`, заполняется информацией о событии, а затем передается обработчикам этого регистратора (и его предков, вплоть до регистратора включительно). где дальнейшее распространение вверх по иерархии отключено). До Python 3.2 было только два места, где это творилось:

source: :meth:`Logger.makeRecord`, which is called in the normal process of logging an event. This invoked :class:`LogRecord` directly to create an instance.
ru: :meth:`Logger.makeRecord`, который вызывается в обычном процессе регистрации события. Это вызвало :class:`LogRecord` напрямую для создания экземпляра.

source: :func:`makeLogRecord`, which is called with a dictionary containing attributes to be added to the LogRecord. This is typically invoked when a suitable dictionary has been received over the network (e.g. in pickle form via a :class:`~handlers.SocketHandler`, or in JSON form via an :class:`~handlers.HTTPHandler`).
ru: :func:`makeLogRecord`, который вызывается со словарем, содержащим атрибуты, которые необходимо добавить в LogRecord. Обычно это вызывается, когда по сети получен подходящий словарь (например, в форме Pickle через :class:`~handlers.SocketHandler` или в форме JSON через :class:`~handlers.HTTPHandler`).

source: This has usually meant that if you need to do anything special with a :class:`LogRecord`, you've had to do one of the following.
ru: Обычно это означало, что если вам нужно сделать что-то особенное с :class:`LogRecord`, вам нужно было сделать одно из следующих действий.

source: Create your own :class:`Logger` subclass, which overrides :meth:`Logger.makeRecord`, and set it using :func:`~logging.setLoggerClass` before any loggers that you care about are instantiated.
ru: Создайте свой собственный подкласс :class:`Logger`, который переопределяет :meth:`Logger.makeRecord`, и установите его с помощью :func:`~logging.setLoggerClass` до того, как будут созданы экземпляры всех интересующих вас регистраторов.

source: Add a :class:`Filter` to a logger or handler, which does the necessary special manipulation you need when its :meth:`~Filter.filter` method is called.
ru: Добавьте :class:`Filter` в регистратор или обработчик, который выполняет необходимые специальные манипуляции, необходимые при вызове его метода :meth:`~Filter.filter`.

source: The first approach would be a little unwieldy in the scenario where (say) several different libraries wanted to do different things. Each would attempt to set its own :class:`Logger` subclass, and the one which did this last would win.
ru: Первый подход был бы немного громоздким в сценарии, где (скажем) несколько разных библиотек хотят делать разные вещи. Каждый из них будет пытаться установить свой собственный подкласс :class:`Logger`, и победит тот, кто сделает это последним.

source: The second approach works reasonably well for many cases, but does not allow you to e.g. use a specialized subclass of :class:`LogRecord`. Library developers can set a suitable filter on their loggers, but they would have to remember to do this every time they introduced a new logger (which they would do simply by adding new packages or modules and doing ::
ru: Второй подход работает достаточно хорошо во многих случаях, но не позволяет, например, использовать специализированный подкласс :class:`LogRecord`. Разработчики библиотек могут установить подходящий фильтр для своих средств журналирования, но им придется не забывать делать это каждый раз, когда они представляют новый регистратор (что они будут делать, просто добавляя новые пакеты или модули и выполняя::

source: at module level). It's probably one too many things to think about. Developers could also add the filter to a :class:`~logging.NullHandler` attached to their top-level logger, but this would not be invoked if an application developer attached a handler to a lower-level library logger --- so output from that handler would not reflect the intentions of the library developer.
ru: на уровне модуля). Вероятно, это слишком много вещей, о которых нужно думать. Разработчики также могут добавить фильтр в :class:`~logging.NullHandler`, прикрепленный к их средству ведения журнала верхнего уровня, но это не будет вызываться, если разработчик приложения прикрепит обработчик к средству ведения журнала библиотеки более низкого уровня --- поэтому выведите из этого обработчика не будет отражать намерения разработчика библиотеки.

source: In Python 3.2 and later, :class:`~logging.LogRecord` creation is done through a factory, which you can specify. The factory is just a callable you can set with :func:`~logging.setLogRecordFactory`, and interrogate with :func:`~logging.getLogRecordFactory`. The factory is invoked with the same signature as the :class:`~logging.LogRecord` constructor, as :class:`LogRecord` is the default setting for the factory.
ru: В Python 3.2 и более поздних версиях создание :class:`~logging.LogRecord` выполняется через фабрику, которую вы можете указать. Фабрика — это просто вызываемый объект, который вы можете установить с помощью :func:`~logging.setLogRecordFactory` и опрашивать с помощью :func:`~logging.getLogRecordFactory`. Фабрика вызывается с той же сигнатурой, что и конструктор :class:`~logging.LogRecord`, поскольку :class:`LogRecord` является настройкой по умолчанию для фабрики.

source: This approach allows a custom factory to control all aspects of LogRecord creation. For example, you could return a subclass, or just add some additional attributes to the record once created, using a pattern similar to this::
ru: Этот подход позволяет специальной фабрике контролировать все аспекты создания LogRecord. Например, вы можете вернуть подкласс или просто добавить некоторые дополнительные атрибуты к созданной записи, используя шаблон, подобный этому:

source: This pattern allows different libraries to chain factories together, and as long as they don't overwrite each other's attributes or unintentionally overwrite the attributes provided as standard, there should be no surprises. However, it should be borne in mind that each link in the chain adds run-time overhead to all logging operations, and the technique should only be used when the use of a :class:`Filter` does not provide the desired result.
ru: Этот шаблон позволяет различным библиотекам объединять фабрики в цепочку, и пока они не перезаписывают атрибуты друг друга или непреднамеренно перезаписывают атрибуты, предоставляемые в стандартной комплектации, сюрпризов быть не должно. Однако следует иметь в виду, что каждое звено в цепочке добавляет накладные расходы во время выполнения всех операций журналирования, и этот метод следует использовать только тогда, когда использование :class:`Filter` не дает желаемого результата.

source: Subclassing QueueHandler and QueueListener- a ZeroMQ example
ru: Создание подклассов QueueHandler и QueueListener — пример ZeroMQ

source: Subclass ``QueueHandler``
ru: Подкласс ``QueueHandler``

source: You can use a :class:`QueueHandler` subclass to send messages to other kinds of queues, for example a ZeroMQ 'publish' socket. In the example below,the socket is created separately and passed to the handler (as its 'queue')::
ru: Вы можете использовать подкласс :class:`QueueHandler` для отправки сообщений в другие виды очередей, например сокет публикации ZeroMQ. В приведенном ниже примере сокет создается отдельно и передается обработчику (как его «очередь»)::

source: Of course there are other ways of organizing this, for example passing in the data needed by the handler to create the socket::
ru: Конечно, есть и другие способы организации этого, например, передача данных, необходимых обработчику для создания сокета:

source: Subclass ``QueueListener``
ru: Подкласс ``QueueListener``

source: You can also subclass :class:`QueueListener` to get messages from other kinds of queues, for example a ZeroMQ 'subscribe' socket. Here's an example::
ru: Вы также можете создать подкласс :class:`QueueListener` для получения сообщений из других типов очередей, например сокета подписки ZeroMQ. Вот пример::

source: Subclassing QueueHandler and QueueListener- a ``pynng`` example
ru: Создание подклассов QueueHandler и QueueListener — пример ``pyng``

source: In a similar way to the above section, we can implement a listener and handler using :pypi:`pynng`, which is a Python binding to `NNG <https://nng.nanomsg.org/>`_, billed as a spiritual successor to ZeroMQ. The following snippets illustrate -- you can test them in an environment which has ``pynng`` installed. Just for variety, we present the listener first.
ru: Аналогично предыдущему разделу мы можем реализовать прослушиватель и обработчик, используя :pypi:`pynng`, который представляет собой привязку Python к `NNG <https://nng.nanomsg.org/>`_, позиционируемую как духовный преемник ZeroMQ. Следующие фрагменты иллюстрируют - вы можете протестировать их в среде, где установлен ``pyng``. Для разнообразия сначала представляем слушателя.

source: You can run the above two snippets in separate command shells. If we run the listener in one shell and run the sender in two separate shells, we should see something like the following. In the first sender shell:
ru: Вы можете запустить два приведенных выше фрагмента в отдельных командных оболочках. Если мы запустим прослушиватель в одной оболочке, а отправитель — в двух отдельных оболочках, мы должны увидеть что-то вроде следующего. В первой оболочке отправителя:

source: In the second sender shell:
ru: Во второй оболочке отправителя:

source: In the listener shell:
ru: В оболочке слушателя:

source: As you can see, the logging from the two sender processes is interleaved in the listener's output.
ru: Как видите, журналирование двух процессов-отправителей чередуется с выходными данными прослушивателя.

source: An example dictionary-based configuration
ru: Пример конфигурации на основе словаря

source: Below is an example of a logging configuration dictionary - it's taken from the `documentation on the Django project <https://docs.djangoproject.com/en/stable/topics/logging/#configuring-logging>`_. This dictionary is passed to :func:`~config.dictConfig` to put the configuration into effect::
ru: Ниже приведен пример словаря конфигурации журналирования — он взят из `документации по проекту Django <https://docs.djangoproject.com/en/stable/topics/logging/#configuring-logging>`_. Этот словарь передается в :func:`~config.dictConfig` для применения конфигурации::

source: For more information about this configuration, you can see the `relevant section <https://docs.djangoproject.com/en/stable/topics/logging/#configuring-logging>`_ of the Django documentation.
ru: Для получения дополнительной информации об этой конфигурации вы можете увидеть `соответствующий раздел <https://docs.djangoproject.com/en/stable/topics/logging/#configuring-logging>`_ документации Django.

source: Using a rotator and namer to customize log rotation processing
ru: Использование ротатора и неймера для настройки обработки ротации журналов

source: An example of how you can define a namer and rotator is given in the following runnable script, which shows gzip compression of the log file::
ru: Пример того, как вы можете определить имя и ротатор, приведен в следующем исполняемом скрипте, который показывает сжатие файла журнала gzip:

source: After running this, you will see six new files, five of which are compressed:
ru: После запуска вы увидите шесть новых файлов, пять из которых сжаты:

source: A more elaborate multiprocessing example
ru: Более сложный пример многопроцессорной обработки

source: The following working example shows how logging can be used with multiprocessing using configuration files. The configurations are fairly simple, but serve to illustrate how more complex ones could be implemented in a real multiprocessing scenario.
ru: В следующем рабочем примере показано, как можно использовать ведение журнала при многопроцессорной обработке с использованием файлов конфигурации. Конфигурации довольно просты, но служат для иллюстрации того, как более сложные конфигурации могут быть реализованы в реальном сценарии многопроцессорной обработки.
