Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/howto/logging-cookbook.po
Languages: ru

source: The web application uses `Gunicorn <https://gunicorn.org/>`_, which is a popular web application server that starts multiple worker processes to handle requests. This example setup shows how the workers can write to the same log file without conflicting with one another --- they all go through the socket listener.
ru: Веб-приложение использует `Gunicorn <https://gunicorn.org/>`_, популярный сервер веб-приложений, который запускает несколько рабочих процессов для обработки запросов. В этом примере настройки показано, как рабочие могут писать в один и тот же файл журнала, не конфликтуя друг с другом — все они проходят через прослушиватель сокетов.

source: To test these files, do the following in a POSIX environment:
ru: Чтобы протестировать эти файлы, выполните следующие действия в среде POSIX:

source: Download `the Gist <socket-listener-gist_>`__ as a ZIP archive using the :guilabel:`Download ZIP` button.
ru: Загрузите `the Gist <socket-listener-gist_>`__ в виде ZIP-архива, используя кнопку :guilabel:`Загрузить ZIP`.

source: Unzip the above files from the archive into a scratch directory.
ru: Разархивируйте указанные выше файлы из архива в временный каталог.

source: In the scratch directory, run ``bash prepare.sh`` to get things ready. This creates a :file:`run` subdirectory to contain Supervisor-related and log files, and a :file:`venv` subdirectory to contain a virtual environment into which ``bottle``, ``gunicorn`` and ``supervisor`` are installed.
ru: В рабочем каталоге запустите bashprepree.sh, чтобы все было готово. При этом создается подкаталог :file:`run` для хранения файлов журналов и файлов, связанных с Supervisor, а также подкаталог :file:`venv` для хранения виртуальной среды, в которой находятся ``bottle``, ``gunicorn`` и ``supervisor'. `` установлены.

source: Run ``bash ensure_app.sh`` to ensure that Supervisor is running with the above configuration.
ru: Запустите bash Sure_app.sh, чтобы убедиться, что Supervisor работает с указанной выше конфигурацией.

source: Run ``venv/bin/python client.py`` to exercise the web application, which will lead to records being written to the log.
ru: Запустите ``venv/bin/python client.py``, чтобы протестировать веб-приложение, что приведет к записи записей в журнал.

source: Inspect the log files in the :file:`run` subdirectory. You should see the most recent log lines in files matching the pattern :file:`app.log*`. They won't be in any particular order, since they have been handled concurrently by different worker processes in a non-deterministic way.
ru: Проверьте файлы журналов в подкаталоге :file:`run`. Вы должны увидеть самые последние строки журнала в файлах, соответствующих шаблону :file:`app.log*`. Они не будут располагаться в каком-то определенном порядке, поскольку они обрабатывались одновременно разными рабочими процессами недетерминированным образом.

source: You can shut down the listener and the web application by running ``venv/bin/supervisorctl -c supervisor.conf shutdown``.
ru: Вы можете закрыть прослушиватель и веб-приложение, запустив ``venv/bin/supervisorctl -c Supervisor.conf Shutdown``.

source: You may need to tweak the configuration files in the unlikely event that the configured ports clash with something else in your test environment.
ru: Возможно, вам придется настроить файлы конфигурации в том маловероятном случае, если настроенные порты будут конфликтовать с чем-то еще в вашей тестовой среде.

source: Adding contextual information to your logging output
ru: Добавление контекстной информации в выходные данные журнала

source: Sometimes you want logging output to contain contextual information in addition to the parameters passed to the logging call. For example, in a networked application, it may be desirable to log client-specific information in the log (e.g. remote client's username, or IP address). Although you could use the *extra* parameter to achieve this, it's not always convenient to pass the information in this way. While it might be tempting to create :class:`Logger` instances on a per-connection basis, this is not a good idea because these instances are not garbage collected. While this is not a problem in practice, when the number of :class:`Logger` instances is dependent on the level of granularity you want to use in logging an application, it could be hard to manage if the number of :class:`Logger` instances becomes effectively unbounded.
ru: Иногда вам нужно, чтобы выходные данные журнала содержали контекстную информацию в дополнение к параметрам, передаваемым в вызов журнала. Например, в сетевом приложении может быть желательно регистрировать в журнале информацию, специфичную для клиента (например, имя пользователя или IP-адрес удаленного клиента). Хотя для этого можно использовать параметр *extra*, передавать информацию таким способом не всегда удобно. Хотя может показаться заманчивым создавать экземпляры :class:`Logger` для каждого соединения, это не очень хорошая идея, поскольку эти экземпляры не подлежат сборке мусора. Хотя на практике это не проблема, но когда количество экземпляров :class:`Logger` зависит от уровня детализации, который вы хотите использовать при регистрации приложения, им может быть сложно управлять, если количество :class:` Экземпляры Logger становятся фактически неограниченными.

source: Using LoggerAdapters to impart contextual information
ru: Использование LoggerAdapters для передачи контекстной информации

source: An easy way in which you can pass contextual information to be output along with logging event information is to use the :class:`LoggerAdapter` class. This class is designed to look like a :class:`Logger`, so that you can call :meth:`debug`, :meth:`info`, :meth:`warning`, :meth:`error`, :meth:`exception`, :meth:`critical` and :meth:`log`. These methods have the same signatures as their counterparts in :class:`Logger`, so you can use the two types of instances interchangeably.
ru: Простой способ передать контекстную информацию для вывода вместе с информацией о событиях журнала — использовать класс :class:`LoggerAdapter`. Этот класс спроектирован так, чтобы выглядеть как :class:`Logger`, так что вы можете вызывать :meth:`debug`, :meth:`info`, :meth:`warning`, :meth:`error`, :meth :`Exception`, :meth:`critical` и :meth:`log`. Эти методы имеют те же сигнатуры, что и их аналоги в :class:`Logger`, поэтому вы можете использовать эти два типа экземпляров как взаимозаменяемые.

source: When you create an instance of :class:`LoggerAdapter`, you pass it a :class:`Logger` instance and a dict-like object which contains your contextual information. When you call one of the logging methods on an instance of :class:`LoggerAdapter`, it delegates the call to the underlying instance of :class:`Logger` passed to its constructor, and arranges to pass the contextual information in the delegated call. Here's a snippet from the code of :class:`LoggerAdapter`::
ru: Когда вы создаете экземпляр :class:`LoggerAdapter`, вы передаете ему экземпляр :class:`Logger` и объект, подобный dict, который содержит вашу контекстную информацию. Когда вы вызываете один из методов ведения журнала в экземпляре :class:`LoggerAdapter`, он делегирует вызов базовому экземпляру :class:`Logger`, передаваемому его конструктору, и организует передачу контекстной информации в делегированном вызове. . Вот фрагмент кода :class:`LoggerAdapter`::

source: The :meth:`~LoggerAdapter.process` method of :class:`LoggerAdapter` is where the contextual information is added to the logging output. It's passed the message and keyword arguments of the logging call, and it passes back (potentially) modified versions of these to use in the call to the underlying logger. The default implementation of this method leaves the message alone, but inserts an 'extra' key in the keyword argument whose value is the dict-like object passed to the constructor. Of course, if you had passed an 'extra' keyword argument in the call to the adapter, it will be silently overwritten.
ru: Метод :meth:`~LoggerAdapter.process` :class:`LoggerAdapter` — это место, где контекстная информация добавляется к выходным данным журнала. Он передает аргументы сообщения и ключевого слова вызова журнала и передает обратно (потенциально) измененные версии их для использования в вызове базового средства ведения журнала. Реализация этого метода по умолчанию оставляет сообщение в покое, но вставляет «дополнительный» ключ в аргумент ключевого слова, значением которого является объект, подобный диктовке, передаваемый конструктору. Конечно, если вы передали аргумент ключевого слова «дополнительный» при вызове адаптера, он будет автоматически перезаписан.

source: The advantage of using 'extra' is that the values in the dict-like object are merged into the :class:`LogRecord` instance's __dict__, allowing you to use customized strings with your :class:`Formatter` instances which know about the keys of the dict-like object. If you need a different method, e.g. if you want to prepend or append the contextual information to the message string, you just need to subclass :class:`LoggerAdapter` and override :meth:`~LoggerAdapter.process` to do what you need. Here is a simple example::
ru: Преимущество использования «extra» состоит в том, что значения в объекте, похожем на :class:`LogRecord`, объединяются в __dict__ экземпляра :class:`LogRecord`, что позволяет вам использовать настроенные строки с вашими экземплярами :class:`Formatter`, которые знают о ключах. объекта, подобного диктовке. Если вам нужен другой метод, например, если вы хотите добавить контекстную информацию в начало или добавить контекстную информацию к строке сообщения, вам просто нужно создать подкласс :class:`LoggerAdapter` и переопределить :meth:`~LoggerAdapter.process`, чтобы сделать то, что вам нужно. . Вот простой пример:

source: which you can use like this::
ru: который вы можете использовать следующим образом::

source: Then any events that you log to the adapter will have the value of ``some_conn_id`` prepended to the log messages.
ru: Тогда любые события, которые вы регистрируете в адаптере, будут иметь значение ``some_conn_id`` перед сообщениями журнала.

source: Using objects other than dicts to pass contextual information
ru: Использование объектов, отличных от dicts, для передачи контекстной информации

source: You don't need to pass an actual dict to a :class:`LoggerAdapter` - you could pass an instance of a class which implements ``__getitem__`` and ``__iter__`` so that it looks like a dict to logging. This would be useful if you want to generate values dynamically (whereas the values in a dict would be constant).
ru: Вам не нужно передавать фактический словарь в :class:`LoggerAdapter` - вы можете передать экземпляр класса, который реализует ``__getitem__`` и ``__iter__``, чтобы он выглядел как словарь для регистрации. Это было бы полезно, если вы хотите динамически генерировать значения (тогда как значения в словаре будут постоянными).

source: Using Filters to impart contextual information
ru: Использование фильтров для передачи контекстной информации

source: You can also add contextual information to log output using a user-defined :class:`Filter`. ``Filter`` instances are allowed to modify the ``LogRecords`` passed to them, including adding additional attributes which can then be output using a suitable format string, or if needed a custom :class:`Formatter`.
ru: Вы также можете добавить контекстную информацию в вывод журнала, используя определяемый пользователем :class:`Filter`. Экземплярам ``Filter`` разрешено изменять переданные им ``LogRecords``, включая добавление дополнительных атрибутов, которые затем можно вывести с использованием подходящей строки формата или, при необходимости, специального :class:`Formatter`.

source: For example in a web application, the request being processed (or at least, the interesting parts of it) can be stored in a threadlocal (:class:`threading.local`) variable, and then accessed from a ``Filter`` to add, say, information from the request - say, the remote IP address and remote user's username - to the ``LogRecord``, using the attribute names 'ip' and 'user' as in the ``LoggerAdapter`` example above. In that case, the same format string can be used to get similar output to that shown above. Here's an example script::
ru: Например, в веб-приложении обрабатываемый запрос (или, по крайней мере, его интересные части) может быть сохранен в переменной threadlocal (:class:`threading.local`), а затем доступен из ``Filter``. добавить, скажем, информацию из запроса — скажем, удаленный IP-адрес и имя пользователя удаленного пользователя — в LogRecord, используя имена атрибутов «ip» и «user», как в примере «LoggerAdapter» выше. . В этом случае можно использовать ту же строку формата для получения вывода, аналогичного показанному выше. Вот пример скрипта::

source: which, when run, produces something like:
ru: который при запуске выдает что-то вроде:

source: Use of ``contextvars``
ru: Использование ``contextvars``

source: Since Python 3.7, the :mod:`contextvars` module has provided context-local storage which works for both :mod:`threading` and :mod:`asyncio` processing needs. This type of storage may thus be generally preferable to thread-locals. The following example shows how, in a multi-threaded environment, logs can populated with contextual information such as, for example, request attributes handled by web applications.
ru: Начиная с Python 3.7, модуль :mod:`contextvars` предоставляет контекстно-локальное хранилище, которое подходит как для обработки :mod:`threading`, так и для :mod:`asyncio`. Таким образом, этот тип хранилища может быть предпочтительнее локальных потоков. В следующем примере показано, как в многопоточной среде журналы могут заполняться контекстной информацией, такой как, например, атрибуты запроса, обрабатываемые веб-приложениями.

source: For the purposes of illustration, say that you have different web applications, each independent of the other but running in the same Python process and using a library common to them. How can each of these applications have their own log, where all logging messages from the library (and other request processing code) are directed to the appropriate application's log file, while including in the log additional contextual information such as client IP, HTTP request method and client username?
ru: В качестве иллюстрации предположим, что у вас есть разные веб-приложения, каждое из которых независимо от другого, но выполняются в одном и том же процессе Python и используют общую для них библиотеку. Как каждое из этих приложений может иметь свой собственный журнал, где все сообщения журнала из библиотеки (и другой код обработки запросов) направляются в файл журнала соответствующего приложения, при этом в журнал включается дополнительная контекстная информация, такая как IP-адрес клиента, метод HTTP-запроса и имя пользователя клиента?

source: Let's assume that the library can be simulated by the following code:
ru: Предположим, что библиотеку можно смоделировать с помощью следующего кода:

source: We can simulate the multiple web applications by means of two simple classes, ``Request`` and ``WebApp``. These simulate how real threaded web applications work - each request is handled by a thread:
ru: Мы можем моделировать несколько веб-приложений с помощью двух простых классов: Request и WebApp. Они имитируют работу реальных многопоточных веб-приложений — каждый запрос обрабатывается потоком:

source: If you run the above, you should find that roughly half the requests go into :file:`app1.log` and the rest into :file:`app2.log`, and the all the requests are logged to :file:`app.log`. Each webapp-specific log will contain only log entries for only that webapp, and the request information will be displayed consistently in the log (i.e. the information in each dummy request will always appear together in a log line). This is illustrated by the following shell output:
ru: Если вы запустите вышеописанное, вы обнаружите, что примерно половина запросов поступает в :file:`app1.log`, а остальные - в :file:`app2.log`, и все запросы записываются в :file:`app .log`. Каждый журнал конкретного веб-приложения будет содержать только записи журнала только для этого веб-приложения, а информация о запросе будет последовательно отображаться в журнале (т. е. информация в каждом фиктивном запросе всегда будет отображаться вместе в строке журнала). Это иллюстрируется следующим выводом оболочки:

source: Imparting contextual information in handlers
ru: Передача контекстной информации в обработчики

source: Each :class:`~Handler` has its own chain of filters. If you want to add contextual information to a :class:`LogRecord` without leaking it to other handlers, you can use a filter that returns a new :class:`~LogRecord` instead of modifying it in-place, as shown in the following script::
ru: Каждый :class:`~Handler` имеет свою собственную цепочку фильтров. Если вы хотите добавить контекстную информацию в :class:`LogRecord`, не передавая ее другим обработчикам, вы можете использовать фильтр, который возвращает новый :class:`~LogRecord` вместо его модификации на месте, как показано на рисунке следующий скрипт::

source: Logging to a single file from multiple processes
ru: Запись в один файл из нескольких процессов

source: Although logging is thread-safe, and logging to a single file from multiple threads in a single process *is* supported, logging to a single file from *multiple processes* is *not* supported, because there is no standard way to serialize access to a single file across multiple processes in Python. If you need to log to a single file from multiple processes, one way of doing this is to have all the processes log to a :class:`~handlers.SocketHandler`, and have a separate process which implements a socket server which reads from the socket and logs to file. (If you prefer, you can dedicate one thread in one of the existing processes to perform this function.) :ref:`This section <network-logging>` documents this approach in more detail and includes a working socket receiver which can be used as a starting point for you to adapt in your own applications.
ru: Хотя ведение журнала является поточно-ориентированным и ведение журнала в один файл из нескольких потоков в одном процессе *поддерживается*, ведение журнала в один файл из *нескольких процессов* *не* поддерживается, поскольку не существует стандартного способа сериализации доступа. в один файл в нескольких процессах Python. Если вам нужно записывать в один файл несколько процессов, один из способов сделать это — записать все процессы в :class:`~handlers.SocketHandler` и иметь отдельный процесс, реализующий сервер сокетов, который читает из сокет и журналы в файл. (Если вы предпочитаете, вы можете выделить один поток в одном из существующих процессов для выполнения этой функции.) в качестве отправной точки для адаптации к вашим собственным приложениям.

source: Alternatively, you can use a ``Queue`` and a :class:`QueueHandler` to send all logging events to one of the processes in your multi-process application. The following example script demonstrates how you can do this; in the example a separate listener process listens for events sent by other processes and logs them according to its own logging configuration. Although the example only demonstrates one way of doing it (for example, you may want to use a listener thread rather than a separate listener process -- the implementation would be analogous) it does allow for completely different logging configurations for the listener and the other processes in your application, and can be used as the basis for code meeting your own specific requirements::
ru: В качестве альтернативы вы можете использовать Queue и :class:`QueueHandler` для отправки всех событий регистрации в один из процессов вашего многопроцессного приложения. Следующий пример сценария демонстрирует, как это можно сделать; в этом примере отдельный процесс-прослушиватель прослушивает события, отправленные другими процессами, и регистрирует их в соответствии со своей собственной конфигурацией журналирования. Хотя пример демонстрирует только один способ сделать это (например, вы можете захотеть использовать поток прослушивателя, а не отдельный процесс прослушивателя - реализация будет аналогичной), он позволяет использовать совершенно разные конфигурации журналирования для прослушивателя и другого процесса. процессов в вашем приложении и может быть использован в качестве основы для кода, отвечающего вашим конкретным требованиям:

source: A variant of the above script keeps the logging in the main process, in a separate thread::
ru: Вариант приведенного выше скрипта сохраняет журналирование в основном процессе, в отдельном потоке:

source: This variant shows how you can e.g. apply configuration for particular loggers - e.g. the ``foo`` logger has a special handler which stores all events in the ``foo`` subsystem in a file ``mplog-foo.log``. This will be used by the logging machinery in the main process (even though the logging events are generated in the worker processes) to direct the messages to the appropriate destinations.
ru: Этот вариант показывает, как вы можете, например, применить конфигурацию для определенных регистраторов - например, регистратор ``foo`` имеет специальный обработчик, который сохраняет все события в подсистеме ``foo`` в файле ``mplog-foo.log``. Это будет использоваться механизмом протоколирования в основном процессе (даже если события протоколирования генерируются в рабочих процессах) для направления сообщений в соответствующие пункты назначения.

source: Using concurrent.futures.ProcessPoolExecutor
ru: Использование concurrent.futures.ProcessPoolExecutor

source: If you want to use :class:`concurrent.futures.ProcessPoolExecutor` to start your worker processes, you need to create the queue slightly differently. Instead of
ru: Если вы хотите использовать :class:`concurrent.futures.ProcessPoolExecutor` для запуска ваших рабочих процессов, вам нужно создать очередь немного по-другому. Вместо

source: you should use
ru: вы должны использовать

source: and you can then replace the worker creation from this::
ru: и затем вы можете заменить создание рабочего следующим образом:

source: to this (remembering to first import :mod:`concurrent.futures`)::
ru: к этому (не забывая сначала импортировать :mod:`concurrent.futures`)::

source: Deploying Web applications using Gunicorn and uWSGI
ru: Развертывание веб-приложений с использованием Gunicorn и uWSGI.

source: When deploying Web applications using `Gunicorn <https://gunicorn.org/>`_ or `uWSGI <https://uwsgi-docs.readthedocs.io/en/latest/>`_ (or similar), multiple worker processes are created to handle client requests. In such environments, avoid creating file-based handlers directly in your web application. Instead, use a :class:`SocketHandler` to log from the web application to a listener in a separate process. This can be set up using a process management tool such as Supervisor - see `Running a logging socket listener in production`_ for more details.
ru: При развертывании веб-приложений с использованием `Gunicorn <https://gunicorn.org/>`_ или `uWSGI <https://uwsgi-docs.readthedocs.io/en/latest/>`_ (или аналогичного) несколько рабочих процессов создаются для обработки запросов клиентов. В таких средах избегайте создания обработчиков на основе файлов непосредственно в веб-приложении. Вместо этого используйте :class:`SocketHandler` для входа из веб-приложения в прослушиватель в отдельном процессе. Это можно настроить с помощью инструмента управления процессами, такого как Supervisor. Дополнительные сведения см. в разделе «Запуск прослушивателя сокетов журналирования в рабочей среде».

source: Using file rotation
ru: Использование ротации файлов
