Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/howto/regex.po
Languages: es_es

source: Regular Expression HOWTO
es_es: CÓMO de expresiones regulares

source: Author
es_es: Autor

source: Abstract
es_es: Resumen

source: This document is an introductory tutorial to using regular expressions in Python with the :mod:`re` module. It provides a gentler introduction than the corresponding section in the Library Reference.
es_es: Este documento es un tutorial de introducción al uso de expresiones regulares en Python con el módulo :mod:`re`. Proporciona una introducción más suave que la sección correspondiente en la Referencia de la Biblioteca.

source: Introduction
es_es: Introducción

source: Regular expressions (called REs, or regexes, or regex patterns) are essentially a tiny, highly specialized programming language embedded inside Python and made available through the :mod:`re` module. Using this little language, you specify the rules for the set of possible strings that you want to match; this set might contain English sentences, or e-mail addresses, or TeX commands, or anything you like. You can then ask questions such as "Does this string match the pattern?", or "Is there a match for the pattern anywhere in this string?". You can also use REs to modify a string or to split it apart in various ways.
es_es: Las expresiones regulares (llamadas REs, o regexes, o patrones regex) son esencialmente un pequeño lenguaje de programación altamente especializado incrustado dentro de Python y disponible a través del módulo :mod:`re`. Con este pequeño lenguaje, se especifican las reglas para el conjunto de posibles cadenas que se desea comparar; este conjunto puede contener frases en inglés, direcciones de correo electrónico, comandos TeX o lo que se desee. A continuación, puede hacer preguntas como "¿Coincide esta cadena con el patrón?", o "¿Coincide el patrón en alguna parte de esta cadena?". También puede utilizar los RE para modificar una cadena o dividirla de varias formas.

source: Regular expression patterns are compiled into a series of bytecodes which are then executed by a matching engine written in C. For advanced use, it may be necessary to pay careful attention to how the engine will execute a given RE, and write the RE in a certain way in order to produce bytecode that runs faster. Optimization isn't covered in this document, because it requires that you have a good understanding of the matching engine's internals.
es_es: Los patrones de expresiones regulares se compilan en una serie de bytecodes que luego son ejecutados por un motor de comparación escrito en C. Para un uso avanzado, puede ser necesario prestar mucha atención a cómo el motor ejecutará una RE dada, y escribir la RE de cierta manera para producir un bytecode que se ejecute más rápido. La optimización no está cubierta en este documento, porque requiere que usted tenga una buena comprensión de las interioridades del motor de emparejamiento.

source: The regular expression language is relatively small and restricted, so not all possible string processing tasks can be done using regular expressions. There are also tasks that *can* be done with regular expressions, but the expressions turn out to be very complicated. In these cases, you may be better off writing Python code to do the processing; while Python code will be slower than an elaborate regular expression, it will also probably be more understandable.
es_es: El lenguaje de expresiones regulares es relativamente pequeño y restringido, por lo que no todas las tareas posibles de procesamiento de cadenas pueden realizarse mediante expresiones regulares. También hay tareas que *pueden* realizarse con expresiones regulares, pero las expresiones resultan ser muy complicadas. En estos casos, puede que sea mejor escribir código Python para realizar el procesamiento; aunque el código Python será más lento que una expresión regular elaborada, también será probablemente más comprensible.

source: Simple Patterns
es_es: Patrones sencillos

source: We'll start by learning about the simplest possible regular expressions. Since regular expressions are used to operate on strings, we'll begin with the most common task: matching characters.
es_es: Empezaremos por conocer las expresiones regulares más sencillas posibles. Dado que las expresiones regulares se utilizan para operar con cadenas, empezaremos por la tarea más común: buscar caracteres.

source: For a detailed explanation of the computer science underlying regular expressions (deterministic and non-deterministic finite automata), you can refer to almost any textbook on writing compilers.
es_es: Para una explicación detallada de la informática subyacente a las expresiones regulares (autómatas finitos deterministas y no deterministas), puede consultar casi cualquier libro de texto sobre escritura de compiladores.

source: Matching Characters
es_es: Coincidencia de caracteres

source: Most letters and characters will simply match themselves. For example, the regular expression ``test`` will match the string ``test`` exactly. (You can enable a case-insensitive mode that would let this RE match ``Test`` or ``TEST`` as well; more about this later.)
es_es: La mayoría de las letras y caracteres simplemente coinciden entre sí. Por ejemplo, la expresión regular ``test`` coincidirá exactamente con la cadena ``test``. (Puede activar un modo que no distinga entre mayúsculas y minúsculas y que permitiría que esta RE coincidiera también con ``Test`` o ``TEST``; más sobre esto más adelante).

source: There are exceptions to this rule; some characters are special :dfn:`metacharacters`, and don't match themselves. Instead, they signal that some out-of-the-ordinary thing should be matched, or they affect other portions of the RE by repeating them or changing their meaning. Much of this document is devoted to discussing various metacharacters and what they do.
es_es: Hay excepciones a esta regla; algunos caracteres son special :dfn:`metacharacters`, especiales, y no coinciden por sí mismos. En su lugar, señalan que alguna cosa fuera de lo común debe ser emparejada, o afectan a otras partes del RE repitiéndolos o cambiando su significado. Gran parte de este documento está dedicado a discutir varios metacaracteres y lo que hacen.

source: Here's a complete list of the metacharacters; their meanings will be discussed in the rest of this HOWTO.
es_es: Esta es una lista completa de los metacaracteres; sus significados se discutirán en el resto de este CÓMO.

source: The first metacharacters we'll look at are ``[`` and ``]``. They're used for specifying a character class, which is a set of characters that you wish to match. Characters can be listed individually, or a range of characters can be indicated by giving two characters and separating them by a ``'-'``. For example, ``[abc]`` will match any of the characters ``a``, ``b``, or ``c``; this is the same as ``[a-c]``, which uses a range to express the same set of characters. If you wanted to match only lowercase letters, your RE would be ``[a-z]``.
es_es: Los primeros metacaracteres que veremos son ``[`` y ``]``. Sirven para especificar una clase de caracteres, es decir, un conjunto de caracteres con los que se desea establecer una correspondencia. Los caracteres se pueden enumerar individualmente, o se puede indicar un rango de caracteres dando dos caracteres y separándolos por un ``'-'``. Por ejemplo, ``[abc]`` coincidirá con cualquiera de los caracteres ``a``, ``b``, o ``c``; esto es lo mismo que ``[a-c]``, que utiliza un rango para expresar el mismo conjunto de caracteres. Si sólo desea buscar letras minúsculas, el RE sería ``[a-z]``.

source: Metacharacters (except ``\``) are not active inside classes. For example, ``[akm$]`` will match any of the characters ``'a'``, ``'k'``, ``'m'``, or ``'$'``; ``'$'`` is usually a metacharacter, but inside a character class it's stripped of its special nature.
es_es: Los metacaracteres (excepto ``\``) no están activos dentro de las clases. Por ejemplo, ``[akm$]`` coincidirá con cualquiera de los caracteres ``'a'``, ``'k'``, ``'m'``, o ``'$'``; ``'$'`` suele ser un metacarácter, pero dentro de una clase de caracteres se le quita su naturaleza especial.

source: You can match the characters not listed within the class by :dfn:`complementing` the set. This is indicated by including a ``'^'`` as the first character of the class. For example, ``[^5]`` will match any character except ``'5'``. If the caret appears elsewhere in a character class, it does not have special meaning. For example: ``[5^]`` will match either a ``'5'`` or a ``'^'``.
es_es: Puede hacer coincidir los caracteres no enumerados dentro de la clase :dfn:`complementing` el conjunto. Esto se indica incluyendo un ``'^'`` como primer carácter de la clase. Por ejemplo, ``[^5]`` coincidirá con cualquier carácter excepto ``'5'``. Si el signo de intercalación aparece en otra parte de una clase de caracteres, no tiene ningún significado especial. Por ejemplo: ``[5^]`` coincidirá tanto con ``'5'`` como con ``'^'``.

source: Perhaps the most important metacharacter is the backslash, ``\``. As in Python string literals, the backslash can be followed by various characters to signal various special sequences. It's also used to escape all the metacharacters so you can still match them in patterns; for example, if you need to match a ``[`` or ``\``, you can precede them with a backslash to remove their special meaning: ``\[`` or ``\\``.
es_es: Quizás el metacarácter más importante sea la barra invertida, ``\``. Como en los literales de cadena de Python, la barra invertida puede ir seguida de varios caracteres para indicar diversas secuencias especiales. También se utiliza para escapar de todos los metacaracteres, de modo que pueda seguir emparejándolos en patrones; por ejemplo, si necesita emparejar un ``[`` o ``\``, puede precederlos de una barra invertida para eliminar su significado especial: ``\[`` o ``\\``.

source: Some of the special sequences beginning with ``'\'`` represent predefined sets of characters that are often useful, such as the set of digits, the set of letters, or the set of anything that isn't whitespace.
es_es: Algunas de las secuencias especiales que empiezan por ``'\'`` representan conjuntos predefinidos de caracteres que suelen ser útiles, como el conjunto de dígitos, el conjunto de letras o el conjunto de todo lo que no sean espacios en blanco.

source: Let's take an example: ``\w`` matches any alphanumeric character. If the regex pattern is expressed in bytes, this is equivalent to the class ``[a-zA-Z0-9_]``. If the regex pattern is a string, ``\w`` will match all the characters marked as letters in the Unicode database provided by the :mod:`unicodedata` module. You can use the more restricted definition of ``\w`` in a string pattern by supplying the :const:`re.ASCII` flag when compiling the regular expression.
es_es: Tomemos un ejemplo: ``\w`` coincide con cualquier carácter alfanumérico. Si el patrón regex se expresa en bytes, equivale a la clase ``[a-zA-Z0-9_]``. Si el patrón regex es una cadena, ``\w`` coincidirá con todos los caracteres marcados como letras en la base de datos Unicode proporcionada por el módulo :mod:`unicodedata`. Puede utilizar la definición más restringida de ``\w`` en un patrón de cadena proporcionando el indicador :const:`re.ASCII` al compilar la expresión regular.

source: The following list of special sequences isn't complete. For a complete list of sequences and expanded class definitions for Unicode string patterns, see the last part of :ref:`Regular Expression Syntax <re-syntax>` in the Standard Library reference. In general, the Unicode versions match any character that's in the appropriate category in the Unicode database.
es_es: La siguiente lista de secuencias especiales no está completa. Para obtener una lista completa de secuencias y definiciones de clases expandidas para patrones de cadenas Unicode, consulte la última parte de :ref:`Regular Expression Syntax <re-syntax>` en la referencia de la Biblioteca Estándar. En general, las versiones Unicode coinciden con cualquier carácter que esté en la categoría apropiada en la base de datos Unicode.

source: Matches any decimal digit; this is equivalent to the class ``[0-9]``.
es_es: Coincide con cualquier dígito decimal; equivale a la clase ``[0-9]``.

source: Matches any non-digit character; this is equivalent to the class ``[^0-9]``.
es_es: Coincide con cualquier carácter que no sea un dígito; equivale a la clase ``[^0-9]``.

source: Matches any whitespace character; this is equivalent to the class ``[ \t\n\r\f\v]``.
es_es: Coincide con cualquier carácter de espacio en blanco; equivale a la clase ``[ \t\n\r\f\v]``.

source: Matches any non-whitespace character; this is equivalent to the class ``[^ \t\n\r\f\v]``.
es_es: Coincide con cualquier carácter que no sea un espacio en blanco; equivale a la clase ``[^ \t\n\r\f\v]``.

source: Matches any alphanumeric character; this is equivalent to the class ``[a-zA-Z0-9_]``.
es_es: Coincide con cualquier carácter alfanumérico; equivale a la clase ``[a-zA-Z0-9_]``.

source: Matches any non-alphanumeric character; this is equivalent to the class ``[^a-zA-Z0-9_]``.
es_es: Coincide con cualquier carácter no alfanumérico; equivale a la clase ``[^a-zA-Z0-9_]``.

source: These sequences can be included inside a character class. For example, ``[\s,.]`` is a character class that will match any whitespace character, or ``','`` or ``'.'``.
es_es: Estas secuencias pueden incluirse dentro de una clase de caracteres. Por ejemplo, ``[\s,.]`` es una clase de caracteres que coincidirá con cualquier carácter de espacio en blanco, o ``','`` o ``'.'``.

source: The final metacharacter in this section is ``.``. It matches anything except a newline character, and there's an alternate mode (:const:`re.DOTALL`) where it will match even a newline. ``.`` is often used where you want to match "any character".
es_es: El último metacarácter de esta sección es ``.``. Coincide con cualquier cosa excepto con un carácter de nueva línea, y existe un modo alternativo (:const:`re.DOTALL`) en el que coincidirá incluso con una nueva línea. ``.`` se utiliza a menudo cuando se desea que coincida con "cualquier carácter".

source: Repeating Things
es_es: Repetir las cosas

source: Being able to match varying sets of characters is the first thing regular expressions can do that isn't already possible with the methods available on strings. However, if that was the only additional capability of regexes, they wouldn't be much of an advance. Another capability is that you can specify that portions of the RE must be repeated a certain number of times.
es_es: Lo primero que pueden hacer las expresiones regulares que no sea ya posible con los métodos disponibles para las cadenas es ser capaces de emparejar distintos conjuntos de caracteres. Sin embargo, si ésa fuera la única capacidad adicional de las expresiones regulares, no supondrían un gran avance. Otra capacidad es que puede especificar que partes de la RE deben repetirse un determinado número de veces.

source: The first metacharacter for repeating things that we'll look at is ``*``. ``*`` doesn't match the literal character ``'*'``; instead, it specifies that the previous character can be matched zero or more times, instead of exactly once.
es_es: El primer metacarácter para repetir cosas que veremos es ``*``. ``*`` no coincide con el carácter literal ``'*'``; en su lugar, especifica que el carácter anterior puede coincidir cero o más veces, en lugar de exactamente una vez.

source: For example, ``ca*t`` will match ``'ct'`` (0 ``'a'`` characters), ``'cat'`` (1 ``'a'``), ``'caaat'`` (3 ``'a'`` characters), and so forth.
es_es: Por ejemplo, ``ca*t`` coincidirá con ``'ct'`` (0 ``'a'`` caracteres), ``'cat'`` (1 ``'a'``), ``'caaat'`` (3 ``'a'`` caracteres), y así sucesivamente.

source: Repetitions such as ``*`` are :dfn:`greedy`; when repeating a RE, the matching engine will try to repeat it as many times as possible. If later portions of the pattern don't match, the matching engine will then back up and try again with fewer repetitions.
es_es: Las repeticiones como ``*`` son :dfn:`greedy`; al repetir un RE, el motor de comparación intentará repetirlo tantas veces como sea posible. Si partes posteriores del patrón no coinciden, el motor de comparación retrocederá y volverá a intentarlo con menos repeticiones.

source: A step-by-step example will make this more obvious. Let's consider the expression ``a[bcd]*b``. This matches the letter ``'a'``, zero or more letters from the class ``[bcd]``, and finally ends with a ``'b'``. Now imagine matching this RE against the string ``'abcbd'``.
es_es: Un ejemplo paso a paso lo hará más evidente. Consideremos la expresión ``a[bcd]*b``. Ésta coincide con la letra ``'a'``, cero o más letras de la clase ``[bcd]``, y finalmente termina con una ``'b'``. Ahora imagine que compara esta RE con la cadena ``'abcbd'``.

source: Step
es_es: Paso

source: Matched
es_es: Emparejado

source: Explanation
es_es: Explicación

source: The ``a`` in the RE matches.
es_es: El ``a`` en los emparejados RE.

source: The engine matches ``[bcd]*``, going as far as it can, which is to the end of the string.
es_es: El motor hace coincidir ``[bcd]*``, yendo tan lejos como puede, que es hasta el final de la cadena.

source: *Failure*
es_es: *Fallo*

source: The engine tries to match ``b``, but the current position is at the end of the string, so it fails.
es_es: El motor intenta hacer coincidir ``b``, pero la posición actual está al final de la cadena, por lo que falla.

source: Back up, so that ``[bcd]*`` matches one less character.
es_es: Retrocede, para que ``[bcd]*`` coincida con un carácter menos.

source: Try ``b`` again, but the current position is at the last character, which is a ``'d'``.
es_es: Intente ``b`` de nuevo, pero la posición actual está en el último carácter, que es un ``'d'``.

source: Back up again, so that ``[bcd]*`` is only matching ``bc``.
es_es: Retrocede de nuevo, de modo que ``[bcd]*`` sólo coincida con ``bc``.

source: Try ``b`` again. This time the character at the current position is ``'b'``, so it succeeds.
es_es: Prueba de nuevo con ``b``. Esta vez el carácter en la posición actual es ``'b'``, por lo que tiene éxito.

source: The end of the RE has now been reached, and it has matched ``'abcb'``. This demonstrates how the matching engine goes as far as it can at first, and if no match is found it will then progressively back up and retry the rest of the RE again and again. It will back up until it has tried zero matches for ``[bcd]*``, and if that subsequently fails, the engine will conclude that the string doesn't match the RE at all.
es_es: Se ha llegado al final de la RE, y ha coincidido con ``'abcb'``. Esto demuestra cómo el motor de búsqueda llega tan lejos como puede al principio y, si no encuentra ninguna coincidencia, retrocede progresivamente y vuelve a intentar el resto de la RE una y otra vez. Retrocederá hasta que haya intentado cero coincidencias para ``[bcd]*``, y si posteriormente falla, el motor concluirá que la cadena no coincide en absoluto con el RE.

source: Another repeating metacharacter is ``+``, which matches one or more times. Pay careful attention to the difference between ``*`` and ``+``; ``*`` matches *zero* or more times, so whatever's being repeated may not be present at all, while ``+`` requires at least *one* occurrence. To use a similar example, ``ca+t`` will match ``'cat'`` (1 ``'a'``), ``'caaat'`` (3 ``'a'``\ s), but won't match ``'ct'``.
es_es: Otro metacarácter repetitivo es ``+``, que coincide una o más veces. Preste especial atención a la diferencia entre ``*`` y ``+``; ``*`` coincide *cero* o más veces, por lo que lo que se repite puede no estar presente en absoluto, mientras que ``+`` requiere al menos *una* ocurrencia. Para usar un ejemplo similar, ``ca+t`` coincidirá con ``'cat'`` (1 ``'a'``), ``'caaat'`` (3 ``'a'``\ s), pero no coincidirá con ``'ct'``.

source: You can omit either *m* or *n*; in that case, a reasonable value is assumed for the missing value. Omitting *m* is interpreted as a lower limit of 0, while omitting *n* results in an upper bound of infinity.
es_es: Puede omitir *m* o *n*; en ese caso, se asume un valor razonable para el valor que falta. Omitir *m* se interpreta como un límite inferior de 0, mientras que omitir *n* da como resultado un límite superior de infinito.

source: Using Regular Expressions
es_es: Uso de expresiones regulares

source: Now that we've looked at some simple regular expressions, how do we actually use them in Python? The :mod:`re` module provides an interface to the regular expression engine, allowing you to compile REs into objects and then perform matches with them.
es_es: Ahora que hemos visto algunas expresiones regulares simples, ¿cómo las usamos en Python? El módulo :mod:`re` proporciona una interfaz para el motor de expresiones regulares, permitiéndote compilar REs en objetos y luego realizar coincidencias con ellos.

source: Compiling Regular Expressions
es_es: Compilación de expresiones regulares

source: Regular expressions are compiled into pattern objects, which have methods for various operations such as searching for pattern matches or performing string substitutions. ::
es_es: Las expresiones regulares se compilan en objetos patrón, que disponen de métodos para diversas operaciones, como la búsqueda de coincidencias de patrones o la realización de sustituciones de cadenas. ::

source: :func:`re.compile` also accepts an optional *flags* argument, used to enable various special features and syntax variations. We'll go over the available settings later, but for now a single example will do::
es_es: :func:`re.compile` también acepta un argumento opcional *flags*, utilizado para activar diversas características especiales y variaciones sintácticas. Revisaremos las opciones disponibles más adelante, pero por ahora basta con un ejemplo::

source: The RE is passed to :func:`re.compile` as a string. REs are handled as strings because regular expressions aren't part of the core Python language, and no special syntax was created for expressing them. (There are applications that don't need REs at all, so there's no need to bloat the language specification by including them.) Instead, the :mod:`re` module is simply a C extension module included with Python, just like the :mod:`socket` or :mod:`zlib` modules.
es_es: La RE se pasa a :func:`re.compile` como una cadena. Las REs se manejan como cadenas porque las expresiones regulares no son parte del núcleo del lenguaje Python, y no se ha creado una sintaxis especial para expresarlas. (Hay aplicaciones que no necesitan REs en absoluto, así que no hay necesidad de hinchar la especificación del lenguaje incluyéndolas). En su lugar, el módulo :mod:`re` es simplemente un módulo de extensión C incluido con Python, al igual que los módulos :mod:`socket` o :mod:`zlib`.

source: Putting REs in strings keeps the Python language simpler, but has one disadvantage which is the topic of the next section.
es_es: Poner las REs en cadenas hace que el lenguaje Python sea más simple, pero tiene una desventaja que es el tema de la siguiente sección.

source: The Backslash Plague
es_es: La Backslash Plague
