Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/howto/regex.po
Languages: es_es

source: When repeating a regular expression, as in ``a*``, the resulting action is to consume as much of the pattern as possible. This fact often bites you when you're trying to match a pair of balanced delimiters, such as the angle brackets surrounding an HTML tag. The naive pattern for matching a single HTML tag doesn't work because of the greedy nature of ``.*``. ::
es_es: Cuando se repite una expresión regular, como en ``a*``, la acción resultante es consumir la mayor parte posible del patrón. Este hecho a menudo resulta molesto cuando se trata de hacer coincidir un par de delimitadores equilibrados, como los corchetes angulares que rodean una etiqueta HTML. El patrón ingenuo para que coincida con una sola etiqueta HTML no funciona debido a la naturaleza codiciosa de ``.*``. ::

source: The RE matches the ``'<'`` in ``'<html>'``, and the ``.*`` consumes the rest of the string. There's still more left in the RE, though, and the ``>`` can't match at the end of the string, so the regular expression engine has to backtrack character by character until it finds a match for the ``>``. The final match extends from the ``'<'`` in ``'<html>'`` to the ``'>'`` in ``'</title>'``, which isn't what you want.
es_es: La RE coincide con ``'<'`` en ``'<html>'``, y ``.*`` consume el resto de la cadena. Aún queda más en el RE, sin embargo, y el ``>`` no puede coincidir al final de la cadena, por lo que el motor de expresión regular tiene que retroceder carácter por carácter hasta que encuentra una coincidencia para el ``>``. La coincidencia final se extiende desde el ``'<'`` en ``'<html>'`` hasta el ``'>'`` en ``'</title>'``, que no es lo que usted quiere.

source: (Note that parsing HTML or XML with regular expressions is painful. Quick-and-dirty patterns will handle common cases, but HTML and XML have special cases that will break the obvious regular expression; by the time you've written a regular expression that handles all of the possible cases, the patterns will be *very* complicated. Use an HTML or XML parser module for such tasks.)
es_es: (Tener en cuenta que analizar HTML o XML con expresiones regulares es penoso. Los patrones rápidos manejarán los casos comunes, pero HTML y XML tienen casos especiales que romperán la expresión regular obvia; para cuando se escriba una expresión regular que maneje todos los casos posibles, los patrones serán *muy* complicados. Utilizar un módulo analizador HTML o XML para estas tareas).

source: Using re.VERBOSE
es_es: Uso de re.VERBOSE

source: By now you've probably noticed that regular expressions are a very compact notation, but they're not terribly readable. REs of moderate complexity can become lengthy collections of backslashes, parentheses, and metacharacters, making them difficult to read and understand.
es_es: Probablemente ya te habrás dado cuenta de que las expresiones regulares son una notación muy compacta, pero no son terriblemente legibles. Las expresiones regulares de complejidad moderada pueden convertirse en largas colecciones de barras invertidas, paréntesis y metacaracteres, lo que dificulta su lectura y comprensión.

source: For such REs, specifying the :const:`re.VERBOSE` flag when compiling the regular expression can be helpful, because it allows you to format the regular expression more clearly.
es_es: Para este tipo de expresiones regulares, puede ser útil especificar el indicador :const:`re.VERBOSE` al compilar la expresión regular, ya que permite formatearla con mayor claridad.

source: The ``re.VERBOSE`` flag has several effects. Whitespace in the regular expression that *isn't* inside a character class is ignored. This means that an expression such as ``dog | cat`` is equivalent to the less readable ``dog|cat``, but ``[a b]`` will still match the characters ``'a'``, ``'b'``, or a space. In addition, you can also put comments inside a RE; comments extend from a ``#`` character to the next newline. When used with triple-quoted strings, this enables REs to be formatted more neatly::
es_es: El indicador ``re.VERBOSE`` tiene varios efectos. Se ignoran los espacios en blanco de la expresión regular que *no* estén dentro de una clase de caracteres. Esto significa que una expresión como ``dog | cat`` es equivalente a la menos legible ``dog|cat``, pero ``[a b]`` seguirá coincidiendo con los caracteres ``'a'``, ``'b'``, o un espacio. Además, también puede poner comentarios dentro de una RE; los comentarios se extienden desde un carácter ``#`` hasta la siguiente nueva línea. Cuando se utilizan con cadenas entre comillas triples, esto permite formatear los RE de forma más ordenada::

source: This is far more readable than::
es_es: Esto es mucho más legible que::

source: Feedback
es_es: Comentarios

source: Regular expressions are a complicated topic. Did this document help you understand them? Were there parts that were unclear, or Problems you encountered that weren't covered here? If so, please send suggestions for improvements to the author.
es_es: Las expresiones regulares son un tema complicado. ¿Le ha ayudado este documento a entenderlas? ¿Hubo partes que no quedaron claras, o problemas que encontró que no se trataron aquí? Si es así, por favor envíe sugerencias de mejora al autor.

source: The most complete book on regular expressions is almost certainly Jeffrey Friedl's Mastering Regular Expressions, published by O'Reilly. Unfortunately, it exclusively concentrates on Perl and Java's flavours of regular expressions, and doesn't contain any Python material at all, so it won't be useful as a reference for programming in Python. (The first edition covered Python's now-removed :mod:`!regex` module, which won't help you much.) Consider checking it out from your library.
es_es: El libro más completo sobre expresiones regulares es sin duda Mastering Regular Expressions, de Jeffrey Friedl, publicado por O'Reilly. Desafortunadamente, se concentra exclusivamente en las expresiones regulares de Perl y Java, y no contiene ningún material sobre Python, por lo que no será útil como referencia para programar en Python. (La primera edición cubría el ahora eliminado módulo :mod:`!regex` de Python, que no le ayudará mucho). Considera sacarlo de tu biblioteca.
