Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/howto/regex.po
Languages: es_es

source: As stated earlier, regular expressions use the backslash character (``'\'``) to indicate special forms or to allow special characters to be used without invoking their special meaning. This conflicts with Python's usage of the same character for the same purpose in string literals.
es_es: Como ya se ha dicho, las expresiones regulares utilizan el carácter de barra invertida (``'\'``) para indicar formas especiales o para permitir el uso de caracteres especiales sin invocar su significado especial. Esto entra en conflicto con el uso que hace Python del mismo carácter para el mismo propósito en los literales de cadena.

source: Let's say you want to write a RE that matches the string ``\section``, which might be found in a LaTeX file. To figure out what to write in the program code, start with the desired string to be matched. Next, you must escape any backslashes and other metacharacters by preceding them with a backslash, resulting in the string ``\\section``. The resulting string that must be passed to :func:`re.compile` must be ``\\section``. However, to express this as a Python string literal, both backslashes must be escaped *again*.
es_es: Supongamos que desea escribir un RE que coincida con la cadena ``\section``, que podría encontrarse en un archivo LaTeX. Para saber qué escribir en el código del programa, comience con la cadena que desea comparar. Luego, debe escapar cualquier barra invertida y otros metacaracteres precediéndolos con una barra invertida, resultando en la cadena ``\\section``. La cadena resultante que debe pasarse a :func:`re.compile` debe ser ``\\section``. Sin embargo, para expresar esto como una cadena literal de Python, ambas barras invertidas deben ser escapadas *otra vez*.

source: Characters
es_es: Caracteres

source: Stage
es_es: Proceso

source: Text string to be matched
es_es: Cadena de texto a buscar

source: Escaped backslash for :func:`re.compile`
es_es: Barra diagonal inversa desaparecida para :func:`re.compile`

source: Escaped backslashes for a string literal
es_es: Evitar la barra invertida para una cadena literal

source: In short, to match a literal backslash, one has to write ``'\\\\'`` as the RE string, because the regular expression must be ``\\``, and each backslash must be expressed as ``\\`` inside a regular Python string literal. In REs that feature backslashes repeatedly, this leads to lots of repeated backslashes and makes the resulting strings difficult to understand.
es_es: En resumen, para que coincida con una barra invertida literal, uno tiene que escribir ``'\\\\'`` como la cadena RE, porque la expresión regular debe ser ``\\``, y cada barra invertida debe expresarse como ``\\`` dentro de un literal de cadena regular de Python. En REs que presentan barras invertidas repetidamente, esto lleva a muchas barras invertidas repetidas y hace que las cadenas resultantes sean difíciles de entender.

source: The solution is to use Python's raw string notation for regular expressions; backslashes are not handled in any special way in a string literal prefixed with ``'r'``, so ``r"\n"`` is a two-character string containing ``'\'`` and ``'n'``, while ``"\n"`` is a one-character string containing a newline. Regular expressions will often be written in Python code using this raw string notation.
es_es: La solución es utilizar la notación de cadena sin procesar de Python para las expresiones regulares; las barras invertidas no se manejan de ninguna manera especial en una cadena literal prefijada con ``'r'``, por lo que ``r"\n"`` es una cadena de dos caracteres que contiene ``'\'`` y ``'n'``, mientras que ``"\n"`` es una cadena de un carácter que contiene una nueva línea. Las expresiones regulares se escriben a menudo en código Python utilizando esta notación de cadena sin procesar.

source: In addition, special escape sequences that are valid in regular expressions, but not valid as Python string literals, now result in a :exc:`DeprecationWarning` and will eventually become a :exc:`SyntaxError`, which means the sequences will be invalid if raw string notation or escaping the backslashes isn't used.
es_es: Además, las secuencias de escape especiales que son válidas en expresiones regulares, pero no como literales de cadena de Python, ahora resultan en un :exc:`DeprecationWarning` y eventualmente se convertirán en un :exc:`SyntaxError`, lo que significa que las secuencias no serán válidas si no se utiliza la notación de cadena sin procesar o el escape de las barras invertidas.

source: Regular String
es_es: Cadena normal

source: Raw string
es_es: Cadena bruta

source: Performing Matches
es_es: Realización de combinaciones

source: Once you have an object representing a compiled regular expression, what do you do with it? Pattern objects have several methods and attributes. Only the most significant ones will be covered here; consult the :mod:`re` docs for a complete listing.
es_es: Una vez que se tiene un objeto que representa una expresión regular compilada, ¿qué se hace con él? Los objetos patrón tienen varios métodos y atributos. Aquí sólo trataremos los más importantes; consultar la documentación de :mod:`re` para obtener una lista completa.

source: Method/Attribute
es_es: Método/Atributo

source: Purpose
es_es: Propósito

source: Determine if the RE matches at the beginning of the string.
es_es: Determina si el RE coincide al principio de la cadena.

source: Scan through a string, looking for any location where this RE matches.
es_es: Escanea a través de una cadena, buscando cualquier lugar donde coincida este RE.

source: Find all substrings where the RE matches, and returns them as a list.
es_es: Encuentra todas las subcadenas en las que coincide el RE y las devuelve como una lista.

source: Find all substrings where the RE matches, and returns them as an :term:`iterator`.
es_es: Busca todas las subcadenas en las que coincide el RE y las devuelve como un :term:`iterator`.

source: :meth:`~re.Pattern.match` and :meth:`~re.Pattern.search` return ``None`` if no match can be found. If they're successful, a :ref:`match object <match-objects>` instance is returned, containing information about the match: where it starts and ends, the substring it matched, and more.
es_es: :meth:`~re.Pattern.match` y :meth:`~re.Pattern.search` devuelven ``None`` si no se encuentra ninguna coincidencia. Si tienen éxito, devuelven una instancia :ref:`match object <match-objects>`, que contiene información sobre la coincidencia: dónde empieza y termina, la subcadena con la que coincidió, etc.

source: This HOWTO uses the standard Python interpreter for its examples. First, run the Python interpreter, import the :mod:`re` module, and compile a RE::
es_es: Este CÓMO utiliza el intérprete estándar de Python para sus ejemplos. En primer lugar, ejecute el intérprete de Python, importe el módulo :mod:`re` y compile un archivo RE::

source: Now, you can try matching various strings against the RE ``[a-z]+``. An empty string shouldn't match at all, since ``+`` means 'one or more repetitions'. :meth:`~re.Pattern.match` should return ``None`` in this case, which will cause the interpreter to print no output. You can explicitly print the result of :meth:`!match` to make this clear. ::
es_es: Ahora, puede intentar comparar varias cadenas con el RE ``[a-z]+``. Una cadena vacía no debería coincidir en absoluto, ya que ``+`` significa 'una o más repeticiones'. :meth:`~re.Pattern.match` debería devolver ``None`` en este caso, lo que hará que el intérprete no imprima ninguna salida. Puede imprimir explícitamente el resultado de :meth:`!match` para dejar esto claro. ::

source: Now, let's try it on a string that it should match, such as ``tempo``. In this case, :meth:`~re.Pattern.match` will return a :ref:`match object <match-objects>`, so you should store the result in a variable for later use. ::
es_es: Ahora, probémoslo con una cadena que debería coincidir, como ``tempo``. En este caso, :meth:`~re.Pattern.match` devolverá un objeto :ref:`match <match-objects>`, por lo que debes almacenar el resultado en una variable para su uso posterior. ::

source: Now you can query the :ref:`match object <match-objects>` for information about the matching string. Match object instances also have several methods and attributes; the most important ones are:
es_es: Ahora puede consultar el objeto :ref:`match <match-objects>` para obtener información sobre la cadena coincidente. Las instancias del objeto Match también tienen varios métodos y atributos; los más importantes son:

source: Return the string matched by the RE
es_es: Devuelve la cadena coincidente con el RE

source: Return the starting position of the match
es_es: Devuelve la posición inicial del partido

source: Return the ending position of the match
es_es: Devuelve la posición final del partido

source: Return a tuple containing the (start, end) positions of the match
es_es: Devuelve una tupla que contiene las posiciones (inicial, final) de la coincidencia

source: Trying these methods will soon clarify their meaning::
es_es: Probar estos métodos pronto aclarará su significado::

source: :meth:`~re.Match.group` returns the substring that was matched by the RE. :meth:`~re.Match.start` and :meth:`~re.Match.end` return the starting and ending index of the match. :meth:`~re.Match.span` returns both start and end indexes in a single tuple. Since the :meth:`~re.Pattern.match` method only checks if the RE matches at the start of a string, :meth:`!start` will always be zero. However, the :meth:`~re.Pattern.search` method of patterns scans through the string, so the match may not start at zero in that case. ::
es_es: :meth:`~re.Match.group` devuelve la subcadena coincidente con la RE. :meth:`~re.Match.start` y :meth:`~re.Match.end` devuelven el índice inicial y final de la coincidencia. :meth:`~re.Match.span` devuelve los índices inicial y final en una única tupla. Dado que el método :meth:`~re.Pattern.match` sólo comprueba si la RE coincide al principio de una cadena, :meth:`!start` siempre será cero. Sin embargo, el método :meth:`~re.Pattern.search` de patrones escanea a través de la cadena, por lo que la coincidencia puede no empezar en cero en ese caso. ::

source: In actual programs, the most common style is to store the :ref:`match object <match-objects>` in a variable, and then check if it was ``None``. This usually looks like::
es_es: En los programas reales, el estilo más común es almacenar :ref:`match object <match-objects>` en una variable, y luego comprobar si se ``None``. Esto por lo general se parece a::

source: Two pattern methods return all of the matches for a pattern. :meth:`~re.Pattern.findall` returns a list of matching strings::
es_es: Dos métodos de patrón devuelven todas las coincidencias de un patrón. :meth:`~re.Pattern.findall` devuelve una lista de cadenas coincidentes::

source: The ``r`` prefix, making the literal a raw string literal, is needed in this example because escape sequences in a normal "cooked" string literal that are not recognized by Python, as opposed to regular expressions, now result in a :exc:`DeprecationWarning` and will eventually become a :exc:`SyntaxError`. See :ref:`the-backslash-plague`.
es_es: El prefijo ``r``, que convierte el literal en un literal de cadena "cocinado", es necesario en este ejemplo porque las secuencias de escape en un literal de cadena "cocinado" normal que no son reconocidas por Python, a diferencia de las expresiones regulares, ahora resultan en un :exc:`DeprecationWarning` y eventualmente se convertirán en un :exc:`SyntaxError`. Ver :ref:`the-backslash-plague`.

source: :meth:`~re.Pattern.findall` has to create the entire list before it can be returned as the result. The :meth:`~re.Pattern.finditer` method returns a sequence of :ref:`match object <match-objects>` instances as an :term:`iterator`::
es_es: :meth:`~re.Pattern.findall` tiene que crear la lista completa antes de que pueda ser devuelta como resultado. El método :meth:`~re.Pattern.finditer` devuelve una secuencia de instancias :ref:`match object <match-objects>` como un :term:`iterator`::

source: Module-Level Functions
es_es: Funciones a nivel de módulo

source: You don't have to create a pattern object and call its methods; the :mod:`re` module also provides top-level functions called :func:`~re.match`, :func:`~re.search`, :func:`~re.findall`, :func:`~re.sub`, and so forth. These functions take the same arguments as the corresponding pattern method with the RE string added as the first argument, and still return either ``None`` or a :ref:`match object <match-objects>` instance. ::
es_es: No es necesario crear un objeto patrón y llamar a sus métodos; el módulo :mod:`re` también proporciona funciones de nivel superior denominadas :func:`~re.match`, :func:`~re.search`, :func:`~re.findall`, :func:`~re.sub`, etcétera. Estas funciones toman los mismos argumentos que el método de patrón correspondiente con la cadena RE añadida como primer argumento, y siguen devolviendo ``None`` o una instancia de :ref:`objeto coincidente <match-objects>`. ::

source: Under the hood, these functions simply create a pattern object for you and call the appropriate method on it. They also store the compiled object in a cache, so future calls using the same RE won't need to parse the pattern again and again.
es_es: De forma encubierta, estas funciones simplemente crean un objeto patrón para ti y llaman al método apropiado sobre él. También almacenan el objeto compilado en una caché, para que las futuras llamadas que utilicen el mismo RE no tengan que analizar el patrón una y otra vez.

source: Should you use these module-level functions, or should you get the pattern and call its methods yourself? If you're accessing a regex within a loop, pre-compiling it will save a few function calls. Outside of loops, there's not much difference thanks to the internal cache.
es_es: ¿Se deberían utilizar estas funciones a nivel de módulo, o se deberían obtener el patrón y llamar a sus métodos uno mismo? Si se está accediendo a un regex dentro de un bucle, precompilarlo ahorrará unas cuantas llamadas a funciones. Fuera de los bucles, no hay mucha diferencia gracias a la caché interna.

source: Compilation Flags
es_es: Banderas de compilación

source: Compilation flags let you modify some aspects of how regular expressions work. Flags are available in the :mod:`re` module under two names, a long name such as :const:`IGNORECASE` and a short, one-letter form such as :const:`I`. (If you're familiar with Perl's pattern modifiers, the one-letter forms use the same letters; the short form of :const:`re.VERBOSE` is :const:`re.X`, for example.) Multiple flags can be specified by bitwise OR-ing them; ``re.I | re.M`` sets both the :const:`I` and :const:`M` flags, for example.
es_es: Los indicadores de compilación permiten modificar algunos aspectos del funcionamiento de las expresiones regulares. Los indicadores están disponibles en el módulo :mod:`re` bajo dos nombres, un nombre largo como :const:`IGNORECASE` y una forma corta de una letra como :const:`I`. (Si se está familiarizado con los modificadores de patrones de Perl, las formas de una letra utilizan las mismas letras; la forma corta de :const:`re.VERBOSE` es :const:`re.X`, por ejemplo). Se pueden especificar varias banderas combinándolas entre sí; por ejemplo, ``re.I | re.M`` activa las banderas :const:`I` y :const:`M`.

source: Here's a table of the available flags, followed by a more detailed explanation of each one.
es_es: He aquí una tabla con las banderas disponibles, seguida de una explicación más detallada de cada una.

source: Flag
es_es: Bandera

source: Meaning
es_es: Significado

source: Makes several escapes like ``\w``, ``\b``, ``\s`` and ``\d`` match only on ASCII characters with the respective property.
es_es: Hace que varios escapes como ``\w``, ``\b``, ``\s`` y ``\d`` coincidan sólo con caracteres ASCII con la propiedad respectiva.

source: Make ``.`` match any character, including newlines.
es_es: Hacer que ``.`` coincida con cualquier carácter, incluidas las nuevas líneas.

source: Do case-insensitive matches.
es_es: No distingue entre mayúsculas y minúsculas.

source: Do a locale-aware match.
es_es: Realizar una coincidencia local.

source: Multi-line matching, affecting ``^`` and ``$``.
es_es: Coincidencia multilínea, que afecta a ``^`` y ``$``.

source: :const:`VERBOSE`, :const:`X` (for 'extended')
es_es: :const:`VERBOSE`, :const:`X` (para "ampliado")

source: Enable verbose REs, which can be organized more cleanly and understandably.
es_es: Habilita las expresiones regulares REs, que pueden organizarse de forma más limpia y comprensible.

source: Perform case-insensitive matching; character class and literal strings will match letters by ignoring case. For example, ``[A-Z]`` will match lowercase letters, too. Full Unicode matching also works unless the :const:`ASCII` flag is used to disable non-ASCII matches. When the Unicode patterns ``[a-z]`` or ``[A-Z]`` are used in combination with the :const:`IGNORECASE` flag, they will match the 52 ASCII letters and 4 additional non-ASCII letters: 'İ' (U+0130, Latin capital letter I with dot above), 'ı' (U+0131, Latin small letter dotless i), 'ſ' (U+017F, Latin small letter long s) and 'K' (U+212A, Kelvin sign). ``Spam`` will match ``'Spam'``, ``'spam'``, ``'spAM'``, or ``'ſpam'`` (the latter is matched only in Unicode mode). This lowercasing doesn't take the current locale into account; it will if you also set the :const:`LOCALE` flag.
es_es: Realiza coincidencias insensibles a mayúsculas y minúsculas; la clase de caracteres y las cadenas literales coincidirán con letras ignorando mayúsculas y minúsculas. Por ejemplo, ``[A-Z]`` también coincidirá con letras minúsculas. Las coincidencias Unicode completas también funcionan a menos que se utilice el indicador :const:`ASCII` para desactivar las coincidencias no ASCII. Cuando los patrones Unicode ``[a-z]`` o ``[A-Z]`` se utilizan en combinación con la bandera :const:`IGNORECASE`, coincidirán con las 52 letras ASCII y 4 letras no ASCII adicionales: 'İ' (U+0130, letra mayúscula latina I con punto arriba), 'ı' (U+0131, letra minúscula latina i sin punto), 'ſ' (U+017F, letra minúscula latina s larga) y 'K' (U+212A, signo Kelvin). ``Spam`` coincidirá con ``'Spam'``, ``'spam'``, ``'spAM'``, o ``'ſpam'`` (esta última sólo coincide en modo Unicode). Este tipo de minúsculas no tiene en cuenta la configuración regional actual; sí lo hará si también activa el indicador :const:`LOCALE`.

source: Make ``\w``, ``\W``, ``\b``, ``\B`` and case-insensitive matching dependent on the current locale instead of the Unicode database.
es_es: Hacer que ``\w``, ``\W``, ``\b``, ``\B`` y la coincidencia entre mayúsculas y minúsculas dependan de la configuración regional actual en lugar de la base de datos Unicode.

source: Locales are a feature of the C library intended to help in writing programs that take account of language differences. For example, if you're processing encoded French text, you'd want to be able to write ``\w+`` to match words, but ``\w`` only matches the character class ``[A-Za-z]`` in bytes patterns; it won't match bytes corresponding to ``é`` or ``ç``. If your system is configured properly and a French locale is selected, certain C functions will tell the program that the byte corresponding to ``é`` should also be considered a letter. Setting the :const:`LOCALE` flag when compiling a regular expression will cause the resulting compiled object to use these C functions for ``\w``; this is slower, but also enables ``\w+`` to match French words as you'd expect. The use of this flag is discouraged in Python 3 as the locale mechanism is very unreliable, it only handles one "culture" at a time, and it only works with 8-bit locales. Unicode matching is already enabled by default in Python 3 for Unicode (str) patterns, and it is able to handle different locales/languages.
es_es: Las localizaciones son una característica de la biblioteca C pensada para ayudar a escribir programas que tengan en cuenta las diferencias lingüísticas. Por ejemplo, si está procesando texto francés codificado, querrá poder escribir ``\w+`` para que coincida con palabras, pero ``\w`` sólo coincide con la clase de caracteres ``[A-Za-z]`` en patrones de bytes; no coincidirá con bytes correspondientes a ``é`` o ``ç``. Si su sistema está configurado correctamente y se selecciona una configuración regional francesa, ciertas funciones de C indicarán al programa que el byte correspondiente a ``é`` también debe considerarse una letra. Si activa la opción :const:`LOCALE` al compilar una expresión regular, el objeto compilado resultante utilizará estas funciones de C para ``\w``; esto es más lento, pero también permite que ``\w+`` coincida con palabras francesas como cabría esperar. Se desaconseja el uso de esta opción en Python 3 ya que el mecanismo de configuración regional es muy poco fiable, sólo maneja una "cultura" a la vez, y sólo funciona con configuraciones regionales de 8 bits. La concordancia Unicode ya está activada por defecto en Python 3 para patrones Unicode (str), y es capaz de manejar diferentes configuraciones regionales/idiomas.

source: (``^`` and ``$`` haven't been explained yet; they'll be introduced in section :ref:`more-metacharacters`.)
es_es: (``^`` y ``$`` aún no se han explicado; se presentarán en la sección :ref:`more-metacharacters`.)

source: Usually ``^`` matches only at the beginning of the string, and ``$`` matches only at the end of the string and immediately before the newline (if any) at the end of the string. When this flag is specified, ``^`` matches at the beginning of the string and at the beginning of each line within the string, immediately following each newline. Similarly, the ``$`` metacharacter matches either at the end of the string and at the end of each line (immediately preceding each newline).
es_es: Normalmente ``^`` sólo coincide al principio de la cadena, y ``$`` sólo coincide al final de la cadena e inmediatamente antes de la nueva línea (si existe) al final de la cadena. Cuando se especifica esta bandera, ``^`` coincide al principio de la cadena y al principio de cada línea dentro de la cadena, inmediatamente después de cada nueva línea. Del mismo modo, el metacarácter ``$`` coincide al final de la cadena y al final de cada línea (inmediatamente antes de cada nueva línea).

source: Makes the ``'.'`` special character match any character at all, including a newline; without this flag, ``'.'`` will match anything *except* a newline.
es_es: Hace que el carácter especial ``'.'`` coincida con cualquier carácter, incluida una nueva línea; sin esta opción, ``'.'`` coincidirá con cualquier carácter *excepto* una nueva línea.

source: Make ``\w``, ``\W``, ``\b``, ``\B``, ``\s`` and ``\S`` perform ASCII-only matching instead of full Unicode matching. This is only meaningful for Unicode patterns, and is ignored for byte patterns.
es_es: Hacer que ``\w``, ``\W``, ``\b``, ``\B``, ``\s`` y ``\S`` realicen coincidencias sólo ASCII en lugar de coincidencias Unicode completas. Esto sólo tiene sentido para patrones Unicode, y se ignora para patrones de bytes.
