Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/howto/regex.po
Languages: es_es

source: This flag allows you to write regular expressions that are more readable by granting you more flexibility in how you can format them. When this flag has been specified, whitespace within the RE string is ignored, except when the whitespace is in a character class or preceded by an unescaped backslash; this lets you organize and indent the RE more clearly. This flag also lets you put comments within a RE that will be ignored by the engine; comments are marked by a ``'#'`` that's neither in a character class or preceded by an unescaped backslash.
es_es: Esta opción le permite escribir expresiones regulares más legibles, ya que le da más flexibilidad a la hora de formatearlas. Cuando se ha especificado esta opción, se ignoran los espacios en blanco dentro de la cadena RE, excepto cuando el espacio en blanco está en una clase de caracteres o precedido por una barra invertida sin ocultar; esto le permite organizar y sangrar la RE de forma más clara. Esta bandera también le permite poner comentarios dentro de un RE que serán ignorados por el motor; los comentarios están marcados por un ``'#'`` que no está ni en una clase de caracteres ni precedido por una barra invertida.

source: For example, here's a RE that uses :const:`re.VERBOSE`; see how much easier it is to read? ::
es_es: Por ejemplo, aquí tienes un RE que utiliza :const:`re.VERBOSE`; ¿ves cómo es más fácil de leer? ::

source: Without the verbose setting, the RE would look like this::
es_es: Sin la configuración verbose, el RE tendría este aspecto::

source: In the above example, Python's automatic concatenation of string literals has been used to break up the RE into smaller pieces, but it's still more difficult to understand than the version using :const:`re.VERBOSE`.
es_es: En el ejemplo anterior, se ha utilizado la concatenación automática de literales de cadena de Python para dividir el RE en trozos más pequeños, pero sigue siendo más difícil de entender que la versión que utiliza :const:`re.VERBOSE`.

source: More Pattern Power
es_es: Más potencia de patrón

source: So far we've only covered a part of the features of regular expressions. In this section, we'll cover some new metacharacters, and how to use groups to retrieve portions of the text that was matched.
es_es: Hasta ahora sólo hemos cubierto una parte de las características de las expresiones regulares. En esta sección, cubriremos algunos metacaracteres nuevos, y cómo usar grupos para recuperar porciones del texto que coincidió.

source: More Metacharacters
es_es: Más metacaracteres

source: There are some metacharacters that we haven't covered yet. Most of them will be covered in this section.
es_es: Hay algunos metacaracteres que aún no hemos tratado. La mayoría de ellos se tratarán en esta sección.

source: Some of the remaining metacharacters to be discussed are :dfn:`zero-width assertions`. They don't cause the engine to advance through the string; instead, they consume no characters at all, and simply succeed or fail. For example, ``\b`` is an assertion that the current position is located at a word boundary; the position isn't changed by the ``\b`` at all. This means that zero-width assertions should never be repeated, because if they match once at a given location, they can obviously be matched an infinite number of times.
es_es: Algunos de los metacaracteres que quedan por discutir son las aserciones :dfn:`zero-width assertions`. No hacen que el motor avance por la cadena, sino que no consumen ningún carácter y simplemente tienen éxito o fallan. Por ejemplo, ``\b`` es una afirmación de que la posición actual se encuentra en el límite de una palabra; la posición no cambia en absoluto con ``\b``. Esto significa que las aserciones de ancho cero nunca deben repetirse, porque si coinciden una vez en una posición dada, obviamente pueden coincidir un número infinito de veces.

source: Alternation, or the "or" operator. If *A* and *B* are regular expressions, ``A|B`` will match any string that matches either *A* or *B*. ``|`` has very low precedence in order to make it work reasonably when you're alternating multi-character strings. ``Crow|Servo`` will match either ``'Crow'`` or ``'Servo'``, not ``'Cro'``, a ``'w'`` or an ``'S'``, and ``'ervo'``.
es_es: Alternancia, o el operador "o". Si *A* y *B* son expresiones regulares, ``A|B`` coincidirá con cualquier cadena que coincida con *A* o *B*. ``|`` tiene una precedencia muy baja para que funcione razonablemente cuando se alternan cadenas de varios caracteres. ``Crow|Servo`` coincidirá con ``'Crow'`` o ``'Servo'``, no con ``'Cro'``, un ``'w'`` o un ``'S'``, y ``'ervo'``.

source: To match a literal ``'|'``, use ``\|``, or enclose it inside a character class, as in ``[|]``.
es_es: Para que coincida con un literal ``'|'``, utilice ``\|``, o enciérrelo dentro de una clase de caracteres, como en ``[|]``.

source: Matches at the beginning of lines. Unless the :const:`MULTILINE` flag has been set, this will only match at the beginning of the string. In :const:`MULTILINE` mode, this also matches immediately after each newline within the string.
es_es: Coincide con el principio de las líneas. A menos que se haya activado la opción :const:`MULTILINE`, sólo coincidirá con el principio de la cadena. En el modo :const:`MULTILINE`, también coincide inmediatamente después de cada nueva línea dentro de la cadena.

source: For example, if you wish to match the word ``From`` only at the beginning of a line, the RE to use is ``^From``. ::
es_es: Por ejemplo, si desea que la palabra ``From`` coincida sólo al principio de una línea, el RE que debe utilizar es ``^From``. ::

source: To match a literal ``'^'``, use ``\^``.
es_es: Para que coincida con un literal ``'^'``, utilice ``\^``.

source: Matches at the end of a line, which is defined as either the end of the string, or any location followed by a newline character. ::
es_es: Coincide con el final de una línea, que se define como el final de la cadena o cualquier posición seguida de un carácter de nueva línea. ::

source: To match a literal ``'$'``, use ``\$`` or enclose it inside a character class, as in ``[$]``.
es_es: Para que coincida con un literal ``'$'``, utilice ``\$`` o enciérrelo dentro de una clase de caracteres, como en ``[$]``.

source: Matches only at the start of the string. When not in :const:`MULTILINE` mode, ``\A`` and ``^`` are effectively the same. In :const:`MULTILINE` mode, they're different: ``\A`` still matches only at the beginning of the string, but ``^`` may match at any location inside the string that follows a newline character.
es_es: Coincide sólo con el principio de la cadena. Cuando no están en modo :const:`MULTILINE`, ``\A`` y ``^`` son iguales. En el modo :const:`MULTILINE`, son diferentes: ``\A`` sigue coincidiendo sólo al principio de la cadena, pero ``^`` puede coincidir en cualquier posición dentro de la cadena que siga a un carácter de nueva línea.

source: Matches only at the end of the string.
es_es: Coincide sólo con el final de la cadena.

source: Word boundary. This is a zero-width assertion that matches only at the beginning or end of a word. A word is defined as a sequence of alphanumeric characters, so the end of a word is indicated by whitespace or a non-alphanumeric character.
es_es: Límite de palabra. Se trata de una aserción de ancho cero que sólo coincide con el principio o el final de una palabra. Una palabra se define como una secuencia de caracteres alfanuméricos, por lo que el final de una palabra se indica mediante un espacio en blanco o un carácter no alfanumérico.

source: The following example matches ``class`` only when it's a complete word; it won't match when it's contained inside another word. ::
es_es: El siguiente ejemplo coincide con ``class`` sólo cuando es una palabra completa; no coincidirá cuando esté contenida dentro de otra palabra. ::

source: There are two subtleties you should remember when using this special sequence. First, this is the worst collision between Python's string literals and regular expression sequences. In Python's string literals, ``\b`` is the backspace character, ASCII value 8. If you're not using raw strings, then Python will convert the ``\b`` to a backspace, and your RE won't match as you expect it to. The following example looks the same as our previous RE, but omits the ``'r'`` in front of the RE string. ::
es_es: Hay dos sutilezas que debes recordar cuando uses esta secuencia especial. Primero, esta es la peor colisión entre los literales de cadena de Python y las secuencias de expresiones regulares. En los literales de cadena de Python, ``\b`` es el carácter de retroceso, valor 8 de ASCII. Si no estás usando cadenas en bruto, entonces Python convertirá ``\b`` en un retroceso, y tu RE no coincidirá como esperabas. El siguiente ejemplo tiene el mismo aspecto que nuestro RE anterior, pero omite el ``'r'`` delante de la cadena RE. ::

source: Second, inside a character class, where there's no use for this assertion, ``\b`` represents the backspace character, for compatibility with Python's string literals.
es_es: Segundo, dentro de una clase carácter, donde no hay uso para esta aserción, ``\b`` representa el carácter de retroceso, por compatibilidad con los literales de cadena de Python.

source: Another zero-width assertion, this is the opposite of ``\b``, only matching when the current position is not at a word boundary.
es_es: Otra aserción de ancho cero, es lo contrario de ``\b``, sólo coincide cuando la posición actual no está en un límite de palabra.

source: Grouping
es_es: Agrupación

source: Frequently you need to obtain more information than just whether the RE matched or not. Regular expressions are often used to dissect strings by writing a RE divided into several subgroups which match different components of interest. For example, an RFC-822 header line is divided into a header name and a value, separated by a ``':'``, like this:
es_es: Con frecuencia se necesita obtener más información que simplemente si la ER coincide o no. Las expresiones regulares se utilizan a menudo para diseccionar cadenas escribiendo una RE dividida en varios subgrupos que coinciden con diferentes componentes de interés. Por ejemplo, una línea de encabezado RFC-822 se divide en un nombre de encabezado y un valor, separados por un ``':'``, así:

source: This can be handled by writing a regular expression which matches an entire header line, and has one group which matches the header name, and another group which matches the header's value.
es_es: Esto puede solucionarse escribiendo una expresión regular que coincida con una línea de cabecera completa, y que tenga un grupo que coincida con el nombre de la cabecera, y otro grupo que coincida con el valor de la cabecera.

source: Groups indicated with ``'('``, ``')'`` also capture the starting and ending index of the text that they match; this can be retrieved by passing an argument to :meth:`~re.Match.group`, :meth:`~re.Match.start`, :meth:`~re.Match.end`, and :meth:`~re.Match.span`. Groups are numbered starting with 0. Group 0 is always present; it's the whole RE, so :ref:`match object <match-objects>` methods all have group 0 as their default argument. Later we'll see how to express groups that don't capture the span of text that they match. ::
es_es: Los grupos indicados con ``'('``, ``')'`` también capturan el índice inicial y final del texto con el que coinciden; esto se puede recuperar pasando un argumento a :meth:`~re.Match.group`, :meth:`~re.Match.start`, :meth:`~re.Match.end`, y :meth:`~re.Match.span`. Los grupos se numeran empezando por 0. El grupo 0 siempre está presente; es todo el RE, así que todos los métodos :ref:`match object <match-objects>` tienen el grupo 0 como argumento por defecto. Más adelante veremos cómo expresar grupos que no capturan el tramo de texto con el que coinciden ::

source: Subgroups are numbered from left to right, from 1 upward. Groups can be nested; to determine the number, just count the opening parenthesis characters, going from left to right. ::
es_es: Los subgrupos se numeran de izquierda a derecha, de 1 en adelante. Los grupos pueden estar anidados; para determinar el número, basta con contar los caracteres de apertura del paréntesis, de izquierda a derecha. ::

source: :meth:`~re.Match.group` can be passed multiple group numbers at a time, in which case it will return a tuple containing the corresponding values for those groups. ::
es_es: :meth:`~re.Match.group` se le pueden pasar varios números de grupo a la vez, en cuyo caso devolverá una tupla con los valores correspondientes a esos grupos. ::

source: The :meth:`~re.Match.groups` method returns a tuple containing the strings for all the subgroups, from 1 up to however many there are. ::
es_es: El método :meth:`~re.Match.groups` devuelve una tupla que contiene las cadenas de todos los subgrupos, desde 1 hasta el número que haya. ::

source: Backreferences in a pattern allow you to specify that the contents of an earlier capturing group must also be found at the current location in the string. For example, ``\1`` will succeed if the exact contents of group 1 can be found at the current position, and fails otherwise. Remember that Python's string literals also use a backslash followed by numbers to allow including arbitrary characters in a string, so be sure to use a raw string when incorporating backreferences in a RE.
es_es: Las referencias retrospectivas en un patrón permiten especificar que el contenido de un grupo de captura anterior también debe encontrarse en la posición actual de la cadena. Por ejemplo, ``\1`` tendrá éxito si el contenido exacto del grupo 1 se encuentra en la posición actual, y fallará en caso contrario. Recuerde que los literales de cadena de Python también utilizan una barra invertida seguida de números para permitir la inclusión de caracteres arbitrarios en una cadena, así que asegúrese de utilizar una cadena sin procesar cuando incorpore retro-referencias en un RE.

source: For example, the following RE detects doubled words in a string. ::
es_es: Por ejemplo, el siguiente RE detecta palabras duplicadas en una cadena ::

source: Backreferences like this aren't often useful for just searching through a string --- there are few text formats which repeat data in this way --- but you'll soon find out that they're *very* useful when performing string substitutions.
es_es: Las referencias retrospectivas de este tipo no suelen ser útiles para buscar en una cadena - hay pocos formatos de texto que repitan los datos de este modo-, pero pronto descubrirás que son *muy* útiles para realizar sustituciones de cadenas.

source: Non-capturing and Named Groups
es_es: Grupos no capturados y nombrados

source: Elaborate REs may use many groups, both to capture substrings of interest, and to group and structure the RE itself. In complex REs, it becomes difficult to keep track of the group numbers. There are two features which help with this problem. Both of them use a common syntax for regular expression extensions, so we'll look at that first.
es_es: Los RE elaborados pueden utilizar muchos grupos, tanto para capturar subcadenas de interés como para agrupar y estructurar el propio RE. En los RE complejos, resulta difícil hacer un seguimiento de los números de grupo. Hay dos funciones que ayudan a resolver este problema. Ambas usan una sintaxis común para las extensiones de expresiones regulares, así que veremos eso primero.

source: Perl 5 is well known for its powerful additions to standard regular expressions. For these new features the Perl developers couldn't choose new single-keystroke metacharacters or new special sequences beginning with ``\`` without making Perl's regular expressions confusingly different from standard REs. If they chose ``&`` as a new metacharacter, for example, old expressions would be assuming that ``&`` was a regular character and wouldn't have escaped it by writing ``\&`` or ``[&]``.
es_es: Perl 5 es bien conocido por sus potentes adiciones a las expresiones regulares estándar. Para estas nuevas características, los desarrolladores de Perl no podían elegir nuevos metacaracteres de una sola pulsación o nuevas secuencias especiales que empezaran por ``\`` sin hacer que las expresiones regulares de Perl fueran confusamente diferentes de las ER estándar. Si elegían ``&`` como nuevo metacarácter, por ejemplo, las expresiones antiguas estarían asumiendo que ``&`` era un carácter regular y no lo habrían escapado escribiendo ``\&`` o ``[&]``.

source: The solution chosen by the Perl developers was to use ``(?...)`` as the extension syntax. ``?`` immediately after a parenthesis was a syntax error because the ``?`` would have nothing to repeat, so this didn't introduce any compatibility problems. The characters immediately after the ``?`` indicate what extension is being used, so ``(?=foo)`` is one thing (a positive lookahead assertion) and ``(?:foo)`` is something else (a non-capturing group containing the subexpression ``foo``).
es_es: La solución elegida por los desarrolladores de Perl fue utilizar ``(?...)`` como sintaxis de extensión. ``?`` inmediatamente después de un paréntesis era un error de sintaxis porque ``?`` no tendría nada que repetir, así que esto no introdujo ningún problema de compatibilidad. Los caracteres que aparecen inmediatamente después de ``?`` indican qué extensión se está utilizando, de modo que ``(?=foo)`` es una cosa (una aserción lookahead positiva) y ``(?:foo)`` es otra cosa (un grupo no capturador que contiene la subexpresión ``foo``).

source: Python supports several of Perl's extensions and adds an extension syntax to Perl's extension syntax. If the first character after the question mark is a ``P``, you know that it's an extension that's specific to Python.
es_es: Python soporta varias de las extensiones de Perl y añade una sintaxis de extensión a la sintaxis de extensión de Perl. Si el primer carácter después del signo de interrogación es ``P``, sabrás que se trata de una extensión específica de Python.

source: Now that we've looked at the general extension syntax, we can return to the features that simplify working with groups in complex REs.
es_es: Ahora que hemos visto la sintaxis general de la extensión, podemos volver a las características que simplifican el trabajo con grupos en REs complejos.

source: Sometimes you'll want to use a group to denote a part of a regular expression, but aren't interested in retrieving the group's contents. You can make this fact explicit by using a non-capturing group: ``(?:...)``, where you can replace the ``...`` with any other regular expression. ::
es_es: A veces querrá utilizar un grupo para denotar una parte de una expresión regular, pero no estará interesado en recuperar el contenido del grupo. Puede hacer explícito este hecho utilizando un grupo no capturador: ``(?:...)`` donde puede sustituir ``...`` por cualquier otra expresión regular. ::

source: Except for the fact that you can't retrieve the contents of what the group matched, a non-capturing group behaves exactly the same as a capturing group; you can put anything inside it, repeat it with a repetition metacharacter such as ``*``, and nest it within other groups (capturing or non-capturing). ``(?:...)`` is particularly useful when modifying an existing pattern, since you can add new groups without changing how all the other groups are numbered. It should be mentioned that there's no performance difference in searching between capturing and non-capturing groups; neither form is any faster than the other.
es_es: Excepto por el hecho de que no se puede recuperar el contenido de lo que el grupo coincidió, un grupo de no captura se comporta exactamente igual que un grupo de captura; se puede poner cualquier cosa dentro de él, repetirlo con un metacarácter de repetición como ``*``, y anidarlo dentro de otros grupos (de captura o de no captura). ``(?:...)`` es particularmente útil cuando se modifica un patrón existente, ya que se pueden añadir nuevos grupos sin cambiar cómo se numeran todos los demás grupos. Cabe mencionar que no hay diferencia de rendimiento en la búsqueda entre grupos de captura y de no captura; ninguna de las dos formas es más rápida que la otra.

source: A more significant feature is named groups: instead of referring to them by numbers, groups can be referenced by a name.
es_es: Una característica más significativa son los grupos con nombre: en lugar de referirse a ellos por números, se puede hacer referencia a los grupos por un nombre.

source: The syntax for a named group is one of the Python-specific extensions: ``(?P<name>...)``. *name* is, obviously, the name of the group. Named groups behave exactly like capturing groups, and additionally associate a name with a group. The :ref:`match object <match-objects>` methods that deal with capturing groups all accept either integers that refer to the group by number or strings that contain the desired group's name. Named groups are still given numbers, so you can retrieve information about a group in two ways::
es_es: La sintaxis para un grupo con nombre es una de las extensiones específicas de Python: ``(?P<name>...)``. *nombre* es, obviamente, el nombre del grupo. Los grupos con nombre se comportan exactamente igual que los grupos de captura, y además asocian un nombre a un grupo. Los métodos :ref:`match object <match-objects>` que se ocupan de capturar grupos aceptan enteros que se refieren al grupo por su número o cadenas que contienen el nombre del grupo deseado. Los grupos con nombre siguen recibiendo números, por lo que se puede recuperar información sobre un grupo de dos formas::

source: Additionally, you can retrieve named groups as a dictionary with :meth:`~re.Match.groupdict`::
es_es: Además, puede recuperar grupos con nombre como diccionario con :meth:`~re.Match.groupdict`::

source: It's obviously much easier to retrieve ``m.group('zonem')``, instead of having to remember to retrieve group 9.
es_es: Obviamente, es mucho más fácil recuperar ``m.group('zonem')``, en lugar de tener que acordarse de recuperar el grupo 9.

source: The syntax for backreferences in an expression such as ``(...)\1`` refers to the number of the group. There's naturally a variant that uses the group name instead of the number. This is another Python extension: ``(?P=name)`` indicates that the contents of the group called *name* should again be matched at the current point. The regular expression for finding doubled words, ``\b(\w+)\s+\1\b`` can also be written as ``\b(?P<word>\w+)\s+(?P=word)\b``::
es_es: La sintaxis para backreferences en una expresión como ``(...)\1`` se refiere al número del grupo. Naturalmente, existe una variante que utiliza el nombre del grupo en lugar del número. Se trata de otra extensión de Python: ``(?P=name)`` indica que el contenido del grupo llamado *nombre* debe volver a coincidir en el punto actual. La expresión regular para encontrar palabras duplicadas, ``\b(\w+)\s+\1\b`` también puede escribirse como ``\b(?P<word>\w+)\s+(?P=word)\b``::

source: Lookahead Assertions
es_es: Afirmaciones anticipadas

source: Another zero-width assertion is the lookahead assertion. Lookahead assertions are available in both positive and negative form, and look like this:
es_es: Otra aserción de ancho cero es la aserción lookahead. Las aserciones lookahead están disponibles tanto en forma positiva como negativa, y tienen este aspecto:
