Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/howto/regex.po
Languages: es_es

source: Positive lookahead assertion. This succeeds if the contained regular expression, represented here by ``...``, successfully matches at the current location, and fails otherwise. But, once the contained expression has been tried, the matching engine doesn't advance at all; the rest of the pattern is tried right where the assertion started.
es_es: Afirmación de búsqueda positiva. Tiene éxito si la expresión regular contenida, representada aquí por ``...``, coincide con éxito en la ubicación actual, y falla en caso contrario. Pero, una vez que se ha probado la expresión contenida, el motor de comparación no avanza en absoluto; el resto del patrón se prueba justo donde comenzó la aserción.

source: Negative lookahead assertion. This is the opposite of the positive assertion; it succeeds if the contained expression *doesn't* match at the current position in the string.
es_es: Aserción de búsqueda negativa. Es lo contrario de la aserción positiva; tiene éxito si la expresión contenida *no* coincide en la posición actual de la cadena.

source: To make this concrete, let's look at a case where a lookahead is useful. Consider a simple pattern to match a filename and split it apart into a base name and an extension, separated by a ``.``. For example, in ``news.rc``, ``news`` is the base name, and ``rc`` is the filename's extension.
es_es: Para concretar, veamos un caso en el que un lookahead es útil. Considere un patrón simple que coincida con un nombre de archivo y lo divida en un nombre base y una extensión, separados por un ``.``. Por ejemplo, en ``news.rc``, ``news`` es el nombre base, y ``rc`` es la extensión del nombre de archivo.

source: The pattern to match this is quite simple:
es_es: El patrón para que coincida con esto es bastante simple:

source: Notice that the ``.`` needs to be treated specially because it's a metacharacter, so it's inside a character class to only match that specific character. Also notice the trailing ``$``; this is added to ensure that all the rest of the string must be included in the extension. This regular expression matches ``foo.bar`` and ``autoexec.bat`` and ``sendmail.cf`` and ``printers.conf``.
es_es: Observe que ``.`` necesita un tratamiento especial porque es un metacarácter, por lo que está dentro de una clase de caracteres para que sólo coincida con ese carácter específico. Observe también el final ``$``; se añade para garantizar que todo el resto de la cadena debe incluirse en la extensión. Esta expresión regular coincide con ``foo.bar`` y ``autoexec.bat`` y ``sendmail.cf`` y ``printers.conf``.

source: Now, consider complicating the problem a bit; what if you want to match filenames where the extension is not ``bat``? Some incorrect attempts:
es_es: Ahora, considere la posibilidad de complicar un poco el problema; ¿qué ocurre si desea buscar coincidencias con nombres de archivo cuya extensión no sea ``bat``? Algunos intentos incorrectos:

source: ``.*[.][^b].*$`` The first attempt above tries to exclude ``bat`` by requiring that the first character of the extension is not a ``b``. This is wrong, because the pattern also doesn't match ``foo.bar``.
es_es: ``.*[.][^b].*$`` El primer intento anterior intenta excluir ``bat`` exigiendo que el primer carácter de la extensión no sea ``b``. Esto es erróneo, porque el patrón tampoco coincide con ``foo.bar``.

source: The expression gets messier when you try to patch up the first solution by requiring one of the following cases to match: the first character of the extension isn't ``b``; the second character isn't ``a``; or the third character isn't ``t``. This accepts ``foo.bar`` and rejects ``autoexec.bat``, but it requires a three-letter extension and won't accept a filename with a two-letter extension such as ``sendmail.cf``. We'll complicate the pattern again in an effort to fix it.
es_es: La expresión se complica cuando se intenta corregir la primera solución exigiendo que coincida uno de los siguientes casos: que el primer carácter de la extensión no sea ``b``; que el segundo carácter no sea ``a``; o que el tercer carácter no sea ``t``. Esto acepta ``foo.bar`` y rechaza ``autoexec.bat``, pero requiere una extensión de tres letras y no aceptará un nombre de archivo con una extensión de dos letras como ``sendmail.cf``. Volveremos a complicar el patrón para intentar solucionarlo.

source: In the third attempt, the second and third letters are all made optional in order to allow matching extensions shorter than three characters, such as ``sendmail.cf``.
es_es: En el tercer intento, la segunda y tercera letras se convierten en opcionales para permitir la coincidencia de extensiones de menos de tres caracteres, como ``sendmail.cf``.

source: The pattern's getting really complicated now, which makes it hard to read and understand. Worse, if the problem changes and you want to exclude both ``bat`` and ``exe`` as extensions, the pattern would get even more complicated and confusing.
es_es: El patrón se está volviendo muy complicado ahora, lo que lo hace difícil de leer y entender. Peor aún, si el problema cambia y se quiere excluir tanto ``bat`` como ``exe`` como extensiones, el patrón se volvería aún más complicado y confuso.

source: A negative lookahead cuts through all this confusion:
es_es: Una visión de futuro negativa evita toda esta confusión:

source: ``.*[.](?!bat$)[^.]*$`` The negative lookahead means: if the expression ``bat`` doesn't match at this point, try the rest of the pattern; if ``bat$`` does match, the whole pattern will fail. The trailing ``$`` is required to ensure that something like ``sample.batch``, where the extension only starts with ``bat``, will be allowed. The ``[^.]*`` makes sure that the pattern works when there are multiple dots in the filename.
es_es: ``.*[.](?!bat$)[^.]*$`` La anticipación negativa significa: si la expresión ``bat`` no coincide en este punto, pruebe con el resto del patrón; si ``bat$`` coincide, el patrón completo fallará. El final ``$`` es necesario para asegurar que algo como ``sample.batch``, donde la extensión sólo empieza por ``bat``, sea permitido. El ``[^.]*`` asegura que el patrón funcione cuando hay varios puntos en el nombre del archivo.

source: Excluding another filename extension is now easy; simply add it as an alternative inside the assertion. The following pattern excludes filenames that end in either ``bat`` or ``exe``:
es_es: Ahora es fácil excluir otra extensión de nombre de archivo; basta con añadirla como alternativa dentro de la aserción. El siguiente patrón excluye los nombres de archivo que terminan en ``bat`` o ``exe``:

source: Modifying Strings
es_es: Modificación de cadenas

source: Up to this point, we've simply performed searches against a static string. Regular expressions are also commonly used to modify strings in various ways, using the following pattern methods:
es_es: Hasta ahora, nos hemos limitado a realizar búsquedas en una cadena estática. Las expresiones regulares también se utilizan habitualmente para modificar cadenas de varias maneras, utilizando los siguientes métodos de patrones:

source: Split the string into a list, splitting it wherever the RE matches
es_es: Divide la cadena en una lista, dividiéndola siempre que el RE coincida

source: Find all substrings where the RE matches, and replace them with a different string
es_es: Busca todas las subcadenas en las que coincida el RE y sustitúyelas por una cadena diferente

source: Does the same thing as :meth:`!sub`, but returns the new string and the number of replacements
es_es: Hace lo mismo que :meth:`!sub`, pero devuelve la nueva cadena y el número de sustituciones

source: Splitting Strings
es_es: Dividir cadenas

source: The :meth:`~re.Pattern.split` method of a pattern splits a string apart wherever the RE matches, returning a list of the pieces. It's similar to the :meth:`~str.split` method of strings but provides much more generality in the delimiters that you can split by; string :meth:`!split` only supports splitting by whitespace or by a fixed string. As you'd expect, there's a module-level :func:`re.split` function, too.
es_es: El método :meth:`~re.Pattern.split` de un patrón divide una cadena siempre que el RE coincida, devolviendo una lista de los trozos. Es similar al método :meth:`~str.split` de cadenas, pero proporciona mucha más generalidad en los delimitadores por los que se puede dividir; la cadena :meth:`!split` sólo admite la división por espacios en blanco o por una cadena fija. Como era de esperar, también existe una función :func:`re.split` a nivel de módulo.

source: Split *string* by the matches of the regular expression. If capturing parentheses are used in the RE, then their contents will also be returned as part of the resulting list. If *maxsplit* is nonzero, at most *maxsplit* splits are performed.
es_es: Dividir *cadena* por las coincidencias de la expresión regular. Si se utilizan paréntesis de captura en la RE, su contenido también se devolverá como parte de la lista resultante. Si *maxsplit* es distinto de cero, se realizarán como máximo *maxsplit* divisiones.

source: You can limit the number of splits made, by passing a value for *maxsplit*. When *maxsplit* is nonzero, at most *maxsplit* splits will be made, and the remainder of the string is returned as the final element of the list. In the following example, the delimiter is any sequence of non-alphanumeric characters. ::
es_es: Puede limitar el número de divisiones pasándole un valor a *maxsplit*. Cuando *maxsplit* es distinto de cero, se realiza un máximo de *maxsplit* divisiones, y el resto de la cadena se devuelve como elemento final de la lista. En el siguiente ejemplo, el delimitador es cualquier secuencia de caracteres no alfanuméricos. ::

source: Sometimes you're not only interested in what the text between delimiters is, but also need to know what the delimiter was. If capturing parentheses are used in the RE, then their values are also returned as part of the list. Compare the following calls::
es_es: A veces no sólo interesa saber cuál es el texto entre delimitadores, sino que también se necesita saber cuál era el delimitador. Si se utilizan paréntesis de captura en el RE, sus valores también se devuelven como parte de la lista. Comparar las siguientes llamadas::

source: The module-level function :func:`re.split` adds the RE to be used as the first argument, but is otherwise the same. ::
es_es: La función a nivel de módulo :func:`re.split` añade el RE que se utilizará como primer argumento, pero por lo demás es igual. ::

source: Search and Replace
es_es: Buscar y reemplazar

source: Another common task is to find all the matches for a pattern, and replace them with a different string. The :meth:`~re.Pattern.sub` method takes a replacement value, which can be either a string or a function, and the string to be processed.
es_es: Otra tarea común es encontrar todas las coincidencias de un patrón y sustituirlas por una cadena diferente. El método :meth:`~re.Pattern.sub` toma un valor de sustitución, que puede ser una cadena o una función, y la cadena que se va a procesar.

source: Returns the string obtained by replacing the leftmost non-overlapping occurrences of the RE in *string* by the replacement *replacement*. If the pattern isn't found, *string* is returned unchanged.
es_es: Devuelve la cadena obtenida reemplazando las ocurrencias no solapadas más a la izquierda del RE en *cadena* por el reemplazo *reemplazo*. Si no se encuentra el patrón, *cadena* se devuelve sin cambios.

source: The optional argument *count* is the maximum number of pattern occurrences to be replaced; *count* must be a non-negative integer. The default value of 0 means to replace all occurrences.
es_es: El argumento opcional *count* es el número máximo de ocurrencias del patrón a reemplazar; *count* debe ser un número entero no negativo. El valor predeterminado 0 significa que se reemplazan todas las ocurrencias.

source: Here's a simple example of using the :meth:`~re.Pattern.sub` method. It replaces colour names with the word ``colour``::
es_es: He aquí un ejemplo sencillo de utilización del método :meth:`~re.Pattern.sub`. Sustituye los nombres de los colores por la palabra ``colour``::

source: The :meth:`~re.Pattern.subn` method does the same work, but returns a 2-tuple containing the new string value and the number of replacements that were performed::
es_es: El método :meth:`~re.Pattern.subn` hace el mismo trabajo, pero devuelve una 2-tupla que contiene el nuevo valor de cadena y el número de sustituciones que se realizaron::

source: Empty matches are replaced only when they're not adjacent to a previous empty match. ::
es_es: Las coincidencias vacías sólo se sustituyen cuando no son adyacentes a una coincidencia vacía anterior. ::

source: If *replacement* is a string, any backslash escapes in it are processed. That is, ``\n`` is converted to a single newline character, ``\r`` is converted to a carriage return, and so forth. Unknown escapes such as ``\&`` are left alone. Backreferences, such as ``\6``, are replaced with the substring matched by the corresponding group in the RE. This lets you incorporate portions of the original text in the resulting replacement string.
es_es: Si *reemplazo* es una cadena, se procesa cualquier escape de barra invertida que contenga. Es decir, ``\n`` se convierte en un carácter de nueva línea, ``\r`` se convierte en un retorno de carro, y así sucesivamente. Los escapes desconocidos, como ``\&``, se dejan como están. Las referencias retrospectivas, como ``\6``, se sustituyen por la subcadena coincidente con el grupo correspondiente en el RE. Esto le permite incorporar partes del texto original en la cadena de sustitución resultante.

source: This example matches the word ``section`` followed by a string enclosed in ``{``, ``}``, and changes ``section`` to ``subsection``::
es_es: Este ejemplo coincide con la palabra ``section`` seguida de una cadena encerrada en ``{``, ``}``, y cambia ``section`` por ``subsection``::

source: There's also a syntax for referring to named groups as defined by the ``(?P<name>...)`` syntax. ``\g<name>`` will use the substring matched by the group named ``name``, and ``\g<number>`` uses the corresponding group number. ``\g<2>`` is therefore equivalent to ``\2``, but isn't ambiguous in a replacement string such as ``\g<2>0``. (``\20`` would be interpreted as a reference to group 20, not a reference to group 2 followed by the literal character ``'0'``.) The following substitutions are all equivalent, but use all three variations of the replacement string. ::
es_es: También existe una sintaxis para hacer referencia a grupos con nombre, tal como se define en la sintaxis ``(?P<name>...)``. ``\g<name>`` utilizará la subcadena coincidente con el grupo llamado ``name``, y ``\g<number>`` utiliza el número de grupo correspondiente. ``\g<2>`` es, por tanto, equivalente a ``\2``, pero no es ambigua en una cadena de sustitución como ``\g<2>0``. (``\20`` se interpretaría como una referencia al grupo 20, no como una referencia al grupo 2 seguida del carácter literal ``'0'``). Las siguientes sustituciones son todas equivalentes, pero utilizan las tres variantes de la cadena de sustitución. ::

source: *replacement* can also be a function, which gives you even more control. If *replacement* is a function, the function is called for every non-overlapping occurrence of *pattern*. On each call, the function is passed a :ref:`match object <match-objects>` argument for the match and can use this information to compute the desired replacement string and return it.
es_es: *replacement* también puede ser una función, lo que le da aún más control. Si *replacement* es una función, se llama a la función por cada ocurrencia no solapada de *pattern*. En cada llamada, a la función se le pasa un argumento :ref:`match object <match-objects>` para la coincidencia y puede usar esta información para calcular la cadena de sustitución deseada y devolverla.

source: In the following example, the replacement function translates decimals into hexadecimal::
es_es: En el siguiente ejemplo, la función de sustitución convierte los decimales en hexadecimales::

source: When using the module-level :func:`re.sub` function, the pattern is passed as the first argument. The pattern may be provided as an object or as a string; if you need to specify regular expression flags, you must either use a pattern object as the first parameter, or use embedded modifiers in the pattern string, e.g. ``sub("(?i)b+", "x", "bbbb BBBB")`` returns ``'x x'``.
es_es: Cuando se utiliza la función :func:`re.sub` a nivel de módulo, el patrón se pasa como primer argumento. El patrón puede proporcionarse como un objeto o como una cadena; si necesita especificar indicadores de expresión regular, debe utilizar un objeto de patrón como primer parámetro o utilizar modificadores incrustados en la cadena del patrón, por ejemplo, ``sub("(?i)b+", "x", "bbbb BBBB")`` devuelve ``'x x'``.

source: Common Problems
es_es: Problemas comunes

source: Regular expressions are a powerful tool for some applications, but in some ways their behaviour isn't intuitive and at times they don't behave the way you may expect them to. This section will point out some of the most common pitfalls.
es_es: Las expresiones regulares son una potente herramienta para algunas aplicaciones, pero en algunos aspectos su comportamiento no es intuitivo y a veces no se comportan como cabría esperar. En esta sección se señalan algunos de los escollos más comunes.

source: Use String Methods
es_es: Utilizar métodos de cadena

source: Sometimes using the :mod:`re` module is a mistake. If you're matching a fixed string, or a single character class, and you're not using any :mod:`re` features such as the :const:`~re.IGNORECASE` flag, then the full power of regular expressions may not be required. Strings have several methods for performing operations with fixed strings and they're usually much faster, because the implementation is a single small C loop that's been optimized for the purpose, instead of the large, more generalized regular expression engine.
es_es: A veces, utilizar el módulo :mod:`re` es un error. Si estás comparando una cadena fija, o una clase de carácter único, y no estás usando ninguna característica de :mod:`re` como la bandera :const:`~re.IGNORECASE`, entonces puede que no sea necesaria toda la potencia de las expresiones regulares. Las cadenas tienen varios métodos para realizar operaciones con cadenas fijas y normalmente son mucho más rápidas, porque la implementación es un único pequeño bucle en C que ha sido optimizado para el propósito, en lugar del gran y más generalizado motor de expresiones regulares.

source: One example might be replacing a single fixed string with another one; for example, you might replace ``word`` with ``deed``. :func:`re.sub` seems like the function to use for this, but consider the :meth:`~str.replace` method. Note that :meth:`!replace` will also replace ``word`` inside words, turning ``swordfish`` into ``sdeedfish``, but the naive RE ``word`` would have done that, too. (To avoid performing the substitution on parts of words, the pattern would have to be ``\bword\b``, in order to require that ``word`` have a word boundary on either side. This takes the job beyond :meth:`!replace`'s abilities.)
es_es: Un ejemplo podría ser reemplazar una cadena fija por otra; por ejemplo, podría reemplazar ``word`` por ``deed``. :func:`re.sub` parece la función a utilizar para esto, pero considere el método :meth:`~str.replace`. Tenga en cuenta que :meth:`!replace` también sustituirá ``word`` dentro de las palabras, convirtiendo ``swordfish`` en ``sdeedfish``, pero el ingenuo RE ``word`` también lo habría hecho. (Para evitar realizar la sustitución en partes de palabras, el patrón tendría que ser ``\bword\b``, para requerir que ``word`` tenga un límite de palabra a cada lado. Esto lleva el trabajo más allá de las capacidades de :meth:`!replace`).

source: Another common task is deleting every occurrence of a single character from a string or replacing it with another single character. You might do this with something like ``re.sub('\n', ' ', S)``, but :meth:`~str.translate` is capable of doing both tasks and will be faster than any regular expression operation can be.
es_es: Otra tarea común es borrar cada ocurrencia de un único carácter de una cadena o reemplazarlo por otro único carácter. Puede hacer esto con algo como ``re.sub('\n', ' ', S)``, pero :meth:`~str.translate` es capaz de hacer ambas tareas y será más rápido que cualquier operación de expresión regular.

source: In short, before turning to the :mod:`re` module, consider whether your problem can be solved with a faster and simpler string method.
es_es: En resumen, antes de recurrir al módulo :mod:`re`, considere si su problema puede resolverse con un método de cadenas más rápido y sencillo.

source: The :func:`~re.match` function only checks if the RE matches at the beginning of the string while :func:`~re.search` will scan forward through the string for a match. It's important to keep this distinction in mind. Remember, :func:`!match` will only report a successful match which will start at 0; if the match wouldn't start at zero, :func:`!match` will *not* report it. ::
es_es: La función :func:`~re.match` sólo comprueba si el RE coincide al principio de la cadena, mientras que :func:`~re.search` escaneará la cadena hacia delante en busca de una coincidencia. Es importante tener en cuenta esta distinción. Recuerde, :func:`!match` sólo reportará una coincidencia exitosa que comenzará en 0; si la coincidencia no comenzara en cero, :func:`!match` *no* la reportará. ::

source: On the other hand, :func:`~re.search` will scan forward through the string, reporting the first match it finds. ::
es_es: Por otro lado, :func:`~re.search` escaneará hacia delante a través de la cadena, informando de la primera coincidencia que encuentre. ::

source: Sometimes you'll be tempted to keep using :func:`re.match`, and just add ``.*`` to the front of your RE. Resist this temptation and use :func:`re.search` instead. The regular expression compiler does some analysis of REs in order to speed up the process of looking for a match. One such analysis figures out what the first character of a match must be; for example, a pattern starting with ``Crow`` must match starting with a ``'C'``. The analysis lets the engine quickly scan through the string looking for the starting character, only trying the full match if a ``'C'`` is found.
es_es: A veces tendrás la tentación de seguir utilizando :func:`re.match`, y añadir simplemente ``.*`` al principio de tu RE. Resista esta tentación y use :func:`re.search` en su lugar. El compilador de expresiones regulares realiza algunos análisis de las ER para acelerar el proceso de búsqueda de coincidencias. Uno de estos análisis calcula cuál debe ser el primer carácter de una coincidencia; por ejemplo, un patrón que empiece por ``Crow`` debe coincidir a partir de ``'C'``. El análisis permite al motor escanear rápidamente la cadena en busca del carácter inicial, intentando la coincidencia completa sólo si se encuentra un ``'C'``.

source: Adding ``.*`` defeats this optimization, requiring scanning to the end of the string and then backtracking to find a match for the rest of the RE. Use :func:`re.search` instead.
es_es: Si se añade ``.*``, se pierde esta optimización, ya que es necesario escanear hasta el final de la cadena y luego retroceder para encontrar una coincidencia para el resto de la RE. Utilice :func:`re.search` en su lugar.

source: Greedy versus Non-Greedy
es_es: Codicioso frente a no codicioso
