Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/howto/sorting.po
Languages: es_es, ru

source: Sorting Techniques
ru: Методы сортировки

source: Author
es_es: Autor
ru: Автор

source: Andrew Dalke and Raymond Hettinger
es_es: Andrew Dalke y Raymond Hettinger
ru: Эндрю Далк и Рэймонд Хеттингер

source: Python lists have a built-in :meth:`list.sort` method that modifies the list in-place. There is also a :func:`sorted` built-in function that builds a new sorted list from an iterable.
es_es: Las listas de Python tienen un método incorporado :meth:`list.sort` que modifica la lista in situ. También hay una función incorporada :func:`sorted` que construye una nueva lista ordenada a partir de un iterable.
ru: Списки Python имеют встроенный метод :meth:`list.sort`, который изменяет список на месте. Существует также встроенная функция :func:`sorted`, которая создает новый отсортированный список из итерируемого объекта.

source: In this document, we explore the various techniques for sorting data using Python.
es_es: En este documento, exploramos las distintas técnicas para ordenar datos utilizando Python.
ru: В этом документе мы исследуем различные методы сортировки данных с использованием Python.

source: Sorting Basics
es_es: Clasificación básica
ru: Основы сортировки

source: A simple ascending sort is very easy: just call the :func:`sorted` function. It returns a new sorted list:
es_es: Una ordenación ascendente sencilla es muy fácil: basta con llamar a la función :func:`sorted`. Devuelve una nueva lista ordenada:
ru: Простая сортировка по возрастанию очень проста: просто вызовите функцию :func:`sorted`. Он возвращает новый отсортированный список:

source: You can also use the :meth:`list.sort` method. It modifies the list in-place (and returns ``None`` to avoid confusion). Usually it's less convenient than :func:`sorted` - but if you don't need the original list, it's slightly more efficient.
es_es: También puede utilizar el método :meth:`list.sort`. Modifica la lista in situ (y devuelve ``None`` para evitar confusiones). Normalmente es menos conveniente que :func:`sorted` - pero si no necesitas la lista original, es ligeramente más eficiente.
ru: Вы также можете использовать метод :meth:`list.sort`. Он изменяет список на месте (и возвращает None, чтобы избежать путаницы). Обычно это менее удобно, чем :func:`sorted`, но если вам не нужен исходный список, это немного более эффективно.

source: Another difference is that the :meth:`list.sort` method is only defined for lists. In contrast, the :func:`sorted` function accepts any iterable.
es_es: Otra diferencia es que el método :meth:`list.sort` sólo está definido para listas. En cambio, la función :func:`sorted` acepta cualquier iterable.
ru: Другое отличие состоит в том, что метод :meth:`list.sort` определен только для списков. Напротив, функция :func:`sorted` принимает любую итерацию.

source: Key Functions
es_es: Funciones clave
ru: Ключевые функции

source: Both :meth:`list.sort` and :func:`sorted` have a *key* parameter to specify a function (or other callable) to be called on each list element prior to making comparisons.
es_es: Tanto :meth:`list.sort` como :func:`sorted` tienen un parámetro *key* para especificar una función (u otra llamada) a la que llamar en cada elemento de la lista antes de realizar las comparaciones.
ru: И :meth:`list.sort`, и :func:`sorted` имеют параметр *key* для указания функции (или другого вызываемого объекта), которая будет вызываться для каждого элемента списка перед выполнением сравнения.

source: For example, here's a case-insensitive string comparison:
es_es: Por ejemplo, he aquí una comparación de cadenas que no distingue entre mayúsculas y minúsculas:
ru: Например, вот сравнение строк без учета регистра:

source: The value of the *key* parameter should be a function (or other callable) that takes a single argument and returns a key to use for sorting purposes. This technique is fast because the key function is called exactly once for each input record.
es_es: El valor del parámetro *key* debe ser una función (u otra llamada) que tome un único argumento y devuelva una clave que se utilizará para clasificar. Esta técnica es rápida porque la función clave se llama exactamente una vez por cada registro de entrada.
ru: Значением параметра *key* должна быть функция (или другая вызываемая функция), которая принимает один аргумент и возвращает ключ для использования в целях сортировки. Этот метод быстрый, поскольку ключевая функция вызывается ровно один раз для каждой входной записи.

source: A common pattern is to sort complex objects using some of the object's indices as keys. For example:
es_es: Un patrón común es ordenar objetos complejos utilizando algunos de los índices del objeto como claves. Por ejemplo:
ru: Распространенным шаблоном является сортировка сложных объектов с использованием некоторых индексов объекта в качестве ключей. Например:

source: The same technique works for objects with named attributes. For example:
es_es: La misma técnica funciona para objetos con atributos con nombre. Por ejemplo:
ru: Тот же метод работает для объектов с именованными атрибутами. Например:

source: Objects with named attributes can be made by a regular class as shown above, or they can be instances of :class:`~dataclasses.dataclass` or a :term:`named tuple`.
ru: Объекты с именованными атрибутами могут быть созданы обычным классом, как показано выше, или они могут быть экземплярами :class:`~dataclasses.dataclass` или :term:`named tuple`.

source: Operator Module Functions and Partial Function Evaluation
ru: Функции операторского модуля и частичная оценка функций

source: The :term:`key function` patterns shown above are very common, so Python provides convenience functions to make accessor functions easier and faster. The :mod:`operator` module has :func:`~operator.itemgetter`, :func:`~operator.attrgetter`, and a :func:`~operator.methodcaller` function.
ru: Показанные выше шаблоны :term:`key function` очень распространены, поэтому Python предоставляет удобные функции, упрощающие и ускоряющие функции доступа. Модуль :mod:`operator` имеет :func:`~operator.itemgetter`, :func:`~operator.attrgetter` и функцию :func:`~operator.methodcaller`.

source: Using those functions, the above examples become simpler and faster:
es_es: Utilizando esas funciones, los ejemplos anteriores resultan más sencillos y rápidos:
ru: Используя эти функции, приведенные выше примеры становятся проще и быстрее:

source: The operator module functions allow multiple levels of sorting. For example, to sort by *grade* then by *age*:
es_es: Las funciones del módulo operador permiten varios niveles de ordenación. Por ejemplo, para ordenar por *grado* y luego por *edad*:
ru: Функции модуля оператора допускают несколько уровней сортировки. Например, чтобы отсортировать по *оценке*, а затем по *возрасту*:

source: The :mod:`functools` module provides another helpful tool for making key-functions. The :func:`~functools.partial` function can reduce the `arity <https://en.wikipedia.org/wiki/Arity>`_ of a multi-argument function making it suitable for use as a key-function.
ru: Модуль :mod:`functools` предоставляет еще один полезный инструмент для создания ключевых функций. Функция :func:`~functools.partial` может уменьшить `арность <https://en.wikipedia.org/wiki/Arity>`_ функции с несколькими аргументами, что делает ее подходящей для использования в качестве ключевой функции.

source: Ascending and Descending
es_es: Ascenso y descenso
ru: Восходящий и нисходящий

source: Both :meth:`list.sort` and :func:`sorted` accept a *reverse* parameter with a boolean value. This is used to flag descending sorts. For example, to get the student data in reverse *age* order:
es_es: Tanto :meth:`list.sort` como :func:`sorted` aceptan un parámetro *reverse* con un valor booleano. Se utiliza para marcar ordenaciones descendentes. Por ejemplo, para obtener los datos de los estudiantes en orden *antiguo* inverso:
ru: Оба :meth:`list.sort` и :func:`sorted` принимают параметр *reverse* с логическим значением. Это используется для обозначения нисходящей сортировки. Например, чтобы получить данные об учащихся в обратном *возрастном* порядке:

source: Sort Stability and Complex Sorts
es_es: Estabilidad de la clasificación y clasificaciones complejas
ru: Стабильность сортировки и комплексные сортировки

source: Sorts are guaranteed to be `stable <https://en.wikipedia.org/wiki/Sorting_algorithm#Stability>`_\. That means that when multiple records have the same key, their original order is preserved.
es_es: Se garantiza que las ordenaciones son `estables <https://en.wikipedia.org/wiki/Sorting_algorithm#Stability>`_\ . Esto significa que cuando varios registros tienen la misma clave, se conserva su orden original.
ru: Сортировки гарантированно `стабильны <https://en.wikipedia.org/wiki/Sorting_algorithm#Stability>`_\. Это означает, что если несколько записей имеют один и тот же ключ, их первоначальный порядок сохраняется.

source: Notice how the two records for *blue* retain their original order so that ``('blue', 1)`` is guaranteed to precede ``('blue', 2)``.
es_es: Observe cómo los dos registros de *azul* conservan su orden original, de modo que se garantiza que ``('blue', 1)`` precede a ``('blue', 2)``.
ru: Обратите внимание, что две записи для *blue* сохраняют свой первоначальный порядок, так что ``('blue', 1)`` гарантированно предшествует ``('blue', 2)``.

source: This wonderful property lets you build complex sorts in a series of sorting steps. For example, to sort the student data by descending *grade* and then ascending *age*, do the *age* sort first and then sort again using *grade*:
es_es: Esta maravillosa propiedad le permite construir ordenaciones complejas en una serie de pasos de ordenación. Por ejemplo, para ordenar los datos de los alumnos por *grado* descendente y *edad* ascendente, realice primero la ordenación por *edad* y, a continuación, vuelva a realizar la ordenación por *grado*:
ru: Это замечательное свойство позволяет создавать сложные сортировки за несколько этапов сортировки. Например, чтобы отсортировать данные об учащихся по убыванию *оценки*, а затем по возрастанию *возраста*, сначала выполните сортировку *возраст*, а затем повторите сортировку, используя *оценку*:

source: This can be abstracted out into a wrapper function that can take a list and tuples of field and order to sort them on multiple passes.
es_es: Esto se puede abstraer en una función de envoltura que puede tomar una lista y tuplas de campo y orden para ordenarlos en múltiples pasadas.
ru: Это можно абстрагировать в функцию-оболочку, которая может принимать список и кортежи полей и сортировать их за несколько проходов.

source: The `Timsort <https://en.wikipedia.org/wiki/Timsort>`_ algorithm used in Python does multiple sorts efficiently because it can take advantage of any ordering already present in a dataset.
es_es: El algoritmo `Timsort <https://en.wikipedia.org/wiki/Timsort>`_ utilizado en Python realiza ordenaciones múltiples de forma eficiente porque puede aprovechar cualquier ordenación ya presente en un conjunto de datos.
ru: Алгоритм Timsort <https://en.wikipedia.org/wiki/Timsort>`_, используемый в Python, эффективно выполняет несколько сортировок, поскольку он может использовать преимущества любого порядка, уже присутствующего в наборе данных.

source: Decorate-Sort-Undecorate
ru: Украсить-Сортировать-Украсить

source: This idiom is called Decorate-Sort-Undecorate after its three steps:
es_es: Esta expresión se denomina "decorar-aburrir-deshacer" por sus tres pasos:
ru: Эта идиома называется «Украсить-Сортировать-Украсить» после трех этапов:

source: First, the initial list is decorated with new values that control the sort order.
es_es: En primer lugar, la lista inicial se decora con nuevos valores que controlan el orden de clasificación.
ru: Сначала исходный список дополняется новыми значениями, управляющими порядком сортировки.

source: Second, the decorated list is sorted.
es_es: En segundo lugar, se ordena la lista decorada.
ru: Во-вторых, декорированный список сортируется.

source: Finally, the decorations are removed, creating a list that contains only the initial values in the new order.
es_es: Por último, se eliminan los adornos, creando una lista que sólo contiene los valores iniciales en el nuevo orden.
ru: Наконец, украшения удаляются, создавая список, содержащий только начальные значения в новом порядке.

source: For example, to sort the student data by *grade* using the DSU approach:
es_es: Por ejemplo, para ordenar los datos de los alumnos por *grado* utilizando el enfoque DSU:
ru: Например, чтобы отсортировать данные учащихся по *оценкам*, используя подход DSU:

source: This idiom works because tuples are compared lexicographically; the first items are compared; if they are the same then the second items are compared, and so on.
es_es: Este lenguaje funciona porque las tuplas se comparan lexicográficamente; se comparan los primeros elementos; si son iguales, se comparan los segundos, y así sucesivamente.
ru: Эта идиома работает, поскольку кортежи сравниваются лексикографически; сравниваются первые элементы; если они одинаковы, сравниваются вторые элементы и так далее.

source: It is not strictly necessary in all cases to include the index *i* in the decorated list, but including it gives two benefits:
es_es: No es estrictamente necesario en todos los casos incluir el índice *i* en la lista decorada, pero incluirlo aporta dos ventajas:
ru: Не во всех случаях обязательно включать индекс *i* в декорируемый список, но его включение дает два преимущества:

source: The sort is stable -- if two items have the same key, their order will be preserved in the sorted list.
es_es: La ordenación es estable: si dos elementos tienen la misma clave, su orden se mantendrá en la lista ordenada.
ru: Сортировка стабильна — если два элемента имеют одинаковый ключ, их порядок в отсортированном списке сохранится.

source: The original items do not have to be comparable because the ordering of the decorated tuples will be determined by at most the first two items. So for example the original list could contain complex numbers which cannot be sorted directly.
es_es: Los elementos originales no tienen por qué ser comparables, ya que la ordenación de las tuplas decoradas vendrá determinada como máximo por los dos primeros elementos. Así, por ejemplo, la lista original podría contener números complejos que no pueden ordenarse directamente.
ru: Исходные элементы не обязательно должны быть сопоставимыми, поскольку порядок декорированных кортежей будет определяться не более чем первыми двумя элементами. Например, исходный список может содержать комплексные числа, которые нельзя отсортировать напрямую.

source: Another name for this idiom is `Schwartzian transform <https://en.wikipedia.org/wiki/Schwartzian_transform>`_\, after Randal L. Schwartz, who popularized it among Perl programmers.
es_es: Otro nombre para este lenguaje es `Schwartzian transform <https://en.wikipedia.org/wiki/Schwartzian_transform>`_\, en honor a Randal L. Schwartz, quien lo popularizó entre los programadores de Perl.
ru: Другое название этой идиомы — `преобразование Шварца <https://en.wikipedia.org/wiki/Schwartzian_transform>`_\, в честь Рэндала Л. Шварца, который популяризировал ее среди программистов Perl.

source: Now that Python sorting provides key-functions, this technique is not often needed.
es_es: Ahora que la ordenación en Python proporciona funciones clave, esta técnica no suele ser necesaria.
ru: Теперь, когда сортировка Python предоставляет ключевые функции, этот метод требуется нечасто.

source: Comparison Functions
ru: Функции сравнения

source: Unlike key functions that return an absolute value for sorting, a comparison function computes the relative ordering for two inputs.
ru: В отличие от ключевых функций, которые возвращают абсолютное значение для сортировки, функция сравнения вычисляет относительный порядок для двух входных данных.

source: For example, a `balance scale <https://upload.wikimedia.org/wikipedia/commons/1/17/Balance_à_tabac_1850.JPG>`_ compares two samples giving a relative ordering: lighter, equal, or heavier. Likewise, a comparison function such as ``cmp(a, b)`` will return a negative value for less-than, zero if the inputs are equal, or a positive value for greater-than.
ru: Например, `шкала баланса <https://upload.wikimedia.org/wikipedia/commons/1/17/Balance_à_tabac_1850.JPG>`_ сравнивает два образца, давая относительный порядок: легче, равно или тяжелее. Аналогично, функция сравнения, такая как ``cmp(a, b)``, вернет отрицательное значение для меньшего, ноль, если входные данные равны, или положительное значение для большего.

source: It is common to encounter comparison functions when translating algorithms from other languages. Also, some libraries provide comparison functions as part of their API. For example, :func:`locale.strcoll` is a comparison function.
ru: Функции сравнения часто встречаются при переводе алгоритмов с других языков. Кроме того, некоторые библиотеки предоставляют функции сравнения как часть своего API. Например, :func:`locale.strcoll` — это функция сравнения.

source: To accommodate those situations, Python provides :class:`functools.cmp_to_key` to wrap the comparison function to make it usable as a key function::
ru: Чтобы учесть такие ситуации, Python предоставляет :class:`functools.cmp_to_key` для обертывания функции сравнения, чтобы ее можно было использовать в качестве ключевой функции:

source: For locale aware sorting, use :func:`locale.strxfrm` for a key function or :func:`locale.strcoll` for a comparison function. This is necessary because "alphabetical" sort orderings can vary across cultures even if the underlying alphabet is the same.
ru: Для сортировки с учетом локали используйте :func:`locale.strxfrm` для ключевой функции или :func:`locale.strcoll` для функции сравнения. Это необходимо, поскольку «алфавитный» порядок сортировки может различаться в зависимости от культуры, даже если базовый алфавит один и тот же.

source: The *reverse* parameter still maintains sort stability (so that records with equal keys retain the original order). Interestingly, that effect can be simulated without the parameter by using the builtin :func:`reversed` function twice:
es_es: El parámetro *reverse* sigue manteniendo la estabilidad de la ordenación (de modo que los registros con claves iguales conservan el orden original). Curiosamente, ese efecto puede simularse sin el parámetro utilizando dos veces la función integrada :func:`reversed`:
ru: Параметр *reverse* по-прежнему сохраняет стабильность сортировки (так что записи с одинаковыми ключами сохраняют первоначальный порядок). Интересно, что этот эффект можно смоделировать без параметра, дважды используя встроенную функцию :func:`reversed`:

source: The sort routines use ``<`` when making comparisons between two objects. So, it is easy to add a standard sort order to a class by defining an :meth:`~object.__lt__` method:
ru: Подпрограммы сортировки используют ``<`` при сравнении двух объектов. Таким образом, в класс легко добавить стандартный порядок сортировки, определив метод :meth:`~object.__lt__`:

source: However, note that ``<`` can fall back to using :meth:`~object.__gt__` if :meth:`~object.__lt__` is not implemented (see :func:`object.__lt__` for details on the mechanics). To avoid surprises, :pep:`8` recommends that all six comparison methods be implemented. The :func:`~functools.total_ordering` decorator is provided to make that task easier.
ru: Однако обратите внимание, что ``<`` может вернуться к использованию :meth:`~object.__gt__`, если :meth:`~object.__lt__` не реализован (см. :func:`object.__lt__` для получения подробной информации о механика). Чтобы избежать сюрпризов, :pep:`8` рекомендует реализовать все шесть методов сравнения. Декоратор :func:`~functools.total_ordering` предназначен для облегчения этой задачи.

source: Key functions need not depend directly on the objects being sorted. A key function can also access external resources. For instance, if the student grades are stored in a dictionary, they can be used to sort a separate list of student names:
es_es: Las funciones clave no tienen por qué depender directamente de los objetos que se clasifican. Una función clave también puede acceder a recursos externos. Por ejemplo, si las calificaciones de los alumnos se almacenan en un diccionario, pueden utilizarse para ordenar una lista independiente de nombres de alumnos:
ru: Ключевые функции не обязательно должны напрямую зависеть от сортируемых объектов. Ключевая функция также может получить доступ к внешним ресурсам. Например, если оценки учащихся хранятся в словаре, их можно использовать для сортировки отдельного списка имен учащихся:

source: Partial Sorts
ru: Частичные сортировки

source: Some applications require only some of the data to be ordered. The standard library provides several tools that do less work than a full sort:
ru: Некоторым приложениям требуется упорядочить только часть данных. Стандартная библиотека предоставляет несколько инструментов, которые выполняют меньше работы, чем полная сортировка:

source: :func:`min` and :func:`max` return the smallest and largest values, respectively. These functions make a single pass over the input data and require almost no auxiliary memory.
ru: :func:`min` и :func:`max` возвращают наименьшее и наибольшее значения соответственно. Эти функции выполняют один проход по входным данным и практически не требуют дополнительной памяти.

source: :func:`heapq.nsmallest` and :func:`heapq.nlargest` return the *n* smallest and largest values, respectively. These functions make a single pass over the data keeping only *n* elements in memory at a time. For values of *n* that are small relative to the number of inputs, these functions make far fewer comparisons than a full sort.
ru: :func:`heapq.nsmallest` и :func:`heapq.nlargest` возвращают *n* наименьшее и наибольшее значения соответственно. Эти функции выполняют один проход по данным, сохраняя в памяти одновременно только *n* элементов. Для значений *n*, которые малы по сравнению с количеством входных данных, эти функции выполняют гораздо меньше сравнений, чем полная сортировка.

source: :func:`heapq.heappush` and :func:`heapq.heappop` create and maintain a partially sorted arrangement of data that keeps the smallest element at position ``0``. These functions are suitable for implementing priority queues which are commonly used for task scheduling.
ru: :func:`heapq.heappush` и :func:`heapq.heappop` создают и поддерживают частично отсортированную структуру данных, которая сохраняет наименьший элемент в позиции ``0``. Эти функции подходят для реализации очередей с приоритетами, которые обычно используются для планирования задач.

source: Release
es_es: Publique
