Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/howto/unicode.po
Languages: ru

source: Unicode HOWTO
ru: Руководство по Юникоду

source: Release
ru: Релиз

source: This HOWTO discusses Python's support for the Unicode specification for representing textual data, and explains various problems that people commonly encounter when trying to work with Unicode.
ru: В этом HOWTO обсуждается поддержка Python спецификации Unicode для представления текстовых данных и объясняются различные проблемы, с которыми люди обычно сталкиваются при попытке работать с Unicode.

source: Introduction to Unicode
ru: Введение в Юникод

source: Definitions
ru: Определения

source: Today's programs need to be able to handle a wide variety of characters. Applications are often internationalized to display messages and output in a variety of user-selectable languages; the same program might need to output an error message in English, French, Japanese, Hebrew, or Russian. Web content can be written in any of these languages and can also include a variety of emoji symbols. Python's string type uses the Unicode Standard for representing characters, which lets Python programs work with all these different possible characters.
ru: Сегодняшние программы должны иметь возможность обрабатывать самые разнообразные символы. Приложения часто интернационализируются для отображения сообщений и вывода на различных языках, выбираемых пользователем; одной и той же программе может потребоваться вывести сообщение об ошибке на английском, французском, японском, иврите или русском языке. Веб-контент может быть написан на любом из этих языков, а также может включать в себя различные символы эмодзи. Строковый тип Python использует стандарт Unicode для представления символов, что позволяет программам Python работать со всеми этими различными возможными символами.

source: Unicode (https://www.unicode.org/) is a specification that aims to list every character used by human languages and give each character its own unique code. The Unicode specifications are continually revised and updated to add new languages and symbols.
ru: Unicode (https://www.unicode.org/) — это спецификация, целью которой является перечисление всех символов, используемых человеческими языками, и присвоение каждому символу собственного уникального кода. Спецификации Unicode постоянно пересматриваются и обновляются с добавлением новых языков и символов.

source: A **character** is the smallest possible component of a text. 'A', 'B', 'C', etc., are all different characters. So are 'È' and 'Í'. Characters vary depending on the language or context you're talking about. For example, there's a character for "Roman Numeral One", 'Ⅰ', that's separate from the uppercase letter 'I'. They'll usually look the same, but these are two different characters that have different meanings.
ru: **Символ** – это наименьший возможный компонент текста. «А», «Б», «С» и т. д. — это разные символы. То же самое относится и к «È» и «Í». Символы различаются в зависимости от языка или контекста, о котором вы говорите. Например, есть символ «римской цифры один», «Ⅰ», который отделен от заглавной буквы «I». Обычно они выглядят одинаково, но это два разных символа, имеющих разное значение.

source: The Unicode standard describes how characters are represented by **code points**. A code point value is an integer in the range 0 to 0x10FFFF (about 1.1 million values, the `actual number assigned <https://www.unicode.org/versions/latest/#Summary>`_ is less than that). In the standard and in this document, a code point is written using the notation ``U+265E`` to mean the character with value ``0x265e`` (9,822 in decimal).
ru: Стандарт Unicode описывает, как символы представляются **кодовыми точками**. Значение кодовой точки представляет собой целое число в диапазоне от 0 до 0x10FFFF (около 1,1 миллиона значений, `фактическое назначенное число <https://www.unicode.org/versions/latest/#Summary>`_ меньше этого). В стандарте и в этом документе кодовая точка записывается с использованием обозначения U+265E, обозначая символ со значением 0x265e (9822 в десятичном формате).

source: The Unicode standard contains a lot of tables listing characters and their corresponding code points:
ru: Стандарт Unicode содержит множество таблиц, в которых перечислены символы и соответствующие им кодовые точки:

source: Strictly, these definitions imply that it's meaningless to say 'this is character ``U+265E``'. ``U+265E`` is a code point, which represents some particular character; in this case, it represents the character 'BLACK CHESS KNIGHT', '♞'. In informal contexts, this distinction between code points and characters will sometimes be forgotten.
ru: Строго говоря, эти определения подразумевают, что бессмысленно говорить: «Это символ ``U+265E``'. ``U+265E`` — это кодовая точка, которая представляет определенный символ; в данном случае он представляет собой символ «ЧЕРНЫЙ ШАХМАТНЫЙ РЫЦАРЬ», «♞». В неформальном контексте это различие между кодовыми точками и символами иногда забывается.

source: A character is represented on a screen or on paper by a set of graphical elements that's called a **glyph**. The glyph for an uppercase A, for example, is two diagonal strokes and a horizontal stroke, though the exact details will depend on the font being used. Most Python code doesn't need to worry about glyphs; figuring out the correct glyph to display is generally the job of a GUI toolkit or a terminal's font renderer.
ru: Символ представлен на экране или на бумаге набором графических элементов, называемых **глифами**. Например, глиф для заглавной буквы A состоит из двух диагональных штрихов и горизонтального штриха, хотя точные детали будут зависеть от используемого шрифта. Большинству кода Python не нужно беспокоиться о глифах; Определение правильного глифа для отображения обычно является задачей набора инструментов графического интерфейса или средства визуализации шрифтов терминала.

source: Encodings
ru: Кодирование

source: To summarize the previous section: a Unicode string is a sequence of code points, which are numbers from 0 through ``0x10FFFF`` (1,114,111 decimal). This sequence of code points needs to be represented in memory as a set of **code units**, and **code units** are then mapped to 8-bit bytes. The rules for translating a Unicode string into a sequence of bytes are called a **character encoding**, or just an **encoding**.
ru: Подводя итог предыдущему разделу: строка Unicode представляет собой последовательность кодовых точек, представляющих собой числа от 0 до 0x10FFFF (1 114 111 десятичных чисел). Эта последовательность кодовых точек должна быть представлена ​​в памяти как набор **кодовых единиц**, а **кодовые единицы** затем отображаются в 8-битные байты. Правила преобразования строки Юникода в последовательность байтов называются **кодировкой символов** или просто **кодировкой**.

source: The first encoding you might think of is using 32-bit integers as the code unit, and then using the CPU's representation of 32-bit integers. In this representation, the string "Python" might look like this:
ru: Первая кодировка, о которой вы можете подумать, — это использование 32-битных целых чисел в качестве единицы кода, а затем использование представления 32-битных целых чисел процессором. В этом представлении строка «Python» может выглядеть так:

source: This representation is straightforward but using it presents a number of problems.
ru: Это представление простое, но его использование сопряжено с рядом проблем.

source: It's not portable; different processors order the bytes differently.
ru: Это не портативно; разные процессоры упорядочивают байты по-разному.

source: It's very wasteful of space. In most texts, the majority of the code points are less than 127, or less than 255, so a lot of space is occupied by ``0x00`` bytes. The above string takes 24 bytes compared to the 6 bytes needed for an ASCII representation. Increased RAM usage doesn't matter too much (desktop computers have gigabytes of RAM, and strings aren't usually that large), but expanding our usage of disk and network bandwidth by a factor of 4 is intolerable.
ru: Это очень расточительно занимает пространство. В большинстве текстов большинство кодовых точек меньше 127 или меньше 255, поэтому много места занимают байты ``0x00``. Приведенная выше строка занимает 24 байта по сравнению с 6 байтами, необходимыми для представления ASCII. Увеличение использования оперативной памяти не имеет большого значения (настольные компьютеры имеют гигабайты оперативной памяти, а строки обычно не такие большие), но увеличение использования нами дисковой и сетевой пропускной способности в 4 раза невыносимо.

source: It's not compatible with existing C functions such as ``strlen()``, so a new family of wide string functions would need to be used.
ru: Он несовместим с существующими функциями C, такими как strlen(), поэтому необходимо использовать новое семейство функций для работы с широкими строками.

source: Therefore this encoding isn't used very much, and people instead choose other encodings that are more efficient and convenient, such as UTF-8.
ru: Поэтому эта кодировка используется не очень часто, и вместо этого люди выбирают другие, более эффективные и удобные кодировки, например UTF-8.

source: UTF-8 is one of the most commonly used encodings, and Python often defaults to using it. UTF stands for "Unicode Transformation Format", and the '8' means that 8-bit values are used in the encoding. (There are also UTF-16 and UTF-32 encodings, but they are less frequently used than UTF-8.) UTF-8 uses the following rules:
ru: UTF-8 — одна из наиболее часто используемых кодировок, и Python часто использует ее по умолчанию. UTF означает «Формат преобразования Unicode», а «8» означает, что в кодировке используются 8-битные значения. (Существуют также кодировки UTF-16 и UTF-32, но они используются реже, чем UTF-8.) В UTF-8 используются следующие правила:

source: If the code point is < 128, it's represented by the corresponding byte value.
ru: Если кодовая точка < 128, она представлена ​​соответствующим значением байта.

source: If the code point is >= 128, it's turned into a sequence of two, three, or four bytes, where each byte of the sequence is between 128 and 255.
ru: Если кодовая точка >= 128, она преобразуется в последовательность из двух, трех или четырех байтов, где каждый байт последовательности находится между 128 и 255.

source: UTF-8 has several convenient properties:
ru: UTF-8 имеет несколько удобных свойств:

source: It can handle any Unicode code point.
ru: Он может обрабатывать любую кодовую точку Unicode.

source: A Unicode string is turned into a sequence of bytes that contains embedded zero bytes only where they represent the null character (U+0000). This means that UTF-8 strings can be processed by C functions such as ``strcpy()`` and sent through protocols that can't handle zero bytes for anything other than end-of-string markers.
ru: Строка Юникода преобразуется в последовательность байтов, содержащую внедренные нулевые байты только там, где они представляют нулевой символ (U+0000). Это означает, что строки UTF-8 могут обрабатываться функциями C, такими как strcpy(), и отправляться через протоколы, которые не могут обрабатывать нулевые байты для чего-либо, кроме маркеров конца строки.

source: A string of ASCII text is also valid UTF-8 text.
ru: Строка текста ASCII также является допустимым текстом UTF-8.

source: UTF-8 is fairly compact; the majority of commonly used characters can be represented with one or two bytes.
ru: UTF-8 довольно компактен; большинство часто используемых символов могут быть представлены одним или двумя байтами.

source: If bytes are corrupted or lost, it's possible to determine the start of the next UTF-8-encoded code point and resynchronize. It's also unlikely that random 8-bit data will look like valid UTF-8.
ru: Если байты повреждены или потеряны, можно определить начало следующей кодовой точки в кодировке UTF-8 и выполнить повторную синхронизацию. Также маловероятно, что случайные 8-битные данные будут выглядеть как действительный UTF-8.

source: UTF-8 is a byte oriented encoding. The encoding specifies that each character is represented by a specific sequence of one or more bytes. This avoids the byte-ordering issues that can occur with integer and word oriented encodings, like UTF-16 and UTF-32, where the sequence of bytes varies depending on the hardware on which the string was encoded.
ru: UTF-8 — это байтовая кодировка. Кодировка определяет, что каждый символ представлен определенной последовательностью из одного или нескольких байтов. Это позволяет избежать проблем с порядком байтов, которые могут возникнуть при целочисленных и словесных кодировках, таких как UTF-16 и UTF-32, где последовательность байтов варьируется в зависимости от оборудования, на котором была закодирована строка.

source: The `Unicode Consortium site <https://www.unicode.org>`_ has character charts, a glossary, and PDF versions of the Unicode specification. Be prepared for some difficult reading. `A chronology <https://www.unicode.org/history/>`_ of the origin and development of Unicode is also available on the site.
ru: На сайте Консорциума Unicode <https://www.unicode.org> имеются таблицы символов, глоссарий и PDF-версии спецификации Unicode. Будьте готовы к трудному чтению. `_ Хронология <https://www.unicode.org/history/>`_ происхождения и развития Unicode также доступна на сайте.

source: On the Computerphile Youtube channel, Tom Scott briefly `discusses the history of Unicode and UTF-8 <https://www.youtube.com/watch?v=MijmeoH9LT4>`_ (9 minutes 36 seconds).
ru: На канале Computerphile Youtube Том Скотт кратко `обсуждает историю Unicode и UTF-8 <https://www.youtube.com/watch?v=MijmeoH9LT4>`_ (9 минут 36 секунд).

source: To help understand the standard, Jukka Korpela has written `an introductory guide <https://jkorpela.fi/unicode/guide.html>`_ to reading the Unicode character tables.
ru: Чтобы помочь понять стандарт, Юкка Корпела написал `вводное руководство <https://jkorpela.fi/unicode/guide.html>`_ по чтению таблиц символов Юникода.

source: Another `good introductory article <https://www.joelonsoftware.com/2003/10/08/the-absolute-minimum-every-software-developer-absolutely-positively-must-know-about-unicode-and-character-sets-no-excuses/>`_ was written by Joel Spolsky. If this introduction didn't make things clear to you, you should try reading this alternate article before continuing.
ru: Еще одна «хорошая вводная статья» set-no-excuses/>`_ был написан Джоэлом Спольски. Если это введение не прояснило вам ситуацию, попробуйте прочитать альтернативную статью, прежде чем продолжить.

source: Wikipedia entries are often helpful; see the entries for "`character encoding <https://en.wikipedia.org/wiki/Character_encoding>`_" and `UTF-8 <https://en.wikipedia.org/wiki/UTF-8>`_, for example.
ru: Записи в Википедии часто бывают полезны; см. записи для «`кодировки символов <https://en.wikipedia.org/wiki/Character_encoding>`_» и `UTF-8 <https://en.wikipedia.org/wiki/UTF-8>`_ , например.

source: Python's Unicode Support
ru: Поддержка Юникода в Python

source: Now that you've learned the rudiments of Unicode, we can look at Python's Unicode features.
ru: Теперь, когда вы изучили основы Unicode, мы можем рассмотреть возможности Unicode в Python.

source: The String Type
ru: Строковый тип

source: Since Python 3.0, the language's :class:`str` type contains Unicode characters, meaning any string created using ``"unicode rocks!"``, ``'unicode rocks!'``, or the triple-quoted string syntax is stored as Unicode.
ru: Начиная с Python 3.0, тип языка :class:`str` содержит символы Юникода, что означает, что любая строка, созданная с использованием ``"Unicode Rocks!"``, ``'Unicode Rocks!'`` или синтаксиса строки в тройных кавычках, имеет вид хранится как Юникод.

source: The default encoding for Python source code is UTF-8, so you can simply include a Unicode character in a string literal::
ru: Кодировкой исходного кода Python по умолчанию является UTF-8, поэтому вы можете просто включить символ Юникода в строковый литерал:

source: Side note: Python 3 also supports using Unicode characters in identifiers::
ru: Примечание: Python 3 также поддерживает использование символов Юникода в идентификаторах:

source: If you can't enter a particular character in your editor or want to keep the source code ASCII-only for some reason, you can also use escape sequences in string literals. (Depending on your system, you may see the actual capital-delta glyph instead of a \u escape.) ::
ru: Если вы не можете ввести определенный символ в своем редакторе или по какой-то причине хотите сохранить исходный код только в формате ASCII, вы также можете использовать escape-последовательности в строковых литералах. (В зависимости от вашей системы вы можете увидеть фактический символ заглавной дельты вместо escape-символа \u.) ::

source: In addition, one can create a string using the :func:`~bytes.decode` method of :class:`bytes`. This method takes an *encoding* argument, such as ``UTF-8``, and optionally an *errors* argument.
ru: Кроме того, можно создать строку, используя метод :func:`~bytes.decode` :class:`bytes`. Этот метод принимает аргумент *кодирование*, например ``UTF-8``, и, возможно, аргумент *errors*.

source: The *errors* argument specifies the response when the input string can't be converted according to the encoding's rules. Legal values for this argument are ``'strict'`` (raise a :exc:`UnicodeDecodeError` exception), ``'replace'`` (use ``U+FFFD``, ``REPLACEMENT CHARACTER``), ``'ignore'`` (just leave the character out of the Unicode result), or ``'backslashreplace'`` (inserts a ``\xNN`` escape sequence). The following examples show the differences::
ru: Аргумент *errors* определяет ответ, когда входная строка не может быть преобразована в соответствии с правилами кодирования. Допустимые значения для этого аргумента: ``'strict'`` (вызывает исключение :exc:`UnicodeDecodeError`), ``'replace'`` (используйте ``U+FFFD``, ``REPLACEMENT CHARACTER``), ``'игнорировать'`` (просто оставьте символ вне результата Unicode) или ``'обратная косая черта'`` (вставляет escape-последовательность ``\xNN``). Следующие примеры показывают различия:

source: Encodings are specified as strings containing the encoding's name. Python comes with roughly 100 different encodings; see the Python Library Reference at :ref:`standard-encodings` for a list. Some encodings have multiple names; for example, ``'latin-1'``, ``'iso_8859_1'`` and ``'8859``' are all synonyms for the same encoding.
ru: Кодировки указываются в виде строк, содержащих имя кодировки. Python поставляется примерно со 100 различными кодировками; список см. в Справочнике библиотеки Python по адресу :ref:`standard-encodings`. Некоторые кодировки имеют несколько названий; например, ``'latin-1'``, ``'iso_8859_1'`` и ``'8859``' являются синонимами одной и той же кодировки.

source: One-character Unicode strings can also be created with the :func:`chr` built-in function, which takes integers and returns a Unicode string of length 1 that contains the corresponding code point. The reverse operation is the built-in :func:`ord` function that takes a one-character Unicode string and returns the code point value::
ru: Односимвольные строки Юникода также можно создавать с помощью встроенной функции :func:`chr`, которая принимает целые числа и возвращает строку Юникода длиной 1, содержащую соответствующую кодовую точку. Обратная операция — это встроенная функция :func:`ord`, которая принимает односимвольную строку Юникода и возвращает значение кодовой точки::

source: Converting to Bytes
ru: Преобразование в байты

source: The opposite method of :meth:`bytes.decode` is :meth:`str.encode`, which returns a :class:`bytes` representation of the Unicode string, encoded in the requested *encoding*.
ru: Противоположным методом :meth:`bytes.decode` является :meth:`str.encode`, который возвращает :class:`bytes` представление строки Unicode, закодированной в запрошенной *кодировке*.

source: The *errors* parameter is the same as the parameter of the :meth:`~bytes.decode` method but supports a few more possible handlers. As well as ``'strict'``, ``'ignore'``, and ``'replace'`` (which in this case inserts a question mark instead of the unencodable character), there is also ``'xmlcharrefreplace'`` (inserts an XML character reference), ``backslashreplace`` (inserts a ``\uNNNN`` escape sequence) and ``namereplace`` (inserts a ``\N{...}`` escape sequence).
ru: Параметр *errors* аналогичен параметру метода :meth:`~bytes.decode`, но поддерживает еще несколько возможных обработчиков. Помимо ``'strict'``, ``'ignore'`` и ``'replace'`` (которые в данном случае вставляют вопросительный знак вместо некодируемого символа), существует также ``'xmlcharrefreplace '`` (вставляет ссылку на символ XML), ``обратная косая черта`` (вставляет escape-последовательность ``\uNNNN``) и ``namereplace`` (вставляет escape-последовательность ``\N{...}`` ).

source: The following example shows the different results::
ru: В следующем примере показаны разные результаты:

source: The low-level routines for registering and accessing the available encodings are found in the :mod:`codecs` module. Implementing new encodings also requires understanding the :mod:`codecs` module. However, the encoding and decoding functions returned by this module are usually more low-level than is comfortable, and writing new encodings is a specialized task, so the module won't be covered in this HOWTO.
ru: Низкоуровневые процедуры регистрации и доступа к доступным кодировкам находятся в модуле :mod:`codecs`. Реализация новых кодировок также требует понимания модуля :mod:`codecs`. Однако функции кодирования и декодирования, возвращаемые этим модулем, обычно являются более низкоуровневыми, чем это удобно, а написание новых кодировок является специализированной задачей, поэтому этот модуль не будет рассматриваться в этом HOWTO.

source: Unicode Literals in Python Source Code
ru: Литералы Юникода в исходном коде Python

source: In Python source code, specific Unicode code points can be written using the ``\u`` escape sequence, which is followed by four hex digits giving the code point. The ``\U`` escape sequence is similar, but expects eight hex digits, not four::
ru: В исходном коде Python определенные кодовые точки Unicode могут быть записаны с использованием escape-последовательности ``\u``, за которой следуют четыре шестнадцатеричные цифры, обозначающие кодовую точку. Escape-последовательность ``\U`` аналогична, но предполагает восемь шестнадцатеричных цифр, а не четыре:

source: Using escape sequences for code points greater than 127 is fine in small doses, but becomes an annoyance if you're using many accented characters, as you would in a program with messages in French or some other accent-using language. You can also assemble strings using the :func:`chr` built-in function, but this is even more tedious.
ru: Использование escape-последовательностей для кодовых точек больше 127 допустимо в небольших дозах, но становится раздражающим, если вы используете много символов с диакритическими знаками, как это было бы в программе с сообщениями на французском или каком-либо другом языке, использующем диакритические знаки. Вы также можете собирать строки, используя встроенную функцию :func:`chr`, но это еще более утомительно.
