Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/howto/unicode.po
Languages: ru

source: Ideally, you'd want to be able to write literals in your language's natural encoding. You could then edit Python source code with your favorite editor which would display the accented characters naturally, and have the right characters used at runtime.
ru: В идеале вы хотели бы иметь возможность писать литералы в естественной кодировке вашего языка. Затем вы можете редактировать исходный код Python в своем любимом редакторе, который будет естественным образом отображать символы с диакритическими знаками и использовать правильные символы во время выполнения.

source: Python supports writing source code in UTF-8 by default, but you can use almost any encoding if you declare the encoding being used. This is done by including a special comment as either the first or second line of the source file::
ru: Python по умолчанию поддерживает запись исходного кода в UTF-8, но вы можете использовать практически любую кодировку, если объявите используемую кодировку. Это делается путем включения специального комментария в первую или вторую строку исходного файла:

source: The syntax is inspired by Emacs's notation for specifying variables local to a file. Emacs supports many different variables, but Python only supports 'coding'. The ``-*-`` symbols indicate to Emacs that the comment is special; they have no significance to Python but are a convention. Python looks for ``coding: name`` or ``coding=name`` in the comment.
ru: Синтаксис основан на нотации Emacs для указания переменных, локальных для файла. Emacs поддерживает множество различных переменных, но Python поддерживает только «кодирование». Символы ``-*-`` указывают Emacs, что комментарий является особенным; они не имеют никакого значения для Python, но являются соглашением. Python ищет в комментарии ``coding: name`` или ``coding=name``.

source: If you don't include such a comment, the default encoding used will be UTF-8 as already mentioned. See also :pep:`263` for more information.
ru: Если вы не включите такой комментарий, по умолчанию будет использоваться кодировка UTF-8, как уже упоминалось. См. также :pep:`263` для получения дополнительной информации.

source: Unicode Properties
ru: Свойства Юникода

source: The Unicode specification includes a database of information about code points. For each defined code point, the information includes the character's name, its category, the numeric value if applicable (for characters representing numeric concepts such as the Roman numerals, fractions such as one-third and four-fifths, etc.). There are also display-related properties, such as how to use the code point in bidirectional text.
ru: Спецификация Unicode включает базу данных с информацией о кодовых точках. Для каждой определенной кодовой точки информация включает имя символа, его категорию, числовое значение, если применимо (для символов, представляющих числовые понятия, такие как римские цифры, дроби, такие как одна треть и четыре пятых и т. д.). Существуют также свойства, связанные с отображением, например, как использовать кодовую точку в двунаправленном тексте.

source: The following program displays some information about several characters, and prints the numeric value of one particular character::
ru: Следующая программа отображает некоторую информацию о нескольких символах и печатает числовое значение одного конкретного символа:

source: When run, this prints:
ru: При запуске это печатает:

source: The category codes are abbreviations describing the nature of the character. These are grouped into categories such as "Letter", "Number", "Punctuation", or "Symbol", which in turn are broken up into subcategories. To take the codes from the above output, ``'Ll'`` means 'Letter, lowercase', ``'No'`` means "Number, other", ``'Mn'`` is "Mark, nonspacing", and ``'So'`` is "Symbol, other". See `the General Category Values section of the Unicode Character Database documentation <https://www.unicode.org/reports/tr44/#General_Category_Values>`_ for a list of category codes.
ru: Коды категорий представляют собой аббревиатуры, описывающие характер персонажа. Они сгруппированы в такие категории, как «Буква», «Цифра», «Пунктуация» или «Символ», которые, в свою очередь, разбиты на подкатегории. Если взять коды из приведенного выше вывода, ``'Ll'`` означает "Буква, строчная", ``'Нет'`` означает "Число, другое", ``'Mn'`` означает "Знак, без пробелов". , а ``'So'`` — это «Символ, другое». Список кодов категорий см. в разделе «Общие значения категорий» документации по базе данных символов Юникода <https://www.unicode.org/reports/tr44/#General_Category_Values>.

source: Comparing Strings
ru: Сравнение строк

source: Unicode adds some complication to comparing strings, because the same set of characters can be represented by different sequences of code points. For example, a letter like 'ê' can be represented as a single code point U+00EA, or as U+0065 U+0302, which is the code point for 'e' followed by a code point for 'COMBINING CIRCUMFLEX ACCENT'. These will produce the same output when printed, but one is a string of length 1 and the other is of length 2.
ru: Юникод усложняет сравнение строк, поскольку один и тот же набор символов может быть представлен разными последовательностями кодовых точек. Например, буква типа «ê» может быть представлена ​​как одна кодовая точка U+00EA или как U+0065 U+0302, которая является кодовой точкой для «e», за которой следует кодовая точка для «COMBINING CIRCUMFLEX ACCENT». . При печати они будут выдавать один и тот же результат, но один из них представляет собой строку длины 1, а другой — длины 2.

source: One tool for a case-insensitive comparison is the :meth:`~str.casefold` string method that converts a string to a case-insensitive form following an algorithm described by the Unicode Standard. This algorithm has special handling for characters such as the German letter 'ß' (code point U+00DF), which becomes the pair of lowercase letters 'ss'.
ru: Одним из инструментов сравнения без учета регистра является строковый метод :meth:`~str.casefold`, который преобразует строку в форму без учета регистра в соответствии с алгоритмом, описанным стандартом Unicode. В этом алгоритме предусмотрена специальная обработка таких символов, как немецкая буква «ß» (кодовая точка U+00DF), которая становится парой строчных букв «ss».

source: A second tool is the :mod:`unicodedata` module's :func:`~unicodedata.normalize` function that converts strings to one of several normal forms, where letters followed by a combining character are replaced with single characters. :func:`~unicodedata.normalize` can be used to perform string comparisons that won't falsely report inequality if two strings use combining characters differently:
ru: Второй инструмент — это функция :func:`~unicodedata.normalize` модуля :mod:`unicodedata`, которая преобразует строки в одну из нескольких нормальных форм, где буквы, за которыми следует объединяющий символ, заменяются одиночными символами. :func:`~unicodedata.normalize` можно использовать для сравнения строк, которое не будет выдавать ложное сообщение о неравенстве, если две строки по-разному используют объединение символов:

source: When run, this outputs:
ru: При запуске это выводит:

source: The first argument to the :func:`~unicodedata.normalize` function is a string giving the desired normalization form, which can be one of 'NFC', 'NFKC', 'NFD', and 'NFKD'.
ru: Первый аргумент функции :func:`~unicodedata.normalize` — это строка, задающая желаемую форму нормализации, которая может быть одной из следующих: «NFC», «NFKC», «NFD» и «NFKD».

source: The Unicode Standard also specifies how to do caseless comparisons::
ru: Стандарт Unicode также определяет, как выполнять сравнения без регистра:

source: This will print ``True``. (Why is :func:`!NFD` invoked twice? Because there are a few characters that make :meth:`~str.casefold` return a non-normalized string, so the result needs to be normalized again. See section 3.13 of the Unicode Standard for a discussion and an example.)
ru: Это напечатает ``True``. (Почему :func:`!NFD` вызывается дважды? Потому что есть несколько символов, которые заставляют :meth:`~str.casefold` возвращать ненормализованную строку, поэтому результат необходимо нормализовать снова. См. раздел 3.13 стандарт Unicode для обсуждения и примера.)

source: Unicode Regular Expressions
ru: Регулярные выражения Юникода

source: The regular expressions supported by the :mod:`re` module can be provided either as bytes or strings. Some of the special character sequences such as ``\d`` and ``\w`` have different meanings depending on whether the pattern is supplied as bytes or a string. For example, ``\d`` will match the characters ``[0-9]`` in bytes but in strings will match any character that's in the ``'Nd'`` category.
ru: Регулярные выражения, поддерживаемые модулем :mod:`re`, могут быть предоставлены в виде байтов или строк. Некоторые последовательности специальных символов, такие как ``\d`` и ``\w``, имеют разные значения в зависимости от того, представлен ли шаблон в виде байтов или строки. Например, ``\d`` будет соответствовать символам ``[0-9]`` в байтах, но в строках будет соответствовать любому символу из категории ``'Nd'``.

source: The string in this example has the number 57 written in both Thai and Arabic numerals::
ru: Строка в этом примере имеет номер 57, записанный как тайскими, так и арабскими цифрами::

source: When executed, ``\d+`` will match the Thai numerals and print them out. If you supply the :const:`re.ASCII` flag to :func:`~re.compile`, ``\d+`` will match the substring "57" instead.
ru: При выполнении ``\d+`` будет соответствовать тайским цифрам и распечатывать их. Если вы укажете флаг :const:`re.ASCII` в :func:`~re.compile`, ``\d+`` вместо этого будет соответствовать подстроке "57".

source: Similarly, ``\w`` matches a wide variety of Unicode characters but only ``[a-zA-Z0-9_]`` in bytes or if :const:`re.ASCII` is supplied, and ``\s`` will match either Unicode whitespace characters or ``[ \t\n\r\f\v]``.
ru: Аналогично, ``\w`` соответствует широкому спектру символов Юникода, но только ``[a-zA-Z0-9_]`` в байтах или если указан :const:`re.ASCII`, и ``\s `` будет соответствовать либо пробельным символам Юникода, либо ``[ \t\n\r\f\v]``.

source: Some good alternative discussions of Python's Unicode support are:
ru: Некоторые хорошие альтернативные обсуждения поддержки Unicode в Python:

source: `Processing Text Files in Python 3 <https://python-notes.curiousefficiency.org/en/latest/python3/text_file_processing.html>`_, by Nick Coghlan.
ru: `Обработка текстовых файлов в Python 3 <https://python-notes.curiousefficiency.org/en/latest/python3/text_file_processing.html>`_, Ник Коглан.

source: `Pragmatic Unicode <https://nedbatchelder.com/text/unipain.html>`_, a PyCon 2012 presentation by Ned Batchelder.
ru: `Pragmatic Unicode <https://nedbatchelder.com/text/unipain.html>`_, презентация Неда Батчелдера на PyCon 2012.

source: The :class:`str` type is described in the Python library reference at :ref:`textseq`.
ru: Тип :class:`str` описан в справочнике по библиотеке Python по адресу :ref:`textseq`.

source: The documentation for the :mod:`unicodedata` module.
ru: Документация для модуля :mod:`unicodedata`.

source: The documentation for the :mod:`codecs` module.
ru: Документация для модуля :mod:`codecs`.

source: Marc-André Lemburg gave `a presentation titled "Python and Unicode" (PDF slides) <https://downloads.egenix.com/python/Unicode-EPC2002-Talk.pdf>`_ at EuroPython 2002. The slides are an excellent overview of the design of Python 2's Unicode features (where the Unicode string type is called ``unicode`` and literals start with ``u``).
ru: Марк-Андре Лембург сделал `презентацию под названием «Python и Unicode» (слайды в формате PDF) <https://downloads.egenix.com/python/Unicode-EPC2002-Talk.pdf>`_ на выставке EuroPython 2002. Эти слайды представляют собой превосходное обзор функций Unicode в Python 2 (где строковый тип Unicode называется ``unicode``, а литералы начинаются с ``u``).

source: Reading and Writing Unicode Data
ru: Чтение и запись данных Unicode

source: Once you've written some code that works with Unicode data, the next problem is input/output. How do you get Unicode strings into your program, and how do you convert Unicode into a form suitable for storage or transmission?
ru: После того, как вы написали код, работающий с данными Unicode, следующей проблемой является ввод/вывод. Как добавить строки Unicode в вашу программу и как преобразовать Unicode в форму, пригодную для хранения или передачи?

source: It's possible that you may not need to do anything depending on your input sources and output destinations; you should check whether the libraries used in your application support Unicode natively. XML parsers often return Unicode data, for example. Many relational databases also support Unicode-valued columns and can return Unicode values from an SQL query.
ru: Возможно, вам не придется ничего делать в зависимости от ваших источников ввода и назначения вывода; вам следует проверить, поддерживают ли библиотеки, используемые в вашем приложении, Unicode изначально. Например, анализаторы XML часто возвращают данные Unicode. Многие реляционные базы данных также поддерживают столбцы со значениями в Юникоде и могут возвращать значения в Юникоде из запроса SQL.

source: Unicode data is usually converted to a particular encoding before it gets written to disk or sent over a socket. It's possible to do all the work yourself: open a file, read an 8-bit bytes object from it, and convert the bytes with ``bytes.decode(encoding)``. However, the manual approach is not recommended.
ru: Данные Unicode обычно преобразуются в определенную кодировку перед записью на диск или отправкой через сокет. Всю работу можно сделать самостоятельно: открыть файл, прочитать из него 8-битный байтовый объект и преобразовать байты с помощью ``bytes.decode(encoding)``. Однако ручной подход не рекомендуется.

source: One problem is the multi-byte nature of encodings; one Unicode character can be represented by several bytes. If you want to read the file in arbitrary-sized chunks (say, 1024 or 4096 bytes), you need to write error-handling code to catch the case where only part of the bytes encoding a single Unicode character are read at the end of a chunk. One solution would be to read the entire file into memory and then perform the decoding, but that prevents you from working with files that are extremely large; if you need to read a 2 GiB file, you need 2 GiB of RAM. (More, really, since for at least a moment you'd need to have both the encoded string and its Unicode version in memory.)
ru: Одна из проблем — многобайтовая природа кодировок; один символ Юникода может быть представлен несколькими байтами. Если вы хотите прочитать файл порциями произвольного размера (скажем, 1024 или 4096 байт), вам необходимо написать код обработки ошибок, чтобы отловить случай, когда в конце считывается только часть байтов, кодирующих один символ Юникода. кусок. Одним из решений было бы прочитать весь файл в памяти, а затем выполнить декодирование, но это не позволяет работать с файлами очень большого размера; если вам нужно прочитать файл размером 2 ГБ, вам понадобится 2 ГБ ОЗУ. (На самом деле даже больше, поскольку хотя бы на мгновение вам понадобится иметь в памяти и закодированную строку, и ее версию в Юникоде.)

source: The solution would be to use the low-level decoding interface to catch the case of partial coding sequences. The work of implementing this has already been done for you: the built-in :func:`open` function can return a file-like object that assumes the file's contents are in a specified encoding and accepts Unicode parameters for methods such as :meth:`~io.TextIOBase.read` and :meth:`~io.TextIOBase.write`. This works through :func:`open`\'s *encoding* and *errors* parameters which are interpreted just like those in :meth:`str.encode` and :meth:`bytes.decode`.
ru: Решением могло бы стать использование низкоуровневого интерфейса декодирования для выявления случаев частичных последовательностей кодирования. Работа по реализации этого уже сделана за вас: встроенная функция :func:`open` может возвращать файлоподобный объект, который предполагает, что содержимое файла находится в указанной кодировке, и принимает параметры Unicode для таких методов, как :meth. :`~io.TextIOBase.read` и :meth:`~io.TextIOBase.write`. Это работает через параметры *encoding* и *errors* :func:`open`\, которые интерпретируются так же, как и в :meth:`str.encode` и :meth:`bytes.decode`.

source: Reading Unicode from a file is therefore simple::
ru: Таким образом, чтение Unicode из файла является простым:

source: It's also possible to open files in update mode, allowing both reading and writing::
ru: Также возможно открывать файлы в режиме обновления, допуская как чтение, так и запись::

source: The Unicode character ``U+FEFF`` is used as a byte-order mark (BOM), and is often written as the first character of a file in order to assist with autodetection of the file's byte ordering. Some encodings, such as UTF-16, expect a BOM to be present at the start of a file; when such an encoding is used, the BOM will be automatically written as the first character and will be silently dropped when the file is read. There are variants of these encodings, such as 'utf-16-le' and 'utf-16-be' for little-endian and big-endian encodings, that specify one particular byte ordering and don't skip the BOM.
ru: Символ Юникода ``U+FEFF`` используется в качестве метки порядка байтов (BOM) и часто записывается как первый символ файла, чтобы облегчить автоматическое определение порядка байтов в файле. Некоторые кодировки, такие как UTF-16, предполагают наличие спецификации в начале файла; при использовании такой кодировки спецификация будет автоматически записана как первый символ и будет автоматически удалена при чтении файла. Существуют варианты этих кодировок, такие как «utf-16-le» и «utf-16-be» для кодировок с прямым и прямым порядком байтов, которые определяют один конкретный порядок байтов и не пропускают спецификацию.

source: In some areas, it is also convention to use a "BOM" at the start of UTF-8 encoded files; the name is misleading since UTF-8 is not byte-order dependent. The mark simply announces that the file is encoded in UTF-8. For reading such files, use the 'utf-8-sig' codec to automatically skip the mark if present.
ru: В некоторых областях также принято использовать «BOM» в начале файлов в кодировке UTF-8; имя вводит в заблуждение, поскольку UTF-8 не зависит от порядка байтов. Знак просто сообщает, что файл имеет кодировку UTF-8. Для чтения таких файлов используйте кодек «utf-8-sig», чтобы автоматически пропустить метку, если она есть.

source: Unicode filenames
ru: Имена файлов в Юникоде

source: Most of the operating systems in common use today support filenames that contain arbitrary Unicode characters. Usually this is implemented by converting the Unicode string into some encoding that varies depending on the system. Today Python is converging on using UTF-8: Python on MacOS has used UTF-8 for several versions, and Python 3.6 switched to using UTF-8 on Windows as well. On Unix systems, there will only be a :term:`filesystem encoding <filesystem encoding and error handler>`. if you've set the ``LANG`` or ``LC_CTYPE`` environment variables; if you haven't, the default encoding is again UTF-8.
ru: Большинство широко используемых сегодня операционных систем поддерживают имена файлов, содержащие произвольные символы Юникода. Обычно это реализуется путем преобразования строки Unicode в некоторую кодировку, которая зависит от системы. Сегодня Python переходит на использование UTF-8: Python в MacOS использует UTF-8 в нескольких версиях, а Python 3.6 также перешел на использование UTF-8 в Windows. В системах Unix будет только :term:`кодировка файловой системы <кодировка файловой системы и обработчик ошибок>`. если вы установили переменные среды ``LANG`` или ``LC_CTYPE``; если вы этого не сделали, кодировка по умолчанию снова будет UTF-8.

source: The :func:`sys.getfilesystemencoding` function returns the encoding to use on your current system, in case you want to do the encoding manually, but there's not much reason to bother. When opening a file for reading or writing, you can usually just provide the Unicode string as the filename, and it will be automatically converted to the right encoding for you::
ru: Функция :func:`sys.getfilesystemencoding` возвращает кодировку, которая будет использоваться в вашей текущей системе, на случай, если вы хотите выполнить кодировку вручную, но нет особых причин для беспокойства. При открытии файла для чтения или записи вы обычно можете просто указать строку Unicode в качестве имени файла, и она будет автоматически преобразована в нужную вам кодировку:

source: Functions in the :mod:`os` module such as :func:`os.stat` will also accept Unicode filenames.
ru: Функции в модуле :mod:`os`, такие как :func:`os.stat`, также принимают имена файлов в Юникоде.

source: The :func:`os.listdir` function returns filenames, which raises an issue: should it return the Unicode version of filenames, or should it return bytes containing the encoded versions? :func:`os.listdir` can do both, depending on whether you provided the directory path as bytes or a Unicode string. If you pass a Unicode string as the path, filenames will be decoded using the filesystem's encoding and a list of Unicode strings will be returned, while passing a byte path will return the filenames as bytes. For example, assuming the default :term:`filesystem encoding <filesystem encoding and error handler>` is UTF-8, running the following program::
ru: Функция :func:`os.listdir` возвращает имена файлов, что вызывает проблему: должна ли она возвращать версию имен файлов в Юникоде или она должна возвращать байты, содержащие закодированные версии? :func:`os.listdir` может делать и то, и другое, в зависимости от того, указали ли вы путь к каталогу в виде байтов или строки Unicode. Если вы передадите строку Unicode в качестве пути, имена файлов будут декодированы с использованием кодировки файловой системы и будет возвращен список строк Unicode, а при передаче байтового пути имена файлов будут возвращены в виде байтов. Например, если предположить, что :term:`кодировка файловой системы <кодировка файловой системы и обработчик ошибок>` — UTF-8, запустите следующую программу:

source: will produce the following output:
ru: выдаст следующий результат:

source: The first list contains UTF-8-encoded filenames, and the second list contains the Unicode versions.
ru: Первый список содержит имена файлов в кодировке UTF-8, а второй список содержит версии Unicode.

source: Note that on most occasions, you should can just stick with using Unicode with these APIs. The bytes APIs should only be used on systems where undecodable file names can be present; that's pretty much only Unix systems now.
ru: Обратите внимание, что в большинстве случаев вам следует просто использовать Unicode с этими API. API-интерфейсы bytes следует использовать только в системах, где могут присутствовать нерасшифрованные имена файлов; сейчас это практически только системы Unix.

source: Tips for Writing Unicode-aware Programs
ru: Советы по написанию программ, поддерживающих Unicode

source: This section provides some suggestions on writing software that deals with Unicode.
ru: В этом разделе представлены некоторые предложения по написанию программного обеспечения, работающего с Unicode.

source: The most important tip is:
ru: Самый важный совет:
