Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/howto/unicode.po
Languages: ru

source: Software should only work with Unicode strings internally, decoding the input data as soon as possible and encoding the output only at the end.
ru: Программное обеспечение должно работать только со строками Unicode внутри, декодируя входные данные как можно скорее и кодируя выходные данные только в конце.

source: If you attempt to write processing functions that accept both Unicode and byte strings, you will find your program vulnerable to bugs wherever you combine the two different kinds of strings. There is no automatic encoding or decoding: if you do e.g. ``str + bytes``, a :exc:`TypeError` will be raised.
ru: Если вы попытаетесь написать функции обработки, которые принимают как строки Юникода, так и байтовые строки, вы обнаружите, что ваша программа уязвима для ошибок везде, где вы комбинируете два разных типа строк. Автоматического кодирования или декодирования не существует: если вы выполните, например, ``str + bytes``, будет выдано :exc:`TypeError`.

source: When using data coming from a web browser or some other untrusted source, a common technique is to check for illegal characters in a string before using the string in a generated command line or storing it in a database. If you're doing this, be careful to check the decoded string, not the encoded bytes data; some encodings may have interesting properties, such as not being bijective or not being fully ASCII-compatible. This is especially true if the input data also specifies the encoding, since the attacker can then choose a clever way to hide malicious text in the encoded bytestream.
ru: При использовании данных, поступающих из веб-браузера или другого ненадежного источника, обычным методом является проверка на наличие недопустимых символов в строке перед использованием строки в сгенерированной командной строке или сохранением ее в базе данных. Если вы это делаете, будьте осторожны и проверяйте декодированную строку, а не закодированные байты данных; некоторые кодировки могут иметь интересные свойства, например, не быть биективными или не полностью ASCII-совместимыми. Это особенно верно, если во входных данных также указана кодировка, поскольку тогда злоумышленник может выбрать хитрый способ скрыть вредоносный текст в закодированном потоке байтов.

source: Converting Between File Encodings
ru: Преобразование между кодировками файлов

source: The :class:`~codecs.StreamRecoder` class can transparently convert between encodings, taking a stream that returns data in encoding #1 and behaving like a stream returning data in encoding #2.
ru: Класс :class:`~codecs.StreamRecoder` может прозрачно преобразовывать данные между кодировками, принимая поток, возвращающий данные в кодировке №1, и ведя себя как поток, возвращающий данные в кодировке №2.

source: For example, if you have an input file *f* that's in Latin-1, you can wrap it with a :class:`~codecs.StreamRecoder` to return bytes encoded in UTF-8::
ru: Например, если у вас есть входной файл *f* в формате Latin-1, вы можете обернуть его :class:`~codecs.StreamRecoder`, чтобы возвращать байты, закодированные в UTF-8::

source: Files in an Unknown Encoding
ru: Файлы в неизвестной кодировке

source: What can you do if you need to make a change to a file, but don't know the file's encoding? If you know the encoding is ASCII-compatible and only want to examine or modify the ASCII parts, you can open the file with the ``surrogateescape`` error handler::
ru: Что делать, если вам нужно внести изменения в файл, но вы не знаете его кодировку? Если вы знаете, что кодировка совместима с ASCII, и хотите просмотреть или изменить только части ASCII, вы можете открыть файл с помощью обработчика ошибок surrogateescape::

source: The ``surrogateescape`` error handler will decode any non-ASCII bytes as code points in a special range running from U+DC80 to U+DCFF. These code points will then turn back into the same bytes when the ``surrogateescape`` error handler is used to encode the data and write it back out.
ru: Обработчик ошибок surrogateescape декодирует любые байты, отличные от ASCII, как кодовые точки в специальном диапазоне от U+DC80 до U+DCFF. Эти кодовые точки затем снова превратятся в те же байты, когда обработчик ошибок surrogateescape используется для кодирования данных и их обратной записи.

source: One section of `Mastering Python 3 Input/Output <https://pyvideo.org/video/289/pycon-2010--mastering-python-3-i-o>`_, a PyCon 2010 talk by David Beazley, discusses text processing and binary data handling.
ru: В одном разделе «Освоение ввода/вывода Python 3 <https://pyvideo.org/video/289/pycon-2010--mastering-python-3-io>», доклада Дэвида Бизли на PyCon 2010, обсуждается обработка текста. и обработка двоичных данных.

source: The `PDF slides for Marc-André Lemburg's presentation "Writing Unicode-aware Applications in Python" <https://downloads.egenix.com/python/LSM2005-Developing-Unicode-aware-applications-in-Python.pdf>`_ discuss questions of character encodings as well as how to internationalize and localize an application. These slides cover Python 2.x only.
ru: `Слайды в формате PDF к презентации Марка-Андре Лембурга «Написание приложений с поддержкой Unicode на Python» <https://downloads.egenix.com/python/LSM2005-Developing-Unicode-aware-applications-in-Python.pdf>`_ обсудить вопросы кодировок символов, а также способы интернационализации и локализации приложения. Эти слайды посвящены только Python 2.x.

source: `The Guts of Unicode in Python <https://pyvideo.org/video/1768/the-guts-of-unicode-in-python>`_ is a PyCon 2013 talk by Benjamin Peterson that discusses the internal Unicode representation in Python 3.3.
ru: `The Guts of Unicode в Python <https://pyvideo.org/video/1768/the-guts-of-unicode-in-python>`_ — это доклад Бенджамина Петерсона на PyCon 2013, в котором обсуждается внутреннее представление Unicode в Python. 3.3.

source: Acknowledgements
ru: Подтверждение

source: The initial draft of this document was written by Andrew Kuchling. It has since been revised further by Alexander Belopolsky, Georg Brandl, Andrew Kuchling, and Ezio Melotti.
ru: Первоначальный проект этого документа был написан Эндрю Кучлингом. С тех пор он был доработан Александром Белопольским, Георгом Брандлом, Эндрю Кучлингом и Эцио Мелотти.

source: Thanks to the following people who have noted errors or offered suggestions on this article: Éric Araujo, Nicholas Bastin, Nick Coghlan, Marius Gedminas, Kent Johnson, Ken Krugler, Marc-André Lemburg, Martin von Löwis, Terry J. Reedy, Serhiy Storchaka, Eryk Sun, Chad Whitacre, Graham Wideman.
ru: Спасибо следующим людям, которые заметили ошибки или предложили предложения по этой статье: Эрик Араужо, Николас Бастин, Ник Коглан, Мариус Гедминас, Кент Джонсон, Кен Круглер, Марк-Андре Лембург, Мартин фон Лёвис, Терри Дж. Риди, Сергей Сторчака , Эрик Сан, Чад Уитакр, Грэм Уайдман.
