Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/whatsnew/3.1.po
Languages: ru

source: What's New In Python 3.1
ru: Что нового в Python 3.1

source: Author
ru: Автор

source: This article explains the new features in Python 3.1, compared to 3.0. Python 3.1 was released on June 27, 2009.
ru: В этой статье объясняются новые возможности Python 3.1 по сравнению с версией 3.0. Python 3.1 был выпущен 27 июня 2009 г.

source: PEP 372: Ordered Dictionaries
ru: PEP 372: упорядоченные словари

source: Regular Python dictionaries iterate over key/value pairs in arbitrary order. Over the years, a number of authors have written alternative implementations that remember the order that the keys were originally inserted. Based on the experiences from those implementations, a new :class:`collections.OrderedDict` class has been introduced.
ru: Обычные словари Python перебирают пары ключ/значение в произвольном порядке. За прошедшие годы ряд авторов написали альтернативные реализации, запоминающие порядок первоначальной вставки ключей. На основе опыта этих реализаций был представлен новый класс :class:`collections.OrderedDict`.

source: The OrderedDict API is substantially the same as regular dictionaries but will iterate over keys and values in a guaranteed order depending on when a key was first inserted. If a new entry overwrites an existing entry, the original insertion position is left unchanged. Deleting an entry and reinserting it will move it to the end.
ru: API OrderedDict по существу аналогичен обычным словарям, но выполняет перебор ключей и значений в гарантированном порядке в зависимости от того, когда ключ был впервые вставлен. Если новая запись перезаписывает существующую, исходная позиция вставки остается неизменной. Удаление записи и повторная вставка переместит ее в конец.

source: The standard library now supports use of ordered dictionaries in several modules. The :mod:`configparser` module uses them by default. This lets configuration files be read, modified, and then written back in their original order. The *_asdict()* method for :func:`collections.namedtuple` now returns an ordered dictionary with the values appearing in the same order as the underlying tuple indices. The :mod:`json` module is being built-out with an *object_pairs_hook* to allow OrderedDicts to be built by the decoder. Support was also added for third-party tools like `PyYAML <https://pyyaml.org/>`_.
ru: Стандартная библиотека теперь поддерживает использование упорядоченных словарей в нескольких модулях. Модуль :mod:`configparser` использует их по умолчанию. Это позволяет читать, изменять и затем записывать файлы конфигурации в исходном порядке. Метод *_asdict()* для :func:`collections.namedtuple` теперь возвращает упорядоченный словарь, значения которого располагаются в том же порядке, что и базовые индексы кортежа. В модуль :mod:`json` встроен *object_pairs_hook*, позволяющий декодеру создавать OrderedDicts. Также была добавлена ​​поддержка сторонних инструментов, таких как `PyYAML <https://pyyaml.org/>`_.

source: :pep:`372` - Ordered Dictionaries
ru: :pep:`372` - Упорядоченные словари

source: PEP written by Armin Ronacher and Raymond Hettinger. Implementation written by Raymond Hettinger.
ru: PEP, написанный Армином Ронахером и Раймондом Хеттингером. Реализация написана Раймондом Хеттингером.

source: Since an ordered dictionary remembers its insertion order, it can be used in conjunction with sorting to make a sorted dictionary::
ru: Поскольку упорядоченный словарь запоминает порядок вставки, его можно использовать вместе с сортировкой для создания отсортированного словаря:

source: The new sorted dictionaries maintain their sort order when entries are deleted. But when new keys are added, the keys are appended to the end and the sort is not maintained.
ru: Новые отсортированные словари сохраняют свой порядок сортировки при удалении записей. Но когда добавляются новые ключи, они добавляются в конец, и сортировка не сохраняется.

source: PEP 378: Format Specifier for Thousands Separator
ru: PEP 378: спецификатор формата для разделителя тысяч

source: The built-in :func:`format` function and the :meth:`str.format` method use a mini-language that now includes a simple, non-locale aware way to format a number with a thousands separator. That provides a way to humanize a program's output, improving its professional appearance and readability::
ru: Встроенная функция :func:`format` и метод :meth:`str.format` используют мини-язык, который теперь включает в себя простой, не зависящий от локали способ форматирования числа с разделителем тысяч. Это дает возможность очеловечить вывод программы, улучшив ее профессиональный вид и читабельность:

source: The supported types are :class:`int`, :class:`float`, :class:`complex` and :class:`decimal.Decimal`.
ru: Поддерживаемые типы: :class:`int`, :class:`float`, :class:`complex` и :class:`decimal.Decimal`.

source: Discussions are underway about how to specify alternative separators like dots, spaces, apostrophes, or underscores. Locale-aware applications should use the existing *n* format specifier which already has some support for thousands separators.
ru: В настоящее время ведутся дискуссии о том, как указать альтернативные разделители, такие как точки, пробелы, апострофы или подчеркивания. Приложения с учетом локали должны использовать существующий спецификатор формата *n*, который уже имеет некоторую поддержку разделителей тысяч.

source: :pep:`378` - Format Specifier for Thousands Separator
ru: :pep:`378` - Описатель формата для разделителя тысяч

source: PEP written by Raymond Hettinger and implemented by Eric Smith and Mark Dickinson.
ru: PEP написан Рэймондом Хеттингером и реализован Эриком Смитом и Марком Дикинсоном.

source: Other Language Changes
ru: Другие языковые изменения

source: Some smaller changes made to the core Python language are:
ru: Некоторые небольшие изменения, внесенные в основной язык Python:

source: Directories and zip archives containing a :file:`__main__.py` file can now be executed directly by passing their name to the interpreter. The directory/zipfile is automatically inserted as the first entry in sys.path. (Suggestion and initial patch by Andy Chu; revised patch by Phillip J. Eby and Nick Coghlan; :issue:`1739468`.)
ru: Каталоги и zip-архивы, содержащие файл :file:`__main__.py`, теперь можно запускать напрямую, передав их имя интерпретатору. Каталог/zip-файл автоматически вставляется в качестве первой записи в sys.path. (Предложение и первоначальный патч Энди Чу; исправленный патч Филиппа Дж. Эби и Ника Коглана; :issue:`1739468`.)

source: The :func:`int` type gained a ``bit_length`` method that returns the number of bits necessary to represent its argument in binary::
ru: Тип :func:`int` получил метод ``bit_length``, который возвращает количество битов, необходимое для представления его аргумента в двоичном виде:

source: (Contributed by Fredrik Johansson, Victor Stinner, Raymond Hettinger, and Mark Dickinson; :issue:`3439`.)
ru: (Предоставлено Фредриком Йоханссоном, Виктором Стиннером, Рэймондом Хеттингером и Марком Дикинсоном; :issue:`3439`.)

source: The fields in :func:`format` strings can now be automatically numbered::
ru: Поля в строках :func:`format` теперь могут автоматически нумероваться::

source: Formerly, the string would have required numbered fields such as: ``'Sir {0} of {1}'``.
ru: Раньше для строки требовались пронумерованные поля, такие как: ``'Сэр {0} из {1}'``.

source: (Contributed by Eric Smith; :issue:`5237`.)
ru: (Предоставлено Эриком Смитом; :issue:`5237`.)

source: The :func:`!string.maketrans` function is deprecated and is replaced by new static methods, :meth:`bytes.maketrans` and :meth:`bytearray.maketrans`. This change solves the confusion around which types were supported by the :mod:`string` module. Now, :class:`str`, :class:`bytes`, and :class:`bytearray` each have their own **maketrans** and **translate** methods with intermediate translation tables of the appropriate type.
ru: Функция :func:`!string.maketrans` устарела и заменена новыми статическими методами: :meth:`bytes.maketrans` и :meth:`bytearray.maketrans`. Это изменение решает путаницу, связанную с тем, какие типы поддерживаются модулем :mod:`string`. Теперь каждый из :class:`str`, :class:`bytes` и :class:`bytearray` имеет свои собственные методы **maketrans** и **translate** с промежуточными таблицами перевода соответствующего типа.

source: (Contributed by Georg Brandl; :issue:`5675`.)
ru: (Предоставлено Георгом Брандлом; :issue:`5675`.)

source: The syntax of the :keyword:`with` statement now allows multiple context managers in a single statement::
ru: Синтаксис оператора :keyword:`with` теперь позволяет использовать несколько менеджеров контекста в одном операторе::

source: With the new syntax, the :func:`!contextlib.nested` function is no longer needed and is now deprecated.
ru: С новым синтаксисом функция :func:`!contextlib.nested` больше не нужна и объявлена ​​устаревшей.

source: (Contributed by Georg Brandl and Mattias Brändström; `appspot issue 53094 <https://codereview.appspot.com/53094>`_.)
ru: (Предоставлено Георгом Брандлом и Маттиасом Брендстремом; `appspot Issue 53094 <https://codereview.appspot.com/53094>`_.)

source: ``round(x, n)`` now returns an integer if *x* is an integer. Previously it returned a float::
ru: ``round(x, n)`` теперь возвращает целое число, если *x* является целым числом. Раньше он возвращал число с плавающей запятой::

source: (Contributed by Mark Dickinson; :issue:`4707`.)
ru: (Предоставлено Марком Дикинсоном; :issue:`4707`.)

source: Python now uses David Gay's algorithm for finding the shortest floating-point representation that doesn't change its value. This should help mitigate some of the confusion surrounding binary floating-point numbers.
ru: Python теперь использует алгоритм Дэвида Гэя для поиска кратчайшего представления с плавающей запятой, которое не меняет своего значения. Это должно помочь смягчить некоторую путаницу, связанную с двоичными числами с плавающей запятой.

source: The significance is easily seen with a number like ``1.1`` which does not have an exact equivalent in binary floating point. Since there is no exact equivalent, an expression like ``float('1.1')`` evaluates to the nearest representable value which is ``0x1.199999999999ap+0`` in hex or ``1.100000000000000088817841970012523233890533447265625`` in decimal. That nearest value was and still is used in subsequent floating-point calculations.
ru: Значение легко увидеть по числу типа «1.1», которое не имеет точного эквивалента в двоичном формате с плавающей запятой. Поскольку точного эквивалента не существует, выражение, такое как «float (» 1,1 ') `` Оценивается на ближайшее представительное значение, которое составляет `` 0x1.199999999999AP+0`` в HEX или `` 1,100000000000000000881784197001252333333333444881784197001252333333434444444444444444444444444444444444444444444444444444444444444444444444444444444н4н4н4н4н4н4н4н4н4н4н4н4н4н4н4н4н4н4а43434444888тели. Это ближайшее значение использовалось и до сих пор используется в последующих вычислениях с плавающей запятой.

source: What is new is how the number gets displayed. Formerly, Python used a simple approach. The value of ``repr(1.1)`` was computed as ``format(1.1, '.17g')`` which evaluated to ``'1.1000000000000001'``. The advantage of using 17 digits was that it relied on IEEE-754 guarantees to assure that ``eval(repr(1.1))`` would round-trip exactly to its original value. The disadvantage is that many people found the output to be confusing (mistaking intrinsic limitations of binary floating-point representation as being a problem with Python itself).
ru: Новым является то, как отображается число. Раньше Python использовал простой подход. Значение ``repr(1.1)`` было вычислено как ``format(1.1, '.17g')``, которое вычислено как ``'1.1000000000000001'``. Преимущество использования 17 цифр заключалось в том, что оно опиралось на гарантии IEEE-754, гарантирующие, что ``eval(repr(1.1))`` будет возвращаться точно к исходному значению. Недостаток заключается в том, что многие люди сочли результат запутанным (приняв внутренние ограничения двоичного представления с плавающей запятой за проблему самого Python).

source: The new algorithm for ``repr(1.1)`` is smarter and returns ``'1.1'``. Effectively, it searches all equivalent string representations (ones that get stored with the same underlying float value) and returns the shortest representation.
ru: Новый алгоритм repr(1.1) умнее и возвращает 1.1. По сути, он ищет все эквивалентные строковые представления (те, которые хранятся с одним и тем же базовым значением с плавающей запятой) и возвращает самое короткое представление.

source: The new algorithm tends to emit cleaner representations when possible, but it does not change the underlying values. So, it is still the case that ``1.1 + 2.2 != 3.3`` even though the representations may suggest otherwise.
ru: Новый алгоритм имеет тенденцию выдавать более чистые представления, когда это возможно, но не меняет базовые значения. Таким образом, «1,1 + 2,2 != 3,3» по-прежнему имеет место, хотя представления могут предполагать иное.

source: The new algorithm depends on certain features in the underlying floating-point implementation. If the required features are not found, the old algorithm will continue to be used. Also, the text pickle protocols assure cross-platform portability by using the old algorithm.
ru: Новый алгоритм зависит от определенных функций базовой реализации операций с плавающей запятой. Если необходимые функции не будут найдены, старый алгоритм продолжит использоваться. Кроме того, протоколы травления текста обеспечивают межплатформенную переносимость за счет использования старого алгоритма.

source: (Contributed by Eric Smith and Mark Dickinson; :issue:`1580`)
ru: (Предоставлено Эриком Смитом и Марком Дикинсоном; :issue:`1580`)

source: New, Improved, and Deprecated Modules
ru: Новые, улучшенные и устаревшие модули

source: Added a :class:`collections.Counter` class to support convenient counting of unique items in a sequence or iterable::
ru: Добавлен класс :class:`collections.Counter` для поддержки удобного подсчета уникальных элементов в последовательности или итерации::

source: (Contributed by Raymond Hettinger; :issue:`1696199`.)
ru: (Предоставлено Рэймондом Хеттингером; :issue:`1696199`.)

source: Added a new module, :mod:`tkinter.ttk` for access to the Tk themed widget set. The basic idea of ttk is to separate, to the extent possible, the code implementing a widget's behavior from the code implementing its appearance.
ru: Добавлен новый модуль :mod:`tkinter.ttk` для доступа к набору виджетов на тему Tk. Основная идея ttk состоит в том, чтобы отделить, насколько это возможно, код, реализующий поведение виджета, от кода, реализующего его внешний вид.

source: (Contributed by Guilherme Polo; :issue:`2983`.)
ru: (Предоставлено Гильерме Поло; :issue:`2983`.)

source: The :class:`gzip.GzipFile` and :class:`bz2.BZ2File` classes now support the context management protocol::
ru: Классы :class:`gzip.GzipFile` и :class:`bz2.BZ2File` теперь поддерживают протокол управления контекстом:

source: (Contributed by Antoine Pitrou.)
ru: (Предоставлено Антуаном Питру.)

source: The :mod:`decimal` module now supports methods for creating a decimal object from a binary :class:`float`. The conversion is exact but can sometimes be surprising::
ru: Модуль :mod:`decimal` теперь поддерживает методы создания десятичного объекта из двоичного :class:`float`. Преобразование точное, но иногда может быть неожиданным::

source: The long decimal result shows the actual binary fraction being stored for *1.1*. The fraction has many digits because *1.1* cannot be exactly represented in binary.
ru: Длинный десятичный результат показывает фактическую двоичную дробь, сохраненную для *1,1*. Дробь имеет много цифр, поскольку *1.1* не может быть точно представлено в двоичном формате.

source: (Contributed by Raymond Hettinger and Mark Dickinson.)
ru: (Сообщили Рэймонд Хеттингер и Марк Дикинсон.)

source: The :mod:`itertools` module grew two new functions. The :func:`itertools.combinations_with_replacement` function is one of four for generating combinatorics including permutations and Cartesian products. The :func:`itertools.compress` function mimics its namesake from APL. Also, the existing :func:`itertools.count` function now has an optional *step* argument and can accept any type of counting sequence including :class:`fractions.Fraction` and :class:`decimal.Decimal`::
ru: В модуле :mod:`itertools` появились две новые функции. Функция :func:`itertools.combinations_with_replacement` — одна из четырех функций для генерации комбинаторики, включая перестановки и декартовы произведения. Функция :func:`itertools.compress` имитирует свою тезку из APL. Кроме того, существующая функция :func:`itertools.count` теперь имеет необязательный аргумент *step* и может принимать любой тип последовательности счета, включая :class:`fractions.Fraction` и :class:`decimal.Decimal`::

source: (Contributed by Raymond Hettinger.)
ru: (Предоставлено Раймондом Хеттингером.)

source: :func:`collections.namedtuple` now supports a keyword argument *rename* which lets invalid fieldnames be automatically converted to positional names in the form _0, _1, etc. This is useful when the field names are being created by an external source such as a CSV header, SQL field list, or user input::
ru: :func:`collections.namedtuple` теперь поддерживает аргумент ключевого слова *rename*, который позволяет автоматически преобразовывать недопустимые имена полей в позиционные имена в форме _0, _1 и т. д. Это полезно, когда имена полей создаются внешним источником, например в виде заголовка CSV, списка полей SQL или пользовательского ввода::

source: (Contributed by Raymond Hettinger; :issue:`1818`.)
ru: (Предоставлено Рэймондом Хеттингером; :issue:`1818`.)

source: The :func:`re.sub`, :func:`re.subn` and :func:`re.split` functions now accept a flags parameter.
ru: Функции :func:`re.sub`, :func:`re.subn` и :func:`re.split` теперь принимают параметр flags.

source: (Contributed by Gregory Smith.)
ru: (Предоставлено Грегори Смитом.)

source: The :mod:`logging` module now implements a simple :class:`logging.NullHandler` class for applications that are not using logging but are calling library code that does. Setting-up a null handler will suppress spurious warnings such as "No handlers could be found for logger foo"::
ru: Модуль :mod:`logging` теперь реализует простой класс :class:`logging.NullHandler` для приложений, которые не используют ведение журнала, но вызывают код библиотеки, который его использует. Установка нулевого обработчика подавляет ложные предупреждения, такие как «Не удалось найти обработчики для logger foo»::

source: (Contributed by Vinay Sajip; :issue:`4384`).
ru: (Предоставлено Винаем Саджипом; :issue:`4384`).

source: The :mod:`runpy` module which supports the ``-m`` command line switch now supports the execution of packages by looking for and executing a ``__main__`` submodule when a package name is supplied.
ru: Модуль :mod:`runpy`, поддерживающий ключ командной строки ``-m``, теперь поддерживает выполнение пакетов путем поиска и выполнения подмодуля ``__main__`` при указании имени пакета.

source: (Contributed by Andi Vajda; :issue:`4195`.)
ru: (Предоставлено Энди Вайдой; :issue:`4195`.)

source: The :mod:`pdb` module can now access and display source code loaded via :mod:`zipimport` (or any other conformant :pep:`302` loader).
ru: Модуль :mod:`pdb` теперь может получать доступ и отображать исходный код, загруженный через :mod:`zipimport` (или любой другой совместимый :pep:`302` загрузчик).

source: :class:`functools.partial` objects can now be pickled.
ru: Объекты :class:`functools.partial` теперь можно мариновать.

source: (Suggested by Antoine Pitrou and Jesse Noller. Implemented by Jack Diederich; :issue:`5228`.)
ru: (Предложено Антуаном Питру и Джесси Ноллером. Реализовано Джеком Дидерихом; :issue:`5228`.)

source: Add :mod:`pydoc` help topics for symbols so that ``help('@')`` works as expected in the interactive environment.
ru: Добавьте разделы справки :mod:`pydoc` для символов, чтобы ``help('@')`` работал должным образом в интерактивной среде.

source: (Contributed by David Laban; :issue:`4739`.)
ru: (Предоставлено Дэвидом Лабаном; :issue:`4739`.)

source: The :mod:`unittest` module now supports skipping individual tests or classes of tests. And it supports marking a test as an expected failure, a test that is known to be broken, but shouldn't be counted as a failure on a TestResult::
ru: Модуль :mod:`unittest` теперь поддерживает пропуск отдельных тестов или классов тестов. И он поддерживает пометку теста как ожидаемого сбоя, теста, который, как известно, сломан, но не должен считаться сбоем в TestResult::

source: Also, tests for exceptions have been builtout to work with context managers using the :keyword:`with` statement::
ru: Кроме того, были созданы тесты на исключения для работы с контекстными менеджерами с использованием оператора :keyword:`with`::

source: In addition, several new assertion methods were added including :meth:`~unittest.TestCase.assertSetEqual`, :meth:`~unittest.TestCase.assertDictEqual`, :meth:`!assertDictContainsSubset`, :meth:`~unittest.TestCase.assertListEqual`, :meth:`~unittest.TestCase.assertTupleEqual`, :meth:`~unittest.TestCase.assertSequenceEqual`, :meth:`assertRaisesRegexp() <unittest.TestCase.assertRaisesRegex>`, :meth:`~unittest.TestCase.assertIsNone`, and :meth:`~unittest.TestCase.assertIsNotNone`.
ru: Кроме того, было добавлено несколько новых методов утверждения, включая :meth:`~unittest.TestCase.assertSetEqual`, :meth:`~unittest.TestCase.assertDictEqual`, :meth:`!assertDictContainsSubset`, :meth:`~unittest.TestCase` .assertListEqual`, :meth:`~unittest.TestCase.assertTupleEqual`, :meth:`~unittest.TestCase.assertSequenceEqual`, :meth:`assertRaisesRegexp() <unittest.TestCase.assertRaisesRegex>`, :meth:`~unittest .TestCase.assertIsNone` и :meth:`~unittest.TestCase.assertIsNotNone`.

source: (Contributed by Benjamin Peterson and Antoine Pitrou.)
ru: (Сообщили Бенджамин Петерсон и Антуан Питру.)

source: The :mod:`io` module has three new constants for the :meth:`~io.IOBase.seek` method: :data:`~os.SEEK_SET`, :data:`~os.SEEK_CUR`, and :data:`~os.SEEK_END`.
ru: Модуль :mod:`io` имеет три новые константы для метода :meth:`~io.IOBase.seek`: :data:`~os.SEEK_SET`, :data:`~os.SEEK_CUR` и :data. :`~os.SEEK_END`.

source: The :data:`sys.version_info` tuple is now a named tuple::
ru: Кортеж :data:`sys.version_info` теперь является именованным кортежем::

source: (Contributed by Ross Light; :issue:`4285`.)
ru: (Предоставлено Россом Лайтом; :issue:`4285`.)

source: The :mod:`!nntplib` and :mod:`imaplib` modules now support IPv6.
ru: Модули :mod:`!nntplib` и :mod:`imaplib` теперь поддерживают IPv6.

source: (Contributed by Derek Morr; :issue:`1655` and :issue:`1664`.)
ru: (Предоставлено Дереком Морром; :issue:`1655` и :issue:`1664`.)
