Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/whatsnew/3.1.po
Languages: ru

source: The :mod:`pickle` module has been adapted for better interoperability with Python 2.x when used with protocol 2 or lower. The reorganization of the standard library changed the formal reference for many objects. For example, ``__builtin__.set`` in Python 2 is called ``builtins.set`` in Python 3. This change confounded efforts to share data between different versions of Python. But now when protocol 2 or lower is selected, the pickler will automatically use the old Python 2 names for both loading and dumping. This remapping is turned-on by default but can be disabled with the *fix_imports* option::
ru: Модуль :mod:`pickle` был адаптирован для лучшей совместимости с Python 2.x при использовании с протоколом 2 или ниже. Реорганизация стандартной библиотеки изменила формальные ссылки на многие объекты. Например, ``__builtin__.set`` в Python 2 называется ``builtins.set`` в Python 3. Это изменение свело на нет усилия по совместному использованию данных между различными версиями Python. Но теперь, когда выбран протокол 2 или ниже, сборщик будет автоматически использовать старые имена Python 2 как для загрузки, так и для дампа. Это переназначение включено по умолчанию, но его можно отключить с помощью опции *fix_imports*::

source: An unfortunate but unavoidable side-effect of this change is that protocol 2 pickles produced by Python 3.1 won't be readable with Python 3.0. The latest pickle protocol, protocol 3, should be used when migrating data between Python 3.x implementations, as it doesn't attempt to remain compatible with Python 2.x.
ru: Неудачным, но неизбежным побочным эффектом этого изменения является то, что огурцы протокола 2, созданные Python 3.1, не будут читабельны Python 3.0. Последний протокол рассола, протокол 3, следует использовать при переносе данных между реализациями Python 3.x, поскольку он не пытается оставаться совместимым с Python 2.x.

source: (Contributed by Alexandre Vassalotti and Antoine Pitrou, :issue:`6137`.)
ru: (Предоставлено Александром Вассалотти и Антуаном Питру, :issue:`6137`.)

source: A new module, :mod:`importlib` was added. It provides a complete, portable, pure Python reference implementation of the :keyword:`import` statement and its counterpart, the :func:`__import__` function. It represents a substantial step forward in documenting and defining the actions that take place during imports.
ru: Был добавлен новый модуль :mod:`importlib`. Он предоставляет полную, переносимую, эталонную реализацию на чистом Python оператора :keyword:`import` и его аналога, функции :func:`__import__`. Это представляет собой существенный шаг вперед в документировании и определении действий, происходящих во время импорта.

source: (Contributed by Brett Cannon.)
ru: (Предоставлено Бреттом Кэнноном.)

source: Optimizations
ru: Оптимизации

source: Major performance enhancements have been added:
ru: Были добавлены важные улучшения производительности:

source: The new I/O library (as defined in :pep:`3116`) was mostly written in Python and quickly proved to be a problematic bottleneck in Python 3.0. In Python 3.1, the I/O library has been entirely rewritten in C and is 2 to 20 times faster depending on the task at hand. The pure Python version is still available for experimentation purposes through the ``_pyio`` module.
ru: Новая библиотека ввода-вывода (как она определена в :pep:`3116`) была в основном написана на Python и быстро оказалась узким местом в Python 3.0. В Python 3.1 библиотека ввода-вывода была полностью переписана на C и работает от 2 до 20 раз быстрее в зависимости от поставленной задачи. Чистая версия Python по-прежнему доступна для экспериментов через модуль ``_pyio``.

source: (Contributed by Amaury Forgeot d'Arc and Antoine Pitrou.)
ru: (Сообщили Амори Форжо д'Арк и Антуан Питру.)

source: Added a heuristic so that tuples and dicts containing only untrackable objects are not tracked by the garbage collector. This can reduce the size of collections and therefore the garbage collection overhead on long-running programs, depending on their particular use of datatypes.
ru: Добавлена ​​эвристика, благодаря которой сборщик мусора не отслеживает кортежи и словари, содержащие только неотслеживаемые объекты. Это может уменьшить размер коллекций и, следовательно, накладные расходы на сбор мусора в долговыполняющихся программах, в зависимости от конкретного использования ими типов данных.

source: (Contributed by Antoine Pitrou, :issue:`4688`.)
ru: (Предоставлено Антуаном Питру, :issue:`4688`.)

source: Enabling a configure option named ``--with-computed-gotos`` on compilers that support it (notably: gcc, SunPro, icc), the bytecode evaluation loop is compiled with a new dispatch mechanism which gives speedups of up to 20%, depending on the system, the compiler, and the benchmark.
ru: При включении опции конфигурации с именем ``--with-computed-gotos`` на компиляторах, которые ее поддерживают (в частности: gcc, SunPro, icc), цикл оценки байт-кода компилируется с новым механизмом диспетчеризации, который дает ускорение до 20%. , в зависимости от системы, компилятора и эталона.

source: (Contributed by Antoine Pitrou along with a number of other participants, :issue:`4753`).
ru: (Предоставлено Антуаном Питру вместе с рядом других участников, :issue:`4753`).

source: The decoding of UTF-8, UTF-16 and LATIN-1 is now two to four times faster.
ru: Декодирование UTF-8, UTF-16 и LATIN-1 теперь происходит в два-четыре раза быстрее.

source: (Contributed by Antoine Pitrou and Amaury Forgeot d'Arc, :issue:`4868`.)
ru: (Сообщили Антуан Питру и Амори Форжо д'Арк, :issue:`4868`.)

source: The :mod:`json` module now has a C extension to substantially improve its performance. In addition, the API was modified so that json works only with :class:`str`, not with :class:`bytes`. That change makes the module closely match the `JSON specification <https://json.org/>`_ which is defined in terms of Unicode.
ru: Модуль :mod:`json` теперь имеет расширение C, что существенно повышает его производительность. Кроме того, API был изменен так, что json работает только с :class:`str`, а не с :class:`bytes`. Это изменение делает модуль более близким к спецификации JSON <https://json.org/>`_, которая определена в терминах Unicode.

source: (Contributed by Bob Ippolito and converted to Py3.1 by Antoine Pitrou and Benjamin Peterson; :issue:`4136`.)
ru: (Разработано Бобом Ипполито и преобразовано в Py3.1 Антуаном Питру и Бенджамином Петерсоном; :issue:`4136`.)

source: Unpickling now interns the attribute names of pickled objects. This saves memory and allows pickles to be smaller.
ru: При распаковке теперь интернируются имена атрибутов маринованных объектов. Это экономит память и позволяет уменьшить размер соленых огурцов.

source: (Contributed by Jake McGuire and Antoine Pitrou; :issue:`5084`.)
ru: (Сообщили Джейк Макгуайр и Антуан Питру; :issue:`5084`.)

source: IDLE's format menu now provides an option to strip trailing whitespace from a source file.
ru: Меню формата IDLE теперь предоставляет возможность удалить конечные пробелы из исходного файла.

source: (Contributed by Roger D. Serwy; :issue:`5150`.)
ru: (Предоставлено Роджером Д. Серви; :issue:`5150`.)

source: Build and C API Changes
ru: Изменения API сборки и C

source: Changes to Python's build process and to the C API include:
ru: Изменения в процессе сборки Python и C API включают в себя:

source: Integers are now stored internally either in base ``2**15`` or in base ``2**30``, the base being determined at build time. Previously, they were always stored in base ``2**15``. Using base ``2**30`` gives significant performance improvements on 64-bit machines, but benchmark results on 32-bit machines have been mixed. Therefore, the default is to use base ``2**30`` on 64-bit machines and base ``2**15`` on 32-bit machines; on Unix, there's a new configure option ``--enable-big-digits`` that can be used to override this default.
ru: Целые числа теперь хранятся внутри либо в базе 2**15, либо в базе 2**30, причем база определяется во время сборки. Раньше они всегда хранились в базе ``2**15``. Использование базы «2**30» дает значительный прирост производительности на 64-битных машинах, но результаты тестов на 32-битных машинах неоднозначны. Поэтому по умолчанию используется база «2**30» на 64-битных машинах и база «2**15» на 32-битных машинах; в Unix появилась новая опция конфигурации ``--enable-big-digits``, которую можно использовать для переопределения этого значения по умолчанию.

source: Apart from the performance improvements this change should be invisible to end users, with one exception: for testing and debugging purposes there's a new :data:`sys.int_info` that provides information about the internal format, giving the number of bits per digit and the size in bytes of the C type used to store each digit::
ru: Помимо улучшения производительности, это изменение должно быть незаметно для конечных пользователей, за одним исключением: для целей тестирования и отладки существует новый файл :data:`sys.int_info`, который предоставляет информацию о внутреннем формате, указывая количество бит на цифру и размер в байтах типа C, используемый для хранения каждой цифры::

source: (Contributed by Mark Dickinson; :issue:`4258`.)
ru: (Предоставлено Марком Дикинсоном; :issue:`4258`.)

source: The :c:func:`PyLong_AsUnsignedLongLong()` function now handles a negative *pylong* by raising :exc:`OverflowError` instead of :exc:`TypeError`.
ru: Функция :c:func:`PyLong_AsUnsignedLongLong()` теперь обрабатывает отрицательное значение *pylong*, вызывая :exc:`OverflowError` вместо :exc:`TypeError`.

source: (Contributed by Mark Dickinson and Lisandro Dalcrin; :issue:`5175`.)
ru: (Сообщили Марк Дикинсон и Лисандро Далкрин; :issue:`5175`.)

source: Deprecated :c:func:`!PyNumber_Int`. Use :c:func:`PyNumber_Long` instead.
ru: Устарело :c:func:`!PyNumber_Int`. Вместо этого используйте :c:func:`PyNumber_Long`.

source: (Contributed by Mark Dickinson; :issue:`4910`.)
ru: (Предоставлено Марком Дикинсоном; :issue:`4910`.)

source: Added a new :c:func:`PyOS_string_to_double` function to replace the deprecated functions :c:func:`!PyOS_ascii_strtod` and :c:func:`!PyOS_ascii_atof`.
ru: Добавлена ​​новая функция :c:func:`PyOS_string_to_double` для замены устаревших функций :c:func:`!PyOS_ascii_strtod` и :c:func:`!PyOS_ascii_atof`.

source: (Contributed by Mark Dickinson; :issue:`5914`.)
ru: (Предоставлено Марком Дикинсоном; :issue:`5914`.)

source: Added :c:type:`PyCapsule` as a replacement for the :c:type:`!PyCObject` API. The principal difference is that the new type has a well defined interface for passing typing safety information and a less complicated signature for calling a destructor. The old type had a problematic API and is now deprecated.
ru: Добавлен :c:type:`PyCapsule` в качестве замены API :c:type:`!PyCObject`. Принципиальное отличие состоит в том, что новый тип имеет четко определенный интерфейс для передачи информации о безопасности ввода и менее сложную сигнатуру для вызова деструктора. Старый тип имел проблемный API и теперь устарел.

source: (Contributed by Larry Hastings; :issue:`5630`.)
ru: (Предоставлено Ларри Гастингсом; :issue:`5630`.)

source: Porting to Python 3.1
ru: Портирование на Python 3.1

source: This section lists previously described changes and other bugfixes that may require changes to your code:
ru: В этом разделе перечислены ранее описанные изменения и другие исправления ошибок, которые могут потребовать внесения изменений в ваш код:

source: The new floating-point string representations can break existing doctests. For example::
ru: Новые представления строк с плавающей запятой могут нарушить существующие документы. Например::

source: The automatic name remapping in the pickle module for protocol 2 or lower can make Python 3.1 pickles unreadable in Python 3.0. One solution is to use protocol 3. Another solution is to set the *fix_imports* option to ``False``. See the discussion above for more details.
ru: Автоматическое переназначение имен в модуле Pickle для протокола 2 или ниже может сделать Pickles Python 3.1 нечитаемыми в Python 3.0. Одним из решений является использование протокола 3. Другое решение — установить для параметра *fix_imports* значение «False». Подробности смотрите в обсуждении выше.
