Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/whatsnew/3.12.po
Languages: ru

source: The :c:func:`PyUnicode_FSDecoder` function no longer accepts bytes-like paths, like :class:`bytearray` and :class:`memoryview` types: only the exact :class:`bytes` type is accepted for bytes strings. (Contributed by Victor Stinner in :gh:`98393`.)
ru: Функция :c:func:`PyUnicode_FSDecoder` больше не принимает байтовые пути, такие как типы :class:`bytearray` и :class:`memoryview`: для байтовых строк принимается только точный тип :class:`bytes`. (Предоставлено Виктором Стиннером в :gh:`98393`.)

source: The :c:macro:`Py_CLEAR`, :c:macro:`Py_SETREF` and :c:macro:`Py_XSETREF` macros now only evaluate their arguments once. If an argument has side effects, these side effects are no longer duplicated. (Contributed by Victor Stinner in :gh:`98724`.)
ru: Макросы :c:macro:`Py_CLEAR`, :c:macro:`Py_SETREF` и :c:macro:`Py_XSETREF` теперь оценивают свои аргументы только один раз. Если аргумент имеет побочные эффекты, эти побочные эффекты больше не дублируются. (Предоставлено Виктором Стиннером в :gh:`98724`.)

source: The interpreter's error indicator is now always normalized. This means that :c:func:`PyErr_SetObject`, :c:func:`PyErr_SetString` and the other functions that set the error indicator now normalize the exception before storing it. (Contributed by Mark Shannon in :gh:`101578`.)
ru: Индикатор ошибки интерпретатора теперь всегда нормализуется. Это означает, что :c:func:`PyErr_SetObject`, :c:func:`PyErr_SetString` и другие функции, устанавливающие индикатор ошибки, теперь нормализуют исключение перед его сохранением. (Предоставлено Марком Шенноном в :gh:`101578`.)

source: ``_Py_RefTotal`` is no longer authoritative and only kept around for ABI compatibility. Note that it is an internal global and only available on debug builds. If you happen to be using it then you'll need to start using ``_Py_GetGlobalRefTotal()``.
ru: ``_Py_RefTotal`` больше не является авторитетным и сохраняется только для совместимости с ABI. Обратите внимание, что это внутренний глобальный параметр, доступный только в отладочных сборках. Если вы его используете, вам нужно будет начать использовать ``_Py_GetGlobalRefTotal()``.

source: The following functions now select an appropriate metaclass for the newly created type:
ru: Следующие функции теперь выбирают соответствующий метакласс для вновь созданного типа:

source: Creating classes whose metaclass overrides :c:member:`~PyTypeObject.tp_new` is deprecated, and in Python 3.14+ it will be disallowed. Note that these functions ignore ``tp_new`` of the metaclass, possibly allowing incomplete initialization.
ru: Создание классов, метакласс которых переопределяет :c:member:`~PyTypeObject.tp_new`, объявлено устаревшим, а в Python 3.14+ оно будет запрещено. Обратите внимание, что эти функции игнорируют ``tp_new`` метакласса, что может привести к неполной инициализации.

source: Note that :c:func:`PyType_FromMetaclass` (added in Python 3.12) already disallows creating classes whose metaclass overrides ``tp_new`` (:meth:`~object.__new__` in Python).
ru: Обратите внимание, что :c:func:`PyType_FromMetaclass` (добавленный в Python 3.12) уже запрещает создание классов, метакласс которых переопределяет ``tp_new`` (:meth:`~object.__new__` в Python).

source: Since ``tp_new`` overrides almost everything ``PyType_From*`` functions do, the two are incompatible with each other. The existing behavior -- ignoring the metaclass for several steps of type creation -- is unsafe in general, since (meta)classes assume that ``tp_new`` was called. There is no simple general workaround. One of the following may work for you:
ru: Поскольку ``tp_new`` переопределяет почти все, что делают функции ``PyType_From*``, они несовместимы друг с другом. Существующее поведение — игнорирование метакласса на нескольких этапах создания типа — в целом небезопасно, поскольку (мета)классы предполагают, что был вызван ``tp_new``. Простого общего решения не существует. Вам может подойти одно из следующих действий:

source: If you control the metaclass, avoid using ``tp_new`` in it:
ru: Если вы управляете метаклассом, избегайте использования в нем tp_new:

source: If initialization can be skipped, it can be done in :c:member:`~PyTypeObject.tp_init` instead.
ru: Если инициализацию можно пропустить, ее можно выполнить в :c:member:`~PyTypeObject.tp_init`.

source: If the metaclass doesn't need to be instantiated from Python, set its ``tp_new`` to ``NULL`` using the :c:macro:`Py_TPFLAGS_DISALLOW_INSTANTIATION` flag. This makes it acceptable for ``PyType_From*`` functions.
ru: Если метакласс не нуждается в создании экземпляра из Python, установите для его ``tp_new`` значение ``NULL`` с помощью флага :c:macro:`Py_TPFLAGS_DISALLOW_INSTANTIATION`. Это делает его приемлемым для функций PyType_From*.

source: Avoid ``PyType_From*`` functions: if you don't need C-specific features (slots or setting the instance size), create types by :ref:`calling <call>` the metaclass.
ru: Избегайте функций ``PyType_From*``: если вам не нужны специфичные для C функции (слоты или установка размера экземпляра), создавайте типы, вызывая <call>` метакласс.

source: If you *know* the ``tp_new`` can be skipped safely, filter the deprecation warning out using :func:`warnings.catch_warnings` from Python.
ru: Если вы *знаете*, что ``tp_new`` можно безопасно пропустить, отфильтруйте предупреждение об устаревании, используя :func:`warnings.catch_warnings` из Python.

source: :c:var:`PyOS_InputHook` and :c:var:`PyOS_ReadlineFunctionPointer` are no longer called in :ref:`subinterpreters <sub-interpreter-support>`. This is because clients generally rely on process-wide global state (since these callbacks have no way of recovering extension module state).
ru: :c:var:`PyOS_InputHook` и :c:var:`PyOS_ReadlineFunctionPointer` больше не вызываются в :ref:`subinterpreters <sub-interpreter-support>`. Это связано с тем, что клиенты обычно полагаются на глобальное состояние всего процесса (поскольку эти обратные вызовы не имеют возможности восстановить состояние модуля расширения).

source: This also avoids situations where extensions may find themselves running in a subinterpreter that they don't support (or haven't yet been loaded in). See :gh:`104668` for more info.
ru: Это также позволяет избежать ситуаций, когда расширения могут работать в субинтерпретаторе, который они не поддерживают (или еще не загружены). См. :gh:`104668` для получения дополнительной информации.

source: :c:struct:`PyLongObject` has had its internals changed for better performance. Although the internals of :c:struct:`PyLongObject` are private, they are used by some extension modules. The internal fields should no longer be accessed directly, instead the API functions beginning ``PyLong_...`` should be used instead. Two new *unstable* API functions are provided for efficient access to the value of :c:struct:`PyLongObject`\s which fit into a single machine word:
ru: Внутренние элементы :c:struct:`PyLongObject` были изменены для повышения производительности. Хотя внутренние компоненты :c:struct:`PyLongObject` являются частными, они используются некоторыми модулями расширения. К внутренним полям больше нельзя обращаться напрямую, вместо этого следует использовать функции API, начинающиеся с ``PyLong_...``. Для эффективного доступа к значению :c:struct:`PyLongObject`\s, которое умещается в одно машинное слово, предусмотрены две новые *нестабильные* API-функции:

source: Custom allocators, set via :c:func:`PyMem_SetAllocator`, are now required to be thread-safe, regardless of memory domain. Allocators that don't have their own state, including "hooks", are not affected. If your custom allocator is not already thread-safe and you need guidance then please create a new GitHub issue and CC ``@ericsnowcurrently``.
ru: Пользовательские распределители, установленные через :c:func:`PyMem_SetAllocator`, теперь должны быть потокобезопасными, независимо от домена памяти. Распределители, не имеющие собственного состояния, включая «крючки», не затрагиваются. Если ваш пользовательский распределитель еще не поддерживает потокобезопасность и вам нужны рекомендации, создайте новую задачу на GitHub и CC ``@ericsnowcurrently``.

source: In accordance with :pep:`699`, the ``ma_version_tag`` field in :c:type:`PyDictObject` is deprecated for extension modules. Accessing this field will generate a compiler warning at compile time. This field will be removed in Python 3.14. (Contributed by Ramvikrams and Kumar Aditya in :gh:`101193`. PEP by Ken Jin.)
ru: В соответствии с :pep:`699`, поле ``ma_version_tag`` в :c:type:`PyDictObject` не рекомендуется для модулей расширения. Доступ к этому полю приведет к генерации предупреждения компилятора во время компиляции. Это поле будет удалено в Python 3.14. (Предоставлено Рамвикрамсом и Кумаром Адитьей в :gh:`101193`. PEP Кена Джина.)

source: Deprecate global configuration variable:
ru: Отменены глобальные переменные конфигурации:

source: :c:var:`Py_DebugFlag`: use :c:member:`PyConfig.parser_debug`
ru: :c:var:`Py_DebugFlag`: использовать :c:member:`PyConfig.parser_debug`

source: :c:var:`Py_VerboseFlag`: use :c:member:`PyConfig.verbose`
ru: :c:var:`Py_VerboseFlag`: использовать :c:member:`PyConfig.verbose`

source: :c:var:`Py_QuietFlag`: use :c:member:`PyConfig.quiet`
ru: :c:var:`Py_QuietFlag`: использовать :c:member:`PyConfig.quiet`

source: :c:var:`Py_InteractiveFlag`: use :c:member:`PyConfig.interactive`
ru: :c:var:`Py_InteractiveFlag`: использовать :c:member:`PyConfig.interactive`

source: :c:var:`Py_InspectFlag`: use :c:member:`PyConfig.inspect`
ru: :c:var:`Py_InspectFlag`: использовать :c:member:`PyConfig.inspect`

source: :c:var:`Py_OptimizeFlag`: use :c:member:`PyConfig.optimization_level`
ru: :c:var:`Py_OptimizeFlag`: использовать :c:member:`PyConfig.optimization_level`

source: :c:var:`Py_NoSiteFlag`: use :c:member:`PyConfig.site_import`
ru: :c:var:`Py_NoSiteFlag`: использовать :c:member:`PyConfig.site_import`

source: :c:var:`Py_BytesWarningFlag`: use :c:member:`PyConfig.bytes_warning`
ru: :c:var:`Py_BytesWarningFlag`: использовать :c:member:`PyConfig.bytes_warning`

source: :c:var:`Py_FrozenFlag`: use :c:member:`PyConfig.pathconfig_warnings`
ru: :c:var:`Py_FrozenFlag`: использовать :c:member:`PyConfig.pathconfig_warnings`

source: :c:var:`Py_IgnoreEnvironmentFlag`: use :c:member:`PyConfig.use_environment`
ru: :c:var:`Py_IgnoreEnvironmentFlag`: использовать :c:member:`PyConfig.use_environment`

source: :c:var:`Py_DontWriteBytecodeFlag`: use :c:member:`PyConfig.write_bytecode`
ru: :c:var:`Py_DontWriteBytecodeFlag`: использовать :c:member:`PyConfig.write_bytecode`

source: :c:var:`Py_NoUserSiteDirectory`: use :c:member:`PyConfig.user_site_directory`
ru: :c:var:`Py_NoUserSiteDirectory`: использовать :c:member:`PyConfig.user_site_directory`

source: :c:var:`Py_UnbufferedStdioFlag`: use :c:member:`PyConfig.buffered_stdio`
ru: :c:var:`Py_UnbufferedStdioFlag`: использовать :c:member:`PyConfig.buffered_stdio`

source: :c:var:`Py_HashRandomizationFlag`: use :c:member:`PyConfig.use_hash_seed` and :c:member:`PyConfig.hash_seed`
ru: :c:var:`Py_HashRandomizationFlag`: используйте :c:member:`PyConfig.use_hash_seed` и :c:member:`PyConfig.hash_seed`

source: :c:var:`Py_IsolatedFlag`: use :c:member:`PyConfig.isolated`
ru: :c:var:`Py_IsolatedFlag`: использовать :c:member:`PyConfig.isolated`

source: :c:var:`Py_LegacyWindowsFSEncodingFlag`: use :c:member:`PyPreConfig.legacy_windows_fs_encoding`
ru: :c:var:`Py_LegacyWindowsFSEncodingFlag`: использовать :c:member:`PyPreConfig.legacy_windows_fs_encoding`

source: :c:var:`Py_LegacyWindowsStdioFlag`: use :c:member:`PyConfig.legacy_windows_stdio`
ru: :c:var:`Py_LegacyWindowsStdioFlag`: использовать :c:member:`PyConfig.legacy_windows_stdio`

source: :c:var:`!Py_FileSystemDefaultEncoding`: use :c:member:`PyConfig.filesystem_encoding`
ru: :c:var:`!Py_FileSystemDefaultEncoding`: использовать :c:member:`PyConfig.filesystem_encoding`

source: :c:var:`!Py_HasFileSystemDefaultEncoding`: use :c:member:`PyConfig.filesystem_encoding`
ru: :c:var:`!Py_HasFileSystemDefaultEncoding`: использовать :c:member:`PyConfig.filesystem_encoding`

source: :c:var:`!Py_FileSystemDefaultEncodeErrors`: use :c:member:`PyConfig.filesystem_errors`
ru: :c:var:`!Py_FileSystemDefaultEncodeErrors`: использовать :c:member:`PyConfig.filesystem_errors`

source: :c:var:`!Py_UTF8Mode`: use :c:member:`PyPreConfig.utf8_mode` (see :c:func:`Py_PreInitialize`)
ru: :c:var:`!Py_UTF8Mode`: используйте :c:member:`PyPreConfig.utf8_mode` (см. :c:func:`Py_PreInitialize`)

source: The :c:func:`Py_InitializeFromConfig` API should be used with :c:type:`PyConfig` instead. (Contributed by Victor Stinner in :gh:`77782`.)
ru: Вместо этого API :c:func:`Py_InitializeFromConfig` следует использовать с :c:type:`PyConfig`. (Предоставлено Виктором Стиннером в :gh:`77782`.)

source: Creating :c:data:`immutable types <Py_TPFLAGS_IMMUTABLETYPE>` with mutable bases is deprecated and will be disabled in Python 3.14. (:gh:`95388`)
ru: Создание :c:data:`неизменяемых типов <Py_TPFLAGS_IMMUTABLETYPE>` с изменяемыми базами устарело и будет отключено в Python 3.14. (:gh:`95388`)

source: The :file:`structmember.h` header is deprecated, though it continues to be available and there are no plans to remove it.
ru: Заголовок :file:`structmember.h` устарел, однако он по-прежнему доступен, и его удаление не планируется.

source: Its contents are now available just by including :file:`Python.h`, with a ``Py`` prefix added if it was missing:
ru: Его содержимое теперь доступно, просто включив :file:`Python.h`, с добавлением префикса ``Py``, если он отсутствовал:

source: :c:struct:`PyMemberDef`, :c:func:`PyMember_GetOne` and :c:func:`PyMember_SetOne`
ru: :c:struct:`PyMemberDef`, :c:func:`PyMember_GetOne` и :c:func:`PyMember_SetOne`

source: Type macros like :c:macro:`Py_T_INT`, :c:macro:`Py_T_DOUBLE`, etc. (previously ``T_INT``, ``T_DOUBLE``, etc.)
ru: Введите макросы, например :c:macro:`Py_T_INT`, :c:macro:`Py_T_DOUBLE` и т. д. (ранее ``T_INT``, ``T_DOUBLE`` и т. д.)

source: The flags :c:macro:`Py_READONLY` (previously ``READONLY``) and :c:macro:`Py_AUDIT_READ` (previously all uppercase)
ru: Флаги :c:macro:`Py_READONLY` (ранее ``READONLY``) и :c:macro:`Py_AUDIT_READ` (ранее все были в верхнем регистре)

source: Several items are not exposed from :file:`Python.h`:
ru: Некоторые элементы не отображаются из :file:`Python.h`:

source: :c:macro:`T_OBJECT` (use :c:macro:`Py_T_OBJECT_EX`)
ru: :c:macro:`T_OBJECT` (используйте :c:macro:`Py_T_OBJECT_EX`)

source: :c:macro:`T_NONE` (previously undocumented, and pretty quirky)
ru: :c:macro:`T_NONE` (ранее недокументированный и довольно необычный)

source: The macro ``WRITE_RESTRICTED`` which does nothing.
ru: Макрос WRITE_RESTRICTED, который ничего не делает.

source: The macros ``RESTRICTED`` and ``READ_RESTRICTED``, equivalents of :c:macro:`Py_AUDIT_READ`.
ru: Макросы ``RESTRICTED`` и ``READ_RESTRICTED``, эквиваленты :c:macro:`Py_AUDIT_READ`.

source: In some configurations, ``<stddef.h>`` is not included from :file:`Python.h`. It should be included manually when using ``offsetof()``.
ru: В некоторых конфигурациях ``<stddef.h>`` не включается в :file:`Python.h`. Его следует включать вручную при использовании offsetof().

source: The deprecated header continues to provide its original contents under the original names. Your old code can stay unchanged, unless the extra include and non-namespaced macros bother you greatly.
ru: Устаревший заголовок продолжает предоставлять свое исходное содержимое под исходными именами. Ваш старый код может оставаться неизменным, если вас сильно не беспокоят дополнительные включения и макросы без пространства имен.

source: (Contributed in :gh:`47146` by Petr Viktorin, based on earlier work by Alexander Belopolsky and Matthias Braun.)
ru: (Внесено в :gh:`47146` Петром Викторином на основе более ранних работ Александра Белопольского и Матиаса Брауна.)

source: :c:func:`PyErr_Fetch` and :c:func:`PyErr_Restore` are deprecated. Use :c:func:`PyErr_GetRaisedException` and :c:func:`PyErr_SetRaisedException` instead. (Contributed by Mark Shannon in :gh:`101578`.)
ru: :c:func:`PyErr_Fetch` и :c:func:`PyErr_Restore` устарели. Вместо этого используйте :c:func:`PyErr_GetRaizedException` и :c:func:`PyErr_SetRaizedException`. (Предоставлено Марком Шенноном в :gh:`101578`.)

source: :c:func:`!PyErr_Display` is deprecated. Use :c:func:`PyErr_DisplayException` instead. (Contributed by Irit Katriel in :gh:`102755`).
ru: :c:func:`!PyErr_Display` устарел. Вместо этого используйте :c:func:`PyErr_DisplayException`. (Предоставлено Ирит Катриэль в :gh:`102755`).

source: ``_PyErr_ChainExceptions`` is deprecated. Use ``_PyErr_ChainExceptions1`` instead. (Contributed by Irit Katriel in :gh:`102192`.)
ru: ``_PyErr_ChainExceptions`` устарел. Вместо этого используйте ``_PyErr_ChainExceptions1``. (Предоставлено Ирит Катриэль в :gh:`102192`.)

source: Using :c:func:`PyType_FromSpec`, :c:func:`PyType_FromSpecWithBases` or :c:func:`PyType_FromModuleAndSpec` to create a class whose metaclass overrides :c:member:`~PyTypeObject.tp_new` is deprecated. Call the metaclass instead.
ru: Использование :c:func:`PyType_FromSpec`, :c:func:`PyType_FromSpecWithBases` или :c:func:`PyType_FromModuleAndSpec` для создания класса, метакласс которого переопределяет :c:member:`~PyTypeObject.tp_new`, устарел. Вместо этого вызовите метакласс.

source: The ``ma_version_tag`` field in :c:type:`PyDictObject` for extension modules (:pep:`699`; :gh:`101193`).
ru: Поле ma_version_tag в :c:type:`PyDictObject` для модулей расширения (:pep:`699`; :gh:`101193`).

source: Creating :c:data:`immutable types <Py_TPFLAGS_IMMUTABLETYPE>` with mutable bases (:gh:`95388`).
ru: Создание :c:data:`неизменяемых типов <Py_TPFLAGS_IMMUTABLETYPE>` с изменяемыми базами (:gh:`95388`).

source: Functions to configure Python's initialization, deprecated in Python 3.11:
ru: Функции для настройки инициализации Python, устаревшие в Python 3.11:

source: :c:func:`!PySys_SetArgvEx()`: Set :c:member:`PyConfig.argv` instead.
ru: :c:func:`!PySys_SetArgvEx()`: Вместо этого установите :c:member:`PyConfig.argv`.

source: :c:func:`!PySys_SetArgv()`: Set :c:member:`PyConfig.argv` instead.
ru: :c:func:`!PySys_SetArgv()`: Вместо этого установите :c:member:`PyConfig.argv`.

source: :c:func:`!Py_SetProgramName()`: Set :c:member:`PyConfig.program_name` instead.
ru: :c:func:`!Py_SetProgramName()`: Вместо этого установите :c:member:`PyConfig.program_name`.

source: :c:func:`!Py_SetPythonHome()`: Set :c:member:`PyConfig.home` instead.
ru: :c:func:`!Py_SetPythonHome()`: Вместо этого установите :c:member:`PyConfig.home`.

source: The :c:func:`Py_InitializeFromConfig` API should be used with :c:type:`PyConfig` instead.
ru: Вместо этого API :c:func:`Py_InitializeFromConfig` следует использовать с :c:type:`PyConfig`.

source: Global configuration variables:
ru: Глобальные переменные конфигурации:

source: :c:var:`Py_DebugFlag`: Use :c:member:`PyConfig.parser_debug` instead.
ru: :c:var:`Py_DebugFlag`: Вместо этого используйте :c:member:`PyConfig.parser_debug`.

source: :c:var:`Py_VerboseFlag`: Use :c:member:`PyConfig.verbose` instead.
ru: :c:var:`Py_VerboseFlag`: вместо этого используйте :c:member:`PyConfig.verbose`.

source: :c:var:`Py_QuietFlag`: Use :c:member:`PyConfig.quiet` instead.
ru: :c:var:`Py_QuietFlag`: Вместо этого используйте :c:member:`PyConfig.quiet`.

source: :c:var:`Py_InteractiveFlag`: Use :c:member:`PyConfig.interactive` instead.
ru: :c:var:`Py_InteractiveFlag`: Вместо этого используйте :c:member:`PyConfig.interactive`.

source: :c:var:`Py_InspectFlag`: Use :c:member:`PyConfig.inspect` instead.
ru: :c:var:`Py_InspectFlag`: Вместо этого используйте :c:member:`PyConfig.inspect`.

source: :c:var:`Py_OptimizeFlag`: Use :c:member:`PyConfig.optimization_level` instead.
ru: :c:var:`Py_OptimizeFlag`: Вместо этого используйте :c:member:`PyConfig.optimization_level`.

source: :c:var:`Py_NoSiteFlag`: Use :c:member:`PyConfig.site_import` instead.
ru: :c:var:`Py_NoSiteFlag`: Вместо этого используйте :c:member:`PyConfig.site_import`.

source: :c:var:`Py_BytesWarningFlag`: Use :c:member:`PyConfig.bytes_warning` instead.
ru: :c:var:`Py_BytesWarningFlag`: вместо этого используйте :c:member:`PyConfig.bytes_warning`.

source: :c:var:`Py_FrozenFlag`: Use :c:member:`PyConfig.pathconfig_warnings` instead.
ru: :c:var:`Py_FrozenFlag`: Вместо этого используйте :c:member:`PyConfig.pathconfig_warnings`.

source: :c:var:`Py_IgnoreEnvironmentFlag`: Use :c:member:`PyConfig.use_environment` instead.
ru: :c:var:`Py_IgnoreEnvironmentFlag`: вместо этого используйте :c:member:`PyConfig.use_environment`.

source: :c:var:`Py_DontWriteBytecodeFlag`: Use :c:member:`PyConfig.write_bytecode` instead.
ru: :c:var:`Py_DontWriteBytecodeFlag`: Вместо этого используйте :c:member:`PyConfig.write_bytecode`.

source: :c:var:`Py_NoUserSiteDirectory`: Use :c:member:`PyConfig.user_site_directory` instead.
ru: :c:var:`Py_NoUserSiteDirectory`: вместо этого используйте :c:member:`PyConfig.user_site_directory`.

source: :c:var:`Py_UnbufferedStdioFlag`: Use :c:member:`PyConfig.buffered_stdio` instead.
ru: :c:var:`Py_UnbufferedStdioFlag`: Вместо этого используйте :c:member:`PyConfig.buffered_stdio`.

source: :c:var:`Py_HashRandomizationFlag`: Use :c:member:`PyConfig.use_hash_seed` and :c:member:`PyConfig.hash_seed` instead.
ru: :c:var:`Py_HashRandomizationFlag`: вместо этого используйте :c:member:`PyConfig.use_hash_seed` и :c:member:`PyConfig.hash_seed`.

source: :c:var:`Py_IsolatedFlag`: Use :c:member:`PyConfig.isolated` instead.
ru: :c:var:`Py_IsolatedFlag`: Вместо этого используйте :c:member:`PyConfig.isolated`.

source: :c:var:`Py_LegacyWindowsFSEncodingFlag`: Use :c:member:`PyPreConfig.legacy_windows_fs_encoding` instead.
ru: :c:var:`Py_LegacyWindowsFSEncodingFlag`: вместо этого используйте :c:member:`PyPreConfig.legacy_windows_fs_encoding`.

source: :c:var:`Py_LegacyWindowsStdioFlag`: Use :c:member:`PyConfig.legacy_windows_stdio` instead.
ru: :c:var:`Py_LegacyWindowsStdioFlag`: вместо этого используйте :c:member:`PyConfig.legacy_windows_stdio`.

source: :c:var:`!Py_FileSystemDefaultEncoding`: Use :c:member:`PyConfig.filesystem_encoding` instead.
ru: :c:var:`!Py_FileSystemDefaultEncoding`: Вместо этого используйте :c:member:`PyConfig.filesystem_encoding`.

source: :c:var:`!Py_HasFileSystemDefaultEncoding`: Use :c:member:`PyConfig.filesystem_encoding` instead.
ru: :c:var:`!Py_HasFileSystemDefaultEncoding`: Вместо этого используйте :c:member:`PyConfig.filesystem_encoding`.

source: :c:var:`!Py_FileSystemDefaultEncodeErrors`: Use :c:member:`PyConfig.filesystem_errors` instead.
ru: :c:var:`!Py_FileSystemDefaultEncodeErrors`: вместо этого используйте :c:member:`PyConfig.filesystem_errors`.

source: :c:var:`!Py_UTF8Mode`: Use :c:member:`PyPreConfig.utf8_mode` instead. (see :c:func:`Py_PreInitialize`)
ru: :c:var:`!Py_UTF8Mode`: вместо этого используйте :c:member:`PyPreConfig.utf8_mode`. (см. :c:func:`Py_PreInitialize`)

source: The bundled copy of ``libmpdecimal``.
ru: Связанная копия libmpdecimal.

source: The :c:func:`PyImport_ImportModuleNoBlock`: Use :c:func:`PyImport_ImportModule` instead.
ru: :c:func:`PyImport_ImportModuleNoBlock`: вместо этого используйте :c:func:`PyImport_ImportModule`.

source: :c:func:`PyWeakref_GetObject` and :c:func:`PyWeakref_GET_OBJECT`: Use :c:func:`!PyWeakref_GetRef` instead.
ru: :c:func:`PyWeakref_GetObject` и :c:func:`PyWeakref_GET_OBJECT`: вместо этого используйте :c:func:`!PyWeakref_GetRef`.

source: :c:type:`Py_UNICODE` type and the :c:macro:`!Py_UNICODE_WIDE` macro: Use :c:type:`wchar_t` instead.
ru: Тип :c:type:`Py_UNICODE` и макрос :c:macro:`!Py_UNICODE_WIDE`: вместо этого используйте :c:type:`wchar_t`.

source: Python initialization functions:
ru: Функции инициализации Python:
