Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/whatsnew/3.12.po
Languages: ru

source: :c:func:`PySys_ResetWarnOptions`: Clear :data:`sys.warnoptions` and :data:`!warnings.filters` instead.
ru: :c:func:`PySys_ResetWarnOptions`: Вместо этого очистите :data:`sys.warnoptions` и :data:`!warnings.filters`.

source: :c:func:`Py_GetExecPrefix`: Get :data:`sys.exec_prefix` instead.
ru: :c:func:`Py_GetExecPrefix`: Вместо этого получите :data:`sys.exec_prefix`.

source: :c:func:`Py_GetPath`: Get :data:`sys.path` instead.
ru: :c:func:`Py_GetPath`: Вместо этого получите :data:`sys.path`.

source: :c:func:`Py_GetPrefix`: Get :data:`sys.prefix` instead.
ru: :c:func:`Py_GetPrefix`: Вместо этого получите :data:`sys.prefix`.

source: :c:func:`Py_GetProgramFullPath`: Get :data:`sys.executable` instead.
ru: :c:func:`Py_GetProgramFullPath`: Вместо этого получите :data:`sys.executable`.

source: :c:func:`Py_GetProgramName`: Get :data:`sys.executable` instead.
ru: :c:func:`Py_GetProgramName`: Вместо этого получите :data:`sys.executable`.

source: :c:func:`Py_GetPythonHome`: Get :c:member:`PyConfig.home` or the :envvar:`PYTHONHOME` environment variable instead.
ru: :c:func:`Py_GetPythonHome`: Вместо этого получите :c:member:`PyConfig.home` или переменную среды :envvar:`PYTHONHOME`.

source: The following APIs are deprecated and will be removed, although there is currently no date scheduled for their removal.
ru: Следующие API устарели и будут удалены, хотя дата их удаления в настоящее время не запланирована.

source: :c:macro:`Py_TPFLAGS_HAVE_FINALIZE`: Unneeded since Python 3.8.
ru: :c:macro:`Py_TPFLAGS_HAVE_FINALIZE`: не требуется, начиная с Python 3.8.

source: :c:func:`PyErr_Fetch`: Use :c:func:`PyErr_GetRaisedException` instead.
ru: :c:func:`PyErr_Fetch`: Вместо этого используйте :c:func:`PyErr_GetRaizedException`.

source: :c:func:`PyErr_NormalizeException`: Use :c:func:`PyErr_GetRaisedException` instead.
ru: :c:func:`PyErr_NormalizeException`: вместо этого используйте :c:func:`PyErr_GetRaizedException`.

source: :c:func:`PyErr_Restore`: Use :c:func:`PyErr_SetRaisedException` instead.
ru: :c:func:`PyErr_Restore`: Вместо этого используйте :c:func:`PyErr_SetRaizedException`.

source: :c:func:`PyModule_GetFilename`: Use :c:func:`PyModule_GetFilenameObject` instead.
ru: :c:func:`PyModule_GetFilename`: Вместо этого используйте :c:func:`PyModule_GetFilenameObject`.

source: :c:func:`PyOS_AfterFork`: Use :c:func:`PyOS_AfterFork_Child` instead.
ru: :c:func:`PyOS_AfterFork`: Вместо этого используйте :c:func:`PyOS_AfterFork_Child`.

source: :c:func:`PySlice_GetIndicesEx`: Use :c:func:`PySlice_Unpack` and :c:func:`PySlice_AdjustIndices` instead.
ru: :c:func:`PySlice_GetIndicesEx`: вместо этого используйте :c:func:`PySlice_Unpack` и :c:func:`PySlice_AdjustIndices`.

source: :c:func:`!PyUnicode_AsDecodedObject`: Use :c:func:`PyCodec_Decode` instead.
ru: :c:func:`!PyUnicode_AsDecodedObject`: Вместо этого используйте :c:func:`PyCodec_Decode`.

source: :c:func:`!PyUnicode_AsDecodedUnicode`: Use :c:func:`PyCodec_Decode` instead.
ru: :c:func:`!PyUnicode_AsDecodedUnicode`: Вместо этого используйте :c:func:`PyCodec_Decode`.

source: :c:func:`!PyUnicode_AsEncodedObject`: Use :c:func:`PyCodec_Encode` instead.
ru: :c:func:`!PyUnicode_AsEncodedObject`: вместо этого используйте :c:func:`PyCodec_Encode`.

source: :c:func:`!PyUnicode_AsEncodedUnicode`: Use :c:func:`PyCodec_Encode` instead.
ru: :c:func:`!PyUnicode_AsEncodedUnicode`: вместо этого используйте :c:func:`PyCodec_Encode`.

source: :c:func:`PyUnicode_READY`: Unneeded since Python 3.12
ru: :c:func:`PyUnicode_READY`: не требуется, начиная с Python 3.12.

source: :c:func:`!PyErr_Display`: Use :c:func:`PyErr_DisplayException` instead.
ru: :c:func:`!PyErr_Display`: Вместо этого используйте :c:func:`PyErr_DisplayException`.

source: :c:func:`!_PyErr_ChainExceptions`: Use :c:func:`!_PyErr_ChainExceptions1` instead.
ru: :c:func:`!_PyErr_ChainExceptions`: вместо этого используйте :c:func:`!_PyErr_ChainExceptions1`.

source: :c:member:`!PyBytesObject.ob_shash` member: call :c:func:`PyObject_Hash` instead.
ru: :c:member:`!PyBytesObject.ob_shash`member: вместо этого вызовите :c:func:`PyObject_Hash`.

source: Thread Local Storage (TLS) API:
ru: API локального хранилища потоков (TLS):

source: :c:func:`PyThread_create_key`: Use :c:func:`PyThread_tss_alloc` instead.
ru: :c:func:`PyThread_create_key`: вместо этого используйте :c:func:`PyThread_tss_alloc`.

source: :c:func:`PyThread_delete_key`: Use :c:func:`PyThread_tss_free` instead.
ru: :c:func:`PyThread_delete_key`: вместо этого используйте :c:func:`PyThread_tss_free`.

source: :c:func:`PyThread_set_key_value`: Use :c:func:`PyThread_tss_set` instead.
ru: :c:func:`PyThread_set_key_value`: вместо этого используйте :c:func:`PyThread_tss_set`.

source: :c:func:`PyThread_get_key_value`: Use :c:func:`PyThread_tss_get` instead.
ru: :c:func:`PyThread_get_key_value`: вместо этого используйте :c:func:`PyThread_tss_get`.

source: :c:func:`PyThread_delete_key_value`: Use :c:func:`PyThread_tss_delete` instead.
ru: :c:func:`PyThread_delete_key_value`: вместо этого используйте :c:func:`PyThread_tss_delete`.

source: :c:func:`PyThread_ReInitTLS`: Unneeded since Python 3.7.
ru: :c:func:`PyThread_ReInitTLS`: не требуется, начиная с Python 3.7.

source: Remove the :file:`token.h` header file. There was never any public tokenizer C API. The :file:`token.h` header file was only designed to be used by Python internals. (Contributed by Victor Stinner in :gh:`92651`.)
ru: Удалите заголовочный файл :file:`token.h`. Никогда не существовало общедоступного API-интерфейса токенизатора C. Заголовочный файл :file:`token.h` был разработан только для использования внутренними компонентами Python. (Предоставлено Виктором Стиннером в :gh:`92651`.)

source: Legacy Unicode APIs have been removed. See :pep:`623` for detail.
ru: Устаревшие API-интерфейсы Unicode были удалены. Подробности смотрите в :pep:`623`.

source: Remove the ``PyUnicode_InternImmortal()`` function macro. (Contributed by Victor Stinner in :gh:`85858`.)
ru: Удалите макрос функции ``PyUnicode_InternImmortal()``. (Предоставлено Виктором Стиннером в :gh:`85858`.)

source: Notable changes in 3.12.4
ru: Заметные изменения в 3.12.4

source: Fixed ``is_global`` and ``is_private`` behavior in ``IPv4Address``, ``IPv6Address``, ``IPv4Network`` and ``IPv6Network``.
ru: Исправлено поведение is_global и is_private в IPv4Address, IPv6Address, IPv4Network и IPv6Network.

source: Notable changes in 3.12.5
ru: Заметные изменения в 3.12.5

source: email
ru: электронная почта

source: Headers with embedded newlines are now quoted on output.
ru: Заголовки со встроенными символами новой строки теперь заключаются в кавычки при выводе.

source: The :mod:`~email.generator` will now refuse to serialize (write) headers that are improperly folded or delimited, such that they would be parsed as multiple headers or joined with adjacent data. If you need to turn this safety feature off, set :attr:`~email.policy.Policy.verify_generated_headers`. (Contributed by Bas Bloemsaat and Petr Viktorin in :gh:`121650`.)
ru: :mod:`~email.generator` теперь будет отказываться сериализовать (записывать) заголовки, которые неправильно свернуты или разделены, так что они будут анализироваться как несколько заголовков или объединяться со смежными данными. Если вам нужно отключить эту функцию безопасности, установите :attr:`~email.policy.Policy.verify_generated_headers`. (Предоставлено Басом Блумсаатом и Петром Викторином в :gh:`121650`.)

source: Notable changes in 3.12.6
ru: Заметные изменения в 3.12.6

source: :func:`email.utils.getaddresses` and :func:`email.utils.parseaddr` now return ``('', '')`` 2-tuples in more situations where invalid email addresses are encountered, instead of potentially inaccurate values. An optional *strict* parameter was added to these two functions: use ``strict=False`` to get the old behavior, accepting malformed inputs. ``getattr(email.utils, 'supports_strict_parsing', False)`` can be used to check if the *strict* paramater is available. (Contributed by Thomas Dwyer and Victor Stinner for :gh:`102988` to improve the CVE-2023-27043 fix.)
ru: :func:`email.utils.getaddresses` и :func:`email.utils.parseaddr` теперь возвращают ``('', '')`` 2-кортежи в большем количестве ситуаций, когда встречаются недействительные адреса электронной почты, а не потенциально неточные значения. К этим двум функциям был добавлен необязательный параметр *strict*: используйте ``strict=False``, чтобы получить старое поведение, принимая неверные входные данные. ``getattr(email.utils, 'supports_strict_parsing', False)`` можно использовать для проверки доступности параметра *strict*. (Предоставлено Томасом Дуайером и Виктором Стиннером для :gh:`102988` для улучшения исправления CVE-2023-27043.)
