Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/whatsnew/3.12.po
Languages: ru

source: Accessing :attr:`~codeobject.co_lnotab` on code objects was deprecated in Python 3.10 via :pep:`626`, but it only got a proper :exc:`DeprecationWarning` in 3.12. May be removed in 3.15. (Contributed by Nikita Sobolev in :gh:`101866`.)
ru: Доступ к :attr:`~codeobject.co_lnotab` к объектам кода был объявлен устаревшим в Python 3.10 через :pep:`626`, но правильное :exc:`DeprecationWarning` появилось только в версии 3.12. Может быть удалено в 3.15. (Добавлен Никитой Соболевым в :gh:`101866`.)

source: Pending Removal in Python 3.13
ru: Ожидает удаления в Python 3.13

source: Modules (see :pep:`594`):
ru: Модули (см. :pep:`594`):

source: Other modules:
ru: Другие модули:

source: :mod:`!lib2to3`, and the :program:`2to3` program (:gh:`84540`)
ru: :mod:`!lib2to3` и программа :program:`2to3` (:gh:`84540`)

source: :class:`classmethod` descriptor chaining (:gh:`89519`)
ru: :class:`classmethod` цепочка дескрипторов (:gh:`89519`)

source: :mod:`importlib.resources` deprecated methods:
ru: :mod:`importlib.resources` устаревшие методы:

source: Use :func:`importlib.resources.files` instead. Refer to `importlib-resources: Migrating from Legacy <https://importlib-resources.readthedocs.io/en/latest/using.html#migrating-from-legacy>`_ (:gh:`106531`)
ru: Вместо этого используйте :func:`importlib.resources.files`. См. `importlib-resources: переход с устаревшей версии <https://importlib-resources.readthedocs.io/en/latest/using.html#migrating-from-legacy>`_ (:gh:`106531`)

source: Pending Removal in Python 3.14
ru: Ожидает удаления в Python 3.14

source: :mod:`ast`: The following features have been deprecated in documentation since Python 3.8, now cause a :exc:`DeprecationWarning` to be emitted at runtime when they are accessed or used, and will be removed in Python 3.14:
ru: :mod:`ast`: Следующие функции устарели в документации, начиная с Python 3.8, теперь вызывают выдачу :exc:`DeprecationWarning` во время выполнения, когда к ним обращаются или используют, и будут удалены в Python 3.14:

source: The child watcher classes :class:`~asyncio.MultiLoopChildWatcher`, :class:`~asyncio.FastChildWatcher`, :class:`~asyncio.AbstractChildWatcher` and :class:`~asyncio.SafeChildWatcher` are deprecated and will be removed in Python 3.14. (Contributed by Kumar Aditya in :gh:`94597`.)
ru: Классы наблюдателей за детьми :class:`~asyncio.MultiLoopChildWatcher`, :class:`~asyncio.FastChildWatcher`, :class:`~asyncio.AbstractChildWatcher` и :class:`~asyncio.SafeChildWatcher` устарели и будут удалены в Питон 3.14. (Предоставлено Кумаром Адитьей в :gh:`94597`.)

source: :mod:`multiprocessing`: The default start method will change to a safer one on Linux, BSDs, and other non-macOS POSIX platforms where ``'fork'`` is currently the default (:gh:`84559`). Adding a runtime warning about this was deemed too disruptive as the majority of code is not expected to care. Use the :func:`~multiprocessing.get_context` or :func:`~multiprocessing.set_start_method` APIs to explicitly specify when your code *requires* ``'fork'``. See :ref:`multiprocessing-start-methods`.
ru: :mod:`multiprocessing`: Метод запуска по умолчанию изменится на более безопасный в Linux, BSD и других платформах, отличных от macOS POSIX, где в настоящее время по умолчанию используется ``'fork'`` (:gh:`84559`). Добавление предупреждения об этом во время выполнения было сочтено слишком разрушительным, поскольку ожидается, что большая часть кода не будет обращать на это внимания. Используйте API :func:`~multiprocessing.get_context` или :func:`~multiprocessing.set_start_method`, чтобы явно указать, когда ваш код *требует* ``'вилки'``. См. :ref:`мультипроцессорные-стартовые методы`.

source: :mod:`pathlib`: :meth:`~pathlib.PurePath.is_relative_to` and :meth:`~pathlib.PurePath.relative_to`: passing additional arguments is deprecated.
ru: :mod:`pathlib`: :meth:`~pathlib.PurePath.is_relative_to` и :meth:`~pathlib.PurePath.relative_to`: передача дополнительных аргументов устарела.

source: ``master_open()``: use :func:`pty.openpty`.
ru: ``master_open()``: используйте :func:`pty.openpty`.

source: ``slave_open()``: use :func:`pty.openpty`.
ru: ``slave_open()``: используйте :func:`pty.openpty`.

source: :data:`~sqlite3.version` and :data:`~sqlite3.version_info`.
ru: :data:`~sqlite3.version` и :data:`~sqlite3.version_info`.

source: Pending Removal in Python 3.15
ru: Ожидает удаления в Python 3.15

source: :mod:`pathlib`: :meth:`pathlib.PurePath.is_reserved` is deprecated and scheduled for removal in Python 3.15. From Python 3.13 onwards, use ``os.path.isreserved`` to detect reserved paths on Windows.
ru: :mod:`pathlib`: :meth:`pathlib.PurePath.is_reserved` устарел и запланирован к удалению в Python 3.15. Начиная с Python 3.13, используйте os.path.isreserved для обнаружения зарезервированных путей в Windows.

source: :mod:`platform`: :func:`~platform.java_ver` is deprecated and will be removed in 3.15. It was largely untested, had a confusing API, and was only useful for Jython support. (Contributed by Nikita Sobolev in :gh:`116349`.)
ru: :mod:`platform`: :func:`~platform.java_ver` устарел и будет удален в версии 3.15. Он практически не тестировался, имел запутанный API и был полезен только для поддержки Jython. (Предоставлено Никитой Соболевым в :gh:`116349`.)

source: :mod:`threading`: Passing any arguments to :func:`threading.RLock` is now deprecated. C version allows any numbers of args and kwargs, but they are just ignored. Python version does not allow any arguments. All arguments will be removed from :func:`threading.RLock` in Python 3.15. (Contributed by Nikita Sobolev in :gh:`102029`.)
ru: :mod:`threading`: Передача любых аргументов в :func:`threading.RLock` теперь устарела. Версия C допускает любое количество аргументов и кваргов, но они просто игнорируются. Версия Python не допускает никаких аргументов. Все аргументы будут удалены из :func:`threading.RLock` в Python 3.15. (Добавлен Никитой Соболевым в :gh:`102029`.)

source: The undocumented keyword argument syntax for creating :class:`!NamedTuple` classes (``NT = NamedTuple("NT", x=int)``) is deprecated, and will be disallowed in 3.15. Use the class-based syntax or the functional syntax instead.
ru: Недокументированный синтаксис аргумента ключевого слова для создания классов :class:`!NamedTuple` (``NT = NamedTuple("NT", x=int)``) устарел и будет запрещен в версии 3.15. Вместо этого используйте синтаксис на основе классов или функциональный синтаксис.

source: :class:`types.CodeType`: Accessing :attr:`~codeobject.co_lnotab` was deprecated in :pep:`626` since 3.10 and was planned to be removed in 3.12, but it only got a proper :exc:`DeprecationWarning` in 3.12. May be removed in 3.15. (Contributed by Nikita Sobolev in :gh:`101866`.)
ru: :class:`types.CodeType`: Доступ к :attr:`~codeobject.co_lnotab` устарел в :pep:`626` с версии 3.10 и планировалось удалить в 3.12, но он получил только правильное :exc:`DeprecationWarning ` в 3.12. Может быть удалено в 3.15. (Добавлен Никитой Соболевым в :gh:`101866`.)

source: When using the functional syntax to create a :class:`!NamedTuple` class, failing to pass a value to the *fields* parameter (``NT = NamedTuple("NT")``) is deprecated. Passing ``None`` to the *fields* parameter (``NT = NamedTuple("NT", None)``) is also deprecated. Both will be disallowed in Python 3.15. To create a :class:`!NamedTuple` class with 0 fields, use ``class NT(NamedTuple): pass`` or ``NT = NamedTuple("NT", [])``.
ru: При использовании функционального синтаксиса для создания класса :class:`!NamedTuple` невозможность передать значение параметру *fields* (``NT = NamedTuple("NT")``) считается устаревшей. Передача None в параметр *fields* (NT = NamedTuple("NT", None)``) также не рекомендуется. Оба будут запрещены в Python 3.15. Чтобы создать класс :class:`!NamedTuple` с 0 полями, используйте ``class NT(NamedTuple): pass`` или ``NT = NamedTuple("NT", [])``.

source: :class:`typing.TypedDict`: When using the functional syntax to create a :class:`!TypedDict` class, failing to pass a value to the *fields* parameter (``TD = TypedDict("TD")``) is deprecated. Passing ``None`` to the *fields* parameter (``TD = TypedDict("TD", None)``) is also deprecated. Both will be disallowed in Python 3.15. To create a :class:`!TypedDict` class with 0 fields, use ``class TD(TypedDict): pass`` or ``TD = TypedDict("TD", {})``.
ru: :class:`typing.TypedDict`: При использовании функционального синтаксиса для создания класса :class:`!TypedDict` не удается передать значение параметру *fields* (``TD = TypedDict("TD")`` ) устарел. Передача None в параметр *fields* (``TD = TypedDict("TD", None)``) также не рекомендуется. Оба будут запрещены в Python 3.15. Чтобы создать класс :class:`!TypedDict` с 0 полями, используйте ``class TD(TypedDict): pass`` или ``TD = TypedDict("TD", {})``.

source: :mod:`wave`: Deprecate the ``getmark()``, ``setmark()`` and ``getmarkers()`` methods of the :class:`wave.Wave_read` and :class:`wave.Wave_write` classes. They will be removed in Python 3.15. (Contributed by Victor Stinner in :gh:`105096`.)
ru: :mod:`wave`: Устаревшие методы ``getmark()``, ``setmark()`` и ``getmarkers()`` в :class:`wave.Wave_read` и :class:`wave. Классы Wave_write`. Они будут удалены в Python 3.15. (Предоставлено Виктором Стиннером в :gh:`105096`.)

source: Pending Removal in Python 3.16
ru: Ожидает удаления в Python 3.16

source: The import system:
ru: Система импорта:

source: Setting :attr:`~module.__loader__` on a module while failing to set :attr:`__spec__.loader <importlib.machinery.ModuleSpec.loader>` is deprecated. In Python 3.16, :attr:`!__loader__` will cease to be set or taken into consideration by the import system or the standard library.
ru: Установка :attr:`~module.__loader__` в модуле без установки :attr:`__spec__.loader <importlib.machinery.ModuleSpec.loader>` устарела. В Python 3.16 :attr:`!__loader__` перестанет устанавливаться или учитываться системой импорта или стандартной библиотекой.

source: :mod:`array`: :class:`array.array` ``'u'`` type (:c:type:`wchar_t`): use the ``'w'`` type instead (``Py_UCS4``).
ru: :mod:`массив` : :class:`array.array` ``в'' тип ( :c:type:`wchar_t` ): используйте ``'в'`` введите вместо этого ( ``Py_UCS4`` ).

source: :mod:`builtins`: ``~bool``, bitwise inversion on bool.
ru: :mod:`встроенные` : ``~бул`` , побитовая инверсия bool.

source: :mod:`symtable`: Deprecate :meth:`symtable.Class.get_methods` due to the lack of interest. (Contributed by Bénédikt Tran in :gh:`119698`.)
ru: :mod:`symtable` : Устарело :meth:`symtable.Class.get_methods` из-за отсутствия интереса. (Предоставлено Бенедиктом Траном в :gh:`119698` .)

source: Pending Removal in Future Versions
ru: Ожидается удаление в будущих версиях

source: The following APIs will be removed in the future, although there is currently no date scheduled for their removal.
ru: Следующие API будут удалены в будущем, хотя дата их удаления в настоящее время не запланирована.

source: :mod:`argparse`: Nesting argument groups and nesting mutually exclusive groups are deprecated.
ru: :mod:`argparse`: Вложенные группы аргументов и вложенные взаимоисключающие группы устарели.

source: :mod:`array`'s ``'u'`` format code (:gh:`57281`)
ru: Код формата ``'u'`` :mod:`array`` (:gh:`57281`)

source: Generators: ``throw(type, exc, tb)`` and ``athrow(type, exc, tb)`` signature is deprecated: use ``throw(exc)`` and ``athrow(exc)`` instead, the single argument signature.
ru: Генераторы: сигнатура ``throw(type, exc, tb)`` и ``athrow(type, exc, tb)`` устарела: вместо этого используйте ``throw(exc)`` и ``athrow(exc)`` , сигнатура одного аргумента.

source: Currently Python accepts numeric literals immediately followed by keywords, for example ``0in x``, ``1or x``, ``0if 1else 2``. It allows confusing and ambiguous expressions like ``[0x1for x in y]`` (which can be interpreted as ``[0x1 for x in y]`` or ``[0x1f or x in y]``). A syntax warning is raised if the numeric literal is immediately followed by one of keywords :keyword:`and`, :keyword:`else`, :keyword:`for`, :keyword:`if`, :keyword:`in`, :keyword:`is` and :keyword:`or`. In a future release it will be changed to a syntax error. (:gh:`87999`)
ru: В настоящее время Python принимает числовые литералы, за которыми сразу следуют ключевые слова, например ``0in x``, ``1or x``, ``0if 1else 2``. Это позволяет использовать запутанные и неоднозначные выражения, такие как ``[0x1for x in y]`` (которые можно интерпретировать как ``[0x1 for x in y]`` или ``[0x1f or x in y]``). Синтаксическое предупреждение выдается, если за числовым литералом сразу следует одно из ключевых слов :keyword:`and`, :keyword:`else`, :keyword:`for`, :keyword:`if`, :keyword:`in` , :keyword:`is` и :keyword:`or`. В будущем выпуске это будет изменено на синтаксическую ошибку. (:gh:`87999`)

source: Support for ``__index__()`` and ``__int__()`` method returning non-int type: these methods will be required to return an instance of a strict subclass of :class:`int`.
ru: Поддержка методов ``__index__()`` и ``__int__()``, возвращающих тип, отличный от int: эти методы потребуются для возврата экземпляра строгого подкласса :class:`int`.

source: Support for ``__float__()`` method returning a strict subclass of :class:`float`: these methods will be required to return an instance of :class:`float`.
ru: Поддержка метода __float__(), возвращающего строгий подкласс :class:`float`: эти методы потребуются для возврата экземпляра :class:`float`.

source: Support for ``__complex__()`` method returning a strict subclass of :class:`complex`: these methods will be required to return an instance of :class:`complex`.
ru: Поддержка метода ``__complex__()``, возвращающего строгий подкласс :class:`complex`: эти методы потребуются для возврата экземпляра :class:`complex`.

source: Delegation of ``int()`` to ``__trunc__()`` method.
ru: Делегирование ``int()`` методу ``__trunc__()``.

source: Passing a complex number as the *real* or *imag* argument in the :func:`complex` constructor is now deprecated; it should only be passed as a single positional argument. (Contributed by Serhiy Storchaka in :gh:`109218`.)
ru: Передача комплексного числа в качестве аргумента *real* или *imag* в конструкторе :func:`complex` теперь не рекомендуется; его следует передавать только как один позиционный аргумент. (Предоставлено Сергеем Сторчакой в ​​:gh:`109218`.)

source: :attr:`codeobject.co_lnotab`: use the :meth:`codeobject.co_lines` method instead.
ru: :attr:`codeobject.co_lnotab`: вместо этого используйте метод :meth:`codeobject.co_lines`.

source: :meth:`~datetime.datetime.utcnow`: use ``datetime.datetime.now(tz=datetime.UTC)``.
ru: :meth:`~datetime.datetime.utcnow`: используйте ``datetime.datetime.now(tz=datetime.UTC)``.

source: :mod:`gettext`: Plural value must be an integer.
ru: :mod:`gettext`: Множественное значение должно быть целым числом.

source: ``load_module()`` method: use ``exec_module()`` instead.
ru: exec_module

source: :func:`~importlib.util.cache_from_source` *debug_override* parameter is deprecated: use the *optimization* parameter instead.
ru: :func:`~importlib.util.cache_from_source` Параметр *debug_override* устарел: вместо него используйте параметр *optimization*.

source: ``EntryPoints`` tuple interface.
ru: Интерфейс кортежа ``EntryPoints``.

source: Implicit ``None`` on return values.
ru: Неявное ``None`` для возвращаемых значений.

source: :mod:`mailbox`: Use of StringIO input and text mode is deprecated, use BytesIO and binary mode instead.
ru: :mod:`mailbox`: Использование ввода StringIO и текстового режима устарело, вместо этого используйте BytesIO и двоичный режим.

source: :mod:`os`: Calling :func:`os.register_at_fork` in multi-threaded process.
ru: :mod:`os`: Вызов :func:`os.register_at_fork` в многопоточном процессе.

source: :class:`!pydoc.ErrorDuringImport`: A tuple value for *exc_info* parameter is deprecated, use an exception instance.
ru: :class:`!pydoc.ErrorDuringImport`: значение кортежа для параметра *exc_info* устарело, используйте экземпляр исключения.

source: :mod:`re`: More strict rules are now applied for numerical group references and group names in regular expressions. Only sequence of ASCII digits is now accepted as a numerical reference. The group name in bytes patterns and replacement strings can now only contain ASCII letters and digits and underscore. (Contributed by Serhiy Storchaka in :gh:`91760`.)
ru: :mod:`re`: К числовым ссылкам на группы и именам групп в регулярных выражениях теперь применяются более строгие правила. В качестве числовой ссылки теперь принимается только последовательность цифр ASCII. Имя группы в байтовых шаблонах и строках замены теперь может содержать только буквы ASCII, цифры и подчеркивание. (Предоставлено Сергеем Сторчакой в ​​:gh:`91760`.)

source: :mod:`!sre_compile`, :mod:`!sre_constants` and :mod:`!sre_parse` modules.
ru: Модули :mod:`!sre_compile`, :mod:`!sre_constants` и :mod:`!sre_parse`.

source: :mod:`ssl` options and protocols:
ru: :mod:`ssl` опции и протоколы:

source: :class:`ssl.SSLContext` without protocol argument is deprecated.
ru: :class:`ssl.SSLContext` без аргумента протокола устарел.

source: ``ssl.OP_NO_SSL*`` options
ru: ``ssl.OP_NO_SSL*`` опции

source: ``ssl.OP_NO_TLS*`` options
ru: ``ssl.OP_NO_TLS*`` опции

source: :func:`sysconfig.is_python_build` *check_home* parameter is deprecated and ignored.
ru: :func:`sysconfig.is_python_build` Параметр *check_home* устарел и игнорируется.

source: :mod:`threading` methods:
ru: :mod:`threading` методы:

source: :meth:`!threading.Condition.notifyAll`: use :meth:`~threading.Condition.notify_all`.
ru: :meth:`!threading.Condition.notifyAll`: используйте :meth:`~threading.Condition.notify_all`.

source: :meth:`!threading.Event.isSet`: use :meth:`~threading.Event.is_set`.
ru: :meth:`!threading.Event.isSet`: используйте :meth:`~threading.Event.is_set`.

source: :meth:`!threading.currentThread`: use :meth:`threading.current_thread`.
ru: :meth:`!threading.currentThread`: используйте :meth:`threading.current_thread`.

source: :meth:`!threading.activeCount`: use :meth:`threading.active_count`.
ru: :meth:`!threading.activeCount`: используйте :meth:`threading.active_count`.

source: :class:`unittest.IsolatedAsyncioTestCase`: it is deprecated to return a value that is not ``None`` from a test case.
ru: :class:`unittest.IsolatedAsyncioTestCase`: не рекомендуется возвращать из тестового примера значение, отличное от ``None``.

source: :mod:`urllib.parse` deprecated functions: :func:`~urllib.parse.urlparse` instead
ru: :mod:`urllib.parse` устаревшая функция: используйте :func:`~urllib.parse.urlparse`

source: :mod:`wsgiref`: ``SimpleHandler.stdout.write()`` should not do partial writes.
ru: :mod:`wsgiref`: ``SimpleHandler.stdout.write()`` не должен выполнять частичную запись.

source: :mod:`xml.etree.ElementTree`: Testing the truth value of an :class:`~xml.etree.ElementTree.Element` is deprecated. In a future release it will always return ``True``. Prefer explicit ``len(elem)`` or ``elem is not None`` tests instead.
ru: :mod:`xml.etree.ElementTree`: Проверка истинности :class:`~xml.etree.ElementTree.Element` устарела. В будущем выпуске он всегда будет возвращать ``True``. Вместо этого отдавайте предпочтение явным тестам ``len(elem)`` или ``elem is not None``.

source: :meth:`zipimport.zipimporter.load_module` is deprecated: use :meth:`~zipimport.zipimporter.exec_module` instead.
ru: :meth:`zipimport.zipimporter.load_module` устарел: вместо него используйте :meth:`~zipimport.zipimporter.exec_module`.

source: Removed
ru: Удалено

source: These two modules have been removed according to the schedule in :pep:`594`, having been deprecated in Python 3.6. Use :mod:`asyncio` instead. (Contributed by Nikita Sobolev in :gh:`96580`.)
ru: Эти два модуля были удалены в соответствии с графиком :pep:`594`, поскольку они объявлены устаревшими в Python 3.6. Вместо этого используйте :mod:`asyncio`. (Предоставлено Никитой Соболевым в :gh:`96580`.)

source: Several names deprecated in the :mod:`configparser` way back in 3.2 have been removed per :gh:`89336`:
ru: Несколько имен, устаревших в :mod:`configparser` ещё в версии 3.2, были удалены в :gh:`89336`:

source: :class:`configparser.ParsingError` no longer has a ``filename`` attribute or argument. Use the ``source`` attribute and argument instead.
ru: :class:`configparser.ParsingError` больше не имеет атрибута или аргумента ``filename``. Вместо этого используйте атрибут и аргумент ``source``.

source: :mod:`configparser` no longer has a ``SafeConfigParser`` class. Use the shorter :class:`~configparser.ConfigParser` name instead.
ru: :mod:`configparser` больше не имеет класса ``SafeConfigParser``. Вместо этого используйте более короткое имя :class:`~configparser.ConfigParser`.

source: :class:`configparser.ConfigParser` no longer has a ``readfp`` method. Use :meth:`~configparser.ConfigParser.read_file` instead.
ru: :class:`configparser.ConfigParser` больше не имеет метода ``readfp``. Вместо этого используйте :meth:`~configparser.ConfigParser.read_file`.

source: Remove the :py:mod:`!distutils` package. It was deprecated in Python 3.10 by :pep:`632` "Deprecate distutils module". For projects still using ``distutils`` and cannot be updated to something else, the ``setuptools`` project can be installed: it still provides ``distutils``. (Contributed by Victor Stinner in :gh:`92584`.)
ru: Удалите пакет :py:mod:`!distutils`. В Python 3.10 он объявлен устаревшим из-за :pep:`632` "Устаревшего модуля distutils". Для проектов, которые все еще используют distutils и не могут быть обновлены на что-то другое, можно установить проект setuptools: он по-прежнему предоставляет distutils. (Предоставлено Виктором Стиннером в :gh:`92584`.)

source: Remove the bundled setuptools wheel from :mod:`ensurepip`, and stop installing setuptools in environments created by :mod:`venv`.
ru: Удалите встроенное колесо настройки инструментов из :mod:`ensurepip` и прекратите установку инструментов настройки в средах, созданных :mod:`venv`.

source: ``pip (>= 22.1)`` does not require setuptools to be installed in the environment. ``setuptools``-based (and ``distutils``-based) packages can still be used with ``pip install``, since pip will provide ``setuptools`` in the build environment it uses for building a package.
ru: ``pip (>= 22.1)`` не требует установки инструментов настройки в среде. Пакеты на основе ``setuptools`` (и ``distutils``) по-прежнему можно использовать с ``pip install``, поскольку pip предоставит ``setuptools`` в среде сборки, которую он использует для сборки пакета.

source: ``easy_install``, ``pkg_resources``, ``setuptools`` and ``distutils`` are no longer provided by default in environments created with ``venv`` or bootstrapped with ``ensurepip``, since they are part of the ``setuptools`` package. For projects relying on these at runtime, the ``setuptools`` project should be declared as a dependency and installed separately (typically, using pip).
ru: ``easy_install``, ``pkg_resources``, ``setuptools`` и ``distutils`` больше не предоставляются по умолчанию в средах, созданных с помощью ``venv`` или загруженных с ``ensurepip``, поскольку они часть пакета ``setuptools``. Для проектов, использующих их во время выполнения, проект ``setuptools`` должен быть объявлен как зависимость и установлен отдельно (обычно с использованием pip).

source: (Contributed by Pradyun Gedam in :gh:`95299`.)
ru: (Предоставлено Прадьюном Гедамом в :gh:`95299`.)

source: Remove :mod:`enum`'s ``EnumMeta.__getattr__``, which is no longer needed for enum attribute access. (Contributed by Ethan Furman in :gh:`95083`.)
ru: Удалите ``EnumMeta.__getattr__`` из :mod:`enum`, который больше не нужен для доступа к атрибуту перечисления. (Предоставлено Итаном Фурманом в :gh:`95083`.)
