Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/whatsnew/3.3.po
Languages: ru

source: What's New In Python 3.3
ru: Что нового в Python 3.3

source: This article explains the new features in Python 3.3, compared to 3.2. Python 3.3 was released on September 29, 2012. For full details, see the `changelog <https://docs.python.org/3.3/whatsnew/changelog.html>`_.
ru: В этой статье описываются новые возможности Python 3.3 по сравнению с версией 3.2. Версия Python 3.3 была выпущена 29 сентября 2012 года. Более подробную информацию смотрите в `Списке изменений <https://docs.python.org/3.3/whatsnew/changelog.html>`_.

source: :pep:`398` - Python 3.3 Release Schedule
ru: :pep:`398` - Расписание выхода Python 3.3

source: Summary -- Release highlights
ru: Краткое описание - Основные моменты релиза

source: New syntax features:
ru: Новые возможности синтаксиса:

source: New ``yield from`` expression for :ref:`generator delegation <pep-380>`.
ru: Новое выражение ``yield from`` для :ref:`делегирования генератора <pep-380>`.

source: The ``u'unicode'`` syntax is accepted again for :class:`str` objects.
ru: Синтаксис ``u'unicode'`` снова принимается для объектов :class:`str`.

source: New library modules:
ru: Новые библиотечные модули:

source: :mod:`faulthandler` (helps debugging low-level crashes)
ru: :mod:`faulthandler` (помогает отлаживать низкоуровневые сбои)

source: :mod:`ipaddress` (high-level objects representing IP addresses and masks)
ru: :mod:`ipaddress` (объекты высокого уровня, представляющие IP-адреса и маски)

source: :mod:`lzma` (compress data using the XZ / LZMA algorithm)
ru: :mod:`lzma` (сжимать данные по алгоритму XZ/LZMA)

source: :mod:`unittest.mock` (replace parts of your system under test with mock objects)
ru: :mod:`unittest.mock` (замените части тестируемой системы фиктивными объектами)

source: :mod:`venv` (Python :ref:`virtual environments <pep-405>`, as in the popular ``virtualenv`` package)
ru: :mod:`venv` (Python :ref:`виртуальные среды <pep-405>`, как в популярном пакете ``virtualenv``)

source: New built-in features:
ru: Новые встроенные функции:

source: Reworked :ref:`I/O exception hierarchy <pep-3151>`.
ru: Переработана :ref:`Иерархия исключений ввода-вывода <pep-3151>`.

source: Implementation improvements:
ru: Улучшения реализации:

source: Rewritten :ref:`import machinery <importlib>` based on :mod:`importlib`.
ru: Переписано импортное оборудование <importlib>` на основе :mod:`importlib`.

source: More compact :ref:`unicode strings <pep-393>`.
ru: Более компактные :ref:`строки Юникода <pep-393>`.

source: More compact :ref:`attribute dictionaries <pep-412>`.
ru: Более компактные :ref:`словари атрибутов <pep-412>`.

source: Significantly Improved Library Modules:
ru: Значительно улучшенные библиотечные модули:

source: C Accelerator for the :ref:`decimal <new-decimal>` module.
ru: Ускоритель C для модуля :ref:`decimal <new-decimal>`.

source: Better unicode handling in the :ref:`email <new-email>` module (:term:`provisional <provisional package>`).
ru: Улучшена обработка юникода в модуле :ref:`email <new-email>` (:term:`provisional <provisional package>`).

source: Security improvements:
ru: Улучшения безопасности:

source: Hash randomization is switched on by default.
ru: Рандомизация хеша включена по умолчанию.

source: Please read on for a comprehensive list of user-facing changes.
ru: Пожалуйста, прочтите полный список изменений, с которыми сталкиваются пользователи.

source: PEP 405: Virtual Environments
ru: PEP 405: Виртуальные среды

source: Virtual environments help create separate Python setups while sharing a system-wide base install, for ease of maintenance. Virtual environments have their own set of private site packages (i.e. locally installed libraries), and are optionally segregated from the system-wide site packages. Their concept and implementation are inspired by the popular ``virtualenv`` third-party package, but benefit from tighter integration with the interpreter core.
ru: Виртуальные среды помогают создавать отдельные установки Python, одновременно используя общесистемную базовую установку для упрощения обслуживания. Виртуальные среды имеют собственный набор пакетов частного сайта (т. е. локально установленных библиотек) и могут быть отделены от общесистемных пакетов сайта. Их концепция и реализация вдохновлены популярным сторонним пакетом virtualenv, но выигрывают от более тесной интеграции с ядром интерпретатора.

source: This PEP adds the :mod:`venv` module for programmatic access, and the ``pyvenv`` script for command-line access and administration. The Python interpreter checks for a ``pyvenv.cfg``, file whose existence signals the base of a virtual environment's directory tree.
ru: Этот PEP добавляет модуль :mod:`venv` для программного доступа и скрипт pyvenv для доступа и администрирования из командной строки. Интерпретатор Python проверяет наличие файла ``pyvenv.cfg``, существование которого сигнализирует о базе дерева каталогов виртуальной среды.

source: :pep:`405` - Python Virtual Environments
ru: :pep:`405` - Виртуальные среды Python

source: PEP written by Carl Meyer; implementation by Carl Meyer and Vinay Sajip
ru: PEP, написанный Карлом Мейером; реализация Карла Мейера и Виная Саджипа

source: PEP 420: Implicit Namespace Packages
ru: PEP 420: пакеты неявного пространства имен

source: Native support for package directories that don't require ``__init__.py`` marker files and can automatically span multiple path segments (inspired by various third party approaches to namespace packages, as described in :pep:`420`)
ru: Встроенная поддержка каталогов пакетов, которые не требуют файлов маркеров ``__init__.py`` и могут автоматически охватывать несколько сегментов пути (на основе различных сторонних подходов к пакетам пространства имен, как описано в :pep:`420`)

source: :pep:`420` - Implicit Namespace Packages
ru: :pep:`420` - Пакеты неявного пространства имен

source: PEP written by Eric V. Smith; implementation by Eric V. Smith and Barry Warsaw
ru: PEP, написанный Эриком В. Смитом; реализация Эрика В. Смита и Барри Варшавы

source: PEP 3118: New memoryview implementation and buffer protocol documentation
ru: PEP 3118: новая реализация MemoryView и документация по протоколу буфера.

source: The implementation of :pep:`3118` has been significantly improved.
ru: Реализация :pep:`3118` была значительно улучшена.

source: The new memoryview implementation comprehensively fixes all ownership and lifetime issues of dynamically allocated fields in the Py_buffer struct that led to multiple crash reports. Additionally, several functions that crashed or returned incorrect results for non-contiguous or multi-dimensional input have been fixed.
ru: Новая реализация Memoryview полностью устраняет все проблемы владения и срока службы динамически выделяемых полей в структуре Py_buffer, которые приводили к множественным отчетам о сбоях. Кроме того, исправлено несколько функций, которые приводили к сбою или возвращали неправильные результаты для несмежных или многомерных входных данных.

source: The memoryview object now has a PEP-3118 compliant getbufferproc() that checks the consumer's request type. Many new features have been added, most of them work in full generality for non-contiguous arrays and arrays with suboffsets.
ru: Объект Memoryview теперь имеет функцию getbufferproc(), совместимую с PEP-3118, которая проверяет тип запроса потребителя. Было добавлено множество новых функций, большинство из которых в целом работают для несмежных массивов и массивов с подсмещениями.

source: The documentation has been updated, clearly spelling out responsibilities for both exporters and consumers. Buffer request flags are grouped into basic and compound flags. The memory layout of non-contiguous and multi-dimensional NumPy-style arrays is explained.
ru: Документация была обновлена, в ней четко прописаны обязанности как экспортеров, так и потребителей. Флаги запроса буфера сгруппированы в базовые и составные флаги. Объясняется расположение памяти несмежных и многомерных массивов в стиле NumPy.

source: Features
ru: Особенности

source: All native single character format specifiers in struct module syntax (optionally prefixed with '@') are now supported.
ru: Теперь поддерживаются все собственные спецификаторы односимвольного формата в синтаксисе модуля структуры (необязательно с префиксом «@»).

source: With some restrictions, the cast() method allows changing of format and shape of C-contiguous arrays.
ru: С некоторыми ограничениями метод cast() позволяет изменять формат и форму C-непрерывных массивов.

source: Multi-dimensional list representations are supported for any array type.
ru: Представления многомерных списков поддерживаются для любого типа массива.

source: Multi-dimensional comparisons are supported for any array type.
ru: Многомерные сравнения поддерживаются для любого типа массива.

source: One-dimensional memoryviews of hashable (read-only) types with formats B, b or c are now hashable. (Contributed by Antoine Pitrou in :issue:`13411`.)
ru: Одномерные представления памяти хешируемых типов (только для чтения) с форматами B, b или c теперь являются хэшируемыми. (Предоставлено Антуаном Питру в :issue:`13411`.)

source: Arbitrary slicing of any 1-D arrays type is supported. For example, it is now possible to reverse a memoryview in *O*\ (1) by using a negative step.
ru: Поддерживается произвольная нарезка любого типа одномерных массивов. Например, теперь можно перевернуть представление памяти в *O*\ (1), используя отрицательный шаг.

source: API changes
ru: Изменения API

source: The maximum number of dimensions is officially limited to 64.
ru: Максимальное количество измерений официально ограничено 64.

source: The representation of empty shape, strides and suboffsets is now an empty tuple instead of ``None``.
ru: Представление пустой формы, шагов и подсмещений теперь представляет собой пустой кортеж вместо «Нет».

source: Accessing a memoryview element with format 'B' (unsigned bytes) now returns an integer (in accordance with the struct module syntax). For returning a bytes object the view must be cast to 'c' first.
ru: Доступ к элементу MemoryView в формате «B» (беззнаковые байты) теперь возвращает целое число (в соответствии с синтаксисом модуля struct). Для возврата объекта байтов представление сначала должно быть приведено к «c».

source: memoryview comparisons now use the logical structure of the operands and compare all array elements by value. All format strings in struct module syntax are supported. Views with unrecognised format strings are still permitted, but will always compare as unequal, regardless of view contents.
ru: Сравнения MemoryView теперь используют логическую структуру операндов и сравнивают все элементы массива по значению. Поддерживаются все строки формата в синтаксисе модуля struct. Представления с нераспознанными строками формата по-прежнему разрешены, но всегда будут сравниваться как неравные, независимо от содержимого представления.

source: For further changes see `Build and C API Changes`_ and `Porting C code`_.
ru: Дополнительные изменения см. в разделах «Изменения API сборки и C» и «Перенос кода C».

source: (Contributed by Stefan Krah in :issue:`10181`.)
ru: (Предоставлено Стефаном Кра в :issue:`10181`.)

source: :pep:`3118` - Revising the Buffer Protocol
ru: :pep:`3118` - Пересмотр протокола буфера

source: PEP 393: Flexible String Representation
ru: PEP 393: гибкое строковое представление

source: The Unicode string type is changed to support multiple internal representations, depending on the character with the largest Unicode ordinal (1, 2, or 4 bytes) in the represented string. This allows a space-efficient representation in common cases, but gives access to full UCS-4 on all systems. For compatibility with existing APIs, several representations may exist in parallel; over time, this compatibility should be phased out.
ru: Тип строки Юникода изменен для поддержки нескольких внутренних представлений в зависимости от символа с наибольшим порядковым номером Юникода (1, 2 или 4 байта) в представляемой строке. Это обеспечивает эффективное представление в общих случаях, но дает доступ к полной версии UCS-4 во всех системах. Для совместимости с существующими API несколько представлений могут существовать параллельно; со временем от этой совместимости следует отказаться.

source: On the Python side, there should be no downside to this change.
ru: Со стороны Python у этого изменения не должно быть недостатков.

source: On the C API side, :pep:`393` is fully backward compatible. The legacy API should remain available at least five years. Applications using the legacy API will not fully benefit of the memory reduction, or - worse - may use a bit more memory, because Python may have to maintain two versions of each string (in the legacy format and in the new efficient storage).
ru: Что касается C API, :pep:`393` полностью обратно совместим. Устаревший API должен оставаться доступным как минимум пять лет. Приложения, использующие устаревший API, не получат полной выгоды от сокращения памяти или, что еще хуже, могут использовать немного больше памяти, поскольку Python, возможно, придется поддерживать две версии каждой строки (в устаревшем формате и в новом эффективном хранилище).

source: Functionality
ru: Функциональность

source: Changes introduced by :pep:`393` are the following:
ru: Изменения, внесенные :pep:`393`, следующие:

source: Python now always supports the full range of Unicode code points, including non-BMP ones (i.e. from ``U+0000`` to ``U+10FFFF``). The distinction between narrow and wide builds no longer exists and Python now behaves like a wide build, even under Windows.
ru: Python теперь всегда поддерживает полный диапазон кодовых точек Unicode, включая коды, отличные от BMP (т.е. от ``U+0000`` до ``U+10FFFF``). Различия между узкими и широкими сборками больше не существует, и Python теперь ведет себя как широкая сборка, даже под Windows.

source: With the death of narrow builds, the problems specific to narrow builds have also been fixed, for example:
ru: С прекращением узких сборок были исправлены и проблемы, характерные для узких сборок, например:

source: :func:`len` now always returns 1 for non-BMP characters, so ``len('\U0010FFFF') == 1``;
ru: :func:`len` теперь всегда возвращает 1 для символов, отличных от BMP, поэтому ``len('\U0010FFFF') == 1``;

source: surrogate pairs are not recombined in string literals, so ``'\uDBFF\uDFFF' != '\U0010FFFF'``;
ru: суррогатные пары не объединяются в строковые литералы, поэтому ``'\uDBFF\uDFFF' != '\U0010FFFF'``;

source: indexing or slicing non-BMP characters returns the expected value, so ``'\U0010FFFF'[0]`` now returns ``'\U0010FFFF'`` and not ``'\uDBFF'``;
ru: индексирование или нарезка символов, отличных от BMP, возвращает ожидаемое значение, поэтому ``'\U0010FFFF'[0]`` теперь возвращает ``'\U0010FFFF'``, а не ``'\uDBFF'``;

source: all other functions in the standard library now correctly handle non-BMP code points.
ru: все остальные функции стандартной библиотеки теперь правильно обрабатывают кодовые точки, отличные от BMP.

source: The value of :data:`sys.maxunicode` is now always ``1114111`` (``0x10FFFF`` in hexadecimal). The :c:func:`!PyUnicode_GetMax` function still returns either ``0xFFFF`` or ``0x10FFFF`` for backward compatibility, and it should not be used with the new Unicode API (see :issue:`13054`).
ru: Значение :data:`sys.maxunicode` теперь всегда равно ``1114111`` (``0x10FFFF`` в шестнадцатеричном формате). Функция :c:func:`!PyUnicode_GetMax` по-прежнему возвращает либо ``0xFFFF``, либо ``0x10FFFF`` для обратной совместимости, и ее не следует использовать с новым Unicode API (см. :issue:`13054`).

source: The :file:`./configure` flag ``--with-wide-unicode`` has been removed.
ru: Флаг :file:`./configure` ``--with-wide-unicode`` был удален.

source: Performance and resource usage
ru: Производительность и использование ресурсов

source: The storage of Unicode strings now depends on the highest code point in the string:
ru: Хранение строк Юникода теперь зависит от наивысшей кодовой точки в строке:

source: pure ASCII and Latin1 strings (``U+0000-U+00FF``) use 1 byte per code point;
ru: Строки чистого ASCII и Latin1 (``U+0000-U+00FF``) используют 1 байт на кодовую точку;

source: BMP strings (``U+0000-U+FFFF``) use 2 bytes per code point;
ru: Строки BMP (``U+0000-U+FFFF``) используют 2 байта на кодовую точку;

source: non-BMP strings (``U+10000-U+10FFFF``) use 4 bytes per code point.
ru: Строки, отличные от BMP (``U+10000-U+10FFFF``), используют 4 байта на кодовую точку.

source: The net effect is that for most applications, memory usage of string storage should decrease significantly - especially compared to former wide unicode builds - as, in many cases, strings will be pure ASCII even in international contexts (because many strings store non-human language data, such as XML fragments, HTTP headers, JSON-encoded data, etc.). We also hope that it will, for the same reasons, increase CPU cache efficiency on non-trivial applications. The memory usage of Python 3.3 is two to three times smaller than Python 3.2, and a little bit better than Python 2.7, on a Django benchmark (see the PEP for details).
ru: Конечным эффектом является то, что для большинства приложений использование памяти для хранения строк должно значительно уменьшиться - особенно по сравнению с предыдущими широкими сборками Unicode - поскольку во многих случаях строки будут чистыми ASCII даже в международных контекстах (поскольку многие строки хранят нечеловеческий язык). данные, такие как фрагменты XML, заголовки HTTP, данные в формате JSON и т. д.). Мы также надеемся, что по тем же причинам это повысит эффективность кэша ЦП в нетривиальных приложениях. Использование памяти Python 3.3 в два-три раза меньше, чем Python 3.2, и немного лучше, чем Python 2.7, в тесте Django (подробности см. в PEP).

source: :pep:`393` - Flexible String Representation
ru: :pep:`393` - Гибкое строковое представление

source: PEP written by Martin von Löwis; implementation by Torsten Becker and Martin von Löwis.
ru: PEP, написанный Мартином фон Лёвисом; реализация Торстена Беккера и Мартина фон Лёвиса.

source: PEP 397: Python Launcher for Windows
ru: PEP 397: Программа запуска Python для Windows

source: The Python 3.3 Windows installer now includes a ``py`` launcher application that can be used to launch Python applications in a version independent fashion.
ru: Установщик Python 3.3 для Windows теперь включает в себя приложение запуска ``py``, которое можно использовать для запуска приложений Python независимо от версии.

source: This launcher is invoked implicitly when double-clicking ``*.py`` files. If only a single Python version is installed on the system, that version will be used to run the file. If multiple versions are installed, the most recent version is used by default, but this can be overridden by including a Unix-style "shebang line" in the Python script.
ru: Эта программа запуска вызывается неявно при двойном щелчке по файлам ``*.py``. Если в системе установлена ​​только одна версия Python, эта версия будет использоваться для запуска файла. Если установлено несколько версий, по умолчанию используется самая последняя версия, но ее можно переопределить, включив в сценарий Python «строку shebang» в стиле Unix.

source: The launcher can also be used explicitly from the command line as the ``py`` application. Running ``py`` follows the same version selection rules as implicitly launching scripts, but a more specific version can be selected by passing appropriate arguments (such as ``-3`` to request Python 3 when Python 2 is also installed, or ``-2.6`` to specifically request an earlier Python version when a more recent version is installed).
ru: Средство запуска также можно использовать явно из командной строки как приложение ``py``. Запуск ``py`` следует тем же правилам выбора версии, что и неявный запуск скриптов, но можно выбрать более конкретную версию, передав соответствующие аргументы (например, ``-3`` для запроса Python 3, когда также установлен Python 2, или ``-2.6`` для запроса более ранней версии Python при установке более новой версии).

source: In addition to the launcher, the Windows installer now includes an option to add the newly installed Python to the system PATH. (Contributed by Brian Curtin in :issue:`3561`.)
ru: В дополнение к средству запуска установщик Windows теперь включает возможность добавления вновь установленного Python в системную переменную PATH. (Предоставлено Брайаном Кертином в :issue:`3561`.)

source: :pep:`397` - Python Launcher for Windows
ru: :pep:`397` - Программа запуска Python для Windows

source: PEP written by Mark Hammond and Martin v. Löwis; implementation by Vinay Sajip.
ru: PEP, написанное Марком Хаммондом и Мартином против Лёвиса; реализация Виная Саджипа.

source: Launcher documentation: :ref:`launcher`
ru: Документация по лаунчеру: :ref:`launcher`

source: Installer PATH modification: :ref:`windows-path-mod`
ru: Изменение PATH установщика: :ref:`windows-path-mod`

source: PEP 3151: Reworking the OS and IO exception hierarchy
ru: PEP 3151: переработка иерархии исключений ОС и ввода-вывода

source: The hierarchy of exceptions raised by operating system errors is now both simplified and finer-grained.
ru: Иерархия исключений, вызываемых ошибками операционной системы, теперь упрощена и детализирована.

source: You don't have to worry anymore about choosing the appropriate exception type between :exc:`OSError`, :exc:`IOError`, :exc:`EnvironmentError`, :exc:`WindowsError`, :exc:`mmap.error`, :exc:`socket.error` or :exc:`select.error`. All these exception types are now only one: :exc:`OSError`. The other names are kept as aliases for compatibility reasons.
ru: Вам больше не нужно беспокоиться о выборе подходящего типа исключения между :exc:`OSError`, :exc:`IOError`, :exc:`EnvironmentError`, :exc:`WindowsError`, :exc:`mmap.error` `, :exc:`socket.error` или :exc:`select.error`. Все эти типы исключений теперь только один: :exc:`OSError`. Остальные имена сохраняются как псевдонимы по соображениям совместимости.

source: Also, it is now easier to catch a specific error condition. Instead of inspecting the ``errno`` attribute (or ``args[0]``) for a particular constant from the :mod:`errno` module, you can catch the adequate :exc:`OSError` subclass. The available subclasses are the following:
ru: Кроме того, теперь стало легче обнаружить конкретную ошибку. Вместо проверки атрибута ``errno`` (или ``args[0]``) на наличие конкретной константы из модуля :mod:`errno`, вы можете перехватить соответствующий подкласс :exc:`OSError`. Доступны следующие подклассы:

source: And the :exc:`ConnectionError` itself has finer-grained subclasses:
ru: А сам :exc:`ConnectionError` имеет более мелкие подклассы:

source: Thanks to the new exceptions, common usages of the :mod:`errno` can now be avoided. For example, the following code written for Python 3.2::
ru: Благодаря новым исключениям теперь можно избежать распространенного использования :mod:`errno`. Например, следующий код, написанный для Python 3.2:

source: can now be written without the :mod:`errno` import and without manual inspection of exception attributes::
ru: теперь можно писать без импорта :mod:`errno` и без ручной проверки атрибутов исключений::

source: :pep:`3151` - Reworking the OS and IO Exception Hierarchy
ru: :pep:`3151` - Переработка иерархии исключений ОС и ввода-вывода.

source: PEP written and implemented by Antoine Pitrou
ru: PEP написан и реализован Антуаном Питру.

source: PEP 380: Syntax for Delegating to a Subgenerator
ru: PEP 380: Синтаксис делегирования подгенератору
