Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/whatsnew/3.3.po
Languages: ru

source: PEP 380 adds the ``yield from`` expression, allowing a :term:`generator` to delegate part of its operations to another generator. This allows a section of code containing :keyword:`yield` to be factored out and placed in another generator. Additionally, the subgenerator is allowed to return with a value, and the value is made available to the delegating generator.
ru: PEP 380 добавляет выражение «yield from», позволяющее генератору делегировать часть своих операций другому генератору. Это позволяет вынести часть кода, содержащую :keyword:`yield`, и поместить в другой генератор. Кроме того, подгенератору разрешено возвращать значение, и это значение становится доступным генератору, делегирующему делегирование.

source: While designed primarily for use in delegating to a subgenerator, the ``yield from`` expression actually allows delegation to arbitrary subiterators.
ru: Хотя выражение «yield from» разработано в первую очередь для использования при делегировании подгенератору, оно фактически позволяет делегировать произвольным подитераторам.

source: For simple iterators, ``yield from iterable`` is essentially just a shortened form of ``for item in iterable: yield item``::
ru: Для простых итераторов «yield from iterable» — это, по сути, просто сокращенная форма «for item in iterable: yield item»::

source: However, unlike an ordinary loop, ``yield from`` allows subgenerators to receive sent and thrown values directly from the calling scope, and return a final value to the outer generator::
ru: Однако, в отличие от обычного цикла, «yield from» позволяет подгенераторам получать отправленные и выброшенные значения непосредственно из вызывающей области и возвращать окончательное значение внешнему генератору:

source: The main principle driving this change is to allow even generators that are designed to be used with the ``send`` and ``throw`` methods to be split into multiple subgenerators as easily as a single large function can be split into multiple subfunctions.
ru: Основной принцип, лежащий в основе этого изменения, заключается в том, чтобы позволить даже генераторам, которые предназначены для использования с методами send и throw, разделяться на несколько подгенераторов так же легко, как одну большую функцию можно разделить на несколько подфункций. .

source: :pep:`380` - Syntax for Delegating to a Subgenerator
ru: :pep:`380` - Синтаксис делегирования подгенератору

source: PEP written by Greg Ewing; implementation by Greg Ewing, integrated into 3.3 by Renaud Blanch, Ryan Kelly and Nick Coghlan; documentation by Zbigniew Jędrzejewski-Szmek and Nick Coghlan
ru: PEP, написанный Грегом Юингом; реализация Грега Юинга, интегрированная в 3.3 Рено Бланшем, Райаном Келли и Ником Когланом; документация Збигнева Енджеевского-Шмека и Ника Коглана

source: PEP 409: Suppressing exception context
ru: PEP 409: Подавление контекста исключения

source: PEP 409 introduces new syntax that allows the display of the chained exception context to be disabled. This allows cleaner error messages in applications that convert between exception types::
ru: PEP 409 представляет новый синтаксис, который позволяет отключить отображение связанного контекста исключения. Это позволяет более четко отображать сообщения об ошибках в приложениях, которые преобразуют типы исключений:

source: Without the ``from None`` suffix to suppress the cause, the original exception would be displayed by default::
ru: Без суффикса from None для подавления причины исходное исключение будет отображаться по умолчанию:

source: No debugging capability is lost, as the original exception context remains available if needed (for example, if an intervening library has incorrectly suppressed valuable underlying details)::
ru: Возможность отладки не теряется, поскольку исходный контекст исключения остается доступным при необходимости (например, если промежуточная библиотека неправильно подавила ценные базовые сведения)::

source: :pep:`409` - Suppressing exception context
ru: :pep:`409` - Подавление контекста исключения

source: PEP written by Ethan Furman; implemented by Ethan Furman and Nick Coghlan.
ru: PEP, написанный Итаном Фурманом; реализован Итаном Фурманом и Ником Когланом.

source: PEP 414: Explicit Unicode literals
ru: PEP 414: явные литералы Юникода

source: To ease the transition from Python 2 for Unicode aware Python applications that make heavy use of Unicode literals, Python 3.3 once again supports the "``u``" prefix for string literals. This prefix has no semantic significance in Python 3, it is provided solely to reduce the number of purely mechanical changes in migrating to Python 3, making it easier for developers to focus on the more significant semantic changes (such as the stricter default separation of binary and text data).
ru: Чтобы облегчить переход от Python 2 к приложениям Python, поддерживающим Unicode, которые интенсивно используют литералы Unicode, Python 3.3 снова поддерживает префикс «``u``» для строковых литералов. Этот префикс не имеет семантического значения в Python 3, он предусмотрен исключительно для уменьшения количества чисто механических изменений при переходе на Python 3, что позволяет разработчикам сосредоточиться на более значимых семантических изменениях (таких как более строгое разделение двоичных файлов по умолчанию). и текстовые данные).

source: :pep:`414` - Explicit Unicode literals
ru: :pep:`414` - Явные литералы Юникода

source: PEP written by Armin Ronacher.
ru: PEP, написанный Армином Ронахером.

source: PEP 3155: Qualified name for classes and functions
ru: PEP 3155: Полное имя для классов и функций.

source: Functions and class objects have a new :attr:`~definition.__qualname__` attribute representing the "path" from the module top-level to their definition. For global functions and classes, this is the same as :attr:`~definition.__name__`. For other functions and classes, it provides better information about where they were actually defined, and how they might be accessible from the global scope.
ru: Функции и объекты классов имеют новый атрибут :attr:`~definition.__qualname__`, представляющий «путь» от верхнего уровня модуля до их определения. Для глобальных функций и классов это то же самое, что :attr:`~definition.__name__`. Для других функций и классов он предоставляет более подробную информацию о том, где они были фактически определены и как к ним можно получить доступ из глобальной области видимости.

source: Example with (non-bound) methods::
ru: Пример с (несвязанными) методами::

source: Example with nested classes::
ru: Пример с вложенными классами::

source: Example with nested functions::
ru: Пример с вложенными функциями::

source: The string representation of those objects is also changed to include the new, more precise information::
ru: Строковое представление этих объектов также изменено и включает новую, более точную информацию:

source: :pep:`3155` - Qualified name for classes and functions
ru: :pep:`3155` - Полное имя для классов и функций.

source: PEP written and implemented by Antoine Pitrou.
ru: PEP написан и реализован Антуаном Питру.

source: PEP 412: Key-Sharing Dictionary
ru: PEP 412: словарь совместного использования ключей

source: Dictionaries used for the storage of objects' attributes are now able to share part of their internal storage between each other (namely, the part which stores the keys and their respective hashes). This reduces the memory consumption of programs creating many instances of non-builtin types.
ru: Словари, используемые для хранения атрибутов объектов, теперь могут совместно использовать часть своей внутренней памяти (а именно ту часть, в которой хранятся ключи и соответствующие им хеши). Это снижает потребление памяти программами, создающими множество экземпляров невстроенных типов.

source: :pep:`412` - Key-Sharing Dictionary
ru: :pep:`412` - Словарь совместного использования ключей

source: PEP written and implemented by Mark Shannon.
ru: PEP написан и реализован Марком Шенноном.

source: PEP 362: Function Signature Object
ru: PEP 362: Объект сигнатуры функции

source: A new function :func:`inspect.signature` makes introspection of python callables easy and straightforward. A broad range of callables is supported: python functions, decorated or not, classes, and :func:`functools.partial` objects. New classes :class:`inspect.Signature`, :class:`inspect.Parameter` and :class:`inspect.BoundArguments` hold information about the call signatures, such as, annotations, default values, parameters kinds, and bound arguments, which considerably simplifies writing decorators and any code that validates or amends calling signatures or arguments.
ru: Новая функция :func:`inspect.signature` делает самоанализ вызываемых объектов Python простым и понятным. Поддерживается широкий спектр вызываемых объектов: функции Python, декорированные или нет, классы и объекты :func:`functools.partial`. Новые классы :class:`inspect.Signature`, :class:`inspect.Parameter` и :class:`inspect.BoundArguments` содержат информацию о сигнатурах вызовов, такую ​​как аннотации, значения по умолчанию, типы параметров и связанные аргументы. что значительно упрощает написание декораторов и любого кода, который проверяет или изменяет сигнатуры вызова или аргументы.

source: :pep:`362`: - Function Signature Object
ru: :pep:`362`: - Объект сигнатуры функции

source: PEP 421: Adding sys.implementation
ru: PEP 421: Добавление sys.implementation

source: A new attribute on the :mod:`sys` module exposes details specific to the implementation of the currently running interpreter. The initial set of attributes on :data:`sys.implementation` are ``name``, ``version``, ``hexversion``, and ``cache_tag``.
ru: Новый атрибут модуля :mod:`sys` раскрывает подробности, относящиеся к реализации текущего интерпретатора. Исходный набор атрибутов :data:`sys.implementation`: ``name``, ``version``, ``hexversion`` и ``cache_tag``.

source: The intention of ``sys.implementation`` is to consolidate into one namespace the implementation-specific data used by the standard library. This allows different Python implementations to share a single standard library code base much more easily. In its initial state, ``sys.implementation`` holds only a small portion of the implementation-specific data. Over time that ratio will shift in order to make the standard library more portable.
ru: Целью ``sys.implementation`` является объединение в одно пространство имен данных, специфичных для реализации, используемых стандартной библиотекой. Это позволяет различным реализациям Python гораздо проще использовать одну базу кода стандартной библиотеки. В своем начальном состоянии ``sys.implementation`` содержит лишь небольшую часть данных, специфичных для реализации. Со временем это соотношение изменится, чтобы стандартная библиотека стала более портативной.

source: One example of improved standard library portability is ``cache_tag``. As of Python 3.3, ``sys.implementation.cache_tag`` is used by :mod:`importlib` to support :pep:`3147` compliance. Any Python implementation that uses ``importlib`` for its built-in import system may use ``cache_tag`` to control the caching behavior for modules.
ru: Одним из примеров улучшенной переносимости стандартной библиотеки является ``cache_tag``. Начиная с Python 3.3, ``sys.implementation.cache_tag`` используется :mod:`importlib` для поддержки соответствия :pep:`3147`. Любая реализация Python, использующая importlib для встроенной системы импорта, может использоватьcache_tag для управления поведением кэширования модулей.

source: The implementation of ``sys.implementation`` also introduces a new type to Python: :class:`types.SimpleNamespace`. In contrast to a mapping-based namespace, like :class:`dict`, ``SimpleNamespace`` is attribute-based, like :class:`object`. However, unlike ``object``, ``SimpleNamespace`` instances are writable. This means that you can add, remove, and modify the namespace through normal attribute access.
ru: Реализация ``sys.implementation`` также вводит в Python новый тип: :class:`types.SimpleNamespace`. В отличие от пространства имен, основанного на сопоставлении, такого как :class:`dict`, ``SimpleNamespace`` основано на атрибутах, например :class:`object`. Однако, в отличие от объекта, экземпляры SimpleNamespace доступны для записи. Это означает, что вы можете добавлять, удалять и изменять пространство имен посредством обычного доступа к атрибутам.

source: :pep:`421` - Adding sys.implementation
ru: :pep:`421` - Добавление sys.implementation

source: PEP written and implemented by Eric Snow.
ru: PEP написан и реализован Эриком Сноу.

source: Using importlib as the Implementation of Import
ru: Использование importlib в качестве реализации импорта

source: :issue:`2377` - Replace __import__ w/ importlib.__import__ :issue:`13959` - Re-implement parts of :mod:`!imp` in pure Python :issue:`14605` - Make import machinery explicit :issue:`14646` - Require loaders set __loader__ and __package__
ru: :issue:`2377` - Замените __import__ на importlib.__import__ :issue:`13959` - Повторно реализуйте части :mod:`!imp` в чистом Python :issue:`14605` - Сделайте механизм импорта явным :issue: `14646` — Требуются наборы загрузчиков __loader__ и __package__.

source: The :func:`__import__` function is now powered by :func:`importlib.__import__`. This work leads to the completion of "phase 2" of :pep:`302`. There are multiple benefits to this change. First, it has allowed for more of the machinery powering import to be exposed instead of being implicit and hidden within the C code. It also provides a single implementation for all Python VMs supporting Python 3.3 to use, helping to end any VM-specific deviations in import semantics. And finally it eases the maintenance of import, allowing for future growth to occur.
ru: Функция :func:`__import__` теперь поддерживается :func:`importlib.__import__`. Эта работа приводит к завершению «фазы 2» :pep:`302`. Это изменение имеет множество преимуществ. Во-первых, это позволило сделать больше механизмов, обеспечивающих импорт, открытыми, а не скрытыми в коде C. Он также предоставляет единую реализацию для всех виртуальных машин Python, поддерживающих Python 3.3, что помогает устранить любые отклонения в семантике импорта, специфичные для виртуальных машин. И, наконец, это облегчает поддержание импорта, позволяя обеспечить будущий рост.

source: For the common user, there should be no visible change in semantics. For those whose code currently manipulates import or calls import programmatically, the code changes that might possibly be required are covered in the `Porting Python code`_ section of this document.
ru: Для обычного пользователя не должно быть видимых изменений в семантике. Для тех, чей код в настоящее время управляет импортом или вызывает импорт программно, возможные изменения кода описаны в разделе «Перенос кода Python» этого документа.

source: New APIs
ru: Новые API

source: One of the large benefits of this work is the exposure of what goes into making the import statement work. That means the various importers that were once implicit are now fully exposed as part of the :mod:`importlib` package.
ru: Одним из больших преимуществ этой работы является раскрытие того, как заставить работать оператор импорта. Это означает, что различные импортеры, которые когда-то были неявными, теперь полностью доступны как часть пакета :mod:`importlib`.

source: The abstract base classes defined in :mod:`importlib.abc` have been expanded to properly delineate between :term:`meta path finders <meta path finder>` and :term:`path entry finders <path entry finder>` by introducing :class:`importlib.abc.MetaPathFinder` and :class:`importlib.abc.PathEntryFinder`, respectively. The old ABC of :class:`!importlib.abc.Finder` is now only provided for backwards-compatibility and does not enforce any method requirements.
ru: Абстрактные базовые классы, определенные в :mod:`importlib.abc`, были расширены для правильного разграничения между :term:`мета-поисками пути <мета-поиск пути>` и :term:`поискателями записей пути <поиск записей пути>` путем введения :class:`importlib.abc.MetaPathFinder` и :class:`importlib.abc.PathEntryFinder` соответственно. Старая азбука :class:`!importlib.abc.Finder` теперь предоставляется только для обратной совместимости и не налагает никаких требований к методам.

source: In terms of finders, :class:`importlib.machinery.FileFinder` exposes the mechanism used to search for source and bytecode files of a module. Previously this class was an implicit member of :data:`sys.path_hooks`.
ru: Что касается средств поиска, :class:`importlib.machinery.FileFinder` предоставляет механизм, используемый для поиска исходных файлов и файлов байт-кода модуля. Ранее этот класс был неявным членом :data:`sys.path_hooks`.

source: For loaders, the new abstract base class :class:`importlib.abc.FileLoader` helps write a loader that uses the file system as the storage mechanism for a module's code. The loader for source files (:class:`importlib.machinery.SourceFileLoader`), sourceless bytecode files (:class:`importlib.machinery.SourcelessFileLoader`), and extension modules (:class:`importlib.machinery.ExtensionFileLoader`) are now available for direct use.
ru: Для загрузчиков новый абстрактный базовый класс :class:`importlib.abc.FileLoader` помогает написать загрузчик, который использует файловую систему в качестве механизма хранения кода модуля. Загрузчик для исходных файлов (:class:`importlib.machinery.SourceFileLoader`), файлов байт-кода без исходного кода (:class:`importlib.machinery.SourcelessFileLoader`) и модулей расширения (:class:`importlib.machinery.ExtensionFileLoader`) теперь доступен для прямого использования.

source: :exc:`ImportError` now has ``name`` and ``path`` attributes which are set when there is relevant data to provide. The message for failed imports will also provide the full name of the module now instead of just the tail end of the module's name.
ru: :exc:`ImportError` теперь имеет атрибуты ``name`` и ``path``, которые устанавливаются при наличии соответствующих данных для предоставления. В сообщении о неудачном импорте теперь также будет указано полное имя модуля, а не только его окончание.

source: The :func:`importlib.invalidate_caches` function will now call the method with the same name on all finders cached in :data:`sys.path_importer_cache` to help clean up any stored state as necessary.
ru: Функция :func:`importlib.invalidate_caches` теперь будет вызывать метод с тем же именем во всех средствах поиска, кэшированных в :data:`sys.path_importer_cache`, чтобы при необходимости очистить любое сохраненное состояние.

source: Visible Changes
ru: Видимые изменения

source: For potential required changes to code, see the `Porting Python code`_ section.
ru: Информацию о возможных необходимых изменениях кода см. в разделе «Перенос кода Python».

source: Beyond the expanse of what :mod:`importlib` now exposes, there are other visible changes to import. The biggest is that :data:`sys.meta_path` and :data:`sys.path_hooks` now store all of the meta path finders and path entry hooks used by import. Previously the finders were implicit and hidden within the C code of import instead of being directly exposed. This means that one can now easily remove or change the order of the various finders to fit one's needs.
ru: Помимо того, что теперь предоставляет :mod:`importlib`, есть и другие видимые изменения для импорта. Самым большим из них является то, что :data:`sys.meta_path` и :data:`sys.path_hooks` теперь хранят все средства поиска метапутей и перехватчики ввода путей, используемые при импорте. Раньше средства поиска были неявными и скрытыми в коде импорта C, а не открывались напрямую. Это означает, что теперь можно легко удалить или изменить порядок различных средств поиска в соответствии со своими потребностями.

source: Another change is that all modules have a ``__loader__`` attribute, storing the loader used to create the module. :pep:`302` has been updated to make this attribute mandatory for loaders to implement, so in the future once 3rd-party loaders have been updated people will be able to rely on the existence of the attribute. Until such time, though, import is setting the module post-load.
ru: Еще одно изменение заключается в том, что все модули имеют атрибут ``__loader__``, в котором хранится загрузчик, использованный для создания модуля. :pep:`302` был обновлен, чтобы сделать этот атрибут обязательным для реализации загрузчиками, поэтому в будущем, когда сторонние загрузчики будут обновлены, люди смогут полагаться на существование атрибута. Однако до этого времени импорт устанавливает пост-загрузку модуля.

source: Loaders are also now expected to set the ``__package__`` attribute from :pep:`366`. Once again, import itself is already setting this on all loaders from :mod:`importlib` and import itself is setting the attribute post-load.
ru: Ожидается, что загрузчики также установят атрибут ``__package__`` из :pep:`366`. Опять же, сам импорт уже устанавливает это для всех загрузчиков из :mod:`importlib`, а сам импорт устанавливает атрибут post-load.

source: ``None`` is now inserted into :data:`sys.path_importer_cache` when no finder can be found on :data:`sys.path_hooks`. Since :class:`!imp.NullImporter` is not directly exposed on :data:`sys.path_hooks` it could no longer be relied upon to always be available to use as a value representing no finder found.
ru: ``None`` теперь вставляется в :data:`sys.path_importer_cache`, если в :data:`sys.path_hooks` не найден поисковик. Поскольку :class:`!imp.NullImporter` не отображается напрямую в :data:`sys.path_hooks`, больше нельзя полагаться на его постоянную доступность для использования в качестве значения, представляющего отсутствие найденного средства поиска.

source: All other changes relate to semantic changes which should be taken into consideration when updating code for Python 3.3, and thus should be read about in the `Porting Python code`_ section of this document.
ru: Все остальные изменения относятся к семантическим изменениям, которые следует учитывать при обновлении кода для Python 3.3, и поэтому о них следует прочитать в разделе «Перенос кода Python» этого документа.

source: (Implementation by Brett Cannon)
ru: (Реализация Бретта Кэннона)

source: Other Language Changes
ru: Другие языковые изменения

source: Some smaller changes made to the core Python language are:
ru: Некоторые небольшие изменения, внесенные в основной язык Python:

source: Added support for Unicode name aliases and named sequences. Both :func:`unicodedata.lookup` and ``'\N{...}'`` now resolve name aliases, and :func:`unicodedata.lookup` resolves named sequences too.
ru: Добавлена ​​поддержка псевдонимов имен Unicode и именованных последовательностей. И :func:`unicodedata.lookup`, и ``'\N{...}'`` теперь разрешают псевдонимы имен, а :func:`unicodedata.lookup` также разрешает именованные последовательности.

source: (Contributed by Ezio Melotti in :issue:`12753`.)
ru: (Предоставлено Эцио Мелотти в :issue:`12753`.)

source: Unicode database updated to UCD version 6.1.0
ru: База данных Unicode обновлена ​​до версии UCD 6.1.0.

source: Equality comparisons on :func:`range` objects now return a result reflecting the equality of the underlying sequences generated by those range objects. (:issue:`13201`)
ru: Сравнения на равенство объектов :func:`range` теперь возвращают результат, отражающий равенство базовых последовательностей, сгенерированных этими объектами диапазона. (:issue:`13201`)
