Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/whatsnew/3.3.po
Languages: ru

source: The :class:`~decimal.Decimal` constructor in decimal.py does not observe the context limits and converts values with arbitrary exponents or precision exactly. Since the C version has internal limits, the following scheme is used: If possible, values are converted exactly, otherwise :exc:`~decimal.InvalidOperation` is raised and the result is NaN. In the latter case it is always possible to use :meth:`~decimal.Context.create_decimal` in order to obtain a rounded or inexact value.
ru: Конструктор :class:`~decimal.Decimal` в decimal.py не учитывает ограничения контекста и точно преобразует значения с произвольными показателями степени или точностью. Поскольку версия C имеет внутренние ограничения, используется следующая схема: если возможно, значения преобразуются точно, в противном случае возникает :exc:`~decimal.InvalidOperation` и результатом является NaN. В последнем случае всегда можно использовать :meth:`~decimal.Context.create_decimal`, чтобы получить округленное или неточное значение.

source: The power function in decimal.py is always correctly rounded. In the C version, it is defined in terms of the correctly rounded :meth:`~decimal.Decimal.exp` and :meth:`~decimal.Decimal.ln` functions, but the final result is only "almost always correctly rounded".
ru: Степенная функция в decimal.py всегда правильно округляется. В версии C он определяется в терминах правильно округленных функций :meth:`~decimal.Decimal.exp` и :meth:`~decimal.Decimal.ln`, но окончательный результат "почти всегда правильно округлен". ".

source: In the C version, the context dictionary containing the signals is a :class:`~collections.abc.MutableMapping`. For speed reasons, :attr:`~decimal.Context.flags` and :attr:`~decimal.Context.traps` always refer to the same :class:`~collections.abc.MutableMapping` that the context was initialized with. If a new signal dictionary is assigned, :attr:`~decimal.Context.flags` and :attr:`~decimal.Context.traps` are updated with the new values, but they do not reference the RHS dictionary.
ru: В версии C контекстный словарь, содержащий сигналы, представляет собой :class:`~collections.abc.MutableMapping`. Из соображений скорости :attr:`~decimal.Context.flags` и :attr:`~decimal.Context.traps` всегда ссылаются на тот же :class:`~collections.abc.MutableMapping`, которым был инициализирован контекст. Если назначен новый словарь сигналов, :attr:`~decimal.Context.flags` и :attr:`~decimal.Context.traps` обновляются новыми значениями, но они не ссылаются на словарь RHS.

source: Pickling a :class:`~decimal.Context` produces a different output in order to have a common interchange format for the Python and C versions.
ru: Выбор :class:`~decimal.Context` дает другой вывод, чтобы иметь общий формат обмена для версий Python и C.

source: The order of arguments in the :class:`~decimal.Context` constructor has been changed to match the order displayed by :func:`repr`.
ru: Порядок аргументов в конструкторе :class:`~decimal.Context` был изменен, чтобы соответствовать порядку, отображаемому :func:`repr`.

source: The ``watchexp`` parameter in the :meth:`~decimal.Decimal.quantize` method is deprecated.
ru: Параметр watchexp в методе :meth:`~decimal.Decimal.quantize` устарел.

source: email
ru: электронная почта

source: Policy Framework
ru: Рамочная политика

source: The email package now has a :mod:`~email.policy` framework. A :class:`~email.policy.Policy` is an object with several methods and properties that control how the email package behaves. The primary policy for Python 3.3 is the :class:`~email.policy.Compat32` policy, which provides backward compatibility with the email package in Python 3.2. A ``policy`` can be specified when an email message is parsed by a :mod:`~email.parser`, or when a :class:`~email.message.Message` object is created, or when an email is serialized using a :mod:`~email.generator`. Unless overridden, a policy passed to a ``parser`` is inherited by all the ``Message`` object and sub-objects created by the ``parser``. By default a ``generator`` will use the policy of the ``Message`` object it is serializing. The default policy is :data:`~email.policy.compat32`.
ru: Пакет электронной почты теперь имеет структуру :mod:`~email.policy`. :class:`~email.policy.Policy` — это объект с несколькими методами и свойствами, которые контролируют поведение пакета электронной почты. Основной политикой Python 3.3 является политика :class:`~email.policy.Compat32`, которая обеспечивает обратную совместимость с пакетом электронной почты в Python 3.2. ``Политика`` может быть указана, когда сообщение электронной почты анализируется с помощью :mod:`~email.parser`, или когда создается объект :class:`~email.message.Message`, или когда электронное письмо сериализуется с помощью :mod:`~email.generator`. Если не переопределено, политика, передаваемая в ``парсер``, наследуется всеми объектом ``Сообщение`` и подобъектами, созданными ``парсером``. По умолчанию ``генератор`` будет использовать политику объекта ``Message``, который он сериализует. Политика по умолчанию: data:`~email.policy.compat32`.

source: The minimum set of controls implemented by all ``policy`` objects are:
ru: Минимальный набор элементов управления, реализованный всеми объектами политики:

source: The maximum length, excluding the linesep character(s), individual lines may have when a ``Message`` is serialized. Defaults to 78.
ru: Максимальная длина, исключая символы linesep, которую могут иметь отдельные строки при сериализации сообщения. По умолчанию 78.

source: The character used to separate individual lines when a ``Message`` is serialized. Defaults to ``\n``.
ru: Символ, используемый для разделения отдельных строк при сериализации сообщения. По умолчанию ``\n``.

source: ``7bit`` or ``8bit``. ``8bit`` applies only to a ``Bytes`` ``generator``, and means that non-ASCII may be used where allowed by the protocol (or where it exists in the original input).
ru: ``7бит`` или ``8бит``. ``8bit`` применяется только к ``Bytes`` ``генератору`` и означает, что код, отличный от ASCII, может использоваться там, где это разрешено протоколом (или там, где он существует в исходном вводе).

source: Causes a ``parser`` to raise error when defects are encountered instead of adding them to the ``Message`` object's ``defects`` list.
ru: Заставляет ``парсер`` выдавать ошибку при обнаружении дефектов вместо добавления их в список ``дефектов`` объекта ``Сообщение``.

source: A new policy instance, with new settings, is created using the :meth:`~email.policy.Policy.clone` method of policy objects. ``clone`` takes any of the above controls as keyword arguments. Any control not specified in the call retains its default value. Thus you can create a policy that uses ``\r\n`` linesep characters like this::
ru: Новый экземпляр политики с новыми настройками создается с использованием метода объектов политики :meth:`~email.policy.Policy.clone`. ``clone`` принимает любой из вышеперечисленных элементов управления в качестве аргументов ключевого слова. Любой элемент управления, не указанный в вызове, сохраняет значение по умолчанию. Таким образом, вы можете создать политику, которая использует символы строки ``\r\n``, например:

source: Policies can be used to make the generation of messages in the format needed by your application simpler. Instead of having to remember to specify ``linesep='\r\n'`` in all the places you call a ``generator``, you can specify it once, when you set the policy used by the ``parser`` or the ``Message``, whichever your program uses to create ``Message`` objects. On the other hand, if you need to generate messages in multiple forms, you can still specify the parameters in the appropriate ``generator`` call. Or you can have custom policy instances for your different cases, and pass those in when you create the ``generator``.
ru: Политики можно использовать для упрощения генерации сообщений в формате, необходимом вашему приложению. Вместо того, чтобы помнить об указании ``linesep='\r\n'`` во всех местах, где вы вызываете ``генератор``, вы можете указать его один раз, когда вы устанавливаете политику, используемую ``парсером`` `или ``Message``, в зависимости от того, что ваша программа использует для создания объектов ``Message``. С другой стороны, если вам нужно генерировать сообщения в нескольких формах, вы все равно можете указать параметры в соответствующем вызове генератора. Или вы можете иметь собственные экземпляры политики для разных случаев и передавать их при создании ``генератора``.

source: Provisional Policy with New Header API
ru: Предварительная политика с новым API заголовка

source: While the policy framework is worthwhile all by itself, the main motivation for introducing it is to allow the creation of new policies that implement new features for the email package in a way that maintains backward compatibility for those who do not use the new policies. Because the new policies introduce a new API, we are releasing them in Python 3.3 as a :term:`provisional policy <provisional package>`. Backwards incompatible changes (up to and including removal of the code) may occur if deemed necessary by the core developers.
ru: Хотя структура политики сама по себе заслуживает внимания, основной мотивацией ее внедрения является возможность создания новых политик, которые реализуют новые функции для пакета электронной почты таким образом, чтобы поддерживать обратную совместимость для тех, кто не использует новые политики. Поскольку новые политики вводят новый API, мы выпускаем их в Python 3.3 как :term:`предварительная политика <предварительный пакет>`. Обратная несовместимость изменений (вплоть до удаления кода) может произойти, если основные разработчики сочтут это необходимым.

source: The new policies are instances of :class:`~email.policy.EmailPolicy`, and add the following additional controls:
ru: Новые политики являются экземплярами :class:`~email.policy.EmailPolicy` и добавляют следующие дополнительные элементы управления:

source: Controls whether or not headers parsed by a :mod:`~email.parser` are refolded by the :mod:`~email.generator`. It can be ``none``, ``long``, or ``all``. The default is ``long``, which means that source headers with a line longer than ``max_line_length`` get refolded. ``none`` means no line get refolded, and ``all`` means that all lines get refolded.
ru: Определяет, будут ли заголовки, проанализированные :mod:`~email.parser`, сворачиваться :mod:`~email.generator`. Это может быть ``none``, ``long`` или ``all``. По умолчанию установлено ``long``, что означает, что заголовки источника со строкой длиной, превышающей ``max_line_length``, сворачиваются заново. ``none`` означает, что ни одна строка не переворачивается, а ``all`` означает, что все строки переворачиваются.

source: A callable that take a ``name`` and ``value`` and produces a custom header object.
ru: Вызываемый объект, который принимает ``имя`` и ``значение`` и создает собственный объект заголовка.

source: The ``header_factory`` is the key to the new features provided by the new policies. When one of the new policies is used, any header retrieved from a ``Message`` object is an object produced by the ``header_factory``, and any time you set a header on a ``Message`` it becomes an object produced by ``header_factory``. All such header objects have a ``name`` attribute equal to the header name. Address and Date headers have additional attributes that give you access to the parsed data of the header. This means you can now do things like this::
ru: «header_factory» — это ключ к новым функциям, предоставляемым новыми политиками. Когда используется одна из новых политик, любой заголовок, полученный из объекта ``Message``, является объектом, созданным ``header_factory``, и каждый раз, когда вы устанавливаете заголовок для ``Message``, он становится объектом. произведено ``header_factory``. Все такие объекты заголовков имеют атрибут ``name``, равный имени заголовка. Заголовки «Адрес» и «Дата» имеют дополнительные атрибуты, которые предоставляют доступ к анализируемым данным заголовка. Это означает, что теперь вы можете делать такие вещи::

source: You will note that the unicode display name is automatically encoded as ``utf-8`` when the message is serialized, but that when the header is accessed directly, you get the unicode version. This eliminates any need to deal with the :mod:`email.header` :meth:`~email.header.decode_header` or :meth:`~email.header.make_header` functions.
ru: Вы заметите, что отображаемое имя в Юникоде автоматически кодируется как «utf-8» при сериализации сообщения, но при прямом доступе к заголовку вы получаете версию в Юникоде. Это устраняет необходимость иметь дело с функциями :mod:`email.header` :meth:`~email.header.decode_header` или :meth:`~email.header.make_header`.

source: You can also create addresses from parts::
ru: Вы также можете создавать адреса из частей::

source: Decoding to unicode is done automatically::
ru: Декодирование в юникод происходит автоматически:

source: When you parse a message, you can use the ``addresses`` and ``groups`` attributes of the header objects to access the groups and individual addresses::
ru: При анализе сообщения вы можете использовать атрибуты ``addresses`` и ``groups`` объектов заголовка для доступа к группам и отдельным адресам:

source: In summary, if you use one of the new policies, header manipulation works the way it ought to: your application works with unicode strings, and the email package transparently encodes and decodes the unicode to and from the RFC standard Content Transfer Encodings.
ru: Таким образом, если вы используете одну из новых политик, манипулирование заголовками работает так, как должно: ваше приложение работает со строками в Юникоде, а пакет электронной почты прозрачно кодирует и декодирует Юникод в стандартные кодировки передачи контента RFC и обратно.

source: Other API Changes
ru: Другие изменения в API

source: New :class:`~email.parser.BytesHeaderParser`, added to the :mod:`~email.parser` module to complement :class:`~email.parser.HeaderParser` and complete the Bytes API.
ru: Новый :class:`~email.parser.BytesHeaderParser`, добавленный в модуль :mod:`~email.parser` для дополнения :class:`~email.parser.HeaderParser` и завершения API Bytes.

source: New utility functions:
ru: Новые полезные функции:

source: :func:`~email.utils.format_datetime`: given a :class:`~datetime.datetime`, produce a string formatted for use in an email header.
ru: :func:`~email.utils.format_datetime`: учитывая :class:`~datetime.datetime`, создайте строку, отформатированную для использования в заголовке электронного письма.

source: :func:`~email.utils.parsedate_to_datetime`: given a date string from an email header, convert it into an aware :class:`~datetime.datetime`, or a naive :class:`~datetime.datetime` if the offset is ``-0000``.
ru: :func:`~email.utils.parsedate_to_datetime`: получив строку даты из заголовка электронного письма, преобразуйте ее в понятный :class:`~datetime.datetime` или наивный :class:`~datetime.datetime`, если смещение равно ``-0000``.

source: :func:`~email.utils.localtime`: With no argument, returns the current local time as an aware :class:`~datetime.datetime` using the local :class:`~datetime.timezone`. Given an aware :class:`~datetime.datetime`, converts it into an aware :class:`~datetime.datetime` using the local :class:`~datetime.timezone`.
ru: :func:`~email.utils.localtime`: Без аргументов возвращает текущее местное время как известное :class:`~datetime.datetime` с использованием локального :class:`~datetime.timezone`. Учитывая известный :class:`~datetime.datetime`, преобразует его в известный :class:`~datetime.datetime`, используя локальный :class:`~datetime.timezone`.

source: :class:`ftplib.FTP` now accepts a ``source_address`` keyword argument to specify the ``(host, port)`` to use as the source address in the bind call when creating the outgoing socket. (Contributed by Giampaolo Rodolà in :issue:`8594`.)
ru: :class:`ftplib.FTP` теперь принимает аргумент ключевого слова ``source_address``, чтобы указать ``(хост, порт)``, который будет использоваться в качестве исходного адреса в вызове связывания при создании исходящего сокета. (Предоставлено Джампаоло Родола в :issue:`8594`.)

source: The :class:`~ftplib.FTP_TLS` class now provides a new :func:`~ftplib.FTP_TLS.ccc` function to revert control channel back to plaintext. This can be useful to take advantage of firewalls that know how to handle NAT with non-secure FTP without opening fixed ports. (Contributed by Giampaolo Rodolà in :issue:`12139`.)
ru: Класс :class:`~ftplib.FTP_TLS` теперь предоставляет новую функцию :func:`~ftplib.FTP_TLS.ccc` для возврата канала управления обратно в открытый текст. Это может быть полезно для использования брандмауэров, которые умеют обрабатывать NAT с незащищенным FTP без открытия фиксированных портов. (Предоставлено Джампаоло Родола в :issue:`12139`.)

source: Added :meth:`ftplib.FTP.mlsd` method which provides a parsable directory listing format and deprecates :meth:`ftplib.FTP.nlst` and :meth:`ftplib.FTP.dir`. (Contributed by Giampaolo Rodolà in :issue:`11072`.)
ru: Добавлен метод :meth:`ftplib.FTP.mlsd`, который предоставляет анализируемый формат списка каталогов и объявляет устаревшим :meth:`ftplib.FTP.nlst` и :meth:`ftplib.FTP.dir`. (Предоставлено Джампаоло Родола в :issue:`11072`.)

source: The :func:`functools.lru_cache` decorator now accepts a ``typed`` keyword argument (that defaults to ``False`` to ensure that it caches values of different types that compare equal in separate cache slots. (Contributed by Raymond Hettinger in :issue:`13227`.)
ru: Декоратор :func:`functools.lru_cache` теперь принимает аргумент ключевого слова ``typed`` (который по умолчанию имеет значение ``False``, чтобы гарантировать, что он кэширует значения разных типов, которые сравниваются равными, в отдельных слотах кэша. (Разработано Рэймондом) Хеттингер в :issue:`13227`.)

source: It is now possible to register callbacks invoked by the garbage collector before and after collection using the new :data:`~gc.callbacks` list.
ru: Теперь можно регистрировать обратные вызовы, вызываемые сборщиком мусора до и после сбора, используя новый список :data:`~gc.callbacks`.

source: A new :func:`~hmac.compare_digest` function has been added to prevent side channel attacks on digests through timing analysis. (Contributed by Nick Coghlan and Christian Heimes in :issue:`15061`.)
ru: Была добавлена ​​новая функция :func:`~hmac.compare_digest` для предотвращения атак по побочным каналам на дайджесты посредством временного анализа. (Предоставлено Ником Когланом и Кристианом Хаймсом в :issue:`15061`.)

source: :class:`http.server.BaseHTTPRequestHandler` now buffers the headers and writes them all at once when :meth:`~http.server.BaseHTTPRequestHandler.end_headers` is called. A new method :meth:`~http.server.BaseHTTPRequestHandler.flush_headers` can be used to directly manage when the accumulated headers are sent. (Contributed by Andrew Schaaf in :issue:`3709`.)
ru: :class:`http.server.BaseHTTPRequestHandler` теперь буферизует заголовки и записывает их все одновременно при вызове :meth:`~http.server.BaseHTTPRequestHandler.end_headers`. Новый метод :meth:`~http.server.BaseHTTPRequestHandler.flush_headers` можно использовать для непосредственного управления отправкой накопленных заголовков. (Предоставлено Эндрю Шаафом в :issue:`3709`.)

source: :class:`http.server` now produces valid ``HTML 4.01 strict`` output. (Contributed by Ezio Melotti in :issue:`13295`.)
ru: :class:`http.server` теперь выдаёт корректный вывод ``HTML 4.01 strict``. (Предоставлено Эцио Мелотти в :issue:`13295`.)

source: :class:`http.client.HTTPResponse` now has a :meth:`~http.client.HTTPResponse.readinto` method, which means it can be used as an :class:`io.RawIOBase` class. (Contributed by John Kuhn in :issue:`13464`.)
ru: :class:`http.client.HTTPResponse` теперь имеет метод :meth:`~http.client.HTTPResponse.readinto`, что означает, что его можно использовать как класс :class:`io.RawIOBase`. (Предоставлено Джоном Куном в :issue:`13464`.)

source: :class:`html.parser.HTMLParser` is now able to parse broken markup without raising errors, therefore the *strict* argument of the constructor and the :exc:`~html.parser.HTMLParseError` exception are now deprecated. The ability to parse broken markup is the result of a number of bug fixes that are also available on the latest bug fix releases of Python 2.7/3.2. (Contributed by Ezio Melotti in :issue:`15114`, and :issue:`14538`, :issue:`13993`, :issue:`13960`, :issue:`13358`, :issue:`1745761`, :issue:`755670`, :issue:`13357`, :issue:`12629`, :issue:`1200313`, :issue:`670664`, :issue:`13273`, :issue:`12888`, :issue:`7311`.)
ru: :class:`html.parser.HTMLParser` теперь может анализировать сломанную разметку, не вызывая ошибок, поэтому аргумент *strict* конструктора и исключение :exc:`~html.parser.HTMLParser` теперь устарели. Возможность анализировать сломанную разметку является результатом ряда исправлений ошибок, которые также доступны в последних версиях Python 2.7/3.2 с исправлениями ошибок. (Внесено Эцио Мелотти в :issue:`15114`, :issue:`14538`, :issue:`13993`, :issue:`13960`, :issue:`13358`, :issue:`1745761`, : Issue:`755670`, :issue:`13357`, :issue:`12629`, :issue:`1200313`, :issue:`670664`, :issue:`13273`, :issue:`12888`, :issue :`7311`.)

source: A new :data:`~html.entities.html5` dictionary that maps HTML5 named character references to the equivalent Unicode character(s) (e.g. ``html5['gt;'] == '>'``) has been added to the :mod:`html.entities` module. The dictionary is now also used by :class:`~html.parser.HTMLParser`. (Contributed by Ezio Melotti in :issue:`11113` and :issue:`15156`.)
ru: Добавлен новый словарь :data:`~html.entities.html5`, который сопоставляет ссылки на именованные символы HTML5 с эквивалентными символами Юникода (например, ``html5['gt;'] == '>'``). в модуль :mod:`html.entities`. Словарь теперь также используется :class:`~html.parser.HTMLParser`. (Внесено Эцио Мелотти в :issue:`11113` и :issue:`15156`.)

source: The :class:`~imaplib.IMAP4_SSL` constructor now accepts an SSLContext parameter to control parameters of the secure channel.
ru: Конструктор :class:`~imaplib.IMAP4_SSL` теперь принимает параметр SSLContext для управления параметрами безопасного канала.

source: (Contributed by Sijin Joseph in :issue:`8808`.)
ru: (Внесено Сиджином Джозефом в :issue:`8808`.)

source: A new :func:`~inspect.getclosurevars` function has been added. This function reports the current binding of all names referenced from the function body and where those names were resolved, making it easier to verify correct internal state when testing code that relies on stateful closures.
ru: Добавлена ​​новая функция :func:`~inspect.getclosurevars`. Эта функция сообщает о текущей привязке всех имен, на которые есть ссылки из тела функции, и о том, где эти имена были разрешены, что упрощает проверку правильного внутреннего состояния при тестировании кода, основанного на замыканиях с отслеживанием состояния.

source: (Contributed by Meador Inge and Nick Coghlan in :issue:`13062`.)
ru: (Предоставлено Мидором Инге и Ником Когланом в :issue:`13062`.)

source: A new :func:`~inspect.getgeneratorlocals` function has been added. This function reports the current binding of local variables in the generator's stack frame, making it easier to verify correct internal state when testing generators.
ru: Добавлена ​​новая функция :func:`~inspect.getgeneratorlocals`. Эта функция сообщает о текущей привязке локальных переменных в кадре стека генератора, что упрощает проверку правильного внутреннего состояния при тестировании генераторов.

source: (Contributed by Meador Inge in :issue:`15153`.)
ru: (Предоставлено Мидором Инге в :issue:`15153`.)
