Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/whatsnew/3.3.po
Languages: ru

source: A longstanding RFC-compliance bug (:issue:`1079`) in the parsing done by :func:`email.header.decode_header` has been fixed. Code that uses the standard idiom to convert encoded headers into unicode (``str(make_header(decode_header(h))``) will see no change, but code that looks at the individual tuples returned by decode_header will see that whitespace that precedes or follows ``ASCII`` sections is now included in the ``ASCII`` section. Code that builds headers using ``make_header`` should also continue to work without change, since ``make_header`` continues to add whitespace between ``ASCII`` and non-``ASCII`` sections if it is not already present in the input strings.
ru: Исправлена ​​давняя ошибка соответствия RFC (:issue:`1079`) при синтаксическом анализе, выполняемом :func:`email.header.decode_header`. Код, который использует стандартную идиому для преобразования закодированных заголовков в Юникод (``str(make_header(decode_header(h))``), не увидит никаких изменений, но код, который просматривает отдельные кортежи, возвращаемые decode_header, увидит пробелы, которые предшествуют или Следующие разделы ``ASCII`` теперь включены в раздел ``ASCII``. Код, который создает заголовки с использованием ``make_header``, также должен продолжать работать без изменений, поскольку ``make_header`` продолжает добавлять пробелы между `` Разделы ASCII и не-ASCII, если они еще не присутствуют во входных строках.

source: :func:`email.utils.formataddr` now does the correct content transfer encoding when passed non-``ASCII`` display names. Any code that depended on the previous buggy behavior that preserved the non-``ASCII`` unicode in the formatted output string will need to be changed (:issue:`1690608`).
ru: :func:`email.utils.formataddr` теперь выполняет правильное кодирование передачи контента при передаче отображаемых имен, отличных от ``ASCII``. Любой код, который зависел от предыдущего ошибочного поведения и сохранял в форматированной выходной строке юникод, отличный от ``ASCII``, необходимо будет изменить (:issue:`1690608`).

source: :meth:`poplib.POP3.quit` may now raise protocol errors like all other ``poplib`` methods. Code that assumes ``quit`` does not raise :exc:`poplib.error_proto` errors may need to be changed if errors on ``quit`` are encountered by a particular application (:issue:`11291`).
ru: :meth:`poplib.POP3.quit` теперь может вызывать ошибки протокола, как и все другие методы ``poplib``. Код, предполагающий, что ``quit`` не вызывает ошибок :exc:`poplib.error_proto`, возможно, придется изменить, если ошибки при ``quit`` обнаружены конкретным приложением (:issue:`11291`).

source: The ``strict`` argument to :class:`email.parser.Parser`, deprecated since Python 2.4, has finally been removed.
ru: Аргумент ``strict`` для :class:`email.parser.Parser`, устаревший, начиная с Python 2.4, наконец-то удален.

source: The deprecated method ``unittest.TestCase.assertSameElements`` has been removed.
ru: Устаревший метод unittest.TestCase.assertSameElements был удален.

source: The deprecated variable ``time.accept2dyear`` has been removed.
ru: Устаревшая переменная time.accept2dyear была удалена.

source: The deprecated ``Context._clamp`` attribute has been removed from the :mod:`decimal` module. It was previously replaced by the public attribute :attr:`~decimal.Context.clamp`. (See :issue:`8540`.)
ru: Устаревший атрибут Context._clamp был удален из модуля :mod:`decimal`. Ранее он был заменен общедоступным атрибутом :attr:`~decimal.Context.clamp`. (См.:issue:`8540`.)

source: The undocumented internal helper class ``SSLFakeFile`` has been removed from :mod:`smtplib`, since its functionality has long been provided directly by :meth:`socket.socket.makefile`.
ru: Недокументированный внутренний вспомогательный класс SSLFakeFile был удален из :mod:`smtplib`, поскольку его функциональность уже давно обеспечивается непосредственно :meth:`socket.socket.makefile`.

source: Passing a negative value to :func:`time.sleep` on Windows now raises an error instead of sleeping forever. It has always raised an error on posix.
ru: Передача отрицательного значения в :func:`time.sleep` в Windows теперь вызывает ошибку, а не вечный сон. В posix всегда возникала ошибка.

source: The ``ast.__version__`` constant has been removed. If you need to make decisions affected by the AST version, use :data:`sys.version_info` to make the decision.
ru: Константа ``ast.__version__`` была удалена. Если вам нужно принять решения, на которые влияет версия AST, используйте :data:`sys.version_info` для принятия решения.

source: Code that used to work around the fact that the :mod:`threading` module used factory functions by subclassing the private classes will need to change to subclass the now-public classes.
ru: Код, который раньше обходил тот факт, что модуль :mod:`threading` использовал фабричные функции путем создания подклассов частных классов, необходимо будет изменить на подклассы теперь общедоступных классов.

source: The undocumented debugging machinery in the threading module has been removed, simplifying the code. This should have no effect on production code, but is mentioned here in case any application debug frameworks were interacting with it (:issue:`13550`).
ru: Недокументированный механизм отладки в модуле потоков был удален, что упростило код. Это не должно влиять на рабочий код, но упоминается здесь на случай, если с ним взаимодействовали какие-либо платформы отладки приложений (:issue:`13550`).

source: Porting C code
ru: Перенос кода на C

source: In the course of changes to the buffer API the undocumented :c:member:`!smalltable` member of the :c:type:`Py_buffer` structure has been removed and the layout of the :c:type:`PyMemoryViewObject` has changed.
ru: В ходе изменений в API буфера был удален недокументированный член :c:member:`!smalltable` структуры :c:type:`Py_buffer` и изменилось расположение :c:type:`PyMemoryViewObject`. .

source: All extensions relying on the relevant parts in ``memoryobject.h`` or ``object.h`` must be rebuilt.
ru: Все расширения, использующие соответствующие части в ``memoryobject.h`` или ``object.h``, должны быть перестроены.

source: Due to :ref:`PEP 393 <pep-393>`, the :c:type:`Py_UNICODE` type and all functions using this type are deprecated (but will stay available for at least five years). If you were using low-level Unicode APIs to construct and access unicode objects and you want to benefit of the memory footprint reduction provided by :pep:`393`, you have to convert your code to the new :doc:`Unicode API <../c-api/unicode>`.
ru: Из-за :ref:`PEP 393 <pep-393>` тип :c:type:`Py_UNICODE` и все функции, использующие этот тип, устарели (но останутся доступными в течение как минимум пяти лет). Если вы использовали низкоуровневые API-интерфейсы Unicode для создания объектов Unicode и доступа к ним и хотите получить выгоду от сокращения объема памяти, обеспечиваемого :pep:`393`, вам необходимо преобразовать свой код в новый :doc:`Unicode API < ../c-api/unicode>`.

source: However, if you only have been using high-level functions such as :c:func:`PyUnicode_Concat()`, :c:func:`PyUnicode_Join` or :c:func:`PyUnicode_FromFormat()`, your code will automatically take advantage of the new unicode representations.
ru: Однако если вы использовали только функции высокого уровня, такие как :c:func:`PyUnicode_Concat()`, :c:func:`PyUnicode_Join` или :c:func:`PyUnicode_FromFormat()`, ваш код автоматически примет преимущества новых представлений Юникода.

source: :c:func:`PyImport_GetMagicNumber` now returns ``-1`` upon failure.
ru: :c:func:`PyImport_GetMagicNumber` теперь возвращает ``-1`` в случае неудачи.

source: As a negative value for the *level* argument to :func:`__import__` is no longer valid, the same now holds for :c:func:`PyImport_ImportModuleLevel`. This also means that the value of *level* used by :c:func:`PyImport_ImportModuleEx` is now ``0`` instead of ``-1``.
ru: Поскольку отрицательное значение аргумента *level* для :func:`__import__` больше не является допустимым, то же самое теперь справедливо и для :c:func:`PyImport_ImportModuleLevel`. Это также означает, что значение *level*, используемое :c:func:`PyImport_ImportModuleEx`, теперь равно ``0`` вместо ``-1``.

source: Building C extensions
ru: Создание расширений C

source: The range of possible file names for C extensions has been narrowed. Very rarely used spellings have been suppressed: under POSIX, files named ``xxxmodule.so``, ``xxxmodule.abi3.so`` and ``xxxmodule.cpython-*.so`` are no longer recognized as implementing the ``xxx`` module. If you had been generating such files, you have to switch to the other spellings (i.e., remove the ``module`` string from the file names).
ru: Диапазон возможных имен файлов для расширений C сужен. Очень редко используемые варианты написания были подавлены: в POSIX файлы с именами ``xxxmodule.so``, ``xxxmodule.abi3.so`` и ``xxxmodule.cpython-*.so`` больше не распознаются как реализация `` `xxx`` модуль. Если вы создавали такие файлы, вам придется переключиться на другое написание (т. е. удалить строку ``module`` из имен файлов).

source: (implemented in :issue:`14040`.)
ru: (реализовано в :issue:`14040`.)

source: Command Line Switch Changes
ru: Изменения переключателей командной строки

source: The -Q command-line flag and related artifacts have been removed. Code checking sys.flags.division_warning will need updating.
ru: Флаг командной строки -Q и связанные с ним артефакты были удалены. Код проверки sys.flags.division_warning потребует обновления.

source: (:issue:`10998`, contributed by Éric Araujo.)
ru: (:issue:`10998`, предоставлено Эриком Араужо.)

source: When :program:`python` is started with :option:`-S`, ``import site`` will no longer add site-specific paths to the module search paths. In previous versions, it did.
ru: Когда :program:`python` запускается с :option:`-S`, ``import site`` больше не будет добавлять пути, специфичные для сайта, в пути поиска модуля. В предыдущих версиях так и было.

source: (:issue:`11591`, contributed by Carl Meyer with editions by Éric Araujo.)
ru: (:issue:`11591`, предоставлено Карлом Мейером, редакция Эрика Араужо.)

source: yield from (in What's New)
ru: yield (в разделе «Что нового»)
