Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/whatsnew/3.3.po
Languages: ru

source: The previously undocumented helper function ``quote`` from the :mod:`!pipes` modules has been moved to the :mod:`shlex` module and documented. :func:`~shlex.quote` properly escapes all characters in a string that might be otherwise given special meaning by the shell.
ru: Ранее недокументированная вспомогательная функция ``quote`` из модулей :mod:`!pipes` была перенесена в модуль :mod:`shlex` и задокументирована. :func:`~shlex.quote` правильно экранирует все символы в строке, которым в противном случае оболочка могла бы придать особое значение.

source: New functions:
ru: Новые функции:

source: :func:`~shutil.disk_usage`: provides total, used and free disk space statistics. (Contributed by Giampaolo Rodolà in :issue:`12442`.)
ru: :func:`~shutil.disk_usage`: предоставляет статистику общего, использованного и свободного дискового пространства. (Предоставлено Джампаоло Родола в :issue:`12442`.)

source: :func:`~shutil.chown`: allows one to change user and/or group of the given path also specifying the user/group names and not only their numeric ids. (Contributed by Sandro Tosi in :issue:`12191`.)
ru: :func:`~shutil.chown`: позволяет изменить пользователя и/или группу по заданному пути, также указав имена пользователей/групп, а не только их числовые идентификаторы. (Предоставлено Сандро Този в :issue:`12191`.)

source: :func:`shutil.get_terminal_size`: returns the size of the terminal window to which the interpreter is attached. (Contributed by Zbigniew Jędrzejewski-Szmek in :issue:`13609`.)
ru: :func:`shutil.get_terminal_size`: возвращает размер окна терминала, к которому подключен интерпретатор. (Предоставлено Збигневом Енджеевским-Шмеком в :issue:`13609`.)

source: :func:`~shutil.copy2` and :func:`~shutil.copystat` now preserve file timestamps with nanosecond precision on platforms that support it. They also preserve file "extended attributes" on Linux. (Contributed by Larry Hastings in :issue:`14127` and :issue:`15238`.)
ru: :func:`~shutil.copy2` и :func:`~shutil.copystat` теперь сохраняют временные метки файлов с точностью до наносекунды на платформах, которые это поддерживают. Они также сохраняют «расширенные атрибуты» файлов в Linux. (Предоставлено Ларри Гастингсом в :issue:`14127` и :issue:`15238`.)

source: Several functions now take an optional ``symlinks`` argument: when that parameter is true, symlinks aren't dereferenced and the operation instead acts on the symlink itself (or creates one, if relevant). (Contributed by Hynek Schlawack in :issue:`12715`.)
ru: Некоторые функции теперь принимают необязательный аргумент ``symlinks``: если этот параметр имеет значение true, символические ссылки не разыменовываются, а операция вместо этого воздействует на саму символическую ссылку (или создает ее, если это необходимо). (Предоставлено Хайнеком Шлаваком в :issue:`12715`.)

source: When copying files to a different file system, :func:`~shutil.move` now handles symlinks the way the posix ``mv`` command does, recreating the symlink rather than copying the target file contents. (Contributed by Jonathan Niehof in :issue:`9993`.) :func:`~shutil.move` now also returns the ``dst`` argument as its result.
ru: При копировании файлов в другую файловую систему :func:`~shutil.move` теперь обрабатывает символические ссылки так же, как это делает команда posix ``mv``, воссоздавая символическую ссылку, а не копируя содержимое целевого файла. (Внесено Джонатаном Нихофом в :issue:`9993`.) :func:`~shutil.move` теперь также возвращает в качестве результата аргумент ``dst``.

source: :func:`~shutil.rmtree` is now resistant to symlink attacks on platforms which support the new ``dir_fd`` parameter in :func:`os.open` and :func:`os.unlink`. (Contributed by Martin von Löwis and Hynek Schlawack in :issue:`4489`.)
ru: :func:`~shutil.rmtree` теперь устойчив к атакам по символическим ссылкам на платформах, которые поддерживают новый параметр ``dir_fd`` в :func:`os.open` и :func:`os.unlink`. (Предоставлено Мартином фон Лёвисом и Хайнеком Шлаваком в :issue:`4489`.)

source: signal
ru: сигнал

source: The :mod:`signal` module has new functions:
ru: Модуль :mod:`signal` имеет новые функции:

source: :func:`~signal.pthread_sigmask`: fetch and/or change the signal mask of the calling thread (Contributed by Jean-Paul Calderone in :issue:`8407`);
ru: :func:`~signal.pthread_sigmask`: извлекает и/или изменяет маску сигнала вызывающего потока (предоставлен Жан-Полем Кальдероном в :issue:`8407`);

source: :func:`~signal.pthread_kill`: send a signal to a thread;
ru: :func:`~signal.pthread_kill`: отправить сигнал потоку;

source: :func:`~signal.sigpending`: examine pending functions;
ru: :func:`~signal.sigpending`: проверить ожидающие функции;

source: :func:`~signal.sigwait`: wait a signal;
ru: :func:`~signal.sigwait`: дождаться сигнала;

source: :func:`~signal.sigwaitinfo`: wait for a signal, returning detailed information about it;
ru: :func:`~signal.sigwaitinfo`: ожидание сигнала, возвращающее подробную информацию о нем;

source: :func:`~signal.sigtimedwait`: like :func:`~signal.sigwaitinfo` but with a timeout.
ru: :func:`~signal.sigtimedwait`: аналогично :func:`~signal.sigwaitinfo`, но с таймаутом.

source: The signal handler writes the signal number as a single byte instead of a nul byte into the wakeup file descriptor. So it is possible to wait more than one signal and know which signals were raised.
ru: Обработчик сигнала записывает номер сигнала в дескриптор файла пробуждения в виде одного байта вместо нулевого байта. Таким образом, можно дождаться более одного сигнала и узнать, какие сигналы были подняты.

source: :func:`signal.signal` and :func:`signal.siginterrupt` raise an OSError, instead of a RuntimeError: OSError has an errno attribute.
ru: :func:`signal.signal` и :func:`signal.siginterrupt` вызывают OSError вместо RuntimeError: OSError имеет атрибут errno.

source: The :mod:`!smtpd` module now supports :rfc:`5321` (extended SMTP) and :rfc:`1870` (size extension). Per the standard, these extensions are enabled if and only if the client initiates the session with an ``EHLO`` command.
ru: Модуль :mod:`!smtpd` теперь поддерживает :rfc:`5321` (расширенный SMTP) и :rfc:`1870` (расширение размера). Согласно стандарту, эти расширения включены тогда и только тогда, когда клиент инициирует сеанс с помощью команды EHLO.

source: (Initial ``ELHO`` support by Alberto Trevino. Size extension by Juhana Jauhiainen. Substantial additional work on the patch contributed by Michele Orrù and Dan Boswell. :issue:`8739`)
ru: (Первоначальная поддержка «ELHO» — Альберто Тревино. Расширение размера — Юхана Яухиайнен. Значительную дополнительную работу над патчем внесли Мишель Орру и Дэн Босуэлл. :issue:`8739`)

source: The :class:`~smtplib.SMTP`, :class:`~smtplib.SMTP_SSL`, and :class:`~smtplib.LMTP` classes now accept a ``source_address`` keyword argument to specify the ``(host, port)`` to use as the source address in the bind call when creating the outgoing socket. (Contributed by Paulo Scardine in :issue:`11281`.)
ru: Классы :class:`~smtplib.SMTP`, :class:`~smtplib.SMTP_SSL` и :class:`~smtplib.LMTP` теперь принимают аргумент ключевого слова ``source_address`` для указания ``(host, port)`` для использования в качестве исходного адреса в вызове привязки при создании исходящего сокета. (Предоставлено Пауло Скардином в :issue:`11281`.)

source: :class:`~smtplib.SMTP` now supports the context management protocol, allowing an ``SMTP`` instance to be used in a ``with`` statement. (Contributed by Giampaolo Rodolà in :issue:`11289`.)
ru: :class:`~smtplib.SMTP` теперь поддерживает протокол управления контекстом, позволяя использовать экземпляр ``SMTP`` в операторе ``with``. (Предоставлено Джампаоло Родола в :issue:`11289`.)

source: The :class:`~smtplib.SMTP_SSL` constructor and the :meth:`~smtplib.SMTP.starttls` method now accept an SSLContext parameter to control parameters of the secure channel. (Contributed by Kasun Herath in :issue:`8809`.)
ru: Конструктор :class:`~smtplib.SMTP_SSL` и метод :meth:`~smtplib.SMTP.starttls` теперь принимают параметр SSLContext для управления параметрами безопасного канала. (Предоставлено Касуном Хератом в :issue:`8809`.)

source: socket
ru: сокет

source: The :class:`~socket.socket` class now exposes additional methods to process ancillary data when supported by the underlying platform:
ru: Класс :class:`~socket.socket` теперь предоставляет дополнительные методы для обработки вспомогательных данных, если они поддерживаются базовой платформой:

source: (Contributed by David Watson in :issue:`6560`, based on an earlier patch by Heiko Wundram)
ru: (Предоставлено Дэвидом Уотсоном в :issue:`6560`, на основе более раннего патча Хейко Вундрама)

source: The :class:`~socket.socket` class now supports the PF_CAN protocol family (https://en.wikipedia.org/wiki/Socketcan), on Linux (https://lwn.net/Articles/253425).
ru: Класс :class:`~socket.socket` теперь поддерживает семейство протоколов PF_CAN (https://en.wikipedia.org/wiki/Socketcan) в Linux (https://lwn.net/Articles/253425).

source: (Contributed by Matthias Fuchs, updated by Tiago Gonçalves in :issue:`10141`.)
ru: (Предоставлено Матиасом Фуксом, обновлено Тьяго Гонсалвесом в :issue:`10141`.)

source: The :class:`~socket.socket` class now supports the PF_RDS protocol family (https://en.wikipedia.org/wiki/Reliable_Datagram_Sockets and `https://oss.oracle.com/projects/rds <https://web.archive.org/web/20130115155505/https://oss.oracle.com/projects/rds/>`__).
ru: Класс :class:`~socket.socket` теперь поддерживает семейство протоколов PF_RDS (https://en.wikipedia.org/wiki/Reliable_Datagram_Sockets и `https://oss.oracle.com/projects/rds <https:/ /web.archive.org/web/20130115155505/https://oss.oracle.com/projects/rds/>`__).

source: The :class:`~socket.socket` class now supports the ``PF_SYSTEM`` protocol family on OS X. (Contributed by Michael Goderbauer in :issue:`13777`.)
ru: Класс :class:`~socket.socket` теперь поддерживает семейство протоколов ``PF_SYSTEM`` в OS X. (Внесено Майклом Годербауэром в :issue:`13777`.)

source: New function :func:`~socket.sethostname` allows the hostname to be set on Unix systems if the calling process has sufficient privileges. (Contributed by Ross Lagerwall in :issue:`10866`.)
ru: Новая функция :func:`~socket.sethostname` позволяет устанавливать имя хоста в системах Unix, если вызывающий процесс имеет достаточные привилегии. (Предоставлено Россом Лагерволлом в :issue:`10866`.)

source: :class:`~socketserver.BaseServer` now has an overridable method :meth:`~socketserver.BaseServer.service_actions` that is called by the :meth:`~socketserver.BaseServer.serve_forever` method in the service loop. :class:`~socketserver.ForkingMixIn` now uses this to clean up zombie child processes. (Contributed by Justin Warkentin in :issue:`11109`.)
ru: :class:`~socketserver.BaseServer` теперь имеет переопределяемый метод :meth:`~socketserver.BaseServer.service_actions`, который вызывается методом :meth:`~socketserver.BaseServer.serve_forever` в цикле обслуживания. :class:`~socketserver.ForkingMixIn` теперь использует это для очистки дочерних процессов-зомби. (Предоставлено Джастином Варкентином в :issue:`11109`.)

source: New :class:`sqlite3.Connection` method :meth:`~sqlite3.Connection.set_trace_callback` can be used to capture a trace of all sql commands processed by sqlite. (Contributed by Torsten Landschoff in :issue:`11688`.)
ru: Новый метод :class:`sqlite3.Connection` :meth:`~sqlite3.Connection.set_trace_callback` можно использовать для захвата трассировки всех команд sql, обрабатываемых sqlite. (Предоставлено Торстеном Ландшоффом в :issue:`11688`.)

source: The :mod:`ssl` module has two new random generation functions:
ru: Модуль :mod:`ssl` имеет две новые функции случайной генерации:

source: :func:`~ssl.RAND_bytes`: generate cryptographically strong pseudo-random bytes.
ru: :func:`~ssl.RAND_bytes`: генерирует криптостойкие псевдослучайные байты.

source: :func:`~ssl.RAND_pseudo_bytes`: generate pseudo-random bytes.
ru: :func:`~ssl.RAND_pseudo_bytes`: генерировать псевдослучайные байты.

source: (Contributed by Victor Stinner in :issue:`12049`.)
ru: (Предоставлено Виктором Стиннером в :issue:`12049`.)

source: The :mod:`ssl` module now exposes a finer-grained exception hierarchy in order to make it easier to inspect the various kinds of errors. (Contributed by Antoine Pitrou in :issue:`11183`.)
ru: Модуль :mod:`ssl` теперь предоставляет более детальную иерархию исключений, чтобы упростить проверку различных типов ошибок. (Предоставлено Антуаном Питру в :issue:`11183`.)

source: :meth:`~ssl.SSLContext.load_cert_chain` now accepts a *password* argument to be used if the private key is encrypted. (Contributed by Adam Simpkins in :issue:`12803`.)
ru: :meth:`~ssl.SSLContext.load_cert_chain` теперь принимает аргумент *пароль*, который будет использоваться, если закрытый ключ зашифрован. (Предоставлено Адамом Симпкинсом в :issue:`12803`.)

source: Diffie-Hellman key exchange, both regular and Elliptic Curve-based, is now supported through the :meth:`~ssl.SSLContext.load_dh_params` and :meth:`~ssl.SSLContext.set_ecdh_curve` methods. (Contributed by Antoine Pitrou in :issue:`13626` and :issue:`13627`.)
ru: Обмен ключами Диффи-Хеллмана, как обычный, так и на основе эллиптической кривой, теперь поддерживается с помощью методов :meth:`~ssl.SSLContext.load_dh_params` и :meth:`~ssl.SSLContext.set_ecdh_curve`. (Внесено Антуаном Питру в :issue:`13626` и :issue:`13627`.)

source: SSL sockets have a new :meth:`~ssl.SSLSocket.get_channel_binding` method allowing the implementation of certain authentication mechanisms such as SCRAM-SHA-1-PLUS. (Contributed by Jacek Konieczny in :issue:`12551`.)
ru: Сокеты SSL имеют новый метод :meth:`~ssl.SSLSocket.get_channel_binding`, позволяющий реализовать определенные механизмы аутентификации, такие как SCRAM-SHA-1-PLUS. (Предоставлено Яцеком Конечным в :issue:`12551`.)

source: You can query the SSL compression algorithm used by an SSL socket, thanks to its new :meth:`~ssl.SSLSocket.compression` method. The new attribute :const:`~ssl.OP_NO_COMPRESSION` can be used to disable compression. (Contributed by Antoine Pitrou in :issue:`13634`.)
ru: Вы можете запросить алгоритм сжатия SSL, используемый сокетом SSL, благодаря новому методу :meth:`~ssl.SSLSocket.compression`. Новый атрибут :const:`~ssl.OP_NO_COMPRESSION` можно использовать для отключения сжатия. (Предоставлено Антуаном Питру в :issue:`13634`.)

source: Support has been added for the Next Protocol Negotiation extension using the :meth:`ssl.SSLContext.set_npn_protocols` method. (Contributed by Colin Marc in :issue:`14204`.)
ru: Добавлена ​​поддержка расширения Next Protocol Negotiation с использованием метода :meth:`ssl.SSLContext.set_npn_protocols`. (Предоставлено Колином Марком в :issue:`14204`.)

source: SSL errors can now be introspected more easily thanks to :attr:`~ssl.SSLError.library` and :attr:`~ssl.SSLError.reason` attributes. (Contributed by Antoine Pitrou in :issue:`14837`.)
ru: Ошибки SSL теперь можно легче анализировать благодаря атрибутам :attr:`~ssl.SSLError.library` и :attr:`~ssl.SSLError.reason`. (Предоставлено Антуаном Питру в :issue:`14837`.)

source: The :func:`~ssl.get_server_certificate` function now supports IPv6. (Contributed by Charles-François Natali in :issue:`11811`.)
ru: Функция :func:`~ssl.get_server_certificate` теперь поддерживает IPv6. (Предоставлено Шарлем-Франсуа Натали в :issue:`11811`.)

source: New attribute :const:`~ssl.OP_CIPHER_SERVER_PREFERENCE` allows setting SSLv3 server sockets to use the server's cipher ordering preference rather than the client's (:issue:`13635`).
ru: Новый атрибут :const:`~ssl.OP_CIPHER_SERVER_PREFERENCE` позволяет настроить сокеты сервера SSLv3 для использования предпочтений порядка шифрования сервера, а не клиента (:issue:`13635`).

source: The undocumented tarfile.filemode function has been moved to :func:`stat.filemode`. It can be used to convert a file's mode to a string of the form '-rwxrwxrwx'.
ru: Недокументированная функция tarfile.filemode была перенесена в :func:`stat.filemode`. Его можно использовать для преобразования режима файла в строку вида «-rwxrwxrwx».

source: (Contributed by Giampaolo Rodolà in :issue:`14807`.)
ru: (Предоставлено Джампаоло Родола в :issue:`14807`.)

source: The :mod:`struct` module now supports :c:type:`ssize_t` and :c:type:`size_t` via the new codes ``n`` and ``N``, respectively. (Contributed by Antoine Pitrou in :issue:`3163`.)
ru: Модуль :mod:`struct` теперь поддерживает :c:type:`ssize_t` и :c:type:`size_t` через новые коды ``n`` и ``N`` соответственно. (Предоставлено Антуаном Питру в :issue:`3163`.)

source: Command strings can now be bytes objects on posix platforms. (Contributed by Victor Stinner in :issue:`8513`.)
ru: Командные строки теперь могут быть байтовыми объектами на платформах posix. (Предоставлено Виктором Стиннером в :issue:`8513`.)

source: A new constant :const:`~subprocess.DEVNULL` allows suppressing output in a platform-independent fashion. (Contributed by Ross Lagerwall in :issue:`5870`.)
ru: Новая константа :const:`~subprocess.DEVNULL` позволяет подавлять вывод независимо от платформы. (Предоставлено Россом Лагерволлом в :issue:`5870`.)

source: The :mod:`sys` module has a new :data:`~sys.thread_info` :term:`named tuple` holding information about the thread implementation (:issue:`11223`).
ru: Модуль :mod:`sys` имеет новый :data:`~sys.thread_info` :term:`named tuple`, содержащий информацию о реализации потока (:issue:`11223`).

source: :mod:`tarfile` now supports ``lzma`` encoding via the :mod:`lzma` module. (Contributed by Lars Gustäbel in :issue:`5689`.)
ru: :mod:`tarfile` теперь поддерживает кодирование ``lzma`` через модуль :mod:`lzma`. (Предоставлено Ларсом Густебелем в :issue:`5689`.)

source: :class:`tempfile.SpooledTemporaryFile`\'s :meth:`~tempfile.SpooledTemporaryFile.truncate` method now accepts a ``size`` parameter. (Contributed by Ryan Kelly in :issue:`9957`.)
ru: Метод :class:`tempfile.SpooledTemporaryFile`` :meth:`~tempfile.SpooledTemporaryFile.truncate` теперь принимает параметр ``size``. (Предоставлено Райаном Келли в :issue:`9957`.)

source: The :mod:`textwrap` module has a new :func:`~textwrap.indent` that makes it straightforward to add a common prefix to selected lines in a block of text (:issue:`13857`).
ru: Модуль :mod:`textwrap` имеет новый :func:`~textwrap.indent`, который упрощает добавление общего префикса к выбранным строкам в блоке текста (:issue:`13857`).

source: :class:`threading.Condition`, :class:`threading.Semaphore`, :class:`threading.BoundedSemaphore`, :class:`threading.Event`, and :class:`threading.Timer`, all of which used to be factory functions returning a class instance, are now classes and may be subclassed. (Contributed by Éric Araujo in :issue:`10968`.)
ru: :class:`threading.Condition`, :class:`threading.Semaphore`, :class:`threading.BoundedSemaphore`, :class:`threading.Event` и :class:`threading.Timer`, все из которых используются будучи фабричными функциями, возвращающими экземпляр класса, теперь являются классами и могут быть подклассами. (Предоставлено Эриком Араужо в :issue:`10968`.)

source: The :class:`threading.Thread` constructor now accepts a ``daemon`` keyword argument to override the default behavior of inheriting the ``daemon`` flag value from the parent thread (:issue:`6064`).
ru: Конструктор :class:`threading.Thread` теперь принимает аргумент ключевого слова ``daemon`` для переопределения поведения по умолчанию, наследующего значение флага ``daemon`` от родительского потока (:issue:`6064`).

source: The formerly private function ``_thread.get_ident`` is now available as the public function :func:`threading.get_ident`. This eliminates several cases of direct access to the ``_thread`` module in the stdlib. Third party code that used ``_thread.get_ident`` should likewise be changed to use the new public interface.
ru: Ранее частная функция ``_thread.get_ident`` теперь доступна как общедоступная функция :func:`threading.get_ident`. Это исключает несколько случаев прямого доступа к модулю ``_thread`` в stdlib. Сторонний код, который использовал ``_thread.get_ident``, также должен быть изменен для использования нового общедоступного интерфейса.

source: time
ru: время

source: The :pep:`418` added new functions to the :mod:`time` module:
ru: :pep:`418` добавил новые функции в модуль :mod:`time`:

source: :func:`~time.get_clock_info`: Get information on a clock.
ru: :func:`~time.get_clock_info`: Получить информацию о часах.

source: :func:`~time.monotonic`: Monotonic clock (cannot go backward), not affected by system clock updates.
ru: :func:`~time.monotonic`: Монотонные часы (не могут двигаться назад), на них не влияют обновления системных часов.

source: :func:`~time.perf_counter`: Performance counter with the highest available resolution to measure a short duration.
ru: :func:`~time.perf_counter`: Счетчик производительности с максимально доступным разрешением для измерения короткой продолжительности.

source: :func:`~time.process_time`: Sum of the system and user CPU time of the current process.
ru: :func:`~time.process_time`: Сумма системного и пользовательского времени процессора текущего процесса.

source: Other new functions:
ru: Другие новые функции:

source: :func:`~time.clock_getres`, :func:`~time.clock_gettime` and :func:`~time.clock_settime` functions with :samp:`CLOCK_{xxx}` constants. (Contributed by Victor Stinner in :issue:`10278`.)
ru: :func:`~time.clock_getres`, :func:`~time.clock_gettime` и :func:`~time.clock_settime` с константами :samp:`CLOCK_{xxx}`. (Предоставлено Виктором Стиннером в :issue:`10278`.)

source: To improve cross platform consistency, :func:`~time.sleep` now raises a :exc:`ValueError` when passed a negative sleep value. Previously this was an error on posix, but produced an infinite sleep on Windows.
ru: Чтобы улучшить межплатформенную согласованность, :func:`~time.sleep` теперь вызывает :exc:`ValueError` при передаче отрицательного значения сна. Раньше это была ошибка в posix, но приводила к бесконечному спящему режиму в Windows.

source: types
ru: типы

source: Add a new :class:`types.MappingProxyType` class: Read-only proxy of a mapping. (:issue:`14386`)
ru: Добавьте новый класс :class:`types.MappingProxyType`: прокси-сервер сопоставления, доступный только для чтения. (:issue:`14386`)

source: The new functions :func:`types.new_class` and :func:`types.prepare_class` provide support for :pep:`3115` compliant dynamic type creation. (:issue:`14588`)
ru: Новые функции :func:`types.new_class` и :func:`types.prepare_class` обеспечивают поддержку создания динамических типов, совместимых с :pep:`3115`. (:issue:`14588`)

source: :meth:`.assertRaises`, :meth:`.assertRaisesRegex`, :meth:`.assertWarns`, and :meth:`.assertWarnsRegex` now accept a keyword argument *msg* when used as context managers. (Contributed by Ezio Melotti and Winston Ewert in :issue:`10775`.)
ru: :meth:`.assertRaises`, :meth:`.assertRaisesRegex`, :meth:`.assertWarns` и :meth:`.assertWarnsRegex` теперь принимают аргумент ключевого слова *msg* при использовании в качестве контекстных менеджеров. (Предоставлено Эцио Мелотти и Уинстоном Эвертом в :issue:`10775`.)

source: :meth:`unittest.TestCase.run` now returns the :class:`~unittest.TestResult` object.
ru: :meth:`unittest.TestCase.run` теперь возвращает объект :class:`~unittest.TestResult`.

source: The :class:`~urllib.request.Request` class, now accepts a *method* argument used by :meth:`~urllib.request.Request.get_method` to determine what HTTP method should be used. For example, this will send a ``'HEAD'`` request::
ru: Класс :class:`~urllib.request.Request` теперь принимает аргумент *method*, используемый :meth:`~urllib.request.Request.get_method` для определения того, какой метод HTTP следует использовать. Например, это отправит запрос HEAD::

source: webbrowser
ru: веб-браузер
