Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/whatsnew/3.3.po
Languages: ru

source: The :func:`~io.open` function has a new ``'x'`` mode that can be used to exclusively create a new file, and raise a :exc:`FileExistsError` if the file already exists. It is based on the C11 'x' mode to fopen().
ru: Функция :func:`~io.open` имеет новый режим ``'x'``, который можно использовать исключительно для создания нового файла и вызова :exc:`FileExistsError`, если файл уже существует. Он основан на режиме C11 'x' для fopen().

source: (Contributed by David Townshend in :issue:`12760`.)
ru: (Предоставлено Дэвидом Тауншендом в :issue:`12760`.)

source: The constructor of the :class:`~io.TextIOWrapper` class has a new *write_through* optional argument. If *write_through* is ``True``, calls to :meth:`~io.TextIOWrapper.write` are guaranteed not to be buffered: any data written on the :class:`~io.TextIOWrapper` object is immediately handled to its underlying binary buffer.
ru: Конструктор класса :class:`~io.TextIOWrapper` имеет новый необязательный аргумент *write_through*. Если *write_through* имеет значение True, вызовы :meth:`~io.TextIOWrapper.write` гарантированно не будут буферизованы: любые данные, записанные в объекте :class:`~io.TextIOWrapper`, немедленно обрабатываются его базовый двоичный буфер.

source: :func:`~itertools.accumulate` now takes an optional ``func`` argument for providing a user-supplied binary function.
ru: :func:`~itertools.accumulate` теперь принимает необязательный аргумент func для предоставления двоичной функции, предоставляемой пользователем.

source: The :func:`~logging.basicConfig` function now supports an optional ``handlers`` argument taking an iterable of handlers to be added to the root logger.
ru: Функция :func:`~logging.basicConfig` теперь поддерживает необязательный аргумент ``handlers``, принимающий итерацию обработчиков, которые будут добавлены в корневой регистратор.

source: A class level attribute :attr:`~logging.handlers.SysLogHandler.append_nul` has been added to :class:`~logging.handlers.SysLogHandler` to allow control of the appending of the ``NUL`` (``\000``) byte to syslog records, since for some daemons it is required while for others it is passed through to the log.
ru: Атрибут уровня класса :attr:`~logging.handlers.SysLogHandler.append_nul` был добавлен в :class:`~logging.handlers.SysLogHandler`, чтобы позволить контролировать добавление ``NUL`` (``\000 ``) байт в записи системного журнала, поскольку для некоторых демонов он требуется, а для других он передается в журнал.

source: The :mod:`math` module has a new function, :func:`~math.log2`, which returns the base-2 logarithm of *x*.
ru: В модуле :mod:`math` появилась новая функция :func:`~math.log2`, которая возвращает логарифм по основанию 2 от *x*.

source: (Written by Mark Dickinson in :issue:`11888`.)
ru: (Написано Марком Дикинсоном в :issue:`11888`.)

source: The :meth:`~mmap.mmap.read` method is now more compatible with other file-like objects: if the argument is omitted or specified as ``None``, it returns the bytes from the current file position to the end of the mapping. (Contributed by Petri Lehtinen in :issue:`12021`.)
ru: Метод :meth:`~mmap.mmap.read` теперь более совместим с другими файлоподобными объектами: если аргумент опущен или указан как ``None``, он возвращает байты от текущей позиции файла до конца. картографии. (Предоставлено Петри Лехтиненом в :issue:`12021`.)

source: The new :func:`multiprocessing.connection.wait` function allows polling multiple objects (such as connections, sockets and pipes) with a timeout. (Contributed by Richard Oudkerk in :issue:`12328`.)
ru: Новая функция multiprocessing.connection.wait позволяет опрашивать несколько объектов (таких как соединения, сокеты и каналы) с таймаутом. (Предоставлено Ричардом Оудкерком в :issue:`12328`.)

source: :class:`multiprocessing.Connection` objects can now be transferred over multiprocessing connections. (Contributed by Richard Oudkerk in :issue:`4892`.)
ru: Объекты :class:`multiprocessing.Connection` теперь можно передавать через многопроцессорные соединения. (Предоставлено Ричардом Оудкерком в :issue:`4892`.)

source: :class:`multiprocessing.Process` now accepts a ``daemon`` keyword argument to override the default behavior of inheriting the ``daemon`` flag from the parent process (:issue:`6064`).
ru: :class:`multiprocessing.Process` теперь принимает аргумент ключевого слова ``daemon``, чтобы переопределить поведение по умолчанию, заключающееся в наследовании флага ``daemon`` от родительского процесса (:issue:`6064`).

source: New attribute :data:`multiprocessing.Process.sentinel` allows a program to wait on multiple :class:`~multiprocessing.Process` objects at one time using the appropriate OS primitives (for example, :mod:`select` on posix systems).
ru: Новый атрибут :data:`multiprocessing.Process.sentinel` позволяет программе одновременно ожидать обработки нескольких объектов :class:`~multiprocessing.Process`, используя соответствующие примитивы ОС (например, :mod:`select` в системах posix ).

source: New methods :meth:`multiprocessing.pool.Pool.starmap` and :meth:`~multiprocessing.pool.Pool.starmap_async` provide :func:`itertools.starmap` equivalents to the existing :meth:`multiprocessing.pool.Pool.map` and :meth:`~multiprocessing.pool.Pool.map_async` functions. (Contributed by Hynek Schlawack in :issue:`12708`.)
ru: Новые методы :meth:`multiprocessing.pool.Pool.starmap` и :meth:`~multiprocessing.pool.Pool.starmap_async` предоставляют :func:`itertools.starmap` эквиваленты существующего :meth:`multiprocessing.pool.Pool Функции .map` и :meth:`~multiprocessing.pool.Pool.map_async`. (Предоставлено Хайнеком Шлаваком в :issue:`12708`.)

source: The :class:`!nntplib.NNTP` class now supports the context management protocol to unconditionally consume :exc:`socket.error` exceptions and to close the NNTP connection when done::
ru: Класс :class:`!nntplib.NNTP` теперь поддерживает протокол управления контекстом для безусловного использования исключений :exc:`socket.error` и закрытия NNTP-соединения после завершения::

source: (Contributed by Giampaolo Rodolà in :issue:`9795`.)
ru: (Предоставлено Джампаоло Родола в :issue:`9795`.)

source: The :mod:`os` module has a new :func:`~os.pipe2` function that makes it possible to create a pipe with :const:`~os.O_CLOEXEC` or :const:`~os.O_NONBLOCK` flags set atomically. This is especially useful to avoid race conditions in multi-threaded programs.
ru: Модуль :mod:`os` имеет новую функцию :func:`~os.pipe2`, которая позволяет создавать канал с флагами :const:`~os.O_CLOEXEC` или :const:`~os.O_NONBLOCK`. установить атомарно. Это особенно полезно для предотвращения состояний гонки в многопоточных программах.

source: The :mod:`os` module has a new :func:`~os.sendfile` function which provides an efficient "zero-copy" way for copying data from one file (or socket) descriptor to another. The phrase "zero-copy" refers to the fact that all of the copying of data between the two descriptors is done entirely by the kernel, with no copying of data into userspace buffers. :func:`~os.sendfile` can be used to efficiently copy data from a file on disk to a network socket, e.g. for downloading a file.
ru: Модуль :mod:`os` имеет новую функцию :func:`~os.sendfile`, которая обеспечивает эффективный способ копирования данных из одного дескриптора файла (или сокета) с «нулевым копированием» в другой. Фраза «нулевое копирование» относится к тому факту, что все копирование данных между двумя дескрипторами полностью выполняется ядром, без копирования данных в буферы пользовательского пространства. :func:`~os.sendfile` можно использовать для эффективного копирования данных из файла на диске в сетевой сокет, например, для загрузки файла.

source: (Patch submitted by Ross Lagerwall and Giampaolo Rodolà in :issue:`10882`.)
ru: (Патч представлен Россом Лагерволлом и Джампаоло Родоло в :issue:`10882`.)

source: To avoid race conditions like symlink attacks and issues with temporary files and directories, it is more reliable (and also faster) to manipulate file descriptors instead of file names. Python 3.3 enhances existing functions and introduces new functions to work on file descriptors (:issue:`4761`, :issue:`10755` and :issue:`14626`).
ru: Чтобы избежать состояний гонки, таких как атаки по символическим ссылкам и проблемы с временными файлами и каталогами, надежнее (и быстрее) манипулировать дескрипторами файлов, а не именами файлов. Python 3.3 расширяет существующие функции и вводит новые функции для работы с файловыми дескрипторами (:issue:`4761`, :issue:`10755` и :issue:`14626`).

source: The :mod:`os` module has a new :func:`~os.fwalk` function similar to :func:`~os.walk` except that it also yields file descriptors referring to the directories visited. This is especially useful to avoid symlink races.
ru: Модуль :mod:`os` имеет новую функцию :func:`~os.fwalk`, аналогичную :func:`~os.walk`, за исключением того, что она также возвращает файловые дескрипторы, ссылающиеся на посещенные каталоги. Это особенно полезно, чтобы избежать гонок по символическим ссылкам.

source: The following functions get new optional *dir_fd* (:ref:`paths relative to directory descriptors <dir_fd>`) and/or *follow_symlinks* (:ref:`not following symlinks <follow_symlinks>`): :func:`~os.access`, :func:`~os.chflags`, :func:`~os.chmod`, :func:`~os.chown`, :func:`~os.link`, :func:`~os.lstat`, :func:`~os.mkdir`, :func:`~os.mkfifo`, :func:`~os.mknod`, :func:`~os.open`, :func:`~os.readlink`, :func:`~os.remove`, :func:`~os.rename`, :func:`~os.replace`, :func:`~os.rmdir`, :func:`~os.stat`, :func:`~os.symlink`, :func:`~os.unlink`, :func:`~os.utime`. Platform support for using these parameters can be checked via the sets :data:`os.supports_dir_fd` and :data:`os.supports_follows_symlinks`.
ru: Следующие функции получают новые дополнительные *dir_fd* (:ref:`пути относительно дескрипторов каталогов <dir_fd>`) и/или *follow_symlinks* (:ref:`не следующие символические ссылки <follow_symlinks>`): :func:`~os .access`, :func:`~os.chflags`, :func:`~os.chmod`, :func:`~os.chown`, :func:`~os.link`, :func:`~os .lstat`, :func:`~os.mkdir`, :func:`~os.mkfifo`, :func:`~os.mknod`, :func:`~os.open`, :func:`~os .readlink`, :func:`~os.remove`, :func:`~os.rename`, :func:`~os.replace`, :func:`~os.rmdir`, :func:`~os .stat`, :func:`~os.symlink`, :func:`~os.unlink`, :func:`~os.utime`. Поддержка платформы для использования этих параметров можно проверить с помощью наборов :data:`os.supports_dir_fd` и :data:`os.supports_follows_symlinks`.

source: The following functions now support a file descriptor for their path argument: :func:`~os.chdir`, :func:`~os.chmod`, :func:`~os.chown`, :func:`~os.execve`, :func:`~os.listdir`, :func:`~os.pathconf`, :func:`~os.path.exists`, :func:`~os.stat`, :func:`~os.statvfs`, :func:`~os.utime`. Platform support for this can be checked via the :data:`os.supports_fd` set.
ru: Следующие функции теперь поддерживают дескриптор файла в качестве аргумента пути: :func:`~os.chdir`, :func:`~os.chmod`, :func:`~os.chown`, :func:`~os. execve`, :func:`~os.listdir`, :func:`~os.pathconf`, :func:`~os.path.exists`, :func:`~os.stat`, :func:`~ os.statvfs`, :func:`~os.utime`. Поддержка платформы для этого может быть проверена с помощью набора :data:`os.supports_fd`.

source: :func:`~os.access` accepts an ``effective_ids`` keyword argument to turn on using the effective uid/gid rather than the real uid/gid in the access check. Platform support for this can be checked via the :data:`~os.supports_effective_ids` set.
ru: :func:`~os.access` принимает аргумент ключевого слова ``efficient_ids`` для включения использования эффективного uid/gid, а не реального uid/gid при проверке доступа. Поддержка платформы для этого может быть проверена с помощью набора :data:`~os.supports_efficient_ids`.

source: The :mod:`os` module has two new functions: :func:`~os.getpriority` and :func:`~os.setpriority`. They can be used to get or set process niceness/priority in a fashion similar to :func:`os.nice` but extended to all processes instead of just the current one.
ru: Модуль :mod:`os` имеет две новые функции: :func:`~os.getpriority` и :func:`~os.setpriority`. Их можно использовать для получения или установки приоритета/приятности процесса аналогично :func:`os.nice`, но распространяется на все процессы, а не только на текущий.

source: (Patch submitted by Giampaolo Rodolà in :issue:`10784`.)
ru: (Патч предоставлен Джампаоло Родолом в :issue:`10784`.)

source: The new :func:`os.replace` function allows cross-platform renaming of a file with overwriting the destination. With :func:`os.rename`, an existing destination file is overwritten under POSIX, but raises an error under Windows. (Contributed by Antoine Pitrou in :issue:`8828`.)
ru: Новая функция :func:`os.replace` позволяет кросс-платформенное переименование файла с перезаписью места назначения. При использовании :func:`os.rename` существующий файл назначения перезаписывается в POSIX, но вызывает ошибку в Windows. (Предоставлено Антуаном Питру в :issue:`8828`.)

source: The stat family of functions (:func:`~os.stat`, :func:`~os.fstat`, and :func:`~os.lstat`) now support reading a file's timestamps with nanosecond precision. Symmetrically, :func:`~os.utime` can now write file timestamps with nanosecond precision. (Contributed by Larry Hastings in :issue:`14127`.)
ru: Семейство функций stat (:func:`~os.stat`, :func:`~os.fstat` и :func:`~os.lstat`) теперь поддерживает чтение временных меток файла с точностью до наносекунды. Симметрично, :func:`~os.utime` теперь может записывать временные метки файлов с точностью до наносекунды. (Предоставлено Ларри Гастингсом в :issue:`14127`.)

source: The new :func:`os.get_terminal_size` function queries the size of the terminal attached to a file descriptor. See also :func:`shutil.get_terminal_size`. (Contributed by Zbigniew Jędrzejewski-Szmek in :issue:`13609`.)
ru: Новая функция :func:`os.get_terminal_size` запрашивает размер терминала, прикрепленного к файловому дескриптору. См. также :func:`shutil.get_terminal_size`. (Предоставлено Збигневом Енджеевским-Шмеком в :issue:`13609`.)

source: New functions to support Linux extended attributes (:issue:`12720`): :func:`~os.getxattr`, :func:`~os.listxattr`, :func:`~os.removexattr`, :func:`~os.setxattr`.
ru: Новые функции для поддержки расширенных атрибутов Linux (:issue:`12720`): :func:`~os.getxattr`, :func:`~os.listxattr`, :func:`~os.removexattr`, :func:` ~os.setxattr`.

source: New interface to the scheduler. These functions control how a process is allocated CPU time by the operating system. New functions: :func:`~os.sched_get_priority_max`, :func:`~os.sched_get_priority_min`, :func:`~os.sched_getaffinity`, :func:`~os.sched_getparam`, :func:`~os.sched_getscheduler`, :func:`~os.sched_rr_get_interval`, :func:`~os.sched_setaffinity`, :func:`~os.sched_setparam`, :func:`~os.sched_setscheduler`, :func:`~os.sched_yield`,
ru: Новый интерфейс планировщика. Эти функции управляют тем, как операционная система распределяет процессорное время процессу. Новые функции: :func:`~os.sched_get_priority_max`, :func:`~os.sched_get_priority_min`, :func:`~os.sched_getaffinity`, :func:`~os.sched_getparam`, :func:`~os. sched_getscheduler`, :func:`~os.sched_rr_get_interval`, :func:`~os.sched_setaffinity`, :func:`~os.sched_setparam`, :func:`~os.sched_setscheduler`, :func:`~os. план_доходности`,

source: New functions to control the file system:
ru: Новые функции для управления файловой системой:

source: :func:`~os.posix_fadvise`: Announces an intention to access data in a specific pattern thus allowing the kernel to make optimizations.
ru: :func:`~os.posix_fadvise`: Объявляет о намерении получить доступ к данным по определенному шаблону, что позволяет ядру выполнять оптимизацию.

source: :func:`~os.posix_fallocate`: Ensures that enough disk space is allocated for a file.
ru: :func:`~os.posix_fallocate`: Гарантирует, что для файла выделено достаточно места на диске.

source: :func:`~os.sync`: Force write of everything to disk.
ru: :func:`~os.sync`: Принудительная запись всего на диск.

source: Additional new posix functions:
ru: Дополнительные новые функции posix:

source: :func:`~os.lockf`: Apply, test or remove a POSIX lock on an open file descriptor.
ru: :func:`~os.lockf`: Применить, проверить или удалить блокировку POSIX для открытого файлового дескриптора.

source: :func:`~os.pread`: Read from a file descriptor at an offset, the file offset remains unchanged.
ru: :func:`~os.pread`: Читается из дескриптора файла по смещению, смещение файла остается неизменным.

source: :func:`~os.pwrite`: Write to a file descriptor from an offset, leaving the file offset unchanged.
ru: :func:`~os.pwrite`: Запись в дескриптор файла по смещению, оставляя смещение файла неизменным.

source: :func:`~os.readv`: Read from a file descriptor into a number of writable buffers.
ru: :func:`~os.readv`: Чтение из файлового дескриптора в несколько записываемых буферов.

source: :func:`~os.truncate`: Truncate the file corresponding to *path*, so that it is at most *length* bytes in size.
ru: :func:`~os.truncate`: Усекает файл, соответствующий *path*, чтобы его размер не превышал *length* байт.

source: :func:`~os.waitid`: Wait for the completion of one or more child processes.
ru: :func:`~os.waitid`: Дождитесь завершения одного или нескольких дочерних процессов.

source: :func:`~os.writev`: Write the contents of *buffers* to a file descriptor, where *buffers* is an arbitrary sequence of buffers.
ru: :func:`~os.writev`: Записывает содержимое *buffers* в файловый дескриптор, где *buffers* — это произвольная последовательность буферов.

source: :func:`~os.getgrouplist` (:issue:`9344`): Return list of group ids that specified user belongs to.
ru: :func:`~os.getgrouplist` (:issue:`9344`): Возвращает список идентификаторов групп, к которым принадлежит указанный пользователь.

source: :func:`~os.times` and :func:`~os.uname`: Return type changed from a tuple to a tuple-like object with named attributes.
ru: :func:`~os.times` и :func:`~os.uname`: тип возвращаемого значения изменен с кортежа на объект, подобный кортежу, с именованными атрибутами.

source: Some platforms now support additional constants for the :func:`~os.lseek` function, such as ``os.SEEK_HOLE`` and ``os.SEEK_DATA``.
ru: Некоторые платформы теперь поддерживают дополнительные константы для функции :func:`~os.lseek`, такие как os.SEEK_HOLE и os.SEEK_DATA.

source: New constants :const:`~os.RTLD_LAZY`, :const:`~os.RTLD_NOW`, :const:`~os.RTLD_GLOBAL`, :const:`~os.RTLD_LOCAL`, :const:`~os.RTLD_NODELETE`, :const:`~os.RTLD_NOLOAD`, and :const:`~os.RTLD_DEEPBIND` are available on platforms that support them. These are for use with the :func:`sys.setdlopenflags` function, and supersede the similar constants defined in :mod:`ctypes` and :mod:`DLFCN`. (Contributed by Victor Stinner in :issue:`13226`.)
ru: Новые константы :const:`~os.RTLD_LAZY`, :const:`~os.RTLD_NOW`, :const:`~os.RTLD_GLOBAL`, :const:`~os.RTLD_LOCAL`, :const:`~os.RTLD_NODELETE `, :const:`~os.RTLD_NOLOAD` и :const:`~os.RTLD_DEEPBIND` доступны на платформах, которые их поддерживают. Они предназначены для использования с функцией :func:`sys.setdlopenflags` и заменяют аналогичные константы, определенные в :mod:`ctypes` и :mod:`DLFCN`. (Предоставлено Виктором Стиннером в :issue:`13226`.)

source: :func:`os.symlink` now accepts (and ignores) the ``target_is_directory`` keyword argument on non-Windows platforms, to ease cross-platform support.
ru: :func:`os.symlink` теперь принимает (и игнорирует) аргумент ключевого слова ``target_is_directory`` на платформах, отличных от Windows, чтобы облегчить кросс-платформенную поддержку.

source: Tab-completion is now available not only for command names, but also their arguments. For example, for the ``break`` command, function and file names are completed.
ru: Дополнение по табуляции теперь доступно не только для имен команд, но и для их аргументов. Например, для команды «break» имена функций и файлов дополняются.

source: (Contributed by Georg Brandl in :issue:`14210`)
ru: (Предоставлено Георгом Брандлом в :issue:`14210`)

source: :class:`pickle.Pickler` objects now have an optional :attr:`~pickle.Pickler.dispatch_table` attribute allowing per-pickler reduction functions to be set.
ru: Объекты :class:`pickle.Pickler` теперь имеют дополнительный атрибут :attr:`~pickle.Pickler.dispatch_table`, позволяющий устанавливать функции сокращения для каждого пиклера.

source: (Contributed by Richard Oudkerk in :issue:`14166`.)
ru: (Предоставлено Ричардом Оудкерком в :issue:`14166`.)

source: The Tk GUI and the :func:`~pydoc.serve` function have been removed from the :mod:`pydoc` module: ``pydoc -g`` and :func:`~pydoc.serve` have been deprecated in Python 3.2.
ru: Графический интерфейс Tk и функция :func:`~pydoc.serve` были удалены из модуля :mod:`pydoc`: ``pydoc -g`` и :func:`~pydoc.serve` устарели в Python. 3.2.

source: :class:`str` regular expressions now support ``\u`` and ``\U`` escapes.
ru: :class:`str` Регулярные выражения теперь поддерживают escape-символы ``\u`` и ``\U``.

source: (Contributed by Serhiy Storchaka in :issue:`3665`.)
ru: (Предоставлено Сергеем Сторчакой в ​​:issue:`3665`.)

source: :meth:`~sched.scheduler.run` now accepts a *blocking* parameter which when set to false makes the method execute the scheduled events due to expire soonest (if any) and then return immediately. This is useful in case you want to use the :class:`~sched.scheduler` in non-blocking applications. (Contributed by Giampaolo Rodolà in :issue:`13449`.)
ru: :meth:`~sched.scheduler.run` теперь принимает параметр *blocking*, который, если ему присвоено значение false, заставляет метод выполнять запланированные события, срок действия которых истекает раньше всего (если таковые имеются), а затем немедленно возвращаться. Это полезно, если вы хотите использовать :class:`~sched.scheduler` в неблокирующих приложениях. (Предоставлено Джампаоло Родола в :issue:`13449`.)

source: :class:`~sched.scheduler` class can now be safely used in multi-threaded environments. (Contributed by Josiah Carlson and Giampaolo Rodolà in :issue:`8684`.)
ru: Класс :class:`~sched.scheduler` теперь можно безопасно использовать в многопоточных средах. (Предоставлено Джозайей Карлсоном и Джампаоло Родола в :issue:`8684`.)

source: *timefunc* and *delayfunct* parameters of :class:`~sched.scheduler` class constructor are now optional and defaults to :func:`time.time` and :func:`time.sleep` respectively. (Contributed by Chris Clark in :issue:`13245`.)
ru: Параметры *timefunc* и *delayfunct* конструктора класса :class:`~sched.scheduler` теперь являются необязательными и по умолчанию имеют значения :func:`time.time` и :func:`time.sleep` соответственно. (Предоставлено Крисом Кларком в :issue:`13245`.)

source: :meth:`~sched.scheduler.enter` and :meth:`~sched.scheduler.enterabs` *argument* parameter is now optional. (Contributed by Chris Clark in :issue:`13245`.)
ru: Параметр *argument* :meth:`~sched.scheduler.enter` и :meth:`~sched.scheduler.enterabs` теперь является необязательным. (Предоставлено Крисом Кларком в :issue:`13245`.)

source: :meth:`~sched.scheduler.enter` and :meth:`~sched.scheduler.enterabs` now accept a *kwargs* parameter. (Contributed by Chris Clark in :issue:`13245`.)
ru: :meth:`~sched.scheduler.enter` и :meth:`~sched.scheduler.enterabs` теперь принимают параметр *kwargs*. (Предоставлено Крисом Кларком в :issue:`13245`.)

source: Solaris and derivative platforms have a new class :class:`select.devpoll` for high performance asynchronous sockets via :file:`/dev/poll`. (Contributed by Jesús Cea Avión in :issue:`6397`.)
ru: Solaris и производные платформы имеют новый класс :class:`select.devpoll` для высокопроизводительных асинхронных сокетов через :file:`/dev/poll`. (Предоставлено Хесусом Сеа Авионом в :issue:`6397`.)
