Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/whatsnew/3.3.po
Languages: ru

source: The :mod:`webbrowser` module supports more "browsers": Google Chrome (named :program:`chrome`, :program:`chromium`, :program:`chrome-browser` or :program:`chromium-browser` depending on the version and operating system), and the generic launchers :program:`xdg-open`, from the FreeDesktop.org project, and :program:`gvfs-open`, which is the default URI handler for GNOME 3. (The former contributed by Arnaud Calmettes in :issue:`13620`, the latter by Matthias Klose in :issue:`14493`.)
ru: Модуль :mod:`webbrowser` поддерживает больше "браузеров": Google Chrome (названный :program:`chrome`, :program:`chromium`, :program:`chrome-browser` или :program:`chromium-browser` в зависимости от в зависимости от версии и операционной системы), а также общие средства запуска :program:`xdg-open` из проекта FreeDesktop.org и :program:`gvfs-open`, который является обработчиком URI по умолчанию для GNOME 3. ( первый предоставлен Арно Кальметтом в :issue:`13620`, второй - Маттиасом Клозе в :issue:`14493`.)

source: The :mod:`xml.etree.ElementTree` module now imports its C accelerator by default; there is no longer a need to explicitly import :mod:`xml.etree.cElementTree` (this module stays for backwards compatibility, but is now deprecated). In addition, the ``iter`` family of methods of :class:`~xml.etree.ElementTree.Element` has been optimized (rewritten in C). The module's documentation has also been greatly improved with added examples and a more detailed reference.
ru: Модуль :mod:`xml.etree.ElementTree` теперь по умолчанию импортирует свой ускоритель C; больше нет необходимости явно импортировать :mod:`xml.etree.cElementTree` (этот модуль остался для обратной совместимости, но теперь устарел). Кроме того, было оптимизировано (переписано на C) семейство методов ``iter`` :class:`~xml.etree.ElementTree.Element`. Документация модуля также была значительно улучшена: добавлены примеры и более подробная ссылка.

source: New attribute :attr:`zlib.Decompress.eof` makes it possible to distinguish between a properly formed compressed stream and an incomplete or truncated one. (Contributed by Nadeem Vawda in :issue:`12646`.)
ru: Новый атрибут :attr:`zlib.Decompress.eof` позволяет отличить правильно сформированный сжатый поток от неполного или усеченного. (Предоставлено Надимом Вавдой в :issue:`12646`.)

source: New attribute :const:`zlib.ZLIB_RUNTIME_VERSION` reports the version string of the underlying ``zlib`` library that is loaded at runtime. (Contributed by Torsten Landschoff in :issue:`12306`.)
ru: Новый атрибут :const:`zlib.ZLIB_RUNTIME_VERSION` сообщает строку версии базовой библиотеки ``zlib``, которая загружается во время выполнения. (Предоставлено Торстеном Ландшоффом в :issue:`12306`.)

source: Optimizations
ru: Оптимизации

source: Major performance enhancements have been added:
ru: Были добавлены важные улучшения производительности:

source: Thanks to :pep:`393`, some operations on Unicode strings have been optimized:
ru: Благодаря :pep:`393` некоторые операции со строками Unicode были оптимизированы:

source: the memory footprint is divided by 2 to 4 depending on the text
ru: объем памяти делится от 2 до 4 в зависимости от текста

source: encode an ASCII string to UTF-8 doesn't need to encode characters anymore, the UTF-8 representation is shared with the ASCII representation
ru: кодировать строку ASCII в UTF-8 больше не нужно кодировать символы, представление UTF-8 используется совместно с представлением ASCII

source: the UTF-8 encoder has been optimized
ru: кодировщик UTF-8 был оптимизирован

source: repeating a single ASCII letter and getting a substring of an ASCII string is 4 times faster
ru: повтор одной буквы ASCII и получение подстроки строки ASCII происходит в 4 раза быстрее

source: UTF-8 is now 2x to 4x faster. UTF-16 encoding is now up to 10x faster.
ru: UTF-8 теперь работает в 2–4 раза быстрее. Кодировка UTF-16 теперь работает до 10 раз быстрее.

source: (Contributed by Serhiy Storchaka, :issue:`14624`, :issue:`14738` and :issue:`15026`.)
ru: (Предоставлено Сергеем Сторчакой, :issue:`14624`, :issue:`14738` и :issue:`15026`.)

source: Build and C API Changes
ru: Изменения API сборки и C

source: Changes to Python's build process and to the C API include:
ru: Изменения в процессе сборки Python и C API включают в себя:

source: New :pep:`3118` related function:
ru: Новая функция, связанная с :pep:`3118`:

source: :pep:`393` added new Unicode types, macros and functions:
ru: :pep:`393` добавил новые типы Unicode, макросы и функции:

source: High-level API:
ru: Высокоуровневый API:

source: Low-level API:
ru: низкоуровневый API:

source: :c:type:`Py_UCS1`, :c:type:`Py_UCS2`, :c:type:`Py_UCS4` types
ru: Типы :c:type:`Py_UCS1`, :c:type:`Py_UCS2`, :c:type:`Py_UCS4`

source: :c:type:`PyASCIIObject` and :c:type:`PyCompactUnicodeObject` structures
ru: Структуры :c:type:`PyASCIIObject` и :c:type:`PyCompactUnicodeObject`

source: :c:macro:`PyUnicode_KIND` with :c:enum:`PyUnicode_Kind` enum: :c:data:`!PyUnicode_WCHAR_KIND`, :c:data:`PyUnicode_1BYTE_KIND`, :c:data:`PyUnicode_2BYTE_KIND`, :c:data:`PyUnicode_4BYTE_KIND`
ru: :c:macro:`PyUnicode_KIND` с :c:enum:`PyUnicode_Kind` enum: :c:data:`!PyUnicode_WCHAR_KIND`, :c:data:`PyUnicode_1BYTE_KIND`, :c:data:`PyUnicode_2BYTE_KIND`, :c:data:`PyUnicode_4BYTE_KIND`

source: :c:macro:`PyArg_ParseTuple` now accepts a :class:`bytearray` for the ``c`` format (:issue:`12380`).
ru: :c:macro:`PyArg_ParseTuple` теперь принимает :class:`bytearray` для формата ``c`` (:issue:`12380`).

source: Deprecated
ru: Устарел

source: Unsupported Operating Systems
ru: Неподдерживаемые операционные системы

source: OS/2 and VMS are no longer supported due to the lack of a maintainer.
ru: OS/2 и VMS больше не поддерживаются из-за отсутствия сопровождающего.

source: Windows 2000 and Windows platforms which set ``COMSPEC`` to ``command.com`` are no longer supported due to maintenance burden.
ru: Платформы Windows 2000 и Windows, для которых для COMSPEC установлено значение «command.com», больше не поддерживаются из-за необходимости обслуживания.

source: OSF support, which was deprecated in 3.2, has been completely removed.
ru: Поддержка OSF, устаревшая в версии 3.2, полностью удалена.

source: Deprecated Python modules, functions and methods
ru: Устаревшие модули, функции и методы Python

source: Passing a non-empty string to ``object.__format__()`` is deprecated, and will produce a :exc:`TypeError` in Python 3.4 (:issue:`9856`).
ru: Передача непустой строки в ``object.__format__()`` устарела и приведет к возникновению ошибки :exc:`TypeError` в Python 3.4 (:issue:`9856`).

source: The ``unicode_internal`` codec has been deprecated because of the :pep:`393`, use UTF-8, UTF-16 (``utf-16-le`` or ``utf-16-be``), or UTF-32 (``utf-32-le`` or ``utf-32-be``)
ru: Кодек ``unicode_internal`` устарел из-за :pep:`393`, используйте UTF-8, UTF-16 (``utf-16-le`` или ``utf-16-be``), или UTF-32 (``utf-32-le`` или ``utf-32-be``)

source: :meth:`ftplib.FTP.nlst` and :meth:`ftplib.FTP.dir`: use :meth:`ftplib.FTP.mlsd`
ru: :meth:`ftplib.FTP.nlst` и :meth:`ftplib.FTP.dir`: используйте :meth:`ftplib.FTP.mlsd`

source: :func:`platform.popen`: use the :mod:`subprocess` module. Check especially the :ref:`subprocess-replacements` section (:issue:`11377`).
ru: :func:`platform.popen`: используйте модуль :mod:`subprocess`. Особенно проверьте раздел :ref:`subprocess-replacements` (:issue:`11377`).

source: :issue:`13374`: The Windows bytes API has been deprecated in the :mod:`os` module. Use Unicode filenames, instead of bytes filenames, to not depend on the ANSI code page anymore and to support any filename.
ru: :issue:`13374`: API-интерфейс Windows bytes устарел в модуле :mod:`os`. Используйте имена файлов в Юникоде вместо байтовых имен файлов, чтобы больше не зависеть от кодовой страницы ANSI и поддерживать любое имя файла.

source: :issue:`13988`: The :mod:`xml.etree.cElementTree` module is deprecated. The accelerator is used automatically whenever available.
ru: :issue:`13988`: Модуль :mod:`xml.etree.cElementTree` устарел. Ускоритель используется автоматически, когда он доступен.

source: The behaviour of :func:`time.clock` depends on the platform: use the new :func:`time.perf_counter` or :func:`time.process_time` function instead, depending on your requirements, to have a well defined behaviour.
ru: Поведение :func:`time.clock` зависит от платформы: вместо этого используйте новую функцию :func:`time.perf_counter` или :func:`time.process_time`, в зависимости от ваших требований, чтобы иметь четко определенное поведение. .

source: The :func:`os.stat_float_times` function is deprecated.
ru: Функция :func:`os.stat_float_times` устарела.

source: :mod:`abc` module:
ru: Модуль :mod:`abc`:

source: :mod:`importlib` package:
ru: Пакет :mod:`importlib`:

source: :meth:`importlib.abc.SourceLoader.path_mtime` is now deprecated in favour of :meth:`importlib.abc.SourceLoader.path_stats` as bytecode files now store both the modification time and size of the source file the bytecode file was compiled from.
ru: :meth:`importlib.abc.SourceLoader.path_mtime` теперь устарел в пользу :meth:`importlib.abc.SourceLoader.path_stats`, поскольку файлы байт-кода теперь хранят как время модификации, так и размер исходного файла, в котором был скомпилирован файл байт-кода. от.

source: Deprecated functions and types of the C API
ru: Устаревшие функции и типы C API

source: The :c:type:`Py_UNICODE` has been deprecated by :pep:`393` and will be removed in Python 4. All functions using this type are deprecated:
ru: Параметр :c:type:`Py_UNICODE` признан устаревшим по :pep:`393` и будет удален в Python 4. Все функции, использующие этот тип, являются устаревшими:

source: Unicode functions and methods using :c:type:`Py_UNICODE` and :c:expr:`Py_UNICODE*` types:
ru: Функции и методы Unicode, использующие типы :c:type:`Py_UNICODE` и :c:expr:`Py_UNICODE*`:

source: :c:macro:`!PyUnicode_FromUnicode`: use :c:func:`PyUnicode_FromWideChar` or :c:func:`PyUnicode_FromKindAndData`
ru: :c:macro:`!PyUnicode_FromUnicode`: использует:c:func:`PyUnicode_FromWideChar` или :c:func:`PyUnicode_FromKindAndData`

source: :c:macro:`!PyUnicode_AS_UNICODE`, :c:func:`!PyUnicode_AsUnicode`, :c:func:`!PyUnicode_AsUnicodeAndSize`: use :c:func:`PyUnicode_AsWideCharString`
ru: :c:macro:`!PyUnicode_AS_UNICODE`, :c:func:`!PyUnicode_AsUnicode`, :c:func:`!PyUnicode_AsUnicodeAndSize`: используют:c:func:`PyUnicode_AsWideCharString`

source: :c:macro:`!PyUnicode_AS_DATA`: use :c:macro:`PyUnicode_DATA` with :c:macro:`PyUnicode_READ` and :c:macro:`PyUnicode_WRITE`
ru: :c:macro:`!PyUnicode_AS_DATA`: использует :c:macro:`PyUnicode_DATA` с :c:macro:`PyUnicode_READ` и :c:macro:`PyUnicode_WRITE`

source: :c:macro:`!PyUnicode_GET_SIZE`, :c:func:`!PyUnicode_GetSize`: use :c:macro:`PyUnicode_GET_LENGTH` or :c:func:`PyUnicode_GetLength`
ru: :c:macro:`!PyUnicode_GET_SIZE`, :c:func:`!PyUnicode_GetSize`: используют :c:macro:`PyUnicode_GET_LENGTH` или :c:func:`PyUnicode_GetLength`

source: :c:macro:`!PyUnicode_GET_DATA_SIZE`: use ``PyUnicode_GET_LENGTH(str) * PyUnicode_KIND(str)`` (only work on ready strings)
ru: :c:macro:`!PyUnicode_GET_DATA_SIZE`: использует ``PyUnicode_GET_LENGTH(str) * PyUnicode_KIND(str)`` (работает только с готовыми строки)

source: :c:func:`!PyUnicode_AsUnicodeCopy`: use :c:func:`PyUnicode_AsUCS4Copy` or :c:func:`PyUnicode_AsWideCharString`
ru: :c:func:`!PyUnicode_AsUnicodeCopy`: использует :c:func:`PyUnicode_AsUCS4Copy` или :c:func:`PyUnicode_AsWideCharString`

source: Functions and macros manipulating Py_UNICODE* strings:
ru: Функции и макросы, манипулирующие строками Py_UNICODE*:

source: :c:macro:`!Py_UNICODE_strlen()`: use :c:func:`PyUnicode_GetLength` or :c:macro:`PyUnicode_GET_LENGTH`
ru: :c:macro:`!Py_UNICODE_strlen()`: использует :c:func:`PyUnicode_GetLength` или :c:macro:`PyUnicode_GET_LENGTH`

source: :c:macro:`!Py_UNICODE_strcat()`: use :c:func:`PyUnicode_CopyCharacters` or :c:func:`PyUnicode_FromFormat`
ru: :c:macro:`!Py_UNICODE_strcat()`: использует :c:func:`PyUnicode_CopyCharacters` или :c:func:`PyUnicode_FromFormat`

source: :c:macro:`!Py_UNICODE_strcpy()`, :c:macro:`!Py_UNICODE_strncpy()`, :c:macro:`!Py_UNICODE_COPY()`: use :c:func:`PyUnicode_CopyCharacters` or :c:func:`PyUnicode_Substring`
ru: :c:macro:`!Py_UNICODE_strcpy()`, :c:macro:`!Py_UNICODE_strncpy()`, :c:macro:`!Py_UNICODE_COPY()`: используют :c:func:`PyUnicode_CopyCharacters` или :c:func:`PyUnicode_Substring`

source: :c:macro:`!Py_UNICODE_strcmp()`: use :c:func:`PyUnicode_Compare`
ru: :c:macro:`!Py_UNICODE_strcmp()`: использует :c:func:`PyUnicode_Compare`

source: :c:macro:`!Py_UNICODE_strncmp()`: use :c:func:`PyUnicode_Tailmatch`
ru: :c:macro:`!Py_UNICODE_strncmp()`: использует :c:func:`PyUnicode_Tailmatch`

source: :c:macro:`!Py_UNICODE_strchr()`, :c:macro:`!Py_UNICODE_strrchr()`: use :c:func:`PyUnicode_FindChar`
ru: :c:macro:`!Py_UNICODE_strchr()`, :c:macro:`!Py_UNICODE_strrchr()`: используют :c:func:`PyUnicode_FindChar`

source: :c:macro:`!Py_UNICODE_FILL()`: use :c:func:`PyUnicode_Fill`
ru: :c:macro:`!Py_UNICODE_FILL()`: использует :c:func:`PyUnicode_Fill`

source: Encoders:
ru: Кодировщики:

source: :c:func:`!PyUnicode_Encode`: use :c:func:`!PyUnicode_AsEncodedObject`
ru: :c:func:`!PyUnicode_Encode`: использует:c:func:`!PyUnicode_AsEncodedObject`

source: :c:func:`!PyUnicode_EncodeUTF8`: use :c:func:`PyUnicode_AsUTF8` or :c:func:`PyUnicode_AsUTF8String`
ru: :c:func:`!PyUnicode_EncodeUTF8`: использует :c:func:`PyUnicode_AsUTF8` или :c:func:`PyUnicode_AsUTF8String`

source: :c:func:`!PyUnicode_EncodeUnicodeEscape` use :c:func:`PyUnicode_AsUnicodeEscapeString`
ru: :c:func:`!PyUnicode_EncodeUnicodeEscape` использует :c:func:`PyUnicode_AsUnicodeEscapeString`

source: :c:func:`!PyUnicode_EncodeRawUnicodeEscape` use :c:func:`PyUnicode_AsRawUnicodeEscapeString`
ru: :c:func:`!PyUnicode_EncodeRawUnicodeEscape` использует :c:func:`PyUnicode_AsRawUnicodeEscapeString`

source: :c:func:`!PyUnicode_EncodeLatin1`: use :c:func:`PyUnicode_AsLatin1String`
ru: :c:func:`!PyUnicode_EncodeLatin1`: использует :c:func:`PyUnicode_AsLatin1String`

source: :c:func:`!PyUnicode_EncodeASCII`: use :c:func:`PyUnicode_AsASCIIString`
ru: :c:func:`!PyUnicode_EncodeASCII`: использует :c:func:`PyUnicode_AsASCIIString`

source: :c:func:`!PyUnicode_EncodeMBCS`: use :c:func:`PyUnicode_AsMBCSString` or :c:func:`PyUnicode_EncodeCodePage` (with ``CP_ACP`` code_page)
ru: :c:func:`!PyUnicode_EncodeMBCS`: использует :c:func:`PyUnicode_AsMBCSString` или :c:func:`PyUnicode_EncodeCodePage` (с кодовой_страницей ``CP_ACP`` )

source: Deprecated features
ru: Устаревшие функции

source: The :mod:`array` module's ``'u'`` format code is now deprecated and will be removed in Python 4 together with the rest of the (:c:type:`Py_UNICODE`) API.
ru: Код формата ``'u'`` модуля :mod:`array` теперь устарел и будет удален в Python 4 вместе с остальной частью API (:c:type:`Py_UNICODE`).

source: Porting to Python 3.3
ru: Портирование на Python 3.3

source: This section lists previously described changes and other bugfixes that may require changes to your code.
ru: В этом разделе перечислены ранее описанные изменения и другие исправления ошибок, которые могут потребовать внесения изменений в ваш код.

source: Porting Python code
ru: Перенос кода на Python

source: Hash randomization is enabled by default. Set the :envvar:`PYTHONHASHSEED` environment variable to ``0`` to disable hash randomization. See also the :meth:`object.__hash__` method.
ru: Рандомизация хеша включена по умолчанию. Установите для переменной среды :envvar:`PYTHONHASHSEED` значение ``0``, чтобы отключить рандомизацию хеша. См. также метод :meth:`object.__hash__`.

source: :issue:`12326`: On Linux, sys.platform doesn't contain the major version anymore. It is now always 'linux', instead of 'linux2' or 'linux3' depending on the Linux version used to build Python. Replace sys.platform == 'linux2' with sys.platform.startswith('linux'), or directly sys.platform == 'linux' if you don't need to support older Python versions.
ru: :issue:`12326`: В Linux sys.platform больше не содержит основной версии. Теперь это всегда «linux», а не «linux2» или «linux3» в зависимости от версии Linux, использованной для сборки Python. Замените sys.platform == 'linux2' на sys.platform.startswith('linux') или напрямую sys.platform == 'linux', если вам не нужна поддержка более старых версий Python.

source: :issue:`13847`, :issue:`14180`: :mod:`time` and :mod:`datetime`: :exc:`OverflowError` is now raised instead of :exc:`ValueError` if a timestamp is out of range. :exc:`OSError` is now raised if C functions :c:func:`gmtime` or :c:func:`localtime` failed.
ru: :issue:`13847`, :issue:`14180`: :mod:`time` и :mod:`datetime`: :exc:`OverflowError` теперь вызывается вместо :exc:`ValueError`, если метка времени отсутствует диапазона. :exc:`OSError` теперь вызывается в случае сбоя функций C :c:func:`gmtime` или :c:func:`localtime`.

source: The default finders used by import now utilize a cache of what is contained within a specific directory. If you create a Python source file or sourceless bytecode file, make sure to call :func:`importlib.invalidate_caches` to clear out the cache for the finders to notice the new file.
ru: Средства поиска по умолчанию, используемые при импорте, теперь используют кеш содержимого определенного каталога. Если вы создаете исходный файл Python или файл байт-кода без исходного кода, обязательно вызовите :func:`importlib.invalidate_caches`, чтобы очистить кеш, чтобы средства поиска могли заметить новый файл.

source: :exc:`ImportError` now uses the full name of the module that was attempted to be imported. Doctests that check ImportErrors' message will need to be updated to use the full name of the module instead of just the tail of the name.
ru: :exc:`ImportError` теперь использует полное имя модуля, который пытались импортировать. Документы, проверяющие сообщение ImportErrors, необходимо будет обновить, чтобы использовать полное имя модуля, а не только хвостовую часть имени.

source: The *index* argument to :func:`__import__` now defaults to 0 instead of -1 and no longer support negative values. It was an oversight when :pep:`328` was implemented that the default value remained -1. If you need to continue to perform a relative import followed by an absolute import, then perform the relative import using an index of 1, followed by another import using an index of 0. It is preferred, though, that you use :func:`importlib.import_module` rather than call :func:`__import__` directly.
ru: Аргумент *index* функции :func:`__import__` теперь по умолчанию имеет значение 0 вместо -1 и больше не поддерживает отрицательные значения. При внедрении :pep:`328` было допущено упущение, что значение по умолчанию осталось -1. Если вам необходимо продолжить выполнение относительного импорта, за которым следует абсолютный импорт, выполните относительный импорт с индексом 1, а затем еще один импорт с индексом 0. Однако предпочтительно использовать :func:` importlib.import_module`, а не вызывать :func:`__import__` напрямую.

source: :func:`__import__` no longer allows one to use an index value other than 0 for top-level modules. E.g. ``__import__('sys', level=1)`` is now an error.
ru: :func:`__import__` больше не позволяет использовать значение индекса, отличное от 0, для модулей верхнего уровня. Например, ``__import__('sys', level=1)`` теперь является ошибкой.

source: Because :data:`sys.meta_path` and :data:`sys.path_hooks` now have finders on them by default, you will most likely want to use :meth:`list.insert` instead of :meth:`list.append` to add to those lists.
ru: Поскольку :data:`sys.meta_path` и :data:`sys.path_hooks` теперь имеют средства поиска по умолчанию, вы, скорее всего, захотите использовать :meth:`list.insert` вместо :meth:`list.append `, чтобы добавить в эти списки.

source: Because ``None`` is now inserted into :data:`sys.path_importer_cache`, if you are clearing out entries in the dictionary of paths that do not have a finder, you will need to remove keys paired with values of ``None`` **and** :class:`!imp.NullImporter` to be backwards-compatible. This will lead to extra overhead on older versions of Python that re-insert ``None`` into :data:`sys.path_importer_cache` where it represents the use of implicit finders, but semantically it should not change anything.
ru: Поскольку ``None`` теперь вставлен в :data:`sys.path_importer_cache`, если вы удаляете записи в словаре путей, у которых нет средства поиска, вам нужно будет удалить ключи, связанные со значениями ``None `` **and** :class:`!imp.NullImporter` для обратной совместимости. Это приведет к дополнительным накладным расходам в старых версиях Python, которые повторно вставляют ``None`` в :data:`sys.path_importer_cache`, где это представляет собой использование неявных средств поиска, но семантически это не должно ничего менять.

source: :class:`!importlib.abc.Finder` no longer specifies a ``find_module()`` abstract method that must be implemented. If you were relying on subclasses to implement that method, make sure to check for the method's existence first. You will probably want to check for ``find_loader()`` first, though, in the case of working with :term:`path entry finders <path entry finder>`.
ru: :class:`!importlib.abc.Finder` больше не определяет абстрактный метод ``find_module()``, который должен быть реализован. Если для реализации этого метода вы полагались на подклассы, обязательно сначала проверьте существование метода. Однако вы, вероятно, захотите сначала проверить ``find_loader()`` в случае работы с :term:`поискателями записей пути <path input finder>`.

source: :mod:`pkgutil` has been converted to use :mod:`importlib` internally. This eliminates many edge cases where the old behaviour of the :pep:`302` import emulation failed to match the behaviour of the real import system. The import emulation itself is still present, but is now deprecated. The :func:`pkgutil.iter_importers` and :func:`pkgutil.walk_packages` functions special case the standard import hooks so they are still supported even though they do not provide the non-standard ``iter_modules()`` method.
ru: :mod:`pkgutil` был преобразован для внутреннего использования :mod:`importlib`. Это исключает многие крайние случаи, когда старое поведение эмуляции импорта :pep:`302` не соответствовало поведению реальной системы импорта. Сама эмуляция импорта все еще присутствует, но сейчас устарела. Функции :func:`pkgutil.iter_importers` и :func:`pkgutil.walk_packages` представляют собой особый случай стандартных перехватчиков импорта, поэтому они по-прежнему поддерживаются, даже если они не предоставляют нестандартный метод ``iter_modules()``.
