Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/whatsnew/3.3.po
Languages: ru

source: The ``count()``, ``find()``, ``rfind()``, ``index()`` and ``rindex()`` methods of :class:`bytes` and :class:`bytearray` objects now accept an integer between 0 and 255 as their first argument.
ru: Методы count(), find(), rfind(), index() иrindex() классов :class:bytes и : Объекты class:`bytearray` теперь принимают целое число от 0 до 255 в качестве первого аргумента.

source: (Contributed by Petri Lehtinen in :issue:`12170`.)
ru: (Предоставлено Петри Лехтиненом в :issue:`12170`.)

source: The ``rjust()``, ``ljust()``, and ``center()`` methods of :class:`bytes` and :class:`bytearray` now accept a :class:`bytearray` for the ``fill`` argument. (Contributed by Petri Lehtinen in :issue:`12380`.)
ru: Методы ``rjust()``, ``ljust()`` и ``center()`` из :class:`bytes` и :class:`bytearray` теперь принимают :class:`bytearray` в качестве аргумента ``fill``. (Автор Petri Lehtinen в :issue:`12380`.)

source: New methods have been added to :class:`list` and :class:`bytearray`: ``copy()`` and ``clear()`` (:issue:`10516`). Consequently, :class:`~collections.abc.MutableSequence` now also defines a :meth:`~collections.abc.MutableSequence.clear` method (:issue:`11388`).
ru: В :class:`list` и :class:`bytearray` были добавлены новые методы: ``копировать()`` и ``очистить()`` (:issue:`10516`). Следовательно, :class:`~collections.abc.MutableSequence` теперь также определяет метод :meth:`~collections.abc.MutableSequence.clear` (:issue:`11388`).

source: Raw bytes literals can now be written ``rb"..."`` as well as ``br"..."``.
ru: Необработанные байтовые литералы теперь могут быть записаны как ``rb"...."``, так и ``br"...."``.

source: (Contributed by Antoine Pitrou in :issue:`13748`.)
ru: (Предоставлено Антуаном Питру в :issue:`13748`.)

source: :meth:`dict.setdefault` now does only one lookup for the given key, making it atomic when used with built-in types.
ru: :meth:`dict.setdefault` теперь выполняет только один поиск по заданному ключу, что делает его атомарным при использовании со встроенными типами.

source: (Contributed by Filip Gruszczyński in :issue:`13521`.)
ru: (Предоставлено Филипом Грущиньским в :issue:`13521`.)

source: The error messages produced when a function call does not match the function signature have been significantly improved.
ru: Сообщения об ошибках, выводимые, когда вызов функции не соответствует сигнатуре функции, были значительно улучшены.

source: (Contributed by Benjamin Peterson.)
ru: (Предоставлено Бенджамином Петерсоном.)

source: A Finer-Grained Import Lock
ru: Более детальная блокировка импорта

source: Previous versions of CPython have always relied on a global import lock. This led to unexpected annoyances, such as deadlocks when importing a module would trigger code execution in a different thread as a side-effect. Clumsy workarounds were sometimes employed, such as the :c:func:`PyImport_ImportModuleNoBlock` C API function.
ru: Предыдущие версии CPython всегда полагались на глобальную блокировку импорта. Это приводило к неожиданным неприятностям, например, к взаимоблокировкам при импорте модуля, которые в качестве побочного эффекта приводили к выполнению кода в другом потоке. Иногда использовались неуклюжие обходные пути, такие как функция C API :c:func:`PyImport_ImportModuleNoBlock`.

source: In Python 3.3, importing a module takes a per-module lock. This correctly serializes importation of a given module from multiple threads (preventing the exposure of incompletely initialized modules), while eliminating the aforementioned annoyances.
ru: В Python 3.3 импорт модуля требует блокировки для каждого модуля. Это правильно сериализует импорт данного модуля из нескольких потоков (предотвращая раскрытие неполностью инициализированных модулей), устраняя при этом вышеупомянутые неприятности.

source: (Contributed by Antoine Pitrou in :issue:`9260`.)
ru: (Предоставлено Антуаном Питру в :issue:`9260`.)

source: Builtin functions and types
ru: Встроенные функции и типы

source: :func:`open` gets a new *opener* parameter: the underlying file descriptor for the file object is then obtained by calling *opener* with (*file*, *flags*). It can be used to use custom flags like :const:`os.O_CLOEXEC` for example. The ``'x'`` mode was added: open for exclusive creation, failing if the file already exists.
ru: :func:`open` получает новый параметр *opener*: базовый файловый дескриптор для файлового объекта затем получается путем вызова *opener* с (*file*, *flags*). Его можно использовать, например, для использования пользовательских флагов, таких как :const:`os.O_CLOEXEC`. Был добавлен режим ``'x'``: открыт для эксклюзивного создания, проваливается, если файл уже существует.

source: :func:`print`: added the *flush* keyword argument. If the *flush* keyword argument is true, the stream is forcibly flushed.
ru: :func:`print`: добавлен аргумент ключевого слова *flush*. Если аргумент ключевого слова *flush* имеет значение true, поток принудительно сбрасывается.

source: :func:`hash`: hash randomization is enabled by default, see :meth:`object.__hash__` and :envvar:`PYTHONHASHSEED`.
ru: :func:`hash`: рандомизация хеша включена по умолчанию, см. :meth:`object.__hash__` и :envvar:`PYTHONHASHSEED`.

source: The :class:`str` type gets a new :meth:`~str.casefold` method: return a casefolded copy of the string, casefolded strings may be used for caseless matching. For example, ``'ß'.casefold()`` returns ``'ss'``.
ru: Тип :class:`str` получает новый метод :meth:`~str.casefold`: возвращает копию строки в свёрнутом регистре, строки с свёрнутым регистром могут использоваться для сопоставления без регистра. Например, ``'ß'.casefold()`` возвращает ``'ss'``.

source: The sequence documentation has been substantially rewritten to better explain the binary/text sequence distinction and to provide specific documentation sections for the individual builtin sequence types (:issue:`4966`).
ru: Документация по последовательности была существенно переписана, чтобы лучше объяснить различие между двоичной и текстовой последовательностями и предоставить специальные разделы документации для отдельных встроенных типов последовательностей (:issue:`4966`).

source: New Modules
ru: Новые модули

source: This new debug module :mod:`faulthandler` contains functions to dump Python tracebacks explicitly, on a fault (a crash like a segmentation fault), after a timeout, or on a user signal. Call :func:`faulthandler.enable` to install fault handlers for the :const:`SIGSEGV`, :const:`SIGFPE`, :const:`SIGABRT`, :const:`SIGBUS`, and :const:`SIGILL` signals. You can also enable them at startup by setting the :envvar:`PYTHONFAULTHANDLER` environment variable or by using :option:`-X` ``faulthandler`` command line option.
ru: Этот новый модуль отладки :mod:`faulthandler` содержит функции для явного сброса обратных трассировок Python, при ошибке (сбой, такой как ошибка сегментации), после тайм-аута или по сигналу пользователя. Вызовите :func:`faulthandler.enable`, чтобы установить обработчики ошибок для :const:`SIGSEGV`, :const:`SIGFPE`, :const:`SIGABRT`, :const:`SIGBUS` и :const:`SIGILL` сигналы. Вы также можете включить их при запуске, установив переменную среды :envvar:`PYTHONFAULTHANDLER` или используя параметр командной строки :option:`-X` ``faulthandler``.

source: Example of a segmentation fault on Linux:
ru: Пример ошибки сегментации в Linux:

source: The new :mod:`ipaddress` module provides tools for creating and manipulating objects representing IPv4 and IPv6 addresses, networks and interfaces (i.e. an IP address associated with a specific IP subnet).
ru: Новый модуль :mod: `ipaddress` предоставляет инструменты для создания и управления объектами, представляющими адреса IPv4 и IPv6, сети и интерфейсы (т.е. IP-адрес, связанный с определенной IP-подсетью).

source: (Contributed by Google and Peter Moody in :pep:`3144`.)
ru: (Предоставлено Google и Peter Moody в :pep:`3144`.)

source: The newly added :mod:`lzma` module provides data compression and decompression using the LZMA algorithm, including support for the ``.xz`` and ``.lzma`` file formats.
ru: Недавно добавленный модуль :mod:`lzma` обеспечивает сжатие и распаковку данных с использованием алгоритма LZMA, включая поддержку форматов файлов ``.xz`` и ``.lzma``.

source: (Contributed by Nadeem Vawda and Per Øyvind Karlsen in :issue:`6715`.)
ru: (Предоставлено Надимом Вавдой и Пером Ойвиндом Карлсеном в :issue:`6715`.)

source: Improved Modules
ru: Улучшенные модули

source: Improved support for abstract base classes containing descriptors composed with abstract methods. The recommended approach to declaring abstract descriptors is now to provide :attr:`__isabstractmethod__` as a dynamically updated property. The built-in descriptors have been updated accordingly.
ru: Улучшена поддержка абстрактных базовых классов, содержащих дескрипторы, состоящие из абстрактных методов. Рекомендуемый подход к объявлению абстрактных дескрипторов теперь заключается в предоставлении :attr:`__isabstractmethod__` в качестве динамически обновляемого свойства. Встроенные дескрипторы были соответствующим образом обновлены.

source: :class:`abc.abstractproperty` has been deprecated, use :class:`property` with :func:`abc.abstractmethod` instead.
ru: :class:`abc.abstractproperty` устарел, вместо этого используйте :class:`property` с :func:`abc.abstractmethod`.

source: :class:`abc.abstractstaticmethod` has been deprecated, use :class:`staticmethod` with :func:`abc.abstractmethod` instead.
ru: :class:`abc.abstractstaticmethod` устарел, вместо этого используйте :class:`staticmethod` с :func:`abc.abstractmethod`.

source: (Contributed by Darren Dale in :issue:`11610`.)
ru: (Предоставлено Дарреном Дейлом в :issue:`11610`.)

source: :meth:`abc.ABCMeta.register` now returns the registered subclass, which means it can now be used as a class decorator (:issue:`10868`).
ru: :meth:`abc.ABCMeta.register` теперь возвращает зарегистрированный подкласс, что означает, что теперь его можно использовать в качестве декоратора класса (:issue:`10868`).

source: The :mod:`array` module supports the :c:expr:`long long` type using ``q`` and ``Q`` type codes.
ru: Модуль :mod:`array` поддерживает тип :c:expr:`long long` с использованием кодов типов ``q`` и ``Q``.

source: (Contributed by Oren Tirosh and Hirokazu Yamamoto in :issue:`1172711`.)
ru: (Предоставлено Орен Тирош и Хирокадзу Ямамото в :issue:`1172711`.)

source: ASCII-only Unicode strings are now accepted by the decoding functions of the :mod:`base64` modern interface. For example, ``base64.b64decode('YWJj')`` returns ``b'abc'``. (Contributed by Catalin Iacob in :issue:`13641`.)
ru: Функции декодирования в современном интерфейсе :mod:`base64` теперь принимают строки Юникода, содержащие только ASCII. Например, ``base64.b64decode('YWJj')`` возвращает ``b'abc``. (Автор: Catalin Iacob в :issue:`13641`.)

source: In addition to the binary objects they normally accept, the ``a2b_`` functions now all also accept ASCII-only strings as input. (Contributed by Antoine Pitrou in :issue:`13637`.)
ru: В дополнение к двоичным объектам, которые они обычно принимают, функции a2b_ теперь также принимают в качестве входных данных строки только ASCII. (Предоставлено Антуаном Питру в :issue:`13637`.)

source: The :mod:`bz2` module has been rewritten from scratch. In the process, several new features have been added:
ru: Модуль :mod:`bz2` был переписан с нуля. В процессе было добавлено несколько новых функций:

source: New :func:`bz2.open` function: open a bzip2-compressed file in binary or text mode.
ru: Новая функция :func:`bz2.open`: открывает файл, сжатый с помощью bzip2, в двоичном или текстовом режиме.

source: :class:`bz2.BZ2File` can now read from and write to arbitrary file-like objects, by means of its constructor's *fileobj* argument.
ru: :class:`bz2.BZ2File` теперь может читать и записывать в произвольные файловые объекты с помощью аргумента *fileobj* своего конструктора.

source: (Contributed by Nadeem Vawda in :issue:`5863`.)
ru: (Предоставлено Надимом Вавдой в :issue:`5863`.)

source: :class:`bz2.BZ2File` and :func:`bz2.decompress` can now decompress multi-stream inputs (such as those produced by the :program:`pbzip2` tool). :class:`bz2.BZ2File` can now also be used to create this type of file, using the ``'a'`` (append) mode.
ru: :class:`bz2.BZ2File` и :func:`bz2.decompress` теперь могут распаковывать многопоточные входные данные (например, созданные инструментом :program:`pbzip2`). :class:`bz2.BZ2File` теперь также можно использовать для создания файлов этого типа, используя режим ``'a'`` (добавление).

source: (Contributed by Nir Aides in :issue:`1625`.)
ru: (Предоставлено Ниром Эйдесом в :issue:`1625`.)

source: :class:`bz2.BZ2File` now implements all of the :class:`io.BufferedIOBase` API, except for the :meth:`detach` and :meth:`truncate` methods.
ru: :class:`bz2.BZ2File` теперь реализует весь API :class:`io.BufferedIOBase`, за исключением методов :meth:`detach` и :meth:`truncate`.

source: codecs
ru: кодеки

source: The :mod:`~encodings.mbcs` codec has been rewritten to handle correctly ``replace`` and ``ignore`` error handlers on all Windows versions. The :mod:`~encodings.mbcs` codec now supports all error handlers, instead of only ``replace`` to encode and ``ignore`` to decode.
ru: Кодек :mod:`~encodings.mbcs` был переписан для правильной обработки обработчиков ошибок ``replace`` и ``ignore`` во всех версиях Windows. Кодек :mod:`~encodings.mbcs` теперь поддерживает все обработчики ошибок, а не только ``replace`` для кодирования и ``игнорировать`` для декодирования.

source: A new Windows-only codec has been added: ``cp65001`` (:issue:`13216`). It is the Windows code page 65001 (Windows UTF-8, ``CP_UTF8``). For example, it is used by ``sys.stdout`` if the console output code page is set to cp65001 (e.g., using ``chcp 65001`` command).
ru: Был добавлен новый кодек только для Windows: ``cp65001`` (:issue:`13216`). Это кодовая страница Windows 65001 (Windows UTF-8, ``CP_UTF8``). Например, он используется ``sys.stdout``, если кодовая страница вывода консоли установлена ​​на cp65001 (например, с помощью команды ``chcp 65001``).

source: Multibyte CJK decoders now resynchronize faster. They only ignore the first byte of an invalid byte sequence. For example, ``b'\xff\n'.decode('gb2312', 'replace')`` now returns a ``\n`` after the replacement character.
ru: PEP 409 представляет новый синтаксис, который позволяет отключить отображение связанного контекста исключения. Это позволяет более четко отображать сообщения об ошибках в приложениях, которые преобразуют типы исключений:

source: Incremental CJK codec encoders are no longer reset at each call to their encode() methods. For example::
ru: Кодеры инкрементального кодека CJK больше не сбрасываются при каждом вызове их методов encode(). Например::

source: This example gives ``b'~{Np~}~{J)~}~{l6~}~{HK~}~{!#~} Bye.'`` with older Python versions.
ru: В этом примере выдается ``b'~{Np~}~{J)~}~{l6~}~{HK~}~{!#~} Bye.'`` со старыми версиями Python.

source: The ``unicode_internal`` codec has been deprecated.
ru: Кодек ``unicode_internal`` устарел.

source: collections
ru: коллекции

source: Addition of a new :class:`~collections.ChainMap` class to allow treating a number of mappings as a single unit. (Written by Raymond Hettinger for :issue:`11089`, made public in :issue:`11297`.)
ru: Добавлен новый класс :class:`~collections.ChainMap`, позволяющий обрабатывать несколько отображений как единое целое. (Написано Рэймондом Хеттингером для :issue:`11089`, опубликовано в :issue:`11297`.)

source: The abstract base classes have been moved in a new :mod:`collections.abc` module, to better differentiate between the abstract and the concrete collections classes. Aliases for ABCs are still present in the :mod:`collections` module to preserve existing imports. (:issue:`11085`)
ru: Абстрактные базовые классы были перенесены в новый модуль :mod:`collections.abc`, чтобы лучше различать абстрактные и конкретные классы коллекций. Псевдонимы для ABC по-прежнему присутствуют в модуле :mod:`collections` для сохранения существующего импорта. (:issue:`11085`)

source: The :class:`~collections.Counter` class now supports the unary ``+`` and ``-`` operators, as well as the in-place operators ``+=``, ``-=``, ``|=``, and ``&=``. (Contributed by Raymond Hettinger in :issue:`13121`.)
ru: Класс :class:`~collections.Counter` теперь поддерживает унарные операторы ``+`` и ``-``, а также операторы ``+=``, ``-=``, ``|=`` и ``&=``. (Предоставлено Рэймондом Хеттингером в :issue:`13121`.)

source: :class:`~contextlib.ExitStack` now provides a solid foundation for programmatic manipulation of context managers and similar cleanup functionality. Unlike the previous ``contextlib.nested`` API (which was deprecated and removed), the new API is designed to work correctly regardless of whether context managers acquire their resources in their ``__init__`` method (for example, file objects) or in their ``__enter__`` method (for example, synchronisation objects from the :mod:`threading` module).
ru: :class:`~contextlib.ExitStack` теперь обеспечивает прочную основу для программного манипулирования менеджерами контекста и аналогичных функций очистки. В отличие от предыдущего API contextlib.nested (который устарел и был удален), новый API предназначен для корректной работы независимо от того, получают ли менеджеры контекста свои ресурсы в методе __init__ (например, файловые объекты). или в их методе ``__enter__`` (например, объекты синхронизации из модуля :mod:`threading`).

source: Addition of salt and modular crypt format (hashing method) and the :func:`!mksalt` function to the :mod:`!crypt` module.
ru: Добавление соли и модульного формата шифрования (метода хеширования) и функции :func:`!mksalt` в модуль :mod:`!crypt`.

source: If the :mod:`curses` module is linked to the ncursesw library, use Unicode functions when Unicode strings or characters are passed (e.g. :c:func:`waddwstr`), and bytes functions otherwise (e.g. :c:func:`waddstr`).
ru: Если модуль :mod:`curses` связан с библиотекой ncursesw, используйте функции Unicode, когда передаются строки или символы Unicode (например, :c:func:`waddwstr`), и функции bytes в противном случае (например, :c:func:` ваддстр`).

source: Use the locale encoding instead of ``utf-8`` to encode Unicode strings.
ru: Используйте кодировку локали вместо ``utf-8`` для кодирования строк Unicode.

source: :class:`curses.window` has a new :attr:`curses.window.encoding` attribute.
ru: :class:`curses.window` имеет новый атрибут :attr:`curses.window.encoding`.

source: The :class:`curses.window` class has a new :meth:`~curses.window.get_wch` method to get a wide character
ru: Класс :class:`curses.window` имеет новый метод :meth:`~curses.window.get_wch` для получения широкого символа.

source: The :mod:`curses` module has a new :meth:`~curses.unget_wch` function to push a wide character so the next :meth:`~curses.window.get_wch` will return it
ru: В модуле :mod:`curses` есть новая функция :meth:`~curses.unget_wch` для ввода широкого символа, поэтому следующий :meth:`~curses.window.get_wch` вернет его.

source: (Contributed by Iñigo Serna in :issue:`6755`.)
ru: (Предоставлено Иньиго Серной в :issue:`6755`.)

source: Equality comparisons between naive and aware :class:`~datetime.datetime` instances now return :const:`False` instead of raising :exc:`TypeError` (:issue:`15006`).
ru: Сравнения на равенство между наивными и осведомленными экземплярами :class:`~datetime.datetime` теперь возвращают :const:`False` вместо вызова :exc:`TypeError` (:issue:`15006`).

source: New :meth:`datetime.datetime.timestamp` method: Return POSIX timestamp corresponding to the :class:`~datetime.datetime` instance.
ru: Новый метод :meth:`datetime.datetime.timestamp`: возвращает временную метку POSIX, соответствующую экземпляру :class:`~datetime.datetime`.

source: The :meth:`datetime.datetime.strftime` method supports formatting years older than 1000.
ru: Метод :meth:`datetime.datetime.strftime` поддерживает форматирование лет старше 1000.

source: The :meth:`datetime.datetime.astimezone` method can now be called without arguments to convert datetime instance to the system timezone.
ru: Метод :meth:`datetime.datetime.astimezone` теперь можно вызывать без аргументов для преобразования экземпляра datetime в системный часовой пояс.

source: decimal
ru: десятичный

source: :issue:`7652` - integrate fast native decimal arithmetic.
ru: :issue:`7652` - интеграция быстрой встроенной десятичной арифметики.

source: C-module and libmpdec written by Stefan Krah.
ru: C-модуль и libmpdec, написанные Stefan Krah.

source: The new C version of the decimal module integrates the high speed libmpdec library for arbitrary precision correctly rounded decimal floating-point arithmetic. libmpdec conforms to IBM's General Decimal Arithmetic Specification.
ru: Новая версия C-модуля decimal объединяет высокоскоростную библиотеку libmpdec для произвольной точности и правильного округления десятичных арифметических операций с плавающей запятой. libmpdec соответствует Общей спецификации десятичной арифметики IBM.

source: Performance gains range from 10x for database applications to 100x for numerically intensive applications. These numbers are expected gains for standard precisions used in decimal floating-point arithmetic. Since the precision is user configurable, the exact figures may vary. For example, in integer bignum arithmetic the differences can be significantly higher.
ru: Прирост производительности варьируется от 10-кратного для приложений баз данных до 100-кратного для приложений с интенсивным числом вычислений. Эти числа являются ожидаемым увеличением стандартной точности, используемой в десятичной арифметике с плавающей запятой. Поскольку точность настраивается пользователем, точные цифры могут отличаться. Например, в целочисленной арифметике bignum различия могут быть значительно выше.

source: The following table is meant as an illustration. Benchmarks are available at https://www.bytereef.org/mpdecimal/quickstart.html.
ru: Следующая таблица предназначена для иллюстрации. Контрольные показатели доступны по адресу https://www.bytereef.org/mpdecimal/quickstart.html.

source: speedup
ru: ускорение

source: 42.02s
ru: 42.02c

source: 0.345s
ru: 0.345с

source: 172.19s
ru: 172.19с

source: 5.68s
ru: 5.68с

source: 3.57s
ru: 3.57с

source: 0.29s
ru: 0.29с

source: The :exc:`~decimal.FloatOperation` signal optionally enables stricter semantics for mixing floats and Decimals.
ru: Сигнал :exc:`~decimal.FloatOperation` дополнительно включает более строгую семантику для смешивания чисел с плавающей запятой и десятичных дробей.

source: If Python is compiled without threads, the C version automatically disables the expensive thread local context machinery. In this case, the variable :const:`~decimal.HAVE_THREADS` is set to ``False``.
ru: Если Python скомпилирован без потоков, версия C автоматически отключает дорогостоящий механизм локального контекста потока. В этом случае для переменной :const:`~decimal.HAVE_THREADS` установлено значение ``False``.

source: The C module has the following context limits, depending on the machine architecture:
ru: Модуль C имеет следующие ограничения контекста, в зависимости от архитектуры машины:

source: 32-bit
ru: 32-бит

source: 64-bit
ru: 64-бит
