Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/whatsnew/3.7.po
Languages: ru

source: The ``ssl`` module no longer sends IP addresses in SNI TLS extension. (Contributed by Christian Heimes in :issue:`32185`.)
ru: Модуль SSL больше не отправляет IP-адреса в расширении SNI TLS. (Предоставлено Кристианом Хаймсом в :issue:`32185`.)

source: :func:`~ssl.match_hostname` no longer supports partial wildcards like ``www*.example.org``. (Contributed by Mandeep Singh in :issue:`23033` and Christian Heimes in :issue:`31399`.)
ru: :func:`~ssl.match_hostname` больше не поддерживает частичные подстановочные знаки, такие как ``www*.example.org``. (Предоставлено Мандипом Сингхом в :issue:`23033` и Кристианом Хаймсом в :issue:`31399`.)

source: The default cipher suite selection of the ``ssl`` module now uses a blacklist approach rather than a hard-coded whitelist. Python no longer re-enables ciphers that have been blocked by OpenSSL security updates. Default cipher suite selection can be configured at compile time. (Contributed by Christian Heimes in :issue:`31429`.)
ru: Выбор набора шифров по умолчанию для модуля SSL теперь использует подход с черным списком, а не с жестко запрограммированным белым списком. Python больше не включает повторно шифры, заблокированные обновлениями безопасности OpenSSL. Выбор набора шифров по умолчанию можно настроить во время компиляции. (Предоставлено Кристианом Хаймсом в :issue:`31429`.)

source: Validation of server certificates containing internationalized domain names (IDNs) is now supported. As part of this change, the :attr:`SSLSocket.server_hostname <ssl.SSLSocket.server_hostname>` attribute now stores the expected hostname in A-label form (``"xn--pythn-mua.org"``), rather than the U-label form (``"pythön.org"``). (Contributed by Nathaniel J. Smith and Christian Heimes in :issue:`28414`.)
ru: Теперь поддерживается проверка сертификатов сервера, содержащих интернационализированные доменные имена (IDN). В рамках этого изменения атрибут :attr:`SSLSocket.server_hostname <ssl.SSLSocket.server_hostname>` теперь сохраняет ожидаемое имя хоста в форме A-метки (``"xn--pythn-mua.org"``), а не в форме U-метки (``"pythön.org"``). (Предоставлено Натаниэлем Дж. Смитом и Кристианом Хаймсом в :issue:`28414`.)

source: The ``ssl`` module has preliminary and experimental support for TLS 1.3 and OpenSSL 1.1.1. At the time of Python 3.7.0 release, OpenSSL 1.1.1 is still under development and TLS 1.3 hasn't been finalized yet. The TLS 1.3 handshake and protocol behaves slightly differently than TLS 1.2 and earlier, see :ref:`ssl-tlsv1_3`. (Contributed by Christian Heimes in :issue:`32947`, :issue:`20995`, :issue:`29136`, :issue:`30622` and :issue:`33618`)
ru: Модуль SSL имеет предварительную и экспериментальную поддержку TLS 1.3 и OpenSSL 1.1.1. На момент выпуска Python 3.7.0 OpenSSL 1.1.1 все еще находился в стадии разработки, а TLS 1.3 еще не был завершен. Подтверждение и протокол TLS 1.3 ведут себя немного иначе, чем TLS 1.2 и более ранние версии, см. :ref:`ssl-tlsv1_3`. (Внесено Кристианом Хаймсом в :issue:`32947`, :issue:`20995`, :issue:`29136`, :issue:`30622` и :issue:`33618`)

source: :class:`~ssl.SSLSocket` and :class:`~ssl.SSLObject` no longer have a public constructor. Direct instantiation was never a documented and supported feature. Instances must be created with :class:`~ssl.SSLContext` methods :meth:`~ssl.SSLContext.wrap_socket` and :meth:`~ssl.SSLContext.wrap_bio`. (Contributed by Christian Heimes in :issue:`32951`)
ru: :class:`~ssl.SSLSocket` и :class:`~ssl.SSLObject` больше не имеют открытого конструктора. Прямое создание экземпляров никогда не было документированной и поддерживаемой функцией. Экземпляры должны быть созданы с помощью методов :class:`~ssl.SSLContext` :meth:`~ssl.SSLContext.wrap_socket` и :meth:`~ssl.SSLContext.wrap_bio`. (Предоставлено Кристианом Хаймсом в :issue:`32951`)

source: OpenSSL 1.1 APIs for setting the minimum and maximum TLS protocol version are available as :attr:`SSLContext.minimum_version <ssl.SSLContext.minimum_version>` and :attr:`SSLContext.maximum_version <ssl.SSLContext.maximum_version>`. Supported protocols are indicated by several new flags, such as :data:`~ssl.HAS_TLSv1_1`. (Contributed by Christian Heimes in :issue:`32609`.)
ru: API OpenSSL 1.1 для установки минимальной и максимальной версии протокола TLS доступны как :attr:`SSLContext.minimum_version <ssl.SSLContext.minimum_version>` и :attr:`SSLContext.maximum_version <ssl.SSLContext.maximum_version>`. Поддерживаемые протоколы обозначаются несколькими новыми флагами, такими как :data:`~ssl.HAS_TLSv1_1`. (Предоставлено Кристианом Хаймсом в :issue:`32609`.)

source: Added :attr:`ssl.SSLContext.post_handshake_auth` to enable and :meth:`ssl.SSLSocket.verify_client_post_handshake` to initiate TLS 1.3 post-handshake authentication. (Contributed by Christian Heimes in :gh:`78851`.)
ru: Добавлен :attr:`ssl.SSLContext.post_handshake_auth` для включения и :meth:`ssl.SSLSocket.verify_client_post_handshake` для инициации аутентификации TLS 1.3 после рукопожатия. (Предоставлено Кристианом Хаймсом в :gh:`78851`.)

source: string
ru: строка

source: :class:`string.Template` now lets you to optionally modify the regular expression pattern for braced placeholders and non-braced placeholders separately. (Contributed by Barry Warsaw in :issue:`1198569`.)
ru: :class:`string.Template` теперь позволяет вам при необходимости изменять шаблон регулярного выражения для заполнителей в фигурных скобках и заполнителей без фигурных скобок отдельно. (Предоставлено Барри Варшавой в :issue:`1198569`.)

source: The :func:`subprocess.run` function accepts the new *capture_output* keyword argument. When true, stdout and stderr will be captured. This is equivalent to passing :const:`subprocess.PIPE` as *stdout* and *stderr* arguments. (Contributed by Bo Bayles in :issue:`32102`.)
ru: Функция :func:`subprocess.run` принимает новый аргумент ключевого слова *capture_output*. Если это правда, то stdout и stderr будут перехвачены. Это эквивалентно передаче :const:`subprocess.PIPE` в качестве аргументов *stdout* и *stderr*. (Предоставлено Бо Бейлсом в :issue:`32102`.)

source: The ``subprocess.run`` function and the :class:`subprocess.Popen` constructor now accept the *text* keyword argument as an alias to *universal_newlines*. (Contributed by Andrew Clegg in :issue:`31756`.)
ru: Функция ``subprocess.run`` и конструктор :class:`subprocess.Popen` теперь принимают аргумент ключевого слова *text* в качестве псевдонима для *universal_newlines*. (Предоставлено Эндрю Клеггом в :issue:`31756`.)

source: On Windows the default for *close_fds* was changed from ``False`` to ``True`` when redirecting the standard handles. It's now possible to set *close_fds* to true when redirecting the standard handles. See :class:`subprocess.Popen`. This means that *close_fds* now defaults to ``True`` on all supported platforms. (Contributed by Segev Finer in :issue:`19764`.)
ru: В Windows значение по умолчанию для *close_fds* было изменено с ``False`` на ``True`` при перенаправлении стандартных дескрипторов. Теперь можно установить для *close_fds* значение true при перенаправлении стандартных дескрипторов. См. :class:`subprocess.Popen`. Это означает, что *close_fds* теперь по умолчанию имеет значение True на всех поддерживаемых платформах. (Предоставлено Сегевым Файнером в :issue:`19764`.)

source: The subprocess module is now more graceful when handling :exc:`KeyboardInterrupt` during :func:`subprocess.call`, :func:`subprocess.run`, or in a :class:`~subprocess.Popen` context manager. It now waits a short amount of time for the child to exit, before continuing the handling of the ``KeyboardInterrupt`` exception. (Contributed by Gregory P. Smith in :issue:`25942`.)
ru: Модуль подпроцесса теперь более изящно обрабатывает :exc:`KeyboardInterrupt` во время :func:`subprocess.call`, :func:`subprocess.run` или в контекстном менеджере :class:`~subprocess.Popen`. Теперь он некоторое время ждет выхода дочернего элемента, прежде чем продолжить обработку исключения ``KeyboardInterrupt``. (Предоставлено Грегори П. Смитом в :issue:`25942`.)

source: The new :func:`sys.breakpointhook` hook function is called by the built-in :func:`breakpoint`. (Contributed by Barry Warsaw in :issue:`31353`.)
ru: Новая функция-перехватчик :func:`sys.breakpointhook` вызывается встроенной функцией :func:`breakpoint`. (Предоставлено Барри Варшавой в :issue:`31353`.)

source: On Android, the new :func:`sys.getandroidapilevel` returns the build-time Android API version. (Contributed by Victor Stinner in :issue:`28740`.)
ru: В Android новый :func:`sys.getandroidapilevel` возвращает версию Android API времени сборки. (Предоставлено Виктором Стиннером в :issue:`28740`.)

source: The new :func:`sys.get_coroutine_origin_tracking_depth` function returns the current coroutine origin tracking depth, as set by the new :func:`sys.set_coroutine_origin_tracking_depth`. :mod:`asyncio` has been converted to use this new API instead of the deprecated :func:`sys.set_coroutine_wrapper`. (Contributed by Nathaniel J. Smith in :issue:`32591`.)
ru: Новая функция :func:`sys.get_coroutine_origin_tracking_length` возвращает текущую глубину отслеживания начала координат сопрограммы, как установлено новой :func:`sys.set_coroutine_origin_tracking_length`. :mod:`asyncio` был преобразован для использования этого нового API вместо устаревшего :func:`sys.set_coroutine_wrapper`. (Предоставлено Натаниэлем Дж. Смитом в :issue:`32591`.)

source: time
ru: время

source: :pep:`564` adds six new functions with nanosecond resolution to the :mod:`time` module:
ru: :pep:`564` добавляет в модуль :mod:`time` шесть новых функций с наносекундным разрешением:

source: New clock identifiers have been added:
ru: Добавлены новые идентификаторы часов:

source: :const:`time.CLOCK_BOOTTIME` (Linux): Identical to :const:`time.CLOCK_MONOTONIC`, except it also includes any time that the system is suspended.
ru: :const:`time.CLOCK_BOOTTIME` (Linux): Идентичен :const:`time.CLOCK_MONOTONIC`, за исключением того, что он также включает время, когда система приостановлена.

source: :const:`time.CLOCK_PROF` (FreeBSD, NetBSD and OpenBSD): High-resolution per-process CPU timer.
ru: :const:`time.CLOCK_PROF` (FreeBSD, NetBSD и OpenBSD): таймер ЦП с высоким разрешением для каждого процесса.

source: :const:`time.CLOCK_UPTIME` (FreeBSD, OpenBSD): Time whose absolute value is the time the system has been running and not suspended, providing accurate uptime measurement.
ru: :const:`time.CLOCK_UPTIME` (FreeBSD, OpenBSD): Время, абсолютное значение которого равно времени, когда система работала и не была приостановлена, обеспечивая точное измерение времени безотказной работы.

source: The new :func:`time.thread_time` and :func:`time.thread_time_ns` functions can be used to get per-thread CPU time measurements. (Contributed by Antoine Pitrou in :issue:`32025`.)
ru: Новые функции :func:`time.thread_time` и :func:`time.thread_time_ns` можно использовать для получения измерений времени процессора для каждого потока. (Предоставлено Антуаном Питру в :issue:`32025`.)

source: The new :func:`time.pthread_getcpuclockid` function returns the clock ID of the thread-specific CPU-time clock.
ru: Новая функция :func:`time.pthread_getcpulockid` возвращает идентификатор часов процессорного времени для конкретного потока.

source: The new :class:`tkinter.ttk.Spinbox` class is now available. (Contributed by Alan Moore in :issue:`32585`.)
ru: Новый класс :class:`tkinter.ttk.Spinbox` теперь доступен. (Предоставлено Аланом Муром в :issue:`32585`.)

source: :class:`tracemalloc.Traceback` behaves more like regular tracebacks, sorting the frames from oldest to most recent. :meth:`Traceback.format() <tracemalloc.Traceback.format>` now accepts negative *limit*, truncating the result to the ``abs(limit)`` oldest frames. To get the old behaviour, use the new *most_recent_first* argument to ``Traceback.format()``. (Contributed by Jesse Bakker in :issue:`32121`.)
ru: :class:`tracemalloc.Traceback` ведет себя скорее как обычная обратная трассировка, сортируя кадры от самых старых до самых последних. :meth:`Traceback.format() <tracemalloc.Traceback.format>` теперь принимает отрицательный *limit*, усекая результат до самых старых кадров ``abs(limit)``. Чтобы получить старое поведение, используйте новый аргумент *most_recent_first* для ``Traceback.format()``. (Предоставлено Джесси Баккером в :issue:`32121`.)

source: types
ru: типы

source: The new :class:`~types.WrapperDescriptorType`, :class:`~types.MethodWrapperType`, :class:`~types.MethodDescriptorType`, and :class:`~types.ClassMethodDescriptorType` classes are now available. (Contributed by Manuel Krebber and Guido van Rossum in :issue:`29377`, and Serhiy Storchaka in :issue:`32265`.)
ru: Теперь доступны новые классы :class:`~types.WrapperDescriptorType`, :class:`~types.MethodWrapperType`, :class:`~types.MethodDescriptorType` и :class:`~types.ClassMethodDescriptorType`. (Предоставлено Мануэлем Креббером и Гвидо ван Россумом в :issue:`29377` и Сергеем Сторчакой в ​​:issue:`32265`.)

source: The new :func:`types.resolve_bases` function resolves MRO entries dynamically as specified by :pep:`560`. (Contributed by Ivan Levkivskyi in :issue:`32717`.)
ru: Новая функция :func:`types.resolve_bases` динамически разрешает записи MRO, как указано в :pep:`560`. (Предоставлено Иваном Левковским в :issue:`32717`.)

source: The internal :mod:`unicodedata` database has been upgraded to use `Unicode 11 <https://www.unicode.org/versions/Unicode11.0.0/>`_. (Contributed by Benjamin Peterson.)
ru: Внутренняя база данных :mod:`unicodedata` была обновлена ​​для использования `Unicode 11 <https://www.unicode.org/versions/Unicode11.0.0/>`_. (Предоставлено Бенджамином Петерсоном.)

source: The new ``-k`` command-line option allows filtering tests by a name substring or a Unix shell-like pattern. For example, ``python -m unittest -k foo`` runs ``foo_tests.SomeTest.test_something``, ``bar_tests.SomeTest.test_foo``, but not ``bar_tests.FooTest.test_something``. (Contributed by Jonas Haag in :issue:`32071`.)
ru: Новая опция командной строки ``-k`` позволяет фильтровать тесты по подстроке имени или шаблону, подобному оболочке Unix. Например, ``python -m unittest -k foo`` запускает ``foo_tests.SomeTest.test_something``, ``bar_tests.SomeTest.test_foo``, но не ``bar_tests.FooTest.test_something``. (Предоставлено Йонасом Хаагом в :issue:`32071`.)

source: The :const:`~unittest.mock.sentinel` attributes now preserve their identity when they are :mod:`copied <copy>` or :mod:`pickled <pickle>`. (Contributed by Serhiy Storchaka in :issue:`20804`.)
ru: Атрибуты :const:`~unittest.mock.sentinel` теперь сохраняют свою идентичность, когда они :mod:`скопированы <copy>` или :mod:`маринованы <pickle>`. (Предоставлено Сергеем Сторчакой в ​​:issue:`20804`.)

source: The new :func:`~unittest.mock.seal` function allows sealing :class:`~unittest.mock.Mock` instances, which will disallow further creation of attribute mocks. The seal is applied recursively to all attributes that are themselves mocks. (Contributed by Mario Corchero in :issue:`30541`.)
ru: Новая функция :func:`~unittest.mock.seal` позволяет запечатывать экземпляры :class:`~unittest.mock.Mock`, что запрещает дальнейшее создание макетов атрибутов. Печать рекурсивно применяется ко всем атрибутам, которые сами являются макетами. (Предоставлено Марио Корчеро в :issue:`30541`.)

source: :func:`urllib.parse.quote` has been updated from :rfc:`2396` to :rfc:`3986`, adding ``~`` to the set of characters that are never quoted by default. (Contributed by Christian Theune and Ratnadeep Debnath in :issue:`16285`.)
ru: :func:`urllib.parse.quote` был обновлен с :rfc:`2396` до :rfc:`3986`, добавлен ``~`` к набору символов, которые по умолчанию никогда не заключаются в кавычки. (Предоставлено Кристианом Теуном и Ратнадипом Дебнатом в :issue:`16285`.)

source: The :func:`!uu.encode` function now accepts an optional *backtick* keyword argument. When it's true, zeros are represented by ``'`'`` instead of spaces. (Contributed by Xiang Zhang in :issue:`30103`.)
ru: Функция :func:`!uu.encode` теперь принимает необязательный аргумент ключевого слова *backtick*. Когда это правда, нули представлены ``'`'`` вместо пробелов. (Предоставлено Сян Чжаном в :issue:`30103`.)

source: The new :attr:`UUID.is_safe <uuid.UUID.is_safe>` attribute relays information from the platform about whether generated UUIDs are generated with a multiprocessing-safe method. (Contributed by Barry Warsaw in :issue:`22807`.)
ru: Новый атрибут :attr:`UUID.is_safe <uuid.UUID.is_safe>` передает информацию с платформы о том, генерируются ли сгенерированные UUID методом, безопасным для многопроцессорной обработки. (Предоставлено Барри Варшавой в :issue:`22807`.)

source: :func:`uuid.getnode` now prefers universally administered MAC addresses over locally administered MAC addresses. This makes a better guarantee for global uniqueness of UUIDs returned from :func:`uuid.uuid1`. If only locally administered MAC addresses are available, the first such one found is returned. (Contributed by Barry Warsaw in :issue:`32107`.)
ru: :func:`uuid.getnode` теперь предпочитает универсально администрируемые MAC-адреса локально администрируемым MAC-адресам. Это дает лучшую гарантию глобальной уникальности UUID, возвращаемых из :func:`uuid.uuid1`. Если доступны только локально администрируемые MAC-адреса, возвращается первый найденный такой. (Предоставлено Барри Варшавой в :issue:`32107`.)

source: warnings
ru: предупреждения

source: The initialization of the default warnings filters has changed as follows:
ru: Инициализация фильтров предупреждений по умолчанию изменилась следующим образом:

source: warnings enabled via command line options (including those for :option:`-b` and the new CPython-specific :option:`-X` ``dev`` option) are always passed to the warnings machinery via the :data:`sys.warnoptions` attribute.
ru: предупреждения, включенные с помощью параметров командной строки (включая предупреждения для :option:`-b` и новую специфичную для CPython опцию :option:`-X` ``dev``), всегда передаются в механизм предупреждений через :data:` Атрибут sys.warnooptions.

source: warnings filters enabled via the command line or the environment now have the following order of precedence:
ru: Фильтры предупреждений, активируемые через командную строку или среду, теперь имеют следующий порядок приоритета:

source: the ``BytesWarning`` filter for :option:`-b` (or ``-bb``)
ru: фильтр ``BytesWarning`` для :option:`-b` (или ``-bb``)

source: any filters specified with the :option:`-W` option
ru: любые фильтры, указанные с опцией :option:`-W`

source: any filters specified with the :envvar:`PYTHONWARNINGS` environment variable
ru: любые фильтры, указанные в переменной среды :envvar:`PYTHONWARNINGS`

source: any other CPython specific filters (e.g. the ``default`` filter added for the new ``-X dev`` mode)
ru: любые другие фильтры, специфичные для CPython (например, фильтр «default», добавленный для нового режима «-X dev»)

source: any implicit filters defined directly by the warnings machinery
ru: любые неявные фильтры, определенные непосредственно механизмом предупреждений

source: in :ref:`CPython debug builds <debug-build>`, all warnings are now displayed by default (the implicit filter list is empty)
ru: в :ref:`CPython debug builds <debug-build>` все предупреждения теперь отображаются по умолчанию (список неявных фильтров пуст)

source: (Contributed by Nick Coghlan and Victor Stinner in :issue:`20361`, :issue:`32043`, and :issue:`32230`.)
ru: (Внесено Ником Когланом и Виктором Стиннером в :issue:`20361`, :issue:`32043` и :issue:`32230`.)

source: Deprecation warnings are once again shown by default in single-file scripts and at the interactive prompt. See :ref:`whatsnew37-pep565` for details. (Contributed by Nick Coghlan in :issue:`31975`.)
ru: Предупреждения об устаревании снова отображаются по умолчанию в однофайловых сценариях и в интерактивной подсказке. Подробности смотрите в :ref:`whatsnew37-pep565`. (Предоставлено Ником Когланом в :issue:`31975`.)

source: As mitigation against DTD and external entity retrieval, the :mod:`xml.dom.minidom` and :mod:`xml.sax` modules no longer process external entities by default. (Contributed by Christian Heimes in :gh:`61441`.)
ru: В целях защиты от DTD и извлечения внешних объектов модули :mod:`xml.dom.minidom` и :mod:`xml.sax` больше не обрабатывают внешние объекты по умолчанию. (Предоставлено Кристианом Хаймсом в :gh:`61441`.)

source: :ref:`ElementPath <elementtree-xpath>` predicates in the :meth:`find` methods can now compare text of the current node with ``[. = "text"]``, not only text in children. Predicates also allow adding spaces for better readability. (Contributed by Stefan Behnel in :issue:`31648`.)
ru: Предикаты :ref:`ElementPath <elementtree-xpath>` в методах :meth:`find` теперь могут сравнивать текст текущего узла с ``[. = "text"]``, не только текст в дочерних элементах. Предикаты также позволяют добавлять пробелы для лучшей читаемости. (Предоставлено Стефаном Бенелем в :issue:`31648`.)

source: :meth:`SimpleXMLRPCDispatcher.register_function <xmlrpc.server.SimpleXMLRPCDispatcher>` can now be used as a decorator. (Contributed by Xiang Zhang in :issue:`7769`.)
ru: :meth:`SimpleXMLRPCDispatcher.register_function <xmlrpc.server.SimpleXMLRPCDispatcher>` теперь можно использовать в качестве декоратора. (Предоставлено Сян Чжаном в :issue:`7769`.)

source: Function :func:`~zipapp.create_archive` now accepts an optional *filter* argument to allow the user to select which files should be included in the archive. (Contributed by Irmen de Jong in :issue:`31072`.)
ru: Функция :func:`~zipapp.create_archive` теперь принимает необязательный аргумент *filter*, позволяющий пользователю выбирать, какие файлы следует включить в архив. (Предоставлено Ирмен де Йонг в :issue:`31072`.)

source: Function :func:`~zipapp.create_archive` now accepts an optional *compressed* argument to generate a compressed archive. A command line option ``--compress`` has also been added to support compression. (Contributed by Zhiming Wang in :issue:`31638`.)
ru: Функция :func:`~zipapp.create_archive` теперь принимает необязательный аргумент *compressed* для создания сжатого архива. Также была добавлена ​​опция командной строки ``--compress`` для поддержки сжатия. (Предоставлено Чжимином Ваном в :issue:`31638`.)

source: zipfile
ru: zip-файл

source: :class:`~zipfile.ZipFile` now accepts the new *compresslevel* parameter to control the compression level. (Contributed by Bo Bayles in :issue:`21417`.)
ru: :class:`~zipfile.ZipFile` теперь принимает новый параметр *compresslevel* для управления уровнем сжатия. (Предоставлено Бо Бейлсом в :issue:`21417`.)

source: Subdirectories in archives created by ``ZipFile`` are now stored in alphabetical order. (Contributed by Bernhard M. Wiedemann in :issue:`30693`.)
ru: Подкаталоги в архивах, созданных с помощью ``ZipFile``, теперь хранятся в алфавитном порядке. (Предоставлено Бернхардом М. Видеманном в :issue:`30693`.)

source: C API Changes
ru: Изменения в C API

source: A new API for thread-local storage has been implemented. See :ref:`whatsnew37-pep539` for an overview and :ref:`thread-specific-storage-api` for a complete reference. (Contributed by Masayuki Yamamoto in :issue:`25658`.)
ru: Реализован новый API для локального хранилища потоков. См. :ref:`whatsnew37-pep539` для обзора и :ref:`thread-special-storage-api` для получения полной информации. (Предоставлено Масаюки Ямамото в :issue:`25658`.)

source: The new :ref:`context variables <whatsnew37-pep567>` functionality exposes a number of :ref:`new C APIs <contextvarsobjects>`.
ru: Новая :ref:`функциональность контекстных переменных <whatsnew37-pep567>` предоставляет ряд :ref:`новых API C <contextvarsobjects>`.
