Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/whatsnew/3.7.po
Languages: ru

source: :c:func:`!PySys_AddWarnOptionUnicode` is not currently usable by embedding applications due to the requirement to create a Unicode object prior to calling ``Py_Initialize``. Use :c:func:`!PySys_AddWarnOption` instead.
ru: :c:func:`!PySys_AddWarnOptionUnicode` в настоящее время нельзя использовать для встраивания приложений из-за требования создания объекта Unicode перед вызовом ``Py_Initialize``. Вместо этого используйте :c:func:`!PySys_AddWarnOption`.

source: warnings filters added by an embedding application with :c:func:`!PySys_AddWarnOption` should now more consistently take precedence over the default filters set by the interpreter
ru: Фильтры предупреждений, добавленные приложением для внедрения с помощью :c:func:`!PySys_AddWarnOption`, теперь должны более последовательно иметь приоритет над фильтрами по умолчанию, установленными интерпретатором.

source: Due to changes in the way the default warnings filters are configured, setting :c:data:`Py_BytesWarningFlag` to a value greater than one is no longer sufficient to both emit :exc:`BytesWarning` messages and have them converted to exceptions. Instead, the flag must be set (to cause the warnings to be emitted in the first place), and an explicit ``error::BytesWarning`` warnings filter added to convert them to exceptions.
ru: Из-за изменений в способе настройки фильтров предупреждений по умолчанию установка :c:data:`Py_BytesWarningFlag` на значение больше единицы больше не является достаточным для отправки сообщений :exc:`BytesWarning` и их преобразования в исключения. Вместо этого необходимо установить флаг (чтобы в первую очередь вызвать выдачу предупреждений) и добавить явный фильтр предупреждений error::BytesWarning для преобразования их в исключения.

source: Due to a change in the way docstrings are handled by the compiler, the implicit ``return None`` in a function body consisting solely of a docstring is now marked as occurring on the same line as the docstring, not on the function's header line.
ru: Из-за изменения способа обработки строк документации компилятором неявный возврат None в теле функции, состоящей исключительно из строки документации, теперь помечается как происходящий в той же строке, что и строка документации, а не в строке заголовка функции. .

source: The current exception state has been moved from the frame object to the co-routine. This simplified the interpreter and fixed a couple of obscure bugs caused by having swap exception state when entering or exiting a generator. (Contributed by Mark Shannon in :issue:`25612`.)
ru: Текущее состояние исключения было перенесено из объекта фрейма в сопрограмму. Это упростило интерпретатор и исправило пару малоизвестных ошибок, вызванных сменой состояния исключения при входе в генератор или выходе из него. (Предоставлено Марком Шенноном в :issue:`25612`.)

source: Notable changes in Python 3.7.1
ru: Заметные изменения в Python 3.7.1

source: Starting in 3.7.1, :c:func:`Py_Initialize` now consistently reads and respects all of the same environment settings as :c:func:`Py_Main` (in earlier Python versions, it respected an ill-defined subset of those environment variables, while in Python 3.7.0 it didn't read any of them due to :issue:`34247`). If this behavior is unwanted, set :c:data:`Py_IgnoreEnvironmentFlag` to 1 before calling :c:func:`Py_Initialize`.
ru: Начиная с версии 3.7.1, :c:func:`Py_Initialize` теперь последовательно считывает и учитывает все те же настройки среды, что и :c:func:`Py_Main` (в более ранних версиях Python он учитывал плохо определенное подмножество этой среды). переменных, тогда как в Python 3.7.0 он не читал ни одну из них из-за :issue:`34247`). Если такое поведение нежелательно, установите для :c:data:`Py_IgnoreEnvironmentFlag` значение 1 перед вызовом :c:func:`Py_Initialize`.

source: In 3.7.1 the C API for Context Variables :ref:`was updated <contextvarsobjects_pointertype_change>` to use :c:type:`PyObject` pointers. See also :issue:`34762`.
ru: В версии 3.7.1 API C для контекстных переменных :ref:`был обновлен <contextvarsobjects_pointertype_change>` для использования :c:type:` PyObj ect` указателей. См. также :issue:`34762`.

source: In 3.7.1 the :mod:`tokenize` module now implicitly emits a ``NEWLINE`` token when provided with input that does not have a trailing new line. This behavior now matches what the C tokenizer does internally. (Contributed by Ammar Askar in :issue:`33899`.)
ru: В версии 3.7.1 модуль :mod:`tokenize` теперь неявно выдаёт токен ``NEWLINE`` при вводе, который не имеет завершающей новой строки. Теперь это поведение соответствует тому, что делает токенизатор C внутри. (Предоставлено Аммаром Аскаром в :issue:`33899`.)

source: Notable changes in Python 3.7.2
ru: Заметные изменения в Python 3.7.2

source: In 3.7.2, :mod:`venv` on Windows no longer copies the original binaries, but creates redirector scripts named ``python.exe`` and ``pythonw.exe`` instead. This resolves a long standing issue where all virtual environments would have to be upgraded or recreated with each Python update. However, note that this release will still require recreation of virtual environments in order to get the new scripts.
ru: В версии 3.7.2 :mod:`venv` в Windows больше не копирует исходные двоичные файлы, а вместо этого создаёт сценарии перенаправления с именами ``python.exe`` и ``pythonw.exe``. Это решает давнюю проблему, когда все виртуальные среды необходимо обновлять или воссоздавать при каждом обновлении Python. Однако обратите внимание, что в этом выпуске по-прежнему потребуется воссоздание виртуальных сред для получения новых сценариев.

source: Notable changes in Python 3.7.6
ru: Заметные изменения в Python 3.7.6

source: Due to significant security concerns, the *reuse_address* parameter of :meth:`asyncio.loop.create_datagram_endpoint` is no longer supported. This is because of the behavior of the socket option ``SO_REUSEADDR`` in UDP. For more details, see the documentation for ``loop.create_datagram_endpoint()``. (Contributed by Kyle Stanley, Antoine Pitrou, and Yury Selivanov in :issue:`37228`.)
ru: Из соображений безопасности параметр *reuse_address* :meth:`asyncio.loop.create_datagram_endpoint` больше не поддерживается. Это связано с поведением опции сокета SO_REUSEADDR в UDP. Более подробную информацию смотрите в документации по ``loop.create_datagram_endpoint()``. (Предоставлено Кайлом Стэнли, Антуаном Питру и Юрием Селивановым в :issue:`37228`.)

source: Notable changes in Python 3.7.10
ru: Заметные изменения в Python 3.7.10

source: Earlier Python versions allowed using both ``;`` and ``&`` as query parameter separators in :func:`urllib.parse.parse_qs` and :func:`urllib.parse.parse_qsl`. Due to security concerns, and to conform with newer W3C recommendations, this has been changed to allow only a single separator key, with ``&`` as the default. This change also affects :func:`!cgi.parse` and :func:`!cgi.parse_multipart` as they use the affected functions internally. For more details, please see their respective documentation. (Contributed by Adam Goldschmidt, Senthil Kumaran and Ken Jin in :issue:`42967`.)
ru: Более ранние версии Python позволяли использовать как ``;``, так и ``&`` в качестве разделителей параметров запроса в :func:`urllib.parse.parse_qs` и :func:`urllib.parse.parse_qsl`. Из соображений безопасности и для соответствия новым рекомендациям W3C это было изменено, чтобы разрешить использование только одного ключа-разделителя с ``&`` по умолчанию. Это изменение также затрагивает :func:`!cgi.parse` и :func:`!cgi.parse_multipart`, поскольку они используют затронутые функции внутри себя. Более подробную информацию можно найти в соответствующей документации. (Предоставлено Адамом Гольдшмидтом, Сентилом Кумараном и Кеном Джином в :issue:`42967`.)

source: Notable changes in Python 3.7.11
ru: Заметные изменения в Python 3.7.11

source: A security fix alters the :class:`ftplib.FTP` behavior to not trust the IPv4 address sent from the remote server when setting up a passive data channel. We reuse the ftp server IP address instead. For unusual code requiring the old behavior, set a ``trust_server_pasv_ipv4_address`` attribute on your FTP instance to ``True``. (See :gh:`87451`)
ru: Исправление безопасности изменяет поведение :class:`ftplib.FTP`, чтобы он не доверял IPv4-адресу, отправленному с удаленного сервера при настройке пассивного канала передачи данных. Вместо этого мы повторно используем IP-адрес ftp-сервера. Для необычного кода, требующего старого поведения, установите для атрибута Trust_server_pasv_ipv4_address вашего экземпляра FTP значение True. (См. :gh:`87451`)

source: The presence of newline or tab characters in parts of a URL allows for some forms of attacks. Following the WHATWG specification that updates RFC 3986, ASCII newline ``\n``, ``\r`` and tab ``\t`` characters are stripped from the URL by the parser :func:`urllib.parse` preventing such attacks. The removal characters are controlled by a new module level variable ``urllib.parse._UNSAFE_URL_BYTES_TO_REMOVE``. (See :gh:`88048`)
ru: Наличие символов новой строки или табуляции в частях URL-адреса допускает некоторые формы атак. В соответствии со спецификацией WHATWG, обновляющей RFC 3986, символы новой строки ASCII ``\n``, ``\r`` и табуляции ``\t`` удаляются из URL-адреса анализатором :func:`urllib.parse`, предотвращая такие атаки. Символы удаления управляются новой переменной уровня модуля ``urllib.parse._UNSAFE_URL_BYTES_TO_REMOVE``. (См. :gh:`88048`)

source: Notable security feature in 3.7.14
ru: Заметная функция безопасности в версии 3.7.14.

source: Converting between :class:`int` and :class:`str` in bases other than 2 (binary), 4, 8 (octal), 16 (hexadecimal), or 32 such as base 10 (decimal) now raises a :exc:`ValueError` if the number of digits in string form is above a limit to avoid potential denial of service attacks due to the algorithmic complexity. This is a mitigation for :cve:`2020-10735`. This limit can be configured or disabled by environment variable, command line flag, or :mod:`sys` APIs. See the :ref:`integer string conversion length limitation <int_max_str_digits>` documentation. The default limit is 4300 digits in string form.
ru: Преобразование между :class:`int` и :class:`str` в системах счисления, отличных от 2 (двоичная), 4, 8 (восьмеричная), 16 (шестнадцатеричная) или 32, например, 10 (десятичная), теперь вызывает :exc :`ValueError`, если количество цифр в строковой форме превышает ограничение, чтобы избежать потенциальных атак типа «отказ в обслуживании» из-за сложности алгоритма. Это смягчение последствий :cve:`2020-10735`. Это ограничение можно настроить или отключить с помощью переменной среды, флага командной строки или API :mod:`sys`. См. документацию по ограничению длины преобразования целочисленной строки <int_max_str_digits>`. Ограничение по умолчанию — 4300 цифр в строковой форме.
