Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/whatsnew/3.7.po
Languages: ru

source: When using the :option:`-m` switch, the initial working directory is now added to :data:`sys.path`, rather than an empty string (which dynamically denoted the current working directory at the time of each import). Any programs that are checking for the empty string, or otherwise relying on the previous behaviour, will need to be updated accordingly (e.g. by also checking for ``os.getcwd()`` or ``os.path.dirname(__main__.__file__)``, depending on why the code was checking for the empty string in the first place).
ru: При использовании переключателя :option:`-m` начальный рабочий каталог теперь добавляется в :data:`sys.path`, а не пустая строка (которая динамически обозначает текущий рабочий каталог во время каждого импорта). Любые программы, которые проверяют пустую строку или иным образом полагаются на предыдущее поведение, должны быть соответствующим образом обновлены (например, путем проверки ``os.getcwd()`` или ``os.path.dirname(__main__. __file__)``, в зависимости от того, почему код вообще проверял наличие пустой строки).

source: Changes in the Python API
ru: Изменения в API Python

source: :meth:`socketserver.ThreadingMixIn.server_close` now waits until all non-daemon threads complete. Set the new :attr:`socketserver.ThreadingMixIn.block_on_close` class attribute to ``False`` to get the pre-3.7 behaviour. (Contributed by Victor Stinner in :issue:`31233` and :issue:`33540`.)
ru: :meth:`socketserver.ThreadingMixIn.server_close` теперь ожидает завершения всех потоков, не являющихся демонами. Установите для нового атрибута класса :attr:`socketserver.ThreadingMixIn.block_on_close` значение ``False``, чтобы получить поведение версии до версии 3.7. (Предоставлено Виктором Стиннером в :issue:`31233` и :issue:`33540`.)

source: :meth:`socketserver.ForkingMixIn.server_close` now waits until all child processes complete. Set the new :attr:`socketserver.ForkingMixIn.block_on_close` class attribute to ``False`` to get the pre-3.7 behaviour. (Contributed by Victor Stinner in :issue:`31151` and :issue:`33540`.)
ru: :meth:`socketserver.ForkingMixIn.server_close` теперь ожидает завершения всех дочерних процессов. Установите для нового атрибута класса :attr:`socketserver.ForkingMixIn.block_on_close` значение ``False``, чтобы получить поведение версии до версии 3.7. (Предоставлено Виктором Стиннером в :issue:`31151` и :issue:`33540`.)

source: The :func:`locale.localeconv` function now temporarily sets the ``LC_CTYPE`` locale to the value of ``LC_NUMERIC`` in some cases. (Contributed by Victor Stinner in :issue:`31900`.)
ru: Функция :func:`locale.localeconv` теперь временно устанавливает для локали ``LC_CTYPE`` значение ``LC_NUMERIC`` в некоторых случаях. (Предоставлено Виктором Стиннером в :issue:`31900`.)

source: :meth:`pkgutil.walk_packages` now raises a :exc:`ValueError` if *path* is a string. Previously an empty list was returned. (Contributed by Sanyam Khurana in :issue:`24744`.)
ru: :meth:`pkgutil.walk_packages` теперь вызывает :exc:`ValueError`, если *path* является строкой. Ранее возвращался пустой список. (Предоставлено Саньямом Хураной в :issue:`24744`.)

source: A format string argument for :meth:`string.Formatter.format` is now :ref:`positional-only <positional-only_parameter>`. Passing it as a keyword argument was deprecated in Python 3.5. (Contributed by Serhiy Storchaka in :issue:`29193`.)
ru: Аргумент строки формата для :meth:`string.Formatter.format` теперь имеет вид :ref:`positional-only <positional-only_parameter>`. Передача его в качестве аргумента ключевого слова устарела в Python 3.5. (Предоставлено Сергеем Сторчакой в ​​:issue:`29193`.)

source: Attributes :attr:`~http.cookies.Morsel.key`, :attr:`~http.cookies.Morsel.value` and :attr:`~http.cookies.Morsel.coded_value` of class :class:`http.cookies.Morsel` are now read-only. Assigning to them was deprecated in Python 3.5. Use the :meth:`~http.cookies.Morsel.set` method for setting them. (Contributed by Serhiy Storchaka in :issue:`29192`.)
ru: Атрибуты :attr:`~http.cookies.Morsel.key`, :attr:`~http.cookies.Morsel.value` и :attr:`~http.cookies.Morsel.coded_value` класса :class:`http. cookie.Morsel` теперь доступны только для чтения. Назначение им устарело в Python 3.5. Используйте метод :meth:`~http.cookies.Morsel.set` для их установки. (Предоставлено Сергеем Сторчакой в ​​:issue:`29192`.)

source: The *mode* argument of :func:`os.makedirs` no longer affects the file permission bits of newly created intermediate-level directories. To set their file permission bits you can set the umask before invoking ``makedirs()``. (Contributed by Serhiy Storchaka in :issue:`19930`.)
ru: Аргумент *mode* :func:`os.madeirs` больше не влияет на биты прав доступа к файлам вновь созданных каталогов промежуточного уровня. Чтобы установить биты прав доступа к файлам, вы можете установить umask перед вызовом makedirs(). (Предоставлено Сергеем Сторчакой в ​​:issue:`19930`.)

source: The :attr:`struct.Struct.format` type is now :class:`str` instead of :class:`bytes`. (Contributed by Victor Stinner in :issue:`21071`.)
ru: Тип :attr:`struct.Struct.format` теперь имеет вид :class:`str` вместо :class:`bytes`. (Предоставлено Виктором Стиннером в :issue:`21071`.)

source: :func:`!cgi.parse_multipart` now accepts the *encoding* and *errors* arguments and returns the same results as :class:`!FieldStorage`: for non-file fields, the value associated to a key is a list of strings, not bytes. (Contributed by Pierre Quentel in :issue:`29979`.)
ru: :func:`!cgi.parse_multipart` теперь принимает аргументы *encoding* и *errors* и возвращает те же результаты, что и :class:`!FieldStorage`: для полей, не являющихся файлами, значение, связанное с ключом, представляет собой список строки, а не байты. (Предоставлено Пьером Квентелем в :issue:`29979`.)

source: Due to internal changes in :mod:`socket`, calling :func:`socket.fromshare` on a socket created by :func:`socket.share <socket.socket.share>` in older Python versions is not supported.
ru: Из-за внутренних изменений в :mod:`socket` вызов :func:`socket.fromshare` для сокета, созданного :func:`socket.share <socket.socket.share>` в старых версиях Python, не поддерживается.

source: ``repr`` for :exc:`BaseException` has changed to not include the trailing comma. Most exceptions are affected by this change. (Contributed by Serhiy Storchaka in :issue:`30399`.)
ru: ``repr`` для :exc:`BaseException` изменен и теперь не содержит завершающую запятую. Это изменение затронуло большинство исключений. (Предоставлено Сергеем Сторчакой в ​​:issue:`30399`.)

source: ``repr`` for :class:`datetime.timedelta` has changed to include the keyword arguments in the output. (Contributed by Utkarsh Upadhyay in :issue:`30302`.)
ru: ``repr`` для :class:`datetime.timedelta` был изменен и включает в вывод аргументы ключевого слова. (Предоставлено Уткаршем Упадхьяем в :issue:`30302`.)

source: Because :func:`shutil.rmtree` is now implemented using the :func:`os.scandir` function, the user specified handler *onerror* is now called with the first argument ``os.scandir`` instead of ``os.listdir`` when listing the directory is failed.
ru: Поскольку :func:`shutil.rmtree` теперь реализован с использованием функции :func:`os.scandir`, указанный пользователем обработчик *onerror* теперь вызывается с первым аргументом ``os.scandir`` вместо ``os .listdir`` при неудачном перечислении каталога.

source: Support for nested sets and set operations in regular expressions as in `Unicode Technical Standard #18`_ might be added in the future. This would change the syntax. To facilitate this future change a :exc:`FutureWarning` will be raised in ambiguous cases for the time being. That include sets starting with a literal ``'['`` or containing literal character sequences ``'--'``, ``'&&'``, ``'~~'``, and ``'||'``. To avoid a warning, escape them with a backslash. (Contributed by Serhiy Storchaka in :issue:`30349`.)
ru: В будущем может быть добавлена ​​поддержка вложенных наборов и операций над множествами в регулярных выражениях, как в «Техническом стандарте Unicode #18». Это изменит синтаксис. Чтобы облегчить это будущее изменение, в настоящее время в неоднозначных случаях будет вызываться :exc:`FutureWarning`. Сюда входят наборы, начинающиеся с литерала ``'['`` или содержащие литеральные последовательности символов ``'--'``, ``'&&'``, ``'~~'`` и ``'| |'``. Чтобы избежать предупреждения, экранируйте их обратной косой чертой. (Предоставлено Сергеем Сторчакой в ​​:issue:`30349`.)

source: The result of splitting a string on a :mod:`regular expression <re>` that could match an empty string has been changed. For example splitting on ``r'\s*'`` will now split not only on whitespaces as it did previously, but also on empty strings before all non-whitespace characters and just before the end of the string. The previous behavior can be restored by changing the pattern to ``r'\s+'``. A :exc:`FutureWarning` was emitted for such patterns since Python 3.5.
ru: Изменен результат разделения строки на :mod:`регулярное выражение <re>`, которое могло соответствовать пустой строке. Например, разделение на ``r'\s*'`` теперь будет разделяться не только по пробелам, как это было раньше, но также и по пустым строкам перед всеми символами, не являющимися пробелами, и непосредственно перед концом строки. Предыдущее поведение можно восстановить, изменив шаблон на ``r'\s+'``. Для таких шаблонов начиная с версии Python 3.5 выдавалось сообщение :exc:`FutureWarning`.

source: For patterns that match both empty and non-empty strings, the result of searching for all matches may also be changed in other cases. For example in the string ``'a\n\n'``, the pattern ``r'(?m)^\s*?$'`` will not only match empty strings at positions 2 and 3, but also the string ``'\n'`` at positions 2--3. To match only blank lines, the pattern should be rewritten as ``r'(?m)^[^\S\n]*$'``.
ru: Для шаблонов, соответствующих как пустым, так и непустым строкам, результат поиска всех совпадений также может быть изменен в других случаях. Например, в строке ``'a\n\n'`` шаблон ``r'(?m)^\s*?$'`` будет не только соответствовать пустым строкам в позициях 2 и 3, но и строка ``'\n'`` в позициях 2--3. Чтобы соответствовать только пустым строкам, шаблон следует переписать как ``r'(?m)^[^\S\n]*$'``.

source: :func:`re.sub` now replaces empty matches adjacent to a previous non-empty match. For example ``re.sub('x*', '-', 'abxd')`` returns now ``'-a-b--d-'`` instead of ``'-a-b-d-'`` (the first minus between 'b' and 'd' replaces 'x', and the second minus replaces an empty string between 'x' and 'd').
ru: :func:`re.sub` теперь заменяет пустые совпадения, соседние с предыдущим непустым совпадением. Например, ``re.sub('x*', '-', 'abxd')`` теперь возвращает ``'-ab--d-'`` вместо ``'-abd-'`` ( первый минус между «b» и «d» заменяет «x», а второй минус заменяет пустую строку между «x» и «d»).

source: (Contributed by Serhiy Storchaka in :issue:`25054` and :issue:`32308`.)
ru: (Внесено Сергеем Сторчакой в ​​:issue:`25054` и :issue:`32308`.)

source: Change :func:`re.escape` to only escape regex special characters instead of escaping all characters other than ASCII letters, numbers, and ``'_'``. (Contributed by Serhiy Storchaka in :issue:`29995`.)
ru: Измените :func:`re.escape`, чтобы экранировать только специальные символы регулярных выражений вместо экранирования всех символов, кроме букв ASCII, цифр и ``'_'``. (Предоставлено Сергеем Сторчакой в ​​:issue:`29995`.)

source: :class:`tracemalloc.Traceback` frames are now sorted from oldest to most recent to be more consistent with :mod:`traceback`. (Contributed by Jesse Bakker in :issue:`32121`.)
ru: Кадры :class:`tracemalloc.Traceback` теперь сортируются от самых старых к самым последним, чтобы лучше соответствовать :mod:`traceback`. (Предоставлено Джесси Баккером в :issue:`32121`.)

source: On OSes that support :const:`socket.SOCK_NONBLOCK` or :const:`socket.SOCK_CLOEXEC` bit flags, the :attr:`socket.type <socket.socket.type>` no longer has them applied. Therefore, checks like ``if sock.type == socket.SOCK_STREAM`` work as expected on all platforms. (Contributed by Yury Selivanov in :issue:`32331`.)
ru: В ОС, которые поддерживают битовые флаги :const:`socket.SOCK_NONBLOCK` или :const:`socket.SOCK_CLOEXEC`, :attr:`socket.type <socket.socket.type>` больше не применяется. Таким образом, проверки типа ``if sock.type == socket.SOCK_STREAM`` работают должным образом на всех платформах. (Добавлен Юрием Селивановым в :issue:`32331`.)

source: On Windows the default for the *close_fds* argument of :class:`subprocess.Popen` was changed from :const:`False` to :const:`True` when redirecting the standard handles. If you previously depended on handles being inherited when using :class:`subprocess.Popen` with standard io redirection, you will have to pass ``close_fds=False`` to preserve the previous behaviour, or use :attr:`STARTUPINFO.lpAttributeList <subprocess.STARTUPINFO.lpAttributeList>`.
ru: В Windows значение по умолчанию для аргумента *close_fds* :class:`subprocess.Popen` было изменено с :const:`False` на :const:`True` при перенаправлении стандартных дескрипторов. Если вы ранее зависели от наследования дескрипторов при использовании :class:`subprocess.Popen` со стандартным перенаправлением ввода-вывода, вам нужно будет передать ``close_fds=False``, чтобы сохранить предыдущее поведение, или использовать :attr:`STARTUPINFO.lpAttributeList <subprocess.STARTUPINFO.lpAttributeList>`.

source: :meth:`importlib.machinery.PathFinder.invalidate_caches` -- which implicitly affects :func:`importlib.invalidate_caches` -- now deletes entries in :data:`sys.path_importer_cache` which are set to ``None``. (Contributed by Brett Cannon in :issue:`33169`.)
ru: :meth:`importlib.machinery.PathFinder.invalidate_caches` -- который неявно влияет на :func:`importlib.invalidate_caches` -- теперь удаляет записи в :data:`sys.path_importer_cache`, для которых установлено значение ``None``. (Предоставлено Бреттом Кэнноном в :issue:`33169`.)

source: In :mod:`asyncio`, :meth:`loop.sock_recv() <asyncio.loop.sock_recv>`, :meth:`loop.sock_sendall() <asyncio.loop.sock_sendall>`, :meth:`loop.sock_accept() <asyncio.loop.sock_accept>`, :meth:`loop.getaddrinfo() <asyncio.loop.getaddrinfo>`, :meth:`loop.getnameinfo() <asyncio.loop.getnameinfo>` have been changed to be proper coroutine methods to match their documentation. Previously, these methods returned :class:`asyncio.Future` instances. (Contributed by Yury Selivanov in :issue:`32327`.)
ru: В :mod:`asyncio`, :meth:`loop.sock_recv() <asyncio.loop.sock_recv>`, :meth:`loop.sock_sendall() <asyncio.loop.sock_sendall>`, :meth:`loop. sock_accept() <asyncio.loop.sock_accept>`, :meth:`loop.getaddrinfo() <asyncio.loop.getaddrinfo>`, :meth:`loop.getnameinfo() <asyncio.loop.getnameinfo>` были изменены быть правильными методами сопрограммы, соответствующими их документации. Раньше эти методы возвращали экземпляры :class:`asyncio.Future`. (Добавлен Юрием Селивановым в :issue:`32327`.)

source: :attr:`asyncio.Server.sockets` now returns a copy of the internal list of server sockets, instead of returning it directly. (Contributed by Yury Selivanov in :issue:`32662`.)
ru: :attr:`asyncio.Server.sockets` теперь возвращает копию внутреннего списка сокетов сервера вместо того, чтобы возвращать его напрямую. (Добавлен Юрием Селивановым в :issue:`32662`.)

source: :attr:`Struct.format <struct.Struct.format>` is now a :class:`str` instance instead of a :class:`bytes` instance. (Contributed by Victor Stinner in :issue:`21071`.)
ru: :attr:`Struct.format <struct.Struct.format>` теперь является экземпляром :class:`str` вместо экземпляра :class:`bytes`. (Предоставлено Виктором Стиннером в :issue:`21071`.)

source: :mod:`argparse` subparsers can now be made mandatory by passing ``required=True`` to :meth:`ArgumentParser.add_subparsers() <argparse.ArgumentParser.add_subparsers>`. (Contributed by Anthony Sottile in :issue:`26510`.)
ru: Субпарсеры :mod:`argparse` теперь можно сделать обязательными, передав ``required=True`` в :meth:`ArgumentParser.add_subparsers() <argparse.ArgumentParser.add_subparsers>`. (Предоставлено Энтони Соттайлом в :issue:`26510`.)

source: :meth:`ast.literal_eval` is now stricter. Addition and subtraction of arbitrary numbers are no longer allowed. (Contributed by Serhiy Storchaka in :issue:`31778`.)
ru: :meth:`ast.literal_eval` теперь более строгий. Сложение и вычитание произвольных чисел больше не допускается. (Предоставлено Сергеем Сторчакой в ​​:issue:`31778`.)

source: :meth:`Calendar.itermonthdates <calendar.Calendar.itermonthdates>` will now consistently raise an exception when a date falls outside of the ``0001-01-01`` through ``9999-12-31`` range. To support applications that cannot tolerate such exceptions, the new :meth:`Calendar.itermonthdays3 <calendar.Calendar.itermonthdays3>` and :meth:`Calendar.itermonthdays4 <calendar.Calendar.itermonthdays4>` can be used. The new methods return tuples and are not restricted by the range supported by :class:`datetime.date`. (Contributed by Alexander Belopolsky in :issue:`28292`.)
ru: :meth:`Calendar.itermonthdates <calendar.Calendar.itermonthdates>` теперь будет постоянно вызывать исключение, когда дата выходит за пределы диапазона от ``0001-01-01`` до ``9999-12-31``. Для поддержки приложений, которые не допускают таких исключений, можно использовать новые :meth:`Calendar.itermonthdays3 <calendar.Calendar.itermonthdays3>` и :meth:`Calendar.itermonthdays4 <calendar.Calendar.itermonthdays4>`. Новые методы возвращают кортежи и не ограничены диапазоном, поддерживаемым :class:`datetime.date`. (Предоставлено Александром Белопольским в :issue:`28292`.)

source: :class:`collections.ChainMap` now preserves the order of the underlying mappings. (Contributed by Raymond Hettinger in :issue:`32792`.)
ru: :class:`collections.ChainMap` теперь сохраняет порядок базовых отображений. (Предоставлено Рэймондом Хеттингером в :issue:`32792`.)

source: The ``submit()`` method of :class:`concurrent.futures.ThreadPoolExecutor` and :class:`concurrent.futures.ProcessPoolExecutor` now raises a :exc:`RuntimeError` if called during interpreter shutdown. (Contributed by Mark Nemec in :issue:`33097`.)
ru: Метод ``submit()`` для :class:`concurrent.futures.ThreadPoolExecutor` и :class:`concurrent.futures.ProcessPoolExecutor` теперь вызывает :exc:`RuntimeError`, если он вызывается во время завершения работы интерпретатора. (Предоставлено Марком Немеком в :issue:`33097`.)

source: The :class:`configparser.ConfigParser` constructor now uses ``read_dict()`` to process the default values, making its behavior consistent with the rest of the parser. Non-string keys and values in the defaults dictionary are now being implicitly converted to strings. (Contributed by James Tocknell in :issue:`23835`.)
ru: Конструктор :class:`configparser.ConfigParser` теперь использует ``read_dict()`` для обработки значений по умолчанию, что делает его поведение согласованным с остальной частью парсера. Нестроковые ключи и значения в словаре по умолчанию теперь неявно преобразуются в строки. (Предоставлено Джеймсом Токнеллом в :issue:`23835`.)

source: Several undocumented internal imports were removed. One example is that ``os.errno`` is no longer available; use ``import errno`` directly instead. Note that such undocumented internal imports may be removed any time without notice, even in micro version releases.
ru: Несколько недокументированных внутренних импортных товаров были удалены. Одним из примеров является то, что ``os.errno`` больше не доступен; вместо этого используйте ``import errno`` напрямую. Обратите внимание, что такой недокументированный внутренний импорт может быть удален в любое время без предварительного уведомления, даже в микроверсиях.

source: Changes in the C API
ru: Изменения в C API

source: The function :c:func:`PySlice_GetIndicesEx` is considered unsafe for resizable sequences. If the slice indices are not instances of :class:`int`, but objects that implement the :meth:`!__index__` method, the sequence can be resized after passing its length to :c:func:`!PySlice_GetIndicesEx`. This can lead to returning indices out of the length of the sequence. For avoiding possible problems use new functions :c:func:`PySlice_Unpack` and :c:func:`PySlice_AdjustIndices`. (Contributed by Serhiy Storchaka in :issue:`27867`.)
ru: Функция :c:func:`PySlice_GetIndicesEx` считается небезопасной для последовательностей с изменяемым размером. Если индексы срезов не являются экземплярами :class:`int`, а являются объектами, реализующими метод :meth:`!__index__`, размер последовательности можно изменить после передачи ее длины в :c:func:`!PySlice_GetIndicesEx`. Это может привести к возврату индексов за пределами длины последовательности. Чтобы избежать возможных проблем, используйте новые функции :c:func:`PySlice_Unpack` и :c:func:`PySlice_AdjustIndices`. (Предоставлено Сергеем Сторчакой в ​​:issue:`27867`.)

source: CPython bytecode changes
ru: Изменения в байт-коде CPython

source: There are two new opcodes: :opcode:`LOAD_METHOD` and :opcode:`!CALL_METHOD`. (Contributed by Yury Selivanov and INADA Naoki in :issue:`26110`.)
ru: Появилось два новых кода операции: :opcode:`LOAD_METHOD` и :opcode:`!CALL_METHOD`. (Предоставлено Юрием Селивановым и INADA Naoki в :issue:`26110`.)

source: The :opcode:`!STORE_ANNOTATION` opcode has been removed. (Contributed by Mark Shannon in :issue:`32550`.)
ru: Код операции :opcode:`!STORE_ANNOTATION` был удален. (Предоставлено Марком Шенноном в :issue:`32550`.)

source: The file used to override :data:`sys.path` is now called ``<python-executable>._pth`` instead of ``'sys.path'``. See :ref:`windows_finding_modules` for more information. (Contributed by Steve Dower in :issue:`28137`.)
ru: Файл, используемый для переопределения :data:`sys.path`, теперь называется ``<python-executable>._pth`` вместо ``'sys.path'``. Дополнительную информацию см. в разделе :ref:`windows_finding_modules`. (Предоставлено Стивом Дауэром в :issue:`28137`.)

source: Other CPython implementation changes
ru: Другие изменения реализации CPython

source: In preparation for potential future changes to the public CPython runtime initialization API (see :pep:`432` for an initial, but somewhat outdated, draft), CPython's internal startup and configuration management logic has been significantly refactored. While these updates are intended to be entirely transparent to both embedding applications and users of the regular CPython CLI, they're being mentioned here as the refactoring changes the internal order of various operations during interpreter startup, and hence may uncover previously latent defects, either in embedding applications, or in CPython itself. (Initially contributed by Nick Coghlan and Eric Snow as part of :issue:`22257`, and further updated by Nick, Eric, and Victor Stinner in a number of other issues). Some known details affected:
ru: В рамках подготовки к возможным будущим изменениям общедоступного API инициализации среды выполнения CPython (первоначальный, но несколько устаревший проект см. в :pep:`432`), внутренняя логика управления запуском и конфигурацией CPython была значительно переработана. Хотя эти обновления должны быть полностью прозрачными как для встраиваемых приложений, так и для пользователей обычного интерфейса командной строки CPython, они упоминаются здесь, поскольку рефакторинг меняет внутренний порядок различных операций во время запуска интерпретатора и, следовательно, может выявить ранее скрытые дефекты, либо при внедрении приложений или в самом CPython. (Первоначально предоставлено Ником Когланом и Эриком Сноу как часть :issue:`22257`, а затем обновлено Ником, Эриком и Виктором Стиннером в ряде других выпусков). Затронули некоторые известные детали:
