Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/whatsnew/3.7.po
Languages: ru

source: Yield expressions (both ``yield`` and ``yield from`` clauses) are now deprecated in comprehensions and generator expressions (aside from the iterable expression in the leftmost :keyword:`!for` clause). This ensures that comprehensions always immediately return a container of the appropriate type (rather than potentially returning a :term:`generator iterator` object), while generator expressions won't attempt to interleave their implicit output with the output from any explicit yield expressions. In Python 3.7, such expressions emit :exc:`DeprecationWarning` when compiled, in Python 3.8 this will be a :exc:`SyntaxError`. (Contributed by Serhiy Storchaka in :issue:`10544`.)
ru: Выражения доходности (как предложения ``yield``, так и ``yield from``) теперь считаются устаревшими в генераторных выражениях и генераторах (за исключением итерируемого выражения в крайнем левом предложении :keyword:`!for`). Это гарантирует, что понимания всегда немедленно возвращают контейнер соответствующего типа (вместо того, чтобы потенциально возвращать объект :term:`generator iterator`), в то время как выражения генератора не будут пытаться чередовать свой неявный вывод с выводом любых явных выражений доходности. В Python 3.7 такие выражения при компиляции выдают :exc:`DeprecationWarning`, в Python 3.8 это будет :exc:`SyntaxError`. (Предоставлено Сергеем Сторчакой в ​​:issue:`10544`.)

source: Returning a subclass of :class:`complex` from :meth:`object.__complex__` is deprecated and will be an error in future Python versions. This makes ``__complex__()`` consistent with :meth:`object.__int__` and :meth:`object.__float__`. (Contributed by Serhiy Storchaka in :issue:`28894`.)
ru: Возврат подкласса :class:`complex` из :meth:`object.__complex__` устарел и будет ошибкой в ​​будущих версиях Python. Это делает ``__complex__()`` совместимым с :meth:`object.__int__` и :meth:`object.__float__`. (Предоставлено Сергеем Сторчакой в ​​:issue:`28894`.)

source: Deprecated Python modules, functions and methods
ru: Устаревшие модули, функции и методы Python

source: :func:`!aifc.openfp` has been deprecated and will be removed in Python 3.9. Use :func:`!aifc.open` instead. (Contributed by Brian Curtin in :issue:`31985`.)
ru: :func:`!aifc.openfp` устарел и будет удален в Python 3.9. Вместо этого используйте :func:`!aifc.open`. (Предоставлено Брайаном Кертином в :issue:`31985`.)

source: Support for directly ``await``-ing instances of :class:`asyncio.Lock` and other asyncio synchronization primitives has been deprecated. An asynchronous context manager must be used in order to acquire and release the synchronization resource. (Contributed by Andrew Svetlov in :issue:`32253`.)
ru: Поддержка прямого ожидания экземпляров :class:`asyncio.Lock` и других примитивов синхронизации asyncio устарела. Для получения и освобождения ресурса синхронизации необходимо использовать асинхронный менеджер контекста. (Предоставлено Андреем Светловым в :issue:`32253`.)

source: The :meth:`!asyncio.Task.current_task` and :meth:`!asyncio.Task.all_tasks` methods have been deprecated. (Contributed by Andrew Svetlov in :issue:`32250`.)
ru: Методы :meth:`!asyncio.Task.current_task` и :meth:`!asyncio.Task.all_tasks` устарели. (Предоставлено Андреем Светловым в :issue:`32250`.)

source: In Python 3.8, the abstract base classes in :mod:`collections.abc` will no longer be exposed in the regular :mod:`collections` module. This will help create a clearer distinction between the concrete classes and the abstract base classes. (Contributed by Serhiy Storchaka in :issue:`25988`.)
ru: В Python 3.8 абстрактные базовые классы в :mod:`collections.abc` больше не будут отображаться в обычном модуле :mod:`collections`. Это поможет создать более четкое различие между конкретными классами и абстрактными базовыми классами. (Предоставлено Сергеем Сторчакой в ​​:issue:`25988`.)

source: :mod:`dbm.dumb` now supports reading read-only files and no longer writes the index file when it is not changed. A deprecation warning is now emitted if the index file is missing and recreated in the ``'r'`` and ``'w'`` modes (this will be an error in future Python releases). (Contributed by Serhiy Storchaka in :issue:`28847`.)
ru: :mod:`dbm.dumb` теперь поддерживает чтение файлов, доступных только для чтения, и больше не записывает индексный файл, если он не изменен. Предупреждение об устаревании теперь выдается, если индексный файл отсутствует и создается заново в режимах ``'r'`` и ``'w'`` (в будущих выпусках Python это будет ошибкой). (Предоставлено Сергеем Сторчакой в ​​:issue:`28847`.)

source: In Python 3.8, attempting to check for non-Enum objects in :class:`Enum` classes will raise a :exc:`TypeError` (e.g. ``1 in Color``); similarly, attempting to check for non-Flag objects in a :class:`Flag` member will raise :exc:`TypeError` (e.g. ``1 in Perm.RW``); currently, both operations return :const:`False` instead. (Contributed by Ethan Furman in :issue:`33217`.)
ru: В Python 3.8 попытка проверки объектов, отличных от Enum, в классах :class:`Enum` вызовет ошибку :exc:`TypeError` (например, ``1 in Color``); аналогично, попытка проверить наличие объектов, не являющихся флагами, в члене :class:`Flag` приведет к возникновению :exc:`TypeError` (например, ``1 в Perm.RW``); в настоящее время обе операции вместо этого возвращают :const:`False`. (Предоставлено Итаном Фурманом в :issue:`33217`.)

source: Using non-integer value for selecting a plural form in :mod:`gettext` is now deprecated. It never correctly worked. (Contributed by Serhiy Storchaka in :issue:`28692`.)
ru: Использование нецелого значения для выбора формы множественного числа в :mod:`gettext` теперь устарело. Это никогда не работало правильно. (Предоставлено Сергеем Сторчакой в ​​:issue:`28692`.)

source: Methods :meth:`!MetaPathFinder.find_module` (replaced by :meth:`MetaPathFinder.find_spec() <importlib.abc.MetaPathFinder.find_spec>`) and :meth:`!PathEntryFinder.find_loader` (replaced by :meth:`PathEntryFinder.find_spec() <importlib.abc.PathEntryFinder.find_spec>`) both deprecated in Python 3.4 now emit :exc:`DeprecationWarning`. (Contributed by Matthias Bussonnier in :issue:`29576`.)
ru: Методы :meth:`!MetaPathFinder.find_module` (заменено на :meth:`MetaPathFinder.find_spec() <importlib.abc.MetaPathFinder.find_spec>`) и :meth:`!PathEntryFinder.find_loader` (заменено на :meth:` PathEntryFinder.find_spec() <importlib.abc.PathEntryFinder.find_spec>`), оба из которых устарели в Python 3.4, теперь выдают :exc:`DeprecationWarning`. (Предоставлено Матиасом Бюссонье в :issue:`29576`.)

source: The :class:`importlib.abc.ResourceLoader` ABC has been deprecated in favour of :class:`importlib.abc.ResourceReader`.
ru: :class:`importlib.abc.ResourceLoader` ABC устарел в пользу :class:`importlib.abc.ResourceReader`.

source: :func:`locale.format` has been deprecated, use :meth:`locale.format_string` instead. (Contributed by Garvit in :issue:`10379`.)
ru: :func:`locale.format` устарел, используйте вместо него :meth:`locale.format_string`. (Предоставлено Гарвитом в :issue:`10379`.)

source: The :mod:`macpath` is now deprecated and will be removed in Python 3.8. (Contributed by Chi Hsuan Yen in :issue:`9850`.)
ru: :mod:`macpath` устарел и будет удален в Python 3.8. (Предоставлено Чи Сюань Йеном в :issue:`9850`.)

source: :mod:`!dummy_threading` and :mod:`!_dummy_thread` have been deprecated. It is no longer possible to build Python with threading disabled. Use :mod:`threading` instead. (Contributed by Antoine Pitrou in :issue:`31370`.)
ru: :mod:`!dummy_threading` и :mod:`!_dummy_thread` устарели. Больше невозможно собрать Python с отключенной многопоточностью. Вместо этого используйте :mod:`threading`. (Предоставлено Антуаном Питру в :issue:`31370`.)

source: The silent argument value truncation in :func:`socket.htons` and :func:`socket.ntohs` has been deprecated. In future versions of Python, if the passed argument is larger than 16 bits, an exception will be raised. (Contributed by Oren Milman in :issue:`28332`.)
ru: Усечение значения тихого аргумента в :func:`socket.htons` и :func:`socket.ntohs` устарело. В будущих версиях Python, если переданный аргумент превышает 16 бит, будет возбуждено исключение. (Предоставлено Ореном Милманом в :issue:`28332`.)

source: :func:`ssl.wrap_socket` is deprecated. Use :meth:`ssl.SSLContext.wrap_socket` instead. (Contributed by Christian Heimes in :issue:`28124`.)
ru: :func:`ssl.wrap_socket` устарел. Вместо этого используйте :meth:`ssl.SSLContext.wrap_socket`. (Предоставлено Кристианом Хаймсом в :issue:`28124`.)

source: :func:`!sunau.openfp` has been deprecated and will be removed in Python 3.9. Use :func:`!sunau.open` instead. (Contributed by Brian Curtin in :issue:`31985`.)
ru: :func:`!sunau.openfp` устарел и будет удален в Python 3.9. Вместо этого используйте :func:`!sunau.open`. (Предоставлено Брайаном Кертином в :issue:`31985`.)

source: Deprecated :func:`sys.set_coroutine_wrapper` and :func:`sys.get_coroutine_wrapper`.
ru: Устарели :func:`sys.set_coroutine_wrapper` и :func:`sys.get_coroutine_wrapper`.

source: The undocumented ``sys.callstats()`` function has been deprecated and will be removed in a future Python version. (Contributed by Victor Stinner in :issue:`28799`.)
ru: Недокументированная функция ``sys.callstats()`` устарела и будет удалена в будущей версии Python. (Предоставлено Виктором Стиннером в :issue:`28799`.)

source: :func:`wave.openfp` has been deprecated and will be removed in Python 3.9. Use :func:`wave.open` instead. (Contributed by Brian Curtin in :issue:`31985`.)
ru: :func:`wave.openfp` устарел и будет удален в Python 3.9. Вместо этого используйте :func:`wave.open`. (Предоставлено Брайаном Кертином в :issue:`31985`.)

source: Deprecated functions and types of the C API
ru: Устаревшие функции и типы C API

source: Function :c:func:`PySlice_GetIndicesEx` is deprecated and replaced with a macro if ``Py_LIMITED_API`` is not set or set to a value in the range between ``0x03050400`` and ``0x03060000`` (not inclusive), or is ``0x03060100`` or higher. (Contributed by Serhiy Storchaka in :issue:`27867`.)
ru: Функция :c:func:`PySlice_GetIndicesEx` устарела и заменена макросом, если ``Py_LIMITED_API`` не установлен или ему присвоено значение в диапазоне от ``0x03050400`` до ``0x03060000`` (не включительно), или ``0x03060100`` или выше. (Предоставлено Сергеем Сторчакой в ​​:issue:`27867`.)

source: :c:func:`PyOS_AfterFork` has been deprecated. Use :c:func:`PyOS_BeforeFork`, :c:func:`PyOS_AfterFork_Parent` or :c:func:`PyOS_AfterFork_Child()` instead. (Contributed by Antoine Pitrou in :issue:`16500`.)
ru: :c:func:`PyOS_AfterFork` устарел. Вместо этого используйте :c:func:`PyOS_BeforeFork`, :c:func:`PyOS_AfterFork_Parent` или :c:func:`PyOS_AfterFork_Child()`. (Предоставлено Антуаном Питру в :issue:`16500`.)

source: Platform Support Removals
ru: Удаление поддержки платформы

source: FreeBSD 9 and older are no longer officially supported.
ru: FreeBSD 9 и более ранние версии официально больше не поддерживаются.

source: For full Unicode support, including within extension modules, \*nix platforms are now expected to provide at least one of ``C.UTF-8`` (full locale), ``C.utf8`` (full locale) or ``UTF-8`` (``LC_CTYPE``-only locale) as an alternative to the legacy ``ASCII``-based ``C`` locale.
ru: Для полной поддержки Unicode, в том числе в модулях расширения, платформы \*nix теперь должны предоставлять как минимум один из ``C.UTF-8`` (полный языковой стандарт), ``C.utf8`` (полный языковой стандарт) или ``C.utf8`` (полный языковой стандарт) или ``C.UTF-8`` (полный языковой стандарт) `UTF-8`` (только локаль ``LC_CTYPE``) как альтернатива устаревшей локали ``ASCII`` на основе ``C``.

source: OpenSSL 0.9.8 and 1.0.1 are no longer supported, which means building CPython 3.7 with SSL/TLS support on older platforms still using these versions requires custom build options that link to a more recent version of OpenSSL.
ru: OpenSSL 0.9.8 и 1.0.1 больше не поддерживаются, а это означает, что для сборки CPython 3.7 с поддержкой SSL/TLS на старых платформах, которые все еще используют эти версии, требуются специальные параметры сборки, связанные с более поздней версией OpenSSL.

source: Notably, this issue affects the Debian 8 (aka "jessie") and Ubuntu 14.04 (aka "Trusty") LTS Linux distributions, as they still use OpenSSL 1.0.1 by default.
ru: Примечательно, что эта проблема затрагивает дистрибутивы Debian 8 (также известные как «Джесси») и Ubuntu 14.04 (также известные как «Надежный») LTS Linux, поскольку они по-прежнему используют OpenSSL 1.0.1 по умолчанию.

source: Debian 9 ("stretch") and Ubuntu 16.04 ("xenial"), as well as recent releases of other LTS Linux releases (e.g. RHEL/CentOS 7.5, SLES 12-SP3), use OpenSSL 1.0.2 or later, and remain supported in the default build configuration.
ru: Debian 9 («stretch») и Ubuntu 16.04 («xenial»), а также недавние выпуски других выпусков LTS Linux (например, RHEL/CentOS 7.5, SLES 12-SP3) используют OpenSSL 1.0.2 или новее и продолжают поддерживаться. в конфигурации сборки по умолчанию.

source: CPython's own `CI configuration file <https://github.com/python/cpython/blob/v3.7.13/.travis.yml>`_ provides an example of using the SSL :source:`compatibility testing infrastructure <Tools/ssl/multissltests.py>` in CPython's test suite to build and link against OpenSSL 1.1.0 rather than an outdated system provided OpenSSL.
ru: Собственный `файл конфигурации CI CPython <https://github.com/python/cpython/blob/v3.7.13/.travis.yml>`_ представляет собой пример использования инфраструктуры тестирования совместимости SSL <Tools/ssl /multissltests.py>` в наборе тестов CPython для сборки и связывания с OpenSSL 1.1.0, а не с устаревшей системой, предоставляющей OpenSSL.

source: API and Feature Removals
ru: Удаление API и функций

source: The following features and APIs have been removed from Python 3.7:
ru: Следующие функции и API были удалены из Python 3.7:

source: The ``os.stat_float_times()`` function has been removed. It was introduced in Python 2.3 for backward compatibility with Python 2.2, and was deprecated since Python 3.1.
ru: Функция ``os.stat_float_times()`` была удалена. Он был введен в Python 2.3 для обратной совместимости с Python 2.2 и устарел с Python 3.1.

source: Unknown escapes consisting of ``'\'`` and an ASCII letter in replacement templates for :func:`re.sub` were deprecated in Python 3.5, and will now cause an error.
ru: Неизвестные escape-символы, состоящие из ``'\'`` и буквы ASCII в шаблонах замены :func:`re.sub`, устарели в Python 3.5 и теперь вызывают ошибку.

source: Removed support of the *exclude* argument in :meth:`tarfile.TarFile.add`. It was deprecated in Python 2.7 and 3.2. Use the *filter* argument instead.
ru: Удалена поддержка аргумента *exclude* в :meth:`tarfile.TarFile.add`. Он устарел в Python 2.7 и 3.2. Вместо этого используйте аргумент *filter*.

source: The :func:`!ntpath.splitunc` function was deprecated in Python 3.1, and has now been removed. Use :func:`~os.path.splitdrive` instead.
ru: Функция :func:`!ntpath.splitunc` устарела в Python 3.1 и теперь удалена. Вместо этого используйте :func:`~os.path.splitdrive`.

source: :func:`collections.namedtuple` no longer supports the *verbose* parameter or ``_source`` attribute which showed the generated source code for the named tuple class. This was part of an optimization designed to speed-up class creation. (Contributed by Jelle Zijlstra with further improvements by INADA Naoki, Serhiy Storchaka, and Raymond Hettinger in :issue:`28638`.)
ru: :func:`collections.namedtuple` больше не поддерживает параметр *verbose* или атрибут ``_source``, который отображал сгенерированный исходный код для именованного класса кортежа. Это было частью оптимизации, призванной ускорить создание классов. (Внесено Йелле Зийлстра, дальнейшие улучшения внесены INADA Naoki, Сергеем Сторчакой и Раймондом Хеттингером в :issue:`28638`.)

source: Functions :func:`bool`, :func:`float`, :func:`list` and :func:`tuple` no longer take keyword arguments. The first argument of :func:`int` can now be passed only as positional argument.
ru: Функции :func:`bool`, :func:`float`, :func:`list` и :func:`tuple` больше не принимают ключевые слова в качестве аргументов. Первый аргумент :func:`int` теперь можно передавать только как позиционный аргумент.

source: Removed previously deprecated in Python 2.4 classes ``Plist``, ``Dict`` and ``_InternalDict`` in the :mod:`plistlib` module. Dict values in the result of functions :func:`~plistlib.readPlist` and :func:`~plistlib.readPlistFromBytes` are now normal dicts. You no longer can use attribute access to access items of these dictionaries.
ru: В модуле :mod:`plistlib` удалены ранее устаревшие классы Python 2.4 ``Plist``, ``Dict`` и ``_InternalDict``. Значения Dict в результате функций :func:`~plistlib.readPlist` и :func:`~plistlib.readPlistFromBytes` теперь являются обычными словарями. Вы больше не можете использовать доступ к атрибутам для доступа к элементам этих словарей.

source: The ``asyncio.windows_utils.socketpair()`` function has been removed. Use the :func:`socket.socketpair` function instead, it is available on all platforms since Python 3.5. ``asyncio.windows_utils.socketpair`` was just an alias to ``socket.socketpair`` on Python 3.5 and newer.
ru: Функция asyncio.windows_utils.socketpair() была удалена. Вместо этого используйте функцию :func:`socket.socketpair`, она доступна на всех платформах, начиная с Python 3.5. ``asyncio.windows_utils.socketpair`` был просто псевдонимом ``socket.socketpair`` в Python 3.5 и новее.

source: :mod:`asyncio` no longer exports the :mod:`selectors` and :mod:`!_overlapped` modules as ``asyncio.selectors`` and ``asyncio._overlapped``. Replace ``from asyncio import selectors`` with ``import selectors``.
ru: :mod:`asyncio` больше не экспортирует модули :mod:`selectors` и :mod:`!_overlapped` как ``asyncio.selectors`` и ``asyncio._overlapped``. Замените «селекторы импорта из asyncio» на «селекторы импорта».

source: Direct instantiation of :class:`ssl.SSLSocket` and :class:`ssl.SSLObject` objects is now prohibited. The constructors were never documented, tested, or designed as public constructors. Users were supposed to use :func:`ssl.wrap_socket` or :class:`ssl.SSLContext`. (Contributed by Christian Heimes in :issue:`32951`.)
ru: Прямое создание объектов :class:`ssl.SSLSocket` и :class:`ssl.SSLObject` теперь запрещено. Конструкторы никогда не документировались, не тестировались и не разрабатывались как общедоступные конструкторы. Пользователи должны были использовать :func:`ssl.wrap_socket` или :class:`ssl.SSLContext`. (Предоставлено Кристианом Хаймсом в :issue:`32951`.)

source: The unused ``distutils`` ``install_misc`` command has been removed. (Contributed by Eric N. Vander Weele in :issue:`29218`.)
ru: Неиспользуемая команда distutils ``install_misc`` была удалена. (Предоставлено Эриком Н. Вандером Вилом в :issue:`29218`.)

source: Module Removals
ru: Удаление модулей

source: The ``fpectl`` module has been removed. It was never enabled by default, never worked correctly on x86-64, and it changed the Python ABI in ways that caused unexpected breakage of C extensions. (Contributed by Nathaniel J. Smith in :issue:`29137`.)
ru: Модуль ``fpectl`` был удален. Он никогда не был включен по умолчанию, никогда не работал корректно на x86-64 и изменял ABI Python таким образом, что приводил к неожиданной поломке расширений C. (Предоставлено Натаниэлем Дж. Смитом в :issue:`29137`.)

source: Windows-only Changes
ru: Изменения только для Windows

source: The python launcher, (py.exe), can accept 32 & 64 bit specifiers **without** having to specify a minor version as well. So ``py -3-32`` and ``py -3-64`` become valid as well as ``py -3.7-32``, also the -*m*-64 and -*m.n*-64 forms are now accepted to force 64 bit python even if 32 bit would have otherwise been used. If the specified version is not available py.exe will error exit. (Contributed by Steve Barnes in :issue:`30291`.)
ru: Средство запуска Python (py.exe) может принимать 32- и 64-битные спецификаторы **без** необходимости указывать также дополнительную версию. Таким образом, ``py -3-32`` и ``py -3-64`` становятся действительными, а также ``py -3.7-32``, а также -*m*-64 и -*mn*-64. формы теперь принимаются для принудительного использования 64-битного Python, даже если в противном случае использовался бы 32-битный. Если указанная версия недоступна, py.exe завершит работу по ошибке. (Предоставлено Стивом Барнсом в :issue:`30291`.)

source: The launcher can be run as ``py -0`` to produce a list of the installed pythons, *with default marked with an asterisk*. Running ``py -0p`` will include the paths. If py is run with a version specifier that cannot be matched it will also print the *short form* list of available specifiers. (Contributed by Steve Barnes in :issue:`30362`.)
ru: Программу запуска можно запустить как ``py -0`` для создания списка установленных питонов, *по умолчанию отмечено звездочкой*. Запуск ``py -0p`` включит пути. Если py запускается со спецификатором версии, который не может быть сопоставлен, он также распечатает *краткий* список доступных спецификаторов. (Предоставлено Стивом Барнсом в :issue:`30362`.)

source: Porting to Python 3.7
ru: Портирование на Python 3.7

source: This section lists previously described changes and other bugfixes that may require changes to your code.
ru: В этом разделе перечислены ранее описанные изменения и другие исправления ошибок, которые могут потребовать внесения изменений в ваш код.

source: Changes in Python Behavior
ru: Изменения в поведении Python

source: :keyword:`async` and :keyword:`await` names are now reserved keywords. Code using these names as identifiers will now raise a :exc:`SyntaxError`. (Contributed by Jelle Zijlstra in :issue:`30406`.)
ru: Имена :keyword:`async` и :keyword:`await` теперь являются зарезервированными ключевыми словами. Код, использующий эти имена в качестве идентификаторов, теперь будет вызывать ошибку :exc:`SyntaxError`. (Предоставлено Джелле Зийлстра в :issue:`30406`.)

source: :pep:`479` is enabled for all code in Python 3.7, meaning that :exc:`StopIteration` exceptions raised directly or indirectly in coroutines and generators are transformed into :exc:`RuntimeError` exceptions. (Contributed by Yury Selivanov in :issue:`32670`.)
ru: :pep:`479` включен для всего кода в Python 3.7, а это означает, что исключения :exc:`StopIteration`, возникающие прямо или косвенно в сопрограммах и генераторах, преобразуются в исключения :exc:`RuntimeError`. (Добавлен Юрием Селивановым в :issue:`32670`.)

source: :meth:`object.__aiter__` methods can no longer be declared as asynchronous. (Contributed by Yury Selivanov in :issue:`31709`.)
ru: Методы :meth:`object.__aiter__` больше нельзя объявлять как асинхронные. (Добавлен Юрием Селивановым в :issue:`31709`.)

source: Due to an oversight, earlier Python versions erroneously accepted the following syntax::
ru: Из-за недосмотра более ранние версии Python ошибочно принимали следующий синтаксис:

source: Python 3.7 now correctly raises a :exc:`SyntaxError`, as a generator expression always needs to be directly inside a set of parentheses and cannot have a comma on either side, and the duplication of the parentheses can be omitted only on calls. (Contributed by Serhiy Storchaka in :issue:`32012` and :issue:`32023`.)
ru: Python 3.7 теперь правильно вызывает :exc:`SyntaxError`, поскольку выражение генератора всегда должно находиться непосредственно внутри набора круглых скобок и не может иметь запятую с обеих сторон, а дублирование круглых скобок можно опустить только при вызовах. (Внесено Сергеем Сторчакой в ​​:issue:`32012` и :issue:`32023`.)
