Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/whatsnew/3.7.po
Languages: ru

source: What's New In Python 3.7
ru: Что нового в Python 3.7

source: Editor
ru: Редактор

source: This article explains the new features in Python 3.7, compared to 3.6. Python 3.7 was released on June 27, 2018. For full details, see the :ref:`changelog <changelog>`.
ru: В этой статье объясняются новые возможности Python 3.7 по сравнению с версией 3.6. Python 3.7 был выпущен 27 июня 2018 г. Подробную информацию см. в журнале изменений <changelog>`.

source: Summary -- Release Highlights
ru: Резюме: основные моменты выпуска

source: New syntax features:
ru: Новые возможности синтаксиса:

source: :ref:`PEP 563 <whatsnew37-pep563>`, postponed evaluation of type annotations.
ru: :ref:`PEP 563 <whatsnew37-pep563>`, отложенная оценка аннотаций типов.

source: Backwards incompatible syntax changes:
ru: Изменения синтаксиса обратной несовместимости:

source: :keyword:`async` and :keyword:`await` are now reserved keywords.
ru: :keyword:`async` и :keyword:`await` теперь являются зарезервированными ключевыми словами.

source: New library modules:
ru: Новые библиотечные модули:

source: :mod:`contextvars`: :ref:`PEP 567 -- Context Variables <whatsnew37-pep567>`
ru: :mod:`contextvars`: :ref:`PEP 567 -- Переменные контекста <whatsnew37-pep567>`

source: :mod:`dataclasses`: :ref:`PEP 557 -- Data Classes <whatsnew37-pep557>`
ru: :mod:`dataclasses`: :ref:`PEP 557 -- Классы данных <whatsnew37-pep557>`

source: New built-in features:
ru: Новые встроенные функции:

source: :ref:`PEP 553 <whatsnew37-pep553>`, the new :func:`breakpoint` function.
ru: :ref:`PEP 553 <whatsnew37-pep553>`, новая функция :func:`breakpoint`.

source: Python data model improvements:
ru: Улучшения модели данных Python:

source: :ref:`PEP 562 <whatsnew37-pep562>`, customization of access to module attributes.
ru: :ref:`PEP 562 <whatsnew37-pep562>`, настройка доступа к атрибутам модуля.

source: :ref:`PEP 560 <whatsnew37-pep560>`, core support for typing module and generic types.
ru: :ref:`PEP 560 <whatsnew37-pep560>`, основная поддержка модуля типизации и универсальных типов.

source: the insertion-order preservation nature of :ref:`dict <typesmapping>` objects `has been declared`_ to be an official part of the Python language spec.
ru: природа сохранения порядка вставки объектов :ref:`dict <typesmapping>` была объявлена ​​`_ официальной частью спецификации языка Python.

source: Significant improvements in the standard library:
ru: Значительные улучшения в стандартной библиотеке:

source: The :mod:`asyncio` module has received new features, significant :ref:`usability and performance improvements <whatsnew37_asyncio>`.
ru: Модуль :mod:`asyncio` получил новые функции, значительные улучшения :ref:`удобства использования и производительности <whatsnew37_asyncio>`.

source: The :mod:`time` module gained support for :ref:`functions with nanosecond resolution <whatsnew37-pep564>`.
ru: Модуль :mod:`time` получил поддержку :ref:`функций с наносекундным разрешением <whatsnew37-pep564>`.

source: CPython implementation improvements:
ru: Улучшения в реализации CPython:

source: Avoiding the use of ASCII as a default text encoding:
ru: Отказ от использования ASCII в качестве кодировки текста по умолчанию:

source: :ref:`PEP 538 <whatsnew37-pep538>`, legacy C locale coercion
ru: :ref:`PEP 538 <whatsnew37-pep538>`, устаревшее приведение локали C

source: :ref:`PEP 540 <whatsnew37-pep540>`, forced UTF-8 runtime mode
ru: :ref:`PEP 540 <whatsnew37-pep540>`, принудительный режим выполнения UTF-8

source: :ref:`PEP 552 <whatsnew37-pep552>`, deterministic .pycs
ru: :ref:`PEP 552 <whatsnew37-pep552>`, детерминированный .pycs

source: :ref:`New Python Development Mode <whatsnew37-devmode>`
ru: :ref:`Новый режим разработки Python <whatsnew37-devmode>`

source: :ref:`PEP 565 <whatsnew37-pep565>`, improved :exc:`DeprecationWarning` handling
ru: :ref:`PEP 565 <whatsnew37-pep565>`, улучшена обработка :exc:`DeprecationWarning`

source: C API improvements:
ru: Улучшения в C API:

source: :ref:`PEP 539 <whatsnew37-pep539>`, new C API for thread-local storage
ru: :ref:`PEP 539 <whatsnew37-pep539>`, новый C API для локального хранилища потоков

source: Documentation improvements:
ru: Улучшение документации:

source: :ref:`PEP 545 <whatsnew37-pep545>`, Python documentation translations
ru: :ref:`PEP 545 <whatsnew37-pep545>`, переводы документации Python

source: New documentation translations: `Japanese <https://docs.python.org/ja/>`_, `French <https://docs.python.org/fr/>`_, and `Korean <https://docs.python.org/ko/>`_.
ru: Новые переводы документации: `_ японский <https://docs.python.org/ja/>`_, `французский <https://docs.python.org/fr/>`_ и `корейский <https:// docs.python.org/ko/>`_.

source: This release features notable performance improvements in many areas. The :ref:`whatsnew37-perf` section lists them in detail.
ru: Этот выпуск содержит заметные улучшения производительности во многих областях. В разделе :ref:`whatsnew37-perf` они перечислены подробно.

source: For a list of changes that may affect compatibility with previous Python releases please refer to the :ref:`porting-to-python-37` section.
ru: Список изменений, которые могут повлиять на совместимость с предыдущими выпусками Python, см. в разделе :ref:`porting-to-python-37`.

source: New Features
ru: Новые особенности

source: PEP 563: Postponed Evaluation of Annotations
ru: PEP 563: Отложенная оценка аннотаций

source: The advent of type hints in Python uncovered two glaring usability issues with the functionality of annotations added in :pep:`3107` and refined further in :pep:`526`:
ru: Появление подсказок типов в Python выявило две явные проблемы с удобством использования функциональности аннотаций, добавленных в :pep:`3107` и доработанных в :pep:`526`:

source: annotations could only use names which were already available in the current scope, in other words they didn't support forward references of any kind; and
ru: аннотации могли использовать только имена, которые уже были доступны в текущей области, другими словами, они не поддерживали никаких прямых ссылок; и

source: annotating source code had adverse effects on startup time of Python programs.
ru: аннотирование исходного кода отрицательно сказалось на времени запуска программ Python.

source: Both of these issues are fixed by postponing the evaluation of annotations. Instead of compiling code which executes expressions in annotations at their definition time, the compiler stores the annotation in a string form equivalent to the AST of the expression in question. If needed, annotations can be resolved at runtime using :func:`typing.get_type_hints`. In the common case where this is not required, the annotations are cheaper to store (since short strings are interned by the interpreter) and make startup time faster.
ru: Обе эти проблемы решаются путем отсрочки оценки аннотаций. Вместо компиляции кода, который выполняет выражения в аннотациях во время их определения, компилятор сохраняет аннотацию в строковой форме, эквивалентной AST рассматриваемого выражения. При необходимости аннотации можно разрешить во время выполнения с помощью :func:`typing.get_type_hints`. В обычном случае, когда это не требуется, аннотации дешевле хранить (поскольку короткие строки интерпретируются интерпретатором) и ускоряют время запуска.

source: Usability-wise, annotations now support forward references, making the following syntax valid::
ru: С точки зрения удобства использования аннотации теперь поддерживают прямые ссылки, что делает допустимым следующий синтаксис:

source: Since this change breaks compatibility, the new behavior needs to be enabled on a per-module basis in Python 3.7 using a :mod:`__future__` import::
ru: Поскольку это изменение нарушает совместимость, новое поведение необходимо включить для каждого модуля в Python 3.7 с помощью :mod:`__future__` import::

source: It will become the default in Python 3.10.
ru: В Python 3.10 он станет значением по умолчанию.

source: :pep:`563` -- Postponed evaluation of annotations
ru: :pep:`563` -- Отложенная оценка аннотаций

source: PEP written and implemented by Łukasz Langa.
ru: PEP написан и реализован Лукашом Лангой.

source: PEP 538: Legacy C Locale Coercion
ru: PEP 538: устаревшее принуждение локали C

source: An ongoing challenge within the Python 3 series has been determining a sensible default strategy for handling the "7-bit ASCII" text encoding assumption currently implied by the use of the default C or POSIX locale on non-Windows platforms.
ru: Постоянной проблемой в серии Python 3 было определение разумной стратегии по умолчанию для обработки предположения о кодировке текста «7-битный ASCII», которое в настоящее время подразумевается использованием локали C или POSIX по умолчанию на платформах, отличных от Windows.

source: :pep:`538` updates the default interpreter command line interface to automatically coerce that locale to an available UTF-8 based locale as described in the documentation of the new :envvar:`PYTHONCOERCECLOCALE` environment variable. Automatically setting ``LC_CTYPE`` this way means that both the core interpreter and locale-aware C extensions (such as :mod:`readline`) will assume the use of UTF-8 as the default text encoding, rather than ASCII.
ru: :pep:`538` обновляет интерфейс командной строки интерпретатора по умолчанию, чтобы автоматически привести эту локаль к доступной локали на основе UTF-8, как описано в документации новой переменной среды :envvar:`PYTHONCOERCECLOCALE`. Автоматическая установка LC_CTYPE таким образом означает, что как основной интерпретатор, так и расширения C с учетом локали (такие как :mod:`readline`) будут предполагать использование UTF-8 в качестве кодировки текста по умолчанию, а не ASCII.

source: The platform support definition in :pep:`11` has also been updated to limit full text handling support to suitably configured non-ASCII based locales.
ru: Определение поддержки платформы в :pep:`11` также было обновлено, чтобы ограничить поддержку полнотекстовой обработки правильно настроенными локалями, не основанными на ASCII.

source: As part of this change, the default error handler for :data:`~sys.stdin` and :data:`~sys.stdout` is now ``surrogateescape`` (rather than ``strict``) when using any of the defined coercion target locales (currently ``C.UTF-8``, ``C.utf8``, and ``UTF-8``). The default error handler for :data:`~sys.stderr` continues to be ``backslashreplace``, regardless of locale.
ru: В рамках этого изменения обработчиком ошибок по умолчанию для :data:`~sys.stdin` и :data:`~sys.stdout` теперь является ``surrogateescape`` (а не ``strict``) при использовании любого из определенные целевые локали приведения (в настоящее время C.UTF-8, C.utf8 и UTF-8). Обработчиком ошибок по умолчанию для :data:`~sys.stderr` продолжает оставаться ``backslashreplace``, независимо от локали.

source: Locale coercion is silent by default, but to assist in debugging potentially locale related integration problems, explicit warnings (emitted directly on :data:`~sys.stderr`) can be requested by setting ``PYTHONCOERCECLOCALE=warn``. This setting will also cause the Python runtime to emit a warning if the legacy C locale remains active when the core interpreter is initialized.
ru: По умолчанию принуждение к локали происходит беззвучно, но для помощи в отладке потенциально связанных с локалью проблем интеграции можно запросить явные предупреждения (выдаваемые непосредственно в :data:`~sys.stderr`), установив ``PYTHONCOERCECLOCALE=warn``. Этот параметр также приведет к тому, что среда выполнения Python выдаст предупреждение, если устаревшая локаль C остается активной при инициализации основного интерпретатора.

source: While :pep:`538`'s locale coercion has the benefit of also affecting extension modules (such as GNU ``readline``), as well as child processes (including those running non-Python applications and older versions of Python), it has the downside of requiring that a suitable target locale be present on the running system. To better handle the case where no suitable target locale is available (as occurs on RHEL/CentOS 7, for example), Python 3.7 also implements :ref:`whatsnew37-pep540`.
ru: Хотя принуждение локали :pep:`538` имеет то преимущество, что оно также влияет на модули расширения (такие как GNU ``readline``), а также на дочерние процессы (включая те, которые запускают приложения, отличные от Python, и более старые версии Python), у него есть обратная сторона: требуется, чтобы в работающей системе присутствовала подходящая целевая локаль. Чтобы лучше обрабатывать случай, когда подходящая целевая локаль недоступна (как это происходит, например, в RHEL/CentOS 7), Python 3.7 также реализует :ref:`whatsnew37-pep540`.

source: :pep:`538` -- Coercing the legacy C locale to a UTF-8 based locale
ru: :pep:`538` -- Приведение устаревшей локали C к локали на основе UTF-8.

source: PEP written and implemented by Nick Coghlan.
ru: PEP написан и реализован Ником Когланом.

source: PEP 540: Forced UTF-8 Runtime Mode
ru: PEP 540: принудительный режим выполнения UTF-8

source: The new :option:`-X` ``utf8`` command line option and :envvar:`PYTHONUTF8` environment variable can be used to enable the :ref:`Python UTF-8 Mode <utf8-mode>`.
ru: Новый параметр командной строки :option:`-X` ``utf8`` и переменная среды :envvar:`PYTHONUTF8` могут использоваться для включения режима :ref:`Python UTF-8 <utf8-mode>`.

source: When in UTF-8 mode, CPython ignores the locale settings, and uses the UTF-8 encoding by default. The error handlers for :data:`sys.stdin` and :data:`sys.stdout` streams are set to ``surrogateescape``.
ru: В режиме UTF-8 CPython игнорирует настройки локали и по умолчанию использует кодировку UTF-8. Обработчики ошибок для потоков :data:`sys.stdin` и :data:`sys.stdout` установлены в ``surrogateescape``.

source: The forced UTF-8 mode can be used to change the text handling behavior in an embedded Python interpreter without changing the locale settings of an embedding application.
ru: Принудительный режим UTF-8 можно использовать для изменения поведения обработки текста во встроенном интерпретаторе Python без изменения настроек локали внедряемого приложения.

source: While :pep:`540`'s UTF-8 mode has the benefit of working regardless of which locales are available on the running system, it has the downside of having no effect on extension modules (such as GNU ``readline``), child processes running non-Python applications, and child processes running older versions of Python. To reduce the risk of corrupting text data when communicating with such components, Python 3.7 also implements :ref:`whatsnew37-pep540`).
ru: Хотя режим UTF-8 в :pep:`540` имеет то преимущество, что работает независимо от того, какие локали доступны в работающей системе, у него есть и обратная сторона: он не влияет на модули расширения (такие как GNU ``readline``). , дочерние процессы, выполняющие приложения, отличные от Python, и дочерние процессы, выполняющие более старые версии Python. Чтобы снизить риск повреждения текстовых данных при взаимодействии с такими компонентами, Python 3.7 также реализует :ref:`whatsnew37-pep540`).

source: The UTF-8 mode is enabled by default when the locale is ``C`` or ``POSIX``, and the :pep:`538` locale coercion feature fails to change it to a UTF-8 based alternative (whether that failure is due to ``PYTHONCOERCECLOCALE=0`` being set, ``LC_ALL`` being set, or the lack of a suitable target locale).
ru: Режим UTF-8 включается по умолчанию, когда языковым стандартом является ``C`` или ``POSIX``, а функция приведения локали :pep:`538` не может изменить его на альтернативу на основе UTF-8 (независимо от того, сбой вызван установкой ``PYTHONCOERCECLOCALE=0``, установкой ``LC_ALL`` или отсутствием подходящей целевой локали).

source: :pep:`540` -- Add a new UTF-8 mode
ru: :pep:`540` -- Добавьте новый режим UTF-8.

source: PEP written and implemented by Victor Stinner
ru: PEP написан и реализован Виктором Стиннером

source: PEP 553: Built-in ``breakpoint()``
ru: PEP 553: встроенная ``breakpoint()``

source: Python 3.7 includes the new built-in :func:`breakpoint` function as an easy and consistent way to enter the Python debugger.
ru: Python 3.7 включает новую встроенную функцию :func:`breakpoint` как простой и последовательный способ входа в отладчик Python.

source: Built-in ``breakpoint()`` calls :func:`sys.breakpointhook`. By default, the latter imports :mod:`pdb` and then calls ``pdb.set_trace()``, but by binding ``sys.breakpointhook()`` to the function of your choosing, ``breakpoint()`` can enter any debugger. Additionally, the environment variable :envvar:`PYTHONBREAKPOINT` can be set to the callable of your debugger of choice. Set ``PYTHONBREAKPOINT=0`` to completely disable built-in ``breakpoint()``.
ru: Встроенная ``breakpoint()`` вызывает :func:`sys.breakpointhook`. По умолчанию последний импортирует :mod:`pdb`, а затем вызывает ``pdb.set_trace()``, но путем привязки ``sys.breakpointhook()`` к выбранной вами функции ``breakpoint()` `может войти в любой отладчик. Кроме того, переменная среды :envvar:`PYTHONBREAKPOINT` может быть установлена ​​в вызываемый объект выбранного вами отладчика. Установите PYTHONBREAKPOINT=0, чтобы полностью отключить встроенную точку останова().

source: :pep:`553` -- Built-in breakpoint()
ru: :pep:`553` -- Встроенная точка останова()

source: PEP written and implemented by Barry Warsaw
ru: PEP написан и реализован Барри Варшавой

source: PEP 539: New C API for Thread-Local Storage
ru: PEP 539: новый C API для локального хранилища потоков

source: While Python provides a C API for thread-local storage support; the existing :ref:`Thread Local Storage (TLS) API <thread-local-storage-api>` has used :c:expr:`int` to represent TLS keys across all platforms. This has not generally been a problem for officially support platforms, but that is neither POSIX-compliant, nor portable in any practical sense.
ru: Хотя Python предоставляет C API для поддержки локального хранилища потоков; существующий :ref:`Thread Local Storage (TLS) API <thread-local-storage-api>` использует :c:expr:`int` для представления ключей TLS на всех платформах. Обычно это не является проблемой для официально поддерживаемых платформ, но это не является ни POSIX-совместимым, ни переносимым в каком-либо практическом смысле.

source: :pep:`539` changes this by providing a new :ref:`Thread Specific Storage (TSS) API <thread-specific-storage-api>` to CPython which supersedes use of the existing TLS API within the CPython interpreter, while deprecating the existing API. The TSS API uses a new type :c:type:`Py_tss_t` instead of :c:expr:`int` to represent TSS keys--an opaque type the definition of which may depend on the underlying TLS implementation. Therefore, this will allow to build CPython on platforms where the native TLS key is defined in a way that cannot be safely cast to :c:expr:`int`.
ru: :pep:`539` меняет это, предоставляя новый :ref:`Thread-Specific Storage (TSS) API <thread-special-storage-api>` для CPython, который заменяет использование существующего TLS API в интерпретаторе CPython, но при этом объявляется устаревшим. существующий API. API TSS использует новый тип :c:type:`Py_tss_t` вместо :c:expr:`int` для представления ключей TSS — непрозрачный тип, определение которого может зависеть от базовой реализации TLS. Следовательно, это позволит создавать CPython на платформах, где собственный ключ TLS определен таким образом, что его невозможно безопасно привести к :c:expr:`int`.

source: Note that on platforms where the native TLS key is defined in a way that cannot be safely cast to :c:expr:`int`, all functions of the existing TLS API will be no-op and immediately return failure. This indicates clearly that the old API is not supported on platforms where it cannot be used reliably, and that no effort will be made to add such support.
ru: Обратите внимание, что на платформах, где собственный ключ TLS определен таким образом, что его нельзя безопасно привести к :c:expr:`int`, все функции существующего API TLS будут неактивными и немедленно вернут ошибку. Это ясно указывает на то, что старый API не поддерживается на платформах, где его нельзя надежно использовать, и что никаких усилий по добавлению такой поддержки предприниматься не будет.

source: :pep:`539` -- A New C-API for Thread-Local Storage in CPython
ru: :pep:`539` -- Новый C-API для локального хранилища потоков в CPython

source: PEP written by Erik M. Bray; implementation by Masayuki Yamamoto.
ru: PEP, написанный Эриком М. Бреем; реализация Масаюки Ямамото.

source: PEP 562: Customization of Access to Module Attributes
ru: PEP 562: настройка доступа к атрибутам модуля

source: Python 3.7 allows defining :meth:`__getattr__` on modules and will call it whenever a module attribute is otherwise not found. Defining :meth:`__dir__` on modules is now also allowed.
ru: Python 3.7 позволяет определять :meth:`__getattr__` для модулей и будет вызывать его всякий раз, когда атрибут модуля не найден. Определение :meth:`__dir__` для модулей теперь также разрешено.

source: A typical example of where this may be useful is module attribute deprecation and lazy loading.
ru: Типичным примером того, где это может быть полезно, является устаревание атрибутов модуля и отложенная загрузка.

source: :pep:`562` -- Module ``__getattr__`` and ``__dir__``
ru: :pep:`562` -- Модуль ``__getattr__`` и ``__dir__``

source: PEP written and implemented by Ivan Levkivskyi
ru: PEP написан и реализован Иваном Левкивским.

source: PEP 564: New Time Functions With Nanosecond Resolution
ru: PEP 564: новые функции времени с наносекундным разрешением

source: The resolution of clocks in modern systems can exceed the limited precision of a floating-point number returned by the :func:`time.time` function and its variants. To avoid loss of precision, :pep:`564` adds six new "nanosecond" variants of the existing timer functions to the :mod:`time` module:
ru: Разрешение часов в современных системах может превышать ограниченную точность числа с плавающей запятой, возвращаемого функцией :func:`time.time` и ее вариантами. Чтобы избежать потери точности, :pep:`564` добавляет в модуль :mod:`time` шесть новых "наносекундных" вариантов существующих функций таймера:

source: The new functions return the number of nanoseconds as an integer value.
ru: Новые функции возвращают количество наносекунд в виде целочисленного значения.

source: :pep:`Measurements <0564#annex-clocks-resolution-in-python>` show that on Linux and Windows the resolution of :func:`time.time_ns` is approximately 3 times better than that of :func:`time.time`.
ru: :pep:`Измерения <0564#annex-locks-solve-in-python>` показывают, что в Linux и Windows разрешение :func:`time.time_ns` примерно в 3 раза лучше, чем у :func:`time. время`.

source: :pep:`564` -- Add new time functions with nanosecond resolution
ru: :pep:`564` -- Добавлены новые функции времени с наносекундным разрешением.

source: PEP 565: Show DeprecationWarning in ``__main__``
ru: PEP 565: показывать предупреждение об устаревании в ``__main__``
