Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/whatsnew/3.7.po
Languages: ru

source: The new :meth:`StreamWriter.wait_closed() <asyncio.StreamWriter.wait_closed>` coroutine method allows waiting until the stream writer is closed. The new :meth:`StreamWriter.is_closing() <asyncio.StreamWriter.is_closing>` method can be used to determine if the writer is closing. (Contributed by Andrew Svetlov in :issue:`32391`.)
ru: Новый метод сопрограммы :meth:`StreamWriter.wait_closed() <asyncio.StreamWriter.wait_closed>` позволяет ждать, пока средство записи потока не закроется. Новый метод :meth:`StreamWriter.is_closing() <asyncio.StreamWriter.is_closing>` можно использовать для определения того, закрывается ли средство записи. (Предоставлено Андреем Светловым в :issue:`32391`.)

source: The new :meth:`loop.sock_sendfile() <asyncio.loop.sock_sendfile>` coroutine method allows sending files using :mod:`os.sendfile` when possible. (Contributed by Andrew Svetlov in :issue:`32410`.)
ru: Новый метод сопрограммы :meth:`loop.sock_sendfile() <asyncio.loop.sock_sendfile>` позволяет отправлять файлы с использованием :mod:`os.sendfile`, когда это возможно. (Предоставлено Андреем Светловым в :issue:`32410`.)

source: The new :meth:`Future.get_loop() <asyncio.Future.get_loop>` and ``Task.get_loop()`` methods return the instance of the loop on which a task or a future were created. :meth:`Server.get_loop() <asyncio.Server.get_loop>` allows doing the same for :class:`asyncio.Server` objects. (Contributed by Yury Selivanov in :issue:`32415` and Srinivas Reddy Thatiparthy in :issue:`32418`.)
ru: Новые методы :meth:`Future.get_loop() <asyncio.Future.get_loop>` и ``Task.get_loop()`` возвращают экземпляр цикла, в котором была создана задача или будущее. :meth:`Server.get_loop() <asyncio.Server.get_loop>` позволяет делать то же самое для объектов :class:`asyncio.Server`. (Предоставлено Юрием Селивановым в :issue:`32415` и Шринивасом Редди Татипарти в :issue:`32418`.)

source: It is now possible to control how instances of :class:`asyncio.Server` begin serving. Previously, the server would start serving immediately when created. The new *start_serving* keyword argument to :meth:`loop.create_server() <asyncio.loop.create_server>` and :meth:`loop.create_unix_server() <asyncio.loop.create_unix_server>`, as well as :meth:`Server.start_serving() <asyncio.Server.start_serving>`, and :meth:`Server.serve_forever() <asyncio.Server.serve_forever>` can be used to decouple server instantiation and serving. The new :meth:`Server.is_serving() <asyncio.Server.is_serving>` method returns ``True`` if the server is serving. :class:`~asyncio.Server` objects are now asynchronous context managers::
ru: Теперь можно контролировать, как начинают обслуживаться экземпляры :class:`asyncio.Server`. Раньше сервер начинал обслуживаться сразу после создания. Новый аргумент ключевого слова *start_serving* для :meth:`loop.create_server() <asyncio.loop.create_server>` и :meth:`loop.create_unix_server() <asyncio.loop.create_unix_server>`, а также :meth: `Server.start_serving() <asyncio.Server.start_serving>` и :meth:`Server.serve_forever() <asyncio.Server.serve_forever>` можно использовать для разделения создания и обслуживания сервера. Новый метод :meth:`Server.is_serving() <asyncio.Server.is_serving>` возвращает ``True``, если сервер обслуживает. Объекты :class:`~asyncio.Server` теперь являются асинхронными менеджерами контекста::

source: Callback objects returned by :func:`loop.call_later() <asyncio.loop.call_later>` gained the new :meth:`when() <asyncio.TimerHandle.when>` method which returns an absolute scheduled callback timestamp. (Contributed by Andrew Svetlov in :issue:`32741`.)
ru: Объекты обратного вызова, возвращаемые :func:`loop.call_later() <asyncio.loop.call_later>`, получили новый метод :meth:`when() <asyncio.TimerHandle.when>`, который возвращает абсолютную временную метку запланированного обратного вызова. (Предоставлено Андреем Светловым в :issue:`32741`.)

source: The :meth:`loop.create_datagram_endpoint() \ <asyncio.loop.create_datagram_endpoint>` method gained support for Unix sockets. (Contributed by Quentin Dawans in :issue:`31245`.)
ru: Метод :meth:`loop.create_datagram_endpoint() \ <asyncio.loop.create_datagram_endpoint>` получил поддержку сокетов Unix. (Предоставлено Квентином Давансом в :issue:`31245`.)

source: The :func:`asyncio.open_connection`, :func:`asyncio.start_server` functions, :meth:`loop.create_connection() <asyncio.loop.create_connection>`, :meth:`loop.create_server() <asyncio.loop.create_server>`, :meth:`loop.create_accepted_socket() <asyncio.loop.connect_accepted_socket>` methods and their corresponding UNIX socket variants now accept the *ssl_handshake_timeout* keyword argument. (Contributed by Neil Aspinall in :issue:`29970`.)
ru: Функции :func:`asyncio.open_connection`, :func:`asyncio.start_server`, :meth:`loop.create_connection() <asyncio.loop.create_connection>`, :meth:`loop.create_server() <asyncio. Методы loop.create_server>`, :meth:`loop.create_accepted_socket() <asyncio.loop.connect_accepted_socket>` и соответствующие им варианты сокетов UNIX теперь принимают аргумент ключевого слова *ssl_handshake_timeout*. (Предоставлено Нилом Аспиналлом в :issue:`29970`.)

source: The new :meth:`Handle.cancelled() <asyncio.Handle.cancelled>` method returns ``True`` if the callback was cancelled. (Contributed by Marat Sharafutdinov in :issue:`31943`.)
ru: Новый метод :meth:`Handle.cancelled() <asyncio.Handle.cancelled>` возвращает ``True``, если обратный вызов был отменен. (Предоставлено Маратом Шарафутдиновым в :issue:`31943`.)

source: The asyncio source has been converted to use the :keyword:`async`/:keyword:`await` syntax. (Contributed by Andrew Svetlov in :issue:`32193`.)
ru: Исходный код asyncio был преобразован для использования синтаксиса :keyword:`async`/:keyword:`await`. (Предоставлено Андреем Светловым в :issue:`32193`.)

source: The new :meth:`ReadTransport.is_reading() <asyncio.ReadTransport.is_reading>` method can be used to determine the reading state of the transport. Additionally, calls to :meth:`ReadTransport.resume_reading() <asyncio.ReadTransport.resume_reading>` and :meth:`ReadTransport.pause_reading() <asyncio.ReadTransport.pause_reading>` are now idempotent. (Contributed by Yury Selivanov in :issue:`32356`.)
ru: Новый метод :meth:`ReadTransport.is_reading() <asyncio.ReadTransport.is_reading>` можно использовать для определения состояния чтения транспорта. Кроме того, вызовы :meth:`ReadTransport.resume_reading() <asyncio.ReadTransport.resume_reading>` и :meth:`ReadTransport.pause_reading() <asyncio.ReadTransport.pause_reading>` теперь являются идемпотентными. (Добавлен Юрием Селивановым в :issue:`32356`.)

source: Loop methods which accept socket paths now support passing :term:`path-like objects <path-like object>`. (Contributed by Yury Selivanov in :issue:`32066`.)
ru: Методы цикла, которые принимают пути к сокетам, теперь поддерживают передачу :term:`path-like object <path-like object>`. (Добавлен Юрием Селивановым в :issue:`32066`.)

source: In :mod:`asyncio` TCP sockets on Linux are now created with ``TCP_NODELAY`` flag set by default. (Contributed by Yury Selivanov and Victor Stinner in :issue:`27456`.)
ru: В :mod:`asyncio` TCP-сокеты в Linux теперь создаются с флагом ``TCP_NODELAY``, установленным по умолчанию. (Предоставлено Юрием Селивановым и Виктором Стиннером в :issue:`27456`.)

source: Exceptions occurring in cancelled tasks are no longer logged. (Contributed by Yury Selivanov in :issue:`30508`.)
ru: Исключения, возникающие в отмененных задачах, больше не регистрируются. (Добавлен Юрием Селивановым в :issue:`30508`.)

source: New ``WindowsSelectorEventLoopPolicy`` and ``WindowsProactorEventLoopPolicy`` classes. (Contributed by Yury Selivanov in :issue:`33792`.)
ru: Новые классы WindowsSelectorEventLoopPolicy и WindowsProactorEventLoopPolicy. (Добавлен Юрием Селивановым в :issue:`33792`.)

source: Several ``asyncio`` APIs have been :ref:`deprecated <whatsnew37-asyncio-deprecated>`.
ru: Несколько ``asyncio`` API :ref:`устарели <whatsnew37-asyncio-deprecated>`.

source: The :func:`~binascii.b2a_uu` function now accepts an optional *backtick* keyword argument. When it's true, zeros are represented by ``'`'`` instead of spaces. (Contributed by Xiang Zhang in :issue:`30103`.)
ru: Функция :func:`~binascii.b2a_uu` теперь принимает необязательный аргумент ключевого слова *backtick*. Когда это правда, нули представлены ``'`'`` вместо пробелов. (Предоставлено Сян Чжаном в :issue:`30103`.)

source: calendar
ru: календарь

source: The :class:`~calendar.HTMLCalendar` class has new class attributes which ease the customization of CSS classes in the produced HTML calendar. (Contributed by Oz Tiram in :issue:`30095`.)
ru: Класс :class:`~calendar.HTMLCalendar` имеет новые атрибуты класса, которые упрощают настройку классов CSS в созданном календаре HTML. (Предоставлено Озом Тирамом в :issue:`30095`.)

source: collections
ru: коллекции

source: ``collections.namedtuple()`` now supports default values. (Contributed by Raymond Hettinger in :issue:`32320`.)
ru: ``collections.namedtuple()`` теперь поддерживает значения по умолчанию. (Предоставлено Рэймондом Хеттингером в :issue:`32320`.)

source: :func:`compileall.compile_dir` learned the new *invalidation_mode* parameter, which can be used to enable :ref:`hash-based .pyc invalidation <whatsnew37-pep552>`. The invalidation mode can also be specified on the command line using the new ``--invalidation-mode`` argument. (Contributed by Benjamin Peterson in :issue:`31650`.)
ru: :func:`compileall.compile_dir` узнал новый параметр *invalidation_mode*, который можно использовать для включения :ref:`инвалидации .pyc на основе хэша <whatsnew37-pep552>`. Режим недействительности также можно указать в командной строке, используя новый аргумент ``--invalidation-mode``. (Предоставлено Бенджамином Петерсоном в :issue:`31650`.)

source: :class:`ProcessPoolExecutor <concurrent.futures.ProcessPoolExecutor>` and :class:`ThreadPoolExecutor <concurrent.futures.ThreadPoolExecutor>` now support the new *initializer* and *initargs* constructor arguments. (Contributed by Antoine Pitrou in :issue:`21423`.)
ru: :class:`ProcessPoolExecutor <concurrent.futures.ProcessPoolExecutor>` и :class:`ThreadPoolExecutor <concurrent.futures.ThreadPoolExecutor>` теперь поддерживают новые аргументы конструктора *initializer* и *initargs*. (Предоставлено Антуаном Питру в :issue:`21423`.)

source: The :class:`ProcessPoolExecutor <concurrent.futures.ProcessPoolExecutor>` can now take the multiprocessing context via the new *mp_context* argument. (Contributed by Thomas Moreau in :issue:`31540`.)
ru: :class:`ProcessPoolExecutor <concurrent.futures.ProcessPoolExecutor>` теперь может принимать контекст многопроцессорной обработки через новый аргумент *mp_context*. (Предоставлено Томасом Моро в :issue:`31540`.)

source: The new :func:`~contextlib.nullcontext` is a simpler and faster no-op context manager than :class:`~contextlib.ExitStack`. (Contributed by Jesse-Bakker in :issue:`10049`.)
ru: Новый :func:`~contextlib.nullcontext` — это более простой и быстрый неактивный контекстный менеджер, чем :class:`~contextlib.ExitStack`. (Предоставлено Джесси-Баккером в :issue:`10049`.)

source: The new :func:`~contextlib.asynccontextmanager`, :class:`~contextlib.AbstractAsyncContextManager`, and :class:`~contextlib.AsyncExitStack` have been added to complement their synchronous counterparts. (Contributed by Jelle Zijlstra in :issue:`29679` and :issue:`30241`, and by Alexander Mohr and Ilya Kulakov in :issue:`29302`.)
ru: Новые :func:`~contextlib.asynccontextmanager`, :class:`~contextlib.AbstractAsyncContextManager` и :class:`~contextlib.AsyncExitStack` были добавлены в дополнение к своим синхронным аналогам. (Сообщено Йелле Зийлстра в :issue:`29679` и :issue:`30241`, а также Александром Мором и Ильей Кулаковым в :issue:`29302`.)

source: The :mod:`cProfile` command line now accepts ``-m module_name`` as an alternative to script path. (Contributed by Sanyam Khurana in :issue:`21862`.)
ru: Командная строка :mod:`cProfile` теперь принимает ``-m имя_модуля`` в качестве альтернативы пути к скрипту. (Предоставлено Саньямом Хураной в :issue:`21862`.)

source: The :mod:`!crypt` module now supports the Blowfish hashing method. (Contributed by Serhiy Storchaka in :issue:`31664`.)
ru: Модуль :mod:`!crypt` теперь поддерживает метод хеширования Blowfish. (Предоставлено Сергеем Сторчакой в ​​:issue:`31664`.)

source: The :func:`!mksalt` function now allows specifying the number of rounds for hashing. (Contributed by Serhiy Storchaka in :issue:`31702`.)
ru: Функция :func:`!mksalt` теперь позволяет указать количество раундов хеширования. (Предоставлено Сергеем Сторчакой в ​​:issue:`31702`.)

source: The new :meth:`datetime.fromisoformat() <datetime.datetime.fromisoformat>` method constructs a :class:`~datetime.datetime` object from a string in one of the formats output by :meth:`datetime.isoformat() <datetime.datetime.isoformat>`. (Contributed by Paul Ganssle in :issue:`15873`.)
ru: Новый метод :meth:`datetime.fromisoformat() <datetime.datetime.fromisoformat>` конструирует объект :class:`~datetime.datetime` из строки в одном из форматов, выводимых :meth:`datetime.isoformat( ) <datetime.datetime.isoformat>`. (Предоставлено Полом Гансслом в :issue:`15873`.)

source: The :class:`tzinfo <datetime.tzinfo>` class now supports sub-minute offsets. (Contributed by Alexander Belopolsky in :issue:`5288`.)
ru: Класс :class:`tzinfo <datetime.tzinfo>` теперь поддерживает субминутные смещения. (Предоставлено Александром Белопольским в :issue:`5288`.)

source: :mod:`dbm.dumb` now supports reading read-only files and no longer writes the index file when it is not changed.
ru: :mod:`dbm.dumb` теперь поддерживает чтение файлов, доступных только для чтения, и больше не записывает индексный файл, если он не изменен.

source: decimal
ru: десятичный

source: The :mod:`decimal` module now uses :ref:`context variables <whatsnew37-pep567>` to store the decimal context. (Contributed by Yury Selivanov in :issue:`32630`.)
ru: Модуль :mod:`decimal` теперь использует :ref:`контекстные переменные <whatsnew37-pep567>` для хранения десятичного контекста. (Добавлен Юрием Селивановым в :issue:`32630`.)

source: The :func:`~dis.dis` function is now able to disassemble nested code objects (the code of comprehensions, generator expressions and nested functions, and the code used for building nested classes). The maximum depth of disassembly recursion is controlled by the new *depth* parameter. (Contributed by Serhiy Storchaka in :issue:`11822`.)
ru: Функция :func:`~dis.dis` теперь способна дизассемблировать вложенные объекты кода (код понятий, выражений-генераторов и вложенных функций, а также код, используемый для построения вложенных классов). Максимальная глубина рекурсии дизассемблирования контролируется новым параметром *глубина*. (Предоставлено Сергеем Сторчакой в ​​:issue:`11822`.)

source: ``README.rst`` is now included in the list of distutils standard READMEs and therefore included in source distributions. (Contributed by Ryan Gonzalez in :issue:`11913`.)
ru: ``README.rst`` теперь включен в список стандартных файлов README distutils и, следовательно, включен в исходные дистрибутивы. (Предоставлено Райаном Гонсалесом в :issue:`11913`.)

source: The :class:`Enum <enum.Enum>` learned the new ``_ignore_`` class property, which allows listing the names of properties which should not become enum members. (Contributed by Ethan Furman in :issue:`31801`.)
ru: :class:`Enum <enum.Enum>` узнал новое свойство класса ``_ignore_``, которое позволяет перечислять имена свойств, которые не должны становиться членами перечисления. (Предоставлено Итаном Фурманом в :issue:`31801`.)

source: In Python 3.8, attempting to check for non-Enum objects in :class:`Enum` classes will raise a :exc:`TypeError` (e.g. ``1 in Color``); similarly, attempting to check for non-Flag objects in a :class:`Flag` member will raise :exc:`TypeError` (e.g. ``1 in Perm.RW``); currently, both operations return :const:`False` instead and are deprecated. (Contributed by Ethan Furman in :issue:`33217`.)
ru: В Python 3.8 попытка проверки объектов, отличных от Enum, в классах :class:`Enum` вызовет ошибку :exc:`TypeError` (например, ``1 in Color``); аналогично, попытка проверить наличие объектов, не являющихся флагами, в члене :class:`Flag` приведет к возникновению :exc:`TypeError` (например, ``1 в Perm.RW``); в настоящее время обе операции вместо этого возвращают :const:`False` и считаются устаревшими. (Предоставлено Итаном Фурманом в :issue:`33217`.)

source: :func:`functools.singledispatch` now supports registering implementations using type annotations. (Contributed by Łukasz Langa in :issue:`32227`.)
ru: :func:`functools.singledispatch` теперь поддерживает регистрацию реализаций с использованием аннотаций типов. (Предоставлено Лукашом Лангой в :issue:`32227`.)

source: The new :func:`gc.freeze` function allows freezing all objects tracked by the garbage collector and excluding them from future collections. This can be used before a POSIX ``fork()`` call to make the GC copy-on-write friendly or to speed up collection. The new :func:`gc.unfreeze` functions reverses this operation. Additionally, :func:`gc.get_freeze_count` can be used to obtain the number of frozen objects. (Contributed by Li Zekun in :issue:`31558`.)
ru: Новая функция :func:`gc.freeze` позволяет заморозить все объекты, отслеживаемые сборщиком мусора, и исключить их из будущих коллекций. Это можно использовать перед вызовом POSIX fork(), чтобы сделать сборщик мусора дружественным к копированию при записи или ускорить сбор. Новые функции :func:`gc.unfreeze` отменяют эту операцию. Кроме того, :func:`gc.get_freeze_count` можно использовать для получения количества замороженных объектов. (Предоставлено Ли Зекуном в :issue:`31558`.)

source: The :mod:`hmac` module now has an optimized one-shot :func:`~hmac.digest` function, which is up to three times faster than :func:`~hmac.HMAC`. (Contributed by Christian Heimes in :issue:`32433`.)
ru: Модуль :mod:`hmac` теперь имеет оптимизированную одноразовую функцию :func:`~hmac.digest`, которая работает до трёх раз быстрее, чем :func:`~hmac.HMAC`. (Предоставлено Кристианом Хаймсом в :issue:`32433`.)

source: :class:`~http.client.HTTPConnection` and :class:`~http.client.HTTPSConnection` now support the new *blocksize* argument for improved upload throughput. (Contributed by Nir Soffer in :issue:`31945`.)
ru: :class:`~http.client.HTTPConnection` и :class:`~http.client.HTTPSConnection` теперь поддерживают новый аргумент *blocksize* для повышения пропускной способности загрузки. (Предоставлено Ниром Соффером в :issue:`31945`.)

source: :class:`~http.server.SimpleHTTPRequestHandler` now supports the HTTP ``If-Modified-Since`` header. The server returns the 304 response status if the target file was not modified after the time specified in the header. (Contributed by Pierre Quentel in :issue:`29654`.)
ru: :class:`~http.server.SimpleHTTPRequestHandler` теперь поддерживает HTTP-заголовок ``If-Modified-Since``. Сервер возвращает статус ответа 304, если целевой файл не был изменен по истечении времени, указанного в заголовке. (Предоставлено Пьером Квентелем в :issue:`29654`.)

source: :class:`~http.server.SimpleHTTPRequestHandler` accepts the new *directory* argument, in addition to the new ``--directory`` command line argument. With this parameter, the server serves the specified directory, by default it uses the current working directory. (Contributed by Stéphane Wirtel and Julien Palard in :issue:`28707`.)
ru: :class:`~http.server.SimpleHTTPRequestHandler` принимает новый аргумент *directory* в дополнение к новому аргументу командной строки ``--directory``. С помощью этого параметра сервер обслуживает указанный каталог, по умолчанию он использует текущий рабочий каталог. (Предоставлено Стефаном Виртелем и Жюльеном Паларом в :issue:`28707`.)

source: The new :class:`ThreadingHTTPServer <http.server.ThreadingHTTPServer>` class uses threads to handle requests using :class:`~socketserver.ThreadingMixin`. It is used when ``http.server`` is run with ``-m``. (Contributed by Julien Palard in :issue:`31639`.)
ru: Новый класс :class:`ThreadingHTTPServer <http.server.ThreadingHTTPServer>` использует потоки для обработки запросов с помощью :class:`~socketserver.ThreadingMixin`. Он используется, когда ``http.server`` запускается с ``-m``. (Предоставлено Жюльеном Паларом в :issue:`31639`.)

source: idlelib and IDLE
ru: idlelib и IDLE

source: Multiple fixes for autocompletion. (Contributed by Louie Lu in :issue:`15786`.)
ru: Множество исправлений автозаполнения. (Предоставлено Луи Лу в :issue:`15786`.)

source: Module Browser (on the File menu, formerly called Class Browser), now displays nested functions and classes in addition to top-level functions and classes. (Contributed by Guilherme Polo, Cheryl Sabella, and Terry Jan Reedy in :issue:`1612262`.)
ru: Обозреватель модулей (в меню «Файл», ранее называвшийся «Обозреватель классов») теперь отображает вложенные функции и классы в дополнение к функциям и классам верхнего уровня. (Сообщили Гильерме Поло, Шерил Сабелла и Терри Ян Риди в :issue:`1612262`.)

source: The Settings dialog (Options, Configure IDLE) has been partly rewritten to improve both appearance and function. (Contributed by Cheryl Sabella and Terry Jan Reedy in multiple issues.)
ru: Диалоговое окно «Настройки» («Параметры», «Настроить IDLE») было частично переписано для улучшения внешнего вида и функциональности. (Представлено Шерил Сабеллой и Терри Джен Риди в нескольких выпусках.)

source: The font sample now includes a selection of non-Latin characters so that users can better see the effect of selecting a particular font. (Contributed by Terry Jan Reedy in :issue:`13802`.) The sample can be edited to include other characters. (Contributed by Serhiy Storchaka in :issue:`31860`.)
ru: Образец шрифта теперь включает набор нелатинских символов, чтобы пользователи могли лучше видеть эффект от выбора определенного шрифта. (Предоставлено Терри Джен Риди в :issue:`13802`.) Образец можно отредактировать, включив в него другие символы. (Предоставлено Сергеем Сторчакой в ​​:issue:`31860`.)

source: The IDLE features formerly implemented as extensions have been reimplemented as normal features. Their settings have been moved from the Extensions tab to other dialog tabs. (Contributed by Charles Wohlganger and Terry Jan Reedy in :issue:`27099`.)
ru: Функции IDLE, ранее реализованные как расширения, теперь реализованы как обычные функции. Их настройки перенесены с вкладки «Расширения» на другие вкладки диалога. (Предоставлено Чарльзом Вольгангером и Терри Яном Риди в :issue:`27099`.)

source: Editor code context option revised. Box displays all context lines up to maxlines. Clicking on a context line jumps the editor to that line. Context colors for custom themes is added to Highlights tab of Settings dialog. (Contributed by Cheryl Sabella and Terry Jan Reedy in :issue:`33642`, :issue:`33768`, and :issue:`33679`.)
ru: Пересмотрена опция контекста кода редактора. В поле отображаются все строки контекста до maxlines. Щелчок по строке контекста переводит редактор на эту строку. Цвета контекста для пользовательских тем добавлены на вкладку «Основные моменты» диалогового окна «Настройки». (Внесено Шерил Сабеллой и Терри Джен Риди в :issue:`33642`, :issue:`33768` и :issue:`33679`.)
