Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/whatsnew/3.7.po
Languages: ru

source: The default handling of :exc:`DeprecationWarning` has been changed such that these warnings are once more shown by default, but only when the code triggering them is running directly in the :mod:`__main__` module. As a result, developers of single file scripts and those using Python interactively should once again start seeing deprecation warnings for the APIs they use, but deprecation warnings triggered by imported application, library and framework modules will continue to be hidden by default.
ru: Обработка :exc:`DeprecationWarning` по умолчанию была изменена таким образом, что эти предупреждения снова отображаются по умолчанию, но только тогда, когда код, вызывающий их, выполняется непосредственно в модуле :mod:`__main__`. В результате разработчики однофайловых сценариев и те, кто использует Python в интерактивном режиме, должны снова начать видеть предупреждения об устаревании используемых ими API, но предупреждения об устаревании, вызываемые импортированными модулями приложений, библиотек и фреймворков, будут по-прежнему скрыты по умолчанию.

source: As a result of this change, the standard library now allows developers to choose between three different deprecation warning behaviours:
ru: В результате этого изменения стандартная библиотека теперь позволяет разработчикам выбирать между тремя различными вариантами поведения предупреждения об устаревании:

source: :exc:`FutureWarning`: always displayed by default, recommended for warnings intended to be seen by application end users (e.g. for deprecated application configuration settings).
ru: :exc:`FutureWarning`: всегда отображается по умолчанию, рекомендуется для предупреждений, предназначенных для просмотра конечными пользователями приложения (например, для устаревших настроек конфигурации приложения).

source: :exc:`DeprecationWarning`: displayed by default only in :mod:`__main__` and when running tests, recommended for warnings intended to be seen by other Python developers where a version upgrade may result in changed behaviour or an error.
ru: :exc:`DeprecationWarning`: отображается по умолчанию только в :mod:`__main__` и при запуске тестов, рекомендуется для предупреждений, предназначенных для просмотра другими разработчиками Python, когда обновление версии может привести к изменению поведения или ошибке.

source: :exc:`PendingDeprecationWarning`: displayed by default only when running tests, intended for cases where a future version upgrade will change the warning category to :exc:`DeprecationWarning` or :exc:`FutureWarning`.
ru: :exc:`PendingDeprecationWarning`: отображается по умолчанию только при запуске тестов, предназначенных для случаев, когда будущее обновление версии изменит категорию предупреждения на :exc:`DeprecationWarning` или :exc:`FutureWarning`.

source: Previously both :exc:`DeprecationWarning` and :exc:`PendingDeprecationWarning` were only visible when running tests, which meant that developers primarily writing single file scripts or using Python interactively could be surprised by breaking changes in the APIs they used.
ru: Раньше оба :exc:`DeprecationWarning` и :exc:`PendingDeprecationWarning` были видны только при запуске тестов, а это означало, что разработчики, в основном пишущие однофайловые скрипты или интерактивно использующие Python, могли быть удивлены, обнаружив серьезные изменения в используемых ими API.

source: :pep:`565` -- Show DeprecationWarning in ``__main__``
ru: :pep:`565` -- Показать предупреждение об устаревании в ``__main__``

source: PEP written and implemented by Nick Coghlan
ru: PEP написан и реализован Ником Когланом

source: PEP 560: Core Support for ``typing`` module and Generic Types
ru: PEP 560: Базовая поддержка модуля типизации и универсальных типов.

source: Initially :pep:`484` was designed in such way that it would not introduce *any* changes to the core CPython interpreter. Now type hints and the :mod:`typing` module are extensively used by the community, so this restriction is removed. The PEP introduces two special methods :meth:`__class_getitem__` and ``__mro_entries__``, these methods are now used by most classes and special constructs in :mod:`typing`. As a result, the speed of various operations with types increased up to 7 times, the generic types can be used without metaclass conflicts, and several long standing bugs in :mod:`typing` module are fixed.
ru: Изначально :pep:`484` был разработан таким образом, чтобы не вносить *каких-либо* изменений в основной интерпретатор CPython. Теперь подсказки по типу и модуль :mod:`typing` широко используются сообществом, поэтому это ограничение снято. PEP вводит два специальных метода :meth:`__class_getitem__` и ``__mro_entries__``, эти методы теперь используются большинством классов и специальных конструкций в :mod:`typing`. В результате скорость различных операций с типами увеличена до 7 раз, обобщенные типы можно использовать без конфликтов метаклассов, а также исправлено несколько давних ошибок в модуле :mod:`typing`.

source: :pep:`560` -- Core support for typing module and generic types
ru: :pep:`560` -- Базовая поддержка модуля типизации и универсальных типов.

source: PEP 552: Hash-based .pyc Files
ru: PEP 552: файлы .pyc на основе хеша

source: Python has traditionally checked the up-to-dateness of bytecode cache files (i.e., ``.pyc`` files) by comparing the source metadata (last-modified timestamp and size) with source metadata saved in the cache file header when it was generated. While effective, this invalidation method has its drawbacks. When filesystem timestamps are too coarse, Python can miss source updates, leading to user confusion. Additionally, having a timestamp in the cache file is problematic for `build reproducibility <https://reproducible-builds.org/>`_ and content-based build systems.
ru: Python традиционно проверял актуальность файлов кэша байт-кода (т. е. файлов .pyc) путем сравнения метаданных источника (временной метки и размера последнего изменения) с метаданными источника, сохраненными в заголовке файла кэша при его создании. генерируется. Несмотря на свою эффективность, этот метод аннулирования имеет свои недостатки. Если временные метки файловой системы слишком грубы, Python может пропустить обновления исходного кода, что приведет к путанице пользователей. Кроме того, наличие временной метки в файле кэша проблематично для `воспроизводимости сборки <https://reproducible-builds.org/>`_ и систем сборки на основе содержимого.

source: :pep:`552` extends the pyc format to allow the hash of the source file to be used for invalidation instead of the source timestamp. Such ``.pyc`` files are called "hash-based". By default, Python still uses timestamp-based invalidation and does not generate hash-based ``.pyc`` files at runtime. Hash-based ``.pyc`` files may be generated with :mod:`py_compile` or :mod:`compileall`.
ru: :pep:`552` расширяет формат pyc, позволяя использовать хэш исходного файла для аннулирования вместо исходной временной метки. Такие файлы ``.pyc`` называются "хеш-основанными". По умолчанию Python по-прежнему использует недействительность на основе временных меток и не генерирует файлы ``.pyc`` на основе хеша во время выполнения. Файлы ``.pyc`` на основе хеша могут быть созданы с помощью :mod:`py_compile` или :mod:`compileall`.

source: Hash-based ``.pyc`` files come in two variants: checked and unchecked. Python validates checked hash-based ``.pyc`` files against the corresponding source files at runtime but doesn't do so for unchecked hash-based pycs. Unchecked hash-based ``.pyc`` files are a useful performance optimization for environments where a system external to Python (e.g., the build system) is responsible for keeping ``.pyc`` files up-to-date.
ru: Файлы ``.pyc``, основанные на хеше, бывают двух вариантов: отмеченные и непроверенные. Python проверяет проверенные файлы ``.pyc`` на основе хэша по сравнению с соответствующими исходными файлами во время выполнения, но не делает этого для непроверенных pycs на основе хеша. Непроверяемые файлы ``.pyc`` на основе хэша являются полезной оптимизацией производительности для сред, где внешняя по отношению к Python система (например, система сборки) отвечает за поддержание актуальности файлов ``.pyc``.

source: See :ref:`pyc-invalidation` for more information.
ru: См. :ref:`pyc-invalidation` для получения дополнительной информации.

source: :pep:`552` -- Deterministic pycs
ru: :pep:`552` -- Детерминированные цифры

source: PEP written and implemented by Benjamin Peterson
ru: PEP написан и реализован Бенджамином Петерсоном

source: PEP 545: Python Documentation Translations
ru: PEP 545: Переводы документации Python

source: :pep:`545` describes the process of creating and maintaining Python documentation translations.
ru: :pep:`545` описывает процесс создания и поддержки переводов документации Python.

source: Three new translations have been added:
ru: Добавлено три новых перевода:

source: Japanese: https://docs.python.org/ja/
ru: Японский: https://docs.python.org/ja/

source: French: https://docs.python.org/fr/
ru: Французский: https://docs.python.org/fr/

source: Korean: https://docs.python.org/ko/
ru: Корейский: https://docs.python.org/ko/

source: :pep:`545` -- Python Documentation Translations
ru: :pep:`545` -- Переводы документации Python

source: PEP written and implemented by Julien Palard, Inada Naoki, and Victor Stinner.
ru: PEP написан и реализован Жюльеном Паларом, Инадой Наоки и Виктором Стиннером.

source: Python Development Mode (-X dev)
ru: Режим разработки Python (-X dev)

source: The new :option:`-X` ``dev`` command line option or the new :envvar:`PYTHONDEVMODE` environment variable can be used to enable :ref:`Python Development Mode <devmode>`. When in development mode, Python performs additional runtime checks that are too expensive to be enabled by default. See :ref:`Python Development Mode <devmode>` documentation for the full description.
ru: Для включения режима разработки Python <devmode> можно использовать новый параметр командной строки :option:`-X` ``dev`` или новую переменную среды :envvar:`PYTHONDEVMODE`. В режиме разработки Python выполняет дополнительные проверки во время выполнения, которые слишком затратны, чтобы их можно было включить по умолчанию. Полное описание смотрите в документации по режиму разработки Python <devmode>.

source: Other Language Changes
ru: Другие языковые изменения

source: An :keyword:`await` expression and comprehensions containing an :keyword:`async for` clause were illegal in the expressions in :ref:`formatted string literals <f-strings>` due to a problem with the implementation. In Python 3.7 this restriction was lifted.
ru: Выражение :keyword:`await` и выражения, содержащие предложение :keyword:`async for`, были недопустимы в выражениях в :ref:`форматированных строковых литералах <f-strings>` из-за проблем с реализацией. В Python 3.7 это ограничение было снято.

source: More than 255 arguments can now be passed to a function, and a function can now have more than 255 parameters. (Contributed by Serhiy Storchaka in :issue:`12844` and :issue:`18896`.)
ru: В функцию теперь можно передать более 255 аргументов, а функция теперь может иметь более 255 параметров. (Внесено Сергеем Сторчакой в ​​:issue:`12844` и :issue:`18896`.)

source: :meth:`bytes.fromhex` and :meth:`bytearray.fromhex` now ignore all ASCII whitespace, not only spaces. (Contributed by Robert Xiao in :issue:`28927`.)
ru: :meth:`bytes.fromhex` и :meth:`bytearray.fromhex` теперь игнорируют все пробелы ASCII, а не только пробелы. (Предоставлено Робертом Сяо в :issue:`28927`.)

source: :class:`str`, :class:`bytes`, and :class:`bytearray` gained support for the new :meth:`isascii() <str.isascii>` method, which can be used to test if a string or bytes contain only the ASCII characters. (Contributed by INADA Naoki in :issue:`32677`.)
ru: :class:`str`, :class:`bytes` и :class:`bytearray` получили поддержку нового метода :meth:`isascii() <str.isascii>`, который можно использовать для проверки того, является ли строка или байты содержат только символы ASCII. (Предоставлено ИНАДА Наоки в :issue:`32677`.)

source: :exc:`ImportError` now displays module name and module ``__file__`` path when ``from ... import ...`` fails. (Contributed by Matthias Bussonnier in :issue:`29546`.)
ru: :exc:`ImportError` теперь отображает имя модуля и путь к модулю ``__file__``, когда ``from ... import ...`` завершается неудачно. (Предоставлено Маттиасом Бюссонье в :issue:`29546`.)

source: Circular imports involving absolute imports with binding a submodule to a name are now supported. (Contributed by Serhiy Storchaka in :issue:`30024`.)
ru: Теперь поддерживается циклический импорт, включающий абсолютный импорт с привязкой подмодуля к имени. (Предоставлено Сергеем Сторчакой в ​​:issue:`30024`.)

source: ``object.__format__(x, '')`` is now equivalent to ``str(x)`` rather than ``format(str(self), '')``. (Contributed by Serhiy Storchaka in :issue:`28974`.)
ru: ``object.__format__(x, '')`` теперь эквивалентен ``str(x)``, а не ``format(str(self), '')``. (Добавлен Сергеем Сторчакой в ​​:issue:`28974`.)

source: In order to better support dynamic creation of stack traces, :class:`types.TracebackType` can now be instantiated from Python code, and the :attr:`~traceback.tb_next` attribute on :ref:`tracebacks <traceback-objects>` is now writable. (Contributed by Nathaniel J. Smith in :issue:`30579`.)
ru: Чтобы лучше поддерживать динамическое создание трассировок стека, :class:`types.TracebackType` теперь может быть создан из кода Python, а атрибут :attr:`~traceback.tb_next` в :ref:`tracebacks <traceback-objects> ` теперь доступен для записи. (Предоставлено Натаниэлем Дж. Смитом в :issue:`30579`.)

source: When using the :option:`-m` switch, ``sys.path[0]`` is now eagerly expanded to the full starting directory path, rather than being left as the empty directory (which allows imports from the *current* working directory at the time when an import occurs) (Contributed by Nick Coghlan in :issue:`33053`.)
ru: При использовании переключателя :option:`-m` ``sys.path[0]`` теперь быстро расширяется до полного начального пути к каталогу, а не остается пустым каталогом (что позволяет импортировать из *текущего* каталога). рабочий каталог в момент импорта) (предоставлен Ником Когланом в :issue:`33053`.)

source: The new :option:`-X` ``importtime`` option or the :envvar:`PYTHONPROFILEIMPORTTIME` environment variable can be used to show the timing of each module import. (Contributed by Inada Naoki in :issue:`31415`.)
ru: Новая опция :option:`-X` ``importtime`` или переменная среды :envvar:`PYTHONPROFILEIMPORTTIME` может использоваться для отображения времени импорта каждого модуля. (Предоставлено Инадой Наоки в :issue:`31415`.)

source: New Modules
ru: Новые модули

source: The new :mod:`contextvars` module and a set of :ref:`new C APIs <contextvarsobjects>` introduce support for *context variables*. Context variables are conceptually similar to thread-local variables. Unlike TLS, context variables support asynchronous code correctly.
ru: Новый модуль :mod:`contextvars` и набор :ref:`новых API C <contextvarsobjects>` обеспечивают поддержку *контекстных переменных*. Контекстные переменные концептуально аналогичны локальным переменным потока. В отличие от TLS, контекстные переменные корректно поддерживают асинхронный код.

source: The :mod:`asyncio` and :mod:`decimal` modules have been updated to use and support context variables out of the box. Particularly the active decimal context is now stored in a context variable, which allows decimal operations to work with the correct context in asynchronous code.
ru: Модули :mod:`asyncio` и :mod:`decimal` были обновлены для использования и поддержки контекстных переменных "из коробки". В частности, активный десятичный контекст теперь хранится в контекстной переменной, что позволяет десятичным операциям работать с правильным контекстом в асинхронном коде.

source: :pep:`567` -- Context Variables
ru: :pep:`567` -- Контекстные переменные

source: dataclasses
ru: классы данных

source: The new :func:`~dataclasses.dataclass` decorator provides a way to declare *data classes*. A data class describes its attributes using class variable annotations. Its constructor and other magic methods, such as :meth:`~object.__repr__`, :meth:`~object.__eq__`, and :meth:`~object.__hash__` are generated automatically.
ru: Новый декоратор :func:`~dataclasses.dataclass` позволяет объявлять *классы данных*. Класс данных описывает свои атрибуты с помощью аннотаций переменных класса. Его конструктор и другие магические методы, такие как :meth:`~object.__repr__`, :meth:`~object.__eq__` и :meth:`~object.__hash__`, генерируются автоматически.

source: Example::
ru: Пример::

source: :pep:`557` -- Data Classes
ru: :pep:`557` -- Классы данных

source: PEP written and implemented by Eric V. Smith
ru: PEP написан и реализован Эриком В. Смитом.

source: The new :mod:`importlib.resources` module provides several new APIs and one new ABC for access to, opening, and reading *resources* inside packages. Resources are roughly similar to files inside packages, but they needn't be actual files on the physical file system. Module loaders can provide a :meth:`get_resource_reader` function which returns a :class:`importlib.abc.ResourceReader` instance to support this new API. Built-in file path loaders and zip file loaders both support this.
ru: Новый модуль :mod:`importlib.resources` предоставляет несколько новых API и один новый ABC для доступа, открытия и чтения *ресурсов* внутри пакетов. Ресурсы примерно аналогичны файлам внутри пакетов, но они не обязательно должны быть реальными файлами в физической файловой системе. Загрузчики модулей могут предоставлять функцию :meth:`get_resource_reader`, которая возвращает экземпляр :class:`importlib.abc.ResourceReader` для поддержки этого нового API. Это поддерживают встроенные загрузчики путей к файлам и загрузчики zip-файлов.

source: Contributed by Barry Warsaw and Brett Cannon in :issue:`32248`.
ru: Предоставлено Барри Варшавой и Бреттом Кэнноном в :issue:`32248`.

source: `importlib_resources <https://importlib-resources.readthedocs.io/en/latest/>`_ -- a PyPI backport for earlier Python versions.
ru: `importlib_resources <https://importlib-resources.readthedocs.io/en/latest/>`_ — резервный порт PyPI для более ранних версий Python.

source: Improved Modules
ru: Улучшенные модули

source: The new :meth:`ArgumentParser.parse_intermixed_args() <argparse.ArgumentParser.parse_intermixed_args>` method allows intermixing options and positional arguments. (Contributed by paul.j3 in :issue:`14191`.)
ru: Новый метод :meth:`ArgumentParser.parse_intermixed_args() <argparse.ArgumentParser.parse_intermixed_args>` позволяет смешивать параметры и позиционные аргументы. (Добавлен paul.j3 в :issue:`14191`.)

source: The :mod:`asyncio` module has received many new features, usability and :ref:`performance improvements <whatsnew37-asyncio-perf>`. Notable changes include:
ru: Модуль :mod:`asyncio` получил множество новых функций, удобства использования и :ref:`улучшений производительности <whatsnew37-asyncio-perf>`. Заметные изменения включают в себя:

source: The new :term:`provisional <provisional API>` :func:`asyncio.run` function can be used to run a coroutine from synchronous code by automatically creating and destroying the event loop. (Contributed by Yury Selivanov in :issue:`32314`.)
ru: Новую функцию :term:`provisional <provisional API>` :func:`asyncio.run` можно использовать для запуска сопрограммы из синхронного кода путем автоматического создания и уничтожения цикла событий. (Добавлен Юрием Селивановым в :issue:`32314`.)

source: asyncio gained support for :mod:`contextvars`. :meth:`loop.call_soon() <asyncio.loop.call_soon>`, :meth:`loop.call_soon_threadsafe() <asyncio.loop.call_soon_threadsafe>`, :meth:`loop.call_later() <asyncio.loop.call_later>`, :meth:`loop.call_at() <asyncio.loop.call_at>`, and :meth:`Future.add_done_callback() <asyncio.Future.add_done_callback>` have a new optional keyword-only *context* parameter. :class:`Tasks <asyncio.Task>` now track their context automatically. See :pep:`567` for more details. (Contributed by Yury Selivanov in :issue:`32436`.)
ru: asyncio получила поддержку :mod:`contextvars`. :meth:`loop.call_soon() <asyncio.loop.call_soon>`, :meth:`loop.call_soon_threadsafe() <asyncio.loop.call_soon_threadsafe>`, :meth:`loop.call_later() <asyncio.loop. call_later>`, :meth:`loop.call_at() <asyncio.loop.call_at>` и :meth:`Future.add_done_callback() <asyncio.Future.add_done_callback>` имеют новое необязательное ключевое слово *context* параметр. :class:`Задачи <asyncio.Task>` теперь автоматически отслеживают свой контекст. См. :pep:`567` для более подробной информации. (Добавлен Юрием Селивановым в :issue:`32436`.)

source: The new :func:`asyncio.create_task` function has been added as a shortcut to ``asyncio.get_event_loop().create_task()``. (Contributed by Andrew Svetlov in :issue:`32311`.)
ru: Новая функция :func:`asyncio.create_task` была добавлена ​​как ярлык для ``asyncio.get_event_loop().create_task()``. (Предоставлено Андреем Светловым в :issue:`32311`.)

source: The new :meth:`loop.start_tls() <asyncio.loop.start_tls>` method can be used to upgrade an existing connection to TLS. (Contributed by Yury Selivanov in :issue:`23749`.)
ru: Новый метод :meth:`loop.start_tls() <asyncio.loop.start_tls>` можно использовать для обновления существующего соединения до TLS. (Добавлен Юрием Селивановым в :issue:`23749`.)

source: The new :meth:`loop.sock_recv_into() <asyncio.loop.sock_recv_into>` method allows reading data from a socket directly into a provided buffer making it possible to reduce data copies. (Contributed by Antoine Pitrou in :issue:`31819`.)
ru: Новый метод :meth:`loop.sock_recv_into() <asyncio.loop.sock_recv_into>` позволяет считывать данные из сокета непосредственно в предоставленный буфер, что позволяет уменьшить количество копий данных. (Предоставлено Антуаном Питру в :issue:`31819`.)

source: The new :func:`asyncio.current_task` function returns the currently running :class:`~asyncio.Task` instance, and the new :func:`asyncio.all_tasks` function returns a set of all existing ``Task`` instances in a given loop. The :meth:`!Task.current_task` and :meth:`!Task.all_tasks` methods have been deprecated. (Contributed by Andrew Svetlov in :issue:`32250`.)
ru: Новая функция :func:`asyncio.current_task` возвращает текущий запущенный экземпляр :class:`~asyncio.Task`, а новая функция :func:`asyncio.all_tasks` возвращает набор всех существующих экземпляров ``Task``. в заданном цикле. Методы :meth:`!Task.current_task` и :meth:`!Task.all_tasks` устарели. (Предоставлено Андреем Светловым в :issue:`32250`.)

source: The new *provisional* :class:`~asyncio.BufferedProtocol` class allows implementing streaming protocols with manual control over the receive buffer. (Contributed by Yury Selivanov in :issue:`32251`.)
ru: Новый *предварительный* класс :class:`~asyncio.BufferedProtocol` позволяет реализовать протоколы потоковой передачи с ручным управлением буфером приема. (Добавлен Юрием Селивановым в :issue:`32251`.)

source: The new :func:`asyncio.get_running_loop` function returns the currently running loop, and raises a :exc:`RuntimeError` if no loop is running. This is in contrast with :func:`asyncio.get_event_loop`, which will *create* a new event loop if none is running. (Contributed by Yury Selivanov in :issue:`32269`.)
ru: Новая функция :func:`asyncio.get_running_loop` возвращает текущий выполняющийся цикл и вызывает :exc:`RuntimeError`, если ни один цикл не выполняется. Это контрастирует с :func:`asyncio.get_event_loop`, который *создает* новый цикл событий, если ни один из них не запущен. (Добавлен Юрием Селивановым в :issue:`32269`.)
