Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/whatsnew/3.7.po
Languages: ru

source: On Windows, a new API call tells Windows that tk scales for DPI. On Windows 8.1+ or 10, with DPI compatibility properties of the Python binary unchanged, and a monitor resolution greater than 96 DPI, this should make text and lines sharper. It should otherwise have no effect. (Contributed by Terry Jan Reedy in :issue:`33656`.)
ru: В Windows новый вызов API сообщает Windows, что tk масштабируется в соответствии с DPI. В Windows 8.1+ или 10 с неизмененными свойствами совместимости DPI двоичного файла Python и разрешением монитора более 96 DPI это должно сделать текст и линии более четкими. В противном случае это не должно иметь никакого эффекта. (Предоставлено Терри Джен Риди в :issue:`33656`.)

source: New in 3.7.1:
ru: Новое в версии 3.7.1:

source: Output over N lines (50 by default) is squeezed down to a button. N can be changed in the PyShell section of the General page of the Settings dialog. Fewer, but possibly extra long, lines can be squeezed by right clicking on the output. Squeezed output can be expanded in place by double-clicking the button or into the clipboard or a separate window by right-clicking the button. (Contributed by Tal Einat in :issue:`1529353`.)
ru: Вывод в N строк (по умолчанию 50) сжимается до кнопки. N можно изменить в разделе PyShell на странице «Общие» диалогового окна «Настройки». Меньшее количество, но, возможно, более длинные строки можно сжать, щелкнув правой кнопкой мыши по выходным данным. Сжатый вывод можно развернуть на месте, дважды щелкнув кнопку, или в буфер обмена или в отдельное окно, щелкнув кнопку правой кнопкой мыши. (Предоставлено Талом Эйнатом в :issue:`1529353`.)

source: The changes above have been backported to 3.6 maintenance releases.
ru: Вышеупомянутые изменения были перенесены в сервисные выпуски 3.6.

source: NEW in 3.7.4:
ru: НОВОЕ в версии 3.7.4:

source: Add "Run Customized" to the Run menu to run a module with customized settings. Any command line arguments entered are added to sys.argv. They re-appear in the box for the next customized run. One can also suppress the normal Shell main module restart. (Contributed by Cheryl Sabella, Terry Jan Reedy, and others in :issue:`5680` and :issue:`37627`.)
ru: Добавьте «Запустить по индивидуальному заказу» в меню «Выполнить», чтобы запустить модуль с настроенными настройками. Все введенные аргументы командной строки добавляются в sys.argv. Они снова появятся в поле для следующего индивидуального запуска. Также можно запретить обычный перезапуск основного модуля Shell. (Внесено Шерил Сабеллой, Терри Джен Риди и другими в :issue:`5680` и :issue:`37627`.)

source: New in 3.7.5:
ru: Новое в версии 3.7.5:

source: Add optional line numbers for IDLE editor windows. Windows open without line numbers unless set otherwise in the General tab of the configuration dialog. Line numbers for an existing window are shown and hidden in the Options menu. (Contributed by Tal Einat and Saimadhav Heblikar in :issue:`17535`.)
ru: Добавьте дополнительные номера строк для окон редактора IDLE. Окна открываются без номеров строк, если иное не установлено на вкладке «Общие» диалогового окна конфигурации. Номера строк существующего окна отображаются и скрываются в меню «Параметры». (Предоставлено Талом Эйнатом и Саймадхавом Хебликаром в :issue:`17535`.)

source: The :class:`importlib.abc.ResourceReader` ABC was introduced to support the loading of resources from packages. See also :ref:`whatsnew37_importlib_resources`. (Contributed by Barry Warsaw, Brett Cannon in :issue:`32248`.)
ru: ABC :class:`importlib.abc.ResourceReader` был введен для поддержки загрузки ресурсов из пакетов. См. также:ref:`whatsnew37_importlib_resources`. (Предоставлено Барри Варшавой и Бреттом Кэнноном в :issue:`32248`.)

source: :func:`importlib.reload` now raises :exc:`ModuleNotFoundError` if the module lacks a spec. (Contributed by Garvit Khatri in :issue:`29851`.)
ru: :func:`importlib.reload` теперь вызывает :exc:`ModuleNotFoundError`, если у модуля отсутствует спецификация. (Предоставлено Гарвитом Хатри в :issue:`29851`.)

source: :func:`importlib.find_spec` now raises :exc:`ModuleNotFoundError` instead of :exc:`AttributeError` if the specified parent module is not a package (i.e. lacks a ``__path__`` attribute). (Contributed by Milan Oberkirch in :issue:`30436`.)
ru: :func:`importlib.find_spec` теперь вызывает :exc:`ModuleNotFoundError` вместо :exc:`AttributeError`, если указанный родительский модуль не является пакетом (т.е. не имеет атрибута ``__path__``). (Предоставлено Миланом Оберкирхом в :issue:`30436`.)

source: The new :func:`importlib.source_hash` can be used to compute the hash of the passed source. A :ref:`hash-based .pyc file <whatsnew37-pep552>` embeds the value returned by this function.
ru: Новый :func:`importlib.source_hash` можно использовать для вычисления хеша переданного источника. Файл .pyc на основе хеша <whatsnew37-pep552> включает значение, возвращаемое этой функцией.

source: The new :meth:`TextIOWrapper.reconfigure() <io.TextIOWrapper.reconfigure>` method can be used to reconfigure the text stream with the new settings. (Contributed by Antoine Pitrou in :issue:`30526` and INADA Naoki in :issue:`15216`.)
ru: Новый метод :meth:`TextIOWrapper.reconfigure() <io.TextIOWrapper.reconfigure>` можно использовать для перенастройки текстового потока с новыми настройками. (Предоставлено Антуаном Питру в :issue:`30526` и INADA Наоки в :issue:`15216`.)

source: The new ``subnet_of()`` and ``supernet_of()`` methods of :class:`ipaddress.IPv6Network` and :class:`ipaddress.IPv4Network` can be used for network containment tests. (Contributed by Michel Albert and Cheryl Sabella in :issue:`20825`.)
ru: Новые методы subnet_of() и supernet_of() :class:`ipaddress.IPv6Network` и :class:`ipaddress.IPv4Network` могут использоваться для тестов сдерживания сети. (Предоставлено Мишелем Альбертом и Шерил Сабеллой в :issue:`20825`.)

source: :func:`itertools.islice` now accepts :meth:`integer-like objects <object.__index__>` as start, stop, and slice arguments. (Contributed by Will Roberts in :issue:`30537`.)
ru: :func:`itertools.islice` теперь принимает :meth:`целочисленные объекты <object.__index__>` в качестве аргументов запуска, остановки и среза. (Предоставлено Уиллом Робертсом в :issue:`30537`.)

source: locale
ru: локаль

source: The new *monetary* argument to :func:`locale.format_string` can be used to make the conversion use monetary thousands separators and grouping strings. (Contributed by Garvit in :issue:`10379`.)
ru: Новый аргумент *monetary* для :func:`locale.format_string` можно использовать для преобразования с использованием денежных разделителей тысяч и строк группировки. (Предоставлено Гарвитом в :issue:`10379`.)

source: The :func:`locale.getpreferredencoding` function now always returns ``'UTF-8'`` on Android or when in the :ref:`forced UTF-8 mode <whatsnew37-pep540>`.
ru: Функция :func:`locale.getpreferredencoding` теперь всегда возвращает ``'UTF-8'`` на Android или в :ref:`принудительном режиме UTF-8 <whatsnew37-pep540>`.

source: logging
ru: логирование

source: :class:`~logging.Logger` instances can now be pickled. (Contributed by Vinay Sajip in :issue:`30520`.)
ru: Экземпляры :class:`~logging.Logger` теперь можно мариновать. (Предоставлено Винаем Саджипом в :issue:`30520`.)

source: The new :meth:`StreamHandler.setStream() <logging.StreamHandler.setStream>` method can be used to replace the logger stream after handler creation. (Contributed by Vinay Sajip in :issue:`30522`.)
ru: Новый метод :meth:`StreamHandler.setStream() <logging.StreamHandler.setStream>` можно использовать для замены потока регистратора после создания обработчика. (Предоставлено Винаем Саджипом в :issue:`30522`.)

source: It is now possible to specify keyword arguments to handler constructors in configuration passed to :func:`logging.config.fileConfig`. (Contributed by Preston Landers in :issue:`31080`.)
ru: Теперь можно указать аргументы ключевых слов для конструкторов обработчиков в конфигурации, передаваемой в :func:`logging.config.fileConfig`. (Предоставлено Престоном Ландерсом в :issue:`31080`.)

source: math
ru: математика

source: The new :func:`math.remainder` function implements the IEEE 754-style remainder operation. (Contributed by Mark Dickinson in :issue:`29962`.)
ru: Новая функция :func:`math.remainder` реализует операцию остатка в стиле IEEE 754. (Предоставлено Марком Дикинсоном в :issue:`29962`.)

source: The MIME type of .bmp has been changed from ``'image/x-ms-bmp'`` to ``'image/bmp'``. (Contributed by Nitish Chandra in :issue:`22589`.)
ru: MIME-тип файла .bmp был изменен с ``'image/x-ms-bmp'`` на ``'image/bmp'``. (Предоставлено Нитишем Чандрой в :issue:`22589`.)

source: The new :meth:`!Database.Close` method can be used to close the :abbr:`MSI` database. (Contributed by Berker Peksag in :issue:`20486`.)
ru: Новый метод :meth:`!Database.Close` можно использовать для закрытия базы данных :abbr:`MSI`. (Предоставлено Беркером Пексагом в :issue:`20486`.)

source: The new :meth:`Process.close() <multiprocessing.Process.close>` method explicitly closes the process object and releases all resources associated with it. :exc:`ValueError` is raised if the underlying process is still running. (Contributed by Antoine Pitrou in :issue:`30596`.)
ru: Новый метод :meth:`Process.close() <multiprocessing.Process.close>` явно закрывает объект процесса и освобождает все связанные с ним ресурсы. :exc:`ValueError` возникает, если базовый процесс все еще работает. (Предоставлено Антуаном Питру в :issue:`30596`.)

source: The new :meth:`Process.kill() <multiprocessing.Process.kill>` method can be used to terminate the process using the :data:`SIGKILL` signal on Unix. (Contributed by Vitor Pereira in :issue:`30794`.)
ru: Новый метод :meth:`Process.kill() <multiprocessing.Process.kill>` можно использовать для завершения процесса с помощью сигнала :data:`SIGKILL` в Unix. (Предоставлено Витором Перейрой в :issue:`30794`.)

source: Non-daemonic threads created by :class:`~multiprocessing.Process` are now joined on process exit. (Contributed by Antoine Pitrou in :issue:`18966`.)
ru: Недемонические потоки, созданные :class:`~multiprocessing.Process`, теперь объединяются при выходе из процесса. (Предоставлено Антуаном Питру в :issue:`18966`.)

source: :func:`os.fwalk` now accepts the *path* argument as :class:`bytes`. (Contributed by Serhiy Storchaka in :issue:`28682`.)
ru: :func:`os.fwalk` теперь принимает аргумент *path* как :class:`bytes`. (Предоставлено Сергеем Сторчакой в ​​:issue:`28682`.)

source: :func:`os.scandir` gained support for :ref:`file descriptors <path_fd>`. (Contributed by Serhiy Storchaka in :issue:`25996`.)
ru: :func:`os.scandir` получил поддержку :ref:`дескрипторов файлов <path_fd>`. (Добавлен Сергеем Сторчакой в ​​:issue:`25996`.)

source: The new :func:`~os.register_at_fork` function allows registering Python callbacks to be executed at process fork. (Contributed by Antoine Pitrou in :issue:`16500`.)
ru: Новая функция :func:`~os.register_at_fork` позволяет регистрировать обратные вызовы Python, которые будут выполняться при разветвлении процесса. (Предоставлено Антуаном Питру в :issue:`16500`.)

source: Added :func:`os.preadv` (combine the functionality of :func:`os.readv` and :func:`os.pread`) and :func:`os.pwritev` functions (combine the functionality of :func:`os.writev` and :func:`os.pwrite`). (Contributed by Pablo Galindo in :issue:`31368`.)
ru: Добавлены функции :func:`os.preadv` (объединяют функциональность :func:`os.readv` и :func:`os.pread`) и :func:`os.pwritev` (объединяют функциональность :func: `os.writev` и :func:`os.pwrite`). (Предоставлено Пабло Галиндо в :issue:`31368`.)

source: The mode argument of :func:`os.makedirs` no longer affects the file permission bits of newly created intermediate-level directories. (Contributed by Serhiy Storchaka in :issue:`19930`.)
ru: Аргумент режима :func:`os.madeirs` больше не влияет на биты прав доступа к файлам вновь созданных каталогов промежуточного уровня. (Предоставлено Сергеем Сторчакой в ​​:issue:`19930`.)

source: :func:`os.dup2` now returns the new file descriptor. Previously, ``None`` was always returned. (Contributed by Benjamin Peterson in :issue:`32441`.)
ru: :func:`os.dup2` теперь возвращает новый дескриптор файла. Раньше всегда возвращалось значение None. (Предоставлено Бенджамином Петерсоном в :issue:`32441`.)

source: The structure returned by :func:`os.stat` now contains the :attr:`~os.stat_result.st_fstype` attribute on Solaris and its derivatives. (Contributed by Jesús Cea Avión in :issue:`32659`.)
ru: Структура, возвращаемая :func:`os.stat`, теперь содержит атрибут :attr:`~os.stat_result.st_fstype` в Solaris и его производных. (Предоставлено Хесусом Сеа Авионом в :issue:`32659`.)

source: The new :meth:`Path.is_mount() <pathlib.Path.is_mount>` method is now available on POSIX systems and can be used to determine whether a path is a mount point. (Contributed by Cooper Ry Lees in :issue:`30897`.)
ru: Новый метод :meth:`Path.is_mount() <pathlib.Path.is_mount>` теперь доступен в системах POSIX и может использоваться для определения того, является ли путь точкой монтирования. (Предоставлено Купером Рай Лизом в :issue:`30897`.)

source: :func:`pdb.set_trace` now takes an optional *header* keyword-only argument. If given, it is printed to the console just before debugging begins. (Contributed by Barry Warsaw in :issue:`31389`.)
ru: :func:`pdb.set_trace` теперь принимает необязательный аргумент *header*, содержащий только ключевое слово. Если он задан, он выводится на консоль непосредственно перед началом отладки. (Предоставлено Барри Варшавой в :issue:`31389`.)

source: :mod:`pdb` command line now accepts ``-m module_name`` as an alternative to script file. (Contributed by Mario Corchero in :issue:`32206`.)
ru: Командная строка :mod:`pdb` теперь принимает ``-m имя_модуля`` в качестве альтернативы файлу сценария. (Предоставлено Марио Корчеро в :issue:`32206`.)

source: :func:`py_compile.compile` -- and by extension, :mod:`compileall` -- now respects the :envvar:`SOURCE_DATE_EPOCH` environment variable by unconditionally creating ``.pyc`` files for hash-based validation. This allows for guaranteeing `reproducible builds <https://reproducible-builds.org/>`_ of ``.pyc`` files when they are created eagerly. (Contributed by Bernhard M. Wiedemann in :issue:`29708`.)
ru: :func:`py_compile.compile` -- и, как следствие, :mod:`compileall` -- теперь учитывает переменную среды :envvar:`SOURCE_DATE_EPOCH`, безоговорочно создавая файлы ``.pyc`` для проверки на основе хеша. Это позволяет гарантировать `воспроизводимые сборки <https://reproducible-builds.org/>`_ файлов ``.pyc``, когда они создаются с готовностью. (Предоставлено Бернхардом М. Видеманном в :issue:`29708`.)

source: The pydoc server can now bind to an arbitrary hostname specified by the new ``-n`` command-line argument. (Contributed by Feanil Patel in :issue:`31128`.)
ru: Сервер pydoc теперь может привязываться к произвольному имени хоста, указанному в новом аргументе командной строки ``-n``. (Предоставлено Феанилом Пателем в :issue:`31128`.)

source: queue
ru: очередь

source: The new :class:`~queue.SimpleQueue` class is an unbounded :abbr:`FIFO` queue. (Contributed by Antoine Pitrou in :issue:`14976`.)
ru: Новый класс :class:`~queue.SimpleQueue` представляет собой неограниченную очередь :abbr:`FIFO`. (Предоставлено Антуаном Питру в :issue:`14976`.)

source: The flags :const:`re.ASCII`, :const:`re.LOCALE` and :const:`re.UNICODE` can be set within the scope of a group. (Contributed by Serhiy Storchaka in :issue:`31690`.)
ru: Флаги :const:`re.ASCII`, :const:`re.LOCALE` и :const:`re.UNICODE` могут быть установлены в пределах группы. (Предоставлено Сергеем Сторчакой в ​​:issue:`31690`.)

source: :func:`re.split` now supports splitting on a pattern like ``r'\b'``, ``'^$'`` or ``(?=-)`` that matches an empty string. (Contributed by Serhiy Storchaka in :issue:`25054`.)
ru: :func:`re.split` теперь поддерживает разделение по шаблону типа ``r'\b'``, ``'^ $ '`` или ``(?=-)``, который соответствует пустой строке. (Добавлен Сергеем Сторчакой в ​​:issue:`25054`.)

source: Regular expressions compiled with the :const:`re.LOCALE` flag no longer depend on the locale at compile time. Locale settings are applied only when the compiled regular expression is used. (Contributed by Serhiy Storchaka in :issue:`30215`.)
ru: Регулярные выражения, скомпилированные с флагом :const:`re.LOCALE`, больше не зависят от локали во время компиляции. Настройки локали применяются только при использовании скомпилированного регулярного выражения. (Предоставлено Сергеем Сторчакой в ​​:issue:`30215`.)

source: :exc:`FutureWarning` is now emitted if a regular expression contains character set constructs that will change semantically in the future, such as nested sets and set operations. (Contributed by Serhiy Storchaka in :issue:`30349`.)
ru: :exc:`FutureWarning` теперь генерируется, если регулярное выражение содержит конструкции набора символов, которые семантически изменятся в будущем, например вложенные наборы и операции над множествами. (Предоставлено Сергеем Сторчакой в ​​:issue:`30349`.)

source: Compiled regular expression and match objects can now be copied using :func:`copy.copy` and :func:`copy.deepcopy`. (Contributed by Serhiy Storchaka in :issue:`10076`.)
ru: Скомпилированные регулярные выражения и объекты сопоставления теперь можно копировать с помощью :func:`copy.copy` и :func:`copy.deepcopy`. (Размещено Сергеем Сторчакой в ​​:issue:`10076`.)

source: signal
ru: сигнал

source: The new *warn_on_full_buffer* argument to the :func:`signal.set_wakeup_fd` function makes it possible to specify whether Python prints a warning on stderr when the wakeup buffer overflows. (Contributed by Nathaniel J. Smith in :issue:`30050`.)
ru: Новый аргумент *warn_on_full_buffer* функции :func:`signal.set_wakeup_fd` позволяет указать, будет ли Python печатать предупреждение на stderr при переполнении буфера пробуждения. (Предоставлено Натаниэлем Дж. Смитом в :issue:`30050`.)

source: socket
ru: сокет

source: The new :func:`socket.getblocking() <socket.socket.getblocking>` method returns ``True`` if the socket is in blocking mode and ``False`` otherwise. (Contributed by Yury Selivanov in :issue:`32373`.)
ru: Новый метод :func:`socket.getblocking() <socket.socket.getblocking>` возвращает ``True``, если сокет находится в режиме блокировки, и ``False`` в противном случае. (Добавлен Юрием Селивановым в :issue:`32373`.)

source: The new :func:`socket.close` function closes the passed socket file descriptor. This function should be used instead of :func:`os.close` for better compatibility across platforms. (Contributed by Christian Heimes in :issue:`32454`.)
ru: Новая функция :func:`socket.close` закрывает переданный дескриптор файла сокета. Эту функцию следует использовать вместо :func:`os.close` для лучшей совместимости между платформами. (Предоставлено Кристианом Хаймсом в :issue:`32454`.)

source: The :mod:`socket` module now exposes the :const:`socket.TCP_CONGESTION` (Linux 2.6.13), :const:`socket.TCP_USER_TIMEOUT` (Linux 2.6.37), and :const:`socket.TCP_NOTSENT_LOWAT` (Linux 3.12) constants. (Contributed by Omar Sandoval in :issue:`26273` and Nathaniel J. Smith in :issue:`29728`.)
ru: Модуль :mod:`socket` теперь предоставляет :const:`socket.TCP_CONGESTION` (Linux 2.6.13), :const:`socket.TCP_USER_TIMEOUT` (Linux 2.6.37) и :const:`socket.TCP_NOTSENT_LOWAT` (Linux 3.12) константы. (Предоставлено Омаром Сандовалем в :issue:`26273` и Натаниэлем Дж. Смитом в :issue:`29728`.)

source: Support for :const:`socket.AF_VSOCK` sockets has been added to allow communication between virtual machines and their hosts. (Contributed by Cathy Avery in :issue:`27584`.)
ru: Добавлена ​​поддержка сокетов :const:`socket.AF_VSOCK` для обеспечения связи между виртуальными машинами и их хостами. (Предоставлено Кэти Эйвери в :issue:`27584`.)

source: Sockets now auto-detect family, type and protocol from file descriptor by default. (Contributed by Christian Heimes in :issue:`28134`.)
ru: Сокеты теперь по умолчанию автоматически определяют семейство, тип и протокол по файловому дескриптору. (Предоставлено Кристианом Хаймсом в :issue:`28134`.)

source: :meth:`socketserver.ThreadingMixIn.server_close` now waits until all non-daemon threads complete. :meth:`socketserver.ForkingMixIn.server_close` now waits until all child processes complete.
ru: :meth:`socketserver.ThreadingMixIn.server_close` теперь ожидает завершения всех потоков, не являющихся демонами. :meth:`socketserver.ForkingMixIn.server_close` теперь ожидает завершения всех дочерних процессов.

source: Add a new :attr:`socketserver.ForkingMixIn.block_on_close` class attribute to :class:`socketserver.ForkingMixIn` and :class:`socketserver.ThreadingMixIn` classes. Set the class attribute to ``False`` to get the pre-3.7 behaviour.
ru: Добавьте новый атрибут класса :attr:`socketserver.ForkingMixIn.block_on_close` к классам :class:`socketserver.ForkingMixIn` и :class:`socketserver.ThreadingMixIn`. Установите для атрибута класса значение False, чтобы получить поведение версии до версии 3.7.

source: :class:`sqlite3.Connection` now exposes the :meth:`~sqlite3.Connection.backup` method when the underlying SQLite library is at version 3.6.11 or higher. (Contributed by Lele Gaifax in :issue:`27645`.)
ru: :class:`sqlite3.Connection` теперь предоставляет метод :meth:`~sqlite3.Connection.backup`, если базовая библиотека SQLite имеет версию 3.6.11 или выше. (Предоставлено Леле Гайфакс в :issue:`27645`.)

source: The *database* argument of :func:`sqlite3.connect` now accepts any :term:`path-like object`, instead of just a string. (Contributed by Anders Lorentsen in :issue:`31843`.)
ru: Аргумент *database* :func:`sqlite3.connect` теперь принимает любой :term:`path-подобный объект`, а не просто строку. (Предоставлено Андерсом Лорентсеном в :issue:`31843`.)

source: The :mod:`ssl` module now uses OpenSSL's builtin API instead of :func:`~ssl.match_hostname` to check a host name or an IP address. Values are validated during TLS handshake. Any certificate validation error including failing the host name check now raises :exc:`~ssl.SSLCertVerificationError` and aborts the handshake with a proper TLS Alert message. The new exception contains additional information. Host name validation can be customized with :attr:`SSLContext.hostname_checks_common_name <ssl.SSLContext.hostname_checks_common_name>`. (Contributed by Christian Heimes in :issue:`31399`.)
ru: Модуль :mod:`ssl` теперь использует встроенный API OpenSSL вместо :func:`~ssl.match_hostname` для проверки имени хоста или IP-адреса. Значения проверяются во время установления связи TLS. Любая ошибка проверки сертификата, включая неудачную проверку имени хоста, теперь вызывает ошибку :exc:`~ssl.SSLCertVerificationError` и прерывает рукопожатие с соответствующим сообщением TLS Alert. Новое исключение содержит дополнительную информацию. Проверку имени хоста можно настроить с помощью :attr:`SSLContext.hostname_checks_common_name <ssl.SSLContext.hostname_checks_common_name>`. (Предоставлено Кристианом Хаймсом в :issue:`31399`.)

source: The improved host name check requires a *libssl* implementation compatible with OpenSSL 1.0.2 or 1.1. Consequently, OpenSSL 0.9.8 and 1.0.1 are no longer supported (see :ref:`37-platform-support-removals` for more details). The ssl module is mostly compatible with LibreSSL 2.7.2 and newer.
ru: Для улучшенной проверки имени хоста требуется реализация *libssl*, совместимая с OpenSSL 1.0.2 или 1.1. Следовательно, OpenSSL 0.9.8 и 1.0.1 больше не поддерживаются (более подробную информацию см. в разделе :ref:`37-platform-support-removals`). Модуль SSL в основном совместим с LibreSSL 2.7.2 и новее.
