Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/whatsnew/3.7.po
Languages: ru

source: The new :c:func:`PyImport_GetModule` function returns the previously imported module with the given name. (Contributed by Eric Snow in :issue:`28411`.)
ru: Новая функция :c:func:`PyImport_GetModule` возвращает ранее импортированный модуль с заданным именем. (Предоставлено Эриком Сноу в :issue:`28411`.)

source: The new :c:macro:`Py_RETURN_RICHCOMPARE` macro eases writing rich comparison functions. (Contributed by Petr Victorin in :issue:`23699`.)
ru: Новый макрос :c:macro:`Py_RETURN_RICHCOMPARE` упрощает написание расширенных функций сравнения. (Предоставлено Петром Викторином в :issue:`23699`.)

source: The new :c:macro:`Py_UNREACHABLE` macro can be used to mark unreachable code paths. (Contributed by Barry Warsaw in :issue:`31338`.)
ru: Новый макрос :c:macro:`Py_UNREACHABLE` можно использовать для обозначения недоступных путей кода. (Предоставлено Барри Варшавой в :issue:`31338`.)

source: The :mod:`tracemalloc` now exposes a C API through the new :c:func:`PyTraceMalloc_Track` and :c:func:`PyTraceMalloc_Untrack` functions. (Contributed by Victor Stinner in :issue:`30054`.)
ru: :mod:`tracemalloc` теперь предоставляет C API через новые функции :c:func:`PyTraceMalloc_Track` и :c:func:`PyTraceMalloc_Untrack`. (Предоставлено Виктором Стиннером в :issue:`30054`.)

source: The new :c:func:`import__find__load__start` and :c:func:`import__find__load__done` static markers can be used to trace module imports. (Contributed by Christian Heimes in :issue:`31574`.)
ru: Новые статические маркеры :c:func:`import__find__load__start` и :c:func:`import__find__load__done` можно использовать для отслеживания импорта модулей. (Предоставлено Кристианом Хаймсом в :issue:`31574`.)

source: The fields :c:member:`!name` and :c:member:`!doc` of structures :c:type:`PyMemberDef`, :c:type:`PyGetSetDef`, :c:type:`PyStructSequence_Field`, :c:type:`PyStructSequence_Desc`, and :c:struct:`wrapperbase` are now of type ``const char *`` rather of ``char *``. (Contributed by Serhiy Storchaka in :issue:`28761`.)
ru: Поля :c:member:`!name` и :c:member:`!doc` структур :c:type:`PyMemberDef`, :c:type:`PyGetSetDef`, :c:type:`PyStructSequence_Field`, :c:type:`PyStructSequence_Desc` и :c:struct:`wrapperbase` теперь имеют тип ``const char *``, а не ``char *``. (Предоставлено Сергеем Сторчакой в ​​:issue:`28761`.)

source: The result of :c:func:`PyUnicode_AsUTF8AndSize` and :c:func:`PyUnicode_AsUTF8` is now of type ``const char *`` rather of ``char *``. (Contributed by Serhiy Storchaka in :issue:`28769`.)
ru: Результат :c:func:`PyUnicode_AsUTF8AndSize` и :c:func:`PyUnicode_AsUTF8` теперь имеет тип ``const char *``, а не ``char *``. (Предоставлено Сергеем Сторчакой в ​​:issue:`28769`.)

source: The result of :c:func:`PyMapping_Keys`, :c:func:`PyMapping_Values` and :c:func:`PyMapping_Items` is now always a list, rather than a list or a tuple. (Contributed by Oren Milman in :issue:`28280`.)
ru: Результатом :c:func:`PyMapping_Keys`, :c:func:`PyMapping_Values` и :c:func:`PyMapping_Items` теперь всегда является список, а не список или кортеж. (Предоставлено Ореном Милманом в :issue:`28280`.)

source: Added functions :c:func:`PySlice_Unpack` and :c:func:`PySlice_AdjustIndices`. (Contributed by Serhiy Storchaka in :issue:`27867`.)
ru: Добавлены функции :c:func:`PySlice_Unpack` и :c:func:`PySlice_AdjustIndices`. (Предоставлено Сергеем Сторчакой в ​​:issue:`27867`.)

source: :c:func:`PyOS_AfterFork` is deprecated in favour of the new functions :c:func:`PyOS_BeforeFork`, :c:func:`PyOS_AfterFork_Parent` and :c:func:`PyOS_AfterFork_Child`. (Contributed by Antoine Pitrou in :issue:`16500`.)
ru: :c:func:`PyOS_AfterFork` устарел в пользу новых функций :c:func:`PyOS_BeforeFork`, :c:func:`PyOS_AfterFork_Parent` и :c:func:`PyOS_AfterFork_Child`. (Предоставлено Антуаном Питру в :issue:`16500`.)

source: The ``PyExc_RecursionErrorInst`` singleton that was part of the public API has been removed as its members being never cleared may cause a segfault during finalization of the interpreter. Contributed by Xavier de Gaye in :issue:`22898` and :issue:`30697`.
ru: Синглтон ``PyExc_RecursionErrorInst``, который был частью общедоступного API, был удален, поскольку его члены, которые никогда не очищаются, могут вызвать ошибку сегмента во время завершения интерпретатора. Предоставлено Ксавье де Гайе в :issue:`22898` и :issue:`30697`.

source: Added C API support for timezones with timezone constructors :c:func:`PyTimeZone_FromOffset` and :c:func:`PyTimeZone_FromOffsetAndName`, and access to the UTC singleton with :c:data:`PyDateTime_TimeZone_UTC`. Contributed by Paul Ganssle in :issue:`10381`.
ru: Добавлена ​​поддержка C API для часовых поясов с помощью конструкторов часовых поясов :c:func:`PyTimeZone_FromOffset` и :c:func:`PyTimeZone_FromOffsetAndName`, а также доступ к синглтону UTC с помощью :c:data:`PyDateTime_TimeZone_UTC`. Предоставлено Полом Ганссле в :issue:`10381`.

source: The type of results of :c:func:`PyThread_start_new_thread` and :c:func:`PyThread_get_thread_ident`, and the *id* parameter of :c:func:`PyThreadState_SetAsyncExc` changed from :c:expr:`long` to :c:expr:`unsigned long`. (Contributed by Serhiy Storchaka in :issue:`6532`.)
ru: Тип результатов :c:func:`PyThread_start_new_thread` и :c:func:`PyThread_get_thread_ident`, а также параметр *id* :c:func:`PyThreadState_SetAsyncExc` изменился с :c:expr:`long` на : c:expr:`unsigned long`. (Предоставлено Сергеем Сторчакой в ​​:issue:`6532`.)

source: :c:func:`PyUnicode_AsWideCharString` now raises a :exc:`ValueError` if the second argument is ``NULL`` and the :c:expr:`wchar_t*` string contains null characters. (Contributed by Serhiy Storchaka in :issue:`30708`.)
ru: :c:func:`PyUnicode_AsWideCharString` теперь вызывает :exc:`ValueError`, если второй аргумент равен ``NULL`` и строка :c:expr:`wchar_t*` содержит нулевые символы. (Предоставлено Сергеем Сторчакой в ​​:issue:`30708`.)

source: Changes to the startup sequence and the management of dynamic memory allocators mean that the long documented requirement to call :c:func:`Py_Initialize` before calling most C API functions is now relied on more heavily, and failing to abide by it may lead to segfaults in embedding applications. See the :ref:`porting-to-python-37` section in this document and the :ref:`pre-init-safe` section in the C API documentation for more details.
ru: Изменения в последовательности запуска и управлении распределителями динамической памяти означают, что давно задокументированное требование вызывать :c:func:`Py_Initialize` перед вызовом большинства функций C API теперь применяется в большей степени, и несоблюдение этого требования может привести к segfaults при внедрении приложений. Дополнительные сведения см. в разделе :ref:`porting-to-python-37` в этом документе и в разделе :ref:`pre-init-safe` в документации по C API.

source: The new :c:func:`PyInterpreterState_GetID` returns the unique ID for a given interpreter. (Contributed by Eric Snow in :issue:`29102`.)
ru: Новый :c:func:`PyInterpreterState_GetID` возвращает уникальный идентификатор для данного интерпретатора. (Предоставлено Эриком Сноу в :issue:`29102`.)

source: :c:func:`Py_DecodeLocale`, :c:func:`Py_EncodeLocale` now use the UTF-8 encoding when the :ref:`UTF-8 mode <whatsnew37-pep540>` is enabled. (Contributed by Victor Stinner in :issue:`29240`.)
ru: :c:func:`Py_DecodeLocale`, :c:func:`Py_EncodeLocale` теперь используют кодировку UTF-8, когда включен режим :ref:`UTF-8 <whatsnew37-pep540>`. (Предоставлено Виктором Стиннером в :issue:`29240`.)

source: :c:func:`PyUnicode_DecodeLocaleAndSize` and :c:func:`PyUnicode_EncodeLocale` now use the current locale encoding for ``surrogateescape`` error handler. (Contributed by Victor Stinner in :issue:`29240`.)
ru: :c:func:`PyUnicode_DecodeLocaleAndSize` и :c:func:`PyUnicode_EncodeLocale` теперь используют текущую кодировку локали для обработчика ошибок ``surrogateescape``. (Предоставлено Виктором Стиннером в :issue:`29240`.)

source: The *start* and *end* parameters of :c:func:`PyUnicode_FindChar` are now adjusted to behave like string slices. (Contributed by Xiang Zhang in :issue:`28822`.)
ru: Параметры *start* и *end* :c:func:`PyUnicode_FindChar` теперь настроены так, чтобы вести себя как фрагменты строки. (Предоставлено Сян Чжаном в :issue:`28822`.)

source: Build Changes
ru: Изменения сборки

source: Support for building ``--without-threads`` has been removed. The :mod:`threading` module is now always available. (Contributed by Antoine Pitrou in :issue:`31370`.).
ru: Поддержка построения ``--without-threads`` была удалена. Модуль :mod:`threading` теперь всегда доступен. (Предоставлено Антуаном Питру в :issue:`31370`.).

source: A full copy of libffi is no longer bundled for use when building the :mod:`_ctypes <ctypes>` module on non-OSX UNIX platforms. An installed copy of libffi is now required when building ``_ctypes`` on such platforms. (Contributed by Zachary Ware in :issue:`27979`.)
ru: Полная копия libffi больше не поставляется для использования при сборке модуля :mod:`_ctypes <ctypes>` на платформах UNIX, отличных от OSX. Установленная копия libffi теперь требуется при сборке ``_ctypes`` на таких платформах. (Предоставлено Закари Уэром в :issue:`27979`.)

source: The Windows build process no longer depends on Subversion to pull in external sources, a Python script is used to download zipfiles from GitHub instead. If Python 3.6 is not found on the system (via ``py -3.6``), NuGet is used to download a copy of 32-bit Python for this purpose. (Contributed by Zachary Ware in :issue:`30450`.)
ru: Процесс сборки Windows больше не зависит от Subversion для получения внешних источников, вместо этого для загрузки zip-файлов с GitHub используется сценарий Python. Если Python 3.6 не найден в системе (через ``py -3.6``), для этой цели используется NuGet для загрузки копии 32-битного Python. (Предоставлено Закари Уэром в :issue:`30450`.)

source: The :mod:`ssl` module requires OpenSSL 1.0.2 or 1.1 compatible libssl. OpenSSL 1.0.1 has reached end of lifetime on 2016-12-31 and is no longer supported. LibreSSL is temporarily not supported as well. LibreSSL releases up to version 2.6.4 are missing required OpenSSL 1.0.2 APIs.
ru: Для модуля :mod:`ssl` требуется библиотека libssl, совместимая с OpenSSL 1.0.2 или 1.1. Срок службы OpenSSL 1.0.1 истек 31 декабря 2016 г., и он больше не поддерживается. LibreSSL также временно не поддерживается. В выпусках LibreSSL до версии 2.6.4 отсутствуют необходимые API OpenSSL 1.0.2.

source: Optimizations
ru: Оптимизации

source: The overhead of calling many methods of various standard library classes implemented in C has been significantly reduced by porting more code to use the ``METH_FASTCALL`` convention. (Contributed by Victor Stinner in :issue:`29300`, :issue:`29507`, :issue:`29452`, and :issue:`29286`.)
ru: Накладные расходы на вызов многих методов различных классов стандартной библиотеки, реализованных на C, были значительно уменьшены за счет переноса большего количества кода для использования соглашения METH_FASTCALL. (Внесено Виктором Стиннером в :issue:`29300`, :issue:`29507`, :issue:`29452` и :issue:`29286`.)

source: Various optimizations have reduced Python startup time by 10% on Linux and up to 30% on macOS. (Contributed by Victor Stinner, INADA Naoki in :issue:`29585`, and Ivan Levkivskyi in :issue:`31333`.)
ru: Различные оптимизации сократили время запуска Python на 10 % в Linux и до 30 % в macOS. (Предоставлено Виктором Стиннером, INADA Наоки в :issue:`29585` и Иваном Левковским в :issue:`31333`.)

source: Method calls are now up to 20% faster due to the bytecode changes which avoid creating bound method instances. (Contributed by Yury Selivanov and INADA Naoki in :issue:`26110`.)
ru: Вызовы методов теперь выполняются на 20 % быстрее благодаря изменениям байт-кода, которые позволяют избежать создания связанных экземпляров метода. (Предоставлено Юрием Селивановым и INADA Naoki в :issue:`26110`.)

source: The :mod:`asyncio` module received a number of notable optimizations for commonly used functions:
ru: Модуль :mod:`asyncio` получил ряд заметных оптимизаций для часто используемых функций:

source: The :func:`asyncio.get_event_loop` function has been reimplemented in C to make it up to 15 times faster. (Contributed by Yury Selivanov in :issue:`32296`.)
ru: Функция :func:`asyncio.get_event_loop` была переопределена в C, чтобы сделать ее до 15 раз быстрее. (Добавлен Юрием Селивановым в :issue:`32296`.)

source: :class:`asyncio.Future` callback management has been optimized. (Contributed by Yury Selivanov in :issue:`32348`.)
ru: :class:`asyncio.Future` управление обратными вызовами было оптимизировано. (Автор: Юрий Селиванов в :issue:`32348`.)

source: :func:`asyncio.gather` is now up to 15% faster. (Contributed by Yury Selivanov in :issue:`32355`.)
ru: :func:`asyncio.gather` теперь работает до 15% быстрее. (Добавлен Юрием Селивановым в :issue:`32355`.)

source: :func:`asyncio.sleep` is now up to 2 times faster when the *delay* argument is zero or negative. (Contributed by Andrew Svetlov in :issue:`32351`.)
ru: :func:`asyncio.sleep` теперь работает до 2 раз быстрее, если аргумент *delay* равен нулю или имеет отрицательное значение. (Предоставлено Андреем Светловым в :issue:`32351`.)

source: The performance overhead of asyncio debug mode has been reduced. (Contributed by Antoine Pitrou in :issue:`31970`.)
ru: Накладные расходы на производительность в режиме отладки asyncio были уменьшены. (Предоставлено Антуаном Питру в :issue:`31970`.)

source: As a result of :ref:`PEP 560 work <whatsnew37-pep560>`, the import time of :mod:`typing` has been reduced by a factor of 7, and many typing operations are now faster. (Contributed by Ivan Levkivskyi in :issue:`32226`.)
ru: В результате работы :ref:`PEP 560 <whatsnew37-pep560>` время импорта :mod:`typing` сократилось в 7 раз, и многие операции ввода теперь выполняются быстрее. (Предоставлено Иваном Левковским в :issue:`32226`.)

source: :func:`sorted` and :meth:`list.sort` have been optimized for common cases to be up to 40-75% faster. (Contributed by Elliot Gorokhovsky in :issue:`28685`.)
ru: :func:`sorted` и :meth:`list.sort` оптимизированы для обычных случаев и теперь работают на 40–75 % быстрее. (Предоставлено Эллиотом Гороховским в :issue:`28685`.)

source: :meth:`dict.copy` is now up to 5.5 times faster. (Contributed by Yury Selivanov in :issue:`31179`.)
ru: :meth:`dict.copy` теперь работает до 5,5 раз быстрее. (Добавлен Юрием Селивановым в :issue:`31179`.)

source: :func:`hasattr` and :func:`getattr` are now about 4 times faster when *name* is not found and *obj* does not override :meth:`object.__getattr__` or :meth:`object.__getattribute__`. (Contributed by INADA Naoki in :issue:`32544`.)
ru: :func:`hasattr` и :func:`getattr` теперь работают примерно в 4 раза быстрее, если *name* не найдено и *obj* не переопределяет :meth:`object.__getattr__` или :meth:`object.__getattribute__` . (Предоставлено ИНАДА Наоки в :issue:`32544`.)

source: Searching for certain Unicode characters (like Ukrainian capital "Є") in a string was up to 25 times slower than searching for other characters. It is now only 3 times slower in the worst case. (Contributed by Serhiy Storchaka in :issue:`24821`.)
ru: Поиск определенных символов Юникода (например, украинской заглавной буквы «Є») в строке был до 25 раз медленнее, чем поиск других символов. Теперь в худшем случае он медленнее всего в 3 раза. (Предоставлено Сергеем Сторчакой в ​​:issue:`24821`.)

source: The :func:`collections.namedtuple` factory has been reimplemented to make the creation of named tuples 4 to 6 times faster. (Contributed by Jelle Zijlstra with further improvements by INADA Naoki, Serhiy Storchaka, and Raymond Hettinger in :issue:`28638`.)
ru: Фабрика :func:`collections.namedtuple` была переопределена, чтобы ускорить создание именованных кортежей в 4–6 раз. (Внесено Джелле Зийлстра, дальнейшие улучшения внесены Инадой Наоки, Сергеем Сторчакой и Раймондом Хеттингером в :issue:`28638`.)

source: :meth:`date.fromordinal` and :meth:`date.fromtimestamp` are now up to 30% faster in the common case. (Contributed by Paul Ganssle in :issue:`32403`.)
ru: :meth:`date.fromordinal` и :meth:`date.fromtimestamp` теперь в обычном случае работают до 30 % быстрее. (Предоставлено Полом Гансслом в :issue:`32403`.)

source: The :func:`os.fwalk` function is now up to 2 times faster thanks to the use of :func:`os.scandir`. (Contributed by Serhiy Storchaka in :issue:`25996`.)
ru: Функция :func:`os.fwalk` теперь работает до 2 раз быстрее благодаря использованию :func:`os.scandir`. (Добавлен Сергеем Сторчакой в ​​:issue:`25996`.)

source: The speed of the :func:`shutil.rmtree` function has been improved by 20--40% thanks to the use of the :func:`os.scandir` function. (Contributed by Serhiy Storchaka in :issue:`28564`.)
ru: Скорость работы функции :func:`shutil.rmtree` увеличена на 20--40% благодаря использованию функции :func:`os.scandir`. (Предоставлено Сергеем Сторчакой в ​​:issue:`28564`.)

source: Optimized case-insensitive matching and searching of :mod:`regular expressions <re>`. Searching some patterns can now be up to 20 times faster. (Contributed by Serhiy Storchaka in :issue:`30285`.)
ru: Оптимизировано сопоставление и поиск по :mod:`регулярным выражениям <re>` без учета регистра. Поиск некоторых шаблонов теперь может выполняться до 20 раз быстрее. (Предоставлено Сергеем Сторчакой в ​​:issue:`30285`.)

source: :func:`re.compile` now converts ``flags`` parameter to int object if it is ``RegexFlag``. It is now as fast as Python 3.5, and faster than Python 3.6 by about 10% depending on the pattern. (Contributed by INADA Naoki in :issue:`31671`.)
ru: :func:`re.compile` теперь преобразует параметр ``flags`` в объект int, если это ``RegexFlag``. Теперь он так же быстр, как Python 3.5, и быстрее Python 3.6 примерно на 10 % в зависимости от шаблона. (Предоставлено ИНАДА Наоки в :issue:`31671`.)

source: The :meth:`~selectors.BaseSelector.modify` methods of classes :class:`selectors.EpollSelector`, :class:`selectors.PollSelector` and :class:`selectors.DevpollSelector` may be around 10% faster under heavy loads. (Contributed by Giampaolo Rodola' in :issue:`30014`)
ru: Методы :meth:`~selectors.BaseSelector.modify` классов :class:`selectors.EpollSelector`, :class:`selectors.PollSelector` и :class:`selectors.DevpollSelector` могут работать примерно на 10 % быстрее при больших нагрузках. . (Предоставлено Джампаоло Родолой в :issue:`30014`)

source: Constant folding has been moved from the peephole optimizer to the new AST optimizer, which is able perform optimizations more consistently. (Contributed by Eugene Toder and INADA Naoki in :issue:`29469` and :issue:`11549`.)
ru: Свертывание констант было перенесено из оптимизатора глазка в новый оптимизатор AST, который может выполнять оптимизацию более последовательно. (Предоставлено Юджином Тодером и INADA Наоки в :issue:`29469` и :issue:`11549`.)

source: Most functions and methods in :mod:`abc` have been rewritten in C. This makes creation of abstract base classes, and calling :func:`isinstance` and :func:`issubclass` on them 1.5x faster. This also reduces Python start-up time by up to 10%. (Contributed by Ivan Levkivskyi and INADA Naoki in :issue:`31333`)
ru: Большинство функций и методов в :mod:`abc` были переписаны на C. Это делает создание абстрактных базовых классов и вызов :func:`isinstance` и :func:`issubclass` для них в 1,5 раза быстрее. Это также сокращает время запуска Python почти на 10%. (Предоставлено Иваном Левковским и ИНАДА Наоки в :issue:`31333`)

source: Significant speed improvements to alternate constructors for :class:`datetime.date` and :class:`datetime.datetime` by using fast-path constructors when not constructing subclasses. (Contributed by Paul Ganssle in :issue:`32403`)
ru: Значительное повышение скорости альтернативных конструкторов для :class:`datetime.date` и :class:`datetime.datetime` за счет использования конструкторов быстрого пути, когда не создаются подклассы. (Предоставлено Полом Гансслом в :issue:`32403`)

source: The speed of comparison of :class:`array.array` instances has been improved considerably in certain cases. It is now from 10x to 70x faster when comparing arrays holding values of the same integer type. (Contributed by Adrian Wielgosik in :issue:`24700`.)
ru: Скорость сравнения экземпляров :class:`array.array` в некоторых случаях значительно улучшена. Теперь сравнение массивов, содержащих значения одного целочисленного типа, происходит в 10–70 раз быстрее. (Предоставлено Адрианом Вельгосиком в :issue:`24700`.)

source: The :func:`math.erf` and :func:`math.erfc` functions now use the (faster) C library implementation on most platforms. (Contributed by Serhiy Storchaka in :issue:`26121`.)
ru: Функции :func:`math.erf` и :func:`math.erfc` теперь используют (более быструю) реализацию библиотеки C на большинстве платформ. (Предоставлено Сергеем Сторчакой в ​​:issue:`26121`.)

source: Other CPython Implementation Changes
ru: Другие изменения реализации CPython

source: Trace hooks may now opt out of receiving the ``line`` and opt into receiving the ``opcode`` events from the interpreter by setting the corresponding new :attr:`~frame.f_trace_lines` and :attr:`~frame.f_trace_opcodes` attributes on the frame being traced. (Contributed by Nick Coghlan in :issue:`31344`.)
ru: Перехватчики трассировки теперь могут отказаться от получения строки и включить получение событий кода операции от интерпретатора, установив соответствующие новые :attr:`~frame.f_trace_lines` и :attr:`~frame. Атрибуты f_trace_opcodes` в отслеживаемом кадре. (Предоставлено Ником Когланом в :issue:`31344`.)

source: Fixed some consistency problems with namespace package module attributes. Namespace module objects now have an ``__file__`` that is set to ``None`` (previously unset), and their ``__spec__.origin`` is also set to ``None`` (previously the string ``"namespace"``). See :issue:`32305`. Also, the namespace module object's ``__spec__.loader`` is set to the same value as ``__loader__`` (previously, the former was set to ``None``). See :issue:`32303`.
ru: Исправлены некоторые проблемы согласованности атрибутов модуля пакета пространства имен. Объекты модуля пространства имен теперь имеют ``__file__``, для которого установлено значение ``None`` (ранее не было установлено), а их ``__spec__.origin`` также установлено в ``None`` (ранее строка ``" пространство имен"``). См. :issue:`32305`. Кроме того, для объекта модуля пространства имен ``__spec__.loader`` установлено то же значение, что и для ``__loader__`` (ранее для первого было установлено значение ``None``). См. :issue:`32303`.

source: The :func:`locals` dictionary now displays in the lexical order that variables were defined. Previously, the order was undefined. (Contributed by Raymond Hettinger in :issue:`32690`.)
ru: Словарь :func:`locals` теперь отображается в том лексическом порядке, в котором были определены переменные. Раньше порядок был неопределенным. (Предоставлено Рэймондом Хеттингером в :issue:`32690`.)

source: The ``distutils`` ``upload`` command no longer tries to change CR end-of-line characters to CRLF. This fixes a corruption issue with sdists that ended with a byte equivalent to CR. (Contributed by Bo Bayles in :issue:`32304`.)
ru: Команда ``distutils`` ``upload`` больше не пытается изменить символы конца строки CR на CRLF. Это устраняет проблему повреждения sdists, заканчивающихся байтом, эквивалентным CR. (Предоставлено Бо Бейлсом в :issue:`32304`.)

source: Deprecated Python Behavior
ru: Устаревшее поведение Python
