Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/whatsnew/3.8.po
Languages: ru

source: What's New In Python 3.8
ru: Что нового в Python 3.8

source: Editor
ru: Редактор

source: This article explains the new features in Python 3.8, compared to 3.7. Python 3.8 was released on October 14, 2019. For full details, see the :ref:`changelog <changelog>`.
ru: В этой статье объясняются новые возможности Python 3.8 по сравнению с версией 3.7. Python 3.8 был выпущен 14 октября 2019 года. Полную информацию см. в журнале изменений <changelog>`.

source: Summary -- Release highlights
ru: Краткое описание - Основные моменты релиза

source: New Features
ru: Новые особенности

source: Assignment expressions
ru: Выражения присваивания

source: There is new syntax ``:=`` that assigns values to variables as part of a larger expression. It is affectionately known as "the walrus operator" due to its resemblance to `the eyes and tusks of a walrus <https://en.wikipedia.org/wiki/Walrus#/media/File:Pacific_Walrus_-_Bull_(8247646168).jpg>`_.
ru: Существует новый синтаксис ``:=``, который присваивает значения переменным как часть более крупного выражения. Его ласково называют «моржовым оператором» из-за его сходства с «глазами и бивнями моржа <https://en.wikipedia.org/wiki/Walrus#/media/File:Pacific_Walrus_-_Bull_(8247646168). jpg>`_.

source: In this example, the assignment expression helps avoid calling :func:`len` twice::
ru: В этом примере выражение присваивания помогает избежать двойного вызова :func:`len`::

source: A similar benefit arises during regular expression matching where match objects are needed twice, once to test whether a match occurred and another to extract a subgroup::
ru: Аналогичное преимущество возникает при сопоставлении регулярных выражений, когда объекты сопоставления необходимы дважды: один раз для проверки наличия совпадения, а другой — для извлечения подгруппы:

source: The operator is also useful with while-loops that compute a value to test loop termination and then need that same value again in the body of the loop::
ru: Оператор также полезен в циклах while, которые вычисляют значение для проверки завершения цикла, а затем снова требуют того же значения в теле цикла::

source: Another motivating use case arises in list comprehensions where a value computed in a filtering condition is also needed in the expression body::
ru: Другой мотивирующий вариант использования возникает в генераторах списков, где значение, вычисленное в условии фильтрации, также необходимо в теле выражения:

source: Try to limit use of the walrus operator to clean cases that reduce complexity and improve readability.
ru: Постарайтесь ограничить использование оператора «морж» для очистки случаев, что уменьшит сложность и улучшит читаемость.

source: See :pep:`572` for a full description.
ru: См. полное описание в :pep:`572`.

source: (Contributed by Emily Morehouse in :issue:`35224`.)
ru: (Предоставлено Эмили Морхаус в :issue:`35224`.)

source: Positional-only parameters
ru: Только позиционные параметры

source: In the following example, parameters *a* and *b* are positional-only, while *c* or *d* can be positional or keyword, and *e* or *f* are required to be keywords::
ru: В следующем примере параметры *a* и *b* являются только позиционными, тогда как *c* или *d* могут быть позиционными или ключевыми словами, а *e* или *f* должны быть ключевыми словами::

source: The following is a valid call::
ru: Ниже приведен действительный вызов::

source: However, these are invalid calls::
ru: Однако это недействительные вызовы::

source: One use case for this notation is that it allows pure Python functions to fully emulate behaviors of existing C coded functions. For example, the built-in :func:`divmod` function does not accept keyword arguments::
ru: Одним из вариантов использования этой нотации является то, что она позволяет чистым функциям Python полностью эмулировать поведение существующих функций, написанных на C. Например, встроенная функция :func:`divmod` не принимает аргументы ключевых слов::

source: Another use case is to preclude keyword arguments when the parameter name is not helpful. For example, the builtin :func:`len` function has the signature ``len(obj, /)``. This precludes awkward calls such as::
ru: Другой вариант использования — исключить аргументы ключевого слова, когда имя параметра бесполезно. Например, встроенная функция :func:`len` имеет сигнатуру ``len(obj, /)``. Это исключает неудобные вызовы, такие как::

source: A further benefit of marking a parameter as positional-only is that it allows the parameter name to be changed in the future without risk of breaking client code. For example, in the :mod:`statistics` module, the parameter name *dist* may be changed in the future. This was made possible with the following function specification::
ru: Еще одним преимуществом маркировки параметра как позиционного является то, что оно позволяет изменить имя параметра в будущем без риска нарушения клиентского кода. Например, в модуле :mod:`statistics` имя параметра *dist* может быть изменено в будущем. Это стало возможным благодаря следующей спецификации функции:

source: Since the parameters to the left of ``/`` are not exposed as possible keywords, the parameters names remain available for use in ``**kwargs``::
ru: Поскольку параметры слева от ``/`` не представлены как возможные ключевые слова, имена параметров остаются доступными для использования в ``**kwargs``::

source: This greatly simplifies the implementation of functions and methods that need to accept arbitrary keyword arguments. For example, here is an excerpt from code in the :mod:`collections` module::
ru: Это значительно упрощает реализацию функций и методов, которым необходимо принимать произвольные аргументы ключевых слов. Например, вот отрывок из кода модуля :mod:`collections`::

source: See :pep:`570` for a full description.
ru: См. полное описание в :pep:`570`.

source: (Contributed by Pablo Galindo in :issue:`36540`.)
ru: (Предоставлено Пабло Галиндо в :issue:`36540`.)

source: Parallel filesystem cache for compiled bytecode files
ru: Кэш параллельной файловой системы для скомпилированных файлов байт-кода

source: The new :envvar:`PYTHONPYCACHEPREFIX` setting (also available as :option:`-X` ``pycache_prefix``) configures the implicit bytecode cache to use a separate parallel filesystem tree, rather than the default ``__pycache__`` subdirectories within each source directory.
ru: Новый параметр :envvar:`PYTHONPYCACHEPREFIX` (также доступен как :option:`-X` ``pycache_prefix``) настраивает неявный кеш байт-кода для использования отдельного параллельного дерева файловой системы, а не подкаталогов по умолчанию ``__pycache__`` внутри каждый исходный каталог.

source: The location of the cache is reported in :data:`sys.pycache_prefix` (:const:`None` indicates the default location in ``__pycache__`` subdirectories).
ru: Местоположение кэша указывается в :data:`sys.pycache_prefix` (:const:`None` указывает местоположение по умолчанию в подкаталогах ``__pycache__``).

source: (Contributed by Carl Meyer in :issue:`33499`.)
ru: (Предоставлено Карлом Мейером в :issue:`33499`.)

source: Debug build uses the same ABI as release build
ru: Отладочная сборка использует тот же ABI, что и выпускная сборка.

source: Python now uses the same ABI whether it's built in release or debug mode. On Unix, when Python is built in debug mode, it is now possible to load C extensions built in release mode and C extensions built using the stable ABI.
ru: Python теперь использует один и тот же ABI независимо от того, встроен ли он в режим выпуска или в режим отладки. В Unix, когда Python собран в режиме отладки, теперь можно загружать расширения C, созданные в режиме выпуска, и расширения C, созданные с использованием стабильного ABI.

source: Release builds and :ref:`debug builds <debug-build>` are now ABI compatible: defining the ``Py_DEBUG`` macro no longer implies the ``Py_TRACE_REFS`` macro, which introduces the only ABI incompatibility. The ``Py_TRACE_REFS`` macro, which adds the :func:`sys.getobjects` function and the :envvar:`PYTHONDUMPREFS` environment variable, can be set using the new :option:`./configure --with-trace-refs <--with-trace-refs>` build option. (Contributed by Victor Stinner in :issue:`36465`.)
ru: Сборки выпуска и сборки отладки <debug-build>` теперь совместимы с ABI: определение макроса ``Py_DEBUG`` больше не подразумевает использование макроса ``Py_TRACE_REFS``, который представляет собой единственную несовместимость с ABI. Макрос Py_TRACE_REFS, который добавляет функцию :func:`sys.getobjects` и переменную среды :envvar:`PYTHONDUMPREFS`, можно установить с помощью нового :option:`./configure --with-trace- refs <--with-trace-refs>` опция сборки. (Предоставлено Виктором Стиннером в :issue:`36465`.)

source: On Unix, C extensions are no longer linked to libpython except on Android and Cygwin. It is now possible for a statically linked Python to load a C extension built using a shared library Python. (Contributed by Victor Stinner in :issue:`21536`.)
ru: В Unix расширения C больше не связаны с libpython, за исключением Android и Cygwin. Теперь статически связанный Python может загружать расширение C, созданное с использованием общей библиотеки Python. (Предоставлено Виктором Стиннером в :issue:`21536`.)

source: On Unix, when Python is built in debug mode, import now also looks for C extensions compiled in release mode and for C extensions compiled with the stable ABI. (Contributed by Victor Stinner in :issue:`36722`.)
ru: В Unix, когда Python собирается в режиме отладки, импорт теперь также ищет расширения C, скомпилированные в режиме выпуска, и расширения C, скомпилированные со стабильным ABI. (Предоставлено Виктором Стиннером в :issue:`36722`.)

source: To embed Python into an application, a new ``--embed`` option must be passed to ``python3-config --libs --embed`` to get ``-lpython3.8`` (link the application to libpython). To support both 3.8 and older, try ``python3-config --libs --embed`` first and fallback to ``python3-config --libs`` (without ``--embed``) if the previous command fails.
ru: Чтобы встроить Python в приложение, необходимо передать новую опцию ``--embed`` в ``python3-config --libs --embed``, чтобы получить ``-lpython3.8`` (свяжите приложение с libpython ). Для поддержки версий 3.8 и старше попробуйте сначала ``python3-config --libs --embed`` и вернитесь к ``python3-config --libs`` (без ``--embed``), если предыдущая команда не удалась. .

source: Add a pkg-config ``python-3.8-embed`` module to embed Python into an application: ``pkg-config python-3.8-embed --libs`` includes ``-lpython3.8``. To support both 3.8 and older, try ``pkg-config python-X.Y-embed --libs`` first and fallback to ``pkg-config python-X.Y --libs`` (without ``--embed``) if the previous command fails (replace ``X.Y`` with the Python version).
ru: Добавьте модуль pkg-config ``python-3.8-embed`` для встраивания Python в приложение: ``pkg-config python-3.8-embed --libs`` включает ``-lpython3.8``. Для поддержки версий 3.8 и старше попробуйте сначала ``pkg-config python-XY-embed --libs`` и откатитесь к ``pkg-config python-XY --libs`` (без ``--embed``) если предыдущая команда не удалась (замените ``XY`` на версию Python).

source: On the other hand, ``pkg-config python3.8 --libs`` no longer contains ``-lpython3.8``. C extensions must not be linked to libpython (except on Android and Cygwin, whose cases are handled by the script); this change is backward incompatible on purpose. (Contributed by Victor Stinner in :issue:`36721`.)
ru: С другой стороны, ``pkg-config python3.8 --libs`` больше не содержит ``-lpython3.8``. Расширения C не должны быть связаны с libpython (за исключением Android и Cygwin, случаи которых обрабатываются сценарием); это изменение намеренно обратно несовместимо. (Предоставлено Виктором Стиннером в :issue:`36721`.)

source: f-strings support ``=`` for self-documenting expressions and debugging
ru: f-строки поддерживают ``=`` для самодокументируемых выражений и отладки.

source: Added an ``=`` specifier to :term:`f-string`\s. An f-string such as ``f'{expr=}'`` will expand to the text of the expression, an equal sign, then the representation of the evaluated expression. For example:
ru: Добавлен спецификатор ``=`` в :term:`f-string`\s. f-строка, такая как ``f'{expr=}'``, будет расширяться до текста выражения, знака равенства, а затем представления вычисленного выражения. Например:

source: The usual :ref:`f-string format specifiers <f-strings>` allow more control over how the result of the expression is displayed::
ru: Обычные спецификаторы формата f-string <f-strings>` позволяют лучше контролировать отображение результата выражения::

source: The ``=`` specifier will display the whole expression so that calculations can be shown::
ru: Спецификатор ``=`` отобразит все выражение, чтобы можно было показать вычисления::

source: (Contributed by Eric V. Smith and Larry Hastings in :issue:`36817`.)
ru: (Предоставлено Эриком В. Смитом и Ларри Гастингсом в :issue:`36817`.)

source: PEP 578: Python Runtime Audit Hooks
ru: PEP 578: Хуки аудита среды выполнения Python

source: The PEP adds an Audit Hook and Verified Open Hook. Both are available from Python and native code, allowing applications and frameworks written in pure Python code to take advantage of extra notifications, while also allowing embedders or system administrators to deploy builds of Python where auditing is always enabled.
ru: PEP добавляет перехватчик аудита и проверенный открытый перехватчик. Оба доступны из Python и собственного кода, что позволяет приложениям и платформам, написанным на чистом коде Python, использовать дополнительные уведомления, а также позволяет специалистам по внедрению или системным администраторам развертывать сборки Python, где аудит всегда включен.

source: See :pep:`578` for full details.
ru: Подробности смотрите в :pep:`578`.

source: PEP 587: Python Initialization Configuration
ru: PEP 587: Конфигурация инициализации Python

source: The :pep:`587` adds a new C API to configure the Python Initialization providing finer control on the whole configuration and better error reporting.
ru: :pep:`587` добавляет новый C API для настройки инициализации Python, обеспечивающий более точный контроль над всей конфигурацией и улучшенные отчеты об ошибках.

source: New structures:
ru: Новые структуры:

source: New functions:
ru: Новые функции:

source: This PEP also adds ``_PyRuntimeState.preconfig`` (:c:type:`PyPreConfig` type) and ``PyInterpreterState.config`` (:c:type:`PyConfig` type) fields to these internal structures. ``PyInterpreterState.config`` becomes the new reference configuration, replacing global configuration variables and other private variables.
ru: Этот PEP также добавляет поля ``_PyRuntimeState.preconfig`` (:c:type:`PyPreConfig` type) и ``PyInterpreterState.config`` (:c:type:`PyConfig` type) к этим внутренним структурам. ``PyInterpreterState.config`` становится новой эталонной конфигурацией, заменяя глобальные переменные конфигурации и другие частные переменные.

source: See :ref:`Python Initialization Configuration <init-config>` for the documentation.
ru: См. документацию в разделе :ref:`Конфигурация инициализации Python <init-config>`.

source: See :pep:`587` for a full description.
ru: См. полное описание в :pep:`587`.

source: (Contributed by Victor Stinner in :issue:`36763`.)
ru: (Предоставлено Виктором Стиннером в :issue:`36763`.)

source: PEP 590: Vectorcall: a fast calling protocol for CPython
ru: PEP 590: Vectorcall: протокол быстрого вызова для CPython

source: :ref:`vectorcall` is added to the Python/C API. It is meant to formalize existing optimizations which were already done for various classes. Any :ref:`static type <static-types>` implementing a callable can use this protocol.
ru: :ref:`vectorcall` добавлен в API Python/C. Он предназначен для формализации существующих оптимизаций, которые уже были сделаны для различных классов. Любой статический тип <static-types>`, реализующий вызываемый объект, может использовать этот протокол.

source: This is currently provisional. The aim is to make it fully public in Python 3.9.
ru: В настоящее время это предварительно. Цель состоит в том, чтобы сделать его полностью общедоступным в Python 3.9.

source: See :pep:`590` for a full description.
ru: См. полное описание в :pep:`590`.

source: (Contributed by Jeroen Demeyer, Mark Shannon and Petr Viktorin in :issue:`36974`.)
ru: (Предоставлено Йеруном Демейером, Марком Шенноном и Петром Викторином в :issue:`36974`.)

source: Pickle protocol 5 with out-of-band data buffers
ru: Модуль :mod:`typing` включает в себя несколько новых функций:

source: When :mod:`pickle` is used to transfer large data between Python processes in order to take advantage of multi-core or multi-machine processing, it is important to optimize the transfer by reducing memory copies, and possibly by applying custom techniques such as data-dependent compression.
ru: Когда :mod:`pickle` используется для передачи больших данных между процессами Python, чтобы воспользоваться преимуществами многоядерной или многомашинной обработки, важно оптимизировать передачу, уменьшая количество копий в памяти и, возможно, применяя специальные методы, такие как как сжатие, зависящее от данных.

source: The :mod:`pickle` protocol 5 introduces support for out-of-band buffers where :pep:`3118`-compatible data can be transmitted separately from the main pickle stream, at the discretion of the communication layer.
ru: Протокол :mod:`pickle` 5 обеспечивает поддержку внеполосных буферов, где :pep:`3118`-совместимые данные могут передаваться отдельно от основного потока Pickle, по усмотрению уровня связи.

source: See :pep:`574` for a full description.
ru: См. полное описание в :pep:`574`.

source: (Contributed by Antoine Pitrou in :issue:`36785`.)
ru: (Предоставлено Антуаном Питру в :issue:`36785`.)

source: Other Language Changes
ru: Другие языковые изменения

source: A :keyword:`continue` statement was illegal in the :keyword:`finally` clause due to a problem with the implementation. In Python 3.8 this restriction was lifted. (Contributed by Serhiy Storchaka in :issue:`32489`.)
ru: Оператор :keyword:`continue` был недопустим в предложении :keyword:`finally` из-за проблемы с реализацией. В Python 3.8 это ограничение было снято. (Предоставлено Сергеем Сторчакой в ​​:issue:`32489`.)

source: The :class:`bool`, :class:`int`, and :class:`fractions.Fraction` types now have an :meth:`~int.as_integer_ratio` method like that found in :class:`float` and :class:`decimal.Decimal`. This minor API extension makes it possible to write ``numerator, denominator = x.as_integer_ratio()`` and have it work across multiple numeric types. (Contributed by Lisa Roach in :issue:`33073` and Raymond Hettinger in :issue:`37819`.)
ru: Типы :class:`bool`, :class:`int` и :class:`fractions.Fraction` теперь имеют метод :meth:`~int.as_integer_ratio`, подобный тому, который можно найти в :class:`float` и : класс:`decimal.Decimal`. Это незначительное расширение API позволяет писать ``numerator, denominator = x.as_integer_ratio()`` и работать с несколькими числовыми типами. (Предоставлено Лизой Роуч в :issue:`33073` и Рэймондом Хеттингером в :issue:`37819`.)

source: Constructors of :class:`int`, :class:`float` and :class:`complex` will now use the :meth:`~object.__index__` special method, if available and the corresponding method :meth:`~object.__int__`, :meth:`~object.__float__` or :meth:`~object.__complex__` is not available. (Contributed by Serhiy Storchaka in :issue:`20092`.)
ru: Конструкторы :class:`int`, :class:`float` и :class:`complex` теперь будут использовать специальный метод :meth:`~object.__index__`, если он доступен, и соответствующий метод :meth:`~object. .__int__`, :meth:`~object.__float__` или :meth:`~object.__complex__` недоступны. (Предоставлено Сергеем Сторчакой в ​​:issue:`20092`.)

source: (Contributed by Jonathan Eunice and Serhiy Storchaka in :issue:`30688`.)
ru: (Предоставлено Джонатаном Юнисом и Сергеем Сторчакой в ​​:issue:`30688`.)

source: Dict and dictviews are now iterable in reversed insertion order using :func:`reversed`. (Contributed by Rémi Lapeyre in :issue:`33462`.)
ru: Dict и dictviews теперь можно итерировать в обратном порядке вставки, используя :func:`reversed`. (Предоставлено Реми Лапейром в :issue:`33462`.)

source: The syntax allowed for keyword names in function calls was further restricted. In particular, ``f((keyword)=arg)`` is no longer allowed. It was never intended to permit more than a bare name on the left-hand side of a keyword argument assignment term. (Contributed by Benjamin Peterson in :issue:`34641`.)
ru: Синтаксис, разрешенный для имен ключевых слов в вызовах функций, был дополнительно ограничен. В частности, ``f((keyword)=arg)`` больше не допускается. Никогда не предполагалось, что в левой части термина назначения аргумента ключевого слова будет разрешено использовать только одно имя. (Предоставлено Бенджамином Петерсоном в :issue:`34641`.)

source: Generalized iterable unpacking in :keyword:`yield` and :keyword:`return` statements no longer requires enclosing parentheses. This brings the *yield* and *return* syntax into better agreement with normal assignment syntax::
ru: Обобщенная итеративная распаковка в операторах :keyword:`yield` и :keyword:`return` больше не требует заключения в круглые скобки. Это приводит синтаксис *yield* и *return* в лучшее соответствие с обычным синтаксисом присваивания::

source: (Contributed by David Cuthbert and Jordan Chapman in :issue:`32117`.)
ru: (Предоставлено Дэвидом Катбертом и Джорданом Чепменом в :issue:`32117`.)

source: When a comma is missed in code such as ``[(10, 20) (30, 40)]``, the compiler displays a :exc:`SyntaxWarning` with a helpful suggestion. This improves on just having a :exc:`TypeError` indicating that the first tuple was not callable. (Contributed by Serhiy Storchaka in :issue:`15248`.)
ru: Если в коде, например, ``[(10, 20) (30, 40)]`` пропущена запятая, компилятор отображает :exc:`SyntaxWarning` с полезным предложением. Это лучше, чем наличие :exc:`TypeError`, указывающего, что первый кортеж не может быть вызван. (Добавлен Сергеем Сторчакой в ​​:issue:`15248`.)

source: Arithmetic operations between subclasses of :class:`datetime.date` or :class:`datetime.datetime` and :class:`datetime.timedelta` objects now return an instance of the subclass, rather than the base class. This also affects the return type of operations whose implementation (directly or indirectly) uses :class:`datetime.timedelta` arithmetic, such as :meth:`~datetime.datetime.astimezone`. (Contributed by Paul Ganssle in :issue:`32417`.)
ru: Арифметические операции между подклассами объектов :class:`datetime.date` или :class:`datetime.datetime` и :class:`datetime.timedelta` теперь возвращают экземпляр подкласса, а не базового класса. Это также влияет на тип возвращаемого значения операций, реализация которых (прямо или косвенно) использует арифметику :class:`datetime.timedelta`, например :meth:`~datetime.datetime.astimezone`. (Предоставлено Полом Гансслом в :issue:`32417`.)
