Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/whatsnew/3.8.po
Languages: ru

source: The :meth:`mmap.flush() <mmap.mmap.flush>` method now returns ``None`` on success and raises an exception on error under all platforms. Previously, its behavior was platform-dependent: a nonzero value was returned on success; zero was returned on error under Windows. A zero value was returned on success; an exception was raised on error under Unix. (Contributed by Berker Peksag in :issue:`2122`.)
ru: Метод :meth:`mmap.flush() <mmap.mmap.flush>` теперь возвращает None в случае успеха и вызывает исключение в случае ошибки на всех платформах. Раньше его поведение зависело от платформы: в случае успеха возвращалось ненулевое значение; ноль был возвращен при ошибке под Windows. В случае успеха было возвращено нулевое значение; в Unix возникло исключение из-за ошибки. (Предоставлено Беркером Пексагом в :issue:`2122`.)

source: :mod:`xml.dom.minidom` and :mod:`xml.sax` modules no longer process external entities by default. (Contributed by Christian Heimes in :issue:`17239`.)
ru: Модули :mod:`xml.dom.minidom` и :mod:`xml.sax` больше не обрабатывают внешние объекты по умолчанию. (Предоставлено Кристианом Хаймсом в :issue:`17239`.)

source: Deleting a key from a read-only :mod:`dbm` database (:mod:`dbm.dumb`, :mod:`dbm.gnu` or :mod:`dbm.ndbm`) raises :attr:`error` (:exc:`dbm.dumb.error`, :exc:`dbm.gnu.error` or :exc:`dbm.ndbm.error`) instead of :exc:`KeyError`. (Contributed by Xiang Zhang in :issue:`33106`.)
ru: Удаление ключа из базы данных :mod:`dbm`, доступной только для чтения (:mod:`dbm.dumb`, :mod:`dbm.gnu` или :mod:`dbm.ndbm`), вызывает ошибку :attr:`error` (:exc:`dbm.dumb.error`, :exc:`dbm.gnu.error` или :exc:`dbm.ndbm.error`) вместо :exc:`KeyError`. (Предоставлено Сян Чжаном в :issue:`33106`.)

source: Simplified AST for literals. All constants will be represented as :class:`ast.Constant` instances. Instantiating old classes ``Num``, ``Str``, ``Bytes``, ``NameConstant`` and ``Ellipsis`` will return an instance of ``Constant``. (Contributed by Serhiy Storchaka in :issue:`32892`.)
ru: Упрощенный AST для литералов. Все константы будут представлены как экземпляры :class:`ast.Constant`. Создание экземпляров старых классов ``Num``, ``Str``, ``Bytes``, ``NameConstant`` и ``Ellipsis`` вернет экземпляр ``Constant``. (Предоставлено Сергеем Сторчакой в ​​:issue:`32892`.)

source: The function :func:`asyncio.wait_for` now correctly waits for cancellation when using an instance of :class:`asyncio.Task`. Previously, upon reaching *timeout*, it was cancelled and immediately returned. (Contributed by Elvis Pranskevichus in :issue:`32751`.)
ru: Функция :func:`asyncio.wait_for` теперь корректно ожидает отмены при использовании экземпляра :class:`asyncio.Task`. Раньше по достижении *таймаута* он отменялся и сразу возвращался. (Предоставлено Элвисом Пранскевичусом в :issue:`32751`.)

source: The function :func:`asyncio.BaseTransport.get_extra_info` now returns a safe to use socket object when 'socket' is passed to the *name* parameter. (Contributed by Yury Selivanov in :issue:`37027`.)
ru: Функция :func:`asyncio.BaseTransport.get_extra_info` теперь возвращает безопасный для использования объект сокета, когда сокет передается в параметр *name*. (Добавлен Юрием Селивановым в :issue:`37027`.)

source: :class:`asyncio.BufferedProtocol` has graduated to the stable API.
ru: :class:`asyncio.BufferedProtocol` переведен на стабильный API.

source: DLL dependencies for extension modules and DLLs loaded with :mod:`ctypes` on Windows are now resolved more securely. Only the system paths, the directory containing the DLL or PYD file, and directories added with :func:`~os.add_dll_directory` are searched for load-time dependencies. Specifically, :envvar:`PATH` and the current working directory are no longer used, and modifications to these will no longer have any effect on normal DLL resolution. If your application relies on these mechanisms, you should check for :func:`~os.add_dll_directory` and if it exists, use it to add your DLLs directory while loading your library. Note that Windows 7 users will need to ensure that Windows Update KB2533623 has been installed (this is also verified by the installer). (Contributed by Steve Dower in :issue:`36085`.)
ru: Зависимости DLL для модулей расширения и DLL, загруженных с помощью :mod:`ctypes` в Windows, теперь разрешаются более безопасно. Только системные пути, каталог, содержащий файл DLL или PYD, и каталоги, добавленные с помощью :func:`~os.add_dll_directory`, проверяются на наличие зависимостей во время загрузки. В частности, :envvar:`PATH` и текущий рабочий каталог больше не используются, и их изменения больше не будут влиять на нормальное разрешение DLL. Если ваше приложение использует эти механизмы, вам следует проверить :func:`~os.add_dll_directory` и, если он существует, использовать его для добавления каталога DLL при загрузке библиотеки. Обратите внимание, что пользователям Windows 7 необходимо убедиться, что установлено обновление Windows Update KB2533623 (это также проверяется установщиком). (Предоставлено Стивом Дауэром в :issue:`36085`.)

source: The header files and functions related to pgen have been removed after its replacement by a pure Python implementation. (Contributed by Pablo Galindo in :issue:`36623`.)
ru: Файлы заголовков и функции, связанные с pgen, были удалены после их замены чистой реализацией Python. (Предоставлено Пабло Галиндо в :issue:`36623`.)

source: :class:`types.CodeType` has a new parameter in the second position of the constructor (*posonlyargcount*) to support positional-only arguments defined in :pep:`570`. The first argument (*argcount*) now represents the total number of positional arguments (including positional-only arguments). The new ``replace()`` method of :class:`types.CodeType` can be used to make the code future-proof.
ru: :class:`types.CodeType` имеет новый параметр во второй позиции конструктора (*posonlyargcount*) для поддержки только позиционных аргументов, определенных в :pep:`570`. Первый аргумент (*argcount*) теперь представляет общее количество позиционных аргументов (включая только позиционные аргументы). Новый метод replace() класса :class:`types.CodeType` можно использовать, чтобы сделать код перспективным.

source: The parameter ``digestmod`` for :func:`hmac.new` no longer uses the MD5 digest by default.
ru: Параметр ``digestmod`` для :func:`hmac.new` больше не использует дайджест MD5 по умолчанию.

source: Changes in the C API
ru: Изменения в C API

source: The :c:struct:`PyCompilerFlags` structure got a new *cf_feature_version* field. It should be initialized to ``PY_MINOR_VERSION``. The field is ignored by default, and is used if and only if ``PyCF_ONLY_AST`` flag is set in *cf_flags*. (Contributed by Guido van Rossum in :issue:`35766`.)
ru: Структура :c:struct:`PyCompilerFlags` получила новое поле *cf_feature_version*. Он должен быть инициализирован как PY_MINOR_VERSION. По умолчанию это поле игнорируется и используется тогда и только тогда, когда в *cf_flags* установлен флаг ``PyCF_ONLY_AST``. (Предоставлено Гвидо ван Россумом в :issue:`35766`.)

source: On Unix, C extensions are no longer linked to libpython except on Android and Cygwin. When Python is embedded, ``libpython`` must not be loaded with ``RTLD_LOCAL``, but ``RTLD_GLOBAL`` instead. Previously, using ``RTLD_LOCAL``, it was already not possible to load C extensions which were not linked to ``libpython``, like C extensions of the standard library built by the ``*shared*`` section of ``Modules/Setup``. (Contributed by Victor Stinner in :issue:`21536`.)
ru: В Unix расширения C больше не связаны с libpython, за исключением Android и Cygwin. Когда Python встроен, libpython должен быть загружен не с RTLD_LOCAL, а с RTLD_GLOBAL. Раньше, используя ``RTLD_LOCAL``, уже было невозможно загрузить расширения C, которые не были связаны с ``libpython``, например расширения C стандартной библиотеки, созданные в разделе ``*shared*`` `` Модули/Настройка``. (Предоставлено Виктором Стиннером в :issue:`21536`.)

source: Use of ``#`` variants of formats in parsing or building value (e.g. :c:func:`PyArg_ParseTuple`, :c:func:`Py_BuildValue`, :c:func:`PyObject_CallFunction`, etc.) without ``PY_SSIZE_T_CLEAN`` defined raises ``DeprecationWarning`` now. It will be removed in 3.10 or 4.0. Read :ref:`arg-parsing` for detail. (Contributed by Inada Naoki in :issue:`36381`.)
ru: Использование вариантов форматов ``#`` при синтаксическом анализе или построении значения (например, :c:func:`PyArg_ParseTuple`, :c:func:`Py_BuildValue`, :c:func:`PyObject_CallFunction` и т. д.) без `` PY_SSIZE_T_CLEAN`` теперь вызывает ``DeprecationWarning``. Он будет удален в версии 3.10 или 4.0. Подробности читайте в :ref:`arg-parsing`. (Предоставлено Инадой Наоки в :issue:`36381`.)

source: Instances of heap-allocated types (such as those created with :c:func:`PyType_FromSpec`) hold a reference to their type object. Increasing the reference count of these type objects has been moved from :c:func:`PyType_GenericAlloc` to the more low-level functions, :c:func:`PyObject_Init` and :c:func:`PyObject_INIT`. This makes types created through :c:func:`PyType_FromSpec` behave like other classes in managed code.
ru: Экземпляры типов, выделенных в куче (например, созданных с помощью :c:func:`PyType_FromSpec`) содержат ссылку на свой объект типа. Увеличение счетчика ссылок для этих типов объектов было перенесено из :c:func:`PyType_GenericAlloc` в более низкоуровневые функции: :c:func:` PyObj ect_Init` и :c:func:` PyObj ect_INIT`. Это заставляет типы, созданные с помощью :c:func:`PyType_FromSpec`, вести себя как другие классы в управляемом коде.

source: :ref:`Statically allocated types <static-types>` are not affected.
ru: :ref:`Статически выделенные типы <static-types>` не затрагиваются.

source: For the vast majority of cases, there should be no side effect. However, types that manually increase the reference count after allocating an instance (perhaps to work around the bug) may now become immortal. To avoid this, these classes need to call Py_DECREF on the type object during instance deallocation.
ru: В подавляющем большинстве случаев побочных эффектов быть не должно. Однако типы, которые вручную увеличивают счетчик ссылок после выделения экземпляра (возможно, чтобы обойти ошибку), теперь могут стать бессмертными. Чтобы избежать этого, этим классам необходимо вызывать Py_DECREF для объекта типа во время освобождения экземпляра.

source: To correctly port these types into 3.8, please apply the following changes:
ru: Чтобы правильно перенести эти типы в версию 3.8, внесите следующие изменения:

source: Example:
ru: Пример:

source: Ensure that all custom ``tp_dealloc`` functions of heap-allocated types decrease the type's reference count.
ru: Убедитесь, что все пользовательские функции tp_dealloc для типов, выделяемых в куче, уменьшают счетчик ссылок типа.

source: (Contributed by Eddie Elizondo in :issue:`35810`.)
ru: (Предоставлено Эдди Элизондо в :issue:`35810`.)

source: The :c:macro:`Py_DEPRECATED()` macro has been implemented for MSVC. The macro now must be placed before the symbol name.
ru: Макрос :c:macro:`Py_DEPRECATED()` реализован для MSVC. Макрос теперь необходимо размещать перед именем символа.

source: (Contributed by Zackery Spytz in :issue:`33407`.)
ru: (Предоставлено Закери Шпитцем в :issue:`33407`.)

source: (Contributed by Antoine Pitrou in :issue:`32388`.)
ru: (Предоставлено Антуаном Питру в :issue:`32388`.)

source: The :file:`libpython38.a` file to allow MinGW tools to link directly against :file:`python38.dll` is no longer included in the regular Windows distribution. If you require this file, it may be generated with the ``gendef`` and ``dlltool`` tools, which are part of the MinGW binutils package:
ru: Файл :file:`libpython38.a`, позволяющий инструментам MinGW напрямую связываться с :file:`python38.dll`, больше не включен в обычный дистрибутив Windows. Если вам нужен этот файл, его можно создать с помощью инструментов ``gendef`` и ``dlltool``, которые являются частью пакета MinGW binutils:

source: The location of an installed :file:`pythonXY.dll` will depend on the installation options and the version and language of Windows. See :ref:`using-on-windows` for more information. The resulting library should be placed in the same directory as :file:`pythonXY.lib`, which is generally the :file:`libs` directory under your Python installation.
ru: Местоположение установленного :file:`pythonXY.dll` будет зависеть от параметров установки, а также версии и языка Windows. Дополнительную информацию см. в разделе :ref:`using-on-windows`. Полученную библиотеку следует поместить в тот же каталог, что и :file:`pythonXY.lib`, который обычно является каталогом :file:`libs` в вашей установке Python.

source: (Contributed by Steve Dower in :issue:`37351`.)
ru: (Предоставлено Стивом Дауэром в :issue:`37351`.)

source: CPython bytecode changes
ru: Изменения в байт-коде CPython

source: The interpreter loop has been simplified by moving the logic of unrolling the stack of blocks into the compiler. The compiler emits now explicit instructions for adjusting the stack of values and calling the cleaning-up code for :keyword:`break`, :keyword:`continue` and :keyword:`return`.
ru: Цикл интерпретатора был упрощен за счет перемещения логики развертывания стека блоков в компилятор. Компилятор теперь выдает явные инструкции для корректировки стека значений и вызова кода очистки для :keyword:`break`, :keyword:`continue` и :keyword:`return`.

source: Removed opcodes :opcode:`BREAK_LOOP`, :opcode:`CONTINUE_LOOP`, :opcode:`SETUP_LOOP` and :opcode:`SETUP_EXCEPT`. Added new opcodes :opcode:`ROT_FOUR`, :opcode:`BEGIN_FINALLY`, :opcode:`CALL_FINALLY` and :opcode:`POP_FINALLY`. Changed the behavior of :opcode:`END_FINALLY` and :opcode:`WITH_CLEANUP_START`.
ru: Удалены коды операций :opcode:`BREAK_LOOP`, :opcode:`CONTINUE_LOOP`, :opcode:`SETUP_LOOP` и :opcode:`SETUP_EXCEPT`. Добавлены новые коды операций :opcode:`ROT_FOUR`, :opcode:`BEGIN_FINALLY`, :opcode:`CALL_FINALLY` и :opcode:`POP_FINALLY`. Изменено поведение :opcode:`END_FINALLY` и :opcode:`WITH_CLEANUP_START`.

source: (Contributed by Mark Shannon, Antoine Pitrou and Serhiy Storchaka in :issue:`17611`.)
ru: (Предоставлено Марком Шенноном, Антуаном Питру и Сергеем Сторчакой в ​​:issue:`17611`.)

source: Added new opcode :opcode:`END_ASYNC_FOR` for handling exceptions raised when awaiting a next item in an :keyword:`async for` loop. (Contributed by Serhiy Storchaka in :issue:`33041`.)
ru: Добавлен новый код операции :opcode:`END_ASYNC_FOR` для обработки исключений, возникающих при ожидании следующего элемента в цикле :keyword:`async for`. (Добавлен Сергеем Сторчакой в ​​:issue:`33041`.)

source: The :opcode:`MAP_ADD` now expects the value as the first element in the stack and the key as the second element. This change was made so the key is always evaluated before the value in dictionary comprehensions, as proposed by :pep:`572`. (Contributed by Jörn Heissler in :issue:`35224`.)
ru: :opcode:`MAP_ADD` теперь ожидает значение в качестве первого элемента в стеке и ключ в качестве второго элемента. Это изменение было сделано для того, чтобы ключ всегда оценивался перед значением в словарных определениях, как было предложено :pep:`572`. (Предоставлено Йорном Хейсслером в :issue:`35224`.)

source: Demos and Tools
ru: Демо и инструменты

source: Added a benchmark script for timing various ways to access variables: ``Tools/scripts/var_access_benchmark.py``. (Contributed by Raymond Hettinger in :issue:`35884`.)
ru: Добавлен тестовый скрипт для определения времени различных способов доступа к переменным: ``Tools/scripts/var_access_benchmark.py``. (Предоставлено Рэймондом Хеттингером в :issue:`35884`.)

source: Here's a summary of performance improvements since Python 3.3:
ru: Вот краткий обзор улучшений производительности по сравнению с Python 3.3:

source: Notable changes in Python 3.8.1
ru: Заметные изменения в Python 3.8.1

source: Due to significant security concerns, the *reuse_address* parameter of :meth:`asyncio.loop.create_datagram_endpoint` is no longer supported. This is because of the behavior of the socket option ``SO_REUSEADDR`` in UDP. For more details, see the documentation for ``loop.create_datagram_endpoint()``. (Contributed by Kyle Stanley, Antoine Pitrou, and Yury Selivanov in :issue:`37228`.)
ru: Из соображений безопасности параметр *reuse_address* :meth:`asyncio.loop.create_datagram_endpoint` больше не поддерживается. Это связано с поведением опции сокета SO_REUSEADDR в UDP. Более подробную информацию смотрите в документации по ``loop.create_datagram_endpoint()``. (Предоставлено Кайлом Стэнли, Антуаном Питру и Юрием Селивановым в :issue:`37228`.)

source: Notable changes in Python 3.8.8
ru: Заметные изменения в Python 3.8.8

source: Earlier Python versions allowed using both ``;`` and ``&`` as query parameter separators in :func:`urllib.parse.parse_qs` and :func:`urllib.parse.parse_qsl`. Due to security concerns, and to conform with newer W3C recommendations, this has been changed to allow only a single separator key, with ``&`` as the default. This change also affects :func:`cgi.parse` and :func:`cgi.parse_multipart` as they use the affected functions internally. For more details, please see their respective documentation. (Contributed by Adam Goldschmidt, Senthil Kumaran and Ken Jin in :issue:`42967`.)
ru: Более ранние версии Python позволяли использовать как ``;``, так и ``&`` в качестве разделителей параметров запроса в :func:`urllib.parse.parse_qs` и :func:`urllib.parse.parse_qsl`. Из соображений безопасности и в соответствии с новыми рекомендациями W3C это было изменено, чтобы разрешить только один ключ-разделитель с ``&`` по умолчанию. Это изменение также затрагивает :func:`cgi.parse` и :func:`cgi.parse_multipart`, поскольку они используют затронутые функции внутри себя. Более подробную информацию можно найти в соответствующей документации. (Предоставлено Адамом Гольдшмидтом, Сентилом Кумараном и Кеном Джином в :issue:`42967`.)

source: Notable changes in Python 3.8.12
ru: Заметные изменения в Python 3.8.12

source: Starting with Python 3.8.12 the :mod:`ipaddress` module no longer accepts any leading zeros in IPv4 address strings. Leading zeros are ambiguous and interpreted as octal notation by some libraries. For example the legacy function :func:`socket.inet_aton` treats leading zeros as octal notation. glibc implementation of modern :func:`~socket.inet_pton` does not accept any leading zeros.
ru: Начиная с Python 3.8.12, модуль :mod:`ipaddress` больше не принимает ведущие нули в строках адреса IPv4. Ведущие нули неоднозначны и некоторыми библиотеками интерпретируются как восьмеричная запись. Например, устаревшая функция :func:`socket.inet_aton` рассматривает ведущие нули как восьмеричную запись. Реализация современного :func:`~socket.inet_pton` в glibc не принимает ведущие нули.

source: (Originally contributed by Christian Heimes in :issue:`36384`, and backported to 3.8 by Achraf Merzouki.)
ru: (Первоначально предоставлено Кристианом Хаймсом в :issue:`36384` и перенесено в версию 3.8 Ахрафом Мерзуки.)
