Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/whatsnew/3.8.po
Languages: ru

source: New function :func:`~unicodedata.is_normalized` can be used to verify a string is in a specific normal form, often much faster than by actually normalizing the string. (Contributed by Max Belanger, David Euresti, and Greg Price in :issue:`32285` and :issue:`37966`).
ru: Новую функцию :func:`~unicodedata.is_normalized` можно использовать для проверки того, что строка находится в определенной нормальной форме, часто намного быстрее, чем при фактической нормализации строки. (Предоставлено Максом Белэнджером, Дэвидом Эурести и Грегом Прайсом в :issue:`32285` и :issue:`37966`).

source: Added :class:`~unittest.mock.AsyncMock` to support an asynchronous version of :class:`~unittest.mock.Mock`. Appropriate new assert functions for testing have been added as well. (Contributed by Lisa Roach in :issue:`26467`).
ru: Добавлен :class:`~unittest.mock.AsyncMock` для поддержки асинхронной версии :class:`~unittest.mock.Mock`. Также были добавлены соответствующие новые функции утверждения для тестирования. (Предоставлено Лизой Роуч в :issue:`26467`).

source: Several mock assert functions now also print a list of actual calls upon failure. (Contributed by Petter Strandmark in :issue:`35047`.)
ru: Несколько ложных функций утверждения теперь также печатают список реальных вызовов в случае сбоя. (Предоставлено Петтером Стрэндмарком в :issue:`35047`.)

source: :mod:`unittest` module gained support for coroutines to be used as test cases with :class:`unittest.IsolatedAsyncioTestCase`. (Contributed by Andrew Svetlov in :issue:`32972`.)
ru: Модуль :mod:`unittest` получил поддержку сопрограмм, которые можно использовать в качестве тестовых примеров с :class:`unittest.IsolatedAsyncioTestCase`. (Предоставлено Андреем Светловым в :issue:`32972`.)

source: Example::
ru: Пример::

source: :mod:`venv` now includes an ``Activate.ps1`` script on all platforms for activating virtual environments under PowerShell Core 6.1. (Contributed by Brett Cannon in :issue:`32718`.)
ru: :mod:`venv` теперь включает скрипт ``Activate.ps1`` на всех платформах для активации виртуальных сред под PowerShell Core 6.1. (Предоставлено Бреттом Кэнноном в :issue:`32718`.)

source: The proxy objects returned by :func:`weakref.proxy` now support the matrix multiplication operators ``@`` and ``@=`` in addition to the other numeric operators. (Contributed by Mark Dickinson in :issue:`36669`.)
ru: Прокси-объекты, возвращаемые :func:`weakref.proxy`, теперь поддерживают операторы матричного умножения ``@`` и ``@=`` в дополнение к другим числовым операторам. (Предоставлено Марком Дикинсоном в :issue:`36669`.)

source: As mitigation against DTD and external entity retrieval, the :mod:`xml.dom.minidom` and :mod:`xml.sax` modules no longer process external entities by default. (Contributed by Christian Heimes in :issue:`17239`.)
ru: В целях защиты от DTD и извлечения внешних объектов модули :mod:`xml.dom.minidom` и :mod:`xml.sax` больше не обрабатывают внешние объекты по умолчанию. (Предоставлено Кристианом Хаймсом в :issue:`17239`.)

source: The ``.find*()`` methods in the :mod:`xml.etree.ElementTree` module support wildcard searches like ``{*}tag`` which ignores the namespace and ``{namespace}*`` which returns all tags in the given namespace. (Contributed by Stefan Behnel in :issue:`28238`.)
ru: Методы ``.find*()`` в модуле :mod:`xml.etree.ElementTree` поддерживают поиск по шаблонам, например ``{*}tag``, который игнорирует пространство имен, и ``{namespace}*``, который возвращает все теги в заданном пространстве имен. (Предоставлено Стефаном Бенелем в :issue:`28238`.)

source: The target object of :class:`xml.etree.ElementTree.XMLParser` can receive namespace declaration events through the new callback methods ``start_ns()`` and ``end_ns()``. Additionally, the :class:`xml.etree.ElementTree.TreeBuilder` target can be configured to process events about comments and processing instructions to include them in the generated tree. (Contributed by Stefan Behnel in :issue:`36676` and :issue:`36673`.)
ru: Целевой объект :class:`xml.etree.ElementTree.XMLParser` может получать события объявления пространства имен через новые методы обратного вызова ``start_ns()`` и ``end_ns()``. Кроме того, цель :class:`xml.etree.ElementTree.TreeBuilder` может быть настроена на обработку событий о комментариях и инструкциях обработки для включения их в сгенерированное дерево. (Предоставлено Стефаном Бенелем в :issue:`36676` и :issue:`36673`.)

source: :class:`xmlrpc.client.ServerProxy` now supports an optional *headers* keyword argument for a sequence of HTTP headers to be sent with each request. Among other things, this makes it possible to upgrade from default basic authentication to faster session authentication. (Contributed by Cédric Krier in :issue:`35153`.)
ru: :class:`xmlrpc.client.ServerProxy` теперь поддерживает необязательный аргумент ключевого слова *headers* для последовательности HTTP-заголовков, которые будут отправляться с каждым запросом. Помимо прочего, это позволяет перейти от базовой аутентификации по умолчанию к более быстрой аутентификации сеанса. (Предоставлено Седриком Криером в :issue:`35153`.)

source: Optimizations
ru: Оптимизации

source: The :mod:`subprocess` module can now use the :func:`os.posix_spawn` function in some cases for better performance. Currently, it is only used on macOS and Linux (using glibc 2.24 or newer) if all these conditions are met:
ru: Модуль :mod:`subprocess` теперь может в некоторых случаях использовать функцию :func:`os.posix_spawn` для повышения производительности. В настоящее время он используется только в macOS и Linux (с использованием glibc 2.24 или новее), если соблюдены все эти условия:

source: *close_fds* is false;
ru: *close_fds* имеет значение false;

source: *preexec_fn*, *pass_fds*, *cwd* and *start_new_session* parameters are not set;
ru: Параметры *preexec_fn*, *pass_fds*, *cwd* и *start_new_session* не заданы;

source: the *executable* path contains a directory.
ru: путь *исполняемого файла* содержит каталог.

source: (Contributed by Joannah Nanjekye and Victor Stinner in :issue:`35537`.)
ru: (Предоставлено Джоанной Нанжекье и Виктором Стиннером в :issue:`35537`.)

source: :func:`shutil.copyfile`, :func:`shutil.copy`, :func:`shutil.copy2`, :func:`shutil.copytree` and :func:`shutil.move` use platform-specific "fast-copy" syscalls on Linux and macOS in order to copy the file more efficiently. "fast-copy" means that the copying operation occurs within the kernel, avoiding the use of userspace buffers in Python as in "``outfd.write(infd.read())``". On Windows :func:`shutil.copyfile` uses a bigger default buffer size (1 MiB instead of 16 KiB) and a :func:`memoryview`-based variant of :func:`shutil.copyfileobj` is used. The speedup for copying a 512 MiB file within the same partition is about +26% on Linux, +50% on macOS and +40% on Windows. Also, much less CPU cycles are consumed. See :ref:`shutil-platform-dependent-efficient-copy-operations` section. (Contributed by Giampaolo Rodolà in :issue:`33671`.)
ru: :func:`shutil.copyfile`, :func:`shutil.copy`, :func:`shutil.copy2`, :func:`shutil.copytree` и :func:`shutil.move` используют "быстрый" для конкретной платформы -copy» в Linux и macOS для более эффективного копирования файла. «быстрое копирование» означает, что операция копирования происходит внутри ядра, избегая использования буферов пользовательского пространства в Python, как в «``outfd.write(infd.read())``». В Windows :func:`shutil.copyfile` использует больший размер буфера по умолчанию (1 МБ вместо 16 КиБ) и используется вариант :func:`shutil.copyfileobj` на основе :func:`memoryview`. Ускорение копирования файла размером 512 МБ в одном разделе составляет около +26% в Linux, +50% в macOS и +40% в Windows. Кроме того, потребляется гораздо меньше циклов процессора. См. раздел «shutil-платформо-зависимые-эффективные-операции копирования». (Предоставлено Джампаоло Родола в :issue:`33671`.)

source: :func:`shutil.copytree` uses :func:`os.scandir` function and all copy functions depending from it use cached :func:`os.stat` values. The speedup for copying a directory with 8000 files is around +9% on Linux, +20% on Windows and +30% on a Windows SMB share. Also the number of :func:`os.stat` syscalls is reduced by 38% making :func:`shutil.copytree` especially faster on network filesystems. (Contributed by Giampaolo Rodolà in :issue:`33695`.)
ru: :func:`shutil.copytree` использует функцию :func:`os.scandir` и все зависящие от нее функции копирования используют кэшированные значения :func:`os.stat`. Ускорение копирования каталога с 8000 файлами составляет около +9% в Linux, +20% в Windows и +30% на общем ресурсе Windows SMB. Кроме того, количество системных вызовов :func:`os.stat` сокращается на 38%, что делает :func:`shutil.copytree` особенно быстрее в сетевых файловых системах. (Предоставлено Джампаоло Родола в :issue:`33695`.)

source: The default protocol in the :mod:`pickle` module is now Protocol 4, first introduced in Python 3.4. It offers better performance and smaller size compared to Protocol 3 available since Python 3.0.
ru: Протоколом по умолчанию в модуле :mod:`pickle` теперь является протокол 4, впервые представленный в Python 3.4. Он предлагает лучшую производительность и меньший размер по сравнению с протоколом 3, доступным начиная с Python 3.0.

source: Removed one :c:type:`Py_ssize_t` member from ``PyGC_Head``. All GC tracked objects (e.g. tuple, list, dict) size is reduced 4 or 8 bytes. (Contributed by Inada Naoki in :issue:`33597`.)
ru: Удален один член :c:type:`Py_ssize_t` из ``PyGC_Head``. Размер всех отслеживаемых GC объектов (например, кортежа, списка, словаря) уменьшается на 4 или 8 байт. (Предоставлено Инадой Наоки в :issue:`33597`.)

source: :class:`uuid.UUID` now uses ``__slots__`` to reduce its memory footprint. (Contributed by Wouter Bolsterlee and Tal Einat in :issue:`30977`)
ru: :class:`uuid.UUID` теперь использует ``__slots__`` для уменьшения занимаемой памяти. (Предоставлено Воутером Болстерли и Талом Эйнатом в :issue:`30977`)

source: Improved performance of :func:`operator.itemgetter` by 33%. Optimized argument handling and added a fast path for the common case of a single non-negative integer index into a tuple (which is the typical use case in the standard library). (Contributed by Raymond Hettinger in :issue:`35664`.)
ru: Улучшена производительность :func:`operator.itemgetter` на 33%. Оптимизирована обработка аргументов и добавлен быстрый путь для общего случая, когда один неотрицательный целочисленный индекс помещается в кортеж (это типичный вариант использования в стандартной библиотеке). (Предоставлено Рэймондом Хеттингером в :issue:`35664`.)

source: Sped-up field lookups in :func:`collections.namedtuple`. They are now more than two times faster, making them the fastest form of instance variable lookup in Python. (Contributed by Raymond Hettinger, Pablo Galindo, and Joe Jevnik, Serhiy Storchaka in :issue:`32492`.)
ru: Ускоренный поиск полей в :func:`collections.namedtuple`. Теперь они работают более чем в два раза быстрее, что делает их самым быстрым способом поиска переменных экземпляра в Python. (Предоставлено Рэймондом Хеттингером, Пабло Галиндо и Джо Евником, Сергеем Сторчакой в ​​:issue:`32492`.)

source: The :class:`list` constructor does not overallocate the internal item buffer if the input iterable has a known length (the input implements ``__len__``). This makes the created list 12% smaller on average. (Contributed by Raymond Hettinger and Pablo Galindo in :issue:`33234`.)
ru: Конструктор :class:`list` не переполняет внутренний буфер элементов, если входная итерация имеет известную длину (входные данные реализуют ``__len__``). Это делает созданный список в среднем на 12 % меньше. (Предоставлено Рэймондом Хеттингером и Пабло Галиндо в :issue:`33234`.)

source: Doubled the speed of class variable writes. When a non-dunder attribute was updated, there was an unnecessary call to update slots. (Contributed by Stefan Behnel, Pablo Galindo Salgado, Raymond Hettinger, Neil Schemenauer, and Serhiy Storchaka in :issue:`36012`.)
ru: Удвоена скорость записи переменных класса. При обновлении атрибута, отличного от dunder, возникал ненужный вызов обновления слотов. (Предоставлено Стефаном Бенелем, Пабло Галиндо Сальгадо, Раймондом Хеттингером, Нилом Шеменауэром и Сергеем Сторчакой в ​​:issue:`36012`.)

source: Reduced an overhead of converting arguments passed to many builtin functions and methods. This sped up calling some simple builtin functions and methods up to 20--50%. (Contributed by Serhiy Storchaka in :issue:`23867`, :issue:`35582` and :issue:`36127`.)
ru: Уменьшены накладные расходы на преобразование аргументов, передаваемых многим встроенным функциям и методам. Это ускорило вызов некоторых простых встроенных функций и методов на 20--50%. (Внесено Сергеем Сторчакой в ​​:issue:`23867`, :issue:`35582` и :issue:`36127`.)

source: ``LOAD_GLOBAL`` instruction now uses new "per opcode cache" mechanism. It is about 40% faster now. (Contributed by Yury Selivanov and Inada Naoki in :issue:`26219`.)
ru: Инструкция ``LOAD_GLOBAL`` теперь использует новый механизм кэширования каждого кода операции. Сейчас это примерно на 40% быстрее. (Предоставлено Юрием Селивановым и Инадой Наоки в :issue:`26219`.)

source: Build and C API Changes
ru: Изменения API сборки и C

source: Default :data:`sys.abiflags` became an empty string: the ``m`` flag for pymalloc became useless (builds with and without pymalloc are ABI compatible) and so has been removed. (Contributed by Victor Stinner in :issue:`36707`.)
ru: По умолчанию :data:`sys.abiflags` стал пустой строкой: флаг ``m`` для pymalloc стал бесполезным (сборки с pymalloc и без него совместимы с ABI) и поэтому был удален. (Предоставлено Виктором Стиннером в :issue:`36707`.)

source: Example of changes:
ru: Пример изменений:

source: Only ``python3.8`` program is installed, ``python3.8m`` program is gone.
ru: Установлена ​​только программа ``python3.8``, программа ``python3.8m`` отсутствует.

source: Only ``python3.8-config`` script is installed, ``python3.8m-config`` script is gone.
ru: Установлен только скрипт ``python3.8-config``, скрипт ``python3.8m-config`` отсутствует.

source: The ``m`` flag has been removed from the suffix of dynamic library filenames: extension modules in the standard library as well as those produced and installed by third-party packages, like those downloaded from PyPI. On Linux, for example, the Python 3.7 suffix ``.cpython-37m-x86_64-linux-gnu.so`` became ``.cpython-38-x86_64-linux-gnu.so`` in Python 3.8.
ru: Флаг ``m`` был удален из суффикса имен файлов динамических библиотек: модулей расширения в стандартной библиотеке, а также модулей, созданных и установленных сторонними пакетами, например, загруженных из PyPI. Например, в Linux суффикс Python 3.7 «.cpython-37m-x86_64-linux-gnu.so» превратился в «.cpython-38-x86_64-linux-gnu.so» в Python 3.8.

source: The header files have been reorganized to better separate the different kinds of APIs:
ru: Файлы заголовков были реорганизованы, чтобы лучше разделить различные типы API:

source: ``Include/*.h`` should be the portable public stable C API.
ru: ``Include/*.h`` должен быть переносимым общедоступным стабильным API C.

source: ``Include/cpython/*.h`` should be the unstable C API specific to CPython; public API, with some private API prefixed by ``_Py`` or ``_PY``.
ru: ``Include/cpython/*.h`` должен быть нестабильным C API, специфичным для CPython; общедоступный API с некоторым частным API с префиксом ``_Py`` или ``_PY``.

source: ``Include/internal/*.h`` is the private internal C API very specific to CPython. This API comes with no backward compatibility warranty and should not be used outside CPython. It is only exposed for very specific needs like debuggers and profiles which has to access to CPython internals without calling functions. This API is now installed by ``make install``.
ru: ``Include/internal/*.h`` — это частный внутренний C API, очень специфичный для CPython. Этот API не имеет гарантии обратной совместимости и не должен использоваться вне CPython. Он доступен только для очень специфических нужд, таких как отладчики и профили, которым необходим доступ к внутренним компонентам CPython без вызова функций. Этот API теперь устанавливается командой make install.

source: (Contributed by Victor Stinner in :issue:`35134` and :issue:`35081`, work initiated by Eric Snow in Python 3.7.)
ru: (Внесено Виктором Стиннером в :issue:`35134` и :issue:`35081`, работа инициирована Эриком Сноу в Python 3.7.)

source: Some macros have been converted to static inline functions: parameter types and return type are well defined, they don't have issues specific to macros, variables have a local scopes. Examples:
ru: Некоторые макросы были преобразованы в статические встроенные функции: типы параметров и тип возвращаемого значения четко определены, у них нет проблем, характерных для макросов, переменные имеют локальную область видимости. Примеры:

source: (Contributed by Victor Stinner in :issue:`35059`.)
ru: (Предоставлено Виктором Стиннером в :issue:`35059`.)

source: The result of :c:func:`PyExceptionClass_Name` is now of type ``const char *`` rather of ``char *``. (Contributed by Serhiy Storchaka in :issue:`33818`.)
ru: Результат :c:func:`PyExceptionClass_Name` теперь имеет тип ``const char *``, а не ``char *``. (Предоставлено Сергеем Сторчакой в ​​:issue:`33818`.)

source: The duality of ``Modules/Setup.dist`` and ``Modules/Setup`` has been removed. Previously, when updating the CPython source tree, one had to manually copy ``Modules/Setup.dist`` (inside the source tree) to ``Modules/Setup`` (inside the build tree) in order to reflect any changes upstream. This was of a small benefit to packagers at the expense of a frequent annoyance to developers following CPython development, as forgetting to copy the file could produce build failures.
ru: Двойственность «Modules/Setup.dist» и «Modules/Setup» была удалена. Раньше при обновлении дерева исходного кода CPython приходилось вручную копировать «Modules/Setup.dist» (внутри дерева исходного кода) в «Modules/Setup» (внутри дерева сборки), чтобы отразить любые изменения в исходном коде. . Это принесло небольшую выгоду упаковщикам за счет частого раздражения разработчиков после разработки CPython, поскольку забывание скопировать файл могло привести к сбоям сборки.

source: Now the build system always reads from ``Modules/Setup`` inside the source tree. People who want to customize that file are encouraged to maintain their changes in a git fork of CPython or as patch files, as they would do for any other change to the source tree.
ru: Теперь система сборки всегда читает файлы из ``Modules/Setup`` внутри дерева исходного кода. Людям, желающим настроить этот файл, рекомендуется сохранять свои изменения в git-форке CPython или в виде файлов исправлений, как они поступали бы для любых других изменений в дереве исходного кода.

source: (Contributed by Antoine Pitrou in :issue:`32430`.)
ru: (Предоставлено Антуаном Питру в :issue:`32430`.)

source: Functions that convert Python number to C integer like :c:func:`PyLong_AsLong` and argument parsing functions like :c:func:`PyArg_ParseTuple` with integer converting format units like ``'i'`` will now use the :meth:`~object.__index__` special method instead of :meth:`~object.__int__`, if available. The deprecation warning will be emitted for objects with the ``__int__()`` method but without the ``__index__()`` method (like :class:`~decimal.Decimal` and :class:`~fractions.Fraction`). :c:func:`PyNumber_Check` will now return ``1`` for objects implementing ``__index__()``. :c:func:`PyNumber_Long`, :c:func:`PyNumber_Float` and :c:func:`PyFloat_AsDouble` also now use the ``__index__()`` method if available. (Contributed by Serhiy Storchaka in :issue:`36048` and :issue:`20092`.)
ru: Функции, которые преобразуют число Python в целое число C, например :c:func:`PyLong_AsLong`, и функции анализа аргументов, такие как :c:func:`PyArg_ParseTuple` с единицами формата целочисленного преобразования, такими как ``'i'``, теперь будут использовать :meth: Специальный метод `~object.__index__` вместо :meth:`~object.__int__`, если он доступен. Предупреждение об устаревании будет выдано для объектов с методом __int__(), но без метода __index__() (например, :class:`~decimal.Decimal` и :class:`~fractions.Fraction` ). :c:func:`PyNumber_Check` теперь будет возвращать ``1`` для объектов, реализующих ``__index__()``. :c:func:`PyNumber_Long`, :c:func:`PyNumber_Float` и :c:func:`PyFloat_AsDouble` также теперь используют метод ``__index__()``, если он доступен. (Внесено Сергеем Сторчакой в ​​:issue:`36048` и :issue:`20092`.)

source: Heap-allocated type objects will now increase their reference count in :c:func:`PyObject_Init` (and its parallel macro ``PyObject_INIT``) instead of in :c:func:`PyType_GenericAlloc`. Types that modify instance allocation or deallocation may need to be adjusted. (Contributed by Eddie Elizondo in :issue:`35810`.)
ru: Объекты типа, выделенные в куче, теперь будут увеличивать счетчик ссылок в :c:func:` PyObj ect_Init` (и его параллельном макросе `` PyObj ect_INIT``), а не в :c:func:`PyType_GenericAlloc`. Типы, которые изменяют выделение или освобождение экземпляров, возможно, придется скорректировать. (Предоставлено Эдди Элизондо в :issue:`35810`.)

source: Deprecated
ru: Устарел

source: The distutils ``bdist_wininst`` command is now deprecated, use ``bdist_wheel`` (wheel packages) instead. (Contributed by Victor Stinner in :issue:`37481`.)
ru: Команда distutils ``bdist_wininst`` устарела, вместо нее используйте ``bdist_wheel`` (пакеты колес). (Предоставлено Виктором Стиннером в :issue:`37481`.)

source: Deprecated methods ``getchildren()`` and ``getiterator()`` in the :mod:`~xml.etree.ElementTree` module now emit a :exc:`DeprecationWarning` instead of :exc:`PendingDeprecationWarning`. They will be removed in Python 3.9. (Contributed by Serhiy Storchaka in :issue:`29209`.)
ru: Устаревшие методы getchildren() и getiterator() в модуле :mod:`~xml.etree.ElementTree` теперь выдают :exc:`DeprecationWarning` вместо :exc:`PendingDeprecationWarning`. Они будут удалены в Python 3.9. (Предоставлено Сергеем Сторчакой в ​​:issue:`29209`.)

source: Passing an object that is not an instance of :class:`concurrent.futures.ThreadPoolExecutor` to :meth:`loop.set_default_executor() <asyncio.loop.set_default_executor>` is deprecated and will be prohibited in Python 3.9. (Contributed by Elvis Pranskevichus in :issue:`34075`.)
ru: Передача объекта, который не является экземпляром :class:`concurrent.futures.ThreadPoolExecutor`, в :meth:`loop.set_default_executor() <asyncio.loop.set_default_executor>` считается устаревшей и будет запрещена в Python 3.9. (Предоставлено Элвисом Пранскевичусом в :issue:`34075`.)

source: Implementations of these methods have been ignoring their *index* parameter, and returning the next item instead. (Contributed by Berker Peksag in :issue:`9372`.)
ru: Реализации этих методов игнорировали параметр *index* и вместо этого возвращали следующий элемент. (Предоставлено Беркером Пексагом в :issue:`9372`.)

source: The :class:`typing.NamedTuple` class has deprecated the ``_field_types`` attribute in favor of the ``__annotations__`` attribute which has the same information. (Contributed by Raymond Hettinger in :issue:`36320`.)
ru: Класс :class:`typing.NamedTuple` отказался от атрибута _field_types в пользу атрибута __annotations__, который содержит ту же информацию. (Предоставлено Рэймондом Хеттингером в :issue:`36320`.)
