Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/whatsnew/3.8.po
Languages: ru

source: When the Python interpreter is interrupted by Ctrl-C (SIGINT) and the resulting :exc:`KeyboardInterrupt` exception is not caught, the Python process now exits via a SIGINT signal or with the correct exit code such that the calling process can detect that it died due to a Ctrl-C. Shells on POSIX and Windows use this to properly terminate scripts in interactive sessions. (Contributed by Google via Gregory P. Smith in :issue:`1054041`.)
ru: Когда интерпретатор Python прерывается нажатием Ctrl-C (SIGINT) и результирующее исключение :exc:`KeyboardInterrupt` не перехватывается, процесс Python теперь завершается через сигнал SIGINT или с правильным кодом завершения, чтобы вызывающий процесс мог обнаружить это. он умер из-за Ctrl-C. Оболочки POSIX и Windows используют это для правильного завершения сценариев в интерактивных сеансах. (Предоставлено Google через Грегори П. Смита в :issue:`1054041`.)

source: Some advanced styles of programming require updating the :class:`types.CodeType` object for an existing function. Since code objects are immutable, a new code object needs to be created, one that is modeled on the existing code object. With 19 parameters, this was somewhat tedious. Now, the new ``replace()`` method makes it possible to create a clone with a few altered parameters.
ru: Некоторые продвинутые стили программирования требуют обновления объекта :class:`types.CodeType` для существующей функции. Поскольку объекты кода являются неизменяемыми, необходимо создать новый объект кода, смоделированный на основе существующего объекта кода. С 19 параметрами это было несколько утомительно. Теперь новый метод replace() позволяет создать клон с несколькими измененными параметрами.

source: Here's an example that alters the :func:`statistics.mean` function to prevent the *data* parameter from being used as a keyword argument::
ru: Вот пример, который изменяет функцию :func:`statistics.mean`, чтобы предотвратить использование параметра *data* в качестве аргумента ключевого слова:

source: (Contributed by Victor Stinner in :issue:`37032`.)
ru: (Предоставлено Виктором Стиннером в :issue:`37032`.)

source: For integers, the three-argument form of the :func:`pow` function now permits the exponent to be negative in the case where the base is relatively prime to the modulus. It then computes a modular inverse to the base when the exponent is ``-1``, and a suitable power of that inverse for other negative exponents. For example, to compute the `modular multiplicative inverse <https://en.wikipedia.org/wiki/Modular_multiplicative_inverse>`_ of 38 modulo 137, write::
ru: Для целых чисел форма функции :func:`pow` с тремя аргументами теперь позволяет экспоненте быть отрицательной в случае, когда основание относительно простое по отношению к модулю. Затем он вычисляет модульную величину, обратную базе, когда показатель степени равен «-1», и подходящую степень этой обратной степени для других отрицательных показателей. Например, чтобы вычислить `модульную мультипликативную обратную <https://en.wikipedia.org/wiki/Modular_multiplicative_inverse>`_ 38 по модулю 137, напишите::

source: Modular inverses arise in the solution of `linear Diophantine equations <https://en.wikipedia.org/wiki/Diophantine_equation>`_. For example, to find integer solutions for ``4258𝑥 + 147𝑦 = 369``, first rewrite as ``4258𝑥 ≡ 369 (mod 147)`` then solve:
ru: Модульные обратные возникают при решении `линейных диофантовых уравнений <https://en.wikipedia.org/wiki/Diophantine_equation>`_. Например, чтобы найти целочисленные решения для ``4258𝑥 + 147𝑦 = 369``, сначала перепишите как ``4258𝑥 ≡ 369 (по модулю 147)``, а затем решите:

source: (Contributed by Mark Dickinson in :issue:`36027`.)
ru: (Предоставлено Марком Дикинсоном в :issue:`36027`.)

source: Dict comprehensions have been synced-up with dict literals so that the key is computed first and the value second::
ru: Понимания Dict были синхронизированы с литералами dict, так что сначала вычисляется ключ, а затем значение::

source: The guaranteed execution order is helpful with assignment expressions because variables assigned in the key expression will be available in the value expression::
ru: Гарантированный порядок выполнения полезен при работе с выражениями присваивания, поскольку переменные, назначенные в ключевом выражении, будут доступны в выражении значения:

source: (Contributed by Jörn Heissler in :issue:`35224`.)
ru: (Предоставлено Йорном Хейсслером в :issue:`35224`.)

source: The :meth:`object.__reduce__` method can now return a tuple from two to six elements long. Formerly, five was the limit. The new, optional sixth element is a callable with a ``(obj, state)`` signature. This allows the direct control over the state-updating behavior of a specific object. If not *None*, this callable will have priority over the object's :meth:`~__setstate__` method. (Contributed by Pierre Glaser and Olivier Grisel in :issue:`35900`.)
ru: Метод :meth:`object.__reduce__` теперь может возвращать кортеж длиной от двух до шести элементов. Раньше пять было пределом. Новый, необязательный шестой элемент — это вызываемый объект с сигнатурой «(obj, state)». Это позволяет напрямую контролировать поведение обновления состояния конкретного объекта. Если не *None*, этот вызываемый объект будет иметь приоритет над методом :meth:`~__setstate__` объекта. (Предоставлено Пьером Глейзером и Оливье Гризелем в :issue:`35900`.)

source: New Modules
ru: Новые модули

source: The new :mod:`importlib.metadata` module provides (provisional) support for reading metadata from third-party packages. For example, it can extract an installed package's version number, list of entry points, and more::
ru: Новый модуль :mod:`importlib.metadata` обеспечивает (временную) поддержку чтения метаданных из сторонних пакетов. Например, он может извлечь номер версии установленного пакета, список точек входа и многое другое:

source: (Contributed by Barry Warsaw and Jason R. Coombs in :issue:`34632`.)
ru: (Предоставлено Барри Варшавой и Джейсоном Р. Кумбсом в :issue:`34632`.)

source: Improved Modules
ru: Улучшенные модули

source: AST nodes now have ``end_lineno`` and ``end_col_offset`` attributes, which give the precise location of the end of the node. (This only applies to nodes that have ``lineno`` and ``col_offset`` attributes.)
ru: Узлы AST теперь имеют атрибуты end_lineno и end_col_offset, которые указывают точное местоположение конца узла. (Это относится только к узлам, имеющим атрибуты ``lineno`` и ``col_offset``.)

source: New function :func:`ast.get_source_segment` returns the source code for a specific AST node.
ru: Новая функция :func:`ast.get_source_segment` возвращает исходный код для определенного узла AST.

source: (Contributed by Ivan Levkivskyi in :issue:`33416`.)
ru: (Предоставлено Иваном Левковским в :issue:`33416`.)

source: The :func:`ast.parse` function has some new flags:
ru: Функция :func:`ast.parse` имеет несколько новых флагов:

source: ``type_comments=True`` causes it to return the text of :pep:`484` and :pep:`526` type comments associated with certain AST nodes;
ru: ``type_comments=True`` заставляет его возвращать текст комментариев типа :pep:`484` и :pep:`526`, связанных с определенными узлами AST;

source: ``mode='func_type'`` can be used to parse :pep:`484` "signature type comments" (returned for function definition AST nodes);
ru: ``mode='func_type'`` можно использовать для анализа :pep:`484` "комментариев типа подписи" (возвращаемых для узлов определения функции AST);

source: ``feature_version=(3, N)`` allows specifying an earlier Python 3 version. For example, ``feature_version=(3, 4)`` will treat :keyword:`async` and :keyword:`await` as non-reserved words.
ru: ``feature_version = (3, N)`` позволяет указать более раннюю версию Python 3. Например, ``feature_version = (3, 4)`` будет рассматривать :keyword:`async` и :keyword:`await` как незарезервированные слова.

source: (Contributed by Guido van Rossum in :issue:`35766`.)
ru: (Предоставлено Гвидо ван Россумом в :issue:`35766`.)

source: :func:`asyncio.run` has graduated from the provisional to stable API. This function can be used to execute a :term:`coroutine` and return the result while automatically managing the event loop. For example::
ru: :func:`asyncio.run` превратился из предварительного API в стабильный. Эту функцию можно использовать для выполнения сопрограммы и возврата результата при автоматическом управлении циклом событий. Например::

source: This is *roughly* equivalent to::
ru: Это *примерно* эквивалентно::

source: The actual implementation is significantly more complex. Thus, :func:`asyncio.run` should be the preferred way of running asyncio programs.
ru: Фактическая реализация значительно сложнее. Таким образом, :func:`asyncio.run` должен быть предпочтительным способом запуска asyncio-программ.

source: Running ``python -m asyncio`` launches a natively async REPL. This allows rapid experimentation with code that has a top-level :keyword:`await`. There is no longer a need to directly call ``asyncio.run()`` which would spawn a new event loop on every invocation:
ru: Запуск ``python -m asyncio`` запускает асинхронный REPL. Это позволяет быстро экспериментировать с кодом, имеющим :keyword:`await` верхнего уровня. Больше нет необходимости напрямую вызывать asyncio.run(), который будет порождать новый цикл событий при каждом вызове:

source: The exception :class:`asyncio.CancelledError` now inherits from :class:`BaseException` rather than :class:`Exception` and no longer inherits from :class:`concurrent.futures.CancelledError`. (Contributed by Yury Selivanov in :issue:`32528`.)
ru: Исключение :class:`asyncio.CancelledError` теперь наследуется от :class:`BaseException`, а не от :class:`Exception` и больше не наследуется от :class:`concurrent.futures.CancelledError`. (Добавлен Юрием Селивановым в :issue:`32528`.)

source: On Windows, the default event loop is now :class:`~asyncio.ProactorEventLoop`. (Contributed by Victor Stinner in :issue:`34687`.)
ru: В Windows цикл событий по умолчанию теперь имеет вид :class:`~asyncio.ProactorEventLoop`. (Предоставлено Виктором Стиннером в :issue:`34687`.)

source: :class:`~asyncio.ProactorEventLoop` now also supports UDP. (Contributed by Adam Meily and Andrew Svetlov in :issue:`29883`.)
ru: :class:`~asyncio.ProactorEventLoop` теперь также поддерживает UDP. (Предоставлено Адамом Мейли и Эндрю Светловым в :issue:`29883`.)

source: :class:`~asyncio.ProactorEventLoop` can now be interrupted by :exc:`KeyboardInterrupt` ("CTRL+C"). (Contributed by Vladimir Matveev in :issue:`23057`.)
ru: :class:`~asyncio.ProactorEventLoop` теперь можно прервать :exc:`KeyboardInterrupt` ("CTRL+C"). (Внесено Владимиром Матвеевым в :issue:`23057`.)

source: Added :meth:`asyncio.Task.get_coro` for getting the wrapped coroutine within an :class:`asyncio.Task`. (Contributed by Alex Grönholm in :issue:`36999`.)
ru: Добавлен :meth:`asyncio.Task.get_coro` для получения завернутой сопрограммы в :class:`asyncio.Task`. (Предоставлено Алексом Грёнхольмом в :issue:`36999`.)

source: Asyncio tasks can now be named, either by passing the ``name`` keyword argument to :func:`asyncio.create_task` or the :meth:`~asyncio.loop.create_task` event loop method, or by calling the :meth:`~asyncio.Task.set_name` method on the task object. The task name is visible in the ``repr()`` output of :class:`asyncio.Task` and can also be retrieved using the :meth:`~asyncio.Task.get_name` method. (Contributed by Alex Grönholm in :issue:`34270`.)
ru: Задачам Asyncio теперь можно присваивать имена либо путем передачи аргумента ключевого слова ``name`` в :func:`asyncio.create_task` или метода цикла событий :meth:`~asyncio.loop.create_task`, либо путем вызова :meth :`~asyncio.Task.set_name` для объекта задачи. Имя задачи отображается в выводе ``repr()`` :class:`asyncio.Task`, а также может быть получено с помощью метода :meth:`~asyncio.Task.get_name`. (Предоставлено Алексом Грёнхольмом в :issue:`34270`.)

source: Added support for `Happy Eyeballs <https://en.wikipedia.org/wiki/Happy_Eyeballs>`_ to :func:`asyncio.loop.create_connection`. To specify the behavior, two new parameters have been added: *happy_eyeballs_delay* and *interleave*. The Happy Eyeballs algorithm improves responsiveness in applications that support IPv4 and IPv6 by attempting to simultaneously connect using both. (Contributed by twisteroid ambassador in :issue:`33530`.)
ru: Добавлена ​​поддержка `Happy Eyeballs <https://en.wikipedia.org/wiki/Happy_Eyeballs>`_ в :func:`asyncio.loop.create_connection`. Чтобы указать поведение, были добавлены два новых параметра: *happy_eyeballs_delay* и *interleave*. Алгоритм Happy Eyeballs повышает скорость реагирования приложений, поддерживающих IPv4 и IPv6, пытаясь одновременно подключиться с использованием обоих. (Предоставлено послом Twisteroid в :issue:`33530`.)

source: builtins
ru: встроенные

source: The :func:`compile` built-in has been improved to accept the ``ast.PyCF_ALLOW_TOP_LEVEL_AWAIT`` flag. With this new flag passed, :func:`compile` will allow top-level ``await``, ``async for`` and ``async with`` constructs that are usually considered invalid syntax. Asynchronous code object marked with the ``CO_COROUTINE`` flag may then be returned. (Contributed by Matthias Bussonnier in :issue:`34616`)
ru: Встроенная функция :func:`compile` была улучшена и теперь принимает флаг ``ast.PyCF_ALLOW_TOP_LEVEL_AWAIT``. После передачи этого нового флага :func:`compile` позволит использовать конструкции верхнего уровня ``await``, ``async for`` и ``async with``, которые обычно считаются недопустимым синтаксисом. Затем может быть возвращен объект асинхронного кода, отмеченный флагом CO_COROUTINE. (Предоставлено Матиасом Бюссонье в :issue:`34616`)

source: collections
ru: коллекции

source: The :meth:`~collections.somenamedtuple._asdict` method for :func:`collections.namedtuple` now returns a :class:`dict` instead of a :class:`collections.OrderedDict`. This works because regular dicts have guaranteed ordering since Python 3.7. If the extra features of :class:`OrderedDict` are required, the suggested remediation is to cast the result to the desired type: ``OrderedDict(nt._asdict())``. (Contributed by Raymond Hettinger in :issue:`35864`.)
ru: Метод :meth:`~collections.somenamedtuple._asdict` для :func:`collections.namedtuple` теперь возвращает :class:`dict` вместо :class:`collections.OrderedDict`. Это работает, потому что обычные словари гарантируют порядок, начиная с Python 3.7. Если требуются дополнительные возможности :class:`OrderedDict`, предлагаемое исправление состоит в приведении результата к желаемому типу: ``OrderedDict(nt._asdict())``. (Предоставлено Рэймондом Хеттингером в :issue:`35864`.)

source: The :class:`cProfile.Profile <profile.Profile>` class can now be used as a context manager. Profile a block of code by running::
ru: Класс :class:`cProfile.Profile <profile.Profile>` теперь можно использовать в качестве менеджера контекста. Профилируйте блок кода, запустив::

source: (Contributed by Scott Sanderson in :issue:`29235`.)
ru: (Предоставлено Скоттом Сандерсоном в :issue:`29235`.)

source: The :class:`csv.DictReader` now returns instances of :class:`dict` instead of a :class:`collections.OrderedDict`. The tool is now faster and uses less memory while still preserving the field order. (Contributed by Michael Selik in :issue:`34003`.)
ru: :class:`csv.DictReader` теперь возвращает экземпляры :class:`dict` вместо :class:`collections.OrderedDict`. Инструмент теперь работает быстрее и использует меньше памяти, сохраняя при этом порядок полей. (Предоставлено Майклом Селиком в :issue:`34003`.)

source: Added a new variable holding structured version information for the underlying ncurses library: :data:`~curses.ncurses_version`. (Contributed by Serhiy Storchaka in :issue:`31680`.)
ru: Добавлена ​​новая переменная, содержащая структурированную информацию о версии базовой библиотеки ncurses: :data:`~curses.ncurses_version`. (Предоставлено Сергеем Сторчакой в ​​:issue:`31680`.)

source: On Windows, :class:`~ctypes.CDLL` and subclasses now accept a *winmode* parameter to specify flags for the underlying ``LoadLibraryEx`` call. The default flags are set to only load DLL dependencies from trusted locations, including the path where the DLL is stored (if a full or partial path is used to load the initial DLL) and paths added by :func:`~os.add_dll_directory`. (Contributed by Steve Dower in :issue:`36085`.)
ru: В Windows :class:`~ctypes.CDLL` и подклассы теперь принимают параметр *winmode* для указания флагов для базового вызова ``LoadLibraryEx``. Флаги по умолчанию установлены на загрузку зависимостей DLL только из доверенных мест, включая путь, по которому хранится DLL (если для загрузки исходной DLL используется полный или частичный путь) и пути, добавленные :func:`~os.add_dll_directory` . (Предоставлено Стивом Дауэром в :issue:`36085`.)

source: :func:`functools.lru_cache` can now be used as a straight decorator rather than as a function returning a decorator. So both of these are now supported::
ru: :func:`functools.lru_cache` теперь можно использовать как прямой декоратор, а не как функцию, возвращающую декоратор. Итак, оба из них теперь поддерживаются::

source: (Contributed by Raymond Hettinger in :issue:`36772`.)
ru: (Предоставлено Рэймондом Хеттингером в :issue:`36772`.)

source: Added a new :func:`functools.cached_property` decorator, for computed properties cached for the life of the instance. ::
ru: Добавлен новый декоратор :func:`functools.cached_property` для вычисляемых свойств, кэшируемых на весь срок существования экземпляра. ::

source: (Contributed by Carl Meyer in :issue:`21145`)
ru: (Предоставлено Карлом Мейером в :issue:`21145`)

source: Added a new :func:`functools.singledispatchmethod` decorator that converts methods into :term:`generic functions <generic function>` using :term:`single dispatch`::
ru: Добавлен новый декоратор :func:`functools.singledispatchmethod`, который преобразует методы в :term:`универсальные функции <generic function>` с помощью :term:`single диспетчеризации`::

source: (Contributed by Ethan Smith in :issue:`32380`)
ru: (Предоставлено Итаном Смитом в :issue:`32380`)

source: :func:`~gc.get_objects` can now receive an optional *generation* parameter indicating a generation to get objects from. (Contributed by Pablo Galindo in :issue:`36016`.)
ru: :func:`~gc.get_objects` теперь может получать необязательный параметр *generation*, указывающий поколение, из которого нужно получить объекты. (Предоставлено Пабло Галиндо в :issue:`36016`.)

source: Added :func:`~gettext.pgettext` and its variants. (Contributed by Franz Glasner, Éric Araujo, and Cheryl Sabella in :issue:`2504`.)
ru: Добавлен :func:`~gettext.pgettext` и его варианты. (Предоставлено Францем Гласнером, Эриком Араужо и Шерил Сабеллой в :issue:`2504`.)

source: Added the *mtime* parameter to :func:`gzip.compress` for reproducible output. (Contributed by Guo Ci Teo in :issue:`34898`.)
ru: Добавлен параметр *mtime* в :func:`gzip.compress` для воспроизводимого вывода. (Предоставлено Го Ци Тео в :issue:`34898`.)

source: A :exc:`~gzip.BadGzipFile` exception is now raised instead of :exc:`OSError` for certain types of invalid or corrupt gzip files. (Contributed by Filip Gruszczyński, Michele Orrù, and Zackery Spytz in :issue:`6584`.)
ru: Исключение :exc:`~gzip.BadGzipFile` теперь вызывается вместо :exc:`OSError` для определенных типов недействительных или поврежденных файлов gzip. (Предоставлено Филипом Грущиньским, Мишелем Орру и Закери Шпитцем в :issue:`6584`.)

source: IDLE and idlelib
ru: IDLE и idlelib

source: Output over N lines (50 by default) is squeezed down to a button. N can be changed in the PyShell section of the General page of the Settings dialog. Fewer, but possibly extra long, lines can be squeezed by right clicking on the output. Squeezed output can be expanded in place by double-clicking the button or into the clipboard or a separate window by right-clicking the button. (Contributed by Tal Einat in :issue:`1529353`.)
ru: Вывод в N строк (по умолчанию 50) сжимается до кнопки. N можно изменить в разделе PyShell на странице «Общие» диалогового окна «Настройки». Меньшее количество, но, возможно, более длинные строки можно сжать, щелкнув правой кнопкой мыши по выходным данным. Сжатый вывод можно развернуть на месте, дважды щелкнув кнопку, или в буфер обмена или в отдельное окно, щелкнув кнопку правой кнопкой мыши. (Предоставлено Талом Эйнатом в :issue:`1529353`.)

source: Add "Run Customized" to the Run menu to run a module with customized settings. Any command line arguments entered are added to sys.argv. They also re-appear in the box for the next customized run. One can also suppress the normal Shell main module restart. (Contributed by Cheryl Sabella, Terry Jan Reedy, and others in :issue:`5680` and :issue:`37627`.)
ru: Добавьте «Запустить по индивидуальному заказу» в меню «Выполнить», чтобы запустить модуль с настроенными настройками. Все введенные аргументы командной строки добавляются в sys.argv. Они также снова появятся в поле для следующего индивидуального запуска. Также можно запретить обычный перезапуск основного модуля Shell. (Внесено Шерил Сабеллой, Терри Джен Риди и другими в :issue:`5680` и :issue:`37627`.)

source: Added optional line numbers for IDLE editor windows. Windows open without line numbers unless set otherwise in the General tab of the configuration dialog. Line numbers for an existing window are shown and hidden in the Options menu. (Contributed by Tal Einat and Saimadhav Heblikar in :issue:`17535`.)
ru: Добавлены необязательные номера строк для окон редактора IDLE. Окна открываются без номеров строк, если иное не установлено на вкладке «Общие» диалогового окна конфигурации. Номера строк существующего окна отображаются и скрываются в меню «Параметры». (Предоставлено Талом Эйнатом и Саймадхавом Хебликаром в :issue:`17535`.)

source: OS native encoding is now used for converting between Python strings and Tcl objects. This allows IDLE to work with emoji and other non-BMP characters. These characters can be displayed or copied and pasted to or from the clipboard. Converting strings from Tcl to Python and back now never fails. (Many people worked on this for eight years but the problem was finally solved by Serhiy Storchaka in :issue:`13153`.)
ru: Для преобразования строк Python и объектов Tcl теперь используется собственная кодировка ОС. Это позволяет IDLE работать с эмодзи и другими символами, отличными от BMP. Эти символы можно отображать, копировать и вставлять в буфер обмена или из него. Преобразование строк из Tcl в Python и обратно теперь никогда не дает сбоев. (Многие люди работали над этим в течение восьми лет, но наконец проблема была решена Сергеем Сторчакой в ​​:issue:`13153`.)

source: New in 3.8.1:
ru: Новое в версии 3.8.1:

source: Add option to toggle cursor blink off. (Contributed by Zackery Spytz in :issue:`4603`.)
ru: Добавьте опцию для отключения мигания курсора. (Предоставлено Закери Шпитцем в :issue:`4603`.)

source: Escape key now closes IDLE completion windows. (Contributed by Johnny Najera in :issue:`38944`.)
ru: Клавиша Escape теперь закрывает окна завершения IDLE. (Предоставлено Джонни Наджерой в :issue:`38944`.)

source: The changes above have been backported to 3.7 maintenance releases.
ru: Вышеупомянутые изменения были перенесены в сервисные выпуски 3.7.

source: Add keywords to module name completion list. (Contributed by Terry J. Reedy in :issue:`37765`.)
ru: Добавьте ключевые слова в список завершения имени модуля. (Предоставлено Терри Дж. Риди в :issue:`37765`.)
