Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/whatsnew/3.8.po
Languages: ru

source: The :func:`inspect.getdoc` function can now find docstrings for ``__slots__`` if that attribute is a :class:`dict` where the values are docstrings. This provides documentation options similar to what we already have for :func:`property`, :func:`classmethod`, and :func:`staticmethod`::
ru: Функция :func:`inspect.getdoc` теперь может находить строки документации для ``__slots__``, если этот атрибут является :class:`dict`, где значения являются строками документации. Это предоставляет параметры документации, аналогичные тем, которые у нас уже есть для :func:`property`, :func:`classmethod` и :func:`staticmethod`::

source: (Contributed by Raymond Hettinger in :issue:`36326`.)
ru: (Предоставлено Рэймондом Хеттингером в :issue:`36326`.)

source: In development mode (:option:`-X` ``env``) and in :ref:`debug build <debug-build>`, the :class:`io.IOBase` finalizer now logs the exception if the ``close()`` method fails. The exception is ignored silently by default in release build. (Contributed by Victor Stinner in :issue:`18748`.)
ru: В режиме разработки (:option:`-X` ``env``) и в :ref:`debug build <debug-build>` финализатор :class:`io.IOBase` теперь регистрирует исключение, если `` close()`` метод завершается с ошибкой. По умолчанию в сборке выпуска исключение игнорируется автоматически. (Предоставлено Виктором Стиннером в :issue:`18748`.)

source: The :func:`itertools.accumulate` function added an option *initial* keyword argument to specify an initial value::
ru: В функцию :func:`itertools.accumulate` добавлен ключевой аргумент опции *initial* для указания начального значения::

source: (Contributed by Lisa Roach in :issue:`34659`.)
ru: (Предоставлено Лизой Роуч в :issue:`34659`.)

source: Add option ``--json-lines`` to parse every input line as a separate JSON object. (Contributed by Weipeng Hong in :issue:`31553`.)
ru: Добавьте опцию ``--json-lines`` для анализа каждой входной строки как отдельного объекта JSON. (Предоставлено Вейпенгом Хонгом в :issue:`31553`.)

source: logging
ru: логирование

source: This solves a long-standing problem. Once a logger or *basicConfig()* had been called, subsequent calls to *basicConfig()* were silently ignored. This made it difficult to update, experiment with, or teach the various logging configuration options using the interactive prompt or a Jupyter notebook.
ru: Это решает давнюю проблему. После вызова средства ведения журнала или *basicConfig()* последующие вызовы *basicConfig()* молча игнорировались. Это затрудняло обновление, экспериментирование или обучение различным параметрам конфигурации ведения журнала с помощью интерактивной подсказки или блокнота Jupyter.

source: math
ru: математика

source: Added new function :func:`math.dist` for computing Euclidean distance between two points. (Contributed by Raymond Hettinger in :issue:`33089`.)
ru: Добавлена ​​новая функция :func:`math.dist` для вычисления евклидова расстояния между двумя точками. (Предоставлено Рэймондом Хеттингером в :issue:`33089`.)

source: Expanded the :func:`math.hypot` function to handle multiple dimensions. Formerly, it only supported the 2-D case. (Contributed by Raymond Hettinger in :issue:`33089`.)
ru: Расширена функция :func:`math.hypot` для обработки нескольких измерений. Раньше он поддерживал только 2D-случай. (Предоставлено Рэймондом Хеттингером в :issue:`33089`.)

source: Added new function, :func:`math.prod`, as analogous function to :func:`sum` that returns the product of a 'start' value (default: 1) times an iterable of numbers::
ru: Добавлена ​​новая функция :func:`math.prod`, аналогичная функции :func:`sum`, которая возвращает произведение начального значения (по умолчанию: 1) на итерацию чисел::

source: (Contributed by Pablo Galindo in :issue:`35606`.)
ru: (Предоставлено Пабло Галиндо в :issue:`35606`.)

source: Added two new combinatoric functions :func:`math.perm` and :func:`math.comb`::
ru: Добавлены две новые комбинаторные функции :func:`math.perm` и :func:`math.comb`::

source: (Contributed by Yash Aggarwal, Keller Fuchs, Serhiy Storchaka, and Raymond Hettinger in :issue:`37128`, :issue:`37178`, and :issue:`35431`.)
ru: (Предоставлено Яшем Аггарвалом, Келлером Фуксом, Сергеем Сторчакой и Раймондом Хеттингером в :issue:`37128`, :issue:`37178` и :issue:`35431`.)

source: Added a new function :func:`math.isqrt` for computing accurate integer square roots without conversion to floating point. The new function supports arbitrarily large integers. It is faster than ``floor(sqrt(n))`` but slower than :func:`math.sqrt`::
ru: Добавлена ​​новая функция :func:`math.isqrt` для вычисления точных целочисленных квадратных корней без преобразования в числа с плавающей запятой. Новая функция поддерживает сколь угодно большие целые числа. Это быстрее, чем Floor(sqrt(n)) но медленнее, чем :func:`math.sqrt`::

source: (Contributed by Mark Dickinson in :issue:`36887`.)
ru: (Предоставлено Марком Дикинсоном в :issue:`36887`.)

source: The function :func:`math.factorial` no longer accepts arguments that are not int-like. (Contributed by Pablo Galindo in :issue:`33083`.)
ru: Функция :func:`math.factorial` больше не принимает аргументы, отличные от целочисленных. (Предоставлено Пабло Галиндо в :issue:`33083`.)

source: The :class:`mmap.mmap` class now has an :meth:`~mmap.mmap.madvise` method to access the ``madvise()`` system call. (Contributed by Zackery Spytz in :issue:`32941`.)
ru: Класс :class:`mmap.mmap` теперь имеет метод :meth:`~mmap.mmap.madvise` для доступа к системному вызову ``madvise()``. (Предоставлено Закери Шпитцем в :issue:`32941`.)

source: Added new :mod:`multiprocessing.shared_memory` module. (Contributed by Davin Potts in :issue:`35813`.)
ru: Добавлен новый модуль multiprocessing.shared_memory. (Предоставлено Дэвином Поттсом в :issue:`35813`.)

source: On macOS, the *spawn* start method is now used by default. (Contributed by Victor Stinner in :issue:`33725`.)
ru: В macOS метод запуска *spawn* теперь используется по умолчанию. (Предоставлено Виктором Стиннером в :issue:`33725`.)

source: Added new function :func:`~os.add_dll_directory` on Windows for providing additional search paths for native dependencies when importing extension modules or loading DLLs using :mod:`ctypes`. (Contributed by Steve Dower in :issue:`36085`.)
ru: Добавлена ​​новая функция :func:`~os.add_dll_directory` в Windows для предоставления дополнительных путей поиска для собственных зависимостей при импорте модулей расширения или загрузке DLL с использованием :mod:`ctypes`. (Предоставлено Стивом Дауэром в :issue:`36085`.)

source: A new :func:`os.memfd_create` function was added to wrap the ``memfd_create()`` syscall. (Contributed by Zackery Spytz and Christian Heimes in :issue:`26836`.)
ru: Была добавлена ​​новая функция :func:`os.memfd_create` для обертывания системного вызова ``memfd_create()``. (Предоставлено Закери Шпитцем и Кристианом Хаймсом в :issue:`26836`.)

source: On Windows, much of the manual logic for handling reparse points (including symlinks and directory junctions) has been delegated to the operating system. Specifically, :func:`os.stat` will now traverse anything supported by the operating system, while :func:`os.lstat` will only open reparse points that identify as "name surrogates" while others are opened as for :func:`os.stat`. In all cases, :attr:`stat_result.st_mode` will only have ``S_IFLNK`` set for symbolic links and not other kinds of reparse points. To identify other kinds of reparse point, check the new :attr:`stat_result.st_reparse_tag` attribute.
ru: В Windows большая часть ручной логики обработки точек повторной обработки (включая символические ссылки и соединения каталогов) была делегирована операционной системе. В частности, :func:`os.stat` теперь будет просматривать все, что поддерживается операционной системой, тогда как :func:`os.lstat` будет открывать только точки повторной обработки, которые идентифицируются как «суррогаты имени», в то время как другие открываются, как и для :func: `os.stat`. Во всех случаях в :attr:`stat_result.st_mode` будет установлен только ``S_IFLNK`` для символических ссылок, а не для других типов точек повторной обработки. Чтобы определить другие типы точек повторной обработки, проверьте новый атрибут :attr:`stat_result.st_reparse_tag`.

source: On Windows, :func:`os.readlink` is now able to read directory junctions. Note that :func:`~os.path.islink` will return ``False`` for directory junctions, and so code that checks ``islink`` first will continue to treat junctions as directories, while code that handles errors from :func:`os.readlink` may now treat junctions as links.
ru: В Windows :func:`os.readlink` теперь может читать соединения каталогов. Обратите внимание, что :func:`~os.path.islink` будет возвращать ``False`` для соединений каталогов, и поэтому код, который сначала проверяет ``islink``, будет продолжать рассматривать соединения как каталоги, в то время как код, который обрабатывает ошибки из: func:`os.readlink` теперь может рассматривать соединения как ссылки.

source: (Contributed by Steve Dower in :issue:`37834`.)
ru: (Предоставлено Стивом Дауэром в :issue:`37834`.)

source: :mod:`os.path` functions that return a boolean result like :func:`~os.path.exists`, :func:`~os.path.lexists`, :func:`~os.path.isdir`, :func:`~os.path.isfile`, :func:`~os.path.islink`, and :func:`~os.path.ismount` now return ``False`` instead of raising :exc:`ValueError` or its subclasses :exc:`UnicodeEncodeError` and :exc:`UnicodeDecodeError` for paths that contain characters or bytes unrepresentable at the OS level. (Contributed by Serhiy Storchaka in :issue:`33721`.)
ru: :mod:`os.path` функции, которые возвращают логический результат, например :func:`~os.path.exists`, :func:`~os.path.lexists`, :func:`~os.path.isdir` , :func:`~os.path.isfile`, :func:`~os.path.islink` и :func:`~os.path.ismount` теперь возвращают ``False`` вместо вызова :exc: `ValueError` или его подклассы :exc:`UnicodeEncodeError` и :exc:`UnicodeDecodeError` для путей, содержащих символы или байты, непредставимые на уровне ОС. (Предоставлено Сергеем Сторчакой в ​​:issue:`33721`.)

source: :func:`~os.path.expanduser` on Windows now prefers the :envvar:`USERPROFILE` environment variable and does not use :envvar:`HOME`, which is not normally set for regular user accounts. (Contributed by Anthony Sottile in :issue:`36264`.)
ru: :func:`~os.path.expanduser` в Windows теперь предпочитает переменную среды :envvar:`USERPROFILE` и не использует :envvar:`HOME`, которая обычно не устанавливается для обычных учетных записей пользователей. (Предоставлено Энтони Соттайлом в :issue:`36264`.)

source: :func:`~os.path.isdir` on Windows no longer returns ``True`` for a link to a non-existent directory.
ru: :func:`~os.path.isdir` в Windows больше не возвращает ``True`` для ссылки на несуществующий каталог.

source: :func:`~os.path.realpath` on Windows now resolves reparse points, including symlinks and directory junctions.
ru: :func:`~os.path.realpath` в Windows теперь разрешает точки повторной обработки, включая символические ссылки и соединения каталогов.

source: :mod:`pickle` extensions subclassing the C-optimized :class:`~pickle.Pickler` can now override the pickling logic of functions and classes by defining the special :meth:`~pickle.Pickler.reducer_override` method. (Contributed by Pierre Glaser and Olivier Grisel in :issue:`35900`.)
ru: Расширения :mod:`pickle`, создающие подкласс оптимизированного для C :class:`~pickle.Pickler`, теперь могут переопределять логику травления функций и классов, определяя специальный метод :meth:`~pickle.Pickler.reducer_override`. (Предоставлено Пьером Глейзером и Оливье Гризелем в :issue:`35900`.)

source: Added new :class:`plistlib.UID` and enabled support for reading and writing NSKeyedArchiver-encoded binary plists. (Contributed by Jon Janzen in :issue:`26707`.)
ru: Добавлен новый :class:`plistlib.UID` и включена поддержка чтения и записи двоичных списков в кодировке NSKeyedArchiver. (Предоставлено Джоном Янзеном в :issue:`26707`.)

source: The :mod:`pprint` module added a *sort_dicts* parameter to several functions. By default, those functions continue to sort dictionaries before rendering or printing. However, if *sort_dicts* is set to false, the dictionaries retain the order that keys were inserted. This can be useful for comparison to JSON inputs during debugging.
ru: Модуль :mod:`pprint` добавил параметр *sort_dicts* в несколько функций. По умолчанию эти функции продолжают сортировать словари перед рендерингом или печатью. Однако если для *sort_dicts* установлено значение false, словари сохраняют порядок вставки ключей. Это может быть полезно для сравнения с входными данными JSON во время отладки.

source: In addition, there is a convenience new function, :func:`pprint.pp` that is like :func:`pprint.pprint` but with *sort_dicts* defaulting to ``False``::
ru: Кроме того, появилась новая удобная функция :func:`pprint.pp`, похожая на :func:`pprint.pprint`, но с *sort_dicts* по умолчанию равным ``False``::

source: (Contributed by Rémi Lapeyre in :issue:`30670`.)
ru: (Предоставлено Реми Лапейром в :issue:`30670`.)

source: :func:`py_compile.compile` now supports silent mode. (Contributed by Joannah Nanjekye in :issue:`22640`.)
ru: :func:`py_compile.compile` теперь поддерживает тихий режим. (Внесено Джоанной Нанжекье в :issue:`22640`.)

source: The new :func:`shlex.join` function acts as the inverse of :func:`shlex.split`. (Contributed by Bo Bayles in :issue:`32102`.)
ru: Новая функция :func:`shlex.join` действует как инверсия :func:`shlex.split`. (Предоставлено Бо Бейлсом в :issue:`32102`.)

source: :func:`shutil.copytree` now accepts a new ``dirs_exist_ok`` keyword argument. (Contributed by Josh Bronson in :issue:`20849`.)
ru: :func:`shutil.copytree` теперь принимает новый аргумент ключевого слова ``dirs_exist_ok``. (Предоставлено Джошем Бронсоном в :issue:`20849`.)

source: :func:`shutil.make_archive` now defaults to the modern pax (POSIX.1-2001) format for new archives to improve portability and standards conformance, inherited from the corresponding change to the :mod:`tarfile` module. (Contributed by C.A.M. Gerlach in :issue:`30661`.)
ru: :func:`shutil.make_archive` теперь по умолчанию использует современный формат pax (POSIX.1-2001) для новых архивов для улучшения переносимости и соответствия стандартам, унаследованным от соответствующего изменения в модуле :mod:`tarfile`. (Предоставлено САМ Герлахом в :issue:`30661`.)

source: :func:`shutil.rmtree` on Windows now removes directory junctions without recursively removing their contents first. (Contributed by Steve Dower in :issue:`37834`.)
ru: :func:`shutil.rmtree` в Windows теперь удаляет соединения каталогов без предварительного рекурсивного удаления их содержимого. (Предоставлено Стивом Дауэром в :issue:`37834`.)

source: socket
ru: сокет

source: Added :attr:`~ssl.SSLContext.post_handshake_auth` to enable and :meth:`~ssl.SSLSocket.verify_client_post_handshake` to initiate TLS 1.3 post-handshake authentication. (Contributed by Christian Heimes in :issue:`34670`.)
ru: Добавлен :attr:`~ssl.SSLContext.post_handshake_auth` для включения и :meth:`~ssl.SSLSocket.verify_client_post_handshake` для инициации аутентификации TLS 1.3 после рукопожатия. (Предоставлено Кристианом Хаймсом в :issue:`34670`.)

source: statistics
ru: статистика

source: Added :func:`statistics.multimode` that returns a list of the most common values. (Contributed by Raymond Hettinger in :issue:`35892`.)
ru: Добавлен :func:`statistics.multimode`, который возвращает список наиболее распространенных значений. (Предоставлено Рэймондом Хеттингером в :issue:`35892`.)

source: Added :func:`statistics.quantiles` that divides data or a distribution in to equiprobable intervals (e.g. quartiles, deciles, or percentiles). (Contributed by Raymond Hettinger in :issue:`36546`.)
ru: Добавлена ​​функция :func:`statistics.quantiles`, которая делит данные или распределение на равновероятные интервалы (например, квартили, децили или процентили). (Предоставлено Рэймондом Хеттингером в :issue:`36546`.)

source: Added :class:`statistics.NormalDist`, a tool for creating and manipulating normal distributions of a random variable. (Contributed by Raymond Hettinger in :issue:`36018`.)
ru: Добавлен :class:`statistics.NormalDist`, инструмент для создания и управления нормальными распределениями случайной величины. (Предоставлено Рэймондом Хеттингером в :issue:`36018`.)

source: Add new :func:`sys.unraisablehook` function which can be overridden to control how "unraisable exceptions" are handled. It is called when an exception has occurred but there is no way for Python to handle it. For example, when a destructor raises an exception or during garbage collection (:func:`gc.collect`). (Contributed by Victor Stinner in :issue:`36829`.)
ru: Добавьте новую функцию :func:`sys.unraisablehook`, которую можно переопределить, чтобы контролировать обработку «невозможных исключений». Он вызывается, когда произошло исключение, но Python не может его обработать. Например, когда деструктор вызывает исключение или во время сборки мусора (:func:`gc.collect`). (Предоставлено Виктором Стиннером в :issue:`36829`.)

source: The :mod:`tarfile` module now defaults to the modern pax (POSIX.1-2001) format for new archives, instead of the previous GNU-specific one. This improves cross-platform portability with a consistent encoding (UTF-8) in a standardized and extensible format, and offers several other benefits. (Contributed by C.A.M. Gerlach in :issue:`36268`.)
ru: Модуль :mod:`tarfile` теперь по умолчанию использует современный формат pax (POSIX.1-2001) для новых архивов вместо предыдущего формата, специфичного для GNU. Это улучшает межплатформенную переносимость за счет согласованной кодировки (UTF-8) в стандартизированном и расширяемом формате, а также дает ряд других преимуществ. (Предоставлено САМ Герлахом в :issue:`36268`.)

source: Add a new :func:`threading.excepthook` function which handles uncaught :meth:`threading.Thread.run` exception. It can be overridden to control how uncaught :meth:`threading.Thread.run` exceptions are handled. (Contributed by Victor Stinner in :issue:`1230540`.)
ru: Добавьте новую функцию :func:`threading.excepthook`, которая обрабатывает неперехваченное исключение :meth:`threading.Thread.run`. Его можно переопределить, чтобы контролировать обработку неперехваченных исключений :meth:`threading.Thread.run`. (Предоставлено Виктором Стиннером в :issue:`1230540`.)

source: Add a new :func:`threading.get_native_id` function and a :data:`~threading.Thread.native_id` attribute to the :class:`threading.Thread` class. These return the native integral Thread ID of the current thread assigned by the kernel. This feature is only available on certain platforms, see :func:`get_native_id <threading.get_native_id>` for more information. (Contributed by Jake Tesler in :issue:`36084`.)
ru: Добавьте новую функцию :func:`threading.get_native_id` и атрибут :data:`~threading.Thread.native_id` в класс :class:`threading.Thread`. Они возвращают собственный интегральный идентификатор текущего потока, назначенный ядром. Эта функция доступна только на определенных платформах. Для получения дополнительной информации см. :func:`get_native_id <threading.get_native_id>`. (Предоставлено Джейком Теслером в :issue:`36084`.)

source: tokenize
ru: токенизировать

source: The :mod:`tokenize` module now implicitly emits a ``NEWLINE`` token when provided with input that does not have a trailing new line. This behavior now matches what the C tokenizer does internally. (Contributed by Ammar Askar in :issue:`33899`.)
ru: Модуль :mod:`tokenize` теперь неявно выдает токен ``NEWLINE`` при вводе, который не имеет завершающей новой строки. Теперь это поведение соответствует тому, что делает токенизатор C внутри. (Предоставлено Аммаром Аскаром в :issue:`33899`.)

source: Added methods :meth:`~tkinter.Spinbox.selection_from`, :meth:`~tkinter.Spinbox.selection_present`, :meth:`~tkinter.Spinbox.selection_range` and :meth:`~tkinter.Spinbox.selection_to` in the :class:`tkinter.Spinbox` class. (Contributed by Juliette Monsel in :issue:`34829`.)
ru: В класс :class:`tkinter.Spinbox`. (Предоставлено Джульеттой Монсель в :issue:`34829`.)

source: Added method :meth:`~tkinter.Canvas.moveto` in the :class:`tkinter.Canvas` class. (Contributed by Juliette Monsel in :issue:`23831`.)
ru: Добавлен метод :meth:`~tkinter.Canvas.moveto` в класс :class:`tkinter.Canvas`. (Внесено Джульеттой Монсель в :issue:`23831`.)

source: The :class:`tkinter.PhotoImage` class now has :meth:`~tkinter.PhotoImage.transparency_get` and :meth:`~tkinter.PhotoImage.transparency_set` methods. (Contributed by Zackery Spytz in :issue:`25451`.)
ru: Класс :class:`tkinter.PhotoImage` теперь имеет методы :meth:`~tkinter.PhotoImage.transparency_get` и :meth:`~tkinter.PhotoImage.transparency_set`. (Предоставлено Закери Шпитцем в :issue:`25451`.)

source: time
ru: время

source: typing
ru: печатание

source: The :mod:`typing` module incorporates several new features:
ru: Модуль :mod:`typing` включает в себя несколько новых функций:

source: A dictionary type with per-key types. See :pep:`589` and :class:`typing.TypedDict`. TypedDict uses only string keys. By default, every key is required to be present. Specify "total=False" to allow keys to be optional::
ru: Тип словаря с типами для каждого ключа. См. :pep:`589` и :class:`typing.TypedDict`. TypedDict использует только строковые ключи. По умолчанию каждый ключ должен присутствовать. Укажите «total=False», чтобы ключи были необязательными::

source: Literal types. See :pep:`586` and :class:`typing.Literal`. Literal types indicate that a parameter or return value is constrained to one or more specific literal values::
ru: Литеральные типы. См. :pep:`586` и :class:`typing.Literal`. Литеральные типы указывают, что параметр или возвращаемое значение ограничено одним или несколькими конкретными литеральными значениями:

source: "Final" variables, functions, methods and classes. See :pep:`591`, :class:`typing.Final` and :func:`typing.final`. The final qualifier instructs a static type checker to restrict subclassing, overriding, or reassignment::
ru: «Конечные» переменные, функции, методы и классы. См. :pep:`591`, :class:`typing.Final` и :func:`typing.final`. Последний квалификатор указывает средству проверки статического типа ограничить создание подклассов, переопределение или переназначение:

source: Protocol definitions. See :pep:`544`, :class:`typing.Protocol` and :func:`typing.runtime_checkable`. Simple ABCs like :class:`typing.SupportsInt` are now ``Protocol`` subclasses.
ru: Определения протоколов. См. :pep:`544`, :class:`typing.Protocol` и :func:`typing.runtime_checkable`. Простые ABC, такие как :class:`typing.SupportsInt`, теперь являются подклассами ``Protocol``.

source: New protocol class :class:`typing.SupportsIndex`.
ru: Новый класс протокола:class:`typing.SupportsIndex`.

source: New functions :func:`typing.get_origin` and :func:`typing.get_args`.
ru: Новые функции :func:`typing.get_origin` и :func:`typing.get_args`.

source: The :mod:`unicodedata` module has been upgraded to use the `Unicode 12.1.0 <https://blog.unicode.org/2019/05/unicode-12-1-en.html>`_ release.
ru: Модуль :mod:`unicodedata` был обновлен для использования версии `Unicode 12.1.0 <https://blog.unicode.org/2019/05/unicode-12-1-en.html>`_.
