Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/whatsnew/3.8.po
Languages: ru

source: :mod:`ast` classes ``Num``, ``Str``, ``Bytes``, ``NameConstant`` and ``Ellipsis`` are considered deprecated and will be removed in future Python versions. :class:`~ast.Constant` should be used instead. (Contributed by Serhiy Storchaka in :issue:`32892`.)
ru: :mod:`ast` Классы ``Num``, ``Str``, ``Bytes``, ``NameConstant`` и ``Ellipsis`` считаются устаревшими и будут удалены в будущих версиях Python. Вместо этого следует использовать :class:`~ast.Constant`. (Предоставлено Сергеем Сторчакой в ​​:issue:`32892`.)

source: :class:`ast.NodeVisitor` methods ``visit_Num()``, ``visit_Str()``, ``visit_Bytes()``, ``visit_NameConstant()`` and ``visit_Ellipsis()`` are deprecated now and will not be called in future Python versions. Add the :meth:`~ast.NodeVisitor.visit_Constant` method to handle all constant nodes. (Contributed by Serhiy Storchaka in :issue:`36917`.)
ru: :class:`ast.NodeVisitor` Методы ``visit_Num()``, ``visit_Str()``, ``visit_Bytes()``, ``visit_NameConstant()`` и ``visit_Ellipsis()`` устарели. сейчас и не будет вызываться в будущих версиях Python. Добавьте метод :meth:`~ast.NodeVisitor.visit_Constant` для обработки всех постоянных узлов. (Предоставлено Сергеем Сторчакой в ​​:issue:`36917`.)

source: The :func:`asyncio.coroutine` :term:`decorator` is deprecated and will be removed in version 3.10. Instead of ``@asyncio.coroutine``, use :keyword:`async def` instead. (Contributed by Andrew Svetlov in :issue:`36921`.)
ru: :func:`asyncio.coroutine` :term:`decorator` устарел и будет удален в версии 3.10. Вместо ``@asyncio.coroutine`` используйте :keyword:`async def`. (Предоставлено Андреем Светловым в :issue:`36921`.)

source: In :mod:`asyncio`, the explicit passing of a *loop* argument has been deprecated and will be removed in version 3.10 for the following: :func:`asyncio.sleep`, :func:`asyncio.gather`, :func:`asyncio.shield`, :func:`asyncio.wait_for`, :func:`asyncio.wait`, :func:`asyncio.as_completed`, :class:`asyncio.Task`, :class:`asyncio.Lock`, :class:`asyncio.Event`, :class:`asyncio.Condition`, :class:`asyncio.Semaphore`, :class:`asyncio.BoundedSemaphore`, :class:`asyncio.Queue`, :func:`asyncio.create_subprocess_exec`, and :func:`asyncio.create_subprocess_shell`.
ru: В :mod:`asyncio` явная передача аргумента *loop* устарела и будет удалена в версии 3.10 для следующих объектов: :func:`asyncio.sleep`, :func:`asyncio.gather`, : func:`asyncio.shield`, :func:`asyncio.wait_for`, :func:`asyncio.wait`, :func:`asyncio.as_completed`, :class:`asyncio.Task`, :class:`asyncio. Lock`, :class:`asyncio.Event`, :class:`asyncio.Condition`, :class:`asyncio.Semaphore`, :class:`asyncio.BoundedSemaphore`, :class:`asyncio.Queue`, :func :`asyncio.create_subprocess_exec` и :func:`asyncio.create_subprocess_shell`.

source: The explicit passing of coroutine objects to :func:`asyncio.wait` has been deprecated and will be removed in version 3.11. (Contributed by Yury Selivanov in :issue:`34790`.)
ru: Явная передача объектов сопрограммы в :func:`asyncio.wait` устарела и будет удалена в версии 3.11. (Добавлен Юрием Селивановым в :issue:`34790`.)

source: The following functions and methods are deprecated in the :mod:`gettext` module: :func:`~gettext.lgettext`, :func:`~gettext.ldgettext`, :func:`~gettext.lngettext` and :func:`~gettext.ldngettext`. They return encoded bytes, and it's possible that you will get unexpected Unicode-related exceptions if there are encoding problems with the translated strings. It's much better to use alternatives which return Unicode strings in Python 3. These functions have been broken for a long time.
ru: Следующие функции и методы в модуле :mod:`gettext` признаны устаревшими: :func:`~gettext.lgettext`, :func:`~gettext.ldgettext`, :func:`~gettext.lngettext` и :func: `~gettext.ldngettext`. Они возвращают закодированные байты, и возможно, вы получите неожиданные исключения, связанные с Unicode, если возникнут проблемы с кодировкой переведенных строк. Гораздо лучше использовать альтернативы, которые возвращают строки Unicode в Python 3. Эти функции уже давно не работают.

source: Function :func:`~gettext.bind_textdomain_codeset`, methods :meth:`~gettext.NullTranslations.output_charset` and :meth:`~gettext.NullTranslations.set_output_charset`, and the *codeset* parameter of functions :func:`~gettext.translation` and :func:`~gettext.install` are also deprecated, since they are only used for the ``l*gettext()`` functions. (Contributed by Serhiy Storchaka in :issue:`33710`.)
ru: Функция :func:`~gettext.bind_textdomain_codeset`, методы :meth:`~gettext.NullTranslations.output_charset` и :meth:`~gettext.NullTranslations.set_output_charset`, а также параметр *codeset* функций :func:`~gettext .translation` и :func:`~gettext.install` также устарели, поскольку они используются только для функций ``l*gettext()``. (Предоставлено Сергеем Сторчакой в ​​:issue:`33710`.)

source: Many builtin and extension functions that take integer arguments will now emit a deprecation warning for :class:`~decimal.Decimal`\ s, :class:`~fractions.Fraction`\ s and any other objects that can be converted to integers only with a loss (e.g. that have the :meth:`~object.__int__` method but do not have the :meth:`~object.__index__` method). In future version they will be errors. (Contributed by Serhiy Storchaka in :issue:`36048`.)
ru: Многие встроенные функции и функции расширения, принимающие целочисленные аргументы, теперь будут выдавать предупреждение об устаревании для :class:`~decimal.Decimal`\ s, :class:`~fractions.Fraction`\ s и любых других объектов, которые можно преобразовать только в целые числа. с потерей (например, у которых есть метод :meth:`~object.__int__`, но нет метода :meth:`~object.__index__`). В будущей версии это будут ошибки. (Предоставлено Сергеем Сторчакой в ​​:issue:`36048`.)

source: Deprecated passing the following arguments as keyword arguments:
ru: Устарело передавать следующие аргументы в качестве аргументов ключевого слова:

source: *func* in :func:`functools.partialmethod`, :func:`weakref.finalize`, :meth:`profile.Profile.runcall`, :meth:`cProfile.Profile.runcall`, :meth:`bdb.Bdb.runcall`, :meth:`trace.Trace.runfunc` and :func:`curses.wrapper`.
ru: *func* в :func:`functools.partialmethod`, :func:`weakref.finalize`, :meth:`profile.Profile.runcall`, :meth:`cProfile.Profile.runcall`, :meth:`bdb. Bdb.runcall`, :meth:`trace.Trace.runfunc` и :func:`curses.wrapper`.

source: *function* in :meth:`unittest.TestCase.addCleanup`.
ru: *функция* в :meth:`unittest.TestCase.addCleanup`.

source: *fn* in the :meth:`~concurrent.futures.Executor.submit` method of :class:`concurrent.futures.ThreadPoolExecutor` and :class:`concurrent.futures.ProcessPoolExecutor`.
ru: *fn* в методе :meth:`~concurrent.futures.Executor.submit` :class:`concurrent.futures.ThreadPoolExecutor` и :class:`concurrent.futures.ProcessPoolExecutor`.

source: *c* and *typeid* in the :meth:`~multiprocessing.managers.Server.create` method of :class:`multiprocessing.managers.Server` and :class:`multiprocessing.managers.SharedMemoryServer`.
ru: *c* и *typeid* в методе :meth:`~multiprocessing.managers.Server.create` :class:`multiprocessing.managers.Server` и :class:`multiprocessing.managers.SharedMemoryServer`.

source: *obj* in :func:`weakref.finalize`.
ru: *obj* в :func:`weakref.finalize`.

source: In future releases of Python, they will be :ref:`positional-only <positional-only_parameter>`. (Contributed by Serhiy Storchaka in :issue:`36492`.)
ru: В будущих выпусках Python они будут иметь вид :ref:`positional-only <positional-only_parameter>`. (Предоставлено Сергеем Сторчакой в ​​:issue:`36492`.)

source: API and Feature Removals
ru: Удаление API и функций

source: The following features and APIs have been removed from Python 3.8:
ru: Следующие функции и API были удалены из Python 3.8:

source: The :mod:`macpath` module, deprecated in Python 3.7, has been removed. (Contributed by Victor Stinner in :issue:`35471`.)
ru: Модуль :mod:`macpath`, устаревший в Python 3.7, был удален. (Предоставлено Виктором Стиннером в :issue:`35471`.)

source: The function :func:`platform.popen` has been removed, after having been deprecated since Python 3.3: use :func:`os.popen` instead. (Contributed by Victor Stinner in :issue:`35345`.)
ru: Функция :func:`platform.popen` была удалена, поскольку она устарела начиная с Python 3.3: вместо нее используйте :func:`os.popen`. (Предоставлено Виктором Стиннером в :issue:`35345`.)

source: The function :func:`time.clock` has been removed, after having been deprecated since Python 3.3: use :func:`time.perf_counter` or :func:`time.process_time` instead, depending on your requirements, to have well-defined behavior. (Contributed by Matthias Bussonnier in :issue:`36895`.)
ru: Функция :func:`time.clock` была удалена после того, как она устарела начиная с Python 3.3: используйте вместо нее :func:`time.perf_counter` или :func:`time.process_time`, в зависимости от ваших требований, чтобы иметь -определенное поведение. (Предоставлено Матиасом Бюссонье в :issue:`36895`.)

source: The ``pyvenv`` script has been removed in favor of ``python3.8 -m venv`` to help eliminate confusion as to what Python interpreter the ``pyvenv`` script is tied to. (Contributed by Brett Cannon in :issue:`25427`.)
ru: Скрипт ``pyvenv`` был удален в пользу ``python3.8 -m venv``, чтобы избежать путаницы относительно того, к какому интерпретатору Python привязан скрипт ``pyvenv``. (Предоставлено Бреттом Кэнноном в :issue:`25427`.)

source: ``parse_qs``, ``parse_qsl``, and ``escape`` are removed from the :mod:`cgi` module. They are deprecated in Python 3.2 or older. They should be imported from the ``urllib.parse`` and ``html`` modules instead.
ru: ``parse_qs``, ``parse_qsl`` и ``escape`` удалены из модуля :mod:`cgi`. Они устарели в Python 3.2 и старше. Вместо этого их следует импортировать из модулей urllib.parse и html.

source: ``filemode`` function is removed from the :mod:`tarfile` module. It is not documented and deprecated since Python 3.3.
ru: Функция filemode удалена из модуля :mod:`tarfile`. Он не документирован и устарел начиная с Python 3.3.

source: The :class:`~xml.etree.ElementTree.XMLParser` constructor no longer accepts the *html* argument. It never had an effect and was deprecated in Python 3.4. All other parameters are now :ref:`keyword-only <keyword-only_parameter>`. (Contributed by Serhiy Storchaka in :issue:`29209`.)
ru: Конструктор :class:`~xml.etree.ElementTree.XMLParser` больше не принимает аргумент *html*. Это никогда не имело эффекта и было объявлено устаревшим в Python 3.4. Все остальные параметры теперь :ref:`keyword-only <keyword-only_parameter>`. (Предоставлено Сергеем Сторчакой в ​​:issue:`29209`.)

source: Removed the ``doctype()`` method of :class:`~xml.etree.ElementTree.XMLParser`. (Contributed by Serhiy Storchaka in :issue:`29209`.)
ru: Удален метод ``doctype()`` из :class:`~xml.etree.ElementTree.XMLParser`. (Предоставлено Сергеем Сторчакой в ​​:issue:`29209`.)

source: "unicode_internal" codec is removed. (Contributed by Inada Naoki in :issue:`36297`.)
ru: Кодек «unicode_internal» удален. (Предоставлено Инадой Наоки в :issue:`36297`.)

source: The ``Cache`` and ``Statement`` objects of the :mod:`sqlite3` module are not exposed to the user. (Contributed by Aviv Palivoda in :issue:`30262`.)
ru: Объекты ``Cache`` и ``Statement`` модуля :mod:`sqlite3` не доступны пользователю. (Предоставлено Авивом Паливодой в :issue:`30262`.)

source: The ``bufsize`` keyword argument of :func:`fileinput.input` and :func:`fileinput.FileInput` which was ignored and deprecated since Python 3.6 has been removed. :issue:`36952` (Contributed by Matthias Bussonnier.)
ru: Аргумент ключевого слова ``bufsize`` для :func:`fileinput.input` и :func:`fileinput.FileInput`, который игнорировался и устарел с момента удаления Python 3.6. :issue:`36952` (предоставлен Матиасом Бюссонье.)

source: The functions :func:`sys.set_coroutine_wrapper` and :func:`sys.get_coroutine_wrapper` deprecated in Python 3.7 have been removed; :issue:`36933` (Contributed by Matthias Bussonnier.)
ru: Функции :func:`sys.set_coroutine_wrapper` и :func:`sys.get_coroutine_wrapper`, устаревшие в Python 3.7, были удалены; :issue:`36933` (предоставлен Матиасом Бюссонье.)

source: Porting to Python 3.8
ru: Портирование на Python 3.8

source: This section lists previously described changes and other bugfixes that may require changes to your code.
ru: В этом разделе перечислены ранее описанные изменения и другие исправления ошибок, которые могут потребовать внесения изменений в ваш код.

source: Changes in Python behavior
ru: Изменения в поведении Python

source: Yield expressions (both ``yield`` and ``yield from`` clauses) are now disallowed in comprehensions and generator expressions (aside from the iterable expression in the leftmost :keyword:`!for` clause). (Contributed by Serhiy Storchaka in :issue:`10544`.)
ru: Выражения доходности (как предложения ``yield``, так и ``yield from``) теперь запрещены в генераторных выражениях и генераторах (за исключением итерируемого выражения в крайнем левом предложении :keyword:`!for`). (Предоставлено Сергеем Сторчакой в ​​:issue:`10544`.)

source: The compiler now produces a :exc:`SyntaxWarning` when identity checks (``is`` and ``is not``) are used with certain types of literals (e.g. strings, numbers). These can often work by accident in CPython, but are not guaranteed by the language spec. The warning advises users to use equality tests (``==`` and ``!=``) instead. (Contributed by Serhiy Storchaka in :issue:`34850`.)
ru: Компилятор теперь выдает :exc:`SyntaxWarning`, когда проверки подлинности («is» и «is not») используются с определенными типами литералов (например, строк, чисел). Они часто могут случайно сработать в CPython, но это не гарантируется спецификацией языка. Предупреждение советует пользователям вместо этого использовать тесты на равенство (``==`` и ``!=``. (Предоставлено Сергеем Сторчакой в ​​:issue:`34850`.)

source: The CPython interpreter can swallow exceptions in some circumstances. In Python 3.8 this happens in fewer cases. In particular, exceptions raised when getting the attribute from the type dictionary are no longer ignored. (Contributed by Serhiy Storchaka in :issue:`35459`.)
ru: Интерпретатор CPython в некоторых случаях может проглатывать исключения. В Python 3.8 это происходит в меньшем количестве случаев. В частности, больше не игнорируются исключения, возникающие при получении атрибута из словаря типов. (Предоставлено Сергеем Сторчакой в ​​:issue:`35459`.)

source: Removed ``__str__`` implementations from builtin types :class:`bool`, :class:`int`, :class:`float`, :class:`complex` and few classes from the standard library. They now inherit ``__str__()`` from :class:`object`. As result, defining the ``__repr__()`` method in the subclass of these classes will affect their string representation. (Contributed by Serhiy Storchaka in :issue:`36793`.)
ru: Удалены реализации ``__str__`` из встроенных типов :class:`bool`, :class:`int`, :class:`float`, :class:`complex` и нескольких классов из стандартной библиотеки. Теперь они наследуют ``__str__()`` от :class:`object`. В результате определение метода __repr__() в подклассе этих классов повлияет на их строковое представление. (Предоставлено Сергеем Сторчакой в ​​:issue:`36793`.)

source: Changes in the Python API
ru: Изменения в API Python

source: The :func:`os.getcwdb` function now uses the UTF-8 encoding on Windows, rather than the ANSI code page: see :pep:`529` for the rationale. The function is no longer deprecated on Windows. (Contributed by Victor Stinner in :issue:`37412`.)
ru: Функция :func:`os.getcwdb` теперь использует в Windows кодировку UTF-8, а не кодовую страницу ANSI: обоснование см. в :pep:`529`. Эта функция больше не является устаревшей в Windows. (Предоставлено Виктором Стиннером в :issue:`37412`.)

source: :class:`subprocess.Popen` can now use :func:`os.posix_spawn` in some cases for better performance. On Windows Subsystem for Linux and QEMU User Emulation, the :class:`Popen` constructor using :func:`os.posix_spawn` no longer raises an exception on errors like "missing program". Instead the child process fails with a non-zero :attr:`~Popen.returncode`. (Contributed by Joannah Nanjekye and Victor Stinner in :issue:`35537`.)
ru: :class:`subprocess.Popen` теперь может использовать :func:`os.posix_spawn` в некоторых случаях для повышения производительности. В подсистеме Windows для Linux и эмуляции пользователя QEMU конструктор :class:`Popen`, использующий :func:`os.posix_spawn`, больше не вызывает исключение при таких ошибках, как «отсутствует программа». Вместо этого дочерний процесс завершается с ненулевым :attr:`~Popen.returncode`. (Предоставлено Джоанной Нанжекье и Виктором Стиннером в :issue:`35537`.)

source: The *preexec_fn* argument of * :class:`subprocess.Popen` is no longer compatible with subinterpreters. The use of the parameter in a subinterpreter now raises :exc:`RuntimeError`. (Contributed by Eric Snow in :issue:`34651`, modified by Christian Heimes in :issue:`37951`.)
ru: Аргумент *preexec_fn* * :class:`subprocess.Popen` больше не совместим с субинтерпретаторами. Использование параметра в субинтерпретаторе теперь вызывает :exc:`RuntimeError`. (Внесено Эриком Сноу в :issue:`34651`, изменено Кристианом Хеймсом в :issue:`37951`.)

source: The :meth:`imap.IMAP4.logout` method no longer silently ignores arbitrary exceptions. (Contributed by Victor Stinner in :issue:`36348`.)
ru: Метод :meth:`imap.IMAP4.logout` больше не игнорирует произвольные исключения. (Предоставлено Виктором Стиннером в :issue:`36348`.)

source: The :func:`statistics.mode` function no longer raises an exception when given multimodal data. Instead, it returns the first mode encountered in the input data. (Contributed by Raymond Hettinger in :issue:`35892`.)
ru: Функция :func:`statistics.mode` больше не вызывает исключение при получении мультимодальных данных. Вместо этого он возвращает первый режим, обнаруженный во входных данных. (Предоставлено Рэймондом Хеттингером в :issue:`35892`.)

source: The :meth:`~tkinter.ttk.Treeview.selection` method of the :class:`tkinter.ttk.Treeview` class no longer takes arguments. Using it with arguments for changing the selection was deprecated in Python 3.6. Use specialized methods like :meth:`~tkinter.ttk.Treeview.selection_set` for changing the selection. (Contributed by Serhiy Storchaka in :issue:`31508`.)
ru: Метод :meth:`~tkinter.ttk.Treeview.selection` класса :class:`tkinter.ttk.Treeview` больше не принимает аргументы. Использование его с аргументами для изменения выбора устарело в Python 3.6. Используйте специализированные методы, такие как :meth:`~tkinter.ttk.Treeview.selection_set`, для изменения выделения. (Предоставлено Сергеем Сторчакой в ​​:issue:`31508`.)

source: The :meth:`writexml`, :meth:`toxml` and :meth:`toprettyxml` methods of :mod:`xml.dom.minidom`, and the :meth:`write` method of :mod:`xml.etree`, now preserve the attribute order specified by the user. (Contributed by Diego Rojas and Raymond Hettinger in :issue:`34160`.)
ru: Методы :meth:`writexml`, :meth:`toxml` и :meth:`toprettyxml` для :mod:`xml.dom.minidom`, а также метод :meth:`write` для :mod:`xml. etree` теперь сохраняет порядок атрибутов, указанный пользователем. (Предоставлено Диего Рохасом и Раймондом Хеттингером в :issue:`34160`.)

source: A :mod:`dbm.dumb` database opened with flags ``'r'`` is now read-only. :func:`dbm.dumb.open` with flags ``'r'`` and ``'w'`` no longer creates a database if it does not exist. (Contributed by Serhiy Storchaka in :issue:`32749`.)
ru: База данных :mod:`dbm.dumb`, открытая с флагами ``'r'``, теперь доступна только для чтения. :func:`dbm.dumb.open` с флагами ``'r'`` и ``'w'`` больше не создает базу данных, если она не существует. (Размещено Сергеем Сторчакой в ​​:issue:`32749`.)

source: The ``doctype()`` method defined in a subclass of :class:`~xml.etree.ElementTree.XMLParser` will no longer be called and will emit a :exc:`RuntimeWarning` instead of a :exc:`DeprecationWarning`. Define the :meth:`doctype() <xml.etree.ElementTree.TreeBuilder.doctype>` method on a target for handling an XML doctype declaration. (Contributed by Serhiy Storchaka in :issue:`29209`.)
ru: Метод ``doctype()``, определенный в подклассе :class:`~xml.etree.ElementTree.XMLParser`, больше не будет вызываться и будет выдавать :exc:`RuntimeWarning` вместо :exc:`DeprecationWarning `. Определите метод :meth:`doctype() <xml.etree.ElementTree.TreeBuilder.doctype>` в целевом объекте для обработки объявления типа документа XML. (Предоставлено Сергеем Сторчакой в ​​:issue:`29209`.)

source: A :exc:`RuntimeError` is now raised when the custom metaclass doesn't provide the ``__classcell__`` entry in the namespace passed to ``type.__new__``. A :exc:`DeprecationWarning` was emitted in Python 3.6--3.7. (Contributed by Serhiy Storchaka in :issue:`23722`.)
ru: Ошибка :exc:`RuntimeError` теперь возникает, когда пользовательский метакласс не предоставляет запись ``__classcell__`` в пространстве имен, переданном в ``type.__new__``. В Python 3.6–3.7 возникло сообщение :exc:`DeprecationWarning`. (Предоставлено Сергеем Сторчакой в ​​:issue:`23722`.)

source: The :class:`cProfile.Profile` class can now be used as a context manager. (Contributed by Scott Sanderson in :issue:`29235`.)
ru: Класс :class:`cProfile.Profile` теперь можно использовать в качестве менеджера контекста. (Предоставлено Скоттом Сандерсоном в :issue:`29235`.)

source: :func:`shutil.copyfile`, :func:`shutil.copy`, :func:`shutil.copy2`, :func:`shutil.copytree` and :func:`shutil.move` use platform-specific "fast-copy" syscalls (see :ref:`shutil-platform-dependent-efficient-copy-operations` section).
ru: :func:`shutil.copyfile`, :func:`shutil.copy`, :func:`shutil.copy2`, :func:`shutil.copytree` и :func:`shutil.move` используют "быстрый" для конкретной платформы -copy» (см. раздел «shutil-платформо-зависимые-эффективные-операции копирования»).

source: :func:`shutil.copyfile` default buffer size on Windows was changed from 16 KiB to 1 MiB.
ru: :func:`shutil.copyfile` Размер буфера по умолчанию в Windows был изменен с 16 КиБ на 1 МиБ.

source: The ``PyGC_Head`` struct has changed completely. All code that touched the struct member should be rewritten. (See :issue:`33597`.)
ru: Структура PyGC_Head полностью изменилась. Весь код, затрагивающий член структуры, следует переписать. (См. :issue:`33597`.)

source: The :c:type:`PyInterpreterState` struct has been moved into the "internal" header files (specifically Include/internal/pycore_pystate.h). An opaque ``PyInterpreterState`` is still available as part of the public API (and stable ABI). The docs indicate that none of the struct's fields are public, so we hope no one has been using them. However, if you do rely on one or more of those private fields and have no alternative then please open a BPO issue. We'll work on helping you adjust (possibly including adding accessor functions to the public API). (See :issue:`35886`.)
ru: Структура :c:type:`PyInterpreterState` была перемещена во «внутренние» заголовочные файлы (в частности, Include/internal/pycore_pystate.h). Непрозрачный PyInterpreterState по-прежнему доступен как часть общедоступного API (и стабильного ABI). В документации указано, что ни одно из полей структуры не является общедоступным, поэтому мы надеемся, что никто их не использовал. Однако, если вы полагаетесь на одно или несколько из этих частных полей и у вас нет альтернативы, откройте проблему BPO. Мы будем работать над тем, чтобы помочь вам адаптироваться (возможно, включая добавление функций доступа к общедоступному API). (См. :issue:`35886`.)
