Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/whatsnew/3.9.po
Languages: ru

source: What's New In Python 3.9
ru: Что нового в Python 3.9

source: Editor
ru: Редактор

source: This article explains the new features in Python 3.9, compared to 3.8. Python 3.9 was released on October 5, 2020. For full details, see the :ref:`changelog <changelog>`.
ru: В этой статье объясняются новые возможности Python 3.9 по сравнению с версией 3.8. Python 3.9 был выпущен 5 октября 2020 г. Подробную информацию см. в журнале изменений <changelog>`.

source: :pep:`596` - Python 3.9 Release Schedule
ru: :pep:`596` - График выпуска Python 3.9

source: Summary -- Release highlights
ru: Краткое описание - Основные моменты релиза

source: New syntax features:
ru: Новые возможности синтаксиса:

source: :pep:`584`, union operators added to ``dict``;
ru: :pep:`584`, в ``dict`` добавлены операторы объединения;

source: :pep:`585`, type hinting generics in standard collections;
ru: :pep:`585`, генерики хинтинга типов в стандартных коллекциях;

source: :pep:`614`, relaxed grammar restrictions on decorators.
ru: :pep:`614`, смягчены грамматические ограничения для декораторов.

source: New built-in features:
ru: Новые встроенные функции:

source: :pep:`616`, string methods to remove prefixes and suffixes.
ru: :pep:`616`, строковые методы для удаления префиксов и суффиксов.

source: New features in the standard library:
ru: Новые возможности стандартной библиотеки:

source: :pep:`593`, flexible function and variable annotations;
ru: :pep:`593`, гибкие функции и аннотации переменных;

source: :func:`os.pidfd_open` added that allows process management without races and signals.
ru: Добавлен :func:`os.pidfd_open`, позволяющий управлять процессами без гонок и сигналов.

source: Interpreter improvements:
ru: Улучшения интерпретатора:

source: :pep:`573`, fast access to module state from methods of C extension types;
ru: :pep:`573`, быстрый доступ к состоянию модуля из методов типов расширения C;

source: :pep:`617`, CPython now uses a new parser based on PEG;
ru: :pep:`617`, CPython теперь использует новый парсер, основанный на PEG;

source: a number of Python builtins (range, tuple, set, frozenset, list, dict) are now sped up using :pep:`590` vectorcall;
ru: ряд встроенных функций Python (range, Tuple, Set, Frozeset, List, dict) теперь ускоряются с помощью :pep:`590` Vectorcall;

source: garbage collection does not block on resurrected objects;
ru: сборка мусора не блокируется на воскрешенных объектах;

source: a number of Python modules (:mod:`!_abc`, :mod:`!audioop`, :mod:`!_bz2`, :mod:`!_codecs`, :mod:`!_contextvars`, :mod:`!_crypt`, :mod:`!_functools`, :mod:`!_json`, :mod:`!_locale`, :mod:`math`, :mod:`operator`, :mod:`resource`, :mod:`time`, :mod:`!_weakref`) now use multiphase initialization as defined by PEP 489;
ru: ряд модулей Python (:mod:`!_abc`, :mod:`!audioop`, :mod:`!_bz2`, :mod:`!_codecs`, :mod:`!_contextvars`, :mod:` !_crypt`, :mod:`!_functools`, :mod:`!_json`, :mod:`!_locale`, :mod:`math`, :mod:`operator`, :mod:`resource`, : mod:`time`, :mod:`!_weakref`) теперь использует многофазную инициализацию, как определено PEP 489;

source: a number of standard library modules (:mod:`!audioop`, :mod:`ast`, :mod:`grp`, :mod:`!_hashlib`, :mod:`pwd`, :mod:`!_posixsubprocess`, :mod:`random`, :mod:`select`, :mod:`struct`, :mod:`termios`, :mod:`zlib`) are now using the stable ABI defined by PEP 384.
ru: ряд стандартных библиотечных модулей (:mod:`!audioop`, :mod:`ast`, :mod:`grp`, :mod:`!_hashlib`, :mod:`pwd`, :mod:`!_posixsubprocess `, :mod:`random`, :mod:`select`, :mod:`struct`, :mod:`termios`, :mod:`zlib`) теперь используют стабильный ABI, определенный PEP 384.

source: New library modules:
ru: Новые библиотечные модули:

source: :pep:`615`, the IANA Time Zone Database is now present in the standard library in the :mod:`zoneinfo` module;
ru: :pep:`615`, база данных часовых поясов IANA теперь присутствует в стандартной библиотеке в модуле :mod:`zoneinfo`;

source: an implementation of a topological sort of a graph is now provided in the new :mod:`graphlib` module.
ru: реализация топологической разновидности графа теперь представлена ​​в новом модуле :mod:`graphlib`.

source: Release process changes:
ru: Изменения в процессе выпуска:

source: :pep:`602`, CPython adopts an annual release cycle.
ru: :pep:`602`, CPython использует годовой цикл выпуска.

source: You should check for DeprecationWarning in your code
ru: Вам следует проверить наличие DeprecationWarning в своем коде.

source: When Python 2.7 was still supported, a lot of functionality in Python 3 was kept for backward compatibility with Python 2.7. With the end of Python 2 support, these backward compatibility layers have been removed, or will be removed soon. Most of them emitted a :exc:`DeprecationWarning` warning for several years. For example, using ``collections.Mapping`` instead of ``collections.abc.Mapping`` emits a :exc:`DeprecationWarning` since Python 3.3, released in 2012.
ru: Когда Python 2.7 еще поддерживался, многие функции Python 3 были сохранены для обратной совместимости с Python 2.7. С прекращением поддержки Python 2 эти уровни обратной совместимости были удалены или будут удалены в ближайшее время. Большинство из них в течение нескольких лет выдавали предупреждение :exc:`DeprecationWarning`. Например, использование Collections.Mapping вместо Collections.abc.Mapping выдает :exc:DeprecationWarning, начиная с версии Python 3.3, выпущенной в 2012 году.

source: Test your application with the :option:`-W` ``default`` command-line option to see :exc:`DeprecationWarning` and :exc:`PendingDeprecationWarning`, or even with :option:`-W` ``error`` to treat them as errors. :ref:`Warnings Filter <warning-filter>` can be used to ignore warnings from third-party code.
ru: Протестируйте свое приложение с помощью параметра командной строки :option:`-W` ``default``, чтобы увидеть :exc:`DeprecationWarning` и :exc:`PendingDeprecationWarning`, или даже с помощью :option:`-W` ``ошибки. `` рассматривать их как ошибки. :ref:`Фильтр предупреждений <warning-filter>` можно использовать для игнорирования предупреждений от стороннего кода.

source: Python 3.9 is the last version providing those Python 2 backward compatibility layers, to give more time to Python projects maintainers to organize the removal of the Python 2 support and add support for Python 3.9.
ru: Python 3.9 — последняя версия, обеспечивающая уровни обратной совместимости Python 2, чтобы дать разработчикам проектов Python больше времени для организации удаления поддержки Python 2 и добавления поддержки Python 3.9.

source: Aliases to :ref:`Abstract Base Classes <collections-abstract-base-classes>` in the :mod:`collections` module, like ``collections.Mapping`` alias to :class:`collections.abc.Mapping`, are kept for one last release for backward compatibility. They will be removed from Python 3.10.
ru: Псевдонимы :ref:`Абстрактных базовых классов <collections-abstract-base-classes>` в модуле :mod:`collections`, например псевдоним ``collections.Mapping`` для :class:`collections.abc.Mapping`, сохраняются для последнего выпуска для обеспечения обратной совместимости. Они будут удалены из Python 3.10.

source: More generally, try to run your tests in the :ref:`Python Development Mode <devmode>` which helps to prepare your code to make it compatible with the next Python version.
ru: В более общем плане попробуйте запускать тесты в :ref:`Режиме разработки Python <devmode>`, который помогает подготовить ваш код к совместимости со следующей версией Python.

source: Note: a number of pre-existing deprecations were removed in this version of Python as well. Consult the :ref:`removed-in-python-39` section.
ru: Примечание. В этой версии Python также был удален ряд ранее существовавших устаревших возможностей. Обратитесь к разделу :ref:`removed-in-python-39`.

source: New Features
ru: Новые особенности

source: Dictionary Merge & Update Operators
ru: Операторы слияния и обновления словаря

source: Merge (``|``) and update (``|=``) operators have been added to the built-in :class:`dict` class. Those complement the existing ``dict.update`` and ``{**d1, **d2}`` methods of merging dictionaries.
ru: Операторы слияния (``|``) и обновления (``|=``) были добавлены во встроенный класс :class:`dict`. Они дополняют существующие методы объединения словарей ``dict.update`` и ``{**d1, **d2}``.

source: Example::
ru: Пример::

source: See :pep:`584` for a full description. (Contributed by Brandt Bucher in :issue:`36144`.)
ru: См. полное описание в :pep:`584`. (Предоставлено Брандтом Бухером в :issue:`36144`.)

source: New String Methods to Remove Prefixes and Suffixes
ru: Новые строковые методы для удаления префиксов и суффиксов

source: :meth:`str.removeprefix(prefix)<str.removeprefix>` and :meth:`str.removesuffix(suffix)<str.removesuffix>` have been added to easily remove an unneeded prefix or a suffix from a string. Corresponding ``bytes``, ``bytearray``, and ``collections.UserString`` methods have also been added. See :pep:`616` for a full description. (Contributed by Dennis Sweeney in :issue:`39939`.)
ru: :meth:`str.removeprefix(prefix)<str.removeprefix>` и :meth:`str.removesuffix(suffix)<str.removesuffix>` были добавлены для легкого удаления ненужного префикса или суффикса из строки. Также были добавлены соответствующие методы «bytes», «bytearray» и «collections.UserString». См. полное описание в :pep:`616`. (Предоставлено Деннисом Суини в :issue:`39939`.)

source: Type Hinting Generics in Standard Collections
ru: Обобщенные типы хинтинга в стандартных коллекциях

source: In type annotations you can now use built-in collection types such as ``list`` and ``dict`` as generic types instead of importing the corresponding capitalized types (e.g. ``List`` or ``Dict``) from ``typing``. Some other types in the standard library are also now generic, for example ``queue.Queue``.
ru: В аннотациях типов теперь вы можете использовать встроенные типы коллекций, такие как list и dict, в качестве универсальных типов вместо импорта соответствующих типов с заглавной буквы (например, List или Dict) из ``печатать``. Некоторые другие типы стандартной библиотеки теперь также являются универсальными, например,queue.Queue.

source: Example:
ru: Пример:

source: See :pep:`585` for more details. (Contributed by Guido van Rossum, Ethan Smith, and Batuhan Taşkaya in :issue:`39481`.)
ru: См. :pep:`585` для более подробной информации. (Предоставлено Гвидо ван Россумом, Итаном Смитом и Батуханом Ташкайей в :issue:`39481`.)

source: New Parser
ru: Новый анализатор

source: Python 3.9 uses a new parser, based on `PEG <https://en.wikipedia.org/wiki/Parsing_expression_grammar>`_ instead of `LL(1) <https://en.wikipedia.org/wiki/LL_parser>`_. The new parser's performance is roughly comparable to that of the old parser, but the PEG formalism is more flexible than LL(1) when it comes to designing new language features. We'll start using this flexibility in Python 3.10 and later.
ru: Python 3.9 использует новый синтаксический анализатор, основанный на `PEG <https://en.wikipedia.org/wiki/Parsing_expression_grammar>`_ вместо `LL(1) <https://en.wikipedia.org/wiki/LL_parser> `_. Производительность нового парсера примерно сопоставима с производительностью старого парсера, но формализм PEG более гибок, чем LL(1), когда дело доходит до разработки новых возможностей языка. Мы начнем использовать эту гибкость в Python 3.10 и более поздних версиях.

source: The :mod:`ast` module uses the new parser and produces the same AST as the old parser.
ru: Модуль :mod:`ast` использует новый парсер и создает тот же AST, что и старый парсер.

source: In Python 3.10, the old parser will be deleted and so will all functionality that depends on it (primarily the :mod:`!parser` module, which has long been deprecated). In Python 3.9 *only*, you can switch back to the LL(1) parser using a command line switch (``-X oldparser``) or an environment variable (``PYTHONOLDPARSER=1``).
ru: В Python 3.10 старый парсер будет удален, как и все зависящие от него функции (в первую очередь модуль :mod:`!parser`, который уже давно устарел). *Только* в Python 3.9 вы можете переключиться обратно на анализатор LL(1) с помощью переключателя командной строки (``-X oldparser``) или переменной среды (``PYTHONOLDPARSER=1``).

source: See :pep:`617` for more details. (Contributed by Guido van Rossum, Pablo Galindo and Lysandros Nikolaou in :issue:`40334`.)
ru: См. :pep:`617` для более подробной информации. (Предоставлено Гвидо ван Россумом, Пабло Галиндо и Лисандросом Николау в :issue:`40334`.)

source: Other Language Changes
ru: Другие языковые изменения

source: :func:`__import__` now raises :exc:`ImportError` instead of :exc:`ValueError`, which used to occur when a relative import went past its top-level package. (Contributed by Ngalim Siregar in :issue:`37444`.)
ru: :func:`__import__` теперь вызывает :exc:`ImportError` вместо :exc:`ValueError`, который раньше возникал, когда относительный импорт выходил за пределы пакета верхнего уровня. (Предоставлено Нгалимом Сирегаром в :issue:`37444`.)

source: Python now gets the absolute path of the script filename specified on the command line (ex: ``python3 script.py``): the ``__file__`` attribute of the :mod:`__main__` module became an absolute path, rather than a relative path. These paths now remain valid after the current directory is changed by :func:`os.chdir`. As a side effect, the traceback also displays the absolute path for :mod:`__main__` module frames in this case. (Contributed by Victor Stinner in :issue:`20443`.)
ru: Python теперь получает абсолютный путь к имени файла сценария, указанному в командной строке (например: ``python3 script.py``): атрибут ``__file__`` модуля :mod:`__main__` стал абсолютным путем, а не чем относительный путь. Эти пути теперь остаются действительными после изменения текущего каталога с помощью :func:`os.chdir`. В качестве побочного эффекта в этом случае обратная трассировка также отображает абсолютный путь к кадрам модуля :mod:`__main__`. (Предоставлено Виктором Стиннером в :issue:`20443`.)

source: In the :ref:`Python Development Mode <devmode>` and in :ref:`debug build <debug-build>`, the *encoding* and *errors* arguments are now checked for string encoding and decoding operations. Examples: :func:`open`, :meth:`str.encode` and :meth:`bytes.decode`.
ru: В :ref:`Python Development Mode <devmode>` и в :ref:`debug build <debug-build>` аргументы *encoding* и *errors* теперь проверяются на операции кодирования и декодирования строк. Примеры: :func:`open`, :meth:`str.encode` и :meth:`bytes.decode`.

source: By default, for best performance, the *errors* argument is only checked at the first encoding/decoding error and the *encoding* argument is sometimes ignored for empty strings. (Contributed by Victor Stinner in :issue:`37388`.)
ru: По умолчанию для лучшей производительности аргумент *errors* проверяется только при первой ошибке кодирования/декодирования, а аргумент *encoding* иногда игнорируется для пустых строк. (Предоставлено Виктором Стиннером в :issue:`37388`.)

source: ``"".replace("", s, n)`` now returns ``s`` instead of an empty string for all non-zero ``n``. It is now consistent with ``"".replace("", s)``. There are similar changes for :class:`bytes` and :class:`bytearray` objects. (Contributed by Serhiy Storchaka in :issue:`28029`.)
ru: ``"".replace("", s, n)`` теперь возвращает ``s`` вместо пустой строки для всех ненулевых ``n``. Теперь оно соответствует ``"".replace("", s)``. Аналогичные изменения есть и для объектов :class:`bytes` и :class:`bytearray`. (Предоставлено Сергеем Сторчакой в ​​:issue:`28029`.)

source: Any valid expression can now be used as a :term:`decorator`. Previously, the grammar was much more restrictive. See :pep:`614` for details. (Contributed by Brandt Bucher in :issue:`39702`.)
ru: Любое допустимое выражение теперь можно использовать в качестве декоратора. Раньше грамматика была гораздо более строгой. Подробности смотрите в :pep:`614`. (Предоставлено Брандтом Бухером в :issue:`39702`.)

source: Improved help for the :mod:`typing` module. Docstrings are now shown for all special forms and special generic aliases (like ``Union`` and ``List``). Using :func:`help` with generic alias like ``List[int]`` will show the help for the correspondent concrete type (``list`` in this case). (Contributed by Serhiy Storchaka in :issue:`40257`.)
ru: Улучшена справка по модулю :mod:`typing`. Строки документации теперь отображаются для всех специальных форм и специальных общих псевдонимов (например, Union и List). Использование :func:`help` с общим псевдонимом, например ``List[int]``, покажет справку для соответствующего конкретного типа (в данном случае ``list``). (Предоставлено Сергеем Сторчакой в ​​:issue:`40257`.)

source: Parallel running of :meth:`~agen.aclose` / :meth:`~agen.asend` / :meth:`~agen.athrow` is now prohibited, and ``ag_running`` now reflects the actual running status of the async generator. (Contributed by Yury Selivanov in :issue:`30773`.)
ru: Параллельный запуск :meth:`~agen.aclose` / :meth:`~agen.asend` / :meth:`~agen.athrow` теперь запрещен, а ``ag_running`` теперь отражает фактический статус выполнения асинхронный генератор. (Добавлен Юрием Селивановым в :issue:`30773`.)

source: Unexpected errors in calling the ``__iter__`` method are no longer masked by ``TypeError`` in the :keyword:`in` operator and functions :func:`~operator.contains`, :func:`~operator.indexOf` and :func:`~operator.countOf` of the :mod:`operator` module. (Contributed by Serhiy Storchaka in :issue:`40824`.)
ru: Неожиданные ошибки при вызове метода ``__iter__`` больше не маскируются ``TypeError`` в операторе :keyword:`in` и функциях :func:`~operator.contains`, :func:`~operator.indexOf ` и :func:`~operator.countOf` модуля :mod:`operator`. (Предоставлено Сергеем Сторчакой в ​​:issue:`40824`.)

source: Unparenthesized lambda expressions can no longer be the expression part in an ``if`` clause in comprehensions and generator expressions. See :issue:`41848` and :issue:`43755` for details.
ru: Лямбда-выражения без скобок больше не могут быть частью выражения в предложении if в выражениях-генераторах и генераторах. Подробности смотрите в :issue:`41848` и :issue:`43755`.

source: New Modules
ru: Новые модули

source: The :mod:`zoneinfo` module brings support for the IANA time zone database to the standard library. It adds :class:`zoneinfo.ZoneInfo`, a concrete :class:`datetime.tzinfo` implementation backed by the system's time zone data.
ru: Модуль :mod:`zoneinfo` обеспечивает поддержку базы данных часовых поясов IANA в стандартной библиотеке. Он добавляет :class:`zoneinfo.ZoneInfo`, конкретную реализацию :class:`datetime.tzinfo`, поддерживаемую данными о часовом поясе системы.

source: As a fall-back source of data for platforms that don't ship the IANA database, the :pypi:`tzdata` module was released as a first-party package -- distributed via PyPI and maintained by the CPython core team.
ru: В качестве резервного источника данных для платформ, которые не поставляют базу данных IANA, модуль :pypi:`tzdata` был выпущен как собственный пакет, распространяемый через PyPI и поддерживаемый основной командой CPython.

source: :pep:`615` -- Support for the IANA Time Zone Database in the Standard Library
ru: :pep:`615` -- Поддержка базы данных часовых поясов IANA в стандартной библиотеке.

source: PEP written and implemented by Paul Ganssle
ru: PEP написан и реализован Полом Гансслом

source: A new module, :mod:`graphlib`, was added that contains the :class:`graphlib.TopologicalSorter` class to offer functionality to perform topological sorting of graphs. (Contributed by Pablo Galindo, Tim Peters and Larry Hastings in :issue:`17005`.)
ru: Был добавлен новый модуль :mod:`graphlib`, который содержит класс :class:`graphlib.TopologicalSorter`, предлагающий функциональные возможности для выполнения топологической сортировки графов. (Предоставлено Пабло Галиндо, Тимом Питерсом и Ларри Гастингсом в :issue:`17005`.)

source: Improved Modules
ru: Улучшенные модули

source: Added the *indent* option to :func:`~ast.dump` which allows it to produce a multiline indented output. (Contributed by Serhiy Storchaka in :issue:`37995`.)
ru: В :func:`~ast.dump` добавлен параметр *indent*, который позволяет создавать многострочный вывод с отступом. (Предоставлено Сергеем Сторчакой в ​​:issue:`37995`.)

source: Added :func:`ast.unparse` as a function in the :mod:`ast` module that can be used to unparse an :class:`ast.AST` object and produce a string with code that would produce an equivalent :class:`ast.AST` object when parsed. (Contributed by Pablo Galindo and Batuhan Taskaya in :issue:`38870`.)
ru: Добавлен :func:`ast.unparse` как функция в модуль :mod:`ast`, которую можно использовать для разбора объекта :class:`ast.AST` и создания строки с кодом, которая создаст эквивалент :class. :`ast.AST` при анализе. (Предоставлено Пабло Галиндо и Батуханом Таской в ​​:issue:`38870`.)

source: Added docstrings to AST nodes that contains the ASDL signature used to construct that node. (Contributed by Batuhan Taskaya in :issue:`39638`.)
ru: К узлам AST добавлены строки документации, содержащие подпись ASDL, использованную для создания этого узла. (Предоставлено Батуханом Таской в ​​:issue:`39638`.)

source: Due to significant security concerns, the *reuse_address* parameter of :meth:`asyncio.loop.create_datagram_endpoint` is no longer supported. This is because of the behavior of the socket option ``SO_REUSEADDR`` in UDP. For more details, see the documentation for ``loop.create_datagram_endpoint()``. (Contributed by Kyle Stanley, Antoine Pitrou, and Yury Selivanov in :issue:`37228`.)
ru: Из соображений безопасности параметр *reuse_address* :meth:`asyncio.loop.create_datagram_endpoint` больше не поддерживается. Это связано с поведением опции сокета SO_REUSEADDR в UDP. Более подробную информацию смотрите в документации по ``loop.create_datagram_endpoint()``. (Предоставлено Кайлом Стэнли, Антуаном Питру и Юрием Селивановым в :issue:`37228`.)

source: Added a new :term:`coroutine` :meth:`~asyncio.loop.shutdown_default_executor` that schedules a shutdown for the default executor that waits on the :class:`~concurrent.futures.ThreadPoolExecutor` to finish closing. Also, :func:`asyncio.run` has been updated to use the new :term:`coroutine`. (Contributed by Kyle Stanley in :issue:`34037`.)
ru: Добавлена ​​новая :term:`coroutine` :meth:`~asyncio.loop.shutdown_default_executor`, которая планирует завершение работы исполнителя по умолчанию, ожидающего завершения закрытия :class:`~concurrent.futures.ThreadPoolExecutor`. Кроме того, :func:`asyncio.run` был обновлен для использования новой :term:`coroutine`. (Предоставлено Кайлом Стэнли в :issue:`34037`.)

source: Added :class:`asyncio.PidfdChildWatcher`, a Linux-specific child watcher implementation that polls process file descriptors. (:issue:`38692`)
ru: Добавлен :class:`asyncio.PidfdChildWatcher`, реализация наблюдения за детьми, специфичная для Linux, которая опрашивает дескрипторы файлов процессов. (:issue:`38692`)

source: Added a new :term:`coroutine` :func:`asyncio.to_thread`. It is mainly used for running IO-bound functions in a separate thread to avoid blocking the event loop, and essentially works as a high-level version of :meth:`~asyncio.loop.run_in_executor` that can directly take keyword arguments. (Contributed by Kyle Stanley and Yury Selivanov in :issue:`32309`.)
ru: Добавлена ​​новая :term:`coroutine` :func:`asyncio.to_thread`. В основном он используется для запуска функций, связанных с вводом-выводом, в отдельном потоке, чтобы избежать блокировки цикла событий, и по существу работает как высокоуровневая версия :meth:`~asyncio.loop.run_in_executor`, которая может напрямую принимать аргументы ключевого слова. (Предоставлено Кайлом Стэнли и Юрием Селивановым в :issue:`32309`.)
