Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/whatsnew/3.9.po
Languages: ru

source: Added a new :data:`sys.platlibdir` attribute: name of the platform-specific library directory. It is used to build the path of standard library and the paths of installed extension modules. It is equal to ``"lib"`` on most platforms. On Fedora and SuSE, it is equal to ``"lib64"`` on 64-bit platforms. (Contributed by Jan Matějek, Matěj Cepl, Charalampos Stratakis and Victor Stinner in :issue:`1294959`.)
ru: Добавлен новый атрибут :data:`sys.platlibdir`: имя каталога библиотеки для конкретной платформы. Он используется для построения пути стандартной библиотеки и путей установленных модулей расширения. На большинстве платформ он равен ``"lib"``. В Fedora и SuSE он равен ``"lib64"`` на 64-битных платформах. (Предоставлено Яном Матеком, Матеем Чеплом, Харалампосом Стратакисом и Виктором Стиннером в :issue:`1294959`.)

source: Previously, :data:`sys.stderr` was block-buffered when non-interactive. Now ``stderr`` defaults to always being line-buffered. (Contributed by Jendrik Seipp in :issue:`13601`.)
ru: Раньше :data:`sys.stderr` в неинтерактивном режиме помещался в блочную буферизацию. Теперь ``stderr`` по умолчанию всегда находится в строковом буфере. (Предоставлено Джендриком Зейппом в :issue:`13601`.)

source: Added :func:`tracemalloc.reset_peak` to set the peak size of traced memory blocks to the current size, to measure the peak of specific pieces of code. (Contributed by Huon Wilson in :issue:`40630`.)
ru: Добавлен :func:`tracemalloc.reset_peak` для установки максимального размера отслеживаемых блоков памяти на текущий размер, чтобы измерить пиковый размер определенных фрагментов кода. (Предоставлено Хуоном Уилсоном в :issue:`40630`.)

source: typing
ru: печатание

source: :pep:`593` introduced an :data:`typing.Annotated` type to decorate existing types with context-specific metadata and new ``include_extras`` parameter to :func:`typing.get_type_hints` to access the metadata at runtime. (Contributed by Till Varoquaux and Konstantin Kashin.)
ru: :pep:`593` представил тип :data:`typing.Annotated` для украшения существующих типов контекстно-зависимыми метаданными и новый параметр ``include_extras`` для :func:`typing.get_type_hints` для доступа к метаданным во время выполнения. (Сообщили Тилль Варокво и Константин Кашин.)

source: The Unicode database has been updated to version 13.0.0. (:issue:`39926`).
ru: База данных Unicode обновлена ​​до версии 13.0.0. (:issue:`39926`).

source: The activation scripts provided by :mod:`venv` now all specify their prompt customization consistently by always using the value specified by ``__VENV_PROMPT__``. Previously some scripts unconditionally used ``__VENV_PROMPT__``, others only if it happened to be set (which was the default case), and one used ``__VENV_NAME__`` instead. (Contributed by Brett Cannon in :issue:`37663`.)
ru: Все сценарии активации, предоставляемые :mod:`venv`, теперь последовательно определяют настройку приглашений, всегда используя значение, указанное в ``__VENV_PROMPT__``. Раньше некоторые скрипты использовали ``__VENV_PROMPT__`` безоговорочно, другие - только в том случае, если он был установлен (что было по умолчанию), а один вместо этого использовал ``__VENV_NAME__``. (Предоставлено Бреттом Кэнноном в :issue:`37663`.)

source: White space characters within attributes are now preserved when serializing :mod:`xml.etree.ElementTree` to XML file. EOLNs are no longer normalized to "\n". This is the result of discussion about how to interpret section 2.11 of XML spec. (Contributed by Mefistotelis in :issue:`39011`.)
ru: Пробелы внутри атрибутов теперь сохраняются при сериализации :mod:`xml.etree.ElementTree`в XML-файл. EOLN больше не нормализуются до "\n". Это результат обсуждения того, как интерпретировать раздел 2.11 спецификации XML. (Предоставлено Mefistotelis в :issue:`39011`.)

source: Optimizations
ru: Оптимизации

source: Optimized the idiom for assignment a temporary variable in comprehensions. Now ``for y in [expr]`` in comprehensions is as fast as a simple assignment ``y = expr``. For example:
ru: Оптимизирована идиома назначения временной переменной в понимании. Теперь ``for y в [expr]`` в понимании выполняется так же быстро, как простое присваивание ``y = expr``. Например:

source: Unlike the ``:=`` operator this idiom does not leak a variable to the outer scope.
ru: В отличие от оператора ``:=`` эта идиома не пропускает переменную во внешнюю область видимости.

source: (Contributed by Serhiy Storchaka in :issue:`32856`.)
ru: (Предоставлено Сергеем Сторчакой в :issue:`32856`.)

source: Optimized signal handling in multithreaded applications. If a thread different than the main thread gets a signal, the bytecode evaluation loop is no longer interrupted at each bytecode instruction to check for pending signals which cannot be handled. Only the main thread of the main interpreter can handle signals.
ru: Оптимизированная обработка сигналов в многопоточных приложениях. Если поток, отличный от основного потока, получает сигнал, цикл оценки байт-кода больше не прерывается на каждой инструкции байт-кода для проверки ожидающих сигналов, которые не могут быть обработаны. Обрабатывать сигналы может только основной поток основного интерпретатора.

source: Previously, the bytecode evaluation loop was interrupted at each instruction until the main thread handles signals. (Contributed by Victor Stinner in :issue:`40010`.)
ru: Раньше цикл оценки байт-кода прерывался на каждой инструкции до тех пор, пока основной поток не обработает сигналы. (Предоставлено Виктором Стиннером в :issue:`40010`.)

source: Optimized the :mod:`subprocess` module on FreeBSD using ``closefrom()``. (Contributed by Ed Maste, Conrad Meyer, Kyle Evans, Kubilay Kocak and Victor Stinner in :issue:`38061`.)
ru: Оптимизирован модуль :mod:`subprocess` во FreeBSD с помощью ``closefrom()``. (Предоставлено Эдом Масте, Конрадом Мейером, Кайлом Эвансом, Кубилаем Кочаком и Виктором Стиннером в :issue:`38061`.)

source: :c:func:`PyLong_FromDouble` is now up to 1.87x faster for values that fit into :c:expr:`long`. (Contributed by Sergey Fedoseev in :issue:`37986`.)
ru: :c:func:`PyLong_FromDouble` теперь работает до 1,87 раз быстрее для значений, которые соответствуют :c:expr:`long`. (Внесено Сергеем Федосеевым в :issue:`37986`.)

source: A number of Python builtins (:class:`range`, :class:`tuple`, :class:`set`, :class:`frozenset`, :class:`list`, :class:`dict`) are now sped up by using :pep:`590` vectorcall protocol. (Contributed by Donghee Na, Mark Shannon, Jeroen Demeyer and Petr Viktorin in :issue:`37207`.)
ru: Ряд встроенных функций Python (:class:`range`, :class:`tuple`, :class:`set`, :class:`frozenset`, :class:`list`, :class:`dict`) теперь ускорен за счет использования протокола векторного вызова :pep:`590`. (Предоставлено Донхи На, Марком Шенноном, Джеруном Демейером и Петром Викторином в :issue:`37207`.)

source: Optimized :func:`~set.difference_update` for the case when the other set is much larger than the base set. (Suggested by Evgeny Kapun with code contributed by Michele Orrù in :issue:`8425`.)
ru: :func:`~set.difference_update` оптимизирован для случая, когда другой набор намного больше базового. (Предложено Евгением Капуном, код предоставлен Мишелем Орру в :issue:`8425`.)

source: Python's small object allocator (``obmalloc.c``) now allows (no more than) one empty arena to remain available for immediate reuse, without returning it to the OS. This prevents thrashing in simple loops where an arena could be created and destroyed anew on each iteration. (Contributed by Tim Peters in :issue:`37257`.)
ru: Распределитель небольших объектов Python (obmalloc.c) теперь позволяет (не более) одной пустой арене оставаться доступной для немедленного повторного использования без возврата ее в ОС. Это предотвращает возникновение простых циклов, в которых арена может создаваться и уничтожаться заново на каждой итерации. (Предоставлено Тимом Питерсом в :issue:`37257`.)

source: :term:`floor division` of float operation now has a better performance. Also the message of :exc:`ZeroDivisionError` for this operation is updated. (Contributed by Donghee Na in :issue:`39434`.)
ru: :term:`Поэтажное разделение` операции с плавающей запятой теперь имеет лучшую производительность. Также обновлено сообщение :exc:`ZeroDivisionError` для этой операции. (Предоставлено Донхи На в :issue:`39434`.)

source: Decoding short ASCII strings with UTF-8 and ascii codecs is now about 15% faster. (Contributed by Inada Naoki in :issue:`37348`.)
ru: Декодирование коротких строк ASCII с помощью кодеков UTF-8 и ascii теперь происходит примерно на 15 % быстрее. (Предоставлено Инадой Наоки в :issue:`37348`.)

source: Here's a summary of performance improvements from Python 3.4 through Python 3.9:
ru: Вот краткий обзор улучшений производительности с Python 3.4 по Python 3.9:

source: These results were generated from the variable access benchmark script at: ``Tools/scripts/var_access_benchmark.py``. The benchmark script displays timings in nanoseconds. The benchmarks were measured on an `Intel® Core™ i7-4960HQ processor <https://ark.intel.com/content/www/us/en/ark/products/76088/intel-core-i7-4960hq-processor-6m-cache-up-to-3-80-ghz.html>`_ running the macOS 64-bit builds found at `python.org <https://www.python.org/downloads/macos/>`_.
ru: Эти результаты были получены с помощью сценария тестирования доступа к переменным по адресу: ``Tools/scripts/var_access_benchmark.py``. Сценарий тестирования отображает тайминги в наносекундах. Тесты проводились на процессоре Intel® Core™ i7-4960HQ <https://ark.intel.com/content/www/us/en/ark/products/76088/intel-core-i7-4960hq-processor- 6m-cache-up-to-3-80-ghz.html>`_ запуск 64-битных сборок macOS, найденных на `python.org <https://www.python.org/downloads/macos/>`_.

source: Deprecated
ru: Устарел

source: The distutils ``bdist_msi`` command is now deprecated, use ``bdist_wheel`` (wheel packages) instead. (Contributed by Hugo van Kemenade in :issue:`39586`.)
ru: Команда distutils ``bdist_msi`` устарела, вместо нее используйте ``bdist_wheel`` (пакеты колес). (Предоставлено Хьюго ван Кеменаде в :issue:`39586`.)

source: Currently :func:`math.factorial` accepts :class:`float` instances with non-negative integer values (like ``5.0``). It raises a :exc:`ValueError` for non-integral and negative floats. It is now deprecated. In future Python versions it will raise a :exc:`TypeError` for all floats. (Contributed by Serhiy Storchaka in :issue:`37315`.)
ru: В настоящее время :func:`math.factorial` принимает экземпляры :class:`float` с неотрицательными целочисленными значениями (например, ``5.0``). Он вызывает :exc:`ValueError` для нецелых и отрицательных чисел с плавающей запятой. Сейчас оно устарело. В будущих версиях Python будет выдаваться ошибка :exc:`TypeError` для всех чисел с плавающей запятой. (Предоставлено Сергеем Сторчакой в ​​:issue:`37315`.)

source: The :mod:`!parser` and :mod:`!symbol` modules are deprecated and will be removed in future versions of Python. For the majority of use cases, users can leverage the Abstract Syntax Tree (AST) generation and compilation stage, using the :mod:`ast` module.
ru: Модули :mod:`!parser` и :mod:`!symbol` устарели и будут удалены в будущих версиях Python. В большинстве случаев пользователи могут использовать этап генерации и компиляции абстрактного синтаксического дерева (AST), используя модуль :mod:`ast`.

source: The Public C API functions :c:func:`!PyParser_SimpleParseStringFlags`, :c:func:`!PyParser_SimpleParseStringFlagsFilename`, :c:func:`!PyParser_SimpleParseFileFlags` and :c:func:`!PyNode_Compile` are deprecated and will be removed in Python 3.10 together with the old parser.
ru: Функции Public C API :c:func:`!PyParser_SimpleParseStringFlags`, :c:func:`!PyParser_SimpleParseStringFlagsFilename`, :c:func:`!PyParser_SimpleParseFileFlags` и :c:func:`!PyNode_Compile` устарели и будут удалены. в Python 3.10 вместе со старым парсером.

source: Using :data:`NotImplemented` in a boolean context has been deprecated, as it is almost exclusively the result of incorrect rich comparator implementations. It will be made a :exc:`TypeError` in a future version of Python. (Contributed by Josh Rosenberg in :issue:`35712`.)
ru: Использование :data:`NotImplemented` в логическом контексте устарело, поскольку оно почти всегда является результатом неправильной реализации расширенного компаратора. В будущей версии Python это будет преобразовано в :exc:`TypeError`. (Предоставлено Джошем Розенбергом в :issue:`35712`.)

source: The :mod:`random` module currently accepts any hashable type as a possible seed value. Unfortunately, some of those types are not guaranteed to have a deterministic hash value. After Python 3.9, the module will restrict its seeds to :const:`None`, :class:`int`, :class:`float`, :class:`str`, :class:`bytes`, and :class:`bytearray`.
ru: Модуль :mod:`random` в настоящее время принимает любой хэшируемый тип в качестве возможного начального значения. К сожалению, некоторые из этих типов не гарантированно имеют детерминированное значение хеш-функции. После Python 3.9 модуль будет ограничивать свои начальные значения :const:`None`, :class:`int`, :class:`float`, :class:`str`, :class:`bytes` и :class: `bytearray`.

source: Opening the :class:`~gzip.GzipFile` file for writing without specifying the *mode* argument is deprecated. In future Python versions it will always be opened for reading by default. Specify the *mode* argument for opening it for writing and silencing a warning. (Contributed by Serhiy Storchaka in :issue:`28286`.)
ru: Открытие файла :class:`~gzip.GzipFile` для записи без указания аргумента *mode* устарело. В будущих версиях Python он всегда будет открыт для чтения по умолчанию. Укажите аргумент *mode*, чтобы открыть его для записи и отключить предупреждение. (Предоставлено Сергеем Сторчакой в ​​:issue:`28286`.)

source: Deprecated the ``split()`` method of :class:`!_tkinter.TkappType` in favour of the ``splitlist()`` method which has more consistent and predictable behavior. (Contributed by Serhiy Storchaka in :issue:`38371`.)
ru: Устаревший метод ``split()`` :class:`!_tkinter.TkappType` в пользу метода ``splitlist()``, который имеет более последовательное и предсказуемое поведение. (Предоставлено Сергеем Сторчакой в ​​:issue:`38371`.)

source: The explicit passing of coroutine objects to :func:`asyncio.wait` has been deprecated and will be removed in version 3.11. (Contributed by Yury Selivanov and Kyle Stanley in :issue:`34790`.)
ru: Явная передача объектов сопрограммы в :func:`asyncio.wait` устарела и будет удалена в версии 3.11. (Предоставлено Юрием Селивановым и Кайлом Стэнли в :issue:`34790`.)

source: binhex4 and hexbin4 standards are now deprecated. The :mod:`!binhex` module and the following :mod:`binascii` functions are now deprecated:
ru: Стандарты binhex4 и hexbin4 устарели. Модуль :mod:`!binhex` и следующие функции :mod:`binascii` объявлены устаревшими:

source: (Contributed by Victor Stinner in :issue:`39353`.)
ru: (Предоставлено Виктором Стиннером в :issue:`39353`.)

source: :mod:`ast` classes ``slice``, ``Index`` and ``ExtSlice`` are considered deprecated and will be removed in future Python versions. ``value`` itself should be used instead of ``Index(value)``. ``Tuple(slices, Load())`` should be used instead of ``ExtSlice(slices)``. (Contributed by Serhiy Storchaka in :issue:`34822`.)
ru: :mod:`ast` Классы ``slice``, ``Index`` и ``ExtSlice`` считаются устаревшими и будут удалены в будущих версиях Python. Вместо ``Index(value)`` следует использовать ``value``. ``Tuple(slices, Load())`` следует использовать вместо ``ExtSlice(slices)``. (Предоставлено Сергеем Сторчакой в ​​:issue:`34822`.)

source: :mod:`ast` classes ``Suite``, ``Param``, ``AugLoad`` and ``AugStore`` are considered deprecated and will be removed in future Python versions. They were not generated by the parser and not accepted by the code generator in Python 3. (Contributed by Batuhan Taskaya in :issue:`39639` and :issue:`39969` and Serhiy Storchaka in :issue:`39988`.)
ru: :mod:`ast` Классы ``Suite``, ``Param``, ``AugLoad`` и ``AugStore`` считаются устаревшими и будут удалены в будущих версиях Python. Они не были сгенерированы парсером и не приняты генератором кода в Python 3.

source: The :c:func:`!PyEval_InitThreads` and :c:func:`!PyEval_ThreadsInitialized` functions are now deprecated and will be removed in Python 3.11. Calling :c:func:`!PyEval_InitThreads` now does nothing. The :term:`GIL` is initialized by :c:func:`Py_Initialize` since Python 3.7. (Contributed by Victor Stinner in :issue:`39877`.)
ru: Функции :c:func:`!PyEval_InitThreads` и :c:func:`!PyEval_ThreadsInitialized` объявлены устаревшими и будут удалены в Python 3.11. Вызов :c:func:`!PyEval_InitThreads` теперь ничего не делает. :term:`GIL` инициализируется :c:func:`Py_Initialize`, начиная с Python 3.7. (Предоставлено Виктором Стиннером в :issue:`39877`.)

source: Passing ``None`` as the first argument to the :func:`shlex.split` function has been deprecated. (Contributed by Zackery Spytz in :issue:`33262`.)
ru: Передача None в качестве первого аргумента функции :func:`shlex.split` устарела. (Предоставлено Закери Шпитцем в :issue:`33262`.)

source: :func:`!smtpd.MailmanProxy` is now deprecated as it is unusable without an external module, ``mailman``. (Contributed by Samuel Colvin in :issue:`35800`.)
ru: :func:`!smtpd.MailmanProxy` устарел, так как его невозможно использовать без внешнего модуля ``mailman``. (Предоставлено Сэмюэлем Колвином в :issue:`35800`.)

source: The :mod:`!lib2to3` module now emits a :exc:`PendingDeprecationWarning`. Python 3.9 switched to a PEG parser (see :pep:`617`), and Python 3.10 may include new language syntax that is not parsable by lib2to3's LL(1) parser. The :mod:`!lib2to3` module may be removed from the standard library in a future Python version. Consider third-party alternatives such as `LibCST`_ or `parso`_. (Contributed by Carl Meyer in :issue:`40360`.)
ru: Модуль :mod:`!lib2to3` теперь выдает :exc:`PendingDeprecationWarning`. Python 3.9 переключился на парсер PEG (см. :pep:`617`), а Python 3.10 может включать новый синтаксис языка, который не анализируется парсером LL(1) из lib2to3. Модуль :mod:`!lib2to3` может быть удален из стандартной библиотеки в будущей версии Python. Рассмотрите сторонние альтернативы, такие как `LibCST`_ или `parso`_. (Предоставлено Карлом Мейером в :issue:`40360`.)

source: The *random* parameter of :func:`random.shuffle` has been deprecated. (Contributed by Raymond Hettinger in :issue:`40465`)
ru: Параметр *random* в :func:`random.shuffle` устарел. (Предоставлено Рэймондом Хеттингером в :issue:`40465`)

source: Removed
ru: Удалено

source: The erroneous version at :data:`!unittest.mock.__version__` has been removed.
ru: Ошибочная версия :data:`!unittest.mock.__version__` была удалена.

source: :class:`!nntplib.NNTP`: ``xpath()`` and ``xgtitle()`` methods have been removed. These methods are deprecated since Python 3.3. Generally, these extensions are not supported or not enabled by NNTP server administrators. For ``xgtitle()``, please use :meth:`!nntplib.NNTP.descriptions` or :meth:`!nntplib.NNTP.description` instead. (Contributed by Donghee Na in :issue:`39366`.)
ru: :class:`!nntplib.NNTP`: методы ``xpath()`` и ``xgtitle()`` были удалены. Эти методы устарели, начиная с Python 3.3. Как правило, эти расширения не поддерживаются или не включаются администраторами NNTP-серверов. Для ``xgtitle()`` используйте вместо этого :meth:`!nntplib.NNTP.descriptions` или :meth:`!nntplib.NNTP.description`. (Предоставлено Донхи На в :issue:`39366`.)

source: :class:`array.array`: ``tostring()`` and ``fromstring()`` methods have been removed. They were aliases to ``tobytes()`` and ``frombytes()``, deprecated since Python 3.2. (Contributed by Victor Stinner in :issue:`38916`.)
ru: :class:`array.array`: методы ``tostring()`` и ``fromstring()`` были удалены. Это были псевдонимы ``tobytes()`` и ``frombytes()``, устаревшие, начиная с Python 3.2. (Предоставлено Виктором Стиннером в :issue:`38916`.)

source: The undocumented ``sys.callstats()`` function has been removed. Since Python 3.7, it was deprecated and always returned :const:`None`. It required a special build option ``CALL_PROFILE`` which was already removed in Python 3.7. (Contributed by Victor Stinner in :issue:`37414`.)
ru: Недокументированная функция sys.callstats() была удалена. Начиная с Python 3.7, он устарел и всегда возвращал :const:`None`. Для этого требовался специальный параметр сборки CALL_PROFILE, который уже был удален в Python 3.7. (Предоставлено Виктором Стиннером в :issue:`37414`.)

source: The ``sys.getcheckinterval()`` and ``sys.setcheckinterval()`` functions have been removed. They were deprecated since Python 3.2. Use :func:`sys.getswitchinterval` and :func:`sys.setswitchinterval` instead. (Contributed by Victor Stinner in :issue:`37392`.)
ru: Функции ``sys.getcheckinterval()`` и ``sys.setcheckinterval()`` были удалены. Они устарели, начиная с Python 3.2. Вместо этого используйте :func:`sys.getswitchinterval` и :func:`sys.setswitchinterval`. (Предоставлено Виктором Стиннером в :issue:`37392`.)

source: The C function ``PyImport_Cleanup()`` has been removed. It was documented as: "Empty the module table. For internal use only." (Contributed by Victor Stinner in :issue:`36710`.)
ru: Функция C ``PyImport_Cleanup()`` была удалена. Это было задокументировано как: «Очистить таблицу модулей. Только для внутреннего использования». (Предоставлено Виктором Стиннером в :issue:`36710`.)

source: ``_dummy_thread`` and ``dummy_threading`` modules have been removed. These modules were deprecated since Python 3.7 which requires threading support. (Contributed by Victor Stinner in :issue:`37312`.)
ru: Модули ``_dummy_thread`` и ``dummy_threading`` были удалены. Эти модули устарели, начиная с версии Python 3.7, которая требует поддержки потоков. (Предоставлено Виктором Стиннером в :issue:`37312`.)

source: ``aifc.openfp()`` alias to ``aifc.open()``, ``sunau.openfp()`` alias to ``sunau.open()``, and ``wave.openfp()`` alias to :func:`wave.open` have been removed. They were deprecated since Python 3.7. (Contributed by Victor Stinner in :issue:`37320`.)
ru: ``aifc.openfp()`` псевдоним ``aifc.open()``, ``sunau.openfp()`` псевдоним ``sunau.open()`` и ``wave.openfp() `` Псевдоним :func:`wave.open` был удален. Они устарели, начиная с Python 3.7. (Предоставлено Виктором Стиннером в :issue:`37320`.)

source: The :meth:`!isAlive` method of :class:`threading.Thread` has been removed. It was deprecated since Python 3.8. Use :meth:`~threading.Thread.is_alive` instead. (Contributed by Donghee Na in :issue:`37804`.)
ru: Метод :meth:`!isAlive` класса :class:`threading.Thread` был удален. Он устарел с Python 3.8. Вместо этого используйте :meth:`~threading.Thread.is_alive`. (Предоставлено Донхи На в :issue:`37804`.)

source: Methods ``getchildren()`` and ``getiterator()`` of classes :class:`~xml.etree.ElementTree.ElementTree` and :class:`~xml.etree.ElementTree.Element` in the :mod:`~xml.etree.ElementTree` module have been removed. They were deprecated in Python 3.2. Use ``iter(x)`` or ``list(x)`` instead of ``x.getchildren()`` and ``x.iter()`` or ``list(x.iter())`` instead of ``x.getiterator()``. (Contributed by Serhiy Storchaka in :issue:`36543`.)
ru: Методы getchildren() и getiterator() классов :class:`~xml.etree.ElementTree.ElementTree` и :class:`~xml.etree.ElementTree.Element` в :mod: Модуль `~xml.etree.ElementTree` был удален. Они устарели в Python 3.2. Используйте ``iter(x)`` или ``list(x)`` вместо ``x.getchildren()`` и ``x.iter()`` или ``list(x.iter()) `` вместо ``x.getiterator()``. (Предоставлено Сергеем Сторчакой в ​​:issue:`36543`.)
