Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/whatsnew/3.9.po
Languages: ru

source: Added :c:func:`PyThreadState_GetInterpreter` and :c:func:`PyInterpreterState_Get` functions to get the interpreter. Added :c:func:`PyThreadState_GetFrame` function to get the current frame of a Python thread state. Added :c:func:`PyThreadState_GetID` function: get the unique identifier of a Python thread state. (Contributed by Victor Stinner in :issue:`39947`.)
ru: Добавлены функции :c:func:`PyThreadState_GetInterpreter` и :c:func:`PyInterpreterState_Get` для получения интерпретатора. Добавлена ​​функция :c:func:`PyThreadState_GetFrame` для получения текущего кадра состояния потока Python. Добавлена ​​функция :c:func:`PyThreadState_GetID`: получение уникального идентификатора состояния потока Python. (Предоставлено Виктором Стиннером в :issue:`39947`.)

source: Added a new public :c:func:`PyObject_CallNoArgs` function to the C API, which calls a callable Python object without any arguments. It is the most efficient way to call a callable Python object without any argument. (Contributed by Victor Stinner in :issue:`37194`.)
ru: В API C добавлена ​​новая общедоступная функция :c:func:` PyObj ect_CallNoArgs`, которая вызывает вызываемый объект Python без каких-либо аргументов. Это наиболее эффективный способ вызвать вызываемый объект Python без каких-либо аргументов. (Предоставлено Виктором Стиннером в :issue:`37194`.)

source: Changes in the limited C API (if ``Py_LIMITED_API`` macro is defined):
ru: Изменения в ограниченном C API (если определен макрос Py_LIMITED_API):

source: Provide :c:func:`Py_EnterRecursiveCall` and :c:func:`Py_LeaveRecursiveCall` as regular functions for the limited API. Previously, there were defined as macros, but these macros didn't compile with the limited C API which cannot access ``PyThreadState.recursion_depth`` field (the structure is opaque in the limited C API).
ru: Предоставьте :c:func:`Py_EnterRecursiveCall` и :c:func:`Py_LeaveRecursiveCall` как обычные функции для ограниченного API. Раньше они были определены как макросы, но эти макросы не компилировались с ограниченным API C, который не может получить доступ к полю PyThreadState.recursion_length (структура непрозрачна в ограниченном API C).

source: ``PyObject_INIT()`` and ``PyObject_INIT_VAR()`` become regular "opaque" function to hide implementation details.
ru: `` PyObj ect_INIT()`` и `` PyObj ect_INIT_VAR()`` становятся обычной "непрозрачной" функцией, чтобы скрыть детали реализации.

source: (Contributed by Victor Stinner in :issue:`38644` and :issue:`39542`.)
ru: (Предоставлено Виктором Стиннером в :issue:`38644` и :issue:`39542`.)

source: The :c:func:`PyModule_AddType` function is added to help adding a type to a module. (Contributed by Donghee Na in :issue:`40024`.)
ru: Функция :c:func:`PyModule_AddType` добавлена, чтобы помочь добавить тип в модуль. (Предоставлено Донхи На в :issue:`40024`.)

source: Added the functions :c:func:`PyObject_GC_IsTracked` and :c:func:`PyObject_GC_IsFinalized` to the public API to allow to query if Python objects are being currently tracked or have been already finalized by the garbage collector respectively. (Contributed by Pablo Galindo Salgado in :issue:`40241`.)
ru: В общедоступный API добавлены функции :c:func:` PyObj ect_GC_IsTracked` и :c:func:` PyObj ect_GC_IsFinalized`, позволяющие запрашивать, отслеживаются ли в данный момент объекты Python или они уже были финализированы сборщиком мусора соответственно. (Предоставлено Пабло Галиндо Сальгадо в :issue:`40241`.)

source: Added :c:func:`!_PyObject_FunctionStr` to get a user-friendly string representation of a function-like object. (Patch by Jeroen Demeyer in :issue:`37645`.)
ru: Добавлен :c:func:`!_ PyObj ect_FunctionStr`, чтобы получить удобное строковое представление функционального объекта. (Патч от Йеруна Демейера в :issue:`37645`.)

source: Added :c:func:`PyObject_CallOneArg` for calling an object with one positional argument (Patch by Jeroen Demeyer in :issue:`37483`.)
ru: Добавлен :c:func:` PyObj ect_CallOneArg` для вызова объекта с одним позиционным аргументом (патч от Йеруна Демейера в :issue:`37483`.)

source: ``PyInterpreterState.eval_frame`` (:pep:`523`) now requires a new mandatory *tstate* parameter (``PyThreadState*``). (Contributed by Victor Stinner in :issue:`38500`.)
ru: ``PyInterpreterState.eval_frame`` (:pep:`523`) теперь требует нового обязательного параметра *tstate* (``PyThreadState*``). (Предоставлено Виктором Стиннером в :issue:`38500`.)

source: Extension modules: :c:member:`~PyModuleDef.m_traverse`, :c:member:`~PyModuleDef.m_clear` and :c:member:`~PyModuleDef.m_free` functions of :c:type:`PyModuleDef` are no longer called if the module state was requested but is not allocated yet. This is the case immediately after the module is created and before the module is executed (:c:data:`Py_mod_exec` function). More precisely, these functions are not called if :c:member:`~PyModuleDef.m_size` is greater than 0 and the module state (as returned by :c:func:`PyModule_GetState`) is ``NULL``.
ru: Модули расширения: :c:member:`~PyModuleDef.m_traverse`, :c:member:`~PyModuleDef.m_clear` и :c:member:`~PyModuleDef.m_free` функции :c:type:`PyModuleDef` отсутствуют больше вызывается, если состояние модуля было запрошено, но еще не выделено. Это происходит сразу после создания модуля и до его выполнения (функция:c:data:`Py_mod_exec`). Точнее, эти функции не вызываются, если :c:member:`~PyModuleDef.m_size` больше 0 и состояние модуля (возвращаемое :c:func:`PyModule_GetState`) равно ``NULL``.

source: Extension modules without module state (``m_size <= 0``) are not affected.
ru: Модули расширения без состояния модуля (``m_size <= 0``) не затрагиваются.

source: If :c:func:`Py_AddPendingCall` is called in a subinterpreter, the function is now scheduled to be called from the subinterpreter, rather than being called from the main interpreter. Each subinterpreter now has its own list of scheduled calls. (Contributed by Victor Stinner in :issue:`39984`.)
ru: Если :c:func:`Py_AddPendingCall` вызывается в субинтерпретаторе, теперь запланирован вызов функции из субинтерпретатора, а не из основного интерпретатора. У каждого субпереводчика теперь есть свой список запланированных вызовов. (Предоставлено Виктором Стиннером в :issue:`39984`.)

source: The Windows registry is no longer used to initialize :data:`sys.path` when the ``-E`` option is used (if :c:member:`PyConfig.use_environment` is set to ``0``). This is significant when embedding Python on Windows. (Contributed by Zackery Spytz in :issue:`8901`.)
ru: Реестр Windows больше не используется для инициализации :data:`sys.path`, когда используется опция ``-E`` (если :c:member:`PyConfig.use_environment` установлен в ``0``). Это важно при встраивании Python в Windows. (Предоставлено Закери Шпитцем в :issue:`8901`.)

source: The global variable :c:data:`PyStructSequence_UnnamedField` is now a constant and refers to a constant string. (Contributed by Serhiy Storchaka in :issue:`38650`.)
ru: Глобальная переменная :c:data:`PyStructSequence_UnnamedField` теперь является константой и ссылается на константную строку. (Предоставлено Сергеем Сторчакой в ​​:issue:`38650`.)

source: The :c:type:`!PyGC_Head` structure is now opaque. It is only defined in the internal C API (``pycore_gc.h``). (Contributed by Victor Stinner in :issue:`40241`.)
ru: Структура :c:type:`!PyGC_Head` теперь непрозрачна. Он определен только во внутреннем API C (``pycore_gc.h``). (Предоставлено Виктором Стиннером в :issue:`40241`.)

source: The ``Py_UNICODE_COPY``, ``Py_UNICODE_FILL``, ``PyUnicode_WSTR_LENGTH``, :c:func:`!PyUnicode_FromUnicode`, :c:func:`!PyUnicode_AsUnicode`, ``_PyUnicode_AsUnicode``, and :c:func:`!PyUnicode_AsUnicodeAndSize` are marked as deprecated in C. They have been deprecated by :pep:`393` since Python 3.3. (Contributed by Inada Naoki in :issue:`36346`.)
ru: ``Py_UNICODE_COPY``, ``Py_UNICODE_FILL``, ``PyUnicode_WSTR_LENGTH``, :c:func:`!PyUnicode_FromUnicode`, :c:func:`!PyUnicode_AsUnicode`, ``_PyUnicode_AsUnicode`` и :c:func :`!PyUnicode_AsUnicodeAndSize` помечены как устаревшие в C. Они объявлены устаревшими в :pep:`393`, начиная с Python 3.3. (Предоставлено Инадой Наоки в :issue:`36346`.)

source: The :c:func:`Py_FatalError` function is replaced with a macro which logs automatically the name of the current function, unless the ``Py_LIMITED_API`` macro is defined. (Contributed by Victor Stinner in :issue:`39882`.)
ru: Функция :c:func:`Py_FatalError` заменяется макросом, который автоматически записывает имя текущей функции, если не определен макрос ``Py_LIMITED_API``. (Предоставлено Виктором Стиннером в :issue:`39882`.)

source: The vectorcall protocol now requires that the caller passes only strings as keyword names. (See :issue:`37540` for more information.)
ru: Протокол векторного вызова теперь требует, чтобы вызывающая сторона передавала в качестве имен ключевых слов только строки. (Дополнительную информацию см. в :issue:`37540`.)

source: Implementation details of a number of macros and functions are now hidden:
ru: Детали реализации ряда макросов и функций теперь скрыты:

source: :c:func:`PyObject_IS_GC` macro was converted to a function.
ru: Макрос :c:func:` PyObject_IS_GC` был преобразован в функцию.

source: The :c:func:`!PyObject_NEW` macro becomes an alias to the :c:macro:`PyObject_New` macro, and the :c:func:`!PyObject_NEW_VAR` macro becomes an alias to the :c:macro:`PyObject_NewVar` macro. They no longer access directly the :c:member:`PyTypeObject.tp_basicsize` member.
ru: :c:func:`! Макрос PyObj ect_NEW` становится псевдонимом макроса :c:macro:` PyObj ect_New`, а макрос :c:func:`! Макрос PyObject_NEW_VAR` становится псевдонимом макроса :c:macro:` PyObj ect_NewVar`. Они больше не имеют прямого доступа к элементу :c:member:`PyTypeObject.tp_basicsize`.

source: :c:func:`!PyObject_GET_WEAKREFS_LISTPTR` macro was converted to a function: the macro accessed directly the :c:member:`PyTypeObject.tp_weaklistoffset` member.
ru: :c:func:`! Макрос PyObject_GET_WEAKREFS_LISTPTR` был преобразован в функцию: макрос напрямую обращался к элементу :c:member:`PyTypeObject.tp_weaklistoffset`.

source: :c:func:`PyObject_CheckBuffer` macro was converted to a function: the macro accessed directly the :c:member:`PyTypeObject.tp_as_buffer` member.
ru: Макрос :c:func:` PyObj ect_CheckBuffer` был преобразован в функцию: макрос напрямую обращался к элементу :c:member:`PyTypeObject.tp_as_buffer`.

source: :c:func:`PyIndex_Check` is now always declared as an opaque function to hide implementation details: removed the ``PyIndex_Check()`` macro. The macro accessed directly the :c:member:`PyTypeObject.tp_as_number` member.
ru: :c:func:`PyIndex_Check` теперь всегда объявляется как непрозрачная функция, чтобы скрыть детали реализации: удален макрос ``PyIndex_Check()``. Макрос напрямую обращается к элементу :c:member:`PyTypeObject.tp_as_number`.

source: (See :issue:`40170` for more details.)
ru: (Подробнее см. в :issue:`40170`.)

source: Excluded ``PyFPE_START_PROTECT()`` and ``PyFPE_END_PROTECT()`` macros of ``pyfpe.h`` from the limited C API. (Contributed by Victor Stinner in :issue:`38835`.)
ru: Исключены макросы PyFPE_START_PROTECT() и PyFPE_END_PROTECT() для pyfpe.h из ограниченного C API. (Предоставлено Виктором Стиннером в :issue:`38835`.)

source: The ``tp_print`` slot of :ref:`PyTypeObject <type-structs>` has been removed. It was used for printing objects to files in Python 2.7 and before. Since Python 3.0, it has been ignored and unused. (Contributed by Jeroen Demeyer in :issue:`36974`.)
ru: Слот ``tp_print`` в :ref:`PyTypeObject <type-structs>` был удален. Он использовался для печати объектов в файлы в Python 2.7 и ранее. Начиная с Python 3.0, он игнорировался и не использовался. (Предоставлено Йеруном Демейером в :issue:`36974`.)

source: Excluded the following functions from the limited C API:
ru: Из ограниченного C API исключены следующие функции:

source: ``PyThreadState_DeleteCurrent()`` (Contributed by Joannah Nanjekye in :issue:`37878`.)
ru: ``PyThreadState_DeleteCurrent()`` (предоставлен Джоанной Нанджеки в :issue:`37878`.)

source: The trashcan mechanism which never worked in the limited C API.
ru: Механизм мусорной корзины, который никогда не работал в ограниченном C API.

source: Moved following functions and definitions to the internal C API:
ru: Следующие функции и определения перенесены во внутренний API C:

source: ``_Py_AddToAllObjects()`` (specific to ``Py_TRACE_REFS`` build)
ru: ``_Py_AddToAllObjects()`` (специфично для сборки ``Py_TRACE_REFS``)

source: Removed ``_PyRuntime.getframe`` hook and removed ``_PyThreadState_GetFrame`` macro which was an alias to ``_PyRuntime.getframe``. They were only exposed by the internal C API. Removed also ``PyThreadFrameGetter`` type. (Contributed by Victor Stinner in :issue:`39946`.)
ru: Удален хук ``_PyRuntime.getframe`` и удален макрос ``_PyThreadState_GetFrame``, который был псевдонимом ``_PyRuntime.getframe``. Они были доступны только внутреннему API C. Также удален тип PyThreadFrameGetter. (Предоставлено Виктором Стиннером в :issue:`39946`.)

source: Removed the following functions from the C API. Call :c:func:`PyGC_Collect` explicitly to clear all free lists. (Contributed by Inada Naoki and Victor Stinner in :issue:`37340`, :issue:`38896` and :issue:`40428`.)
ru: Удалены следующие функции из C API. Вызовите :c:func:`PyGC_Collect` явно, чтобы очистить все свободные списки. (Внесено Инадой Наоки и Виктором Стиннером в :issue:`37340`, :issue:`38896` и :issue:`40428`.)

source: ``PyMethod_ClearFreeList()`` and ``PyCFunction_ClearFreeList()``: the free lists of bound method objects have been removed.
ru: ``PyMethod_ClearFreeList()`` и ``PyCFunction_ClearFreeList()``: свободные списки связанных объектов метода были удалены.

source: ``PySet_ClearFreeList()``: the set free list has been removed in Python 3.4.
ru: ``PySet_ClearFreeList()``: список установленных свободных мест был удален в Python 3.4.

source: ``PyUnicode_ClearFreeList()``: the Unicode free list has been removed in Python 3.3.
ru: ``PyUnicode_ClearFreeList()``: список свободных объектов Unicode был удален в Python 3.3.

source: Removed ``_PyUnicode_ClearStaticStrings()`` function. (Contributed by Victor Stinner in :issue:`39465`.)
ru: Удалена функция ``_PyUnicode_ClearStaticStrings()``. (Предоставлено Виктором Стиннером в :issue:`39465`.)

source: Removed ``Py_UNICODE_MATCH``. It has been deprecated by :pep:`393`, and broken since Python 3.3. The :c:func:`PyUnicode_Tailmatch` function can be used instead. (Contributed by Inada Naoki in :issue:`36346`.)
ru: Удален ``Py_UNICODE_MATCH``. Он устарел :pep:`393` и не работает начиная с Python 3.3. Вместо этого можно использовать функцию :c:func:`PyUnicode_Tailmatch`. (Предоставлено Инадой Наоки в :issue:`36346`.)

source: Cleaned header files of interfaces defined but with no implementation. The public API symbols being removed are: ``_PyBytes_InsertThousandsGroupingLocale``, ``_PyBytes_InsertThousandsGrouping``, ``_Py_InitializeFromArgs``, ``_Py_InitializeFromWideArgs``, ``_PyFloat_Repr``, ``_PyFloat_Digits``, ``_PyFloat_DigitsInit``, ``PyFrame_ExtendStack``, ``_PyAIterWrapper_Type``, ``PyNullImporter_Type``, ``PyCmpWrapper_Type``, ``PySortWrapper_Type``, ``PyNoArgsFunction``. (Contributed by Pablo Galindo Salgado in :issue:`39372`.)
ru: Очищены заголовочные файлы интерфейсов, определенных, но без реализации. Удаляются следующие общедоступные символы API: ``_PyBytes_InsertThousandsGroupingLocale``, ``_PyBytes_InsertThousandsGrouping``, ``_Py_InitializeFromArgs``, ``_Py_InitializeFromWideArgs``, ``_PyFloat_Repr``, ``_PyFloat_Digits``, ``_ PyFloat_DigitsInit``, ``PyFrame_ExtendStack``, ``_PyAIterWrapper_Type``, ``PyNullImporter_Type``, ``PyCmpWrapper_Type``, ``PySortWrapper_Type``, ``PyNoArgsFunction``. (Предоставлено Пабло Галиндо Сальгадо в :issue:`39372`.)

source: Notable changes in Python 3.9.1
ru: Заметные изменения в Python 3.9.1

source: The behavior of :class:`typing.Literal` was changed to conform with :pep:`586` and to match the behavior of static type checkers specified in the PEP.
ru: Поведение :class:`typing.Literal` было изменено, чтобы соответствовать :pep:`586` и поведению средств проверки статических типов, указанных в PEP.

source: ``Literal`` now de-duplicates parameters.
ru: ``Literal`` теперь устраняет дубликаты параметров.

source: Equality comparisons between ``Literal`` objects are now order independent.
ru: Сравнения на равенство между объектами Literal теперь не зависят от порядка.

source: ``Literal`` comparisons now respect types. For example, ``Literal[0] == Literal[False]`` previously evaluated to ``True``. It is now ``False``. To support this change, the internally used type cache now supports differentiating types.
ru: ``Литеральные`` сравнения теперь учитывают типы. Например, ``Literal[0] == Literal[False]`` ранее оценивалось как ``True``. Теперь это ``Ложь``. Чтобы поддержать это изменение, внутренний кэш типов теперь поддерживает дифференцирующие типы.

source: ``Literal`` objects will now raise a :exc:`TypeError` exception during equality comparisons if any of their parameters are not :term:`hashable`. Note that declaring ``Literal`` with mutable parameters will not throw an error::
ru: ``Литеральные`` объекты теперь будут вызывать исключение :exc:`TypeError` во время сравнения на равенство, если какой-либо из их параметров не является :term:`hashable`. Обратите внимание, что объявление ``Literal`` с изменяемыми параметрами не приведет к ошибке::

source: (Contributed by Yurii Karabas in :issue:`42345`.)
ru: (Предоставлено Юрием Карабасом в :issue:`42345`.)

source: macOS 11.0 (Big Sur) and Apple Silicon Mac support
ru: Поддержка macOS 11.0 (Big Sur) и Apple Silicon Mac

source: As of 3.9.1, Python now fully supports building and running on macOS 11.0 (Big Sur) and on Apple Silicon Macs (based on the ``ARM64`` architecture). A new universal build variant, ``universal2``, is now available to natively support both ``ARM64`` and ``Intel 64`` in one set of executables. Binaries can also now be built on current versions of macOS to be deployed on a range of older macOS versions (tested to 10.9) while making some newer OS functions and options conditionally available based on the operating system version in use at runtime ("weaklinking").
ru: Начиная с версии 3.9.1, Python теперь полностью поддерживает сборку и работу на macOS 11.0 (Big Sur) и на компьютерах Apple Silicon Mac (на основе архитектуры ARM64). Теперь доступен новый универсальный вариант сборки, «universal2», который изначально поддерживает как «ARM64», так и «Intel 64» в одном наборе исполняемых файлов. Двоичные файлы теперь также можно создавать на текущих версиях macOS для развертывания на ряде более старых версий macOS (протестировано до 10.9), при этом некоторые новые функции и параметры ОС становятся условно доступными в зависимости от версии операционной системы, используемой во время выполнения («слабая связь»). ).

source: (Contributed by Ronald Oussoren and Lawrence D'Anna in :issue:`41100`.)
ru: (Предоставлено Рональдом Оусореном и Лоуренсом Д'Анна в :issue:`41100`.)

source: Notable changes in Python 3.9.2
ru: Известные изменения в Python 3.9.2

source: :class:`collections.abc.Callable` generic now flattens type parameters, similar to what :data:`typing.Callable` currently does. This means that ``collections.abc.Callable[[int, str], str]`` will have ``__args__`` of ``(int, str, str)``; previously this was ``([int, str], str)``. To allow this change, :class:`types.GenericAlias` can now be subclassed, and a subclass will be returned when subscripting the :class:`collections.abc.Callable` type. Code which accesses the arguments via :func:`typing.get_args` or ``__args__`` need to account for this change. A :exc:`DeprecationWarning` may be emitted for invalid forms of parameterizing :class:`collections.abc.Callable` which may have passed silently in Python 3.9.1. This :exc:`DeprecationWarning` will become a :exc:`TypeError` in Python 3.10. (Contributed by Ken Jin in :issue:`42195`.)
ru: :class:`collections.abc.Callable` универсальный теперь выравнивает параметры типа, аналогично тому, что сейчас делает :data:`typing.Callable`. Это означает, что ``collections.abc.Callable[[int, str], str]`` будет иметь ``__args__`` из ``(int, str, str)``; раньше это было ``([int, str], str)``. Чтобы разрешить это изменение, :class:`types.GenericAlias` теперь может быть подклассом, и подкласс будет возвращен при подписке на тип :class:`collections.abc.Callable`. Код, который обращается к аргументам через :func:`typing.get_args` или ``__args__``, должен учитывать это изменение. :exc:`DeprecationWarning` может быть выдано для недопустимых форм параметризации :class:`collections.abc.Callable`, которые могли передаваться автоматически в Python 3.9.1. Это :exc:`DeprecationWarning` станет :exc:`TypeError` в Python 3.10. (Предоставлено Кеном Джином в :issue:`42195`.)

source: Earlier Python versions allowed using both ``;`` and ``&`` as query parameter separators in :func:`urllib.parse.parse_qs` and :func:`urllib.parse.parse_qsl`. Due to security concerns, and to conform with newer W3C recommendations, this has been changed to allow only a single separator key, with ``&`` as the default. This change also affects :func:`!cgi.parse` and :func:`!cgi.parse_multipart` as they use the affected functions internally. For more details, please see their respective documentation. (Contributed by Adam Goldschmidt, Senthil Kumaran and Ken Jin in :issue:`42967`.)
ru: Более ранние версии Python позволяли использовать как ``;``, так и ``&`` в качестве разделителей параметров запроса в :func:`urllib.parse.parse_qs` и :func:`urllib.parse.parse_qsl`. Из соображений безопасности и для соответствия новым рекомендациям W3C это было изменено, чтобы разрешить использование только одного ключа-разделителя с ``&`` по умолчанию. Это изменение также затрагивает :func:`!cgi.parse` и :func:`!cgi.parse_multipart`, поскольку они используют затронутые функции внутри себя. Более подробную информацию можно найти в соответствующей документации. (Предоставлено Адамом Гольдшмидтом, Сентилом Кумараном и Кеном Джином в :issue:`42967`.)

source: Notable changes in Python 3.9.3
ru: Заметные изменения в Python 3.9.3

source: A security fix alters the :class:`ftplib.FTP` behavior to not trust the IPv4 address sent from the remote server when setting up a passive data channel. We reuse the ftp server IP address instead. For unusual code requiring the old behavior, set a ``trust_server_pasv_ipv4_address`` attribute on your FTP instance to ``True``. (See :gh:`87451`)
ru: Исправление безопасности изменяет поведение :class:`ftplib.FTP`, чтобы он не доверял IPv4-адресу, отправленному с удаленного сервера при настройке пассивного канала передачи данных. Вместо этого мы повторно используем IP-адрес ftp-сервера. Для необычного кода, требующего старого поведения, установите для атрибута Trust_server_pasv_ipv4_address вашего экземпляра FTP значение True. (См. :gh:`87451`)

source: Notable changes in Python 3.9.5
ru: Заметные изменения в Python 3.9.5
