Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/whatsnew/3.9.po
Languages: ru

source: When cancelling the task due to a timeout, :meth:`asyncio.wait_for` will now wait until the cancellation is complete also in the case when *timeout* is <= 0, like it does with positive timeouts. (Contributed by Elvis Pranskevichus in :issue:`32751`.)
ru: При отмене задачи из-за таймаута :meth:`asyncio.wait_for` теперь будет ждать завершения отмены также в случае, когда *timeout* <= 0, как это происходит с положительными таймаутами. (Предоставлено Элвисом Пранскевичусом в :issue:`32751`.)

source: :mod:`asyncio` now raises :exc:`TypeError` when calling incompatible methods with an :class:`ssl.SSLSocket` socket. (Contributed by Ido Michael in :issue:`37404`.)
ru: :mod:`asyncio` теперь вызывает :exc:`TypeError` при вызове несовместимых методов с помощью сокета :class:`ssl.SSLSocket`. (Предоставлено Идо Майклом в :issue:`37404`.)

source: Added new possibility to use hardlinks for duplicated ``.pyc`` files: *hardlink_dupes* parameter and --hardlink-dupes command line option. (Contributed by Lumír 'Frenzy' Balhar in :issue:`40495`.)
ru: Добавлена ​​новая возможность использовать жесткие ссылки для дублированных файлов ``.pyc``: параметр *hardlink_dupes* и параметр командной строки --hardlink-dupes. (Предоставлено Люмиром «Безумием» Балхаром в :issue:`40495`.)

source: Added new options for path manipulation in resulting ``.pyc`` files: *stripdir*, *prependdir*, *limit_sl_dest* parameters and -s, -p, -e command line options. Added the possibility to specify the option for an optimization level multiple times. (Contributed by Lumír 'Frenzy' Balhar in :issue:`38112`.)
ru: Добавлены новые параметры для манипуляций с путями в результирующих файлах ``.pyc``: параметры *stripdir*, *prependdir*, *limit_sl_dest* и параметры командной строки -s, -p, -e. Добавлена ​​возможность указать параметр уровня оптимизации несколько раз. (Предоставлено Люмиром «Безумием» Балхаром в :issue:`38112`.)

source: Added a new *cancel_futures* parameter to :meth:`concurrent.futures.Executor.shutdown` that cancels all pending futures which have not started running, instead of waiting for them to complete before shutting down the executor. (Contributed by Kyle Stanley in :issue:`39349`.)
ru: Добавлен новый параметр *cancel_futures* в :meth:`concurrent.futures.Executor.shutdown`, который отменяет все ожидающие фьючерсы, которые еще не начали выполняться, вместо того, чтобы ждать их завершения перед выключением исполнителя. (Предоставлено Кайлом Стэнли в :issue:`39349`.)

source: Removed daemon threads from :class:`~concurrent.futures.ThreadPoolExecutor` and :class:`~concurrent.futures.ProcessPoolExecutor`. This improves compatibility with subinterpreters and predictability in their shutdown processes. (Contributed by Kyle Stanley in :issue:`39812`.)
ru: Удалены потоки демона из :class:`~concurrent.futures.ThreadPoolExecutor` и :class:`~concurrent.futures.ProcessPoolExecutor`. Это улучшает совместимость с субинтерпретаторами и предсказуемость процессов их завершения. (Предоставлено Кайлом Стэнли в :issue:`39812`.)

source: Workers in :class:`~concurrent.futures.ProcessPoolExecutor` are now spawned on demand, only when there are no available idle workers to reuse. This optimizes startup overhead and reduces the amount of lost CPU time to idle workers. (Contributed by Kyle Stanley in :issue:`39207`.)
ru: Рабочие в :class:`~concurrent.futures.ProcessPoolExecutor`теперь создаются по требованию, только когда нет доступных свободных рабочих для повторного использования. Это оптимизирует накладные расходы при запуске и сокращает количество потерянного процессорного времени для свободных рабочих. (Предоставлено Кайлом Стэнли в :issue:`39207`.)

source: Added :func:`curses.get_escdelay`, :func:`curses.set_escdelay`, :func:`curses.get_tabsize`, and :func:`curses.set_tabsize` functions. (Contributed by Anthony Sottile in :issue:`38312`.)
ru: Добавлены функции :func:`curses.get_escdelay`, :func:`curses.set_escdelay`, :func:`curses.get_tabsize` и :func:`curses.set_tabsize`. (Предоставлено Энтони Соттайлом в :issue:`38312`.)

source: The :meth:`~datetime.date.isocalendar` of :class:`datetime.date` and :meth:`~datetime.datetime.isocalendar` of :class:`datetime.datetime` methods now returns a :func:`~collections.namedtuple` instead of a :class:`tuple`. (Contributed by Donghee Na in :issue:`24416`.)
ru: :meth:`~datetime.date.isocalendar` методов :class:`datetime.date` и :meth:`~datetime.datetime.isocalendar` :class:`datetime.datetime` теперь возвращает :func:` ~collections.namedtuple` вместо :class:`tuple`. (Предоставлено Донхи На в :issue:`24416`.)

source: The :command:`upload` command now creates SHA2-256 and Blake2b-256 hash digests. It skips MD5 on platforms that block MD5 digest. (Contributed by Christian Heimes in :issue:`40698`.)
ru: Команда :command:`upload` теперь создает хеш-дайджесты SHA2-256 и Blake2b-256. Он пропускает MD5 на платформах, которые блокируют дайджест MD5. (Предоставлено Кристианом Хаймсом в :issue:`40698`.)

source: Added constants :const:`~fcntl.F_OFD_GETLK`, :const:`~fcntl.F_OFD_SETLK` and :const:`~fcntl.F_OFD_SETLKW`. (Contributed by Donghee Na in :issue:`38602`.)
ru: Добавлены константы :const:`~fcntl.F_OFD_GETLK`, :const:`~fcntl.F_OFD_SETLK` и :const:`~fcntl.F_OFD_SETLKW`. (Предоставлено Донхи На в :issue:`38602`.)

source: :class:`~ftplib.FTP` and :class:`~ftplib.FTP_TLS` now raise a :class:`ValueError` if the given timeout for their constructor is zero to prevent the creation of a non-blocking socket. (Contributed by Donghee Na in :issue:`39259`.)
ru: :class:`~ftplib.FTP` и :class:`~ftplib.FTP_TLS` теперь вызывают :class:`ValueError`, если заданное время ожидания для их конструктора равно нулю, чтобы предотвратить создание неблокирующего сокета. (Предоставлено Донхи На в :issue:`39259`.)

source: When the garbage collector makes a collection in which some objects resurrect (they are reachable from outside the isolated cycles after the finalizers have been executed), do not block the collection of all objects that are still unreachable. (Contributed by Pablo Galindo and Tim Peters in :issue:`38379`.)
ru: Когда сборщик мусора создает сборку, в которой некоторые объекты воскрешаются (они доступны извне изолированных циклов после выполнения финализаторов), не блокируйте сбор всех объектов, которые все еще недоступны. (Предоставлено Пабло Галиндо и Тимом Питерсом в :issue:`38379`.)

source: Added a new function :func:`gc.is_finalized` to check if an object has been finalized by the garbage collector. (Contributed by Pablo Galindo in :issue:`39322`.)
ru: Добавлена ​​новая функция :func:`gc.is_finalized` для проверки того, был ли объект финализирован сборщиком мусора. (Предоставлено Пабло Галиндо в :issue:`39322`.)

source: The :mod:`hashlib` module can now use SHA3 hashes and SHAKE XOF from OpenSSL when available. (Contributed by Christian Heimes in :issue:`37630`.)
ru: Модуль :mod:`hashlib` теперь может использовать хэши SHA3 и SHAKE XOF из OpenSSL, если они доступны. (Предоставлено Кристианом Хаймсом в :issue:`37630`.)

source: Builtin hash modules can now be disabled with ``./configure --without-builtin-hashlib-hashes`` or selectively enabled with e.g. ``./configure --with-builtin-hashlib-hashes=sha3,blake2`` to force use of OpenSSL based implementation. (Contributed by Christian Heimes in :issue:`40479`)
ru: Встроенные хэш-модули теперь можно отключить с помощью ``./configure --without-builtin-hashlib-hashes`` или выборочно включить, например, ``./configure --with-builtin-hashlib-hashes=sha3,blake2`` для принудительное использование реализации на основе OpenSSL. (Предоставлено Кристианом Хаймсом в :issue:`40479`)

source: HTTP status codes ``103 EARLY_HINTS``, ``418 IM_A_TEAPOT`` and ``425 TOO_EARLY`` are added to :class:`http.HTTPStatus`. (Contributed by Donghee Na in :issue:`39509` and Ross Rhodes in :issue:`39507`.)
ru: Коды состояния HTTP ``103 EARLY_HINTS``, ``418 IM_A_TEAPOT`` и ``425 Too_EARLY`` добавляются в :class:`http.HTTPStatus`. (Предоставлено Донхи На в :issue:`39509` и Россом Роудсом в :issue:`39507`.)

source: IDLE and idlelib
ru: IDLE и idlelib

source: Added option to toggle cursor blink off. (Contributed by Zackery Spytz in :issue:`4603`.)
ru: Добавлена ​​опция отключения мерцания курсора. (Предоставлено Закери Шпитцем в :issue:`4603`.)

source: Escape key now closes IDLE completion windows. (Contributed by Johnny Najera in :issue:`38944`.)
ru: Клавиша Escape теперь закрывает окна завершения IDLE. (Предоставлено Джонни Наджерой в :issue:`38944`.)

source: Added keywords to module name completion list. (Contributed by Terry J. Reedy in :issue:`37765`.)
ru: Добавлены ключевые слова в список завершения имени модуля. (Предоставлено Терри Дж. Риди в :issue:`37765`.)

source: New in 3.9 maintenance releases
ru: Новое в обновлении 3.9 выпуска

source: Make IDLE invoke :func:`sys.excepthook` (when started without '-n'). User hooks were previously ignored. (Contributed by Ken Hilton in :issue:`43008`.)
ru: Заставьте IDLE вызывать :func:`sys.excepthook` (при запуске без '-n'). Пользовательские перехваты ранее игнорировались. (Предоставлено Кеном Хилтоном в :issue:`43008`.)

source: The changes above have been backported to 3.8 maintenance releases.
ru: Вышеуказанные изменения были перенесены в обновление 3.8 выпуска.

source: Rearrange the settings dialog. Split the General tab into Windows and Shell/Ed tabs. Move help sources, which extend the Help menu, to the Extensions tab. Make space for new options and shorten the dialog. The latter makes the dialog better fit small screens. (Contributed by Terry Jan Reedy in :issue:`40468`.) Move the indent space setting from the Font tab to the new Windows tab. (Contributed by Mark Roseman and Terry Jan Reedy in :issue:`33962`.)
ru: Переупорядочить диалоговое окно настроек. Разделить вкладку «Общие» на вкладки «Windows» и «Shell/Ed». Переместить источники справки, которые расширяют меню «Справка», на вкладку «Расширения». Освободить место для новых параметров и сократить диалоговое окно. Последнее позволяет лучше разместить диалоговое окно на небольших экранах. (Предоставлено Терри Яном Риди в :issue:`40468`.) Переместить настройку отступа с вкладки «Шрифт» на новую вкладку «Windows». (Предоставлено Марком Роземаном и Терри Яном Риди в :issue:`33962`.)

source: Apply syntax highlighting to ``.pyi`` files. (Contributed by Alex Waygood and Terry Jan Reedy in :issue:`45447`.)
ru: Примените подсветку синтаксиса к файлам ``.pyi``. (Предоставлено Алексом Вэйгудом и Терри Джен Риди в :issue:`45447`.)

source: :class:`~imaplib.IMAP4` and :class:`~imaplib.IMAP4_SSL` now have an optional *timeout* parameter for their constructors. Also, the :meth:`~imaplib.IMAP4.open` method now has an optional *timeout* parameter with this change. The overridden methods of :class:`~imaplib.IMAP4_SSL` and :class:`~imaplib.IMAP4_stream` were applied to this change. (Contributed by Donghee Na in :issue:`38615`.)
ru: :class:`~imaplib.IMAP4` и :class:`~imaplib.IMAP4_SSL` теперь имеют необязательный параметр *timeout* для своих конструкторов. Кроме того, благодаря этому изменению метод :meth:`~imaplib.IMAP4.open` теперь имеет дополнительный параметр *timeout*. К этому изменению были применены переопределенные методы :class:`~imaplib.IMAP4_SSL` и :class:`~imaplib.IMAP4_stream`. (Предоставлено Донхи На в :issue:`38615`.)

source: :meth:`imaplib.IMAP4.unselect` is added. :meth:`imaplib.IMAP4.unselect` frees server's resources associated with the selected mailbox and returns the server to the authenticated state. This command performs the same actions as :meth:`imaplib.IMAP4.close`, except that no messages are permanently removed from the currently selected mailbox. (Contributed by Donghee Na in :issue:`40375`.)
ru: Добавлен :meth:`imaplib.IMAP4.unselect`. :meth:`imaplib.IMAP4.unselect` освобождает ресурсы сервера, связанные с выбранным почтовым ящиком, и возвращает сервер в состояние аутентификации. Эта команда выполняет те же действия, что и :meth:`imaplib.IMAP4.close`, за исключением того, что никакие сообщения не удаляются навсегда из текущего выбранного почтового ящика. (Предоставлено Донхи На в :issue:`40375`.)

source: To improve consistency with import statements, :func:`importlib.util.resolve_name` now raises :exc:`ImportError` instead of :exc:`ValueError` for invalid relative import attempts. (Contributed by Ngalim Siregar in :issue:`37444`.)
ru: Чтобы улучшить согласованность с операторами импорта, :func:`importlib.util.resolve_name` теперь вызывает :exc:`ImportError` вместо :exc:`ValueError` для недопустимых относительных попыток импорта. (Предоставлено Нгалимом Сирегаром в :issue:`37444`.)

source: Import loaders which publish immutable module objects can now publish immutable packages in addition to individual modules. (Contributed by Dino Viehland in :issue:`39336`.)
ru: Загрузчики импорта, которые публикуют неизменяемые объекты модулей, теперь могут публиковать неизменяемые пакеты в дополнение к отдельным модулям. (Предоставлено Дино Виеландом в :issue:`39336`.)

source: Added :func:`importlib.resources.files` function with support for subdirectories in package data, matching backport in ``importlib_resources`` version 1.5. (Contributed by Jason R. Coombs in :issue:`39791`.)
ru: Добавлена ​​функция :func:`importlib.resources.files` с поддержкой подкаталогов в данных пакета, соответствующая backport в ``importlib_resources`` версии 1.5. (Предоставлено Джейсоном Р. Кумбсом в :issue:`39791`.)

source: Refreshed ``importlib.metadata`` from ``importlib_metadata`` version 1.6.1.
ru: Обновлен ``importlib.metadata`` из ``importlib_metadata`` версии 1.6.1.

source: :attr:`inspect.BoundArguments.arguments` is changed from ``OrderedDict`` to regular dict. (Contributed by Inada Naoki in :issue:`36350` and :issue:`39775`.)
ru: :attr:`inspect.BoundArguments.arguments` изменен с ``OrderedDict`` на обычный dict. (Предоставлено Инадой Наоки в :issue:`36350` и :issue:`39775`.)

source: :mod:`ipaddress` now supports IPv6 Scoped Addresses (IPv6 address with suffix ``%<scope_id>``).
ru: :mod:`ipaddress` теперь поддерживает адреса с ограниченной областью действия IPv6 (IPv6-адрес с суффиксом ``%<scope_id>``).

source: Scoped IPv6 addresses can be parsed using :class:`ipaddress.IPv6Address`. If present, scope zone ID is available through the :attr:`~ipaddress.IPv6Address.scope_id` attribute. (Contributed by Oleksandr Pavliuk in :issue:`34788`.)
ru: Адреса IPv6 с ограниченной областью действия можно проанализировать с помощью :class:`ipaddress.IPv6Address`. Если он присутствует, идентификатор зоны области доступен через атрибут :attr:`~ipaddress.IPv6Address.scope_id`. (Предоставлено Александром Павлюком в :issue:`34788`.)

source: Starting with Python 3.9.5 the :mod:`ipaddress` module no longer accepts any leading zeros in IPv4 address strings. (Contributed by Christian Heimes in :issue:`36384`).
ru: Начиная с Python 3.9.5, модуль :mod:`ipaddress` больше не принимает ведущие нули в адресных строках IPv4. (Предоставлено Кристианом Хаймсом в :issue:`36384`).

source: math
ru: математика

source: Expanded the :func:`math.gcd` function to handle multiple arguments. Formerly, it only supported two arguments. (Contributed by Serhiy Storchaka in :issue:`39648`.)
ru: Расширена функция :func:`math.gcd` для обработки нескольких аргументов. Раньше он поддерживал только два аргумента. (Предоставлено Сергеем Сторчакой в ​​:issue:`39648`.)

source: Added :func:`math.lcm`: return the least common multiple of specified arguments. (Contributed by Mark Dickinson, Ananthakrishnan and Serhiy Storchaka in :issue:`39479` and :issue:`39648`.)
ru: Добавлен :func:`math.lcm`: возвращает наименьшее общее кратное указанных аргументов. (Предоставлено Марком Дикинсоном, Анантакришнаном и Сергеем Сторчакой в ​​:issue:`39479` и :issue:`39648`.)

source: Added :func:`math.nextafter`: return the next floating-point value after *x* towards *y*. (Contributed by Victor Stinner in :issue:`39288`.)
ru: Добавлена ​​:func:`math.nextafter`: возвращает следующее значение с плавающей запятой после *x* по направлению к *y*. (Предоставлено Виктором Стиннером в :issue:`39288`.)

source: Added :func:`math.ulp`: return the value of the least significant bit of a float. (Contributed by Victor Stinner in :issue:`39310`.)
ru: Добавлен :func:`math.ulp`: возвращает значение младшего бита числа с плавающей запятой. (Предоставлено Виктором Стиннером в :issue:`39310`.)

source: The :class:`multiprocessing.SimpleQueue` class has a new :meth:`~multiprocessing.SimpleQueue.close` method to explicitly close the queue. (Contributed by Victor Stinner in :issue:`30966`.)
ru: Класс :class:`multiprocessing.SimpleQueue` имеет новый метод :meth:`~multiprocessing.SimpleQueue.close` для явного закрытия очереди. (Предоставлено Виктором Стиннером в :issue:`30966`.)

source: :class:`!NNTP` and :class:`!NNTP_SSL` now raise a :class:`ValueError` if the given timeout for their constructor is zero to prevent the creation of a non-blocking socket. (Contributed by Donghee Na in :issue:`39259`.)
ru: :class:`!NNTP` и :class:`!NNTP_SSL` теперь вызывают :class:`ValueError`, если заданное время ожидания для их конструктора равно нулю, чтобы предотвратить создание неблокирующего сокета. (Предоставлено Донхи На в :issue:`39259`.)

source: Added :const:`~os.CLD_KILLED` and :const:`~os.CLD_STOPPED` for :attr:`!si_code`. (Contributed by Donghee Na in :issue:`38493`.)
ru: Добавлены :const:`~os.CLD_KILLED` и :const:`~os.CLD_STOPPED` для :attr:`!si_code`. (Предоставлено Донхи На в :issue:`38493`.)

source: Exposed the Linux-specific :func:`os.pidfd_open` (:issue:`38692`) and :const:`os.P_PIDFD` (:issue:`38713`) for process management with file descriptors.
ru: Предоставлены специфичные для Linux :func:`os.pidfd_open` (:issue:`38692`) и :const:`os.P_PIDFD` (:issue:`38713`) для управления процессами с помощью файловых дескрипторов.

source: The :func:`os.unsetenv` function is now also available on Windows. (Contributed by Victor Stinner in :issue:`39413`.)
ru: Функция :func:`os.unsetenv` теперь доступна и в Windows. (Предоставлено Виктором Стиннером в :issue:`39413`.)

source: The :func:`os.putenv` and :func:`os.unsetenv` functions are now always available. (Contributed by Victor Stinner in :issue:`39395`.)
ru: Функции :func:`os.putenv` и :func:`os.unsetenv` теперь доступны всегда. (Предоставлено Виктором Стиннером в :issue:`39395`.)

source: Added :func:`os.waitstatus_to_exitcode` function: convert a wait status to an exit code. (Contributed by Victor Stinner in :issue:`40094`.)
ru: Добавлена ​​функция :func:`os.waitstatus_to_exitcode`: преобразует статус ожидания в код выхода. (Предоставлено Виктором Стиннером в :issue:`40094`.)

source: Added :meth:`pathlib.Path.readlink` which acts similarly to :func:`os.readlink`. (Contributed by Girts Folkmanis in :issue:`30618`)
ru: Добавлен :meth:`pathlib.Path.readlink`, который действует аналогично :func:`os.readlink`. (Предоставлено Гиртсом Фолкманисом в :issue:`30618`)

source: On Windows now :class:`~pdb.Pdb` supports ``~/.pdbrc``. (Contributed by Tim Hopper and Dan Lidral-Porter in :issue:`20523`.)
ru: В Windows теперь :class:`~pdb.Pdb` поддерживает ``~/.pdbrc``. (Предоставлено Тимом Хоппером и Дэном Лидралом-Портером в :issue:`20523`.)

source: :class:`~poplib.POP3` and :class:`~poplib.POP3_SSL` now raise a :class:`ValueError` if the given timeout for their constructor is zero to prevent the creation of a non-blocking socket. (Contributed by Donghee Na in :issue:`39259`.)
ru: :class:`~poplib.POP3` и :class:`~poplib.POP3_SSL` теперь вызывают :class:`ValueError`, если заданное время ожидания для их конструктора равно нулю, чтобы предотвратить создание неблокирующего сокета. (Предоставлено Донхи На в :issue:`39259`.)

source: :mod:`pprint` can now pretty-print :class:`types.SimpleNamespace`. (Contributed by Carl Bordum Hansen in :issue:`37376`.)
ru: :mod:`pprint` теперь может красиво печатать :class:`types.SimpleNamespace`. (Предоставлено Карлом Бордумом Хансеном в :issue:`37376`.)

source: The documentation string is now shown not only for class, function, method etc, but for any object that has its own :attr:`~definition.__doc__` attribute. (Contributed by Serhiy Storchaka in :issue:`40257`.)
ru: Строка документации теперь отображается не только для класса, функции, метода и т. д., но и для любого объекта, имеющего собственный атрибут :attr:`~definition.__doc__`. (Предоставлено Сергеем Сторчакой в ​​:issue:`40257`.)

source: random
ru: случайный

source: Added a new :attr:`random.Random.randbytes` method: generate random bytes. (Contributed by Victor Stinner in :issue:`40286`.)
ru: Добавлен новый метод :attr:`random.Random.randbytes`: генерировать случайные байты. (Предоставлено Виктором Стиннером в :issue:`40286`.)

source: signal
ru: сигнал

source: Exposed the Linux-specific :func:`signal.pidfd_send_signal` for sending to signals to a process using a file descriptor instead of a pid. (:issue:`38712`)
ru: Предоставлена ​​специфичная для Linux :func:`signal.pidfd_send_signal` для отправки сигналов процессу с использованием файлового дескриптора вместо pid. (:issue:`38712`)

source: :class:`~smtplib.SMTP` and :class:`~smtplib.SMTP_SSL` now raise a :class:`ValueError` if the given timeout for their constructor is zero to prevent the creation of a non-blocking socket. (Contributed by Donghee Na in :issue:`39259`.)
ru: :class:`~smtplib.SMTP` и :class:`~smtplib.SMTP_SSL` теперь вызывают :class:`ValueError`, если заданное время ожидания для их конструктора равно нулю, чтобы предотвратить создание неблокирующего сокета. (Предоставлено Донхи На в :issue:`39259`.)

source: :class:`~smtplib.LMTP` constructor now has an optional *timeout* parameter. (Contributed by Donghee Na in :issue:`39329`.)
ru: Конструктор :class:`~smtplib.LMTP` теперь имеет необязательный параметр *timeout*. (Предоставлено Донхи На в :issue:`39329`.)

source: socket
ru: сокет

source: The :mod:`socket` module now exports the :const:`~socket.CAN_RAW_JOIN_FILTERS` constant on Linux 4.1 and greater. (Contributed by Stefan Tatschner and Zackery Spytz in :issue:`25780`.)
ru: Модуль :mod:`socket` теперь экспортирует константу :const:`~socket.CAN_RAW_JOIN_FILTERS` в Linux 4.1 и более поздних версиях. (Предоставлено Стефаном Татшнером и Закери Шпитцем в :issue:`25780`.)

source: The socket module now supports the :const:`~socket.CAN_J1939` protocol on platforms that support it. (Contributed by Karl Ding in :issue:`40291`.)
ru: Модуль сокета теперь поддерживает протокол :const:`~socket.CAN_J1939` на платформах, которые его поддерживают. (Предоставлено Карлом Дином в :issue:`40291`.)

source: The socket module now has the :func:`socket.send_fds` and :func:`socket.recv_fds` functions. (Contributed by Joannah Nanjekye, Shinya Okano and Victor Stinner in :issue:`28724`.)
ru: Модуль сокета теперь имеет функции :func:`socket.send_fds` и :func:`socket.recv_fds`. (Предоставлено Джоанной Нанджеке, Шинья Окано и Виктором Стиннером в :issue:`28724`.)

source: time
ru: время

source: On AIX, :func:`~time.thread_time` is now implemented with ``thread_cputime()`` which has nanosecond resolution, rather than ``clock_gettime(CLOCK_THREAD_CPUTIME_ID)`` which has a resolution of 10 milliseconds. (Contributed by Batuhan Taskaya in :issue:`40192`)
ru: В AIX :func:`~time.thread_time` теперь реализован с помощью ``thread_cputime()``, который имеет наносекундное разрешение, а не `` clock_gettime(CLOCK_THREAD_CPUTIME_ID)``, который имеет разрешение 10 миллисекунд. (Предоставлено Батуханом Таской в ​​:issue:`40192`)
