Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/whatsnew/3.9.po
Languages: ru

source: The presence of newline or tab characters in parts of a URL allows for some forms of attacks. Following the WHATWG specification that updates :rfc:`3986`, ASCII newline ``\n``, ``\r`` and tab ``\t`` characters are stripped from the URL by the parser in :mod:`urllib.parse` preventing such attacks. The removal characters are controlled by a new module level variable ``urllib.parse._UNSAFE_URL_BYTES_TO_REMOVE``. (See :gh:`88048`)
ru: Наличие символов новой строки или табуляции в частях URL-адреса допускает некоторые формы атак. В соответствии со спецификацией WHATWG, которая обновляет :rfc:`3986`, символы новой строки ASCII ``\n``, ``\r`` и табуляции ``\t`` удаляются из URL-адреса анализатором в :mod:` urllib.parse` предотвращает такие атаки. Символы удаления управляются новой переменной уровня модуля ``urllib.parse._UNSAFE_URL_BYTES_TO_REMOVE``. (См. :gh:`88048`)

source: Notable security feature in 3.9.14
ru: Заметная функция безопасности в версии 3.9.14.

source: Converting between :class:`int` and :class:`str` in bases other than 2 (binary), 4, 8 (octal), 16 (hexadecimal), or 32 such as base 10 (decimal) now raises a :exc:`ValueError` if the number of digits in string form is above a limit to avoid potential denial of service attacks due to the algorithmic complexity. This is a mitigation for :cve:`2020-10735`. This limit can be configured or disabled by environment variable, command line flag, or :mod:`sys` APIs. See the :ref:`integer string conversion length limitation <int_max_str_digits>` documentation. The default limit is 4300 digits in string form.
ru: Преобразование между :class:`int` и :class:`str` в системах счисления, отличных от 2 (двоичная), 4, 8 (восьмеричная), 16 (шестнадцатеричная) или 32, например, 10 (десятичная), теперь вызывает :exc :`ValueError`, если количество цифр в строковой форме превышает ограничение, чтобы избежать потенциальных атак типа «отказ в обслуживании» из-за сложности алгоритма. Это смягчение последствий :cve:`2020-10735`. Это ограничение можно настроить или отключить с помощью переменной среды, флага командной строки или API :mod:`sys`. См. документацию по ограничению длины преобразования целочисленной строки <int_max_str_digits>`. Ограничение по умолчанию — 4300 цифр в строковой форме.

source: Notable changes in 3.9.17
ru: Заметные изменения в 3.9.17

source: The extraction methods in :mod:`tarfile`, and :func:`shutil.unpack_archive`, have a new a *filter* argument that allows limiting tar features than may be surprising or dangerous, such as creating files outside the destination directory. See :ref:`tarfile-extraction-filter` for details. In Python 3.12, use without the *filter* argument will show a :exc:`DeprecationWarning`. In Python 3.14, the default will switch to ``'data'``. (Contributed by Petr Viktorin in :pep:`706`.)
ru: Методы извлечения в :mod:`tarfile` и :func:`shutil.unpack_archive` имеют новый аргумент *filter*, который позволяет ограничить возможности tar, которые могут быть неожиданными или опасными, например создание файлов вне каталога назначения. Подробности смотрите в :ref:`tarfile-extraction-filter`. В Python 3.12 использование без аргумента *filter* приведет к появлению :exc:`DeprecationWarning`. В Python 3.14 значение по умолчанию переключится на ``'data'``. (Предоставлено Петром Викториным в :pep:`706`.)
