Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/whatsnew/3.9.po
Languages: ru

source: The old :mod:`plistlib` API has been removed, it was deprecated since Python 3.4. Use the :func:`~plistlib.load`, :func:`~plistlib.loads`, :func:`~plistlib.dump`, and :func:`~plistlib.dumps` functions. Additionally, the *use_builtin_types* parameter was removed, standard :class:`bytes` objects are always used instead. (Contributed by Jon Janzen in :issue:`36409`.)
ru: Старый API :mod:`plistlib` был удален, он устарел с версии Python 3.4. Используйте функции :func:`~plistlib.load`, :func:`~plistlib.loads`, :func:`~plistlib.dump` и :func:`~plistlib.dumps`. Кроме того, был удален параметр *use_builtin_types*, вместо него всегда используются стандартные объекты :class:`bytes`. (Предоставлено Джоном Янзеном в :issue:`36409`.)

source: The C function ``PyGen_NeedsFinalizing`` has been removed. It was not documented, tested, or used anywhere within CPython after the implementation of :pep:`442`. Patch by Joannah Nanjekye. (Contributed by Joannah Nanjekye in :issue:`15088`)
ru: Функция C PyGen_NeedsFinalizing была удалена. Он не документировался, не тестировался и не использовался где-либо в CPython после реализации :pep:`442`. Патч от Джоанны Нанджеки. (Предоставлено Джоанной Нанжекье в :issue:`15088`)

source: ``base64.encodestring()`` and ``base64.decodestring()``, aliases deprecated since Python 3.1, have been removed: use :func:`base64.encodebytes` and :func:`base64.decodebytes` instead. (Contributed by Victor Stinner in :issue:`39351`.)
ru: ``base64.encodestring()`` и ``base64.decodestring()``, псевдонимы, устаревшие, начиная с Python 3.1, были удалены: вместо них используйте :func:`base64.encodebytes` и :func:`base64.decodebytes`. (Предоставлено Виктором Стиннером в :issue:`39351`.)

source: ``fractions.gcd()`` function has been removed, it was deprecated since Python 3.5 (:issue:`22486`): use :func:`math.gcd` instead. (Contributed by Victor Stinner in :issue:`39350`.)
ru: Функция Fractions.gcd() удалена, она устарела начиная с Python 3.5 (:issue:`22486`): вместо нее используйте :func:`math.gcd`. (Предоставлено Виктором Стиннером в :issue:`39350`.)

source: The *buffering* parameter of :class:`bz2.BZ2File` has been removed. Since Python 3.0, it was ignored and using it emitted a :exc:`DeprecationWarning`. Pass an open file object to control how the file is opened. (Contributed by Victor Stinner in :issue:`39357`.)
ru: Параметр *buffering* файла :class:`bz2.BZ2File` был удален. Начиная с Python 3.0, он игнорировался, и при его использовании выдавалось :exc:`DeprecationWarning`. Передайте объект открытого файла, чтобы контролировать способ открытия файла. (Предоставлено Виктором Стиннером в :issue:`39357`.)

source: The *encoding* parameter of :func:`json.loads` has been removed. As of Python 3.1, it was deprecated and ignored; using it has emitted a :exc:`DeprecationWarning` since Python 3.8. (Contributed by Inada Naoki in :issue:`39377`)
ru: Параметр *encoding* файла :func:`json.loads` был удален. Начиная с Python 3.1, он устарел и игнорировался; его использование выдавало :exc:`DeprecationWarning` начиная с Python 3.8. (Предоставлено Инадой Наоки в :issue:`39377`)

source: ``with (await asyncio.lock):`` and ``with (yield from asyncio.lock):`` statements are not longer supported, use ``async with lock`` instead. The same is correct for ``asyncio.Condition`` and ``asyncio.Semaphore``. (Contributed by Andrew Svetlov in :issue:`34793`.)
ru: Операторы ``with (await asyncio.lock):`` и ``with (yield from asyncio.lock):`` больше не поддерживаются, вместо этого используйте ``async with lock``. То же самое верно для asyncio.Condition и asyncio.Semaphore. (Предоставлено Андреем Светловым в :issue:`34793`.)

source: The :func:`!sys.getcounts` function, the ``-X showalloccount`` command line option and the ``show_alloc_count`` field of the C structure :c:type:`PyConfig` have been removed. They required a special Python build by defining ``COUNT_ALLOCS`` macro. (Contributed by Victor Stinner in :issue:`39489`.)
ru: Функция :func:`!sys.getcounts`, опция командной строки ``-X showalloccount`` и поле ``show_alloc_count`` структуры C :c:type:`PyConfig` были удалены. Им потребовалась специальная сборка Python с определением макроса COUNT_ALLOCS. (Предоставлено Виктором Стиннером в :issue:`39489`.)

source: The ``_field_types`` attribute of the :class:`typing.NamedTuple` class has been removed. It was deprecated since Python 3.8. Use the ``__annotations__`` attribute instead. (Contributed by Serhiy Storchaka in :issue:`40182`.)
ru: Атрибут ``_field_types`` класса :class:`typing.NamedTuple` был удален. Он устарел с Python 3.8. Вместо этого используйте атрибут ``__annotations__``. (Предоставлено Сергеем Сторчакой в ​​:issue:`40182`.)

source: The :meth:`!symtable.SymbolTable.has_exec` method has been removed. It was deprecated since 2006, and only returning ``False`` when it's called. (Contributed by Batuhan Taskaya in :issue:`40208`)
ru: Метод :meth:`!symtable.SymbolTable.has_exec` был удален. Он устарел с 2006 года и возвращает False только при вызове. (Предоставлено Батуханом Таской в ​​:issue:`40208`)

source: The :meth:`!asyncio.Task.current_task` and :meth:`!asyncio.Task.all_tasks` have been removed. They were deprecated since Python 3.7 and you can use :func:`asyncio.current_task` and :func:`asyncio.all_tasks` instead. (Contributed by Rémi Lapeyre in :issue:`40967`)
ru: :meth:`!asyncio.Task.current_task` и :meth:`!asyncio.Task.all_tasks` были удалены. Они устарели, начиная с Python 3.7, и вместо них вы можете использовать :func:`asyncio.current_task` и :func:`asyncio.all_tasks`. (Предоставлено Реми Лапейром в :issue:`40967`)

source: The ``unescape()`` method in the :class:`html.parser.HTMLParser` class has been removed (it was deprecated since Python 3.4). :func:`html.unescape` should be used for converting character references to the corresponding unicode characters.
ru: Метод ``unescape()`` в классе :class:`html.parser.HTMLParser` был удален (он устарел, начиная с Python 3.4). :func:`html.unescape` следует использовать для преобразования ссылок на символы в соответствующие символы Юникода.

source: Porting to Python 3.9
ru: Портирование на Python 3.9

source: This section lists previously described changes and other bugfixes that may require changes to your code.
ru: В этом разделе перечислены ранее описанные изменения и другие исправления ошибок, которые могут потребовать внесения изменений в ваш код.

source: Changes in the Python API
ru: Изменения в API Python

source: :func:`__import__` and :func:`importlib.util.resolve_name` now raise :exc:`ImportError` where it previously raised :exc:`ValueError`. Callers catching the specific exception type and supporting both Python 3.9 and earlier versions will need to catch both using ``except (ImportError, ValueError):``.
ru: :func:`__import__` и :func:`importlib.util.resolve_name` теперь вызывают :exc:`ImportError` там, где ранее вызывалось :exc:`ValueError`. Вызывающие программы, перехватывающие определенный тип исключения и поддерживающие Python 3.9 и более ранние версии, должны будут перехватывать оба исключения, используя ``кроме (ImportError, ValueError):``.

source: The :mod:`venv` activation scripts no longer special-case when ``__VENV_PROMPT__`` is set to ``""``.
ru: Скрипты активации :mod:`venv` больше не являются особым случаем, когда для ``__VENV_PROMPT__`` установлено значение ``""``.

source: The :meth:`select.epoll.unregister` method no longer ignores the :const:`~errno.EBADF` error. (Contributed by Victor Stinner in :issue:`39239`.)
ru: Метод :meth:`select.epoll.unregister` больше не игнорирует ошибку :const:`~errno.EBADF`. (Предоставлено Виктором Стиннером в :issue:`39239`.)

source: The *compresslevel* parameter of :class:`bz2.BZ2File` became keyword-only, since the *buffering* parameter has been removed. (Contributed by Victor Stinner in :issue:`39357`.)
ru: Параметр *compresslevel* файла :class:`bz2.BZ2File` стал доступным только по ключевым словам, поскольку параметр *buffering* был удален. (Предоставлено Виктором Стиннером в :issue:`39357`.)

source: Simplified AST for subscription. Simple indices will be represented by their value, extended slices will be represented as tuples. ``Index(value)`` will return a ``value`` itself, ``ExtSlice(slices)`` will return ``Tuple(slices, Load())``. (Contributed by Serhiy Storchaka in :issue:`34822`.)
ru: Упрощенный AST для подписки. Простые индексы будут представлены их значениями, расширенные срезы — кортежами. ``Index(value)`` вернет само ``значение``, ``ExtSlice(slices)`` вернет ``Tuple(slices, Load())``. (Предоставлено Сергеем Сторчакой в ​​:issue:`34822`.)

source: The :mod:`importlib` module now ignores the :envvar:`PYTHONCASEOK` environment variable when the :option:`-E` or :option:`-I` command line options are being used.
ru: Модуль :mod:`importlib` теперь игнорирует переменную среды :envvar:`PYTHONCASEOK`, когда используются параметры командной строки :option:`-E` или :option:`-I`.

source: The *encoding* parameter has been added to the classes :class:`ftplib.FTP` and :class:`ftplib.FTP_TLS` as a keyword-only parameter, and the default encoding is changed from Latin-1 to UTF-8 to follow :rfc:`2640`.
ru: Параметр *encoding* был добавлен в классы :class:`ftplib.FTP` и :class:`ftplib.FTP_TLS` как параметр, содержащий только ключевые слова, а кодировка по умолчанию изменена с Latin-1 на UTF-8 на следуйте :rfc:`2640`.

source: :meth:`asyncio.loop.shutdown_default_executor` has been added to :class:`~asyncio.AbstractEventLoop`, meaning alternative event loops that inherit from it should have this method defined. (Contributed by Kyle Stanley in :issue:`34037`.)
ru: :meth:`asyncio.loop.shutdown_default_executor` был добавлен в :class:`~asyncio.AbstractEventLoop`, что означает, что альтернативные циклы событий, которые наследуются от него, должны иметь этот метод. (Предоставлено Кайлом Стэнли в :issue:`34037`.)

source: The constant values of future flags in the :mod:`__future__` module is updated in order to prevent collision with compiler flags. Previously ``PyCF_ALLOW_TOP_LEVEL_AWAIT`` was clashing with ``CO_FUTURE_DIVISION``. (Contributed by Batuhan Taskaya in :issue:`39562`)
ru: Постоянные значения будущих флагов в модуле :mod:`__future__` обновляются, чтобы предотвратить конфликт с флагами компилятора. Ранее PyCF_ALLOW_TOP_LEVEL_AWAIT конфликтовал с CO_FUTURE_DIVISION. (Предоставлено Батуханом Таской в ​​:issue:`39562`)

source: ``array('u')`` now uses :c:type:`wchar_t` as C type instead of ``Py_UNICODE``. This change doesn't affect to its behavior because ``Py_UNICODE`` is alias of :c:type:`wchar_t` since Python 3.3. (Contributed by Inada Naoki in :issue:`34538`.)
ru: ``array('u')`` теперь использует :c:type:`wchar_t` в качестве типа C вместо ``Py_UNICODE``. Это изменение не влияет на его поведение, поскольку ``Py_UNICODE`` является псевдонимом :c:type:`wchar_t`, начиная с Python 3.3. (Предоставлено Инадой Наоки в :issue:`34538`.)

source: The :func:`logging.getLogger` API now returns the root logger when passed the name ``'root'``, whereas previously it returned a non-root logger named ``'root'``. This could affect cases where user code explicitly wants a non-root logger named ``'root'``, or instantiates a logger using ``logging.getLogger(__name__)`` in some top-level module called ``'root.py'``. (Contributed by Vinay Sajip in :issue:`37742`.)
ru: API :func:`logging.getLogger` теперь возвращает корневой регистратор при передаче имени ``'root'``, тогда как раньше он возвращал некорневой регистратор с именем ``'root'``. Это может повлиять на случаи, когда пользовательский код явно требует наличия средства ведения журнала без полномочий root с именем «root» или создает экземпляр средства ведения журнала с помощью «logging.getLogger(__name__)» в каком-либо модуле верхнего уровня под названием «root». py'``. (Предоставлено Винаем Саджипом в :issue:`37742`.)

source: Division handling of :class:`~pathlib.PurePath` now returns :data:`NotImplemented` instead of raising a :exc:`TypeError` when passed something other than an instance of ``str`` or :class:`~pathlib.PurePath`. This allows creating compatible classes that don't inherit from those mentioned types. (Contributed by Roger Aiudi in :issue:`34775`).
ru: Обработка разделения :class:`~pathlib.PurePath` теперь возвращает :data:`NotImplemented` вместо вызова :exc:`TypeError`, когда передается что-то отличное от экземпляра ``str`` или :class:`~pathlib .PurePath`. Это позволяет создавать совместимые классы, которые не наследуются от упомянутых типов. (Предоставлено Роджером Айуди в :issue:`34775`).

source: Starting with Python 3.9.5 the :mod:`ipaddress` module no longer accepts any leading zeros in IPv4 address strings. Leading zeros are ambiguous and interpreted as octal notation by some libraries. For example the legacy function :func:`socket.inet_aton` treats leading zeros as octal notatation. glibc implementation of modern :func:`~socket.inet_pton` does not accept any leading zeros. (Contributed by Christian Heimes in :issue:`36384`).
ru: Начиная с Python 3.9.5, модуль :mod:`ipaddress` больше не принимает ведущие нули в строках адреса IPv4. Ведущие нули неоднозначны и некоторыми библиотеками интерпретируются как восьмеричная запись. Например, устаревшая функция :func:`socket.inet_aton` рассматривает ведущие нули как восьмеричную запись. Реализация современного :func:`~socket.inet_pton` в glibc не принимает ведущие нули. (Предоставлено Кристианом Хаймсом в :issue:`36384`).

source: :func:`codecs.lookup` now normalizes the encoding name the same way as :func:`encodings.normalize_encoding`, except that :func:`codecs.lookup` also converts the name to lower case. For example, ``"latex+latin1"`` encoding name is now normalized to ``"latex_latin1"``. (Contributed by Jordon Xu in :issue:`37751`.)
ru: :func:`codecs.lookup` теперь нормализует имя кодировки так же, как :func:`encodings.normalize_encoding`, за исключением того, что :func:`codecs.lookup` также преобразует имя в нижний регистр. Например, имя кодировки ``"latex+latin1"`` теперь нормализуется до ``"latex_latin1"``. (Предоставлено Джорданом Сюй в :issue:`37751`.)

source: Changes in the C API
ru: Изменения в C API

source: Instances of :ref:`heap-allocated types <heap-types>` (such as those created with :c:func:`PyType_FromSpec` and similar APIs) hold a reference to their type object since Python 3.8. As indicated in the "Changes in the C API" of Python 3.8, for the vast majority of cases, there should be no side effect but for types that have a custom :c:member:`~PyTypeObject.tp_traverse` function, ensure that all custom ``tp_traverse`` functions of heap-allocated types visit the object's type.
ru: Экземпляры :ref:`выделенных в куче типов <heap-types>` (например, созданных с помощью :c:func:`PyType_FromSpec` и подобных API) содержат ссылку на свой объект типа, начиная с Python 3.8. Как указано в разделе «Изменения в C API» Python 3.8, в подавляющем большинстве случаев побочных эффектов быть не должно, но для типов, которые имеют специальную функцию :c:member:`~PyTypeObject.tp_traverse`, убедитесь, что все пользовательские функции ``tp_traverse`` типов, выделяемых в куче, обращаются к типу объекта.

source: If your traverse function delegates to ``tp_traverse`` of its base class (or another type), ensure that ``Py_TYPE(self)`` is visited only once. Note that only :ref:`heap type <heap-types>` are expected to visit the type in ``tp_traverse``.
ru: Если ваша функция перемещения делегирует ``tp_traverse`` своего базового класса (или другого типа), убедитесь, что ``Py_TYPE(self)`` посещается только один раз. Обратите внимание, что только :ref:`heap type <heap-types>` должен посещать тип в ``tp_traverse``.

source: For example, if your ``tp_traverse`` function includes:
ru: Например, если ваша функция tp_traverse включает в себя:

source: then add:
ru: затем добавьте:

source: (See :issue:`35810` and :issue:`40217` for more information.)
ru: (Дополнительную информацию см. в :issue:`35810` и :issue:`40217`.)

source: The functions ``PyEval_CallObject``, ``PyEval_CallFunction``, ``PyEval_CallMethod`` and ``PyEval_CallObjectWithKeywords`` are deprecated. Use :c:func:`PyObject_Call` and its variants instead. (See more details in :issue:`29548`.)
ru: функции ``PyEval_CallObject`` , ``PyEval_CallFunction``, ``PyEval_CallMethod`` и ``PyEval_CallObjectWithKeywords`` - это устарело. Вместо этого используйте :c:func:`PyObject_Call` и его варианты. (Более подробную информацию см. в :issue:`29548`.)

source: CPython bytecode changes
ru: Изменения в байт-коде CPython

source: The :opcode:`LOAD_ASSERTION_ERROR` opcode was added for handling the :keyword:`assert` statement. Previously, the assert statement would not work correctly if the :exc:`AssertionError` exception was being shadowed. (Contributed by Zackery Spytz in :issue:`34880`.)
ru: Опкод :opcode:`LOAD_ASSERTION_ERROR` был добавлен для обработки оператора :keyword:`assert`. Раньше оператор утверждения не работал корректно, если скрывалось исключение :exc:`AssertionError`. (Предоставлено Закери Шпитцем в :issue:`34880`.)

source: The :opcode:`COMPARE_OP` opcode was split into four distinct instructions:
ru: Код операции :opcode:`COMPARE_OP` был разделен на четыре отдельные инструкции:

source: ``COMPARE_OP`` for rich comparisons
ru: ``COMPARE_OP`` для расширенных сравнений.

source: ``IS_OP`` for 'is' and 'is not' tests
ru: ``IS_OP`` для тестов "есть" и "нет"

source: ``CONTAINS_OP`` for 'in' and 'not in' tests
ru: ``CONTAINS_OP`` для тестов «в» и «не в»

source: ``JUMP_IF_NOT_EXC_MATCH`` for checking exceptions in 'try-except' statements.
ru: ``JUMP_IF_NOT_EXC_MATCH`` для проверки исключений в операторах Try-Exception.

source: (Contributed by Mark Shannon in :issue:`39156`.)
ru: (Предоставлено Марком Шенноном в :issue:`39156`.)

source: Build Changes
ru: Изменения сборки

source: Added ``--with-platlibdir`` option to the ``configure`` script: name of the platform-specific library directory, stored in the new :data:`sys.platlibdir` attribute. See :data:`sys.platlibdir` attribute for more information. (Contributed by Jan Matějek, Matěj Cepl, Charalampos Stratakis and Victor Stinner in :issue:`1294959`.)
ru: В скрипт ``configure`` добавлена ​​опция ``--with-platlibdir``: имя каталога библиотеки для конкретной платформы, хранящееся в новом атрибуте :data:`sys.platlibdir`. Дополнительную информацию см. в атрибуте :data:`sys.platlibdir`. (Предоставлено Яном Матеком, Матеем Чеплом, Харалампосом Стратакисом и Виктором Стиннером в :issue:`1294959`.)

source: The ``COUNT_ALLOCS`` special build macro has been removed. (Contributed by Victor Stinner in :issue:`39489`.)
ru: Специальный макрос сборки ``COUNT_ALLOCS`` был удален. (Предоставлено Виктором Стиннером в :issue:`39489`.)

source: On non-Windows platforms, the :c:func:`!setenv` and :c:func:`!unsetenv` functions are now required to build Python. (Contributed by Victor Stinner in :issue:`39395`.)
ru: На платформах, отличных от Windows, функции :c:func:`!setenv` и :c:func:`!unsetenv` теперь необходимы для сборки Python. (Предоставлено Виктором Стиннером в :issue:`39395`.)

source: On non-Windows platforms, creating ``bdist_wininst`` installers is now officially unsupported. (See :issue:`10945` for more details.)
ru: На платформах, отличных от Windows, создание установщиков bdist_wininst теперь официально не поддерживается. (Подробнее см. в :issue:`10945`.)

source: When building Python on macOS from source, ``_tkinter`` now links with non-system Tcl and Tk frameworks if they are installed in ``/Library/Frameworks``, as had been the case on older releases of macOS. If a macOS SDK is explicitly configured, by using :option:`--enable-universalsdk` or ``-isysroot``, only the SDK itself is searched. The default behavior can still be overridden with ``--with-tcltk-includes`` and ``--with-tcltk-libs``. (Contributed by Ned Deily in :issue:`34956`.)
ru: При сборке Python в macOS из исходного кода ``_tkinter`` теперь связывается с несистемными платформами Tcl и Tk, если они установлены в ``/Library/Frameworks``, как это было в старых выпусках macOS. Если SDK для macOS настроен явно с помощью :option:`--enable-universalsdk` или ``-isysroot``, поиск выполняется только в самом SDK. Поведение по умолчанию все еще можно переопределить с помощью ``--with-tcltk-includes`` и ``--with-tcltk-libs``. (Предоставлено Недом Дейли в :issue:`34956`.)

source: Python can now be built for Windows 10 ARM64. (Contributed by Steve Dower in :issue:`33125`.)
ru: Python теперь можно собрать для Windows 10 ARM64. (Предоставлено Стивом Дауэром в :issue:`33125`.)

source: Some individual tests are now skipped when ``--pgo`` is used. The tests in question increased the PGO task time significantly and likely didn't help improve optimization of the final executable. This speeds up the task by a factor of about 15x. Running the full unit test suite is slow. This change may result in a slightly less optimized build since not as many code branches will be executed. If you are willing to wait for the much slower build, the old behavior can be restored using ``./configure [..] PROFILE_TASK="-m test --pgo-extended"``. We make no guarantees as to which PGO task set produces a faster build. Users who care should run their own relevant benchmarks as results can depend on the environment, workload, and compiler tool chain. (See :issue:`36044` and :issue:`37707` for more details.)
ru: Некоторые отдельные тесты теперь пропускаются при использовании ``--pgo``. Рассматриваемые тесты значительно увеличили время выполнения задачи PGO и, вероятно, не помогли улучшить оптимизацию конечного исполняемого файла. Это ускоряет задачу примерно в 15 раз. Запуск полного набора модульных тестов происходит медленно. Это изменение может привести к несколько менее оптимизированной сборке, поскольку будет выполняться не так много ветвей кода. Если вы готовы подождать гораздо более медленной сборки, старое поведение можно восстановить с помощью ``./configure [..] PROFILE_TASK="-m test --pgo-extended"``. Мы не даем никаких гарантий относительно того, какой набор задач PGO обеспечит более быструю сборку. Заинтересованным пользователям следует провести собственные соответствующие тесты, поскольку результаты могут зависеть от среды, рабочей нагрузки и цепочки инструментов компилятора. (Подробнее см. в :issue:`36044` и :issue:`37707`.)

source: C API Changes
ru: Изменения в C API

source: :pep:`573`: Added :c:func:`PyType_FromModuleAndSpec` to associate a module with a class; :c:func:`PyType_GetModule` and :c:func:`PyType_GetModuleState` to retrieve the module and its state; and :c:type:`PyCMethod` and :c:macro:`METH_METHOD` to allow a method to access the class it was defined in. (Contributed by Marcel Plch and Petr Viktorin in :issue:`38787`.)
ru: :pep:`573`: Добавлен :c:func:`PyType_FromModuleAndSpec` для связывания модуля с классом; :c:func:`PyType_GetModule` и :c:func:`PyType_GetModuleState` для получения модуля и его состояния; и :c:type:`PyCMethod` и :c:macro:`METH_METHOD`, чтобы разрешить методу доступ к классу, в котором он был определен. (Внесено Марселем Плхом и Петром Викторином в :issue:`38787`.)

source: Added :c:func:`PyFrame_GetCode` function: get a frame code. Added :c:func:`PyFrame_GetBack` function: get the frame next outer frame. (Contributed by Victor Stinner in :issue:`40421`.)
ru: Добавлена ​​функция :c:func:`PyFrame_GetCode`: получение кода кадра. Добавлена ​​функция :c:func:`PyFrame_GetBack`: получение следующего внешнего кадра. (Предоставлено Виктором Стиннером в :issue:`40421`.)

source: Added :c:func:`PyFrame_GetLineNumber` to the limited C API. (Contributed by Victor Stinner in :issue:`40421`.)
ru: Добавлен :c:func:`PyFrame_GetLineNumber` в API Limited C. (Предоставлено Виктором Стиннером в :issue:`40421`.)
