Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/reference/executionmodel.po
Languages: ru

source: Execution model
ru: Модель исполнения.

source: Structure of a program
ru: Структура программы.

source: A Python program is constructed from code blocks. A :dfn:`block` is a piece of Python program text that is executed as a unit. The following are blocks: a module, a function body, and a class definition. Each command typed interactively is a block. A script file (a file given as standard input to the interpreter or specified as a command line argument to the interpreter) is a code block. A script command (a command specified on the interpreter command line with the :option:`-c` option) is a code block. A module run as a top level script (as module ``__main__``) from the command line using a :option:`-m` argument is also a code block. The string argument passed to the built-in functions :func:`eval` and :func:`exec` is a code block.
ru: Программа Python состоит из блоков кода. :dfn:`block` — это фрагмент текста программы Python, который выполняется как единое целое. Ниже приведены блоки: модуль, тело функции и определение класса. Каждая команда, введенная в интерактивном режиме, представляет собой блок. Файл сценария (файл, передаваемый интерпретатору в качестве стандартного ввода или указанный в качестве аргумента командной строки интерпретатора) представляет собой блок кода. Команда сценария (команда, указанная в командной строке интерпретатора с опцией :option:`-c`) представляет собой блок кода. Модуль, запускаемый как скрипт верхнего уровня (как модуль ``__main__``) из командной строки с использованием аргумента :option:`-m`, также является блоком кода. Строковый аргумент, передаваемый встроенным функциям :func:`eval` и :func:`exec`, представляет собой блок кода.

source: A code block is executed in an :dfn:`execution frame`. A frame contains some administrative information (used for debugging) and determines where and how execution continues after the code block's execution has completed.
ru: Блок кода выполняется в :dfn:`кадре исполнения<кадр исполнения>`. Кадр содержит служебную информацию (использующуюся для отладки), и определяет, где и как продолжается выполнение после завершения выполнения блока кода.

source: Naming and binding
ru: Именование и связывание.

source: Binding of names
ru: Связывание имён.

source: :dfn:`Names` refer to objects. Names are introduced by name binding operations.
ru: :dfn:'Имена' указывают на объекты. Имена вводятся операциями связывания имени.

source: The following constructs bind names:
ru: Следующие конструкции связывают имена:

source: formal parameters to functions,
ru: формальные параметры функций,

source: class definitions,
ru: определения классов,

source: function definitions,
ru: определения функций,

source: assignment expressions,
ru: выражения присваивания,

source: :ref:`targets <assignment>` that are identifiers if occurring in an assignment:
ru: :ref:`targets <assignment>`, которые являются идентификаторами, если встречаются в присваивании:

source: :keyword:`for` loop header,
ru: :keyword:`for` заголовок цикла,

source: after :keyword:`!as` in a :keyword:`with` statement, :keyword:`except` clause, :keyword:`except* <except_star>` clause, or in the as-pattern in structural pattern matching,
ru: после :keyword:`!as` в операторе :keyword:`with`, в предложении :keyword:`Exception`, в предложении :keyword:`Exception* <Exception_star>` или в шаблоне as при сопоставлении структурных шаблонов,

source: in a capture pattern in structural pattern matching
ru: в шаблоне захвата при сопоставлении структурных шаблонов

source: :ref:`type parameter lists <type-params>`.
ru: :ref:`списки параметров типа <type-params>`.

source: The :keyword:`!import` statement of the form ``from ... import *`` binds all names defined in the imported module, except those beginning with an underscore. This form may only be used at the module level.
ru: Оператор :keyword:`!import` в форме ``from ... import *`` связывает все имена, определенные в импортируемом модуле, за исключением тех, которые начинаются с подчеркивания. Эту форму можно использовать только на уровне модуля.

source: A target occurring in a :keyword:`del` statement is also considered bound for this purpose (though the actual semantics are to unbind the name).
ru: Цель назначения для инструкции ":keyword:`del`" также считается получившей назначение (хотя в действительности смысл в снятии связи с этого имени) .

source: Each assignment or import statement occurs within a block defined by a class or function definition or at the module level (the top-level code block).
ru: Любое назначение или импорт действует только в пределах блока класса, функции или модуля (он является самым высокоуровневым блоком кода) .

source: If a name is bound in a block, it is a local variable of that block, unless declared as :keyword:`nonlocal` or :keyword:`global`. If a name is bound at the module level, it is a global variable. (The variables of the module code block are local and global.) If a variable is used in a code block but not defined there, it is a :term:`free variable`.
ru: Если имя привязано к блоку, оно является локальной переменной этого блока, если только оно не объявлено как :keyword:`nonlocal` или :keyword:`global`. Если имя привязано на уровне модуля, это глобальная переменная. (Переменные блока кода модуля являются локальными и глобальными.) Если переменная используется в блоке кода, но не определена там, это :term:`свободная переменная`.

source: Each occurrence of a name in the program text refers to the :dfn:`binding` of that name established by the following name resolution rules.
ru: Каждое появление имени в тексте программы указывает на то, что назначено этому имени в данном самом внутреннем функциональном блоке.

source: Resolution of names
ru: Нахождение значения имени.

source: A :dfn:`scope` defines the visibility of a name within a block. If a local variable is defined in a block, its scope includes that block. If the definition occurs in a function block, the scope extends to any blocks contained within the defining one, unless a contained block introduces a different binding for the name.
ru: :dfn:`Область видимости<область видимости>` определяет видимость имени внутри блока. Если локальная переменная определена в блоке, то ее область видимости включает этот блок. Если это определение происходит в блоке функции, то ее область видимости распространяется на любые блоки, содержащиеся в данном блоке функции, если только содержащийся блок не вводит своё назначение данному имени.

source: When a name is used in a code block, it is resolved using the nearest enclosing scope. The set of all such scopes visible to a code block is called the block's :dfn:`environment`.
ru: Если имя упоминается в блоке кода, то его значение ищется последовательно переходя от одной области видимости к следующей непосредственно объемлющей до первой содержащей определение данного имени. Множество всех таких областей видимости, используемых блоком кода - называется :dfn:`окружение<окружением>` данного блока.

source: When a name is not found at all, a :exc:`NameError` exception is raised. If the current scope is a function scope, and the name refers to a local variable that has not yet been bound to a value at the point where the name is used, an :exc:`UnboundLocalError` exception is raised. :exc:`UnboundLocalError` is a subclass of :exc:`NameError`.
ru: Когда имя вообще не найдено - вызывается исключение ":exc:`NameError`" . Если текущая область видимости образована функцией и если искомое имя указывает на локальную переменную, до связывания которой исполнение функции ещё не дошло - вызывается исключение ":exc:`UnboundLocalError`" , которое является подклассом для ":exc:`NameError`" .

source: If a name binding operation occurs anywhere within a code block, all uses of the name within the block are treated as references to the current block. This can lead to errors when a name is used within a block before it is bound. This rule is subtle. Python lacks declarations and allows name binding operations to occur anywhere within a code block. The local variables of a code block can be determined by scanning the entire text of the block for name binding operations. See :ref:`the FAQ entry on UnboundLocalError <faq-unboundlocalerror>` for examples.
ru: Если операция привязки имени происходит где-нибудь внутри блока кода, все использования имени внутри блока рассматриваются как ссылки на текущий блок. Это может привести к ошибкам, если имя используется внутри блока до его привязки. Это правило тонкое. В Python отсутствуют объявления, и он позволяет выполнять операции привязки имен в любом месте блока кода. Локальные переменные блока кода можно определить путем сканирования всего текста блока на предмет операций привязки имени. Примеры см. в разделе часто задаваемых вопросов по UnboundLocalError <faq-unboundlocalerror>.

source: If the :keyword:`global` statement occurs within a block, all uses of the names specified in the statement refer to the bindings of those names in the top-level namespace. Names are resolved in the top-level namespace by searching the global namespace, i.e. the namespace of the module containing the code block, and the builtins namespace, the namespace of the module :mod:`builtins`. The global namespace is searched first. If the names are not found there, the builtins namespace is searched next. If the names are also not found in the builtins namespace, new variables are created in the global namespace. The global statement must precede all uses of the listed names.
ru: Если оператор :keyword:`global` встречается внутри блока, все использования имен, указанных в операторе, относятся к привязкам этих имен в пространстве имен верхнего уровня. Имена разрешаются в пространстве имен верхнего уровня путем поиска в глобальном пространстве имен, т. е. пространстве имен модуля, содержащего блок кода, и пространстве имен встроенных модулей, пространстве имен модуля :mod:`builtins`. Сначала выполняется поиск в глобальном пространстве имен. Если имена там не найдены, следующий поиск осуществляется во встроенном пространстве имен. Если имена также не найдены во встроенном пространстве имен, новые переменные создаются в глобальном пространстве имен. Глобальный оператор должен предшествовать любому использованию перечисленных имен.

source: The :keyword:`global` statement has the same scope as a name binding operation in the same block. If the nearest enclosing scope for a free variable contains a global statement, the free variable is treated as a global.
ru: Инструкция ":keyword:`global`" остаётся в силе в тех же рамках, в каких действует связывание имени, произведённое в том же блоке. Если не связанная в данном блоке переменная ("свободная") упоминается в любом месте этого же блока в инструкции ":keyword:`global`" , то эта переменная сразу считается глобальной.

source: The :keyword:`nonlocal` statement causes corresponding names to refer to previously bound variables in the nearest enclosing function scope. :exc:`SyntaxError` is raised at compile time if the given name does not exist in any enclosing function scope. :ref:`Type parameters <type-params>` cannot be rebound with the :keyword:`!nonlocal` statement.
ru: Оператор :keyword:`nonlocal` заставляет соответствующие имена ссылаться на ранее связанные переменные в ближайшей области охватывающей функции. :exc:`SyntaxError` возникает во время компиляции, если данное имя не существует ни в одной области охватывающей функции. :ref:`Параметры типа <type-params>` не могут быть повторно привязаны с помощью оператора :keyword:`!nonlocal`.

source: The namespace for a module is automatically created the first time a module is imported. The main module for a script is always called :mod:`__main__`.
ru: Пространство имён для модуля автоматически создаётся, когда модуль в первый раз импортируется. Главный модуль скрипта всегда называется ":mod:`__main__`" .

source: Class definition blocks and arguments to :func:`exec` and :func:`eval` are special in the context of name resolution. A class definition is an executable statement that may use and define names. These references follow the normal rules for name resolution with an exception that unbound local variables are looked up in the global namespace. The namespace of the class definition becomes the attribute dictionary of the class. The scope of names defined in a class block is limited to the class block; it does not extend to the code blocks of methods. This includes comprehensions and generator expressions, but it does not include :ref:`annotation scopes <annotation-scopes>`, which have access to their enclosing class scopes. This means that the following will fail::
ru: Блоки определения классов и аргументы :func:`exec` и :func:`eval` являются особыми в контексте разрешения имен. Определение класса — это исполняемый оператор, который может использовать и определять имена. Эти ссылки следуют обычным правилам разрешения имен, за исключением того, что несвязанные локальные переменные ищутся в глобальном пространстве имен. Пространство имен определения класса становится словарем атрибутов класса. Область имен, определенных в блоке классов, ограничена блоком классов; оно не распространяется на блоки кода методов. Это включает в себя понимания и выражения-генераторы, но не включает :ref:`области аннотаций <annotation-scopes>`, которые имеют доступ к областям своих включающих классов. Это означает, что следующее не удастся:

source: However, the following will succeed::
ru: Тем не менее, следующее будет успешным:

source: Annotation scopes
ru: Области аннотаций

source: :ref:`Type parameter lists <type-params>` and :keyword:`type` statements introduce *annotation scopes*, which behave mostly like function scopes, but with some exceptions discussed below. :term:`Annotations <annotation>` currently do not use annotation scopes, but they are expected to use annotation scopes in Python 3.13 when :pep:`649` is implemented.
ru: :ref:`Списки параметров типа <type-params>` и :keyword:`type` операторы вводят *области аннотаций*, которые ведут себя в основном как области функций, но с некоторыми исключениями, обсуждаемыми ниже. :term:`Аннотации <annotation>` в настоящее время не используют области аннотаций, но ожидается, что они будут использовать области аннотаций в Python 3.13, когда будет реализован :pep:`649`.

source: Annotation scopes are used in the following contexts:
ru: Области аннотаций используются в следующих контекстах:

source: Type parameter lists for :ref:`generic type aliases <generic-type-aliases>`.
ru: Списки параметров типа для :ref:`псевдонимов общего типа <generic-type-aliases>`.

source: Type parameter lists for :ref:`generic functions <generic-functions>`. A generic function's annotations are executed within the annotation scope, but its defaults and decorators are not.
ru: Введите списки параметров для :ref:`generic function <generic-functions>`. Аннотации универсальной функции выполняются в области аннотации, а ее значения по умолчанию и декораторы — нет.

source: Type parameter lists for :ref:`generic classes <generic-classes>`. A generic class's base classes and keyword arguments are executed within the annotation scope, but its decorators are not.
ru: Списки параметров типа для :ref:`универсальных классов <generic-classes>`. Базовые классы и ключевые аргументы универсального класса выполняются в области аннотации, а его декораторы — нет.

source: The bounds, constraints, and default values for type parameters (:ref:`lazily evaluated <lazy-evaluation>`).
ru: Границы, ограничения и значения по умолчанию для параметров типа (:ref:`лениво оцениваемые <lazy-evaluation>`).

source: The value of type aliases (:ref:`lazily evaluated <lazy-evaluation>`).
ru: Значение псевдонимов типов (:ref:`лениво оцениваемое <lazy-evaluation>`).

source: Annotation scopes differ from function scopes in the following ways:
ru: Области аннотаций отличаются от областей функций следующим образом:

source: Annotation scopes have access to their enclosing class namespace. If an annotation scope is immediately within a class scope, or within another annotation scope that is immediately within a class scope, the code in the annotation scope can use names defined in the class scope as if it were executed directly within the class body. This contrasts with regular functions defined within classes, which cannot access names defined in the class scope.
ru: Области аннотаций имеют доступ к пространству имен включающего их класса. Если область аннотации находится непосредственно в области класса или внутри другой области аннотации, которая находится непосредственно в области класса, код в области аннотации может использовать имена, определенные в области класса, как если бы он выполнялся непосредственно внутри тела класса. Это контрастирует с обычными функциями, определенными внутри классов, которые не могут получить доступ к именам, определенным в области действия класса.

source: Expressions in annotation scopes cannot contain :keyword:`yield`, ``yield from``, :keyword:`await`, or :token:`:= <python-grammar:assignment_expression>` expressions. (These expressions are allowed in other scopes contained within the annotation scope.)
ru: Выражения в областях аннотаций не могут содержать выражения :keyword:`yield`, ``yield from``, :keyword:`await` или :token:`:= <python-grammar:assignment_expression>`. (Эти выражения разрешены в других областях, содержащихся в области аннотации.)

source: Names defined in annotation scopes cannot be rebound with :keyword:`nonlocal` statements in inner scopes. This includes only type parameters, as no other syntactic elements that can appear within annotation scopes can introduce new names.
ru: Имена, определенные в областях аннотаций, не могут быть повторно связаны с операторами :keyword:`nonlocal` во внутренних областях. Сюда входят только параметры типа, поскольку никакие другие синтаксические элементы, которые могут появляться в областях аннотаций, не могут вводить новые имена.

source: While annotation scopes have an internal name, that name is not reflected in the :term:`qualified name` of objects defined within the scope. Instead, the :attr:`~definition.__qualname__` of such objects is as if the object were defined in the enclosing scope.
ru: Хотя области аннотаций имеют внутреннее имя, это имя не отражается в :term:`полном имени` объектов, определенных в этой области. Вместо этого :attr:`~definition.__qualname__` таких объектов выглядит так, как если бы объект был определен во внешней области видимости.

source: Annotation scopes were introduced in Python 3.12 as part of :pep:`695`.
ru: Области аннотаций были представлены в Python 3.12 как часть :pep:`695`.

source: Annotation scopes are also used for type parameter defaults, as introduced by :pep:`696`.
ru: Области аннотаций также используются для значений параметров типа по умолчанию, как это представлено в :pep:`696`.

source: Lazy evaluation
ru: Ленивая оценка

source: The values of type aliases created through the :keyword:`type` statement are *lazily evaluated*. The same applies to the bounds, constraints, and default values of type variables created through the :ref:`type parameter syntax <type-params>`. This means that they are not evaluated when the type alias or type variable is created. Instead, they are only evaluated when doing so is necessary to resolve an attribute access.
ru: Значения псевдонимов типов, созданных с помощью оператора :keyword:`type`, оцениваются *лениво*. То же самое относится к границам, ограничениям и значениям по умолчанию переменных типа, созданных с помощью синтаксиса параметра типа <type-params>. Это означает, что они не оцениваются при создании псевдонима типа или переменной типа. Вместо этого они оцениваются только тогда, когда это необходимо для разрешения доступа к атрибуту.

source: Example:
ru: Пример:

source: Here the exception is raised only when the ``__value__`` attribute of the type alias or the ``__bound__`` attribute of the type variable is accessed.
ru: Здесь исключение возникает только при доступе к атрибуту ``__value__`` псевдонима типа или атрибуту ``__bound__`` переменной типа.

source: This behavior is primarily useful for references to types that have not yet been defined when the type alias or type variable is created. For example, lazy evaluation enables creation of mutually recursive type aliases::
ru: Такое поведение в первую очередь полезно для ссылок на типы, которые еще не были определены при создании псевдонима типа или переменной типа. Например, ленивые вычисления позволяют создавать псевдонимы взаимно рекурсивных типов:

source: Lazily evaluated values are evaluated in :ref:`annotation scope <annotation-scopes>`, which means that names that appear inside the lazily evaluated value are looked up as if they were used in the immediately enclosing scope.
ru: Лениво вычисляемые значения оцениваются в :ref:`области аннотации <annotation-scopes>`, что означает, что имена, которые появляются внутри лениво вычисляемого значения, просматриваются так, как если бы они использовались в непосредственно охватывающей области.

source: Builtins and restricted execution
ru: Встроенные методы и запрещенное исполнение

source: Users should not touch ``__builtins__``; it is strictly an implementation detail. Users wanting to override values in the builtins namespace should :keyword:`import` the :mod:`builtins` module and modify its attributes appropriately.
ru: Пользователи не должны влазить в "``__builtins__``" - его содержание - это исключительно особенности реализации. Пользователи, желающие переопределить значения в этом встроенном пространстве имён должны импортировать модуль ":mod:`builtins`" и модифицировать соответственно его атрибуты.

source: The builtins namespace associated with the execution of a code block is actually found by looking up the name ``__builtins__`` in its global namespace; this should be a dictionary or a module (in the latter case the module's dictionary is used). By default, when in the :mod:`__main__` module, ``__builtins__`` is the built-in module :mod:`builtins`; when in any other module, ``__builtins__`` is an alias for the dictionary of the :mod:`builtins` module itself.
ru: Пространство имен встроенных функций, связанное с выполнением блока кода, фактически находится путем поиска имени ``__builtins__`` в его глобальном пространстве имен; это должен быть словарь или модуль (в последнем случае используется словарь модуля). По умолчанию в модуле :mod:`__main__` ``__builtins__`` является встроенным модулем :mod:`builtins`; в любом другом модуле ``__builtins__`` является псевдонимом словаря самого модуля :mod:`builtins`.

source: Interaction with dynamic features
ru: Взаимодействие с динамическими свойствами.

source: Name resolution of free variables occurs at runtime, not at compile time. This means that the following code will print 42::
ru: Поиск значения имени несвязанной переменной происходит во время исполнения, а не компиляции. Это значит, что следующий код напечатает 42 ::
