Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/reference/executionmodel.po
Languages: ru

source: The :func:`eval` and :func:`exec` functions do not have access to the full environment for resolving names. Names may be resolved in the local and global namespaces of the caller. Free variables are not resolved in the nearest enclosing namespace, but in the global namespace. [#]_ The :func:`exec` and :func:`eval` functions have optional arguments to override the global and local namespace. If only one namespace is specified, it is used for both.
ru: Функции ":func:`eval`" и ":func:`exec`" не имеют доступа ко всему окружению для интерпретации имён. Значения имён могут искаться в локальной и в глобальной областях имён относительно места вызова. Свободные переменные не ищутся в области имён одним уровнем выше, за исключением глобальной. (Это ограничение происходит от того, что код, исполняемый этими инструкциями не доступен во время компиляции данного модуля.) Функции ":func:`exec`" и ":func:`eval`" имеют необязательные аргументы для переопределения глобальной и локальной областей имён. Если задан только один аргумент, то он используется для обеих областей.

source: Exceptions
ru: Исключения

source: Exceptions are a means of breaking out of the normal flow of control of a code block in order to handle errors or other exceptional conditions. An exception is *raised* at the point where the error is detected; it may be *handled* by the surrounding code block or by any code block that directly or indirectly invoked the code block where the error occurred.
ru: Исключения являются средством прерывания нормального хода исполнения кода для обработки ошибок или других исключительных ситуаций. Исключение *возникает* в месте, где обнаружена ошибка; оно может быть *обработано* в текущем блоке кода или в любом блоке кода, в котором прямо или косвенно вызван тот блок кода, в котором возникла ошибка.

source: The Python interpreter raises an exception when it detects a run-time error (such as division by zero). A Python program can also explicitly raise an exception with the :keyword:`raise` statement. Exception handlers are specified with the :keyword:`try` ... :keyword:`except` statement. The :keyword:`finally` clause of such a statement can be used to specify cleanup code which does not handle the exception, but is executed whether an exception occurred or not in the preceding code.
ru: Интерпретатор Питона исполняет исключение, когда обнаруживает ошибку исполнения (например деление на ноль) . Программа на Питоне также может явно вызывать исключение инструкцией ":keyword:`raise`" . Обработчики исключений задаются инструкцией ":keyword:`try` ... :keyword:`except`" . Отдел ":keyword:`finally`" этой инструкции может быть использован для задания кода, который исполняется независимо от того, произошло ли исключение в соответствующем блоке ":keyword:`try` ... :keyword:`except`" ( и который не является функцией, получающей в качестве аргумента идентификатор ошибки, и не является собственно обработчиком ошибки) .

source: Python uses the "termination" model of error handling: an exception handler can find out what happened and continue execution at an outer level, but it cannot repair the cause of the error and retry the failing operation (except by re-entering the offending piece of code from the top).
ru: Питон использует ограничительную модель обработки ошибок: обработчик исключения может проанализировать ситуацию и продолжить исполнение за пределами блока ":keyword:`try` ... :keyword:`except`" , но не может исправить причину ошибки и всё-таки выполнить сбойную операцию (не считая того, чтобы вызвать весь проблемный фрагмент с самого начала) .

source: When an exception is not handled at all, the interpreter terminates execution of the program, or returns to its interactive main loop. In either case, it prints a stack traceback, except when the exception is :exc:`SystemExit`.
ru: Когда исключение вообще не обрабатывается, интерпретатор прекращает выполнение программы или возвращается к интерактивному основному циклу. В любом случае он печатает обратную трассировку стека, за исключением случаев, когда исключением является :exc:`SystemExit`.

source: Exceptions are identified by class instances. The :keyword:`except` clause is selected depending on the class of the instance: it must reference the class of the instance or a :term:`non-virtual base class <abstract base class>` thereof. The instance can be received by the handler and can carry additional information about the exceptional condition.
ru: Исключения идентифицируются экземплярами класса. Предложение :keyword:`Exception` выбирается в зависимости от класса экземпляра: оно должно ссылаться на класс экземпляра или на его :term:`невиртуальный базовый класс <абстрактный базовый класс>`. Экземпляр может быть получен обработчиком и содержать дополнительную информацию об исключительном состоянии.

source: Exception messages are not part of the Python API. Their contents may change from one version of Python to the next without warning and should not be relied on by code which will run under multiple versions of the interpreter.
ru: Сообщения о исключениях не являются частью API Питона. Их содержание может меняться от одной версии Питона к другой без предупреждения и код, который будет запускаться на разных версиях интерпретатора не должен полагаться на них.

source: See also the description of the :keyword:`try` statement in section :ref:`try` and :keyword:`raise` statement in section :ref:`raise`.
ru: Также, смотрите описание инструкции " :keyword:`try`" в разделе :ref:`try` и инструкции ":keyword:`raise`" в разделе :ref:`raise`.

source: Footnotes
ru: Сноски

source: This limitation occurs because the code that is executed by these operations is not available at the time the module is compiled.
ru: Это ограничение происходит от того, что код, исполняемый этими инструкциями не доступен во время компиляции данного модуля.

source: execution model
ru: модель исполнения

source: code
ru: код

source: block
ru: блокировать

source: frame
ru: фрейм

source: namespace
ru: пространство имён

source: name
ru: имя

source: from
ru: от

source: variable
ru: переменная

source: NameError (built-in exception)
ru: NameError (встроенное исключение)

source: module
ru: модуль

source: restricted
ru: ограниченный

source: raise an exception
ru: вызвать исключение

source: handle an exception
ru: обрабатывать исключение

source: exception handler
ru: обработчик исключений

source: errors
ru: ошибки

source: error handling
ru: обработка ошибок

source: termination model
ru: модель завершения

source: SystemExit (built-in exception)
ru: SystemExit (встроенное исключение)
