Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/reference/lexical_analysis.po
Languages: ru

source: Some examples of formatted string literals::
ru: Некоторые примеры форматированных строковых литералов:

source: Reusing the outer f-string quoting type inside a replacement field is permitted::
ru: Разрешено повторное использование внешнего типа цитирования f-строки внутри поля замены:

source: Prior to Python 3.12, reuse of the same quoting type of the outer f-string inside a replacement field was not possible.
ru: До Python 3.12 повторное использование одного и того же типа кавычек внешней f-строки внутри поля замены было невозможно.

source: Backslashes are also allowed in replacement fields and are evaluated the same way as in any other context::
ru: Обратная косая черта также разрешена в полях замены и оценивается так же, как и в любом другом контексте:

source: Prior to Python 3.12, backslashes were not permitted inside an f-string replacement field.
ru: До Python 3.12 обратная косая черта не допускалась внутри поля замены f-строки.

source: Formatted string literals cannot be used as docstrings, even if they do not include expressions.
ru: Отформатированные строковые литералы нельзя использовать в качестве строк документации, даже если они не содержат выражений.

source: See also :pep:`498` for the proposal that added formatted string literals, and :meth:`str.format`, which uses a related format string mechanism.
ru: См. также :pep:`498` о предложении, в котором добавлены литералы форматированной строки, и :meth:`str.format`, который использует соответствующий механизм форматирования строк.

source: Numeric literals
ru: Числовые литералы

source: There are three types of numeric literals: integers, floating-point numbers, and imaginary numbers. There are no complex literals (complex numbers can be formed by adding a real number and an imaginary number).
ru: Существует три типа числовых литералов: целые числа, числа с плавающей запятой и мнимые числа. Комплексных литералов нет (комплексные числа можно образовать сложением действительного и мнимого числа).

source: Note that numeric literals do not include a sign; a phrase like ``-1`` is actually an expression composed of the unary operator '``-``' and the literal ``1``.
ru: Обратите внимание, что числовые литералы не содержат знака; фраза типа ``-1`` на самом деле является выражением, состоящим из унарного оператора ``-``' и литерала ``1``.

source: Integer literals
ru: Целочисленные литералы

source: Integer literals are described by the following lexical definitions:
ru: Целочисленные литералы описываются следующими лексическими определениями:

source: There is no limit for the length of integer literals apart from what can be stored in available memory.
ru: Нет ограничений на длину целочисленных литералов, за исключением того, что может храниться в доступной памяти.

source: Underscores are ignored for determining the numeric value of the literal. They can be used to group digits for enhanced readability. One underscore can occur between digits, and after base specifiers like ``0x``.
ru: Символы подчеркивания игнорируются при определении числового значения литерала. Их можно использовать для группировки цифр для улучшения читаемости. Одно подчеркивание может встречаться между цифрами и после базовых спецификаторов, таких как ``0x``.

source: Note that leading zeros in a non-zero decimal number are not allowed. This is for disambiguation with C-style octal literals, which Python used before version 3.0.
ru: Обратите внимание, что ведущие нули в ненулевом десятичном числе не допускаются. Это сделано для устранения неоднозначности с восьмеричными литералами в стиле C, которые Python использовал до версии 3.0.

source: Some examples of integer literals::
ru: Некоторые примеры целочисленных литералов::

source: Underscores are now allowed for grouping purposes in literals.
ru: Символы подчеркивания теперь разрешены для группировки в литералах.

source: Floating-point literals
ru: Литералы с плавающей запятой

source: Floating-point literals are described by the following lexical definitions:
ru: Литералы с плавающей запятой описываются следующими лексическими определениями:

source: Note that the integer and exponent parts are always interpreted using radix 10. For example, ``077e010`` is legal, and denotes the same number as ``77e10``. The allowed range of floating-point literals is implementation-dependent. As in integer literals, underscores are supported for digit grouping.
ru: Обратите внимание, что целая и показательная части всегда интерпретируются с использованием системы счисления 10. Например, ``077e010`` является допустимым и обозначает то же число, что и ``77e10``. Допустимый диапазон литералов с плавающей запятой зависит от реализации. Как и в целочисленных литералах, для группировки цифр поддерживаются подчеркивания.

source: Some examples of floating-point literals::
ru: Некоторые примеры литералов с плавающей запятой:

source: Imaginary literals
ru: Воображаемые литералы

source: Imaginary literals are described by the following lexical definitions:
ru: Мнимые литералы описываются следующими лексическими определениями:

source: An imaginary literal yields a complex number with a real part of 0.0. Complex numbers are represented as a pair of floating-point numbers and have the same restrictions on their range. To create a complex number with a nonzero real part, add a floating-point number to it, e.g., ``(3+4j)``. Some examples of imaginary literals::
ru: Мнимый литерал дает комплексное число с действительной частью 0,0. Комплексные числа представляются парой чисел с плавающей запятой и имеют те же ограничения на диапазон. Чтобы создать комплексное число с ненулевой действительной частью, добавьте к нему число с плавающей запятой, например, ``(3+4j)``. Некоторые примеры воображаемых литералов:

source: Operators
ru: Операторы

source: The following tokens serve as delimiters in the grammar:
ru: Следующие токены служат разделителями в грамматике:

source: The period can also occur in floating-point and imaginary literals. A sequence of three periods has a special meaning as an ellipsis literal. The second half of the list, the augmented assignment operators, serve lexically as delimiters, but also perform an operation.
ru: Точка также может встречаться в литералах с плавающей запятой и воображаемых литералах. Последовательность трех периодов имеет особое значение как литерал с многоточием. Вторая половина списка — расширенные операторы присваивания — лексически служат разделителями, но также выполняют операции.

source: The following printing ASCII characters have special meaning as part of other tokens or are otherwise significant to the lexical analyzer:
ru: Следующие печатные символы ASCII имеют особое значение как часть других токенов или иным образом важны для лексического анализатора:

source: The following printing ASCII characters are not used in Python. Their occurrence outside string literals and comments is an unconditional error:
ru: Следующие печатные символы ASCII не используются в Python. Их появление вне строковых литералов и комментариев является безусловной ошибкой:

source: Footnotes
ru: Сноски

source: lexical analysis
ru: лексический анализ

source: parser
ru: парсер

source: token
ru: token (жетон)

source: line structure
ru: линейная структура

source: logical line
ru: строка логики

source: physical line
ru: физическая линия

source: line joining
ru: соединение линий

source: comment
ru: комментарий

source: hash character
ru: хэш-символ

source: source character set
ru: исходный набор символов

source: encoding declarations (source file)
ru: объявления кодирования (исходный файл)

source: source encoding declaration
ru: объявление исходной кодировки

source: line continuation
ru: продолжение строки

source: backslash character
ru: символ обратной косой черты

source: blank line
ru: пустая строка

source: indentation
ru: отступ

source: leading whitespace
ru: ведущие пробелы

source: grouping
ru: группировка

source: statement grouping
ru: группировка операторов

source: INDENT token
ru: токен отступа

source: identifier
ru: идентификатор

source: name
ru: имя

source: reserved word
ru: зарезервированное слово

source: soft keyword
ru: мягкое ключевое слово

source: string literal
ru: строковый литерал

source: bytes literal
ru: байтовый литерал

source: ' (single quote)
ru: ' (одинарная кавычка)

source: " (double quote)
ru: "(двойная кавычка)

source: triple-quoted string
ru: строка в тройных кавычках

source: Unicode Consortium
ru: Консорциум Юникод

source: raw string
ru: необработанная строка

source: raw string literal
ru: необработанный строковый литерал

source: formatted string literal
ru: форматированный строковый литерал

source: escape sequence
ru: escape-последовательность

source: Standard C
ru: Стандарт С

source: \ (backslash)
ru: \ (обратная косая черта)

source: unrecognized escape sequence
ru: нераспознанная escape-последовательность

source: interpolated string literal
ru: интерполированный строковый литерал

source: string
ru: строка

source: formatted literal
ru: форматированный литерал

source: interpolated literal
ru: интерполированный литерал

source: f-string
ru: f-строка

source: fstring
ru: f-строка

source: {} (curly brackets)
ru: {} (фигурные скобки)

source: in formatted string literal
ru: в форматированном строковом литерале

source: ! (exclamation)
ru: ! (восклицание)

source: : (colon)
ru: : (двоеточие)

source: = (equals)
ru: = (равно)

source: for help in debugging using string literals
ru: за помощь в отладке с использованием строковых литералов

source: number
ru: число

source: numeric literal
ru: числовой литерал

source: integer literal
ru: целочисленный литерал

source: floating-point literal
ru: литерал с плавающей запятой

source: hexadecimal literal
ru: шестнадцатеричный литерал

source: octal literal
ru: восьмеричный литерал

source: binary literal
ru: двоичный литерал

source: decimal literal
ru: десятичный литерал

source: imaginary literal
ru: воображаемый literal

source: complex literal
ru: сложный литерал

source: _ (underscore)
ru: _ (подчеркивание)

source: in numeric literal
ru: в числовом литерале

source: . (dot)
ru: . (точка)

source: operators
ru: операторы

source: delimiters
ru: разделители
