Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/reference/lexical_analysis.po
Languages: ru

source: Lexical analysis
ru: Лексический анализ

source: A Python program is read by a *parser*. Input to the parser is a stream of *tokens*, generated by the *lexical analyzer*. This chapter describes how the lexical analyzer breaks a file into tokens.
ru: Программа Python читается *парсером*. Входными данными для синтаксического анализатора является поток *токенов*, сгенерированный *лексическим анализатором*. В этой главе описано, как лексический анализатор разбивает файл на токены.

source: Python reads program text as Unicode code points; the encoding of a source file can be given by an encoding declaration and defaults to UTF-8, see :pep:`3120` for details. If the source file cannot be decoded, a :exc:`SyntaxError` is raised.
ru: Python читает текст программы как кодовые точки Unicode; кодировка исходного файла может быть задана в объявлении кодировки и по умолчанию используется UTF-8, подробности см. в :pep:`3120`. Если исходный файл не может быть декодирован, выдается ошибка :exc:`SyntaxError`.

source: Line structure
ru: Линейная структура

source: A Python program is divided into a number of *logical lines*.
ru: Программа Python разделена на несколько *логических строк*.

source: Logical lines
ru: Логические линии

source: The end of a logical line is represented by the token NEWLINE. Statements cannot cross logical line boundaries except where NEWLINE is allowed by the syntax (e.g., between statements in compound statements). A logical line is constructed from one or more *physical lines* by following the explicit or implicit *line joining* rules.
ru: Конец логической строки обозначается маркером NEWLINE. Операторы не могут пересекать границы логических строк, за исключением случаев, когда NEWLINE разрешен синтаксисом (например, между операторами в составных операторах). Логическая линия создается из одной или нескольких *физических линий* в соответствии с явными или неявными правилами *соединения линий*.

source: Physical lines
ru: Физические линии

source: A physical line is a sequence of characters terminated by an end-of-line sequence. In source files and strings, any of the standard platform line termination sequences can be used - the Unix form using ASCII LF (linefeed), the Windows form using the ASCII sequence CR LF (return followed by linefeed), or the old Macintosh form using the ASCII CR (return) character. All of these forms can be used equally, regardless of platform. The end of input also serves as an implicit terminator for the final physical line.
ru: Физическая строка — это последовательность символов, заканчивающаяся последовательностью конца строки. В исходных файлах и строках можно использовать любую стандартную последовательность завершения строки платформы: форму Unix с использованием ASCII LF (перевод строки), форму Windows с использованием последовательности ASCII CR LF (возврат с последующим переводом строки) или старую форму Macintosh с использованием символ ASCII CR (возврат). Все эти формы можно использовать одинаково, независимо от платформы. Конец ввода также служит неявным ограничителем последней физической строки.

source: When embedding Python, source code strings should be passed to Python APIs using the standard C conventions for newline characters (the ``\n`` character, representing ASCII LF, is the line terminator).
ru: При встраивании Python строки исходного кода должны передаваться в API Python с использованием стандартных соглашений C для символов новой строки (символ ``\n``, представляющий ASCII LF, является признаком конца строки).

source: Comments
ru: Комментарии

source: A comment starts with a hash character (``#``) that is not part of a string literal, and ends at the end of the physical line. A comment signifies the end of the logical line unless the implicit line joining rules are invoked. Comments are ignored by the syntax.
ru: Комментарий начинается с символа решетки (``#``), который не является частью строкового литерала, и заканчивается в конце физической строки. Комментарий означает конец логической строки, если не вызываются неявные правила объединения строк. Комментарии игнорируются синтаксисом.

source: Encoding declarations
ru: Объявления кодирования

source: If a comment in the first or second line of the Python script matches the regular expression ``coding[=:]\s*([-\w.]+)``, this comment is processed as an encoding declaration; the first group of this expression names the encoding of the source code file. The encoding declaration must appear on a line of its own. If it is the second line, the first line must also be a comment-only line. The recommended forms of an encoding expression are ::
ru: Если комментарий в первой или второй строке скрипта Python соответствует регулярному выражению ``coding[=:]\s*([-\w.]+)``, этот комментарий обрабатывается как объявление кодировки; первая группа этого выражения называет кодировку файла исходного кода. Объявление кодировки должно располагаться на отдельной строке. Если это вторая строка, первая строка также должна быть строкой только для комментариев. Рекомендуемые формы выражения кодировки:::

source: which is recognized also by GNU Emacs, and ::
ru: который также признается GNU Emacs, и ::

source: which is recognized by Bram Moolenaar's VIM.
ru: который признан VIM Брэма Муленаара.

source: If no encoding declaration is found, the default encoding is UTF-8. If the implicit or explicit encoding of a file is UTF-8, an initial UTF-8 byte-order mark (b'\xef\xbb\xbf') is ignored rather than being a syntax error.
ru: Если объявление кодировки не найдено, кодировкой по умолчанию является UTF-8. Если неявная или явная кодировка файла — UTF-8, начальная метка порядка байтов UTF-8 (b'\xef\xbb\xbf') игнорируется, а не является синтаксической ошибкой.

source: If an encoding is declared, the encoding name must be recognized by Python (see :ref:`standard-encodings`). The encoding is used for all lexical analysis, including string literals, comments and identifiers.
ru: Если кодировка объявлена, имя кодировки должно распознаваться Python (см. :ref:`standard-encodings`). Кодировка используется для всего лексического анализа, включая строковые литералы, комментарии и идентификаторы.

source: Explicit line joining
ru: Явное соединение строк

source: Two or more physical lines may be joined into logical lines using backslash characters (``\``), as follows: when a physical line ends in a backslash that is not part of a string literal or comment, it is joined with the following forming a single logical line, deleting the backslash and the following end-of-line character. For example::
ru: Две или более физические строки могут быть объединены в логические строки с использованием символов обратной косой черты (``\``) следующим образом: когда физическая строка заканчивается обратной косой чертой, которая не является частью строкового литерала или комментария, она объединяется с помощью следующего формирование одной логической строки, удаление обратной косой черты и следующего за ней символа конца строки. Например::

source: A line ending in a backslash cannot carry a comment. A backslash does not continue a comment. A backslash does not continue a token except for string literals (i.e., tokens other than string literals cannot be split across physical lines using a backslash). A backslash is illegal elsewhere on a line outside a string literal.
ru: Строка, заканчивающаяся обратной косой чертой, не может содержать комментарий. Обратная косая черта не продолжает комментарий. Обратная косая черта не продолжает токен, за исключением строковых литералов (т. е. токены, отличные от строковых литералов, не могут быть разделены на физические строки с помощью обратной косой черты). Обратная косая черта недопустима в любом месте строки за пределами строкового литерала.

source: Implicit line joining
ru: Неявное соединение строк

source: Expressions in parentheses, square brackets or curly braces can be split over more than one physical line without using backslashes. For example::
ru: Выражения в круглых, квадратных или фигурных скобках можно разделить на несколько физических строк без использования обратной косой черты. Например::

source: Implicitly continued lines can carry comments. The indentation of the continuation lines is not important. Blank continuation lines are allowed. There is no NEWLINE token between implicit continuation lines. Implicitly continued lines can also occur within triple-quoted strings (see below); in that case they cannot carry comments.
ru: Неявно продолженные строки могут содержать комментарии. Отступ строк продолжения не важен. Допускаются пустые строки продолжения. Между строками неявного продолжения нет токена NEWLINE. Неявно продолжающиеся строки также могут встречаться в строках, заключенных в тройные кавычки (см. ниже); в этом случае они не могут нести комментарии.

source: Blank lines
ru: Пустые строки

source: A logical line that contains only spaces, tabs, formfeeds and possibly a comment, is ignored (i.e., no NEWLINE token is generated). During interactive input of statements, handling of a blank line may differ depending on the implementation of the read-eval-print loop. In the standard interactive interpreter, an entirely blank logical line (i.e. one containing not even whitespace or a comment) terminates a multi-line statement.
ru: Логическая строка, содержащая только пробелы, табуляции, переводы страниц и, возможно, комментарий, игнорируется (т. е. токен NEWLINE не генерируется). Во время интерактивного ввода операторов обработка пустой строки может отличаться в зависимости от реализации цикла чтения-оценки-печати. В стандартном интерактивном интерпретаторе полностью пустая логическая строка (т.е. не содержащая даже пробелов или комментариев) завершает многострочный оператор.

source: Indentation
ru: Отступ

source: Leading whitespace (spaces and tabs) at the beginning of a logical line is used to compute the indentation level of the line, which in turn is used to determine the grouping of statements.
ru: Ведущие пробелы (пробелы и табуляции) в начале логической строки используются для вычисления уровня отступа строки, который, в свою очередь, используется для определения группировки операторов.

source: Tabs are replaced (from left to right) by one to eight spaces such that the total number of characters up to and including the replacement is a multiple of eight (this is intended to be the same rule as used by Unix). The total number of spaces preceding the first non-blank character then determines the line's indentation. Indentation cannot be split over multiple physical lines using backslashes; the whitespace up to the first backslash determines the indentation.
ru: Табуляция заменяется (слева направо) на от одного до восьми пробелов, так что общее количество символов до замены включительно кратно восьми (это то же самое правило, которое используется в Unix). Общее количество пробелов, предшествующих первому непустому символу, определяет отступ строки. Отступ нельзя разделить на несколько физических строк с помощью обратной косой черты; пробелы до первой обратной косой черты определяют отступ.

source: Indentation is rejected as inconsistent if a source file mixes tabs and spaces in a way that makes the meaning dependent on the worth of a tab in spaces; a :exc:`TabError` is raised in that case.
ru: Отступы отклоняются как непоследовательные, если в исходном файле табуляция и пробелы смешаны таким образом, что значение зависит от значения табуляции в пробелах; В этом случае возникает :exc:`TabError`.

source: **Cross-platform compatibility note:** because of the nature of text editors on non-UNIX platforms, it is unwise to use a mixture of spaces and tabs for the indentation in a single source file. It should also be noted that different platforms may explicitly limit the maximum indentation level.
ru: **Примечание о межплатформенной совместимости:** из-за особенностей текстовых редакторов на платформах, отличных от UNIX, неразумно использовать сочетание пробелов и табуляции для отступов в одном исходном файле. Также следует отметить, что разные платформы могут явно ограничивать максимальный уровень отступов.

source: A formfeed character may be present at the start of the line; it will be ignored for the indentation calculations above. Formfeed characters occurring elsewhere in the leading whitespace have an undefined effect (for instance, they may reset the space count to zero).
ru: Символ перевода страницы может присутствовать в начале строки; он будет игнорироваться при расчете отступов, приведенном выше. Символы перевода страницы, встречающиеся в других местах начального пробела, имеют неопределенный эффект (например, они могут сбросить счетчик пробелов на ноль).

source: The indentation levels of consecutive lines are used to generate INDENT and DEDENT tokens, using a stack, as follows.
ru: Уровни отступов последовательных строк используются для создания токенов INDENT и DEDENT с использованием стека следующим образом.

source: Before the first line of the file is read, a single zero is pushed on the stack; this will never be popped off again. The numbers pushed on the stack will always be strictly increasing from bottom to top. At the beginning of each logical line, the line's indentation level is compared to the top of the stack. If it is equal, nothing happens. If it is larger, it is pushed on the stack, and one INDENT token is generated. If it is smaller, it *must* be one of the numbers occurring on the stack; all numbers on the stack that are larger are popped off, and for each number popped off a DEDENT token is generated. At the end of the file, a DEDENT token is generated for each number remaining on the stack that is larger than zero.
ru: Прежде чем будет прочитана первая строка файла, в стек помещается один ноль; это больше никогда не будет снято. Числа, помещенные в стек, всегда будут строго увеличиваться снизу вверх. В начале каждой логической строки уровень отступа строки сравнивается с вершиной стека. Если оно равно, ничего не происходит. Если он больше, он помещается в стек и генерируется один токен INDENT. Если оно меньше, оно *должно* быть одним из чисел, встречающихся в стеке; все числа в стеке, которые больше, извлекаются, и для каждого извлеченного числа генерируется токен DEDENT. В конце файла генерируется токен DEDENT для каждого оставшегося в стеке числа, большего нуля.

source: Here is an example of a correctly (though confusingly) indented piece of Python code::
ru: Вот пример правильно (хотя и сбивчиво) фрагмента кода Python с отступами:

source: The following example shows various indentation errors::
ru: В следующем примере показаны различные ошибки отступов:

source: (Actually, the first three errors are detected by the parser; only the last error is found by the lexical analyzer --- the indentation of ``return r`` does not match a level popped off the stack.)
ru: (На самом деле синтаксический анализатор обнаруживает первые три ошибки; лексический анализатор находит только последнюю ошибку --- отступ ``return r`` не соответствует уровню, извлеченному из стека.)

source: Whitespace between tokens
ru: Пробелы между токенами

source: Except at the beginning of a logical line or in string literals, the whitespace characters space, tab and formfeed can be used interchangeably to separate tokens. Whitespace is needed between two tokens only if their concatenation could otherwise be interpreted as a different token (e.g., ab is one token, but a b is two tokens).
ru: За исключением начала логической строки или строковых литералов, пробелы, символы табуляции и перевода страницы могут использоваться взаимозаменяемо для разделения токенов. Пробелы необходимы между двумя токенами только в том случае, если их объединение иначе можно было бы интерпретировать как другой токен (например, ab — это один токен, а ab — два токена).

source: Other tokens
ru: Другие токены

source: Besides NEWLINE, INDENT and DEDENT, the following categories of tokens exist: *identifiers*, *keywords*, *literals*, *operators*, and *delimiters*. Whitespace characters (other than line terminators, discussed earlier) are not tokens, but serve to delimit tokens. Where ambiguity exists, a token comprises the longest possible string that forms a legal token, when read from left to right.
ru: Помимо NEWLINE, INDENT и DEDENT, существуют следующие категории токенов: *идентификаторы*, *ключевые слова*, *литералы*, *операторы* и *разделители*. Пробельные символы (кроме ограничителей строк, обсуждавшихся ранее) не являются токенами, а служат для их разделения. Там, где существует неоднозначность, токен содержит максимально длинную строку, которая образует допустимый токен при чтении слева направо.

source: Identifiers and keywords
ru: Идентификаторы и ключевые слова

source: Identifiers (also referred to as *names*) are described by the following lexical definitions.
ru: Идентификаторы (также называемые *именами*) описываются следующими лексическими определениями.

source: The syntax of identifiers in Python is based on the Unicode standard annex UAX-31, with elaboration and changes as defined below; see also :pep:`3131` for further details.
ru: Синтаксис идентификаторов в Python основан на стандартном приложении Unicode UAX-31 с доработками и изменениями, как определено ниже; дополнительную информацию см. также в :pep:`3131`.

source: Within the ASCII range (U+0001..U+007F), the valid characters for identifiers include the uppercase and lowercase letters ``A`` through ``Z``, the underscore ``_`` and, except for the first character, the digits ``0`` through ``9``. Python 3.0 introduced additional characters from outside the ASCII range (see :pep:`3131`). For these characters, the classification uses the version of the Unicode Character Database as included in the :mod:`unicodedata` module.
ru: В диапазоне ASCII (U+0001..U+007F) допустимые символы для идентификаторов включают прописные и строчные буквы от «A» до «Z», подчеркивание «_» и, за исключением первый символ — цифры от «0» до «9». В Python 3.0 появились дополнительные символы за пределами диапазона ASCII (см. :pep:`3131`). Для этих символов в классификации используется версия базы данных символов Юникода, включенная в модуль :mod:`unicodedata`.

source: Identifiers are unlimited in length. Case is significant.
ru: Идентификаторы не ограничены по длине. Случай знаменательный.

source: The Unicode category codes mentioned above stand for:
ru: Упомянутые выше коды категорий Unicode означают:

source: *Lu* - uppercase letters
ru: *Лу* - заглавные буквы

source: *Ll* - lowercase letters
ru: *Ll* - строчные буквы

source: *Lt* - titlecase letters
ru: *Lt* - заглавные буквы

source: *Lm* - modifier letters
ru: *Lm* - буквы-модификаторы

source: *Lo* - other letters
ru: *Lo* - другие буквы

source: *Nl* - letter numbers
ru: *Nl* - номера букв

source: *Mn* - nonspacing marks
ru: *Mn* - непромежуточные знаки

source: *Mc* - spacing combining marks
ru: *Mc* - знаки объединения интервалов

source: *Nd* - decimal numbers
ru: *Nd* - десятичные числа

source: *Pc* - connector punctuations
ru: *Pc* — знаки препинания разъема

source: *Other_ID_Start* - explicit list of characters in `PropList.txt <https://www.unicode.org/Public/15.1.0/ucd/PropList.txt>`_ to support backwards compatibility
ru: *Other_ID_Start* — явный список символов в `PropList.txt <https://www.unicode.org/Public/15.1.0/ucd/PropList.txt>`_ для поддержки обратной совместимости.

source: *Other_ID_Continue* - likewise
ru: *Other_ID_Continue* - аналогично

source: All identifiers are converted into the normal form NFKC while parsing; comparison of identifiers is based on NFKC.
ru: Все идентификаторы при разборе преобразуются в нормальную форму NFKC; сравнение идентификаторов основано на NFKC.

source: A non-normative HTML file listing all valid identifier characters for Unicode 15.1.0 can be found at https://www.unicode.org/Public/15.1.0/ucd/DerivedCoreProperties.txt
ru: Ненормативный HTML-файл, в котором перечислены все допустимые символы идентификаторов для Unicode 15.1.0, можно найти по адресу https://www.unicode.org/Public/15.1.0/ucd/DerivedCoreProperties.txt.

source: Keywords
ru: Ключевые слова

source: The following identifiers are used as reserved words, or *keywords* of the language, and cannot be used as ordinary identifiers. They must be spelled exactly as written here:
ru: Следующие идентификаторы используются как зарезервированные слова или *ключевые слова* языка и не могут использоваться как обычные идентификаторы. Их нужно писать именно так, как написано здесь:

source: False await else import pass None break except in raise True class finally is return and continue for lambda try as def from nonlocal while assert del global not with async elif if or yield
ru: Ложь, ожидайте еще прохода импорта Ни одного брейка, кроме рейза Истинный класс, наконец, возвращается и продолжите попытку лямбды как определение из нелокального while утверждать del global не с помощью асинхронный elif if или выход

source: Soft Keywords
ru: Мягкие ключевые слова

source: Some identifiers are only reserved under specific contexts. These are known as *soft keywords*. The identifiers ``match``, ``case``, ``type`` and ``_`` can syntactically act as keywords in certain contexts, but this distinction is done at the parser level, not when tokenizing.
ru: Некоторые идентификаторы зарезервированы только в определенных контекстах. Они известны как *мягкие ключевые слова*. Идентификаторы ``match``, ``case``, ``type`` и ``_`` могут синтаксически действовать как ключевые слова в определенных контекстах, но это различие осуществляется на уровне синтаксического анализатора, а не при токенизации.

source: As soft keywords, their use in the grammar is possible while still preserving compatibility with existing code that uses these names as identifier names.
ru: В качестве мягких ключевых слов их использование в грамматике возможно при сохранении совместимости с существующим кодом, который использует эти имена в качестве имен-идентификаторов.

source: ``match``, ``case``, and ``_`` are used in the :keyword:`match` statement. ``type`` is used in the :keyword:`type` statement.
ru: ``match``, ``case`` и ``_`` используются в операторе :keyword:`match`. ``type`` используется в операторе :keyword:`type`.

source: ``type`` is now a soft keyword.
ru: ``type`` теперь является мягким ключевым словом.

source: Reserved classes of identifiers
ru: Зарезервированные классы идентификаторов

source: Certain classes of identifiers (besides keywords) have special meanings. These classes are identified by the patterns of leading and trailing underscore characters:
ru: Определенные классы идентификаторов (кроме ключевых слов) имеют особое значение. Эти классы идентифицируются по шаблонам начальных и конечных символов подчеркивания:

source: Not imported by ``from module import *``.
ru: Не импортируется из ``from module import *``.

source: In a ``case`` pattern within a :keyword:`match` statement, ``_`` is a :ref:`soft keyword <soft-keywords>` that denotes a :ref:`wildcard <wildcard-patterns>`.
ru: В шаблоне ``case`` в операторе :keyword:`match` ``_`` представляет собой :ref:`мягкое ключевое слово <soft-keywords>`, которое обозначает :ref:`wildcard <wildcard-patterns> `.

source: Separately, the interactive interpreter makes the result of the last evaluation available in the variable ``_``. (It is stored in the :mod:`builtins` module, alongside built-in functions like ``print``.)
ru: Отдельно интерактивный интерпретатор делает результат последней оценки доступным в переменной ``_``. (Он хранится в модуле :mod:`builtins` вместе со встроенными функциями, такими как ``print``.)
