Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/reference/lexical_analysis.po
Languages: ru

source: Elsewhere, ``_`` is a regular identifier. It is often used to name "special" items, but it is not special to Python itself.
ru: В других местах ``_`` является обычным идентификатором. Его часто используют для обозначения «специальных» элементов, но он не является чем-то особенным для самого Python.

source: The name ``_`` is often used in conjunction with internationalization; refer to the documentation for the :mod:`gettext` module for more information on this convention.
ru: Имя ``_`` часто используется в сочетании с интернационализацией; обратитесь к документации модуля :mod:`gettext` для получения дополнительной информации об этом соглашении.

source: It is also commonly used for unused variables.
ru: Он также часто используется для неиспользуемых переменных.

source: System-defined names, informally known as "dunder" names. These names are defined by the interpreter and its implementation (including the standard library). Current system names are discussed in the :ref:`specialnames` section and elsewhere. More will likely be defined in future versions of Python. *Any* use of ``__*__`` names, in any context, that does not follow explicitly documented use, is subject to breakage without warning.
ru: Определенные системой имена, неофициально известные как имена «dunder». Эти имена определяются интерпретатором и его реализацией (включая стандартную библиотеку). Текущие системные имена обсуждаются в разделе :ref:`specialnames` и других местах. Скорее всего, больше будет определено в будущих версиях Python. *Любое* использование имен ``__*__`` в любом контексте, которое не соответствует явно задокументированному использованию, может быть нарушено без предупреждения.

source: Class-private names. Names in this category, when used within the context of a class definition, are re-written to use a mangled form to help avoid name clashes between "private" attributes of base and derived classes. See section :ref:`atom-identifiers`.
ru: Частные имена классов. Имена в этой категории, когда они используются в контексте определения класса, переписываются в искаженной форме, чтобы избежать конфликтов имен между «частными» атрибутами базового и производных классов. См. раздел :ref:`атом-идентификаторы`.

source: Literals
ru: Литералы

source: Literals are notations for constant values of some built-in types.
ru: Литералы — это обозначения постоянных значений некоторых встроенных типов.

source: String and Bytes literals
ru: Строковые и байтовые литералы

source: String literals are described by the following lexical definitions:
ru: Строковые литералы описываются следующими лексическими определениями:

source: One syntactic restriction not indicated by these productions is that whitespace is not allowed between the :token:`~python-grammar:stringprefix` or :token:`~python-grammar:bytesprefix` and the rest of the literal. The source character set is defined by the encoding declaration; it is UTF-8 if no encoding declaration is given in the source file; see section :ref:`encodings`.
ru: Одно синтаксическое ограничение, не указанное в этих продуктах, заключается в том, что пробелы не допускаются между :token:`~python-grammar:stringprefix` или :token:`~python-grammar:bytesprefix` и остальной частью литерала. Исходный набор символов определяется объявлением кодировки; это UTF-8, если в исходном файле не указано объявление кодировки; см. раздел :ref:`кодировки`.

source: In plain English: Both types of literals can be enclosed in matching single quotes (``'``) or double quotes (``"``). They can also be enclosed in matching groups of three single or double quotes (these are generally referred to as *triple-quoted strings*). The backslash (``\``) character is used to give special meaning to otherwise ordinary characters like ``n``, which means 'newline' when escaped (``\n``). It can also be used to escape characters that otherwise have a special meaning, such as newline, backslash itself, or the quote character. See :ref:`escape sequences <escape-sequences>` below for examples.
ru: На простом английском языке: оба типа литералов могут быть заключены в соответствующие одинарные кавычки (``'``) или двойные кавычки (``"``). Они также могут быть заключены в соответствующие группы из трех одинарных или двойных кавычек (это обычно называется *строками в тройных кавычках*). Символ обратной косой черты (``\``) используется для придания особого значения обычным символам, таким как ``n``, который при экранировании означает "новую строку" (``\). n``). Его также можно использовать для escape-символов, которые в противном случае имеют специальное значение, таких как новая строка, обратная косая черта или символ кавычки. Примеры см. в разделе :ref:`escape-sequences <escape-sequences>` ниже.

source: Bytes literals are always prefixed with ``'b'`` or ``'B'``; they produce an instance of the :class:`bytes` type instead of the :class:`str` type. They may only contain ASCII characters; bytes with a numeric value of 128 or greater must be expressed with escapes.
ru: Байтовые литералы всегда имеют префикс ``'b'`` или ``'B'``; они создают экземпляр типа :class:`bytes` вместо типа :class:`str`. Они могут содержать только символы ASCII; байты с числовым значением 128 или больше должны быть выражены с помощью escape-символов.

source: Both string and bytes literals may optionally be prefixed with a letter ``'r'`` or ``'R'``; such constructs are called :dfn:`raw string literals` and :dfn:`raw bytes literals` respectively and treat backslashes as literal characters. As a result, in raw string literals, ``'\U'`` and ``'\u'`` escapes are not treated specially.
ru: Как строковые, так и байтовые литералы могут иметь префикс буквы ``'r'`` или ``'R'``; такие конструкции называются :dfn:`raw string literals` и :dfn:`raw bytes literals` соответственно и обрабатывают обратную косую черту как буквальные символы. В результате в необработанных строковых литералах escape-символы ``'\U'`` и ``'\u'`` не обрабатываются особым образом.

source: The ``'rb'`` prefix of raw bytes literals has been added as a synonym of ``'br'``.
ru: Префикс ``'rb'`` для литералов необработанных байтов был добавлен как синоним ``'br'``.

source: Support for the unicode legacy literal (``u'value'``) was reintroduced to simplify the maintenance of dual Python 2.x and 3.x codebases. See :pep:`414` for more information.
ru: Поддержка устаревшего литерала Unicode («u'value») была вновь введена для упрощения обслуживания двойных кодовых баз Python 2.x и 3.x. См. :pep:`414` для получения дополнительной информации.

source: A string literal with ``'f'`` or ``'F'`` in its prefix is a :dfn:`formatted string literal`; see :ref:`f-strings`. The ``'f'`` may be combined with ``'r'``, but not with ``'b'`` or ``'u'``, therefore raw formatted strings are possible, but formatted bytes literals are not.
ru: Строковый литерал с префиксом ``'f'`` или ``'F'`` является :dfn:`форматированным строковым литералом`; см. :ref:`f-strings`. ``'f'`` можно комбинировать с ``'r'``, но не с ``'b'`` или ``'u'``, поэтому возможны необработанные форматированные строки, но форматированные байтовые литералы нет.

source: In triple-quoted literals, unescaped newlines and quotes are allowed (and are retained), except that three unescaped quotes in a row terminate the literal. (A "quote" is the character used to open the literal, i.e. either ``'`` or ``"``.)
ru: В литералах с тройными кавычками разрешены (и сохраняются) неэкранированные символы новой строки и кавычки, за исключением того, что три неэкранированные кавычки подряд завершают литерал. («Кавычка» — это символ, используемый для открытия литерала, т. е. либо ``'``, либо ``'``.)

source: Escape sequences
ru: Escape-последовательности

source: Unless an ``'r'`` or ``'R'`` prefix is present, escape sequences in string and bytes literals are interpreted according to rules similar to those used by Standard C. The recognized escape sequences are:
ru: Если не присутствует префикс ``'r'`` или ``'R'``, escape-последовательности в строковых и байтовых литералах интерпретируются в соответствии с правилами, аналогичными тем, которые используются в стандарте C. Распознаваемые escape-последовательности:

source: Escape Sequence
ru: Escape-последовательность

source: Meaning
ru: Значение

source: Notes
ru: Примечания

source: Backslash and newline ignored
ru: Обратная косая черта и новая строка игнорируются

source: Backslash (``\``)
ru: Обратный слэш (``\``)

source: Single quote (``'``)
ru: Одиночная кавычка (``'``)

source: Double quote (``"``)
ru: Двойная кавычка (``"``)

source: ASCII Formfeed (FF)
ru: Подача форм в формате ASCII (FF)

source: Character with octal value *ooo*
ru: Символ восьмеричного значения *ооо*

source: Character with hex value *hh*
ru: Символ с шестнадцатеричным значением *чч*

source: Escape sequences only recognized in string literals are:
ru: Escape-последовательности, распознаваемые только в строковых литералах:

source: Character named *name* in the Unicode database
ru: Символ с именем *имя* в базе данных Юникода

source: Character with 16-bit hex value *xxxx*
ru: Символ с 16-битным шестнадцатеричным значением *xxxx*

source: Character with 32-bit hex value *xxxxxxxx*
ru: Символ с 32-битным шестнадцатеричным значением *xxxxxxxxxx*

source: Notes:
ru: Примечания:

source: A backslash can be added at the end of a line to ignore the newline::
ru: В конце строки можно добавить обратную косую черту, чтобы игнорировать новую строку:

source: >>> 'This string will not include \ ... backslashes or newline characters.' 'This string will not include backslashes or newline characters.'
ru: >>> 'Эта строка не будет включать \ ... обратная косая черта или символы новой строки.' «Эта строка не будет содержать обратную косую черту или символы новой строки».

source: The same result can be achieved using :ref:`triple-quoted strings <strings>`, or parentheses and :ref:`string literal concatenation <string-concatenation>`.
ru: Того же результата можно добиться, используя :ref:`строки в тройных кавычках <strings>` или круглые скобки и :ref:`конкатенацию строковых литералов <string-concatenation>`.

source: As in Standard C, up to three octal digits are accepted.
ru: Как и в стандарте C, допускается до трех восьмеричных цифр.

source: Octal escapes with value larger than ``0o377`` produce a :exc:`DeprecationWarning`.
ru: Восьмеричные escape-последовательности со значением больше 0o377 создают :exc:`DeprecationWarning`.

source: Octal escapes with value larger than ``0o377`` produce a :exc:`SyntaxWarning`. In a future Python version they will be eventually a :exc:`SyntaxError`.
ru: Восьмеричные escape-символы со значением больше 0o377 создают :exc:`SyntaxWarning`. В будущей версии Python они в конечном итоге станут :exc:`SyntaxError`.

source: Unlike in Standard C, exactly two hex digits are required.
ru: В отличие от стандарта C, здесь требуется ровно две шестнадцатеричные цифры.

source: In a bytes literal, hexadecimal and octal escapes denote the byte with the given value. In a string literal, these escapes denote a Unicode character with the given value.
ru: В литерале байтов шестнадцатеричные и восьмеричные escape-символы обозначают байт с заданным значением. В строковом литерале эти escape-символы обозначают символ Юникода с заданным значением.

source: Support for name aliases [#]_ has been added.
ru: Поддержка псевдонимов имен [#]_ был добавлен.

source: Exactly four hex digits are required.
ru: Требуется ровно четыре шестнадцатеричные цифры.

source: Any Unicode character can be encoded this way. Exactly eight hex digits are required.
ru: Таким образом можно закодировать любой символ Юникода. Требуется ровно восемь шестнадцатеричных цифр.

source: Unlike Standard C, all unrecognized escape sequences are left in the string unchanged, i.e., *the backslash is left in the result*. (This behavior is useful when debugging: if an escape sequence is mistyped, the resulting output is more easily recognized as broken.) It is also important to note that the escape sequences only recognized in string literals fall into the category of unrecognized escapes for bytes literals.
ru: В отличие от стандарта C, все нераспознанные escape-последовательности остаются в строке неизмененными, т.е. *обратная косая черта остается в результате*. (Такое поведение полезно при отладке: если escape-последовательность введена с ошибкой, результирующий вывод легче распознать как поврежденный.) Также важно отметить, что escape-последовательности, распознаваемые только в строковых литералах, попадают в категорию нераспознанных escape-последовательностей для байтов. литералы.

source: Unrecognized escape sequences produce a :exc:`DeprecationWarning`.
ru: Нераспознанные escape-последовательности создают :exc:`DeprecationWarning`.

source: Unrecognized escape sequences produce a :exc:`SyntaxWarning`. In a future Python version they will be eventually a :exc:`SyntaxError`.
ru: Нераспознанные escape-последовательности создают :exc:`SyntaxWarning`. В будущей версии Python они в конечном итоге станут :exc:`SyntaxError`.

source: Even in a raw literal, quotes can be escaped with a backslash, but the backslash remains in the result; for example, ``r"\""`` is a valid string literal consisting of two characters: a backslash and a double quote; ``r"\"`` is not a valid string literal (even a raw string cannot end in an odd number of backslashes). Specifically, *a raw literal cannot end in a single backslash* (since the backslash would escape the following quote character). Note also that a single backslash followed by a newline is interpreted as those two characters as part of the literal, *not* as a line continuation.
ru: Даже в необработанном литерале кавычки можно экранировать обратной косой чертой, но в результате обратная косая черта останется; например, ``r"\""`` является допустимым строковым литералом, состоящим из двух символов: обратной косой черты и двойной кавычки; ``r"\"`` не является допустимым строковым литералом (даже необработанная строка не может заканчиваться в нечетном количестве обратных косых черт). В частности, *необработанный литерал не может заканчиваться одной обратной косой чертой* (поскольку обратная косая черта будет экранировать следующий символ кавычки). Обратите также внимание, что одиночная обратная косая черта, за которой следует символ новой строки, интерпретируется как эти два символа. часть литерала, *не* как продолжение строки.

source: String literal concatenation
ru: Объединение строковых литералов

source: Multiple adjacent string or bytes literals (delimited by whitespace), possibly using different quoting conventions, are allowed, and their meaning is the same as their concatenation. Thus, ``"hello" 'world'`` is equivalent to ``"helloworld"``. This feature can be used to reduce the number of backslashes needed, to split long strings conveniently across long lines, or even to add comments to parts of strings, for example::
ru: Допускаются несколько смежных строковых или байтовых литералов (разделенных пробелами), возможно, с использованием разных соглашений о кавычках, и их значение такое же, как и их объединение. Таким образом, ``"hello" 'world'`` эквивалентен ``"helloworld"``. Эту функцию можно использовать для уменьшения количества необходимых обратных косых черт, для удобного разделения длинных строк на длинные строки или даже для добавления комментариев к частям строк, например:

source: Note that this feature is defined at the syntactical level, but implemented at compile time. The '+' operator must be used to concatenate string expressions at run time. Also note that literal concatenation can use different quoting styles for each component (even mixing raw strings and triple quoted strings), and formatted string literals may be concatenated with plain string literals.
ru: Обратите внимание, что эта функция определена на синтаксическом уровне, но реализуется во время компиляции. Оператор «+» необходимо использовать для объединения строковых выражений во время выполнения. Также обратите внимание, что при конкатенации литералов могут использоваться разные стили кавычек для каждого компонента (даже смешивание необработанных строк и строк в тройных кавычках), а форматированные строковые литералы могут быть объединены с простыми строковыми литералами.

source: A :dfn:`formatted string literal` or :dfn:`f-string` is a string literal that is prefixed with ``'f'`` or ``'F'``. These strings may contain replacement fields, which are expressions delimited by curly braces ``{}``. While other string literals always have a constant value, formatted strings are really expressions evaluated at run time.
ru: :dfn:`форматированный строковый литерал` или :dfn:`f-string` — это строковый литерал с префиксом ``'f'`` или ``'F'``. Эти строки могут содержать поля замены, которые представляют собой выражения, разделенные фигурными скобками ``{}``. В то время как другие строковые литералы всегда имеют постоянное значение, форматированные строки на самом деле являются выражениями, вычисляемыми во время выполнения.

source: Escape sequences are decoded like in ordinary string literals (except when a literal is also marked as a raw string). After decoding, the grammar for the contents of the string is:
ru: Escape-последовательности декодируются так же, как и обычные строковые литералы (кроме случаев, когда литерал также помечен как необработанная строка). После декодирования грамматика содержимого строки будет следующей:

source: The parts of the string outside curly braces are treated literally, except that any doubled curly braces ``'{{'`` or ``'}}'`` are replaced with the corresponding single curly brace. A single opening curly bracket ``'{'`` marks a replacement field, which starts with a Python expression. To display both the expression text and its value after evaluation, (useful in debugging), an equal sign ``'='`` may be added after the expression. A conversion field, introduced by an exclamation point ``'!'`` may follow. A format specifier may also be appended, introduced by a colon ``':'``. A replacement field ends with a closing curly bracket ``'}'``.
ru: Части строки за пределами фигурных скобок обрабатываются буквально, за исключением того, что любые двойные фигурные скобки ``'{{'`` или ``'}}'`` заменяются соответствующей одинарной фигурной скобкой. Одиночная открывающая фигурная скобка ``'{'`` отмечает поле замены, которое начинается с выражения Python. Чтобы отобразить как текст выражения, так и его значение после вычисления (полезно при отладке), после выражения можно добавить знак равенства ``'='``. После этого может следовать поле преобразования, представляемое восклицательным знаком ``'!'``. Также может быть добавлен спецификатор формата, обозначаемый двоеточием ``':'``. Поле замены заканчивается закрывающей фигурной скобкой ``'}'``.

source: Expressions in formatted string literals are treated like regular Python expressions surrounded by parentheses, with a few exceptions. An empty expression is not allowed, and both :keyword:`lambda` and assignment expressions ``:=`` must be surrounded by explicit parentheses. Each expression is evaluated in the context where the formatted string literal appears, in order from left to right. Replacement expressions can contain newlines in both single-quoted and triple-quoted f-strings and they can contain comments. Everything that comes after a ``#`` inside a replacement field is a comment (even closing braces and quotes). In that case, replacement fields must be closed in a different line.
ru: Выражения в литералах форматированной строки обрабатываются как обычные выражения Python, заключенные в круглые скобки, за некоторыми исключениями. Пустое выражение не допускается, и выражения :keyword:`lambda` и присваивания ``:=`` должны быть заключены в явные круглые скобки. Каждое выражение оценивается в контексте, где появляется форматированный строковый литерал, в порядке слева направо. Выражения замены могут содержать символы новой строки как в одинарных, так и в тройных кавычках, а также могут содержать комментарии. Все, что идет после ``#`` внутри поля замены, является комментарием (даже закрывающими скобками и кавычками). В этом случае поля замены необходимо закрыть в другой строке.

source: Prior to Python 3.7, an :keyword:`await` expression and comprehensions containing an :keyword:`async for` clause were illegal in the expressions in formatted string literals due to a problem with the implementation.
ru: До Python 3.7 выражение :keyword:`await` и выражения, содержащие предложение :keyword:`async for`, были недопустимы в выражениях в форматированных строковых литералах из-за проблем с реализацией.

source: Prior to Python 3.12, comments were not allowed inside f-string replacement fields.
ru: До Python 3.12 комментарии не допускались внутри полей замены f-строки.

source: When the equal sign ``'='`` is provided, the output will have the expression text, the ``'='`` and the evaluated value. Spaces after the opening brace ``'{'``, within the expression and after the ``'='`` are all retained in the output. By default, the ``'='`` causes the :func:`repr` of the expression to be provided, unless there is a format specified. When a format is specified it defaults to the :func:`str` of the expression unless a conversion ``'!r'`` is declared.
ru: Если указан знак равенства ``'='``, выходные данные будут содержать текст выражения, ``'='`` и вычисленное значение. Пробелы после открывающей скобки ``'{'``, внутри выражения и после ``'='`` все сохраняются в выводе. По умолчанию ``'='`` приводит к предоставлению :func:`repr` выражения, если не указан формат. Когда указан формат, по умолчанию используется :func:`str` выражения, если не объявлено преобразование ``'!r'``.

source: The equal sign ``'='``.
ru: Знак равенства ``'='``.

source: If a conversion is specified, the result of evaluating the expression is converted before formatting. Conversion ``'!s'`` calls :func:`str` on the result, ``'!r'`` calls :func:`repr`, and ``'!a'`` calls :func:`ascii`.
ru: Если указано преобразование, результат вычисления выражения преобразуется перед форматированием. Преобразование ``'!s'`` вызывает :func:`str` для результата, ``'!r'`` вызывает :func:`repr`, а ``'!a'`` вызывает :func:` ascii`.

source: The result is then formatted using the :func:`format` protocol. The format specifier is passed to the :meth:`~object.__format__` method of the expression or conversion result. An empty string is passed when the format specifier is omitted. The formatted result is then included in the final value of the whole string.
ru: Затем результат форматируется с использованием протокола :func:`format`. Спецификатор формата передается методу :meth:`~object.__format__` выражения или результата преобразования. Пустая строка передается, если спецификатор формата опущен. Отформатированный результат затем включается в окончательное значение всей строки.

source: Top-level format specifiers may include nested replacement fields. These nested fields may include their own conversion fields and :ref:`format specifiers <formatspec>`, but may not include more deeply nested replacement fields. The :ref:`format specifier mini-language <formatspec>` is the same as that used by the :meth:`str.format` method.
ru: Спецификаторы формата верхнего уровня могут включать вложенные поля замены. Эти вложенные поля могут включать в себя собственные поля преобразования и :ref:`описатели формата <formatspec>`, но не могут включать более глубоко вложенные поля замены. Мини-язык спецификатора формата <formatspec>` аналогичен тому, который используется в методе :meth:`str.format`.

source: Formatted string literals may be concatenated, but replacement fields cannot be split across literals.
ru: Отформатированные строковые литералы можно объединять, но поля замены нельзя разделить на литералы.
