Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/arg.po
Languages: es_es, ru

source: :c:func:`PyArg_ParseTuple` will allocate a buffer of the needed size, copy the encoded data into this buffer and adjust *\*buffer* to reference the newly allocated storage. The caller is responsible for calling :c:func:`PyMem_Free` to free the allocated buffer after use.
es_es: :c:func:`PyArg_ParseTuple` asignará un búfer del tamaño necesario, copiará los datos codificados en este búfer y ajustará *\*búfer* para hacer referencia al almacenamiento recién asignado. Caller es responsable de llamar :c:func:`PyMem_Free` para liberar el búfer asignado después de su uso.
ru: :c:func:`PyArg_ParseTuple` выделит буфер необходимого размера, скопирует закодированные данные в этот буфер и настроит *\*buffer* для ссылки на вновь выделенное хранилище. Вызывающий объект отвечает за вызов :c:func:`PyMem_Free`, чтобы освободить выделенный буфер после использования.

source: ``et`` (:class:`str`, :class:`bytes` or :class:`bytearray`) [const char \*encoding, char \*\*buffer]
es_es: ``et`` (:class:`str`, :class:`bytes` o :class:`bytearray`) [const char \*encoding, char \*\*buffer]

source: Same as ``es`` except that byte string objects are passed through without recoding them. Instead, the implementation assumes that the byte string object uses the encoding passed in as parameter.
es_es: Igual que ``es`` excepto que los objetos de cadena de bytes se pasan sin recodificarlos. En cambio, la implementación asume que el objeto de cadena de bytes usa la codificación pasada como parámetro.
ru: То же, что и ``es```, за исключением того, что объекты байтовой строки передаются без их перекодирования. Вместо этого реализация предполагает, что объект байтовой строки использует кодировку, переданную в качестве параметра.

source: This variant on ``s#`` is used for encoding Unicode into a character buffer. Unlike the ``es`` format, this variant allows input data which contains NUL characters.
es_es: Esta variante de ``s#``se utiliza para codificar Unicode en un búfer de caracteres. A diferencia del formato ``es``, esta variante permite la entrada de datos que contienen caracteres NUL.
ru: Этот вариант на ``s#`` используется для кодирования Unicode в символьный буфер. В отличие от формата ``es``, этот вариант допускает ввод данных, содержащих нулевые символы.

source: It requires three arguments. The first is only used as input, and must be a :c:expr:`const char*` which points to the name of an encoding as a NUL-terminated string, or ``NULL``, in which case ``'utf-8'`` encoding is used. An exception is raised if the named encoding is not known to Python. The second argument must be a :c:expr:`char**`; the value of the pointer it references will be set to a buffer with the contents of the argument text. The text will be encoded in the encoding specified by the first argument. The third argument must be a pointer to an integer; the referenced integer will be set to the number of bytes in the output buffer.
es_es: Requiere tres argumentos. El primero sólo se utiliza como entrada, y debe ser un :c:expr:`const char*` que apunte al nombre de una codificación como cadena terminada en NUL, o ``NULL``, en cuyo caso se utiliza la codificación ``'utf-8'``. Se produce una excepción si Python no conoce la codificación nombrada. El segundo argumento debe ser un :c:expr:`char**`; el valor del puntero al que hace referencia se establecerá en un búfer con el contenido del texto del argumento. El texto se codificará en la codificación especificada por el primer argumento. El tercer argumento debe ser un puntero a un entero; el entero referenciado se establecerá en el número de bytes del búfer de salida.
ru: Для этого требуются три аргумента. Первый используется только в качестве входных данных и должен быть :c:expr:`const char*`, который указывает на имя кодировки в виде нуль-терминированной строки или``NULL``. В этом случае используется кодировка ``'utf-8'``. Возникает исключение, если именованная кодировка неизвестна Python. Вторым аргументом должен быть :c:expr:`char**`; значение указателя, на который он ссылается, будет установлено в буфер с содержимым текста аргумента. Текст будет закодирован в кодировке, указанной в первом аргументе. Третий аргумент должен быть указателем на целое число; целому числу, на которое ссылается ссылка, будет присвоено количество байт в выходном буфере.

source: There are two modes of operation:
es_es: Existen dos modos de operación:
ru: Существует два режима работы:

source: If *\*buffer* points a ``NULL`` pointer, the function will allocate a buffer of the needed size, copy the encoded data into this buffer and set *\*buffer* to reference the newly allocated storage. The caller is responsible for calling :c:func:`PyMem_Free` to free the allocated buffer after usage.
es_es: Si *\*buffer* apunta a un puntero ``NULL`` , la función asignará un búfer del tamaño necesario, copiará los datos codificados en este búfer y establecerá *\*buffer * para referenciar al almacenamiento recién asignado. Calleres responsable de llamar a :c:func:`PyMem_Free`para liberar el búfer asignado después del uso.
ru: Если *\*buffer* указывает на указатель ``NULL``, функция выделит буфер необходимого размера, скопирует закодированные данные в этот буфер и установит *\*buffer* для ссылки на вновь выделенное хранилище. Вызывающий объект отвечает за вызов :c:func:`PyMem_Free`, чтобы освободить выделенный буфер после использования.

source: If *\*buffer* points to a non-``NULL`` pointer (an already allocated buffer), :c:func:`PyArg_ParseTuple` will use this location as the buffer and interpret the initial value of *\*buffer_length* as the buffer size. It will then copy the encoded data into the buffer and NUL-terminate it. If the buffer is not large enough, a :exc:`ValueError` will be set.
es_es: Si *\*buffer* apunta a un puntero no-``NULL`` (un búfer ya asignado), :c:func:`PyArg_ParseTuple` usará esta ubicación como búfer e interpretará el valor inicial de * \ * buffer_length * como el tamaño del búfer. A continuación, copiará los datos codificados en el búfer y los terminará en NULL. .Si el búfer no es lo suficientemente grande, se fijará a :exc:`ValueError`.
ru: Если *\*buffer* указывает на указатель не-``NULL``(уже выделенный буфер), :c:func:`PyArg_ParseTuple` будет использовать это местоположение в качестве буфера и интерпретировать начальное значение *\*buffer_length* как размер буфера. Затем он скопирует закодированные данные в буфер и завершит его обнулением. Если буфер недостаточно велик, будет установлено значение :exc:`ValueError`.

source: In both cases, *\*buffer_length* is set to the length of the encoded data without the trailing NUL byte.
es_es: En ambos casos, *\*buffer_length * se establece en la longitud de los datos codificados sin el byte NUL final.
ru: В обоих случаях *\*buffer_length* устанавливается равным длине закодированных данных без завершающего нулевого байта.

source: ``et#`` (:class:`str`, :class:`bytes` or :class:`bytearray`) [const char \*encoding, char \*\*buffer, :c:type:`Py_ssize_t` \*buffer_length]
es_es: ``et#`` (:class:`str`, :class:`bytes` o :class:`bytearray`) [const char \*encoding, char \*\*buffer, :c:type:`Py_ssize_t` \*buffer_length]

source: Same as ``es#`` except that byte string objects are passed through without recoding them. Instead, the implementation assumes that the byte string object uses the encoding passed in as parameter.
es_es: Igual que ``es#`` excepto que los objetos de cadena de bytes se pasan sin recodificarlos, la implementación supone que el objeto de cadena de bytes utiliza la codificación pasada como parámetro.
ru: То же, что и ``es#``, за исключением того, что объекты байтовой строки передаются без их перекодирования. Вместо этого реализация предполагает, что объект байтовой строки использует кодировку, переданную в качестве параметра.

source: Numbers
es_es: Numeros
ru: Числа

source: ``b`` (:class:`int`) [unsigned char]
es_es: ``b`` (:class:`int`) [caracteres sin firmar]

source: Convert a nonnegative Python integer to an unsigned tiny int, stored in a C :c:expr:`unsigned char`.
es_es: Convierte un entero Python no negativo en un pequeño int sin signo, almacenado en un fichero C :c:expr:`unsigned char`.
ru: Преобразует неотрицательное целое число Python в крошечный int без знака, хранящийся в C :c:expr:`unsigned char`.

source: Convert a Python integer to a tiny int without overflow checking, stored in a C :c:expr:`unsigned char`.
es_es: Convierte un entero Python en un diminuto int sin comprobación de desbordamiento, almacenado en un C :c:expr:`unsigned char`.
ru: Преобразует целое число Python в крошечный int без проверки переполнения, сохраненный в C :c:expr:`unsigned char`.

source: Convert a Python integer to a C :c:expr:`short int`.
es_es: Convierte un entero Python en un entero C :c:expr:`short int`.
ru: Преобразует целое число Python в C :c:expr:`short int`.

source: Convert a Python integer to a C :c:expr:`unsigned short int`, without overflow checking.
es_es: Convierte un entero Python en un entero C :c:expr:`unsigned short int`, sin comprobación de desbordamiento.
ru: Преобразует целое число Python в C :c:expr:`unsigned short int` без проверки переполнения.

source: Convert a Python integer to a plain C :c:expr:`int`.
es_es: Convierte un entero Python en un entero C :c:expr:`int`.
ru: Преобразует целое число Python в обычный C :c:expr:`int`.

source: Convert a Python integer to a C :c:expr:`unsigned int`, without overflow checking.
es_es: Convierte un entero Python en un entero C :c:expr:`unsigned int`, sin comprobación de desbordamiento.
ru: Преобразует целое число Python в C :c:expr:`unsigned int` без проверки переполнения.

source: Convert a Python integer to a C :c:expr:`long int`.
es_es: Convierte un entero Python en un entero C :c:expr:`long int`.
ru: Преобразует целое число Python в C :c:expr:`long int`.

source: Convert a Python integer to a C :c:expr:`unsigned long` without overflow checking.
es_es: Convierte un entero Python en un C :c:expr:`unsigned long` sin comprobación de desbordamiento.
ru: Преобразует целое число Python в C :c:expr:`unsigned long` без проверки переполнения.

source: Convert a Python integer to a C :c:expr:`long long`.
es_es: Convierte un entero Python en un C :c:expr:`long long`.
ru: Преобразует целое число Python в C :c:expr:`long long`.

source: Convert a Python integer to a C :c:expr:`unsigned long long` without overflow checking.
es_es: Convierte un entero Python en un entero C :c:expr:`unsigned long long` sin comprobación de desbordamiento.
ru: Преобразует целое число Python в C :c:expr:`unsigned long long` без проверки переполнения.

source: Convert a Python integer to a C :c:type:`Py_ssize_t`.
es_es: Convertir un entero de Python en un C :c:type:`Py_ssize_t`.
ru: Преобразует целое число Python в C :c:type:`Py_ssize_t`.

source: ``c`` (:class:`bytes` or :class:`bytearray` of length 1) [char]
es_es: ``c`` (:class:`bytes` o :class:`bytearray` de longitud 1) [char]

source: Convert a Python byte, represented as a :class:`bytes` or :class:`bytearray` object of length 1, to a C :c:expr:`char`.
es_es: Convierte un byte Python, representado como un objeto :class:`bytes` o :class:`bytearray` de longitud 1, en un objeto C :c:expr:`char`.
ru: Преобразует байт Python, представленный как объект :class:`bytes` или:class:`bytearray` длины 1, в C :c:expr:`char`.

source: Allow :class:`bytearray` objects.
es_es: Permitir objetos :class:`bytearray`.
ru: Разрешает объекты :class:`bytearray`.

source: ``C`` (:class:`str` of length 1) [int]
es_es: ``C`` (:class:`str` de longitud 1) [int]

source: Convert a Python character, represented as a :class:`str` object of length 1, to a C :c:expr:`int`.
es_es: Convierte un carácter Python, representado como un objeto :class:`str` de longitud 1, en un carácter C :c:expr:`int`.
ru: Преобразует символ Python, представленный как объект :class:`str` длиной 1, в C :c:expr:`int`.

source: Convert a Python floating point number to a C :c:expr:`float`.
es_es: Convertir un número de coma flotante de Python en un número de C :c:expr:`float`.
ru: Преобразует число с плавающей точкой Python в C :c:expr:`float`.

source: Convert a Python floating point number to a C :c:expr:`double`.
es_es: Convertir un número de coma flotante de Python en un número de C :c:expr:`double`.
ru: Преобразует число с плавающей точкой Python в C :c:expr:`double`.

source: Convert a Python complex number to a C :c:type:`Py_complex` structure.
es_es: Convertir un entero de Python en una estructura C :c:type:`Py_complex`.
ru: Преобразует комплексное число Python в структуру C :c:type:`Py_complex`.

source: Other objects
es_es: Otros objetos
ru: Другие объекты

source: Store a Python object (without any conversion) in a C object pointer. The C program thus receives the actual object that was passed. A new :term:`strong reference` to the object is not created (i.e. its reference count is not increased). The pointer stored is not ``NULL``.
es_es: Almacenar un objeto Python (sin ninguna conversión) en un puntero de objeto C. El programa C recibe así el objeto real que se le pasó. No se crea una nueva referencia :term:`strong` al objeto (es decir, no se incrementa su número de referencias). El puntero almacenado no es ``NULL``.
ru: Сохраняет объект Python (без какого-либо преобразования) в указателе на объект C. Таким образом, программа C получает фактический объект, который был передан. Новая :term:`strong reference` на объект не создается (т.е. количество его ссылок не увеличивается). Сохраненный указатель не является ``NULL``.

source: Store a Python object in a C object pointer. This is similar to ``O``, but takes two C arguments: the first is the address of a Python type object, the second is the address of the C variable (of type :c:expr:`PyObject*`) into which the object pointer is stored. If the Python object does not have the required type, :exc:`TypeError` is raised.
es_es: Almacena un objeto Python en un puntero a objeto C. Esto es similar a ``O``, pero toma dos argumentos C: el primero es la dirección de un objeto de tipo Python, el segundo es la dirección de la variable C (de tipo :c:expr:`PyObject*`) en la que se almacena el puntero a objeto. Si el objeto Python no tiene el tipo requerido, aparece :exc:`TypeError`.
ru: Сохраняет объект Python в указателе на объект C . Это похоже на ``O``, но принимает два аргумента C: первый - это адрес объекта типа Python, второй - адрес переменной C (типа :c:expr:`PyObject*`), в которой хранится указатель на объект. Если объект Python не имеет требуемого типа, вызывается :exc:`TypeError`.

source: Convert a Python object to a C variable through a *converter* function. This takes two arguments: the first is a function, the second is the address of a C variable (of arbitrary type), converted to :c:expr:`void *`. The *converter* function in turn is called as follows::
es_es: Convierte un objeto Python en una variable C mediante una función *converter*. Ésta toma dos argumentos: el primero es una función, el segundo es la dirección de una variable C (de tipo arbitrario), convertida a :c:expr:`void *`. La función *converter* a su vez se llama de la siguiente manera::
ru: Преобразуйте объект Python в переменную C с помощью функции *converter*. Для этого требуется два аргумента: первый - функция, второй - адрес переменной C (произвольного типа), преобразованный в :c:expr:`void*`. Функция *converter*, в свою очередь, вызывается следующим образом::

source: where *object* is the Python object to be converted and *address* is the :c:expr:`void*` argument that was passed to the ``PyArg_Parse*`` function. The returned *status* should be ``1`` for a successful conversion and ``0`` if the conversion has failed. When the conversion fails, the *converter* function should raise an exception and leave the content of *address* unmodified.
es_es: donde *object* es el objeto Python a convertir y *address* es el argumento :c:expr:`void*` que se pasó a la función ``PyArg_Parse*``. El *status* devuelto debería ser ``1`` para una conversión exitosa y ``0`` si la conversión ha fallado. Cuando la conversión falla, la función *converter* debe lanzar una excepción y dejar el contenido de *address* sin modificar.
ru: где *object* - это объект Python, подлежащий преобразованию, а *address* - это аргумент :c:expr:`void*`, который был передан функции ``PyArg_Parse*``. Возвращаемый *статус* должен быть ``1`` для успешного преобразования и ``0``, если преобразование завершилось неудачей. При сбое преобразования функция *converter* должна вызвать исключение и оставить содержимое *address* неизмененным.

source: If the *converter* returns ``Py_CLEANUP_SUPPORTED``, it may get called a second time if the argument parsing eventually fails, giving the converter a chance to release any memory that it had already allocated. In this second call, the *object* parameter will be ``NULL``; *address* will have the same value as in the original call.
es_es: Sí el *converter* devuelve ``Py_CLEANUP_SUPPORTED``, se puede llamar por segunda vez si el análisis de argumentos finalmente falla, lo que le da a converter la oportunidad de liberar cualquier memoria que ya haya asignado. En esta segunda llamada, el parámetro *objeto* será ``NULL``; *address* tendrá el mismo valor que en la llamada original.
ru: Если *converter* возвращает ``Py_CLEANUP_SUPPORTED``, он может быть вызван во второй раз, если синтаксический анализ аргумента в конечном итоге завершится неудачей, что даст конвертеру возможность освободить любую память, которую он уже выделил. В этом втором вызове параметром *object* будет ``NULL``; *address* будет иметь то же значение, что и в исходном вызове.

source: ``Py_CLEANUP_SUPPORTED`` was added.
es_es: Se añadió``Py_CLEANUP_SUPPORTED``.
ru: ``Py_CLEANUP_SUPPORTED`` был добавлен.

source: Tests the value passed in for truth (a boolean **p**\ redicate) and converts the result to its equivalent C true/false integer value. Sets the int to ``1`` if the expression was true and ``0`` if it was false. This accepts any valid Python value. See :ref:`truth` for more information about how Python tests values for truth.
es_es: Comprueba la verdad del valor pasado (un redicado booleano **p**\) y convierte el resultado en su valor entero C verdadero/falso equivalente. Fija el int en ``1`` si la expresxión es verdadera y ``0`` si es falsa. Esto acepta cualquier valor de Python válido. Ver :ref:`truth`para obtener más información sobre cómo Python prueba los valores verdaderos.
ru: Проверяет переданное значение на истинность (логическое значение **p**\ redicate) и преобразует результат в его эквивалентное целочисленное значение C true/false. Устанавливает значение int равным ``1``, если выражение было истинным, и ``0``, если оно было ложным. Это принимает любое допустимое значение Python. Смотрите :ref:`truth` для получения дополнительной информации о том, как Python проверяет значения на истинность.

source: The object must be a Python sequence whose length is the number of format units in *items*. The C arguments must correspond to the individual format units in *items*. Format units for sequences may be nested.
es_es: El objeto debe ser una secuencia de Python cuya longitud es el número de unidades formateadas en *items*. Los argumentos de C deben corresponder a las unidades de formato individuales en *items*. Las unidades de formato para secuencias pueden estar anidadas.
ru: Объектом должна быть последовательность Python, длина которой равна количеству единиц формата в *items*. Аргументы C должны соответствовать отдельным единицам формата в *items*. Единицы формата для последовательностей могут быть вложенными.

source: It is possible to pass "long" integers (integers whose value exceeds the platform's :c:macro:`LONG_MAX`) however no proper range checking is done --- the most significant bits are silently truncated when the receiving field is too small to receive the value (actually, the semantics are inherited from downcasts in C --- your mileage may vary).
es_es: Es posible pasar enteros "longs" (enteros cuyo valor excede el :c:macro:`LONG_MAX` de la plataforma) sin embargo no se hace una comprobación de rango apropiada --- los bits más significativos se truncan silenciosamente cuando el campo receptor es demasiado pequeño para recibir el valor (en realidad, la semántica se hereda de downcasts en C --- su kilometraje puede variar).
ru: Можно передавать "длинные" целые числа (целые числа, значение которых превышает значение платформы :c:macro:`LONG_MAX`), однако надлежащая проверка диапазона не выполняется - наиболее значимые биты автоматически усекаются, когда принимающее поле слишком мало для получения значения (на самом деле семантика этого поведения унаследована от даункастов в C --- ваш пробег может отличаться).

source: A few other characters have a meaning in a format string. These may not occur inside nested parentheses. They are:
es_es: Algunos otros caracteres tienen un significado en una cadena de formato. Es posible que no aparezcan dentro de paréntesis anidados. Son:
ru: Несколько других символов имеют значение в строке формата. Они могут не встречаться внутри вложенных круглых скобок. Это:

source: Indicates that the remaining arguments in the Python argument list are optional. The C variables corresponding to optional arguments should be initialized to their default value --- when an optional argument is not specified, :c:func:`PyArg_ParseTuple` does not touch the contents of the corresponding C variable(s).
es_es: Indica que los argumentos restantes en la lista de argumentos de Python son opcionales. Las variables C correspondientes a los argumentos opcionales deben inicializarse a su valor predeterminado --- cuando no se especifica un argumento opcional, :c:func:`PyArg_ParseTuple` no toca el contenido de la-s variable-s C correspondiente(s).
ru: Указывает, что остальные аргументы в списке аргументов Python являются необязательными. Переменные C, соответствующие необязательным аргументам, должны быть инициализированы их значением по умолчанию --- когда необязательный аргумент не указан, :c:func:`PyArg_ParseTuple` не затрагивает содержимое соответствующих переменных C.

source: :c:func:`PyArg_ParseTupleAndKeywords` only: Indicates that the remaining arguments in the Python argument list are keyword-only. Currently, all keyword-only arguments must also be optional arguments, so ``|`` must always be specified before ``$`` in the format string.
es_es: :c:func:`PyArg_ParseTupleAndKeywords` only: indica que los argumentos restantes en la lista de argumentos de Python son solo palabras clave. Actualmente, todos los argumentos de solo palabras clave también deben ser argumentos opcionales., así ``|`` siempre debe especificarse antes de ``$`` en la cadena de formato.
ru: Только для :c:func:`PyArg_ParseTupleAndKeywords`: указывает, что остальные аргументы в списке аргументов Python являются только ключевыми словами. В настоящее время все аргументы, содержащие только ключевые слова, также должны быть необязательными аргументами, поэтому ``|`` всегда должно указываться перед ``$`` в строке формата.

source: The list of format units ends here; the string after the colon is used as the function name in error messages (the "associated value" of the exception that :c:func:`PyArg_ParseTuple` raises).
es_es: La lista de unidades de formato termina aquí; la cadena después de los dos puntos se usa como el nombre de la función en los mensajes de error (el "valor asociado" de la excepción que gener :c:func:`PyArg_ParseTuple`).
ru: На этом список единиц форматирования заканчивается; строка после двоеточия используется в качестве имени функции в сообщениях об ошибках ("связанное значение" исключения, которое вызывает :c:func:`PyArg_ParseTuple`.
