Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/arg.po
Languages: es_es, ru

source: Convert a C :c:expr:`unsigned long long` to a Python integer object.
es_es: Convierte un C :c:expr:`unsigned long long` en un objeto entero de Python.
ru: Преобразует C :c:expr:`unsigned long long` в целочисленный объект Python.

source: Convert a C :c:type:`Py_ssize_t` to a Python integer.
es_es: Convertir un C :c:type:`Py_ssize_t` en un entero de Python.
ru: Преобразует С :c:type:`Py_ssize_t` в целое число Python.

source: ``c`` (:class:`bytes` of length 1) [char]
es_es: ``c`` (:class:`bytes` de longitud 1) [char]

source: Convert a C :c:expr:`int` representing a byte to a Python :class:`bytes` object of length 1.
es_es: Convierte un C :c:expr:`int` que representa un byte en un objeto Python :class:`bytes` de longitud 1.
ru: Преобразует C :c:expr:`int` представляющий байт, в объект Python :class:`bytes` длиной 1.

source: Convert a C :c:expr:`int` representing a character to Python :class:`str` object of length 1.
es_es: Convierte un C :c:expr:`int` que representa un carácter en un objeto Python :class:`str` de longitud 1.
ru: Преобразует C :c:expr:`int` представляющий символ, в объект Python :class:`str` длиной 1.

source: Convert a C :c:expr:`double` to a Python floating point number.
es_es: Convierte un C :c:expr:`double` en un número de coma flotante de Python.
ru: Преобразует C :c:expr:`double` в число с плавающей точкой Python.

source: Convert a C :c:expr:`float` to a Python floating point number.
es_es: Convierte un C :c:expr:`float` en un número de coma flotante de Python.
ru: Преобразует C :c:expr:`float` в число с плавающей точкой Python.

source: Convert a C :c:type:`Py_complex` structure to a Python complex number.
es_es: Convertir una estructura C :c:type:`Py_complex` en un número complejo de Python.
ru: Преобразует структуру C :c:type:`Py_complex` в комплексное число Python.

source: Pass a Python object untouched but create a new :term:`strong reference` to it (i.e. its reference count is incremented by one). If the object passed in is a ``NULL`` pointer, it is assumed that this was caused because the call producing the argument found an error and set an exception. Therefore, :c:func:`Py_BuildValue` will return ``NULL`` but won't raise an exception. If no exception has been raised yet, :exc:`SystemError` is set.
es_es: Pasa un objeto Python intacto pero crea una nueva referencia :term:`strong` a él (es decir, su cuenta de referencias se incrementa en uno). Si el objeto pasado es un puntero ``NULL``, se asume que esto se originó porque la llamada que produjo el argumento encontró un error y estableció una excepción. Por lo tanto, :c:func:`Py_BuildValue` devolverá ``NULL`` pero no lanzará una excepción. Si todavía no se ha lanzado ninguna excepción, se establece :exc:`SystemError`.
ru: Передает объект Python нетронутым, но создает новый :term:`strong reference` на него (т.е. количество его ссылок увеличивается на единицу). Если переданный объект является указателем ``NULL``, предполагается, что это было вызвано тем, что вызов, генерирующий аргумент, обнаружил ошибку и установил исключение. Следовательно, :c:func:`Py_BuildValue` вернет ``NULL`` , но не вызовет исключение. Если исключение еще не было вызвано, устанавливается :exc:`SystemError`.

source: Same as ``O``.
es_es: Igual que ``O``.
ru: То же, что ``O``.

source: Same as ``O``, except it doesn't create a new :term:`strong reference`. Useful when the object is created by a call to an object constructor in the argument list.
es_es: Igual que ``O``, excepto que no crea una nueva referencia :term:`strong`. Útil cuando el objeto se crea mediante una llamada a un constructor de objetos en la lista de argumentos.
ru: То же, что и ``O``, за исключением того, что оно не создает новый :term:`strong reference`. Полезно, когда объект создается вызовом конструктора объекта в списке аргументов.

source: Convert *anything* to a Python object through a *converter* function. The function is called with *anything* (which should be compatible with :c:expr:`void*`) as its argument and should return a "new" Python object, or ``NULL`` if an error occurred.
es_es: Convierte *cualquier cosa* en un objeto Python mediante una función *converter*. La función se llama con *cualquier cosa* (que debe ser compatible con :c:expr:`void*`) como argumento y debe devolver un "nuevo" objeto Python, o ``NULL`` si se ha producido un error.
ru: Преобразует *anything* в объект Python с помощью функции *converter*. Функция вызывается с *anything* (который должен быть совместим с :c:expr:`void*`)в качестве аргумента и должна возвращать "новый" объект Python или ``NULL``, если произошла ошибка.

source: Convert a sequence of C values to a Python tuple with the same number of items.
es_es: Convertir una secuencia de valores de C en una tupla de Python con la misma cantidad de elementos.
ru: Преобразует последовательность значений C в кортеж Python с таким же количеством элементов.

source: Convert a sequence of C values to a Python list with the same number of items.
es_es: Convertir una secuencia de valores de C en una lista de Python con el mismo número de elementos.
ru: Преобразует последовательность значений C в список Python с таким же количеством элементов.

source: Convert a sequence of C values to a Python dictionary. Each pair of consecutive C values adds one item to the dictionary, serving as key and value, respectively.
es_es: Convertir una secuencia de valores de C en un diccionario de Python. Cada par de valores C consecutivos agrega un elemento al diccionario, sirviendo como clave y valor, respectivamente.
ru: Преобразует последовательность значений C в словарь Python. Каждая пара последовательных значений C добавляет один элемент в словарь, служащий ключом и значением соответственно.

source: If there is an error in the format string, the :exc:`SystemError` exception is set and ``NULL`` returned.
es_es: Si hay un error en la cadena de formato, se establece la excepción :exc:`SystemError` y se devuelve ``NULL``.
ru: Если в строке формата есть ошибка, устанавливается исключение :exc:`SystemError` и возвращается ``NULL``.

source: Identical to :c:func:`Py_BuildValue`, except that it accepts a va_list rather than a variable number of arguments.
es_es: Idéntico a :c:func:`Py_BuildValue`, excepto que acepta va_list en lugar de un número variable de argumentos.
ru: Идентичен :c:func:`Py_BuildValue`, за исключением того, что он принимает va_list, а не переменное количество аргументов.

source: Convert a Python Unicode object to a C pointer to a NUL-terminated buffer of Unicode characters. You must pass the address of a :c:type:`Py_UNICODE` pointer variable, which will be filled with the pointer to an existing Unicode buffer. Please note that the width of a :c:type:`Py_UNICODE` character depends on compilation options (it is either 16 or 32 bits). The Python string must not contain embedded null code points; if it does, a :exc:`ValueError` exception is raised.
ru: Преобразуйте объект Python Unicode в указатель C на NUL-терминированный буфер символов Unicode. Вы должны передать адрес переменной-указателя,:c:type:`Py_UNICODE` которая будет заполнена указателем на существующий буфер Unicode. Обратите внимание, :c:type:`Py_UNICODE`что ширина символа зависит от опций компиляции (это либо 16, либо 32 бита). Строка Python не должна содержать встроенных нулевых кодовых точек; если они есть, :exc:`ValueError`будет вызвано исключение.

source: Part of the old-style :c:type:`Py_UNICODE` API; please migrate to using :c:func:`PyUnicode_AsWideCharString`.
ru: Часть :c:type:`Py_UNICODE`API старого образца; пожалуйста, перейдите на использование:c:func:`PyUnicode_AsWideCharString` .

source: This variant on ``u`` stores into two C variables, the first one a pointer to a Unicode data buffer, the second one its length. This variant allows null code points.
ru: В этом варианте ``u``в две переменные C записывается указатель на буфер данных Unicode, а во вторую - его длина. Этот вариант допускает нулевые кодовые точки.

source: Like ``u``, but the Python object may also be ``None``, in which case the :c:type:`Py_UNICODE` pointer is set to ``NULL``.
ru: Как и``u`` , но объект Python может быть и ``None``, в этом случае :c:type:`Py_UNICODE`указатель устанавливается на ``NULL``.

source: Like ``u#``, but the Python object may also be ``None``, in which case the :c:type:`Py_UNICODE` pointer is set to ``NULL``.
ru: Как и ``u#``, но объект Python может быть и ``None``, в этом случае:c:type:`Py_UNICODE` указатель устанавливается на``NULL`` .
