Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/arg.po
Languages: es_es, ru

source: Parsing arguments and building values
es_es: Analizar argumentos y construir valores
ru: Анализ аргументов и построение значений

source: These functions are useful when creating your own extensions functions and methods. Additional information and examples are available in :ref:`extending-index`.
es_es: Estas funciones son útiles cuandoi cree sus propias funciones, extensiones y métodos. Hay disponibles información adicional y ejemplos en :ref:`extending-index`.
ru: Эти функции полезны при создании ваших собственных расширений, функций и методов. Дополнительная информация и примеры доступны в :ref:`extending-index`.

source: The first three of these functions described, :c:func:`PyArg_ParseTuple`, :c:func:`PyArg_ParseTupleAndKeywords`, and :c:func:`PyArg_Parse`, all use *format strings* which are used to tell the function about the expected arguments. The format strings use the same syntax for each of these functions.
es_es: Las tres primeras de estas funciones descritas,:c:func:`PyArg_ParseTuple`, :c:func:`PyArg_ParseTupleAndKeywords`, y :c:func:`PyArg_Parse`, todas usan *cadenas de formato* que se usan para informar a la función sobre los argumentos esperados. Las cadenas de formato utilizan la misma sintaxis para cada una de estas funciones.
ru: Первые три из этих функций описаны, :c:func:`PyArg_ParseTuple`, :c:func:`PyArg_ParseTupleAndKeywords`, и :c:func:`PyArg_Parse`, все они используют *строки формата*, которые используются для сообщения функции об ожидаемых аргументах. Строки формата используют один и тот же синтаксис для каждой из этих функций.

source: Parsing arguments
es_es: Analizando argumentos
ru: Анализ аргументов

source: A format string consists of zero or more "format units." A format unit describes one Python object; it is usually a single character or a parenthesized sequence of format units. With a few exceptions, a format unit that is not a parenthesized sequence normally corresponds to a single address argument to these functions. In the following description, the quoted form is the format unit; the entry in (round) parentheses is the Python object type that matches the format unit; and the entry in [square] brackets is the type of the C variable(s) whose address should be passed.
es_es: Un string de formato consta de cero o mas "unidades de formato". Una unidad de formato describe un objeto de Python; habitualmente un sólo carácter o una secuencia parentesizada de unidades de formato. Con algunas excepciones, una unidad de formato que no es una secuencia parentesizada, señala normalmente un solo argumento a esas funciones. En la siguiente descripción, la forma "entrecomillada" es la unidad de formato; la entrada entre (paréntesis) es el objeto tipo de Python que corresponde a la unidad de formato; y la entrada entre [corchetes] es el tipo de variables C cuyas direcciones deben ser pasadas.
ru: Строка формата состоит из нуля или более "единиц формата". Единица формата описывает один объект Python; обычно это один символ или заключенная в круглые скобки последовательность единиц формата. За некоторыми исключениями, единица формата, которая не является последовательностью, заключенной в круглые скобки, обычно соответствует единственному аргументу адреса для этих функций. В следующем описании форма в кавычках - это единица формата; запись в (круглых) скобках - это тип объекта Python, соответствующий единице формата; а запись в [квадратных] скобках - это тип переменных C, адрес которых должен быть передан.

source: Strings and buffers
es_es: Strings y buffers
ru: Строки и буферы

source: These formats allow accessing an object as a contiguous chunk of memory. You don't have to provide raw storage for the returned unicode or bytes area.
es_es: Estos formatos permiten acceder a un objeto como una porción contigua de memoria. No es necesario proporcionar almacenamiento sin formato para el área unicode o bytes devuelta.
ru: Эти форматы позволяют обращаться к объекту как к непрерывному фрагменту памяти. Вам не нужно предоставлять необработанное хранилище для возвращаемой области unicode или bytes.

source: Unless otherwise stated, buffers are not NUL-terminated.
es_es: A menos que se declare otra cosa, los buffers no son NUL-terminated.
ru: Если не указано иное, буферы не NUL-терминированные.

source: There are three ways strings and buffers can be converted to C:
es_es: Hay tres formas de convertir cadenas y buffers a C:
ru: Существует три способа преобразования строк и буферов в C:

source: Formats such as ``y*`` and ``s*`` fill a :c:type:`Py_buffer` structure. This locks the underlying buffer so that the caller can subsequently use the buffer even inside a :c:type:`Py_BEGIN_ALLOW_THREADS` block without the risk of mutable data being resized or destroyed. As a result, **you have to call** :c:func:`PyBuffer_Release` after you have finished processing the data (or in any early abort case).
es_es: Formatos como ``y*`` y ``s*`` llenan una estructura :c:type:`Py_buffer`. Esto bloquea el búfer subyacente para que el llamante pueda utilizar posteriormente el búfer incluso dentro de un bloque :c:type:`Py_BEGIN_ALLOW_THREADS` sin riesgo de que los datos mutables cambien de tamaño o se destruyan. Como resultado, **hay que llamar** a :c:func:`PyBuffer_Release` después de haber terminado de procesar los datos (o en cualquier caso de cancelación anticipada).
ru: Такие форматы, как ``y*`` и ``s*`` заполняют структуру :c:type:`Py_buffer` Это блокирует базовый буфер, так что вызывающий может впоследствии использовать буфер даже внутри блока :c:type:`Py_BEGIN_ALLOW_THREADS` без риска изменения размера или уничтожения изменяемых данных. В результате ** вы должны вызвать** :c:func:`PyBuffer_Release` после завершения обработки данных (или в любом случае раннего прерывания).

source: The ``es``, ``es#``, ``et`` and ``et#`` formats allocate the result buffer. **You have to call** :c:func:`PyMem_Free` after you have finished processing the data (or in any early abort case).
es_es: Los formatos ``es``, ``es#``, ``et`` y ``et#`` asignan el búfer de resultados. **Hay que llamar** :c:func:`PyMem_Free` después de haber terminado de procesar los datos (o en cualquier caso de aborto anticipado).
ru: Форматы ``es``, ``es#``, ``et`` и ``et#`` выделяют результирующий буфер. **Вы должны вызвать** :c:func:`PyMem_Free` после завершения обработки данных (или в любом случае раннего прерывания).

source: Other formats take a :class:`str` or a read-only :term:`bytes-like object`, such as :class:`bytes`, and provide a ``const char *`` pointer to its buffer. In this case the buffer is "borrowed": it is managed by the corresponding Python object, and shares the lifetime of this object. You won't have to release any memory yourself.
es_es: Otros formatos toman un :class:`str` o un objeto :term:`bytes-like` de sólo lectura, como :class:`bytes`, y proporcionan un puntero ``const char *`` a su búfer. En este caso, el búfer es "prestado": es gestionado por el objeto Python correspondiente, y comparte el tiempo de vida de este objeto. No tendrás que liberar ninguna memoria tú mismo.
ru: Другие форматы принимают :class:`str` или доступный только для чтения :term:`bytes-like object`, такой как :class:`bytes`, и предоставляют указатель ``const char *`` на его буфер. В этом случае буфер "заимствован": он управляется соответствующим объектом Python и разделяет время жизни этого объекта. Вам не придется освобождать память самостоятельно.

source: To ensure that the underlying buffer may be safely borrowed, the object's :c:member:`PyBufferProcs.bf_releasebuffer` field must be ``NULL``. This disallows common mutable objects such as :class:`bytearray`, but also some read-only objects such as :class:`memoryview` of :class:`bytes`.
es_es: Para garantizar que el búfer subyacente pueda tomarse prestado de forma segura, el campo :c:member:`PyBufferProcs.bf_releasebuffer` del objeto debe ser ``NULL``. Esto excluye objetos mutables comunes como :class:`bytearray`, pero también algunos objetos de sólo lectura como :class:`memoryview` de :class:`bytes`.
ru: Чтобы гарантировать, что базовый буфер может быть безопасно заимствован, поле объекта :c:member:`PyBufferProcs.bf_releasebuffer` должно быть ``NULL``. Это запрещает обычные изменяемые объекты, такие как :class:`bytearray`, но также некоторые объекты, доступные только для чтения, такие как :class:`memoryview` из :class:`bytes`.

source: Besides this ``bf_releasebuffer`` requirement, there is no check to verify whether the input object is immutable (e.g. whether it would honor a request for a writable buffer, or whether another thread can mutate the data).
es_es: Además de este requisito de ``bf_releasebuffer``, no hay ninguna comprobación para verificar si el objeto de entrada es inmutable (por ejemplo, si respetaría una solicitud de un búfer escribible, o si otro hilo puede mutar los datos).
ru: Помимо этого требования ``bf_releasebuffer`` нет никакой проверки, чтобы убедиться, является ли входной объект неизменяемым (например, удовлетворит ли он запрос буфера с возможностью записи или другой поток может изменить данные).

source: For all ``#`` variants of formats (``s#``, ``y#``, etc.), the macro :c:macro:`PY_SSIZE_T_CLEAN` must be defined before including :file:`Python.h`. On Python 3.9 and older, the type of the length argument is :c:type:`Py_ssize_t` if the :c:macro:`PY_SSIZE_T_CLEAN` macro is defined, or int otherwise.
es_es: Para todas las variantes de formatos ``#`` (``s#``, ``y#``, etc.), la macro :c:macro:`PY_SSIZE_T_CLEAN` debe estar definida antes de incluir :file:`Python.h`. En Python 3.9 y versiones anteriores, el tipo del argumento de longitud es :c:type:`Py_ssize_t` si la macro :c:macro:`PY_SSIZE_T_CLEAN` está definida, o int en caso contrario.
ru: Для всех вариантов форматов ``#`` (``s#``, ``y#``, и т.д.), макрос :c:macro:`PY_SSIZE_T_CLEAN` должен быть определен перед включением :file:`Python.h`. В Python 3.9 и более ранних версиях типом длины аргумента является :c:type:`Py_ssize_t` если определен макрос :c:macro:`PY_SSIZE_T_CLEAN` или int в противном случае.

source: Convert a Unicode object to a C pointer to a character string. A pointer to an existing string is stored in the character pointer variable whose address you pass. The C string is NUL-terminated. The Python string must not contain embedded null code points; if it does, a :exc:`ValueError` exception is raised. Unicode objects are converted to C strings using ``'utf-8'`` encoding. If this conversion fails, a :exc:`UnicodeError` is raised.
es_es: Convierta un objeto Unicode en un puntero C en una cadena de caracteres. Un puntero a una cadena existente se almacena en la variable de puntero de caracteres cuya dirección pasa. La cadena C es NUL-terminated. La cadena de Python no debe contener puntos de código nulos incrustados; si lo hace, se genera una excepción:exc:`ValueError`. Los objetos Unicode se convierten a cadenas C utilizando la codificación ``'utf-8'``. Si esta conversión falla,, se genera una:exc:`UnicodeError`.
ru: Преобразует объект Unicode в указатель C на символьную строку. Указатель на существующую строку хранится в переменной символьного указателя, адрес которой вы передаете. Строка C завершается нулем. Строка Python не должна содержать встроенных нулевых кодовых позиций; если это так, возникает исключение :exc:`ValueError`. Объекты Unicode преобразуются в строки C с использованием кодировки ``'utf-8'``. Если это преобразование завершается неудачей, возникает ошибка :exc:`UnicodeError`.

source: This format does not accept :term:`bytes-like objects <bytes-like object>`. If you want to accept filesystem paths and convert them to C character strings, it is preferable to use the ``O&`` format with :c:func:`PyUnicode_FSConverter` as *converter*.
es_es: Este formato no acepta :term:`bytes-like-objects <bytes-like object>`. Si deseas aceptar las rutas del sistema de archivos y convertirlas a strings C, es preferible que utilices el formato``O&`` con :c:func:`PyUnicode_FSConverter` como *converter*.
ru: Этот формат не принимает :term:`bytes-like objects <bytes-like object>`. Если вы хотите принять пути к файловой системе и преобразовать их в символьные строки C, предпочтительно использовать формат ``O&`` с :c:func:`PyUnicode_FSConverter` в качестве *конвертера*.

source: Previously, :exc:`TypeError` was raised when embedded null code points were encountered in the Python string.
es_es: Anteriormente, se generaba :exc:`TypeError` cuando se encontraban puntos de código nulos incrustados en la cadena de Python.
ru: Ранее, :exc:`TypeError` вызывался при обнаружении встроенных нулевых кодовых позиций в строке Python.

source: ``s*`` (:class:`str` or :term:`bytes-like object`) [Py_buffer]
es_es: ``s*`` (:class:`str` o :term:`bytes-like object`) [Py_buffer]

source: This format accepts Unicode objects as well as bytes-like objects. It fills a :c:type:`Py_buffer` structure provided by the caller. In this case the resulting C string may contain embedded NUL bytes. Unicode objects are converted to C strings using ``'utf-8'`` encoding.
es_es: Este formato acepta objetos Unicode, así como objetos similares a bytes. Llena una estructura :c:type:`Py_buffer` proporcionada por caller. En este caso, la cadena C resultante puede contener bytes NULOS incrustados. Los objetos Unicode se convierten a cadenas C utilizando la codificación ``'utf-8'``.
ru: Этот формат принимает объекты Unicode, а также байто-подобные объекты. Он заполняет структуру :c:type:`Py_buffer`, предоставленную вызывающим объектом. В этом случае результирующая строка C может содержать встроенные нулевые байты. Объекты Unicode преобразуются в строки C с использованием кодировки ``'utf-8'``.

source: ``s#`` (:class:`str`, read-only :term:`bytes-like object`) [const char \*, :c:type:`Py_ssize_t`]
es_es: ``s#`` (:class:`str`, sólo lectura :term:`bytes-like object`) [const char \*, :c:type:`Py_ssize_t`]

source: Like ``s*``, except that it provides a :ref:`borrowed buffer <c-arg-borrowed-buffer>`. The result is stored into two C variables, the first one a pointer to a C string, the second one its length. The string may contain embedded null bytes. Unicode objects are converted to C strings using ``'utf-8'`` encoding.
es_es: Como ``s*``, excepto que proporciona un búfer :ref:`prestado <c-arg-borrowed-buffer>`. El resultado se almacena en dos variables C, la primera un puntero a una cadena C, la segunda su longitud. La cadena puede contener bytes nulos incrustados. Los objetos Unicode se convierten en cadenas C utilizando la codificación ``'utf-8'``.
ru: Аналогично ``s*``, за исключением того, что он предоставляет :ref:`borrowed buffer <c-arg-borrowed-buffer>`. Результат сохраняется в двух переменных C, первая из которых является указателем на строку C, вторая - ее длиной. Строка может содержать встроенные нулевые байты. Объекты Unicode преобразуются в строки C с использованием кодировки ``'utf-8'``.

source: ``z`` (:class:`str` or ``None``) [const char \*]
es_es: ``z`` (:class:`str` o ``None``) [const char \*]

source: Like ``s``, but the Python object may also be ``None``, in which case the C pointer is set to ``NULL``.
es_es: Como ``s``, pero el objeto Python también puede ser ``None``, en cuyo caso el puntero C se establece en ``NULL``.
ru: Как ``s``, но объект Python также может быть ``None``,и в этом случае указателю C присваивается значение ``NULL``.

source: ``z*`` (:class:`str`, :term:`bytes-like object` or ``None``) [Py_buffer]
es_es: ``z*`` (:class:`str`, :term:`bytes-like object` o ``None``) [Py_buffer]

source: Like ``s*``, but the Python object may also be ``None``, in which case the ``buf`` member of the :c:type:`Py_buffer` structure is set to ``NULL``.
es_es: Como ``s*``, pero el objeto Python también puede ser ``None``, en cuyo caso el miembro ``buf`` de la estructura :c:type:`Py_buffer` se configura a ``NULL``.
ru: Как ``s*``, но объект Python также может быть ``None``, и в этом случае члену ``buf`` структуры :c:type:`Py_buffer` присваивается значение ``NULL``.

source: ``z#`` (:class:`str`, read-only :term:`bytes-like object` or ``None``) [const char \*, :c:type:`Py_ssize_t`]
es_es: ``z#`` (:class:`str`, sólo lectura :term:`bytes-like object` o ``None``) [const char \*, :c:type:`Py_ssize_t`]

source: Like ``s#``, but the Python object may also be ``None``, in which case the C pointer is set to ``NULL``.
es_es: Como ``s#``, pero el objeto Python también puede ser ``None``, en cuyo caso el puntero C se establece en ``NULL``.
ru: Как ``s#``, но объект Python также может быть ``None``, и в этом случае указателю С присваивается значение ``NULL``.

source: This format converts a bytes-like object to a C pointer to a :ref:`borrowed <c-arg-borrowed-buffer>` character string; it does not accept Unicode objects. The bytes buffer must not contain embedded null bytes; if it does, a :exc:`ValueError` exception is raised.
es_es: Este formato convierte un objeto tipo bytes en un puntero C a una cadena de caracteres :ref:`borrowed <c-arg-borrowed-buffer>`; no acepta objetos Unicode. El búfer bytes no debe contener bytes nulos incrustados; si los contiene, se lanza una excepción :exc:`ValueError`.
ru: Этот формат преобразует байтоподобный объект в указатель C на строку символов :ref:`borrowed <c-arg-borrowed-buffer>`; он не принимает объекты Unicode. Буфер байтов не должен содержать встроенных нулевых байтов; если это так, возникает исключение :exc:`ValueError`.

source: Previously, :exc:`TypeError` was raised when embedded null bytes were encountered in the bytes buffer.
es_es: Anteriormente, se generaba :exc:`TypeError` cuando se encontraban bytes nulos incrustados en el búfer de bytes.
ru: Ранее, :exc:`TypeError` вызывался, когда в буфере байтов обнаруживались встроенные нулевые байты.

source: This variant on ``s*`` doesn't accept Unicode objects, only bytes-like objects. **This is the recommended way to accept binary data.**
es_es: Esta variante en ``s*`` no acepta objetos Unicode, sólo objetos similares a bytes. **Esta es la forma recomendada de aceptar datos binarios. **
ru: Этот вариант на ``s*`` не принимает объекты в Юникоде, только байто-подобные объекты. **Это рекомендуемый способ приема двоичных данных.**

source: ``y#`` (read-only :term:`bytes-like object`) [const char \*, :c:type:`Py_ssize_t`]
es_es: ``y#`` (sólo lectura :term:`bytes-like object`) [const char \*, :c:type:`Py_ssize_t`]

source: This variant on ``s#`` doesn't accept Unicode objects, only bytes-like objects.
es_es: Esta variante en ``s#`` no acepta objetos Unicode, sólo objetos similares a bytes.
ru: Этот вариант ``s#`` не принимает объекты в Юникоде, только байто-подобные объекты.

source: Requires that the Python object is a :class:`bytes` object, without attempting any conversion. Raises :exc:`TypeError` if the object is not a bytes object. The C variable may also be declared as :c:expr:`PyObject*`.
es_es: Requiere que el objeto Python sea un objeto :class:`bytes`, sin intentar ninguna conversión. Lanza :exc:`TypeError` si el objeto no es un objeto bytes. La variable C también puede declararse como :c:expr:`PyObject*`.
ru: Требуется, чтобы объект Python был объектом :class:`bytes` без попытки какого-либо преобразования. Вызывает :exc:`TypeError`, если объект не является объектом bytes. Переменная C также может быть объявлена как :c:expr:`PyObject*`.

source: Requires that the Python object is a :class:`bytearray` object, without attempting any conversion. Raises :exc:`TypeError` if the object is not a :class:`bytearray` object. The C variable may also be declared as :c:expr:`PyObject*`.
es_es: Requiere que el objeto Python sea un objeto :class:`bytearray`, sin intentar ninguna conversión. Lanza :exc:`TypeError` si el objeto no es un objeto :class:`bytearray`. La variable C también puede declararse como :c:expr:`PyObject*`.
ru: Требуется, чтобы объект Python был объектом :class:`bytearray` без попытки какого-либо преобразования. Вызывает :exc:`TypeError`, если объект не является объектом :class:`bytearray`. Переменная C также может быть объявлена как :c:expr:`PyObject*`.

source: Requires that the Python object is a Unicode object, without attempting any conversion. Raises :exc:`TypeError` if the object is not a Unicode object. The C variable may also be declared as :c:expr:`PyObject*`.
es_es: Requiere que el objeto Python sea un objeto Unicode, sin intentar ninguna conversión. Lanza :exc:`TypeError` si el objeto no es un objeto Unicode. La variable C también puede declararse como :c:expr:`PyObject*`.
ru: Требуется, чтобы объект Python был объектом Unicode, без попытки какого-либо преобразования. Вызывает :exc:`TypeError`, если объект не является объектом Unicode. Переменная C также может быть объявлена как :c:expr:`PyObject*`.

source: This format accepts any object which implements the read-write buffer interface. It fills a :c:type:`Py_buffer` structure provided by the caller. The buffer may contain embedded null bytes. The caller have to call :c:func:`PyBuffer_Release` when it is done with the buffer.
es_es: Este formato acepta cualquier objeto que implemente la interfaz de búfer de lectura y escritura. Llena una estructura :c:type:`Py_buffer` proporcionada por caller. El búfer puede contener bytes nulos incrustados. Caller tiene que llamar a :c:func:`PyBuffer_Release` cuando termina con el búfer.
ru: Этот формат принимает любой объект, который реализует интерфейс буфера чтения-записи. Он заполняет структуру :c:type:`Py_buffer` , предоставленную вызывающей стороной. Буфер может содержать встроенные нулевые байты. Вызывающий объект должен вызвать :c:func:`PyBuffer_Release`, когда это будет сделано с буфером.

source: This variant on ``s`` is used for encoding Unicode into a character buffer. It only works for encoded data without embedded NUL bytes.
es_es: Se usa esta variante en ``s`` para codificar Unicode en un búfer de caracteres. Solo funciona para datos codificados sin bytes NUL incrustados.
ru: Этот вариант на ``s`` используется для кодирования Unicode в символьный буфер. Он работает только для закодированных данных без встроенных нулевых байтов.

source: This format requires two arguments. The first is only used as input, and must be a :c:expr:`const char*` which points to the name of an encoding as a NUL-terminated string, or ``NULL``, in which case ``'utf-8'`` encoding is used. An exception is raised if the named encoding is not known to Python. The second argument must be a :c:expr:`char**`; the value of the pointer it references will be set to a buffer with the contents of the argument text. The text will be encoded in the encoding specified by the first argument.
es_es: Este formato requiere dos argumentos. El primero sólo se utiliza como entrada, y debe ser un :c:expr:`const char*` que apunte al nombre de una codificación como cadena terminada en NUL, o ``NULL``, en cuyo caso se utiliza la codificación ``'utf-8'``. Se produce una excepción si Python no conoce la codificación nombrada. El segundo argumento debe ser un :c:expr:`char**`; el valor del puntero al que hace referencia se establecerá en un búfer con el contenido del texto del argumento. El texto se codificará en la codificación especificada por el primer argumento.
ru: Этот формат требует двух аргументов. Первый используется только в качестве входных данных и должен быть :c:expr:`const char*`, который указывает на имя кодировки в виде нуль-терминированной строки, или``NULL``, в этом случае используется кодировка ``'utf-8'``. Возникает исключение, если именованная кодировка неизвестна Python. Вторым аргументом должен быть :c:expr:`char**`; значение указателя, на который он ссылается, будет установлено в буфер с содержимым текста аргумента. Текст будет закодирован в кодировке, указанной в первом аргументе.
