Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/arg.po
Languages: es_es, ru

source: The list of format units ends here; the string after the semicolon is used as the error message *instead* of the default error message. ``:`` and ``;`` mutually exclude each other.
es_es: La lista de unidades de formato termina aquí; la cadena después del punto y coma se usa como mensaje de error *en lugar* del mensaje de error predeterminad ``:`` y ``;``se excluyen mutuamente.
ru: На этом список единиц форматирования заканчивается; строка после точки с запятой используется в качестве сообщения об ошибке *вместо* сообщения об ошибке по умолчанию. ``:`` и ``;`` взаимно исключают друг друга.

source: Note that any Python object references which are provided to the caller are *borrowed* references; do not release them (i.e. do not decrement their reference count)!
es_es: Tenga en cuenta que cualquier referencia a objetos Python que se proporcione a la persona que llama son referencias *prestadas*; ¡no las libere (es decir, no disminuya su recuento de referencias)!
ru: Обратите внимание, что любые ссылки на объекты Python, которые предоставляются вызывающему объекту, являются *заимствованными* ссылками; не освобождайте их (т.е. не уменьшайте их счётчик ссылок)!

source: Additional arguments passed to these functions must be addresses of variables whose type is determined by the format string; these are used to store values from the input tuple. There are a few cases, as described in the list of format units above, where these parameters are used as input values; they should match what is specified for the corresponding format unit in that case.
es_es: Los argumentos adicionales pasados ​​a estas funciones deben ser direcciones de variables cuyo tipo esté determinado por la cadena de formato; estos se utilizan para almacenar valores de la tupla de entrada. Hay algunos casos, como se describe en la lista de unidades de formato anterior, donde estos parámetros se usan como valores de entrada; deben coincidir con lo especificado para la unidad de formato correspondiente en ese caso.
ru: Дополнительные аргументы, передаваемые этим функциям, должны быть адресами переменных, тип которых определяется строкой формата; они используются для хранения значений из входного кортежа. Есть несколько случаев, как описано в списке единиц измерения формата выше, где эти параметры используются в качестве входных значений; в этом случае они должны соответствовать тому, что указано для соответствующей единицы измерения формата.

source: For the conversion to succeed, the *arg* object must match the format and the format must be exhausted. On success, the ``PyArg_Parse*`` functions return true, otherwise they return false and raise an appropriate exception. When the ``PyArg_Parse*`` functions fail due to conversion failure in one of the format units, the variables at the addresses corresponding to that and the following format units are left untouched.
es_es: Para que la conversión tenga éxito, el objeto *arg* debe coincidir con el formato y éste debe estar agotado. En caso de éxito, las funciones ``PyArg_Parse*`` devuelven true, en caso contrario devuelven false y lanzan una excepción apropiada. Cuando las funciones ``PyArg_Parse*`` fallan debido a un fallo de conversión en una de las unidades de formato, las variables en las direcciones correspondientes a esa unidad de formato y a las siguientes se dejan intactas.
ru: Чтобы преобразование было успешным, объект *arg* должен соответствовать формату, и формат должен быть исчерпан. В случае успеха функции ``PyArg_Parse*`` возвращают значение true, в противном случае они возвращают значение false и вызывают соответствующее исключение. Когда функции ``PyArg_Parse*`` завершаются ошибкой из-за сбоя преобразования в одной из единиц формата, переменные по адресам, соответствующим этой и следующим единицам формата, остаются нетронутыми.

source: API Functions
es_es: Funciones API
ru: Функции API

source: Parse the parameters of a function that takes only positional parameters into local variables. Returns true on success; on failure, it returns false and raises the appropriate exception.
es_es: Analizar los parámetros de una función que solo toma parámetros posicionales en variables locales. Devuelve verdadero en caso de éxito; en caso de error, devuelve falso y genera la excepción adecuada.
ru: Анализирует параметры функции, которая преобразует в локальные переменные только позиционные параметры. Возвращает true при успешном выполнении; при сбое возвращает false и вызывает соответствующее исключение.

source: Identical to :c:func:`PyArg_ParseTuple`, except that it accepts a va_list rather than a variable number of arguments.
es_es: Idéntico a :c:func:`PyArg_ParseTuple`, excepto que acepta va_list en lugar de un número variable de argumentos.
ru: Идентичен :c:func:`PyArg_ParseTuple`, за исключением того, что он принимает va_list, а не переменное количество аргументов.

source: Parse the parameters of a function that takes both positional and keyword parameters into local variables. The *keywords* argument is a ``NULL``-terminated array of keyword parameter names. Empty names denote :ref:`positional-only parameters <positional-only_parameter>`. Returns true on success; on failure, it returns false and raises the appropriate exception.
es_es: Analizar los parámetros de una función que toma tanto los parámetros posicionales como los de palabras clave en variables locales. El argumento *palabras clave* es una matriz terminada en ``NULL``-de nombres de parámetros de palabras clave. Los nombres vacíos denotan :ref:`parámetros solo posicionales <positional-only_parameter>`. Devuelve verdadero en caso de éxito; en caso de error, devuelve falso y genera la excepción adecuada.
ru: Анализирует параметры функции, которая преобразует как позиционные параметры, так и параметры ключевых слов в локальные переменные. Аргумент *keywords* представляет собой массив имен параметров ключевых слов, заканчивающийся ``NULL``. Пустые имена обозначают :ref:`positional-only parameters <positional-only_parameter>`. Возвращает true при успешном выполнении; при сбое возвращает false и вызывает соответствующее исключение.

source: Added support for :ref:`positional-only parameters <positional-only_parameter>`.
es_es: Se agregó soporte para :ref:`parámetros solo posicionales <positional-only_parameter>`.
ru: Добавлена поддержка :ref:`positional-only parameters <positional-only_parameter>`.

source: Identical to :c:func:`PyArg_ParseTupleAndKeywords`, except that it accepts a va_list rather than a variable number of arguments.
es_es: Idéntico a :c:func:`PyArg_ParseTupleAndKeywords`,excepto que acepta va_list en lugar de un número variable de argumentos.
ru: Идентичен :c:func:`PyArg_ParseTupleAndKeywords`, за исключением того, что он принимает va_list, а не переменное количество аргументов.

source: Ensure that the keys in the keywords argument dictionary are strings. This is only needed if :c:func:`PyArg_ParseTupleAndKeywords` is not used, since the latter already does this check.
es_es: Asegúrese de que las claves en el diccionario de argumentos de palabras clave sean cadenas. Esto solo es necesario si:c:func:`PyArg_ParseTupleAndKeywords` no se usa, ya que este último ya hace esta verificación.
ru: Убедитесь, что ключи в словаре аргументов keywords являются строками. Это необходимо только в том случае, если :c:func:`PyArg_ParseTupleAndKeywords` не используется, поскольку последний уже выполняет эту проверку.

source: Function used to deconstruct the argument lists of "old-style" functions --- these are functions which use the :const:`METH_OLDARGS` parameter parsing method, which has been removed in Python 3. This is not recommended for use in parameter parsing in new code, and most code in the standard interpreter has been modified to no longer use this for that purpose. It does remain a convenient way to decompose other tuples, however, and may continue to be used for that purpose.
es_es: Función utilizada para deconstruir las listas de argumentos de las funciones de "old-style", estas son funciones que utilizan el método de análisis de parámetros:const:`METH_OLDARGS` que se eliminó en Python 3. No se recomienda su uso en el análisis de parámetros en código nuevo, y la mayoría del código en el intérprete estándar se ha modificado para que ya no se use con ese propósito. Sin embargo, sigue siendo una forma conveniente de descomponer otras tuplas y puede continuar usándose para ese propósito.
ru: Функция, используемая для деконструкции списков аргументов функций "старого стиля" --- это функции, которые используют метод синтаксического анализа параметров :const:`METH_OLDARGS`, который был удален в Python 3. Это не рекомендуется использовать при анализе параметров в новом коде, и большая часть кода в стандартном интерпретаторе была изменена, чтобы больше не использовать этот метод для этой цели. Однако он остается удобным способом декомпозиции других кортежей и может продолжать использоваться для этой цели.

source: A simpler form of parameter retrieval which does not use a format string to specify the types of the arguments. Functions which use this method to retrieve their parameters should be declared as :c:macro:`METH_VARARGS` in function or method tables. The tuple containing the actual parameters should be passed as *args*; it must actually be a tuple. The length of the tuple must be at least *min* and no more than *max*; *min* and *max* may be equal. Additional arguments must be passed to the function, each of which should be a pointer to a :c:expr:`PyObject*` variable; these will be filled in with the values from *args*; they will contain :term:`borrowed references <borrowed reference>`. The variables which correspond to optional parameters not given by *args* will not be filled in; these should be initialized by the caller. This function returns true on success and false if *args* is not a tuple or contains the wrong number of elements; an exception will be set if there was a failure.
es_es: Una forma más sencilla de recuperación de parámetros que no utiliza una cadena de formato para especificar los tipos de los argumentos. Las funciones que utilicen este método para recuperar sus parámetros deben declararse como :c:macro:`METH_VARARGS` en las tablas de funciones o métodos. La tupla que contiene los parámetros reales debe pasarse como *args*; debe ser realmente una tupla. La longitud de la tupla debe ser como mínimo *min* y como máximo *max*; *min* y *max* pueden ser iguales. Deben pasarse argumentos adicionales a la función, cada uno de los cuales debe ser un puntero a una variable :c:expr:`PyObject*`; éstos se rellenarán con los valores de *args*; contendrán :term:`referencias prestadas <borrowed reference>`. Las variables que corresponden a parámetros opcionales no dados por *args* no serán rellenadas; éstas deben ser inicializadas por el llamador. Esta función devuelve verdadero en caso de éxito y falso si *args* no es una tupla o contiene un número incorrecto de elementos; se establecerá una excepción si se ha producido un fallo.
ru: Более простая форма извлечения параметров, которая не использует строку формата для указания типов аргументов. Функции, которые используют этот метод для извлечения своих параметров, должны быть объявлены как :c:macro:`METH_VARARGS` в таблицах функций или методов. Кортеж, содержащий актуальные параметры, должен передаваться как *args*; это действительно должен быть кортеж. Длина кортежа должна быть не менее *min* и не более *max*; *min* и *max* могут быть равны. Функции должны быть переданы дополнительные аргументы, каждый из которых должен быть указателем на переменную :c:expr:`PyObject*`; они будут заполнены значениями из *args*; они будут содержать :term:`borrowed references <borrowed reference>`. Переменные, которые соответствуют необязательным параметрам, не указанным в *args*, заполняться не будут; они должны быть инициализированы вызывающим объектом. Эта функция возвращает true при успешном выполнении и false, если *args* не является кортежем или содержит неправильное количество элементов; в случае сбоя будет установлено исключение.

source: This is an example of the use of this function, taken from the sources for the :mod:`!_weakref` helper module for weak references::
es_es: Este es un ejemplo del uso de esta función, tomado de las fuentes del módulo de ayuda :mod:`!_weakref` para referencias débiles::
ru: Это пример использования этой функции, взятый из исходных текстов для вспомогательного модуля :mod:`!_weakref` для слабых ссылок::

source: The call to :c:func:`PyArg_UnpackTuple` in this example is entirely equivalent to this call to :c:func:`PyArg_ParseTuple`::
es_es: La llamada :c:func:`PyArg_UnpackTuple` en este ejemplo es totalmente equivalente a esta llamada a :c:func:`PyArg_ParseTuple`::
ru: Вызов :c:func:`PyArg_UnpackTuple` в этом примере полностью эквивалентен этому вызову :c:func:`PyArg_ParseTuple`::

source: Building values
es_es: Estableciendo valores
ru: Создание значений

source: Create a new value based on a format string similar to those accepted by the ``PyArg_Parse*`` family of functions and a sequence of values. Returns the value or ``NULL`` in the case of an error; an exception will be raised if ``NULL`` is returned.
es_es: Crea un nuevo valor basado en una cadena de formato similar a las aceptadas por la familia de funciones ``PyArg_Parse*`` y una secuencia de valores. Devuelve el valor o ``NULL`` en caso de error; se lanzará una excepción si se devuelve ``NULL``.
ru: Создает новое значение на основе строки формата, аналогичной тем, которые принимаются семейством функций ``PyArg_Parse*``, и последовательности значений. Возвращает значение или ``NULL`` в случае ошибки; исключение будет вызвано, если будет возвращено ``NULL``.

source: :c:func:`Py_BuildValue` does not always build a tuple. It builds a tuple only if its format string contains two or more format units. If the format string is empty, it returns ``None``; if it contains exactly one format unit, it returns whatever object is described by that format unit. To force it to return a tuple of size 0 or one, parenthesize the format string.
es_es: :c:func:`Py_BuildValue` no siempre construye una tupla. Construye una tupla solo si su cadena de formato contiene dos o más unidades de formato. Si la cadena de formato está vacía, devuelve ``None``; si contiene exactamente una unidad de formato, devuelve cualquier objeto descrito por esa unidad de formato. Para obligarlo a devolver una tupla de tamaño 0 o uno, poner entre paréntesis la cadena de formato.
ru: :c:func:`Py_BuildValue` не всегда создает кортеж. Она создает кортеж только в том случае, если строка формата содержит две или более единицы формата. Если строка формата пуста, она возвращает ``None``; если она содержит ровно одну единицу формата, она возвращает любой объект, описываемый этой единицей формата. Чтобы заставить ее возвращать кортеж размером 0 или единицу, заключите строку формата в круглые скобки.

source: When memory buffers are passed as parameters to supply data to build objects, as for the ``s`` and ``s#`` formats, the required data is copied. Buffers provided by the caller are never referenced by the objects created by :c:func:`Py_BuildValue`. In other words, if your code invokes :c:func:`malloc` and passes the allocated memory to :c:func:`Py_BuildValue`, your code is responsible for calling :c:func:`free` for that memory once :c:func:`Py_BuildValue` returns.
es_es: Cuando los búferes de memoria se pasan como parámetros para proporcionar datos para construir objetos, como en los formatos ``s`` y ``s#``, se copian los datos requeridos. Los objetos creados por caller nunca hacen referencia a los búfer proporcionados por :c:func:`Py_BuildValue`. En otras palabras, si el código llama a :c:func:`malloc` y pasa la memoria asignada a :c:func:`Py_BuildValue`, su código es responsable de llamar a :c:func:`free` para esa memoria una vez que devuelve :c:func:`Py_BuildValue`.
ru: Когда буферы памяти передаются в качестве параметров для предоставления данных для построения объектов, как для форматов ``s`` и ``s#``, копируются необходимые данные. На буферы, предоставляемые вызывающей стороной, никогда не ссылаются объекты, созданные с помощью :c:func:`Py_BuildValue`. Другими словами, если ваш код вызывает :c:func:`malloc` и передает выделенную память :c:func:`Py_BuildValue`, ваш код отвечает за вызов :c:func:`free` для этой памяти, как только :c:func:`Py_BuildValue` возвращается.

source: In the following description, the quoted form is the format unit; the entry in (round) parentheses is the Python object type that the format unit will return; and the entry in [square] brackets is the type of the C value(s) to be passed.
es_es: En la siguiente descripción, la forma citada es la unidad de formato; la entrada entre paréntesis (redondos) es el tipo de objeto de Python que devolverá la unidad de formato; y la entrada entre corchetes [cuadrados] es el tipo de valor(es) de C a pasar.
ru: В следующем описании форма в кавычках - это единица формата; запись в (круглых) скобках - это тип объекта Python, который вернет единица формата; а запись в [квадратных] скобках - это тип передаваемых значений C .

source: The characters space, tab, colon and comma are ignored in format strings (but not within format units such as ``s#``). This can be used to make long format strings a tad more readable.
es_es: Los caracteres de espacio, tabulador, dos puntos y coma se ignoran en cadenas de formato (pero no dentro de unidades de formato como ``s#``). Esto se puede usar para hacer que las cadenas de formato largo sean un poco más legibles.
ru: Символы пробела, табуляции, двоеточия и запятой игнорируются в строках формата (но не в единицах формата, таких как ``s#``). Это можно использовать, чтобы сделать длинные строки формата немного более удобочитаемыми.

source: ``s`` (:class:`str` or ``None``) [const char \*]
es_es: ``s`` (:class:`str` o ``None``) [const char \*]

source: Convert a null-terminated C string to a Python :class:`str` object using ``'utf-8'`` encoding. If the C string pointer is ``NULL``, ``None`` is used.
es_es: Convertir una cadena C terminada en nulo en un objeto Python :class:`str` usando la codificación ``'utf-8'``. Si el puntero de la cadena C es ``NULL``, se usa ``None``.
ru: Преобразует нуль-терминированную строку C в объект Python :class:`str`, используя кодировку ``'utf-8'``. Если указатель на строку C равен ``NULL``, используется ``None``.

source: ``s#`` (:class:`str` or ``None``) [const char \*, :c:type:`Py_ssize_t`]
es_es: ``s#`` (:class:`str` o ``None``) [const char \*, :c:type:`Py_ssize_t`]

source: Convert a C string and its length to a Python :class:`str` object using ``'utf-8'`` encoding. If the C string pointer is ``NULL``, the length is ignored and ``None`` is returned.
es_es: Convertir una cadena C y su longitud en un objeto Python :class:`str` usando la codificación ``'utf-8'``. Si el puntero de la cadena C es ``NULL``, la longitud se ignora y se devuelve ``None``.
ru: Преобразует строку C и ее длину в объект Python :class:`str`, используя кодировку ``'utf-8'``. Если указатель на строку C равен ``NULL``, длина игнорируется и возвращается ``None``.

source: This converts a C string to a Python :class:`bytes` object. If the C string pointer is ``NULL``, ``None`` is returned.
es_es: Esto convierte una cadena C en un objeto Python :class:`bytes`. Si el puntero de la cadena C es ``NULL``, se devuelve``None``.
ru: Преобразует строку С в объект Python :class:`bytes`. Если указатель строки С равен ``NULL``, возвращается ``None``.

source: This converts a C string and its lengths to a Python object. If the C string pointer is ``NULL``, ``None`` is returned.
es_es: Esto convierte una cadena C y sus longitudes en un objeto de Python. Si el puntero de la cadena C es ``NULL``, se devuelve ``None``.
ru: Это преобразует строку C и ее длины в объект Python. Если указатель на строку C равен ``NULL``, возвращается ``None``.

source: Same as ``s``.
es_es: Igual que ``s``.
ru: То же, что ``s``.

source: ``z#`` (:class:`str` or ``None``) [const char \*, :c:type:`Py_ssize_t`]
es_es: ``z#`` (:class:`str` o ``None``) [const char \*, :c:type:`Py_ssize_t`]

source: Same as ``s#``.
es_es: Igual que ``s#``.
ru: То же, что ``s#``.

source: Convert a null-terminated :c:type:`wchar_t` buffer of Unicode (UTF-16 or UCS-4) data to a Python Unicode object. If the Unicode buffer pointer is ``NULL``, ``None`` is returned.
es_es: Convierte un búfer :c:type:`wchar_t` terminado en cero de datos Unicode (UTF-16 o UCS-4) en un objeto Python Unicode. Si el puntero del búfer Unicode es ``NULL``, se devuelve ``None``.
ru: Преобразует нуль-терминированный буфер данных Unicode (UTF-16 или UCS-4) :c:type:`wchar_t` в объект Unicode на Python. Если указатель буфера Unicode равен ``NULL``, возвращается ``None``.

source: Convert a Unicode (UTF-16 or UCS-4) data buffer and its length to a Python Unicode object. If the Unicode buffer pointer is ``NULL``, the length is ignored and ``None`` is returned.
es_es: Convertir un búfer de datos Unicode (UTF-16 o UCS-4) y su longitud en un objeto Python Unicode. Si el puntero del búfer Unicode es``NULL``, ignora la longitud y se devuelve ``None``.
ru: Преобразует буфер данных Unicode (UTF-16 или UCS-4) и его длину в объект Unicode на Python. Если указатель буфера в Юникоде равен ``NULL``, длина игнорируется и возвращается ``None``.

source: ``U`` (:class:`str` or ``None``) [const char \*]
es_es: ``U`` (:class:`str` o ``None``) [const char \*]

source: ``U#`` (:class:`str` or ``None``) [const char \*, :c:type:`Py_ssize_t`]
es_es: ``U#`` (:class:`str` o ``None``) [const char \*, :c:type:`Py_ssize_t`]

source: Convert a plain C :c:expr:`int` to a Python integer object.
es_es: Convierte un C simple :c:expr:`int` en un objeto entero de Python.
ru: Преобразует обычный С :c:expr:`int` в целочисленный объект Python.

source: Convert a plain C :c:expr:`char` to a Python integer object.
es_es: Convierte un C :c:expr:`char` simple en un objeto entero de Python.
ru: Преобразует обычный С :c:expr:`char` в целочисленный объект Python.

source: Convert a plain C :c:expr:`short int` to a Python integer object.
es_es: Convierte un C :c:expr:`short int` simple en un objeto entero de Python.
ru: Преобразует обычный C :c:expr:`short int` в целочисленный объект Python.

source: Convert a C :c:expr:`long int` to a Python integer object.
es_es: Convierte un C :c:expr:`long int` en un objeto entero de Python.
ru: Преобразует C :c:expr:`long int` в целочисленный объект Python.

source: Convert a C :c:expr:`unsigned char` to a Python integer object.
es_es: Convierte un C :c:expr:`unsigned char` en un objeto entero de Python.
ru: Преобразует C :c:expr:`unsigned char` в целочисленный объект Python.

source: Convert a C :c:expr:`unsigned short int` to a Python integer object.
es_es: Convierte un C :c:expr:`unsigned short int` en un objeto entero de Python.
ru: Преобразует C :c:expr:`unsigned short int` в целочисленный объект Python.

source: Convert a C :c:expr:`unsigned int` to a Python integer object.
es_es: Convierte un C :c:expr:`unsigned int` en un objeto entero de Python.
ru: Преобразует C :c:expr:`unsigned int` в целочисленный объект Python.

source: Convert a C :c:expr:`unsigned long` to a Python integer object.
es_es: Convierte un C :c:expr:`unsigned long` en un objeto entero de Python.
ru: Преобразует C :c:expr:`unsigned long` в целочисленный объект Python.

source: Convert a C :c:expr:`long long` to a Python integer object.
es_es: Convierte un C :c:expr:`long long` en un objeto entero de Python.
ru: Преобразует C :c:expr:`long long` в целочисленный объект Python.
