Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/bytearray.po
Languages: es_es, ru

source: Byte Array Objects
es_es: Objetos de Matriz de bytes
ru: Объекты Байтовых Массивов

source: This subtype of :c:type:`PyObject` represents a Python bytearray object.
es_es: Este subtipo de :c:type:`PyObject` representa un objeto bytearray de Python.
ru: Этот подтип :c:type:`PyObject` представляет собой объект bytearray

source: This instance of :c:type:`PyTypeObject` represents the Python bytearray type; it is the same object as :class:`bytearray` in the Python layer.
es_es: Esta instancia de :c:type:`PyTypeObject` representa el tipo bytearray de Python; es el mismo objeto que :class:`bytearray` en la capa de Python.
ru: Этот экземпляр :c:type:`PyTypeObject` представляет тип Python bytearray; это тот же объект, что и :class:`bytearray` на уровне Python.

source: Type check macros
es_es: Escribir las macros de verificación
ru: Макросы проверки типа

source: Return true if the object *o* is a bytearray object or an instance of a subtype of the bytearray type. This function always succeeds.
es_es: Devuelve verdadero si el objeto *o* es un objeto bytearray o una instancia de un subtipo del tipo bytearray. Esta función siempre tiene éxito.
ru: Возвращает значение true, если объект *o* является объектом bytearray или экземпляром подтипа типа bytearray. Эта функция всегда выполняется успешно.

source: Return true if the object *o* is a bytearray object, but not an instance of a subtype of the bytearray type. This function always succeeds.
es_es: Devuelve verdadero si el objeto *o* es un objeto bytearray, pero no una instancia de un subtipo del tipo bytearray. Esta función siempre tiene éxito.
ru: Возвращает значение true, если объект *o* является объектом bytearray, но не экземпляром подтипа типа bytearray. Эта функция всегда выполняется успешно.

source: Direct API functions
es_es: Funciones API directas
ru: Прямые функции API

source: Return a new bytearray object from any object, *o*, that implements the :ref:`buffer protocol <bufferobjects>`.
es_es: Devuelve un nuevo objeto bytearray desde cualquier objeto, *o*, que implemente el protocolo :ref:`buffer <bufferobjects>`.
ru: Возвращает новый объект bytearray из любого объекта *o*, который реализует :ref:`buffer protocol <bufferobjects>`.

source: On failure, return ``NULL`` with an exception set.
ru: В случае неудачи верните NULL с установленным исключением.

source: Create a new bytearray object from *string* and its length, *len*.
ru: Создайте новый объект bytearray из *string* и его длины *len*.

source: Concat bytearrays *a* and *b* and return a new bytearray with the result.
es_es: Concatena bytearrays *a* y *b* y devuelve un nuevo bytearray con el resultado.
ru: Объединяет байтовые массивы *a* и *b* и верните новый байтовый массив с результатом.

source: Return the size of *bytearray* after checking for a ``NULL`` pointer.
es_es: Devuelve el tamaño de *bytearray* después de buscar un puntero ``NULL``.
ru: Возвращает размер *bytearray* после проверки наличия ``NULL`` указателя.

source: Return the contents of *bytearray* as a char array after checking for a ``NULL`` pointer. The returned array always has an extra null byte appended.
es_es: Devuelve el contenido de *bytearray* como una matriz de caracteres después de buscar un puntero ``NULL``. La matriz devuelta siempre tiene un byte nulo adicional adjunto.
ru: Возвращает содержимое *bytearray* в виде массива символов после проверки на наличие указателя ``NULL`` . К возвращаемому массиву всегда добавляется дополнительный байт null.

source: Resize the internal buffer of *bytearray* to *len*.
es_es: Cambiar el tamaño del búfer interno de *bytearray* a *len*.
ru: Изменяет размер внутреннего буфера *bytearray* на *len*.

source: Macros
ru: Макрос

source: These macros trade safety for speed and they don't check pointers.
es_es: Estas macros intercambian seguridad por velocidad y no comprueban los punteros.
ru: Эти макросы обменивают безопасность на скорость и не проверяют указатели.

source: Similar to :c:func:`PyByteArray_AsString`, but without error checking.
ru: Аналогично :c:func:`PyByteArray_AsString`, но без проверки ошибок.

source: Similar to :c:func:`PyByteArray_Size`, but without error checking.
ru: Аналогично :c:func:`PyByteArray_Size`, но без проверки ошибок.

source: object
es_es: objeto
ru: объект

source: bytearray
ru: байтовый массив
