Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/call.po
Languages: es_es

source: Call Protocol
es_es: Protocolo de llamada

source: CPython supports two different calling protocols: *tp_call* and vectorcall.
es_es: CPython admite dos protocolos de llamadas diferentes: *tp_call* y vectorcall.

source: The *tp_call* Protocol
es_es: El Protocolo *tp_call*

source: Instances of classes that set :c:member:`~PyTypeObject.tp_call` are callable. The signature of the slot is::
es_es: Las instancias de clases que configuran :c:member:`~PyTypeObject.tp_call` son vocables. La firma del slot es::

source: A call is made using a tuple for the positional arguments and a dict for the keyword arguments, similarly to ``callable(*args, **kwargs)`` in Python code. *args* must be non-NULL (use an empty tuple if there are no arguments) but *kwargs* may be *NULL* if there are no keyword arguments.
es_es: Se realiza una llamada usando una tupla para los argumentos posicionales y un dict para los argumentos de palabras clave, de manera similar a ``callable(*args, **kwargs)`` en código Python. *args* no debe ser NULL (usar una tupla vacía si no hay argumentos) pero *kwargs* puede ser *NULL* si no hay argumentos de palabras clave.

source: This convention is not only used by *tp_call*: :c:member:`~PyTypeObject.tp_new` and :c:member:`~PyTypeObject.tp_init` also pass arguments this way.
es_es: Esta convención no sólo se utiliza por *tp_call*: :c:member:`~PyTypeObject.tp_new` y :c:member:`~PyTypeObject.tp_init` también se pasan argumentos de esta manera.

source: To call an object, use :c:func:`PyObject_Call` or another :ref:`call API <capi-call>`.
es_es: Para llamar a un objeto, usar :c:func:`PyObject_Call` u otra :ref:`call API <capi-call>`.

source: The Vectorcall Protocol
es_es: El protocolo Vectorcall

source: The vectorcall protocol was introduced in :pep:`590` as an additional protocol for making calls more efficient.
es_es: El protocolo vectorcall se introdujo en :pep:`590` como un protocolo adicional para hacer que las llamadas sean mos eficientes.

source: As rule of thumb, CPython will prefer the vectorcall for internal calls if the callable supports it. However, this is not a hard rule. Additionally, some third-party extensions use *tp_call* directly (rather than using :c:func:`PyObject_Call`). Therefore, a class supporting vectorcall must also implement :c:member:`~PyTypeObject.tp_call`. Moreover, the callable must behave the same regardless of which protocol is used. The recommended way to achieve this is by setting :c:member:`~PyTypeObject.tp_call` to :c:func:`PyVectorcall_Call`. This bears repeating:
es_es: Como regla general, CPython preferirá vectorcall para llamadas internas si el invocable lo admite. Sin embargo, esta no es una regla estricta. Además, algunas extensiones de terceros usan *tp_call* directamente (en lugar de usar :c:func:`PyObject_Call`). Por lo tanto, una clase que admita vectorcall también debe implementar:c:member:`~PyTypeObject.tp_call`. Además, el invocable debe comportarse de la misma manera independientemente del protocolo que se utilice. La forma recomendada de lograr esto es estableciendo:c:member:`~PyTypeObject.tp_call` a :c:func:`PyVectorcall_Call`. Esto vale la pena repetir:

source: A class supporting vectorcall **must** also implement :c:member:`~PyTypeObject.tp_call` with the same semantics.
es_es: Una clase que soporte vectorcall **debe** también implementar :c:member:`~PyTypeObject.tp_call` con la misma semántica.

source: A class should not implement vectorcall if that would be slower than *tp_call*. For example, if the callee needs to convert the arguments to an args tuple and kwargs dict anyway, then there is no point in implementing vectorcall.
es_es: Una clase no debe implementar vectorcall si eso fuera más lento que *tp_call*. Por ejemplo, si el destinatario necesita convertir los argumentos en una tupla args y dictar kwargs de todos modos, entonces no tiene sentido implementar vectorcall.

source: *callable* is the object being called.
es_es: *callable* es el objeto que se llama.

source: *args* is a C array consisting of the positional arguments followed by the
es_es: *args* es una matriz C que consiste en los argumentos posicionales seguidos por el

source: values of the keyword arguments. This can be *NULL* if there are no arguments.
es_es: valores de los argumentos de palabra clave. Esto puede ser *NULL* si no hay argumentos.

source: *nargsf* is the number of positional arguments plus possibly the
es_es: *nargsf* es el número de argumentos posicionales más posiblemente el indicador

source: *kwnames* is a tuple containing the names of the keyword arguments;
es_es: *kwnames* es una tupla que contiene los nombres de los argumentos de palabras clave;

source: in other words, the keys of the kwargs dict. These names must be strings (instances of ``str`` or a subclass) and they must be unique. If there are no keyword arguments, then *kwnames* can instead be *NULL*.
es_es: en otras palabras, las claves de los kwargs dict. Estos nombres deben ser cadenas (instancias de ``str`` o una subclase) y deben ser únicos. Si no hay argumentos de palabra clave, entonces *kwnames* puede ser *NULL*.

source: If this flag is set in a vectorcall *nargsf* argument, the callee is allowed to temporarily change ``args[-1]``. In other words, *args* points to argument 1 (not 0) in the allocated vector. The callee must restore the value of ``args[-1]`` before returning.
es_es: Si este indicador se establece en un argumento vectorcall *nargsf*, el destinatario puede cambiar temporalmente ``args[-1]``. En otras palabras, *args* apunta al argumento 1 (no 0) en el vector asignado. El receptor de la llamada debe restaurar el valor de ``args[-1]`` antes de regresar.

source: For :c:func:`PyObject_VectorcallMethod`, this flag means instead that ``args[0]`` may be changed.
es_es: Para :c:func:`PyObject_VectorcallMethod`, esta señal indica que se puede cambiar ``args[0]``.

source: To call an object that implements vectorcall, use a :ref:`call API <capi-call>` function as with any other callable. :c:func:`PyObject_Vectorcall` will usually be most efficient.
es_es: Para llamar a un objeto que implementa vectorcall, usar una función a :ref:`call API <capi-call>` como con cualquier otro invocable. :c:func:`PyObject_Vectorcall` generalmente será más eficiente.

source: Recursion Control
es_es: Control de recursividad

source: When using *tp_call*, callees do not need to worry about :ref:`recursion <recursion>`: CPython uses :c:func:`Py_EnterRecursiveCall` and :c:func:`Py_LeaveRecursiveCall` for calls made using *tp_call*.
es_es: Al usar *tp_call*, callees no necesita preocuparse por <recursion>`: CPython usa :c:func:`Py_EnterRecursiveCall` y :c:func:`Py_LeaveRecursiveCall` para llamadas realizadas usando *tp_call*.

source: For efficiency, this is not the case for calls done using vectorcall: the callee should use *Py_EnterRecursiveCall* and *Py_LeaveRecursiveCall* if needed.
es_es: Para mayor eficiencia, este no es el caso de las llamadas realizadas usando vectorcall: callee debe usar *Py_EnterRecursiveCall* y *Py_LeaveRecursiveCall* si fuera necesario.

source: Vectorcall Support API
es_es: API de soporte de vectorcall

source: Given a vectorcall *nargsf* argument, return the actual number of arguments. Currently equivalent to::
es_es: Dado un argumento vectorcall *nargsf*, devuelve el número real de argumentos. Actualmente equivalente a::

source: However, the function ``PyVectorcall_NARGS`` should be used to allow for future extensions.
es_es: Sin embargo, la función ``PyVectorcall_NARGS``debe usarse para permitir futuras extensiones.

source: If *op* does not support the vectorcall protocol (either because the type does not or because the specific instance does not), return *NULL*. Otherwise, return the vectorcall function pointer stored in *op*. This function never raises an exception.
es_es: Si *op* no admite el protocolo vectorcall (ya sea porque el tipo no lo admite o porque la instancia específica no lo admite), devolver *NULL*. De lo contrario, devuelve el puntero de función vectorcall almacenado en *op*. Esta función nunca genera una excepción.

source: This is mostly useful to check whether or not *op* supports vectorcall, which can be done by checking ``PyVectorcall_Function(op) != NULL``.
es_es: Esto es muy útil para comprobar si *op* admite o no vectorcall, lo que se puede hacer comprobando``PyVectorcall_Function(op) != NULL``.

source: Call *callable*'s :c:type:`vectorcallfunc` with positional and keyword arguments given in a tuple and dict, respectively.
es_es: Llamar *callable*'s :c:type:`vectorcallfunc` con argumentos posicionales y de palabras clave dados en una tupla y un dict, respectivamente.

source: Object Calling API
es_es: API de llamada de objetos

source: Various functions are available for calling a Python object. Each converts its arguments to a convention supported by the called object – either *tp_call* or vectorcall. In order to do as little conversion as possible, pick one that best fits the format of data you have available.
es_es: Hay varias funciones disponibles para llamar a un objeto Python. Cada uno convierte sus argumentos a una convención soportada por el objeto llamado – ya sea *tp_call* o vectorcall. Para realizar la menor conversión posible, elegir la que mejor se ajuste al formato de datos que hay disponible.

source: The following table summarizes the available functions; please see individual documentation for details.
es_es: La siguiente tabla resume las funciones disponibles; consultar la documentación individual para tener más detalles.

source: Function
es_es: Función

source: callable
es_es: invocable

source: args
es_es: argumentos

source: tuple
es_es: tupla

source: 1 object
es_es: 1 objeto

source: tuple/``NULL``
es_es: tupla/``NULL``

source: format
es_es: formato

source: variadic
es_es: variado

source: obj + name
es_es: obj + nombre

source: arg + name
es_es: arg + nombre

source: Call a callable Python object *callable*, with arguments given by the tuple *args*, and named arguments given by the dictionary *kwargs*.
es_es: Llame a un objeto Python invocable **callable*, con argumentos dados por la tupla *args* y ​​argumentos con nombre dados por el diccionario *kwargs*.

source: *args* must not be *NULL*; use an empty tuple if no arguments are needed. If no named arguments are needed, *kwargs* can be *NULL*.
es_es: *args* no debe ser *NULL*; utilice una tupla vacía si no se necesitan argumentos. Si no se necesitan argumentos con nombre, *kwargs* puede ser *NULL*.

source: Return the result of the call on success, or raise an exception and return *NULL* on failure.
es_es: Devuelve el resultado de la llamada en caso de éxito, o genera una excepción y devuelve *NULL* en caso de error.

source: This is the equivalent of the Python expression: ``callable(*args, **kwargs)``.
es_es: Este es el equivalente de la expresión de Python:``callable(*args, **kwargs)``.

source: Call a callable Python object *callable* without any arguments. It is the most efficient way to call a callable Python object without any argument.
es_es: Llame a un objeto Python invocable *callable* sin ningún argumento. Es la forma más eficaz de llamar a un objeto Python invocable sin ningún argumento.

source: Call a callable Python object *callable* with exactly 1 positional argument *arg* and no keyword arguments.
es_es: Llame a un objeto Python invocable *callable* con exactamente 1 argumento posicional *arg* y sin argumentos de palabras clave.

source: Call a callable Python object *callable*, with arguments given by the tuple *args*. If no arguments are needed, then *args* can be *NULL*.
es_es: Llame a un objeto Python invocable *callable*, con argumentos dados por la tupla *args*. Si no se necesitan argumentos, entonces *args* puede ser *NULL*.

source: This is the equivalent of the Python expression: ``callable(*args)``.
es_es: Este es el equivalente de la expresión de Python: ``callable(*args)``.

source: Call a callable Python object *callable*, with a variable number of C arguments. The C arguments are described using a :c:func:`Py_BuildValue` style format string. The format can be *NULL*, indicating that no arguments are provided.
es_es: Llamar a un objeto Python invocable *callable*, con un número variable de argumentos C. Los argumentos de C se describen utilizando una cadena de formato de estilo :c:func:`Py_BuildValue`. El formato puede ser *NULL*, lo que indica que no se proporcionan argumentos.

source: The type of *format* was changed from ``char *``.
es_es: El tipo de *format* se cambió de ``char *``.

source: Call the method named *name* of object *obj* with a variable number of C arguments. The C arguments are described by a :c:func:`Py_BuildValue` format string that should produce a tuple.
es_es: Llamar al método denominado *name* del objeto *obj* con un número variable de argumentos C. Los argumentos de C se describen mediante una cadena de formato :c:func:`Py_BuildValue` que debería producir una tupla.

source: The format can be *NULL*, indicating that no arguments are provided.
es_es: El formato puede ser *NULL*, lo que indica que no se proporcionan argumentos.

source: This is the equivalent of the Python expression: ``obj.name(arg1, arg2, ...)``.
es_es: Este es el equivalente de la expresión de Python: ``obj.name(arg1, arg2, ...)``.

source: The types of *name* and *format* were changed from ``char *``.
es_es: Los tipos de *name* se cambiaron de ``char *``.

source: This is the equivalent of the Python expression: ``callable(arg1, arg2, ...)``.
es_es: Este es el equivalente de la expresión de Python: ``callable(arg1, arg2, ...)``.

source: Call a method of the Python object *obj* without arguments, where the name of the method is given as a Python string object in *name*.
es_es: Llama a un método del objeto Python *obj* sin argumentos, donde el nombre del método se da como un objeto Python string en *name*.

source: Call a method of the Python object *obj* with a single positional argument *arg*, where the name of the method is given as a Python string object in *name*.
es_es: Llama a un método del objeto Python *obj* con un único argumento posicional *arg*, donde el nombre del método se da como un objeto de cadena Python en *name*.

source: Call a callable Python object *callable*. The arguments are the same as for :c:type:`vectorcallfunc`. If *callable* supports vectorcall_, this directly calls the vectorcall function stored in *callable*.
es_es: Llama a un objeto Python *callable*. Los argumentos son los mismos que para :c:type:`vectorcallfunc`. Si *callable* soporta vectorcall_, esto llama directamente a la función vectorcall almacenada en *callable*.

source: Call *callable* with positional arguments passed exactly as in the vectorcall_ protocol, but with keyword arguments passed as a dictionary *kwdict*. The *args* array contains only the positional arguments.
es_es: Llama a *callable* con argumentos posicionales pasados exactamente como en el protocolo vectorcall_, pero con argumentos de palabra clave pasados como un diccionario *kwdict*. El array *args* contiene sólo los argumentos posicionales.

source: Regardless of which protocol is used internally, a conversion of arguments needs to be done. Therefore, this function should only be used if the caller already has a dictionary ready to use for the keyword arguments, but not a tuple for the positional arguments.
es_es: Independientemente del protocolo que se utilice internamente, es necesario realizar una conversión de los argumentos. Por lo tanto, esta función sólo debe utilizarse si caller ya tiene un diccionario listo para usar para los argumentos de palabra clave, pero no una tupla para los argumentos posicionales.

source: Call Support API
es_es: API de soporte de llamada

source: Determine if the object *o* is callable. Return ``1`` if the object is callable and ``0`` otherwise. This function always succeeds.
es_es: Determinar si el objeto *o* es invocable. Devuelve ``1`` si el objeto es invocable y ``0`` en caso contrario. Esta función siempre tiene éxito.
