Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/complex.po
Languages: ru

source: Complex Number Objects
ru: Объекты комплексных чисел

source: Python's complex number objects are implemented as two distinct types when viewed from the C API: one is the Python object exposed to Python programs, and the other is a C structure which represents the actual complex number value. The API provides functions for working with both.
ru: Объекты комплексных чисел Python реализованы как два различных типа, если смотреть через API C: один — это объект Python, доступный программам Python, а другой — структура C, которая представляет фактическое значение комплексного числа. API предоставляет функции для работы с обоими. .

source: Complex Numbers as C Structures
ru: Комплексные числа как структуры C

source: Note that the functions which accept these structures as parameters and return them as results do so *by value* rather than dereferencing them through pointers. This is consistent throughout the API.
ru: Обратите внимание, что функции, которые принимают эти структуры в качестве параметров и возвращают их в качестве результатов, делают это *по значению*, а не разыменовывают их через указатели. Это единообразно во всем API.

source: The C structure which corresponds to the value portion of a Python complex number object. Most of the functions for dealing with complex number objects use structures of this type as input or output values, as appropriate.
ru: Структура C, соответствующая части значения объекта комплексного числа Python. Большинство функций для работы с комплексными числовыми объектами используют структуры этого типа в качестве входных или выходных значений в зависимости от ситуации.

source: The structure is defined as::
ru: Структура определяется как:

source: Return the sum of two complex numbers, using the C :c:type:`Py_complex` representation.
ru: Возвращает сумму двух комплексных чисел, используя представление C :c:type:`Py_complex`.

source: Return the difference between two complex numbers, using the C :c:type:`Py_complex` representation.
ru: Возвращает разницу между двумя комплексными числами, используя представление C :c:type:`Py_complex`.

source: Return the negation of the complex number *num*, using the C :c:type:`Py_complex` representation.
ru: Верните отрицание комплексного числа *num*, используя представление C :c:type:`Py_complex`.

source: Return the product of two complex numbers, using the C :c:type:`Py_complex` representation.
ru: Возвращает произведение двух комплексных чисел, используя представление C :c:type:`Py_complex`.

source: Return the quotient of two complex numbers, using the C :c:type:`Py_complex` representation.
ru: Возвращает частное двух комплексных чисел, используя представление C :c:type:`Py_complex`.

source: If *divisor* is null, this method returns zero and sets :c:data:`errno` to :c:macro:`!EDOM`.
ru: Если *divisor* равен нулю, этот метод возвращает ноль и устанавливает :c:data:`errno` в :c:macro:`!EDOM`.

source: Return the exponentiation of *num* by *exp*, using the C :c:type:`Py_complex` representation.
ru: Верните возведение *num* в степень с помощью *exp*, используя представление C :c:type:`Py_complex`.

source: If *num* is null and *exp* is not a positive real number, this method returns zero and sets :c:data:`errno` to :c:macro:`!EDOM`.
ru: Если *num* имеет значение null и *exp* не является положительным действительным числом, этот метод возвращает ноль и устанавливает :c:data:`errno` в :c:macro:`!EDOM`.

source: Complex Numbers as Python Objects
ru: Комплексные числа как объекты Python

source: This subtype of :c:type:`PyObject` represents a Python complex number object.
ru: Этот подтип :c:type:` PyObject` представляет объект комплексного числа Python.

source: This instance of :c:type:`PyTypeObject` represents the Python complex number type. It is the same object as :class:`complex` in the Python layer.
ru: Этот экземпляр :c:type:`PyTypeObject` представляет тип комплексного числа Python. Это тот же объект, что и :class:`complex` на уровне Python.

source: Return true if its argument is a :c:type:`PyComplexObject` or a subtype of :c:type:`PyComplexObject`. This function always succeeds.
ru: Возвращает true, если его аргументом является :c:type:`PyComplexObject` или подтип :c:type:`PyComplexObject`. Эта функция всегда завершается успешно.

source: Return true if its argument is a :c:type:`PyComplexObject`, but not a subtype of :c:type:`PyComplexObject`. This function always succeeds.
ru: Возвращает true, если его аргументом является :c:type:`PyComplexObject`, но не подтип :c:type:`PyComplexObject`. Эта функция всегда завершается успешно.

source: Create a new Python complex number object from a C :c:type:`Py_complex` value. Return ``NULL`` with an exception set on error.
ru: Создайте новый объект комплексного числа Python на основе значения C :c:type:`Py_complex`. Возвращает ``NULL`` с исключением, установленным в случае ошибки.

source: Return a new :c:type:`PyComplexObject` object from *real* and *imag*. Return ``NULL`` with an exception set on error.
ru: Верните новый объект :c:type:`PyComplexObject` из *real* и *imag*. Возвращает ``NULL`` с исключением, установленным в случае ошибки.

source: Return the real part of *op* as a C :c:expr:`double`.
ru: Верните действительную часть *op* как C :c:expr:`double`.

source: Upon failure, this method returns ``-1.0`` with an exception set, so one should call :c:func:`PyErr_Occurred` to check for errors.
ru: В случае сбоя этот метод возвращает ``-1.0`` с набором исключений, поэтому следует вызвать :c:func:`PyErr_Occurred` для проверки на наличие ошибок.

source: Return the imaginary part of *op* as a C :c:expr:`double`.
ru: Верните мнимую часть *op* как C :c:expr:`double`.

source: Return the :c:type:`Py_complex` value of the complex number *op*.
ru: Верните значение :c:type:`Py_complex` комплексного числа *op*.

source: If *op* is not a Python complex number object but has a :meth:`~object.__complex__` method, this method will first be called to convert *op* to a Python complex number object. If :meth:`!__complex__` is not defined then it falls back to :meth:`~object.__float__`. If :meth:`!__float__` is not defined then it falls back to :meth:`~object.__index__`.
ru: Если *op* не является объектом комплексного числа Python, но имеет метод :meth:`~object.__complex__`, этот метод сначала будет вызван для преобразования *op* в объект комплексного числа Python. Если :meth:`!__complex__` не определен, то он возвращается к :meth:`~object.__float__`. Если :meth:`!__float__` не определен, то он возвращается к :meth:`~object.__index__`.

source: Upon failure, this method returns :c:type:`Py_complex` with :c:member:`~Py_complex.real` set to ``-1.0`` and with an exception set, so one should call :c:func:`PyErr_Occurred` to check for errors.
ru: В случае сбоя этот метод возвращает :c:type:`Py_complex` с :c:member:`~Py_complex.real`, установленным в ``-1.0`` и с набором исключений, поэтому следует вызвать :c:func:` PyErr_Occurred` для проверки ошибок.

source: Use :meth:`~object.__index__` if available.
ru: Используйте :meth:`~object.__index__`, если доступно.

source: object
ru: объект

source: complex number
ru: комплексное число
