Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/concrete.po
Languages: ru

source: Concrete Objects Layer
ru: Слой конкретных объектов

source: The functions in this chapter are specific to certain Python object types. Passing them an object of the wrong type is not a good idea; if you receive an object from a Python program and you are not sure that it has the right type, you must perform a type check first; for example, to check that an object is a dictionary, use :c:func:`PyDict_Check`. The chapter is structured like the "family tree" of Python object types.
ru: Функции в этой главе относятся к определенным типам объектов Python. Передавать им объект неправильного типа — не лучшая идея; если вы получаете объект из программы Python и не уверены, что он имеет правильный тип, необходимо сначала выполнить проверку типа; например, чтобы проверить, что объект является словарем, используйте :c:func:`PyDict_Check`. Глава структурирована как «генеалогическое древо» типов объектов Python.

source: While the functions described in this chapter carefully check the type of the objects which are passed in, many of them do not check for ``NULL`` being passed instead of a valid object. Allowing ``NULL`` to be passed in can cause memory access violations and immediate termination of the interpreter.
ru: Хотя функции, описанные в этой главе, тщательно проверяют тип передаваемых объектов, многие из них не проверяют, передается ли NULL вместо допустимого объекта. Разрешение передачи NULL может привести к нарушению доступа к памяти и немедленному завершению работы интерпретатора.

source: Fundamental Objects
ru: Фундаментальные объекты

source: This section describes Python type objects and the singleton object ``None``.
ru: В этом разделе описываются объекты типа Python и одноэлементный объект None.

source: Numeric Objects
ru: Числовые объекты

source: Sequence Objects
ru: Объекты последовательности

source: Generic operations on sequence objects were discussed in the previous chapter; this section deals with the specific kinds of sequence objects that are intrinsic to the Python language.
ru: Общие операции с объектами последовательностей обсуждались в предыдущей главе; в этом разделе рассматриваются конкретные типы объектов последовательностей, присущие языку Python.

source: Container Objects
ru: Объекты контейнеры

source: Function Objects
ru: Функциональные объекты

source: Other Objects
ru: Другие объекты

source: object
ru: объект

source: numeric
ru: числовой

source: sequence
ru: последовательность

source: mapping
ru: сопоставление
