Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/function.po
Languages: ru

source: Function Objects
ru: Функциональные объекты

source: There are a few functions specific to Python functions.
ru: Есть несколько функций, специфичных для функций Python.

source: The C structure used for functions.
ru: Структура C, используемая для функций.

source: This is an instance of :c:type:`PyTypeObject` and represents the Python function type. It is exposed to Python programmers as ``types.FunctionType``.
ru: Это экземпляр :c:type:`PyTypeObject` и представляет тип функции Python. Программистам Python он предоставляется как «types.FunctionType».

source: Return true if *o* is a function object (has type :c:data:`PyFunction_Type`). The parameter must not be ``NULL``. This function always succeeds.
ru: Возвращайте true, если *o* является объектом функции (имеет тип :c:data:`PyFunction_Type`). Параметр не должен быть NULL. Эта функция всегда завершается успешно.

source: Return a new function object associated with the code object *code*. *globals* must be a dictionary with the global variables accessible to the function.
ru: Возвращает новый объект функции, связанный с объектом кода *code*. *globals* должен быть словарем с глобальными переменными, доступными для функции.

source: The function's docstring and name are retrieved from the code object. :attr:`~function.__module__` is retrieved from *globals*. The argument defaults, annotations and closure are set to ``NULL``. :attr:`~function.__qualname__` is set to the same value as the code object's :attr:`~codeobject.co_qualname` field.
ru: Строка документации и имя функции извлекаются из объекта кода. :attr:`~function.__module__` извлекается из *globals*. По умолчанию для аргументов, аннотаций и замыканий установлено значение NULL. :attr:`~function.__qualname__` имеет то же значение, что и поле :attr:`~codeobject.co_qualname` объекта кода.

source: As :c:func:`PyFunction_New`, but also allows setting the function object's :attr:`~function.__qualname__` attribute. *qualname* should be a unicode object or ``NULL``; if ``NULL``, the :attr:`!__qualname__` attribute is set to the same value as the code object's :attr:`~codeobject.co_qualname` field.
ru: Как :c:func:`PyFunction_New`, но также позволяет установить атрибут :attr:`~function.__qualname__` объекта функции. *qualname* должен быть объектом Юникода или ``NULL``; если ``NULL``, атрибуту :attr:`!__qualname__` присваивается то же значение, что и полю :attr:`~codeobject.co_qualname` объекта кода.

source: Return the code object associated with the function object *op*.
ru: Верните объект кода, связанный с объектом функции *op*.

source: Return the globals dictionary associated with the function object *op*.
ru: Возвращает словарь глобальных переменных, связанный с объектом функции *op*.

source: Return a :term:`borrowed reference` to the :attr:`~function.__module__` attribute of the :ref:`function object <user-defined-funcs>` *op*. It can be *NULL*.
ru: Верните :term:`заимствованную ссылку` на атрибут :attr:`~function.__module__` объекта :ref:`function <user-defined-funcs>` *op*. Это может быть *NULL*.

source: This is normally a :class:`string <str>` containing the module name, but can be set to any other object by Python code.
ru: Обычно это :class:`string <str>`, содержащий имя модуля, но может быть установлен в любой другой объект с помощью кода Python.

source: Return the argument default values of the function object *op*. This can be a tuple of arguments or ``NULL``.
ru: Возвращает значения аргументов по умолчанию для объекта функции *op*. Это может быть кортеж аргументов или NULL.

source: Set the argument default values for the function object *op*. *defaults* must be ``Py_None`` or a tuple.
ru: Установите значения аргументов по умолчанию для функционального объекта *op*. *по умолчанию* должно быть ``Py_None`` или кортеж.

source: Raises :exc:`SystemError` and returns ``-1`` on failure.
ru: Вызывает :exc:`SystemError` и возвращает ``-1`` в случае ошибки.

source: Set the vectorcall field of a given function object *func*.
ru: Установите поле векторного вызова данного функционального объекта *func*.

source: Warning: extensions using this API must preserve the behavior of the unaltered (default) vectorcall function!
ru: Внимание: расширения, использующие этот API, должны сохранять поведение неизмененной (по умолчанию) функции векторного вызова!

source: Return the closure associated with the function object *op*. This can be ``NULL`` or a tuple of cell objects.
ru: Верните замыкание, связанное с объектом функции *op*. Это может быть NULL или кортеж объектов ячеек.

source: Set the closure associated with the function object *op*. *closure* must be ``Py_None`` or a tuple of cell objects.
ru: Установите замыкание, связанное с функциональным объектом *op*. *замыкание* должно быть ``Py_None`` или кортежем объектов ячеек.

source: Return the annotations of the function object *op*. This can be a mutable dictionary or ``NULL``.
ru: Верните аннотации функционального объекта *op*. Это может быть изменяемый словарь или ``NULL``.

source: Set the annotations for the function object *op*. *annotations* must be a dictionary or ``Py_None``.
ru: Установите аннотации для функционального объекта *op*. *аннотации* должны быть словарем или ``Py_None``.

source: Register *callback* as a function watcher for the current interpreter. Return an ID which may be passed to :c:func:`PyFunction_ClearWatcher`. In case of error (e.g. no more watcher IDs available), return ``-1`` and set an exception.
ru: Зарегистрируйте *callback* в качестве наблюдателя за функциями текущего интерпретатора. Возвращает идентификатор, который можно передать в :c:func:`PyFunction_ClearWatcher`. В случае ошибки (например, больше нет доступных идентификаторов наблюдателей) верните ``-1`` и установите исключение.

source: Clear watcher identified by *watcher_id* previously returned from :c:func:`PyFunction_AddWatcher` for the current interpreter. Return ``0`` on success, or ``-1`` and set an exception on error (e.g. if the given *watcher_id* was never registered.)
ru: Очистить наблюдатель, определенный *watcher_id*, ранее возвращенный из :c:func:`PyFunction_AddWatcher` для текущего интерпретатора. Возвращает ``0`` в случае успеха или ``-1`` и устанавливает исключение в случае ошибки (например, если данный *watcher_id* никогда не был зарегистрирован).

source: Enumeration of possible function watcher events: - ``PyFunction_EVENT_CREATE`` - ``PyFunction_EVENT_DESTROY`` - ``PyFunction_EVENT_MODIFY_CODE`` - ``PyFunction_EVENT_MODIFY_DEFAULTS`` - ``PyFunction_EVENT_MODIFY_KWDEFAULTS``
ru: Перечисление возможных событий наблюдателя функций: - ``PyFunction_EVENT_CREATE`` - ``PyFunction_EVENT_DESTROY`` - ``PyFunction_EVENT_MODIFY_CODE`` - ``PyFunction_EVENT_MODIFY_DEFAULTS`` - ``PyFunction_EVENT_MODIFY_KWDEFAULTS``

source: Type of a function watcher callback function.
ru: Тип функции обратного вызова наблюдателя функций.

source: If *event* is ``PyFunction_EVENT_CREATE`` or ``PyFunction_EVENT_DESTROY`` then *new_value* will be ``NULL``. Otherwise, *new_value* will hold a :term:`borrowed reference` to the new value that is about to be stored in *func* for the attribute that is being modified.
ru: Если *event* равно ``PyFunction_EVENT_CREATE`` или ``PyFunction_EVENT_DESTROY``, то *new_value* будет ``NULL``. В противном случае *new_value* будет содержать заимствованную ссылку на новое значение, которое будет сохранено в *func* для изменяемого атрибута.

source: The callback may inspect but must not modify *func*; doing so could have unpredictable effects, including infinite recursion.
ru: Обратный вызов может проверять, но не должен изменять *func*; это может иметь непредсказуемые последствия, включая бесконечную рекурсию.

source: If *event* is ``PyFunction_EVENT_CREATE``, then the callback is invoked after `func` has been fully initialized. Otherwise, the callback is invoked before the modification to *func* takes place, so the prior state of *func* can be inspected. The runtime is permitted to optimize away the creation of function objects when possible. In such cases no event will be emitted. Although this creates the possibility of an observable difference of runtime behavior depending on optimization decisions, it does not change the semantics of the Python code being executed.
ru: Если *event* — это ``PyFunction_EVENT_CREATE``, то обратный вызов вызывается после полной инициализации ``func`. В противном случае обратный вызов вызывается до того, как произойдет изменение *func*, поэтому можно проверить предыдущее состояние *func*. Среде выполнения разрешается оптимизировать создание функциональных объектов, когда это возможно. В таких случаях событие не будет генерироваться. Хотя это создает возможность наблюдаемой разницы в поведении во время выполнения в зависимости от решений по оптимизации, это не меняет семантику исполняемого кода Python.

source: If *event* is ``PyFunction_EVENT_DESTROY``, Taking a reference in the callback to the about-to-be-destroyed function will resurrect it, preventing it from being freed at this time. When the resurrected object is destroyed later, any watcher callbacks active at that time will be called again.
ru: Если *event* равно ``PyFunction_EVENT_DESTROY``, использование ссылки в обратном вызове на функцию, которая будет уничтожена, воскресит ее, предотвращая ее освобождение в данный момент. Когда воскрешенный объект будет позже уничтожен, все активные в тот момент обратные вызовы наблюдателя будут вызваны снова.

source: If the callback sets an exception, it must return ``-1``; this exception will be printed as an unraisable exception using :c:func:`PyErr_WriteUnraisable`. Otherwise it should return ``0``.
ru: Если обратный вызов устанавливает исключение, он должен вернуть ``-1``; это исключение будет напечатано как невызываемое с использованием :c:func:`PyErr_WriteUnraisable`. В противном случае он должен вернуть ``0``.

source: There may already be a pending exception set on entry to the callback. In this case, the callback should return ``0`` with the same exception still set. This means the callback may not call any other API that can set an exception unless it saves and clears the exception state first, and restores it before returning.
ru: При входе в обратный вызов уже может быть установлено ожидающее исключение. В этом случае обратный вызов должен вернуть ``0`` с тем же самым установленным исключением. Это означает, что обратный вызов не может вызывать какой-либо другой API, который может установить исключение, если он сначала не сохранит и не очистит состояние исключения, а затем не восстановит его перед возвратом.

source: object
ru: объект

source: function
ru: функция

source: MethodType (in module types)
ru: MethodType (в типах модулей)
