Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/hash.po
Languages: ru

source: See also the :c:member:`PyTypeObject.tp_hash` member and :ref:`numeric-hash`.
ru: См. также член :c:member:`PyTypeObject.tp_hash` и :ref:`numeric-hash`.

source: Hash value type: signed integer.
ru: Тип значения хэша: целое число со знаком.

source: Hash value type: unsigned integer.
ru: Тип хеш-значения: целое число без знака.

source: The `Mersenne prime <https://en.wikipedia.org/wiki/Mersenne_prime>`_ ``P = 2**n -1``, used for numeric hash scheme.
ru: ``Простое число Мерсенна <https://en.wikipedia.org/wiki/Mersenne_prime>`_ ``P = 2**n -1``, используется для числовой схемы хеширования.

source: The exponent ``n`` of ``P`` in :c:macro:`PyHASH_MODULUS`.
ru: Экспонента ``n`` от ``P`` в :c:macro:`PyHASH_MODULUS`.

source: Prime multiplier used in string and various other hashes.
ru: Простой множитель, используемый в строке и других хэшах.

source: The hash value returned for a positive infinity.
ru: Хэш-значение возвращается для положительной бесконечности.

source: The multiplier used for the imaginary part of a complex number.
ru: Множитель, используемый для мнимой части комплексного числа.

source: Hash function definition used by :c:func:`PyHash_GetFuncDef`.
ru: Определение хэш-функции, используемое :c:func:`PyHash_GetFuncDef`.

source: Hash function name (UTF-8 encoded string).
ru: Имя хеш-функции (строка в кодировке UTF-8).

source: Internal size of the hash value in bits.
ru: Внутренний размер хеш-значения в битах.

source: Size of seed input in bits.
ru: Размер входного начального значения в битах.

source: Get the hash function definition.
ru: Получите определение хеш-функции.

source: :pep:`456` "Secure and interchangeable hash algorithm".
ru: :pep:`456` "Безопасный и взаимозаменяемый алгоритм хеширования".

source: Hash a pointer value: process the pointer value as an integer (cast it to ``uintptr_t`` internally). The pointer is not dereferenced.
ru: Хешировать значение указателя: обрабатывать значение указателя как целое число (внутренне приводить его к uintptr_t). Указатель не разыменовывается.

source: The function cannot fail: it cannot return ``-1``.
ru: Функция не может дать сбой: она не может вернуть ``-1``.

source: Generic hashing function that is meant to be put into a type object's ``tp_hash`` slot. Its result only depends on the object's identity.
ru: Общая хеш-функция, предназначенная для помещения в слот tp_hash объекта типа. Его результат зависит только от личности объекта.

source: In CPython, it is equivalent to :c:func:`Py_HashPointer`.
ru: В CPython это эквивалентно :c:func:`Py_HashPointer`.
