Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/init.po
Languages: ru

source: Initialization, Finalization, and Threads
ru: Инициализация, финализация и потоки

source: See also :ref:`Python Initialization Configuration <init-config>`.
ru: См. также :ref:`Конфигурация инициализации Python <init-config>`.

source: Before Python Initialization
ru: Перед инициализацией Python

source: In an application embedding Python, the :c:func:`Py_Initialize` function must be called before using any other Python/C API functions; with the exception of a few functions and the :ref:`global configuration variables <global-conf-vars>`.
ru: В приложении, встраивающем Python, функцию :c:func:`Py_Initialize` необходимо вызывать перед использованием любых других функций API Python/C; за исключением нескольких функций и :ref:`глобальных переменных конфигурации <global-conf-vars>`.

source: The following functions can be safely called before Python is initialized:
ru: Следующие функции можно безопасно вызвать до инициализации Python:

source: Configuration functions:
ru: Функции настройки:

source: Informative functions:
ru: Информационные функции:

source: Utilities:
ru: Утилиты:

source: Memory allocators:
ru: Распределители памяти:

source: Synchronization:
ru: Синхронизация:

source: The following functions **should not be called** before :c:func:`Py_Initialize`: :c:func:`Py_EncodeLocale`, :c:func:`Py_GetPath`, :c:func:`Py_GetPrefix`, :c:func:`Py_GetExecPrefix`, :c:func:`Py_GetProgramFullPath`, :c:func:`Py_GetPythonHome`, :c:func:`Py_GetProgramName` and :c:func:`PyEval_InitThreads`.
ru: Следующие функции ** не должны вызываться ** перед :c:func:`Py_Initialize`: :c:func:`Py_EncodeLocale`, :c:func:`Py_GetPath`, :c:func:`Py_GetPrefix`, :c:func:`Py_GetExecPrefix`, :c:функции:`Py_GetProgramFullPath`, :c:func:`Py_GetPythonHome`, :c:func:`Py_GetProgramName` и :c:func:`PyEval_InitThreads`.

source: Global configuration variables
ru: Глобальные переменные конфигурации

source: Python has variables for the global configuration to control different features and options. By default, these flags are controlled by :ref:`command line options <using-on-interface-options>`.
ru: В Python есть переменные для глобальной конфигурации, позволяющие управлять различными функциями и параметрами. По умолчанию эти флаги контролируются :ref:`параметрами командной строки <using-on-interface-options>`.

source: When a flag is set by an option, the value of the flag is the number of times that the option was set. For example, ``-b`` sets :c:data:`Py_BytesWarningFlag` to 1 and ``-bb`` sets :c:data:`Py_BytesWarningFlag` to 2.
ru: Если флаг установлен опцией, значение флага равно количеству раз, когда опция была установлена. Например, ``-b`` устанавливает :c:data:`Py_BytesWarningFlag` равным 1, а ``-bb`` устанавливает :c:data:`Py_BytesWarningFlag` равным 2.

source: This API is kept for backward compatibility: setting :c:member:`PyConfig.bytes_warning` should be used instead, see :ref:`Python Initialization Configuration <init-config>`.
ru: Этот API сохранен для обратной совместимости: вместо него следует использовать настройку :c:member:`PyConfig.bytes_warning`, см. :ref:`Конфигурация инициализации Python <init-config>`.

source: Issue a warning when comparing :class:`bytes` or :class:`bytearray` with :class:`str` or :class:`bytes` with :class:`int`. Issue an error if greater or equal to ``2``.
ru: Выдает предупреждение при сравнении :class:`bytes` или :class:`bytearray` с :class:`str` или :class:`bytes` с :class:`int`. Выдать ошибку, если оно больше или равно ``2``.

source: Set by the :option:`-b` option.
ru: Устанавливается опцией :option:`-b`.

source: This API is kept for backward compatibility: setting :c:member:`PyConfig.parser_debug` should be used instead, see :ref:`Python Initialization Configuration <init-config>`.
ru: Этот API сохранен для обратной совместимости: вместо него следует использовать настройку :c:member:`PyConfig.parser_debug`, см. :ref:`Конфигурация инициализации Python <init-config>`.

source: Turn on parser debugging output (for expert only, depending on compilation options).
ru: Включите вывод отладки парсера (только для экспертов, в зависимости от параметров компиляции).

source: Set by the :option:`-d` option and the :envvar:`PYTHONDEBUG` environment variable.
ru: Устанавливается опцией :option:`-d` и переменной среды :envvar:`PYTHONDEBUG`.

source: This API is kept for backward compatibility: setting :c:member:`PyConfig.write_bytecode` should be used instead, see :ref:`Python Initialization Configuration <init-config>`.
ru: Этот API сохранен для обратной совместимости: вместо него следует использовать настройку :c:member:`PyConfig.write_bytecode`, см. :ref:`Конфигурация инициализации Python <init-config>`.

source: If set to non-zero, Python won't try to write ``.pyc`` files on the import of source modules.
ru: Если установлено значение, отличное от нуля, Python не будет пытаться записывать файлы ``.pyc`` при импорте исходных модулей.

source: Set by the :option:`-B` option and the :envvar:`PYTHONDONTWRITEBYTECODE` environment variable.
ru: Устанавливается опцией :option:`-B` и переменной среды :envvar:`PYTHONDONTWRITEBYTECODE`.

source: This API is kept for backward compatibility: setting :c:member:`PyConfig.pathconfig_warnings` should be used instead, see :ref:`Python Initialization Configuration <init-config>`.
ru: Этот API сохранен для обратной совместимости: вместо него следует использовать настройку :c:member:`PyConfig.pathconfig_warnings`, см. :ref:`Конфигурация инициализации Python <init-config>`.

source: Suppress error messages when calculating the module search path in :c:func:`Py_GetPath`.
ru: Подавить сообщения об ошибках при вычислении пути поиска модуля в :c:func:`Py_GetPath`.

source: Private flag used by ``_freeze_module`` and ``frozenmain`` programs.
ru: Частный флаг, используемый программами ``_freeze_module`` и ``frozenmain``.

source: This API is kept for backward compatibility: setting :c:member:`PyConfig.hash_seed` and :c:member:`PyConfig.use_hash_seed` should be used instead, see :ref:`Python Initialization Configuration <init-config>`.
ru: Этот API сохранен для обратной совместимости: вместо этого следует использовать настройки :c:member:`PyConfig.hash_seed` и :c:member:`PyConfig.use_hash_seed`, см. :ref:`Конфигурация инициализации Python <init-config>`.

source: Set to ``1`` if the :envvar:`PYTHONHASHSEED` environment variable is set to a non-empty string.
ru: Установите значение ``1``, если для переменной среды :envvar:`PYTHONHASHSEED` задана непустая строка.

source: If the flag is non-zero, read the :envvar:`PYTHONHASHSEED` environment variable to initialize the secret hash seed.
ru: Если флаг ненулевой, прочитайте переменную среды :envvar:`PYTHONHASHSEED`, чтобы инициализировать секретное начальное значение хеша.

source: This API is kept for backward compatibility: setting :c:member:`PyConfig.use_environment` should be used instead, see :ref:`Python Initialization Configuration <init-config>`.
ru: Этот API сохранен для обратной совместимости: вместо него следует использовать настройку :c:member:`PyConfig.use_environment`, см. :ref:`Конфигурация инициализации Python <init-config>`.

source: Ignore all :envvar:`!PYTHON*` environment variables, e.g. :envvar:`PYTHONPATH` and :envvar:`PYTHONHOME`, that might be set.
ru: Игнорируйте все переменные среды :envvar:`!PYTHON*`, например :envvar:`PYTHONPATH` и :envvar:`PYTHONHOME`, которые могут быть установлены.

source: Set by the :option:`-E` and :option:`-I` options.
ru: Устанавливается опциями :option:`-E` и :option:`-I`.

source: This API is kept for backward compatibility: setting :c:member:`PyConfig.inspect` should be used instead, see :ref:`Python Initialization Configuration <init-config>`.
ru: Этот API сохранен для обратной совместимости: вместо него следует использовать настройку :c:member:`PyConfig.inspect`, см. :ref:`Конфигурация инициализации Python <init-config>`.

source: When a script is passed as first argument or the :option:`-c` option is used, enter interactive mode after executing the script or the command, even when :data:`sys.stdin` does not appear to be a terminal.
ru: Если сценарий передается в качестве первого аргумента или используется опция :option:`-c`, войдите в интерактивный режим после выполнения сценария или команды, даже если :data:`sys.stdin` не выглядит как терминал.

source: Set by the :option:`-i` option and the :envvar:`PYTHONINSPECT` environment variable.
ru: Устанавливается опцией :option:`-i` и переменной среды :envvar:`PYTHONINSPECT`.

source: This API is kept for backward compatibility: setting :c:member:`PyConfig.interactive` should be used instead, see :ref:`Python Initialization Configuration <init-config>`.
ru: Этот API сохранен для обратной совместимости: вместо него следует использовать настройку :c:member:`PyConfig.interactive`, см. :ref:`Конфигурация инициализации Python <init-config>`.

source: Set by the :option:`-i` option.
ru: Устанавливается опцией :option:`-i`.

source: This API is kept for backward compatibility: setting :c:member:`PyConfig.isolated` should be used instead, see :ref:`Python Initialization Configuration <init-config>`.
ru: Этот API сохранен для обратной совместимости: вместо него следует использовать настройку :c:member:`PyConfig.isolated`, см. :ref:`Конфигурация инициализации Python <init-config>`.

source: Run Python in isolated mode. In isolated mode :data:`sys.path` contains neither the script's directory nor the user's site-packages directory.
ru: Запустите Python в изолированном режиме. В изолированном режиме :data:`sys.path` не содержит ни каталога сценария, ни каталога пакетов сайта пользователя.

source: Set by the :option:`-I` option.
ru: Устанавливается опцией :option:`-I`.

source: This API is kept for backward compatibility: setting :c:member:`PyPreConfig.legacy_windows_fs_encoding` should be used instead, see :ref:`Python Initialization Configuration <init-config>`.
ru: Этот API сохранен для обратной совместимости: вместо него следует использовать настройку :c:member:`PyPreConfig.legacy_windows_fs_encoding`, см. :ref:`Конфигурация инициализации Python <init-config>`.

source: If the flag is non-zero, use the ``mbcs`` encoding with ``replace`` error handler, instead of the UTF-8 encoding with ``surrogatepass`` error handler, for the :term:`filesystem encoding and error handler`.
ru: Если флаг ненулевой, используйте кодировку mbcs с обработчиком ошибок replace вместо кодировки UTF-8 с обработчиком ошибок surrogatepass для кодировки файловой системы и обработчик ошибок`.

source: Set to ``1`` if the :envvar:`PYTHONLEGACYWINDOWSFSENCODING` environment variable is set to a non-empty string.
ru: Установите значение ``1``, если для переменной среды :envvar:`PYTHONLEGACYWINDOWSFSENCODING` задана непустая строка.

source: See :pep:`529` for more details.
ru: См. :pep:`529` для более подробной информации.

source: This API is kept for backward compatibility: setting :c:member:`PyConfig.legacy_windows_stdio` should be used instead, see :ref:`Python Initialization Configuration <init-config>`.
ru: Этот API сохранен для обратной совместимости: вместо него следует использовать настройку :c:member:`PyConfig.legacy_windows_stdio`, см. :ref:`Конфигурация инициализации Python <init-config>`.

source: If the flag is non-zero, use :class:`io.FileIO` instead of :class:`!io._WindowsConsoleIO` for :mod:`sys` standard streams.
ru: Если флаг ненулевой, используйте :class:`io.FileIO` вместо :class:`!io._WindowsConsoleIO` для стандартных потоков :mod:`sys`.

source: Set to ``1`` if the :envvar:`PYTHONLEGACYWINDOWSSTDIO` environment variable is set to a non-empty string.
ru: Установите значение ``1``, если для переменной среды :envvar:`PYTHONLEGACYWINDOWSSTDIO` задана непустая строка.

source: See :pep:`528` for more details.
ru: См. :pep:`528` для более подробной информации.

source: This API is kept for backward compatibility: setting :c:member:`PyConfig.site_import` should be used instead, see :ref:`Python Initialization Configuration <init-config>`.
ru: Этот API сохранен для обратной совместимости: вместо него следует использовать настройку :c:member:`PyConfig.site_import`, см. :ref:`Конфигурация инициализации Python <init-config>`.

source: Disable the import of the module :mod:`site` and the site-dependent manipulations of :data:`sys.path` that it entails. Also disable these manipulations if :mod:`site` is explicitly imported later (call :func:`site.main` if you want them to be triggered).
ru: Отключите импорт модуля :mod:`site` и связанные с ним манипуляции с :data:`sys.path`, зависящие от сайта. Также отключите эти манипуляции, если :mod:`site` будет явно импортирован позже (вызовите :func:`site.main`, если вы хотите, чтобы они запускались).

source: Set by the :option:`-S` option.
ru: Устанавливается опцией :option:`-S`.

source: This API is kept for backward compatibility: setting :c:member:`PyConfig.user_site_directory` should be used instead, see :ref:`Python Initialization Configuration <init-config>`.
ru: Этот API сохранен для обратной совместимости: вместо него следует использовать настройку :c:member:`PyConfig.user_site_directory`, см. :ref:`Конфигурация инициализации Python <init-config>`.

source: Don't add the :data:`user site-packages directory <site.USER_SITE>` to :data:`sys.path`.
ru: Не добавляйте каталог :data:`user site-packages <site.USER_SITE>` в :data:`sys.path`.

source: Set by the :option:`-s` and :option:`-I` options, and the :envvar:`PYTHONNOUSERSITE` environment variable.
ru: Устанавливается параметрами :option:`-s` и :option:`-I`, а также переменной среды :envvar:`PYTHONNOUSERSITE`.

source: This API is kept for backward compatibility: setting :c:member:`PyConfig.optimization_level` should be used instead, see :ref:`Python Initialization Configuration <init-config>`.
ru: Этот API сохранен для обратной совместимости: вместо него следует использовать настройку :c:member:`PyConfig.optimization_level`, см. :ref:`Конфигурация инициализации Python <init-config>`.

source: Set by the :option:`-O` option and the :envvar:`PYTHONOPTIMIZE` environment variable.
ru: Устанавливается опцией :option:`-O` и переменной среды :envvar:`PYTHONOPTIMIZE`.

source: This API is kept for backward compatibility: setting :c:member:`PyConfig.quiet` should be used instead, see :ref:`Python Initialization Configuration <init-config>`.
ru: Этот API сохранен для обратной совместимости: вместо него следует использовать настройку :c:member:`PyConfig.quiet`, см. :ref:`Конфигурация инициализации Python <init-config>`.

source: Don't display the copyright and version messages even in interactive mode.
ru: Не отображайте сообщения об авторских правах и версии даже в интерактивном режиме.

source: Set by the :option:`-q` option.
ru: Устанавливается опцией :option:`-q`.

source: This API is kept for backward compatibility: setting :c:member:`PyConfig.buffered_stdio` should be used instead, see :ref:`Python Initialization Configuration <init-config>`.
ru: Этот API сохранен для обратной совместимости: вместо него следует использовать настройку :c:member:`PyConfig.buffered_stdio`, см. :ref:`Конфигурация инициализации Python <init-config>`.

source: Force the stdout and stderr streams to be unbuffered.
ru: Принудительно отключить буферизацию потоков stdout и stderr.

source: Set by the :option:`-u` option and the :envvar:`PYTHONUNBUFFERED` environment variable.
ru: Устанавливается опцией :option:`-u` и переменной среды :envvar:`PYTHONUNBUFFERED`.

source: This API is kept for backward compatibility: setting :c:member:`PyConfig.verbose` should be used instead, see :ref:`Python Initialization Configuration <init-config>`.
ru: Этот API сохранен для обратной совместимости: вместо него следует использовать настройку :c:member:`PyConfig.verbose`, см. :ref:`Конфигурация инициализации Python <init-config>`.

source: Print a message each time a module is initialized, showing the place (filename or built-in module) from which it is loaded. If greater or equal to ``2``, print a message for each file that is checked for when searching for a module. Also provides information on module cleanup at exit.
ru: Выводите сообщение каждый раз при инициализации модуля, показывая место (имя файла или встроенный модуль), из которого он загружен. Если больше или равно ``2``, выведите сообщение для каждого файла, который проверяется при поиске модуля. Также предоставляет информацию об очистке модуля при выходе.

source: Set by the :option:`-v` option and the :envvar:`PYTHONVERBOSE` environment variable.
ru: Устанавливается опцией :option:`-v` и переменной среды :envvar:`PYTHONVERBOSE`.

source: Initializing and finalizing the interpreter
ru: Инициализация и финализация интерпретатора

source: Initialize the Python interpreter. In an application embedding Python, this should be called before using any other Python/C API functions; see :ref:`Before Python Initialization <pre-init-safe>` for the few exceptions.
ru: Инициализируйте интерпретатор Python. В приложении, встраивающем Python, его следует вызывать перед использованием любых других функций API Python/C; см. :ref:`Before Python Initialization <pre-init-safe>` для нескольких исключений.

source: This initializes the table of loaded modules (``sys.modules``), and creates the fundamental modules :mod:`builtins`, :mod:`__main__` and :mod:`sys`. It also initializes the module search path (``sys.path``). It does not set ``sys.argv``; use the new :c:type:`PyConfig` API of the :ref:`Python Initialization Configuration <init-config>` for that. This is a no-op when called for a second time (without calling :c:func:`Py_FinalizeEx` first). There is no return value; it is a fatal error if the initialization fails.
ru: Это инициализирует таблицу загруженных модулей (``sys.modules``) и создает основные модули :mod:`builtins`, :mod:`__main__` и :mod:`sys`. Он также инициализирует путь поиска модуля (``sys.path``). Он не устанавливает ``sys.argv``; для этого используйте новый API :c:type:`PyConfig` :ref:`Конфигурации инициализации Python <init-config>`. Это пустая операция при втором вызове (без первого вызова :c:func:`Py_FinalizeEx`). Возвращаемого значения нет; это фатальная ошибка, если инициализация не удалась.

source: Use the :c:func:`Py_InitializeFromConfig` function to customize the :ref:`Python Initialization Configuration <init-config>`.
ru: Используйте функцию :c:func:`Py_InitializeFromConfig` для настройки :ref:`Конфигурации инициализации Python <init-config>`.

source: On Windows, changes the console mode from ``O_TEXT`` to ``O_BINARY``, which will also affect non-Python uses of the console using the C Runtime.
ru: В Windows изменяет режим консоли с ``O_TEXT`` на ``O_BINARY``, что также повлияет на использование консоли не на Python с использованием среды выполнения C.

source: This function works like :c:func:`Py_Initialize` if *initsigs* is ``1``. If *initsigs* is ``0``, it skips initialization registration of signal handlers, which might be useful when Python is embedded.
ru: Эта функция работает как :c:func:`Py_Initialize`, если *initsigs* равен ``1``. Если *initsigs* равен ``0``, он пропускает регистрацию инициализации обработчиков сигналов, что может быть полезно при встроенном Python.

source: Return true (nonzero) when the Python interpreter has been initialized, false (zero) if not. After :c:func:`Py_FinalizeEx` is called, this returns false until :c:func:`Py_Initialize` is called again.
ru: Возвращайте true (не ноль), если интерпретатор Python был инициализирован, и false (ноль), если нет. После вызова :c:func:`Py_FinalizeEx` он возвращает false до тех пор, пока :c:func:`Py_Initialize` не будет вызван снова.

source: Return true (non-zero) if the main Python interpreter is :term:`shutting down <interpreter shutdown>`. Return false (zero) otherwise.
ru: Возвращает true (не ноль), если основной интерпретатор Python :term:`завершает работу <интерпретатор завершение работы>`. В противном случае верните false (ноль).

source: Undo all initializations made by :c:func:`Py_Initialize` and subsequent use of Python/C API functions, and destroy all sub-interpreters (see :c:func:`Py_NewInterpreter` below) that were created and not yet destroyed since the last call to :c:func:`Py_Initialize`. Ideally, this frees all memory allocated by the Python interpreter. This is a no-op when called for a second time (without calling :c:func:`Py_Initialize` again first).
ru: Отменить все инициализации, выполненные с помощью :c:func:`Py_Initialize` и последующее использование функций API Python/C, а также уничтожить все подинтерпретаторы (см. :c:func:`Py_NewInterpreter` ниже), которые были созданы и еще не уничтожены с момента последний вызов :c:func:`Py_Initialize`. В идеале это освобождает всю память, выделенную интерпретатором Python. Это пустая операция при втором вызове (без повторного вызова :c:func:`Py_Initialize`).

source: Since this is the reverse of :c:func:`Py_Initialize`, it should be called in the same thread with the same interpreter active. That means the main thread and the main interpreter. This should never be called while :c:func:`Py_RunMain` is running.
ru: Поскольку это противоположно :c:func:`Py_Initialize`, его следует вызывать в том же потоке с тем же активным интерпретатором. Это означает основной поток и главный интерпретатор. Это никогда не следует вызывать во время работы :c:func:`Py_RunMain`.

source: Normally the return value is ``0``. If there were errors during finalization (flushing buffered data), ``-1`` is returned.
ru: Обычно возвращаемое значение равно ``0``. Если во время финализации (очистки буферизованных данных) возникли ошибки, возвращается ``-1``.

source: This function is provided for a number of reasons. An embedding application might want to restart Python without having to restart the application itself. An application that has loaded the Python interpreter from a dynamically loadable library (or DLL) might want to free all memory allocated by Python before unloading the DLL. During a hunt for memory leaks in an application a developer might want to free all memory allocated by Python before exiting from the application.
ru: Эта функция предусмотрена по ряду причин. Встраиваемому приложению может потребоваться перезапустить Python без перезапуска самого приложения. Приложение, загрузившее интерпретатор Python из динамически загружаемой библиотеки (или DLL), может захотеть освободить всю память, выделенную Python, перед выгрузкой DLL. Во время поиска утечек памяти в приложении разработчик может захотеть освободить всю память, выделенную Python, перед выходом из приложения.
