Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/init.po
Languages: ru

source: This macro expands to ``PyEval_RestoreThread(_save);``: it is equivalent to :c:macro:`Py_END_ALLOW_THREADS` without the closing brace.
ru: Этот макрос расширяется до ``PyEval_RestoreThread(_save);``: он эквивалентен :c:macro:`Py_END_ALLOW_THREADS` без закрывающей скобки.

source: This macro expands to ``_save = PyEval_SaveThread();``: it is equivalent to :c:macro:`Py_BEGIN_ALLOW_THREADS` without the opening brace and variable declaration.
ru: Этот макрос расширяется до ``_save = PyEval_SaveThread();``: он эквивалентен :c:macro:`Py_BEGIN_ALLOW_THREADS` без открывающей скобки и объявления переменной.

source: Low-level API
ru: Низкоуровневый API

source: All of the following functions must be called after :c:func:`Py_Initialize`.
ru: Все следующие функции должны вызываться после :c:func:`Py_Initialize`.

source: :c:func:`Py_Initialize()` now initializes the :term:`GIL`.
ru: :c:func:`Py_Initialize()` теперь инициализирует :term:`GIL`.

source: Create a new interpreter state object. The global interpreter lock need not be held, but may be held if it is necessary to serialize calls to this function.
ru: Создайте новый объект состояния интерпретатора. Глобальную блокировку интерпретатора удерживать не обязательно, но ее можно удерживать, если необходимо сериализовать вызовы этой функции.

source: Raises an :ref:`auditing event <auditing>` ``cpython.PyInterpreterState_New`` with no arguments.
ru: Вызывает :ref:`событие аудита <auditing>``cpython.PyInterpreterState_New`` без аргументов.

source: Reset all information in an interpreter state object. The global interpreter lock must be held.
ru: Сброс всей информации в объекте состояния интерпретатора. Глобальная блокировка интерпретатора должна быть удержана.

source: Raises an :ref:`auditing event <auditing>` ``cpython.PyInterpreterState_Clear`` with no arguments.
ru: Вызывает :ref:`событие аудита <auditing>``cpython.PyInterpreterState_Clear`` без аргументов.

source: Destroy an interpreter state object. The global interpreter lock need not be held. The interpreter state must have been reset with a previous call to :c:func:`PyInterpreterState_Clear`.
ru: Уничтожить объект состояния интерпретатора. Глобальную блокировку интерпретатора удерживать не требуется. Состояние интерпретатора должно быть сброшено предыдущим вызовом :c:func:`PyInterpreterState_Clear`.

source: Create a new thread state object belonging to the given interpreter object. The global interpreter lock need not be held, but may be held if it is necessary to serialize calls to this function.
ru: Создайте новый объект состояния потока, принадлежащий данному объекту интерпретатора. Глобальную блокировку интерпретатора удерживать не обязательно, но ее можно удерживать, если необходимо сериализовать вызовы этой функции.

source: Reset all information in a thread state object. The global interpreter lock must be held.
ru: Сброс всей информации в объекте состояния потока. Глобальная блокировка интерпретатора должна быть удержана.

source: This function now calls the :c:member:`PyThreadState.on_delete` callback. Previously, that happened in :c:func:`PyThreadState_Delete`.
ru: Эта функция теперь вызывает обратный вызов :c:member:`PyThreadState.on_delete`. Ранее это происходило в :c:func:`PyThreadState_Delete`.

source: Destroy a thread state object. The global interpreter lock need not be held. The thread state must have been reset with a previous call to :c:func:`PyThreadState_Clear`.
ru: Уничтожить объект состояния потока. Глобальную блокировку интерпретатора удерживать не требуется. Состояние потока должно быть сброшено предыдущим вызовом :c:func:`PyThreadState_Clear`.

source: Get the current frame of the Python thread state *tstate*.
ru: Получите текущий кадр состояния потока Python *tstate*.

source: Return a :term:`strong reference`. Return ``NULL`` if no frame is currently executing.
ru: Верните :term:`сильную ссылку`. Верните NULL, если в данный момент не выполняется ни один кадр.

source: See also :c:func:`PyEval_GetFrame`.
ru: См. также :c:func:`PyEval_GetFrame`.

source: *tstate* must not be ``NULL``.
ru: *tstate* не должен быть ``NULL``.

source: Get the unique thread state identifier of the Python thread state *tstate*.
ru: Получите уникальный идентификатор состояния потока Python *tstate*.

source: Get the interpreter of the Python thread state *tstate*.
ru: Получите интерпретатор состояния потока Python *tstate*.

source: Suspend tracing and profiling in the Python thread state *tstate*.
ru: Приостановить трассировку и профилирование в состоянии потока Python *tstate*.

source: Resume them using the :c:func:`PyThreadState_LeaveTracing` function.
ru: Возобновите их, используя функцию :c:func:`PyThreadState_LeaveTracing`.

source: Resume tracing and profiling in the Python thread state *tstate* suspended by the :c:func:`PyThreadState_EnterTracing` function.
ru: Возобновите трассировку и профилирование в состоянии потока Python *tstate*, приостановленном функцией :c:func:`PyThreadState_EnterTracing`.

source: See also :c:func:`PyEval_SetTrace` and :c:func:`PyEval_SetProfile` functions.
ru: См. также функции :c:func:`PyEval_SetTrace` и :c:func:`PyEval_SetProfile`.

source: Get the current interpreter.
ru: Получите текущий интерпретатор.

source: Issue a fatal error if there no current Python thread state or no current interpreter. It cannot return NULL.
ru: Выдает фатальную ошибку, если нет текущего состояния потока Python или текущего интерпретатора. Он не может вернуть NULL.

source: The caller must hold the GIL.
ru: Вызывающий объект должен удерживать GIL.

source: Return the interpreter's unique ID. If there was any error in doing so then ``-1`` is returned and an error is set.
ru: Возвращает уникальный идентификатор переводчика. Если при этом произошла какая-либо ошибка, то возвращается ``-1`` и устанавливается ошибка.

source: Return a dictionary in which interpreter-specific data may be stored. If this function returns ``NULL`` then no exception has been raised and the caller should assume no interpreter-specific dict is available.
ru: Возвращает словарь, в котором могут храниться данные, специфичные для интерпретатора. Если эта функция возвращает NULL, то исключение не возникло, и вызывающая сторона должна предполагать, что словарь, специфичный для интерпретатора, недоступен.

source: This is not a replacement for :c:func:`PyModule_GetState()`, which extensions should use to store interpreter-specific state information.
ru: Это не замена :c:func:`PyModule_GetState()`, расширения которого должны использоваться для хранения информации о состоянии, специфичной для интерпретатора.

source: Type of a frame evaluation function.
ru: Тип функции оценки кадра.

source: The *throwflag* parameter is used by the ``throw()`` method of generators: if non-zero, handle the current exception.
ru: Параметр *throwflag* используется методом генераторов ``throw()``: если он не равен нулю, обрабатывается текущее исключение.

source: The function now takes a *tstate* parameter.
ru: Теперь функция принимает параметр *tstate*.

source: The *frame* parameter changed from ``PyFrameObject*`` to ``_PyInterpreterFrame*``.
ru: Параметр *frame* изменен с ``PyFrameObject*`` на ``_PyInterpreterFrame*``.

source: Get the frame evaluation function.
ru: Получите функцию оценки кадра.

source: See the :pep:`523` "Adding a frame evaluation API to CPython".
ru: См. :pep:`523` «Добавление API оценки кадров в CPython».

source: Set the frame evaluation function.
ru: Установите функцию оценки кадра.

source: Return a dictionary in which extensions can store thread-specific state information. Each extension should use a unique key to use to store state in the dictionary. It is okay to call this function when no current thread state is available. If this function returns ``NULL``, no exception has been raised and the caller should assume no current thread state is available.
ru: Возвращает словарь, в котором расширения могут хранить информацию о состоянии конкретного потока. Каждое расширение должно использовать уникальный ключ для хранения состояния в словаре. Эту функцию можно вызывать, когда текущее состояние потока недоступно. Если эта функция возвращает NULL, исключение не возникло, и вызывающая сторона должна предполагать, что текущее состояние потока недоступно.

source: Asynchronously raise an exception in a thread. The *id* argument is the thread id of the target thread; *exc* is the exception object to be raised. This function does not steal any references to *exc*. To prevent naive misuse, you must write your own C extension to call this. Must be called with the GIL held. Returns the number of thread states modified; this is normally one, but will be zero if the thread id isn't found. If *exc* is ``NULL``, the pending exception (if any) for the thread is cleared. This raises no exceptions.
ru: Асинхронно вызвать исключение в потоке. Аргумент *id* — это идентификатор целевого потока; *exc* — это вызываемый объект исключения. Эта функция не крадет ссылки на *exc*. Чтобы предотвратить наивное неправильное использование, вы должны написать собственное расширение C для вызова этого. Должен быть вызван с удержанием GIL. Возвращает количество измененных состояний потока; Обычно это единица, но будет равна нулю, если идентификатор потока не найден. Если *exc* имеет значение NULL, ожидающее исключение (если оно есть) для потока очищается. Это не вызывает исключений.

source: The type of the *id* parameter changed from :c:expr:`long` to :c:expr:`unsigned long`.
ru: Тип параметра *id* изменен с :c:expr:`long` на :c:expr:`unsigned long`.

source: Acquire the global interpreter lock and set the current thread state to *tstate*, which must not be ``NULL``. The lock must have been created earlier. If this thread already has the lock, deadlock ensues.
ru: Получите глобальную блокировку интерпретатора и установите текущее состояние потока в *tstate*, которое не должно быть ``NULL``. Замок должен быть создан ранее. Если этот поток уже имеет блокировку, возникает взаимоблокировка.

source: Updated to be consistent with :c:func:`PyEval_RestoreThread`, :c:func:`Py_END_ALLOW_THREADS`, and :c:func:`PyGILState_Ensure`, and terminate the current thread if called while the interpreter is finalizing.
ru: Обновлено для совместимости с :c:func:`PyEval_RestoreThread`, :c:func:`Py_END_ALLOW_THREADS` и :c:func:`PyGILState_Ensure`, а также завершает текущий поток, если он вызывается во время завершения работы интерпретатора.

source: :c:func:`PyEval_RestoreThread` is a higher-level function which is always available (even when threads have not been initialized).
ru: :c:func:`PyEval_RestoreThread` — это функция более высокого уровня, которая доступна всегда (даже если потоки не инициализированы).

source: Reset the current thread state to ``NULL`` and release the global interpreter lock. The lock must have been created earlier and must be held by the current thread. The *tstate* argument, which must not be ``NULL``, is only used to check that it represents the current thread state --- if it isn't, a fatal error is reported.
ru: Сбросьте текущее состояние потока на NULL и снимите глобальную блокировку интерпретатора. Блокировка должна быть создана ранее и удерживаться текущим потоком. Аргумент *tstate*, который не должен быть NULL, используется только для проверки того, что он представляет текущее состояние потока. Если это не так, сообщается о фатальной ошибке.

source: :c:func:`PyEval_SaveThread` is a higher-level function which is always available (even when threads have not been initialized).
ru: :c:func:`PyEval_SaveThread` — это функция более высокого уровня, которая всегда доступна (даже если потоки не инициализированы).

source: Sub-interpreter support
ru: Поддержка субпереводчика

source: While in most uses, you will only embed a single Python interpreter, there are cases where you need to create several independent interpreters in the same process and perhaps even in the same thread. Sub-interpreters allow you to do that.
ru: Хотя в большинстве случаев вам понадобится встроить только один интерпретатор Python, в некоторых случаях вам необходимо создать несколько независимых интерпретаторов в одном процессе и, возможно, даже в одном потоке. Субинтерпретаторы позволяют вам это сделать.

source: The "main" interpreter is the first one created when the runtime initializes. It is usually the only Python interpreter in a process. Unlike sub-interpreters, the main interpreter has unique process-global responsibilities like signal handling. It is also responsible for execution during runtime initialization and is usually the active interpreter during runtime finalization. The :c:func:`PyInterpreterState_Main` function returns a pointer to its state.
ru: «Основной» интерпретатор создается первым при инициализации среды выполнения. Обычно это единственный интерпретатор Python в процессе. В отличие от субинтерпретаторов, главный интерпретатор имеет уникальные глобальные обязанности, такие как обработка сигналов. Он также отвечает за выполнение во время инициализации среды выполнения и обычно является активным интерпретатором во время финализации среды выполнения. Функция :c:func:`PyInterpreterState_Main` возвращает указатель на свое состояние.

source: You can switch between sub-interpreters using the :c:func:`PyThreadState_Swap` function. You can create and destroy them using the following functions:
ru: Вы можете переключаться между субинтерпретаторами с помощью функции :c:func:`PyThreadState_Swap`. Вы можете создавать и уничтожать их, используя следующие функции:

source: Structure containing most parameters to configure a sub-interpreter. Its values are used only in :c:func:`Py_NewInterpreterFromConfig` and never modified by the runtime.
ru: Структура, содержащая большинство параметров для настройки субинтерпретатора. Его значения используются только в :c:func:`Py_NewInterpreterFromConfig` и никогда не изменяются во время выполнения.

source: Structure fields:
ru: Структурные поля:

source: If this is ``0`` then the sub-interpreter will use its own "object" allocator state. Otherwise it will use (share) the main interpreter's.
ru: Если это ``0``, то субинтерпретатор будет использовать свое собственное состояние распределителя «объекта». В противном случае он будет использовать (разделять) основной интерпретатор.

source: If this is ``0`` then :c:member:`~PyInterpreterConfig.check_multi_interp_extensions` must be ``1`` (non-zero). If this is ``1`` then :c:member:`~PyInterpreterConfig.gil` must not be :c:macro:`PyInterpreterConfig_OWN_GIL`.
ru: Если это ``0``, то :c:member:`~PyInterpreterConfig.check_multi_interp_extensions` должен быть ``1`` (не ноль). Если это ``1``, то :c:member:`~PyInterpreterConfig.gil` не должен быть :c:macro:`PyInterpreterConfig_OWN_GIL`.

source: If this is ``0`` then the runtime will not support forking the process in any thread where the sub-interpreter is currently active. Otherwise fork is unrestricted.
ru: Если это ``0``, то среда выполнения не будет поддерживать разветвление процесса в любом потоке, где субинтерпретатор в данный момент активен. В противном случае форк не имеет ограничений.

source: Note that the :mod:`subprocess` module still works when fork is disallowed.
ru: Обратите внимание, что модуль :mod:`subprocess` по-прежнему работает, когда fork запрещен.

source: If this is ``0`` then the runtime will not support replacing the current process via exec (e.g. :func:`os.execv`) in any thread where the sub-interpreter is currently active. Otherwise exec is unrestricted.
ru: Если это ``0``, то среда выполнения не будет поддерживать замену текущего процесса через exec (например, :func:`os.execv`) в любом потоке, где субинтерпретатор в данный момент активен. В противном случае exec не имеет ограничений.

source: Note that the :mod:`subprocess` module still works when exec is disallowed.
ru: Обратите внимание, что модуль :mod:`subprocess` по-прежнему работает, даже если exec запрещен.

source: If this is ``0`` then the sub-interpreter's :mod:`threading` module won't create threads. Otherwise threads are allowed.
ru: Если это ``0``, то модуль субинтерпретатора :mod:`threading` не будет создавать потоки. В противном случае потоки разрешены.

source: If this is ``0`` then the sub-interpreter's :mod:`threading` module won't create daemon threads. Otherwise daemon threads are allowed (as long as :c:member:`~PyInterpreterConfig.allow_threads` is non-zero).
ru: Если это ``0``, то модуль :mod:`threading` субинтерпретатора не будет создавать потоки демона. В противном случае потоки демона разрешены (если :c:member:`~PyInterpreterConfig.allow_threads` не равно нулю).

source: If this is ``0`` then all extension modules may be imported, including legacy (single-phase init) modules, in any thread where the sub-interpreter is currently active. Otherwise only multi-phase init extension modules (see :pep:`489`) may be imported. (Also see :c:macro:`Py_mod_multiple_interpreters`.)
ru: Если это ``0``, то все модули расширения могут быть импортированы, включая устаревшие модули (однофазная инициализация), в любом потоке, где субинтерпретатор в данный момент активен. В противном случае можно импортировать только модули расширения многофазной инициализации (см. :pep:`489`). (См. также :c:macro:`Py_mod_multiple_interpreters`.)

source: This must be ``1`` (non-zero) if :c:member:`~PyInterpreterConfig.use_main_obmalloc` is ``0``.
ru: Это должно быть ``1`` (не ноль), если :c:member:`~PyInterpreterConfig.use_main_obmalloc` равно ``0``.

source: This determines the operation of the GIL for the sub-interpreter. It may be one of the following:
ru: Это определяет работу GIL для субинтерпретатора. Это может быть одно из следующих:

source: Use the default selection (:c:macro:`PyInterpreterConfig_SHARED_GIL`).
ru: Используйте выбор по умолчанию (:c:macro:`PyInterpreterConfig_SHARED_GIL`).

source: Use (share) the main interpreter's GIL.
ru: Используйте (делитесь) GIL основного интерпретатора.

source: Use the sub-interpreter's own GIL.
ru: Используйте собственный GIL субинтерпретатора.

source: If this is :c:macro:`PyInterpreterConfig_OWN_GIL` then :c:member:`PyInterpreterConfig.use_main_obmalloc` must be ``0``.
ru: Если это :c:macro:`PyInterpreterConfig_OWN_GIL`, то :c:member:`PyInterpreterConfig.use_main_obmalloc` должен быть ``0``.

source: Create a new sub-interpreter. This is an (almost) totally separate environment for the execution of Python code. In particular, the new interpreter has separate, independent versions of all imported modules, including the fundamental modules :mod:`builtins`, :mod:`__main__` and :mod:`sys`. The table of loaded modules (``sys.modules``) and the module search path (``sys.path``) are also separate. The new environment has no ``sys.argv`` variable. It has new standard I/O stream file objects ``sys.stdin``, ``sys.stdout`` and ``sys.stderr`` (however these refer to the same underlying file descriptors).
ru: Создайте нового субинтерпретатора. Это (почти) полностью отдельная среда для выполнения кода Python. В частности, новый интерпретатор имеет отдельные, независимые версии всех импортированных модулей, включая фундаментальные модули :mod:`builtins`, :mod:`__main__` и :mod:`sys`. Таблица загруженных модулей («sys.modules») и путь поиска модулей («sys.path») также разделены. В новой среде нет переменной sys.argv. Он имеет новые стандартные файловые объекты потока ввода-вывода ``sys.stdin``, ``sys.stdout`` и ``sys.stderr`` (однако они относятся к одним и тем же базовым файловым дескрипторам).

source: The given *config* controls the options with which the interpreter is initialized.
ru: Данная *config* управляет опциями, с которыми инициализируется интерпретатор.

source: Upon success, *tstate_p* will be set to the first thread state created in the new sub-interpreter. This thread state is made in the current thread state. Note that no actual thread is created; see the discussion of thread states below. If creation of the new interpreter is unsuccessful, *tstate_p* is set to ``NULL``; no exception is set since the exception state is stored in the current thread state and there may not be a current thread state.
ru: В случае успеха *tstate_p* будет установлено в первое состояние потока, созданное в новом субинтерпретаторе. Это состояние потока создается в текущем состоянии потока. Обратите внимание, что фактический поток не создается; см. обсуждение состояний потоков ниже. Если создание нового интерпретатора не удалось, *tstate_p* устанавливается в ``NULL``; исключение не устанавливается, поскольку состояние исключения сохраняется в текущем состоянии потока, и текущего состояния потока может не быть.

source: Like all other Python/C API functions, the global interpreter lock must be held before calling this function and is still held when it returns. Likewise a current thread state must be set on entry. On success, the returned thread state will be set as current. If the sub-interpreter is created with its own GIL then the GIL of the calling interpreter will be released. When the function returns, the new interpreter's GIL will be held by the current thread and the previously interpreter's GIL will remain released here.
ru: Как и все другие функции API Python/C, глобальная блокировка интерпретатора должна удерживаться перед вызовом этой функции и по-прежнему удерживаться при ее возврате. Аналогично, при входе должно быть установлено текущее состояние потока. В случае успеха возвращаемое состояние потока будет установлено как текущее. Если субинтерпретатор создается со своим собственным GIL, то GIL вызывающего интерпретатора будет освобожден. Когда функция завершает работу, GIL нового интерпретатора будет удерживаться в текущем потоке, а GIL предыдущего интерпретатора останется здесь освобожденным.

source: Sub-interpreters are most effective when isolated from each other, with certain functionality restricted::
ru: Субинтерпретаторы наиболее эффективны, когда они изолированы друг от друга с ограничением определенных функций:

source: Note that the config is used only briefly and does not get modified. During initialization the config's values are converted into various :c:type:`PyInterpreterState` values. A read-only copy of the config may be stored internally on the :c:type:`PyInterpreterState`.
ru: Обратите внимание, что конфигурация используется недолго и не изменяется. Во время инициализации значения конфигурации преобразуются в различные значения :c:type:`PyInterpreterState`. Копия конфигурации, доступная только для чтения, может храниться внутри :c:type:`PyInterpreterState`.

source: Extension modules are shared between (sub-)interpreters as follows:
ru: Модули расширения распределяются между (суб)интерпретаторами следующим образом:

source: For modules using multi-phase initialization, e.g. :c:func:`PyModule_FromDefAndSpec`, a separate module object is created and initialized for each interpreter. Only C-level static and global variables are shared between these module objects.
ru: Для модулей, использующих многофазную инициализацию, например :c:func:`PyModule_FromDefAndSpec`, для каждого интерпретатора создается и инициализируется отдельный объект модуля. Эти объекты модуля совместно используют только статические и глобальные переменные уровня C.
