Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/init_config.po
Languages: ru

source: Python Initialization Configuration
ru: Конфигурация инициализации Python

source: Python can be initialized with :c:func:`Py_InitializeFromConfig` and the :c:type:`PyConfig` structure. It can be preinitialized with :c:func:`Py_PreInitialize` and the :c:type:`PyPreConfig` structure.
ru: Python можно инициализировать с помощью :c:func:`Py_InitializeFromConfig` и структуры :c:type:`PyConfig`. Его можно предварительно инициализировать с помощью :c:func:`Py_PreInitialize` и структуры :c:type:`PyPreConfig`.

source: There are two kinds of configuration:
ru: Существует два вида конфигурации:

source: The :ref:`Python Configuration <init-python-config>` can be used to build a customized Python which behaves as the regular Python. For example, environment variables and command line arguments are used to configure Python.
ru: :ref:`Конфигурация Python <init-python-config>` может использоваться для создания индивидуального Python, который ведет себя как обычный Python. Например, переменные среды и аргументы командной строки используются для настройки Python.

source: The :ref:`Isolated Configuration <init-isolated-conf>` can be used to embed Python into an application. It isolates Python from the system. For example, environment variables are ignored, the LC_CTYPE locale is left unchanged and no signal handler is registered.
ru: :ref:`Изолированная конфигурация <init-isolated-conf>` может использоваться для встраивания Python в приложение. Он изолирует Python от системы. Например, переменные среды игнорируются, локаль LC_CTYPE остается неизменной, а обработчик сигналов не регистрируется.

source: The :c:func:`Py_RunMain` function can be used to write a customized Python program.
ru: Функцию :c:func:`Py_RunMain` можно использовать для написания индивидуальной программы Python.

source: See also :ref:`Initialization, Finalization, and Threads <initialization>`.
ru: Функцию :c:func:`Py_RunMain` можно использовать для написания индивидуальной программы Python.

source: :pep:`587` "Python Initialization Configuration".
ru: :pep:`587` "Конфигурация инициализации Python".

source: Example
ru: Пример

source: Example of customized Python always running in isolated mode::
ru: Пример настроенного Python, всегда работающего в изолированном режиме:

source: List of ``wchar_t*`` strings.
ru: Список строк ``wchar_t*``.

source: If *length* is non-zero, *items* must be non-``NULL`` and all strings must be non-``NULL``.
ru: Если *длина* не равна нулю, *элементы* должны иметь значение, отличное от NULL, и все строки должны быть отличными от NULL.

source: Methods:
ru: Методы:

source: Append *item* to *list*.
ru: Добавить *элемент* в *список*.

source: Python must be preinitialized to call this function.
ru: Python должен быть предварительно инициализирован для вызова этой функции.

source: Insert *item* into *list* at *index*.
ru: Вставьте *item* в *list* по адресу *index*.

source: If *index* is greater than or equal to *list* length, append *item* to *list*.
ru: Если *index* больше или равен длине *list*, добавьте *item* к *list*.

source: *index* must be greater than or equal to ``0``.
ru: *индекс* должен быть больше или равен ``0``.

source: Structure fields:
ru: Структурные поля:

source: List length.
ru: Длина списка.

source: List items.
ru: Перечислить предметы.

source: Structure to store an initialization function status: success, error or exit.
ru: Структура для хранения статуса функции инициализации: успех, ошибка или выход.

source: For an error, it can store the C function name which created the error.
ru: В случае ошибки он может сохранить имя функции C, вызвавшей ошибку.

source: Exit code. Argument passed to ``exit()``.
ru: Код выхода. Аргумент передан в ``exit()``.

source: Error message.
ru: Сообщение об ошибке.

source: Name of the function which created an error, can be ``NULL``.
ru: Имя функции, вызвавшей ошибку, может быть ``NULL``.

source: Functions to create a status:
ru: Функции для создания статуса:

source: Success.
ru: Выполнено.

source: Initialization error with a message.
ru: Ошибка инициализации с сообщением.

source: *err_msg* must not be ``NULL``.
ru: *err_msg* не должно быть NULL.

source: Memory allocation failure (out of memory).
ru: Ошибка выделения памяти (недостаточно памяти).

source: Exit Python with the specified exit code.
ru: Выйдите из Python с указанным кодом выхода.

source: Functions to handle a status:
ru: Функции для обработки статуса:

source: Is the status an error or an exit? If true, the exception must be handled; by calling :c:func:`Py_ExitStatusException` for example.
ru: Статус — это ошибка или выход? Если это правда, исключение должно быть обработано; например, вызвав :c:func:`Py_ExitStatusException`.

source: Is the result an error?
ru: Является ли результат ошибкой?

source: Is the result an exit?
ru: Является ли результат выходом?

source: Call ``exit(exitcode)`` if *status* is an exit. Print the error message and exit with a non-zero exit code if *status* is an error. Must only be called if ``PyStatus_Exception(status)`` is non-zero.
ru: Вызовите ``exit(exitcode)``, если *status* является выходом. Распечатайте сообщение об ошибке и выйдите с ненулевым кодом выхода, если *status* является ошибкой. Должен вызываться только в том случае, если ``PyStatus_Exception(status)`` не равно нулю.

source: Internally, Python uses macros which set ``PyStatus.func``, whereas functions to create a status set ``func`` to ``NULL``.
ru: Внутри Python использует макросы, которые устанавливают ``PyStatus.func``, тогда как функции для создания статуса устанавливают ``func`` в ``NULL``.

source: Example::
ru: Пример::

source: Structure used to preinitialize Python.
ru: Структура, используемая для предварительной инициализации Python.

source: Function to initialize a preconfiguration:
ru: Функция для инициализации предварительной конфигурации:

source: Initialize the preconfiguration with :ref:`Python Configuration <init-python-config>`.
ru: Инициализируйте предварительную конфигурацию с помощью :ref:`Python Configuration <init-python-config>`.

source: Initialize the preconfiguration with :ref:`Isolated Configuration <init-isolated-conf>`.
ru: Инициализируйте предварительную конфигурацию с помощью :ref:`Isolated Configuration <init-isolated-conf>`.

source: Name of the Python memory allocators:
ru: Имя распределителей памяти Python:

source: ``PYMEM_ALLOCATOR_NOT_SET`` (``0``): don't change memory allocators (use defaults).
ru: ``PYMEM_ALLOCATOR_NOT_SET`` (``0``): не менять распределители памяти (используйте значения по умолчанию).

source: ``PYMEM_ALLOCATOR_DEFAULT`` (``1``): :ref:`default memory allocators <default-memory-allocators>`.
ru: ``PYMEM_ALLOCATOR_DEFAULT`` (``1``): :ref:`распределители памяти по умолчанию <default-memory-allocators>`.

source: ``PYMEM_ALLOCATOR_DEBUG`` (``2``): :ref:`default memory allocators <default-memory-allocators>` with :ref:`debug hooks <pymem-debug-hooks>`.
ru: ``PYMEM_ALLOCATOR_DEBUG`` (``2``): :ref:`распределители памяти по умолчанию <default-memory-allocators>` с :ref:`перехватчиками отладки <pymem-debug-hooks>`.

source: ``PYMEM_ALLOCATOR_MALLOC`` (``3``): use ``malloc()`` of the C library.
ru: ``PYMEM_ALLOCATOR_MALLOC`` (``3``): используйте ``malloc()`` из библиотеки C.

source: ``PYMEM_ALLOCATOR_MALLOC_DEBUG`` (``4``): force usage of ``malloc()`` with :ref:`debug hooks <pymem-debug-hooks>`.
ru: ``PYMEM_ALLOCATOR_MALLOC_DEBUG`` (``4``): принудительное использование ``malloc()`` с помощью отладочных перехватчиков <pymem-debug-hooks>`.

source: ``PYMEM_ALLOCATOR_PYMALLOC`` (``5``): :ref:`Python pymalloc memory allocator <pymalloc>`.
ru: ``PYMEM_ALLOCATOR_PYMALLOC`` (``5``): :ref:`Распределитель памяти Python pymalloc <pymalloc>`.

source: ``PYMEM_ALLOCATOR_PYMALLOC_DEBUG`` (``6``): :ref:`Python pymalloc memory allocator <pymalloc>` with :ref:`debug hooks <pymem-debug-hooks>`.
ru: ``PYMEM_ALLOCATOR_PYMALLOC_DEBUG`` (``6``): :ref:`Распределитель памяти Python pymalloc <pymalloc>` с :ref:`хуками отладки <pymem-debug-hooks>`.

source: ``PYMEM_ALLOCATOR_MIMALLOC`` (``6``): use ``mimalloc``, a fast malloc replacement.
ru: ``PYMEM_ALLOCATOR_MIMALLOC`` (``6``): используйте ``mimalloc``, быструю замену malloc.

source: ``PYMEM_ALLOCATOR_MIMALLOC_DEBUG`` (``7``): use ``mimalloc``, a fast malloc replacement with :ref:`debug hooks <pymem-debug-hooks>`.
ru: ``PYMEM_ALLOCATOR_MIMALLOC_DEBUG`` (``7``): используйте ``mimalloc``, быструю замену malloc с помощью отладочных перехватчиков <pymem-debug-hooks>`.

source: ``PYMEM_ALLOCATOR_PYMALLOC`` and ``PYMEM_ALLOCATOR_PYMALLOC_DEBUG`` are not supported if Python is :option:`configured using --without-pymalloc <--without-pymalloc>`.
ru: ``PYMEM_ALLOCATOR_PYMALLOC`` и ``PYMEM_ALLOCATOR_PYMALLOC_DEBUG`` не поддерживаются, если Python :option:`настроен с использованием --without-pymalloc <--without-pymalloc>`.

source: ``PYMEM_ALLOCATOR_MIMALLOC`` and ``PYMEM_ALLOCATOR_MIMALLOC_DEBUG`` are not supported if Python is :option:`configured using --without-mimalloc <--without-mimalloc>` or if the underlying atomic support isn't available.
ru: ``PYMEM_ALLOCATOR_MIMALLOC`` и ``PYMEM_ALLOCATOR_MIMALLOC_DEBUG`` не поддерживаются, если Python :option:`настроен с использованием --without-mimalloc <--without-mimalloc>` или если базовая атомарная поддержка недоступна.

source: See :ref:`Memory Management <memory>`.
ru: См. :ref:`Управление памятью <memory>`.

source: Default: ``PYMEM_ALLOCATOR_NOT_SET``.
ru: По умолчанию: PYMEM_ALLOCATOR_NOT_SET.

source: Set the LC_CTYPE locale to the user preferred locale.
ru: Установите языковой стандарт LC_CTYPE на предпочитаемый пользователем языковой стандарт.

source: If equals to ``0``, set :c:member:`~PyPreConfig.coerce_c_locale` and :c:member:`~PyPreConfig.coerce_c_locale_warn` members to ``0``.
ru: Если равно ``0``, установите для членов :c:member:`~PyPreConfig.coerce_c_locale` и :c:member:`~PyPreConfig.coerce_c_locale_warn` значение ``0``.

source: Default: ``1`` in Python config, ``0`` in isolated config.
ru: По умолчанию: ``1`` в конфигурации Python, ``0`` в изолированной конфигурации.

source: If equals to ``2``, coerce the C locale.
ru: Если равно ``2``, принудительно использовать локаль C.

source: If equals to ``1``, read the LC_CTYPE locale to decide if it should be coerced.
ru: Если равно «1», прочитайте локаль LC_CTYPE, чтобы решить, следует ли ее принудительно использовать.

source: Default: ``-1`` in Python config, ``0`` in isolated config.
ru: По умолчанию: ``-1`` в конфигурации Python, ``0`` в изолированной конфигурации.

source: If non-zero, emit a warning if the C locale is coerced.
ru: Если ненулевое значение, выдать предупреждение, если используется локаль C.

source: :ref:`Python Development Mode <devmode>`: see :c:member:`PyConfig.dev_mode`.
ru: :ref:`Режим разработки Python <devmode>`: см. :c:member:`PyConfig.dev_mode`.

source: Default: ``-1`` in Python mode, ``0`` in isolated mode.
ru: По умолчанию: ``-1`` в режиме Python, ``0`` в изолированном режиме.

source: Isolated mode: see :c:member:`PyConfig.isolated`.
ru: Изолированный режим: см. :c:member:`PyConfig.isolated`.

source: Default: ``0`` in Python mode, ``1`` in isolated mode.
ru: По умолчанию: ``0`` в режиме Python, ``1`` в изолированном режиме.

source: If non-zero:
ru: Если значение ненулевое:

source: Set :c:member:`PyPreConfig.utf8_mode` to ``0``,
ru: Установите для :c:member:`PyPreConfig.utf8_mode` значение ``0``,

source: Set :c:member:`PyConfig.filesystem_encoding` to ``"mbcs"``,
ru: Установите для :c:member:`PyConfig.filesystem_encoding` значение ``"mbcs"``,

source: Set :c:member:`PyConfig.filesystem_errors` to ``"replace"``.
ru: Установите для :c:member:`PyConfig.filesystem_errors` значение ``"replace"``.

source: Initialized from the :envvar:`PYTHONLEGACYWINDOWSFSENCODING` environment variable value.
ru: Инициализируется значением переменной среды :envvar:`PYTHONLEGACYWINDOWSFSENCODING`.

source: Only available on Windows. ``#ifdef MS_WINDOWS`` macro can be used for Windows specific code.
ru: Доступно только в Windows. Макрос #ifdef MS_WINDOWS можно использовать для кода, специфичного для Windows.

source: Default: ``0``.
ru: По умолчанию: ``0``.

source: If non-zero, :c:func:`Py_PreInitializeFromArgs` and :c:func:`Py_PreInitializeFromBytesArgs` parse their ``argv`` argument the same way the regular Python parses command line arguments: see :ref:`Command Line Arguments <using-on-cmdline>`.
ru: Если не ноль, :c:func:`Py_PreInitializeFromArgs` и :c:func:`Py_PreInitializeFromBytesArgs` анализируют свой аргумент ``argv`` так же, как обычный Python анализирует аргументы командной строки: см. :ref:`Аргументы командной строки < using-on-cmdline>`.

source: Use :ref:`environment variables <using-on-envvars>`? See :c:member:`PyConfig.use_environment`.
ru: Использовать :ref:`переменные среды <using-on-envvars>`? См. :c:member:`PyConfig.use_environment`.

source: Default: ``1`` in Python config and ``0`` in isolated config.
ru: По умолчанию: ``1`` в конфигурации Python и ``0`` в изолированной конфигурации.

source: If non-zero, enable the :ref:`Python UTF-8 Mode <utf8-mode>`.
ru: Если значение не равно нулю, включите режим Python UTF-8 <utf8-mode>.

source: Set to ``0`` or ``1`` by the :option:`-X utf8 <-X>` command line option and the :envvar:`PYTHONUTF8` environment variable.
ru: Установите значение ``0`` или ``1`` с помощью параметра командной строки :option:`-X utf8 <-X>` и переменной среды :envvar:`PYTHONUTF8`.

source: Also set to ``1`` if the ``LC_CTYPE`` locale is ``C`` or ``POSIX``.
ru: Также установите значение «1», если локалью «LC_CTYPE» является «C» или «POSIX».

source: Default: ``-1`` in Python config and ``0`` in isolated config.
ru: По умолчанию: ``-1`` в конфигурации Python и ``0`` в изолированной конфигурации.

source: Preinitialize Python with PyPreConfig
ru: Предварительная инициализация Python с помощью PyPreConfig

source: The preinitialization of Python:
ru: Предварительная инициализация Python:

source: Set the Python memory allocators (:c:member:`PyPreConfig.allocator`)
ru: Установите распределители памяти Python (:c:member:`PyPreConfig.allocator`)

source: Configure the LC_CTYPE locale (:term:`locale encoding`)
ru: Настройте локаль LC_CTYPE (:term:`кодировка локали`)

source: Set the :ref:`Python UTF-8 Mode <utf8-mode>` (:c:member:`PyPreConfig.utf8_mode`)
ru: Установите :ref:`Режим Python UTF-8 <utf8-mode>` (:c:member:`PyPreConfig.utf8_mode`)

source: The current preconfiguration (``PyPreConfig`` type) is stored in ``_PyRuntime.preconfig``.
ru: Текущая предварительная конфигурация (тип PyPreConfig) хранится в файле _PyRuntime.preconfig.

source: Functions to preinitialize Python:
ru: Функции для предварительной инициализации Python:

source: Preinitialize Python from *preconfig* preconfiguration.
ru: Предварительная инициализация Python из предварительной конфигурации *preconfig*.

source: *preconfig* must not be ``NULL``.
ru: *preconfig* не должен иметь значение NULL.

source: Parse *argv* command line arguments (bytes strings) if :c:member:`~PyPreConfig.parse_argv` of *preconfig* is non-zero.
ru: Анализировать аргументы командной строки *argv* (байтовые строки), если :c:member:`~PyPreConfig.parse_argv` из *preconfig* не равно нулю.

source: Parse *argv* command line arguments (wide strings) if :c:member:`~PyPreConfig.parse_argv` of *preconfig* is non-zero.
ru: Анализировать аргументы командной строки *argv* (широкие строки), если :c:member:`~PyPreConfig.parse_argv` из *preconfig* не равно нулю.

source: The caller is responsible to handle exceptions (error or exit) using :c:func:`PyStatus_Exception` and :c:func:`Py_ExitStatusException`.
ru: Вызывающий отвечает за обработку исключений (ошибок или выхода), используя :c:func:`PyStatus_Exception` и :c:func:`Py_ExitStatusException`.

source: For :ref:`Python Configuration <init-python-config>` (:c:func:`PyPreConfig_InitPythonConfig`), if Python is initialized with command line arguments, the command line arguments must also be passed to preinitialize Python, since they have an effect on the pre-configuration like encodings. For example, the :option:`-X utf8 <-X>` command line option enables the :ref:`Python UTF-8 Mode <utf8-mode>`.
ru: Для :ref:`Python Configuration <init-python-config>` (:c:func:`PyPreConfig_InitPythonConfig`), если Python инициализируется с аргументами командной строки, аргументы командной строки также должны быть переданы для предварительной инициализации Python, поскольку они имеют влияние на предварительную настройку, например кодировки. Например, параметр командной строки :option:`-X utf8 <-X>` включает режим :ref:`Python UTF-8 <utf8-mode>`.

source: ``PyMem_SetAllocator()`` can be called after :c:func:`Py_PreInitialize` and before :c:func:`Py_InitializeFromConfig` to install a custom memory allocator. It can be called before :c:func:`Py_PreInitialize` if :c:member:`PyPreConfig.allocator` is set to ``PYMEM_ALLOCATOR_NOT_SET``.
ru: ``PyMem_SetAllocator()`` можно вызвать после :c:func:`Py_PreInitialize` и до :c:func:`Py_InitializeFromConfig` для установки специального распределителя памяти. Его можно вызвать до :c:func:`Py_PreInitialize`, если :c:member:`PyPreConfig.allocator` установлен в ``PYMEM_ALLOCATOR_NOT_SET``.

source: Python memory allocation functions like :c:func:`PyMem_RawMalloc` must not be used before the Python preinitialization, whereas calling directly ``malloc()`` and ``free()`` is always safe. :c:func:`Py_DecodeLocale` must not be called before the Python preinitialization.
ru: Функции распределения памяти Python, такие как :c:func:`PyMem_RawMalloc`, не должны использоваться до предварительной инициализации Python, тогда как прямой вызов ``malloc()`` и ``free()`` всегда безопасен. :c:func:`Py_DecodeLocale` не должен вызываться до предварительной инициализации Python.

source: Example using the preinitialization to enable the :ref:`Python UTF-8 Mode <utf8-mode>`::
ru: Пример использования предварительной инициализации для включения режима Python UTF-8 <utf8-mode>`::

source: Structure containing most parameters to configure Python.
ru: Структура, содержащая большинство параметров для настройки Python.

source: When done, the :c:func:`PyConfig_Clear` function must be used to release the configuration memory.
ru: По завершении необходимо использовать функцию :c:func:`PyConfig_Clear` для освобождения памяти конфигурации.

source: Structure methods:
ru: Структурные методы:

source: Initialize configuration with the :ref:`Python Configuration <init-python-config>`.
ru: Инициализируйте конфигурацию с помощью :ref:`Python Configuration <init-python-config>`.

source: Initialize configuration with the :ref:`Isolated Configuration <init-isolated-conf>`.
ru: Инициализируйте конфигурацию с помощью :ref:`Изолированной конфигурации <init-isolated-conf>`.

source: Copy the wide character string *str* into ``*config_str``.
ru: Скопируйте строку расширенных символов *str* в ``*config_str``.

source: :ref:`Preinitialize Python <c-preinit>` if needed.
ru: :ref:`Предварительно инициализируйте Python <c-preinit>`, если необходимо.

source: Decode *str* using :c:func:`Py_DecodeLocale` and set the result into ``*config_str``.
ru: Декодируйте *str* с помощью :c:func:`Py_DecodeLocale` и установите результат в ``*config_str``.

source: Set command line arguments (:c:member:`~PyConfig.argv` member of *config*) from the *argv* list of wide character strings.
ru: Установите аргументы командной строки (:c:member:`~PyConfig.argv` член *config*) из списка *argv* строк широких символов.

source: Set command line arguments (:c:member:`~PyConfig.argv` member of *config*) from the *argv* list of bytes strings. Decode bytes using :c:func:`Py_DecodeLocale`.
ru: Установите аргументы командной строки (:c:member:`~PyConfig.argv` член *config*) из списка байтовых строк *argv*. Декодируйте байты, используя :c:func:`Py_DecodeLocale`.

source: Set the list of wide strings *list* to *length* and *items*.
ru: Установите для списка широких строк *list* значения *length* и *items*.

source: Read all Python configuration.
ru: Прочтите всю конфигурацию Python.

source: Fields which are already initialized are left unchanged.
ru: Поля, которые уже инициализированы, остаются без изменений.

source: Fields for :ref:`path configuration <init-path-config>` are no longer calculated or modified when calling this function, as of Python 3.11.
ru: Поля для :ref:`path Configuration <init-path-config>` больше не вычисляются и не изменяются при вызове этой функции, начиная с Python 3.11.

source: The :c:func:`PyConfig_Read` function only parses :c:member:`PyConfig.argv` arguments once: :c:member:`PyConfig.parse_argv` is set to ``2`` after arguments are parsed. Since Python arguments are stripped from :c:member:`PyConfig.argv`, parsing arguments twice would parse the application options as Python options.
ru: Функция :c:func:`PyConfig_Read` анализирует аргументы :c:member:`PyConfig.argv` только один раз: :c:member:`PyConfig.parse_argv` устанавливается в ``2`` после анализа аргументов. Поскольку аргументы Python удалены из :c:member:`PyConfig.argv`, двойной анализ аргументов будет анализировать параметры приложения как параметры Python.

source: The :c:member:`PyConfig.argv` arguments are now only parsed once, :c:member:`PyConfig.parse_argv` is set to ``2`` after arguments are parsed, and arguments are only parsed if :c:member:`PyConfig.parse_argv` equals ``1``.
ru: Аргументы :c:member:`PyConfig.argv` теперь анализируются только один раз, :c:member:`PyConfig.parse_argv` устанавливается в ``2`` после анализа аргументов, а аргументы анализируются только в том случае, если :c: член: `PyConfig.parse_argv` равен ``1``.

source: :c:func:`PyConfig_Read` no longer calculates all paths, and so fields listed under :ref:`Python Path Configuration <init-path-config>` may no longer be updated until :c:func:`Py_InitializeFromConfig` is called.
ru: :c:func:`PyConfig_Read` больше не вычисляет все пути, поэтому поля, перечисленные в :ref:`Python Path Configuration <init-path-config>`, больше не могут обновляться до тех пор, пока не будет вызвана :c:func:`Py_InitializeFromConfig` .

source: Release configuration memory.
ru: :c:func:`PyConfig_Read` больше не вычисляет все пути, поэтому поля, перечисленные в :ref:`Python Path Configuration <init-path-config>`, больше не могут обновляться до тех пор, пока не будет вызвана :c:func:`Py_InitializeFromConfig` .

source: Most ``PyConfig`` methods :ref:`preinitialize Python <c-preinit>` if needed. In that case, the Python preinitialization configuration (:c:type:`PyPreConfig`) in based on the :c:type:`PyConfig`. If configuration fields which are in common with :c:type:`PyPreConfig` are tuned, they must be set before calling a :c:type:`PyConfig` method:
ru: Большинство методов ``PyConfig`` при необходимости предварительно инициализируют Python <c-preinit>`. В этом случае конфигурация предварительной инициализации Python (:c:type:`PyPreConfig`) основана на :c:type:`PyConfig`. Если настроены поля конфигурации, общие с :c:type:`PyPreConfig`, их необходимо установить перед вызовом метода :c:type:`PyConfig`:

source: Moreover, if :c:func:`PyConfig_SetArgv` or :c:func:`PyConfig_SetBytesArgv` is used, this method must be called before other methods, since the preinitialization configuration depends on command line arguments (if :c:member:`~PyConfig.parse_argv` is non-zero).
ru: Более того, если используется :c:func:`PyConfig_SetArgv` или :c:func:`PyConfig_SetBytesArgv`, этот метод необходимо вызывать перед другими методами, поскольку конфигурация предварительной инициализации зависит от аргументов командной строки (если :c:member:`~ PyConfig.parse_argv` не равен нулю).
