Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/init_config.po
Languages: ru

source: It is possible to completely ignore the function calculating the default path configuration by setting explicitly all path configuration output fields listed above. A string is considered as set even if it is non-empty. ``module_search_paths`` is considered as set if ``module_search_paths_set`` is set to ``1``. In this case, ``module_search_paths`` will be used without modification.
ru: Можно полностью игнорировать функцию расчета конфигурации пути по умолчанию, явно задав все поля вывода конфигурации пути, перечисленные выше. Строка считается установленной, даже если она не пуста. ``module_search_paths`` считается установленным, если ``module_search_paths_set`` установлен в ``1``. В этом случае module_search_paths будет использоваться без изменений.

source: Set :c:member:`~PyConfig.pathconfig_warnings` to ``0`` to suppress warnings when calculating the path configuration (Unix only, Windows does not log any warning).
ru: Установите для :c:member:`~PyConfig.pathconfig_warnings` значение ``0``, чтобы подавить предупреждения при вычислении конфигурации пути (только для Unix, Windows не регистрирует никаких предупреждений).

source: If :c:member:`~PyConfig.base_prefix` or :c:member:`~PyConfig.base_exec_prefix` fields are not set, they inherit their value from :c:member:`~PyConfig.prefix` and :c:member:`~PyConfig.exec_prefix` respectively.
ru: Если поля :c:member:`~PyConfig.base_prefix` или :c:member:`~PyConfig.base_exec_prefix` не установлены, они наследуют свое значение от :c:member:`~PyConfig.prefix` и :c:member :`~PyConfig.exec_prefix` соответственно.

source: :c:func:`Py_RunMain` and :c:func:`Py_Main` modify :data:`sys.path`:
ru: :c:func:`Py_RunMain` и :c:func:`Py_Main` изменяют :data:`sys.path`:

source: If :c:member:`~PyConfig.run_filename` is set and is a directory which contains a ``__main__.py`` script, prepend :c:member:`~PyConfig.run_filename` to :data:`sys.path`.
ru: Если :c:member:`~PyConfig.run_filename` установлен и является каталогом, содержащим скрипт ``__main__.py``, добавьте :c:member:`~PyConfig.run_filename` к :data:`sys.path `.

source: If :c:member:`~PyConfig.isolated` is zero:
ru: Если :c:member:`~PyConfig.isolated` равен нулю:

source: If :c:member:`~PyConfig.run_module` is set, prepend the current directory to :data:`sys.path`. Do nothing if the current directory cannot be read.
ru: Если установлен :c:member:`~PyConfig.run_module`, добавьте текущий каталог к ​​:data:`sys.path`. Ничего не делайте, если текущий каталог не может быть прочитан.

source: If :c:member:`~PyConfig.run_filename` is set, prepend the directory of the filename to :data:`sys.path`.
ru: Если установлен :c:member:`~PyConfig.run_filename`, добавьте каталог имени файла к :data:`sys.path`.

source: Otherwise, prepend an empty string to :data:`sys.path`.
ru: В противном случае добавьте пустую строку к :data:`sys.path`.

source: If :c:member:`~PyConfig.site_import` is non-zero, :data:`sys.path` can be modified by the :mod:`site` module. If :c:member:`~PyConfig.user_site_directory` is non-zero and the user's site-package directory exists, the :mod:`site` module appends the user's site-package directory to :data:`sys.path`.
ru: Если :c:member:`~PyConfig.site_import` не равно нулю, :data:`sys.path` может быть изменен модулем :mod:`site`. Если :c:member:`~PyConfig.user_site_directory` не равно нулю и каталог пакета сайта пользователя существует, модуль :mod:`site` добавляет каталог пакета сайта пользователя к :data:`sys.path`.

source: The following configuration files are used by the path configuration:
ru: Следующие файлы конфигурации используются для конфигурации пути:

source: ``._pth`` file (ex: ``python._pth``)
ru: Файл ``._pth`` (например: ``python._pth``)

source: ``pybuilddir.txt`` (Unix only)
ru: ``pybuilddir.txt`` (только Unix)

source: If a ``._pth`` file is present:
ru: Если присутствует файл ``._pth``:

source: Set :c:member:`~PyConfig.isolated` to ``1``.
ru: Установите для :c:member:`~PyConfig.isolated` значение ``1``.

source: Set :c:member:`~PyConfig.use_environment` to ``0``.
ru: Установите для :c:member:`~PyConfig.use_environment` значение ``0``.

source: Set :c:member:`~PyConfig.site_import` to ``0``.
ru: Установите для :c:member:`~PyConfig.site_import` значение ``0``.

source: Set :c:member:`~PyConfig.safe_path` to ``1``.
ru: Установите для :c:member:`~PyConfig.safe_path` значение ``1``.

source: The ``__PYVENV_LAUNCHER__`` environment variable is used to set :c:member:`PyConfig.base_executable`.
ru: Переменная среды ``__PYVENV_LAUNCHER__`` используется для установки :c:member:`PyConfig.base_executable`.

source: Get the original command line arguments, before Python modified them.
ru: Получите исходные аргументы командной строки до того, как Python их изменит.

source: See also :c:member:`PyConfig.orig_argv` member.
ru: См. также :c:member:`PyConfig.orig_argv`.

source: Multi-Phase Initialization Private Provisional API
ru: Частный временный API многофазной инициализации

source: This section is a private provisional API introducing multi-phase initialization, the core feature of :pep:`432`:
ru: Этот раздел представляет собой частный временный API, представляющий многофазную инициализацию, основную функцию :pep:`432`:

source: "Core" initialization phase, "bare minimum Python":
ru: Фаза инициализации «ядра», «минимальный Python»:

source: Builtin types;
ru: Встроенные типы;

source: Builtin exceptions;
ru: Встроенные исключения;

source: Builtin and frozen modules;
ru: Встроенные и замороженные модули;

source: The :mod:`sys` module is only partially initialized (ex: :data:`sys.path` doesn't exist yet).
ru: Модуль :mod:`sys` инициализирован лишь частично (например: :data:`sys.path` еще не существует).

source: "Main" initialization phase, Python is fully initialized:
ru: «Основной» этап инициализации, Python полностью инициализируется:

source: Install and configure :mod:`importlib`;
ru: Установите и настройте :mod:`importlib`;

source: Apply the :ref:`Path Configuration <init-path-config>`;
ru: Примените :ref:`Конфигурацию пути <init-path-config>`;

source: Install signal handlers;
ru: Установить обработчики сигналов;

source: Finish :mod:`sys` module initialization (ex: create :data:`sys.stdout` and :data:`sys.path`);
ru: Завершить инициализацию модуля :mod:`sys` (например: создать :data:`sys.stdout` и :data:`sys.path`);

source: Enable optional features like :mod:`faulthandler` and :mod:`tracemalloc`;
ru: Включите дополнительные функции, такие как :mod:`faulthandler` и :mod:`tracemalloc`;

source: Import the :mod:`site` module;
ru: Импортируйте модуль :mod:`site`;

source: etc.
ru: и т.д.

source: Private provisional API:
ru: Частный временный API:

source: :c:member:`PyConfig._init_main`: if set to ``0``, :c:func:`Py_InitializeFromConfig` stops at the "Core" initialization phase.
ru: :c:member:`PyConfig._init_main`: если установлено значение ``0``, :c:func:`Py_InitializeFromConfig` останавливается на этапе инициализации "Ядро".

source: Move to the "Main" initialization phase, finish the Python initialization.
ru: Перейдите к этапу инициализации «Основной», завершите инициализацию Python.

source: No module is imported during the "Core" phase and the ``importlib`` module is not configured: the :ref:`Path Configuration <init-path-config>` is only applied during the "Main" phase. It may allow to customize Python in Python to override or tune the :ref:`Path Configuration <init-path-config>`, maybe install a custom :data:`sys.meta_path` importer or an import hook, etc.
ru: На этапе «Основной» модуль не импортируется, и модуль importlib не настроен: :ref:`Конфигурация пути <init-path-config>` применяется только на этапе «Основной». Это может позволить настроить Python в Python для переопределения или настройки :ref:`Path Configuration <init-path-config>`, возможно, установить собственный импортер :data:`sys.meta_path` или перехватчик импорта и т. д.

source: It may become possible to calculate the :ref:`Path Configuration <init-path-config>` in Python, after the Core phase and before the Main phase, which is one of the :pep:`432` motivation.
ru: Может стать возможным вычислить :ref:`Конфигурацию пути <init-path-config>` в Python после фазы Core и перед основной фазой, что является одной из причин :pep:`432`.

source: The "Core" phase is not properly defined: what should be and what should not be available at this phase is not specified yet. The API is marked as private and provisional: the API can be modified or even be removed anytime until a proper public API is designed.
ru: Фаза «Ядро» не определена должным образом: что должно быть, а что не должно быть доступно на этом этапе, пока не указано. API помечен как частный и временный: API можно изменить или даже удалить в любое время, пока не будет разработан подходящий общедоступный API.

source: Example running Python code between "Core" and "Main" initialization phases::
ru: Пример запуска кода Python между фазами инициализации «Core» и «Main»:
