Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/init.po
Languages: ru

source: Set the tracing function to *func*. This is similar to :c:func:`PyEval_SetProfile`, except the tracing function does receive line-number events and per-opcode events, but does not receive any event related to C function objects being called. Any trace function registered using :c:func:`PyEval_SetTrace` will not receive :c:data:`PyTrace_C_CALL`, :c:data:`PyTrace_C_EXCEPTION` or :c:data:`PyTrace_C_RETURN` as a value for the *what* parameter.
ru: Установите для функции трассировки значение *func*. Это похоже на :c:func:`PyEval_SetProfile`, за исключением того, что функция трассировки получает события номера строки и события для каждого кода операции, но не получает никаких событий, связанных с вызываемыми объектами функции C. Любая функция трассировки, зарегистрированная с использованием :c:func:`PyEval_SetTrace`, не получит :c:data:`PyTrace_C_CALL`, :c:data:`PyTrace_C_EXCEPTION` или :c:data:`PyTrace_C_RETURN` в качестве значения для *what* параметр.

source: See also the :func:`sys.settrace` function.
ru: См. также функцию :func:`sys.settrace`.

source: Like :c:func:`PyEval_SetTrace` but sets the tracing function in all running threads belonging to the current interpreter instead of the setting it only on the current thread.
ru: Подобно :c:func:`PyEval_SetTrace`, но устанавливает функцию трассировки во всех запущенных потоках, принадлежащих текущему интерпретатору, а не только в текущем потоке.

source: As :c:func:`PyEval_SetTrace`, this function ignores any exceptions raised while setting the trace functions in all threads.
ru: Как и :c:func:`PyEval_SetTrace`, эта функция игнорирует любые исключения, возникающие при установке функций трассировки во всех потоках.

source: Reference tracing
ru: Отслеживание ссылок

source: The type of the trace function registered using :c:func:`PyRefTracer_SetTracer`. The first parameter is a Python object that has been just created (when **event** is set to :c:data:`PyRefTracer_CREATE`) or about to be destroyed (when **event** is set to :c:data:`PyRefTracer_DESTROY`). The **data** argument is the opaque pointer that was provided when :c:func:`PyRefTracer_SetTracer` was called.
ru: Тип функции трассировки, зарегистрированной с помощью :c:func:`PyRefTracer_SetTracer`. Первый параметр — это объект Python, который только что был создан (когда для **event** установлено значение :c:data:`PyRefTracer_CREATE`) или собирается быть уничтоженным (когда для **event** установлено значение :c:data). :`PyRefTracer_DESTROY`). Аргумент **data** — это непрозрачный указатель, который был предоставлен при вызове :c:func:`PyRefTracer_SetTracer`.

source: The value for the *event* parameter to :c:type:`PyRefTracer` functions when a Python object has been created.
ru: Значение параметра *event* для функции :c:type:`PyRefTracer` при создании объекта Python.

source: The value for the *event* parameter to :c:type:`PyRefTracer` functions when a Python object has been destroyed.
ru: Значение параметра *event* для функции :c:type:`PyRefTracer`, когда объект Python был уничтожен.

source: Register a reference tracer function. The function will be called when a new Python has been created or when an object is going to be destroyed. If **data** is provided it must be an opaque pointer that will be provided when the tracer function is called. Return ``0`` on success. Set an exception and return ``-1`` on error.
ru: Зарегистрируйте функцию трассировки ссылок. Функция будет вызываться, когда будет создан новый Python или когда объект будет уничтожен. Если указаны **данные**, это должен быть непрозрачный указатель, который будет предоставлен при вызове функции трассировки. Верните ``0`` в случае успеха. Установите исключение и возвращайте ``-1`` в случае ошибки.

source: Not that tracer functions **must not** create Python objects inside or otherwise the call will be re-entrant. The tracer also **must not** clear any existing exception or set an exception. The GIL will be held every time the tracer function is called.
ru: Это не значит, что функции трассировки **не должны** создавать внутри объекты Python, иначе вызов будет повторным входом. Трассировщик также **не должен** очищать существующие исключения или устанавливать исключения. GIL будет удерживаться каждый раз при вызове функции трассировки.

source: The GIL must be held when calling this function.
ru: GIL должен удерживаться при вызове этой функции.

source: Get the registered reference tracer function and the value of the opaque data pointer that was registered when :c:func:`PyRefTracer_SetTracer` was called. If no tracer was registered this function will return NULL and will set the **data** pointer to NULL.
ru: Получите зарегистрированную функцию трассировки ссылок и значение непрозрачного указателя данных, который был зарегистрирован при вызове :c:func:`PyRefTracer_SetTracer`. Если трассировщик не был зарегистрирован, эта функция вернет NULL и установит указатель **data** в NULL.

source: Advanced Debugger Support
ru: Расширенная поддержка отладчика

source: These functions are only intended to be used by advanced debugging tools.
ru: Эти функции предназначены только для использования расширенными инструментами отладки.

source: Return the interpreter state object at the head of the list of all such objects.
ru: Верните объект состояния интерпретатора в начало списка всех таких объектов.

source: Return the main interpreter state object.
ru: Верните основной объект состояния интерпретатора.

source: Return the next interpreter state object after *interp* from the list of all such objects.
ru: Возвращает следующий объект состояния интерпретатора после *interp* из списка всех таких объектов.

source: Return the pointer to the first :c:type:`PyThreadState` object in the list of threads associated with the interpreter *interp*.
ru: Верните указатель на первый объект :c:type:`PyThreadState` в списке потоков, связанных с интерпретатором *interp*.

source: Return the next thread state object after *tstate* from the list of all such objects belonging to the same :c:type:`PyInterpreterState` object.
ru: Возвращает следующий объект состояния потока после *tstate* из списка всех таких объектов, принадлежащих одному и тому же объекту :c:type:`PyInterpreterState`.

source: Thread Local Storage Support
ru: Поддержка локального хранилища потоков

source: The Python interpreter provides low-level support for thread-local storage (TLS) which wraps the underlying native TLS implementation to support the Python-level thread local storage API (:class:`threading.local`). The CPython C level APIs are similar to those offered by pthreads and Windows: use a thread key and functions to associate a :c:expr:`void*` value per thread.
ru: Интерпретатор Python обеспечивает низкоуровневую поддержку локального хранилища потоков (TLS), которое оборачивает базовую собственную реализацию TLS для поддержки API локального хранилища потоков уровня Python (:class:`threading.local`). API-интерфейсы уровня C CPython аналогичны API-интерфейсам, предлагаемым pthreads и Windows: используйте ключ потока и функции для связывания значения :c:expr:`void*` с каждым потоком.

source: The GIL does *not* need to be held when calling these functions; they supply their own locking.
ru: GIL *не* нужно удерживать при вызове этих функций; они обеспечивают собственную блокировку.

source: Note that :file:`Python.h` does not include the declaration of the TLS APIs, you need to include :file:`pythread.h` to use thread-local storage.
ru: Обратите внимание, что :file:`Python.h` не включает декларацию TLS API, вам необходимо включить :file:`pythread.h` для использования локального хранилища потока.

source: None of these API functions handle memory management on behalf of the :c:expr:`void*` values. You need to allocate and deallocate them yourself. If the :c:expr:`void*` values happen to be :c:expr:`PyObject*`, these functions don't do refcount operations on them either.
ru: Ни одна из этих функций API не обрабатывает управление памятью от имени значений :c:expr:`void*`. Вам нужно выделить и освободить их самостоятельно. Если значения :c:expr:`void*` оказались :c:expr:`PyObject*`, эти функции также не выполняют над ними операции подсчета ссылок.

source: Thread Specific Storage (TSS) API
ru: API хранилища для конкретных потоков (TSS)

source: TSS API is introduced to supersede the use of the existing TLS API within the CPython interpreter. This API uses a new type :c:type:`Py_tss_t` instead of :c:expr:`int` to represent thread keys.
ru: TSS API заменяет использование существующего TLS API в интерпретаторе CPython. Этот API использует новый тип :c:type:`Py_tss_t` вместо :c:expr:`int` для представления ключей потока.

source: "A New C-API for Thread-Local Storage in CPython" (:pep:`539`)
ru: «Новый C-API для локального хранилища потоков в CPython» (:pep:`539`)

source: This data structure represents the state of a thread key, the definition of which may depend on the underlying TLS implementation, and it has an internal field representing the key's initialization state. There are no public members in this structure.
ru: Эта структура данных представляет состояние ключа потока, определение которого может зависеть от базовой реализации TLS, и имеет внутреннее поле, представляющее состояние инициализации ключа. В этой структуре нет публичных членов.

source: When :ref:`Py_LIMITED_API <stable>` is not defined, static allocation of this type by :c:macro:`Py_tss_NEEDS_INIT` is allowed.
ru: Если :ref:`Py_LIMITED_API <stable>` не определен, статическое выделение этого типа с помощью :c:macro:`Py_tss_NEEDS_INIT` разрешено.

source: This macro expands to the initializer for :c:type:`Py_tss_t` variables. Note that this macro won't be defined with :ref:`Py_LIMITED_API <stable>`.
ru: Этот макрос расширяется до инициализатора переменных :c:type:`Py_tss_t`. Обратите внимание, что этот макрос не будет определен с помощью :ref:`Py_LIMITED_API <stable>`.

source: Dynamic Allocation
ru: Динамическое распределение

source: Dynamic allocation of the :c:type:`Py_tss_t`, required in extension modules built with :ref:`Py_LIMITED_API <stable>`, where static allocation of this type is not possible due to its implementation being opaque at build time.
ru: Динамическое выделение :c:type:`Py_tss_t`, необходимое в модулях расширения, созданных с помощью :ref:`Py_LIMITED_API <stable>`, где статическое выделение этого типа невозможно из-за того, что его реализация непрозрачна во время сборки.

source: Return a value which is the same state as a value initialized with :c:macro:`Py_tss_NEEDS_INIT`, or ``NULL`` in the case of dynamic allocation failure.
ru: Возвращает значение, которое находится в том же состоянии, что и значение, инициализированное с помощью :c:macro:`Py_tss_NEEDS_INIT` или ``NULL`` в случае сбоя динамического выделения.

source: Free the given *key* allocated by :c:func:`PyThread_tss_alloc`, after first calling :c:func:`PyThread_tss_delete` to ensure any associated thread locals have been unassigned. This is a no-op if the *key* argument is ``NULL``.
ru: Освободите данный *ключ*, выделенный :c:func:`PyThread_tss_alloc`, после первого вызова :c:func:`PyThread_tss_delete`, чтобы убедиться, что все связанные локальные переменные потока не назначены. Это пустая операция, если аргумент *key* равен ``NULL``.

source: A freed key becomes a dangling pointer. You should reset the key to ``NULL``.
ru: Освобожденная клавиша становится висячим указателем. Вам следует сбросить ключ на ``NULL``.

source: Methods
ru: Методы

source: The parameter *key* of these functions must not be ``NULL``. Moreover, the behaviors of :c:func:`PyThread_tss_set` and :c:func:`PyThread_tss_get` are undefined if the given :c:type:`Py_tss_t` has not been initialized by :c:func:`PyThread_tss_create`.
ru: Параметр *key* этих функций не должен иметь значение NULL. Более того, поведение :c:func:`PyThread_tss_set` и :c:func:`PyThread_tss_get` не определено, если данный :c:type:`Py_tss_t` не был инициализирован :c:func:`PyThread_tss_create`.

source: Return a non-zero value if the given :c:type:`Py_tss_t` has been initialized by :c:func:`PyThread_tss_create`.
ru: Возвращает ненулевое значение, если данный :c:type:`Py_tss_t` был инициализирован :c:func:`PyThread_tss_create`.

source: Return a zero value on successful initialization of a TSS key. The behavior is undefined if the value pointed to by the *key* argument is not initialized by :c:macro:`Py_tss_NEEDS_INIT`. This function can be called repeatedly on the same key -- calling it on an already initialized key is a no-op and immediately returns success.
ru: Возвращает нулевое значение при успешной инициализации ключа TSS. Поведение не определено, если значение, на которое указывает аргумент *key*, не инициализировано :c:macro:`Py_tss_NEEDS_INIT`. Эту функцию можно вызывать повторно для одного и того же ключа — вызов ее для уже инициализированного ключа является пустым и немедленно возвращает успех.

source: Destroy a TSS key to forget the values associated with the key across all threads, and change the key's initialization state to uninitialized. A destroyed key is able to be initialized again by :c:func:`PyThread_tss_create`. This function can be called repeatedly on the same key -- calling it on an already destroyed key is a no-op.
ru: Уничтожьте ключ TSS, чтобы забыть значения, связанные с ним во всех потоках, и измените состояние инициализации ключа на неинициализированное. Уничтоженный ключ можно снова инициализировать с помощью :c:func:`PyThread_tss_create`. Эту функцию можно вызывать повторно для одного и того же ключа — вызов ее для уже уничтоженного ключа является пустым процессом.

source: Return a zero value to indicate successfully associating a :c:expr:`void*` value with a TSS key in the current thread. Each thread has a distinct mapping of the key to a :c:expr:`void*` value.
ru: Возвращает нулевое значение, чтобы указать успешное связывание значения :c:expr:`void*` с ключом TSS в текущем потоке. Каждый поток имеет отдельное сопоставление ключа со значением :c:expr:`void*`.

source: Return the :c:expr:`void*` value associated with a TSS key in the current thread. This returns ``NULL`` if no value is associated with the key in the current thread.
ru: Возвращает значение :c:expr:`void*`, связанное с ключом TSS в текущем потоке. Это возвращает NULL, если с ключом в текущем потоке не связано никакое значение.

source: Thread Local Storage (TLS) API
ru: API локального хранилища потоков (TLS)

source: This API is superseded by :ref:`Thread Specific Storage (TSS) API <thread-specific-storage-api>`.
ru: Этот API заменяется API-интерфейсом :ref:`Thread-Specific Storage (TSS) <thread-dependent-storage-api>`.

source: This version of the API does not support platforms where the native TLS key is defined in a way that cannot be safely cast to ``int``. On such platforms, :c:func:`PyThread_create_key` will return immediately with a failure status, and the other TLS functions will all be no-ops on such platforms.
ru: Эта версия API не поддерживает платформы, где собственный ключ TLS определен таким образом, что его невозможно безопасно привести к int. На таких платформах :c:func:`PyThread_create_key` немедленно вернется со статусом сбоя, а все остальные функции TLS на таких платформах будут недоступны.

source: Due to the compatibility problem noted above, this version of the API should not be used in new code.
ru: Из-за отмеченной выше проблемы совместимости эту версию API не следует использовать в новом коде.

source: Synchronization Primitives
ru: Примитивы синхронизации

source: The C-API provides a basic mutual exclusion lock.
ru: C-API обеспечивает базовую блокировку взаимного исключения.

source: A mutual exclusion lock. The :c:type:`!PyMutex` should be initialized to zero to represent the unlocked state. For example::
ru: Блокировка взаимного исключения. :c:type:`!PyMutex` должен быть инициализирован нулем, чтобы представлять разблокированное состояние. Например::

source: Instances of :c:type:`!PyMutex` should not be copied or moved. Both the contents and address of a :c:type:`!PyMutex` are meaningful, and it must remain at a fixed, writable location in memory.
ru: Экземпляры :c:type:`!PyMutex` не следует копировать или перемещать. И содержимое, и адрес :c:type:`!PyMutex` имеют смысл, и они должны оставаться в фиксированном, доступном для записи месте в памяти.

source: A :c:type:`!PyMutex` currently occupies one byte, but the size should be considered unstable. The size may change in future Python releases without a deprecation period.
ru: A :c:type:`!PyMutex` в настоящее время занимает один байт, но размер следует считать нестабильным. Размер может измениться в будущих выпусках Python без периода устаревания.

source: Lock mutex *m*. If another thread has already locked it, the calling thread will block until the mutex is unlocked. While blocked, the thread will temporarily release the :term:`GIL` if it is held.
ru: Блокировка мьютекса *m*. Если другой поток уже заблокировал его, вызывающий поток будет заблокирован до тех пор, пока мьютекс не будет разблокирован. Будучи заблокированным, поток временно освободит :term:`GIL`, если он удерживается.

source: Unlock mutex *m*. The mutex must be locked --- otherwise, the function will issue a fatal error.
ru: Разблокировать мьютекс *m*. Мьютекс должен быть заблокирован — в противном случае функция выдаст фатальную ошибку.

source: Python Critical Section API
ru: API критической секции Python

source: The critical section API provides a deadlock avoidance layer on top of per-object locks for :term:`free-threaded <free threading>` CPython. They are intended to replace reliance on the :term:`global interpreter lock`, and are no-ops in versions of Python with the global interpreter lock.
ru: API критической секции обеспечивает уровень предотвращения взаимоблокировок поверх блокировок для каждого объекта для :term:`free-threaded <free threading>` CPython. Они предназначены для замены использования :term:`глобальной блокировки интерпретатора` и не используются в версиях Python с глобальной блокировкой интерпретатора.

source: Critical sections avoid deadlocks by implicitly suspending active critical sections and releasing the locks during calls to :c:func:`PyEval_SaveThread`. When :c:func:`PyEval_RestoreThread` is called, the most recent critical section is resumed, and its locks reacquired. This means the critical section API provides weaker guarantees than traditional locks -- they are useful because their behavior is similar to the :term:`GIL`.
ru: Критические секции избегают взаимоблокировок, неявно приостанавливая активные критические секции и снимая блокировки во время вызовов :c:func:`PyEval_SaveThread`. Когда вызывается :c:func:`PyEval_RestoreThread`, возобновляется работа самой последней критической секции, и ее блокировки восстанавливаются. Это означает, что API критической секции предоставляет более слабые гарантии, чем традиционные блокировки — они полезны, поскольку их поведение похоже на :term:`GIL`.

source: The functions and structs used by the macros are exposed for cases where C macros are not available. They should only be used as in the given macro expansions. Note that the sizes and contents of the structures may change in future Python versions.
ru: Функции и структуры, используемые макросами, доступны в тех случаях, когда макросы C недоступны. Их следует использовать только так, как в данных макрорасширениях. Обратите внимание, что размеры и содержимое структур могут измениться в будущих версиях Python.

source: Operations that need to lock two objects at once must use :c:macro:`Py_BEGIN_CRITICAL_SECTION2`. You *cannot* use nested critical sections to lock more than one object at once, because the inner critical section may suspend the outer critical sections. This API does not provide a way to lock more than two objects at once.
ru: Операции, которым необходимо заблокировать два объекта одновременно, должны использовать :c:macro:`Py_BEGIN_CRITICAL_SECTION2`. Вы *не можете* использовать вложенные критические секции для одновременной блокировки более чем одного объекта, поскольку внутренняя критическая секция может приостановить работу внешних критических секций. Этот API не предоставляет возможности заблокировать более двух объектов одновременно.

source: Example usage::
ru: Пример использования::

source: In the above example, :c:macro:`Py_SETREF` calls :c:macro:`Py_DECREF`, which can call arbitrary code through an object's deallocation function. The critical section API avoids potentital deadlocks due to reentrancy and lock ordering by allowing the runtime to temporarily suspend the critical section if the code triggered by the finalizer blocks and calls :c:func:`PyEval_SaveThread`.
ru: В приведенном выше примере :c:macro:`Py_SETREF` вызывает :c:macro:`Py_DECREF`, который может вызывать произвольный код через функцию освобождения объекта. API критической секции позволяет избежать потенциальных взаимоблокировок из-за повторного входа и порядка блокировок, позволяя среде выполнения временно приостанавливать критическую секцию, если код, запущенный финализатором, блокируется и вызывает :c:func:`PyEval_SaveThread`.

source: Acquires the per-object lock for the object *op* and begins a critical section.
ru: Получает блокировку для каждого объекта *op* и начинает критическую секцию.

source: In the free-threaded build, this macro expands to::
ru: В свободнопоточной сборке этот макрос расширяется до:

source: In the default build, this macro expands to ``{``.
ru: В сборке по умолчанию этот макрос расширяется до ``{``.

source: Ends the critical section and releases the per-object lock.
ru: Завершает критическую секцию и снимает блокировку каждого объекта.

source: In the default build, this macro expands to ``}``.
ru: В сборке по умолчанию этот макрос расширяется до ``}``.

source: Acquires the per-objects locks for the objects *a* and *b* and begins a critical section. The locks are acquired in a consistent order (lowest address first) to avoid lock ordering deadlocks.
ru: Получает блокировки для объектов *a* и *b* и начинает критическую секцию. Блокировки устанавливаются в последовательном порядке (сначала наименьший адрес), чтобы избежать взаимоблокировок в порядке блокировок.

source: Ends the critical section and releases the per-object locks.
ru: Завершает критическую секцию и снимает блокировки для каждого объекта.

source: path (in module sys)
ru: path (в модуле sys)

source: module
ru: модуль

source: builtins
ru: встроенные

source: search
ru: поиск

source: path
ru: путь

source: Py_FinalizeEx (C function)
ru: Py_FinalizeEx (C функция)

source: global interpreter lock
ru: глобальная блокировка интерпретатора

source: PyThreadState (C type)
ru: PyThreadState (тип C)

source: Py_BEGIN_ALLOW_THREADS (C macro)
ru: Py_BEGIN_ALLOW_THREADS (C макрос)

source: Py_END_ALLOW_THREADS (C macro)
ru: Py_END_ALLOW_THREADS (C макрос)

source: PyEval_RestoreThread (C function)
ru: PyEval_RestoreThread (C функция)

source: PyEval_SaveThread (C function)
ru: PyEval_SaveThread (C функция)

source: Py_Initialize (C function)
ru: Py_Initialize (C функция)
