Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/init.po
Languages: ru

source: For modules using single-phase initialization, e.g. :c:func:`PyModule_Create`, the first time a particular extension is imported, it is initialized normally, and a (shallow) copy of its module's dictionary is squirreled away. When the same extension is imported by another (sub-)interpreter, a new module is initialized and filled with the contents of this copy; the extension's ``init`` function is not called. Objects in the module's dictionary thus end up shared across (sub-)interpreters, which might cause unwanted behavior (see `Bugs and caveats`_ below).
ru: Для модулей, использующих однофазную инициализацию, например :c:func:`PyModule_Create`, при первом импорте определенного расширения оно инициализируется нормально, а (неполная) копия словаря его модуля сохраняется. Когда то же расширение импортируется другим (суб)интерпретатором, новый модуль инициализируется и заполняется содержимым этой копии; функция ``init`` расширения не вызывается. Таким образом, объекты в словаре модуля становятся общими для (суб)интерпретаторов, что может вызвать нежелательное поведение (см. `Ошибки и предостережения`_ ниже).

source: Note that this is different from what happens when an extension is imported after the interpreter has been completely re-initialized by calling :c:func:`Py_FinalizeEx` and :c:func:`Py_Initialize`; in that case, the extension's ``initmodule`` function *is* called again. As with multi-phase initialization, this means that only C-level static and global variables are shared between these modules.
ru: Обратите внимание, что это отличается от того, что происходит, когда расширение импортируется после полной повторной инициализации интерпретатора путем вызова :c:func:`Py_FinalizeEx` и :c:func:`Py_Initialize`; в этом случае функция ``initmodule`` расширения *вызывается* снова. Как и в случае с многофазной инициализацией, это означает, что между этими модулями используются только статические и глобальные переменные уровня C.

source: Create a new sub-interpreter. This is essentially just a wrapper around :c:func:`Py_NewInterpreterFromConfig` with a config that preserves the existing behavior. The result is an unisolated sub-interpreter that shares the main interpreter's GIL, allows fork/exec, allows daemon threads, and allows single-phase init modules.
ru: Создайте нового субинтерпретатора. По сути, это просто оболочка :c:func:`Py_NewInterpreterFromConfig` с конфигурацией, сохраняющей существующее поведение. В результате получается неизолированный подинтерпретатор, который использует GIL основного интерпретатора, допускает fork/exec, разрешает потоки демона и допускает однофазные модули инициализации.

source: Destroy the (sub-)interpreter represented by the given thread state. The given thread state must be the current thread state. See the discussion of thread states below. When the call returns, the current thread state is ``NULL``. All thread states associated with this interpreter are destroyed. The global interpreter lock used by the target interpreter must be held before calling this function. No GIL is held when it returns.
ru: Уничтожьте (суб)интерпретатор, представленный данным состоянием потока. Данное состояние потока должно быть текущим состоянием потока. См. обсуждение состояний потоков ниже. Когда вызов возвращается, текущее состояние потока равно NULL. Все состояния потока, связанные с этим интерпретатором, уничтожаются. Глобальная блокировка интерпретатора, используемая целевым интерпретатором, должна удерживаться перед вызовом этой функции. При возвращении GIL не сохраняется.

source: :c:func:`Py_FinalizeEx` will destroy all sub-interpreters that haven't been explicitly destroyed at that point.
ru: :c:func:`Py_FinalizeEx` уничтожит все субинтерпретаторы, которые не были явно уничтожены на данный момент.

source: A Per-Interpreter GIL
ru: GIL для каждого интерпретатора

source: Using :c:func:`Py_NewInterpreterFromConfig` you can create a sub-interpreter that is completely isolated from other interpreters, including having its own GIL. The most important benefit of this isolation is that such an interpreter can execute Python code without being blocked by other interpreters or blocking any others. Thus a single Python process can truly take advantage of multiple CPU cores when running Python code. The isolation also encourages a different approach to concurrency than that of just using threads. (See :pep:`554`.)
ru: Используя :c:func:`Py_NewInterpreterFromConfig`, вы можете создать субинтерпретатор, полностью изолированный от других интерпретаторов, в том числе имеющий собственный GIL. Самым важным преимуществом этой изоляции является то, что такой интерпретатор может выполнять код Python, не блокируясь другими интерпретаторами и не блокируя других. Таким образом, один процесс Python действительно может использовать преимущества нескольких ядер ЦП при выполнении кода Python. Изоляция также поощряет другой подход к параллелизму, чем просто использование потоков. (См. :pep:`554`.)

source: Using an isolated interpreter requires vigilance in preserving that isolation. That especially means not sharing any objects or mutable state without guarantees about thread-safety. Even objects that are otherwise immutable (e.g. ``None``, ``(1, 5)``) can't normally be shared because of the refcount. One simple but less-efficient approach around this is to use a global lock around all use of some state (or object). Alternately, effectively immutable objects (like integers or strings) can be made safe in spite of their refcounts by making them :term:`immortal`. In fact, this has been done for the builtin singletons, small integers, and a number of other builtin objects.
ru: Использование изолированного переводчика требует бдительности и сохранения этой изоляции. Это особенно означает, что нельзя совместно использовать какие-либо объекты или изменяемое состояние без гарантий потокобезопасности. Даже объекты, которые в противном случае являются неизменяемыми (например, ``None``, ``(1, 5)``), обычно не могут быть разделены из-за счетчика ссылок. Один простой, но менее эффективный подход заключается в использовании глобальной блокировки для любого использования некоторого состояния (или объекта). С другой стороны, фактически неизменяемые объекты (например, целые числа или строки) можно сделать безопасными, несмотря на их счетчики ссылок, сделав их :term:`бессмертными`. Фактически, это было сделано для встроенных одиночных объектов, малых целых чисел и ряда других встроенных объектов.

source: If you preserve isolation then you will have access to proper multi-core computing without the complications that come with free-threading. Failure to preserve isolation will expose you to the full consequences of free-threading, including races and hard-to-debug crashes.
ru: Если вы сохраните изоляцию, у вас будет доступ к полноценным многоядерным вычислениям без сложностей, связанных со свободной многопоточностью. Неспособность сохранить изоляцию подвергнет вас всем последствиям свободной многопоточности, включая гонки и трудноотлаживаемые сбои.

source: Aside from that, one of the main challenges of using multiple isolated interpreters is how to communicate between them safely (not break isolation) and efficiently. The runtime and stdlib do not provide any standard approach to this yet. A future stdlib module would help mitigate the effort of preserving isolation and expose effective tools for communicating (and sharing) data between interpreters.
ru: Помимо этого, одна из основных проблем использования нескольких изолированных переводчиков заключается в том, как безопасно и эффективно общаться между ними (не нарушая изоляцию). Среда выполнения и стандартная библиотека пока не предоставляют стандартного подхода к этому. Будущий модуль stdlib поможет смягчить усилия по сохранению изоляции и предоставит эффективные инструменты для передачи (и совместного использования) данных между интерпретаторами.

source: Bugs and caveats
ru: Ошибки и предостережения

source: Because sub-interpreters (and the main interpreter) are part of the same process, the insulation between them isn't perfect --- for example, using low-level file operations like :func:`os.close` they can (accidentally or maliciously) affect each other's open files. Because of the way extensions are shared between (sub-)interpreters, some extensions may not work properly; this is especially likely when using single-phase initialization or (static) global variables. It is possible to insert objects created in one sub-interpreter into a namespace of another (sub-)interpreter; this should be avoided if possible.
ru: Поскольку подинтерпретаторы (и основной интерпретатор) являются частью одного и того же процесса, изоляция между ними не идеальна — например, используя низкоуровневые файловые операции, такие как :func:`os.close`, они могут (случайно или злонамеренно) влияют на открытые файлы друг друга. Из-за способа совместного использования расширений между (суб)интерпретаторами некоторые расширения могут работать неправильно; это особенно вероятно при использовании однофазной инициализации или (статических) глобальных переменных. Можно вставлять объекты, созданные в одном субинтерпретаторе, в пространство имен другого (суб)интерпретатора; этого следует избегать, если это возможно.

source: Special care should be taken to avoid sharing user-defined functions, methods, instances or classes between sub-interpreters, since import operations executed by such objects may affect the wrong (sub-)interpreter's dictionary of loaded modules. It is equally important to avoid sharing objects from which the above are reachable.
ru: Особое внимание следует уделить тому, чтобы избежать совместного использования определяемых пользователем функций, методов, экземпляров или классов между субинтерпретаторами, поскольку операции импорта, выполняемые такими объектами, могут повлиять на неправильный словарь (суб)интерпретатора загруженных модулей. Не менее важно избегать совместного использования объектов, из которых доступно вышеперечисленное.

source: Also note that combining this functionality with ``PyGILState_*`` APIs is delicate, because these APIs assume a bijection between Python thread states and OS-level threads, an assumption broken by the presence of sub-interpreters. It is highly recommended that you don't switch sub-interpreters between a pair of matching :c:func:`PyGILState_Ensure` and :c:func:`PyGILState_Release` calls. Furthermore, extensions (such as :mod:`ctypes`) using these APIs to allow calling of Python code from non-Python created threads will probably be broken when using sub-interpreters.
ru: Также обратите внимание, что объединение этой функциональности с API PyGILState_*`` является деликатным, поскольку эти API предполагают биекцию между состояниями потоков Python и потоками уровня ОС, что нарушается наличием субинтерпретаторов. Настоятельно рекомендуется не переключать подинтерпретаторы между парой совпадающих вызовов :c:func:`PyGILState_Ensure` и :c:func:`PyGILState_Release`. Более того, расширения (такие как :mod:`ctypes`), использующие эти API для разрешения вызова кода Python из потоков, созданных не на Python, вероятно, будут нарушены при использовании субинтерпретаторов.

source: Asynchronous Notifications
ru: Асинхронные уведомления

source: A mechanism is provided to make asynchronous notifications to the main interpreter thread. These notifications take the form of a function pointer and a void pointer argument.
ru: Предусмотрен механизм отправки асинхронных уведомлений в основной поток интерпретатора. Эти уведомления принимают форму указателя на функцию и аргумента указателя void.

source: Schedule a function to be called from the main interpreter thread. On success, ``0`` is returned and *func* is queued for being called in the main thread. On failure, ``-1`` is returned without setting any exception.
ru: Запланируйте вызов функции из основного потока интерпретатора. В случае успеха возвращается ``0`` и *func* ставится в очередь для вызова в основном потоке. В случае неудачи возвращается ``-1`` без установки каких-либо исключений.

source: When successfully queued, *func* will be *eventually* called from the main interpreter thread with the argument *arg*. It will be called asynchronously with respect to normally running Python code, but with both these conditions met:
ru: При успешной постановке в очередь *func* будет *в конечном итоге* вызвана из основного потока интерпретатора с аргументом *arg*. Он будет вызываться асинхронно относительно нормально работающего кода Python, но при соблюдении обоих этих условий:

source: on a :term:`bytecode` boundary;
ru: на :term:`bytecode` boundary;

source: with the main thread holding the :term:`global interpreter lock` (*func* can therefore use the full C API).
ru: с основным потоком, удерживающим :term:`глобальную блокировку интерпретатора` (поэтому *func* может использовать полный C API).

source: *func* must return ``0`` on success, or ``-1`` on failure with an exception set. *func* won't be interrupted to perform another asynchronous notification recursively, but it can still be interrupted to switch threads if the global interpreter lock is released.
ru: *func* должна возвращать ``0`` в случае успеха или ``-1`` в случае неудачи с установленным исключением. *func* не будет прервана для рекурсивного выполнения другого асинхронного уведомления, но ее все равно можно прервать для переключения потоков, если глобальная блокировка интерпретатора снята.

source: This function doesn't need a current thread state to run, and it doesn't need the global interpreter lock.
ru: Для запуска этой функции не требуется текущее состояние потока и не требуется глобальная блокировка интерпретатора.

source: To call this function in a subinterpreter, the caller must hold the GIL. Otherwise, the function *func* can be scheduled to be called from the wrong interpreter.
ru: Чтобы вызвать эту функцию в субинтерпретаторе, вызывающая сторона должна хранить GIL. В противном случае вызов функции *func* может быть запланирован не из того интерпретатора.

source: This is a low-level function, only useful for very special cases. There is no guarantee that *func* will be called as quick as possible. If the main thread is busy executing a system call, *func* won't be called before the system call returns. This function is generally **not** suitable for calling Python code from arbitrary C threads. Instead, use the :ref:`PyGILState API<gilstate>`.
ru: Это низкоуровневая функция, полезная только в особых случаях. Нет никакой гарантии, что *func* будет вызвана как можно быстрее. Если основной поток занят выполнением системного вызова, *func* не будет вызываться до возврата системного вызова. Эта функция обычно **не** подходит для вызова кода Python из произвольных потоков C. Вместо этого используйте :ref:`PyGILState API<gilstate>`.

source: If this function is called in a subinterpreter, the function *func* is now scheduled to be called from the subinterpreter, rather than being called from the main interpreter. Each subinterpreter now has its own list of scheduled calls.
ru: Если эта функция вызывается в субинтерпретаторе, функция *func* теперь запланирована для вызова из субинтерпретатора, а не из основного интерпретатора. У каждого субпереводчика теперь есть свой список запланированных вызовов.

source: Profiling and Tracing
ru: Профилирование и трассировка

source: The Python interpreter provides some low-level support for attaching profiling and execution tracing facilities. These are used for profiling, debugging, and coverage analysis tools.
ru: Интерпретатор Python обеспечивает некоторую низкоуровневую поддержку для подключения средств профилирования и отслеживания выполнения. Они используются для инструментов профилирования, отладки и анализа покрытия.

source: This C interface allows the profiling or tracing code to avoid the overhead of calling through Python-level callable objects, making a direct C function call instead. The essential attributes of the facility have not changed; the interface allows trace functions to be installed per-thread, and the basic events reported to the trace function are the same as had been reported to the Python-level trace functions in previous versions.
ru: Этот интерфейс C позволяет коду профилирования или трассировки избежать накладных расходов на вызов через вызываемые объекты уровня Python, вместо этого выполняя прямой вызов функции C. Основные характеристики объекта не изменились; интерфейс позволяет устанавливать функции трассировки для каждого потока, а основные события, сообщаемые функции трассировки, такие же, как и функции трассировки уровня Python в предыдущих версиях.

source: The type of the trace function registered using :c:func:`PyEval_SetProfile` and :c:func:`PyEval_SetTrace`. The first parameter is the object passed to the registration function as *obj*, *frame* is the frame object to which the event pertains, *what* is one of the constants :c:data:`PyTrace_CALL`, :c:data:`PyTrace_EXCEPTION`, :c:data:`PyTrace_LINE`, :c:data:`PyTrace_RETURN`, :c:data:`PyTrace_C_CALL`, :c:data:`PyTrace_C_EXCEPTION`, :c:data:`PyTrace_C_RETURN`, or :c:data:`PyTrace_OPCODE`, and *arg* depends on the value of *what*:
ru: Тип функции трассировки, зарегистрированной с помощью :c:func:`PyEval_SetProfile` и :c:func:`PyEval_SetTrace`. Первый параметр — это объект, передаваемый в функцию регистрации как *obj*, *frame* — объект кадра, к которому относится событие, *what* — одна из констант :c:data:`PyTrace_CALL`, :c:data :`PyTrace_EXCEPTION`, :c:data:`PyTrace_LINE`, :c:data:`PyTrace_RETURN`, :c:data:`PyTrace_C_CALL`, :c:data:`PyTrace_C_EXCEPTION`, :c:data:`PyTrace_C_RETURN`, или :c:data:`PyTrace_OPCODE`, а *arg* зависит от значения *what*:

source: Meaning of *arg*
ru: Значение *arg*

source: Always :c:data:`Py_None`.
ru: Всегда :c:data:`Py_None`.

source: Exception information as returned by :func:`sys.exc_info`.
ru: Информация об исключении, возвращаемая :func:`sys.exc_info`.

source: Value being returned to the caller, or ``NULL`` if caused by an exception.
ru: Значение, возвращаемое вызывающему объекту, или ``NULL``, если оно вызвано исключением.

source: Function object being called.
ru: Вызываемый функциональный объект.

source: The value of the *what* parameter to a :c:type:`Py_tracefunc` function when a new call to a function or method is being reported, or a new entry into a generator. Note that the creation of the iterator for a generator function is not reported as there is no control transfer to the Python bytecode in the corresponding frame.
ru: Значение параметра *what* функции :c:type:`Py_tracefunc`, когда сообщается о новом вызове функции или метода или о новой записи в генераторе. Обратите внимание, что о создании итератора для функции-генератора не сообщается, поскольку в соответствующем кадре нет передачи управления байт-коду Python.

source: The value of the *what* parameter to a :c:type:`Py_tracefunc` function when an exception has been raised. The callback function is called with this value for *what* when after any bytecode is processed after which the exception becomes set within the frame being executed. The effect of this is that as exception propagation causes the Python stack to unwind, the callback is called upon return to each frame as the exception propagates. Only trace functions receives these events; they are not needed by the profiler.
ru: Значение параметра *what* функции :c:type:`Py_tracefunc` при возникновении исключения. Функция обратного вызова вызывается с этим значением для *what*, когда после обработки любого байт-кода возникает исключение в исполняемом кадре. Результатом этого является то, что, поскольку распространение исключения приводит к раскручиванию стека Python, обратный вызов вызывается при возврате к каждому кадру по мере распространения исключения. Эти события получают только функции трассировки; они не нужны профилировщику.

source: The value passed as the *what* parameter to a :c:type:`Py_tracefunc` function (but not a profiling function) when a line-number event is being reported. It may be disabled for a frame by setting :attr:`~frame.f_trace_lines` to *0* on that frame.
ru: Значение передается как параметр *what* в функцию :c:type:`Py_tracefunc` (но не в функцию профилирования), когда сообщается о событии с номером строки. Его можно отключить для кадра, установив для :attr:`~frame.f_trace_lines` значение *0* в этом кадре.

source: The value for the *what* parameter to :c:type:`Py_tracefunc` functions when a call is about to return.
ru: Значение параметра *what* для функции :c:type:`Py_tracefunc`, когда вызов собирается вернуться.

source: The value for the *what* parameter to :c:type:`Py_tracefunc` functions when a C function is about to be called.
ru: Значение параметра *what* для функции :c:type:`Py_tracefunc`, когда должна быть вызвана функция C.

source: The value for the *what* parameter to :c:type:`Py_tracefunc` functions when a C function has raised an exception.
ru: Значение параметра *what* для функции :c:type:`Py_tracefunc`, когда функция C вызвала исключение.

source: The value for the *what* parameter to :c:type:`Py_tracefunc` functions when a C function has returned.
ru: Значение параметра *what* для функции :c:type:`Py_tracefunc` при возврате функции C.

source: The value for the *what* parameter to :c:type:`Py_tracefunc` functions (but not profiling functions) when a new opcode is about to be executed. This event is not emitted by default: it must be explicitly requested by setting :attr:`~frame.f_trace_opcodes` to *1* on the frame.
ru: Значение параметра *what* для функций :c:type:`Py_tracefunc` (но не для функций профилирования), когда новый код операции должен быть выполнен. Это событие не генерируется по умолчанию: его необходимо явно запросить, установив для :attr:`~frame.f_trace_opcodes` значение *1* в кадре.

source: Set the profiler function to *func*. The *obj* parameter is passed to the function as its first parameter, and may be any Python object, or ``NULL``. If the profile function needs to maintain state, using a different value for *obj* for each thread provides a convenient and thread-safe place to store it. The profile function is called for all monitored events except :c:data:`PyTrace_LINE` :c:data:`PyTrace_OPCODE` and :c:data:`PyTrace_EXCEPTION`.
ru: Установите для функции профилировщика значение *func*. Параметр *obj* передается функции в качестве первого параметра и может быть любым объектом Python или ``NULL``. Если функции профиля необходимо сохранять состояние, использование разных значений *obj* для каждого потока обеспечивает удобное и потокобезопасное место для его хранения. Функция профиля вызывается для всех отслеживаемых событий, кроме :c:data:`PyTrace_LINE` :c:data:`PyTrace_OPCODE` и :c:data:`PyTrace_EXCEPTION`.

source: See also the :func:`sys.setprofile` function.
ru: См. также функцию :func:`sys.setprofile`.

source: The caller must hold the :term:`GIL`.
ru: Вызывающая сторона должна удерживать :term:`GIL`.

source: Like :c:func:`PyEval_SetProfile` but sets the profile function in all running threads belonging to the current interpreter instead of the setting it only on the current thread.
ru: Подобно :c:func:`PyEval_SetProfile`, но устанавливает функцию профиля во всех запущенных потоках, принадлежащих текущему интерпретатору, а не устанавливает ее только в текущем потоке.

source: As :c:func:`PyEval_SetProfile`, this function ignores any exceptions raised while setting the profile functions in all threads.
ru: Как и :c:func:`PyEval_SetProfile`, эта функция игнорирует любые исключения, возникающие при настройке функций профиля во всех потоках.
