Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/init.po
Languages: ru

source: **Bugs and caveats:** The destruction of modules and objects in modules is done in random order; this may cause destructors (:meth:`~object.__del__` methods) to fail when they depend on other objects (even functions) or modules. Dynamically loaded extension modules loaded by Python are not unloaded. Small amounts of memory allocated by the Python interpreter may not be freed (if you find a leak, please report it). Memory tied up in circular references between objects is not freed. Some memory allocated by extension modules may not be freed. Some extensions may not work properly if their initialization routine is called more than once; this can happen if an application calls :c:func:`Py_Initialize` and :c:func:`Py_FinalizeEx` more than once.
ru: **Ошибки и замечания:** Уничтожение модулей и объектов в модулях производится в случайном порядке; это может привести к сбою деструкторов (методов:meth:`~object.__del__`), когда они зависят от других объектов (даже функций) или модулей. Динамически загружаемые модули расширения, загруженные Python, не выгружаются. Небольшие объемы памяти, выделенные интерпретатором Python, могут быть не освобождены (если вы обнаружите утечку, сообщите об этом). Память, связанная циклическими ссылками между объектами, не освобождается. Некоторая память, выделенная модулями расширения, может быть не освобождена. Некоторые расширения могут работать некорректно, если их процедура инициализации вызывается более одного раза; это может произойти, если приложение вызывает :c:func:`Py_Initialize` и :c:func:`Py_FinalizeEx` более одного раза.

source: Raises an :ref:`auditing event <auditing>` ``cpython._PySys_ClearAuditHooks`` with no arguments.
ru: Вызывает :ref:`событие аудита <auditing>``cpython._PySys_ClearAuditHooks`` без аргументов.

source: This is a backwards-compatible version of :c:func:`Py_FinalizeEx` that disregards the return value.
ru: Это обратно совместимая версия :c:func:`Py_FinalizeEx`, которая игнорирует возвращаемое значение.

source: Process-wide parameters
ru: Общепроцессные параметры

source: This API is kept for backward compatibility: setting :c:member:`PyConfig.program_name` should be used instead, see :ref:`Python Initialization Configuration <init-config>`.
ru: Этот API сохранен для обратной совместимости: вместо него следует использовать настройку :c:member:`PyConfig.program_name`, см. :ref:`Конфигурация инициализации Python <init-config>`.

source: This function should be called before :c:func:`Py_Initialize` is called for the first time, if it is called at all. It tells the interpreter the value of the ``argv[0]`` argument to the :c:func:`main` function of the program (converted to wide characters). This is used by :c:func:`Py_GetPath` and some other functions below to find the Python run-time libraries relative to the interpreter executable. The default value is ``'python'``. The argument should point to a zero-terminated wide character string in static storage whose contents will not change for the duration of the program's execution. No code in the Python interpreter will change the contents of this storage.
ru: Эту функцию следует вызывать до первого вызова :c:func:`Py_Initialize`, если она вообще вызывается. Он сообщает интерпретатору значение аргумента ``argv[0]`` функции :c:func:`main` программы (преобразованное в широкие символы). Это используется :c:func:`Py_GetPath` и некоторыми другими функциями ниже для поиска библиотек времени выполнения Python относительно исполняемого файла интерпретатора. Значение по умолчанию — ``'python'``. Аргумент должен указывать на строку широких символов с нулевым завершением в статической памяти, содержимое которой не изменится во время выполнения программы. Никакой код в интерпретаторе Python не изменит содержимое этого хранилища.

source: Use :c:func:`Py_DecodeLocale` to decode a bytes string to get a :c:expr:`wchar_*` string.
ru: Используйте :c:func:`Py_DecodeLocale` для декодирования строки байтов и получения строки :c:expr:`wchar_*`.

source: Return the program name set with :c:member:`PyConfig.program_name`, or the default. The returned string points into static storage; the caller should not modify its value.
ru: Возвращает имя программы, установленное с помощью :c:member:`PyConfig.program_name`, или значение по умолчанию. Возвращенная строка указывает на статическое хранилище; вызывающий абонент не должен изменять его значение.

source: This function should not be called before :c:func:`Py_Initialize`, otherwise it returns ``NULL``.
ru: Эту функцию не следует вызывать до :c:func:`Py_Initialize`, иначе она вернет ``NULL``.

source: It now returns ``NULL`` if called before :c:func:`Py_Initialize`.
ru: Теперь он возвращает NULL, если был вызван до :c:func:`Py_Initialize`.

source: Get :data:`sys.executable` instead.
ru: Вместо этого получите :data:`sys.executable`.

source: Return the *prefix* for installed platform-independent files. This is derived through a number of complicated rules from the program name set with :c:member:`PyConfig.program_name` and some environment variables; for example, if the program name is ``'/usr/local/bin/python'``, the prefix is ``'/usr/local'``. The returned string points into static storage; the caller should not modify its value. This corresponds to the :makevar:`prefix` variable in the top-level :file:`Makefile` and the :option:`--prefix` argument to the :program:`configure` script at build time. The value is available to Python code as ``sys.prefix``. It is only useful on Unix. See also the next function.
ru: Верните *префикс* для установленных файлов, независимых от платформы. Это получается с помощью ряда сложных правил из имени программы, заданного с помощью :c:member:`PyConfig.program_name` и некоторых переменных среды; например, если имя программы ``'/usr/local/bin/python'``, префикс будет ``'/usr/local'``. Возвращенная строка указывает на статическое хранилище; вызывающий абонент не должен изменять его значение. Это соответствует переменной :makevar:`prefix` в :file:`Makefile` верхнего уровня и аргументу :option:`--prefix` скрипта :program:`configure` во время сборки. Это значение доступно для кода Python как ``sys.prefix``. Это полезно только в Unix. См. также следующую функцию.

source: Get :data:`sys.prefix` instead.
ru: Вместо этого получите :data:`sys.prefix`.

source: Return the *exec-prefix* for installed platform-*dependent* files. This is derived through a number of complicated rules from the program name set with :c:member:`PyConfig.program_name` and some environment variables; for example, if the program name is ``'/usr/local/bin/python'``, the exec-prefix is ``'/usr/local'``. The returned string points into static storage; the caller should not modify its value. This corresponds to the :makevar:`exec_prefix` variable in the top-level :file:`Makefile` and the ``--exec-prefix`` argument to the :program:`configure` script at build time. The value is available to Python code as ``sys.exec_prefix``. It is only useful on Unix.
ru: Верните *exec-префикс* для установленных *зависимых* от платформы файлов. Это получается с помощью ряда сложных правил из имени программы, заданного с помощью :c:member:`PyConfig.program_name` и некоторых переменных среды; например, если имя программы ``'/usr/local/bin/python'``, префикс exec будет ``'/usr/local'``. Возвращенная строка указывает на статическое хранилище; вызывающий абонент не должен изменять его значение. Это соответствует переменной :makevar:`exec_prefix` в :file:`Makefile` верхнего уровня и аргументу ``--exec-prefix`` сценария :program:`configure` во время сборки. Это значение доступно для кода Python как ``sys.exec_prefix``. Это полезно только в Unix.

source: Background: The exec-prefix differs from the prefix when platform dependent files (such as executables and shared libraries) are installed in a different directory tree. In a typical installation, platform dependent files may be installed in the :file:`/usr/local/plat` subtree while platform independent may be installed in :file:`/usr/local`.
ru: Справочная информация. Префикс exec-prefix отличается от префикса, когда файлы, зависящие от платформы (например, исполняемые файлы и общие библиотеки), устанавливаются в другое дерево каталогов. При типичной установке файлы, зависящие от платформы, могут быть установлены в поддереве :file:`/usr/local/plat`, тогда как независимые от платформы файлы могут быть установлены в :file:`/usr/local`.

source: Generally speaking, a platform is a combination of hardware and software families, e.g. Sparc machines running the Solaris 2.x operating system are considered the same platform, but Intel machines running Solaris 2.x are another platform, and Intel machines running Linux are yet another platform. Different major revisions of the same operating system generally also form different platforms. Non-Unix operating systems are a different story; the installation strategies on those systems are so different that the prefix and exec-prefix are meaningless, and set to the empty string. Note that compiled Python bytecode files are platform independent (but not independent from the Python version by which they were compiled!).
ru: Вообще говоря, платформа представляет собой комбинацию семейств аппаратного и программного обеспечения, например, машины Sparc под управлением операционной системы Solaris 2.x считаются одной и той же платформой, но машины Intel под управлением Solaris 2.x — это другая платформа, а машины Intel под управлением Linux — еще одна платформа. другая платформа. Различные основные версии одной и той же операционной системы обычно образуют разные платформы. Операционные системы, отличные от Unix, — это совсем другая история; стратегии установки в этих системах настолько различны, что префикс и префикс exec не имеют смысла и устанавливаются в пустую строку. Обратите внимание, что скомпилированные файлы байт-кода Python не зависят от платформы (но не от версии Python, с помощью которой они были скомпилированы!).

source: System administrators will know how to configure the :program:`mount` or :program:`automount` programs to share :file:`/usr/local` between platforms while having :file:`/usr/local/plat` be a different filesystem for each platform.
ru: Системные администраторы знают, как настроить программы :program:`mount` или :program:`automount` для совместного использования :file:`/usr/local` между платформами, при этом :file:`/usr/local/plat` будет разные файловые системы для каждой платформы.

source: Get :data:`sys.exec_prefix` instead.
ru: Вместо этого получите :data:`sys.exec_prefix`.

source: Return the full program name of the Python executable; this is computed as a side-effect of deriving the default module search path from the program name (set by :c:member:`PyConfig.program_name`). The returned string points into static storage; the caller should not modify its value. The value is available to Python code as ``sys.executable``.
ru: Вернуть полное имя исполняемого файла Python; это вычисляется как побочный эффект получения пути поиска модуля по умолчанию из имени программы (установленного :c:member:`PyConfig.program_name`). Возвращенная строка указывает на статическое хранилище; вызывающий абонент не должен изменять его значение. Это значение доступно для кода Python как ``sys.executable``.

source: Return the default module search path; this is computed from the program name (set by :c:member:`PyConfig.program_name`) and some environment variables. The returned string consists of a series of directory names separated by a platform dependent delimiter character. The delimiter character is ``':'`` on Unix and macOS, ``';'`` on Windows. The returned string points into static storage; the caller should not modify its value. The list :data:`sys.path` is initialized with this value on interpreter startup; it can be (and usually is) modified later to change the search path for loading modules.
ru: Вернуть путь поиска модуля по умолчанию; это вычисляется на основе имени программы (заданного :c:member:`PyConfig.program_name`) и некоторых переменных среды. Возвращенная строка состоит из серии имен каталогов, разделенных символом-разделителем, зависящим от платформы. Символом-разделителем является ``':'`` в Unix и macOS, ``';'`` в Windows. Возвращенная строка указывает на статическое хранилище; вызывающий абонент не должен изменять его значение. Список :data:`sys.path` инициализируется этим значением при запуске интерпретатора; его можно (и обычно это делают) изменить позже, чтобы изменить путь поиска для загрузки модулей.

source: Get :data:`sys.path` instead.
ru: Вместо этого получите :data:`sys.path`.

source: Return the version of this Python interpreter. This is a string that looks something like ::
ru: Верните версию этого интерпретатора Python. Это строка, которая выглядит примерно так::

source: The first word (up to the first space character) is the current Python version; the first characters are the major and minor version separated by a period. The returned string points into static storage; the caller should not modify its value. The value is available to Python code as :data:`sys.version`.
ru: Первое слово (до первого пробела) — это текущая версия Python; первые символы — это основная и второстепенная версии, разделенные точкой. Возвращенная строка указывает на статическое хранилище; вызывающий абонент не должен изменять его значение. Это значение доступно для кода Python как :data:`sys.version`.

source: See also the :c:var:`Py_Version` constant.
ru: См. также константу :c:var:`Py_Version`.

source: Return the platform identifier for the current platform. On Unix, this is formed from the "official" name of the operating system, converted to lower case, followed by the major revision number; e.g., for Solaris 2.x, which is also known as SunOS 5.x, the value is ``'sunos5'``. On macOS, it is ``'darwin'``. On Windows, it is ``'win'``. The returned string points into static storage; the caller should not modify its value. The value is available to Python code as ``sys.platform``.
ru: Возвращает идентификатор текущей платформы. В Unix оно формируется из «официального» названия операционной системы, преобразованного в нижний регистр, за которым следует основной номер версии; например, для Solaris 2.x, который также известен как SunOS 5.x, значение равно ``'sunos5'``. В macOS это «Дарвин». В Windows это ``'win'``. Возвращенная строка указывает на статическое хранилище; вызывающий абонент не должен изменять его значение. Значение доступно для кода Python как ``sys.platform``.

source: Return the official copyright string for the current Python version, for example
ru: Возвратите официальную строку авторских прав для текущей версии Python, например

source: The returned string points into static storage; the caller should not modify its value. The value is available to Python code as ``sys.copyright``.
ru: Возвращенная строка указывает на статическое хранилище; вызывающий абонент не должен изменять его значение. Это значение доступно для кода Python как ``sys.copyright``.

source: Return an indication of the compiler used to build the current Python version, in square brackets, for example::
ru: Возвращает указание компилятора, использованного для сборки текущей версии Python, в квадратных скобках, например::

source: The returned string points into static storage; the caller should not modify its value. The value is available to Python code as part of the variable ``sys.version``.
ru: Возвращенная строка указывает на статическое хранилище; вызывающий абонент не должен изменять его значение. Это значение доступно для кода Python как часть переменной ``sys.version``.

source: Return information about the sequence number and build date and time of the current Python interpreter instance, for example ::
ru: Возвращает информацию о порядковом номере, дате и времени сборки текущего экземпляра интерпретатора Python, например:::

source: This API is kept for backward compatibility: setting :c:member:`PyConfig.argv`, :c:member:`PyConfig.parse_argv` and :c:member:`PyConfig.safe_path` should be used instead, see :ref:`Python Initialization Configuration <init-config>`.
ru: Этот API сохранен для обратной совместимости: вместо этого следует использовать настройки :c:member:`PyConfig.argv`, :c:member:`PyConfig.parse_argv` и :c:member:`PyConfig.safe_path`, см. :ref: `Конфигурация инициализации Python <init-config>`.

source: Set :data:`sys.argv` based on *argc* and *argv*. These parameters are similar to those passed to the program's :c:func:`main` function with the difference that the first entry should refer to the script file to be executed rather than the executable hosting the Python interpreter. If there isn't a script that will be run, the first entry in *argv* can be an empty string. If this function fails to initialize :data:`sys.argv`, a fatal condition is signalled using :c:func:`Py_FatalError`.
ru: Установите :data:`sys.argv` на основе *argc* и *argv*. Эти параметры аналогичны параметрам, передаваемым в функцию :c:func:`main` программы, с той разницей, что первая запись должна ссылаться на файл сценария, который должен быть выполнен, а не на исполняемый файл, в котором размещен интерпретатор Python. Если скрипта, который будет запущен, нет, первая запись в *argv* может быть пустой строкой. Если этой функции не удается инициализировать :data:`sys.argv`, фатальное состояние сигнализируется с помощью :c:func:`Py_FatalError`.

source: If *updatepath* is zero, this is all the function does. If *updatepath* is non-zero, the function also modifies :data:`sys.path` according to the following algorithm:
ru: Если *updatepath* равен нулю, это все, что делает функция. Если *updatepath* ненулевое значение, функция также изменяет :data:`sys.path` в соответствии со следующим алгоритмом:

source: If the name of an existing script is passed in ``argv[0]``, the absolute path of the directory where the script is located is prepended to :data:`sys.path`.
ru: Если имя существующего скрипта передается в ``argv[0]``, к :data:`sys.path` добавляется абсолютный путь к каталогу, в котором находится скрипт.

source: Otherwise (that is, if *argc* is ``0`` or ``argv[0]`` doesn't point to an existing file name), an empty string is prepended to :data:`sys.path`, which is the same as prepending the current working directory (``"."``).
ru: В противном случае (то есть, если *argc* равен ``0`` или ``argv[0]`` не указывает на существующее имя файла), перед :data:`sys.path` добавляется пустая строка, это то же самое, что добавление текущего рабочего каталога (``"."``).

source: See also :c:member:`PyConfig.orig_argv` and :c:member:`PyConfig.argv` members of the :ref:`Python Initialization Configuration <init-config>`.
ru: См. также члены :c:member:`PyConfig.orig_argv` и :c:member:`PyConfig.argv` в :ref:`Конфигурация инициализации Python <init-config>`.

source: It is recommended that applications embedding the Python interpreter for purposes other than executing a single script pass ``0`` as *updatepath*, and update :data:`sys.path` themselves if desired. See :cve:`2008-5983`.
ru: Приложениям, встраивающим интерпретатор Python для целей, отличных от выполнения отдельного сценария, рекомендуется передавать ``0`` в качестве *updatepath* и при необходимости обновлять :data:`sys.path` самостоятельно. См.:cve:`2008-5983`.

source: On versions before 3.1.3, you can achieve the same effect by manually popping the first :data:`sys.path` element after having called :c:func:`PySys_SetArgv`, for example using::
ru: В версиях до 3.1.3 вы можете добиться того же эффекта, вручную извлекая первый элемент :data:`sys.path` после вызова :c:func:`PySys_SetArgv`, например, используя::

source: This API is kept for backward compatibility: setting :c:member:`PyConfig.argv` and :c:member:`PyConfig.parse_argv` should be used instead, see :ref:`Python Initialization Configuration <init-config>`.
ru: Этот API сохранен для обратной совместимости: вместо него следует использовать настройки :c:member:`PyConfig.argv` и :c:member:`PyConfig.parse_argv`, см. :ref:`Конфигурация инициализации Python <init-config>`.

source: This function works like :c:func:`PySys_SetArgvEx` with *updatepath* set to ``1`` unless the :program:`python` interpreter was started with the :option:`-I`.
ru: Эта функция работает как :c:func:`PySys_SetArgvEx` с параметром *updatepath*, установленным в ``1``, если только интерпретатор :program:`python` не был запущен с :option:`-I`.

source: The *updatepath* value depends on :option:`-I`.
ru: Значение *updatepath* зависит от :option:`-I`.

source: This API is kept for backward compatibility: setting :c:member:`PyConfig.home` should be used instead, see :ref:`Python Initialization Configuration <init-config>`.
ru: Этот API сохранен для обратной совместимости: вместо него следует использовать настройку :c:member:`PyConfig.home`, см. :ref:`Конфигурация инициализации Python <init-config>`.

source: Set the default "home" directory, that is, the location of the standard Python libraries. See :envvar:`PYTHONHOME` for the meaning of the argument string.
ru: Установите «домашний» каталог по умолчанию, то есть расположение стандартных библиотек Python. См. :envvar:`PYTHONHOME`, чтобы узнать значение строки аргумента.

source: The argument should point to a zero-terminated character string in static storage whose contents will not change for the duration of the program's execution. No code in the Python interpreter will change the contents of this storage.
ru: Аргумент должен указывать на символьную строку с нулевым завершением в статической памяти, содержимое которой не изменится во время выполнения программы. Никакой код в интерпретаторе Python не изменит содержимое этого хранилища.

source: Return the default "home", that is, the value set by :c:member:`PyConfig.home`, or the value of the :envvar:`PYTHONHOME` environment variable if it is set.
ru: Возвращает «домой» по умолчанию, то есть значение, установленное :c:member:`PyConfig.home`, или значение переменной среды :envvar:`PYTHONHOME`, если она установлена.

source: Get :c:member:`PyConfig.home` or :envvar:`PYTHONHOME` environment variable instead.
ru: Вместо этого получите переменную среды :c:member:`PyConfig.home` или :envvar:`PYTHONHOME`.

source: Thread State and the Global Interpreter Lock
ru: Состояние потока и глобальная блокировка интерпретатора

source: The Python interpreter is not fully thread-safe. In order to support multi-threaded Python programs, there's a global lock, called the :term:`global interpreter lock` or :term:`GIL`, that must be held by the current thread before it can safely access Python objects. Without the lock, even the simplest operations could cause problems in a multi-threaded program: for example, when two threads simultaneously increment the reference count of the same object, the reference count could end up being incremented only once instead of twice.
ru: Интерпретатор Python не является полностью потокобезопасным. Для поддержки многопоточных программ Python существует глобальная блокировка, называемая :term:`глобальной блокировкой интерпретатора` или :term:`GIL`, которая должна удерживаться текущим потоком, прежде чем он сможет безопасно получить доступ к объектам Python. Без блокировки даже самые простые операции могут вызвать проблемы в многопоточной программе: например, когда два потока одновременно увеличивают счетчик ссылок одного и того же объекта, счетчик ссылок может увеличиться только один раз, а не дважды.
