Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/init.po
Languages: ru

source: Therefore, the rule exists that only the thread that has acquired the :term:`GIL` may operate on Python objects or call Python/C API functions. In order to emulate concurrency of execution, the interpreter regularly tries to switch threads (see :func:`sys.setswitchinterval`). The lock is also released around potentially blocking I/O operations like reading or writing a file, so that other Python threads can run in the meantime.
ru: Следовательно, существует правило, согласно которому только поток, получивший :term:`GIL`, может работать с объектами Python или вызывать функции API Python/C. Чтобы эмулировать параллельное выполнение, интерпретатор регулярно пытается переключать потоки (см. :func:`sys.setswitchinterval`). Блокировка также снимается для потенциальной блокировки операций ввода-вывода, таких как чтение или запись файла, чтобы в это время могли выполняться другие потоки Python.

source: The Python interpreter keeps some thread-specific bookkeeping information inside a data structure called :c:type:`PyThreadState`. There's also one global variable pointing to the current :c:type:`PyThreadState`: it can be retrieved using :c:func:`PyThreadState_Get`.
ru: Интерпретатор Python хранит некоторую учетную информацию, специфичную для потока, внутри структуры данных, называемой :c:type:`PyThreadState`. Также есть одна глобальная переменная, указывающая на текущий :c:type:`PyThreadState`: ее можно получить с помощью :c:func:`PyThreadState_Get`.

source: Releasing the GIL from extension code
ru: Освобождение GIL из кода расширения

source: Most extension code manipulating the :term:`GIL` has the following simple structure::
ru: Большая часть кода расширения, управляющего :term:`GIL`, имеет следующую простую структуру::

source: Save the thread state in a local variable. Release the global interpreter lock. ... Do some blocking I/O operation ... Reacquire the global interpreter lock. Restore the thread state from the local variable.
ru: Сохраните состояние потока в локальной переменной. Снимите глобальную блокировку интерпретатора. ... Выполните некоторую блокирующую операцию ввода-вывода... Повторно получите глобальную блокировку интерпретатора. Восстановите состояние потока из локальной переменной.

source: This is so common that a pair of macros exists to simplify it::
ru: Это настолько распространено, что существует пара макросов для упрощения:

source: Py_BEGIN_ALLOW_THREADS ... Do some blocking I/O operation ... Py_END_ALLOW_THREADS
ru: Py_BEGIN_ALLOW_THREADS ... Выполните некоторую блокирующую операцию ввода-вывода... Py_END_ALLOW_THREADS

source: The :c:macro:`Py_BEGIN_ALLOW_THREADS` macro opens a new block and declares a hidden local variable; the :c:macro:`Py_END_ALLOW_THREADS` macro closes the block.
ru: Макрос :c:macro:`Py_BEGIN_ALLOW_THREADS` открывает новый блок и объявляет скрытую локальную переменную; Макрос :c:macro:`Py_END_ALLOW_THREADS` закрывает блок.

source: The block above expands to the following code::
ru: Блок выше расширяется до следующего кода:

source: Here is how these functions work: the global interpreter lock is used to protect the pointer to the current thread state. When releasing the lock and saving the thread state, the current thread state pointer must be retrieved before the lock is released (since another thread could immediately acquire the lock and store its own thread state in the global variable). Conversely, when acquiring the lock and restoring the thread state, the lock must be acquired before storing the thread state pointer.
ru: Вот как работают эти функции: глобальная блокировка интерпретатора используется для защиты указателя на текущее состояние потока. При снятии блокировки и сохранении состояния потока указатель текущего состояния потока должен быть получен до того, как блокировка будет снята (поскольку другой поток может немедленно получить блокировку и сохранить свое собственное состояние потока в глобальной переменной). И наоборот, при получении блокировки и восстановлении состояния потока блокировка должна быть получена до сохранения указателя состояния потока.

source: Calling system I/O functions is the most common use case for releasing the GIL, but it can also be useful before calling long-running computations which don't need access to Python objects, such as compression or cryptographic functions operating over memory buffers. For example, the standard :mod:`zlib` and :mod:`hashlib` modules release the GIL when compressing or hashing data.
ru: Вызов системных функций ввода-вывода является наиболее распространенным вариантом использования для освобождения GIL, но он также может быть полезен перед вызовом длительных вычислений, которым не требуется доступ к объектам Python, например, функции сжатия или шифрования, работающие с буферами памяти. Например, стандартные модули :mod:`zlib` и :mod:`hashlib` освобождают GIL при сжатии или хешировании данных.

source: Non-Python created threads
ru: Потоки, созданные не на Python

source: When threads are created using the dedicated Python APIs (such as the :mod:`threading` module), a thread state is automatically associated to them and the code showed above is therefore correct. However, when threads are created from C (for example by a third-party library with its own thread management), they don't hold the GIL, nor is there a thread state structure for them.
ru: Когда потоки создаются с использованием выделенных API-интерфейсов Python (таких как модуль :mod:`threading`), состояние потока автоматически связывается с ними, и поэтому код, показанный выше, является правильным. Однако, когда потоки создаются из C (например, сторонней библиотекой с собственным управлением потоками), они не содержат GIL, и для них не существует структуры состояния потока.

source: If you need to call Python code from these threads (often this will be part of a callback API provided by the aforementioned third-party library), you must first register these threads with the interpreter by creating a thread state data structure, then acquiring the GIL, and finally storing their thread state pointer, before you can start using the Python/C API. When you are done, you should reset the thread state pointer, release the GIL, and finally free the thread state data structure.
ru: Если вам нужно вызвать код Python из этих потоков (часто это будет частью API обратного вызова, предоставляемого вышеупомянутой сторонней библиотекой), вы должны сначала зарегистрировать эти потоки в интерпретаторе, создав структуру данных состояния потока, а затем получив GIL и, наконец, сохранение указателя состояния потока, прежде чем вы сможете начать использовать API Python/C. Когда вы закончите, вам следует сбросить указатель состояния потока, освободить GIL и, наконец, освободить структуру данных состояния потока.

source: The :c:func:`PyGILState_Ensure` and :c:func:`PyGILState_Release` functions do all of the above automatically. The typical idiom for calling into Python from a C thread is::
ru: Функции :c:func:`PyGILState_Ensure` и :c:func:`PyGILState_Release` выполняют все вышеперечисленное автоматически. Типичная идиома для вызова Python из потока C:

source: Note that the ``PyGILState_*`` functions assume there is only one global interpreter (created automatically by :c:func:`Py_Initialize`). Python supports the creation of additional interpreters (using :c:func:`Py_NewInterpreter`), but mixing multiple interpreters and the ``PyGILState_*`` API is unsupported.
ru: Обратите внимание, что функции ``PyGILState_*`` предполагают, что существует только один глобальный интерпретатор (созданный автоматически :c:func:`Py_Initialize`). Python поддерживает создание дополнительных интерпретаторов (с использованием :c:func:`Py_NewInterpreter`), но смешивание нескольких интерпретаторов и API ``PyGILState_*`` не поддерживается.

source: Cautions about fork()
ru: Предостережения относительно fork()

source: Another important thing to note about threads is their behaviour in the face of the C :c:func:`fork` call. On most systems with :c:func:`fork`, after a process forks only the thread that issued the fork will exist. This has a concrete impact both on how locks must be handled and on all stored state in CPython's runtime.
ru: Еще одна важная вещь, которую следует отметить в отношении потоков, — это их поведение при вызове C :c:func:`fork`. В большинстве систем с :c:func:`fork` после разветвления процесса будет существовать только поток, выдавший разветвление. Это оказывает конкретное влияние как на то, как должны обрабатываться блокировки, так и на все сохраненные состояния во время выполнения CPython.

source: The fact that only the "current" thread remains means any locks held by other threads will never be released. Python solves this for :func:`os.fork` by acquiring the locks it uses internally before the fork, and releasing them afterwards. In addition, it resets any :ref:`lock-objects` in the child. When extending or embedding Python, there is no way to inform Python of additional (non-Python) locks that need to be acquired before or reset after a fork. OS facilities such as :c:func:`!pthread_atfork` would need to be used to accomplish the same thing. Additionally, when extending or embedding Python, calling :c:func:`fork` directly rather than through :func:`os.fork` (and returning to or calling into Python) may result in a deadlock by one of Python's internal locks being held by a thread that is defunct after the fork. :c:func:`PyOS_AfterFork_Child` tries to reset the necessary locks, but is not always able to.
ru: Тот факт, что остается только «текущий» поток, означает, что любые блокировки, удерживаемые другими потоками, никогда не будут сняты. Python решает эту проблему для :func:`os.fork`, получая внутренние блокировки, которые он использует перед разветвлением, и освобождая их после этого. Кроме того, он сбрасывает любые :ref:`lock-objects` в дочернем объекте. При расширении или внедрении Python невозможно сообщить Python о дополнительных (не Python) блокировках, которые необходимо получить до или сбросить после разветвления. Для достижения той же цели необходимо будет использовать такие средства ОС, как :c:func:`!pthread_atfork`. Кроме того, при расширении или встраивании Python вызов :c:func:`fork` напрямую, а не через :func:`os.fork` (и возврат или вызов Python) может привести к взаимоблокировке из-за того, что одна из внутренних блокировок Python удерживается потоком, который прекратил свое существование после разветвления. :c:func:`PyOS_AfterFork_Child` пытается сбросить необходимые блокировки, но не всегда это удается.

source: The fact that all other threads go away also means that CPython's runtime state there must be cleaned up properly, which :func:`os.fork` does. This means finalizing all other :c:type:`PyThreadState` objects belonging to the current interpreter and all other :c:type:`PyInterpreterState` objects. Due to this and the special nature of the :ref:`"main" interpreter <sub-interpreter-support>`, :c:func:`fork` should only be called in that interpreter's "main" thread, where the CPython global runtime was originally initialized. The only exception is if :c:func:`exec` will be called immediately after.
ru: Тот факт, что все остальные потоки исчезают, также означает, что состояние времени выполнения CPython должно быть должным образом очищено, что и делает :func:`os.fork`. Это означает финализацию всех остальных объектов :c:type:`PyThreadState`, принадлежащих текущему интерпретатору, и всех остальных объектов :c:type:`PyInterpreterState`. Из-за этого, а также из-за особой природы :ref:`"main" интерпретатора <sub-interpreter-support>`, :c:func:`fork` следует вызывать только в "основном" потоке этого интерпретатора, где глобальный CPython среда выполнения была изначально инициализирована. Единственное исключение — если сразу после этого будет вызвана :c:func:`exec`.

source: High-level API
ru: Высокоуровневый API

source: These are the most commonly used types and functions when writing C extension code, or when embedding the Python interpreter:
ru: Это наиболее часто используемые типы и функции при написании кода расширения C или при внедрении интерпретатора Python:

source: This data structure represents the state shared by a number of cooperating threads. Threads belonging to the same interpreter share their module administration and a few other internal items. There are no public members in this structure.
ru: Эта структура данных представляет состояние, разделяемое несколькими взаимодействующими потоками. Потоки, принадлежащие одному и тому же интерпретатору, совместно используют административные модули и некоторые другие внутренние элементы. В этой структуре нет публичных членов.

source: Threads belonging to different interpreters initially share nothing, except process state like available memory, open file descriptors and such. The global interpreter lock is also shared by all threads, regardless of to which interpreter they belong.
ru: Потоки, принадлежащие разным интерпретаторам, изначально ничего не разделяют, кроме состояния процесса, такого как доступная память, дескрипторы открытых файлов и т. д. Глобальная блокировка интерпретатора также используется всеми потоками, независимо от того, какому интерпретатору они принадлежат.

source: This data structure represents the state of a single thread. The only public data member is:
ru: Эта структура данных представляет состояние одного потока. Единственный общедоступный элемент данных:

source: This thread's interpreter state.
ru: Состояние интерпретатора этого потока.

source: Deprecated function which does nothing.
ru: Устаревшая функция, которая ничего не делает.

source: In Python 3.6 and older, this function created the GIL if it didn't exist.
ru: В Python 3.6 и старше эта функция создавала GIL, если он не существовал.

source: The function now does nothing.
ru: Функция теперь ничего не делает.

source: This function is now called by :c:func:`Py_Initialize()`, so you don't have to call it yourself anymore.
ru: Эта функция теперь вызывается :c:func:`Py_Initialize()`, поэтому вам больше не придется вызывать ее самостоятельно.

source: This function cannot be called before :c:func:`Py_Initialize()` anymore.
ru: Эту функцию больше нельзя вызывать до :c:func:`Py_Initialize()`.

source: Release the global interpreter lock (if it has been created) and reset the thread state to ``NULL``, returning the previous thread state (which is not ``NULL``). If the lock has been created, the current thread must have acquired it.
ru: Снимите глобальную блокировку интерпретатора (если она была создана) и сбросьте состояние потока на NULL, вернув предыдущее состояние потока (которое не равно NULL). Если блокировка была создана, текущий поток должен ее получить.

source: Acquire the global interpreter lock (if it has been created) and set the thread state to *tstate*, which must not be ``NULL``. If the lock has been created, the current thread must not have acquired it, otherwise deadlock ensues.
ru: Получите глобальную блокировку интерпретатора (если она была создана) и установите состояние потока в *tstate*, которое не должно быть ``NULL``. Если блокировка была создана, текущий поток не должен ее захватить, иначе возникнет взаимоблокировка.

source: Calling this function from a thread when the runtime is finalizing will terminate the thread, even if the thread was not created by Python. You can use :c:func:`Py_IsFinalizing` or :func:`sys.is_finalizing` to check if the interpreter is in process of being finalized before calling this function to avoid unwanted termination.
ru: Вызов этой функции из потока во время завершения среды выполнения приведет к завершению потока, даже если поток не был создан Python. Вы можете использовать :c:func:`Py_IsFinalizing` или :func:`sys.is_finalizing`, чтобы проверить, находится ли интерпретатор в процессе завершения, прежде чем вызывать эту функцию, чтобы избежать нежелательного завершения.

source: Return the current thread state. The global interpreter lock must be held. When the current thread state is ``NULL``, this issues a fatal error (so that the caller needn't check for ``NULL``).
ru: Вернуть текущее состояние потока. Глобальная блокировка интерпретатора должна быть удержана. Когда текущее состояние потока равно NULL, это приводит к фатальной ошибке (поэтому вызывающей стороне не нужно проверять наличие NULL).

source: See also :c:func:`PyThreadState_GetUnchecked`.
ru: См. также :c:func:`PyThreadState_GetUnchecked`.

source: Similar to :c:func:`PyThreadState_Get`, but don't kill the process with a fatal error if it is NULL. The caller is responsible to check if the result is NULL.
ru: Аналогично :c:func:`PyThreadState_Get`, но не завершайте процесс с фатальной ошибкой, если он равен NULL. Вызывающая сторона несет ответственность за проверку того, является ли результат NULL.

source: In Python 3.5 to 3.12, the function was private and known as ``_PyThreadState_UncheckedGet()``.
ru: В версиях Python 3.5–3.12 эта функция была частной и называлась ``_PyThreadState_UncheckedGet()``.

source: Swap the current thread state with the thread state given by the argument *tstate*, which may be ``NULL``. The global interpreter lock must be held and is not released.
ru: Замените текущее состояние потока на состояние потока, заданное аргументом *tstate*, которое может быть ``NULL``. Глобальная блокировка интерпретатора должна удерживаться и не сниматься.

source: The following functions use thread-local storage, and are not compatible with sub-interpreters:
ru: Следующие функции используют локальное хранилище потока и несовместимы с подинтерпретаторами:

source: Ensure that the current thread is ready to call the Python C API regardless of the current state of Python, or of the global interpreter lock. This may be called as many times as desired by a thread as long as each call is matched with a call to :c:func:`PyGILState_Release`. In general, other thread-related APIs may be used between :c:func:`PyGILState_Ensure` and :c:func:`PyGILState_Release` calls as long as the thread state is restored to its previous state before the Release(). For example, normal usage of the :c:macro:`Py_BEGIN_ALLOW_THREADS` and :c:macro:`Py_END_ALLOW_THREADS` macros is acceptable.
ru: Убедитесь, что текущий поток готов вызвать API Python C независимо от текущего состояния Python или глобальной блокировки интерпретатора. Поток может вызывать ее столько раз, сколько пожелает, при условии, что каждый вызов соответствует вызову :c:func:`PyGILState_Release`. В общем, между вызовами :c:func:`PyGILState_Ensure` и :c:func:`PyGILState_Release` можно использовать другие API, связанные с потоками, при условии, что состояние потока восстанавливается до предыдущего состояния перед Release(). Например, допустимо обычное использование макросов :c:macro:`Py_BEGIN_ALLOW_THREADS` и :c:macro:`Py_END_ALLOW_THREADS`.

source: The return value is an opaque "handle" to the thread state when :c:func:`PyGILState_Ensure` was called, and must be passed to :c:func:`PyGILState_Release` to ensure Python is left in the same state. Even though recursive calls are allowed, these handles *cannot* be shared - each unique call to :c:func:`PyGILState_Ensure` must save the handle for its call to :c:func:`PyGILState_Release`.
ru: Возвращаемое значение представляет собой непрозрачный «дескриптор» состояния потока при вызове :c:func:`PyGILState_Ensure` и должно быть передано в :c:func:`PyGILState_Release`, чтобы гарантировать, что Python останется в том же состоянии. Несмотря на то, что рекурсивные вызовы разрешены, эти дескрипторы *не могут* быть общими — каждый уникальный вызов :c:func:`PyGILState_Ensure` должен сохранять дескриптор для своего вызова :c:func:`PyGILState_Release`.

source: When the function returns, the current thread will hold the GIL and be able to call arbitrary Python code. Failure is a fatal error.
ru: Когда функция вернется, текущий поток будет хранить GIL и сможет вызывать произвольный код Python. Неудача – это фатальная ошибка.

source: Release any resources previously acquired. After this call, Python's state will be the same as it was prior to the corresponding :c:func:`PyGILState_Ensure` call (but generally this state will be unknown to the caller, hence the use of the GILState API).
ru: Освободите все ранее приобретенные ресурсы. После этого вызова состояние Python будет таким же, как и до соответствующего вызова :c:func:`PyGILState_Ensure` (но обычно это состояние будет неизвестно вызывающей стороне, поэтому используется API GILState).

source: Every call to :c:func:`PyGILState_Ensure` must be matched by a call to :c:func:`PyGILState_Release` on the same thread.
ru: Каждый вызов :c:func:`PyGILState_Ensure` должен сопровождаться вызовом :c:func:`PyGILState_Release` в том же потоке.

source: Get the current thread state for this thread. May return ``NULL`` if no GILState API has been used on the current thread. Note that the main thread always has such a thread-state, even if no auto-thread-state call has been made on the main thread. This is mainly a helper/diagnostic function.
ru: Получите текущее состояние потока для этого потока. Может возвращать NULL, если в текущем потоке не использовался API GILState. Обратите внимание, что основной поток всегда имеет такое состояние потока, даже если в основном потоке не было выполнено никакого автоматического вызова состояния потока. В основном это вспомогательная/диагностическая функция.

source: Return ``1`` if the current thread is holding the GIL and ``0`` otherwise. This function can be called from any thread at any time. Only if it has had its Python thread state initialized and currently is holding the GIL will it return ``1``. This is mainly a helper/diagnostic function. It can be useful for example in callback contexts or memory allocation functions when knowing that the GIL is locked can allow the caller to perform sensitive actions or otherwise behave differently.
ru: Возвращайте ``1``, если текущий поток содержит GIL, и ``0`` в противном случае. Эту функцию можно вызвать из любого потока в любое время. Только если состояние потока Python было инициализировано и в данный момент удерживается GIL, он вернет «1». В основном это вспомогательная/диагностическая функция. Это может быть полезно, например, в контекстах обратного вызова или функциях выделения памяти, когда знание того, что GIL заблокирован, может позволить вызывающей стороне выполнять конфиденциальные действия или иным образом вести себя по-другому.

source: The following macros are normally used without a trailing semicolon; look for example usage in the Python source distribution.
ru: Следующие макросы обычно используются без точки с запятой в конце; посмотрите пример использования в дистрибутиве исходного кода Python.

source: This macro expands to ``{ PyThreadState *_save; _save = PyEval_SaveThread();``. Note that it contains an opening brace; it must be matched with a following :c:macro:`Py_END_ALLOW_THREADS` macro. See above for further discussion of this macro.
ru: Этот макрос расширяется до ``{ PyThreadState *_save; _save = PyEval_SaveThread();``. Обратите внимание, что он содержит открывающую скобку; он должен соответствовать следующему макросу :c:macro:`Py_END_ALLOW_THREADS`. См. выше дальнейшее обсуждение этого макроса.

source: This macro expands to ``PyEval_RestoreThread(_save); }``. Note that it contains a closing brace; it must be matched with an earlier :c:macro:`Py_BEGIN_ALLOW_THREADS` macro. See above for further discussion of this macro.
ru: Этот макрос расширяется до ``PyEval_RestoreThread(_save); }``. Обратите внимание, что он содержит закрывающую скобку; он должен соответствовать более раннему макросу :c:macro:`Py_BEGIN_ALLOW_THREADS`. См. выше дальнейшее обсуждение этого макроса.
