Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/init_config.po
Languages: ru

source: Default: empty list (``module_search_paths``) and ``0`` (``module_search_paths_set``).
ru: По умолчанию: пустой список (``module_search_paths``) и ``0`` (``module_search_paths_set``).

source: Compilation optimization level:
ru: Уровень оптимизации компиляции:

source: ``0``: Peephole optimizer, set ``__debug__`` to ``True``.
ru: ``0``: оптимизатор Peephole, установите для ``__debug__`` значение ``True``.

source: ``1``: Level 0, remove assertions, set ``__debug__`` to ``False``.
ru: ``1``: Уровень 0, удалите утверждения, установите для ``__debug__`` значение ``False``.

source: ``2``: Level 1, strip docstrings.
ru: ``2``: Уровень 1, удаление строк документации.

source: Incremented by the :option:`-O` command line option. Set to the :envvar:`PYTHONOPTIMIZE` environment variable value.
ru: Увеличивается опцией командной строки :option:`-O`. Установите значение переменной среды :envvar:`PYTHONOPTIMIZE`.

source: The list of the original command line arguments passed to the Python executable: :data:`sys.orig_argv`.
ru: Список исходных аргументов командной строки, передаваемых в исполняемый файл Python: :data:`sys.orig_argv`.

source: If :c:member:`~PyConfig.orig_argv` list is empty and :c:member:`~PyConfig.argv` is not a list only containing an empty string, :c:func:`PyConfig_Read` copies :c:member:`~PyConfig.argv` into :c:member:`~PyConfig.orig_argv` before modifying :c:member:`~PyConfig.argv` (if :c:member:`~PyConfig.parse_argv` is non-zero).
ru: Если список :c:member:`~PyConfig.orig_argv` пуст и :c:member:`~PyConfig.argv` не является списком, содержащим только пустую строку, :c:func:`PyConfig_Read` копирует :c:member :`~PyConfig.argv` в :c:member:`~PyConfig.orig_argv` перед изменением :c:member:`~PyConfig.argv` (если :c:member:`~PyConfig.parse_argv` не равно нулю) .

source: See also the :c:member:`~PyConfig.argv` member and the :c:func:`Py_GetArgcArgv` function.
ru: См. также член :c:member:`~PyConfig.argv` и функцию :c:func:`Py_GetArgcArgv`.

source: Default: empty list.
ru: По умолчанию: пустой список.

source: Parse command line arguments?
ru: Анализировать аргументы командной строки?

source: If equals to ``1``, parse :c:member:`~PyConfig.argv` the same way the regular Python parses :ref:`command line arguments <using-on-cmdline>`, and strip Python arguments from :c:member:`~PyConfig.argv`.
ru: Если равно ``1``, анализируйте :c:member:`~PyConfig.argv` так же, как обычный Python анализирует :ref:`аргументы командной строки <using-on-cmdline>` и удаляет аргументы Python из: c:member:`~PyConfig.argv`.

source: The :c:member:`PyConfig.argv` arguments are now only parsed if :c:member:`PyConfig.parse_argv` equals to ``1``.
ru: Аргументы :c:member:`PyConfig.argv` теперь анализируются только в том случае, если :c:member:`PyConfig.parse_argv` равен ``1``.

source: Parser debug mode. If greater than ``0``, turn on parser debugging output (for expert only, depending on compilation options).
ru: Режим отладки парсера. Если больше ``0``, включите вывод отладки синтаксического анализатора (только для экспертов, в зависимости от параметров компиляции).

source: Incremented by the :option:`-d` command line option. Set to the :envvar:`PYTHONDEBUG` environment variable value.
ru: Увеличивается опцией командной строки :option:`-d`. Установите значение переменной среды :envvar:`PYTHONDEBUG`.

source: Needs a :ref:`debug build of Python <debug-build>` (the ``Py_DEBUG`` macro must be defined).
ru: Требуется :ref:`отладочная сборка Python <debug-build>` (должен быть определен макрос ``Py_DEBUG``).

source: If non-zero, calculation of path configuration is allowed to log warnings into ``stderr``. If equals to ``0``, suppress these warnings.
ru: Если значение не равно нулю, разрешен расчет конфигурации пути для регистрации предупреждений в stderr. Если равно ``0``, подавить эти предупреждения.

source: Now also applies on Windows.
ru: Теперь также применяется в Windows.

source: The site-specific directory prefix where the platform independent Python files are installed: :data:`sys.prefix`.
ru: Префикс каталога, специфичный для сайта, в котором установлены независимые от платформы файлы Python: :data:`sys.prefix`.

source: See also :c:member:`PyConfig.base_prefix`.
ru: См. также :c:member:`PyConfig.base_prefix`.

source: Program name used to initialize :c:member:`~PyConfig.executable` and in early error messages during Python initialization.
ru: Имя программы, используемое для инициализации :c:member:`~PyConfig.executable` и в ранних сообщениях об ошибках во время инициализации Python.

source: On macOS, use :envvar:`PYTHONEXECUTABLE` environment variable if set.
ru: В macOS используйте переменную среды :envvar:`PYTHONEXECUTABLE`, если она установлена.

source: If the ``WITH_NEXT_FRAMEWORK`` macro is defined, use :envvar:`__PYVENV_LAUNCHER__` environment variable if set.
ru: Если определен макрос ``WITH_NEXT_FRAMEWORK``, используйте переменную среды :envvar:`__PYVENV_LAUNCHER__`, если она установлена.

source: Use ``argv[0]`` of :c:member:`~PyConfig.argv` if available and non-empty.
ru: Используйте ``argv[0]`` из :c:member:`~PyConfig.argv`, если он доступен и не пуст.

source: Otherwise, use ``L"python"`` on Windows, or ``L"python3"`` on other platforms.
ru: В противном случае используйте ``L"python"`` в Windows или ``L"python3"`` на других платформах.

source: Directory where cached ``.pyc`` files are written: :data:`sys.pycache_prefix`.
ru: Каталог, в который записываются кэшированные файлы ``.pyc``: :data:`sys.pycache_prefix`.

source: Set by the :option:`-X pycache_prefix=PATH <-X>` command line option and the :envvar:`PYTHONPYCACHEPREFIX` environment variable. The command-line option takes precedence.
ru: Устанавливается параметром командной строки :option:`-X pycache_prefix=PATH <-X>` и переменной среды :envvar:`PYTHONPYCACHEPREFIX`. Параметр командной строки имеет приоритет.

source: If ``NULL``, :data:`sys.pycache_prefix` is set to ``None``.
ru: Если ``NULL``, для :data:`sys.pycache_prefix` установлено значение ``None``.

source: Quiet mode. If greater than ``0``, don't display the copyright and version at Python startup in interactive mode.
ru: Тихий режим. Если больше ``0``, не отображайте авторские права и версию при запуске Python в интерактивном режиме.

source: Incremented by the :option:`-q` command line option.
ru: Увеличивается опцией командной строки :option:`-q`.

source: Value of the :option:`-c` command line option.
ru: Значение параметра командной строки :option:`-c`.

source: Used by :c:func:`Py_RunMain`.
ru: Используется :c:func:`Py_RunMain`.

source: Filename passed on the command line: trailing command line argument without :option:`-c` or :option:`-m`. It is used by the :c:func:`Py_RunMain` function.
ru: Имя файла, передаваемое в командной строке: завершающий аргумент командной строки без :option:`-c` или :option:`-m`. Он используется функцией :c:func:`Py_RunMain`.

source: For example, it is set to ``script.py`` by the ``python3 script.py arg`` command line.
ru: Например, для него установлено значение ``script.py`` в командной строке ``python3 script.py arg``.

source: See also the :c:member:`PyConfig.skip_source_first_line` option.
ru: См. также параметр :c:member:`PyConfig.skip_source_first_line`.

source: ``package.module`` path to module that should be imported before ``site.py`` is run.
ru: ``package.module`` путь к модулю, который должен быть импортирован перед запуском ``site.py``.

source: Set by the :option:`-X presite=package.module <-X>` command-line option and the :envvar:`PYTHON_PRESITE` environment variable. The command-line option takes precedence.
ru: Устанавливается параметром командной строки :option:`-X presite=package.module <-X>` и переменной среды :envvar:`PYTHON_PRESITE`. Параметр командной строки имеет приоритет.

source: Show total reference count at exit (excluding :term:`immortal` objects)?
ru: Показывать общее количество ссылок при выходе (исключая объекты :term:`immortal`)?

source: Set to ``1`` by :option:`-X showrefcount <-X>` command line option.
ru: Установите значение ``1`` с помощью опции командной строки :option:`-X showrefcount <-X>`.

source: Needs a :ref:`debug build of Python <debug-build>` (the ``Py_REF_DEBUG`` macro must be defined).
ru: Требуется :ref:`отладочная сборка Python <debug-build>` (должен быть определен макрос ``Py_REF_DEBUG``).

source: Import the :mod:`site` module at startup?
ru: Импортировать модуль :mod:`site` при запуске?

source: If equal to zero, disable the import of the module site and the site-dependent manipulations of :data:`sys.path` that it entails.
ru: Если оно равно нулю, отключите импорт сайта модуля и связанные с ним манипуляции с :data:`sys.path`, зависящие от сайта.

source: Also disable these manipulations if the :mod:`site` module is explicitly imported later (call :func:`site.main` if you want them to be triggered).
ru: Также отключите эти манипуляции, если модуль :mod:`site` будет явно импортирован позже (вызовите :func:`site.main`, если вы хотите, чтобы они запускались).

source: Set to ``0`` by the :option:`-S` command line option.
ru: Устанавливается в ``0`` опцией командной строки :option:`-S`.

source: :data:`sys.flags.no_site <sys.flags>` is set to the inverted value of :c:member:`~PyConfig.site_import`.
ru: :data:`sys.flags.no_site <sys.flags>` имеет инвертированное значение :c:member:`~PyConfig.site_import`.

source: If non-zero, skip the first line of the :c:member:`PyConfig.run_filename` source.
ru: Если значение не равно нулю, пропустите первую строку источника :c:member:`PyConfig.run_filename`.

source: It allows the usage of non-Unix forms of ``#!cmd``. This is intended for a DOS specific hack only.
ru: Это позволяет использовать не-Unix формы ``#!cmd``. Это предназначено только для взлома DOS.

source: Set to ``1`` by the :option:`-x` command line option.
ru: Устанавливается в ``1`` опцией командной строки :option:`-x`.

source: Encoding and encoding errors of :data:`sys.stdin`, :data:`sys.stdout` and :data:`sys.stderr` (but :data:`sys.stderr` always uses ``"backslashreplace"`` error handler).
ru: Ошибки кодирования и кодирования :data:`sys.stdin`, :data:`sys.stdout` и :data:`sys.stderr` (но :data:`sys.stderr` всегда использует ``"обратную косую черту"`` обработчик ошибок).

source: Use the :envvar:`PYTHONIOENCODING` environment variable if it is non-empty.
ru: Используйте переменную среды :envvar:`PYTHONIOENCODING`, если она не пуста.

source: Default encoding:
ru: Кодировка по умолчанию:

source: ``"UTF-8"`` if :c:member:`PyPreConfig.utf8_mode` is non-zero.
ru: ``"UTF-8"``, если :c:member:`PyPreConfig.utf8_mode` не равно нулю.

source: Otherwise, use the :term:`locale encoding`.
ru: В противном случае используйте :term:`кодировку локали`.

source: Default error handler:
ru: Обработчик ошибок по умолчанию:

source: On Windows: use ``"surrogateescape"``.
ru: В Windows: используйте «surrogateescape».

source: ``"surrogateescape"`` if :c:member:`PyPreConfig.utf8_mode` is non-zero, or if the LC_CTYPE locale is "C" or "POSIX".
ru: ``"surrogateescape"``, если :c:member:`PyPreConfig.utf8_mode` не равно нулю или если локаль LC_CTYPE равна "C" или "POSIX".

source: ``"strict"`` otherwise.
ru: ``"строгий"`` в противном случае.

source: See also :c:member:`PyConfig.legacy_windows_stdio`.
ru: См. также :c:member:`PyConfig.legacy_windows_stdio`.

source: Enable tracemalloc?
ru: Включить трассировку?

source: If non-zero, call :func:`tracemalloc.start` at startup.
ru: Если ненулевое значение, вызовите :func:`tracemalloc.start` при запуске.

source: Set by :option:`-X tracemalloc=N <-X>` command line option and by the :envvar:`PYTHONTRACEMALLOC` environment variable.
ru: Устанавливается параметром командной строки :option:`-X трассировка=N <-X>` и переменной среды :envvar:`PYTHONTRACEMALLOC`.

source: Enable compatibility mode with the perf profiler?
ru: Включить режим совместимости с профилировщиком производительности?

source: If non-zero, initialize the perf trampoline. See :ref:`perf_profiling` for more information.
ru: Если ненулевое значение, инициализировать батут производительности. См. :ref:`perf_profiling` для получения дополнительной информации.

source: Set by :option:`-X perf <-X>` command-line option and by the :envvar:`PYTHON_PERF_JIT_SUPPORT` environment variable for perf support with stack pointers and :option:`-X perf_jit <-X>` command-line option and by the :envvar:`PYTHON_PERF_JIT_SUPPORT` environment variable for perf support with DWARF JIT information.
ru: Устанавливается параметром командной строки :option:`-X perf <-X>` и переменной среды :envvar:`PYTHON_PERF_JIT_SUPPORT` для поддержки производительности с указателями стека и командой :option:`-X perf_jit <-X>`. line и переменной среды :envvar:`PYTHON_PERF_JIT_SUPPORT` для поддержки производительности с информацией DWARF JIT.

source: Use :ref:`environment variables <using-on-envvars>`?
ru: Использовать :ref:`переменные среды <using-on-envvars>`?

source: If equals to zero, ignore the :ref:`environment variables <using-on-envvars>`.
ru: Если равно нулю, игнорируйте :ref:`переменные среды <using-on-envvars>`.

source: Set to ``0`` by the :option:`-E` environment variable.
ru: Устанавливается в ``0`` переменной среды :option:`-E`.

source: If non-zero, add the user site directory to :data:`sys.path`.
ru: Если ненулевое значение, добавьте каталог сайта пользователя в :data:`sys.path`.

source: Set to ``0`` by the :option:`-s` and :option:`-I` command line options.
ru: Установите значение ``0`` с помощью параметров командной строки :option:`-s` и :option:`-I`.

source: Set to ``0`` by the :envvar:`PYTHONNOUSERSITE` environment variable.
ru: Устанавливается в ``0`` переменной среды :envvar:`PYTHONNOUSERSITE`.

source: Verbose mode. If greater than ``0``, print a message each time a module is imported, showing the place (filename or built-in module) from which it is loaded.
ru: Подробный режим. Если больше ``0``, каждый раз при импорте модуля выводить сообщение с указанием места (имя файла или встроенный модуль), из которого он загружен.

source: If greater than or equal to ``2``, print a message for each file that is checked for when searching for a module. Also provides information on module cleanup at exit.
ru: Если больше или равно ``2``, выведите сообщение для каждого файла, который проверяется при поиске модуля. Также предоставляет информацию об очистке модуля при выходе.

source: Incremented by the :option:`-v` command line option.
ru: Увеличивается опцией командной строки :option:`-v`.

source: Set by the :envvar:`PYTHONVERBOSE` environment variable value.
ru: Устанавливается значением переменной среды :envvar:`PYTHONVERBOSE`.

source: Options of the :mod:`warnings` module to build warnings filters, lowest to highest priority: :data:`sys.warnoptions`.
ru: Параметры модуля :mod:`warnings` для создания фильтров предупреждений, от самого низкого до самого высокого приоритета: :data:`sys.warnoptions`.

source: The :mod:`warnings` module adds :data:`sys.warnoptions` in the reverse order: the last :c:member:`PyConfig.warnoptions` item becomes the first item of :data:`warnings.filters` which is checked first (highest priority).
ru: Модуль :mod:`warnings` добавляет :data:`sys.warnoptions` в обратном порядке: последний элемент :c:member:`PyConfig.warnoptions` становится первым элементом :data:`warnings.filters`, который проверяется первым (самый высокий приоритет).

source: The :option:`-W` command line options adds its value to :c:member:`~PyConfig.warnoptions`, it can be used multiple times.
ru: Параметры командной строки :option:`-W` добавляют свое значение к :c:member:`~PyConfig.warnoptions`, его можно использовать несколько раз.

source: The :envvar:`PYTHONWARNINGS` environment variable can also be used to add warning options. Multiple options can be specified, separated by commas (``,``).
ru: Переменную среды :envvar:`PYTHONWARNINGS` также можно использовать для добавления параметров предупреждения. Можно указать несколько опций, разделенных запятыми (``,``).

source: If equal to ``0``, Python won't try to write ``.pyc`` files on the import of source modules.
ru: Если значение равно «0», Python не будет пытаться записывать файлы «.pyc» при импорте исходных модулей.

source: Set to ``0`` by the :option:`-B` command line option and the :envvar:`PYTHONDONTWRITEBYTECODE` environment variable.
ru: Устанавливается в ``0`` с помощью опции командной строки :option:`-B` и переменной среды :envvar:`PYTHONDONTWRITEBYTECODE`.

source: :data:`sys.dont_write_bytecode` is initialized to the inverted value of :c:member:`~PyConfig.write_bytecode`.
ru: :data:`sys.dont_write_bytecode` инициализируется инвертированным значением :c:member:`~PyConfig.write_bytecode`.

source: Values of the :option:`-X` command line options: :data:`sys._xoptions`.
ru: Значения параметров командной строки :option:`-X`: :data:`sys._xoptions`.

source: If :c:member:`~PyConfig.parse_argv` is non-zero, :c:member:`~PyConfig.argv` arguments are parsed the same way the regular Python parses :ref:`command line arguments <using-on-cmdline>`, and Python arguments are stripped from :c:member:`~PyConfig.argv`.
ru: Если :c:member:`~PyConfig.parse_argv` не равно нулю, аргументы :c:member:`~PyConfig.argv` анализируются так же, как обычный Python анализирует :ref:`аргументы командной строки <using-on- cmdline>`, а аргументы Python удаляются из :c:member:`~PyConfig.argv`.

source: The :c:member:`~PyConfig.xoptions` options are parsed to set other options: see the :option:`-X` command line option.
ru: Параметры :c:member:`~PyConfig.xoptions` анализируются для установки других параметров: см. параметр командной строки :option:`-X`.

source: The ``show_alloc_count`` field has been removed.
ru: Поле show_alloc_count было удалено.

source: Initialization with PyConfig
ru: Инициализация с помощью PyConfig

source: Initializing the interpreter from a populated configuration struct is handled by calling :c:func:`Py_InitializeFromConfig`.
ru: Инициализация интерпретатора из заполненной структуры конфигурации выполняется вызовом :c:func:`Py_InitializeFromConfig`.

source: If :c:func:`PyImport_FrozenModules`, :c:func:`PyImport_AppendInittab` or :c:func:`PyImport_ExtendInittab` are used, they must be set or called after Python preinitialization and before the Python initialization. If Python is initialized multiple times, :c:func:`PyImport_AppendInittab` or :c:func:`PyImport_ExtendInittab` must be called before each Python initialization.
ru: Если используются :c:func:`PyImport_FrozenModules`, :c:func:`PyImport_AppendInittab` или :c:func:`PyImport_ExtendInittab`, они должны быть установлены или вызваны после предварительной инициализации Python и до инициализации Python. Если Python инициализируется несколько раз, перед каждой инициализацией Python необходимо вызывать :c:func:`PyImport_AppendInittab` или :c:func:`PyImport_ExtendInittab`.

source: The current configuration (``PyConfig`` type) is stored in ``PyInterpreterState.config``.
ru: Текущая конфигурация (тип PyConfig) хранится в PyInterpreterState.config.

source: Example setting the program name::
ru: Пример установки имени программы::

source: More complete example modifying the default configuration, read the configuration, and then override some parameters. Note that since 3.11, many parameters are not calculated until initialization, and so values cannot be read from the configuration structure. Any values set before initialize is called will be left unchanged by initialization::
ru: Более полный пример изменения конфигурации по умолчанию, чтения конфигурации и последующего переопределения некоторых параметров. Обратите внимание, что начиная с версии 3.11 многие параметры не рассчитываются до инициализации, поэтому значения невозможно прочитать из структуры конфигурации. Любые значения, установленные до вызова инициализации, останутся неизменными при инициализации::

source: Isolated Configuration
ru: Изолированная конфигурация

source: This configuration ignores global configuration variables, environment variables, command line arguments (:c:member:`PyConfig.argv` is not parsed) and user site directory. The C standard streams (ex: ``stdout``) and the LC_CTYPE locale are left unchanged. Signal handlers are not installed.
ru: Эта конфигурация игнорирует глобальные переменные конфигурации, переменные среды, аргументы командной строки (:c:member:`PyConfig.argv` не анализируется) и каталог сайта пользователя. Стандартные потоки C (например: ``stdout``) и локаль LC_CTYPE остаются неизменными. Обработчики сигналов не установлены.

source: Configuration files are still used with this configuration to determine paths that are unspecified. Ensure :c:member:`PyConfig.home` is specified to avoid computing the default path configuration.
ru: Файлы конфигурации по-прежнему используются с этой конфигурацией для определения неуказанных путей. Убедитесь, что указан :c:member:`PyConfig.home`, чтобы избежать вычисления конфигурации пути по умолчанию.

source: Python Configuration
ru: Конфигурация Python

source: Environments variables and command line arguments are used to configure Python, whereas global configuration variables are ignored.
ru: Переменные среды и аргументы командной строки используются для настройки Python, тогда как глобальные переменные конфигурации игнорируются.

source: This function enables C locale coercion (:pep:`538`) and :ref:`Python UTF-8 Mode <utf8-mode>` (:pep:`540`) depending on the LC_CTYPE locale, :envvar:`PYTHONUTF8` and :envvar:`PYTHONCOERCECLOCALE` environment variables.
ru: Эта функция включает приведение локали C (:pep:`538`) и :ref:`Python UTF-8 Mode <utf8-mode>` (:pep:`540`) в зависимости от локали LC_CTYPE, :envvar:`PYTHONUTF8` и переменные среды :envvar:`PYTHONCOERCECLOCALE`.

source: Python Path Configuration
ru: Конфигурация пути Python

source: :c:type:`PyConfig` contains multiple fields for the path configuration:
ru: :c:type:`PyConfig` содержит несколько полей для конфигурации пути:

source: Path configuration inputs:
ru: Входные данные конфигурации пути:

source: current working directory: to get absolute paths
ru: текущий рабочий каталог: чтобы получить абсолютные пути

source: ``PATH`` environment variable to get the program full path (from :c:member:`PyConfig.program_name`)
ru: Переменная среды ``PATH`` для получения полного пути к программе (из :c:member:`PyConfig.program_name`)

source: ``__PYVENV_LAUNCHER__`` environment variable
ru: ``__PYVENV_LAUNCHER__`` переменная среды

source: (Windows only) Application paths in the registry under "Software\Python\PythonCore\X.Y\PythonPath" of HKEY_CURRENT_USER and HKEY_LOCAL_MACHINE (where X.Y is the Python version).
ru: (Только для Windows) Пути к приложениям в реестре «Software\Python\PythonCore\XY\PythonPath» из HKEY_CURRENT_USER и HKEY_LOCAL_MACHINE (где XY — версия Python).

source: Path configuration output fields:
ru: Поля вывода конфигурации пути:

source: If at least one "output field" is not set, Python calculates the path configuration to fill unset fields. If :c:member:`~PyConfig.module_search_paths_set` is equal to ``0``, :c:member:`~PyConfig.module_search_paths` is overridden and :c:member:`~PyConfig.module_search_paths_set` is set to ``1``.
ru: Если хотя бы одно «поле вывода» не установлено, Python вычисляет конфигурацию пути для заполнения неустановленных полей. Если :c:member:`~PyConfig.module_search_paths_set` равен ``0``, :c:member:`~PyConfig.module_search_paths` переопределяется, а :c:member:`~PyConfig.module_search_paths_set` имеет значение `` `1``.
