Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/init_config.po
Languages: ru

source: The caller of these methods is responsible to handle exceptions (error or exit) using ``PyStatus_Exception()`` and ``Py_ExitStatusException()``.
ru: Вызывающий эти методы отвечает за обработку исключений (ошибок или выхода) с помощью PyStatus_Exception() и Py_ExitStatusException().

source: Set :data:`sys.argv` command line arguments based on :c:member:`~PyConfig.argv`. These parameters are similar to those passed to the program's :c:func:`main` function with the difference that the first entry should refer to the script file to be executed rather than the executable hosting the Python interpreter. If there isn't a script that will be run, the first entry in :c:member:`~PyConfig.argv` can be an empty string.
ru: Установите аргументы командной строки :data:`sys.argv` на основе :c:member:`~PyConfig.argv`. Эти параметры аналогичны параметрам, передаваемым в функцию :c:func:`main` программы, с той разницей, что первая запись должна ссылаться на файл сценария, который должен быть выполнен, а не на исполняемый файл, в котором размещен интерпретатор Python. Если скрипта, который будет запущен, нет, первая запись в :c:member:`~PyConfig.argv` может быть пустой строкой.

source: Set :c:member:`~PyConfig.parse_argv` to ``1`` to parse :c:member:`~PyConfig.argv` the same way the regular Python parses Python command line arguments and then to strip Python arguments from :c:member:`~PyConfig.argv`.
ru: Установите для :c:member:`~PyConfig.parse_argv` значение ``1`` для анализа :c:member:`~PyConfig.argv` таким же образом, как обычный Python анализирует аргументы командной строки Python, а затем удаляет аргументы Python из: c:member:`~PyConfig.argv`.

source: If :c:member:`~PyConfig.argv` is empty, an empty string is added to ensure that :data:`sys.argv` always exists and is never empty.
ru: Если :c:member:`~PyConfig.argv` пуст, добавляется пустая строка, чтобы гарантировать, что :data:`sys.argv` всегда существует и никогда не бывает пустым.

source: Default: ``NULL``.
ru: По умолчанию: ``NULL``.

source: See also the :c:member:`~PyConfig.orig_argv` member.
ru: См. также элемент :c:member:`~PyConfig.orig_argv`.

source: If equals to zero, ``Py_RunMain()`` prepends a potentially unsafe path to :data:`sys.path` at startup:
ru: Если равно нулю, Py_RunMain() добавляет потенциально небезопасный путь к :data:`sys.path` при запуске:

source: If :c:member:`argv[0] <PyConfig.argv>` is equal to ``L"-m"`` (``python -m module``), prepend the current working directory.
ru: Если :c:member:`argv[0] <PyConfig.argv>` равен ``L"-m"`` (``python -m модуль``), добавьте текущий рабочий каталог.

source: If running a script (``python script.py``), prepend the script's directory. If it's a symbolic link, resolve symbolic links.
ru: Если вы запускаете скрипт (``python script.py``), добавьте каталог скрипта. Если это символическая ссылка, разрешите символические ссылки.

source: Otherwise (``python -c code`` and ``python``), prepend an empty string, which means the current working directory.
ru: В противном случае (``python -c code`` и ``python``) добавьте пустую строку, которая означает текущий рабочий каталог.

source: Set to ``1`` by the :option:`-P` command line option and the :envvar:`PYTHONSAFEPATH` environment variable.
ru: Устанавливается в ``1`` опцией командной строки :option:`-P` и переменной среды :envvar:`PYTHONSAFEPATH`.

source: Default: ``0`` in Python config, ``1`` in isolated config.
ru: По умолчанию: ``0`` в конфигурации Python, ``1`` в изолированной конфигурации.

source: Part of the :ref:`Python Path Configuration <init-path-config>` output.
ru: Часть вывода :ref:`Python Path Configuration <init-path-config>`.

source: See also :c:member:`PyConfig.exec_prefix`.
ru: См. также :c:member:`PyConfig.exec_prefix`.

source: Python base executable: :data:`sys._base_executable`.
ru: Базовый исполняемый файл Python: :data:`sys._base_executable`.

source: Set by the :envvar:`__PYVENV_LAUNCHER__` environment variable.
ru: Устанавливается переменной среды :envvar:`__PYVENV_LAUNCHER__`.

source: Set from :c:member:`PyConfig.executable` if ``NULL``.
ru: Устанавливается из :c:member:`PyConfig.executable`, если ``NULL``.

source: See also :c:member:`PyConfig.executable`.
ru: См. также :c:member:`PyConfig.executable`.

source: See also :c:member:`PyConfig.prefix`.
ru: См. также :c:member:`PyConfig.prefix`.

source: If equals to ``0`` and :c:member:`~PyConfig.configure_c_stdio` is non-zero, disable buffering on the C streams stdout and stderr.
ru: Если равно ``0`` и :c:member:`~PyConfig.configure_c_stdio` не равно нулю, отключите буферизацию в потоках C stdout и stderr.

source: Set to ``0`` by the :option:`-u` command line option and the :envvar:`PYTHONUNBUFFERED` environment variable.
ru: Устанавливается в ``0`` с помощью опции командной строки :option:`-u` и переменной среды :envvar:`PYTHONUNBUFFERED`.

source: stdin is always opened in buffered mode.
ru: stdin всегда открывается в буферизованном режиме.

source: Default: ``1``.
ru: По умолчанию: ``1``.

source: If equals to ``1``, issue a warning when comparing :class:`bytes` or :class:`bytearray` with :class:`str`, or comparing :class:`bytes` with :class:`int`.
ru: Если равно ``1``, выдать предупреждение при сравнении :class:`bytes` или :class:`bytearray` с :class:`str` или при сравнении :class:`bytes` с :class:`int` .

source: If equal or greater to ``2``, raise a :exc:`BytesWarning` exception in these cases.
ru: Если оно равно или больше ``2``, в этих случаях вызовите исключение :exc:`BytesWarning`.

source: Incremented by the :option:`-b` command line option.
ru: Увеличивается опцией командной строки :option:`-b`.

source: If non-zero, emit a :exc:`EncodingWarning` warning when :class:`io.TextIOWrapper` uses its default encoding. See :ref:`io-encoding-warning` for details.
ru: Если ненулевое значение, выдать предупреждение :exc:`EncodingWarning`, когда :class:`io.TextIOWrapper` использует кодировку по умолчанию. Подробности см. в :ref:`io-encoding-warning`.

source: If equals to ``0``, disables the inclusion of the end line and column mappings in code objects. Also disables traceback printing carets to specific error locations.
ru: Если равно «0», отключает включение сопоставлений конечной строки и столбца в объекты кода. Также отключает обратную печать курсоров для определенных мест ошибок.

source: Set to ``0`` by the :envvar:`PYTHONNODEBUGRANGES` environment variable and by the :option:`-X no_debug_ranges <-X>` command line option.
ru: Устанавливается в ``0`` переменной среды :envvar:`PYTHONNODEBUGRANGES` и параметром командной строки :option:`-X no_debug_ranges <-X>`.

source: Control the validation behavior of hash-based ``.pyc`` files: value of the :option:`--check-hash-based-pycs` command line option.
ru: Управляйте поведением проверки файлов ``.pyc`` на основе хеша: значение параметра командной строки :option:`--check-hash-based-pycs`.

source: Valid values:
ru: Допустимые значения:

source: ``L"always"``: Hash the source file for invalidation regardless of value of the 'check_source' flag.
ru: ``L"always"``: Хэшируйте исходный файл для аннулирования независимо от значения флага 'check_source'.

source: ``L"never"``: Assume that hash-based pycs always are valid.
ru: ``L"никогда"``: Предположим, что pycs на основе хеша всегда действительны.

source: ``L"default"``: The 'check_source' flag in hash-based pycs determines invalidation.
ru: ``L"default"``: Флаг 'check_source' в pycs на основе хеша определяет недействительность.

source: Default: ``L"default"``.
ru: По умолчанию: ``L"default"``.

source: See also :pep:`552` "Deterministic pycs".
ru: См. также :pep:`552` "Детерминированные графики".

source: If non-zero, configure C standard streams:
ru: Если не ноль, настройте стандартные потоки C:

source: On Windows, set the binary mode (``O_BINARY``) on stdin, stdout and stderr.
ru: В Windows установите двоичный режим («O_BINARY») для stdin, stdout и stderr.

source: If :c:member:`~PyConfig.buffered_stdio` equals zero, disable buffering of stdin, stdout and stderr streams.
ru: Если :c:member:`~PyConfig.buffered_stdio` равен нулю, отключите буферизацию потоков stdin, stdout и stderr.

source: If :c:member:`~PyConfig.interactive` is non-zero, enable stream buffering on stdin and stdout (only stdout on Windows).
ru: Если :c:member:`~PyConfig.interactive` не равно нулю, включите буферизацию потока на стандартном вводе и стандартном выводе (только стандартный вывод в Windows).

source: If non-zero, enable the :ref:`Python Development Mode <devmode>`.
ru: Если значение не равно нулю, включите :ref:`Режим разработки Python <devmode>`.

source: Set to ``1`` by the :option:`-X dev <-X>` option and the :envvar:`PYTHONDEVMODE` environment variable.
ru: Устанавливается в ``1`` опцией :option:`-X dev <-X>` и переменной среды :envvar:`PYTHONDEVMODE`.

source: Dump Python references?
ru: Дамп ссылок на Python?

source: If non-zero, dump all objects which are still alive at exit.
ru: Если не ноль, выгрузить все объекты, которые еще живы на выходе.

source: Set to ``1`` by the :envvar:`PYTHONDUMPREFS` environment variable.
ru: Устанавливается в ``1`` переменной среды :envvar:`PYTHONDUMPREFS`.

source: Needs a special build of Python with the ``Py_TRACE_REFS`` macro defined: see the :option:`configure --with-trace-refs option <--with-trace-refs>`.
ru: Требуется специальная сборка Python с определенным макросом ``Py_TRACE_REFS``: см. :option:`configure --with-trace-refs option <--with-trace-refs>`.

source: The site-specific directory prefix where the platform-dependent Python files are installed: :data:`sys.exec_prefix`.
ru: Префикс каталога для конкретного сайта, в котором установлены зависящие от платформы файлы Python: :data:`sys.exec_prefix`.

source: See also :c:member:`PyConfig.base_exec_prefix`.
ru: См. также :c:member:`PyConfig.base_exec_prefix`.

source: The absolute path of the executable binary for the Python interpreter: :data:`sys.executable`.
ru: Абсолютный путь к исполняемому двоичному файлу интерпретатора Python: :data:`sys.executable`.

source: See also :c:member:`PyConfig.base_executable`.
ru: См. также :c:member:`PyConfig.base_executable`.

source: Enable faulthandler?
ru: Включить обработчик ошибок?

source: If non-zero, call :func:`faulthandler.enable` at startup.
ru: Если ненулевое значение, вызовите :func:`faulthandler.enable` при запуске.

source: Set to ``1`` by :option:`-X faulthandler <-X>` and the :envvar:`PYTHONFAULTHANDLER` environment variable.
ru: Устанавливается в ``1`` с помощью :option:`-X errorhandler <-X>` и переменной среды :envvar:`PYTHONFAULTHANDLER`.

source: :term:`Filesystem encoding <filesystem encoding and error handler>`: :func:`sys.getfilesystemencoding`.
ru: :term:`Кодировка файловой системы <кодирование файловой системы и обработчик ошибок>`: :func:`sys.getfilesystemencoding`.

source: On macOS, Android and VxWorks: use ``"utf-8"`` by default.
ru: В macOS, Android и VxWorks: по умолчанию используйте «utf-8».

source: On Windows: use ``"utf-8"`` by default, or ``"mbcs"`` if :c:member:`~PyPreConfig.legacy_windows_fs_encoding` of :c:type:`PyPreConfig` is non-zero.
ru: В Windows: используйте ``"utf-8"`` по умолчанию или ``"mbcs"``, если :c:member:`~PyPreConfig.legacy_windows_fs_encoding` из :c:type:`PyPreConfig` не равно нулю.

source: Default encoding on other platforms:
ru: Кодировка по умолчанию на других платформах:

source: ``"utf-8"`` if :c:member:`PyPreConfig.utf8_mode` is non-zero.
ru: ``"utf-8"``, если :c:member:`PyPreConfig.utf8_mode` не равно нулю.

source: ``"ascii"`` if Python detects that ``nl_langinfo(CODESET)`` announces the ASCII encoding, whereas the ``mbstowcs()`` function decodes from a different encoding (usually Latin1).
ru: ``"ascii"``, если Python обнаруживает, что ``nl_langinfo(CODESET)`` объявляет кодировку ASCII, тогда как функция ``mbstowcs()`` декодирует из другой кодировки (обычно Latin1).

source: ``"utf-8"`` if ``nl_langinfo(CODESET)`` returns an empty string.
ru: ``"utf-8"``, если ``nl_langinfo(CODESET)`` возвращает пустую строку.

source: Otherwise, use the :term:`locale encoding`: ``nl_langinfo(CODESET)`` result.
ru: В противном случае используйте результат :term:`localecoding`: ``nl_langinfo(CODESET)``.

source: At Python startup, the encoding name is normalized to the Python codec name. For example, ``"ANSI_X3.4-1968"`` is replaced with ``"ascii"``.
ru: При запуске Python имя кодировки нормализуется по имени кодека Python. Например, ``"ANSI_X3.4-1968"`` заменяется на ``"ascii"``.

source: See also the :c:member:`~PyConfig.filesystem_errors` member.
ru: См. также элемент :c:member:`~PyConfig.filesystem_errors`.

source: :term:`Filesystem error handler <filesystem encoding and error handler>`: :func:`sys.getfilesystemencodeerrors`.
ru: :term:`Обработчик ошибок файловой системы <кодировка файловой системы и обработчик ошибок>`: :func:`sys.getfilesystemencodeerrors`.

source: On Windows: use ``"surrogatepass"`` by default, or ``"replace"`` if :c:member:`~PyPreConfig.legacy_windows_fs_encoding` of :c:type:`PyPreConfig` is non-zero.
ru: В Windows: используйте ``"surrogatepass"`` по умолчанию или ``"replace"``, если :c:member:`~PyPreConfig.legacy_windows_fs_encoding` из :c:type:`PyPreConfig` не равно нулю.

source: On other platforms: use ``"surrogateescape"`` by default.
ru: На других платформах: по умолчанию используйте «surrogateescape».

source: Supported error handlers:
ru: Поддерживаемые обработчики ошибок:

source: ``"surrogatepass"`` (only supported with the UTF-8 encoding)
ru: ``"surrogatepass"`` (поддерживается только в кодировке UTF-8)

source: See also the :c:member:`~PyConfig.filesystem_encoding` member.
ru: См. также элемент :c:member:`~PyConfig.filesystem_encoding`.

source: Randomized hash function seed.
ru: Рандомизированное начальное значение хэш-функции.

source: If :c:member:`~PyConfig.use_hash_seed` is zero, a seed is chosen randomly at Python startup, and :c:member:`~PyConfig.hash_seed` is ignored.
ru: Если :c:member:`~PyConfig.use_hash_seed` равен нулю, начальное число выбирается случайным образом при запуске Python, а :c:member:`~PyConfig.hash_seed` игнорируется.

source: Set by the :envvar:`PYTHONHASHSEED` environment variable.
ru: Устанавливается переменной среды :envvar:`PYTHONHASHSEED`.

source: Default *use_hash_seed* value: ``-1`` in Python mode, ``0`` in isolated mode.
ru: Значение *use_hash_seed* по умолчанию: ``-1`` в режиме Python, ``0`` в изолированном режиме.

source: Set the default Python "home" directory, that is, the location of the standard Python libraries (see :envvar:`PYTHONHOME`).
ru: Установите «домашний» каталог Python по умолчанию, то есть расположение стандартных библиотек Python (см. :envvar:`PYTHONHOME`).

source: Set by the :envvar:`PYTHONHOME` environment variable.
ru: Устанавливается переменной среды :envvar:`PYTHONHOME`.

source: Part of the :ref:`Python Path Configuration <init-path-config>` input.
ru: Часть входных данных :ref:`Python Path Configuration <init-path-config>`.

source: If non-zero, profile import time.
ru: Если не ноль, время импорта профиля.

source: Set the ``1`` by the :option:`-X importtime <-X>` option and the :envvar:`PYTHONPROFILEIMPORTTIME` environment variable.
ru: Установите ``1`` с помощью опции :option:`-X importtime <-X>` и переменной среды :envvar:`PYTHONPROFILEIMPORTTIME`.

source: Enter interactive mode after executing a script or a command.
ru: Войдите в интерактивный режим после выполнения сценария или команды.

source: If greater than ``0``, enable inspect: when a script is passed as first argument or the -c option is used, enter interactive mode after executing the script or the command, even when :data:`sys.stdin` does not appear to be a terminal.
ru: Если больше ``0``, включите проверку: когда сценарий передается в качестве первого аргумента или используется опция -c, войдите в интерактивный режим после выполнения сценария или команды, даже если :data:`sys.stdin` выполняет не похоже на терминал.

source: Incremented by the :option:`-i` command line option. Set to ``1`` if the :envvar:`PYTHONINSPECT` environment variable is non-empty.
ru: Увеличивается опцией командной строки :option:`-i`. Установите значение ``1``, если переменная среды :envvar:`PYTHONINSPECT` не пуста.

source: Install Python signal handlers?
ru: Установить обработчики сигналов Python?

source: Default: ``1`` in Python mode, ``0`` in isolated mode.
ru: По умолчанию: ``1`` в режиме Python, ``0`` в изолированном режиме.

source: If greater than ``0``, enable the interactive mode (REPL).
ru: Если больше ``0``, включите интерактивный режим (REPL).

source: Incremented by the :option:`-i` command line option.
ru: Увеличивается опцией командной строки :option:`-i`.

source: Configures the :ref:`integer string conversion length limitation <int_max_str_digits>`. An initial value of ``-1`` means the value will be taken from the command line or environment or otherwise default to 4300 (:data:`sys.int_info.default_max_str_digits`). A value of ``0`` disables the limitation. Values greater than zero but less than 640 (:data:`sys.int_info.str_digits_check_threshold`) are unsupported and will produce an error.
ru: Настраивает ограничение длины преобразования целочисленной строки <int_max_str_digits>`. Начальное значение ``-1`` означает, что значение будет взято из командной строки или среды или в противном случае будет установлено по умолчанию 4300 (:data:`sys.int_info.default_max_str_digits`). Значение ``0`` отключает ограничение. Значения больше нуля, но меньше 640 (:data:`sys.int_info.str_digits_check_threshold`) не поддерживаются и приведут к ошибке.

source: Configured by the :option:`-X int_max_str_digits <-X>` command line flag or the :envvar:`PYTHONINTMAXSTRDIGITS` environment variable.
ru: Настраивается флагом командной строки :option:`-X int_max_str_digits <-X>` или переменной среды :envvar:`PYTHONINTMAXSTRDIGITS`.

source: Default: ``-1`` in Python mode. 4300 (:data:`sys.int_info.default_max_str_digits`) in isolated mode.
ru: По умолчанию: ``-1`` в режиме Python. 4300 (:data:`sys.int_info.default_max_str_digits`) в изолированном режиме.

source: If the value of :c:member:`~PyConfig.cpu_count` is not ``-1`` then it will override the return values of :func:`os.cpu_count`, :func:`os.process_cpu_count`, and :func:`multiprocessing.cpu_count`.
ru: Если значение :c:member:`~PyConfig.cpu_count` не равно ``-1``, то оно переопределит возвращаемые значения :func:`os.cpu_count`, :func:`os.process_cpu_count` и :func:`multiprocessing.cpu_count`.

source: Configured by the :samp:`-X cpu_count={n|default}` command line flag or the :envvar:`PYTHON_CPU_COUNT` environment variable.
ru: Настраивается флагом командной строки :samp:`-X cpu_count={n|default}` или переменной среды :envvar:`PYTHON_CPU_COUNT`.

source: Default: ``-1``.
ru: По умолчанию: ``-1``.

source: If greater than ``0``, enable isolated mode:
ru: Если больше «0», включите изолированный режим:

source: Set :c:member:`~PyConfig.safe_path` to ``1``: don't prepend a potentially unsafe path to :data:`sys.path` at Python startup, such as the current directory, the script's directory or an empty string.
ru: Установите для :c:member:`~PyConfig.safe_path` значение ``1``: не добавляйте потенциально небезопасный путь к :data:`sys.path` при запуске Python, например текущий каталог, каталог скрипта или пустая строка.

source: Set :c:member:`~PyConfig.use_environment` to ``0``: ignore ``PYTHON`` environment variables.
ru: Установите для :c:member:`~PyConfig.use_environment` значение ``0``: игнорируйте переменные среды ``PYTHON``.

source: Set :c:member:`~PyConfig.user_site_directory` to ``0``: don't add the user site directory to :data:`sys.path`.
ru: Установите для :c:member:`~PyConfig.user_site_directory` значение ``0``: не добавляйте каталог сайта пользователя в :data:`sys.path`.

source: Python REPL doesn't import :mod:`readline` nor enable default readline configuration on interactive prompts.
ru: Python REPL не импортирует :mod:`readline` и не включает конфигурацию строки чтения по умолчанию в интерактивных подсказках.

source: Set to ``1`` by the :option:`-I` command line option.
ru: Устанавливается в ``1`` опцией командной строки :option:`-I`.

source: See also the :ref:`Isolated Configuration <init-isolated-conf>` and :c:member:`PyPreConfig.isolated`.
ru: См. также :ref:`Изолированная конфигурация <init-isolated-conf>` и :c:member:`PyPreConfig.isolated`.

source: If non-zero, use :class:`io.FileIO` instead of :class:`!io._WindowsConsoleIO` for :data:`sys.stdin`, :data:`sys.stdout` and :data:`sys.stderr`.
ru: Если ненулевое значение, используйте :class:`io.FileIO` вместо :class:`!io._WindowsConsoleIO` для :data:`sys.stdin`, :data:`sys.stdout` и :data:`sys. stderr`.

source: Set to ``1`` if the :envvar:`PYTHONLEGACYWINDOWSSTDIO` environment variable is set to a non-empty string.
ru: Установите значение ``1``, если для переменной среды :envvar:`PYTHONLEGACYWINDOWSSTDIO` задана непустая строка.

source: See also the :pep:`528` (Change Windows console encoding to UTF-8).
ru: См. также :pep:`528` (Измените кодировку консоли Windows на UTF-8).

source: If non-zero, dump statistics on :ref:`Python pymalloc memory allocator <pymalloc>` at exit.
ru: Если значение не равно нулю, при выходе выгрузите статистику в распределитель памяти Python pymalloc <pymalloc>`.

source: Set to ``1`` by the :envvar:`PYTHONMALLOCSTATS` environment variable.
ru: Устанавливается в ``1`` переменной среды :envvar:`PYTHONMALLOCSTATS`.

source: The option is ignored if Python is :option:`configured using the --without-pymalloc option <--without-pymalloc>`.
ru: Этот параметр игнорируется, если Python :option:`настроен с использованием параметра --without-pymalloc <--without-pymalloc>`.

source: Platform library directory name: :data:`sys.platlibdir`.
ru: Имя каталога библиотеки платформы: :data:`sys.platlibdir`.

source: Set by the :envvar:`PYTHONPLATLIBDIR` environment variable.
ru: Устанавливается переменной среды :envvar:`PYTHONPLATLIBDIR`.

source: Default: value of the ``PLATLIBDIR`` macro which is set by the :option:`configure --with-platlibdir option <--with-platlibdir>` (default: ``"lib"``, or ``"DLLs"`` on Windows).
ru: По умолчанию: значение макроса ``PLATLIBDIR``, которое задается опцией :option:`configure --with-platlibdir <--with-platlibdir>` (по умолчанию: ``"lib"`` или ``" DLL"`` в Windows).

source: This macro is now used on Windows to locate the standard library extension modules, typically under ``DLLs``. However, for compatibility, note that this value is ignored for any non-standard layouts, including in-tree builds and virtual environments.
ru: Этот макрос теперь используется в Windows для поиска модулей расширения стандартной библиотеки, обычно в разделе «DLL». Однако в целях совместимости обратите внимание, что это значение игнорируется для любых нестандартных макетов, включая сборки в дереве и виртуальные среды.

source: Module search paths (:data:`sys.path`) as a string separated by ``DELIM`` (:data:`os.pathsep`).
ru: Пути поиска модулей (:data:`sys.path`) в виде строки, разделенной ``DELIM`` (:data:`os.pathsep`).

source: Set by the :envvar:`PYTHONPATH` environment variable.
ru: Устанавливается переменной среды :envvar:`PYTHONPATH`.

source: Module search paths: :data:`sys.path`.
ru: Пути поиска модулей: :data:`sys.path`.

source: If :c:member:`~PyConfig.module_search_paths_set` is equal to ``0``, :c:func:`Py_InitializeFromConfig` will replace :c:member:`~PyConfig.module_search_paths` and sets :c:member:`~PyConfig.module_search_paths_set` to ``1``.
ru: Если :c:member:`~PyConfig.module_search_paths_set` равен ``0``, :c:func:`Py_InitializeFromConfig` заменит :c:member:`~PyConfig.module_search_paths` и установит :c:member:` ~PyConfig.module_search_paths_set для ``1``.
