Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/intro.po
Languages: ru

source: Introduction
ru: Введение

source: The Application Programmer's Interface to Python gives C and C++ programmers access to the Python interpreter at a variety of levels. The API is equally usable from C++, but for brevity it is generally referred to as the Python/C API. There are two fundamentally different reasons for using the Python/C API. The first reason is to write *extension modules* for specific purposes; these are C modules that extend the Python interpreter. This is probably the most common use. The second reason is to use Python as a component in a larger application; this technique is generally referred to as :dfn:`embedding` Python in an application.
ru: Интерфейс прикладного программиста для Python предоставляет программистам C и C++ доступ к интерпретатору Python на различных уровнях. Этот API можно использовать и в C++, но для краткости его обычно называют API Python/C. Есть две принципиально разные причины для использования API Python/C. Первая причина — написать *модули расширения* для конкретных целей; это модули C, расширяющие интерпретатор Python. Это, пожалуй, самое распространенное использование. Вторая причина — использовать Python как компонент более крупного приложения; этот метод обычно называется :dfn:`встраиванием` Python в приложение.

source: Writing an extension module is a relatively well-understood process, where a "cookbook" approach works well. There are several tools that automate the process to some extent. While people have embedded Python in other applications since its early existence, the process of embedding Python is less straightforward than writing an extension.
ru: Написание модуля расширения — относительно хорошо понятный процесс, в котором хорошо работает подход «поваренной книги». Существует несколько инструментов, которые в некоторой степени автоматизируют этот процесс. Хотя люди встраивали Python в другие приложения с самого начала его существования, процесс внедрения Python не так прост, как написание расширения.

source: Many API functions are useful independent of whether you're embedding or extending Python; moreover, most applications that embed Python will need to provide a custom extension as well, so it's probably a good idea to become familiar with writing an extension before attempting to embed Python in a real application.
ru: Многие функции API полезны независимо от того, встраиваете ли вы Python или расширяете его; более того, большинству приложений, встраивающих Python, также потребуется предоставить собственное расширение, поэтому, вероятно, будет хорошей идеей ознакомиться с написанием расширения, прежде чем пытаться встроить Python в реальное приложение.

source: Coding standards
ru: Стандарты кодирования

source: If you're writing C code for inclusion in CPython, you **must** follow the guidelines and standards defined in :PEP:`7`. These guidelines apply regardless of the version of Python you are contributing to. Following these conventions is not necessary for your own third party extension modules, unless you eventually expect to contribute them to Python.
ru: Если вы пишете код C для включения в CPython, вы **должны** следовать рекомендациям и стандартам, определенным в :PEP:`7`. Эти рекомендации применяются независимо от версии Python, в которую вы вносите свой вклад. Следование этим соглашениям не является обязательным для ваших собственных сторонних модулей расширения, если только вы в конечном итоге не планируете внедрить их в Python.

source: Include Files
ru: Включаемые файлы

source: All function, type and macro definitions needed to use the Python/C API are included in your code by the following line::
ru: Все определения функций, типов и макросов, необходимые для использования API Python/C, включаются в ваш код следующей строкой:

source: This implies inclusion of the following standard headers: ``<stdio.h>``, ``<string.h>``, ``<errno.h>``, ``<limits.h>``, ``<assert.h>`` and ``<stdlib.h>`` (if available).
ru: Это подразумевает включение следующих стандартных заголовков: ``<stdio.h>``, ``<string.h>``, ``<errno.h>``, ``<limits.h>``, `` `<assert.h>`` и ``<stdlib.h>`` (если доступны).

source: Since Python may define some pre-processor definitions which affect the standard headers on some systems, you *must* include :file:`Python.h` before any standard headers are included.
ru: Поскольку Python может определять некоторые определения препроцессора, которые влияют на стандартные заголовки в некоторых системах, вы *должны* включить :file:`Python.h` перед включением любых стандартных заголовков.

source: It is recommended to always define ``PY_SSIZE_T_CLEAN`` before including ``Python.h``. See :ref:`arg-parsing` for a description of this macro.
ru: Рекомендуется всегда определять PY_SSIZE_T_CLEAN перед включением Python.h. См. :ref:`arg-parsing` для описания этого макроса.

source: All user visible names defined by Python.h (except those defined by the included standard headers) have one of the prefixes ``Py`` or ``_Py``. Names beginning with ``_Py`` are for internal use by the Python implementation and should not be used by extension writers. Structure member names do not have a reserved prefix.
ru: Все видимые пользователем имена, определенные в Python.h (кроме тех, которые определены включенными стандартными заголовками), имеют один из префиксов ``Py`` или ``_Py``. Имена, начинающиеся с ``_Py``, предназначены для внутреннего использования реализацией Python и не должны использоваться авторами расширений. Имена членов структуры не имеют зарезервированного префикса.

source: User code should never define names that begin with ``Py`` or ``_Py``. This confuses the reader, and jeopardizes the portability of the user code to future Python versions, which may define additional names beginning with one of these prefixes.
ru: Пользовательский код никогда не должен определять имена, начинающиеся с ``Py`` или ``_Py``. Это сбивает с толку читателя и ставит под угрозу переносимость пользовательского кода в будущие версии Python, которые могут определять дополнительные имена, начинающиеся с одного из этих префиксов.

source: C++ users should note that although the API is defined entirely using C, the header files properly declare the entry points to be ``extern "C"``. As a result, there is no need to do anything special to use the API from C++.
ru: Пользователи C++ должны учитывать, что хотя API полностью определен с использованием C, в файлах заголовков правильно объявляются точки входа как «extern «C»». В результате для использования API из C++ не нужно делать ничего особенного.

source: Useful macros
ru: Полезные макросы

source: Several useful macros are defined in the Python header files. Many are defined closer to where they are useful (e.g. :c:macro:`Py_RETURN_NONE`). Others of a more general utility are defined here. This is not necessarily a complete listing.
ru: Несколько полезных макросов определены в файлах заголовков Python. Многие из них определены ближе к тому месту, где они полезны (например, :c:macro:`Py_RETURN_NONE`). Здесь определены другие, более общего назначения. Это не обязательно полный список.

source: Use this when you have a code path that cannot be reached by design. For example, in the ``default:`` clause in a ``switch`` statement for which all possible values are covered in ``case`` statements. Use this in places where you might be tempted to put an ``assert(0)`` or ``abort()`` call.
ru: Используйте это, когда у вас есть путь кода, который не может быть достигнут по замыслу. Например, в предложении ``default:`` в операторе ``switch``, для которого все возможные значения охвачены операторами ``case``. Используйте это в тех местах, где у вас может возникнуть соблазн поместить вызов ``assert(0)`` или ``abort()``.

source: In release mode, the macro helps the compiler to optimize the code, and avoids a warning about unreachable code. For example, the macro is implemented with ``__builtin_unreachable()`` on GCC in release mode.
ru: В режиме выпуска макрос помогает компилятору оптимизировать код и позволяет избежать предупреждения о недостижимом коде. Например, макрос реализован с помощью ``__builtin_unreachable()`` в GCC в режиме выпуска.

source: A use for ``Py_UNREACHABLE()`` is following a call a function that never returns but that is not declared :c:macro:`_Py_NO_RETURN`.
ru: Использование ``Py_UNREACHABLE()`` происходит после вызова функции, которая никогда не возвращает результат, но не объявлена ​​:c:macro:`_Py_NO_RETURN`.

source: If a code path is very unlikely code but can be reached under exceptional case, this macro must not be used. For example, under low memory condition or if a system call returns a value out of the expected range. In this case, it's better to report the error to the caller. If the error cannot be reported to caller, :c:func:`Py_FatalError` can be used.
ru: Если путь кода маловероятен, но может быть достигнут в исключительных случаях, этот макрос использовать нельзя. Например, при нехватке памяти или если системный вызов возвращает значение, выходящее за пределы ожидаемого диапазона. В этом случае лучше сообщить об ошибке вызывающему абоненту. Если об ошибке невозможно сообщить вызывающему абоненту, можно использовать :c:func:`Py_FatalError`.

source: Return the absolute value of ``x``.
ru: Вернуть абсолютное значение ``x``.

source: Return the minimum value between ``x`` and ``y``.
ru: Возвращает минимальное значение между ``x`` и ``y``.

source: Return the maximum value between ``x`` and ``y``.
ru: Возвращает максимальное значение между ``x`` и ``y``.

source: Convert ``x`` to a C string. E.g. ``Py_STRINGIFY(123)`` returns ``"123"``.
ru: Преобразуйте ``x`` в строку C. Например, ``Py_STRINGIFY(123)`` возвращает ``"123"``.

source: Return the size of a structure (``type``) ``member`` in bytes.
ru: Возвращает размер структуры («типа») «члена» в байтах.

source: Argument must be a character or an integer in the range [-128, 127] or [0, 255]. This macro returns ``c`` cast to an ``unsigned char``.
ru: Аргумент должен быть символом или целым числом в диапазоне [-128, 127] или [0, 255]. Этот макрос возвращает приведение ``c`` к ``unsigned char``.

source: Use this for unused arguments in a function definition to silence compiler warnings. Example: ``int func(int a, int Py_UNUSED(b)) { return a; }``.
ru: Используйте это для неиспользуемых аргументов в определении функции, чтобы отключить предупреждения компилятора. Пример: ``int func(int a, int Py_UNUSED(b)) { return a; }``.

source: Use this for deprecated declarations. The macro must be placed before the symbol name.
ru: Используйте это для устаревших объявлений. Макрос должен быть помещен перед именем символа.

source: Example::
ru: Пример::

source: MSVC support was added.
ru: Добавлена ​​поддержка MSVC.

source: Creates a variable with name ``name`` that can be used in docstrings. If Python is built without docstrings, the value will be empty.
ru: Создает переменную с именем ``name``, которую можно использовать в строках документации. Если Python собран без строк документации, значение будет пустым.

source: Use :c:macro:`PyDoc_STRVAR` for docstrings to support building Python without docstrings, as specified in :pep:`7`.
ru: Используйте :c:macro:`PyDoc_STRVAR` для строк документации, чтобы поддерживать сборку Python без строк документации, как указано в :pep:`7`.

source: Creates a docstring for the given input string or an empty string if docstrings are disabled.
ru: Создает строку документации для данной входной строки или пустую строку, если строки документации отключены.

source: Use :c:macro:`PyDoc_STR` in specifying docstrings to support building Python without docstrings, as specified in :pep:`7`.
ru: Используйте :c:macro:`PyDoc_STR` при указании строк документации для поддержки сборки Python без строк документации, как указано в :pep:`7`.

source: Objects, Types and Reference Counts
ru: Объекты, типы и счетчики ссылок

source: All Python objects (even Python integers) have a :dfn:`type` and a :dfn:`reference count`. An object's type determines what kind of object it is (e.g., an integer, a list, or a user-defined function; there are many more as explained in :ref:`types`). For each of the well-known types there is a macro to check whether an object is of that type; for instance, ``PyList_Check(a)`` is true if (and only if) the object pointed to by *a* is a Python list.
ru: Все объекты Python (даже целые числа Python) имеют :dfn:`type` и :dfn:`счетчик ссылок`. Тип объекта определяет, какой это тип объекта (например, целое число, список или определяемая пользователем функция; их гораздо больше, как описано в :ref:`types`). Для каждого из известных типов существует макрос, проверяющий, относится ли объект к этому типу; например, ``PyList_Check(a)`` истинно, если (и только если) объект, на который указывает *a*, является списком Python.

source: Reference Counts
ru: Количество ссылок

source: Reference Count Details
ru: Сведения о количестве ссылок

source: Conversely, when a calling function passes in a reference to an object, there are two possibilities: the function *steals* a reference to the object, or it does not. *Stealing a reference* means that when you pass a reference to a function, that function assumes that it now owns that reference, and you are not responsible for it any longer.
ru: И наоборот, когда вызывающая функция передает ссылку на объект, есть две возможности: функция *крадет* ссылку на объект или нет. *Кража ссылки* означает, что когда вы передаете ссылку функции, эта функция предполагает, что теперь эта ссылка принадлежит ей, и вы больше не несете за нее ответственности.

source: Few functions steal references; the two notable exceptions are :c:func:`PyList_SetItem` and :c:func:`PyTuple_SetItem`, which steal a reference to the item (but not to the tuple or list into which the item is put!). These functions were designed to steal a reference because of a common idiom for populating a tuple or list with newly created objects; for example, the code to create the tuple ``(1, 2, "three")`` could look like this (forgetting about error handling for the moment; a better way to code this is shown below)::
ru: Лишь немногие функции крадут ссылки; двумя заметными исключениями являются :c:func:`PyList_SetItem` и :c:func:`PyTuple_SetItem`, которые крадут ссылку на элемент (но не на кортеж или список, в который помещен этот элемент!). Эти функции были разработаны для кражи ссылки из-за распространенной идиомы заполнения кортежа или списка вновь созданными объектами; например, код для создания кортежа ``(1, 2, "three")" может выглядеть так (на данный момент мы забываем об обработке ошибок; лучший способ закодировать это показан ниже):

source: Here, :c:func:`PyLong_FromLong` returns a new reference which is immediately stolen by :c:func:`PyTuple_SetItem`. When you want to keep using an object although the reference to it will be stolen, use :c:func:`Py_INCREF` to grab another reference before calling the reference-stealing function.
ru: Здесь :c:func:`PyLong_FromLong` возвращает новую ссылку, которая немедленно украдена :c:func:`PyTuple_SetItem`. Если вы хотите продолжать использовать объект, хотя ссылка на него будет украдена, используйте :c:func:`Py_INCREF`, чтобы получить другую ссылку перед вызовом функции кражи ссылки.

source: Incidentally, :c:func:`PyTuple_SetItem` is the *only* way to set tuple items; :c:func:`PySequence_SetItem` and :c:func:`PyObject_SetItem` refuse to do this since tuples are an immutable data type. You should only use :c:func:`PyTuple_SetItem` for tuples that you are creating yourself.
ru: Кстати, :c:func:`PyTuple_SetItem` — это *единственный* способ установить элементы кортежа; :c:func:`PySequence_SetItem` и :c:func:`PyObject_SetItem` отказываются это делать, поскольку кортежи являются неизменяемым типом данных. Вам следует использовать :c:func:`PyTuple_SetItem` только для кортежей, которые вы создаете самостоятельно.

source: Equivalent code for populating a list can be written using :c:func:`PyList_New` and :c:func:`PyList_SetItem`.
ru: Эквивалентный код для заполнения списка можно написать с помощью :c:func:`PyList_New` и :c:func:`PyList_SetItem`.

source: However, in practice, you will rarely use these ways of creating and populating a tuple or list. There's a generic function, :c:func:`Py_BuildValue`, that can create most common objects from C values, directed by a :dfn:`format string`. For example, the above two blocks of code could be replaced by the following (which also takes care of the error checking)::
ru: Однако на практике вы редко будете использовать эти способы создания и заполнения кортежа или списка. Существует общая функция :c:func:`Py_BuildValue`, которая может создавать наиболее распространенные объекты из значений C, управляемых :dfn:`строкой формата`. Например, приведенные выше два блока кода можно заменить следующим (который также обеспечивает проверку ошибок):

source: The situation is slightly different for function return values. While passing a reference to most functions does not change your ownership responsibilities for that reference, many functions that return a reference to an object give you ownership of the reference. The reason is simple: in many cases, the returned object is created on the fly, and the reference you get is the only reference to the object. Therefore, the generic functions that return object references, like :c:func:`PyObject_GetItem` and :c:func:`PySequence_GetItem`, always return a new reference (the caller becomes the owner of the reference).
ru: Ситуация немного отличается для возвращаемых значений функции. Хотя передача ссылки на большинство функций не меняет ваших обязанностей владения этой ссылкой, многие функции, возвращающие ссылку на объект, дают вам право собственности на ссылку. Причина проста: во многих случаях возвращаемый объект создается «на лету», и полученная вами ссылка является единственной ссылкой на объект. Поэтому универсальные функции, возвращающие ссылки на объекты, такие как :c:func:`PyObject_GetItem` и :c:func:`PySequence_GetItem`, всегда возвращают новую ссылку (вызывающая сторона становится владельцем ссылки).

source: It is important to realize that whether you own a reference returned by a function depends on which function you call only --- *the plumage* (the type of the object passed as an argument to the function) *doesn't enter into it!* Thus, if you extract an item from a list using :c:func:`PyList_GetItem`, you don't own the reference --- but if you obtain the same item from the same list using :c:func:`PySequence_GetItem` (which happens to take exactly the same arguments), you do own a reference to the returned object.
ru: Важно понимать, что то, являетесь ли вы владельцем ссылки, возвращаемой функцией, зависит только от того, какую функцию вы вызываете --- *оперение* (тип объекта, передаваемого в качестве аргумента функции) *не входит в него !* Таким образом, если вы извлекаете элемент из списка, используя :c:func:`PyList_GetItem`, вы не являетесь владельцем ссылки --- но если вы получаете тот же элемент из того же списка, используя :c:func:` PySequence_GetItem` (который принимает точно такие же аргументы), у вас есть ссылка на возвращаемый объект.

source: Here is an example of how you could write a function that computes the sum of the items in a list of integers; once using :c:func:`PyList_GetItem`, and once using :c:func:`PySequence_GetItem`. ::
ru: Вот пример того, как можно написать функцию, вычисляющую сумму элементов в списке целых чисел; один раз с использованием :c:func:`PyList_GetItem` и один раз с использованием :c:func:`PySequence_GetItem`. ::

source: Types
ru: Типы

source: A signed integral type such that ``sizeof(Py_ssize_t) == sizeof(size_t)``. C99 doesn't define such a thing directly (size_t is an unsigned integral type). See :pep:`353` for details. ``PY_SSIZE_T_MAX`` is the largest positive value of type :c:type:`Py_ssize_t`.
ru: Целочисленный тип со знаком, такой как ``sizeof(Py_ssize_t) == sizeof(size_t)``. C99 не определяет такую ​​вещь напрямую (size_t — это целочисленный тип без знака). Подробности смотрите в :pep:`353`. ``PY_SSIZE_T_MAX`` ​​— это наибольшее положительное значение типа :c:type:`Py_ssize_t`.

source: Exceptions
ru: Исключения

source: The Python programmer only needs to deal with exceptions if specific error handling is required; unhandled exceptions are automatically propagated to the caller, then to the caller's caller, and so on, until they reach the top-level interpreter, where they are reported to the user accompanied by a stack traceback.
ru: Программисту Python необходимо иметь дело с исключениями только в том случае, если требуется специальная обработка ошибок; необработанные исключения автоматически передаются вызывающему объекту, затем вызывающему объекту и так далее, пока не достигнут интерпретатора верхнего уровня, где о них сообщается пользователю вместе с обратной трассировкой стека.

source: For C programmers, however, error checking always has to be explicit. All functions in the Python/C API can raise exceptions, unless an explicit claim is made otherwise in a function's documentation. In general, when a function encounters an error, it sets an exception, discards any object references that it owns, and returns an error indicator. If not documented otherwise, this indicator is either ``NULL`` or ``-1``, depending on the function's return type. A few functions return a Boolean true/false result, with false indicating an error. Very few functions return no explicit error indicator or have an ambiguous return value, and require explicit testing for errors with :c:func:`PyErr_Occurred`. These exceptions are always explicitly documented.
ru: Однако для программистов на C проверка ошибок всегда должна быть явной. Все функции в API Python/C могут вызывать исключения, если иное не указано в документации к функции. Обычно, когда функция обнаруживает ошибку, она устанавливает исключение, отбрасывает все ссылки на объекты, которыми она владеет, и возвращает индикатор ошибки. Если не указано иное, этот индикатор имеет значение либо NULL, либо -1, в зависимости от типа возвращаемого значения функции. Некоторые функции возвращают логический результат true/false, где false указывает на ошибку. Очень немногие функции не возвращают явного индикатора ошибки или имеют неоднозначное возвращаемое значение и требуют явного тестирования на наличие ошибок с помощью :c:func:`PyErr_Occurred`. Эти исключения всегда явно документируются.

source: Exception state is maintained in per-thread storage (this is equivalent to using global storage in an unthreaded application). A thread can be in one of two states: an exception has occurred, or not. The function :c:func:`PyErr_Occurred` can be used to check for this: it returns a borrowed reference to the exception type object when an exception has occurred, and ``NULL`` otherwise. There are a number of functions to set the exception state: :c:func:`PyErr_SetString` is the most common (though not the most general) function to set the exception state, and :c:func:`PyErr_Clear` clears the exception state.
ru: Состояние исключения поддерживается в хранилище каждого потока (это эквивалентно использованию глобального хранилища в беспоточном приложении). Поток может находиться в одном из двух состояний: произошло исключение или нет. Для проверки этого можно использовать функцию :c:func:`PyErr_Occurred`: она возвращает заимствованную ссылку на объект типа исключения, если исключение произошло, и ``NULL`` в противном случае. Существует ряд функций для установки состояния исключения: :c:func:`PyErr_SetString` — самая распространенная (хотя и не самая общая) функция для установки состояния исключения, а :c:func:`PyErr_Clear` очищает исключение. состояние.
