Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/intro.po
Languages: ru

source: The full exception state consists of three objects (all of which can be ``NULL``): the exception type, the corresponding exception value, and the traceback. These have the same meanings as the Python result of ``sys.exc_info()``; however, they are not the same: the Python objects represent the last exception being handled by a Python :keyword:`try` ... :keyword:`except` statement, while the C level exception state only exists while an exception is being passed on between C functions until it reaches the Python bytecode interpreter's main loop, which takes care of transferring it to ``sys.exc_info()`` and friends.
ru: Полное состояние исключения состоит из трех объектов (каждый из которых может иметь значение NULL): тип исключения, соответствующее значение исключения и обратная трассировка. Они имеют тот же смысл, что и результат Python ``sys.exc_info()``; однако они не одинаковы: объекты Python представляют собой последнее исключение, обрабатываемое оператором Python :keyword:`try` ... :keyword:`Exception`, в то время как состояние исключения уровня C существует только во время возникновения исключения. передается между функциями C, пока не достигнет основного цикла интерпретатора байт-кода Python, который заботится о передаче его в ``sys.exc_info()`` и его друзей.

source: Note that starting with Python 1.5, the preferred, thread-safe way to access the exception state from Python code is to call the function :func:`sys.exc_info`, which returns the per-thread exception state for Python code. Also, the semantics of both ways to access the exception state have changed so that a function which catches an exception will save and restore its thread's exception state so as to preserve the exception state of its caller. This prevents common bugs in exception handling code caused by an innocent-looking function overwriting the exception being handled; it also reduces the often unwanted lifetime extension for objects that are referenced by the stack frames in the traceback.
ru: Обратите внимание, что начиная с Python 1.5 предпочтительным потокобезопасным способом доступа к состоянию исключения из кода Python является вызов функции :func:`sys.exc_info`, которая возвращает состояние исключения для каждого потока для кода Python. Кроме того, семантика обоих способов доступа к состоянию исключения изменилась: функция, перехватывающая исключение, сохраняет и восстанавливает состояние исключения своего потока, чтобы сохранить состояние исключения вызывающего объекта. Это предотвращает распространенные ошибки в коде обработки исключений, вызванные тем, что невинно выглядящая функция перезаписывает обрабатываемое исключение; это также уменьшает часто нежелательное продление срока службы для объектов, на которые ссылаются кадры стека в обратной трассировке.

source: As a general principle, a function that calls another function to perform some task should check whether the called function raised an exception, and if so, pass the exception state on to its caller. It should discard any object references that it owns, and return an error indicator, but it should *not* set another exception --- that would overwrite the exception that was just raised, and lose important information about the exact cause of the error.
ru: В качестве общего принципа функция, которая вызывает другую функцию для выполнения некоторой задачи, должна проверить, вызвала ли вызванная функция исключение, и если да, передать состояние исключения вызывающей стороне. Он должен отбрасывать все ссылки на объекты, которыми он владеет, и возвращать индикатор ошибки, но он *не* должен устанавливать другое исключение, которое перезапишет только что созданное исключение и потеряет важную информацию о точной причине ошибки.

source: Here is the corresponding C code, in all its glory::
ru: Вот соответствующий код C во всей красе:

source: This example represents an endorsed use of the ``goto`` statement in C! It illustrates the use of :c:func:`PyErr_ExceptionMatches` and :c:func:`PyErr_Clear` to handle specific exceptions, and the use of :c:func:`Py_XDECREF` to dispose of owned references that may be ``NULL`` (note the ``'X'`` in the name; :c:func:`Py_DECREF` would crash when confronted with a ``NULL`` reference). It is important that the variables used to hold owned references are initialized to ``NULL`` for this to work; likewise, the proposed return value is initialized to ``-1`` (failure) and only set to success after the final call made is successful.
ru: Этот пример представляет собой одобренное использование оператора goto в C! Он иллюстрирует использование :c:func:`PyErr_ExceptionMatches` и :c:func:`PyErr_Clear` для обработки определенных исключений, а также использование :c:func:`Py_XDECREF` для удаления собственных ссылок, которые могут иметь значение ``NULL'. `` (обратите внимание на ``'X'`` в имени; :c:func:`Py_DECREF` приведет к сбою при столкновении со ссылкой ``NULL``). Для того чтобы это работало, важно, чтобы переменные, используемые для хранения собственных ссылок, были инициализированы значением NULL; аналогично, предлагаемое возвращаемое значение инициализируется как «-1» (сбой) и устанавливается на успех только после того, как последний сделанный вызов окажется успешным.

source: Embedding Python
ru: Внедрение Python

source: The one important task that only embedders (as opposed to extension writers) of the Python interpreter have to worry about is the initialization, and possibly the finalization, of the Python interpreter. Most functionality of the interpreter can only be used after the interpreter has been initialized.
ru: Единственная важная задача, о которой должны беспокоиться только разработчики (в отличие от разработчиков расширений) интерпретатора Python, — это инициализация и, возможно, завершение интерпретатора Python. Большую часть функций интерпретатора можно использовать только после его инициализации.

source: The basic initialization function is :c:func:`Py_Initialize`. This initializes the table of loaded modules, and creates the fundamental modules :mod:`builtins`, :mod:`__main__`, and :mod:`sys`. It also initializes the module search path (``sys.path``).
ru: Базовая функция инициализации — :c:func:`Py_Initialize`. Это инициализирует таблицу загруженных модулей и создает основные модули :mod:`builtins`, :mod:`__main__` и :mod:`sys`. Он также инициализирует путь поиска модуля (``sys.path``).

source: On most systems (in particular, on Unix and Windows, although the details are slightly different), :c:func:`Py_Initialize` calculates the module search path based upon its best guess for the location of the standard Python interpreter executable, assuming that the Python library is found in a fixed location relative to the Python interpreter executable. In particular, it looks for a directory named :file:`lib/python{X.Y}` relative to the parent directory where the executable named :file:`python` is found on the shell command search path (the environment variable :envvar:`PATH`).
ru: В большинстве систем (в частности, в Unix и Windows, хотя детали немного различаются), :c:func:`Py_Initialize` вычисляет путь поиска модуля на основе наилучшего предположения о расположении стандартного исполняемого файла интерпретатора Python, предполагая, что библиотека Python находится в фиксированном месте относительно исполняемого файла интерпретатора Python. В частности, он ищет каталог с именем :file:`lib/python{XY}` относительно родительского каталога, в котором исполняемый файл с именем :file:`python` находится в пути поиска команд оболочки (переменная среды :envvar: «ПУТЬ»).

source: For instance, if the Python executable is found in :file:`/usr/local/bin/python`, it will assume that the libraries are in :file:`/usr/local/lib/python{X.Y}`. (In fact, this particular path is also the "fallback" location, used when no executable file named :file:`python` is found along :envvar:`PATH`.) The user can override this behavior by setting the environment variable :envvar:`PYTHONHOME`, or insert additional directories in front of the standard path by setting :envvar:`PYTHONPATH`.
ru: Например, если исполняемый файл Python находится в :file:`/usr/local/bin/python`, предполагается, что библиотеки находятся в :file:`/usr/local/lib/python{XY}`. (Фактически, этот конкретный путь также является «запасным» местоположением, используемым, когда в :envvar:`PATH` не найден исполняемый файл с именем :file:`python`.) Пользователь может переопределить это поведение, установив переменную среды: envvar:`PYTHONHOME` или вставьте дополнительные каталоги перед стандартным путем, установив :envvar:`PYTHONPATH`.

source: The embedding application can steer the search by calling ``Py_SetProgramName(file)`` *before* calling :c:func:`Py_Initialize`. Note that :envvar:`PYTHONHOME` still overrides this and :envvar:`PYTHONPATH` is still inserted in front of the standard path. An application that requires total control has to provide its own implementation of :c:func:`Py_GetPath`, :c:func:`Py_GetPrefix`, :c:func:`Py_GetExecPrefix`, and :c:func:`Py_GetProgramFullPath` (all defined in :file:`Modules/getpath.c`).
ru: Приложение для внедрения может управлять поиском, вызывая ``Py_SetProgramName(file)`` *перед* вызовом :c:func:`Py_Initialize`. Обратите внимание, что :envvar:`PYTHONHOME` по-прежнему переопределяет это, а :envvar:`PYTHONPATH` по-прежнему вставляется перед стандартным путем. Приложение, которому требуется полный контроль, должно предоставить собственную реализацию :c:func:`Py_GetPath`, :c:func:`Py_GetPrefix`, :c:func:`Py_GetExecPrefix` и :c:func:`Py_GetProgramFullPath` ( все определено в :file:`Modules/getpath.c`).

source: Sometimes, it is desirable to "uninitialize" Python. For instance, the application may want to start over (make another call to :c:func:`Py_Initialize`) or the application is simply done with its use of Python and wants to free memory allocated by Python. This can be accomplished by calling :c:func:`Py_FinalizeEx`. The function :c:func:`Py_IsInitialized` returns true if Python is currently in the initialized state. More information about these functions is given in a later chapter. Notice that :c:func:`Py_FinalizeEx` does *not* free all memory allocated by the Python interpreter, e.g. memory allocated by extension modules currently cannot be released.
ru: Иногда желательно «неинициализировать» Python. Например, приложение может захотеть начать заново (сделать еще один вызов :c:func:`Py_Initialize`) или приложение просто использует Python и хочет освободить память, выделенную Python. Это можно сделать, вызвав :c:func:`Py_FinalizeEx`. Функция :c:func:`Py_IsInitialized` возвращает true, если Python в данный момент находится в инициализированном состоянии. Более подробная информация об этих функциях приведена в следующей главе. Обратите внимание, что :c:func:`Py_FinalizeEx` *не* освобождает всю память, выделенную интерпретатором Python, например, память, выделенная модулями расширения, в настоящее время не может быть освобождена.

source: Debugging Builds
ru: Отладочные сборки

source: Python can be built with several macros to enable extra checks of the interpreter and extension modules. These checks tend to add a large amount of overhead to the runtime so they are not enabled by default.
ru: Python можно собрать с несколькими макросами, позволяющими проводить дополнительные проверки интерпретатора и модулей расширения. Эти проверки, как правило, увеличивают нагрузку на среду выполнения, поэтому по умолчанию они не включены.

source: Please refer to :file:`Misc/SpecialBuilds.txt` in the Python source distribution for more detailed information.
ru: Пожалуйста, обратитесь к :file:`Misc/SpecialBuilds.txt` в дистрибутиве исходного кода Python для получения более подробной информации.
