Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/list.po
Languages: es_es, ru

source: List Objects
es_es: Lista de objetos
ru: Объекты списка

source: This subtype of :c:type:`PyObject` represents a Python list object.
es_es: Este subtipo de :c:type:`PyObject` representa un objeto de lista de Python.
ru: Этот подтип :c:type:` PyObject` представляет объект списка Python.

source: This instance of :c:type:`PyTypeObject` represents the Python list type. This is the same object as :class:`list` in the Python layer.
es_es: Esta instancia de :c:type:`PyTypeObject` representa el tipo de lista de Python. Es el mismo objeto que :class:`list` en la capa Python.
ru: Этот экземпляр :c:type:`PyTypeObject` представляет тип списка Python. Это тот же объект, что и :class:`list` на уровне Python.

source: Return true if *p* is a list object or an instance of a subtype of the list type. This function always succeeds.
es_es: Devuelve true si *p* es un objeto lista o una instancia de un subtipo del tipo lista. Esta función siempre tiene éxito.
ru: Возвращайте true, если *p* является объектом списка или экземпляром подтипа типа списка. Эта функция всегда завершается успешно.

source: Return true if *p* is a list object, but not an instance of a subtype of the list type. This function always succeeds.
es_es: Devuelve true si *p* es un objeto lista, pero no una instancia de un subtipo del tipo lista. Esta función siempre tiene éxito.
ru: Возвращает true, если *p* является объектом списка, но не является экземпляром подтипа типа list. Эта функция всегда работает успешно.

source: Return a new list of length *len* on success, or ``NULL`` on failure.
es_es: Devuelve una nueva lista de longitud *len* en caso de éxito, o ``NULL`` en caso de fallo.
ru: Возвращает новый список длины *len* в случае успеха, или ``NULL`` в случае неудачи.

source: If *len* is greater than zero, the returned list object's items are set to ``NULL``. Thus you cannot use abstract API functions such as :c:func:`PySequence_SetItem` or expose the object to Python code before setting all items to a real object with :c:func:`PyList_SetItem` or :c:func:`PyList_SET_ITEM()`. The following APIs are safe APIs before the list is fully initialized: :c:func:`PyList_SetItem()` and :c:func:`PyList_SET_ITEM()`.
ru: Если *len* больше нуля, элементы возвращаемого объекта списка имеют значение ``NULL``. Таким образом, вы не можете использовать абстрактные функции API, такие как :c:func:`PySequence_SetItem`, или предоставлять объект коду Python перед присвоением всех элементов реальному объекту с помощью :c:func:`PyList_SetItem` или :c:func:`PyList_SET_ITEM( )`. Следующие API являются безопасными API до полной инициализации списка: :c:func:`PyList_SetItem()` и :c:func:`PyList_SET_ITEM()`.

source: Return the length of the list object in *list*; this is equivalent to ``len(list)`` on a list object.
es_es: Devuelve la longitud del objeto de lista en *list*; esto equivale a ``len(list)`` en un objeto de lista.
ru: Вернуть длину объекта списка в *list*; это эквивалентно ``len(list)`` для объекта списка.

source: Similar to :c:func:`PyList_Size`, but without error checking.
ru: Аналогично :c:func:`PyList_Size`, но без проверки ошибок.

source: Return the object at position *index* in the list pointed to by *list*. The position must be non-negative; indexing from the end of the list is not supported. If *index* is out of bounds (:code:`<0 or >=len(list)`), return ``NULL`` and set an :exc:`IndexError` exception.
ru: Верните объект в позиции *index* в списке, на который указывает *list*. Позиция должна быть неотрицательной; индексация с конца списка не поддерживается. Если *index* выходит за пределы (:code:`<0 или >=len(list)`), верните ``NULL`` и установите исключение :exc:`IndexError`.

source: Like :c:func:`PyList_GetItemRef`, but returns a :term:`borrowed reference` instead of a :term:`strong reference`.
ru: Подобно :c:func:`PyList_GetItemRef`, но возвращает :term:`заимствованную ссылку` вместо :term:`сильной ссылки`.

source: Similar to :c:func:`PyList_GetItem`, but without error checking.
ru: Аналогично :c:func:`PyList_GetItem`, но без проверки ошибок.

source: Set the item at index *index* in list to *item*. Return ``0`` on success. If *index* is out of bounds, return ``-1`` and set an :exc:`IndexError` exception.
es_es: Establece el elemento en el índice *index* de la lista en *item*. Devuelve ``0`` en caso de éxito. Si *index* está fuera de los límites, devuelve ``-1`` y establece una excepción :exc:`IndexError`.
ru: Установите элемент с индексом *index* в списке на *item*. Верните ``0`` в случае успеха. Если *index* выходит за пределы, верните ``-1`` и установите исключение :exc:`IndexError`.

source: This function "steals" a reference to *item* and discards a reference to an item already in the list at the affected position.
es_es: Esta función "roba" una referencia a *item* y descarta una referencia a un elemento ya existente en la lista en la posición afectada.
ru: Эта функция «крадет» ссылку на *item* и отбрасывает ссылку на элемент, уже находящийся в списке в соответствующей позиции.

source: Macro form of :c:func:`PyList_SetItem` without error checking. This is normally only used to fill in new lists where there is no previous content.
es_es: Macroforma de :c:func:`PyList_SetItem` sin comprobación de errores. Normalmente sólo se utiliza para rellenar listas nuevas en las que no hay contenido previo.
ru: Макрос-форма :c:func:`PyList_SetItem` без проверки ошибок. Обычно это используется только для заполнения новых списков, в которых нет предыдущего содержимого.

source: Bounds checking is performed as an assertion if Python is built in :ref:`debug mode <debug-build>` or :option:`with assertions <--with-assertions>`.
ru: Проверка границ выполняется как утверждение, если Python встроен в :ref:`режиме отладки <debug-build>` или :option:`с утверждениями <--with-assertions>`.

source: This macro "steals" a reference to *item*, and, unlike :c:func:`PyList_SetItem`, does *not* discard a reference to any item that is being replaced; any reference in *list* at position *i* will be leaked.
es_es: Esta macro "roba" una referencia a *item*, y, a diferencia de :c:func:`PyList_SetItem`, *no* descarta una referencia a cualquier elemento que esté siendo reemplazado; cualquier referencia en *list* en la posición *i* será filtrada.
ru: Этот макрос «крадет» ссылку на *item* и, в отличие от :c:func:`PyList_SetItem`, *не* отбрасывает ссылку на любой заменяемый элемент; любая ссылка в *list* в позиции *i* будет утеряна.

source: Insert the item *item* into list *list* in front of index *index*. Return ``0`` if successful; return ``-1`` and set an exception if unsuccessful. Analogous to ``list.insert(index, item)``.
es_es: Inserta el elemento *item* en la lista *list* delante del índice *index*. Devuelve ``0`` si tiene éxito; devuelve ``-1`` y lanza una excepción si no tiene éxito. Análogo a ``list.insert(index, item)``.
ru: Вставьте элемент *item* в список *list* перед индексом *index*. Верните ``0`` в случае успеха; верните ``-1`` и установите исключение в случае неудачи. Аналогично ``list.insert(index, item)``.

source: Append the object *item* at the end of list *list*. Return ``0`` if successful; return ``-1`` and set an exception if unsuccessful. Analogous to ``list.append(item)``.
es_es: Añade el objeto *item* al final de la lista *list*. Devuelve ``0`` si tiene éxito; devuelve ``-1`` y lanza una excepción si no tiene éxito. Análogo a ``list.append(item)``.
ru: Добавьте объект *item* в конец списка *list*. Верните ``0`` в случае успеха; верните ``-1`` и установите исключение в случае неудачи. Аналогично ``list.append(item)``.

source: Return a list of the objects in *list* containing the objects *between* *low* and *high*. Return ``NULL`` and set an exception if unsuccessful. Analogous to ``list[low:high]``. Indexing from the end of the list is not supported.
es_es: Devuelve una lista de los objetos en *list* que contiene los objetos *between* *low* y *high*. Devuelve ``NULL`` y establece una excepción si no tiene éxito. Análogo a ``list[low:high]``. No se admite la indexación desde el final de la lista.
ru: Возвращает список объектов в *list*, содержащих объекты *между* *low* и *high*. Верните NULL и установите исключение в случае неудачи. Аналогично ``list[low:high]``. Индексация с конца списка не поддерживается.

source: Set the slice of *list* between *low* and *high* to the contents of *itemlist*. Analogous to ``list[low:high] = itemlist``. The *itemlist* may be ``NULL``, indicating the assignment of an empty list (slice deletion). Return ``0`` on success, ``-1`` on failure. Indexing from the end of the list is not supported.
es_es: Asigna la porción de *list* entre *low* y *high* al contenido de *itemlist*. Análogo a ``list[low:high] = itemlist``. *itemlist* puede ser ``NULL``, indicando la asignación de una lista vacía (borrado de segmento). Devuelve ``0`` en caso de éxito, ``-1`` en caso de fallo. No se admite la indexación desde el final de la lista.
ru: Установите срез *list* между *low* и *high* в содержимое *itemlist*. Аналогично ``list[low:high] = itemlist``. *itemlist* может иметь значение NULL, что указывает на назначение пустого списка (удаление фрагмента). Возвращайте ``0`` в случае успеха, ``-1`` в случае неудачи. Индексация с конца списка не поддерживается.

source: Extend *list* with the contents of *iterable*. This is the same as ``PyList_SetSlice(list, PY_SSIZE_T_MAX, PY_SSIZE_T_MAX, iterable)`` and analogous to ``list.extend(iterable)`` or ``list += iterable``.
ru: Расширьте *list* содержимым *iterable*. Это то же самое, что и PyList_SetSlice(list, PY_SSIZE_T_MAX, PY_SSIZE_T_MAX, iterable) и аналогично list.extend(iterable) или list += iterable.

source: Raise an exception and return ``-1`` if *list* is not a :class:`list` object. Return 0 on success.
ru: Вызовите исключение и верните ``-1``, если *list* не является объектом :class:`list`. Вернуть 0 в случае успеха.

source: Remove all items from *list*. This is the same as ``PyList_SetSlice(list, 0, PY_SSIZE_T_MAX, NULL)`` and analogous to ``list.clear()`` or ``del list[:]``.
ru: Удалить все элементы из *списка*. Это то же самое, что и ``PyList_SetSlice(list, 0, PY_SSIZE_T_MAX, NULL)`` и аналогично ``list.clear()`` или ``del list[:]``.

source: Raise an exception and return ``-1`` if *list* is not a :class:`list` object. Return 0 on success.
ru: Вызовите исключение и верните ``-1``, если *list* не является объектом :class:`list`. Вернуть 0 в случае успеха.

source: Sort the items of *list* in place. Return ``0`` on success, ``-1`` on failure. This is equivalent to ``list.sort()``.
es_es: Ordena los elementos de *list* en su lugar. Devuelve ``0`` en caso de éxito, ``-1`` en caso de fallo. Esto es equivalente a ``list.sort()``.
ru: Отсортируйте элементы *списка* на месте. Возвращайте ``0`` в случае успеха, ``-1`` в случае неудачи. Это эквивалентно list.sort().

source: Reverse the items of *list* in place. Return ``0`` on success, ``-1`` on failure. This is the equivalent of ``list.reverse()``.
es_es: Invierte los elementos de *list* en su lugar. Devuelve ``0`` en caso de éxito, en caso de fallo ``-1`` . Equivale a ``list.reverse()``.
ru: Поменяйте местами элементы *list*. Возвращайте ``0`` в случае успеха, ``-1`` в случае неудачи. Это эквивалент list.reverse().

source: Return a new tuple object containing the contents of *list*; equivalent to ``tuple(list)``.
es_es: Devuelve un nuevo objeto tupla que contiene el contenido de *list*; equivalente a ``tuple(list)``.
ru: Вернуть новый объект кортежа, содержащий содержимое *list*; эквивалентно ``tuple(list)``.

source: object
es_es: objeto
ru: объект

source: list
es_es: lista
ru: список

source: built-in function
ru: встроенная функция

source: tuple
es_es: tupla
ru: кортеж
