Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/long.po
Languages: es_es, ru, uk

source: Integer Objects
es_es: Objetos enteros
ru: Целочисленные объекты
uk: Цілі об'єкти

source: All integers are implemented as "long" integer objects of arbitrary size.
es_es: Todos los números enteros se implementan como objetos enteros "long" de tamaño arbitrario.
ru: Все целые числа реализованы как «длинные» целочисленные объекты произвольного размера.
uk: Усі цілі числа реалізуються як "довгі" цілі об’єкти довільного розміру.

source: On error, most ``PyLong_As*`` APIs return ``(return type)-1`` which cannot be distinguished from a number. Use :c:func:`PyErr_Occurred` to disambiguate.
es_es: En caso de error, la mayoría de las API ``PyLong_As*`` devuelven ``(return type)-1``, que no puede distinguirse de un número. Utilizar :c:func:`PyErr_Occurred` para desambiguar.
ru: В случае ошибки большинство API PyLong_As* возвращают ``(return type)-1``, который невозможно отличить от числа. Используйте :c:func:`PyErr_Occurred` для устранения неоднозначности.
uk: У разі помилки більшість API ``PyLong_As*`` повертають ``(тип повернення)-1``, який неможливо відрізнити від числа. Використовуйте :c:func:`PyErr_Occurred` для усунення неоднозначності.

source: This subtype of :c:type:`PyObject` represents a Python integer object.
es_es: Este subtipo de :c:type:`PyObject` representa un objeto entero de Python.
ru: Этот подтип :c:type:`PyObject` представляет собой целочисленный объект Python.
uk: Цей підтип :c:type:`PyObject` представляє цілочисельний об’єкт Python.

source: This instance of :c:type:`PyTypeObject` represents the Python integer type. This is the same object as :class:`int` in the Python layer.
es_es: Esta instancia de :c:type:`PyTypeObject` representa el tipo entero de Python. Es el mismo objeto que :class:`int` en la capa Python.
ru: Этот экземпляр :c:type:`PyTypeObject` представляет целочисленный тип Python. Это тот же объект, что и :class:`int` на уровне Python.
uk: Цей екземпляр :c:type:`PyTypeObject` представляє цілочисельний тип Python. Це той самий об’єкт, що й :class:`int` на рівні Python.

source: Return true if its argument is a :c:type:`PyLongObject` or a subtype of :c:type:`PyLongObject`. This function always succeeds.
es_es: Devuelve true si su argumento es un :c:type:`PyLongObject` o un subtipo de :c:type:`PyLongObject`. Esta función siempre tiene éxito.
ru: Возвращает true, если его аргументом является :c:type:`PyLongObject` или подтип :c:type:`PyLongObject`. Эта функция всегда завершается успешно.
uk: Повертає true, якщо його аргумент є :c:type:`PyLongObject` або підтипом :c:type:`PyLongObject`. Ця функція завжди успішна.

source: Return true if its argument is a :c:type:`PyLongObject`, but not a subtype of :c:type:`PyLongObject`. This function always succeeds.
es_es: Devuelve true si su argumento es un :c:type:`PyLongObject`, pero no un subtipo de :c:type:`PyLongObject`. Esta función siempre tiene éxito.
ru: Возвращает true, если его аргументом является :c:type:`PyLongObject`, но не подтип :c:type:`PyLongObject`. Эта функция всегда завершается успешно.
uk: Повертає true, якщо його аргумент є :c:type:`PyLongObject`, але не підтипом :c:type:`PyLongObject`. Ця функція завжди успішна.

source: Return a new :c:type:`PyLongObject` object from *v*, or ``NULL`` on failure.
es_es: Devuelve un nuevo objeto :c:type:`PyLongObject` de *v*, o ``NULL`` en caso de fallo.
ru: Вернуть новый объект :c:type:`PyLongObject` из *v* или ``NULL`` в случае ошибки.
uk: Повертає новий об’єкт :c:type:`PyLongObject` з *v* або ``NULL`` у разі помилки.

source: The current implementation keeps an array of integer objects for all integers between ``-5`` and ``256``. When you create an int in that range you actually just get back a reference to the existing object.
es_es: La implementación actual mantiene un array de objetos enteros para todos los enteros entre ``-5`` y ``256``. Cuando se crea un int en ese rango, en realidad sólo se obtiene una referencia al objeto existente.
ru: Текущая реализация сохраняет массив целочисленных объектов для всех целых чисел от «-5» до «256». Когда вы создаете int в этом диапазоне, вы фактически просто получаете ссылку на существующий объект.
uk: Поточна реалізація зберігає масив цілих об’єктів для всіх цілих чисел від ``-5`` до ``256``. Коли ви створюєте int у цьому діапазоні, ви фактично повертаєте посилання на існуючий об’єкт.

source: Return a new :c:type:`PyLongObject` object from a C :c:expr:`unsigned long`, or ``NULL`` on failure.
es_es: Devuelve un nuevo objeto :c:type:`PyLongObject` a partir de un C :c:expr:`unsigned long`, o ``NULL`` en caso de fallo.
ru: Возвращает новый объект :c:type:`PyLongObject` из C :c:expr:`unsigned long` или ``NULL`` в случае неудачи.

source: Return a new :c:type:`PyLongObject` object from a C :c:type:`Py_ssize_t`, or ``NULL`` on failure.
es_es: Devuelve un nuevo objeto :c:type:`PyLongObject` a partir de un objeto C :c:type:`Py_ssize_t`, o ``NULL`` en caso de fallo.
ru: Возвращает новый объект :c:type:`PyLongObject` из C :c:type:`Py_ssize_t` или ``NULL`` в случае ошибки.
uk: Повертає новий об’єкт :c:type:`PyLongObject` із C :c:type:`Py_ssize_t` або ``NULL`` у разі помилки.

source: Return a new :c:type:`PyLongObject` object from a C :c:type:`size_t`, or ``NULL`` on failure.
es_es: Devuelve un nuevo objeto :c:type:`PyLongObject` a partir de un objeto C :c:type:`size_t`, o ``NULL`` en caso de fallo.
ru: Возвращает новый объект :c:type:`PyLongObject` из C :c:type:`size_t` или ``NULL`` в случае ошибки.
uk: Повертає новий об’єкт :c:type:`PyLongObject` із C :c:type:`size_t` або ``NULL`` у разі помилки.

source: Return a new :c:type:`PyLongObject` object from a C :c:expr:`long long`, or ``NULL`` on failure.
es_es: Devuelve un nuevo objeto :c:type:`PyLongObject` a partir de un C :c:expr:`long long`, o ``NULL`` en caso de fallo.
ru: Возвращает новый объект :c:type:`PyLongObject` из C :c:expr:`long long` или ``NULL`` в случае неудачи.

source: Return a new :c:type:`PyLongObject` object from a C :c:expr:`unsigned long long`, or ``NULL`` on failure.
es_es: Devuelve un nuevo objeto :c:type:`PyLongObject` a partir de un C :c:expr:`unsigned long long`, o ``NULL`` en caso de fallo.
ru: Вернуть новый объект :c:type:`PyLongObject` из C :c:expr:`unsigned long long` или ``NULL`` в случае неудачи.

source: Return a new :c:type:`PyLongObject` object from the integer part of *v*, or ``NULL`` on failure.
es_es: Devuelve un nuevo objeto :c:type:`PyLongObject` a partir de la parte entera de *v*, o ``NULL`` en caso de fallo.
ru: Вернуть новый объект :c:type:`PyLongObject` из целочисленной части *v* или ``NULL`` в случае ошибки.
uk: Повертає новий об’єкт :c:type:`PyLongObject` із цілої частини *v* або ``NULL`` у разі помилки.

source: Return a new :c:type:`PyLongObject` based on the string value in *str*, which is interpreted according to the radix in *base*, or ``NULL`` on failure. If *pend* is non-``NULL``, *\*pend* will point to the end of *str* on success or to the first character that could not be processed on error. If *base* is ``0``, *str* is interpreted using the :ref:`integers` definition; in this case, leading zeros in a non-zero decimal number raises a :exc:`ValueError`. If *base* is not ``0``, it must be between ``2`` and ``36``, inclusive. Leading and trailing whitespace and single underscores after a base specifier and between digits are ignored. If there are no digits or *str* is not NULL-terminated following the digits and trailing whitespace, :exc:`ValueError` will be raised.
es_es: Devuelve un nuevo :c:type:`PyLongObject` basado en el valor de la cadena en *str*, que se interpreta según el radix en *base*, o ``NULL`` en caso de fallo. Si *pend* no es``NULL``, *\*pend* apuntará al final de *str* en caso de éxito o al primer carácter que no pudo ser procesado en caso de error. Si *base* es ``0``, *str* se interpreta utilizando la definición de :ref:`integers`; en este caso, los ceros a la izquierda en un número decimal distinto de cero provocan un :exc:`ValueError`. Si *base* no es ``0``, debe estar entre ``2`` y ``36``, ambos inclusive. Se ignoran los espacios en blanco iniciales y finales y los guiones bajos simples después de un especificador de base y entre dígitos. Si no hay dígitos o *str* no termina en NULL después de los dígitos y los espacios en blanco, se producirá :exc:`ValueError`.
ru: Возвращает новый :c:type:`PyLongObject` на основе строкового значения в *str*, которое интерпретируется в соответствии с основанием системы счисления в *base*, или ``NULL`` в случае ошибки. Если *pend* не равен NULL, *\*pend* будет указывать на конец *str* в случае успеха или на первый символ, который не удалось обработать в случае ошибки. Если *base* равно «0», *str* интерпретируется с использованием определения :ref:`integers`; в этом случае ведущие нули в ненулевом десятичном числе вызывают ошибку :exc:`ValueError`. Если *base* не равно ``0``, оно должно находиться в диапазоне от ``2`` до ``36`` включительно. Ведущие и конечные пробелы, а также одиночные символы подчеркивания после базового спецификатора и между цифрами игнорируются. Если цифр нет или *str* не заканчивается NULL после цифр и завершающих пробелов, будет поднято :exc:`ValueError`.

source: Python methods :meth:`int.to_bytes` and :meth:`int.from_bytes` to convert a :c:type:`PyLongObject` to/from an array of bytes in base ``256``. You can call those from C using :c:func:`PyObject_CallMethod`.
es_es: Métodos de Python :meth:`int.to_bytes` y :meth:`int.from_bytes` para convertir un :c:type:`PyLongObject` a/desde una matriz de bytes en base ``256``. Puedes llamarlos desde C usando :c:func:`PyObject_CallMethod`.
ru: Методы Python :meth:`int.to_bytes` и :meth:`int.from_bytes` для преобразования :c:type:`PyLongObject` в/из массива байтов в базе ``256``. Вы можете вызвать их из C, используя :c:func:`PyObject_CallMethod`.

source: Convert a sequence of Unicode digits in the string *u* to a Python integer value.
es_es: Convierte una secuencia de dígitos Unicode de la cadena *u* en un valor entero de Python.
ru: Преобразуйте последовательность цифр Юникода в строке *u* в целочисленное значение Python.
uk: Перетворіть послідовність цифр Unicode у рядку *u* на ціле число Python.

source: Create a Python integer from the pointer *p*. The pointer value can be retrieved from the resulting value using :c:func:`PyLong_AsVoidPtr`.
es_es: Crea un entero Python a partir del puntero *p*. El valor del puntero se puede recuperar a partir del valor resultante utilizando :c:func:`PyLong_AsVoidPtr`.
ru: Создайте целое число Python из указателя *p*. Значение указателя можно получить из полученного значения с помощью :c:func:`PyLong_AsVoidPtr`.
uk: Створіть ціле число Python із покажчика *p*. Значення вказівника можна отримати з результуючого значення за допомогою :c:func:`PyLong_AsVoidPtr`.

source: Create a Python integer from the value contained in the first *n_bytes* of *buffer*, interpreted as a two's-complement signed number.
ru: Создайте целое число Python из значения, содержащегося в первых *n_bytes* *buffer*, интерпретируемого как число со знаком, дополняемое до двух.

source: *flags* are as for :c:func:`PyLong_AsNativeBytes`. Passing ``-1`` will select the native endian that CPython was compiled with and assume that the most-significant bit is a sign bit. Passing ``Py_ASNATIVEBYTES_UNSIGNED_BUFFER`` will produce the same result as calling :c:func:`PyLong_FromUnsignedNativeBytes`. Other flags are ignored.
ru: *флаги* такие же, как для :c:func:`PyLong_AsNativeBytes`. При передаче ``-1`` будет выбран собственный порядок байтов, с которым был скомпилирован CPython, и предполагается, что наиболее значимый бит является знаковым. Передача Py_ASNATIVEBYTES_UNSIGNED_BUFFER даст тот же результат, что и вызов :c:func:`PyLong_FromUnsignedNativeBytes`. Остальные флаги игнорируются.

source: Create a Python integer from the value contained in the first *n_bytes* of *buffer*, interpreted as an unsigned number.
ru: Создайте целое число Python из значения, содержащегося в первых *n_bytes* *buffer*, интерпретируемого как беззнаковое число.

source: *flags* are as for :c:func:`PyLong_AsNativeBytes`. Passing ``-1`` will select the native endian that CPython was compiled with and assume that the most-significant bit is not a sign bit. Flags other than endian are ignored.
ru: *флаги* такие же, как для :c:func:`PyLong_AsNativeBytes`. При передаче ``-1`` будет выбран собственный порядок байтов, с которым был скомпилирован CPython, и предполагается, что самый старший бит не является знаковым битом. Флаги, отличные от endian, игнорируются.

source: Return a C :c:expr:`long` representation of *obj*. If *obj* is not an instance of :c:type:`PyLongObject`, first call its :meth:`~object.__index__` method (if present) to convert it to a :c:type:`PyLongObject`.
es_es: Devuelve una representación C :c:expr:`long` de *obj*. Si *obj* no es una instancia de :c:type:`PyLongObject`, llame primero a su método :meth:`~object.__index__` (si existe) para convertirlo en :c:type:`PyLongObject`.
ru: Возвращает C :c:expr:`long` представление *obj*. Если *obj* не является экземпляром :c:type:`PyLongObject`, сначала вызовите его метод :meth:`~object.__index__` (если он присутствует), чтобы преобразовать его в :c:type:`PyLongObject`.

source: Raise :exc:`OverflowError` if the value of *obj* is out of range for a :c:expr:`long`.
es_es: :exc:`OverflowError` si el valor de *obj* está fuera del rango de :c:expr:`long`.
ru: Поднимите :exc:`OverflowError`, если значение *obj* выходит за пределы диапазона для :c:expr:`long`.

source: Returns ``-1`` on error. Use :c:func:`PyErr_Occurred` to disambiguate.
es_es: Devuelve ``-1`` en caso de error. Utilizar :c:func:`PyErr_Occurred` para desambiguar.
ru: Возвращает ``-1`` в случае ошибки. Используйте :c:func:`PyErr_Occurred` для устранения неоднозначности.
uk: Повертає ``-1`` у разі помилки. Використовуйте :c:func:`PyErr_Occurred` для усунення неоднозначності.

source: Use :meth:`~object.__index__` if available.
es_es: Utilice :meth:`~object.__index__` si está disponible.
ru: Используйте :meth:`~object.__index__`, если доступно.

source: This function will no longer use :meth:`~object.__int__`.
es_es: Esta función ya no utilizará :meth:`~object.__int__`.
ru: Эта функция больше не будет использовать :meth:`~object.__int__`.

source: A :term:`soft deprecated` alias. Exactly equivalent to the preferred ``PyLong_AsLong``. In particular, it can fail with :exc:`OverflowError` or another exception.
ru: A :term:`мягкий устаревший` псевдоним. Точно эквивалентен предпочтительному PyLong_AsLong. В частности, он может завершиться ошибкой с :exc:`OverflowError` или другим исключением.

source: The function is soft deprecated.
ru: Функция является устаревшей.

source: Similar to :c:func:`PyLong_AsLong`, but store the result in a C :c:expr:`int` instead of a C :c:expr:`long`.
ru: Аналогично :c:func:`PyLong_AsLong`, но результат сохраняется в C :c:expr:`int` вместо C :c:expr:`long`.

source: If the value of *obj* is greater than :c:macro:`LONG_MAX` or less than :c:macro:`LONG_MIN`, set *\*overflow* to ``1`` or ``-1``, respectively, and return ``-1``; otherwise, set *\*overflow* to ``0``. If any other exception occurs set *\*overflow* to ``0`` and return ``-1`` as usual.
es_es: Si el valor de *obj* es mayor que :c:macro:`LONG_MAX` o menor que :c:macro:`LONG_MIN`, ponga *\*overflow* a ``1`` o ``-1``, respectivamente, y devuelva ``-1``; de lo contrario, ponga *\*overflow* a ``0``. Si ocurre cualquier otra excepción ponga *\*overflow* a ``0`` y devuelva ``-1`` como de costumbre.
ru: Если значение *obj* больше, чем :c:macro:`LONG_MAX` или меньше, чем :c:macro:`LONG_MIN`, установите для *\*overflow* значение ``1`` или ``-1``, соответственно и вернуть ``-1``; в противном случае установите для *\*overflow* значение ``0``. Если возникает какое-либо другое исключение, установите *\*overflow* в ``0`` и верните ``-1``, как обычно.

source: Return a C :c:expr:`long long` representation of *obj*. If *obj* is not an instance of :c:type:`PyLongObject`, first call its :meth:`~object.__index__` method (if present) to convert it to a :c:type:`PyLongObject`.
es_es: Devuelve una representación C :c:expr:`long long` de *obj*. Si *obj* no es una instancia de :c:type:`PyLongObject`, llame primero a su método :meth:`~object.__index__` (si existe) para convertirlo en :c:type:`PyLongObject`.
ru: Возвращает C :c:expr:`long long` представление *obj*. Если *obj* не является экземпляром :c:type:`PyLongObject`, сначала вызовите его метод :meth:`~object.__index__` (если он присутствует), чтобы преобразовать его в :c:type:`PyLongObject`.

source: Raise :exc:`OverflowError` if the value of *obj* is out of range for a :c:expr:`long long`.
es_es: Lanza :exc:`OverflowError` si el valor de *obj* está fuera de rango para un :c:expr:`long long`.
ru: Вызовите :exc:`OverflowError`, если значение *obj* выходит за пределы диапазона для :c:expr:`long long`.

source: If the value of *obj* is greater than :c:macro:`LLONG_MAX` or less than :c:macro:`LLONG_MIN`, set *\*overflow* to ``1`` or ``-1``, respectively, and return ``-1``; otherwise, set *\*overflow* to ``0``. If any other exception occurs set *\*overflow* to ``0`` and return ``-1`` as usual.
es_es: Si el valor de *obj* es mayor que :c:macro:`LLONG_MAX` o menor que :c:macro:`LLONG_MIN`, ponga *\*overflow* a ``1`` o ``-1``, respectivamente, y devuelva ``-1``; de lo contrario, ponga *\*overflow* a ``0``. Si ocurre cualquier otra excepción ponga *\*overflow* a ``0`` y devuelva ``-1`` como de costumbre.
ru: Если значение *obj* больше, чем :c:macro:`LLONG_MAX` или меньше, чем :c:macro:`LLONG_MIN`, установите для *\*overflow* значение ``1`` или ``-1``, соответственно и вернуть ``-1``; в противном случае установите для *\*overflow* значение ``0``. Если возникает какое-либо другое исключение, установите *\*overflow* в ``0`` и верните ``-1``, как обычно.

source: Return a C :c:type:`Py_ssize_t` representation of *pylong*. *pylong* must be an instance of :c:type:`PyLongObject`.
es_es: Devolver una representación C :c:type:`Py_ssize_t` de *pylong*. *pylong* debe ser una instancia de :c:type:`PyLongObject`.
ru: Возвращает представление *pylong* на языке C :c:type:`Py_ssize_t`. *pylong* должен быть экземпляром :c:type:`PyLongObject`.
uk: Повертає C :c:type:`Py_ssize_t` представлення *pylong*. *pylong* має бути екземпляром :c:type:`PyLongObject`.

source: Raise :exc:`OverflowError` if the value of *pylong* is out of range for a :c:type:`Py_ssize_t`.
es_es: Lanzar :exc:`OverflowError` si el valor de *pylong* está fuera de rango para un :c:type:`Py_ssize_t`.
ru: Поднимите :exc:`OverflowError`, если значение *pylong* выходит за пределы диапазона для :c:type:`Py_ssize_t`.
uk: Викликайте :exc:`OverflowError`, якщо значення *pylong* виходить за межі діапазону для :c:type:`Py_ssize_t`.

source: Return a C :c:expr:`unsigned long` representation of *pylong*. *pylong* must be an instance of :c:type:`PyLongObject`.
es_es: Devuelve una representación C :c:expr:`unsigned long` de *pylong*. *pylong* debe ser una instancia de :c:type:`PyLongObject`.
ru: Возвращает C :c:expr:`unsigned long` представление *pylong*. *pylong* должен быть экземпляром :c:type:`PyLongObject`.

source: Raise :exc:`OverflowError` if the value of *pylong* is out of range for a :c:expr:`unsigned long`.
es_es: Lanza :exc:`OverflowError` si el valor de *pylong* está fuera de rango para un :c:expr:`unsigned long`.
ru: Вызовите :exc:`OverflowError`, если значение *pylong* выходит за пределы диапазона для :c:expr:`unsigned long`.

source: Returns ``(unsigned long)-1`` on error. Use :c:func:`PyErr_Occurred` to disambiguate.
es_es: Devuelve ``(unsigned long)-1`` en caso de error. Utilizar :c:func:`PyErr_Occurred` para desambiguar.
ru: Возвращает ``(unsigned long)-1`` в случае ошибки. Используйте :c:func:`PyErr_Occurred` для устранения неоднозначности.
uk: У разі помилки повертає ``(unsigned long)-1``. Використовуйте :c:func:`PyErr_Occurred` для усунення неоднозначності.

source: Return a C :c:type:`size_t` representation of *pylong*. *pylong* must be an instance of :c:type:`PyLongObject`.
es_es: Devuelve una representación C :c:type:`size_t` de *pylong*. *pylong* debe ser una instancia de :c:type:`PyLongObject`.
ru: Возвращает представление *pylong* на языке C :c:type:`size_t`. *pylong* должен быть экземпляром :c:type:`PyLongObject`.
uk: Повертає C :c:type:`size_t` представлення *pylong*. *pylong* має бути екземпляром :c:type:`PyLongObject`.

source: Raise :exc:`OverflowError` if the value of *pylong* is out of range for a :c:type:`size_t`.
es_es: Lanza :exc:`OverflowError` si el valor de *pylong* está fuera de rango para un :c:type:`size_t`.
ru: Поднимите :exc:`OverflowError`, если значение *pylong* выходит за пределы диапазона для :c:type:`size_t`.
uk: Викликайте :exc:`OverflowError`, якщо значення *pylong* виходить за межі діапазону для :c:type:`size_t`.

source: Returns ``(size_t)-1`` on error. Use :c:func:`PyErr_Occurred` to disambiguate.
es_es: Devuelve ``(size_t)-1`` en caso de error. Usar :c:func:`PyErr_Occurred` para desambiguar.
ru: Возвращает ``(size_t)-1`` в случае ошибки. Используйте :c:func:`PyErr_Occurred` для устранения неоднозначности.
uk: Повертає ``(size_t)-1`` у разі помилки. Використовуйте :c:func:`PyErr_Occurred` для усунення неоднозначності.

source: Return a C :c:expr:`unsigned long long` representation of *pylong*. *pylong* must be an instance of :c:type:`PyLongObject`.
es_es: Devuelve una representación C :c:expr:`unsigned long long` de *pylong*. *pylong* debe ser una instancia de :c:type:`PyLongObject`.
ru: Возвращает C :c:expr:`unsigned long long` представление *pylong*. *pylong* должен быть экземпляром :c:type:`PyLongObject`.

source: Raise :exc:`OverflowError` if the value of *pylong* is out of range for an :c:expr:`unsigned long long`.
es_es: Lanza :exc:`OverflowError` si el valor de *pylong* está fuera de rango para un :c:expr:`unsigned long long`.
ru: Вызовите :exc:`OverflowError`, если значение *pylong* выходит за пределы диапазона для :c:expr:`unsigned long long`.

source: Returns ``(unsigned long long)-1`` on error. Use :c:func:`PyErr_Occurred` to disambiguate.
es_es: Devuelve ``(unsigned long long)-1`` en caso de error. Usar :c:func:`PyErr_Occurred` para desambiguar.
ru: Возвращает ``(unsigned long long)-1`` в случае ошибки. Используйте :c:func:`PyErr_Occurred` для устранения неоднозначности.
uk: У разі помилки повертає ``(unsigned long long)-1``. Використовуйте :c:func:`PyErr_Occurred` для усунення неоднозначності.

source: A negative *pylong* now raises :exc:`OverflowError`, not :exc:`TypeError`.
es_es: Un *pylong* negativo ahora sube :exc:`OverflowError`, no :exc:`TypeError`.
ru: Отрицательный *pylong* теперь вызывает :exc:`OverflowError`, а не :exc:`TypeError`.
uk: Негативний *pylong* тепер викликає :exc:`OverflowError`, а не :exc:`TypeError`.

source: Return a C :c:expr:`unsigned long` representation of *obj*. If *obj* is not an instance of :c:type:`PyLongObject`, first call its :meth:`~object.__index__` method (if present) to convert it to a :c:type:`PyLongObject`.
es_es: Devuelve una representación C :c:expr:`unsigned long` de *obj*. Si *obj* no es una instancia de :c:type:`PyLongObject`, llame primero a su método :meth:`~object.__index__` (si existe) para convertirlo en :c:type:`PyLongObject`.
ru: Возвращает C :c:expr:`unsigned long` представление *obj*. Если *obj* не является экземпляром :c:type:`PyLongObject`, сначала вызовите его метод :meth:`~object.__index__` (если он присутствует), чтобы преобразовать его в :c:type:`PyLongObject`.
