Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/long.po
Languages: es_es, ru, uk

source: If the value of *obj* is out of range for an :c:expr:`unsigned long`, return the reduction of that value modulo ``ULONG_MAX + 1``.
es_es: Si el valor de *obj* está fuera de rango para un :c:expr:`unsigned long`, devuelve la reducción de ese valor módulo ``ULONG_MAX + 1``.
ru: Если значение *obj* выходит за пределы диапазона для :c:expr:`unsigned long`, верните уменьшение этого значения по модулю ``ULONG_MAX + 1``.

source: Returns ``(unsigned long)-1`` on error. Use :c:func:`PyErr_Occurred` to disambiguate.
es_es: Devuelve ``(unsigned long)-1`` en caso de error. Utilice :c:func:`PyErr_Occurred` para desambiguar.
ru: Возвращает ``(unsigned long)-1`` в случае ошибки. Используйте :c:func:`PyErr_Occurred` для устранения неоднозначности.
uk: У разі помилки повертає ``(unsigned long)-1``. Використовуйте :c:func:`PyErr_Occurred` для усунення неоднозначності.

source: Return a C :c:expr:`unsigned long long` representation of *obj*. If *obj* is not an instance of :c:type:`PyLongObject`, first call its :meth:`~object.__index__` method (if present) to convert it to a :c:type:`PyLongObject`.
es_es: Devuelve una representación C :c:expr:`unsigned long long` de *obj*. Si *obj* no es una instancia de :c:type:`PyLongObject`, llame primero a su método :meth:`~object.__index__` (si existe) para convertirlo en :c:type:`PyLongObject`.
ru: Возвращает C :c:expr:`unsigned long long` представление *obj*. Если *obj* не является экземпляром :c:type:`PyLongObject`, сначала вызовите его метод :meth:`~object.__index__` (если он присутствует), чтобы преобразовать его в :c:type:`PyLongObject`.

source: If the value of *obj* is out of range for an :c:expr:`unsigned long long`, return the reduction of that value modulo ``ULLONG_MAX + 1``.
es_es: Si el valor de *obj* está fuera de rango para un :c:expr:`unsigned long long`, devuelve la reducción de ese valor módulo ``ULLONG_MAX + 1``.
ru: Если значение *obj* выходит за пределы диапазона для :c:expr:`unsigned long long`, верните уменьшение этого значения по модулю ``ULLONG_MAX + 1``.

source: Returns ``(unsigned long long)-1`` on error. Use :c:func:`PyErr_Occurred` to disambiguate.
es_es: Devuelve ``(unsigned long long)-1`` en caso de error. Usar :c:func:`PyErr_Occurred` para desambiguar.
ru: Возвращает ``(unsigned long long)-1`` в случае ошибки. Используйте :c:func:`PyErr_Occurred` для устранения неоднозначности.
uk: У разі помилки повертає ``(unsigned long long)-1``. Використовуйте :c:func:`PyErr_Occurred` для усунення неоднозначності.

source: Return a C :c:expr:`double` representation of *pylong*. *pylong* must be an instance of :c:type:`PyLongObject`.
es_es: Devuelve una representación C :c:expr:`double` de *pylong*. *pylong* debe ser una instancia de :c:type:`PyLongObject`.
ru: Возвращает представление *pylong* на языке C :c:expr:`double`. *pylong* должен быть экземпляром :c:type:`PyLongObject`.

source: Raise :exc:`OverflowError` if the value of *pylong* is out of range for a :c:expr:`double`.
es_es: Lanza :exc:`OverflowError` si el valor de *pylong* está fuera de rango para un :c:expr:`double`.
ru: Поднимите :exc:`OverflowError`, если значение *pylong* выходит за пределы диапазона для :c:expr:`double`.

source: Returns ``-1.0`` on error. Use :c:func:`PyErr_Occurred` to disambiguate.
es_es: Devuelve ``-1.0`` en caso de error. Usar :c:func:`PyErr_Occurred` para desambiguar.
ru: Возвращает ``-1.0`` в случае ошибки. Используйте :c:func:`PyErr_Occurred` для устранения неоднозначности.
uk: Повертає ``-1.0`` у разі помилки. Використовуйте :c:func:`PyErr_Occurred` для усунення неоднозначності.

source: Convert a Python integer *pylong* to a C :c:expr:`void` pointer. If *pylong* cannot be converted, an :exc:`OverflowError` will be raised. This is only assured to produce a usable :c:expr:`void` pointer for values created with :c:func:`PyLong_FromVoidPtr`.
es_es: Convierte un entero Python *pylong* en un puntero C :c:expr:`void`. Si *pylong* no puede convertirse, se producirá un error :exc:`OverflowError`. Esto sólo se asegura para producir un puntero :c:expr:`void` utilizable para valores creados con :c:func:`PyLong_FromVoidPtr`.
ru: Преобразуйте целое число Python *pylong* в указатель C :c:expr:`void`. Если *pylong* невозможно преобразовать, будет выдано сообщение :exc:`OverflowError`. Это гарантирует только создание полезного указателя :c:expr:`void` для значений, созданных с помощью :c:func:`PyLong_FromVoidPtr`.

source: Returns ``NULL`` on error. Use :c:func:`PyErr_Occurred` to disambiguate.
es_es: Devuelve ``NULL`` en caso de error. Usar :c:func:`PyErr_Occurred` para desambiguar.
ru: Возвращает ``NULL`` в случае ошибки. Используйте :c:func:`PyErr_Occurred` для устранения неоднозначности.
uk: Повертає ``NULL`` у разі помилки. Використовуйте :c:func:`PyErr_Occurred` для усунення неоднозначності.

source: Copy the Python integer value *pylong* to a native *buffer* of size *n_bytes*. The *flags* can be set to ``-1`` to behave similarly to a C cast, or to values documented below to control the behavior.
ru: Скопируйте целочисленное значение Python *pylong* в собственный *буфер* размером *n_bytes*. Для *флагов* можно установить значение ``-1``, чтобы вести себя аналогично приведению C, или значения, описанные ниже, чтобы контролировать поведение.

source: Returns ``-1`` with an exception raised on error. This may happen if *pylong* cannot be interpreted as an integer, or if *pylong* was negative and the ``Py_ASNATIVEBYTES_REJECT_NEGATIVE`` flag was set.
ru: Возвращает ``-1`` с исключением, возникающим в случае ошибки. Это может произойти, если *pylong* не может быть интерпретировано как целое число, или если *pylong* было отрицательным и был установлен флаг ``Py_ASNATIVEBYTES_REJECT_NEGATIVE``.

source: Otherwise, returns the number of bytes required to store the value. If this is equal to or less than *n_bytes*, the entire value was copied. All *n_bytes* of the buffer are written: large buffers are padded with zeroes.
ru: В противном случае возвращает количество байтов, необходимое для хранения значения. Если оно равно или меньше *n_bytes*, скопировано все значение. Записываются все *n_байт* буфера: большие буферы дополняются нулями.

source: If the returned value is greater than than *n_bytes*, the value was truncated: as many of the lowest bits of the value as could fit are written, and the higher bits are ignored. This matches the typical behavior of a C-style downcast.
ru: Если возвращаемое значение превышает *n_bytes*, значение было усечено: записывается столько младших битов значения, сколько могло поместиться, а старшие биты игнорируются. Это соответствует типичному поведению приведения вниз в стиле C.

source: Overflow is not considered an error. If the returned value is larger than *n_bytes*, most significant bits were discarded.
ru: Переполнение не считается ошибкой. Если возвращаемое значение превышает *n_bytes*, наиболее значимые биты отбрасываются.

source: ``0`` will never be returned.
ru: ``0`` никогда не будет возвращен.

source: Values are always copied as two's-complement.
ru: Значения всегда копируются как дополнение до двух.

source: Usage example::
ru: Пример использования::

source: Passing zero to *n_bytes* will return the size of a buffer that would be large enough to hold the value. This may be larger than technically necessary, but not unreasonably so. If *n_bytes=0*, *buffer* may be ``NULL``.
ru: Передача нуля в *n_bytes* вернет размер буфера, который будет достаточно большим для хранения значения. Это может быть больше, чем технически необходимо, но это не является необоснованным. Если *n_bytes=0*, *buffer* может иметь значение ``NULL``.

source: Passing *n_bytes=0* to this function is not an accurate way to determine the bit length of the value.
ru: Передача *n_bytes=0* в эту функцию не является точным способом определения длины значения в битах.

source: To get at the entire Python value of an unknown size, the function can be called twice: first to determine the buffer size, then to fill it::
ru: Чтобы получить все значение Python неизвестного размера, функцию можно вызвать дважды: сначала для определения размера буфера, затем для его заполнения:

source: *flags* is either ``-1`` (``Py_ASNATIVEBYTES_DEFAULTS``) to select defaults that behave most like a C cast, or a combination of the other flags in the table below. Note that ``-1`` cannot be combined with other flags.
ru: *flags* — это либо ``-1`` (``Py_ASNATIVEBYTES_DEFAULTS``), чтобы выбрать значения по умолчанию, которые ведут себя наиболее похоже на приведение C, либо комбинацию других флагов в таблице ниже. Обратите внимание, что ``-1`` нельзя комбинировать с другими флагами.

source: Currently, ``-1`` corresponds to ``Py_ASNATIVEBYTES_NATIVE_ENDIAN | Py_ASNATIVEBYTES_UNSIGNED_BUFFER``.
ru: В настоящее время ``-1`` соответствует ``Py_ASNATIVEBYTES_NATIVE_ENDIAN | Py_ASNATIVEBYTES_UNSIGNED_BUFFER``.

source: Flag
ru: Флаг

source: Value
ru: Значение

source: Specifying ``Py_ASNATIVEBYTES_NATIVE_ENDIAN`` will override any other endian flags. Passing ``2`` is reserved.
ru: Указание ``Py_ASNATIVEBYTES_NATIVE_ENDIAN`` переопределит любые другие флаги с порядком байтов. Передача ``2`` зарезервирована.

source: By default, sufficient buffer will be requested to include a sign bit. For example, when converting 128 with *n_bytes=1*, the function will return 2 (or more) in order to store a zero sign bit.
ru: По умолчанию будет запрошен достаточный буфер для включения знакового бита. Например, при преобразовании 128 с *n_bytes=1* функция вернет 2 (или более), чтобы сохранить бит нулевого знака.

source: If ``Py_ASNATIVEBYTES_UNSIGNED_BUFFER`` is specified, a zero sign bit will be omitted from size calculations. This allows, for example, 128 to fit in a single-byte buffer. If the destination buffer is later treated as signed, a positive input value may become negative. Note that the flag does not affect handling of negative values: for those, space for a sign bit is always requested.
ru: Если указан Py_ASNATIVEBYTES_UNSIGNED_BUFFER, бит нулевого знака будет опущен при расчете размера. Это позволяет, например, разместить 128 в однобайтовом буфере. Если буфер назначения позже будет считаться подписанным, положительное входное значение может стать отрицательным. Обратите внимание, что этот флаг не влияет на обработку отрицательных значений: для них всегда запрашивается место для знакового бита.

source: Specifying ``Py_ASNATIVEBYTES_REJECT_NEGATIVE`` causes an exception to be set if *pylong* is negative. Without this flag, negative values will be copied provided there is enough space for at least one sign bit, regardless of whether ``Py_ASNATIVEBYTES_UNSIGNED_BUFFER`` was specified.
ru: Указание ``Py_ASNATIVEBYTES_REJECT_NEGATIVE`` приводит к установке исключения, если *pylong* имеет отрицательное значение. Без этого флага отрицательные значения будут копироваться при условии, что достаточно места хотя бы для одного знакового бита, независимо от того, был ли указан ``Py_ASNATIVEBYTES_UNSIGNED_BUFFER``.

source: If ``Py_ASNATIVEBYTES_ALLOW_INDEX`` is specified and a non-integer value is passed, its :meth:`~object.__index__` method will be called first. This may result in Python code executing and other threads being allowed to run, which could cause changes to other objects or values in use. When *flags* is ``-1``, this option is not set, and non-integer values will raise :exc:`TypeError`.
ru: Если указан ``Py_ASNATIVEBYTES_ALLOW_INDEX`` и передано нецелое значение, сначала будет вызван его метод :meth:`~object.__index__`. Это может привести к выполнению кода Python и разрешению запуска других потоков, что может привести к изменениям в других используемых объектах или значениях. Если *flags* имеет значение ``-1``, эта опция не установлена, и нецелочисленные значения будут вызывать :exc:`TypeError`.

source: With the default *flags* (``-1``, or *UNSIGNED_BUFFER* without *REJECT_NEGATIVE*), multiple Python integers can map to a single value without overflow. For example, both ``255`` and ``-1`` fit a single-byte buffer and set all its bits. This matches typical C cast behavior.
ru: При использовании *флагов* по умолчанию (``-1`` или *UNSIGNED_BUFFER* без *REJECT_NEGATIVE*) несколько целых чисел Python могут сопоставляться с одним значением без переполнения. Например, и ``255``, и ``-1`` соответствуют однобайтовому буферу и устанавливают все его биты. Это соответствует типичному поведению C.

source: On success, return a read only :term:`named tuple`, that holds information about Python's internal representation of integers. See :data:`sys.int_info` for description of individual fields.
ru: В случае успеха верните кортеж с именем, доступный только для чтения, который содержит информацию о внутреннем представлении целых чисел в Python. См. :data:`sys.int_info` для описания отдельных полей.

source: On failure, return ``NULL`` with an exception set.
es_es: En caso de fallo, devuelve ``NULL`` con un conjunto de excepciones.
ru: В случае неудачи верните NULL с установленным исключением.

source: Return 1 if *op* is compact, 0 otherwise.
es_es: Devuelve 1 si *op* es compacto, 0 en caso contrario.
ru: Возвращает 1, если *op* компактен, в противном случае — 0.

source: This function makes it possible for performance-critical code to implement a “fast path” for small integers. For compact values use :c:func:`PyUnstable_Long_CompactValue`; for others fall back to a :c:func:`PyLong_As* <PyLong_AsSize_t>` function or :c:func:`PyLong_AsNativeBytes`.
ru: Эта функция позволяет коду, критическому к производительности, реализовать «быстрый путь» для небольших целых чисел. Для компактных значений используйте :c:func:`PyUnstable_Long_CompactValue`; для других используйте функцию :c:func:`PyLong_As* <PyLong_AsSize_t>` или :c:func:`PyLong_AsNativeBytes`.

source: The speedup is expected to be negligible for most users.
es_es: Se espera que el aumento de velocidad sea insignificante para la mayoría de los usuarios.
ru: Ожидается, что для большинства пользователей ускорение будет незначительным.

source: Exactly what values are considered compact is an implementation detail and is subject to change.
es_es: Qué valores se consideran compactos es un detalle de implementación y está sujeto a cambios.
ru: То, какие именно значения считаются компактными, является деталью реализации и может быть изменено.

source: If *op* is compact, as determined by :c:func:`PyUnstable_Long_IsCompact`, return its value.
es_es: Si *op* es compacto, tal y como determina :c:func:`PyUnstable_Long_IsCompact`, devuelve su valor.
ru: Если *op* компактен, как определено :c:func:`PyUnstable_Long_IsCompact`, верните его значение.

source: Otherwise, the return value is undefined.
es_es: En caso contrario, el valor de retorno es indefinido.
ru: В противном случае возвращаемое значение не определено.

source: object
es_es: objeto
ru: объект

source: long integer
es_es: entero largo
ru: длинное целое число

source: integer
es_es: entero
ru: целое число

source: LONG_MAX (C macro)
es_es: LONG_MAX (macro C)
ru: LONG_MAX (C макрос)

source: OverflowError (built-in exception)
es_es: OverflowError (excepción incorporada)
ru: OverflowError (встроенное исключение )

source: PY_SSIZE_T_MAX (C macro)
es_es: PY_SSIZE_T_MAX (macro C)
ru: PY_SSIZE_T_MAX (C макрос)

source: ULONG_MAX (C macro)
es_es: ULONG_MAX (macro C)
ru: ULONG_MAX (C макрос)

source: SIZE_MAX (C macro)
es_es: SIZE_MAX (macro C)
ru: SIZE_MAX (C макрос)

source: This function makes it possible for performance-critical code to implement a “fast path” for small integers. For compact values use :c:func:`PyUnstable_Long_CompactValue`; for others fall back to a :c:func:`PyLong_As* <PyLong_AsSize_t>` function or :c:func:`calling <PyObject_CallMethod>` :meth:`int.to_bytes`.
es_es: Esta función hace posible que el código de rendimiento crítico implemente una “fast path” para enteros pequeños. Para valores compactos utilice :c:func:`PyUnstable_Long_CompactValue`; para otros recurra a una función :c:func:`PyLong_As* <PyLong_AsSize_t>` function or :c:func:`calling <PyObject_CallMethod>` :meth:`int.to_bytes` .

source: Return a new :c:type:`PyLongObject` object from a C :c:type:`unsigned long`, or ``NULL`` on failure.
uk: Повертає новий об’єкт :c:type:`PyLongObject` із C :c:type:`unsigned long` або ``NULL`` у разі помилки.

source: Return a new :c:type:`PyLongObject` object from a C :c:type:`long long`, or ``NULL`` on failure.
uk: Повертає новий об’єкт :c:type:`PyLongObject` із C :c:type:`long long` або ``NULL`` у разі помилки.

source: Return a new :c:type:`PyLongObject` object from a C :c:type:`unsigned long long`, or ``NULL`` on failure.
uk: Повертає новий об’єкт :c:type:`PyLongObject` із C :c:type:`unsigned long long` або ``NULL`` у разі помилки.

source: Return a new :c:type:`PyLongObject` based on the string value in *str*, which is interpreted according to the radix in *base*. If *pend* is non-``NULL``, *\*pend* will point to the first character in *str* which follows the representation of the number. If *base* is ``0``, *str* is interpreted using the :ref:`integers` definition; in this case, leading zeros in a non-zero decimal number raises a :exc:`ValueError`. If *base* is not ``0``, it must be between ``2`` and ``36``, inclusive. Leading spaces and single underscores after a base specifier and between digits are ignored. If there are no digits, :exc:`ValueError` will be raised.
uk: Повертає новий :c:type:`PyLongObject` на основі значення рядка в *str*, яке інтерпретується відповідно до основи в *base*. Якщо *pend* не є ``NULL``, *\*pend* вказуватиме на перший символ у *str*, який слідує за представленням числа. Якщо *base* дорівнює ``0``, *str* інтерпретується за допомогою визначення :ref:`integers`; у цьому випадку нулі на початку ненульового десяткового числа викликають :exc:`ValueError`. Якщо *база* не дорівнює ``0``, вона має бути між ``2`` і ``36`` включно. Початкові пробіли та одинарне підкреслення після базового специфікатора та між цифрами ігноруються. Якщо цифр немає, буде викликано :exc:`ValueError`.

source: Raise :exc:`OverflowError` if the value of *obj* is out of range for a :c:type:`long`.
uk: Викликати :exc:`OverflowError`, якщо значення *obj* виходить за межі діапазону для :c:type:`long`.

source: Use :meth:`__index__` if available.
uk: Використовуйте :meth:`__index__`, якщо доступний.

source: If the value of *obj* is greater than :const:`LONG_MAX` or less than :const:`LONG_MIN`, set *\*overflow* to ``1`` or ``-1``, respectively, and return ``-1``; otherwise, set *\*overflow* to ``0``. If any other exception occurs set *\*overflow* to ``0`` and return ``-1`` as usual.
uk: Якщо значення *obj* більше за :const:`LONG_MAX` або менше за :const:`LONG_MIN`, установіть для *\*overflow* значення ``1`` або ``-1`` відповідно та поверніть ``-1``; інакше встановіть *\*overflow* на ``0``. Якщо виникає будь-який інший виняток, встановіть *\*overflow* на ``0`` і поверніть ``-1``, як зазвичай.

source: Raise :exc:`OverflowError` if the value of *obj* is out of range for a :c:type:`long long`.
uk: Викликати :exc:`OverflowError`, якщо значення *obj* виходить за межі діапазону для :c:type:`long long`.

source: If the value of *obj* is greater than :const:`LLONG_MAX` or less than :const:`LLONG_MIN`, set *\*overflow* to ``1`` or ``-1``, respectively, and return ``-1``; otherwise, set *\*overflow* to ``0``. If any other exception occurs set *\*overflow* to ``0`` and return ``-1`` as usual.
uk: Якщо значення *obj* більше за :const:`LLONG_MAX` або менше за :const:`LLONG_MIN`, установіть для *\*overflow* значення ``1`` або ``-1`` відповідно та поверніть ``-1``; інакше встановіть *\*overflow* на ``0``. Якщо виникає будь-який інший виняток, встановіть *\*overflow* на ``0`` і поверніть ``-1``, як зазвичай.

source: Return a C :c:type:`unsigned long` representation of *pylong*. *pylong* must be an instance of :c:type:`PyLongObject`.
uk: Повертає C :c:type:`unsigned long` представлення *pylong*. *pylong* має бути екземпляром :c:type:`PyLongObject`.

source: Raise :exc:`OverflowError` if the value of *pylong* is out of range for a :c:type:`unsigned long`.
uk: Викликати :exc:`OverflowError`, якщо значення *pylong* виходить за межі діапазону для :c:type:`unsigned long`.

source: Return a C :c:type:`unsigned long long` representation of *pylong*. *pylong* must be an instance of :c:type:`PyLongObject`.
uk: Повертає C :c:type:`unsigned long long` представлення *pylong*. *pylong* має бути екземпляром :c:type:`PyLongObject`.

source: Raise :exc:`OverflowError` if the value of *pylong* is out of range for an :c:type:`unsigned long long`.
uk: Викликайте :exc:`OverflowError`, якщо значення *pylong* виходить за межі діапазону для :c:type:`unsigned long long`.

source: If the value of *obj* is out of range for an :c:type:`unsigned long`, return the reduction of that value modulo ``ULONG_MAX + 1``.
uk: Якщо значення *obj* виходить за межі діапазону для :c:type:`unsigned long`, поверніть зменшення цього значення за модулем ``ULONG_MAX + 1``.

source: If the value of *obj* is out of range for an :c:type:`unsigned long long`, return the reduction of that value modulo ``ULLONG_MAX + 1``.
uk: Якщо значення *obj* виходить за межі діапазону для :c:type:`unsigned long long`, поверніть зменшення цього значення за модулем ``ULLONG_MAX + 1``.

source: Return a C :c:type:`double` representation of *pylong*. *pylong* must be an instance of :c:type:`PyLongObject`.
uk: Повертає C :c:type:`double` представлення *pylong*. *pylong* має бути екземпляром :c:type:`PyLongObject`.

source: Raise :exc:`OverflowError` if the value of *pylong* is out of range for a :c:type:`double`.
uk: Викликайте :exc:`OverflowError`, якщо значення *pylong* виходить за межі діапазону для :c:type:`double`.

source: Convert a Python integer *pylong* to a C :c:type:`void` pointer. If *pylong* cannot be converted, an :exc:`OverflowError` will be raised. This is only assured to produce a usable :c:type:`void` pointer for values created with :c:func:`PyLong_FromVoidPtr`.
uk: Перетворіть ціле число Python *pylong* на покажчик C :c:type:`void`. Якщо *pylong* не можна перетворити, буде викликано :exc:`OverflowError`. Це гарантовано лише для створення придатного для використання покажчика :c:type:`void` для значень, створених за допомогою :c:func:`PyLong_FromVoidPtr`.
