Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/mapping.po
Languages: ru

source: Mapping Protocol
ru: Протокол сопоставления

source: See also :c:func:`PyObject_GetItem`, :c:func:`PyObject_SetItem` and :c:func:`PyObject_DelItem`.
ru: См. также :c:func:` PyObj ect_GetItem`, :c:func:` PyObj ect_SetItem` и :c:func:` PyObj ect_DelItem`.

source: Return ``1`` if the object provides the mapping protocol or supports slicing, and ``0`` otherwise. Note that it returns ``1`` for Python classes with a :meth:`~object.__getitem__` method, since in general it is impossible to determine what type of keys the class supports. This function always succeeds.
ru: Возвращайте ``1``, если объект предоставляет протокол сопоставления или поддерживает нарезку, и ``0`` в противном случае. Обратите внимание, что он возвращает ``1`` для классов Python с помощью метода :meth:`~object.__getitem__`, поскольку в целом невозможно определить, какой тип ключей поддерживает класс. Эта функция всегда завершается успешно.

source: Returns the number of keys in object *o* on success, and ``-1`` on failure. This is equivalent to the Python expression ``len(o)``.
ru: Возвращает количество ключей в объекте *o* в случае успеха и ``-1`` в случае неудачи. Это эквивалентно выражению Python ``len(o)``.

source: This is the same as :c:func:`PyObject_GetItem`, but *key* is specified as a :c:expr:`const char*` UTF-8 encoded bytes string, rather than a :c:expr:`PyObject*`.
ru: Это то же самое, что и :c:func:` PyObj ect_GetItem`, но *key* указывается как :c:expr:`const char*` строка байтов в кодировке UTF-8, а не как :c:expr:` PyObj т. д. *`.

source: Variant of :c:func:`PyObject_GetItem` which doesn't raise :exc:`KeyError` if the key is not found.
ru: Вариант :c:func:` PyObj ect_GetItem`, который не вызывает :exc:`KeyError`, если ключ не найден.

source: If the key is found, return ``1`` and set *\*result* to a new :term:`strong reference` to the corresponding value. If the key is not found, return ``0`` and set *\*result* to ``NULL``; the :exc:`KeyError` is silenced. If an error other than :exc:`KeyError` is raised, return ``-1`` and set *\*result* to ``NULL``.
ru: Если ключ найден, верните ``1`` и установите *\*result* в новую :term:`strong ссылку` на соответствующее значение. Если ключ не найден, верните ``0`` и установите для *\*result* значение ``NULL``; :exc:`KeyError` отключен. Если возникает ошибка, отличная от :exc:`KeyError`, верните ``-1`` и установите для *\*result* значение ``NULL``.

source: This is the same as :c:func:`PyMapping_GetOptionalItem`, but *key* is specified as a :c:expr:`const char*` UTF-8 encoded bytes string, rather than a :c:expr:`PyObject*`.
ru: Это то же самое, что и :c:func:`PyMapping_GetOptionalItem`, но *key* указывается как :c:expr:`const char*` строка байтов в кодировке UTF-8, а не как :c:expr:` PyObj ect. *`.

source: This is the same as :c:func:`PyObject_SetItem`, but *key* is specified as a :c:expr:`const char*` UTF-8 encoded bytes string, rather than a :c:expr:`PyObject*`.
ru: Это то же самое, что и :c:func:` PyObj ect_SetItem`, но *key* указывается как :c:expr:`const char*` строка байтов в кодировке UTF-8, а не как :c:expr:` PyObj т. д. *`.

source: This is an alias of :c:func:`PyObject_DelItem`.
ru: Это псевдоним :c:func:` PyObj ect_DelItem`.

source: This is the same as :c:func:`PyObject_DelItem`, but *key* is specified as a :c:expr:`const char*` UTF-8 encoded bytes string, rather than a :c:expr:`PyObject*`.
ru: Это то же самое, что и :c:func:` PyObj ect_DelItem`, но *key* указывается как :c:expr:`const char*` строка байтов в кодировке UTF-8, а не как :c:expr:` PyObj т. д. *`.

source: Return ``1`` if the mapping object has the key *key* and ``0`` otherwise. This is equivalent to the Python expression ``key in o``. On failure, return ``-1``.
ru: Возвращайте ``1``, если объект сопоставления имеет ключ *key*, и ``0`` в противном случае. Это эквивалентно выражению Python ``key in o``. В случае неудачи верните ``-1``.

source: This is the same as :c:func:`PyMapping_HasKeyWithError`, but *key* is specified as a :c:expr:`const char*` UTF-8 encoded bytes string, rather than a :c:expr:`PyObject*`.
ru: Это то же самое, что и :c:func:`PyMapping_HasKeyWithError`, но *key* указывается как :c:expr:`const char*` строка байтов в кодировке UTF-8, а не как :c:expr:` PyObj ect. *`.

source: Return ``1`` if the mapping object has the key *key* and ``0`` otherwise. This is equivalent to the Python expression ``key in o``. This function always succeeds.
ru: Возвращайте ``1``, если объект сопоставления имеет ключ *key*, и ``0`` в противном случае. Это эквивалентно выражению Python ``key in o``. Эта функция всегда завершается успешно.

source: Exceptions which occur when this calls :meth:`~object.__getitem__` method are silently ignored. For proper error handling, use :c:func:`PyMapping_HasKeyWithError`, :c:func:`PyMapping_GetOptionalItem` or :c:func:`PyObject_GetItem()` instead.
ru: Исключения, возникающие при вызове метода :meth:`~object.__getitem__`, игнорируются. Для правильной обработки ошибок используйте вместо этого :c:func:`PyMapping_HasKeyWithError`, :c:func:`PyMapping_GetOptionalItem` или :c:func:` PyObj ect_GetItem()`.

source: This is the same as :c:func:`PyMapping_HasKey`, but *key* is specified as a :c:expr:`const char*` UTF-8 encoded bytes string, rather than a :c:expr:`PyObject*`.
ru: Это то же самое, что и :c:func:`PyMapping_HasKey`, но *key* указывается как :c:expr:`const char*` строка байтов в кодировке UTF-8, а не как :c:expr:` PyObject . *`.

source: Exceptions that occur when this calls :meth:`~object.__getitem__` method or while creating the temporary :class:`str` object are silently ignored. For proper error handling, use :c:func:`PyMapping_HasKeyStringWithError`, :c:func:`PyMapping_GetOptionalItemString` or :c:func:`PyMapping_GetItemString` instead.
ru: Исключения, возникающие при вызове метода :meth:`~object.__getitem__` или при создании временного объекта :class:`str`, молча игнорируются. Для правильной обработки ошибок используйте вместо этого :c:func:`PyMapping_HasKeyStringWithError`, :c:func:`PyMapping_GetOptionalItemString` или :c:func:`PyMapping_GetItemString`.

source: On success, return a list of the keys in object *o*. On failure, return ``NULL``.
ru: В случае успеха вернуть список ключей в объекте *o*. В случае неудачи верните ``NULL``.

source: Previously, the function returned a list or a tuple.
ru: Раньше функция возвращала список или кортеж.

source: On success, return a list of the values in object *o*. On failure, return ``NULL``.
ru: В случае успеха верните список значений объекта *o*. В случае неудачи верните ``NULL``.

source: On success, return a list of the items in object *o*, where each item is a tuple containing a key-value pair. On failure, return ``NULL``.
ru: В случае успеха верните список элементов в объекте *o*, где каждый элемент представляет собой кортеж, содержащий пару ключ-значение. В случае неудачи верните ``NULL``.

source: built-in function
ru: встроенная функция
