Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/marshal.po
Languages: es_es, ru

source: Data marshalling support
es_es: Soporte para la transferencia de datos
ru: Поддержка маршалинга данных

source: These routines allow C code to work with serialized objects using the same data format as the :mod:`marshal` module. There are functions to write data into the serialization format, and additional functions that can be used to read the data back. Files used to store marshalled data must be opened in binary mode.
es_es: Estas rutinas permiten al código C trabajar con objetos serializados utilizando el mismo formato de datos que el módulo :mod:`marshal`. Existen funciones para escribir datos en el formato de serialización, y funciones adicionales que pueden utilizarse para leer los datos de vuelta. Los archivos utilizados para almacenar datos marshalled deben abrirse en modo binario.
ru: Эти процедуры позволяют коду C работать с сериализованными объектами, используя тот же формат данных, что и модуль :mod:`marshal`. Существуют функции для записи данных в формат сериализации и дополнительные функции, которые можно использовать для обратного чтения данных. Файлы, используемые для хранения маршаллированных данных, должны открываться в двоичном режиме.

source: Numeric values are stored with the least significant byte first.
es_es: Los valores numéricos se almacenan con el byte menos significativo primero.
ru: Числовые значения сохраняются начиная с младшего байта.

source: The module supports two versions of the data format: version 0 is the historical version, version 1 shares interned strings in the file, and upon unmarshalling. Version 2 uses a binary format for floating-point numbers. ``Py_MARSHAL_VERSION`` indicates the current file format (currently 2).
ru: Модуль поддерживает две версии формата данных: версия 0 — историческая версия, версия 1 — совместно используемые строки в файле и при демаршаллинге. Версия 2 использует двоичный формат для чисел с плавающей запятой. ``Py_MARSHAL_VERSION`` указывает текущий формат файла (в настоящее время 2).

source: Marshal a :c:expr:`long` integer, *value*, to *file*. This will only write the least-significant 32 bits of *value*; regardless of the size of the native :c:expr:`long` type. *version* indicates the file format.
ru: Маршалирует целое число :c:expr:`long`, *значение*, в *файл*. При этом будут записаны только наименее значимые 32 бита *значения*; независимо от размера собственного типа :c:expr:`long`. *версия* указывает формат файла.

source: This function can fail, in which case it sets the error indicator. Use :c:func:`PyErr_Occurred` to check for that.
es_es: Esta función puede fallar, en cuyo caso establece el indicador de error. Usar :c:func:`PyErr_Occurred` para comprobarlo.
ru: Эта функция может дать сбой, и в этом случае она устанавливает индикатор ошибки. Используйте :c:func:`PyErr_Occurred`, чтобы проверить это.

source: Marshal a Python object, *value*, to *file*. *version* indicates the file format.
es_es: Transfiere un objeto Python, *valor*, a *archivo*. *versión* indica el formato del fichero.
ru: Маршалирует объект Python *value* в *file*. *версия* указывает формат файла.

source: Return a bytes object containing the marshalled representation of *value*. *version* indicates the file format.
es_es: Devuelve un objeto bytes que contiene la representación marshalled de *value*. *version* indica el formato del fichero.
ru: Возвращает объект bytes, содержащий маршаллированное представление *value*. *версия* указывает формат файла.

source: The following functions allow marshalled values to be read back in.
es_es: Las siguientes funciones permiten volver a leer los valores marshalled.
ru: Следующие функции позволяют считывать обратно маршалированные значения.

source: Return a C :c:expr:`long` from the data stream in a :c:expr:`FILE*` opened for reading. Only a 32-bit value can be read in using this function, regardless of the native size of :c:expr:`long`.
ru: Возвращает C :c:expr:`long` из потока данных в :c:expr:`FILE*`, открытом для чтения. С помощью этой функции можно прочитать только 32-битное значение, независимо от собственного размера :c:expr:`long`.

source: On error, sets the appropriate exception (:exc:`EOFError`) and returns ``-1``.
es_es: En caso de error, establece la excepción correspondiente (:exc:`EOFError`) y devuelve ``-1``.
ru: В случае ошибки устанавливает соответствующее исключение (:exc:`EOFError`) и возвращает ``-1``.

source: Return a C :c:expr:`short` from the data stream in a :c:expr:`FILE*` opened for reading. Only a 16-bit value can be read in using this function, regardless of the native size of :c:expr:`short`.
ru: Возвращает C :c:expr:`short` из потока данных в :c:expr:`FILE*`, открытом для чтения. С помощью этой функции можно прочитать только 16-битное значение, независимо от собственного размера :c:expr:`short`.

source: Return a Python object from the data stream in a :c:expr:`FILE*` opened for reading.
ru: Возвращает объект Python из потока данных в :c:expr:`FILE*`, открытом для чтения.

source: On error, sets the appropriate exception (:exc:`EOFError`, :exc:`ValueError` or :exc:`TypeError`) and returns ``NULL``.
es_es: En caso de error, fija la excepción apropiada (:exc:`EOFError`, :exc:`ValueError` o :exc:`TypeError`) y devuelve ``NULL``.
ru: В случае ошибки устанавливает соответствующее исключение (:exc:`EOFError`, :exc:`ValueError` или :exc:`TypeError`) и возвращает ``NULL``.

source: Return a Python object from the data stream in a :c:expr:`FILE*` opened for reading. Unlike :c:func:`PyMarshal_ReadObjectFromFile`, this function assumes that no further objects will be read from the file, allowing it to aggressively load file data into memory so that the de-serialization can operate from data in memory rather than reading a byte at a time from the file. Only use these variant if you are certain that you won't be reading anything else from the file.
ru: Возвращает объект Python из потока данных в :c:expr:`FILE*`, открытом для чтения. В отличие от :c:func:`PyMarshal_ReadObjectFromFile`, эта функция предполагает, что никакие дальнейшие объекты не будут считываться из файла, что позволяет ей агрессивно загружать данные файла в память, чтобы десериализация могла работать с данными в памяти, а не с чтением байта. одновременно из файла. Используйте этот вариант только в том случае, если вы уверены, что больше ничего не будете читать из файла.

source: Return a Python object from the data stream in a byte buffer containing *len* bytes pointed to by *data*.
es_es: Devuelve un objeto Python del flujo de datos en un buffer de bytes que contiene *len* bytes apuntados por *data*.
ru: Возвращает объект Python из потока данных в байтовом буфере, содержащем *len* байт, на который указывает *data*.
