Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/memory.po
Languages: ru

source: Memory Management
ru: Управление памятью

source: Overview
ru: Обзор

source: Memory management in Python involves a private heap containing all Python objects and data structures. The management of this private heap is ensured internally by the *Python memory manager*. The Python memory manager has different components which deal with various dynamic storage management aspects, like sharing, segmentation, preallocation or caching.
ru: Управление памятью в Python включает в себя частную кучу, содержащую все объекты Python и структуры данных. Управление этой частной кучей осуществляется изнутри *менеджером памяти Python*. Диспетчер памяти Python имеет различные компоненты, которые отвечают за различные аспекты динамического управления хранилищем, такие как совместное использование, сегментация, предварительное выделение или кэширование.

source: At the lowest level, a raw memory allocator ensures that there is enough room in the private heap for storing all Python-related data by interacting with the memory manager of the operating system. On top of the raw memory allocator, several object-specific allocators operate on the same heap and implement distinct memory management policies adapted to the peculiarities of every object type. For example, integer objects are managed differently within the heap than strings, tuples or dictionaries because integers imply different storage requirements and speed/space tradeoffs. The Python memory manager thus delegates some of the work to the object-specific allocators, but ensures that the latter operate within the bounds of the private heap.
ru: На самом низком уровне необработанный распределитель памяти гарантирует, что в частной куче достаточно места для хранения всех данных, связанных с Python, путем взаимодействия с диспетчером памяти операционной системы. Помимо необработанного распределителя памяти, несколько объектно-ориентированных распределителей работают в одной куче и реализуют различные политики управления памятью, адаптированные к особенностям каждого типа объекта. Например, целочисленные объекты в куче управляются иначе, чем строки, кортежи или словари, поскольку целые числа подразумевают другие требования к хранению и компромиссы между скоростью и пространством. Таким образом, диспетчер памяти Python делегирует часть работы объектно-ориентированным распределителям, но гарантирует, что последние работают в пределах частной кучи.

source: It is important to understand that the management of the Python heap is performed by the interpreter itself and that the user has no control over it, even if they regularly manipulate object pointers to memory blocks inside that heap. The allocation of heap space for Python objects and other internal buffers is performed on demand by the Python memory manager through the Python/C API functions listed in this document.
ru: Важно понимать, что управление кучей Python осуществляет сам интерпретатор и что пользователь не имеет над ней контроля, даже если он регулярно манипулирует указателями объектов на блоки памяти внутри этой кучи. Выделение кучи для объектов Python и других внутренних буферов выполняется по требованию диспетчером памяти Python с помощью функций API Python/C, перечисленных в этом документе.

source: To avoid memory corruption, extension writers should never try to operate on Python objects with the functions exported by the C library: :c:func:`malloc`, :c:func:`calloc`, :c:func:`realloc` and :c:func:`free`. This will result in mixed calls between the C allocator and the Python memory manager with fatal consequences, because they implement different algorithms and operate on different heaps. However, one may safely allocate and release memory blocks with the C library allocator for individual purposes, as shown in the following example::
ru: Чтобы избежать повреждения памяти, авторам расширений никогда не следует пытаться работать с объектами Python с помощью функций, экспортируемых библиотекой C: :c:func:`malloc`, :c:func:`calloc`, :c:func:`realloc` и :c:func:`free`. Это приведет к смешанным вызовам между распределителем C и диспетчером памяти Python с фатальными последствиями, поскольку они реализуют разные алгоритмы и работают с разными кучами. Однако можно безопасно выделять и освобождать блоки памяти с помощью распределителя библиотеки C для индивидуальных целей, как показано в следующем примере:

source: In this example, the memory request for the I/O buffer is handled by the C library allocator. The Python memory manager is involved only in the allocation of the bytes object returned as a result.
ru: В этом примере запрос памяти для буфера ввода-вывода обрабатывается распределителем библиотеки C. Диспетчер памяти Python участвует только в выделении возвращаемого в результате объекта байтов.

source: In most situations, however, it is recommended to allocate memory from the Python heap specifically because the latter is under control of the Python memory manager. For example, this is required when the interpreter is extended with new object types written in C. Another reason for using the Python heap is the desire to *inform* the Python memory manager about the memory needs of the extension module. Even when the requested memory is used exclusively for internal, highly specific purposes, delegating all memory requests to the Python memory manager causes the interpreter to have a more accurate image of its memory footprint as a whole. Consequently, under certain circumstances, the Python memory manager may or may not trigger appropriate actions, like garbage collection, memory compaction or other preventive procedures. Note that by using the C library allocator as shown in the previous example, the allocated memory for the I/O buffer escapes completely the Python memory manager.
ru: Однако в большинстве ситуаций рекомендуется выделять память из кучи Python именно потому, что последняя находится под контролем диспетчера памяти Python. Например, это требуется, когда интерпретатор расширяется новыми типами объектов, написанными на C. Другой причиной использования кучи Python является желание *информировать* менеджер памяти Python о потребностях модуля расширения в памяти. Даже когда запрошенная память используется исключительно для внутренних, весьма специфических целей, делегирование всех запросов к памяти диспетчеру памяти Python приводит к тому, что интерпретатор получает более точное представление о своем объеме памяти в целом. Следовательно, при определенных обстоятельствах диспетчер памяти Python может запускать или не запускать соответствующие действия, такие как сбор мусора, сжатие памяти или другие профилактические процедуры. Обратите внимание, что при использовании распределителя библиотеки C, как показано в предыдущем примере, выделенная память для буфера ввода-вывода полностью выходит за рамки диспетчера памяти Python.

source: The :envvar:`PYTHONMALLOC` environment variable can be used to configure the memory allocators used by Python.
ru: Переменная среды :envvar:`PYTHONMALLOC` может использоваться для настройки распределителей памяти, используемых Python.

source: The :envvar:`PYTHONMALLOCSTATS` environment variable can be used to print statistics of the :ref:`pymalloc memory allocator <pymalloc>` every time a new pymalloc object arena is created, and on shutdown.
ru: Переменную среды :envvar:`PYTHONMALLOCSTATS` можно использовать для печати статистики :ref:`распределителя памяти pymalloc <pymalloc>` каждый раз, когда создается новая арена объекта pymalloc, а также при завершении работы.

source: Allocator Domains
ru: Домены распределителя

source: All allocating functions belong to one of three different "domains" (see also :c:type:`PyMemAllocatorDomain`). These domains represent different allocation strategies and are optimized for different purposes. The specific details on how every domain allocates memory or what internal functions each domain calls is considered an implementation detail, but for debugging purposes a simplified table can be found at :ref:`here <default-memory-allocators>`. The APIs used to allocate and free a block of memory must be from the same domain. For example, :c:func:`PyMem_Free` must be used to free memory allocated using :c:func:`PyMem_Malloc`.
ru: Все функции распределения принадлежат одному из трех разных «доменов» (см. также :c:type:`PyMemAllocatorDomain`). Эти домены представляют разные стратегии распределения и оптимизированы для разных целей. Конкретные подробности о том, как каждый домен распределяет память или какие внутренние функции вызывает каждый домен, считаются деталями реализации, но для целей отладки упрощенную таблицу можно найти по адресу :ref:`здесь <default-memory-allocators>`. API, используемые для выделения и освобождения блока памяти, должны находиться в одном домене. Например, :c:func:`PyMem_Free` необходимо использовать для освобождения памяти, выделенной с помощью :c:func:`PyMem_Malloc`.

source: The three allocation domains are:
ru: Три домена распределения:

source: Raw domain: intended for allocating memory for general-purpose memory buffers where the allocation *must* go to the system allocator or where the allocator can operate without the :term:`GIL`. The memory is requested directly from the system. See :ref:`Raw Memory Interface <raw-memoryinterface>`.
ru: Необработанный домен: предназначен для выделения памяти для буферов памяти общего назначения, где выделение *должно* идти системному распределителю или где распределитель может работать без :term:`GIL`. Память запрашивается напрямую из системы. См. :ref:`Интерфейс необработанной памяти <raw-memoryinterface>`.

source: "Mem" domain: intended for allocating memory for Python buffers and general-purpose memory buffers where the allocation must be performed with the :term:`GIL` held. The memory is taken from the Python private heap. See :ref:`Memory Interface <memoryinterface>`.
ru: Домен «Mem»: предназначен для выделения памяти для буферов Python и буферов памяти общего назначения, где выделение должно выполняться с удержанием :term:`GIL`. Память берется из частной кучи Python. См. :ref:`Интерфейс памяти <memoryinterface>`.

source: Object domain: intended for allocating memory for Python objects. The memory is taken from the Python private heap. See :ref:`Object allocators <objectinterface>`.
ru: Объектный домен: предназначен для выделения памяти для объектов Python. Память берется из частной кучи Python. См. :ref:`Распределители объектов <objectinterface>`.

source: The :term:`free-threaded <free threading>` build requires that only Python objects are allocated using the "object" domain and that all Python objects are allocated using that domain. This differs from the prior Python versions, where this was only a best practice and not a hard requirement.
ru: Сборка :term:`free-threaded <free threading>` требует, чтобы только объекты Python выделялись с использованием домена «object» и чтобы все объекты Python размещались с использованием этого домена. Это отличается от предыдущих версий Python, где это было лишь рекомендуемой практикой, а не жестким требованием.

source: For example, buffers (non-Python objects) should be allocated using :c:func:`PyMem_Malloc`, :c:func:`PyMem_RawMalloc`, or :c:func:`malloc`, but not :c:func:`PyObject_Malloc`.
ru: Например, буферы (не-Python-объекты) следует выделять с помощью :c:func:`PyMem_Malloc`, :c:func:`PyMem_RawMalloc` или :c:func:`malloc`, но не :c:func:` PyObject_Malloc`.

source: See :ref:`Memory Allocation APIs <free-threaded-memory-allocation>`.
ru: См. :ref:`API распределения памяти <free-threaded-memory-allocation>`.

source: Raw Memory Interface
ru: Интерфейс необработанной памяти

source: The following function sets are wrappers to the system allocator. These functions are thread-safe, the :term:`GIL <global interpreter lock>` does not need to be held.
ru: Следующие наборы функций являются оболочками системного распределителя. Эти функции потокобезопасны, поэтому GIL <глобальная блокировка интерпретатора> удерживать не требуется.

source: The :ref:`default raw memory allocator <default-memory-allocators>` uses the following functions: :c:func:`malloc`, :c:func:`calloc`, :c:func:`realloc` and :c:func:`!free`; call ``malloc(1)`` (or ``calloc(1, 1)``) when requesting zero bytes.
ru: Распределитель необработанной памяти по умолчанию <default-memory-allocators>` использует следующие функции: :c:func:`malloc`, :c:func:`calloc`, :c:func:`realloc` и : c:func:`!free`; вызовите ``malloc(1)`` (или ``calloc(1, 1)``) при запросе нулевых байтов.

source: Allocates *n* bytes and returns a pointer of type :c:expr:`void*` to the allocated memory, or ``NULL`` if the request fails.
ru: Выделяет *n* байтов и возвращает указатель типа :c:expr:`void*` на выделенную память или ``NULL``, если запрос не выполнен.

source: Requesting zero bytes returns a distinct non-``NULL`` pointer if possible, as if ``PyMem_RawMalloc(1)`` had been called instead. The memory will not have been initialized in any way.
ru: Запрос нулевых байтов возвращает отдельный указатель, отличный от NULL, если это возможно, как если бы вместо этого был вызван PyMem_RawMalloc(1)``. Память не будет инициализирована каким-либо образом.

source: Allocates *nelem* elements each whose size in bytes is *elsize* and returns a pointer of type :c:expr:`void*` to the allocated memory, or ``NULL`` if the request fails. The memory is initialized to zeros.
ru: Выделяет элементы *nelem*, размер каждого из которых в байтах равен *elsize*, и возвращает указатель типа :c:expr:`void*` на выделенную память или ``NULL``, если запрос не выполнен. Память инициализируется нулями.

source: Requesting zero elements or elements of size zero bytes returns a distinct non-``NULL`` pointer if possible, as if ``PyMem_RawCalloc(1, 1)`` had been called instead.
ru: Запрос нулевых элементов или элементов размером нуль байт возвращает отдельный указатель, отличный от NULL, если это возможно, как если бы вместо этого был вызван PyMem_RawCalloc(1, 1)``.

source: Resizes the memory block pointed to by *p* to *n* bytes. The contents will be unchanged to the minimum of the old and the new sizes.
ru: Изменяет размер блока памяти, на который указывает *p*, до *n* байт. Содержимое не изменится до минимума старого и нового размеров.

source: If *p* is ``NULL``, the call is equivalent to ``PyMem_RawMalloc(n)``; else if *n* is equal to zero, the memory block is resized but is not freed, and the returned pointer is non-``NULL``.
ru: Если *p* равно NULL, вызов эквивалентен PyMem_RawMalloc(n)``; в противном случае, если *n* равно нулю, размер блока памяти изменяется, но не освобождается, а возвращаемый указатель не равен NULL.

source: Unless *p* is ``NULL``, it must have been returned by a previous call to :c:func:`PyMem_RawMalloc`, :c:func:`PyMem_RawRealloc` or :c:func:`PyMem_RawCalloc`.
ru: Если *p* не равно ``NULL``, оно должно быть возвращено предыдущим вызовом :c:func:`PyMem_RawMalloc`, :c:func:`PyMem_RawRealloc` или :c:func:`PyMem_RawCalloc`.

source: If the request fails, :c:func:`PyMem_RawRealloc` returns ``NULL`` and *p* remains a valid pointer to the previous memory area.
ru: Если запрос завершается неудачей, :c:func:`PyMem_RawRealloc` возвращает ``NULL`` и *p* остается действительным указателем на предыдущую область памяти.

source: Frees the memory block pointed to by *p*, which must have been returned by a previous call to :c:func:`PyMem_RawMalloc`, :c:func:`PyMem_RawRealloc` or :c:func:`PyMem_RawCalloc`. Otherwise, or if ``PyMem_RawFree(p)`` has been called before, undefined behavior occurs.
ru: Освобождает блок памяти, на который указывает *p*, который должен был быть возвращен предыдущим вызовом :c:func:`PyMem_RawMalloc`, :c:func:`PyMem_RawRealloc` или :c:func:`PyMem_RawCalloc`. В противном случае или если PyMem_RawFree(p) был вызван ранее, произойдет неопределенное поведение.

source: If *p* is ``NULL``, no operation is performed.
ru: Если *p* равно NULL, никакая операция не выполняется.

source: Memory Interface
ru: Интерфейс памяти

source: The following function sets, modeled after the ANSI C standard, but specifying behavior when requesting zero bytes, are available for allocating and releasing memory from the Python heap.
ru: Следующие наборы функций, созданные по образцу стандарта ANSI C, но определяющие поведение при запросе нулевых байтов, доступны для выделения и освобождения памяти из кучи Python.

source: The :ref:`default memory allocator <default-memory-allocators>` uses the :ref:`pymalloc memory allocator <pymalloc>`.
ru: Распределитель памяти по умолчанию <default-memory-allocators>` использует распределитель памяти :ref:`pymalloc <pymalloc>`.

source: The :term:`GIL <global interpreter lock>` must be held when using these functions.
ru: При использовании этих функций должен сохраняться :term:`GIL <глобальная блокировка интерпретатора>`.

source: The default allocator is now pymalloc instead of system :c:func:`malloc`.
ru: Распределителем по умолчанию теперь является pymalloc вместо system :c:func:`malloc`.

source: Requesting zero bytes returns a distinct non-``NULL`` pointer if possible, as if ``PyMem_Malloc(1)`` had been called instead. The memory will not have been initialized in any way.
ru: Запрос нулевых байтов возвращает отдельный указатель, отличный от NULL, если это возможно, как если бы вместо этого был вызван PyMem_Malloc(1)``. Память не будет инициализирована каким-либо образом.

source: Requesting zero elements or elements of size zero bytes returns a distinct non-``NULL`` pointer if possible, as if ``PyMem_Calloc(1, 1)`` had been called instead.
ru: Запрос нулевых элементов или элементов размером нуль байт возвращает отдельный указатель, отличный от NULL, если это возможно, как если бы вместо этого был вызван PyMem_Calloc(1, 1)``.

source: If *p* is ``NULL``, the call is equivalent to ``PyMem_Malloc(n)``; else if *n* is equal to zero, the memory block is resized but is not freed, and the returned pointer is non-``NULL``.
ru: Если *p* равно ``NULL``, вызов эквивалентен ``PyMem_Malloc(n)``; в противном случае, если *n* равно нулю, размер блока памяти изменяется, но не освобождается, а возвращаемый указатель не равен NULL.

source: Unless *p* is ``NULL``, it must have been returned by a previous call to :c:func:`PyMem_Malloc`, :c:func:`PyMem_Realloc` or :c:func:`PyMem_Calloc`.
ru: Если *p* не равно ``NULL``, оно должно быть возвращено предыдущим вызовом :c:func:`PyMem_Malloc`, :c:func:`PyMem_Realloc` или :c:func:`PyMem_Calloc`.

source: If the request fails, :c:func:`PyMem_Realloc` returns ``NULL`` and *p* remains a valid pointer to the previous memory area.
ru: Если запрос завершается неудачей, :c:func:`PyMem_Realloc` возвращает ``NULL`` и *p* остается действительным указателем на предыдущую область памяти.

source: Frees the memory block pointed to by *p*, which must have been returned by a previous call to :c:func:`PyMem_Malloc`, :c:func:`PyMem_Realloc` or :c:func:`PyMem_Calloc`. Otherwise, or if ``PyMem_Free(p)`` has been called before, undefined behavior occurs.
ru: Освобождает блок памяти, на который указывает *p*, который должен был быть возвращен предыдущим вызовом :c:func:`PyMem_Malloc`, :c:func:`PyMem_Realloc` или :c:func:`PyMem_Calloc`. В противном случае или если PyMem_Free(p) был вызван ранее, произойдет неопределенное поведение.

source: The following type-oriented macros are provided for convenience. Note that *TYPE* refers to any C type.
ru: Для удобства предусмотрены следующие типизированные макросы. Обратите внимание, что *TYPE* ​​относится к любому типу C.

source: Same as :c:func:`PyMem_Malloc`, but allocates ``(n * sizeof(TYPE))`` bytes of memory. Returns a pointer cast to ``TYPE*``. The memory will not have been initialized in any way.
ru: То же, что :c:func:`PyMem_Malloc`, но выделяет ``(n * sizeof(TYPE))`` байт памяти. Возвращает указатель, приведенный к ``TYPE*``. Память не будет инициализирована каким-либо образом.

source: Same as :c:func:`PyMem_Realloc`, but the memory block is resized to ``(n * sizeof(TYPE))`` bytes. Returns a pointer cast to ``TYPE*``. On return, *p* will be a pointer to the new memory area, or ``NULL`` in the event of failure.
ru: То же, что и :c:func:`PyMem_Realloc`, но размер блока памяти изменяется до ``(n * sizeof(TYPE))`` байт. Возвращает указатель, приведенный к ``TYPE*``. При возврате *p* будет указателем на новую область памяти или NULL в случае сбоя.

source: This is a C preprocessor macro; *p* is always reassigned. Save the original value of *p* to avoid losing memory when handling errors.
ru: Это макрос препроцессора C; *p* всегда переназначается. Сохраните исходное значение *p*, чтобы избежать потери памяти при обработке ошибок.

source: Same as :c:func:`PyMem_Free`.
ru: То же, что :c:func:`PyMem_Free`.

source: In addition, the following macro sets are provided for calling the Python memory allocator directly, without involving the C API functions listed above. However, note that their use does not preserve binary compatibility across Python versions and is therefore deprecated in extension modules.
ru: Кроме того, предусмотрены следующие наборы макросов для прямого вызова распределителя памяти Python без использования функций C API, перечисленных выше. Однако обратите внимание, что их использование не обеспечивает двоичную совместимость между версиями Python и поэтому не рекомендуется в модулях расширения.

source: Object allocators
ru: Распределители объектов

source: There is no guarantee that the memory returned by these allocators can be successfully cast to a Python object when intercepting the allocating functions in this domain by the methods described in the :ref:`Customize Memory Allocators <customize-memory-allocators>` section.
ru: Нет никакой гарантии, что память, возвращаемая этими распределителями, может быть успешно преобразована в объект Python при перехвате функций выделения памяти в этом домене методами, описанными в разделе «Настройка распределителей памяти <customize-memory-allocators>».

source: The :ref:`default object allocator <default-memory-allocators>` uses the :ref:`pymalloc memory allocator <pymalloc>`.
ru: Распределитель объектов по умолчанию <default-memory-allocators>` использует распределитель памяти :ref:`pymalloc <pymalloc>`.

source: Requesting zero bytes returns a distinct non-``NULL`` pointer if possible, as if ``PyObject_Malloc(1)`` had been called instead. The memory will not have been initialized in any way.
ru: Запрос нулевых байтов возвращает отдельный указатель, отличный от NULL, если это возможно, как если бы вместо этого был вызван PyObject_Malloc(1)``. Память не будет инициализирована каким-либо образом.

source: Requesting zero elements or elements of size zero bytes returns a distinct non-``NULL`` pointer if possible, as if ``PyObject_Calloc(1, 1)`` had been called instead.
ru: Запрос нулевых элементов или элементов размером нуль байт возвращает отдельный указатель, отличный от NULL, если это возможно, как если бы вместо этого был вызван PyObject_Calloc(1, 1)``.

source: If *p* is ``NULL``, the call is equivalent to ``PyObject_Malloc(n)``; else if *n* is equal to zero, the memory block is resized but is not freed, and the returned pointer is non-``NULL``.
ru: Если *p* равно ``NULL``, вызов эквивалентен ``PyObject_Malloc(n)``; в противном случае, если *n* равно нулю, размер блока памяти изменяется, но не освобождается, а возвращаемый указатель не равен NULL.

source: Unless *p* is ``NULL``, it must have been returned by a previous call to :c:func:`PyObject_Malloc`, :c:func:`PyObject_Realloc` or :c:func:`PyObject_Calloc`.
ru: Если *p* не равно ``NULL``, оно должно быть возвращено предыдущим вызовом :c:func:`PyObject_Malloc`, :c:func:`PyObject_Realloc` или :c:func:`PyObject_Calloc`.
