Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/memory.po
Languages: ru

source: In addition to the functions aimed at handling raw memory blocks from the Python heap, objects in Python are allocated and released with :c:macro:`PyObject_New`, :c:macro:`PyObject_NewVar` and :c:func:`PyObject_Del`.
ru: В дополнение к функциям, предназначенным для обработки необработанных блоков памяти из кучи Python, объекты в Python выделяются и освобождаются с помощью :c:macro:`PyObject_New`, :c:macro:`PyObject_NewVar` и :c:func:`PyObject_Del` .

source: These will be explained in the next chapter on defining and implementing new object types in C.
ru: Это будет объяснено в следующей главе, посвященной определению и реализации новых типов объектов в C.

source: malloc (C function)
ru: malloc (C функция)

source: calloc (C function)
ru: calloc (C функция)

source: realloc (C function)
ru: realloc (C функция)

source: free (C function)
ru: free (C функция)
