Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/memory.po
Languages: ru

source: If the request fails, :c:func:`PyObject_Realloc` returns ``NULL`` and *p* remains a valid pointer to the previous memory area.
ru: Если запрос завершается неудачно, :c:func:`PyObject_Realloc` возвращает ``NULL`` и *p* остается действительным указателем на предыдущую область памяти.

source: Frees the memory block pointed to by *p*, which must have been returned by a previous call to :c:func:`PyObject_Malloc`, :c:func:`PyObject_Realloc` or :c:func:`PyObject_Calloc`. Otherwise, or if ``PyObject_Free(p)`` has been called before, undefined behavior occurs.
ru: Освобождает блок памяти, на который указывает *p*, который должен был быть возвращен предыдущим вызовом :c:func:`PyObject_Malloc`, :c:func:`PyObject_Realloc` или :c:func:`PyObject_Calloc`. В противном случае или если PyObject_Free(p) был вызван ранее, произойдет неопределенное поведение.

source: Default Memory Allocators
ru: Распределители памяти по умолчанию

source: Default memory allocators:
ru: Распределители памяти по умолчанию:

source: Configuration
ru: Конфигурация

source: Name
ru: Имя

source: Release build
ru: Сборка релиза

source: Debug build
ru: Отладочная сборка

source: ``malloc`` + debug
ru: ``malloc`` + отладка

source: ``pymalloc`` + debug
ru: ``pymalloc`` + отладка

source: Release build, without pymalloc
ru: Выпуск сборки без pymalloc

source: Debug build, without pymalloc
ru: Отладочная сборка без pymalloc

source: Legend:
ru: Легенда:

source: Name: value for :envvar:`PYTHONMALLOC` environment variable.
ru: Имя: значение для переменной среды :envvar:`PYTHONMALLOC`.

source: ``malloc``: system allocators from the standard C library, C functions: :c:func:`malloc`, :c:func:`calloc`, :c:func:`realloc` and :c:func:`free`.
ru: ``malloc``: системные распределители из стандартной библиотеки C, функции C: :c:func:`malloc`, :c:func:`calloc`, :c:func:`realloc` и :c:func:` бесплатно`.

source: ``pymalloc``: :ref:`pymalloc memory allocator <pymalloc>`.
ru: ``pymalloc``: :ref:`pymalloc распределитель памяти <pymalloc>`.

source: ``mimalloc``: :ref:`mimalloc memory allocator <mimalloc>`. The pymalloc allocator will be used if mimalloc support isn't available.
ru: ``mimalloc``: :ref:`распределитель памяти mimalloc <mimalloc>`. Распределитель pymalloc будет использоваться, если поддержка mimalloc недоступна.

source: "+ debug": with :ref:`debug hooks on the Python memory allocators <pymem-debug-hooks>`.
ru: «+ debug»: с :ref:`перехватчиками отладки на распределителях памяти Python <pymem-debug-hooks>`.

source: "Debug build": :ref:`Python build in debug mode <debug-build>`.
ru: «Отладочная сборка»: :ref:`Сборка Python в режиме отладки <debug-build>`.

source: Customize Memory Allocators
ru: Настройка распределителей памяти

source: Structure used to describe a memory block allocator. The structure has the following fields:
ru: Структура, используемая для описания распределителя блоков памяти. Структура имеет следующие поля:

source: Field
ru: Поле

source: Meaning
ru: Значение

source: user context passed as first argument
ru: пользовательский контекст, передаваемый в качестве первого аргумента

source: allocate a memory block
ru: выделить блок памяти

source: allocate a memory block initialized with zeros
ru: выделить блок памяти, инициализированный нулями

source: allocate or resize a memory block
ru: выделить или изменить размер блока памяти

source: free a memory block
ru: освободить блок памяти

source: The :c:type:`!PyMemAllocator` structure was renamed to :c:type:`PyMemAllocatorEx` and a new ``calloc`` field was added.
ru: Структура :c:type:`!PyMemAllocator` была переименована в :c:type:`PyMemAllocatorEx` и было добавлено новое поле ``calloc``.

source: Enum used to identify an allocator domain. Domains:
ru: Перечисление, используемое для идентификации домена распределителя. Домены:

source: Functions:
ru: Функции:

source: Get the memory block allocator of the specified domain.
ru: Получите распределитель блоков памяти указанного домена.

source: Set the memory block allocator of the specified domain.
ru: Установите распределитель блоков памяти указанного домена.

source: The new allocator must return a distinct non-``NULL`` pointer when requesting zero bytes.
ru: Новый распределитель должен возвращать отдельный указатель, отличный от NULL, при запросе нулевых байтов.

source: For the :c:macro:`PYMEM_DOMAIN_RAW` domain, the allocator must be thread-safe: the :term:`GIL <global interpreter lock>` is not held when the allocator is called.
ru: Для домена :c:macro:`PYMEM_DOMAIN_RAW` распределитель должен быть потокобезопасным: :term:`GIL <глобальная блокировка интерпретатора>` не удерживается при вызове распределителя.

source: For the remaining domains, the allocator must also be thread-safe: the allocator may be called in different interpreters that do not share a ``GIL``.
ru: Для остальных доменов распределитель также должен быть потокобезопасным: распределитель может вызываться в разных интерпретаторах, которые не используют общий ``GIL``.

source: If the new allocator is not a hook (does not call the previous allocator), the :c:func:`PyMem_SetupDebugHooks` function must be called to reinstall the debug hooks on top on the new allocator.
ru: Если новый распределитель не является перехватчиком (не вызывает предыдущий распределитель), необходимо вызвать функцию :c:func:`PyMem_SetupDebugHooks`, чтобы переустановить отладочные перехватчики поверх нового распределителя.

source: See also :c:member:`PyPreConfig.allocator` and :ref:`Preinitialize Python with PyPreConfig <c-preinit>`.
ru: См. также :c:member:`PyPreConfig.allocator` и :ref:`Предварительная инициализация Python с помощью PyPreConfig <c-preinit>`.

source: :c:func:`PyMem_SetAllocator` does have the following contract:
ru: :c:func:`PyMem_SetAllocator` имеет следующий контракт:

source: It can be called after :c:func:`Py_PreInitialize` and before :c:func:`Py_InitializeFromConfig` to install a custom memory allocator. There are no restrictions over the installed allocator other than the ones imposed by the domain (for instance, the Raw Domain allows the allocator to be called without the GIL held). See :ref:`the section on allocator domains <allocator-domains>` for more information.
ru: Его можно вызвать после :c:func:`Py_PreInitialize` и до :c:func:`Py_InitializeFromConfig` для установки специального распределителя памяти. Для установленного распределителя нет никаких ограничений, кроме тех, которые налагаются доменом (например, необработанный домен позволяет вызывать распределитель без удержания GIL). См. :ref:`раздел о доменах-распределителях <allocator-domains>` для получения дополнительной информации.

source: If called after Python has finish initializing (after :c:func:`Py_InitializeFromConfig` has been called) the allocator **must** wrap the existing allocator. Substituting the current allocator for some other arbitrary one is **not supported**.
ru: Если вызывается после завершения инициализации Python (после вызова :c:func:`Py_InitializeFromConfig`), распределитель **должен** обернуть существующий распределитель. Замена текущего распределителя на какой-либо другой произвольный **не поддерживается**.

source: All allocators must be thread-safe.
ru: Все распределители должны быть потокобезопасными.

source: Setup :ref:`debug hooks in the Python memory allocators <pymem-debug-hooks>` to detect memory errors.
ru: Установите отладочные перехватчики в распределителях памяти Python <pymem-debug-hooks>` для обнаружения ошибок памяти.

source: Debug hooks on the Python memory allocators
ru: Обработчики отладки распределителей памяти Python

source: When :ref:`Python is built in debug mode <debug-build>`, the :c:func:`PyMem_SetupDebugHooks` function is called at the :ref:`Python preinitialization <c-preinit>` to setup debug hooks on Python memory allocators to detect memory errors.
ru: Когда :ref:`Python собран в режиме отладки <debug-build>`, функция :c:func:`PyMem_SetupDebugHooks` вызывается в :ref:`Python preinitialization <c-preinit>` для настройки отладочных перехватчиков на Python распределители памяти для обнаружения ошибок памяти.

source: The :envvar:`PYTHONMALLOC` environment variable can be used to install debug hooks on a Python compiled in release mode (ex: ``PYTHONMALLOC=debug``).
ru: Переменная среды :envvar:`PYTHONMALLOC` может использоваться для установки перехватчиков отладки в Python, скомпилированном в режиме выпуска (например: ``PYTHONMALLOC=debug``).

source: The :c:func:`PyMem_SetupDebugHooks` function can be used to set debug hooks after calling :c:func:`PyMem_SetAllocator`.
ru: Функцию :c:func:`PyMem_SetupDebugHooks` можно использовать для установки перехватчиков отладки после вызова :c:func:`PyMem_SetAllocator`.

source: These debug hooks fill dynamically allocated memory blocks with special, recognizable bit patterns. Newly allocated memory is filled with the byte ``0xCD`` (``PYMEM_CLEANBYTE``), freed memory is filled with the byte ``0xDD`` (``PYMEM_DEADBYTE``). Memory blocks are surrounded by "forbidden bytes" filled with the byte ``0xFD`` (``PYMEM_FORBIDDENBYTE``). Strings of these bytes are unlikely to be valid addresses, floats, or ASCII strings.
ru: Эти перехватчики отладки заполняют динамически выделяемые блоки памяти специальными, распознаваемыми битовыми шаблонами. Вновь выделенная память заполняется байтом ``0xCD`` (``PYMEM_CLEANBYTE``), освобожденная память заполняется байтом ``0xDD`` (``PYMEM_DEADBYTE``). Блоки памяти окружены «запрещенными байтами», заполненными байтом ``0xFD`` (``PYMEM_FORBIDDENBYTE``). Строки этих байтов вряд ли будут действительными адресами, числами с плавающей запятой или строками ASCII.

source: Runtime checks:
ru: Проверки во время выполнения:

source: Detect API violations. For example, detect if :c:func:`PyObject_Free` is called on a memory block allocated by :c:func:`PyMem_Malloc`.
ru: Обнаружение нарушений API. Например, определите, вызывается ли :c:func:`PyObject_Free` в блоке памяти, выделенном :c:func:`PyMem_Malloc`.

source: Detect write before the start of the buffer (buffer underflow).
ru: Обнаружение записи до начала буфера (переполнение буфера).

source: Detect write after the end of the buffer (buffer overflow).
ru: Обнаружение записи после окончания буфера (переполнение буфера).

source: Check that the :term:`GIL <global interpreter lock>` is held when allocator functions of :c:macro:`PYMEM_DOMAIN_OBJ` (ex: :c:func:`PyObject_Malloc`) and :c:macro:`PYMEM_DOMAIN_MEM` (ex: :c:func:`PyMem_Malloc`) domains are called.
ru: Убедитесь, что :term:`GIL <глобальная блокировка интерпретатора>` удерживается, когда функции распределения :c:macro:`PYMEM_DOMAIN_OBJ` (например: :c:func:`PyObject_Malloc`) и :c:macro:`PYMEM_DOMAIN_MEM` ( например: :c:func:`PyMem_Malloc`) вызываются домены.

source: On error, the debug hooks use the :mod:`tracemalloc` module to get the traceback where a memory block was allocated. The traceback is only displayed if :mod:`tracemalloc` is tracing Python memory allocations and the memory block was traced.
ru: В случае ошибки перехватчики отладки используют модуль :mod:`tracemalloc`, чтобы получить обратную трассировку, где был выделен блок памяти. Обратная трассировка отображается только в том случае, если :mod:`tracemalloc` отслеживает распределение памяти Python и блок памяти был отслежен.

source: Let *S* = ``sizeof(size_t)``. ``2*S`` bytes are added at each end of each block of *N* bytes requested. The memory layout is like so, where p represents the address returned by a malloc-like or realloc-like function (``p[i:j]`` means the slice of bytes from ``*(p+i)`` inclusive up to ``*(p+j)`` exclusive; note that the treatment of negative indices differs from a Python slice):
ru: Пусть *S* = ``sizeof(size_t)``. Байты ``2*S`` добавляются на каждом конце каждого запрошенного блока из *N* байтов. Расположение памяти такое, где p представляет адрес, возвращаемый функцией, подобной malloc или realloc (``p[i:j]`` означает фрагмент байтов из ``*(p+i)`` включительно до ``*(p+j)`` исключая, обратите внимание, что обработка отрицательных индексов отличается от среза Python):

source: Number of bytes originally asked for. This is a size_t, big-endian (easier to read in a memory dump).
ru: Первоначально запрошенное количество байтов. Это size_t с прямым порядком байтов (легче читается в дампе памяти).

source: API identifier (ASCII character):
ru: Идентификатор API (символ ASCII):

source: ``'r'`` for :c:macro:`PYMEM_DOMAIN_RAW`.
ru: ``'r'`` для :c:macro:`PYMEM_DOMAIN_RAW`.

source: ``'m'`` for :c:macro:`PYMEM_DOMAIN_MEM`.
ru: ``'m'`` для :c:macro:`PYMEM_DOMAIN_MEM`.

source: ``'o'`` for :c:macro:`PYMEM_DOMAIN_OBJ`.
ru: ``'o'`` для :c:macro:`PYMEM_DOMAIN_OBJ`.

source: Copies of PYMEM_FORBIDDENBYTE. Used to catch under- writes and reads.
ru: Копии PYMEM_FORBIDDENBYTE. Используется для перехвата операций записи и чтения.

source: The requested memory, filled with copies of PYMEM_CLEANBYTE, used to catch reference to uninitialized memory. When a realloc-like function is called requesting a larger memory block, the new excess bytes are also filled with PYMEM_CLEANBYTE. When a free-like function is called, these are overwritten with PYMEM_DEADBYTE, to catch reference to freed memory. When a realloc- like function is called requesting a smaller memory block, the excess old bytes are also filled with PYMEM_DEADBYTE.
ru: Запрошенная память, заполненная копиями PYMEM_CLEANBYTE, используется для перехвата ссылок на неинициализированную память. Когда функция, подобная realloc, вызывается с запросом большего блока памяти, новые лишние байты также заполняются PYMEM_CLEANBYTE. Когда вызывается свободная функция, они перезаписываются PYMEM_DEADBYTE, чтобы перехватить ссылку на освобожденную память. Когда функция, подобная realloc, вызывается и запрашивает меньший блок памяти, лишние старые байты также заполняются PYMEM_DEADBYTE.

source: Copies of PYMEM_FORBIDDENBYTE. Used to catch over- writes and reads.
ru: Копии PYMEM_FORBIDDENBYTE. Используется для перехвата перезаписи и чтения.

source: Only used if the ``PYMEM_DEBUG_SERIALNO`` macro is defined (not defined by default).
ru: Используется только в том случае, если определен макрос PYMEM_DEBUG_SERIALNO (не определен по умолчанию).

source: A serial number, incremented by 1 on each call to a malloc-like or realloc-like function. Big-endian :c:type:`size_t`. If "bad memory" is detected later, the serial number gives an excellent way to set a breakpoint on the next run, to capture the instant at which this block was passed out. The static function bumpserialno() in obmalloc.c is the only place the serial number is incremented, and exists so you can set such a breakpoint easily.
ru: Серийный номер, увеличивающийся на 1 при каждом вызове функции типа malloc или realloc. Прямой порядок :c:type:`size_t`. Если позже обнаруживается «плохая память», серийный номер дает отличный способ установить точку останова при следующем запуске, чтобы зафиксировать момент, когда этот блок был отключен. Статическая функцияumpserialno() в obmalloc.c — единственное место, где увеличивается серийный номер, и она существует, поэтому вы можете легко установить такую ​​точку останова.

source: A realloc-like or free-like function first checks that the PYMEM_FORBIDDENBYTE bytes at each end are intact. If they've been altered, diagnostic output is written to stderr, and the program is aborted via Py_FatalError(). The other main failure mode is provoking a memory error when a program reads up one of the special bit patterns and tries to use it as an address. If you get in a debugger then and look at the object, you're likely to see that it's entirely filled with PYMEM_DEADBYTE (meaning freed memory is getting used) or PYMEM_CLEANBYTE (meaning uninitialized memory is getting used).
ru: Функция типа realloc или free сначала проверяет целостность байтов PYMEM_FORBIDDENBYTE на каждом конце. Если они были изменены, диагностические данные записываются в stderr, и программа прерывается с помощью Py_FatalError(). Другой основной вид сбоя — это ошибка памяти, когда программа считывает один из специальных битовых шаблонов и пытается использовать его в качестве адреса. Если вы затем зайдете в отладчик и посмотрите на объект, вы, вероятно, увидите, что он полностью заполнен PYMEM_DEADBYTE (это означает, что используется освобожденная память) или PYMEM_CLEANBYTE (это означает, что используется неинициализированная память).

source: The :c:func:`PyMem_SetupDebugHooks` function now also works on Python compiled in release mode. On error, the debug hooks now use :mod:`tracemalloc` to get the traceback where a memory block was allocated. The debug hooks now also check if the GIL is held when functions of :c:macro:`PYMEM_DOMAIN_OBJ` and :c:macro:`PYMEM_DOMAIN_MEM` domains are called.
ru: Функция :c:func:`PyMem_SetupDebugHooks` теперь также работает на Python, скомпилированном в режиме выпуска. В случае ошибки перехватчики отладки теперь используют :mod:`tracemalloc`, чтобы получить обратную трассировку, где был выделен блок памяти. Перехватчики отладки теперь также проверяют, удерживается ли GIL при вызове функций доменов :c:macro:`PYMEM_DOMAIN_OBJ` и :c:macro:`PYMEM_DOMAIN_MEM`.

source: Byte patterns ``0xCB`` (``PYMEM_CLEANBYTE``), ``0xDB`` (``PYMEM_DEADBYTE``) and ``0xFB`` (``PYMEM_FORBIDDENBYTE``) have been replaced with ``0xCD``, ``0xDD`` and ``0xFD`` to use the same values than Windows CRT debug ``malloc()`` and ``free()``.
ru: Байтовые шаблоны ``0xCB`` (``PYMEM_CLEANBYTE``), ``0xDB`` (``PYMEM_DEADBYTE``) и ``0xFB`` (``PYMEM_FORBIDDENBYTE``) заменены на ``0xCD``, ``0xDD`` и ``0xFD`` для использования тех же значений, что и ``malloc()`` и ``free()`` отладки Windows CRT.

source: The pymalloc allocator
ru: Распределитель pymalloc

source: Python has a *pymalloc* allocator optimized for small objects (smaller or equal to 512 bytes) with a short lifetime. It uses memory mappings called "arenas" with a fixed size of either 256 KiB on 32-bit platforms or 1 MiB on 64-bit platforms. It falls back to :c:func:`PyMem_RawMalloc` and :c:func:`PyMem_RawRealloc` for allocations larger than 512 bytes.
ru: В Python имеется распределитель *pymalloc*, оптимизированный для небольших объектов (размером меньше или равных 512 байтам) с коротким временем жизни. Он использует сопоставления памяти, называемые «аренами», с фиксированным размером 256 КиБ на 32-битных платформах или 1 МиБ на 64-битных платформах. Он возвращается к :c:func:`PyMem_RawMalloc` и :c:func:`PyMem_RawRealloc` для выделения памяти размером более 512 байт.

source: *pymalloc* is the :ref:`default allocator <default-memory-allocators>` of the :c:macro:`PYMEM_DOMAIN_MEM` (ex: :c:func:`PyMem_Malloc`) and :c:macro:`PYMEM_DOMAIN_OBJ` (ex: :c:func:`PyObject_Malloc`) domains.
ru: *pymalloc* — это :ref:`распределитель по умолчанию <default-memory-allocators>` для :c:macro:`PYMEM_DOMAIN_MEM` (например: :c:func:`PyMem_Malloc`) и :c:macro:`PYMEM_DOMAIN_OBJ` (например: :c:func:`PyObject_Malloc`) домены.

source: The arena allocator uses the following functions:
ru: Распределитель арены использует следующие функции:

source: :c:func:`!VirtualAlloc` and :c:func:`!VirtualFree` on Windows,
ru: :c:func:`!VirtualAlloc` и :c:func:`!VirtualFree` в Windows,

source: :c:func:`!mmap` and :c:func:`!munmap` if available,
ru: :c:func:`!mmap` и :c:func:`!munmap`, если они доступны,

source: :c:func:`malloc` and :c:func:`free` otherwise.
ru: :c:func:`malloc` и :c:func:`free` в противном случае.

source: This allocator is disabled if Python is configured with the :option:`--without-pymalloc` option. It can also be disabled at runtime using the :envvar:`PYTHONMALLOC` environment variable (ex: ``PYTHONMALLOC=malloc``).
ru: Этот распределитель отключен, если Python настроен с опцией :option:`--without-pymalloc`. Его также можно отключить во время выполнения с помощью переменной среды :envvar:`PYTHONMALLOC` (например: ``PYTHONMALLOC=malloc``).

source: Customize pymalloc Arena Allocator
ru: Настройка распределителя арены pymalloc

source: Structure used to describe an arena allocator. The structure has three fields:
ru: Структура, используемая для описания распределителя арены. Структура имеет три поля:

source: allocate an arena of size bytes
ru: выделить арену размером в байты

source: free an arena
ru: освободить арену

source: Get the arena allocator.
ru: Получите распределитель арены.

source: Set the arena allocator.
ru: Установите распределитель арены.

source: The mimalloc allocator
ru: Распределитель mimalloc

source: Python supports the mimalloc allocator when the underlying platform support is available. mimalloc "is a general purpose allocator with excellent performance characteristics. Initially developed by Daan Leijen for the runtime systems of the Koka and Lean languages."
ru: Python поддерживает распределитель mimalloc, когда доступна поддержка базовой платформы. mimalloc «является распределителем общего назначения с отличными характеристиками производительности. Первоначально разработан Дааном Лейеном для систем времени выполнения языков Koka и Lean».

source: Track an allocated memory block in the :mod:`tracemalloc` module.
ru: Отслеживайте выделенный блок памяти в модуле :mod:`tracemalloc`.

source: Return ``0`` on success, return ``-1`` on error (failed to allocate memory to store the trace). Return ``-2`` if tracemalloc is disabled.
ru: Возвращает «0» в случае успеха, возвращает «-1» в случае ошибки (не удалось выделить память для хранения трассировки). Верните ``-2``, если Tracemalloc отключен.

source: If memory block is already tracked, update the existing trace.
ru: Если блок памяти уже отслеживается, обновите существующую трассировку.

source: Untrack an allocated memory block in the :mod:`tracemalloc` module. Do nothing if the block was not tracked.
ru: Отмените отслеживание выделенного блока памяти в модуле :mod:`tracemalloc`. Ничего не делайте, если блок не отслеживался.

source: Return ``-2`` if tracemalloc is disabled, otherwise return ``0``.
ru: Верните ``-2``, если Tracemalloc отключен, в противном случае верните ``0``.

source: Examples
ru: Примеры

source: Here is the example from section :ref:`memoryoverview`, rewritten so that the I/O buffer is allocated from the Python heap by using the first function set::
ru: Вот пример из раздела :ref:`memoryoverview`, переписанный так, что буфер ввода-вывода выделяется из кучи Python с использованием первого набора функций:

source: The same code using the type-oriented function set::
ru: Тот же код с использованием типоориентированного набора функций::

source: Note that in the two examples above, the buffer is always manipulated via functions belonging to the same set. Indeed, it is required to use the same memory API family for a given memory block, so that the risk of mixing different allocators is reduced to a minimum. The following code sequence contains two errors, one of which is labeled as *fatal* because it mixes two different allocators operating on different heaps. ::
ru: Обратите внимание, что в двух приведенных выше примерах буфер всегда управляется с помощью функций, принадлежащих одному и тому же набору. Действительно, необходимо использовать одно и то же семейство API памяти для данного блока памяти, чтобы риск смешивания разных распределителей был сведен к минимуму. Следующая последовательность кода содержит две ошибки, одна из которых помечена как *фатальная*, поскольку она смешивает два разных распределителя, работающих в разных кучах. ::
