Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/module.po
Languages: ru

source: Multiple ``Py_mod_gil`` slots may not be specified in one module definition.
ru: В одном определении модуля нельзя указать несколько слотов Py_mod_gil.

source: If ``Py_mod_gil`` is not specified, the import machinery defaults to ``Py_MOD_GIL_USED``.
ru: Если ``Py_mod_gil`` не указан, механизм импорта по умолчанию использует ``Py_MOD_GIL_USED``.

source: See :PEP:`489` for more details on multi-phase initialization.
ru: См. :PEP:`489` для получения более подробной информации о многофазной инициализации.

source: Low-level module creation functions
ru: Функции создания низкоуровневых модулей

source: The following functions are called under the hood when using multi-phase initialization. They can be used directly, for example when creating module objects dynamically. Note that both ``PyModule_FromDefAndSpec`` and ``PyModule_ExecDef`` must be called to fully initialize a module.
ru: Следующие функции вызываются «под капотом» при использовании многофазной инициализации. Их можно использовать напрямую, например, при динамическом создании объектов модуля. Обратите внимание, что для полной инициализации модуля необходимо вызвать как PyModule_FromDefAndSpec, так и PyModule_ExecDef.

source: Create a new module object, given the definition in *def* and the ModuleSpec *spec*. This behaves like :c:func:`PyModule_FromDefAndSpec2` with *module_api_version* set to :c:macro:`PYTHON_API_VERSION`.
ru: Создайте новый объект модуля, используя определение в *def* и *spec* ModuleSpec. Это ведет себя как :c:func:`PyModule_FromDefAndSpec2` с *module_api_version*, установленным в :c:macro:`PYTHON_API_VERSION`.

source: Create a new module object, given the definition in *def* and the ModuleSpec *spec*, assuming the API version *module_api_version*. If that version does not match the version of the running interpreter, a :exc:`RuntimeWarning` is emitted.
ru: Создайте новый объект модуля, учитывая определение в *def* и ModuleSpec *spec*, предполагая версию API *module_api_version*. Если эта версия не соответствует версии работающего интерпретатора, выдается :exc:`RuntimeWarning`.

source: Most uses of this function should be using :c:func:`PyModule_FromDefAndSpec` instead; only use this if you are sure you need it.
ru: В большинстве случаев вместо этой функции следует использовать :c:func:`PyModule_FromDefAndSpec`; используйте это только в том случае, если вы уверены, что вам это нужно.

source: Process any execution slots (:c:data:`Py_mod_exec`) given in *def*.
ru: Обработать любые слоты выполнения (:c:data:`Py_mod_exec`), указанные в *def*.

source: Set the docstring for *module* to *docstring*. This function is called automatically when creating a module from ``PyModuleDef``, using either ``PyModule_Create`` or ``PyModule_FromDefAndSpec``.
ru: Установите строку документации для *module* на *docstring*. Эта функция вызывается автоматически при создании модуля из PyModuleDef с использованием либо PyModule_Create, либо PyModule_FromDefAndSpec.

source: Add the functions from the ``NULL`` terminated *functions* array to *module*. Refer to the :c:type:`PyMethodDef` documentation for details on individual entries (due to the lack of a shared module namespace, module level "functions" implemented in C typically receive the module as their first parameter, making them similar to instance methods on Python classes). This function is called automatically when creating a module from ``PyModuleDef``, using either ``PyModule_Create`` or ``PyModule_FromDefAndSpec``.
ru: Добавьте функции из массива *functions* с нулевым завершением в *module*. Обратитесь к документации :c:type:`PyMethodDef` для получения подробной информации об отдельных записях (из-за отсутствия общего пространства имен модуля «функции» уровня модуля, реализованные в C, обычно получают модуль в качестве своего первого параметра, что делает их похожими на экземпляр методы классов Python). Эта функция вызывается автоматически при создании модуля из PyModuleDef с использованием либо PyModule_Create, либо PyModule_FromDefAndSpec.

source: Support functions
ru: Вспомогательные функции

source: The module initialization function (if using single phase initialization) or a function called from a module execution slot (if using multi-phase initialization), can use the following functions to help initialize the module state:
ru: Функция инициализации модуля (при использовании однофазной инициализации) или функция, вызываемая из слота выполнения модуля (при использовании многофазной инициализации), может использовать следующие функции, чтобы помочь инициализировать состояние модуля:

source: Add an object to *module* as *name*. This is a convenience function which can be used from the module's initialization function.
ru: Добавьте объект в *модуль* как *имя*. Это удобная функция, которую можно использовать из функции инициализации модуля.

source: On success, return ``0``. On error, raise an exception and return ``-1``.
ru: В случае успеха верните ``0``. В случае ошибки вызвать исключение и вернуть ``-1``.

source: Return ``-1`` if *value* is ``NULL``. It must be called with an exception raised in this case.
ru: Возвращает ``-1``, если *value* равно ``NULL``. В этом случае его необходимо вызывать с исключением.

source: Example usage::
ru: Пример использования::

source: The example can also be written without checking explicitly if *obj* is ``NULL``::
ru: Пример также можно написать без явной проверки того, имеет ли *obj* значение ``NULL``::

source: Note that ``Py_XDECREF()`` should be used instead of ``Py_DECREF()`` in this case, since *obj* can be ``NULL``.
ru: Обратите внимание, что в этом случае вместо Py_DECREF() следует использовать Py_XDECREF(), поскольку *obj* может иметь значение NULL.

source: The number of different *name* strings passed to this function should be kept small, usually by only using statically allocated strings as *name*. For names that aren't known at compile time, prefer calling :c:func:`PyUnicode_FromString` and :c:func:`PyObject_SetAttr` directly. For more details, see :c:func:`PyUnicode_InternFromString`, which may be used internally to create a key object.
ru: Количество различных строк *name*, передаваемых в эту функцию, должно быть небольшим, обычно за счет использования только статически выделенных строк в качестве *name*. Для имен, которые неизвестны во время компиляции, предпочтительнее вызывать :c:func:`PyUnicode_FromString` и :c:func:`PyObject_SetAttr` напрямую. Для получения более подробной информации см. :c:func:`PyUnicode_InternFromString`, который можно использовать внутри компании для создания ключевого объекта.

source: Similar to :c:func:`PyModule_AddObjectRef`, but "steals" a reference to *value*. It can be called with a result of function that returns a new reference without bothering to check its result or even saving it to a variable.
ru: Аналогично :c:func:`PyModule_AddObjectRef`, но "крадет" ссылку на *value*. Его можно вызвать с результатом функции, которая возвращает новую ссылку, не утруждая себя проверкой результата или даже сохранением его в переменной.

source: Similar to :c:func:`PyModule_AddObjectRef`, but steals a reference to *value* on success (if it returns ``0``).
ru: Аналогично :c:func:`PyModule_AddObjectRef`, но в случае успеха крадет ссылку на *value* (если возвращается ``0``).

source: The new :c:func:`PyModule_Add` or :c:func:`PyModule_AddObjectRef` functions are recommended, since it is easy to introduce reference leaks by misusing the :c:func:`PyModule_AddObject` function.
ru: Рекомендуется использовать новые функции :c:func:`PyModule_Add` или :c:func:`PyModule_AddObjectRef`, так как легко вызвать утечку ссылок при неправильном использовании функции :c:func:`PyModule_AddObject`.

source: Unlike other functions that steal references, ``PyModule_AddObject()`` only releases the reference to *value* **on success**.
ru: В отличие от других функций, которые крадут ссылки, PyModule_AddObject() освобождает ссылку на *value* только **в случае успеха**.

source: This means that its return value must be checked, and calling code must :c:func:`Py_XDECREF` *value* manually on error.
ru: Это означает, что его возвращаемое значение должно быть проверено, а вызывающий код должен :c:func:`Py_XDECREF` *value* вручную в случае ошибки.

source: :c:func:`PyModule_AddObject` is :term:`soft deprecated`.
ru: :c:func:`PyModule_AddObject` :term:`мягко устарел`.

source: Add an integer constant to *module* as *name*. This convenience function can be used from the module's initialization function. Return ``-1`` with an exception set on error, ``0`` on success.
ru: Добавьте целочисленную константу в *module* как *name*. Эту удобную функцию можно использовать из функции инициализации модуля. Возвращает ``-1`` с установленным исключением в случае ошибки и ``0`` в случае успеха.

source: This is a convenience function that calls :c:func:`PyLong_FromLong` and :c:func:`PyModule_AddObjectRef`; see their documentation for details.
ru: Это удобная функция, которая вызывает :c:func:`PyLong_FromLong` и :c:func:`PyModule_AddObjectRef`; подробности см. в их документации.

source: Add a string constant to *module* as *name*. This convenience function can be used from the module's initialization function. The string *value* must be ``NULL``-terminated. Return ``-1`` with an exception set on error, ``0`` on success.
ru: Добавьте строковую константу в *module* как *name*. Эту удобную функцию можно использовать из функции инициализации модуля. Строка *value* должна заканчиваться NULL. Возвращает ``-1`` с установленным исключением в случае ошибки и ``0`` в случае успеха.

source: This is a convenience function that calls :c:func:`PyUnicode_InternFromString` and :c:func:`PyModule_AddObjectRef`; see their documentation for details.
ru: Это удобная функция, которая вызывает :c:func:`PyUnicode_InternFromString` и :c:func:`PyModule_AddObjectRef`; подробности см. в их документации.

source: Add an int constant to *module*. The name and the value are taken from *macro*. For example ``PyModule_AddIntMacro(module, AF_INET)`` adds the int constant *AF_INET* with the value of *AF_INET* to *module*. Return ``-1`` with an exception set on error, ``0`` on success.
ru: Добавьте константу int в *module*. Имя и значение взяты из *macro*. Например, PyModule_AddIntMacro(module, AF_INET) добавляет константу int *AF_INET* со значением *AF_INET* к *module*. Возвращает ``-1`` с установленным исключением в случае ошибки и ``0`` в случае успеха.

source: Add a string constant to *module*.
ru: Добавьте строковую константу в *module*.

source: Add a type object to *module*. The type object is finalized by calling internally :c:func:`PyType_Ready`. The name of the type object is taken from the last component of :c:member:`~PyTypeObject.tp_name` after dot. Return ``-1`` with an exception set on error, ``0`` on success.
ru: Добавьте объект типа в *module*. Объект типа завершается внутренним вызовом :c:func:`PyType_Ready`. Имя объекта типа берется из последнего компонента :c:member:`~PyTypeObject.tp_name` после точки. Возвращает ``-1`` с установленным исключением в случае ошибки и ``0`` в случае успеха.

source: Indicate that *module* does or does not support running without the global interpreter lock (GIL), using one of the values from :c:macro:`Py_mod_gil`. It must be called during *module*'s initialization function. If this function is not called during module initialization, the import machinery assumes the module does not support running without the GIL. This function is only available in Python builds configured with :option:`--disable-gil`. Return ``-1`` with an exception set on error, ``0`` on success.
ru: Укажите, что *модуль* поддерживает или не поддерживает работу без глобальной блокировки интерпретатора (GIL), используя одно из значений из :c:macro:`Py_mod_gil`. Его необходимо вызывать во время функции инициализации *module*. Если эта функция не вызывается во время инициализации модуля, механизм импорта предполагает, что модуль не поддерживает работу без GIL. Эта функция доступна только в сборках Python, настроенных с помощью :option:`--disable-gil`. Возвращает ``-1`` с установленным исключением в случае ошибки и ``0`` в случае успеха.

source: Module lookup
ru: Поиск по модулю

source: Single-phase initialization creates singleton modules that can be looked up in the context of the current interpreter. This allows the module object to be retrieved later with only a reference to the module definition.
ru: Однофазная инициализация создает одноэлементные модули, которые можно искать в контексте текущего интерпретатора. Это позволяет получить объект модуля позже, используя только ссылку на определение модуля.

source: These functions will not work on modules created using multi-phase initialization, since multiple such modules can be created from a single definition.
ru: Эти функции не будут работать с модулями, созданными с использованием многофазной инициализации, поскольку из одного определения можно создать несколько таких модулей.

source: Returns the module object that was created from *def* for the current interpreter. This method requires that the module object has been attached to the interpreter state with :c:func:`PyState_AddModule` beforehand. In case the corresponding module object is not found or has not been attached to the interpreter state yet, it returns ``NULL``.
ru: Возвращает объект модуля, созданный из *def* для текущего интерпретатора. Этот метод требует, чтобы объект модуля был заранее прикреплен к состоянию интерпретатора с помощью :c:func:`PyState_AddModule`. В случае, если соответствующий объект модуля не найден или еще не присоединен к состоянию интерпретатора, он возвращает NULL.

source: Attaches the module object passed to the function to the interpreter state. This allows the module object to be accessible via :c:func:`PyState_FindModule`.
ru: Прикрепляет объект модуля, переданный функции, к состоянию интерпретатора. Это позволяет объекту модуля быть доступным через :c:func:`PyState_FindModule`.

source: Only effective on modules created using single-phase initialization.
ru: Действует только на модулях, созданных с использованием однофазной инициализации.

source: Python calls ``PyState_AddModule`` automatically after importing a module, so it is unnecessary (but harmless) to call it from module initialization code. An explicit call is needed only if the module's own init code subsequently calls ``PyState_FindModule``. The function is mainly intended for implementing alternative import mechanisms (either by calling it directly, or by referring to its implementation for details of the required state updates).
ru: Python вызывает PyState_AddModule автоматически после импорта модуля, поэтому нет необходимости (но безвредно) вызывать его из кода инициализации модуля. Явный вызов необходим только в том случае, если собственный код инициализации модуля впоследствии вызывает PyState_FindModule. Функция в основном предназначена для реализации альтернативных механизмов импорта (либо путем прямого вызова, либо путем обращения к ее реализации для получения подробной информации о необходимых обновлениях состояния).

source: The caller must hold the GIL.
ru: Вызывающий объект должен удерживать GIL.

source: Return ``-1`` with an exception set on error, ``0`` on success.
ru: Возвращает ``-1`` с установленным исключением в случае ошибки и ``0`` в случае успеха.

source: Removes the module object created from *def* from the interpreter state. Return ``-1`` with an exception set on error, ``0`` on success.
ru: Удаляет объект модуля, созданный из *def*, из состояния интерпретатора. Возвращает ``-1`` с установленным исключением в случае ошибки и ``0`` в случае успеха.

source: object
ru: объект

source: module
ru: модуль

source: ModuleType (in module types)
ru: ModuleType (в типах модулей)

source: __name__ (module attribute)
ru: __name__ (атрибут модуля)

source: __doc__ (module attribute)
ru: __doc__ (атрибут модуля)

source: __file__ (module attribute)
ru: __file__ (атрибут модуля)

source: __package__ (module attribute)
ru: __package__ (атрибут модуля)

source: __loader__ (module attribute)
ru: __loader__ (атрибут модуля)

source: __dict__ (module attribute)
ru: __dict__ (атрибут модуля)

source: SystemError (built-in exception)
ru: SystemError (встроенное исключение)
