Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/module.po
Languages: ru

source: Module Objects
ru: Объекты модуля

source: This instance of :c:type:`PyTypeObject` represents the Python module type. This is exposed to Python programs as ``types.ModuleType``.
ru: Этот экземпляр :c:type:`PyTypeObject` представляет тип модуля Python. В программах Python он предоставляется как «types.ModuleType».

source: Return true if *p* is a module object, or a subtype of a module object. This function always succeeds.
ru: Возвращайте true, если *p* является объектом модуля или подтипом объекта модуля. Эта функция всегда завершается успешно.

source: Return true if *p* is a module object, but not a subtype of :c:data:`PyModule_Type`. This function always succeeds.
ru: Возвращайте true, если *p* является объектом модуля, но не подтипом :c:data:`PyModule_Type`. Эта функция всегда завершается успешно.

source: Return a new module object with :attr:`module.__name__` set to *name*. The module's :attr:`!__name__`, :attr:`~module.__doc__`, :attr:`~module.__package__` and :attr:`~module.__loader__` attributes are filled in (all but :attr:`!__name__` are set to ``None``). The caller is responsible for setting a :attr:`~module.__file__` attribute.
ru: Верните новый объект модуля с :attr:`module.__name__`, установленным в *name*. Атрибуты модуля :attr:`!__name__`, :attr:`~module.__doc__`, :attr:`~module.__package__` и :attr:`~module.__loader__` заполняются (все, кроме :attr:` !__name__` установлены на ``None``). Вызывающая сторона отвечает за установку атрибута :attr:`~module.__file__`.

source: Return ``NULL`` with an exception set on error.
ru: Возвращает ``NULL`` с исключением, установленным в случае ошибки.

source: :attr:`~module.__package__` and :attr:`~module.__loader__` are now set to ``None``.
ru: :attr:`~module.__package__` и :attr:`~module.__loader__` теперь установлены на ``None``.

source: Similar to :c:func:`PyModule_NewObject`, but the name is a UTF-8 encoded string instead of a Unicode object.
ru: Аналогично :c:func:`PyModule_NewObject`, но имя представляет собой строку в кодировке UTF-8, а не объект Unicode.

source: Return the dictionary object that implements *module*'s namespace; this object is the same as the :attr:`~object.__dict__` attribute of the module object. If *module* is not a module object (or a subtype of a module object), :exc:`SystemError` is raised and ``NULL`` is returned.
ru: Возвращает объект словаря, реализующий пространство имен *module*; этот объект аналогичен атрибуту :attr:`~object.__dict__` объекта модуля. Если *module* не является объектом модуля (или подтипом объекта модуля), возникает :exc:`SystemError` и возвращается ``NULL``.

source: It is recommended extensions use other ``PyModule_*`` and ``PyObject_*`` functions rather than directly manipulate a module's :attr:`~object.__dict__`.
ru: Рекомендуется, чтобы расширения использовали другие функции ``PyModule_*`` и ``PyObject_*``, а не напрямую манипулировали :attr:`~object.__dict__` модуля.

source: Return *module*'s :attr:`~module.__name__` value. If the module does not provide one, or if it is not a string, :exc:`SystemError` is raised and ``NULL`` is returned.
ru: Возвращает значение :attr:`~module.__name__` *module*. Если модуль его не предоставляет или если это не строка, возникает :exc:`SystemError` и возвращается ``NULL``.

source: Similar to :c:func:`PyModule_GetNameObject` but return the name encoded to ``'utf-8'``.
ru: Аналогично :c:func:`PyModule_GetNameObject`, но возвращает имя, закодированное в ``'utf-8'``.

source: Return the "state" of the module, that is, a pointer to the block of memory allocated at module creation time, or ``NULL``. See :c:member:`PyModuleDef.m_size`.
ru: Возвращает «состояние» модуля, то есть указатель на блок памяти, выделенный во время создания модуля, или ``NULL``. См. :c:member:`PyModuleDef.m_size`.

source: Return a pointer to the :c:type:`PyModuleDef` struct from which the module was created, or ``NULL`` if the module wasn't created from a definition.
ru: Верните указатель на структуру :c:type:`PyModuleDef`, из которой был создан модуль, или ``NULL``, если модуль не был создан на основе определения.

source: Return the name of the file from which *module* was loaded using *module*'s :attr:`~module.__file__` attribute. If this is not defined, or if it is not a string, raise :exc:`SystemError` and return ``NULL``; otherwise return a reference to a Unicode object.
ru: Верните имя файла, из которого был загружен *module*, используя атрибут :attr:`~module.__file__` *module*. Если это не определено или это не строка, вызовите :exc:`SystemError` и верните ``NULL``; в противном случае верните ссылку на объект Unicode.

source: Similar to :c:func:`PyModule_GetFilenameObject` but return the filename encoded to 'utf-8'.
ru: Аналогично :c:func:`PyModule_GetFilenameObject`, но возвращает имя файла в кодировке «utf-8».

source: :c:func:`PyModule_GetFilename` raises :exc:`UnicodeEncodeError` on unencodable filenames, use :c:func:`PyModule_GetFilenameObject` instead.
ru: :c:func:`PyModule_GetFilename` вызывает :exc:`UnicodeEncodeError` для некодируемых имен файлов, вместо этого используйте :c:func:`PyModule_GetFilenameObject`.

source: Initializing C modules
ru: Инициализация модулей C

source: Modules objects are usually created from extension modules (shared libraries which export an initialization function), or compiled-in modules (where the initialization function is added using :c:func:`PyImport_AppendInittab`). See :ref:`building` or :ref:`extending-with-embedding` for details.
ru: Объекты модулей обычно создаются из модулей расширения (общих библиотек, которые экспортируют функцию инициализации) или скомпилированных модулей (где функция инициализации добавляется с помощью :c:func:`PyImport_AppendInittab`). Подробности смотрите в :ref:`building` или :ref:`extending-with-embedding`.

source: The initialization function can either pass a module definition instance to :c:func:`PyModule_Create`, and return the resulting module object, or request "multi-phase initialization" by returning the definition struct itself.
ru: Функция инициализации может либо передать экземпляр определения модуля в :c:func:`PyModule_Create` и вернуть результирующий объект модуля, либо запросить «многофазную инициализацию», вернув саму структуру определения.

source: The module definition struct, which holds all information needed to create a module object. There is usually only one statically initialized variable of this type for each module.
ru: Структура определения модуля, содержащая всю информацию, необходимую для создания объекта модуля. Обычно для каждого модуля существует только одна статически инициализированная переменная этого типа.

source: Always initialize this member to :c:macro:`PyModuleDef_HEAD_INIT`.
ru: Всегда инициализируйте этот член как :c:macro:`PyModuleDef_HEAD_INIT`.

source: Name for the new module.
ru: Имя нового модуля.

source: Docstring for the module; usually a docstring variable created with :c:macro:`PyDoc_STRVAR` is used.
ru: Строка документации для модуля; обычно используется переменная строки документации, созданная с помощью :c:macro:`PyDoc_STRVAR`.

source: Module state may be kept in a per-module memory area that can be retrieved with :c:func:`PyModule_GetState`, rather than in static globals. This makes modules safe for use in multiple sub-interpreters.
ru: Состояние модуля может храниться в области памяти каждого модуля, которую можно получить с помощью :c:func:`PyModule_GetState`, а не в статических глобальных переменных. Это делает модули безопасными для использования в нескольких субинтерпретаторах.

source: This memory area is allocated based on *m_size* on module creation, and freed when the module object is deallocated, after the :c:member:`~PyModuleDef.m_free` function has been called, if present.
ru: Эта область памяти выделяется на основе *m_size* при создании модуля и освобождается, когда объект модуля освобождается после вызова функции :c:member:`~PyModuleDef.m_free`, если она присутствует.

source: Setting ``m_size`` to ``-1`` means that the module does not support sub-interpreters, because it has global state.
ru: Установка ``m_size`` в ``-1`` означает, что модуль не поддерживает субинтерпретаторы, поскольку он имеет глобальное состояние.

source: Setting it to a non-negative value means that the module can be re-initialized and specifies the additional amount of memory it requires for its state. Non-negative ``m_size`` is required for multi-phase initialization.
ru: Установка неотрицательного значения означает, что модуль может быть повторно инициализирован, и указывает дополнительный объем памяти, необходимый для его состояния. Неотрицательное значение m_size требуется для многофазной инициализации.

source: See :PEP:`3121` for more details.
ru: См. :PEP:`3121` для более подробной информации.

source: A pointer to a table of module-level functions, described by :c:type:`PyMethodDef` values. Can be ``NULL`` if no functions are present.
ru: Указатель на таблицу функций уровня модуля, описываемую значениями :c:type:`PyMethodDef`. Может быть NULL, если нет функций.

source: An array of slot definitions for multi-phase initialization, terminated by a ``{0, NULL}`` entry. When using single-phase initialization, *m_slots* must be ``NULL``.
ru: Массив определений слотов для многофазной инициализации, завершающийся записью ``{0, NULL}``. При использовании однофазной инициализации *m_slots* должно быть равно NULL.

source: Prior to version 3.5, this member was always set to ``NULL``, and was defined as:
ru: До версии 3.5 этот член всегда имел значение NULL и определялся как:

source: A traversal function to call during GC traversal of the module object, or ``NULL`` if not needed.
ru: Функция обхода, вызываемая во время обхода GC объекта модуля, или NULL, если не требуется.

source: This function is not called if the module state was requested but is not allocated yet. This is the case immediately after the module is created and before the module is executed (:c:data:`Py_mod_exec` function). More precisely, this function is not called if :c:member:`~PyModuleDef.m_size` is greater than 0 and the module state (as returned by :c:func:`PyModule_GetState`) is ``NULL``.
ru: Эта функция не вызывается, если состояние модуля было запрошено, но еще не выделено. Это происходит сразу после создания модуля и до его выполнения (функция:c:data:`Py_mod_exec`). Точнее, эта функция не вызывается, если :c:member:`~PyModuleDef.m_size` больше 0 и состояние модуля (возвращённое :c:func:`PyModule_GetState`) равно ``NULL``.

source: No longer called before the module state is allocated.
ru: Больше не вызывается до выделения состояния модуля.

source: A clear function to call during GC clearing of the module object, or ``NULL`` if not needed.
ru: Функция очистки, вызываемая во время очистки GC объекта модуля, или NULL, если она не требуется.

source: Like :c:member:`PyTypeObject.tp_clear`, this function is not *always* called before a module is deallocated. For example, when reference counting is enough to determine that an object is no longer used, the cyclic garbage collector is not involved and :c:member:`~PyModuleDef.m_free` is called directly.
ru: Как и :c:member:`PyTypeObject.tp_clear`, эта функция не *всегда* вызывается перед освобождением модуля. Например, когда подсчета ссылок достаточно, чтобы определить, что объект больше не используется, циклический сборщик мусора не задействуется и :c:member:`~PyModuleDef.m_free` вызывается напрямую.

source: A function to call during deallocation of the module object, or ``NULL`` if not needed.
ru: Функция, вызываемая во время освобождения объекта модуля, или NULL, если она не нужна.

source: Single-phase initialization
ru: Однофазная инициализация

source: The module initialization function may create and return the module object directly. This is referred to as "single-phase initialization", and uses one of the following two module creation functions:
ru: Функция инициализации модуля может напрямую создавать и возвращать объект модуля. Это называется «однофазной инициализацией» и использует одну из следующих двух функций создания модуля:

source: Create a new module object, given the definition in *def*. This behaves like :c:func:`PyModule_Create2` with *module_api_version* set to :c:macro:`PYTHON_API_VERSION`.
ru: Создайте новый объект модуля, учитывая определение в *def*. Это ведет себя как :c:func:`PyModule_Create2` с параметром *module_api_version*, установленным в :c:macro:`PYTHON_API_VERSION`.

source: Create a new module object, given the definition in *def*, assuming the API version *module_api_version*. If that version does not match the version of the running interpreter, a :exc:`RuntimeWarning` is emitted.
ru: Создайте новый объект модуля, учитывая определение в *def*, предполагая версию API *module_api_version*. Если эта версия не соответствует версии работающего интерпретатора, выдается :exc:`RuntimeWarning`.

source: Most uses of this function should be using :c:func:`PyModule_Create` instead; only use this if you are sure you need it.
ru: В большинстве случаев вместо этой функции следует использовать :c:func:`PyModule_Create`; используйте это только в том случае, если вы уверены, что вам это нужно.

source: Before it is returned from in the initialization function, the resulting module object is typically populated using functions like :c:func:`PyModule_AddObjectRef`.
ru: Прежде чем он будет возвращен функцией инициализации, результирующий объект модуля обычно заполняется с помощью таких функций, как :c:func:`PyModule_AddObjectRef`.

source: Multi-phase initialization
ru: Многофазная инициализация

source: An alternate way to specify extensions is to request "multi-phase initialization". Extension modules created this way behave more like Python modules: the initialization is split between the *creation phase*, when the module object is created, and the *execution phase*, when it is populated. The distinction is similar to the :py:meth:`!__new__` and :py:meth:`!__init__` methods of classes.
ru: Альтернативный способ указать расширения — запросить «многофазную инициализацию». Модули расширения, созданные таким образом, ведут себя больше как модули Python: инициализация разделена между *фазой создания*, когда создается объект модуля, и *фазой выполнения*, когда он заполняется. Это различие аналогично методам классов :py:meth:`!__new__` и :py:meth:`!__init__`.

source: Unlike modules created using single-phase initialization, these modules are not singletons: if the *sys.modules* entry is removed and the module is re-imported, a new module object is created, and the old module is subject to normal garbage collection -- as with Python modules. By default, multiple modules created from the same definition should be independent: changes to one should not affect the others. This means that all state should be specific to the module object (using e.g. using :c:func:`PyModule_GetState`), or its contents (such as the module's :attr:`~object.__dict__` or individual classes created with :c:func:`PyType_FromSpec`).
ru: В отличие от модулей, созданных с использованием однофазной инициализации, эти модули не являются одиночными: если запись *sys.modules* удалена и модуль повторно импортирован, создается новый объект модуля, а старый модуль подвергается обычной сборке мусора. -- как и в случае с модулями Python. По умолчанию несколько модулей, созданных на основе одного и того же определения, должны быть независимыми: изменения в одном не должны влиять на другие. Это означает, что все состояние должно быть специфичным для объекта модуля (например, с использованием :c:func:`PyModule_GetState`) или его содержимого (например, :attr:`~object.__dict__` модуля или отдельных классов, созданных с помощью :c :func:`PyType_FromSpec`).

source: All modules created using multi-phase initialization are expected to support :ref:`sub-interpreters <sub-interpreter-support>`. Making sure multiple modules are independent is typically enough to achieve this.
ru: Ожидается, что все модули, созданные с использованием многофазной инициализации, будут поддерживать :ref:`субинтерпретаторы <sub-interpreter-support>`. Для этого обычно достаточно убедиться в независимости нескольких модулей.

source: To request multi-phase initialization, the initialization function (PyInit_modulename) returns a :c:type:`PyModuleDef` instance with non-empty :c:member:`~PyModuleDef.m_slots`. Before it is returned, the ``PyModuleDef`` instance must be initialized with the following function:
ru: Чтобы запросить многофазную инициализацию, функция инициализации (PyInit_modulename) возвращает экземпляр :c:type:`PyModuleDef` с непустым :c:member:`~PyModuleDef.m_slots`. Прежде чем он будет возвращен, экземпляр PyModuleDef должен быть инициализирован с помощью следующей функции:

source: Ensures a module definition is a properly initialized Python object that correctly reports its type and reference count.
ru: Гарантирует, что определение модуля является правильно инициализированным объектом Python, который правильно сообщает о своем типе и количестве ссылок.

source: Returns *def* cast to ``PyObject*``, or ``NULL`` if an error occurred.
ru: Возвращает *def* приведение к ``PyObject*`` или ``NULL``, если произошла ошибка.

source: The *m_slots* member of the module definition must point to an array of ``PyModuleDef_Slot`` structures:
ru: Член *m_slots* определения модуля должен указывать на массив структур PyModuleDef_Slot:

source: A slot ID, chosen from the available values explained below.
ru: Идентификатор слота, выбранный из доступных значений, описанных ниже.

source: Value of the slot, whose meaning depends on the slot ID.
ru: Значение слота, значение которого зависит от идентификатора слота.

source: The *m_slots* array must be terminated by a slot with id 0.
ru: Массив *m_slots* должен заканчиваться слотом с идентификатором 0.

source: The available slot types are:
ru: Доступные типы слотов:

source: Specifies a function that is called to create the module object itself. The *value* pointer of this slot must point to a function of the signature:
ru: Указывает функцию, которая вызывается для создания самого объекта модуля. Указатель *value* этого слота должен указывать на функцию подписи:

source: The function receives a :py:class:`~importlib.machinery.ModuleSpec` instance, as defined in :PEP:`451`, and the module definition. It should return a new module object, or set an error and return ``NULL``.
ru: Функция получает экземпляр :py:class:`~importlib.machinery.ModuleSpec`, как определено в :PEP:`451`, и определение модуля. Он должен вернуть новый объект модуля или установить ошибку и вернуть NULL.

source: This function should be kept minimal. In particular, it should not call arbitrary Python code, as trying to import the same module again may result in an infinite loop.
ru: Эта функция должна быть минимальной. В частности, он не должен вызывать произвольный код Python, поскольку попытка повторного импорта того же модуля может привести к бесконечному циклу.

source: Multiple ``Py_mod_create`` slots may not be specified in one module definition.
ru: В одном определении модуля нельзя указать несколько слотов Py_mod_create.

source: If ``Py_mod_create`` is not specified, the import machinery will create a normal module object using :c:func:`PyModule_New`. The name is taken from *spec*, not the definition, to allow extension modules to dynamically adjust to their place in the module hierarchy and be imported under different names through symlinks, all while sharing a single module definition.
ru: Если ``Py_mod_create`` не указан, механизм импорта создаст обычный объект модуля, используя :c:func:`PyModule_New`. Имя взято из *spec*, а не из определения, чтобы позволить модулям расширения динамически подстраиваться под свое место в иерархии модулей и импортироваться под разными именами через символические ссылки, при этом используя одно определение модуля.

source: There is no requirement for the returned object to be an instance of :c:type:`PyModule_Type`. Any type can be used, as long as it supports setting and getting import-related attributes. However, only ``PyModule_Type`` instances may be returned if the ``PyModuleDef`` has non-``NULL`` ``m_traverse``, ``m_clear``, ``m_free``; non-zero ``m_size``; or slots other than ``Py_mod_create``.
ru: Не требуется, чтобы возвращаемый объект был экземпляром :c:type:`PyModule_Type`. Можно использовать любой тип, если он поддерживает установку и получение атрибутов, связанных с импортом. Однако могут быть возвращены только экземпляры PyModule_Type, если PyModuleDef имеет значения, отличные от NULL, ``m_traverse``, ``m_clear``, ``m_free``; ненулевой ``m_size``; или слоты, отличные от ``Py_mod_create``.

source: Specifies a function that is called to *execute* the module. This is equivalent to executing the code of a Python module: typically, this function adds classes and constants to the module. The signature of the function is:
ru: Указывает функцию, которая вызывается для *выполнения* модуля. Это эквивалентно выполнению кода модуля Python: обычно эта функция добавляет в модуль классы и константы. Сигнатура функции:

source: If multiple ``Py_mod_exec`` slots are specified, they are processed in the order they appear in the *m_slots* array.
ru: Если указано несколько слотов Py_mod_exec, они обрабатываются в том порядке, в котором они появляются в массиве *m_slots*.

source: Specifies one of the following values:
ru: Указывает одно из следующих значений:

source: The module does not support being imported in subinterpreters.
ru: Модуль не поддерживает импорт в субинтерпретаторы.

source: The module supports being imported in subinterpreters, but only when they share the main interpreter's GIL. (See :ref:`isolating-extensions-howto`.)
ru: Модуль поддерживает импорт в подинтерпретаторы, но только если они используют GIL основного интерпретатора. (См. :ref:`isolating-extensions-howto`.)

source: The module supports being imported in subinterpreters, even when they have their own GIL. (See :ref:`isolating-extensions-howto`.)
ru: Модуль поддерживает импорт в субинтерпретаторы, даже если у них есть собственный GIL. (См. :ref:`isolating-extensions-howto`.)

source: This slot determines whether or not importing this module in a subinterpreter will fail.
ru: Этот слот определяет, завершится ли импорт этого модуля в субинтерпретаторе неудачно.

source: Multiple ``Py_mod_multiple_interpreters`` slots may not be specified in one module definition.
ru: Несколько слотов Py_mod_multiple_interpreters не могут быть указаны в одном определении модуля.

source: If ``Py_mod_multiple_interpreters`` is not specified, the import machinery defaults to ``Py_MOD_MULTIPLE_INTERPRETERS_NOT_SUPPORTED``.
ru: Если ``Py_mod_multiple_interpreters`` не указан, механизм импорта по умолчанию использует ``Py_MOD_MULTIPLE_INTERPRETERS_NOT_SUPPORTED``.

source: The module depends on the presence of the global interpreter lock (GIL), and may access global state without synchronization.
ru: Модуль зависит от наличия глобальной блокировки интерпретатора (GIL) и может получать доступ к глобальному состоянию без синхронизации.

source: The module is safe to run without an active GIL.
ru: Модуль безопасно запускать без активного GIL.

source: This slot is ignored by Python builds not configured with :option:`--disable-gil`. Otherwise, it determines whether or not importing this module will cause the GIL to be automatically enabled. See :ref:`whatsnew313-free-threaded-cpython` for more detail.
ru: Этот слот игнорируется сборками Python, не настроенными с помощью :option:`--disable-gil`. В противном случае он определяет, приведет ли импорт этого модуля к автоматическому включению GIL. Более подробную информацию смотрите в :ref:`whatsnew313-free-threaded-cpython`.
