Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/perfmaps.po
Languages: ru

source: Support for Perf Maps
ru: Поддержка карт производительности

source: On supported platforms (as of this writing, only Linux), the runtime can take advantage of *perf map files* to make Python functions visible to an external profiling tool (such as `perf <https://perf.wiki.kernel.org/index.php/Main_Page>`_). A running process may create a file in the ``/tmp`` directory, which contains entries that can map a section of executable code to a name. This interface is described in the `documentation of the Linux Perf tool <https://git.kernel.org/pub/scm/linux/ kernel/git/torvalds/linux.git/tree/tools/perf/Documentation/jit-interface.txt>`_.
ru: На поддерживаемых платформах (на момент написания статьи только Linux) среда выполнения может использовать *файлы карт памяти*, чтобы сделать функции Python видимыми для внешнего инструмента профилирования (например, `perf <https://perf.wiki.kernel.org/index.php/Main_Page>`_ ). Запущенный процесс может создать файл в ``/tmp`` каталог, содержащий записи, которые могут сопоставить раздел исполняемого кода с именем. Этот интерфейс описан в документации инструмента Linux Perf <https://git.kernel.org/pub/scm/linux/kernel/git/torvalds/linux.git/tree/tools/perf/Documentation/jit- интерфейс.txt>`_.

source: In Python, these helper APIs can be used by libraries and features that rely on generating machine code on the fly.
ru: В Python эти вспомогательные API-интерфейсы могут использоваться библиотеками и функциями, которые полагаются на генерацию машинного кода на лету.

source: Note that holding the Global Interpreter Lock (GIL) is not required for these APIs.
ru: Обратите внимание, что для этих API не требуется сохранение глобальной блокировки интерпретатора (GIL).

source: Open the ``/tmp/perf-$pid.map`` file, unless it's already opened, and create a lock to ensure thread-safe writes to the file (provided the writes are done through :c:func:`PyUnstable_WritePerfMapEntry`). Normally, there's no need to call this explicitly; just use :c:func:`PyUnstable_WritePerfMapEntry` and it will initialize the state on first call.
ru: Откройте ``/tmp/perf-$pid.map`` файл, если он еще не открыт, и создайте блокировку, чтобы гарантировать потокобезопасную запись в файл (при условии, что запись выполняется через :c:func:`PyUnstable_WritePerfMapEntry` ). Обычно нет необходимости вызывать это явно; просто используй :c:func:`PyUnstable_WritePerfMapEntry` и он инициализирует состояние при первом вызове.

source: Returns ``0`` on success, ``-1`` on failure to create/open the perf map file, or ``-2`` on failure to create a lock. Check ``errno`` for more information about the cause of a failure.
ru: Возврат ``0`` об успехе, ``-1`` при невозможности создать/открыть файл карты производительности или ``-2`` при невозможности создания блокировки. Проверять ``ошибка`` для получения дополнительной информации о причине сбоя.

source: Write one single entry to the ``/tmp/perf-$pid.map`` file. This function is thread safe. Here is what an example entry looks like::
ru: Напишите одну запись в ``/tmp/perf-$pid.map`` файл. Эта функция является потокобезопасной. Вот как выглядит пример записи:

source: # address size name 7f3529fcf759 b py::bar:/run/t.py
ru: # размер адреса имя 7f3529fcf759 b py::bar:/run/t.py

source: Will call :c:func:`PyUnstable_PerfMapState_Init` before writing the entry, if the perf map file is not already opened. Returns ``0`` on success, or the same error codes as :c:func:`PyUnstable_PerfMapState_Init` on failure.
ru: позвоню :c:func:`PyUnstable_PerfMapState_Init` перед записью записи, если файл карты производительности еще не открыт. Возврат ``0`` в случае успеха или те же коды ошибок, что и :c:func:`PyUnstable_PerfMapState_Init` при неудаче.

source: Close the perf map file opened by :c:func:`PyUnstable_PerfMapState_Init`. This is called by the runtime itself during interpreter shut-down. In general, there shouldn't be a reason to explicitly call this, except to handle specific scenarios such as forking.
ru: Закройте файл карты производительности, открытый :c:func:`PyUnstable_PerfMapState_Init` . Это вызывается самой средой выполнения во время завершения работы интерпретатора. В общем, не должно быть причин для явного вызова этого, кроме как для обработки определенных сценариев, таких как разветвление.
