Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/reflection.po
Languages: ru

source: Reflection
ru: Отражение

source: Use :c:func:`PyEval_GetFrameBuiltins` instead.
ru: Вместо этого используйте :c:func:`PyEval_GetFrameBuiltins`.

source: Return a dictionary of the builtins in the current execution frame, or the interpreter of the thread state if no frame is currently executing.
ru: Возвращает словарь встроенных функций в текущем кадре выполнения или интерпретатор состояния потока, если в данный момент ни один кадр не выполняется.

source: Use either :c:func:`PyEval_GetFrameLocals` to obtain the same behaviour as calling :func:`locals` in Python code, or else call :c:func:`PyFrame_GetLocals` on the result of :c:func:`PyEval_GetFrame` to access the :attr:`~frame.f_locals` attribute of the currently executing frame.
ru: Используйте либо :c:func:`PyEval_GetFrameLocals`, чтобы получить то же поведение, что и вызов :func:`locals` в коде Python, либо вызовите :c:func:`PyFrame_GetLocals` для результата :c:func:`PyEval_GetFrame` для доступа к атрибуту :attr:`~frame.f_locals` текущего исполняемого кадра.

source: Return a mapping providing access to the local variables in the current execution frame, or ``NULL`` if no frame is currently executing.
ru: Возвращает отображение, обеспечивающее доступ к локальным переменным в текущем кадре выполнения, или NULL, если в данный момент ни один кадр не выполняется.

source: Refer to :func:`locals` for details of the mapping returned at different scopes.
ru: Обратитесь к :func:`locals` для получения подробной информации о сопоставлении, возвращаемом в различных областях видимости.

source: As this function returns a :term:`borrowed reference`, the dictionary returned for :term:`optimized scopes <optimized scope>` is cached on the frame object and will remain alive as long as the frame object does. Unlike :c:func:`PyEval_GetFrameLocals` and :func:`locals`, subsequent calls to this function in the same frame will update the contents of the cached dictionary to reflect changes in the state of the local variables rather than returning a new snapshot.
ru: Поскольку эта функция возвращает :term:`заимствованную ссылку`, словарь, возвращаемый для :term:`оптимизированных областей <оптимизированная область>`, кэшируется в объекте фрейма и будет оставаться активным до тех пор, пока работает объект фрейма. В отличие от :c:func:`PyEval_GetFrameLocals` и :func:`locals`, последующие вызовы этой функции в том же кадре будут обновлять содержимое кэшированного словаря, чтобы отразить изменения в состоянии локальных переменных, а не возвращать новый снимок. .

source: As part of :pep:`667`, :c:func:`PyFrame_GetLocals`, :func:`locals`, and :attr:`FrameType.f_locals <frame.f_locals>` no longer make use of the shared cache dictionary. Refer to the :ref:`What's New entry <whatsnew313-locals-semantics>` for additional details.
ru: Как часть :pep:`667`, :c:func:`PyFrame_GetLocals`, :func:`locals` и :attr:`FrameType.f_locals <frame.f_locals>` больше не используют словарь общего кэша. Дополнительные сведения см. в разделе :ref:`Что нового <whatsnew313-locals-semantics>`.

source: Use :c:func:`PyEval_GetFrameGlobals` instead.
ru: Вместо этого используйте :c:func:`PyEval_GetFrameGlobals`.

source: Return a dictionary of the global variables in the current execution frame, or ``NULL`` if no frame is currently executing.
ru: Возвращает словарь глобальных переменных в текущем кадре выполнения или ``NULL``, если ни один кадр в данный момент не выполняется.

source: Return the current thread state's frame, which is ``NULL`` if no frame is currently executing.
ru: Возвращает кадр текущего состояния потока, который равен NULL, если в данный момент ни один кадр не выполняется.

source: See also :c:func:`PyThreadState_GetFrame`.
ru: См. также :c:func:`PyThreadState_GetFrame`.

source: Return a dictionary of the local variables in the current execution frame, or ``NULL`` if no frame is currently executing. Equivalent to calling :func:`locals` in Python code.
ru: Возвращает словарь локальных переменных в текущем кадре выполнения или ``NULL``, если ни один кадр в данный момент не выполняется. Эквивалент вызова :func:`locals` в коде Python.

source: To access :attr:`~frame.f_locals` on the current frame without making an independent snapshot in :term:`optimized scopes <optimized scope>`, call :c:func:`PyFrame_GetLocals` on the result of :c:func:`PyEval_GetFrame`.
ru: Чтобы получить доступ к :attr:`~frame.f_locals` в текущем кадре без создания независимого снимка в :term:`optimized Scops <optimized Scope>`, вызовите :c:func:`PyFrame_GetLocals` для результата :c:func :`PyEval_GetFrame`.

source: Return a dictionary of the global variables in the current execution frame, or ``NULL`` if no frame is currently executing. Equivalent to calling :func:`globals` in Python code.
ru: Возвращает словарь глобальных переменных в текущем кадре выполнения или ``NULL``, если ни один кадр в данный момент не выполняется. Эквивалент вызова :func:`globals` в коде Python.

source: Return the name of *func* if it is a function, class or instance object, else the name of *func*\s type.
ru: Возвращает имя *func*, если это функция, класс или объект экземпляра, в противном случае — имя типа *func*\s.

source: Return a description string, depending on the type of *func*. Return values include "()" for functions and methods, " constructor", " instance", and " object". Concatenated with the result of :c:func:`PyEval_GetFuncName`, the result will be a description of *func*.
ru: Возвращает строку описания, в зависимости от типа *func*. Возвращаемые значения включают «()» для функций и методов, «конструктор», «экземпляр» и «объект». Объединенный с результатом :c:func:`PyEval_GetFuncName`, результатом будет описание *func*.
