Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/set.po
Languages: ru

source: Set Objects
ru: Установить объекты

source: This section details the public API for :class:`set` and :class:`frozenset` objects. Any functionality not listed below is best accessed using either the abstract object protocol (including :c:func:`PyObject_CallMethod`, :c:func:`PyObject_RichCompareBool`, :c:func:`PyObject_Hash`, :c:func:`PyObject_Repr`, :c:func:`PyObject_IsTrue`, :c:func:`PyObject_Print`, and :c:func:`PyObject_GetIter`) or the abstract number protocol (including :c:func:`PyNumber_And`, :c:func:`PyNumber_Subtract`, :c:func:`PyNumber_Or`, :c:func:`PyNumber_Xor`, :c:func:`PyNumber_InPlaceAnd`, :c:func:`PyNumber_InPlaceSubtract`, :c:func:`PyNumber_InPlaceOr`, and :c:func:`PyNumber_InPlaceXor`).
ru: В этом разделе подробно описан общедоступный API для объектов :class:`set` и :class:`frozenset`. К любой функциональности, не указанной ниже, лучше всего обращаться с использованием протокола абстрактных объектов (включая :c:func:` PyObj ect_CallMethod`, :c:func:` PyObj ect_RichCompareBool`, :c:func:` PyObj ect_Hash`, :c:func :` PyObj ect_Repr`, :c:func:` PyObj ect_IsTrue`, :c:func:` PyObj ect_Print` и :c:func:` PyObj ect_GetIter`) или протокол абстрактных чисел (включая :c:func:` PyNumber_And`, :c:func:`PyNumber_Subtract`, :c:func:`PyNumber_Or`, :c:func:`PyNumber_Xor`, :c:func:`PyNumber_InPlaceAnd`, :c:func:`PyNumber_InPlaceSubtract`, :c :func:`PyNumber_InPlaceOr` и :c:func:`PyNumber_InPlaceXor`).

source: This subtype of :c:type:`PyObject` is used to hold the internal data for both :class:`set` and :class:`frozenset` objects. It is like a :c:type:`PyDictObject` in that it is a fixed size for small sets (much like tuple storage) and will point to a separate, variable sized block of memory for medium and large sized sets (much like list storage). None of the fields of this structure should be considered public and all are subject to change. All access should be done through the documented API rather than by manipulating the values in the structure.
ru: Этот подтип :c:type:` PyObject` используется для хранения внутренних данных как для объектов :class:`set`, так и :class:`frozenset`. Он похож на :c:type:`PyDictObject` в том, что он имеет фиксированный размер для небольших наборов (так же, как хранилище кортежей) и будет указывать на отдельный блок памяти переменного размера для наборов среднего и большого размера (очень похоже на список хранилище). Ни одно из полей этой структуры не должно считаться общедоступным, и все они могут быть изменены. Весь доступ должен осуществляться через документированный API, а не путем манипулирования значениями в структуре.

source: This is an instance of :c:type:`PyTypeObject` representing the Python :class:`set` type.
ru: Это экземпляр :c:type:`PyTypeObject`, представляющий тип :class:`set` Python.

source: This is an instance of :c:type:`PyTypeObject` representing the Python :class:`frozenset` type.
ru: Это экземпляр :c:type:`PyTypeObject`, представляющий тип :class:`frozenset` Python.

source: The following type check macros work on pointers to any Python object. Likewise, the constructor functions work with any iterable Python object.
ru: Следующие макросы проверки типов работают с указателями на любой объект Python. Аналогично, функции-конструкторы работают с любым итерируемым объектом Python.

source: Return true if *p* is a :class:`set` object or an instance of a subtype. This function always succeeds.
ru: Возвращайте true, если *p* является объектом :class:`set` или экземпляром подтипа. Эта функция всегда завершается успешно.

source: Return true if *p* is a :class:`frozenset` object or an instance of a subtype. This function always succeeds.
ru: Возвращайте true, если *p* является объектом :class:`frozenset` или экземпляром подтипа. Эта функция всегда завершается успешно.

source: Return true if *p* is a :class:`set` object, a :class:`frozenset` object, or an instance of a subtype. This function always succeeds.
ru: Возвращайте true, если *p* является объектом :class:`set`, объектом :class:`frozenset` или экземпляром подтипа. Эта функция всегда завершается успешно.

source: Return true if *p* is a :class:`set` object but not an instance of a subtype. This function always succeeds.
ru: Возвращайте true, если *p* является объектом :class:`set`, но не экземпляром подтипа. Эта функция всегда завершается успешно.

source: Return true if *p* is a :class:`set` object or a :class:`frozenset` object but not an instance of a subtype. This function always succeeds.
ru: Возвращает true, если *p* является объектом :class:`set` или :class:`frozenset`, но не экземпляром подтипа. Эта функция всегда завершается успешно.

source: Return true if *p* is a :class:`frozenset` object but not an instance of a subtype. This function always succeeds.
ru: Возвращайте true, если *p* является объектом :class:`frozenset`, но не экземпляром подтипа. Эта функция всегда завершается успешно.

source: Return a new :class:`set` containing objects returned by the *iterable*. The *iterable* may be ``NULL`` to create a new empty set. Return the new set on success or ``NULL`` on failure. Raise :exc:`TypeError` if *iterable* is not actually iterable. The constructor is also useful for copying a set (``c=set(s)``).
ru: Вернуть новый :class:`set`, содержащий объекты, возвращаемые *iterable*. *iterable* может иметь значение NULL, чтобы создать новый пустой набор. Возвращает новый набор в случае успеха или ``NULL`` в случае неудачи. Поднимите :exc:`TypeError`, если *iterable* на самом деле не является итерируемым. Конструктор также полезен для копирования набора (``c=set(s)``).

source: Return a new :class:`frozenset` containing objects returned by the *iterable*. The *iterable* may be ``NULL`` to create a new empty frozenset. Return the new set on success or ``NULL`` on failure. Raise :exc:`TypeError` if *iterable* is not actually iterable.
ru: Верните новый :class:`frozenset`, содержащий объекты, возвращаемые *iterable*. *iterable* может иметь значение NULL, чтобы создать новый пустой замороженный набор. Возвращает новый набор в случае успеха или ``NULL`` в случае неудачи. Поднимите :exc:`TypeError`, если *iterable* на самом деле не является итерируемым.

source: The following functions and macros are available for instances of :class:`set` or :class:`frozenset` or instances of their subtypes.
ru: Следующие функции и макросы доступны для экземпляров :class:`set` или :class:`frozenset` или экземпляров их подтипов.

source: Return the length of a :class:`set` or :class:`frozenset` object. Equivalent to ``len(anyset)``. Raises a :exc:`SystemError` if *anyset* is not a :class:`set`, :class:`frozenset`, or an instance of a subtype.
ru: Возвращает длину объекта :class:`set` или :class:`frozenset`. Эквивалент ``len(anyset)``. Вызывает :exc:`SystemError`, если *anyset* не является :class:`set`, :class:`frozenset` или экземпляром подтипа.

source: Macro form of :c:func:`PySet_Size` without error checking.
ru: Макрос-форма :c:func:`PySet_Size` без проверки ошибок.

source: Return ``1`` if found, ``0`` if not found, and ``-1`` if an error is encountered. Unlike the Python :meth:`~object.__contains__` method, this function does not automatically convert unhashable sets into temporary frozensets. Raise a :exc:`TypeError` if the *key* is unhashable. Raise :exc:`SystemError` if *anyset* is not a :class:`set`, :class:`frozenset`, or an instance of a subtype.
ru: Возвращайте ``1``, если найдено, ``0``, если не найдено, и ``-1``, если обнаружена ошибка. В отличие от метода Python :meth:`~object.__contains__`, эта функция не преобразует автоматически нехэшируемые наборы во временные замороженные наборы. Вызовите :exc:`TypeError`, если *ключ* не хешируется. Поднимите :exc:`SystemError`, если *anyset* не является :class:`set`, :class:`frozenset` или экземпляром подтипа.

source: Add *key* to a :class:`set` instance. Also works with :class:`frozenset` instances (like :c:func:`PyTuple_SetItem` it can be used to fill in the values of brand new frozensets before they are exposed to other code). Return ``0`` on success or ``-1`` on failure. Raise a :exc:`TypeError` if the *key* is unhashable. Raise a :exc:`MemoryError` if there is no room to grow. Raise a :exc:`SystemError` if *set* is not an instance of :class:`set` or its subtype.
ru: Добавьте *key* в экземпляр :class:`set`. Также работает с экземплярами :class:`frozenset` (например, :c:func:`PyTuple_SetItem`, его можно использовать для заполнения значений совершенно новых замороженных наборов, прежде чем они будут доступны другому коду). Возвращайте ``0`` в случае успеха или ``-1`` в случае неудачи. Вызовите :exc:`TypeError`, если *ключ* не хешируется. Вызовите :exc:`MemoryError`, если нет места для роста. Вызовите :exc:`SystemError`, если *set* не является экземпляром :class:`set` или его подтипа.

source: The following functions are available for instances of :class:`set` or its subtypes but not for instances of :class:`frozenset` or its subtypes.
ru: Следующие функции доступны для экземпляров :class:`set` или его подтипов, но не для экземпляров :class:`frozenset` или его подтипов.

source: Return ``1`` if found and removed, ``0`` if not found (no action taken), and ``-1`` if an error is encountered. Does not raise :exc:`KeyError` for missing keys. Raise a :exc:`TypeError` if the *key* is unhashable. Unlike the Python :meth:`~frozenset.discard` method, this function does not automatically convert unhashable sets into temporary frozensets. Raise :exc:`SystemError` if *set* is not an instance of :class:`set` or its subtype.
ru: Возвращайте ``1``, если он найден и удален, ``0``, если не найден (не предпринято никаких действий), и ``-1``, если обнаружена ошибка. Не вызывает :exc:`KeyError` при отсутствии ключей. Вызовите :exc:`TypeError`, если *ключ* не хешируется. В отличие от метода Python :meth:`~frozenset.discard`, эта функция не преобразует автоматически нехешируемые наборы во временные замороженные наборы. Поднимите :exc:`SystemError`, если *set* не является экземпляром :class:`set` или его подтипа.

source: Return a new reference to an arbitrary object in the *set*, and removes the object from the *set*. Return ``NULL`` on failure. Raise :exc:`KeyError` if the set is empty. Raise a :exc:`SystemError` if *set* is not an instance of :class:`set` or its subtype.
ru: Возвращает новую ссылку на произвольный объект в *наборе* и удаляет объект из *набора*. Возвращайте ``NULL`` в случае неудачи. Поднимите :exc:`KeyError`, если набор пуст. Вызовите :exc:`SystemError`, если *set* не является экземпляром :class:`set` или его подтипа.

source: Empty an existing set of all elements. Return ``0`` on success. Return ``-1`` and raise :exc:`SystemError` if *set* is not an instance of :class:`set` or its subtype.
ru: Очистить существующий набор всех элементов. Верните ``0`` в случае успеха. Верните ``-1`` и вызовите :exc:`SystemError`, если *set* не является экземпляром :class:`set` или его подтипа.

source: object
ru: объект

source: set
ru: установить

source: built-in function
ru: встроенная функция
