Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/slice.po
Languages: es_es, ru

source: Slice Objects
es_es: Rebanar objetos
ru: Объекты среза

source: The type object for slice objects. This is the same as :class:`slice` in the Python layer.
es_es: El objeto de tipo para los objetos de rebanada. Es el mismo que :class:`slice` en la capa de Python.
ru: Тип объекта для объектов среза. Это то же самое, что и :class:`slice` на уровне Python.

source: Return true if *ob* is a slice object; *ob* must not be ``NULL``. This function always succeeds.
es_es: Devuelve true si *ob* es un objeto de rebanada; *ob* no debe ser ``NULL``. Esta función siempre tiene éxito.
ru: Возвращает true, если *ob* является объектом среза; *ob* не должно быть ``NULL``. Эта функция всегда завершается успешно.

source: Return a new slice object with the given values. The *start*, *stop*, and *step* parameters are used as the values of the slice object attributes of the same names. Any of the values may be ``NULL``, in which case the ``None`` will be used for the corresponding attribute.
ru: Верните новый объект среза с заданными значениями. Параметры *start*, *stop* и *step* используются как значения одноименных атрибутов объекта среза. Любое из значений может быть NULL, и в этом случае для соответствующего атрибута будет использоваться None.

source: Return ``NULL`` with an exception set if the new object could not be allocated.
ru: Возвращает NULL с установленным исключением, если новый объект не может быть выделен.

source: Retrieve the start, stop and step indices from the slice object *slice*, assuming a sequence of length *length*. Treats indices greater than *length* as errors.
es_es: Recupera los índices de inicio, fin y paso del objeto *slice*, suponiendo una secuencia de longitud *length*. Trata los índices mayores que *length* como errores.
ru: Получите индексы начала, остановки и шага из объекта среза *slice*, предполагая, что последовательность имеет длину *length*. Индексы, превышающие *длину*, рассматриваются как ошибки.

source: Returns ``0`` on success and ``-1`` on error with no exception set (unless one of the indices was not ``None`` and failed to be converted to an integer, in which case ``-1`` is returned with an exception set).
ru: Возвращает ``0`` в случае успеха и ``-1`` в случае ошибки без установки исключений (если только один из индексов не был ``None`` и его не удалось преобразовать в целое число, в этом случае ``-1 `` возвращается с набором исключений).

source: You probably do not want to use this function.
es_es: Probablemente no quieras usar esta función.
ru: Вероятно, вы не захотите использовать эту функцию.

source: The parameter type for the *slice* parameter was ``PySliceObject*`` before.
es_es: El tipo de parámetro para el parámetro *slice* antes era ``PySliceObject*``.
ru: Раньше типом параметра *slice* был ``PySliceObject*``.

source: Usable replacement for :c:func:`PySlice_GetIndices`. Retrieve the start, stop, and step indices from the slice object *slice* assuming a sequence of length *length*, and store the length of the slice in *slicelength*. Out of bounds indices are clipped in a manner consistent with the handling of normal slices.
es_es: Sustituto útil de :c:func:`PySlice_GetIndices`. Recupera los índices de inicio, parada y paso del objeto de rebanada *slice* asumiendo una secuencia de longitud *length*, y almacena la longitud del slice en *slicelength*. Los índices fuera de los límites se recortan de forma consistente con el manejo de las rebanadas normales.
ru: Полезная замена :c:func:`PySlice_GetIndices`. Извлеките индексы начала, остановки и шага из объекта среза *slice*, предполагая, что последовательность имеет длину *length*, и сохраните длину среза в *slicelength*. Индексы выхода за пределы отсекаются способом, соответствующим обработке обычных срезов.

source: Return ``0`` on success and ``-1`` on error with an exception set.
ru: Возвращает ``0`` в случае успеха и ``-1`` в случае ошибки с установленным исключением.

source: This function is considered not safe for resizable sequences. Its invocation should be replaced by a combination of :c:func:`PySlice_Unpack` and :c:func:`PySlice_AdjustIndices` where ::
es_es: Esta función se considera no segura para secuencias redimensionables. Su invocación debe ser reemplazada por una combinación de :c:func:`PySlice_Unpack` y :c:func:`PySlice_AdjustIndices` donde ::
ru: Эта функция считается небезопасной для последовательностей с изменяемым размером. Его вызов следует заменить комбинацией :c:func:`PySlice_Unpack` и :c:func:`PySlice_AdjustIndices`, где::

source: is replaced by ::
es_es: se sustituye por ::
ru: заменяется на::

source: If ``Py_LIMITED_API`` is not set or set to the value between ``0x03050400`` and ``0x03060000`` (not including) or ``0x03060100`` or higher :c:func:`!PySlice_GetIndicesEx` is implemented as a macro using :c:func:`!PySlice_Unpack` and :c:func:`!PySlice_AdjustIndices`. Arguments *start*, *stop* and *step* are evaluated more than once.
es_es: Si ``Py_LIMITED_API`` no se establece o se establece en el valor entre ``0x03050400`` y ``0x03060000`` (sin incluir) o ``0x03060100`` o superior :c:func:`!PySlice_GetIndicesEx` se implementa como una macro utilizando :c:func:`!PySlice_Unpack` y :c:func:`!PySlice_AdjustIndices`. Los argumentos *start*, *stop* y *step* se evalúan más de una vez.
ru: Если ``Py_LIMITED_API`` не установлен или ему присвоено значение между ``0x03050400`` и ``0x03060000`` (не включая) или ``0x03060100`` или выше, :c:func:`!PySlice_GetIndicesEx` реализуется как макрос с использованием :c:func:`!PySlice_Unpack` и :c:func:`!PySlice_AdjustIndices`. Аргументы *start*, *stop* и *step* оцениваются более одного раза.

source: If ``Py_LIMITED_API`` is set to the value less than ``0x03050400`` or between ``0x03060000`` and ``0x03060100`` (not including) :c:func:`!PySlice_GetIndicesEx` is a deprecated function.
es_es: Si ``Py_LIMITED_API`` se establece en el valor inferior a ``0x03050400`` o entre ``0x03060000`` y ``0x03060100`` (sin incluir) :c:func:`!PySlice_GetIndicesEx` es una función obsoleta.
ru: Если для Py_LIMITED_API установлено значение меньше 0x03050400 или между 0x03060000 и 0x03060100 (не включая), :c:func:`!PySlice_GetIndicesEx` является устаревшей функцией.

source: Extract the start, stop and step data members from a slice object as C integers. Silently reduce values larger than ``PY_SSIZE_T_MAX`` to ``PY_SSIZE_T_MAX``, silently boost the start and stop values less than ``PY_SSIZE_T_MIN`` to ``PY_SSIZE_T_MIN``, and silently boost the step values less than ``-PY_SSIZE_T_MAX`` to ``-PY_SSIZE_T_MAX``.
es_es: Extraer los datos de inicio, parada y paso de un objeto de rebanada como enteros C. Reduzca silenciosamente los valores mayores que ``PY_SSIZE_T_MAX`` a ``PY_SSIZE_T_MAX``, aumente silenciosamente los valores de inicio y parada menores que ``PY_SSIZE_T_MIN`` a ``PY_SSIZE_T_MIN``, y aumente silenciosamente los valores de paso menores que ``-PY_SSIZE_T_MAX`` a ``-PY_SSIZE_T_MAX``.
ru: Извлеките элементы данных начала, остановки и шага из объекта среза как целые числа C. Тихо уменьшайте значения, превышающие ``PY_SSIZE_T_MAX``, до ``PY_SSIZE_T_MAX``, автоматически увеличивайте начальные и конечные значения меньше, чем ``PY_SSIZE_T_MIN``, до ``PY_SSIZE_T_MIN`` и незаметно увеличивайте значения шага меньше, чем ``-PY_SSIZE_T_MAX. `` до ``-PY_SSIZE_T_MAX``.

source: Return ``-1`` with an exception set on error, ``0`` on success.
ru: Возвращает ``-1`` с установленным исключением в случае ошибки и ``0`` в случае успеха.

source: Adjust start/end slice indices assuming a sequence of the specified length. Out of bounds indices are clipped in a manner consistent with the handling of normal slices.
es_es: Ajustar los índices de inicio/fin de la rebanada asumiendo una secuencia de la longitud especificada. Los índices fuera de rango se recortan de manera consistente con el manejo de las rebanadas normales.
ru: Отрегулируйте индексы начала/конца фрагмента, предполагая, что последовательность указанной длины. Индексы выхода за пределы отсекаются способом, соответствующим обработке обычных срезов.

source: Return the length of the slice. Always successful. Doesn't call Python code.
es_es: Devuelve la longitud del corte. Siempre con éxito. No llama a código Python.
ru: Возвращает длину среза. Всегда успешен. Не вызывает код Python.

source: Ellipsis Object
es_es: Objeto elipsis
ru: Объект с многоточием

source: The Python ``Ellipsis`` object. This object has no methods. Like :c:data:`Py_None`, it is an :term:`immortal` singleton object.
ru: Объект Python ``Ellipsis``. У этого объекта нет методов. Как и :c:data:`Py_None`, это :term:`immortal` одноэлементный объект.
