Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/stable.po
Languages: ru

source: C API Stability
ru: Стабильность C API

source: Unless documented otherwise, Python's C API is covered by the Backwards Compatibility Policy, :pep:`387`. Most changes to it are source-compatible (typically by only adding new API). Changing existing API or removing API is only done after a deprecation period or to fix serious issues.
ru: Если не указано иное, API Python C подпадает под действие Политики обратной совместимости, :pep:`387`. Большинство изменений в нем совместимы с исходным кодом (обычно путем добавления только нового API). Изменение существующего API или удаление API производится только по истечении периода устаревания или для устранения серьезных проблем.

source: CPython's Application Binary Interface (ABI) is forward- and backwards-compatible across a minor release (if these are compiled the same way; see :ref:`stable-abi-platform` below). So, code compiled for Python 3.10.0 will work on 3.10.8 and vice versa, but will need to be compiled separately for 3.9.x and 3.11.x.
ru: Двоичный интерфейс приложения (ABI) CPython совместим как вперед, так и назад во всех второстепенных выпусках (если они скомпилированы одинаково; см. :ref:`stable-abi-platform` ниже). Итак, код, скомпилированный для Python 3.10.0, будет работать на 3.10.8 и наоборот, но для 3.9.x и 3.11.x его нужно будет компилировать отдельно.

source: There are two tiers of C API with different stability expectations:
ru: Существует два уровня C API с разными ожиданиями стабильности:

source: :ref:`Unstable API <unstable-c-api>`, may change in minor versions without a deprecation period. It is marked by the ``PyUnstable`` prefix in names.
ru: :ref:`Нестабильный API <unstable-c-api>`, может меняться в второстепенных версиях без периода устаревания. Он отмечен префиксом PyUnstable в именах.

source: :ref:`Limited API <limited-c-api>`, is compatible across several minor releases. When :c:macro:`Py_LIMITED_API` is defined, only this subset is exposed from ``Python.h``.
ru: :ref:`Limited API <limited-c-api>` совместим с несколькими второстепенными выпусками. Когда :c:macro:`Py_LIMITED_API` определен, из ``Python.h`` предоставляется только это подмножество.

source: These are discussed in more detail below.
ru: Более подробно они обсуждаются ниже.

source: Names prefixed by an underscore, such as ``_Py_InternalState``, are private API that can change without notice even in patch releases. If you need to use this API, consider reaching out to `CPython developers <https://discuss.python.org/c/core-dev/c-api/30>`_ to discuss adding public API for your use case.
ru: Имена с префиксом подчеркивания, такие как ``_Py_InternalState``, представляют собой частный API, который может быть изменен без предварительного уведомления даже в выпусках исправлений. Если вам нужно использовать этот API, рассмотрите возможность обращения к `разработчикам CPython <https://discuss.python.org/c/core-dev/c-api/30>`_, чтобы обсудить добавление общедоступного API для вашего варианта использования.

source: Unstable C API
ru: Нестабильный C API

source: Any API named with the ``PyUnstable`` prefix exposes CPython implementation details, and may change in every minor release (e.g. from 3.9 to 3.10) without any deprecation warnings. However, it will not change in a bugfix release (e.g. from 3.10.0 to 3.10.1).
ru: Любой API с префиксом ``PyUnstable`` раскрывает детали реализации CPython и может меняться в каждой второстепенной версии (например, с 3.9 на 3.10) без каких-либо предупреждений об устаревании. Однако это не изменится в версии с исправлением ошибок (например, с 3.10.0 на 3.10.1).

source: It is generally intended for specialized, low-level tools like debuggers.
ru: Обычно он предназначен для специализированных инструментов низкого уровня, таких как отладчики.

source: Projects that use this API are expected to follow CPython development and spend extra effort adjusting to changes.
ru: Ожидается, что проекты, использующие этот API, будут следовать за развитием CPython и прилагать дополнительные усилия для адаптации к изменениям.

source: Stable Application Binary Interface
ru: Стабильный двоичный интерфейс приложения

source: For simplicity, this document talks about *extensions*, but the Limited API and Stable ABI work the same way for all uses of the API – for example, embedding Python.
ru: Для простоты в этом документе говорится о *расширениях*, но ограниченный API и стабильный ABI работают одинаково для всех случаев использования API — например, при внедрении Python.

source: Limited C API
ru: Ограниченный API C

source: Python 3.2 introduced the *Limited API*, a subset of Python's C API. Extensions that only use the Limited API can be compiled once and be loaded on multiple versions of Python. Contents of the Limited API are :ref:`listed below <limited-api-list>`.
ru: В Python 3.2 появился *Limited API*, подмножество Python C API. Расширения, использующие только ограниченный API, можно скомпилировать один раз и загрузить в несколько версий Python. Содержимое Limited API :ref:`перечислено ниже <limited-api-list>`.

source: Define this macro before including ``Python.h`` to opt in to only use the Limited API, and to select the Limited API version.
ru: Определите этот макрос перед включением Python.h, чтобы разрешить использование только ограниченного API и выбрать версию ограниченного API.

source: Define ``Py_LIMITED_API`` to the value of :c:macro:`PY_VERSION_HEX` corresponding to the lowest Python version your extension supports. The extension will be ABI-compatible with all Python 3 releases from the specified one onward, and can use Limited API introduced up to that version.
ru: Определите для Py_LIMITED_API значение :c:macro:`PY_VERSION_HEX`, соответствующее самой низкой версии Python, которую поддерживает ваше расширение. Расширение будет ABI-совместимо со всеми выпусками Python 3, начиная с указанного, и может использовать ограниченный API, представленный до этой версии.

source: Rather than using the ``PY_VERSION_HEX`` macro directly, hardcode a minimum minor version (e.g. ``0x030A0000`` for Python 3.10) for stability when compiling with future Python versions.
ru: Вместо того, чтобы использовать макрос PY_VERSION_HEX напрямую, жестко закодируйте минимальную младшую версию (например, 0x030A0000 для Python 3.10) для стабильности при компиляции с будущими версиями Python.

source: You can also define ``Py_LIMITED_API`` to ``3``. This works the same as ``0x03020000`` (Python 3.2, the version that introduced Limited API).
ru: Вы также можете определить для ``Py_LIMITED_API`` значение ``3``. Это работает так же, как 0x03020000 (Python 3.2, версия, в которой представлен ограниченный API).

source: Stable ABI
ru: Стабильный ABI

source: To enable this, Python provides a *Stable ABI*: a set of symbols that will remain ABI-compatible across Python 3.x versions.
ru: Для этого Python предоставляет *Стабильный ABI*: набор символов, которые останутся ABI-совместимыми во всех версиях Python 3.x.

source: The Stable ABI prevents ABI issues, like linker errors due to missing symbols or data corruption due to changes in structure layouts or function signatures. However, other changes in Python can change the *behavior* of extensions. See Python's Backwards Compatibility Policy (:pep:`387`) for details.
ru: Стабильный ABI предотвращает проблемы ABI, такие как ошибки компоновщика из-за отсутствия символов или повреждения данных из-за изменений в макетах структур или сигнатурах функций. Однако другие изменения в Python могут изменить *поведение* расширений. Подробности см. в Политике обратной совместимости Python (:pep:`387`).

source: The Stable ABI contains symbols exposed in the :ref:`Limited API <limited-c-api>`, but also other ones – for example, functions necessary to support older versions of the Limited API.
ru: Стабильный ABI содержит символы, представленные в :ref:`Limited API <limited-c-api>`, а также другие символы — например, функции, необходимые для поддержки старых версий Limited API.

source: On Windows, extensions that use the Stable ABI should be linked against ``python3.dll`` rather than a version-specific library such as ``python39.dll``.
ru: В Windows расширения, использующие Stable ABI, должны быть связаны с Python3.dll, а не с библиотекой конкретной версии, такой как Python39.dll.

source: On some platforms, Python will look for and load shared library files named with the ``abi3`` tag (e.g. ``mymodule.abi3.so``). It does not check if such extensions conform to a Stable ABI. The user (or their packaging tools) need to ensure that, for example, extensions built with the 3.10+ Limited API are not installed for lower versions of Python.
ru: На некоторых платформах Python будет искать и загружать файлы общей библиотеки, названные тегом abi3 (например, mymodule.abi3.so). Он не проверяет, соответствуют ли такие расширения стабильному ABI. Пользователь (или его инструменты упаковки) должны гарантировать, что, например, расширения, созданные с помощью API 3.10+ Limited, не установлены для более низких версий Python.

source: All functions in the Stable ABI are present as functions in Python's shared library, not solely as macros. This makes them usable from languages that don't use the C preprocessor.
ru: Все функции в Stable ABI представлены как функции общей библиотеки Python, а не только как макросы. Это делает их пригодными для использования в языках, не использующих препроцессор C.

source: Limited API Scope and Performance
ru: Ограниченный объем и производительность API

source: The goal for the Limited API is to allow everything that is possible with the full C API, but possibly with a performance penalty.
ru: Цель ограниченного API — обеспечить все, что возможно с полным API C, но, возможно, с потерей производительности.

source: For example, while :c:func:`PyList_GetItem` is available, its “unsafe” macro variant :c:func:`PyList_GET_ITEM` is not. The macro can be faster because it can rely on version-specific implementation details of the list object.
ru: Например, хотя :c:func:`PyList_GetItem` доступен, его «небезопасный» вариант макроса :c:func:`PyList_GET_ITEM` — нет. Макрос может работать быстрее, поскольку он может полагаться на детали реализации объекта списка, зависящие от версии.

source: Without ``Py_LIMITED_API`` defined, some C API functions are inlined or replaced by macros. Defining ``Py_LIMITED_API`` disables this inlining, allowing stability as Python's data structures are improved, but possibly reducing performance.
ru: Без определения ``Py_LIMITED_API`` некоторые функции C API встраиваются или заменяются макросами. Определение Py_LIMITED_API отключает эту встраивание, обеспечивая стабильность при улучшении структур данных Python, но, возможно, снижая производительность.

source: By leaving out the ``Py_LIMITED_API`` definition, it is possible to compile a Limited API extension with a version-specific ABI. This can improve performance for that Python version, but will limit compatibility. Compiling with ``Py_LIMITED_API`` will then yield an extension that can be distributed where a version-specific one is not available – for example, for prereleases of an upcoming Python version.
ru: Опустив определение Py_LIMITED_API, можно скомпилировать расширение Limited API с ABI для конкретной версии. Это может улучшить производительность этой версии Python, но ограничит совместимость. Компиляция с использованием Py_LIMITED_API даст расширение, которое можно будет распространять там, где недоступно расширение для конкретной версии — например, для предварительных выпусков будущей версии Python.

source: Limited API Caveats
ru: Ограниченные предостережения по API

source: Note that compiling with ``Py_LIMITED_API`` is *not* a complete guarantee that code conforms to the :ref:`Limited API <limited-c-api>` or the :ref:`Stable ABI <stable-abi>`. ``Py_LIMITED_API`` only covers definitions, but an API also includes other issues, such as expected semantics.
ru: Обратите внимание, что компиляция с использованием ``Py_LIMITED_API`` *не* является полной гарантией того, что код соответствует :ref:`Limited API <limited-c-api>` или :ref:`Stable ABI <stable-abi>`. ``Py_LIMITED_API`` охватывает только определения, но API также включает в себя и другие вопросы, такие как ожидаемая семантика.

source: One issue that ``Py_LIMITED_API`` does not guard against is calling a function with arguments that are invalid in a lower Python version. For example, consider a function that starts accepting ``NULL`` for an argument. In Python 3.9, ``NULL`` now selects a default behavior, but in Python 3.8, the argument will be used directly, causing a ``NULL`` dereference and crash. A similar argument works for fields of structs.
ru: Одна из проблем, от которой Py_LIMITED_API не защищает, — это вызов функции с аргументами, которые недопустимы в более ранней версии Python. Например, рассмотрим функцию, которая начинает принимать в качестве аргумента значение NULL. В Python 3.9 ``NULL`` теперь выбирает поведение по умолчанию, но в Python 3.8 аргумент будет использоваться напрямую, что приведет к разыменованию ``NULL`` и сбою. Аналогичный аргумент работает для полей структур.

source: Another issue is that some struct fields are currently not hidden when ``Py_LIMITED_API`` is defined, even though they're part of the Limited API.
ru: Другая проблема заключается в том, что некоторые поля структуры в настоящее время не скрыты, когда определен Py_LIMITED_API, хотя они являются частью Limited API.

source: For these reasons, we recommend testing an extension with *all* minor Python versions it supports, and preferably to build with the *lowest* such version.
ru: По этим причинам мы рекомендуем тестировать расширение со *всеми* второстепенными версиями Python, которые оно поддерживает, и желательно собирать с *самой младшей* такой версией.

source: We also recommend reviewing documentation of all used API to check if it is explicitly part of the Limited API. Even with ``Py_LIMITED_API`` defined, a few private declarations are exposed for technical reasons (or even unintentionally, as bugs).
ru: Мы также рекомендуем просмотреть документацию по всем используемым API, чтобы убедиться, что они явно не являются частью ограниченного API. Даже если Py_LIMITED_API определен, некоторые частные объявления отображаются по техническим причинам (или даже непреднамеренно, как ошибки).

source: Also note that the Limited API is not necessarily stable: compiling with ``Py_LIMITED_API`` with Python 3.8 means that the extension will run with Python 3.12, but it will not necessarily *compile* with Python 3.12. In particular, parts of the Limited API may be deprecated and removed, provided that the Stable ABI stays stable.
ru: Также обратите внимание, что ограниченный API не обязательно стабилен: компиляция с помощью ``Py_LIMITED_API`` с Python 3.8 означает, что расширение будет работать с Python 3.12, но не обязательно *компилируется* с Python 3.12. В частности, части ограниченного API могут быть признаны устаревшими и удалены при условии, что стабильный ABI останется стабильным.

source: Platform Considerations
ru: Особенности платформы

source: ABI stability depends not only on Python, but also on the compiler used, lower-level libraries and compiler options. For the purposes of the :ref:`Stable ABI <stable-abi>`, these details define a “platform”. They usually depend on the OS type and processor architecture
ru: Стабильность ABI зависит не только от Python, но и от используемого компилятора, библиотек нижнего уровня и опций компилятора. Для целей :ref:`Stable ABI <stable-abi>` эти детали определяют «платформу». Обычно они зависят от типа ОС и архитектуры процессора.

source: It is the responsibility of each particular distributor of Python to ensure that all Python versions on a particular platform are built in a way that does not break the Stable ABI. This is the case with Windows and macOS releases from ``python.org`` and many third-party distributors.
ru: Каждый конкретный дистрибьютор Python несет ответственность за то, чтобы все версии Python на конкретной платформе были построены таким образом, чтобы не нарушать стабильный ABI. Так обстоит дело с выпусками Windows и macOS от ``python.org`` и многих сторонних дистрибьюторов.

source: Contents of Limited API
ru: Содержание ограниченного API

source: Currently, the :ref:`Limited API <limited-c-api>` includes the following items:
ru: В настоящее время :ref:`Limited API <limited-c-api>` включает в себя следующие элементы:
