Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/structures.po
Languages: es_es

source: The string should be static, no copy is made of it.
es_es: La cadena debe ser estática, no se hace ninguna copia de ella.

source: The type of the member in the C struct. See :ref:`PyMemberDef-types` for the possible values.
es_es: El tipo del miembro en la estructura C. Ver :ref:`PyMemberDef-types` para conocer los valores posibles.

source: The offset in bytes that the member is located on the type’s object struct.
es_es: El desplazamiento en bytes en que se encuentra el miembro en la estructura del objeto del tipo.

source: Zero or more of the :ref:`PyMemberDef-flags`, combined using bitwise OR.
es_es: Cero o más de los :ref:`PyMemberDef-flags`, combinados mediante bitwise OR.

source: The docstring, or NULL. The string should be static, no copy is made of it. Typically, it is defined using :c:macro:`PyDoc_STR`.
es_es: El docstring, o NULL. La cadena debe ser estática, no se hace ninguna copia de ella. Normalmente, se define utilizando :c:macro:`PyDoc_STR`.

source: By default (when :c:member:`~PyMemberDef.flags` is ``0``), members allow both read and write access. Use the :c:macro:`Py_READONLY` flag for read-only access. Certain types, like :c:macro:`Py_T_STRING`, imply :c:macro:`Py_READONLY`. Only :c:macro:`Py_T_OBJECT_EX` (and legacy :c:macro:`T_OBJECT`) members can be deleted.
es_es: Por defecto (cuando :c:member:`~PyMemberDef.flags` es ``0``), los miembros permiten tanto el acceso de lectura como el de escritura. Utilice la bandera :c:macro:`Py_READONLY` para el acceso de sólo lectura. Ciertos tipos, como :c:macro:`Py_T_STRING`, implican :c:macro:`Py_READONLY`. Sólo se pueden eliminar los miembros de :c:macro:`Py_T_OBJECT_EX` (y de la antigua :c:macro:`T_OBJECT`).

source: For heap-allocated types (created using :c:func:`PyType_FromSpec` or similar), ``PyMemberDef`` may contain a definition for the special member ``"__vectorcalloffset__"``, corresponding to :c:member:`~PyTypeObject.tp_vectorcall_offset` in type objects. These must be defined with ``Py_T_PYSSIZET`` and ``Py_READONLY``, for example::
es_es: Para tipos asignados a heap (creados usando :c:func:`PyType_FromSpec` o similar), ``PyMemberDef`` puede contener una definición para el miembro especial ``"__vectorcalloffset__"``, correspondiente a :c:member:`~PyTypeObject.tp_vectorcall_offset` en objetos de tipo. Estos deben definirse con ``Py_T_PYSSIZET`` y ``Py_READONLY``, por ejemplo::

source: (You may need to ``#include <stddef.h>`` for :c:func:`!offsetof`.)
es_es: (Puede que necesite ``#include <stddef.h>`` para :c:func:`!offsetof`.)

source: The legacy offsets :c:member:`~PyTypeObject.tp_dictoffset` and :c:member:`~PyTypeObject.tp_weaklistoffset` can be defined similarly using ``"__dictoffset__"`` and ``"__weaklistoffset__"`` members, but extensions are strongly encouraged to use :c:macro:`Py_TPFLAGS_MANAGED_DICT` and :c:macro:`Py_TPFLAGS_MANAGED_WEAKREF` instead.
es_es: Los desplazamientos heredados :c:member:`~PyTypeObject.tp_dictoffset` y :c:member:`~PyTypeObject.tp_weaklistoffset` pueden definirse de forma similar utilizando los miembros ``"__dictoffset__"`` y ``"__weaklistoffset__"``, pero se recomienda encarecidamente a las extensiones que utilicen :c:macro:`Py_TPFLAGS_MANAGED_DICT` y :c:macro:`Py_TPFLAGS_MANAGED_WEAKREF` en su lugar.

source: ``PyMemberDef`` is always available. Previously, it required including ``"structmember.h"``.
es_es: ``PyMemberDef`` está siempre disponible. Antes era necesario incluir ``"structmember.h"``.

source: Get an attribute belonging to the object at address *obj_addr*. The attribute is described by ``PyMemberDef`` *m*. Returns ``NULL`` on error.
es_es: Obtener un atributo perteneciente al objeto en la dirección *obj_addr*. El atributo se describe en ``PyMemberDef`` *m*. Devuelve ``NULL`` en caso de error.

source: ``PyMember_GetOne`` is always available. Previously, it required including ``"structmember.h"``.
es_es: ``PyMember_GetOne`` está siempre disponible. Antes era necesario incluir ``"structmember.h"``.

source: Set an attribute belonging to the object at address *obj_addr* to object *o*. The attribute to set is described by ``PyMemberDef`` *m*. Returns ``0`` if successful and a negative value on failure.
es_es: Establece un atributo perteneciente al objeto en la dirección *obj_addr* al objeto *o*. El atributo a establecer se describe en ``PyMemberDef`` *m*. Devuelve ``0`` si tiene éxito y un valor negativo en caso de fallo.

source: ``PyMember_SetOne`` is always available. Previously, it required including ``"structmember.h"``.
es_es: ``PyMember_SetOne`` está siempre disponible. Antes era necesario incluir ``"structmember.h"``.

source: Member flags
es_es: Banderas de los miembros

source: The following flags can be used with :c:member:`PyMemberDef.flags`:
es_es: Los siguientes indicadores pueden utilizarse con :c:member:`PyMemberDef.flags`:

source: Not writable.
es_es: No se puede escribir.

source: Emit an ``object.__getattr__`` :ref:`audit event <audit-events>` before reading.
es_es: Emite un ``object.__getattr__``:ref:`audit event <audit-events>` antes de la lectura.

source: Indicates that the :c:member:`~PyMemberDef.offset` of this ``PyMemberDef`` entry indicates an offset from the subclass-specific data, rather than from ``PyObject``.
es_es: Indica que el :c:member:`~PyMemberDef.offset` de esta entrada ``PyMemberDef`` indica un desplazamiento desde los datos específicos de la subclase, en lugar de desde ``PyObject``.

source: Can only be used as part of :c:member:`Py_tp_members <PyTypeObject.tp_members>` :c:type:`slot <PyType_Slot>` when creating a class using negative :c:member:`~PyType_Spec.basicsize`. It is mandatory in that case.
es_es: Sólo se puede usar como parte de :c:member:`Py_tp_members <PyTypeObject.tp_members>`:c:type:`slot <PyType_Slot>` cuando se crea una clase usando negativo :c:member:`~PyType_Spec.basicsize`. En ese caso es obligatorio.

source: This flag is only used in :c:type:`PyType_Slot`. When setting :c:member:`~PyTypeObject.tp_members` during class creation, Python clears it and sets :c:member:`PyMemberDef.offset` to the offset from the ``PyObject`` struct.
es_es: Esta bandera sólo se utiliza en :c:type:`PyType_Slot`. Cuando se establece :c:member:`~PyTypeObject.tp_members` durante la creación de la clase, Python lo borra y establece :c:member:`PyMemberDef.offset` al offset de la estructura ``PyObject``.

source: The :c:macro:`!RESTRICTED`, :c:macro:`!READ_RESTRICTED` and :c:macro:`!WRITE_RESTRICTED` macros available with ``#include "structmember.h"`` are deprecated. :c:macro:`!READ_RESTRICTED` and :c:macro:`!RESTRICTED` are equivalent to :c:macro:`Py_AUDIT_READ`; :c:macro:`!WRITE_RESTRICTED` does nothing.
es_es: Las macros :c:macro:`!RESTRICTED`, :c:macro:`!READ_RESTRICTED` y :c:macro:`!WRITE_RESTRICTED` disponibles con ``#include "structmember.h"`` están obsoletas. :c:macro:`!READ_RESTRICTED` y :c:macro:`!RESTRICTED` son equivalentes a :c:macro:`Py_AUDIT_READ`; :c:macro:`!WRITE_RESTRICTED` no hace nada.

source: The :c:macro:`!READONLY` macro was renamed to :c:macro:`Py_READONLY`. The :c:macro:`!PY_AUDIT_READ` macro was renamed with the ``Py_`` prefix. The new names are now always available. Previously, these required ``#include "structmember.h"``. The header is still available and it provides the old names.
es_es: La macro :c:macro:`!READONLY` se ha renombrado a :c:macro:`Py_READONLY`. La macro :c:macro:`!PY_AUDIT_READ` se ha renombrado con el prefijo ``Py_``. Los nuevos nombres están ahora siempre disponibles. Antes se necesitaba ``#include "structmember.h"``. La cabecera sigue disponible y proporciona los nombres antiguos.

source: Member types
es_es: Tipos de miembros

source: :c:member:`PyMemberDef.type` can be one of the following macros corresponding to various C types. When the member is accessed in Python, it will be converted to the equivalent Python type. When it is set from Python, it will be converted back to the C type. If that is not possible, an exception such as :exc:`TypeError` or :exc:`ValueError` is raised.
es_es: :c:member:`PyMemberDef.type` puede ser una de las siguientes macros correspondientes a varios tipos de C. Cuando se accede al miembro en Python, se convertirá al tipo Python equivalente. Cuando se establezca desde Python, se convertirá de nuevo al tipo C. Si esto no es posible, se lanzará una excepción como :exc:`TypeError` o :exc:`ValueError`.

source: Unless marked (D), attributes defined this way cannot be deleted using e.g. :keyword:`del` or :py:func:`delattr`.
es_es: A menos que estén marcados con (D), los atributos definidos de esta forma no se pueden eliminar utilizando, por ejemplo, :keyword:`del` o :py:func:`delattr`.

source: Macro name
es_es: Nombre de la macro

source: C type
es_es: Tipo C

source: Python type
es_es: Tipo Python

source: :c:expr:`char` (written as 0 or 1)
es_es: :c:expr:`char` (escrito como 0 o 1)

source: (*): Zero-terminated, UTF8-encoded C string. With :c:macro:`!Py_T_STRING` the C representation is a pointer; with :c:macro:`!Py_T_STRING_INPLACE` the string is stored directly in the structure.
es_es: (*): Cadena en C de terminación cero y codificada en UTF8. Con :c:macro:`!Py_T_STRING` la representación C es un puntero; con :c:macro:`!Py_T_STRING_INPLACE` la cadena se almacena directamente en la estructura.

source: (**): String of length 1. Only ASCII is accepted.
es_es: (**): Cadena de longitud 1. Sólo se acepta ASCII.

source: (RO): Implies :c:macro:`Py_READONLY`.
es_es: (RO): Implica :c:macro:`Py_READONLY`.

source: (D): Can be deleted, in which case the pointer is set to ``NULL``. Reading a ``NULL`` pointer raises :py:exc:`AttributeError`.
es_es: (D): Puede ser borrado, en cuyo caso el puntero se establece en ``NULL``. La lectura de un puntero ``NULL`` plantea :py:exc:`AttributeError`.

source: In previous versions, the macros were only available with ``#include "structmember.h"`` and were named without the ``Py_`` prefix (e.g. as ``T_INT``). The header is still available and contains the old names, along with the following deprecated types:
es_es: En versiones anteriores, las macros sólo estaban disponibles con ``#include "structmember.h"`` y se nombraban sin el prefijo ``Py_`` (por ejemplo, como ``T_INT``). La cabecera sigue disponible y contiene los nombres antiguos, junto con los siguientes tipos obsoletos:

source: Like ``Py_T_OBJECT_EX``, but ``NULL`` is converted to ``None``. This results in surprising behavior in Python: deleting the attribute effectively sets it to ``None``.
es_es: Como ``Py_T_OBJECT_EX``, pero ``NULL`` se convierte en ``None``. Esto da lugar a un comportamiento sorprendente en Python: al eliminar el atributo, se convierte en ``None``.

source: Always ``None``. Must be used with :c:macro:`Py_READONLY`.
es_es: Siempre ``None``. Debe utilizarse con :c:macro:`Py_READONLY`.

source: Defining Getters and Setters
es_es: Definición de Getters y Setters

source: Structure to define property-like access for a type. See also description of the :c:member:`PyTypeObject.tp_getset` slot.
es_es: Estructura para definir el acceso tipo propiedad para un tipo. Véase también la descripción de la ranura :c:member:`PyTypeObject.tp_getset`.

source: attribute name
es_es: nombre de atributo

source: C function to get the attribute.
es_es: C para obtener el atributo.

source: Optional C function to set or delete the attribute. If ``NULL``, the attribute is read-only.
es_es: Función C opcional para establecer o eliminar el atributo. Si ``NULL``, el atributo es de sólo lectura.

source: optional docstring
es_es: docstring opcional

source: Optional user data pointer, providing additional data for getter and setter.
es_es: Puntero opcional de datos de usuario, que proporciona datos adicionales para getter y setter.

source: The ``get`` function takes one :c:expr:`PyObject*` parameter (the instance) and a user data pointer (the associated ``closure``):
es_es: La función ``get`` toma un parámetro :c:expr:`PyObject*` (la instancia) y un puntero de datos de usuario (el ``closure`` asociado):

source: It should return a new reference on success or ``NULL`` with a set exception on failure.
es_es: Debe devolver una nueva referencia en caso de éxito o ``NULL`` con una excepción establecida en caso de fallo.

source: ``set`` functions take two :c:expr:`PyObject*` parameters (the instance and the value to be set) and a user data pointer (the associated ``closure``):
es_es: ``set`` toman dos parámetros :c:expr:`PyObject*` (la instancia y el valor a establecer) y un puntero de datos de usuario (el ``closure`` asociado):

source: In case the attribute should be deleted the second parameter is ``NULL``. Should return ``0`` on success or ``-1`` with a set exception on failure.
es_es: En caso de que el atributo se deba borrar el segundo parámetro es ``NULL``. Debe devolver ``0`` en caso de éxito o ``-1`` con una excepción establecida en caso de fallo.

source: built-in function
es_es: función incorporada

source: staticmethod
es_es: método estático

source: READ_RESTRICTED (C macro)
es_es: READ_RESTRICTED (macro C)

source: WRITE_RESTRICTED (C macro)
es_es: WRITE_RESTRICTED (macro C)

source: RESTRICTED (C macro)
es_es: RESTRICTED (macro C)

source: READONLY (C macro)
es_es: READONLY (macro C)

source: T_BYTE (C macro)
es_es: T_BYTE (macro C)

source: T_SHORT (C macro)
es_es: T_SHORT (macro C)

source: T_INT (C macro)
es_es: T_INT (macro C)

source: T_LONG (C macro)
es_es: T_LONG (macro C)

source: T_LONGLONG (C macro)
es_es: T_LONGLONG (macro C)

source: T_UBYTE (C macro)
es_es: T_UBYTE (macro C)

source: T_USHORT (C macro)
es_es: T_USHORT (macro C)

source: T_UINT (C macro)
es_es: T_UINT (macro C)

source: T_ULONG (C macro)
es_es: T_ULONG (macro C)

source: T_ULONGULONG (C macro)
es_es: T_ULONGULONG (macro C)

source: T_PYSSIZET (C macro)
es_es: T_PYSSIZET (macro C)

source: T_FLOAT (C macro)
es_es: T_FLOAT (macro C)

source: T_DOUBLE (C macro)
es_es: T_DOUBLE (macro C)

source: T_BOOL (C macro)
es_es: T_BOOL (macro C)

source: T_CHAR (C macro)
es_es: T_CHAR (macro C)

source: T_STRING (C macro)
es_es: T_STRING (macro C)

source: T_STRING_INPLACE (C macro)
es_es: T_STRING_INPLACE (macro C)

source: T_OBJECT_EX (C macro)
es_es: T_OBJECT_EX (macro C)
