Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/structures.po
Languages: es_es

source: Common Object Structures
es_es: Estructuras de objetos comunes

source: There are a large number of structures which are used in the definition of object types for Python. This section describes these structures and how they are used.
es_es: Hay un gran número de estructuras que se utilizan en la definición de tipos de objetos para Python. Esta sección describe estas estructuras y cómo se utilizan.

source: Base object types and macros
es_es: Tipos de objetos base y macros

source: All Python objects ultimately share a small number of fields at the beginning of the object's representation in memory. These are represented by the :c:type:`PyObject` and :c:type:`PyVarObject` types, which are defined, in turn, by the expansions of some macros also used, whether directly or indirectly, in the definition of all other Python objects. Additional macros can be found under :ref:`reference counting <countingrefs>`.
es_es: Todos los objetos Python comparten, en última instancia, un pequeño número de campos al principio de la representación del objeto en memoria. Éstos están representados por los tipos :c:type:`PyObject` y :c:type:`PyVarObject`, que están definidos, a su vez, por las expansiones de algunas macros también utilizadas, directa o indirectamente, en la definición de todos los demás objetos Python. Se pueden encontrar macros adicionales en :ref:`reference counting <countingrefs>`.

source: All object types are extensions of this type. This is a type which contains the information Python needs to treat a pointer to an object as an object. In a normal "release" build, it contains only the object's reference count and a pointer to the corresponding type object. Nothing is actually declared to be a :c:type:`PyObject`, but every pointer to a Python object can be cast to a :c:expr:`PyObject*`. Access to the members must be done by using the macros :c:macro:`Py_REFCNT` and :c:macro:`Py_TYPE`.
es_es: Todos los tipos de objeto son extensiones de este tipo. Es un tipo que contiene la información que Python necesita para tratar un puntero a un objeto como un objeto. En una construcción normal de "liberación", sólo contiene el recuento de referencias del objeto y un puntero al objeto de tipo correspondiente. En realidad, nada se declara como un :c:type:`PyObject`, pero todo puntero a un objeto Python puede ser lanzado a un :c:expr:`PyObject*`. El acceso a los miembros debe hacerse utilizando las macros :c:macro:`Py_REFCNT` y :c:macro:`Py_TYPE`.

source: This is an extension of :c:type:`PyObject` that adds the :c:member:`~PyVarObject.ob_size` field. This is only used for objects that have some notion of *length*. This type does not often appear in the Python/C API. Access to the members must be done by using the macros :c:macro:`Py_REFCNT`, :c:macro:`Py_TYPE`, and :c:macro:`Py_SIZE`.
es_es: Se trata de una extensión de :c:type:`PyObject` que añade el campo :c:member:`~PyVarObject.ob_size`. Sólo se utiliza para objetos que tienen alguna noción de *longitud*. Este tipo no suele aparecer en la API de Python/C. El acceso a los miembros debe hacerse utilizando las macros :c:macro:`Py_REFCNT`, :c:macro:`Py_TYPE`, y :c:macro:`Py_SIZE`.

source: This is a macro used when declaring new types which represent objects without a varying length. The PyObject_HEAD macro expands to::
es_es: Este es un macro utilizado al declarar nuevos tipos que representan objetos sin una longitud variable. El macro PyObject_HEAD se expande a:

source: See documentation of :c:type:`PyObject` above.
es_es: Ver documentación de :c:type:`PyObject` arriba.

source: This is a macro used when declaring new types which represent objects with a length that varies from instance to instance. The PyObject_VAR_HEAD macro expands to::
es_es: Este es un macro utilizado al declarar nuevos tipos que representan objetos con una longitud que varía de instancia a instancia. El macro PyObject_VAR_HEAD se expande a:

source: See documentation of :c:type:`PyVarObject` above.
es_es: Ver documentación de :c:type:`PyVarObject` arriba.

source: Test if the *x* object is the *y* object, the same as ``x is y`` in Python.
es_es: Prueba si el objeto *x* es el objeto *y*, igual que ``x is y`` en Python.

source: Test if an object is the ``None`` singleton, the same as ``x is None`` in Python.
es_es: Prueba si un objeto es el singleton ``None``, lo mismo que ``x is None`` en Python.

source: Test if an object is the ``True`` singleton, the same as ``x is True`` in Python.
es_es: Prueba si un objeto es el singleton ``True``, lo mismo que ``x is True`` en Python.

source: Test if an object is the ``False`` singleton, the same as ``x is False`` in Python.
es_es: Prueba si un objeto es el singleton ``False``, lo mismo que ``x is False`` en Python.

source: Get the type of the Python object *o*.
es_es: Obtener el tipo del objeto Python *o*.

source: Return a :term:`borrowed reference`.
es_es: Devuelve un :term:`borrowed reference`.

source: Use the :c:func:`Py_SET_TYPE` function to set an object type.
es_es: Utilice la función :c:func:`Py_SET_TYPE` para establecer un tipo de objeto.

source: :c:func:`Py_TYPE()` is changed to an inline static function. The parameter type is no longer :c:expr:`const PyObject*`.
es_es: :c:func:`Py_TYPE()` se convierte en una función estática en línea. El tipo de parámetro ya no es :c:expr:`const PyObject*`.

source: Return non-zero if the object *o* type is *type*. Return zero otherwise. Equivalent to: ``Py_TYPE(o) == type``.
es_es: Devuelve un valor distinto de cero si el tipo del objeto *o* es *type*. Devuelve cero en caso contrario. Equivalente a: ``Py_TYPE(o) == type``.

source: Set the object *o* type to *type*.
es_es: Establece el tipo del objeto *o* en *tipo*.

source: Get the size of the Python object *o*.
es_es: Obtener el tamaño del objeto Python *o*.

source: Use the :c:func:`Py_SET_SIZE` function to set an object size.
es_es: Utilice la función :c:func:`Py_SET_SIZE` para establecer el tamaño de un objeto.

source: :c:func:`Py_SIZE()` is changed to an inline static function. The parameter type is no longer :c:expr:`const PyVarObject*`.
es_es: :c:func:`Py_SIZE()` se convierte en una función estática en línea. El tipo de parámetro ya no es :c:expr:`const PyVarObject*`.

source: Set the object *o* size to *size*.
es_es: Establece el tamaño del objeto *o* en *tamaño*.

source: This is a macro which expands to initialization values for a new :c:type:`PyObject` type. This macro expands to::
es_es: Esta es una macro que se expande a valores de inicialización para un nuevo tipo :c:type:`PyObject`. Esta macro se expande a::

source: This is a macro which expands to initialization values for a new :c:type:`PyVarObject` type, including the :c:member:`~PyVarObject.ob_size` field. This macro expands to::
es_es: Se trata de una macro que se expande a valores de inicialización para un nuevo tipo :c:type:`PyVarObject`, incluido el campo :c:member:`~PyVarObject.ob_size`. Esta macro se expande a::

source: Implementing functions and methods
es_es: Implementación de funciones y métodos

source: Type of the functions used to implement most Python callables in C. Functions of this type take two :c:expr:`PyObject*` parameters and return one such value. If the return value is ``NULL``, an exception shall have been set. If not ``NULL``, the return value is interpreted as the return value of the function as exposed in Python. The function must return a new reference.
es_es: Tipo de las funciones utilizadas para implementar la mayoría de las llamadas Python en C. Las funciones de este tipo toman dos parámetros :c:expr:`PyObject*` y devuelven un valor de este tipo. Si el valor de retorno es ``NULL``, se habrá establecido una excepción. Si no es ``NULL``, el valor de retorno se interpreta como el valor de retorno de la función tal y como se expone en Python. La función debe devolver una nueva referencia.

source: The function signature is::
es_es: La firma de la función es::

source: Type of the functions used to implement Python callables in C with signature :ref:`METH_VARARGS | METH_KEYWORDS <METH_VARARGS-METH_KEYWORDS>`. The function signature is::
es_es: Tipo de las funciones utilizadas para implementar llamadas de Python en C con firma :ref:`METH_VARARGS | METH_KEYWORDS <METH_VARARGS-METH_KEYWORDS>`. La firma de la función es::

source: Type of the functions used to implement Python callables in C with signature :c:macro:`METH_FASTCALL`. The function signature is::
es_es: Tipo de las funciones utilizadas para implementar callables Python en C con la firma :c:macro:`METH_FASTCALL`. La firma de la función es::

source: Type of the functions used to implement Python callables in C with signature :ref:`METH_FASTCALL | METH_KEYWORDS <METH_FASTCALL-METH_KEYWORDS>`. The function signature is::
es_es: Tipo de las funciones utilizadas para implementar callables de Python en C con firma :ref:`METH_FASTCALL | METH_KEYWORDS <METH_FASTCALL-METH_KEYWORDS>`. La firma de la función es::

source: Type of the functions used to implement Python callables in C with signature :ref:`METH_METHOD | METH_FASTCALL | METH_KEYWORDS <METH_METHOD-METH_FASTCALL-METH_KEYWORDS>`. The function signature is::
es_es: Tipo de las funciones utilizadas para implementar callables de Python en C con firma :ref:`METH_METHOD | METH_FASTCALL | METH_KEYWORDS <METH_METHOD-METH_FASTCALL-METH_KEYWORDS>`. La firma de la función es::

source: Structure used to describe a method of an extension type. This structure has four fields:
es_es: Estructura utilizada para describir un método de un tipo de extensión. Esta estructura tiene cuatro campos:

source: Name of the method.
es_es: Nombre del método.

source: Pointer to the C implementation.
es_es: Puntero a la implementación en C.

source: Flags bits indicating how the call should be constructed.
es_es: Bits de bandera que indican cómo debe construirse la llamada.

source: Points to the contents of the docstring.
es_es: Apunta al contenido del docstring.

source: The :c:member:`~PyMethodDef.ml_meth` is a C function pointer. The functions may be of different types, but they always return :c:expr:`PyObject*`. If the function is not of the :c:type:`PyCFunction`, the compiler will require a cast in the method table. Even though :c:type:`PyCFunction` defines the first parameter as :c:expr:`PyObject*`, it is common that the method implementation uses the specific C type of the *self* object.
es_es: :c:member:`~PyMethodDef.ml_meth` es un puntero a una función C. Las funciones pueden ser de diferentes tipos, pero siempre devuelven :c:expr:`PyObject*`. Si la función no es del tipo :c:type:`PyCFunction`, el compilador requerirá un cast en la tabla de métodos. Aunque :c:type:`PyCFunction` defina el primer parámetro como :c:expr:`PyObject*`, es habitual que la implementación del método utilice el tipo C específico del objeto *self*.

source: The :c:member:`~PyMethodDef.ml_flags` field is a bitfield which can include the following flags. The individual flags indicate either a calling convention or a binding convention.
es_es: El campo :c:member:`~PyMethodDef.ml_flags` es un campo de bits que puede incluir los siguientes indicadores. Las banderas individuales indican una convención de llamada o una convención de enlace.

source: There are these calling conventions:
es_es: Existen estas convenciones de llamada:

source: This is the typical calling convention, where the methods have the type :c:type:`PyCFunction`. The function expects two :c:expr:`PyObject*` values. The first one is the *self* object for methods; for module functions, it is the module object. The second parameter (often called *args*) is a tuple object representing all arguments. This parameter is typically processed using :c:func:`PyArg_ParseTuple` or :c:func:`PyArg_UnpackTuple`.
es_es: Esta es la convención de llamada típica, en la que los métodos tienen el tipo :c:type:`PyCFunction`. La función espera dos valores :c:expr:`PyObject*`. El primero es el objeto *self* para los métodos; para las funciones de módulo, es el objeto módulo. El segundo parámetro (a menudo llamado *args*) es un objeto tupla que representa todos los argumentos. Este parámetro se procesa normalmente utilizando :c:func:`PyArg_ParseTuple` o :c:func:`PyArg_UnpackTuple`.

source: Can only be used in certain combinations with other flags: :ref:`METH_VARARGS | METH_KEYWORDS <METH_VARARGS-METH_KEYWORDS>`, :ref:`METH_FASTCALL | METH_KEYWORDS <METH_FASTCALL-METH_KEYWORDS>` and :ref:`METH_METHOD | METH_FASTCALL | METH_KEYWORDS <METH_METHOD-METH_FASTCALL-METH_KEYWORDS>`.
es_es: Sólo puede utilizarse en determinadas combinaciones con otros indicadores: :ref:`METH_VARARGS | METH_KEYWORDS <METH_VARARGS-METH_KEYWORDS>`, :ref:`METH_FASTCALL | METH_KEYWORDS <METH_FASTCALL-METH_KEYWORDS>` y :ref:`METH_METHOD | METH_FASTCALL | METH_KEYWORDS <METH_METHOD-METH_FASTCALL-METH_KEYWORDS>`.

source: Methods with these flags must be of type :c:type:`PyCFunctionWithKeywords`. The function expects three parameters: *self*, *args*, *kwargs* where *kwargs* is a dictionary of all the keyword arguments or possibly ``NULL`` if there are no keyword arguments. The parameters are typically processed using :c:func:`PyArg_ParseTupleAndKeywords`.
es_es: Los métodos con estas banderas deben ser del tipo :c:type:`PyCFunctionWithKeywords`. La función espera tres parámetros: *self*, *args*, *kwargs* donde *kwargs* es un diccionario de todos los argumentos de palabra clave o posiblemente ``NULL`` si no hay argumentos de palabra clave. Los parámetros se procesan normalmente utilizando :c:func:`PyArg_ParseTupleAndKeywords`.

source: Fast calling convention supporting only positional arguments. The methods have the type :c:type:`_PyCFunctionFast`. The first parameter is *self*, the second parameter is a C array of :c:expr:`PyObject*` values indicating the arguments and the third parameter is the number of arguments (the length of the array).
es_es: Convención de llamada rápida que sólo admite argumentos posicionales. Los métodos tienen el tipo :c:type:`_PyCFunctionFast`. El primer parámetro es *self*, el segundo parámetro es una matriz C de valores :c:expr:`PyObject*` que indican los argumentos y el tercer parámetro es el número de argumentos (la longitud de la matriz).

source: ``METH_FASTCALL`` is now part of the :ref:`stable ABI <stable-abi>`.
es_es: ``METH_FASTCALL`` forma parte ahora de la :ref:`stable ABI <stable-abi>`.

source: Extension of :c:macro:`METH_FASTCALL` supporting also keyword arguments, with methods of type :c:type:`_PyCFunctionFastWithKeywords`. Keyword arguments are passed the same way as in the :ref:`vectorcall protocol <vectorcall>`: there is an additional fourth :c:expr:`PyObject*` parameter which is a tuple representing the names of the keyword arguments (which are guaranteed to be strings) or possibly ``NULL`` if there are no keywords. The values of the keyword arguments are stored in the *args* array, after the positional arguments.
es_es: Extensión de :c:macro:`METH_FASTCALL` que admite también argumentos de palabra clave, con métodos de tipo :c:type:`_PyCFunctionFastWithKeywords`. Los argumentos de palabra clave se pasan de la misma forma que en el protocolo :ref:`vectorcall <vectorcall>`: hay un cuarto parámetro adicional :c:expr:`PyObject*` que es una tupla que representa los nombres de los argumentos de palabra clave (que se garantiza que son cadenas) o posiblemente ``NULL`` si no hay palabras clave. Los valores de los argumentos de palabra clave se almacenan en la matriz *args*, después de los argumentos posicionales.

source: Can only be used in the combination with other flags: :ref:`METH_METHOD | METH_FASTCALL | METH_KEYWORDS <METH_METHOD-METH_FASTCALL-METH_KEYWORDS>`.
es_es: Sólo puede utilizarse en combinación con otros indicadores: :ref:`METH_METHOD | METH_FASTCALL | METH_KEYWORDS <METH_METHOD-METH_FASTCALL-METH_KEYWORDS>`.

source: Extension of :ref:`METH_FASTCALL | METH_KEYWORDS <METH_FASTCALL-METH_KEYWORDS>` supporting the *defining class*, that is, the class that contains the method in question. The defining class might be a superclass of ``Py_TYPE(self)``.
es_es: Extensión de :ref:`METH_FASTCALL | METH_KEYWORDS <METH_FASTCALL-METH_KEYWORDS>` que admite la *clase definidora*, es decir, la clase que contiene el método en cuestión. La clase definidora puede ser una superclase de ``Py_TYPE(self)``.

source: The method needs to be of type :c:type:`PyCMethod`, the same as for ``METH_FASTCALL | METH_KEYWORDS`` with ``defining_class`` argument added after ``self``.
es_es: El método debe ser del tipo :c:type:`PyCMethod`, igual que para ``METH_FASTCALL | METH_KEYWORDS`` con el argumento ``defining_class`` añadido después de ``self``.

source: Methods without parameters don't need to check whether arguments are given if they are listed with the :c:macro:`METH_NOARGS` flag. They need to be of type :c:type:`PyCFunction`. The first parameter is typically named *self* and will hold a reference to the module or object instance. In all cases the second parameter will be ``NULL``.
es_es: Los métodos sin parámetros no necesitan comprobar si se dan argumentos si se enumeran con la bandera :c:macro:`METH_NOARGS`. Necesitan ser del tipo :c:type:`PyCFunction`. El primer parámetro suele llamarse *self* y contendrá una referencia al módulo o a la instancia del objeto. En todos los casos, el segundo parámetro será ``NULL``.

source: The function must have 2 parameters. Since the second parameter is unused, :c:macro:`Py_UNUSED` can be used to prevent a compiler warning.
es_es: La función debe tener 2 parámetros. Dado que el segundo parámetro no se utiliza, se puede utilizar :c:macro:`Py_UNUSED` para evitar una advertencia del compilador.

source: Methods with a single object argument can be listed with the :c:macro:`METH_O` flag, instead of invoking :c:func:`PyArg_ParseTuple` with a ``"O"`` argument. They have the type :c:type:`PyCFunction`, with the *self* parameter, and a :c:expr:`PyObject*` parameter representing the single argument.
es_es: Los métodos con un único argumento objeto pueden listarse con la bandera :c:macro:`METH_O`, en lugar de invocar :c:func:`PyArg_ParseTuple` con un argumento ``"O"``. Tienen el tipo :c:type:`PyCFunction`, con el parámetro *self*, y un parámetro :c:expr:`PyObject*` que representa el argumento único.

source: These two constants are not used to indicate the calling convention but the binding when use with methods of classes. These may not be used for functions defined for modules. At most one of these flags may be set for any given method.
es_es: Estas dos constantes no se utilizan para indicar la convención de llamada, sino la vinculación cuando se usan con métodos de clases. No se pueden usar para funciones definidas en módulos. Como máximo, se puede establecer una de estas banderas para cualquier método dado.

source: The method will be passed the type object as the first parameter rather than an instance of the type. This is used to create *class methods*, similar to what is created when using the :func:`classmethod` built-in function.
es_es: El método recibirá el objeto de tipo como primer parámetro en lugar de una instancia del tipo. Esto se utiliza para crear *métodos de clase*, similares a los que se crean al usar la función integrada :func:`classmethod`.

source: The method will be passed ``NULL`` as the first parameter rather than an instance of the type. This is used to create *static methods*, similar to what is created when using the :func:`staticmethod` built-in function.
es_es: Al método se le pasará ``NULL`` como primer parámetro en lugar de una instancia del tipo. Esto se utiliza para crear *métodos estáticos*, similares a los que se crean cuando se utiliza la función incorporada :func:`staticmethod`.

source: One other constant controls whether a method is loaded in place of another definition with the same method name.
es_es: Otra constante controla si un método se carga en lugar de otra definición con el mismo nombre de método.

source: The method will be loaded in place of existing definitions. Without *METH_COEXIST*, the default is to skip repeated definitions. Since slot wrappers are loaded before the method table, the existence of a *sq_contains* slot, for example, would generate a wrapped method named :meth:`~object.__contains__` and preclude the loading of a corresponding PyCFunction with the same name. With the flag defined, the PyCFunction will be loaded in place of the wrapper object and will co-exist with the slot. This is helpful because calls to PyCFunctions are optimized more than wrapper object calls.
es_es: El método se cargará en lugar de las definiciones existentes. Sin *METH_COEXIST*, por defecto se omiten las definiciones repetidas. Dado que las envolturas de ranuras se cargan antes que la tabla de métodos, la existencia de una ranura *sq_contains*, por ejemplo, generaría un método envuelto llamado :meth:`~object.__contains__` e impediría la carga de una PyCFunction correspondiente con el mismo nombre. Con la bandera definida, la PyCFunction se cargará en lugar del objeto envoltorio y coexistirá con la ranura. Esto es útil porque las llamadas a PyCFunctions están más optimizadas que las llamadas al objeto envoltorio.

source: Turn *ml* into a Python :term:`callable` object. The caller must ensure that *ml* outlives the :term:`callable`. Typically, *ml* is defined as a static variable.
es_es: Convierte *ml* en un objeto :term:`callable` de Python. El invocador debe asegurarse de que *ml* sobrevive al :term:`callable`. Normalmente, *ml* se define como una variable estática.

source: The *self* parameter will be passed as the *self* argument to the C function in ``ml->ml_meth`` when invoked. *self* can be ``NULL``.
es_es: El parámetro *self* se pasará como argumento *self* a la función C en ``ml->ml_meth`` cuando se invoque. *self* puede ser ``NULL``.

source: The :term:`callable` object's ``__module__`` attribute can be set from the given *module* argument. *module* should be a Python string, which will be used as name of the module the function is defined in. If unavailable, it can be set to :const:`None` or ``NULL``.
es_es: El atributo ``__module__`` del objeto :term:`callable` puede establecerse a partir del argumento *module* dado. *module* debe ser una cadena de Python, que se utilizará como nombre del módulo en el que se define la función. Si no está disponible, puede establecerse como :const:`None` o ``NULL``.

source: The *cls* parameter will be passed as the *defining_class* argument to the C function. Must be set if :c:macro:`METH_METHOD` is set on ``ml->ml_flags``.
es_es: El parámetro *cls* se pasará como argumento *defining_class* a la función C. Debe establecerse si :c:macro:`METH_METHOD` se establece en ``ml->ml_flags``.

source: Equivalent to ``PyCMethod_New(ml, self, module, NULL)``.
es_es: Equivalente a ``PyCMethod_New(ml, self, module, NULL)``.

source: Equivalent to ``PyCMethod_New(ml, self, NULL, NULL)``.
es_es: Equivalente a ``PyCMethod_New(ml, self, NULL, NULL)``.

source: Accessing attributes of extension types
es_es: Acceso a los atributos de los tipos de extensión

source: Structure which describes an attribute of a type which corresponds to a C struct member. When defining a class, put a NULL-terminated array of these structures in the :c:member:`~PyTypeObject.tp_members` slot.
es_es: Estructura que describe un atributo de un tipo que corresponde a un miembro struct de C. Al definir una clase, coloque una matriz terminada en NULL de estas estructuras en la ranura :c:member:`~PyTypeObject.tp_members`.

source: Its fields are, in order:
es_es: Sus campos son, por orden:

source: Name of the member. A NULL value marks the end of a ``PyMemberDef[]`` array.
es_es: Nombre del miembro. Un valor NULL marca el final de una matriz ``PyMemberDef[]``.
