Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/sys.po
Languages: es_es

source: Operating System Utilities
es_es: Utilidades del sistema operativo

source: Function to prepare some internal state before a process fork. This should be called before calling :c:func:`fork` or any similar function that clones the current process. Only available on systems where :c:func:`fork` is defined.
es_es: Función para preparar un estado interno antes de realizar una bifurcación de proceso. Esto debería ser llamado antes de llamar a :c:func:`fork` o cualquier función similar que clone el proceso actual. Solo disponible en sistemas donde :c:func:`fork` está definido.

source: The C :c:func:`fork` call should only be made from the :ref:`"main" thread <fork-and-threads>` (of the :ref:`"main" interpreter <sub-interpreter-support>`). The same is true for ``PyOS_BeforeFork()``.
es_es: La llamada C :c:func:`fork` solo debe realizarse desde el hilo :ref:`"main" <fork-and-threads>` (del intérprete :ref:`"main" <sub-interpreter-support>`). Lo mismo ocurre con ``PyOS_BeforeFork()``.

source: Function to update some internal state after a process fork. This should be called from the parent process after calling :c:func:`fork` or any similar function that clones the current process, regardless of whether process cloning was successful. Only available on systems where :c:func:`fork` is defined.
es_es: Función para actualizar algún estado interno después de un proceso de bifurcación. Esto se debería llamar desde el proceso padre después de llamar a :c:func:`fork` o cualquier función similar que clone el proceso actual, independientemente de si la clonación del proceso fue exitosa. Solo disponible en sistemas donde :c:func:`fork` está definido.

source: The C :c:func:`fork` call should only be made from the :ref:`"main" thread <fork-and-threads>` (of the :ref:`"main" interpreter <sub-interpreter-support>`). The same is true for ``PyOS_AfterFork_Parent()``.
es_es: La llamada C :c:func:`fork` solo debe realizarse desde el hilo :ref:`"main" <fork-and-threads>` (del intérprete :ref:`"main" <sub-interpreter-support>`). Lo mismo ocurre con ``PyOS_AfterFork_Parent()``.

source: Function to update internal interpreter state after a process fork. This must be called from the child process after calling :c:func:`fork`, or any similar function that clones the current process, if there is any chance the process will call back into the Python interpreter. Only available on systems where :c:func:`fork` is defined.
es_es: Función para actualizar el estado interno del intérprete después de un proceso de bifurcación. Este se debe llamar desde el proceso hijo después de llamar a :c:func:`fork`, o cualquier función similar que clone el proceso actual, si existe alguna posibilidad de que el proceso llame de vuelta al intérprete de Python. Solo disponible en sistemas donde :c:func:`fork` está definido.

source: The C :c:func:`fork` call should only be made from the :ref:`"main" thread <fork-and-threads>` (of the :ref:`"main" interpreter <sub-interpreter-support>`). The same is true for ``PyOS_AfterFork_Child()``.
es_es: La llamada C :c:func:`fork` solo se debe realizar desde el hilo :ref:`"main" <fork-and-threads>` (del intérprete ::ref:`"main" <sub-interpreter-support>`). Lo mismo ocurre con ``PyOS_AfterFork_Child()``.

source: :func:`os.register_at_fork` allows registering custom Python functions to be called by :c:func:`PyOS_BeforeFork()`, :c:func:`PyOS_AfterFork_Parent` and :c:func:`PyOS_AfterFork_Child`.
es_es: :func:`os.register_at_fork` permite registrar funciones personalizadas de Python para que sea llamada por :c:func:`PyOS_BeforeFork()`, :c:func:`PyOS_AfterFork_Parent` y :c:func:`PyOS_AfterFork_Child`.

source: Function to update some internal state after a process fork; this should be called in the new process if the Python interpreter will continue to be used. If a new executable is loaded into the new process, this function does not need to be called.
es_es: Función para actualizar algún estado interno después de un proceso de bifurcación; esta se debería llamar en el nuevo proceso si se va a seguir utilizando el intérprete de Python. Si se carga un nuevo ejecutable en el nuevo proceso, no es necesario llamar a esta función.

source: This function is superseded by :c:func:`PyOS_AfterFork_Child()`.
es_es: Esta función es reemplazada por :c:func:`PyOS_AfterFork_Child()`.

source: Return a pointer to a newly allocated wide character string, use :c:func:`PyMem_RawFree` to free the memory. If size is not ``NULL``, write the number of wide characters excluding the null character into ``*size``
es_es: Devuelve un puntero a una cadena de caracteres anchos recién asignada, usa :c:func:`PyMem_RawFree` para liberar la memoria. Si size no es ``NULL``, escribe el número de caracteres anchos excluyendo el carácter nulo en ``*size``.

source: Return ``NULL`` on decoding error or memory allocation error. If *size* is not ``NULL``, ``*size`` is set to ``(size_t)-1`` on memory error or set to ``(size_t)-2`` on decoding error.
es_es: Devolver ``NULL`` en caso de error de decodificación o error de asignación de memoria. Si *size* no es ``NULL``, ``*size`` se establece en ``(size_t)-1`` en caso de error de memoria o se establece en ``(size_t)-2`` en caso de error de decodificación.

source: Decoding errors should never happen, unless there is a bug in the C library.
es_es: Los errores de decodificación nunca deberían ocurrir, a menos que haya un error en la biblioteca C.

source: Use the :c:func:`Py_EncodeLocale` function to encode the character string back to a byte string.
es_es: Usar la función :c:func:`Py_EncodeLocale` para codificar la cadena de caracteres de nuevo a una cadena de bytes.

source: The :c:func:`PyUnicode_DecodeFSDefaultAndSize` and :c:func:`PyUnicode_DecodeLocaleAndSize` functions.
es_es: Las funciones :c:func:`PyUnicode_DecodeFSDefaultAndSize` y :c:func:`PyUnicode_DecodeLocaleAndSize`.

source: Return a pointer to a newly allocated byte string, use :c:func:`PyMem_Free` to free the memory. Return ``NULL`` on encoding error or memory allocation error.
es_es: Devuelve un puntero a una cadena de bytes recién asignada, usa :c:func:`PyMem_Free` para liberar la memoria. Devuelve ``NULL`` en caso de error de codificación o error de asignación de memoria.

source: If error_pos is not ``NULL``, ``*error_pos`` is set to ``(size_t)-1`` on success, or set to the index of the invalid character on encoding error.
es_es: Si error_pos no es ``NULL``, ``*error_pos`` se establece en ``(size_t)-1`` en caso de éxito, o en el índice del carácter no válido en caso de error de codificación.

source: Use the :c:func:`Py_DecodeLocale` function to decode the bytes string back to a wide character string.
es_es: Utilice la función :c:func:`Py_DecodeLocale` para decodificar la cadena de bytes de nuevo a una cadena de caracteres amplia.

source: The :c:func:`PyUnicode_EncodeFSDefault` and :c:func:`PyUnicode_EncodeLocale` functions.
es_es: Las funciones :c:func:`PyUnicode_EncodeFSDefault` y :c:func:`PyUnicode_EncodeLocale`.

source: System Functions
es_es: Funciones del sistema

source: These are utility functions that make functionality from the :mod:`sys` module accessible to C code. They all work with the current interpreter thread's :mod:`sys` module's dict, which is contained in the internal thread state structure.
es_es: Estas son funciones de utilidad que hacen que la funcionalidad del módulo :mod:`sys` sea accesible al código C. Todas ellas trabajan con el dict del módulo :mod:`sys` del hilo del intérprete actual, que está contenido en la estructura de estado del hilo interno.

source: Return the object *name* from the :mod:`sys` module or ``NULL`` if it does not exist, without setting an exception.
es_es: Devuelve el objeto *name* del módulo :mod:`sys` o ``NULL`` si no existe, sin generar una excepción.

source: Set *name* in the :mod:`sys` module to *v* unless *v* is ``NULL``, in which case *name* is deleted from the sys module. Returns ``0`` on success, ``-1`` on error.
es_es: Establece *name* en el módulo :mod:`sys` a *v* a menos que *v* sea ``NULL``, en cuyo caso se elimina *name* del módulo sys. Devuelve ``0`` en caso de éxito, ``-1`` en caso de error.

source: Reset :data:`sys.warnoptions` to an empty list. This function may be called prior to :c:func:`Py_Initialize`.
es_es: Restablecer :data:`sys.warnoptions` a una lista vacía. Se puede llamar esta función antes de :c:func:`Py_Initialize`.

source: Write the output string described by *format* to :data:`sys.stdout`. No exceptions are raised, even if truncation occurs (see below).
es_es: Escribir la cadena de salida descrita por *format* en :data:`sys.stdout`. No se generan excepciones, incluso si se produce truncamiento (ver más abajo).

source: *format* should limit the total size of the formatted output string to 1000 bytes or less -- after 1000 bytes, the output string is truncated. In particular, this means that no unrestricted "%s" formats should occur; these should be limited using "%.<N>s" where <N> is a decimal number calculated so that <N> plus the maximum size of other formatted text does not exceed 1000 bytes. Also watch out for "%f", which can print hundreds of digits for very large numbers.
es_es: *format* debería limitar el tamaño total de la cadena de salida formateada a 1000 bytes o menos; después de 1000 bytes, la cadena de salida se truncará. En particular, esto significa que no deben ocurrir formatos "%s" sin restricciones; estos deben limitarse usando "%.<N>s" donde <N> es un número decimal calculado de manera que <N> más el tamaño máximo de otro texto formateado no exceda los 1000 bytes. También tener cuidado con "%f", que puede imprimir cientos de dígitos para números muy grandes.

source: If a problem occurs, or :data:`sys.stdout` is unset, the formatted message is written to the real (C level) *stdout*.
es_es: Si ocurre un problema, o :data:`sys.stdout` no está configurado, el mensaje formateado se escribe en el *stdout* real (nivel C).

source: As :c:func:`PySys_WriteStdout`, but write to :data:`sys.stderr` or *stderr* instead.
es_es: Como :c:func:`PySys_WriteStdout`, pero escribe en :data:`sys.stderr` o *stderr* en su lugar.

source: Function similar to PySys_WriteStdout() but format the message using :c:func:`PyUnicode_FromFormatV` and don't truncate the message to an arbitrary length.
es_es: Función similar a PySys_WriteStdout() pero formatea el mensaje utilizando :c:func:`PyUnicode_FromFormatV` y no trunca el mensaje a una longitud arbitraria.

source: As :c:func:`PySys_FormatStdout`, but write to :data:`sys.stderr` or *stderr* instead.
es_es: Como :c:func:`PySys_FormatStdout`, pero escribe en :data:`sys.stderr` o *stderr* en su lugar.

source: Return the current dictionary of :option:`-X` options, similarly to :data:`sys._xoptions`. On error, ``NULL`` is returned and an exception is set.
es_es: Devuelve el diccionario actual de opciones :option:`-X`, de manera similar a :data:`sys._xoptions`. En caso de error, se devuelve ``NULL`` y se establece una excepción.

source: Raise an auditing event with any active hooks. Return zero for success and non-zero with an exception set on failure.
es_es: Elevar un acto de auditoría con cualquier gancho activo. Devolver cero en caso de éxito y un número distinto de cero con una excepción establecida en caso de fallo.

source: Note that ``#`` format characters should always be treated as :c:type:`Py_ssize_t`, regardless of whether ``PY_SSIZE_T_CLEAN`` was defined.
es_es: Tener en cuenta que los caracteres de formato ``#`` siempre deben tratarse como :c:type:`Py_ssize_t`, independientemente de si se definió ``PY_SSIZE_T_CLEAN``.

source: :func:`sys.audit` performs the same function from Python code.
es_es: :func:`sys.audit` realiza la misma función desde el código de Python.

source: Require :c:type:`Py_ssize_t` for ``#`` format characters. Previously, an unavoidable deprecation warning was raised.
es_es: Requiere :c:type:`Py_ssize_t` para los caracteres de formato ``#``. Anteriormente, se generaba una advertencia de deprecación inevitable.

source: Append the callable *hook* to the list of active auditing hooks. Return zero on success and non-zero on failure. If the runtime has been initialized, also set an error on failure. Hooks added through this API are called for all interpreters created by the runtime.
es_es: Añade el *hook* llamable a la lista de ganchos de auditoría activos. Devuelve cero en caso de éxito y distinto de cero en caso de fallo. Si se ha inicializado el tiempo de ejecución, también establece un error en caso de fallo. Se llaman los ganchos añadidos a través de esta API para todos los intérpretes creados por el tiempo de ejecución.

source: The *userData* pointer is passed into the hook function. Since hook functions may be called from different runtimes, this pointer should not refer directly to Python state.
es_es: El puntero *userData* se pasa a la función gancho. Dado que las funciones gancho se pueden llamar en diferentes tiempos de ejecución, este puntero no debe referirse directamente al estado de Python.

source: This function is safe to call before :c:func:`Py_Initialize`. When called after runtime initialization, existing audit hooks are notified and may silently abort the operation by raising an error subclassed from :class:`Exception` (other errors will not be silenced).
es_es: Esta función es segura de llamar antes de :c:func:`Py_Initialize`. Cuando se llama después de la inicialización en tiempo de ejecución, se notifican los ganchos de auditoría existentes y pueden abortar silenciosamente la operación al generar un error subclasificado de :class:`Exception` (no se silenciarán otros errores).

source: See :pep:`578` for a detailed description of auditing. Functions in the runtime and standard library that raise events are listed in the :ref:`audit events table <audit-events>`. Details are in each function's documentation.
es_es: Ver :pep:`578` para una descripción detallada de la auditoría. Las funciones en tiempo de ejecución y la biblioteca estándar que generan eventos se enumeran en la :ref:`audit events table <audit-events>`. Los detalles se encuentran en la documentación de cada función.

source: Process Control
es_es: Control de Procesos

source: The ``Py_FatalError()`` function is replaced with a macro which logs automatically the name of the current function, unless the ``Py_LIMITED_API`` macro is defined.
es_es: La función ``Py_FatalError()`` se sustituye por una macro que registra automáticamente el nombre de la función actual, a menos que esté definida la macro ``Py_LIMITED_API``.

source: Log the function name automatically.
es_es: Registrar automáticamente el nombre de la función.

source: Exit the current process. This calls :c:func:`Py_FinalizeEx` and then calls the standard C library function ``exit(status)``. If :c:func:`Py_FinalizeEx` indicates an error, the exit status is set to 120.
es_es: Salir del proceso actual. Esto llama a :c:func:`Py_FinalizeEx` y luego llama a la función de la biblioteca estándar de C ``exit(status)``. Si :c:func:`Py_FinalizeEx` indica un error, el estado de salida se establece en 120.

source: Errors from finalization no longer ignored.
es_es: Errores de finalización ya no ignorados.

source: Register a cleanup function to be called by :c:func:`Py_FinalizeEx`. The cleanup function will be called with no arguments and should return no value. At most 32 cleanup functions can be registered. When the registration is successful, :c:func:`Py_AtExit` returns ``0``; on failure, it returns ``-1``. The cleanup function registered last is called first. Each cleanup function will be called at most once. Since Python's internal finalization will have completed before the cleanup function, no Python APIs should be called by *func*.
es_es: Registrar una función de limpieza para ser llamada por :c:func:`Py_FinalizeEx`. La función de limpieza será llamada sin argumentos y no deberá devolver ningún valor. Se pueden registrar como máximo 32 funciones de limpieza. Cuando el registro sea exitoso, :c:func:`Py_AtExit` devuelve ``0``; en caso de fallo, devuelve ``-1``. La última función de limpieza registrada es la primera en ser llamada. Cada función de limpieza será llamada como máximo una vez. Dado que la finalización interna de Python se habrá completado antes de la función de limpieza, no se deben llamar a las API de Python por *func*.
