Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/tuple.po
Languages: ru

source: Tuple Objects
ru: Объекты кортежа

source: This subtype of :c:type:`PyObject` represents a Python tuple object.
ru: Этот подтип :c:type:` PyObject` представляет собой объект-кортеж Python.

source: This instance of :c:type:`PyTypeObject` represents the Python tuple type; it is the same object as :class:`tuple` in the Python layer.
ru: Этот экземпляр :c:type:`PyTypeObject` представляет тип кортежа Python; это тот же объект, что и :class:`tuple` на уровне Python.

source: Return true if *p* is a tuple object or an instance of a subtype of the tuple type. This function always succeeds.
ru: Возвращайте true, если *p* является объектом кортежа или экземпляром подтипа типа кортеж. Эта функция всегда завершается успешно.

source: Return true if *p* is a tuple object, but not an instance of a subtype of the tuple type. This function always succeeds.
ru: Возвращайте true, если *p* является объектом кортежа, но не экземпляром подтипа типа кортеж. Эта функция всегда завершается успешно.

source: Return a new tuple object of size *len*, or ``NULL`` with an exception set on failure.
ru: Возвращает новый объект-кортеж размером *len* или ``NULL`` с исключением, установленным в случае сбоя.

source: Return a new tuple object of size *n*, or ``NULL`` with an exception set on failure. The tuple values are initialized to the subsequent *n* C arguments pointing to Python objects. ``PyTuple_Pack(2, a, b)`` is equivalent to ``Py_BuildValue("(OO)", a, b)``.
ru: Вернуть новый объект-кортеж размером *n* или ``NULL`` с исключением, установленным в случае сбоя. Значения кортежа инициализируются последующими аргументами *n* C, указывающими на объекты Python. ``PyTuple_Pack(2, a, b)`` эквивалентен ``Py_BuildValue("(OO)", a, b)``.

source: Take a pointer to a tuple object, and return the size of that tuple. On error, return ``-1`` and with an exception set.
ru: Возьмите указатель на объект кортежа и верните размер этого кортежа. В случае ошибки вернуть ``-1`` и установить исключение.

source: Like :c:func:`PyTuple_Size`, but without error checking.
ru: Как :c:func:`PyTuple_Size`, но без проверки ошибок.

source: Return the object at position *pos* in the tuple pointed to by *p*. If *pos* is negative or out of bounds, return ``NULL`` and set an :exc:`IndexError` exception.
ru: Верните объект в позиции *pos* в кортеже, на который указывает *p*. Если *pos* отрицательное или выходит за пределы, верните ``NULL`` и установите исключение :exc:`IndexError`.

source: The returned reference is borrowed from the tuple *p* (that is: it is only valid as long as you hold a reference to *p*). To get a :term:`strong reference`, use :c:func:`Py_NewRef(PyTuple_GetItem(...)) <Py_NewRef>` or :c:func:`PySequence_GetItem`.
ru: Возвращенная ссылка заимствована из кортежа *p* (то есть: она действительна только до тех пор, пока вы храните ссылку на *p*). Чтобы получить :term:`сильную ссылку`, используйте :c:func:`Py_NewRef(PyTuple_GetItem(...)) <Py_NewRef>` или :c:func:`PySequence_GetItem`.

source: Like :c:func:`PyTuple_GetItem`, but does no checking of its arguments.
ru: Подобно :c:func:`PyTuple_GetItem`, но не проверяет свои аргументы.

source: Return the slice of the tuple pointed to by *p* between *low* and *high*, or ``NULL`` with an exception set on failure.
ru: Возвращает фрагмент кортежа, на который указывает *p*, между *low* и *high* или ``NULL`` с исключением, установленным в случае сбоя.

source: This is the equivalent of the Python expression ``p[low:high]``. Indexing from the end of the tuple is not supported.
ru: Это эквивалент выражения Python ``p[low:high]``. Индексация с конца кортежа не поддерживается.

source: Insert a reference to object *o* at position *pos* of the tuple pointed to by *p*. Return ``0`` on success. If *pos* is out of bounds, return ``-1`` and set an :exc:`IndexError` exception.
ru: Вставьте ссылку на объект *o* в позицию *pos* кортежа, на который указывает *p*. Верните ``0`` в случае успеха. Если *pos* выходит за пределы, верните ``-1`` и установите исключение :exc:`IndexError`.

source: This function "steals" a reference to *o* and discards a reference to an item already in the tuple at the affected position.
ru: Эта функция «крадет» ссылку на *o* и отбрасывает ссылку на элемент, уже находящийся в кортеже в затронутой позиции.

source: Like :c:func:`PyTuple_SetItem`, but does no error checking, and should *only* be used to fill in brand new tuples.
ru: Подобно :c:func:`PyTuple_SetItem`, но не выполняет проверку ошибок и должен использоваться *только* для заполнения новых кортежей.

source: Bounds checking is performed as an assertion if Python is built in :ref:`debug mode <debug-build>` or :option:`with assertions <--with-assertions>`.
ru: Проверка границ выполняется как утверждение, если Python встроен в :ref:`режиме отладки <debug-build>` или :option:`с утверждениями <--with-assertions>`.

source: This function "steals" a reference to *o*, and, unlike :c:func:`PyTuple_SetItem`, does *not* discard a reference to any item that is being replaced; any reference in the tuple at position *pos* will be leaked.
ru: Эта функция «крадет» ссылку на *o* и, в отличие от :c:func:`PyTuple_SetItem`, *не* отбрасывает ссылку на любой заменяемый элемент; любая ссылка в кортеже в позиции *pos* будет утеряна.

source: Can be used to resize a tuple. *newsize* will be the new length of the tuple. Because tuples are *supposed* to be immutable, this should only be used if there is only one reference to the object. Do *not* use this if the tuple may already be known to some other part of the code. The tuple will always grow or shrink at the end. Think of this as destroying the old tuple and creating a new one, only more efficiently. Returns ``0`` on success. Client code should never assume that the resulting value of ``*p`` will be the same as before calling this function. If the object referenced by ``*p`` is replaced, the original ``*p`` is destroyed. On failure, returns ``-1`` and sets ``*p`` to ``NULL``, and raises :exc:`MemoryError` or :exc:`SystemError`.
ru: Может использоваться для изменения размера кортежа. *newsize* будет новой длиной кортежа. Поскольку кортежи *предполагаются* неизменяемыми, это следует использовать только в том случае, если на объект существует только одна ссылка. *Не* используйте это, если кортеж уже известен какой-то другой части кода. В конце кортеж всегда будет увеличиваться или уменьшаться. Думайте об этом как об уничтожении старого кортежа и создании нового, только более эффективного. Возвращает ``0`` в случае успеха. Клиентский код никогда не должен предполагать, что результирующее значение ``*p`` будет таким же, как и до вызова этой функции. Если объект, на который ссылается ``*p``, заменяется, исходный ``*p`` уничтожается. В случае ошибки возвращает ``-1``, устанавливает ``*p`` в ``NULL`` и вызывает :exc:`MemoryError` или :exc:`SystemError`.

source: Struct Sequence Objects
ru: Структурировать объекты последовательности

source: Struct sequence objects are the C equivalent of :func:`~collections.namedtuple` objects, i.e. a sequence whose items can also be accessed through attributes. To create a struct sequence, you first have to create a specific struct sequence type.
ru: Объекты последовательности структур являются эквивалентом C объектов :func:`~collections.namedtuple`, т.е. последовательности, к элементам которой также можно получить доступ через атрибуты. Чтобы создать последовательность структур, сначала необходимо создать определенный тип последовательности структур.

source: Create a new struct sequence type from the data in *desc*, described below. Instances of the resulting type can be created with :c:func:`PyStructSequence_New`.
ru: Создайте новый тип последовательности структур из данных в *desc*, как описано ниже. Экземпляры результирующего типа могут быть созданы с помощью :c:func:`PyStructSequence_New`.

source: Return ``NULL`` with an exception set on failure.
ru: Возвращает NULL с исключением, установленным в случае сбоя.

source: Initializes a struct sequence type *type* from *desc* in place.
ru: Инициализирует тип последовательности структур *type* из *desc* на месте.

source: Like :c:func:`PyStructSequence_InitType`, but returns ``0`` on success and ``-1`` with an exception set on failure.
ru: Подобно :c:func:`PyStructSequence_InitType`, но возвращает ``0`` в случае успеха и ``-1`` с установленным исключением в случае неудачи.

source: Contains the meta information of a struct sequence type to create.
ru: Содержит метаинформацию о типе последовательности структуры, которую необходимо создать.

source: Fully qualified name of the type; null-terminated UTF-8 encoded. The name must contain the module name.
ru: Полное имя типа; в кодировке UTF-8 с нулевым завершением. Имя должно содержать имя модуля.

source: Pointer to docstring for the type or ``NULL`` to omit.
ru: Указатель на строку документации для типа или ``NULL``, который нужно опустить.

source: Pointer to ``NULL``-terminated array with field names of the new type.
ru: Указатель на завершающийся NULL массив с именами полей нового типа.

source: Number of fields visible to the Python side (if used as tuple).
ru: Количество полей, видимых на стороне Python (если используется как кортеж).

source: Describes a field of a struct sequence. As a struct sequence is modeled as a tuple, all fields are typed as :c:expr:`PyObject*`. The index in the :c:member:`~PyStructSequence_Desc.fields` array of the :c:type:`PyStructSequence_Desc` determines which field of the struct sequence is described.
ru: Описывает поле последовательности структуры. Поскольку последовательность структур моделируется как кортеж, все поля имеют тип :c:expr:` PyObject *`. Индекс в массиве :c:member:`~PyStructSequence_Desc.fields` :c:type:`PyStructSequence_Desc` определяет, какое поле последовательности структур описывается.

source: Name for the field or ``NULL`` to end the list of named fields, set to :c:data:`PyStructSequence_UnnamedField` to leave unnamed.
ru: Имя поля или ``NULL``, чтобы завершить список именованных полей, установите значение :c:data:`PyStructSequence_UnnamedField`, чтобы оставить безымянным.

source: Field docstring or ``NULL`` to omit.
ru: Поле документации или ``NULL``, чтобы его опустить.

source: Special value for a field name to leave it unnamed.
ru: Специальное значение для имени поля, чтобы оставить его без имени.

source: The type was changed from ``char *``.
ru: Тип был изменен с ``char *``.

source: Creates an instance of *type*, which must have been created with :c:func:`PyStructSequence_NewType`.
ru: Создает экземпляр *type*, который должен быть создан с помощью :c:func:`PyStructSequence_NewType`.

source: Return the object at position *pos* in the struct sequence pointed to by *p*.
ru: Верните объект в позиции *pos* в последовательности структур, на которую указывает *p*.

source: Alias to :c:func:`PyStructSequence_GetItem`.
ru: Псевдоним :c:func:`PyStructSequence_GetItem`.

source: Now implemented as an alias to :c:func:`PyStructSequence_GetItem`.
ru: Теперь реализован как псевдоним :c:func:`PyStructSequence_GetItem`.

source: Sets the field at index *pos* of the struct sequence *p* to value *o*. Like :c:func:`PyTuple_SET_ITEM`, this should only be used to fill in brand new instances.
ru: Устанавливает поле с индексом *pos* последовательности структур *p* в значение *o*. Как и :c:func:`PyTuple_SET_ITEM`, его следует использовать только для заполнения совершенно новых экземпляров.

source: This function "steals" a reference to *o*.
ru: Эта функция «крадет» ссылку на *o*.

source: Alias to :c:func:`PyStructSequence_SetItem`.
ru: Псевдоним :c:func:`PyStructSequence_SetItem`.

source: Now implemented as an alias to :c:func:`PyStructSequence_SetItem`.
ru: Теперь реализован как псевдоним :c:func:`PyStructSequence_SetItem`.

source: object
ru: объект

source: tuple
ru: кортеж
