Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/type.po
Languages: es_es

source: If zero, :c:member:`~PyTypeObject.tp_itemsize` is inherited. Extending arbitrary variable-sized classes is dangerous, since some types use a fixed offset for variable-sized memory, which can then overlap fixed-sized memory used by a subclass. To help prevent mistakes, inheriting ``itemsize`` is only possible in the following situations:
es_es: Si es cero, :c:member:`~PyTypeObject.tp_itemsize` se hereda. Extender clases arbitrarias de tamaño variable es peligroso, ya que algunos tipos utilizan un offset fijo para la memoria de tamaño variable, que puede solaparse con la memoria de tamaño fijo utilizada por una subclase. Para ayudar a prevenir errores, heredar ``itemsize`` sólo es posible en las siguientes situaciones:

source: The base is not variable-sized (its :c:member:`~PyTypeObject.tp_itemsize`).
es_es: La base no es de tamaño variable (su :c:member:`~PyTypeObject.tp_itemsize`).

source: The requested :c:member:`PyType_Spec.basicsize` is positive, suggesting that the memory layout of the base class is known.
es_es: La dirección :c:member:`PyType_Spec.basicsize` solicitada es positiva, lo que sugiere que se conoce la disposición en memoria de la clase base.

source: The requested :c:member:`PyType_Spec.basicsize` is zero, suggesting that the subclass does not access the instance's memory directly.
es_es: El :c:member:`PyType_Spec.basicsize` solicitado es cero, lo que sugiere que la subclase no accede directamente a la memoria de la instancia.

source: With the :c:macro:`Py_TPFLAGS_ITEMS_AT_END` flag.
es_es: Con la bandera :c:macro:`Py_TPFLAGS_ITEMS_AT_END`.

source: Type flags, used to set :c:member:`PyTypeObject.tp_flags`.
es_es: Banderas de tipo, utilizadas para establecer :c:member:`PyTypeObject.tp_flags`.

source: If the ``Py_TPFLAGS_HEAPTYPE`` flag is not set, :c:func:`PyType_FromSpecWithBases` sets it automatically.
es_es: Si la bandera ``Py_TPFLAGS_HEAPTYPE`` no está activada, :c:func:`PyType_FromSpecWithBases` la activa automáticamente.

source: Array of :c:type:`PyType_Slot` structures. Terminated by the special slot value ``{0, NULL}``.
es_es: Matriz de estructuras :c:type:`PyType_Slot`. Terminado por el valor de ranura especial ``{0, NULL}``.

source: Each slot ID should be specified at most once.
es_es: Cada ID de ranura debe especificarse como máximo una vez.

source: Structure defining optional functionality of a type, containing a slot ID and a value pointer.
es_es: Estructura que define la funcionalidad opcional de un tipo, que contiene un ID de ranura y un puntero de valor.

source: A slot ID.
es_es: Un ID de ranura.

source: Slot IDs are named like the field names of the structures :c:type:`PyTypeObject`, :c:type:`PyNumberMethods`, :c:type:`PySequenceMethods`, :c:type:`PyMappingMethods` and :c:type:`PyAsyncMethods` with an added ``Py_`` prefix. For example, use:
es_es: Los IDs de las ranuras se nombran como los nombres de campo de las estructuras :c:type:`PyTypeObject`, :c:type:`PyNumberMethods`, :c:type:`PySequenceMethods`, :c:type:`PyMappingMethods` y :c:type:`PyAsyncMethods` con un prefijo ``Py_`` añadido. Por ejemplo, utiliza:

source: ``Py_tp_dealloc`` to set :c:member:`PyTypeObject.tp_dealloc`
es_es: ``Py_tp_dealloc`` para establecer :c:member:`PyTypeObject.tp_dealloc`

source: ``Py_nb_add`` to set :c:member:`PyNumberMethods.nb_add`
es_es: ``Py_nb_add`` para establecer :c:member:`PyNumberMethods.nb_add`

source: ``Py_sq_length`` to set :c:member:`PySequenceMethods.sq_length`
es_es: ``Py_sq_length`` para establecer :c:member:`PySequenceMethods.sq_length`

source: The following “offset” fields cannot be set using :c:type:`PyType_Slot`:
es_es: Los siguientes campos "offset" no pueden configurarse mediante :c:type:`PyType_Slot`:

source: :c:member:`~PyTypeObject.tp_weaklistoffset` (use :c:macro:`Py_TPFLAGS_MANAGED_WEAKREF` instead if possible)
es_es: :c:member:`~PyTypeObject.tp_weaklistoffset` (si es posible, utilice :c:macro:`Py_TPFLAGS_MANAGED_WEAKREF` en su lugar)

source: :c:member:`~PyTypeObject.tp_dictoffset` (use :c:macro:`Py_TPFLAGS_MANAGED_DICT` instead if possible)
es_es: :c:member:`~PyTypeObject.tp_dictoffset` (si es posible, utilice :c:macro:`Py_TPFLAGS_MANAGED_DICT` en su lugar)

source: :c:member:`~PyTypeObject.tp_vectorcall_offset` (use ``"__vectorcalloffset__"`` in :ref:`PyMemberDef <pymemberdef-offsets>`)
es_es: :c:member:`~PyTypeObject.tp_vectorcall_offset` (use ``"__vectorcalloffset__"``en :ref:`PyMemberDef <pymemberdef-offsets>`)

source: If it is not possible to switch to a ``MANAGED`` flag (for example, for vectorcall or to support Python older than 3.12), specify the offset in :c:member:`Py_tp_members <PyTypeObject.tp_members>`. See :ref:`PyMemberDef documentation <pymemberdef-offsets>` for details.
es_es: Si no es posible cambiar a una bandera ``MANAGED`` (por ejemplo, para vectorcall o para soportar Python anterior a 3.12), especifique el desplazamiento en :c:member:`Py_tp_members <PyTypeObject.tp_members>`. Ver :ref:`PyMemberDef documentation <pymemberdef-offsets>` para más detalles.

source: The following fields cannot be set at all when creating a heap type:
es_es: Los siguientes campos no se pueden establecer en absoluto al crear un tipo de montón:

source: :c:member:`~PyTypeObject.tp_vectorcall` (use :c:member:`~PyTypeObject.tp_new` and/or :c:member:`~PyTypeObject.tp_init`)
es_es: :c:member:`~PyTypeObject.tp_vectorcall` (utilice :c:member:`~PyTypeObject.tp_new` y/o :c:member:`~PyTypeObject.tp_init`)

source: Internal fields: :c:member:`~PyTypeObject.tp_dict`, :c:member:`~PyTypeObject.tp_mro`, :c:member:`~PyTypeObject.tp_cache`, :c:member:`~PyTypeObject.tp_subclasses`, and :c:member:`~PyTypeObject.tp_weaklist`.
es_es: Campos internos: :c:member:`~PyTypeObject.tp_dict`, :c:member:`~PyTypeObject.tp_mro`, :c:member:`~PyTypeObject.tp_cache`, :c:member:`~PyTypeObject.tp_subclasses`, y :c:member:`~PyTypeObject.tp_weaklist`.

source: Setting :c:data:`Py_tp_bases` or :c:data:`Py_tp_base` may be problematic on some platforms. To avoid issues, use the *bases* argument of :c:func:`PyType_FromSpecWithBases` instead.
es_es: Establecer :c:data:`Py_tp_bases` o :c:data:`Py_tp_base` puede ser problemático en algunas plataformas. Para evitar problemas, utilice en su lugar el argumento *bases* de :c:func:`PyType_FromSpecWithBases`.

source: Slots in :c:type:`PyBufferProcs` may be set in the unlimited API.
es_es: Las ranuras en :c:type:`PyBufferProcs` pueden configurarse en la API ilimitada.

source: :c:member:`~PyBufferProcs.bf_getbuffer` and :c:member:`~PyBufferProcs.bf_releasebuffer` are now available under the :ref:`limited API <limited-c-api>`.
es_es: :c:member:`~PyBufferProcs.bf_getbuffer` y :c:member:`~PyBufferProcs.bf_releasebuffer` ya están disponibles bajo la :ref:`limited API <limited-c-api>`.

source: The desired value of the slot. In most cases, this is a pointer to a function.
es_es: El valor deseado de la ranura. En la mayoría de los casos, se trata de un puntero a una función.

source: Slots other than ``Py_tp_doc`` may not be ``NULL``.
es_es: Las ranuras que no sean ``Py_tp_doc`` no pueden ser ``NULL``.

source: object
es_es: objeto

source: type
es_es: tipo
