Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/type.po
Languages: es_es

source: Type Objects
es_es: Objetos tipo

source: The C structure of the objects used to describe built-in types.
es_es: La estructura C de los objetos utilizados para describir los tipos incorporados.

source: This is the type object for type objects; it is the same object as :class:`type` in the Python layer.
es_es: Este es el objeto de tipo para los objetos de tipo; es el mismo objeto que :class:`type` en la capa de Python.

source: Return non-zero if the object *o* is a type object, including instances of types derived from the standard type object. Return 0 in all other cases. This function always succeeds.
es_es: Devolver un valor distinto de cero si el objeto *o* es un objeto de tipo, incluyendo instancias de tipos derivados del objeto de tipo estándar. Devolver 0 en todos los demás casos. Esta función siempre tiene éxito.

source: Return non-zero if the object *o* is a type object, but not a subtype of the standard type object. Return 0 in all other cases. This function always succeeds.
es_es: Devuelve un valor distinto de cero si el objeto *o* es un objeto de tipo, pero no un subtipo del objeto de tipo estándar. Devuelve 0 en todos los demás casos. Esta función siempre tiene éxito.

source: Clear the internal lookup cache. Return the current version tag.
es_es: Borrar la caché interna de búsqueda. Devolver la etiqueta de la versión actual.

source: Return the :c:member:`~PyTypeObject.tp_flags` member of *type*. This function is primarily meant for use with ``Py_LIMITED_API``; the individual flag bits are guaranteed to be stable across Python releases, but access to :c:member:`~PyTypeObject.tp_flags` itself is not part of the :ref:`limited API <limited-c-api>`.
es_es: Devuelve el miembro :c:member:`~PyTypeObject.tp_flags` de *tipo*. Esta función está pensada principalmente para su uso con ``Py_LIMITED_API``; se garantiza que los bits de bandera individuales son estables en todas las versiones de Python, pero el acceso a :c:member:`~PyTypeObject.tp_flags` en sí no forma parte de la :ref:`limited API <limited-c-api>`.

source: The return type is now ``unsigned long`` rather than ``long``.
es_es: El tipo de retorno ahora es ``unsigned long`` en lugar de ``long``.

source: Return the type object's internal namespace, which is otherwise only exposed via a read-only proxy (``cls.__dict__``). This is a replacement for accessing :c:member:`~PyTypeObject.tp_dict` directly. The returned dictionary must be treated as read-only.
es_es: Devuelve el espacio de nombres interno del objeto de tipo, que de otro modo sólo se expone a través de un proxy de sólo lectura (``cls.__dict__``). Esto sustituye el acceso directo a :c:member:`~PyTypeObject.tp_dict`. El diccionario devuelto debe tratarse como de sólo lectura.

source: This function is meant for specific embedding and language-binding cases, where direct access to the dict is necessary and indirect access (e.g. via the proxy or :c:func:`PyObject_GetAttr`) isn't adequate.
es_es: Esta función está pensada para casos específicos de incrustación y vinculación lingüística, en los que es necesario el acceso directo al dict y el acceso indirecto (por ejemplo, a través del proxy o :c:func:`PyObject_GetAttr`) no es adecuado.

source: Extension modules should continue to use ``tp_dict``, directly or indirectly, when setting up their own types.
es_es: Los módulos de ampliación deben seguir utilizando ``tp_dict``, directa o indirectamente, al configurar sus propios tipos.

source: Invalidate the internal lookup cache for the type and all of its subtypes. This function must be called after any manual modification of the attributes or base classes of the type.
es_es: Invalida la caché de búsqueda interna para el tipo y todos sus subtipos. Esta función debe invocarse después de cualquier modificación manual de los atributos o clases base del tipo.

source: Register *callback* as a type watcher. Return a non-negative integer ID which must be passed to future calls to :c:func:`PyType_Watch`. In case of error (e.g. no more watcher IDs available), return ``-1`` and set an exception.
es_es: Registrar *callback* como observador de tipos. Devuelve un ID entero no negativo que debe pasarse a futuras llamadas a :c:func:`PyType_Watch`. En caso de error (por ejemplo, no hay más ID de observador disponibles), devuelve ``-1`` y establece una excepción.

source: Clear watcher identified by *watcher_id* (previously returned from :c:func:`PyType_AddWatcher`). Return ``0`` on success, ``-1`` on error (e.g. if *watcher_id* was never registered.)
es_es: Borra el observador identificado por *watcher_id* (previamente devuelto por :c:func:`PyType_AddWatcher`). Devuelve ``0`` en caso de éxito, ``-1`` en caso de error (por ejemplo, si *watcher_id* nunca se registró.)

source: An extension should never call ``PyType_ClearWatcher`` with a *watcher_id* that was not returned to it by a previous call to :c:func:`PyType_AddWatcher`.
es_es: Nunca debe llamar una extensión a ``PyType_ClearWatcher`` con un *watcher_id* que no le haya sido devuelto por una llamada previa a :c:func:`PyType_AddWatcher`.

source: Mark *type* as watched. The callback granted *watcher_id* by :c:func:`PyType_AddWatcher` will be called whenever :c:func:`PyType_Modified` reports a change to *type*. (The callback may be called only once for a series of consecutive modifications to *type*, if :c:func:`!_PyType_Lookup` is not called on *type* between the modifications; this is an implementation detail and subject to change.)
es_es: Marca *type* como vigilado. La llamada de retorno concedida a *watcher_id* por :c:func:`PyType_AddWatcher` se llamará cada vez que :c:func:`PyType_Modified` informe de un cambio en *type*. (El callback se puede llamar sólo una vez para una serie de modificaciones consecutivas a *type*, si :c:func:`!_PyType_Lookup` no es llamado en *type* entre las modificaciones; esto es un detalle de implementación y está sujeto a cambios).

source: An extension should never call ``PyType_Watch`` with a *watcher_id* that was not returned to it by a previous call to :c:func:`PyType_AddWatcher`.
es_es: Una extensión nunca debe llamar a ``PyType_Watch`` con un *watcher_id* que no le haya sido devuelto por una llamada previa a :c:func:`PyType_AddWatcher`.

source: Type of a type-watcher callback function.
es_es: Tipo de una función de devolución de llamada del observador de tipos.

source: The callback must not modify *type* or cause :c:func:`PyType_Modified` to be called on *type* or any type in its MRO; violating this rule could cause infinite recursion.
es_es: La llamada de retorno no debe modificar *type* o causar que :c:func:`PyType_Modified` sea llamado en *type* o cualquier tipo en su MRO; violar esta regla podría causar recursión infinita.

source: Return non-zero if the type object *o* sets the feature *feature*. Type features are denoted by single bit flags.
es_es: Devuelve un valor distinto de cero si el objeto de tipo *o* establece la característica *feature*. Las características de tipo se indican mediante banderas de bits individuales.

source: Return true if the type object includes support for the cycle detector; this tests the type flag :c:macro:`Py_TPFLAGS_HAVE_GC`.
es_es: Devuelve true si el objeto de tipo incluye soporte para el detector de ciclos; esto comprueba la bandera de tipo :c:macro:`Py_TPFLAGS_HAVE_GC`.

source: Return true if *a* is a subtype of *b*.
es_es: Devuelve true si *a* es un subtipo de *b*.

source: This function only checks for actual subtypes, which means that :meth:`~class.__subclasscheck__` is not called on *b*. Call :c:func:`PyObject_IsSubclass` to do the same check that :func:`issubclass` would do.
es_es: Esta función solo verifica los subtipos reales, lo que significa que no se llama a :meth:`~class.__subclasscheck__` en *b*. Llama a :c:func:`PyObject_IsSubclass` para hacer la misma verificación que haría :func:`issubclass`.

source: Generic handler for the :c:member:`~PyTypeObject.tp_alloc` slot of a type object. Use Python's default memory allocation mechanism to allocate a new instance and initialize all its contents to ``NULL``.
es_es: Manejador genérico para la ranura :c:member:`~PyTypeObject.tp_alloc` de un objeto de tipo. Utilizar el mecanismo de asignación de memoria predeterminado de Python para asignar una nueva instancia e inicializar todos sus contenidos a ``NULL``.

source: Generic handler for the :c:member:`~PyTypeObject.tp_new` slot of a type object. Create a new instance using the type's :c:member:`~PyTypeObject.tp_alloc` slot.
es_es: Manejador genérico para la ranura :c:member:`~PyTypeObject.tp_new` de un objeto de tipo. Crea una nueva instancia utilizando la ranura :c:member:`~PyTypeObject.tp_alloc` del tipo.

source: Finalize a type object. This should be called on all type objects to finish their initialization. This function is responsible for adding inherited slots from a type's base class. Return ``0`` on success, or return ``-1`` and sets an exception on error.
es_es: Finaliza un objeto de tipo. Se debe llamar en todos los objetos de tipo para finalizar su inicialización. Esta función es responsable de añadir las ranuras heredadas de la clase base de un tipo. Devuelve ``0`` en caso de éxito, o devuelve ``-1`` y establece una excepción en caso de error.

source: If some of the base classes implements the GC protocol and the provided type does not include the :c:macro:`Py_TPFLAGS_HAVE_GC` in its flags, then the GC protocol will be automatically implemented from its parents. On the contrary, if the type being created does include :c:macro:`Py_TPFLAGS_HAVE_GC` in its flags then it **must** implement the GC protocol itself by at least implementing the :c:member:`~PyTypeObject.tp_traverse` handle.
es_es: Si alguna de las clases base implementa el protocolo GC y el tipo proporcionado no incluye :c:macro:`Py_TPFLAGS_HAVE_GC` en sus banderas, entonces el protocolo GC será implementado automáticamente desde sus padres. Por el contrario, si el tipo que se está creando incluye :c:macro:`Py_TPFLAGS_HAVE_GC` en sus banderas entonces **debe** implementar el protocolo GC por sí mismo implementando al menos el manejador :c:member:`~PyTypeObject.tp_traverse`.

source: Return the type's name. Equivalent to getting the type's ``__name__`` attribute.
es_es: Devuelve el nombre del tipo. Equivale a obtener el atributo ``__name__`` del tipo.

source: Return the type's qualified name. Equivalent to getting the type's ``__qualname__`` attribute.
es_es: Devuelve el nombre cualificado del tipo. Equivale a obtener el atributo ``__qualname__`` del tipo.

source: Return the function pointer stored in the given slot. If the result is ``NULL``, this indicates that either the slot is ``NULL``, or that the function was called with invalid parameters. Callers will typically cast the result pointer into the appropriate function type.
es_es: Devuelve el puntero de la función almacenada en la ranura dada. Si el resultado es ``NULL``, esto indica que la ranura es ``NULL``, o que se llamó la función con parámetros inválidos. Quienes llaman a la función normalmente convertirán el puntero resultante en el tipo de función apropiado.

source: See :c:member:`PyType_Slot.slot` for possible values of the *slot* argument.
es_es: Ver :c:member:`PyType_Slot.slot` para los posibles valores del argumento *slot*.

source: :c:func:`PyType_GetSlot` can now accept all types. Previously, it was limited to :ref:`heap types <heap-types>`.
es_es: :c:func:`PyType_GetSlot` ahora puede aceptar todos los tipos. Anteriormente, se limitaba a :ref:`heap types <heap-types>`.

source: Return the module object associated with the given type when the type was created using :c:func:`PyType_FromModuleAndSpec`.
es_es: Devuelve el objeto módulo asociado con el tipo dado cuando el tipo fue creado usando :c:func:`PyType_FromModuleAndSpec`.

source: If no module is associated with the given type, sets :py:class:`TypeError` and returns ``NULL``.
es_es: Si no hay ningún módulo asociado al tipo dado, establece :py:class:`TypeError` y devuelve ``NULL``.

source: This function is usually used to get the module in which a method is defined. Note that in such a method, ``PyType_GetModule(Py_TYPE(self))`` may not return the intended result. ``Py_TYPE(self)`` may be a *subclass* of the intended class, and subclasses are not necessarily defined in the same module as their superclass. See :c:type:`PyCMethod` to get the class that defines the method. See :c:func:`PyType_GetModuleByDef` for cases when :c:type:`!PyCMethod` cannot be used.
es_es: Esta función se utiliza normalmente para obtener el módulo en el que está definido un método. Tenga en cuenta que en un método de este tipo, ``PyType_GetModule(Py_TYPE(self))`` puede no devolver el resultado previsto. ``Py_TYPE(self)`` puede ser una *subclase* de la clase prevista, y las subclases no están necesariamente definidas en el mismo módulo que su superclase. Consulte :c:type:`PyCMethod` para obtener la clase que define el método. Consulte :c:func:`PyType_GetModuleByDef` para los casos en los que no se puede utilizar :c:type:`!PyCMethod`.

source: Return the state of the module object associated with the given type. This is a shortcut for calling :c:func:`PyModule_GetState()` on the result of :c:func:`PyType_GetModule`.
es_es: Devuelve el estado del objeto módulo asociado al tipo dado. Es un atajo para llamar a :c:func:`PyModule_GetState()` sobre el resultado de :c:func:`PyType_GetModule`.

source: If the *type* has an associated module but its state is ``NULL``, returns ``NULL`` without setting an exception.
es_es: Si el *type* tiene un módulo asociado pero su estado es ``NULL``, devuelve ``NULL`` sin establecer una excepción.

source: Find the first superclass whose module was created from the given :c:type:`PyModuleDef` *def*, and return that module.
es_es: Encuentra la primera superclase cuyo módulo fue creado a partir de la :c:type:`PyModuleDef` *def* dada, y devuelve ese módulo.

source: If no module is found, raises a :py:class:`TypeError` and returns ``NULL``.
es_es: Si no se encuentra ningún módulo, lanza un :py:class:`TypeError` y devuelve ``NULL``.

source: This function is intended to be used together with :c:func:`PyModule_GetState()` to get module state from slot methods (such as :c:member:`~PyTypeObject.tp_init` or :c:member:`~PyNumberMethods.nb_add`) and other places where a method's defining class cannot be passed using the :c:type:`PyCMethod` calling convention.
es_es: Esta función está pensada para ser utilizada junto con :c:func:`PyModule_GetState()` para obtener el estado del módulo de métodos de ranura (como :c:member:`~PyTypeObject.tp_init` o :c:member:`~PyNumberMethods.nb_add`) y otros lugares donde la clase definidora de un método no puede ser pasada utilizando la convención de llamada :c:type:`PyCMethod`.

source: Attempt to assign a version tag to the given type.
es_es: Intenta asignar una etiqueta de versión al tipo dado.

source: Returns 1 if the type already had a valid version tag or a new one was assigned, or 0 if a new tag could not be assigned.
es_es: Devuelve 1 si el tipo ya tenía una etiqueta de versión válida o se asignó una nueva, o 0 si no se pudo asignar una nueva etiqueta.

source: Creating Heap-Allocated Types
es_es: Crear Tipos Asignados en el Montón

source: The following functions and structs are used to create :ref:`heap types <heap-types>`.
es_es: Las siguientes funciones y estructuras se utilizan para crear tipos :ref:`heap <heap-types>`.

source: Create and return a :ref:`heap type <heap-types>` from the *spec* (see :c:macro:`Py_TPFLAGS_HEAPTYPE`).
es_es: Crea y devuelve :ref:`heap type <heap-types>` a partir del *spec* (ver :c:macro:`Py_TPFLAGS_HEAPTYPE`).

source: The metaclass *metaclass* is used to construct the resulting type object. When *metaclass* is ``NULL``, the metaclass is derived from *bases* (or *Py_tp_base[s]* slots if *bases* is ``NULL``, see below).
es_es: La metaclase *metaclass* se utiliza para construir el objeto de tipo resultante. Cuando *metaclass* es ``NULL``, la metaclase se deriva de *bases* (o de *Py_tp_base[s]* slots si *bases* es ``NULL``, ver más abajo).

source: Metaclasses that override :c:member:`~PyTypeObject.tp_new` are not supported, except if ``tp_new`` is ``NULL``. (For backwards compatibility, other ``PyType_From*`` functions allow such metaclasses. They ignore ``tp_new``, which may result in incomplete initialization. This is deprecated and in Python 3.14+ such metaclasses will not be supported.)
es_es: Las metaclases que anulan :c:member:`~PyTypeObject.tp_new` no están soportadas, excepto si ``tp_new`` es ``NULL``. (Por compatibilidad con versiones anteriores, otras funciones ``PyType_From*`` permiten tales metaclases. Ignoran ``tp_new``, lo que puede resultar en una inicialización incompleta. Esto está obsoleto y en Python 3.14+ tales metaclases no serán soportadas).

source: The *bases* argument can be used to specify base classes; it can either be only one class or a tuple of classes. If *bases* is ``NULL``, the *Py_tp_bases* slot is used instead. If that also is ``NULL``, the *Py_tp_base* slot is used instead. If that also is ``NULL``, the new type derives from :class:`object`.
es_es: El argumento *bases* se puede usar para especificar clases base; puede ser una sola clase o una tupla de clases. Si *bases* es ``NULL``, se utiliza el espacio *Py_tp_bases*. Si también es ``NULL``, se utiliza *Py_tp_base*. Si también es ``NULL``, el nuevo tipo deriva de :class:`object`.

source: The *module* argument can be used to record the module in which the new class is defined. It must be a module object or ``NULL``. If not ``NULL``, the module is associated with the new type and can later be retrieved with :c:func:`PyType_GetModule`. The associated module is not inherited by subclasses; it must be specified for each class individually.
es_es: El argumento *module* puede utilizarse para registrar el módulo en el que se define la nueva clase. Debe ser un objeto de módulo o ``NULL``. Si no es ``NULL``, el módulo se asocia al nuevo tipo y puede recuperarse posteriormente con :c:func:`PyType_GetModule`. El módulo asociado no se hereda por las subclases; debe especificarse para cada clase individualmente.

source: This function calls :c:func:`PyType_Ready` on the new type.
es_es: Esta función llama a :c:func:`PyType_Ready` en el nuevo tipo.

source: Note that this function does *not* fully match the behavior of calling :py:class:`type() <type>` or using the :keyword:`class` statement. With user-provided base types or metaclasses, prefer :ref:`calling <capi-call>` :py:class:`type` (or the metaclass) over ``PyType_From*`` functions. Specifically:
es_es: Tenga en cuenta que esta función *no* coincide completamente con el comportamiento de llamar a :py:class:`type() <type>` o usar la sentencia :keyword:`class`. Con tipos base proporcionados por el usuario o metaclases, prefiera :ref:`calling <capi-call>` :py:class:`type` (o a la metaclase) antes que a las funciones ``PyType_From*``. Específicamente:

source: :py:meth:`~object.__new__` is not called on the new class (and it must be set to ``type.__new__``).
es_es: :py:meth:`~object.__new__` no se llama a la nueva clase (y debe establecerse en ``type.__new__``).

source: :py:meth:`~object.__init__` is not called on the new class.
es_es: :py:meth:`~object.__init__` no se llama a la nueva clase.

source: :py:meth:`~object.__init_subclass__` is not called on any bases.
es_es: :py:meth:`~object.__init_subclass__` no se convoca en ninguna base.

source: :py:meth:`~object.__set_name__` is not called on new descriptors.
es_es: :py:meth:`~object.__set_name__` no se invoca en los nuevos descriptores.

source: Equivalent to ``PyType_FromMetaclass(NULL, module, spec, bases)``.
es_es: Equivalente a ``PyType_FromMetaclass(NULL, module, spec, bases)``.

source: The function now accepts a single class as the *bases* argument and ``NULL`` as the ``tp_doc`` slot.
es_es: La función acepta ahora una única clase como argumento *bases* y ``NULL`` como ranura ``tp_doc``.

source: The function now finds and uses a metaclass corresponding to the provided base classes. Previously, only :class:`type` instances were returned.
es_es: La función ahora encuentra y utiliza una metaclase correspondiente a las clases base proporcionadas. Anteriormente, sólo se devolvían instancias de :class:`type`.

source: The :c:member:`~PyTypeObject.tp_new` of the metaclass is *ignored*. which may result in incomplete initialization. Creating classes whose metaclass overrides :c:member:`~PyTypeObject.tp_new` is deprecated and in Python 3.14+ it will be no longer allowed.
es_es: La :c:member:`~PyTypeObject.tp_new` de la metaclase es *ignored*. lo que puede resultar en una inicialización incompleta. Crear clases cuya metaclase ignore :c:member:`~PyTypeObject.tp_new` está obsoleto y en Python 3.14+ ya no estará permitido.

source: Equivalent to ``PyType_FromMetaclass(NULL, NULL, spec, bases)``.
es_es: Equivalente a ``PyType_FromMetaclass(NULL, NULL, spec, bases)``.

source: Equivalent to ``PyType_FromMetaclass(NULL, NULL, spec, NULL)``.
es_es: Equivalente a ``PyType_FromMetaclass(NULL, NULL, spec, NULL)``.

source: The function now finds and uses a metaclass corresponding to the base classes provided in *Py_tp_base[s]* slots. Previously, only :class:`type` instances were returned.
es_es: La función ahora encuentra y utiliza una metaclase correspondiente a las clases base proporcionadas en los slots *Py_tp_base[s]*. Anteriormente, sólo se devolvían instancias de :class:`type`.

source: Structure defining a type's behavior.
es_es: Estructura que define el comportamiento de un tipo.

source: Name of the type, used to set :c:member:`PyTypeObject.tp_name`.
es_es: Nombre del tipo, utilizado para establecer :c:member:`PyTypeObject.tp_name`.

source: If positive, specifies the size of the instance in bytes. It is used to set :c:member:`PyTypeObject.tp_basicsize`.
es_es: Si es positivo, especifica el tamaño de la instancia en bytes. Se utiliza para establecer :c:member:`PyTypeObject.tp_basicsize`.

source: If zero, specifies that :c:member:`~PyTypeObject.tp_basicsize` should be inherited.
es_es: Si es cero, especifica que :c:member:`~PyTypeObject.tp_basicsize` debe heredarse.

source: If negative, the absolute value specifies how much space instances of the class need *in addition* to the superclass. Use :c:func:`PyObject_GetTypeData` to get a pointer to subclass-specific memory reserved this way.
es_es: Si es negativo, el valor absoluto especifica cuánto espacio necesitan las instancias de la clase *además* de la superclase. Utilice :c:func:`PyObject_GetTypeData` para obtener un puntero a la memoria específica de la subclase reservada de esta forma.

source: Previously, this field could not be negative.
es_es: Antes, este campo no podía ser negativo.

source: Size of one element of a variable-size type, in bytes. Used to set :c:member:`PyTypeObject.tp_itemsize`. See ``tp_itemsize`` documentation for caveats.
es_es: Tamaño de un elemento de un tipo de tamaño variable, en bytes. Se utiliza para configurar :c:member:`PyTypeObject.tp_itemsize`. Consulte la documentación de ``tp_itemsize`` para conocer las advertencias.
