Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/unicode.po
Languages: es_es, ru

source: Write a character to a string. The string must have been created through :c:func:`PyUnicode_New`. Since Unicode strings are supposed to be immutable, the string must not be shared, or have been hashed yet.
es_es: Escriba un carácter en una cadena. La cadena se debe haber creado a través de :c:func:`PyUnicode_New`. Dado que se supone que las cadenas Unicode son inmutables, la cadena no debe ser compartida ni haber sido hasheada todavía.
ru: Запишите символ в строку. Строка должна быть создана с помощью :c:func:`PyUnicode_New`. Поскольку строки Юникода должны быть неизменяемыми, строка не должна быть общедоступной или еще не хеширована.

source: This function checks that *unicode* is a Unicode object, that the index is not out of bounds, and that the object can be modified safely (i.e. that it its reference count is one).
es_es: Esta función verifica que *unicode* sea un objeto Unicode, que el índice no esté fuera de límites y que el objeto se pueda modificar de forma segura (es decir, que su recuento de referencias sea uno).
ru: Эта функция проверяет, что *unicode* является объектом Unicode, что индекс не выходит за пределы и что объект можно безопасно изменить (т. е. что его счетчик ссылок равен единице).

source: Return ``0`` on success, ``-1`` on error with an exception set.
ru: Возвращает ``0`` в случае успеха, ``-1`` в случае ошибки с установленным исключением.

source: Read a character from a string. This function checks that *unicode* is a Unicode object and the index is not out of bounds, in contrast to :c:func:`PyUnicode_READ_CHAR`, which performs no error checking.
es_es: Lee un carácter de una cadena. Esta función comprueba que *unicode* es un objeto Unicode y que el índice no está fuera de los límites, a diferencia de :c:func:`PyUnicode_READ_CHAR`, que no realiza ninguna comprobación de errores.
ru: Считайте символ из строки. Эта функция проверяет, что *unicode* является объектом Unicode и индекс не выходит за пределы, в отличие от :c:func:`PyUnicode_READ_CHAR`, которая не выполняет проверку ошибок.

source: Return character on success, ``-1`` on error with an exception set.
ru: Возвращаемый символ в случае успеха, ``-1`` в случае ошибки с установленным исключением.

source: Return a substring of *unicode*, from character index *start* (included) to character index *end* (excluded). Negative indices are not supported. On error, set an exception and return ``NULL``.
ru: Возвращает подстроку *unicode* от индекса символов *start* (включено) до индекса символов *end* (исключено). Отрицательные индексы не поддерживаются. В случае ошибки установить исключение и вернуть ``NULL``.

source: Copy the string *unicode* into a UCS4 buffer, including a null character, if *copy_null* is set. Returns ``NULL`` and sets an exception on error (in particular, a :exc:`SystemError` if *buflen* is smaller than the length of *unicode*). *buffer* is returned on success.
es_es: Copia la cadena *unicode* en un búfer UCS4, incluyendo un carácter nulo, si *copy_null* está establecido. Devuelve ``NULL`` y lanza una excepción en caso de error (en particular, :exc:`SystemError` si *buflen* es menor que la longitud de *unicode*). *buffer* se devuelve en caso de éxito.
ru: Скопируйте строку *unicode* в буфер UCS4, включая нулевой символ, если установлено *copy_null*. Возвращает ``NULL`` и устанавливает исключение в случае ошибки (в частности, :exc:`SystemError`, если *buflen* меньше длины *unicode*). *buffer* возвращается в случае успеха.

source: Copy the string *unicode* into a new UCS4 buffer that is allocated using :c:func:`PyMem_Malloc`. If this fails, ``NULL`` is returned with a :exc:`MemoryError` set. The returned buffer always has an extra null code point appended.
es_es: Copia la cadena *unicode* en un nuevo búfer UCS4 que se asigna usando :c:func:`PyMem_Malloc`. Si esto falla, se devuelve ``NULL`` con :exc:`MemoryError`. El búfer devuelto siempre tiene un punto de código nulo extra añadido.
ru: Скопируйте строку *unicode* в новый буфер UCS4, выделенный с помощью :c:func:`PyMem_Malloc`. Если это не удается, возвращается ``NULL`` с установленным :exc:`MemoryError`. К возвращенному буферу всегда добавляется дополнительная нулевая кодовая точка.

source: Locale Encoding
es_es: Codificación local
ru: Кодировка языка

source: The current locale encoding can be used to decode text from the operating system.
es_es: La codificación local actual se puede utilizar para decodificar texto del sistema operativo.
ru: Текущую кодировку локали можно использовать для декодирования текста из операционной системы.

source: Decode a string from UTF-8 on Android and VxWorks, or from the current locale encoding on other platforms. The supported error handlers are ``"strict"`` and ``"surrogateescape"`` (:pep:`383`). The decoder uses ``"strict"`` error handler if *errors* is ``NULL``. *str* must end with a null character but cannot contain embedded null characters.
es_es: Decodifica una cadena desde UTF-8 en Android y VxWorks, o desde la codificación local actual en otras plataformas. Los manejadores de error soportados son ``"strict"`` y ``"surrogateescape"`` (:pep:`383`). El descodificador utiliza el gestor de errores ``"strict"`` si *errors* es ``NULL``. *str* debe terminar con un carácter nulo pero no puede contener caracteres nulos incrustados.
ru: Декодируйте строку из UTF-8 на Android и VxWorks или из текущей кодировки локали на других платформах. Поддерживаемые обработчики ошибок: ``"strict"`` и ``"surrogateescape"`` (:pep:`383`). Декодер использует ``строгий'` обработчик ошибок, если *errors* имеет значение ``NULL``. *str* должен заканчиваться нулевым символом, но не может содержать встроенные нулевые символы.

source: Use :c:func:`PyUnicode_DecodeFSDefaultAndSize` to decode a string from the :term:`filesystem encoding and error handler`.
es_es: Utilice :c:func:`PyUnicode_DecodeFSDefaultAndSize` para descodificar una cadena del :term:`filesystem encoding and error handler`.
ru: Используйте :c:func:`PyUnicode_DecodeFSDefaultAndSize` для декодирования строки из :term:`кодирования файловой системы и обработчика ошибок`.

source: This function ignores the :ref:`Python UTF-8 Mode <utf8-mode>`.
es_es: Esta función ignora el :ref:`Python UTF-8 Mode <utf8-mode>`.
ru: Эта функция игнорирует :ref:`Режим Python UTF-8 <utf8-mode>`.

source: The :c:func:`Py_DecodeLocale` function.
es_es: La función :c:func:`Py_DecodeLocale`.
ru: Функция :c:func:`Py_DecodeLocale`.

source: The function now also uses the current locale encoding for the ``surrogateescape`` error handler, except on Android. Previously, :c:func:`Py_DecodeLocale` was used for the ``surrogateescape``, and the current locale encoding was used for ``strict``.
es_es: La función ahora también utiliza la codificación de la configuración regional actual para el gestor de errores ``surrogateescape``, excepto en Android. Anteriormente, se utilizaba :c:func:`Py_DecodeLocale` para ``surrogateescape``, y la codificación regional actual para ``strict``.
ru: Функция теперь также использует текущую языковую кодировку для обработчика ошибок surrogateescape, за исключением Android. Ранее :c:func:`Py_DecodeLocale` использовался для ``surrogateescape``, а текущая кодировка локали использовалась для``strict``.

source: Similar to :c:func:`PyUnicode_DecodeLocaleAndSize`, but compute the string length using :c:func:`!strlen`.
es_es: Similar a :c:func:`PyUnicode_DecodeLocaleAndSize`, pero calcula la longitud de la cadena utilizando :c:func:`!strlen`.
ru: Аналогично :c:func:`PyUnicode_DecodeLocaleAndSize`, но длину строки вычислите, используя :c:func:`!strlen`.

source: Encode a Unicode object to UTF-8 on Android and VxWorks, or to the current locale encoding on other platforms. The supported error handlers are ``"strict"`` and ``"surrogateescape"`` (:pep:`383`). The encoder uses ``"strict"`` error handler if *errors* is ``NULL``. Return a :class:`bytes` object. *unicode* cannot contain embedded null characters.
es_es: Codifica un objeto Unicode a UTF-8 en Android y VxWorks, o a la codificación regional actual en otras plataformas. Los manejadores de error soportados son ``"strict"`` y ``"surrogateescape"`` (:pep:`383`). El codificador utiliza el gestor de errores ``"strict"`` si *errors* es ``NULL``. Devuelve un objeto :class:`bytes`. *unicode* no puede contener caracteres nulos incrustados.
ru: Закодируйте объект Unicode в UTF-8 на Android и VxWorks или в текущую языковую кодировку на других платформах. Поддерживаемые обработчики ошибок: ``"strict"`` и ``"surrogateescape"`` (:pep:`383`). Кодировщик использует ``строгий'` обработчик ошибок, если *errors* имеет значение ``NULL``. Верните объект :class:`bytes`. *unicode* не может содержать встроенные нулевые символы.

source: Use :c:func:`PyUnicode_EncodeFSDefault` to encode a string to the :term:`filesystem encoding and error handler`.
es_es: Utilice :c:func:`PyUnicode_EncodeFSDefault` para codificar una cadena según el :term:`filesystem encoding and error handler`.
ru: Используйте :c:func:`PyUnicode_EncodeFSDefault` для кодирования строки в :term:`кодирование файловой системы и обработчик ошибок`.

source: The :c:func:`Py_EncodeLocale` function.
es_es: La función :c:func:`Py_EncodeLocale`.
ru: Функция :c:func:`Py_EncodeLocale`.

source: The function now also uses the current locale encoding for the ``surrogateescape`` error handler, except on Android. Previously, :c:func:`Py_EncodeLocale` was used for the ``surrogateescape``, and the current locale encoding was used for ``strict``.
es_es: La función ahora también utiliza la codificación de la configuración regional actual para el gestor de errores ``surrogateescape``, excepto en Android. Anteriormente, se utilizaba :c:func:`Py_EncodeLocale` para ``surrogateescape``, y la codificación regional actual para ``strict``.
ru: Функция теперь также использует текущую языковую кодировку для обработчика ошибок surrogateescape, за исключением Android. Ранее :c:func:`Py_EncodeLocale` использовался для ``surrogateescape``, а текущая кодировка локали использовалась для``strict``.

source: File System Encoding
es_es: Sistema de codificación de archivos
ru: Кодировка файловой системы

source: Functions encoding to and decoding from the :term:`filesystem encoding and error handler` (:pep:`383` and :pep:`529`).
es_es: Funciones de codificación y descodificación del :term:`filesystem encoding and error handler` (:pep:`383` y :pep:`529`).
ru: Функции кодирования и декодирования из :term:`кодирования файловой системы и обработчика ошибок` (:pep:`383` и :pep:`529`).

source: :ref:`PyArg_Parse\* converter <arg-parsing>`: encode :class:`str` objects -- obtained directly or through the :class:`os.PathLike` interface -- to :class:`bytes` using :c:func:`PyUnicode_EncodeFSDefault`; :class:`bytes` objects are output as-is. *result* must be an address of a C variable of type :c:expr:`PyObject*` (or :c:expr:`PyBytesObject*`). On success, set the variable to a new :term:`strong reference` to a :ref:`bytes object <bytesobjects>` which must be released when it is no longer used and return a non-zero value (:c:macro:`Py_CLEANUP_SUPPORTED`). Embedded null bytes are not allowed in the result. On failure, return ``0`` with an exception set.
ru: : ref: `pyarg_parse \* converter <gard-parsing>`: encode: class: `str` objects-получено напрямую или через: класс:` os.pathlike` interface-to: class: `bytes` с использованием: C: Func: `pyunicode_encodefsdefault`; : class: `bytes 'объекты выводятся как есть. *Результат*Должен быть адрес с переменной C типа: C: expr: `pyobject*` (или: c: expr: `pybytesobject*`). При успехе установите переменную на новый термин: `‘ Сильная ссылка на: ref: `` object <bytesobjects> `, которые должны быть выпущены, когда она больше не используется, и вернуть ненулевое значение (: c: macro : `Py_cleanup_supported`). Встроенные нулевые байты не допускаются в результате. При сбое верните `` 0`` с набором исключений.

source: Accepts a :term:`path-like object`.
es_es: Acepta un ::term:`path-like object`.
ru: Принимает :term:`объект, похожий на путь`.

source: :ref:`PyArg_Parse\* converter <arg-parsing>`: decode :class:`bytes` objects -- obtained either directly or indirectly through the :class:`os.PathLike` interface -- to :class:`str` using :c:func:`PyUnicode_DecodeFSDefaultAndSize`; :class:`str` objects are output as-is. *result* must be an address of a C variable of type :c:expr:`PyObject*` (or :c:expr:`PyUnicodeObject*`). On success, set the variable to a new :term:`strong reference` to a :ref:`Unicode object <unicodeobjects>` which must be released when it is no longer used and return a non-zero value (:c:macro:`Py_CLEANUP_SUPPORTED`). Embedded null characters are not allowed in the result. On failure, return ``0`` with an exception set.
ru: : ref: `pyarg_parse \* converter <gard-parsing>`: decode: class: `bytes` объекты-получены прямо или косвенно через: класс:` os.pathlike` interface-to: class: `str` Использование: C: Func: `pyunicode_decodefsdefaultAndsize`; : class: `str`-объекты выводятся как есть. *Результат*Должен быть адрес с переменной C типа: C: expr: `pyobject*` (или: c: expr: `pyunicodeobject*`). При успехе установите переменную на новую: термин: `сильная ссылка на A: ref:` unicode Object <UnicodeObjects> `, которые должны быть опубликованы, когда оно больше не используется, и вернуть ненулевое значение (: c: macro : `Py_cleanup_supported`). Встроенные нулевые символы не допускаются в результате. При сбое верните `` 0`` с набором исключений.

source: Decode a string from the :term:`filesystem encoding and error handler`.
es_es: Decodifica una cadena a partir del :term:`filesystem encoding and error handler`.
ru: Декодируйте строку из :term:`кодировки файловой системы и обработчика ошибок`.

source: If you need to decode a string from the current locale encoding, use :c:func:`PyUnicode_DecodeLocaleAndSize`.
es_es: Si necesita descodificar una cadena a partir de la codificación regional actual, utilice :c:func:`PyUnicode_DecodeLocaleAndSize`.
ru: Если вам нужно декодировать строку из текущей кодировки локали, используйте :c:func:`PyUnicode_DecodeLocaleAndSize`.

source: The :term:`filesystem error handler <filesystem encoding and error handler>` is now used.
es_es: Ahora se utiliza :term:`filesystem error handler <filesystem encoding and error handler>`.
ru: Теперь используется :term:`обработчик ошибок файловой системы <кодировка файловой системы и обработчик ошибок>`.

source: Decode a null-terminated string from the :term:`filesystem encoding and error handler`.
es_es: Decodifica una cadena acabada en cero a partir del :term:`filesystem encoding and error handler`.
ru: Декодируйте строку с нулевым символом в конце из :term:`кодирования файловой системы и обработчика ошибок`.

source: If the string length is known, use :c:func:`PyUnicode_DecodeFSDefaultAndSize`.
es_es: Si se conoce la longitud de la cadena, utilice :c:func:`PyUnicode_DecodeFSDefaultAndSize`.
ru: Если длина строки известна, используйте :c:func:`PyUnicode_DecodeFSDefaultAndSize`.

source: Encode a Unicode object to the :term:`filesystem encoding and error handler`, and return :class:`bytes`. Note that the resulting :class:`bytes` object can contain null bytes.
es_es: Codifica un objeto Unicode según el :term:`filesystem encoding and error handler`, y devuelve :class:`bytes`. Tenga en cuenta que el objeto :class:`bytes` resultante puede contener bytes nulos.
ru: Закодируйте объект Unicode в :term:`кодирование файловой системы и обработчик ошибок` и верните :class:`bytes`. Обратите внимание, что результирующий объект :class:`bytes` может содержать нулевые байты.

source: If you need to encode a string to the current locale encoding, use :c:func:`PyUnicode_EncodeLocale`.
es_es: Si necesita codificar una cadena con la codificación regional actual, utilice :c:func:`PyUnicode_EncodeLocale`.
ru: Если вам нужно закодировать строку в кодировку текущей локали, используйте :c:func:`PyUnicode_EncodeLocale`.

source: wchar_t Support
ru: поддержка wchar_t

source: :c:type:`wchar_t` support for platforms which support it:
es_es: :c:type:`wchar_t` para las plataformas que lo admiten:
ru: :c:type:`wchar_t` поддержка платформ, которые его поддерживают:

source: Create a Unicode object from the :c:type:`wchar_t` buffer *wstr* of the given *size*. Passing ``-1`` as the *size* indicates that the function must itself compute the length, using :c:func:`!wcslen`. Return ``NULL`` on failure.
es_es: Crea un objeto Unicode a partir del búfer :c:type:`wchar_t` *wstr* del *size* dado. Pasar ``-1`` como *size* indica que la función debe calcular por sí misma la longitud, usando :c:func:`!wcslen`. Devuelve ``NULL`` en caso de fallo.
ru: Создайте объект Unicode из буфера :c:type:`wchar_t` *wstr* заданного *размера*. Передача ``-1`` в качестве *size* указывает, что функция должна сама вычислить длину, используя :c:func:`!wcslen`. Возвращайте ``NULL`` в случае неудачи.

source: Copy the Unicode object contents into the :c:type:`wchar_t` buffer *wstr*. At most *size* :c:type:`wchar_t` characters are copied (excluding a possibly trailing null termination character). Return the number of :c:type:`wchar_t` characters copied or ``-1`` in case of an error.
es_es: Copia el contenido del objeto Unicode en el búfer :c:type:`wchar_t` *wstr*. Se copian como máximo *size* :c:type:`wchar_t` caracteres (excluyendo un posible carácter de terminación nulo al final). Devuelve el número de caracteres :c:type:`wchar_t` copiados o ``-1`` en caso de error.
ru: Скопируйте содержимое объекта Unicode в буфер :c:type:`wchar_t` *wstr*. Копируется не более символов *size* :c:type:`wchar_t` (исключая, возможно, завершающий нулевой символ завершения). Возвращает количество скопированных символов :c:type:`wchar_t` или ``-1`` в случае ошибки.

source: When *wstr* is ``NULL``, instead return the *size* that would be required to store all of *unicode* including a terminating null.
es_es: Cuando *wstr* es ``NULL``, en su lugar devuelve el *size* que se necesitaría para almacenar todo *unicode* incluyendo un null de terminación.
ru: Если *wstr* имеет значение ``NULL``, вместо этого возвращайте *size*, который потребуется для хранения всего *unicode*, включая завершающий нуль.

source: Note that the resulting :c:expr:`wchar_t*` string may or may not be null-terminated. It is the responsibility of the caller to make sure that the :c:expr:`wchar_t*` string is null-terminated in case this is required by the application. Also, note that the :c:expr:`wchar_t*` string might contain null characters, which would cause the string to be truncated when used with most C functions.
es_es: Tenga en cuenta que la cadena :c:expr:`wchar_t*` resultante puede o no estar terminada en cero. Es responsabilidad de quien llama asegurarse de que la cadena :c:expr:`wchar_t*` está terminada en cero en caso de que así lo requiera la aplicación. Además, tenga en cuenta que la cadena :c:expr:`wchar_t*` puede contener caracteres nulos, lo que provocaría que la cadena se truncara al utilizarla con la mayoría de las funciones C.
ru: Обратите внимание, что результирующая строка :c:expr:`wchar_t*` может заканчиваться нулем, а может и не заканчиваться. Вызывающая сторона несет ответственность за то, чтобы строка :c:expr:`wchar_t*` завершалась нулем, если это требуется приложению. Также обратите внимание, что строка :c:expr:`wchar_t*` может содержать нулевые символы, что приведет к усечению строки при использовании с большинством функций C.

source: Convert the Unicode object to a wide character string. The output string always ends with a null character. If *size* is not ``NULL``, write the number of wide characters (excluding the trailing null termination character) into *\*size*. Note that the resulting :c:type:`wchar_t` string might contain null characters, which would cause the string to be truncated when used with most C functions. If *size* is ``NULL`` and the :c:expr:`wchar_t*` string contains null characters a :exc:`ValueError` is raised.
es_es: Convierte el objeto Unicode en una cadena de caracteres anchos. La cadena de salida siempre termina con un carácter nulo. Si *tamaño* no es ``NULL``, escriba el número de caracteres anchos (excluyendo el carácter nulo de terminación final) en *tamaño*. Tenga en cuenta que la cadena :c:type:`wchar_t` resultante puede contener caracteres nulos, lo que provocaría que la cadena se truncara al utilizarla con la mayoría de las funciones C. Si *tamaño* es ``NULL`` y la cadena :c:expr:`wchar_t*` contiene caracteres nulos, se produce un :exc:`ValueError`.
ru: Преобразуйте объект Unicode в строку широких символов. Выходная строка всегда заканчивается нулевым символом. Если *size* не равно ``NULL``, запишите количество широких символов (исключая завершающий нулевой символ завершения) в *\*size*. Обратите внимание, что результирующая строка :c:type:`wchar_t` может содержать нулевые символы, что приведет к усечению строки при использовании с большинством функций C. Если *size* имеет значение ``NULL`` и строка :c:expr:`wchar_t*` содержит нулевые символы, возникает :exc:`ValueError`.

source: Returns a buffer allocated by :c:macro:`PyMem_New` (use :c:func:`PyMem_Free` to free it) on success. On error, returns ``NULL`` and *\*size* is undefined. Raises a :exc:`MemoryError` if memory allocation is failed.
es_es: Devuelve un búfer asignado por :c:macro:`PyMem_New` (utilice :c:func:`PyMem_Free` para liberarlo) en caso de éxito. En caso de error, devuelve ``NULL`` y *\*size* es indefinido. Lanza un :exc:`MemoryError` si falla la asignación de memoria.
ru: Возвращает буфер, выделенный :c:macro:`PyMem_New` (используйте :c:func:`PyMem_Free`, чтобы освободить его) в случае успеха. В случае ошибки возвращается ``NULL`` и *\*size* не определен. Вызывает :exc:`MemoryError`, если выделение памяти не удалось.

source: Raises a :exc:`ValueError` if *size* is ``NULL`` and the :c:expr:`wchar_t*` string contains null characters.
es_es: Lanza un :exc:`ValueError` si *size* es ``NULL`` y la cadena :c:expr:`wchar_t*` contiene caracteres nulos.
ru: Вызывает ошибку :exc:`ValueError`, если *size* имеет значение ``NULL`` и строка :c:expr:`wchar_t*` содержит нулевые символы.

source: Built-in Codecs
es_es: Codecs integrados
ru: Встроенные кодеки

source: Python provides a set of built-in codecs which are written in C for speed. All of these codecs are directly usable via the following functions.
es_es: Python proporciona un conjunto de códecs integrados que están escritos en C para mayor velocidad. Todos estos códecs son directamente utilizables a través de las siguientes funciones.
ru: Python предоставляет набор встроенных кодеков, которые для скорости написаны на C. Все эти кодеки можно использовать напрямую с помощью следующих функций.

source: Many of the following APIs take two arguments encoding and errors, and they have the same semantics as the ones of the built-in :func:`str` string object constructor.
es_es: Muchas de las siguientes APIs toman dos argumentos encoding y errors, y tienen la misma semántica que las del constructor de objetos de cadena :func:`str` incorporado.
ru: Многие из следующих API принимают два аргумента: кодирование и ошибки, и они имеют ту же семантику, что и встроенный конструктор строковых объектов :func:`str`.
