Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/unicode.po
Languages: es_es, ru

source: Unicode Objects and Codecs
es_es: Objetos Unicode y Codecs
ru: Объекты и кодеки Unicode

source: Unicode Objects
es_es: Objetos Unicode
ru: Объекты Юникода

source: Since the implementation of :pep:`393` in Python 3.3, Unicode objects internally use a variety of representations, in order to allow handling the complete range of Unicode characters while staying memory efficient. There are special cases for strings where all code points are below 128, 256, or 65536; otherwise, code points must be below 1114112 (which is the full Unicode range).
es_es: Desde la implementación de :pep:`393` en Python 3.3, los objetos Unicode utilizan internamente una variedad de representaciones para permitir el manejo de la gama completa de caracteres Unicode mientras se mantiene la eficiencia de memoria. Hay casos especiales para cadenas donde todos los puntos de código están por debajo de 128, 256 o 65536; de lo contrario, los puntos de código deben estar por debajo de 1114112 (que es el rango completo de Unicode).
ru: С момента реализации :pep:`393` в Python 3.3 объекты Unicode внутренне используют различные представления, чтобы обеспечить возможность обработки полного диапазона символов Unicode, сохраняя при этом эффективность использования памяти. Существуют особые случаи для строк, в которых все кодовые точки находятся ниже 128, 256 или 65536; в противном случае кодовые точки должны быть ниже 1114112 (полный диапазон Юникода).

source: UTF-8 representation is created on demand and cached in the Unicode object.
es_es: La representación UTF-8 se crea bajo demanda y se almacena en caché en el objeto Unicode.
ru: Представление UTF-8 создается по требованию и кэшируется в объекте Unicode.

source: The :c:type:`Py_UNICODE` representation has been removed since Python 3.12 with deprecated APIs. See :pep:`623` for more information.
es_es: La representación :c:type:`Py_UNICODE` ha sido eliminada desde Python 3.12 con APIs obsoletas. Consulte :pep:`623` para obtener más información.
ru: Представление :c:type:`Py_UNICODE` было удалено начиная с версии Python 3.12 с устаревшими API. См. :pep:`623` для получения дополнительной информации.

source: Unicode Type
es_es: Tipo Unicode
ru: Тип Юникода

source: These are the basic Unicode object types used for the Unicode implementation in Python:
es_es: Estos son los tipos básicos de objetos Unicode utilizados para la implementación de Unicode en Python.
ru: Это основные типы объектов Unicode, используемые для реализации Unicode в Python:

source: These types are typedefs for unsigned integer types wide enough to contain characters of 32 bits, 16 bits and 8 bits, respectively. When dealing with single Unicode characters, use :c:type:`Py_UCS4`.
es_es: Estos tipos son typedefs para tipos de enteros sin signo lo suficientemente amplios para contener caracteres de 32 bits, 16 bits y 8 bits, respectivamente. Al tratar con caracteres Unicode individuales, utiliza :c:type:`Py_UCS4`.
ru: Эти типы являются определениями типов для беззнаковых целочисленных типов, достаточно широких, чтобы содержать символы длиной 32, 16 и 8 бит соответственно. При работе с отдельными символами Юникода используйте :c:type:`Py_UCS4`.

source: This is a typedef of :c:type:`wchar_t`, which is a 16-bit type or 32-bit type depending on the platform.
es_es: Se trata de un typedef de :c:type:`wchar_t`, que es un tipo de 16 bits o de 32 bits dependiendo de la plataforma.
ru: Это определение типа :c:type:`wchar_t`, который является 16-битным или 32-битным типом в зависимости от платформы.

source: In previous versions, this was a 16-bit type or a 32-bit type depending on whether you selected a "narrow" or "wide" Unicode version of Python at build time.
es_es: En versiones anteriores, esto era un tipo de 16 bits o un tipo de 32 bits dependiendo de si seleccionaste una versión de Python "narrow" o "wide" de Unicode en el momento de la compilación.
ru: В предыдущих версиях это был 16-битный или 32-битный тип в зависимости от того, выбрали ли вы «узкую» или «широкую» версию Unicode Python во время сборки.

source: These subtypes of :c:type:`PyObject` represent a Python Unicode object. In almost all cases, they shouldn't be used directly, since all API functions that deal with Unicode objects take and return :c:type:`PyObject` pointers.
es_es: Estos subtipos de :c:type:`PyObject` representan un objeto Unicode de Python. En casi todos los casos, no se deberían utilizar directamente, ya que todas las funciones de la API que trabajan con objetos Unicode toman y devuelven punteros :c:type:`PyObject`.
ru: Эти подтипы :c:type:`PyObject` представляют собой объект Unicode Python. Почти во всех случаях их не следует использовать напрямую, поскольку все функции API, работающие с объектами Unicode, принимают и возвращают указатели :c:type:`PyObject`.

source: This instance of :c:type:`PyTypeObject` represents the Python Unicode type. It is exposed to Python code as ``str``.
es_es: Esta instancia de :c:type:`PyTypeObject` representa el tipo Unicode de Python. Se expone al código de Python como ``str``.
ru: Этот экземпляр :c:type:`PyTypeObject` представляет тип Unicode Python. Он отображается в коде Python как ``str``.

source: The following APIs are C macros and static inlined functions for fast checks and access to internal read-only data of Unicode objects:
es_es: Las siguientes API son macros de C y funciones estáticas incorporadas para realizar comprobaciones rápidas y acceder a los datos internos de sólo lectura de los objetos Unicode:
ru: Следующие API представляют собой макросы C и статические встроенные функции для быстрых проверок и доступа к внутренним данным объектов Unicode, доступным только для чтения:

source: Return true if the object *obj* is a Unicode object or an instance of a Unicode subtype. This function always succeeds.
es_es: Devuelve true si el objeto *obj* es un objeto Unicode o una instancia de un subtipo Unicode. Esta función siempre tiene éxito.
ru: Возвращайте true, если объект *obj* является объектом Юникода или экземпляром подтипа Юникода. Эта функция всегда завершается успешно.

source: Return true if the object *obj* is a Unicode object, but not an instance of a subtype. This function always succeeds.
es_es: Devuelve true si el objeto *obj* es un objeto Unicode, pero no una instancia de un subtipo. Esta función siempre tiene éxito.
ru: Возвращайте true, если объект *obj* является объектом Юникода, но не экземпляром подтипа. Эта функция всегда завершается успешно.

source: Returns ``0``. This API is kept only for backward compatibility.
es_es: Devuelve ``0``. Esta API se mantiene sólo por compatibilidad con versiones anteriores.
ru: Возвращает ``0``. Этот API сохранен только для обратной совместимости.

source: This API does nothing since Python 3.12.
es_es: Esta API no hace nada desde Python 3.12.
ru: Этот API ничего не делает, начиная с Python 3.12.

source: Return the length of the Unicode string, in code points. *unicode* has to be a Unicode object in the "canonical" representation (not checked).
es_es: Devuelve la longitud de la cadena Unicode, en puntos de código. *unicode* tiene que ser un objeto Unicode en la representación "canónica" (no comprobada).
ru: Возвращает длину строки Юникода в кодовых точках. *unicode* должен быть объектом Unicode в «каноническом» представлении (не отмечено).

source: Return a pointer to the canonical representation cast to UCS1, UCS2 or UCS4 integer types for direct character access. No checks are performed if the canonical representation has the correct character size; use :c:func:`PyUnicode_KIND` to select the right function.
es_es: Devuelve un puntero a la representación canónica convertida a tipos enteros UCS1, UCS2 o UCS4 para el acceso directo a caracteres. No se realiza ninguna comprobación si la representación canónica tiene el tamaño de carácter correcto; utilice :c:func:`PyUnicode_KIND` para seleccionar la función adecuada.
ru: Возвращает указатель на каноническое представление, приведенное к целочисленным типам UCS1, UCS2 или UCS4 для прямого доступа к символам. Никакие проверки не выполняются, если каноническое представление имеет правильный размер символов; используйте :c:func:`PyUnicode_KIND`, чтобы выбрать правильную функцию.

source: Return values of the :c:func:`PyUnicode_KIND` macro.
es_es: Valores de retorno de la macro :c:func:`PyUnicode_KIND`.
ru: Возвращаемые значения макроса :c:func:`PyUnicode_KIND`.

source: ``PyUnicode_WCHAR_KIND`` has been removed.
es_es: ``PyUnicode_WCHAR_KIND`` se ha eliminado.
ru: ``PyUnicode_WCHAR_KIND`` был удален.

source: Return one of the PyUnicode kind constants (see above) that indicate how many bytes per character this Unicode object uses to store its data. *unicode* has to be a Unicode object in the "canonical" representation (not checked).
es_es: Devuelve una de las constantes de tipo PyUnicode (ver arriba) que indican cuántos bytes por carácter utiliza este objeto Unicode para almacenar sus datos. *unicode* tiene que ser un objeto Unicode en la representación "canónica" (no comprobada).
ru: Возвращает одну из констант типа PyUnicode (см. выше), которая указывает, сколько байтов на символ этот объект Unicode использует для хранения своих данных. *unicode* должен быть объектом Unicode в «каноническом» представлении (не отмечено).

source: Return a void pointer to the raw Unicode buffer. *unicode* has to be a Unicode object in the "canonical" representation (not checked).
es_es: Devuelve un puntero void al búfer Unicode sin procesar. *unicode* tiene que ser un objeto Unicode en la representación "canónica" (no comprobada).
ru: Верните указатель void в необработанный буфер Юникода. *unicode* должен быть объектом Unicode в «каноническом» представлении (не отмечено).

source: Write into a canonical representation *data* (as obtained with :c:func:`PyUnicode_DATA`). This function performs no sanity checks, and is intended for usage in loops. The caller should cache the *kind* value and *data* pointer as obtained from other calls. *index* is the index in the string (starts at 0) and *value* is the new code point value which should be written to that location.
es_es: Escribe en una representación canónica *data* (tal como se obtiene con :c:func:`PyUnicode_DATA`). Esta función no realiza comprobaciones sensatas, y está pensada para su uso en bucles. La persona que llama debe almacenar en caché el valor *kind* y el puntero *data* obtenidos de otras llamadas. *index* es el índice en la cadena (comienza en 0) y *value* es el nuevo valor de punto de código que debería escribirse en esa ubicación.
ru: Запишите в каноническое представление *data* (полученное с помощью :c:func:`PyUnicode_DATA`). Эта функция не выполняет никаких проверок работоспособности и предназначена для использования в циклах. Вызывающий должен кэшировать значение *kind* и указатель *data*, полученные из других вызовов. *index* — это индекс в строке (начинается с 0), а *value* — это новое значение кодовой точки, которое должно быть записано в это место.

source: Read a code point from a canonical representation *data* (as obtained with :c:func:`PyUnicode_DATA`). No checks or ready calls are performed.
es_es: Lea un punto de código desde una representación canónica *data* (como se obtiene con :c:func:`PyUnicode_DATA`). No se realizan comprobaciones ni llamadas listas.
ru: Считайте кодовую точку из канонического представления *data* (полученного с помощью :c:func:`PyUnicode_DATA`). Никакие проверки или готовые вызовы не выполняются.

source: Read a character from a Unicode object *unicode*, which must be in the "canonical" representation. This is less efficient than :c:func:`PyUnicode_READ` if you do multiple consecutive reads.
es_es: Lee un carácter de un objeto Unicode *unicode*, que debe estar en la representación "canónica". Esto es menos eficiente que :c:func:`PyUnicode_READ` si se realizan varias lecturas consecutivas.
ru: Считайте символ из объекта Юникода *unicode*, который должен находиться в «каноническом» представлении. Это менее эффективно, чем :c:func:`PyUnicode_READ`, если вы выполняете несколько последовательных чтений.

source: Return the maximum code point that is suitable for creating another string based on *unicode*, which must be in the "canonical" representation. This is always an approximation but more efficient than iterating over the string.
es_es: Devuelve el punto de código máximo que es adecuado para crear otra cadena basada en *unicode*, que debe estar en la representación "canónica". Esto es siempre una aproximación pero más eficiente que iterar sobre la cadena.
ru: Возвращает максимальную кодовую точку, подходящую для создания другой строки на основе *unicode*, которая должна быть в «каноническом» представлении. Это всегда приближение, но более эффективное, чем перебор строки.

source: Return ``1`` if the string is a valid identifier according to the language definition, section :ref:`identifiers`. Return ``0`` otherwise.
es_es: Devuelve ``1`` si la cadena es un identificador válido según la definición del lenguaje, sección :ref:`identifiers`. Devuelve ``0`` en caso contrario.
ru: Возвращайте ``1``, если строка является допустимым идентификатором в соответствии с определением языка, раздел :ref:`identifiers`. В противном случае верните ``0``.

source: The function does not call :c:func:`Py_FatalError` anymore if the string is not ready.
es_es: La función ya no llama a :c:func:`Py_FatalError` si la cadena no está lista.
ru: Функция больше не вызывает :c:func:`Py_FatalError`, если строка не готова.

source: Unicode Character Properties
es_es: Propiedades de los caracteres Unicode
ru: Свойства символов Юникода

source: Unicode provides many different character properties. The most often needed ones are available through these macros which are mapped to C functions depending on the Python configuration.
es_es: Unicode proporciona muchas propiedades de caracteres diferentes. Los más necesarios están disponibles a través de estas macros que se asignan a funciones C dependiendo de la configuración de Python.
ru: Юникод предоставляет множество различных свойств символов. Наиболее часто необходимые из них доступны через эти макросы, которые отображаются в функции C в зависимости от конфигурации Python.

source: Return ``1`` or ``0`` depending on whether *ch* is a whitespace character.
es_es: Devuelve ``1`` o ``0`` dependiendo de si *ch* es un carácter de espacio en blanco.
ru: Возвращает ``1`` или ``0`` в зависимости от того, является ли *ch* пробельным символом.

source: Return ``1`` or ``0`` depending on whether *ch* is a lowercase character.
es_es: Devuelve ``1`` o ``0`` dependiendo de si *ch* es un carácter en minúscula.
ru: Возвращает ``1`` или ``0`` в зависимости от того, является ли *ch* символом нижнего регистра.

source: Return ``1`` or ``0`` depending on whether *ch* is an uppercase character.
es_es: Devuelve ``1`` o ``0`` dependiendo de si *ch* es un carácter en mayúscula.
ru: Возвращает ``1`` или ``0`` в зависимости от того, является ли *ch* символом верхнего регистра.

source: Return ``1`` or ``0`` depending on whether *ch* is a titlecase character.
es_es: Devuelve ``1`` o ``0`` dependiendo de si *ch* es un carácter en mayúscula inicial.
ru: Возвращает ``1`` или ``0`` в зависимости от того, является ли *ch* символом регистра заголовка.

source: Return ``1`` or ``0`` depending on whether *ch* is a linebreak character.
es_es: Devuelve ``1`` o ``0`` dependiendo de si *ch* es un carácter de salto de línea.
ru: Возвращает ``1`` или ``0`` в зависимости от того, является ли *ch* символом разрыва строки.

source: Return ``1`` or ``0`` depending on whether *ch* is a decimal character.
es_es: Devuelve ``1`` o ``0`` dependiendo de si *ch* es un carácter decimal.
ru: Возвращает ``1`` или ``0`` в зависимости от того, является ли *ch* десятичным символом.

source: Return ``1`` or ``0`` depending on whether *ch* is a digit character.
es_es: Devuelve ``1`` o ``0`` dependiendo de si *ch* es un carácter numérico.
ru: Возвращает ``1`` или ``0`` в зависимости от того, является ли *ch* цифровым символом.

source: Return ``1`` or ``0`` depending on whether *ch* is a numeric character.
es_es: Devuelve ``1`` o ``0`` dependiendo de si *ch* es un carácter numérico.
ru: Возвращает ``1`` или ``0`` в зависимости от того, является ли *ch* числовым символом.

source: Return ``1`` or ``0`` depending on whether *ch* is an alphabetic character.
es_es: Devuelve ``1`` o ``0`` dependiendo de si *ch* es un carácter alfabético.
ru: Возвращает ``1`` или ``0`` в зависимости от того, является ли *ch* буквенным символом.

source: Return ``1`` or ``0`` depending on whether *ch* is an alphanumeric character.
es_es: Devuelve ``1`` o ``0`` dependiendo de si *ch* es un carácter alfanumérico.
ru: Возвращает ``1`` или ``0`` в зависимости от того, является ли *ch* буквенно-цифровым символом.

source: Return ``1`` or ``0`` depending on whether *ch* is a printable character. Nonprintable characters are those characters defined in the Unicode character database as "Other" or "Separator", excepting the ASCII space (0x20) which is considered printable. (Note that printable characters in this context are those which should not be escaped when :func:`repr` is invoked on a string. It has no bearing on the handling of strings written to :data:`sys.stdout` or :data:`sys.stderr`.)
es_es: Devuelve ``1`` o ``0`` dependiendo de si *ch* es un carácter imprimible. Los caracteres no imprimibles son aquellos caracteres definidos en la base de datos de caracteres Unicode como "Otros" o "Separadores", excepto el espacio ASCII (0x20) que se considera imprimible. (Tener en cuenta que los caracteres imprimibles en este contexto son aquellos que no deben escaparse cuando se invoca la función :func:`repr` en una cadena. No tiene ninguna influencia en el manejo de las cadenas escritas en :data:`sys.stdout` o :data:`sys.stderr`.)
ru: Возвращает ``1`` или ``0`` в зависимости от того, является ли *ch* печатным символом. Непечатаемые символы — это символы, определенные в базе данных символов Юникода как «Другие» или «Разделители», за исключением пробела ASCII (0x20), который считается печатаемым. (Обратите внимание, что в этом контексте печатаемые символы — это те символы, которые не следует экранировать при вызове :func:`repr` для строки. Это не имеет никакого отношения к обработке строк, записанных в :data:`sys.stdout` или :data. :`sys.stderr`.)

source: These APIs can be used for fast direct character conversions:
es_es: Estas APIs se pueden utilizar para conversiones de caracteres directas y rápidas.
ru: Эти API можно использовать для быстрого прямого преобразования символов:

source: Return the character *ch* converted to lower case.
es_es: Devuelve el carácter *ch* convertido a minúscula.
ru: Возвращает символ *ch*, преобразованный в нижний регистр.

source: Return the character *ch* converted to upper case.
es_es: Devuelve el carácter *ch* convertido a mayúsculas.
ru: Возвращает символ *ch*, преобразованный в верхний регистр.

source: Return the character *ch* converted to title case.
es_es: Devuelve el carácter *ch* convertido a título.
ru: Возвращает символ *ch*, преобразованный в регистр заголовка.

source: Return the character *ch* converted to a decimal positive integer. Return ``-1`` if this is not possible. This function does not raise exceptions.
es_es: Devuelve el carácter *ch* convertido a un entero decimal positivo. Devuelve ``-1`` si no es posible. Esta función no genera excepciones.
ru: Возвращает символ *ch*, преобразованный в десятичное положительное целое число. Верните ``-1``, если это невозможно. Эта функция не вызывает исключений.

source: Return the character *ch* converted to a single digit integer. Return ``-1`` if this is not possible. This function does not raise exceptions.
es_es: Devuelve el carácter *ch* convertido a un entero de un solo dígito. Devuelve ``-1`` si no es posible. Esta función no genera excepciones.
ru: Возвращает символ *ch*, преобразованный в однозначное целое число. Верните ``-1``, если это невозможно. Эта функция не вызывает исключений.

source: Return the character *ch* converted to a double. Return ``-1.0`` if this is not possible. This function does not raise exceptions.
es_es: Devuelve el carácter *ch* convertido a doble. Devuelve ``-1.0`` si no es posible. Esta función no genera excepciones.
ru: Возвращает символ *ch*, преобразованный в двойной. Верните ``-1.0``, если это невозможно. Эта функция не вызывает исключений.

source: These APIs can be used to work with surrogates:
es_es: Estas APIs se pueden utilizar para trabajar con sustitutos.
ru: Эти API можно использовать для работы с суррогатами:

source: Check if *ch* is a surrogate (``0xD800 <= ch <= 0xDFFF``).
es_es: Comprueba si *ch* es un sustituto (``0xD800 <= ch <= 0xDFFF``).
ru: Проверьте, является ли *ch* суррогатом (``0xD800 <= ch <= 0xDFFF``).

source: Check if *ch* is a high surrogate (``0xD800 <= ch <= 0xDBFF``).
es_es: Comprueba si *ch* es un alto sustituto (``0xD800 <= ch <= 0xDBFF``).
ru: Проверьте, является ли *ch* старшим суррогатом (``0xD800 <= ch <= 0xDBFF``).

source: Check if *ch* is a low surrogate (``0xDC00 <= ch <= 0xDFFF``).
es_es: Comprueba si *ch* es un sustituto bajo (``0xDC00 <= ch <= 0xDFFF``).
ru: Проверьте, является ли *ch* младшим суррогатом (``0xDC00 <= ch <= 0xDFFF``).

source: Join two surrogate code points and return a single :c:type:`Py_UCS4` value. *high* and *low* are respectively the leading and trailing surrogates in a surrogate pair. *high* must be in the range [0xD800; 0xDBFF] and *low* must be in the range [0xDC00; 0xDFFF].
ru: Объедините две суррогатные точки кода и верните одно значение :c:type:`Py_UCS4`. *high* и *low* являются ведущими и конечными заместителями в суррогатной паре соответственно. *high* должен находиться в диапазоне [0xD800; 0xDBFF] и *low* должны находиться в диапазоне [0xDC00; 0xDFFF].

source: Creating and accessing Unicode strings
es_es: Crear y acceder a cadenas Unicode
ru: Создание строк Юникода и доступ к ним

source: To create Unicode objects and access their basic sequence properties, use these APIs:
es_es: Para crear objetos Unicode y acceder a sus propiedades básicas de secuencia, utiliza estas APIs:
ru: Чтобы создавать объекты Unicode и получать доступ к их основным свойствам последовательности, используйте следующие API:

source: Create a new Unicode object. *maxchar* should be the true maximum code point to be placed in the string. As an approximation, it can be rounded up to the nearest value in the sequence 127, 255, 65535, 1114111.
es_es: Crear un nuevo objeto Unicode. *maxchar* debería ser el verdadero punto de código máximo que se colocará en la cadena. Como aproximación, se puede redondear al valor más cercano en la secuencia 127, 255, 65535, 1114111.
ru: Создайте новый объект Unicode. *maxchar* должен быть истинной максимальной кодовой точкой, помещаемой в строку. В качестве приближения его можно округлить до ближайшего значения в последовательности 127, 255, 65535, 1114111.

source: This is the recommended way to allocate a new Unicode object. Objects created using this function are not resizable.
es_es: Esta es la forma recomendada de asignar un nuevo objeto Unicode. Los objetos creados usando esta función no son redimensionables.
ru: Это рекомендуемый способ выделения нового объекта Юникода. Объекты, созданные с помощью этой функции, не подлежат изменению размера.

source: On error, set an exception and return ``NULL``.
es_es: En caso de error, lanza una excepción y devuelve ``NULL``.
ru: При ошибке установите исключение и верните ``NULL``.
