Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/unicode.po
Languages: es_es, ru

source: Create a new Unicode object with the given *kind* (possible values are :c:macro:`PyUnicode_1BYTE_KIND` etc., as returned by :c:func:`PyUnicode_KIND`). The *buffer* must point to an array of *size* units of 1, 2 or 4 bytes per character, as given by the kind.
es_es: Crear un nuevo objeto Unicode con el *kind* dado (los valores posibles son :c:macro:`PyUnicode_1BYTE_KIND`, etc., como se devuelve por :c:func:`PyUnicode_KIND`). El *buffer* debe apuntar a un array de *size* unidades de 1, 2 o 4 bytes por carácter, según el *kind* dado.
ru: Создайте новый объект Unicode с заданным *видом* (возможные значения: :c:macro:`PyUnicode_1BYTE_KIND` и т. д., возвращаемые :c:func:`PyUnicode_KIND`). *буфер* должен указывать на массив единиц *размера* по 1, 2 или 4 байта на символ, в зависимости от типа.

source: If necessary, the input *buffer* is copied and transformed into the canonical representation. For example, if the *buffer* is a UCS4 string (:c:macro:`PyUnicode_4BYTE_KIND`) and it consists only of codepoints in the UCS1 range, it will be transformed into UCS1 (:c:macro:`PyUnicode_1BYTE_KIND`).
es_es: Si es necesario, el *buffer* de entrada se copia y se transforma en la representación canónica. Por ejemplo, si el *buffer* es una cadena UCS4 (:c:macro:`PyUnicode_4BYTE_KIND`) y consta sólo de codepuntos en el rango UCS1, se transformará en UCS1 (:c:macro:`PyUnicode_1BYTE_KIND`).
ru: При необходимости входной *буфер* копируется и преобразуется в каноническое представление. Например, если *buffer* представляет собой строку UCS4 (:c:macro:`PyUnicode_4BYTE_KIND`) и состоит только из кодовых точек в диапазоне UCS1, он будет преобразован в UCS1 (:c:macro:`PyUnicode_1BYTE_KIND`).

source: Create a Unicode object from the char buffer *str*. The bytes will be interpreted as being UTF-8 encoded. The buffer is copied into the new object. The return value might be a shared object, i.e. modification of the data is not allowed.
es_es: Crea un objeto Unicode a partir del búfer char *str*. Los bytes se interpretarán como codificados en UTF-8. El búfer se copia en el nuevo objeto. El valor devuelto puede ser un objeto compartido, es decir, no se permite la modificación de los datos.
ru: Создайте объект Unicode из буфера символов *str*. Байты будут интерпретироваться как кодированные UTF-8. Буфер копируется в новый объект. Возвращаемое значение может быть общим объектом, т. е. изменение данных не допускается.

source: This function raises :exc:`SystemError` when:
es_es: Esta función plantea :exc:`SystemError` cuando:
ru: Эта функция вызывает :exc:`SystemError`, когда:

source: *str* is ``NULL`` and *size* > 0
es_es: *str* es ``NULL`` y *size* > 0
ru: *str* равно ``NULL`` и *size* > 0

source: *str* == ``NULL`` with *size* > 0 is not allowed anymore.
es_es: *str* == ``NULL`` con *size* > 0 ya no está permitido.
ru: *str* == ``NULL`` с *size* > 0 больше не допускается.

source: Create a Unicode object from a UTF-8 encoded null-terminated char buffer *str*.
es_es: Crea un objeto Unicode a partir de un búfer de caracteres de terminación nula codificados en UTF-8 *str*.
ru: Создайте объект Unicode из буфера символов с нулевым завершением в кодировке UTF-8 *str*.

source: Take a C :c:func:`printf`\ -style *format* string and a variable number of arguments, calculate the size of the resulting Python Unicode string and return a string with the values formatted into it. The variable arguments must be C types and must correspond exactly to the format characters in the *format* ASCII-encoded string.
es_es: Toma una cadena C :c:func:`printf`\ -style *format* y un número variable de argumentos, calcula el tamaño de la cadena Python Unicode resultante y devuelve una cadena con los valores formateados en ella. Los argumentos variables deben ser de tipo C y deben corresponder exactamente a los caracteres de formato de la cadena *format* codificada en ASCII.
ru: Возьмите строку C :c:func:`printf`\ -style *format* и переменное количество аргументов, вычислите размер результирующей строки Python Unicode и верните строку со отформатированными в ней значениями. Переменные аргументы должны быть типами C и должны точно соответствовать символам формата в строке *format* в кодировке ASCII.

source: A conversion specifier contains two or more characters and has the following components, which must occur in this order:
es_es: Un especificador de conversión contiene dos o más caracteres y tiene los siguientes componentes, que deben aparecer en este orden:
ru: Спецификатор преобразования содержит два или более символов и включает следующие компоненты, которые должны встречаться в следующем порядке:

source: The ``'%'`` character, which marks the start of the specifier.
es_es: El carácter ``'%'``, que marca el inicio del especificador.
ru: The ``'%'`` символ, который отмечает начало спецификатора.

source: Conversion flags (optional), which affect the result of some conversion types.
es_es: Indicadores de conversión (opcionales), que afectan al resultado de algunos tipos de conversión.
ru: Флаги преобразования (необязательно), которые влияют на результат некоторых типов преобразования.

source: Minimum field width (optional). If specified as an ``'*'`` (asterisk), the actual width is given in the next argument, which must be of type :c:expr:`int`, and the object to convert comes after the minimum field width and optional precision.
es_es: Anchura mínima del campo (opcional). Si se especifica como ``'*'`` (asterisco), la anchura real se da en el siguiente argumento, que debe ser del tipo :c:expr:`int`, y el objeto a convertir viene después de la anchura mínima de campo y la precisión opcional.
ru: Минимальная ширина поля (необязательно). Если указано как ``'*'`` (звездочка), фактическая ширина указывается в следующем аргументе, который должен иметь тип :c:expr:`int`, а преобразуемый объект располагается после минимальной ширины поля. и дополнительная точность.

source: Precision (optional), given as a ``'.'`` (dot) followed by the precision. If specified as ``'*'`` (an asterisk), the actual precision is given in the next argument, which must be of type :c:expr:`int`, and the value to convert comes after the precision.
es_es: Precisión (opcional), dada como ``'.'`` (punto) seguido de la precisión. Si se especifica como ``'*'`` (un asterisco), la precisión real se da en el siguiente argumento, que debe ser del tipo :c:expr:`int`, y el valor a convertir viene después de la precisión.
ru: Точность (необязательно), указывается как ``'.'`` (точка), за которой следует точность. Если указано как ``'*'`` (звездочка), фактическая точность указывается в следующем аргументе, который должен иметь тип :c:expr:`int`, а преобразуемое значение идет после точности.

source: Length modifier (optional).
es_es: Modificador de longitud (opcional).
ru: Модификатор длины (необязательно).

source: Conversion type.
es_es: Tipo de conversión.
ru: Тип приведения.

source: The conversion flag characters are:
es_es: Los caracteres de la bandera de conversión son:
ru: Символы флага преобразования:

source: Flag
es_es: Bandera
ru: Флаг

source: Meaning
es_es: Significado
ru: Значение

source: The conversion will be zero padded for numeric values.
es_es: La conversión tendrá un relleno cero para los valores numéricos.
ru: Преобразование будет дополнено нулями для числовых значений.

source: The converted value is left adjusted (overrides the ``0`` flag if both are given).
es_es: El valor convertido se deja ajustado (anula la bandera ``0`` si se dan ambas).
ru: Преобразованное значение остается скорректированным (переопределяет флаг ``0``, если заданы оба).

source: The length modifiers for following integer conversions (``d``, ``i``, ``o``, ``u``, ``x``, or ``X``) specify the type of the argument (:c:expr:`int` by default):
es_es: Los modificadores de longitud para las siguientes conversiones de enteros (``d``, ``i``, ``o``, ``u``, ``x``, o ``X``) especifican el tipo del argumento (:c:expr:`int` por defecto):
ru: Модификаторы длины для следующих целочисленных преобразований (``d``, ``i``, ``o``, ``u``, ``x`` или ``X``) определяют тип аргумент (:c:expr:`int` по умолчанию):

source: Modifier
es_es: Modificador
ru: Модификатор

source: Types
es_es: Tipos
ru: Типы

source: :c:expr:`long` or :c:expr:`unsigned long`
es_es: :c:expr:`long` o :c:expr:`unsigned long`
ru: :c:expr:`long` или :c:expr:`unsigned long`

source: :c:expr:`long long` or :c:expr:`unsigned long long`
es_es: :c:expr:`long long` o :c:expr:`unsigned long long`
ru: :c:expr:`long long` или :c:expr:`unsigned long long`.

source: :c:type:`intmax_t` or :c:type:`uintmax_t`
es_es: :c:type:`intmax_t` o :c:type:`uintmax_t`
ru: :c:type:`intmax_t` или :c:type:`uintmax_t`

source: :c:type:`size_t` or :c:type:`ssize_t`
es_es: :c:type:`size_t` o :c:type:`ssize_t`
ru: :c:type:`size_t` или :c:type:`ssize_t`

source: The length modifier ``l`` for following conversions ``s`` or ``V`` specify that the type of the argument is :c:expr:`const wchar_t*`.
es_es: El modificador de longitud ``l`` para las siguientes conversiones ``s`` o ``V`` especifican que el tipo del argumento es :c:expr:`const wchar_t*`.
ru: Модификатор длины l для следующих преобразований ``s`` или ``V`` указывает, что тип аргумента — :c:expr:`const wchar_t*`.

source: The conversion specifiers are:
es_es: Los especificadores de conversión son:
ru: Спецификаторы преобразования:

source: Conversion Specifier
es_es: Especificador de conversión
ru: Спецификатор преобразования

source: Type
es_es: Tipo
ru: Тип

source: Comment
es_es: Comentario
ru: Комментарий

source: The literal ``%`` character.
es_es: El carácter literal ``%``.
ru: Буквальный символ ``%``.

source: Specified by the length modifier
es_es: Especificado por el modificador de longitud
ru: Задается модификатором длины

source: The decimal representation of a signed C integer.
es_es: La representación decimal de un entero C con signo.
ru: Десятичное представление целого числа C со знаком.

source: The decimal representation of an unsigned C integer.
es_es: La representación decimal de un entero C sin signo.
ru: Десятичное представление целого числа C без знака.

source: The octal representation of an unsigned C integer.
es_es: La representación octal de un entero C sin signo.
ru: Восьмеричное представление целого числа C без знака.

source: The hexadecimal representation of an unsigned C integer (lowercase).
es_es: La representación hexadecimal de un entero C sin signo (minúsculas).
ru: Шестнадцатеричное представление целого числа C без знака (в нижнем регистре).

source: The hexadecimal representation of an unsigned C integer (uppercase).
es_es: La representación hexadecimal de un entero C sin signo (mayúsculas).
ru: Шестнадцатеричное представление целого числа C без знака (заглавные буквы).

source: A single character.
es_es: Un solo carácter.
ru: Один символ.

source: :c:expr:`const char*` or :c:expr:`const wchar_t*`
es_es: :c:expr:`const char*` o :c:expr:`const wchar_t*`
ru: :c:expr:`const char*` или :c:expr:`const wchar_t*`

source: A null-terminated C character array.
es_es: Una matriz de caracteres C terminada en nulo.
ru: Нуль-терминированный массив символов С.

source: The hex representation of a C pointer. Mostly equivalent to ``printf("%p")`` except that it is guaranteed to start with the literal ``0x`` regardless of what the platform's ``printf`` yields.
es_es: La representación hexadecimal de un puntero C. Equivale en gran medida a ``printf("%p")``, salvo que se garantiza que comienza con el literal ``0x``, independientemente de lo que indique la plataforma ``printf``.
ru: Шестнадцатеричное представление указателя C. В основном эквивалентно ``printf(" %p ")`` за исключением того, что он гарантированно начинается с литерала ``0x`` независимо от того, что выдает ``printf`` платформы.

source: The result of calling :func:`ascii`.
es_es: El resultado de llamar a :func:`ascii`.
ru: Результат вызова :func:`ascii`.

source: A Unicode object.
es_es: Un objeto Unicode.
ru: Объект в Юникоде.

source: :c:expr:`PyObject*`, :c:expr:`const char*` or :c:expr:`const wchar_t*`
es_es: :c:expr:`PyObject*`, :c:expr:`const char*` o :c:expr:`const wchar_t*`
ru: :c:expr:`PyObject*`, :c:expr:`const char*` или :c:expr:`const wchar_t*`

source: A Unicode object (which may be ``NULL``) and a null-terminated C character array as a second parameter (which will be used, if the first parameter is ``NULL``).
es_es: Un objeto Unicode (que puede ser ``NULL``) y una matriz de caracteres C terminada en cero como segundo parámetro (que se utilizará si el primer parámetro es ``NULL``).
ru: Объект Unicode (который может быть ``NULL``) и нуль-терминированный массив символов C в качестве второго параметра (который будет использоваться, если первый параметр равен ``NULL``).

source: The result of calling :c:func:`PyObject_Str`.
es_es: El resultado de llamar a :c:func:`PyObject_Str`.
ru: Результат вызова :c:func:`PyObject_Str`.

source: The result of calling :c:func:`PyObject_Repr`.
es_es: El resultado de llamar a :c:func:`PyObject_Repr`.
ru: Результат вызова :c:func:`PyObject_Repr`.

source: Get the fully qualified name of an object type; call :c:func:`PyType_GetFullyQualifiedName`.
ru: Получить полное имя типа объекта; вызов :c:func:`PyType_GetFullyQualifiedName`.

source: Similar to ``T`` format, but use a colon (``:``) as separator between the module name and the qualified name.
ru: Аналогичен формату ``T``, но в качестве разделителя между именем модуля и уточненным именем используется двоеточие (``:``).

source: Get the fully qualified name of a type; call :c:func:`PyType_GetFullyQualifiedName`.
ru: Получить полное имя типа; вызов :c:func:`PyType_GetFullyQualifiedName`.

source: Similar to ``N`` format, but use a colon (``:``) as separator between the module name and the qualified name.
ru: Аналогичен формату ``N``, но в качестве разделителя между именем модуля и уточненным именем используется двоеточие (``:``).

source: The width formatter unit is number of characters rather than bytes. The precision formatter unit is number of bytes or :c:type:`wchar_t` items (if the length modifier ``l`` is used) for ``"%s"`` and ``"%V"`` (if the ``PyObject*`` argument is ``NULL``), and a number of characters for ``"%A"``, ``"%U"``, ``"%S"``, ``"%R"`` and ``"%V"`` (if the ``PyObject*`` argument is not ``NULL``).
es_es: La unidad del formateador de anchura es el número de caracteres en lugar de bytes. La unidad del formateador de precisión es el número de bytes o elementos de :c:type:`wchar_t` (si se utiliza el modificador de longitud ``l`` ) para ``"%s"`` y ``"%V"`` (si el argumento ``PyObject*`` es ``NULL``), y un número de caracteres para ``"%A"``, ``"%U"``, ``"%S"``, ``"%R"`` y ``"%V"`` (si el argumento ``PyObject*`` no es ``NULL``).
ru: Единицей форматирования ширины является количество символов, а не байтов. Единицей форматирования точности является количество байтов или элементов :c:type:`wchar_t` (если используется модификатор длины ``l``) для ``" %s "`` и ``"%V"`` (если аргумент ``PyObject*`` равен ``NULL``), а также количество символов для ``" %А "``, ``"%U"``, ``"%S"``, ``"%R"`` и ``"%V"`` (если аргумент ``PyObject*`` равен не ``NULL``).

source: Unlike to C :c:func:`printf` the ``0`` flag has effect even when a precision is given for integer conversions (``d``, ``i``, ``u``, ``o``, ``x``, or ``X``).
es_es: A diferencia de C :c:func:`printf` la bandera ``0`` tiene efecto incluso cuando se da una precisión para conversiones de enteros (``d``, ``i``, ``u``, ``o``, ``x``, o ``X``).
ru: В отличие от C :c:func:`printf` флаг ``0`` действует, даже если для целочисленных преобразований задана точность (``d``, ``i``, ``u``, `` o``, ``x`` или ``X``).

source: Support for ``"%lld"`` and ``"%llu"`` added.
es_es: Se ha añadido compatibilidad con ``"%lld"`` y ``"%llu"``.
ru: Добавлена ​​поддержка ``"%lld"`` и ``%llu"``.

source: Support for ``"%li"``, ``"%lli"`` and ``"%zi"`` added.
es_es: Se ha añadido compatibilidad con ``"%li"``, ``"%lli"`` y ``"%zi"``.
ru: Поддержка ``"%li"``, ``"%lli"`` и ``" %день "`` добавил.

source: Support width and precision formatter for ``"%s"``, ``"%A"``, ``"%U"``, ``"%V"``, ``"%S"``, ``"%R"`` added.
es_es: Formateador de ancho y precisión para ``"%s"``, ``"%A"``, ``"%U"``, ``"%V"``, ``"%S"``, ``"%R"`` añadido.
ru: Поддержка форматирования ширины и точности для ``" %s "``, ``" %А Добавлены "``, ``"%U"``, ``"%V"``, ``"%S"``, ``"%R"``.

source: Support for conversion specifiers ``o`` and ``X``. Support for length modifiers ``j`` and ``t``. Length modifiers are now applied to all integer conversions. Length modifier ``l`` is now applied to conversion specifiers ``s`` and ``V``. Support for variable width and precision ``*``. Support for flag ``-``.
es_es: Compatibilidad con los especificadores de conversión ``o`` y ``X``. Compatibilidad con los modificadores de longitud ``j`` y ``t``. Los modificadores de longitud se aplican ahora a todas las conversiones de enteros. El modificador de longitud ``l`` se aplica ahora a los especificadores de conversión ``s`` y ``V``. Soporte para anchura y precisión variables ``*``. Soporte para la bandera ``-``.
ru: Поддержка спецификаторов преобразования ``o`` и ``X``. Поддержка модификаторов длины ``j`` и ``t``. Модификаторы длины теперь применяются ко всем целочисленным преобразованиям. Модификатор длины ``l`` теперь применяется к спецификаторам преобразования ``s`` и ``V``. Поддержка переменной ширины и точности ``*``. Поддержка флага ``-``.

source: An unrecognized format character now sets a :exc:`SystemError`. In previous versions it caused all the rest of the format string to be copied as-is to the result string, and any extra arguments discarded.
es_es: Un carácter de formato no reconocido ahora establece un :exc:`SystemError`. En versiones anteriores provocaba que todo el resto de la cadena de formato se copiara tal cual a la cadena de resultado, y cualquier argumento extra se descartaba.
ru: Нераспознанный символ формата теперь устанавливает :exc:`SystemError`. В предыдущих версиях это приводило к тому, что вся остальная часть строки формата копировалась в результирующую строку как есть, а все дополнительные аргументы отбрасывались.

source: Support for ``%T``, ``%#T``, ``%N`` and ``%#N`` formats added.
ru: Добавлена ​​поддержка форматов ``%T``, ``%#T``, ``%N`` и ``%#N``.

source: Identical to :c:func:`PyUnicode_FromFormat` except that it takes exactly two arguments.
es_es: Idéntico a :c:func:`PyUnicode_FromFormat` excepto que toma exactamente dos argumentos.
ru: Идентичен :c:func:`PyUnicode_FromFormat`, за исключением того, что он принимает ровно два аргумента.

source: Copy an instance of a Unicode subtype to a new true Unicode object if necessary. If *obj* is already a true Unicode object (not a subtype), return a new :term:`strong reference` to the object.
es_es: Copia una instancia de un subtipo Unicode a un nuevo objeto Unicode verdadero si es necesario. Si *obj* ya es un objeto Unicode verdadero (no un subtipo), devuelve una nueva :term:`strong reference` al objeto.
ru: При необходимости скопируйте экземпляр подтипа Юникода в новый настоящий объект Юникода. Если *obj* уже является настоящим объектом Unicode (а не подтипом), верните новую :term:`strong ссылку` на объект.

source: Objects other than Unicode or its subtypes will cause a :exc:`TypeError`.
es_es: Los objetos que no sean Unicode o sus subtipos causarán un :exc:`TypeError`.
ru: Объекты, отличные от Unicode или его подтипов, вызовут ошибку :exc:`TypeError`.

source: Decode an encoded object *obj* to a Unicode object.
es_es: Decodifica un objeto codificado *obj* a un objeto Unicode.
ru: Декодируйте закодированный объект *obj* в объект Unicode.

source: :class:`bytes`, :class:`bytearray` and other :term:`bytes-like objects <bytes-like object>` are decoded according to the given *encoding* and using the error handling defined by *errors*. Both can be ``NULL`` to have the interface use the default values (see :ref:`builtincodecs` for details).
es_es: :class:`bytes` :class:`bytearray` y otros objetos :term:`bytes-like ` <bytes-like object> se decodifican de acuerdo con la *codificación* dada y usando el tratamiento de errores definido por *errors*. Ambos pueden ser ``NULL`` para que la interfaz use los valores por defecto (ver :ref:`builtincodecs` para más detalles).
ru: :class:`bytes`, :class:`bytearray` и другие :term:`байтоподобные объекты <байтоподобный объект>` декодируются в соответствии с заданной *кодировкой* и с использованием обработки ошибок, определенной *errors*. Оба могут иметь значение ``NULL``, чтобы интерфейс использовал значения по умолчанию (подробнее см. :ref:`builtincodecs`).

source: All other objects, including Unicode objects, cause a :exc:`TypeError` to be set.
es_es: Todos los demás objetos, incluidos los Unicode, hacen que se establezca un :exc:`TypeError`.
ru: Все остальные объекты, включая объекты Unicode, вызывают установку :exc:`TypeError`.

source: The API returns ``NULL`` if there was an error. The caller is responsible for decref'ing the returned objects.
es_es: La API devuelve ``NULL`` si se ha producido un error. Quien llama es responsable de decref'ing los objetos devueltos.
ru: API возвращает NULL, если произошла ошибка. Вызывающая сторона несет ответственность за удаление возвращаемых объектов.

source: Return the length of the Unicode object, in code points.
es_es: Devuelve la longitud del objeto Unicode, en puntos de código.
ru: Возвращает длину объекта Unicode в кодовых точках.

source: On error, set an exception and return ``-1``.
ru: В случае ошибки установить исключение и вернуть ``-1``.

source: Copy characters from one Unicode object into another. This function performs character conversion when necessary and falls back to :c:func:`!memcpy` if possible. Returns ``-1`` and sets an exception on error, otherwise returns the number of copied characters.
es_es: Copia caracteres de un objeto Unicode a otro. Esta función realiza la conversión de caracteres cuando es necesario y vuelve a :c:func:`!memcpy` si es posible. Devuelve ``-1`` y establece una excepción en caso de error; en caso contrario, devuelve el número de caracteres copiados.
ru: Копирование символов из одного объекта Unicode в другой. Эта функция выполняет преобразование символов, когда это необходимо, и, если возможно, возвращается к :c:func:`!memcpy`. Возвращает ``-1`` и устанавливает исключение в случае ошибки, в противном случае возвращает количество скопированных символов.

source: Fill a string with a character: write *fill_char* into ``unicode[start:start+length]``.
es_es: Llena una cadena con un carácter: escribe *fill_char* en ``unicode[start:start+length]``.
ru: Заполните строку символом: напишите *fill_char* в ``unicode[start:start+length]``.

source: Fail if *fill_char* is bigger than the string maximum character, or if the string has more than 1 reference.
es_es: Fallo si *fill_char* es mayor que el carácter máximo de la cadena, o si la cadena tiene más de 1 referencia.
ru: Ошибка, если *fill_char* больше максимального символа строки или если строка содержит более 1 ссылки.

source: Return the number of written character, or return ``-1`` and raise an exception on error.
es_es: Devuelve el número de caracteres escritos, o devuelve ``-1`` y lanza una excepción en caso de error.
ru: Верните количество записанных символов или верните ``-1`` и вызовите исключение в случае ошибки.
