Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/unicode.po
Languages: es_es, ru

source: :c:data:`Py_True` or :c:data:`Py_False` for successful comparisons
es_es: :c:data:`Py_True` o :c:data:`Py_False` para realizar comparaciones con éxito
ru: :c:data:`Py_True` или :c:data:`Py_False` для успешного сравнения.

source: :c:data:`Py_NotImplemented` in case the type combination is unknown
es_es: :c:data:`Py_NotImplemented` en caso de que se desconozca la combinación de tipos
ru: :c:data:`Py_NotImplemented` в случае, если комбинация типов неизвестна

source: Possible values for *op* are :c:macro:`Py_GT`, :c:macro:`Py_GE`, :c:macro:`Py_EQ`, :c:macro:`Py_NE`, :c:macro:`Py_LT`, and :c:macro:`Py_LE`.
es_es: Los posibles valores de *op* son :c:macro:`Py_GT`, :c:macro:`Py_GE`, :c:macro:`Py_EQ`, :c:macro:`Py_NE`, :c:macro:`Py_LT` y :c:macro:`Py_LE`.
ru: Возможные значения для *op*: :c:macro:`Py_GT`, :c:macro:`Py_GE`, :c:macro:`Py_EQ`, :c:macro:`Py_NE`, :c:macro:`Py_LT ` и :c:macro:`Py_LE`.

source: Return a new string object from *format* and *args*; this is analogous to ``format % args``.
es_es: Devuelve un nuevo objeto de cadena a partir de *format* y *args*; esto es análogo a ``format % args``.
ru: Вернуть новый строковый объект из *format* и *args*; это аналогично ``format % args``.

source: Check whether *substr* is contained in *unicode* and return true or false accordingly.
es_es: Comprueba si *substr* está contenido en *unicode* y devuelve true o false según corresponda.
ru: Проверьте, содержится ли *substr* в *unicode*, и верните true или false соответственно.

source: *substr* has to coerce to a one element Unicode string. ``-1`` is returned if there was an error.
es_es: *substr* tiene que coaccionar a una cadena Unicode de un elemento. ``-1`` se devuelve si hubo un error.
ru: *substr* должен привести к одноэлементной строке Unicode. ``-1`` возвращается, если произошла ошибка.

source: Intern the argument :c:expr:`*p_unicode` in place. The argument must be the address of a pointer variable pointing to a Python Unicode string object. If there is an existing interned string that is the same as :c:expr:`*p_unicode`, it sets :c:expr:`*p_unicode` to it (releasing the reference to the old string object and creating a new :term:`strong reference` to the interned string object), otherwise it leaves :c:expr:`*p_unicode` alone and interns it.
ru: Интернируйте аргумент :c:expr:`*p_unicode` на место. Аргумент должен быть адресом переменной-указателя, указывающей на строковый объект Unicode Python. Если существует существующая интернированная строка, такая же, как :c:expr:`*p_unicode`, она устанавливает для нее :c:expr:`*p_unicode` (освобождая ссылку на старый строковый объект и создавая новый :term :`strong reference` на интернированный строковый объект), в противном случае он оставляет :c:expr:`*p_unicode` в покое и интернирует его.

source: (Clarification: even though there is a lot of talk about references, think of this function as reference-neutral. You must own the object you pass in; after the call you no longer own the passed-in reference, but you newly own the result.)
ru: (Уточнение: хотя о ссылках много говорят, думайте об этой функции как о ссылочно-нейтральной. Вы должны владеть объектом, который передаете; после вызова вы больше не владеете переданной ссылкой, но вы вновь владеете результат.)

source: This function never raises an exception. On error, it leaves its argument unchanged without interning it.
ru: Эта функция никогда не вызывает исключения. В случае ошибки он оставляет свой аргумент неизменным, не интернируя его.

source: Instances of subclasses of :py:class:`str` may not be interned, that is, :c:expr:`PyUnicode_CheckExact(*p_unicode)` must be true. If it is not, then -- as with any other error -- the argument is left unchanged.
ru: Экземпляры подклассов :py:class:`str` не могут быть интернированы, то есть :c:expr:`PyUnicode_CheckExact(*p_unicode)` должно иметь значение true. Если это не так, то, как и при любой другой ошибке, аргумент остается неизменным.

source: Note that interned strings are not “immortal”. You must keep a reference to the result to benefit from interning.
ru: Обратите внимание, что интернированные строки не являются «бессмертными». Вы должны сохранить ссылку на результат, чтобы получить выгоду от стажировки.

source: A combination of :c:func:`PyUnicode_FromString` and :c:func:`PyUnicode_InternInPlace`, meant for statically allocated strings.
ru: Комбинация :c:func:`PyUnicode_FromString` и :c:func:`PyUnicode_InternInPlace`, предназначенная для статически выделенных строк.

source: Return a new ("owned") reference to either a new Unicode string object that has been interned, or an earlier interned string object with the same value.
ru: Возвращает новую («принадлежащую») ссылку либо на новый строковый объект Юникода, который был интернирован, либо на ранее интернированный строковый объект с тем же значением.

source: Python may keep a reference to the result, or make it :term:`immortal`, preventing it from being garbage-collected promptly. For interning an unbounded number of different strings, such as ones coming from user input, prefer calling :c:func:`PyUnicode_FromString` and :c:func:`PyUnicode_InternInPlace` directly.
ru: Python может сохранить ссылку на результат или сделать его «бессмертным», предотвращая его быструю сборку мусора. Для интернирования неограниченного количества различных строк, например, поступающих из пользовательского ввода, предпочтительнее вызывать :c:func:`PyUnicode_FromString` и :c:func:`PyUnicode_InternInPlace` напрямую.

source: Strings interned this way are made :term:`immortal`.
ru: Строки, интернированные таким образом, становятся :term:`бессмертными`.

source: This function uses simple case mappings.
es_es: Esta función utiliza mapeos de casos simples.

source: Join two surrogate characters and return a single :c:type:`Py_UCS4` value. *high* and *low* are respectively the leading and trailing surrogates in a surrogate pair. *high* must be in the range [0xD800; 0xDBFF] and *low* must be in the range [0xDC00; 0xDFFF].
es_es: Une dos caracteres sustitutos y devuelve un único valor :c:type:`Py_UCS4`. *high* y *low* son, respectivamente, los sustitutos inicial y final de un par de sustitutos. *high* debe estar en el rango [0xD800; 0xDBFF] y *low* debe estar en el rango [0xDC00; 0xDFFF].

source: To encode file names to :class:`bytes` during argument parsing, the ``"O&"`` converter should be used, passing :c:func:`PyUnicode_FSConverter` as the conversion function:
es_es: Para codificar nombres de archivo en :class:`bytes` durante el análisis sintáctico de argumentos, debe utilizarse el conversor ``"O&"``, pasando :c:func:`PyUnicode_FSConverter` como función de conversión:

source: ParseTuple converter: encode :class:`str` objects -- obtained directly or through the :class:`os.PathLike` interface -- to :class:`bytes` using :c:func:`PyUnicode_EncodeFSDefault`; :class:`bytes` objects are output as-is. *result* must be a :c:expr:`PyBytesObject*` which must be released when it is no longer used.
es_es: Conversor ParseTuple: codifica objetos :class:`str` -- obtenidos directamente o a través de la interfaz :class:`os.PathLike` -- a :class:`bytes` utilizando :c:func:`PyUnicode_EncodeFSDefault`; los objetos :class:`bytes` se emiten tal cual. El *resultado* debe ser un :c:expr:`PyBytesObject*` que debe ser liberado cuando ya no se utilice.

source: To decode file names to :class:`str` during argument parsing, the ``"O&"`` converter should be used, passing :c:func:`PyUnicode_FSDecoder` as the conversion function:
es_es: Para decodificar los nombres de archivo a :class:`str` durante el análisis de argumentos, se debe utilizar el convertidor ``"O&"``, pasando :c:func:`PyUnicode_FSDecoder` como función de conversión.

source: ParseTuple converter: decode :class:`bytes` objects -- obtained either directly or indirectly through the :class:`os.PathLike` interface -- to :class:`str` using :c:func:`PyUnicode_DecodeFSDefaultAndSize`; :class:`str` objects are output as-is. *result* must be a :c:expr:`PyUnicodeObject*` which must be released when it is no longer used.
es_es: Conversor ParseTuple: decodifica objetos :class:`bytes` -- obtenidos directa o indirectamente a través de la interfaz :class:`os.PathLike` -- a :class:`str` utilizando :c:func:`PyUnicode_DecodeFSDefaultAndSize`; los objetos :class:`str` se emiten tal cual. El *resultado* debe ser un :c:expr:`PyUnicodeObject*` que debe ser liberado cuando ya no se utilice.

source: In the case of an error, ``NULL`` is returned with an exception set and no *size* is stored.
es_es: En caso de error, se devuelve ``NULL`` con una excepción y no se almacena *size*.

source: Intern the argument :c:expr:`*p_unicode` in place. The argument must be the address of a pointer variable pointing to a Python Unicode string object. If there is an existing interned string that is the same as :c:expr:`*p_unicode`, it sets :c:expr:`*p_unicode` to it (releasing the reference to the old string object and creating a new :term:`strong reference` to the interned string object), otherwise it leaves :c:expr:`*p_unicode` alone and interns it (creating a new :term:`strong reference`). (Clarification: even though there is a lot of talk about references, think of this function as reference-neutral; you own the object after the call if and only if you owned it before the call.)
es_es: Interna el argumento :c:expr:`*p_unicode` en su lugar. El argumento debe ser la dirección de una variable puntero que apunte a un objeto cadena Unicode de Python. Si hay una cadena internada existente que es la misma que :c:expr:`*p_unicode`, establece :c:expr:`*p_unicode` a ella (liberando la referencia al objeto de cadena antiguo y creando una nueva :term:`strong reference` al objeto de cadena internado), de lo contrario deja :c:expr:`*p_unicode` solo y lo interna (creando una nueva :term:`strong reference`). (Aclaración: aunque se habla mucho de referencias, piense en esta función como neutra en cuanto a referencias; usted posee el objeto después de la llamada si y sólo si lo poseía antes de la llamada).

source: A combination of :c:func:`PyUnicode_FromString` and :c:func:`PyUnicode_InternInPlace`, returning either a new Unicode string object that has been interned, or a new ("owned") reference to an earlier interned string object with the same value.
es_es: Una combinación de :c:func:`PyUnicode_FromString` y :c:func:`PyUnicode_InternInPlace`, devolviendo ya sea un nuevo objeto de cadena Unicode que ha sido internado, o una nueva referencia ("owned") a un objeto de cadena internado anterior con el mismo valor.
