Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/unicode.po
Languages: es_es, ru

source: Create a Unicode object by decoding *size* bytes of the Latin-1 encoded string *str*. Return ``NULL`` if an exception was raised by the codec.
es_es: Crea un objeto Unicode decodificando *size* bytes de la cadena codificada en Latin-1 *str*. Devuelve ``NULL`` si el códec ha lanzado una excepción.
ru: Создайте объект Unicode, декодировав *size* байты строки *str* в кодировке Latin-1. Верните NULL, если кодек вызвал исключение.

source: Encode a Unicode object using Latin-1 and return the result as Python bytes object. Error handling is "strict". Return ``NULL`` if an exception was raised by the codec.
es_es: Codifica un objeto Unicode utilizando Latin-1 y devuelve el resultado como un objeto de bytes de Python. El manejo de errores es "estricto". Devuelve ``NULL`` si se produjo una excepción por parte del códec.
ru: Закодируйте объект Unicode, используя Latin-1, и верните результат как объект байтов Python. Обработка ошибок является «строгой». Верните NULL, если кодек вызвал исключение.

source: ASCII Codecs
es_es: Códecs ASCII
ru: Кодеки ASCII

source: These are the ASCII codec APIs. Only 7-bit ASCII data is accepted. All other codes generate errors.
es_es: Estas son las API del códec ASCII. Solo se aceptan datos ASCII de 7 bits. Todos los demás códigos generan errores.
ru: Это API-интерфейсы кодека ASCII. Принимаются только 7-битные данные ASCII. Все остальные коды выдают ошибки.

source: Create a Unicode object by decoding *size* bytes of the ASCII encoded string *str*. Return ``NULL`` if an exception was raised by the codec.
es_es: Crea un objeto Unicode decodificando *size* bytes de la cadena codificada ASCII *str*. Devuelve ``NULL`` si el códec ha lanzado una excepción.
ru: Создайте объект Unicode, декодировав *size* байты строки *str* в кодировке ASCII. Верните NULL, если кодек вызвал исключение.

source: Encode a Unicode object using ASCII and return the result as Python bytes object. Error handling is "strict". Return ``NULL`` if an exception was raised by the codec.
es_es: Codifica un objeto Unicode usando ASCII y devuelve el resultado como un objeto Python bytes. El tratamiento de errores es "estricto". Devuelve ``NULL`` si el códec ha lanzado una excepción.
ru: Закодируйте объект Unicode, используя ASCII, и верните результат как объект байтов Python. Обработка ошибок является «строгой». Верните NULL, если кодек вызвал исключение.

source: Character Map Codecs
es_es: Mapa de caracteres Códecs
ru: Кодеки карты символов

source: This codec is special in that it can be used to implement many different codecs (and this is in fact what was done to obtain most of the standard codecs included in the :mod:`!encodings` package). The codec uses mappings to encode and decode characters. The mapping objects provided must support the :meth:`~object.__getitem__` mapping interface; dictionaries and sequences work well.
es_es: Este códec es especial en el sentido de que puede utilizarse para implementar muchos códecs diferentes (y esto es, de hecho, lo que se hizo para obtener la mayoría de los códecs estándar incluidos en el paquete :mod:`!encodings` ). El códec utiliza mapeados para codificar y descodificar caracteres. Los objetos de mapeo proporcionados deben soportar la interfaz de mapeo :meth:`~object.__getitem__`; los diccionarios y las secuencias funcionan bien.
ru: Этот кодек уникален тем, что с его помощью можно реализовать множество различных кодеков (именно это и было сделано для получения большинства стандартных кодеков, включенных в пакет :mod:`!encodings`). Кодек использует сопоставления для кодирования и декодирования символов. Предоставленные объекты сопоставления должны поддерживать интерфейс сопоставления :meth:`~object.__getitem__`; словари и последовательности работают хорошо.

source: These are the mapping codec APIs:
es_es: Estas son las APIs de mapeo de códecs.
ru: Это API-интерфейсы кодеков сопоставления:

source: Create a Unicode object by decoding *size* bytes of the encoded string *str* using the given *mapping* object. Return ``NULL`` if an exception was raised by the codec.
es_es: Crea un objeto Unicode decodificando *size* bytes de la cadena codificada *str* utilizando el objeto *mapping* dado. Devuelve ``NULL`` si el códec ha lanzado una excepción.
ru: Создайте объект Unicode, декодировав *size* байты закодированной строки *str*, используя данный объект *mapping*. Верните NULL, если кодек вызвал исключение.

source: If *mapping* is ``NULL``, Latin-1 decoding will be applied. Else *mapping* must map bytes ordinals (integers in the range from 0 to 255) to Unicode strings, integers (which are then interpreted as Unicode ordinals) or ``None``. Unmapped data bytes -- ones which cause a :exc:`LookupError`, as well as ones which get mapped to ``None``, ``0xFFFE`` or ``'\ufffe'``, are treated as undefined mappings and cause an error.
es_es: Si *mapping* es ``NULL``, se aplicará la decodificación Latin-1. De lo contrario, *mapping* debe mapear los bytes ordinales (enteros en el rango de 0 a 255) a cadenas Unicode, enteros (que luego se interpretan como ordinales Unicode) o ``None``. Los bytes de datos no mapeados, aquellos que causan un :exc:`LookupError`, así como aquellos que se mapean a ``None``, ``0xFFFE`` o ``'\ufffe'``, se tratan como mapeos indefinidos y causan un error.
ru: Если *mapping* имеет значение ``NULL``, будет применено декодирование Latin-1. В противном случае *отображение* должно отображать порядковые номера байтов (целые числа в диапазоне от 0 до 255) в строки Unicode, целые числа (которые затем интерпретируются как порядковые номера Unicode) или ``None``. Несопоставленные байты данных — те, которые вызывают :exc:`LookupError`, а также те, которые отображаются в ``None``, ``0xFFFE`` или ``'\ufffe'``, рассматриваются как неопределенные сопоставления. и вызвать ошибку.

source: Encode a Unicode object using the given *mapping* object and return the result as a bytes object. Error handling is "strict". Return ``NULL`` if an exception was raised by the codec.
es_es: Codifica un objeto Unicode utilizando el objeto *mapping* dado y devuelve el resultado como un objeto bytes. El tratamiento de errores es "estricto". Devuelve ``NULL`` si el códec ha lanzado una excepción.
ru: Закодируйте объект Unicode, используя данный объект *mapping*, и верните результат в виде байтового объекта. Обработка ошибок является «строгой». Верните NULL, если кодек вызвал исключение.

source: The *mapping* object must map Unicode ordinal integers to bytes objects, integers in the range from 0 to 255 or ``None``. Unmapped character ordinals (ones which cause a :exc:`LookupError`) as well as mapped to ``None`` are treated as "undefined mapping" and cause an error.
es_es: El objeto *mapping* debe mapear enteros ordinales Unicode a objetos de bytes, enteros en el rango de 0 a 255 o ``None``. Los ordinales de caracteres no mapeados (aquellos que causan un :exc:`LookupError`) así como los mapeados a ``None`` se tratan como "mapeo indefinido" y causan un error.
ru: Объект *mapping* должен отображать порядковые целые числа Юникода в байтовые объекты, целые числа в диапазоне от 0 до 255 или ``None``. Несопоставленные порядковые номера символов (те, которые вызывают :exc:`LookupError`), а также сопоставленные с ``None``, рассматриваются как «неопределенное сопоставление» и вызывают ошибку.

source: The following codec API is special in that maps Unicode to Unicode.
es_es: El siguiente API de códec es especial en el sentido de que mapea Unicode a Unicode.
ru: Следующий API кодека уникален тем, что сопоставляет Unicode с Unicode.

source: Translate a string by applying a character mapping table to it and return the resulting Unicode object. Return ``NULL`` if an exception was raised by the codec.
es_es: Traduce una cadena aplicándole una tabla de asignación de caracteres y devuelve el objeto Unicode resultante. Devuelve ``NULL`` si el códec ha lanzado una excepción.
ru: Переведите строку, применив к ней таблицу сопоставления символов, и верните полученный объект Unicode. Верните NULL, если кодек вызвал исключение.

source: The mapping table must map Unicode ordinal integers to Unicode ordinal integers or ``None`` (causing deletion of the character).
es_es: La tabla de asignación debe asignar enteros ordinales Unicode a enteros ordinales Unicode o ``None`` (provocando la eliminación del carácter).
ru: Таблица сопоставления должна сопоставлять порядковые целые числа Юникода с порядковыми целыми числами Юникода или «Нет» (что приводит к удалению символа).

source: Mapping tables need only provide the :meth:`~object.__getitem__` interface; dictionaries and sequences work well. Unmapped character ordinals (ones which cause a :exc:`LookupError`) are left untouched and are copied as-is.
es_es: Las tablas de asignación sólo deben proporcionar la interfaz :meth:`~object.__getitem__`; los diccionarios y las secuencias funcionan bien. Los ordinales de caracteres no mapeados (los que provocan un :exc:`LookupError`) se dejan intactos y se copian tal cual.
ru: Таблицы отображения должны предоставлять только интерфейс :meth:`~object.__getitem__`; словари и последовательности работают хорошо. Несопоставленные порядковые номера символов (те, которые вызывают ошибку :exc:`LookupError`) остаются нетронутыми и копируются как есть.

source: *errors* has the usual meaning for codecs. It may be ``NULL`` which indicates to use the default error handling.
es_es: *errors* tiene el significado habitual para los codecs. Puede ser ``NULL``, lo cual indica usar el manejo de errores predeterminado.
ru: *errors* имеет обычное значение для кодеков. Это может быть ``NULL``, что указывает на использование обработки ошибок по умолчанию.

source: MBCS codecs for Windows
es_es: Códecs MBCS para Windows
ru: Кодеки MBCS для Windows

source: These are the MBCS codec APIs. They are currently only available on Windows and use the Win32 MBCS converters to implement the conversions. Note that MBCS (or DBCS) is a class of encodings, not just one. The target encoding is defined by the user settings on the machine running the codec.
es_es: Estas son las API del códec MBCS. Actualmente solo están disponibles en Windows y utilizan los convertidores MBCS de Win32 para implementar las conversiones. Tener en cuenta que MBCS (o DBCS) es una clase de codificaciones, no solo una. La codificación objetivo está definida por la configuración del usuario en la máquina que ejecuta el códec.
ru: Это API-интерфейсы кодека MBCS. В настоящее время они доступны только в Windows и используют конвертеры Win32 MBCS для реализации преобразований. Обратите внимание, что MBCS (или DBCS) — это класс кодировок, а не один. Целевая кодировка определяется пользовательскими настройками на компьютере, на котором работает кодек.

source: Create a Unicode object by decoding *size* bytes of the MBCS encoded string *str*. Return ``NULL`` if an exception was raised by the codec.
es_es: Crea un objeto Unicode decodificando *size* bytes de la cadena codificada MBCS *str*. Devuelve ``NULL`` si el códec ha lanzado una excepción.
ru: Создайте объект Unicode, декодировав *size* байты строки в кодировке MBCS *str*. Верните NULL, если кодек вызвал исключение.

source: If *consumed* is ``NULL``, behave like :c:func:`PyUnicode_DecodeMBCS`. If *consumed* is not ``NULL``, :c:func:`PyUnicode_DecodeMBCSStateful` will not decode trailing lead byte and the number of bytes that have been decoded will be stored in *consumed*.
es_es: Si *consumed* es ``NULL``, se comportará como :c:func:`PyUnicode_DecodeMBCS`. Si *consumed* no es ``NULL``, :c:func:`PyUnicode_DecodeMBCSStateful` no descodificará el byte inicial y el número de bytes descodificados se almacenará en *consumed*.
ru: Если *consumed* равно NULL, ведите себя как :c:func:`PyUnicode_DecodeMBCS`. Если *consumed* не равно ``NULL``, :c:func:`PyUnicode_DecodeMBCSStateful` не будет декодировать конечный ведущий байт, а количество декодированных байтов будет сохранено в *consumed*.

source: Encode a Unicode object using MBCS and return the result as Python bytes object. Error handling is "strict". Return ``NULL`` if an exception was raised by the codec.
es_es: Codificar un objeto Unicode utilizando MBCS y devolver el resultado como un objeto bytes de Python. El manejo de errores es "estricto". Devolver ``NULL`` si se produjo una excepción por parte del códec.
ru: Закодируйте объект Unicode, используя MBCS, и верните результат в виде байтового объекта Python. Обработка ошибок является «строгой». Верните NULL, если кодек вызвал исключение.

source: Encode the Unicode object using the specified code page and return a Python bytes object. Return ``NULL`` if an exception was raised by the codec. Use :c:macro:`!CP_ACP` code page to get the MBCS encoder.
es_es: Codifica el objeto Unicode utilizando la página de códigos especificada y devuelve un objeto Python bytes. Devuelve ``NULL`` si el códec ha lanzado una excepción. Utilice :c:macro:`!CP_ACP` code page para obtener el codificador MBCS.
ru: Закодируйте объект Unicode, используя указанную кодовую страницу, и верните байтовый объект Python. Верните NULL, если кодек вызвал исключение. Используйте кодовую страницу :c:macro:`!CP_ACP`, чтобы получить кодировщик MBCS.

source: Methods & Slots
es_es: Métodos y Ranuras
ru: Методы и слоты

source: Methods and Slot Functions
es_es: Métodos y Funciones de Ranura
ru: Методы и функции слотов

source: The following APIs are capable of handling Unicode objects and strings on input (we refer to them as strings in the descriptions) and return Unicode objects or integers as appropriate.
es_es: Las siguientes APIs son capaces de manejar objetos y cadenas Unicode en la entrada (nos referimos a ellos como cadenas en las descripciones) y devuelven objetos Unicode o enteros según corresponda.
ru: Следующие API-интерфейсы способны обрабатывать объекты и строки Unicode на входе (в описаниях мы называем их строками) и возвращать объекты или целые числа Unicode в зависимости от ситуации.

source: They all return ``NULL`` or ``-1`` if an exception occurs.
es_es: Todos ellos devuelven ``NULL`` o ``-1`` si se produce una excepción.
ru: Все они возвращают ``NULL`` или ``-1`` в случае возникновения исключения.

source: Concat two strings giving a new Unicode string.
es_es: Concatena dos cadenas dando una nueva cadena Unicode.
ru: Объедините две строки, давая новую строку Unicode.

source: Split a string giving a list of Unicode strings. If *sep* is ``NULL``, splitting will be done at all whitespace substrings. Otherwise, splits occur at the given separator. At most *maxsplit* splits will be done. If negative, no limit is set. Separators are not included in the resulting list.
es_es: Divide una cadena dando una lista de cadenas Unicode. Si *sep* es ``NULL``, la división se realizará en todas las subcadenas de espacios en blanco. En caso contrario, las divisiones se producen en el separador dado. Se realizarán como máximo *maxsplit* divisiones. Si es negativo, no se establece ningún límite. Los separadores no se incluyen en la lista resultante.
ru: Разделите строку, получив список строк Юникода. Если *sep* имеет значение ``NULL``, разделение будет выполняться по всем подстрокам с пробелами. В противном случае разделение происходит по данному разделителю. Будет выполнено не более *maxsplit* разделения. Если оно отрицательное, предел не устанавливается. Разделители не включаются в результирующий список.

source: Split a Unicode string at line breaks, returning a list of Unicode strings. CRLF is considered to be one line break. If *keepends* is ``0``, the Line break characters are not included in the resulting strings.
es_es: Divide una cadena Unicode en los saltos de línea, devolviendo una lista de cadenas Unicode. CRLF se considera un salto de línea. Si *keepends* es ``0``, los caracteres de salto de línea no se incluyen en las cadenas resultantes.
ru: Разделите строку Юникода по разрывам строк, вернув список строк Юникода. CRLF считается разрывом одной строки. Если *keepends* имеет значение ``0``, символы разрыва строки не включаются в результирующие строки.

source: Join a sequence of strings using the given *separator* and return the resulting Unicode string.
es_es: Unir una secuencia de cadenas utilizando el *separador* proporcionado y devolver la cadena Unicode resultante.
ru: Соедините последовательность строк, используя заданный *разделитель*, и верните полученную строку в Юникоде.

source: Return ``1`` if *substr* matches ``unicode[start:end]`` at the given tail end (*direction* == ``-1`` means to do a prefix match, *direction* == ``1`` a suffix match), ``0`` otherwise. Return ``-1`` if an error occurred.
es_es: Devuelve ``1`` si *substr* coincide con ``unicode[start:end]`` en la cola dada (*direction* == ``-1`` significa hacer una coincidencia de prefijo, *direction* == ``1`` una coincidencia de sufijo), ``0`` en caso contrario. Devuelve ``-1`` si se ha producido un error.
ru: Возвращает ``1``, если *substr* соответствует ``unicode[start:end]`` в заданном конце (*direction* == ``-1`` означает совпадение префикса, *direction* == ``1`` соответствует суффиксу), ``0`` в противном случае. Верните ``-1``, если произошла ошибка.

source: Return the first position of *substr* in ``unicode[start:end]`` using the given *direction* (*direction* == ``1`` means to do a forward search, *direction* == ``-1`` a backward search). The return value is the index of the first match; a value of ``-1`` indicates that no match was found, and ``-2`` indicates that an error occurred and an exception has been set.
es_es: Devuelve la primera posición de *substr* en ``unicode[start:end]`` utilizando la *direction* dada (*direction* == ``1`` significa hacer una búsqueda hacia delante, *direction* == ``-1`` una búsqueda hacia atrás). El valor devuelto es el índice de la primera coincidencia; un valor de ``-1`` indica que no se ha encontrado ninguna coincidencia, y ``-2`` indica que se ha producido un error y se ha establecido una excepción.
ru: Вернуть первую позицию *substr* в ``unicode[start:end]``, используя заданное *direction* (*direction* == ``1`` означает прямой поиск, *direction* == `` -1`` обратный поиск). Возвращаемое значение — это индекс первого совпадения; значение ``-1`` указывает, что совпадение не найдено, а ``-2`` указывает, что произошла ошибка и было установлено исключение.

source: Return the first position of the character *ch* in ``unicode[start:end]`` using the given *direction* (*direction* == ``1`` means to do a forward search, *direction* == ``-1`` a backward search). The return value is the index of the first match; a value of ``-1`` indicates that no match was found, and ``-2`` indicates that an error occurred and an exception has been set.
es_es: Devuelve la primera posición del carácter *ch* en ``unicode[start:end]`` utilizando la *direction* dada (*direction* == ``1`` significa hacer una búsqueda hacia delante, *direction* == ``-1`` una búsqueda hacia atrás). El valor devuelto es el índice de la primera coincidencia; un valor de ``-1`` indica que no se ha encontrado ninguna coincidencia, y ``-2`` indica que se ha producido un error y se ha establecido una excepción.
ru: Вернуть первую позицию символа *ch* в ``unicode[start:end]``, используя заданное *направление* (*direction* == ``1`` означает прямой поиск, *direction* == ``-1`` обратный поиск). Возвращаемое значение — это индекс первого совпадения; значение ``-1`` указывает, что совпадение не найдено, а ``-2`` указывает, что произошла ошибка и было установлено исключение.

source: *start* and *end* are now adjusted to behave like ``unicode[start:end]``.
es_es: *start* y *end* se ajustan ahora para comportarse como ``unicode[start:end]``.
ru: *start* и *end* теперь настроены так, чтобы вести себя как ``unicode[start:end]``.

source: Return the number of non-overlapping occurrences of *substr* in ``unicode[start:end]``. Return ``-1`` if an error occurred.
es_es: Devuelve el número de apariciones no solapadas de *substr* en ``unicode[start:end]``. Devuelve ``-1`` si se ha producido un error.
ru: Возвращает количество непересекающихся вхождений *substr* в ``unicode[start:end]``. Верните ``-1``, если произошла ошибка.

source: Replace at most *maxcount* occurrences of *substr* in *unicode* with *replstr* and return the resulting Unicode object. *maxcount* == ``-1`` means replace all occurrences.
es_es: Reemplaza como máximo *maxcount* ocurrencias de *substr* en *unicode* con *replstr* y devuelve el objeto Unicode resultante. *maxcount* == ``-1`` significa reemplazar todas las ocurrencias.
ru: Замените не более *maxcount* вхождений *substr* в *unicode* на *replstr* и верните полученный объект Unicode. *maxcount* == ``-1`` означает замену всех вхождений.

source: Compare two strings and return ``-1``, ``0``, ``1`` for less than, equal, and greater than, respectively.
es_es: Comparar dos cadenas y devolver ``-1``, ``0``, ``1`` para menor que, igual y mayor que, respectivamente.
ru: Сравните две строки и верните ``-1``, ``0``, ``1`` для значений меньше, равно и больше соответственно.

source: This function returns ``-1`` upon failure, so one should call :c:func:`PyErr_Occurred` to check for errors.
es_es: Esta función devuelve ``-1`` en caso de fallo, por lo que se debe llamar a :c:func:`PyErr_Occurred` para comprobar errores.
ru: Эта функция возвращает ``-1`` в случае сбоя, поэтому следует вызвать :c:func:`PyErr_Occurred` для проверки ошибок.

source: Compare a Unicode object with a char buffer which is interpreted as being UTF-8 or ASCII encoded and return true (``1``) if they are equal, or false (``0``) otherwise. If the Unicode object contains surrogate code points (``U+D800`` - ``U+DFFF``) or the C string is not valid UTF-8, false (``0``) is returned.
ru: Сравните объект Unicode с буфером символов, который интерпретируется как кодированный UTF-8 или ASCII, и верните true («1»), если они равны, или false («0») в противном случае. Если объект Unicode содержит суррогатные кодовые точки (``U+D800`` - ``U+DFFF``) или строка C недействительна в формате UTF-8, возвращается false (``0``).

source: This function does not raise exceptions.
es_es: Esta función no genera excepciones.
ru: Эта функция не вызывает исключений.

source: Similar to :c:func:`PyUnicode_EqualToUTF8AndSize`, but compute *string* length using :c:func:`!strlen`. If the Unicode object contains null characters, false (``0``) is returned.
ru: Аналогично :c:func:`PyUnicode_EqualToUTF8AndSize`, но длину *строки* вычисляйте, используя :c:func:`!strlen`. Если объект Unicode содержит нулевые символы, возвращается false («0»).

source: Compare a Unicode object, *unicode*, with *string* and return ``-1``, ``0``, ``1`` for less than, equal, and greater than, respectively. It is best to pass only ASCII-encoded strings, but the function interprets the input string as ISO-8859-1 if it contains non-ASCII characters.
es_es: Compara un objeto Unicode, *unicode*, con *cadena* y devuelve ``-1``, ``0``, ``1`` para menor que, igual que y mayor que, respectivamente. Es mejor pasar sólo cadenas codificadas en ASCII, pero la función interpreta la cadena de entrada como ISO-8859-1 si contiene caracteres no ASCII.
ru: Сравните объект Unicode *unicode* со *string* и верните ``-1``, ``0``, ``1`` для значений меньше, равно и больше соответственно. Лучше всего передавать только строки в кодировке ASCII, но функция интерпретирует входную строку как ISO-8859-1, если она содержит символы, отличные от ASCII.

source: Rich compare two Unicode strings and return one of the following:
es_es: Comparar dos cadenas Unicode ricas y devolver una de las siguientes opciones:
ru: Rich сравнивает две строки Юникода и возвращает одно из следующих значений:

source: ``NULL`` in case an exception was raised
es_es: ``NULL`` en caso de que se haya producido una excepción.
ru: ``NULL`` в случае возникновения исключения
