Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/unicode.po
Languages: es_es, ru

source: Setting encoding to ``NULL`` causes the default encoding to be used which is UTF-8. The file system calls should use :c:func:`PyUnicode_FSConverter` for encoding file names. This uses the :term:`filesystem encoding and error handler` internally.
es_es: Establecer la codificación en ``NULL`` hace que se utilice la codificación por defecto, que es UTF-8. Las llamadas al sistema de ficheros deben utilizar :c:func:`PyUnicode_FSConverter` para codificar los nombres de fichero. Esto utiliza el :term:`filesystem encoding and error handler` internamente.
ru: Установка для кодировки значения ``NULL`` приводит к использованию кодировки по умолчанию - UTF-8. Вызовы файловой системы должны использовать :c:func:`PyUnicode_FSConverter` для кодирования имен файлов. При этом используется внутренняя кодировка файловой системы и обработчик ошибок.

source: Error handling is set by errors which may also be set to ``NULL`` meaning to use the default handling defined for the codec. Default error handling for all built-in codecs is "strict" (:exc:`ValueError` is raised).
es_es: El manejo de errores se establece mediante errores que también pueden establecerse como ``NULL``, lo que significa usar el manejo predeterminado definido para el códec. El manejo de errores predeterminado para todos los códecs incorporados es "estricto" (se genera :exc:`ValueError`).
ru: Обработка ошибок задается ошибками, для которых также может быть установлено значение NULL, что означает использование обработки по умолчанию, определенной для кодека. Обработка ошибок по умолчанию для всех встроенных кодеков является «строгой» (возникает:exc:`ValueError`).

source: The codecs all use a similar interface. Only deviations from the following generic ones are documented for simplicity.
es_es: Los codecs utilizan todos una interfaz similar. Solo se documentan las desviaciones de las siguientes genéricas por simplicidad.
ru: Все кодеки используют схожий интерфейс. Для простоты документированы только отклонения от следующих общих значений.

source: Generic Codecs
es_es: Códecs genéricos
ru: Универсальные кодеки

source: These are the generic codec APIs:
es_es: Estas son las API genéricas de los códecs:
ru: Это общие API-интерфейсы кодеков:

source: Create a Unicode object by decoding *size* bytes of the encoded string *str*. *encoding* and *errors* have the same meaning as the parameters of the same name in the :func:`str` built-in function. The codec to be used is looked up using the Python codec registry. Return ``NULL`` if an exception was raised by the codec.
es_es: Crea un objeto Unicode descodificando *size* bytes de la cadena codificada *str*. *encoding* y *errors* tienen el mismo significado que los parámetros del mismo nombre en la función incorporada :func:`str`. El códec a utilizar se busca utilizando el registro de códecs de Python. Devuelve ``NULL`` si el códec ha lanzado una excepción.
ru: Создайте объект Unicode, декодировав *size* байты закодированной строки *str*. *encoding* и *errors* имеют то же значение, что и одноименные параметры во встроенной функции :func:`str`. Кодек, который будет использоваться, ищется в реестре кодеков Python. Верните NULL, если кодек вызвал исключение.

source: Encode a Unicode object and return the result as Python bytes object. *encoding* and *errors* have the same meaning as the parameters of the same name in the Unicode :meth:`~str.encode` method. The codec to be used is looked up using the Python codec registry. Return ``NULL`` if an exception was raised by the codec.
es_es: Codifica un objeto Unicode y devuelve el resultado como un objeto bytes de Python. *encoding* y *errors* tienen el mismo significado que los parámetros del mismo nombre en el método :meth:`~str.encode` de Unicode. El códec a utilizar se busca en el registro de códecs de Python. Devuelve ``NULL`` si se produjo una excepción en el códec.
ru: Закодируйте объект Unicode и верните результат как объект байтов Python. *encoding* и *errors* имеют то же значение, что и одноименные параметры в методе Unicode :meth:`~str.encode`. Кодек, который будет использоваться, ищется в реестре кодеков Python. Верните NULL, если кодек вызвал исключение.

source: UTF-8 Codecs
es_es: Códecs UTF-8
ru: Кодеки UTF-8

source: These are the UTF-8 codec APIs:
es_es: Estas son las API de códecs UTF-8:
ru: Это API-интерфейсы кодека UTF-8:

source: Create a Unicode object by decoding *size* bytes of the UTF-8 encoded string *str*. Return ``NULL`` if an exception was raised by the codec.
es_es: Crea un objeto Unicode decodificando *size* bytes de la cadena codificada en UTF-8 *str*. Devuelve ``NULL`` si el códec ha lanzado una excepción.
ru: Создайте объект Unicode, декодировав *size* байты строки *str* в кодировке UTF-8. Верните NULL, если кодек вызвал исключение.

source: If *consumed* is ``NULL``, behave like :c:func:`PyUnicode_DecodeUTF8`. If *consumed* is not ``NULL``, trailing incomplete UTF-8 byte sequences will not be treated as an error. Those bytes will not be decoded and the number of bytes that have been decoded will be stored in *consumed*.
es_es: Si *consumed* es ``NULL``, comportarse como :c:func:`PyUnicode_DecodeUTF8`. Si *consumed* no es ``NULL``, las secuencias de bytes UTF-8 incompletas al final no se tratarán como un error. Esos bytes no se decodificarán y el número de bytes que se han decodificado se almacenará en *consumed*.
ru: Если *consumed* равно NULL, ведите себя как :c:func:`PyUnicode_DecodeUTF8`. Если *consumed* не равно NULL, конечные неполные последовательности байтов UTF-8 не будут рассматриваться как ошибка. Эти байты не будут декодированы, а количество декодированных байтов будет сохранено в *consumed*.

source: Encode a Unicode object using UTF-8 and return the result as Python bytes object. Error handling is "strict". Return ``NULL`` if an exception was raised by the codec.
es_es: Codifica un objeto Unicode utilizando UTF-8 y devuelve el resultado como un objeto de bytes de Python. El manejo de errores es "estricto". Devuelve ``NULL`` si se produjo una excepción por parte del códec.
ru: Закодируйте объект Unicode, используя UTF-8, и верните результат как объект байтов Python. Обработка ошибок является «строгой». Верните NULL, если кодек вызвал исключение.

source: The function fails if the string contains surrogate code points (``U+D800`` - ``U+DFFF``).
ru: Функция завершается ошибкой, если строка содержит суррогатные кодовые точки (``U+D800`` - ``U+DFFF``).

source: Return a pointer to the UTF-8 encoding of the Unicode object, and store the size of the encoded representation (in bytes) in *size*. The *size* argument can be ``NULL``; in this case no size will be stored. The returned buffer always has an extra null byte appended (not included in *size*), regardless of whether there are any other null code points.
es_es: Devuelve un puntero a la codificación UTF-8 del objeto Unicode y almacena el tamaño de la representación codificada (en bytes) en *size*. El argumento *size* puede ser ``NULL``; en este caso no se almacenará ningún tamaño. El búfer devuelto siempre tiene un byte nulo adicional al final (no incluido en *size*), independientemente de si hay otros puntos de código nulos.
ru: Верните указатель на кодировку UTF-8 объекта Unicode и сохраните размер закодированного представления (в байтах) в *size*. Аргумент *size* может иметь значение ``NULL``; в этом случае размер не будет сохранен. К возвращаемому буферу всегда добавляется дополнительный нулевой байт (не включенный в *size*), независимо от того, есть ли какие-либо другие нулевые кодовые точки.

source: On error, set an exception, set *size* to ``-1`` (if it's not NULL) and return ``NULL``.
ru: В случае ошибки установите исключение, установите для *size* значение ``-1`` (если оно не NULL) и верните ``NULL``.

source: This caches the UTF-8 representation of the string in the Unicode object, and subsequent calls will return a pointer to the same buffer. The caller is not responsible for deallocating the buffer. The buffer is deallocated and pointers to it become invalid when the Unicode object is garbage collected.
es_es: Esto almacena en caché la representación UTF-8 de la cadena en el objeto Unicode, y las llamadas posteriores devolverán un puntero al mismo búfer. La persona que realiza la llamada no es responsable de desasignar el búfer. El búfer se desasigna y los punteros al mismo pierden su validez cuando el objeto Unicode es recolectado.
ru: При этом представление строки в формате UTF-8 кэшируется в объекте Unicode, а последующие вызовы будут возвращать указатель на тот же буфер. Вызывающий не несет ответственности за освобождение буфера. Буфер освобождается, и указатели на него становятся недействительными, когда объект Unicode очищается от мусора.

source: The return type is now ``const char *`` rather of ``char *``.
es_es: El tipo de retorno es ahora ``const char *`` en lugar de ``char *``.
ru: Тип возвращаемого значения теперь ``const char *``, а не ``char *``.

source: This function is a part of the :ref:`limited API <limited-c-api>`.
es_es: Esta función forma parte de :ref:`limited API <limited-c-api>`.
ru: Эта функция является частью :ref:`limited API <limited-c-api>`.

source: As :c:func:`PyUnicode_AsUTF8AndSize`, but does not store the size.
es_es: Como :c:func:`PyUnicode_AsUTF8AndSize`, pero no almacena el tamaño.
ru: Как :c:func:`PyUnicode_AsUTF8AndSize`, но размер не сохраняется.

source: This function does not have any special behavior for `null characters <https://en.wikipedia.org/wiki/Null_character>`_ embedded within *unicode*. As a result, strings containing null characters will remain in the returned string, which some C functions might interpret as the end of the string, leading to truncation. If truncation is an issue, it is recommended to use :c:func:`PyUnicode_AsUTF8AndSize` instead.
ru: Эта функция не имеет особого поведения для `нулевых символов <https://en.wikipedia.org/wiki/null_character>` _ встроено в *Unicode *. В результате строки, содержащие нулевые символы, останутся в возвращенной строке, которую некоторые функции C могут интерпретировать как конец строки, что приведет к усечению. Если усечение является проблемой, рекомендуется использовать: C: Func: `pyunicode_asutf8 и размер

source: UTF-32 Codecs
es_es: Códecs UTF-32
ru: Кодеки UTF-32

source: These are the UTF-32 codec APIs:
es_es: Estas son las API de códecs UTF-32:
ru: Это API-интерфейсы кодека UTF-32:

source: Decode *size* bytes from a UTF-32 encoded buffer string and return the corresponding Unicode object. *errors* (if non-``NULL``) defines the error handling. It defaults to "strict".
es_es: Decodifica *size* de bytes de una cadena de búfer codificada en UTF-32 y devuelve el objeto Unicode correspondiente. *errors* (si no es``NULL``) define el tratamiento de errores. Por defecto es "strict".
ru: Декодируйте *size* байты из буферной строки в кодировке UTF-32 и верните соответствующий объект Unicode. *errors* (если не NULL) определяет обработку ошибок. По умолчанию установлено значение «строгое».

source: If *byteorder* is non-``NULL``, the decoder starts decoding using the given byte order::
es_es: Si *byteorder* no es``NULL``, el descodificador empieza a descodificar utilizando el orden de bytes dado::
ru: Если *byteorder* не равен NULL, декодер начинает декодирование, используя заданный порядок байтов:

source: If ``*byteorder`` is zero, and the first four bytes of the input data are a byte order mark (BOM), the decoder switches to this byte order and the BOM is not copied into the resulting Unicode string. If ``*byteorder`` is ``-1`` or ``1``, any byte order mark is copied to the output.
es_es: Si ``*byteorder`` es cero, y los cuatro primeros bytes de los datos de entrada son una marca de orden de bytes (BOM), el descodificador cambia a este orden de bytes y la BOM no se copia en la cadena Unicode resultante. Si ``*byteorder`` es ``-1`` o ``1``, cualquier marca de orden de bytes se copia en la salida.
ru: Если ``*byteorder`` равен нулю, а первые четыре байта входных данных представляют собой метку порядка байтов (BOM), декодер переключается на этот порядок байтов, и BOM не копируется в результирующую строку Unicode. Если ``*byteorder`` равен ``-1`` или ``1``, любая метка порядка байтов копируется на выход.

source: After completion, *\*byteorder* is set to the current byte order at the end of input data.
es_es: Tras la finalización, *\*byteorder* se establece en el orden actual de bytes al final de los datos de entrada.
ru: После завершения *\*byteorder* устанавливается на текущий порядок байтов в конце входных данных.

source: If *byteorder* is ``NULL``, the codec starts in native order mode.
es_es: Si *byteorder* es ``NULL``, el códec se inicia en modo de orden nativo.
ru: Если *byteorder* имеет значение ``NULL``, кодек запускается в собственном режиме порядка.

source: Return ``NULL`` if an exception was raised by the codec.
es_es: Devuelve ``NULL`` si el códec ha lanzado una excepción.
ru: Верните NULL, если кодек вызвал исключение.

source: If *consumed* is ``NULL``, behave like :c:func:`PyUnicode_DecodeUTF32`. If *consumed* is not ``NULL``, :c:func:`PyUnicode_DecodeUTF32Stateful` will not treat trailing incomplete UTF-32 byte sequences (such as a number of bytes not divisible by four) as an error. Those bytes will not be decoded and the number of bytes that have been decoded will be stored in *consumed*.
es_es: Si *consumed* es ``NULL``, se comportará como :c:func:`PyUnicode_DecodeUTF32`. Si *consumed* no es ``NULL``, :c:func:`PyUnicode_DecodeUTF32Stateful` no tratará las secuencias de bytes UTF-32 incompletas (como un número de bytes no divisible por cuatro) como un error. Esos bytes no serán decodificados y el número de bytes que han sido decodificados será almacenado en *consumed*.
ru: Если *consumed* равно NULL, ведите себя как :c:func:`PyUnicode_DecodeUTF32`. Если *consumed* не равно NULL, :c:func:`PyUnicode_DecodeUTF32Stateful` не будет рассматривать конечные неполные последовательности байтов UTF-32 (например, количество байтов, не делящихся на четыре) как ошибку. Эти байты не будут декодированы, а количество декодированных байтов будет сохранено в *consumed*.

source: Return a Python byte string using the UTF-32 encoding in native byte order. The string always starts with a BOM mark. Error handling is "strict". Return ``NULL`` if an exception was raised by the codec.
es_es: Devuelve una cadena de bytes Python utilizando la codificación UTF-32 en orden nativo de bytes. La cadena siempre comienza con una marca BOM. El tratamiento de errores es "estricto". Devuelve ``NULL`` si el códec ha lanzado una excepción.
ru: Возвращает строку байтов Python, используя кодировку UTF-32 в собственном порядке байтов. Строка всегда начинается с метки спецификации. Обработка ошибок является «строгой». Верните NULL, если кодек вызвал исключение.

source: UTF-16 Codecs
es_es: Códecs UTF-16
ru: Кодеки UTF-16

source: These are the UTF-16 codec APIs:
es_es: Estas son las APIs de codec UTF-16.
ru: Это API-интерфейсы кодека UTF-16:

source: Decode *size* bytes from a UTF-16 encoded buffer string and return the corresponding Unicode object. *errors* (if non-``NULL``) defines the error handling. It defaults to "strict".
es_es: Decodifica *size* de bytes de una cadena de búfer codificada en UTF-16 y devuelve el objeto Unicode correspondiente. *errors* (si no es``NULL``) define el tratamiento de errores. Por defecto es "strict".
ru: Декодируйте *size* байты из буферной строки в кодировке UTF-16 и верните соответствующий объект Unicode. *errors* (если не NULL) определяет обработку ошибок. По умолчанию установлено значение «строгое».

source: If ``*byteorder`` is zero, and the first two bytes of the input data are a byte order mark (BOM), the decoder switches to this byte order and the BOM is not copied into the resulting Unicode string. If ``*byteorder`` is ``-1`` or ``1``, any byte order mark is copied to the output (where it will result in either a ``\ufeff`` or a ``\ufffe`` character).
es_es: Si ``*byteorder`` es cero, y los dos primeros bytes de los datos de entrada son una marca de orden de bytes (BOM), el descodificador cambia a este orden de bytes y la BOM no se copia en la cadena Unicode resultante. Si ``*byteorder`` es ``-1`` o ``1``, cualquier marca de orden de bytes se copia a la salida (donde dará como resultado un carácter ``\ufeff`` o ``\ufffe`` ).
ru: Если ``*byteorder`` равен нулю, а первые два байта входных данных представляют собой метку порядка байтов (BOM), декодер переключается на этот порядок байтов, и BOM не копируется в результирующую строку Unicode. Если ``*byteorder`` равен ``-1`` или ``1``, любая метка порядка байтов копируется на выход (где это приведет либо к ``\ufeff``, либо к ``\ufffe `` персонаж).

source: After completion, ``*byteorder`` is set to the current byte order at the end of input data.
es_es: Tras la finalización, ``*byteorder`` se establece en el orden actual de bytes al final de los datos de entrada.
ru: После завершения ``*byteorder`` устанавливается на текущий порядок байтов в конце входных данных.

source: If *consumed* is ``NULL``, behave like :c:func:`PyUnicode_DecodeUTF16`. If *consumed* is not ``NULL``, :c:func:`PyUnicode_DecodeUTF16Stateful` will not treat trailing incomplete UTF-16 byte sequences (such as an odd number of bytes or a split surrogate pair) as an error. Those bytes will not be decoded and the number of bytes that have been decoded will be stored in *consumed*.
es_es: Si *consumed* es ``NULL``, se comporta como :c:func:`PyUnicode_DecodeUTF16`. Si *consumed* no es ``NULL``, :c:func:`PyUnicode_DecodeUTF16Stateful` no tratará las secuencias de bytes UTF-16 incompletas (como un número impar de bytes o un par de sustitutos dividido) como un error. Esos bytes no serán decodificados y el número de bytes que han sido decodificados será almacenado en *consumed*.
ru: Если *consumed* равно NULL, ведите себя как :c:func:`PyUnicode_DecodeUTF16`. Если *consumed* не равно ``NULL``, :c:func:`PyUnicode_DecodeUTF16Stateful` не будет рассматривать конечные неполные последовательности байтов UTF-16 (например, нечетное число байтов или разделенную суррогатную пару) как ошибку. Эти байты не будут декодированы, а количество декодированных байтов будет сохранено в *consumed*.

source: Return a Python byte string using the UTF-16 encoding in native byte order. The string always starts with a BOM mark. Error handling is "strict". Return ``NULL`` if an exception was raised by the codec.
es_es: Devuelve una cadena de bytes Python utilizando la codificación UTF-16 en orden nativo de bytes. La cadena siempre comienza con una marca BOM. El tratamiento de errores es "estricto". Devuelve ``NULL`` si el códec ha lanzado una excepción.
ru: Возвращает строку байтов Python, используя кодировку UTF-16 в собственном порядке байтов. Строка всегда начинается с метки спецификации. Обработка ошибок является «строгой». Верните NULL, если кодек вызвал исключение.

source: UTF-7 Codecs
es_es: Códecs UTF-7
ru: Кодеки UTF-7

source: These are the UTF-7 codec APIs:
es_es: Estas son las APIs del códec UTF-7.
ru: Это API-интерфейсы кодека UTF-7:

source: Create a Unicode object by decoding *size* bytes of the UTF-7 encoded string *str*. Return ``NULL`` if an exception was raised by the codec.
es_es: Crea un objeto Unicode decodificando *size* bytes de la cadena codificada en UTF-7 *str*. Devuelve ``NULL`` si el códec ha lanzado una excepción.
ru: Создайте объект Unicode, декодировав *size* байты строки *str* в кодировке UTF-7. Верните NULL, если кодек вызвал исключение.

source: If *consumed* is ``NULL``, behave like :c:func:`PyUnicode_DecodeUTF7`. If *consumed* is not ``NULL``, trailing incomplete UTF-7 base-64 sections will not be treated as an error. Those bytes will not be decoded and the number of bytes that have been decoded will be stored in *consumed*.
es_es: Si *consumed* es ``NULL``, se comportar como :c:func:`PyUnicode_DecodeUTF7`. Si *consumed* no es ``NULL``, las secciones incompletas de base-64 UTF-7 al final no se tratarán como un error. Esos bytes no se decodificarán y el número de bytes que se han decodificado se almacenará en *consumed*.
ru: Если *consumed* равно NULL, ведите себя как :c:func:`PyUnicode_DecodeUTF7`. Если *consumed* не равно NULL, конечные неполные разделы UTF-7 base-64 не будут рассматриваться как ошибка. Эти байты не будут декодированы, а количество декодированных байтов будет сохранено в *consumed*.

source: Unicode-Escape Codecs
ru: Кодеки Unicode-Escape

source: These are the "Unicode Escape" codec APIs:
es_es: Estas son las API del códec "Unicode Escape":
ru: Это API-интерфейсы кодека Unicode Escape:

source: Create a Unicode object by decoding *size* bytes of the Unicode-Escape encoded string *str*. Return ``NULL`` if an exception was raised by the codec.
es_es: Crea un objeto Unicode decodificando *size* bytes de la cadena *str* codificada con Unicode-Escape. Devuelve ``NULL`` si el códec ha lanzado una excepción.
ru: Создайте объект Unicode, декодировав *size* байты строки *str* в кодировке Unicode-Escape. Верните NULL, если кодек вызвал исключение.

source: Encode a Unicode object using Unicode-Escape and return the result as a bytes object. Error handling is "strict". Return ``NULL`` if an exception was raised by the codec.
es_es: Codifica un objeto Unicode utilizando Unicode-Escape y devuelve el resultado como un objeto de bytes. El manejo de errores es "estricto". Devuelve ``NULL`` si se produjo una excepción por el códec.
ru: Закодируйте объект Unicode с помощью Unicode-Escape и верните результат в виде байтового объекта. Обработка ошибок является «строгой». Верните NULL, если кодек вызвал исключение.

source: Raw-Unicode-Escape Codecs
es_es: Códecs Raw-Unicode-Escape
ru: Кодеки Raw-Unicode-Escape

source: These are the "Raw Unicode Escape" codec APIs:
es_es: Estas son las APIs del códec "Raw Unicode Escape".
ru: Это API-интерфейсы кодека Raw Unicode Escape:

source: Create a Unicode object by decoding *size* bytes of the Raw-Unicode-Escape encoded string *str*. Return ``NULL`` if an exception was raised by the codec.
es_es: Crea un objeto Unicode decodificando *size* bytes de la cadena codificada Raw-Unicode-Escape *str*. Devuelve ``NULL`` si el códec ha lanzado una excepción.
ru: Создайте объект Unicode, декодировав *size* байты строки *str* в кодировке Raw-Unicode-Escape. Верните NULL, если кодек вызвал исключение.

source: Encode a Unicode object using Raw-Unicode-Escape and return the result as a bytes object. Error handling is "strict". Return ``NULL`` if an exception was raised by the codec.
es_es: Codifica un objeto Unicode utilizando Raw-Unicode-Escape y devuelve el resultado como un objeto de bytes. El manejo de errores es "estricto". Devuelve ``NULL`` si se produjo una excepción en el códec.
ru: Закодируйте объект Unicode с помощью Raw-Unicode-Escape и верните результат в виде байтового объекта. Обработка ошибок является «строгой». Верните NULL, если кодек вызвал исключение.

source: Latin-1 Codecs
es_es: Códecs de Latin-1
ru: Кодеки Latin-1

source: These are the Latin-1 codec APIs: Latin-1 corresponds to the first 256 Unicode ordinals and only these are accepted by the codecs during encoding.
es_es: Estas son las API del códec Latin-1: Latin-1 corresponde a los primeros 256 ordinales Unicode y solo estos son aceptados por los códecs durante la codificación.
ru: Это API-интерфейсы кодека Latin-1: Latin-1 соответствует первым 256 порядковым номерам Unicode, и только они принимаются кодеками во время кодирования.
