Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/veryhigh.po
Languages: es_es

source: The Very High Level Layer
es_es: La Capa de Nivel Muy Alto

source: The functions in this chapter will let you execute Python source code given in a file or a buffer, but they will not let you interact in a more detailed way with the interpreter.
es_es: Las funciones en este capítulo te permitirán ejecutar código fuente de Python proporcionado en un archivo o un búfer, pero no te permitirán interactuar de manera más detallada con el intérprete.

source: This is a simplified interface to :c:func:`PyRun_AnyFileExFlags` below, leaving *closeit* set to ``0`` and *flags* set to ``NULL``.
es_es: Esta es una interfaz simplificada para :c:func:`PyRun_AnyFileExFlags` a continuación, dejando *closeit* establecido en ``0`` y *flags* establecido en ``NULL``.

source: This is a simplified interface to :c:func:`PyRun_AnyFileExFlags` below, leaving the *closeit* argument set to ``0``.
es_es: Esta es una interfaz simplificada para :c:func:`PyRun_AnyFileExFlags` a continuación, dejando el argumento *closeit* establecido en ``0``.

source: This is a simplified interface to :c:func:`PyRun_AnyFileExFlags` below, leaving the *flags* argument set to ``NULL``.
es_es: Esta es una interfaz simplificada de :c:func:`PyRun_AnyFileExFlags` a continuación, dejando el argumento *flags* establecido en ``NULL``.

source: If *fp* refers to a file associated with an interactive device (console or terminal input or Unix pseudo-terminal), return the value of :c:func:`PyRun_InteractiveLoop`, otherwise return the result of :c:func:`PyRun_SimpleFile`. *filename* is decoded from the filesystem encoding (:func:`sys.getfilesystemencoding`). If *filename* is ``NULL``, this function uses ``"???"`` as the filename. If *closeit* is true, the file is closed before ``PyRun_SimpleFileExFlags()`` returns.
es_es: Si *fp* se refiere a un archivo asociado con un dispositivo interactivo (consola o entrada de terminal o pseudo-terminal de Unix), devuelve el valor de :c:func:`PyRun_InteractiveLoop`, de lo contrario devuelve el resultado de :c:func:`PyRun_SimpleFile`. *filename* se decodifica a partir de la codificación del sistema de archivos (:func:`sys.getfilesystemencoding`). Si *filename* es ``NULL``, esta función utiliza ``"???"`` como nombre de archivo. Si *closeit* es verdadero, el archivo se cierra antes de que ``PyRun_SimpleFileExFlags()`` devuelva.

source: Executes the Python source code from *command* in the :mod:`__main__` module according to the *flags* argument. If :mod:`__main__` does not already exist, it is created. Returns ``0`` on success or ``-1`` if an exception was raised. If there was an error, there is no way to get the exception information. For the meaning of *flags*, see below.
es_es: Ejecuta el código fuente de Python desde *command* en el módulo :mod:`__main__` según el argumento *flags*. Si :mod:`__main__` no existe, se crea. Devuelve ``0`` en caso de éxito o ``-1`` si se produjo una excepción. Si hubo un error, no hay forma de obtener la información de la excepción. Para el significado de *flags*, ver más abajo.

source: This is a simplified interface to :c:func:`PyRun_SimpleFileExFlags` below, leaving *closeit* set to ``0`` and *flags* set to ``NULL``.
es_es: Esta es una interfaz simplificada a :c:func:`PyRun_SimpleFileExFlags` a continuación, dejando *closeit* establecido en ``0`` y *flags* establecido en ``NULL``.

source: This is a simplified interface to :c:func:`PyRun_SimpleFileExFlags` below, leaving *flags* set to ``NULL``.
es_es: Esta es una interfaz simplificada a :c:func:`PyRun_SimpleFileExFlags` a continuación, dejando *flags* establecido en ``NULL``.

source: On Windows, *fp* should be opened as binary mode (e.g. ``fopen(filename, "rb")``). Otherwise, Python may not handle script file with LF line ending correctly.
es_es: En Windows, *fp* debe abrirse en modo binario (por ejemplo, ``fopen(filename, "rb")``). De lo contrario, Python puede no manejar correctamente el archivo de script con el final de línea LF.

source: This is a simplified interface to :c:func:`PyRun_InteractiveOneFlags` below, leaving *flags* set to ``NULL``.
es_es: Esta es una interfaz simplificada a :c:func:`PyRun_InteractiveOneFlags` a continuación, dejando *flags* establecido en ``NULL``.

source: Returns ``0`` when the input was executed successfully, ``-1`` if there was an exception, or an error code from the :file:`errcode.h` include file distributed as part of Python if there was a parse error. (Note that :file:`errcode.h` is not included by :file:`Python.h`, so must be included specifically if needed.)
es_es: Devuelve ``0`` cuando la entrada se ejecutó correctamente, ``-1`` si hubo una excepción, o un código de error del archivo de inclusión :file:`errcode.h` distribuido como parte de Python si hubo un error de análisis. (Tener en cuenta que :file:`errcode.h` no está incluido por :file:`Python.h`, por lo que, si es necesario, debe incluirse específicamente.)

source: This is a simplified interface to :c:func:`PyRun_InteractiveLoopFlags` below, leaving *flags* set to ``NULL``.
es_es: Esta es una interfaz simplificada a :c:func:`PyRun_InteractiveLoopFlags` a continuación, dejando *flags* establecido en ``NULL``.

source: Can be set to point to a function with the prototype ``int func(void)``. The function will be called when Python's interpreter prompt is about to become idle and wait for user input from the terminal. The return value is ignored. Overriding this hook can be used to integrate the interpreter's prompt with other event loops, as done in the :file:`Modules/_tkinter.c` in the Python source code.
es_es: Puede establecerse para que apunte a una función con el prototipo ``int func(void)``. La función será llamada cuando el prompt del intérprete de Python esté a punto de quedar inactivo y esperar la entrada del usuario desde la terminal. El valor de retorno se ignora. Sobreescribir este gancho puede usarse para integrar el prompt del intérprete con otros bucles de eventos, como se hace en :file:`Modules/_tkinter.c` en el código fuente de Python.

source: Can be set to point to a function with the prototype ``char *func(FILE *stdin, FILE *stdout, char *prompt)``, overriding the default function used to read a single line of input at the interpreter's prompt. The function is expected to output the string *prompt* if it's not ``NULL``, and then read a line of input from the provided standard input file, returning the resulting string. For example, The :mod:`readline` module sets this hook to provide line-editing and tab-completion features.
es_es: Puede establecerse para que apunte a una función con el prototipo ``char *func(FILE *stdin, FILE *stdout, char *prompt)``, anulando la función por defecto utilizada para leer una única línea de entrada en el prompt del intérprete. Se espera que la función muestre la cadena *prompt* si no es ``NULL``, y luego lea una línea de entrada del archivo de entrada estándar proporcionado, devolviendo la cadena resultante. Por ejemplo, el módulo :mod:`readline` establece este gancho para proporcionar funciones de edición de línea y completado de tabulación.

source: The result must be a string allocated by :c:func:`PyMem_RawMalloc` or :c:func:`PyMem_RawRealloc`, or ``NULL`` if an error occurred.
es_es: El resultado debe ser una cadena asignada por :c:func:`PyMem_RawMalloc` o :c:func:`PyMem_RawRealloc`, o ``NULL`` si ocurrió un error.

source: The result must be allocated by :c:func:`PyMem_RawMalloc` or :c:func:`PyMem_RawRealloc`, instead of being allocated by :c:func:`PyMem_Malloc` or :c:func:`PyMem_Realloc`.
es_es: El resultado debe ser asignado por :c:func:`PyMem_RawMalloc` o :c:func:`PyMem_RawRealloc`, en lugar de ser asignado por :c:func:`PyMem_Malloc` o :c:func:`PyMem_Realloc`.

source: This is a simplified interface to :c:func:`PyRun_StringFlags` below, leaving *flags* set to ``NULL``.
es_es: Esta es una interfaz simplificada a :c:func:`PyRun_StringFlags` a continuación, dejando *flags* establecido en ``NULL``.

source: Execute Python source code from *str* in the context specified by the objects *globals* and *locals* with the compiler flags specified by *flags*. *globals* must be a dictionary; *locals* can be any object that implements the mapping protocol. The parameter *start* specifies the start token that should be used to parse the source code.
es_es: Ejecutar el código fuente de Python desde *str* en el contexto especificado por los objetos *globals* y *locals* con las banderas del compilador especificadas por *flags*. *globals* debe ser un diccionario; *locals* puede ser cualquier objeto que implemente el protocolo de mapeo. El parámetro *start* especifica el token de inicio que se debe usar para analizar el código fuente.

source: Returns the result of executing the code as a Python object, or ``NULL`` if an exception was raised.
es_es: Devuelve el resultado de ejecutar el código como un objeto de Python, o ``NULL`` si se produjo una excepción.

source: This is a simplified interface to :c:func:`PyRun_FileExFlags` below, leaving *closeit* set to ``0`` and *flags* set to ``NULL``.
es_es: Esta es una interfaz simplificada a :c:func:`PyRun_FileExFlags` a continuación, dejando *closeit* establecido en ``0`` y *flags* establecido en ``NULL``.

source: This is a simplified interface to :c:func:`PyRun_FileExFlags` below, leaving *flags* set to ``NULL``.
es_es: Esta es una interfaz simplificada a :c:func:`PyRun_FileExFlags` a continuación, dejando *flags* establecido en ``NULL``.

source: This is a simplified interface to :c:func:`PyRun_FileExFlags` below, leaving *closeit* set to ``0``.
es_es: Esta es una interfaz simplificada a :c:func:`PyRun_FileExFlags` a continuación, dejando *closeit* establecido en ``0``.

source: This is a simplified interface to :c:func:`Py_CompileStringFlags` below, leaving *flags* set to ``NULL``.
es_es: Esta es una interfaz simplificada a :c:func:`Py_CompileStringFlags` a continuación, dejando *flags* establecido en ``NULL``.

source: This is a simplified interface to :c:func:`Py_CompileStringExFlags` below, with *optimize* set to ``-1``.
es_es: Esta es una interfaz simplificada a :c:func:`Py_CompileStringExFlags` a continuación, con *optimize* establecido en ``-1``.

source: The integer *optimize* specifies the optimization level of the compiler; a value of ``-1`` selects the optimization level of the interpreter as given by :option:`-O` options. Explicit levels are ``0`` (no optimization; ``__debug__`` is true), ``1`` (asserts are removed, ``__debug__`` is false) or ``2`` (docstrings are removed too).
es_es: El entero *optimize* especifica el nivel de optimización del compilador; un valor de ``-1`` selecciona el nivel de optimización del intérprete según las opciones :option:`-O`. Los niveles explícitos son ``0`` (sin optimización; ``__debug__`` es verdadero), ``1`` (se eliminan las aserciones, ``__debug__`` es falso) o ``2`` (también se eliminan las cadenas de documentación).

source: This is a simplified interface to :c:func:`PyEval_EvalCodeEx`, with just the code object, and global and local variables. The other arguments are set to ``NULL``.
es_es: Esta es una interfaz simplificada para :c:func:`PyEval_EvalCodeEx`, con solo el objeto de código y las variables globales y locales. Los otros argumentos se establecen en ``NULL``.

source: Evaluate a precompiled code object, given a particular environment for its evaluation. This environment consists of a dictionary of global variables, a mapping object of local variables, arrays of arguments, keywords and defaults, a dictionary of default values for :ref:`keyword-only <keyword-only_parameter>` arguments and a closure tuple of cells.
es_es: Evalúa un objeto de código precompilado, dado un entorno particular para su evaluación. Este entorno consiste en un diccionario de variables globales, un objeto de mapeo de variables locales, matrices de argumentos, palabras clave y valores por defecto, un diccionario de valores por defecto para argumentos :ref:`keyword-only <keyword-only_parameter>` y una tupla de cierre de celdas.

source: Evaluate an execution frame. This is a simplified interface to :c:func:`PyEval_EvalFrameEx`, for backward compatibility.
es_es: Evaluar un marco de ejecución. Esta es una interfaz simplificada a :c:func:`PyEval_EvalFrameEx`, para compatibilidad hacia atrás.

source: This is the main, unvarnished function of Python interpretation. The code object associated with the execution frame *f* is executed, interpreting bytecode and executing calls as needed. The additional *throwflag* parameter can mostly be ignored - if true, then it causes an exception to immediately be thrown; this is used for the :meth:`~generator.throw` methods of generator objects.
es_es: Esta es la función principal y sin adornos de la interpretación de Python. El objeto de código asociado al marco de ejecución *f* se ejecuta, interpretando el bytecode y realizando llamadas según sea necesario. El parámetro adicional *throwflag* en su mayoría puede ser ignorado: si es verdadero, provoca que se lance inmediatamente una excepción; esto se utiliza para los métodos :meth:`~generator.throw` de los objetos generador.

source: This function now includes a debug assertion to help ensure that it does not silently discard an active exception.
es_es: Esta función incluye ahora una aserción de depuración para ayudar a garantizar que no descarta silenciosamente una excepción activa.

source: This function changes the flags of the current evaluation frame, and returns true on success, false on failure.
es_es: Esta función cambia las banderas del marco de evaluación actual y devuelve true en caso de éxito, false en caso de fallo.

source: The start symbol from the Python grammar for isolated expressions; for use with :c:func:`Py_CompileString`.
es_es: El símbolo de inicio de la gramática de Python para expresiones aisladas; para usar con :c:func:`Py_CompileString`.

source: The start symbol from the Python grammar for sequences of statements as read from a file or other source; for use with :c:func:`Py_CompileString`. This is the symbol to use when compiling arbitrarily long Python source code.
es_es: El símbolo de inicio de la gramática de Python para secuencias de declaraciones leídas desde un archivo u otra fuente; para usar con :c:func:`Py_CompileString`. Este es el símbolo que se utiliza al compilar código fuente de Python arbitrariamente largo.

source: The start symbol from the Python grammar for a single statement; for use with :c:func:`Py_CompileString`. This is the symbol used for the interactive interpreter loop.
es_es: El símbolo de inicio de la gramática de Python para una sola declaración; para usar con :c:func:`Py_CompileString`. Este es el símbolo utilizado para el bucle del intérprete interactivo.

source: This is the structure used to hold compiler flags. In cases where code is only being compiled, it is passed as ``int flags``, and in cases where code is being executed, it is passed as ``PyCompilerFlags *flags``. In this case, ``from __future__ import`` can modify *flags*.
es_es: Esta es la estructura utilizada para mantener las banderas del compilador. En los casos en los que el código sólo se compila, se pasa como ``int flags``, y en los casos en los que el código se ejecuta, se pasa como ``PyCompilerFlags *flags``. En este caso, ``from __future__ import`` puede modificar *flags*.

source: Compiler flags.
es_es: Banderas del compilador.

source: *cf_feature_version* is the minor Python version. It should be initialized to ``PY_MINOR_VERSION``.
es_es: *cf_feature_version* es la versión menor de Python. Debe inicializarse en ``PY_MINOR_VERSION``.

source: Added *cf_feature_version* field.
es_es: Añadido el campo *cf_feature_version*.

source: This bit can be set in *flags* to cause division operator ``/`` to be interpreted as "true division" according to :pep:`238`.
es_es: Este fragmento se puede establecer en *flags* para hacer que el operador de división ``/`` se interprete como "división verdadera" según :pep:`238`.
