Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/c-api/weakref.po
Languages: ru

source: Weak Reference Objects
ru: Слабые эталонные объекты

source: Python supports *weak references* as first-class objects. There are two specific object types which directly implement weak references. The first is a simple reference object, and the second acts as a proxy for the original object as much as it can.
ru: Python поддерживает *слабые ссылки* как первоклассные объекты. Существует два конкретных типа объектов, которые напрямую реализуют слабые ссылки. Первый представляет собой простой ссылочный объект, а второй действует как прокси исходного объекта, насколько это возможно.

source: Return non-zero if *ob* is either a reference or proxy object. This function always succeeds.
ru: Возвращает ненулевое значение, если *ob* является ссылкой или прокси-объектом. Эта функция всегда завершается успешно.

source: Return non-zero if *ob* is a reference object. This function always succeeds.
ru: Возвращает ненулевое значение, если *ob* является ссылочным объектом. Эта функция всегда завершается успешно.

source: Return non-zero if *ob* is a proxy object. This function always succeeds.
ru: Возвращает ненулевое значение, если *ob* является прокси-объектом. Эта функция всегда завершается успешно.

source: Return a weak reference object for the object *ob*. This will always return a new reference, but is not guaranteed to create a new object; an existing reference object may be returned. The second parameter, *callback*, can be a callable object that receives notification when *ob* is garbage collected; it should accept a single parameter, which will be the weak reference object itself. *callback* may also be ``None`` or ``NULL``. If *ob* is not a weakly referenceable object, or if *callback* is not callable, ``None``, or ``NULL``, this will return ``NULL`` and raise :exc:`TypeError`.
ru: Возвращает объект слабой ссылки для объекта *ob*. Это всегда будет возвращать новую ссылку, но не гарантируется создание нового объекта; может быть возвращен существующий ссылочный объект. Второй параметр, *callback*, может быть вызываемым объектом, который получает уведомление, когда *ob* собирается мусор; он должен принимать один параметр, который будет самим объектом слабой ссылки. *callback* также может быть ``None`` или ``NULL``. Если *ob* не является объектом со слабой ссылкой или если *callback* не вызывается, ``None`` или ``NULL``, это вернет ``NULL`` и вызовет :exc:`TypeError`.

source: Return a weak reference proxy object for the object *ob*. This will always return a new reference, but is not guaranteed to create a new object; an existing proxy object may be returned. The second parameter, *callback*, can be a callable object that receives notification when *ob* is garbage collected; it should accept a single parameter, which will be the weak reference object itself. *callback* may also be ``None`` or ``NULL``. If *ob* is not a weakly referenceable object, or if *callback* is not callable, ``None``, or ``NULL``, this will return ``NULL`` and raise :exc:`TypeError`.
ru: Возвращает прокси-объект слабой ссылки для объекта *ob*. Это всегда будет возвращать новую ссылку, но не гарантируется создание нового объекта; может быть возвращен существующий прокси-объект. Второй параметр, *callback*, может быть вызываемым объектом, который получает уведомление, когда *ob* собирается мусор; он должен принимать один параметр, который будет самим объектом слабой ссылки. *callback* также может быть ``None`` или ``NULL``. Если *ob* не является объектом со слабой ссылкой или если *callback* не вызывается, ``None`` или ``NULL``, это вернет ``NULL`` и вызовет :exc:`TypeError`.

source: Get a :term:`strong reference` to the referenced object from a weak reference, *ref*, into *\*pobj*.
ru: Получите :term:`сильную ссылку` на объект, на который ссылаетесь, из слабой ссылки *ref* в *\*pobj*.

source: On success, set *\*pobj* to a new :term:`strong reference` to the referenced object and return 1.
ru: В случае успеха установите для *\*pobj* новую :term:`strong ссылку` на объект, на который ссылаетесь, и верните 1.

source: If the reference is dead, set *\*pobj* to ``NULL`` and return 0.
ru: Если ссылка мертва, установите для *\*pobj* значение ``NULL`` и верните 0.

source: On error, raise an exception and return -1.
ru: В случае ошибки вызвать исключение и вернуть -1.

source: Return a :term:`borrowed reference` to the referenced object from a weak reference, *ref*. If the referent is no longer live, returns ``Py_None``.
ru: Возвращает :term:`заимствованную ссылку` на объект, на который ссылается, из слабой ссылки *ref*. Если референт больше не активен, возвращается Py_None.

source: This function returns a :term:`borrowed reference` to the referenced object. This means that you should always call :c:func:`Py_INCREF` on the object except when it cannot be destroyed before the last usage of the borrowed reference.
ru: Эта функция возвращает заимствованную ссылку на объект, на который ссылается. Это означает, что вы всегда должны вызывать :c:func:`Py_INCREF` для объекта, за исключением случаев, когда он не может быть уничтожен до последнего использования заимствованной ссылки.

source: Use :c:func:`PyWeakref_GetRef` instead.
ru: Вместо этого используйте :c:func:`PyWeakref_GetRef`.

source: Similar to :c:func:`PyWeakref_GetObject`, but does no error checking.
ru: Аналогично :c:func:`PyWeakref_GetObject`, но не выполняет проверку ошибок.

source: This function is called by the :c:member:`~PyTypeObject.tp_dealloc` handler to clear weak references.
ru: Эта функция вызывается обработчиком :c:member:`~PyTypeObject.tp_dealloc` для очистки слабых ссылок.

source: This iterates through the weak references for *object* and calls callbacks for those references which have one. It returns when all callbacks have been attempted.
ru: Это перебирает слабые ссылки для *object* и вызывает обратные вызовы для тех ссылок, у которых они есть. Он возвращается, когда были предприняты все попытки обратного вызова.

source: Clears the weakrefs for *object* without calling the callbacks.
ru: Очищает слабые ссылки для *object* без вызова обратных вызовов.

source: This function is called by the :c:member:`~PyTypeObject.tp_dealloc` handler for types with finalizers (i.e., :meth:`~object.__del__`). The handler for those objects first calls :c:func:`PyObject_ClearWeakRefs` to clear weakrefs and call their callbacks, then the finalizer, and finally this function to clear any weakrefs that may have been created by the finalizer.
ru: Эта функция вызывается обработчиком :c:member:`~PyTypeObject.tp_dealloc` для типов с финализаторами (т. е. :meth:`~object.__del__`). Обработчик этих объектов сначала вызывает :c:func:` PyObj ect_ClearWeakRefs`, чтобы очистить слабые ссылки и вызвать их обратные вызовы, затем финализатор и, наконец, эту функцию, чтобы очистить все слабые ссылки, которые могли быть созданы финализатором.

source: In most circumstances, it's more appropriate to use :c:func:`PyObject_ClearWeakRefs` to clear weakrefs instead of this function.
ru: В большинстве случаев для очистки слабых ссылок более уместно использовать :c:func:` PyObj ect_ClearWeakRefs` вместо этой функции.
