Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/extending/extending.po
Languages: es_es

source: The big question now remains: when to use ``Py_INCREF(x)`` and ``Py_DECREF(x)``? Let's first introduce some terms. Nobody "owns" an object; however, you can :dfn:`own a reference` to an object. An object's reference count is now defined as the number of owned references to it. The owner of a reference is responsible for calling :c:func:`Py_DECREF` when the reference is no longer needed. Ownership of a reference can be transferred. There are three ways to dispose of an owned reference: pass it on, store it, or call :c:func:`Py_DECREF`. Forgetting to dispose of an owned reference creates a memory leak.
es_es: La gran pregunta sigue siendo: ¿cuándo utilizar ``Py_INCREF(x)`` y ``Py_DECREF(x)``? Introduzcamos primero algunos términos. Nadie "posee" un objeto; sin embargo, puedes :dfn:`poseer una referencia` a un objeto. El recuento de referencias de un objeto se define ahora como el número de referencias propias a él. El propietario de una referencia es responsable de llamar a :c:func:`Py_DECREF` cuando la referencia ya no sea necesaria. La propiedad de una referencia puede transferirse. Hay tres formas de deshacerse de una referencia propia: transferirla, almacenarla o llamar a :c:func:`Py_DECREF`. Olvidar deshacerse de una referencia propia crea una fuga de memoria.

source: It is also possible to :dfn:`borrow` [#]_ a reference to an object. The borrower of a reference should not call :c:func:`Py_DECREF`. The borrower must not hold on to the object longer than the owner from which it was borrowed. Using a borrowed reference after the owner has disposed of it risks using freed memory and should be avoided completely [#]_.
es_es: También es posible :dfn:`prestar` [#]_ una referencia a un objeto. El prestatario de una referencia no debe llamar a :c:func:`Py_DECREF`. El prestatario no debe retener el objeto más tiempo que el propietario del que lo tomó prestado. Usar una referencia prestada después de que el propietario se haya deshecho de ella conlleva el riesgo de usar memoria liberada y debe evitarse completamente [#]_.

source: The advantage of borrowing over owning a reference is that you don't need to take care of disposing of the reference on all possible paths through the code --- in other words, with a borrowed reference you don't run the risk of leaking when a premature exit is taken. The disadvantage of borrowing over owning is that there are some subtle situations where in seemingly correct code a borrowed reference can be used after the owner from which it was borrowed has in fact disposed of it.
es_es: La ventaja de tomar prestada una referencia frente a poseerla es que no es necesario ocuparse de deshacerse de la referencia en todos los caminos posibles a través del código --- en otras palabras, con una referencia prestada no se corre el riesgo de fugas cuando se toma una salida prematura. La desventaja de pedir prestado sobre poseer es que hay algunas situaciones sutiles en las que en código aparentemente correcto una referencia prestada puede ser usada después de que el propietario del que fue prestada se haya deshecho de ella.

source: A borrowed reference can be changed into an owned reference by calling :c:func:`Py_INCREF`. This does not affect the status of the owner from which the reference was borrowed --- it creates a new owned reference, and gives full owner responsibilities (the new owner must dispose of the reference properly, as well as the previous owner).
es_es: Una referencia prestada puede convertirse en una referencia propia llamando a :c:func:`Py_INCREF`. Esto no afecta al estado del propietario del que se tomó prestada la referencia, sino que crea una nueva referencia propia y le otorga plenas responsabilidades (el nuevo propietario debe deshacerse de la referencia correctamente, al igual que el propietario anterior).

source: Ownership Rules
es_es: Normas de propiedad

source: Whenever an object reference is passed into or out of a function, it is part of the function's interface specification whether ownership is transferred with the reference or not.
es_es: Siempre que se pase una referencia de objeto dentro o fuera de una función, forma parte de la especificación de la interfaz de la función si la propiedad se transfiere con la referencia o no.

source: Most functions that return a reference to an object pass on ownership with the reference. In particular, all functions whose function it is to create a new object, such as :c:func:`PyLong_FromLong` and :c:func:`Py_BuildValue`, pass ownership to the receiver. Even if the object is not actually new, you still receive ownership of a new reference to that object. For instance, :c:func:`PyLong_FromLong` maintains a cache of popular values and can return a reference to a cached item.
es_es: La mayoría de las funciones que devuelven una referencia a un objeto pasan la propiedad con la referencia. En particular, todas las funciones cuya función es crear un nuevo objeto, como :c:func:`PyLong_FromLong` y :c:func:`Py_BuildValue`, pasan la propiedad al receptor. Incluso si el objeto no es realmente nuevo, sigues recibiendo la propiedad de una nueva referencia a ese objeto. Por ejemplo, :c:func:`PyLong_FromLong` mantiene una caché de valores populares y puede devolver una referencia a un elemento almacenado en caché.

source: Many functions that extract objects from other objects also transfer ownership with the reference, for instance :c:func:`PyObject_GetAttrString`. The picture is less clear, here, however, since a few common routines are exceptions: :c:func:`PyTuple_GetItem`, :c:func:`PyList_GetItem`, :c:func:`PyDict_GetItem`, and :c:func:`PyDict_GetItemString` all return references that you borrow from the tuple, list or dictionary.
es_es: Muchas funciones que extraen objetos de otros objetos también transfieren la propiedad con la referencia, por ejemplo :c:func:`PyObject_GetAttrString`. Sin embargo, aquí el panorama es menos claro, ya que algunas rutinas comunes son excepciones: :c:func:`PyTuple_GetItem`, :c:func:`PyList_GetItem`, :c:func:`PyDict_GetItem`, y :c:func:`PyDict_GetItemString` todas devuelven referencias que se toman prestadas de la tupla, lista o diccionario.

source: The function :c:func:`PyImport_AddModule` also returns a borrowed reference, even though it may actually create the object it returns: this is possible because an owned reference to the object is stored in ``sys.modules``.
es_es: La función :c:func:`PyImport_AddModule` también devuelve una referencia prestada, aunque en realidad puede crear el objeto que devuelve: esto es posible porque en ``sys.modules`` se almacena una referencia propia al objeto.

source: When you pass an object reference into another function, in general, the function borrows the reference from you --- if it needs to store it, it will use :c:func:`Py_INCREF` to become an independent owner. There are exactly two important exceptions to this rule: :c:func:`PyTuple_SetItem` and :c:func:`PyList_SetItem`. These functions take over ownership of the item passed to them --- even if they fail! (Note that :c:func:`PyDict_SetItem` and friends don't take over ownership --- they are "normal.")
es_es: Cuando pasas una referencia de objeto a otra función, en general, la función toma prestada la referencia de ti --- si necesita almacenarla, utilizará :c:func:`Py_INCREF` para convertirse en propietario independiente. Hay exactamente dos excepciones importantes a esta regla: :c:func:`PyTuple_SetItem` y :c:func:`PyList_SetItem`. Estas funciones asumen la propiedad del elemento que se les pasa, ¡incluso si fallan! (Tenga en cuenta que :c:func:`PyDict_SetItem` y sus amigos no asumen la propiedad --- son "normales").

source: When a C function is called from Python, it borrows references to its arguments from the caller. The caller owns a reference to the object, so the borrowed reference's lifetime is guaranteed until the function returns. Only when such a borrowed reference must be stored or passed on, it must be turned into an owned reference by calling :c:func:`Py_INCREF`.
es_es: Cuando se llama a una función C desde Python, ésta toma prestadas del llamante las referencias a sus argumentos. El invocador posee una referencia al objeto, por lo que el tiempo de vida de la referencia prestada está garantizado hasta que la función retorna. Sólo cuando una referencia prestada se deba almacenar o transferir, se debe convertir en una referencia propia llamando a :c:func:`Py_INCREF`.

source: The object reference returned from a C function that is called from Python must be an owned reference --- ownership is transferred from the function to its caller.
es_es: La referencia al objeto devuelta desde una función C que es llamada desde Python debe ser una referencia de propiedad: la propiedad se transfiere desde la función a su llamador.

source: Thin Ice
es_es: Hielo fino

source: There are a few situations where seemingly harmless use of a borrowed reference can lead to problems. These all have to do with implicit invocations of the interpreter, which can cause the owner of a reference to dispose of it.
es_es: Hay algunas situaciones en las que el uso aparentemente inofensivo de una referencia prestada puede llevar a problemas. Todas estas tienen que ver con invocaciones implícitas del intérprete, que pueden hacer que el propietario de una referencia la deseche.

source: The first and most important case to know about is using :c:func:`Py_DECREF` on an unrelated object while borrowing a reference to a list item. For instance::
es_es: El primer caso, y el más importante, es utilizar :c:func:`Py_DECREF` en un objeto no relacionado mientras se toma prestada una referencia a un elemento de la lista. Por ejemplo::

source: This function first borrows a reference to ``list[0]``, then replaces ``list[1]`` with the value ``0``, and finally prints the borrowed reference. Looks harmless, right? But it's not!
es_es: Esta función primero toma prestada una referencia a ``list[0]``, luego reemplaza ``list[1]`` con el valor ``0``, y finalmente imprime la referencia prestada. ¿Parece inofensivo, verdad? ¡Pero no lo es!

source: The solution, once you know the source of the problem, is easy: temporarily increment the reference count. The correct version of the function reads::
es_es: La solución, una vez conocido el origen del problema, es fácil: incrementar temporalmente el recuento de referencias. La versión correcta de la función es::

source: The second case of problems with a borrowed reference is a variant involving threads. Normally, multiple threads in the Python interpreter can't get in each other's way, because there is a global lock protecting Python's entire object space. However, it is possible to temporarily release this lock using the macro :c:macro:`Py_BEGIN_ALLOW_THREADS`, and to re-acquire it using :c:macro:`Py_END_ALLOW_THREADS`. This is common around blocking I/O calls, to let other threads use the processor while waiting for the I/O to complete. Obviously, the following function has the same problem as the previous one::
es_es: El segundo caso de problemas con una referencia prestada es una variante que involucra hilos. Normalmente, múltiples hilos en el intérprete de Python no pueden interponerse unos en el camino de otros, porque hay un bloqueo global que protege todo el espacio de objetos de Python. Sin embargo, es posible liberar temporalmente este bloqueo usando la macro :c:macro:`Py_BEGIN_ALLOW_THREADS`, y recuperarlo usando :c:macro:`Py_END_ALLOW_THREADS`. Esto es común en llamadas de E/S bloqueantes, para permitir que otros hilos utilicen el procesador mientras esperan a que la E/S se complete. Obviamente, la siguiente función tiene el mismo problema que la anterior::

source: NULL Pointers
es_es: Punteros NULL

source: In general, functions that take object references as arguments do not expect you to pass them ``NULL`` pointers, and will dump core (or cause later core dumps) if you do so. Functions that return object references generally return ``NULL`` only to indicate that an exception occurred. The reason for not testing for ``NULL`` arguments is that functions often pass the objects they receive on to other function --- if each function were to test for ``NULL``, there would be a lot of redundant tests and the code would run more slowly.
es_es: En general, las funciones que toman referencias a objetos como argumentos no esperan que les pases punteros ``NULL``, y volcarán el núcleo (o provocarán volcados posteriores del núcleo) si lo haces. Las funciones que devuelven referencias a objetos generalmente devuelven ``NULL`` sólo para indicar que se ha producido una excepción. La razón para no comprobar los argumentos ``NULL`` es que las funciones a menudo pasan los objetos que reciben a otras funciones --- si cada función tuviera que comprobar ``NULL``, habría muchas pruebas redundantes y el código se ejecutaría más lentamente.

source: It is better to test for ``NULL`` only at the "source:" when a pointer that may be ``NULL`` is received, for example, from :c:func:`malloc` or from a function that may raise an exception.
es_es: Es mejor probar ``NULL`` solo en el "source:" cuando se recibe un puntero que puede ser ``NULL``, por ejemplo, desde :c:func:`malloc` o desde una función que puede generar una excepción.

source: The macros :c:func:`Py_INCREF` and :c:func:`Py_DECREF` do not check for ``NULL`` pointers --- however, their variants :c:func:`Py_XINCREF` and :c:func:`Py_XDECREF` do.
es_es: Los macros :c:func:`Py_INCREF` y :c:func:`Py_DECREF` no comprueban los punteros ``NULL`` --- sin embargo, sus variantes :c:func:`Py_XINCREF` y :c:func:`Py_XDECREF` sí lo hacen.

source: The macros for checking for a particular object type (``Pytype_Check()``) don't check for ``NULL`` pointers --- again, there is much code that calls several of these in a row to test an object against various different expected types, and this would generate redundant tests. There are no variants with ``NULL`` checking.
es_es: Los macros para comprobar un tipo de objeto en particular (``Pytype_Check()``) no comprueban los punteros ``NULL`` --- de nuevo, hay mucho código que llama a varios de estos macros seguidos para probar un objeto contra varios tipos esperados diferentes, y esto generaría pruebas redundantes. No hay variantes con comprobación de ``NULL``.

source: The C function calling mechanism guarantees that the argument list passed to C functions (``args`` in the examples) is never ``NULL`` --- in fact it guarantees that it is always a tuple [#]_.
es_es: El mecanismo de llamada de funciones en C garantiza que la lista de argumentos pasada a las funciones de C (``args`` en los ejemplos) nunca es ``NULL`` --- de hecho, garantiza que siempre es una tupla [#]_.

source: It is a severe error to ever let a ``NULL`` pointer "escape" to the Python user.
es_es: Es un grave error dejar que un puntero ``NULL`` "escape" al usuario de Python.

source: Writing Extensions in C++
es_es: Extensiones en C

source: It is possible to write extension modules in C++. Some restrictions apply. If the main program (the Python interpreter) is compiled and linked by the C compiler, global or static objects with constructors cannot be used. This is not a problem if the main program is linked by the C++ compiler. Functions that will be called by the Python interpreter (in particular, module initialization functions) have to be declared using ``extern "C"``. It is unnecessary to enclose the Python header files in ``extern "C" {...}`` --- they use this form already if the symbol ``__cplusplus`` is defined (all recent C++ compilers define this symbol).
es_es: Es posible escribir módulos de ampliación en C++. Se aplican algunas restricciones. Si el programa principal (el intérprete de Python) está compilado y enlazado por el compilador de C, no se pueden usar objetos globales o estáticos con constructores. Esto no es un problema si el programa principal está enlazado por el compilador de C++. Las funciones que serán llamadas por el intérprete de Python (en particular, las funciones de inicialización de módulos) tienen que ser declaradas usando ``extern "C"``. No es necesario encerrar los ficheros de cabecera de Python en ``extern "C" {...}`` --- ya utilizan esta forma si el símbolo ``__cplusplus`` está definido (todos los compiladores C++ recientes definen este símbolo).

source: Providing a C API for an Extension Module
es_es: Proporcionar una API en C para un módulo de ampliación

source: Many extension modules just provide new functions and types to be used from Python, but sometimes the code in an extension module can be useful for other extension modules. For example, an extension module could implement a type "collection" which works like lists without order. Just like the standard Python list type has a C API which permits extension modules to create and manipulate lists, this new collection type should have a set of C functions for direct manipulation from other extension modules.
es_es: Muchos módulos de extensión simplemente proporcionan nuevas funciones y tipos que se pueden utilizar desde Python, pero a veces el código en un módulo de extensión puede ser útil para otros módulos de extensión. Por ejemplo, un módulo de extensión podría implementar un tipo "colección" que funcione como listas sin orden. Al igual que el tipo de lista estándar de Python tiene una API en C que permite a los módulos de extensión crear y manipular listas, este nuevo tipo de colección debería tener un conjunto de funciones en C para la manipulación directa desde otros módulos de extensión.

source: At first sight this seems easy: just write the functions (without declaring them ``static``, of course), provide an appropriate header file, and document the C API. And in fact this would work if all extension modules were always linked statically with the Python interpreter. When modules are used as shared libraries, however, the symbols defined in one module may not be visible to another module. The details of visibility depend on the operating system; some systems use one global namespace for the Python interpreter and all extension modules (Windows, for example), whereas others require an explicit list of imported symbols at module link time (AIX is one example), or offer a choice of different strategies (most Unices). And even if symbols are globally visible, the module whose functions one wishes to call might not have been loaded yet!
es_es: A primera vista esto parece fácil: basta con escribir las funciones (sin declararlas ``static``, por supuesto), proporcionar un fichero de cabecera apropiado, y documentar la API C. Y de hecho esto funcionaría si todos los módulos de extensión estuvieran siempre enlazados estáticamente con el intérprete de Python. Sin embargo, cuando los módulos se usan como bibliotecas compartidas, los símbolos definidos en un módulo pueden no ser visibles para otro módulo. Los detalles de la visibilidad dependen del sistema operativo; algunos sistemas usan un espacio de nombres global para el intérprete de Python y todos los módulos de extensión (Windows, por ejemplo), mientras que otros requieren una lista explícita de símbolos importados en el momento de enlazar el módulo (AIX es un ejemplo), u ofrecen una selección de diferentes estrategias (la mayoría de los Unices). E incluso si los símbolos son visibles globalmente, el módulo cuyas funciones uno desea llamar puede no haber sido cargado todavía.

source: Portability therefore requires not to make any assumptions about symbol visibility. This means that all symbols in extension modules should be declared ``static``, except for the module's initialization function, in order to avoid name clashes with other extension modules (as discussed in section :ref:`methodtable`). And it means that symbols that *should* be accessible from other extension modules must be exported in a different way.
es_es: Por lo tanto, la portabilidad requiere no hacer ninguna suposición sobre la visibilidad de los símbolos. Esto significa que todos los símbolos en los módulos de extensión deben ser declarados ``static``, excepto la función de inicialización del módulo, para evitar conflictos de nombres con otros módulos de extensión (como se discute en la sección :ref:`methodtable`). Y significa que los símbolos que *deberían* ser accesibles desde otros módulos de extensión deben ser exportados de una manera diferente.

source: There are many ways in which Capsules can be used to export the C API of an extension module. Each function could get its own Capsule, or all C API pointers could be stored in an array whose address is published in a Capsule. And the various tasks of storing and retrieving the pointers can be distributed in different ways between the module providing the code and the client modules.
es_es: Hay muchas formas en las que las Cápsulas se pueden utilizar para exportar la API C de un módulo de extensión. Cada función podría tener su propia Cápsula, o todos los punteros de la API C podrían ser almacenados en un array cuya dirección se publica en una Cápsula. Y las diversas tareas de almacenar y recuperar los punteros pueden ser distribuidas de diferentes formas entre el módulo que proporciona el código y los módulos del cliente.

source: In particular, Capsules used to expose C APIs should be given a name following this convention::
es_es: En particular, las cápsulas utilizadas para exponer APIs C deben recibir un nombre siguiendo esta convención:

source: The convenience function :c:func:`PyCapsule_Import` makes it easy to load a C API provided via a Capsule, but only if the Capsule's name matches this convention. This behavior gives C API users a high degree of certainty that the Capsule they load contains the correct C API.
es_es: La función :c:func:`PyCapsule_Import` facilita la carga de una API de C proporcionada a través de una cápsula, pero sólo si el nombre de la cápsula coincide con esta convención. Este comportamiento ofrece a los usuarios de la API de C un alto grado de certeza de que la Cápsula que cargan contiene la API de C correcta.

source: In the beginning of the module, right after the line ::
es_es: Al principio del módulo, justo después de la línea ::

source: two more lines must be added::
es_es: hay que añadir dos líneas más::

source: The ``#define`` is used to tell the header file that it is being included in the exporting module, not a client module. Finally, the module's initialization function must take care of initializing the C API pointer array::
es_es: El ``#define`` se utiliza para indicar al archivo de cabecera que se está incluyendo en el módulo exportador, no en un módulo cliente. Por último, la función de inicialización del módulo debe encargarse de inicializar la matriz de punteros de la API de C::

source: The bulk of the work is in the header file :file:`spammodule.h`, which looks like this::
es_es: La mayor parte del trabajo se encuentra en el archivo de cabecera :file:`spammodule.h`, que tiene el siguiente aspecto::

source: The main disadvantage of this approach is that the file :file:`spammodule.h` is rather complicated. However, the basic structure is the same for each function that is exported, so it has to be learned only once.
es_es: La principal desventaja de este enfoque es que el archivo :file:`spammodule.h` es bastante complicado. Sin embargo, la estructura básica es la misma para cada función que se exporta, por lo que sólo hay que aprenderla una vez.
