Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/extending/extending.po
Languages: es_es

source: So far we have concentrated on making C functions callable from Python. The reverse is also useful: calling Python functions from C. This is especially the case for libraries that support so-called "callback" functions. If a C interface makes use of callbacks, the equivalent Python often needs to provide a callback mechanism to the Python programmer; the implementation will require calling the Python callback functions from a C callback. Other uses are also imaginable.
es_es: Hasta ahora nos hemos centrado en hacer que las funciones C se puedan llamar desde Python. Lo contrario también es útil: llamar a funciones Python desde C. Este es especialmente el caso de las bibliotecas que soportan las llamadas funciones "callback". Si una interfaz C hace uso de callbacks, el equivalente Python a menudo necesita proporcionar un mecanismo de callback al programador Python; la implementación requerirá llamar a las funciones de callback Python desde un callback C. También son imaginables otros usos.

source: Fortunately, the Python interpreter is easily called recursively, and there is a standard interface to call a Python function. (I won't dwell on how to call the Python parser with a particular string as input --- if you're interested, have a look at the implementation of the :option:`-c` command line option in :file:`Modules/main.c` from the Python source code.)
es_es: Afortunadamente, el intérprete de Python se llama fácilmente de forma recursiva, y existe una interfaz estándar para llamar a una función de Python. (No me detendré en cómo llamar al analizador sintáctico de Python con una cadena concreta como entrada --- si te interesa, echa un vistazo a la implementación de la opción de línea de comandos :option:`-c` en :file:`Modules/main.c` desde el código fuente de Python).

source: Calling a Python function is easy. First, the Python program must somehow pass you the Python function object. You should provide a function (or some other interface) to do this. When this function is called, save a pointer to the Python function object (be careful to :c:func:`Py_INCREF` it!) in a global variable --- or wherever you see fit. For example, the following function might be part of a module definition::
es_es: Llamar a una función Python es fácil. Primero, el programa Python debe pasarte de alguna manera el objeto función Python. Debes proporcionar una función (o alguna otra interfaz) para hacer esto. Cuando se llame a esta función, guarda un puntero al objeto de la función Python (¡cuidado con :c:func:`Py_INCREF`!) en una variable global --- o donde creas conveniente. Por ejemplo, la siguiente función podría ser parte de la definición de un módulo::

source: The macros :c:func:`Py_XINCREF` and :c:func:`Py_XDECREF` increment/decrement the reference count of an object and are safe in the presence of ``NULL`` pointers (but note that *temp* will not be ``NULL`` in this context). More info on them in section :ref:`refcounts`.
es_es: Las macros :c:func:`Py_XINCREF` y :c:func:`Py_XDECREF` incrementan/decrementan la cuenta de referencias de un objeto y son seguras en presencia de punteros ``NULL`` (pero tenga en cuenta que *temp* no será ``NULL`` en este contexto). Más información sobre ellas en la sección :ref:`refcounts`.

source: Later, when it is time to call the function, you call the C function :c:func:`PyObject_CallObject`. This function has two arguments, both pointers to arbitrary Python objects: the Python function, and the argument list. The argument list must always be a tuple object, whose length is the number of arguments. To call the Python function with no arguments, pass in ``NULL``, or an empty tuple; to call it with one argument, pass a singleton tuple. :c:func:`Py_BuildValue` returns a tuple when its format string consists of zero or more format codes between parentheses. For example::
es_es: Más tarde, cuando llega el momento de llamar a la función, se llama a la función C :c:func:`PyObject_CallObject`. Esta función tiene dos argumentos, ambos punteros a objetos arbitrarios de Python: la función de Python y la lista de argumentos. La lista de argumentos debe ser siempre un objeto tupla, cuya longitud es el número de argumentos. Para llamar a la función Python sin argumentos, pase ``NULL``, o una tupla vacía; para llamarla con un argumento, pase una tupla singleton. :c:func:`Py_BuildValue` devuelve una tupla cuando su cadena de formato consta de cero o más códigos de formato entre paréntesis. Por ejemplo::

source: :c:func:`PyObject_CallObject` returns a Python object pointer: this is the return value of the Python function. :c:func:`PyObject_CallObject` is "reference-count-neutral" with respect to its arguments. In the example a new tuple was created to serve as the argument list, which is :c:func:`Py_DECREF`\ -ed immediately after the :c:func:`PyObject_CallObject` call.
es_es: :c:func:`PyObject_CallObject` devuelve un puntero a un objeto Python: este es el valor de retorno de la función Python. :c:func:`PyObject_CallObject` es "reference-count-neutral" con respecto a sus argumentos. En el ejemplo se ha creado una nueva tupla como lista de argumentos, que se :c:func:`Py_DECREF`-ed inmediatamente después de la llamada a :c:func:`PyObject_CallObject`.

source: The return value of :c:func:`PyObject_CallObject` is "new": either it is a brand new object, or it is an existing object whose reference count has been incremented. So, unless you want to save it in a global variable, you should somehow :c:func:`Py_DECREF` the result, even (especially!) if you are not interested in its value.
es_es: El valor de retorno de :c:func:`PyObject_CallObject` es "nuevo": o bien es un objeto completamente nuevo, o bien es un objeto existente cuyo recuento de referencias se ha incrementado. Por lo tanto, a menos que quieras guardarlo en una variable global, deberías de alguna manera :c:func:`Py_DECREF` el resultado, incluso (¡especialmente!) si no estás interesado en su valor.

source: Before you do this, however, it is important to check that the return value isn't ``NULL``. If it is, the Python function terminated by raising an exception. If the C code that called :c:func:`PyObject_CallObject` is called from Python, it should now return an error indication to its Python caller, so the interpreter can print a stack trace, or the calling Python code can handle the exception. If this is not possible or desirable, the exception should be cleared by calling :c:func:`PyErr_Clear`. For example::
es_es: Antes de hacer esto, sin embargo, es importante comprobar que el valor de retorno no es ``NULL``. Si lo es, la función Python termina lanzando una excepción. Si el código C que llamó a :c:func:`PyObject_CallObject` es llamado desde Python, ahora debería devolver una indicación de error a su llamador Python, para que el intérprete pueda imprimir una traza de la pila, o el código Python llamador pueda manejar la excepción. Si esto no es posible o deseable, la excepción debe ser borrada llamando a :c:func:`PyErr_Clear`. Por ejemplo::

source: Depending on the desired interface to the Python callback function, you may also have to provide an argument list to :c:func:`PyObject_CallObject`. In some cases the argument list is also provided by the Python program, through the same interface that specified the callback function. It can then be saved and used in the same manner as the function object. In other cases, you may have to construct a new tuple to pass as the argument list. The simplest way to do this is to call :c:func:`Py_BuildValue`. For example, if you want to pass an integral event code, you might use the following code::
es_es: Dependiendo de la interfaz deseada para la función callback de Python, puede que también tengas que proporcionar una lista de argumentos a :c:func:`PyObject_CallObject`. En algunos casos la lista de argumentos también es proporcionada por el programa Python, a través de la misma interfaz que especificó la función callback. Se puede guardar y utilizar de la misma manera que el objeto de la función. En otros casos, puede que tengas que construir una nueva tupla para pasarla como lista de argumentos. La forma más sencilla de hacerlo es llamar a :c:func:`Py_BuildValue`. Por ejemplo, si desea pasar un código de evento integral, puede utilizar el siguiente código::

source: Note the placement of ``Py_DECREF(arglist)`` immediately after the call, before the error check! Also note that strictly speaking this code is not complete: :c:func:`Py_BuildValue` may run out of memory, and this should be checked.
es_es: Observe la colocación de ``Py_DECREF(arglist)`` inmediatamente después de la llamada, ¡antes de la comprobación de errores! Observe también que, estrictamente hablando, este código no está completo: :c:func:`Py_BuildValue` puede quedarse sin memoria, y esto debe comprobarse.

source: You may also call a function with keyword arguments by using :c:func:`PyObject_Call`, which supports arguments and keyword arguments. As in the above example, we use :c:func:`Py_BuildValue` to construct the dictionary. ::
es_es: También puede llamar a una función con argumentos de palabra clave utilizando :c:func:`PyObject_Call`, que admite argumentos y argumentos de palabra clave. Como en el ejemplo anterior, utilizamos :c:func:`Py_BuildValue` para construir el diccionario. ::

source: Extracting Parameters in Extension Functions
es_es: Extracción de parámetros en funciones de ampliación

source: The :c:func:`PyArg_ParseTuple` function is declared as follows::
es_es: La función :c:func:`PyArg_ParseTuple` se declara como sigue::

source: The *arg* argument must be a tuple object containing an argument list passed from Python to a C function. The *format* argument must be a format string, whose syntax is explained in :ref:`arg-parsing` in the Python/C API Reference Manual. The remaining arguments must be addresses of variables whose type is determined by the format string.
es_es: El argumento *arg* debe ser un objeto tupla que contenga una lista de argumentos pasada desde Python a una función C. El argumento *format* debe ser una cadena de formato, cuya sintaxis se explica en :ref:`arg-parsing` en el Manual de Referencia de la API de Python/C. El resto de argumentos deben ser direcciones de variables cuyo tipo viene determinado por la cadena de formato.

source: Note that while :c:func:`PyArg_ParseTuple` checks that the Python arguments have the required types, it cannot check the validity of the addresses of C variables passed to the call: if you make mistakes there, your code will probably crash or at least overwrite random bits in memory. So be careful!
es_es: Ten en cuenta que mientras :c:func:`PyArg_ParseTuple` comprueba que los argumentos de Python tienen los tipos requeridos, no puede comprobar la validez de las direcciones de las variables C pasadas a la llamada: si cometes errores ahí, tu código probablemente se bloqueará o al menos sobrescribirá bits aleatorios en memoria. Así que ¡Cuidado!

source: Note that any Python object references which are provided to the caller are *borrowed* references; do not decrement their reference count!
es_es: Tenga en cuenta que todas las referencias de objetos de Python que se proporcionan al solicitante son referencias *prestadas*; ¡no reduzca su número de referencia!

source: Some example calls::
es_es: Algunas llamadas de ejemplo::

source: Keyword Parameters for Extension Functions
es_es: Parámetros de palabras clave para funciones de ampliación

source: The :c:func:`PyArg_ParseTupleAndKeywords` function is declared as follows::
es_es: La función :c:func:`PyArg_ParseTupleAndKeywords` se declara como sigue::

source: The *arg* and *format* parameters are identical to those of the :c:func:`PyArg_ParseTuple` function. The *kwdict* parameter is the dictionary of keywords received as the third parameter from the Python runtime. The *kwlist* parameter is a ``NULL``-terminated list of strings which identify the parameters; the names are matched with the type information from *format* from left to right. On success, :c:func:`PyArg_ParseTupleAndKeywords` returns true, otherwise it returns false and raises an appropriate exception.
es_es: Los parámetros *arg* y *format* son idénticos a los de la función :c:func:`PyArg_ParseTuple`. El parámetro *kwdict* es el diccionario de palabras clave recibido como tercer parámetro del tiempo de ejecución de Python. El parámetro *kwlist* es una lista terminada en ``NULL`` de cadenas que identifican los parámetros; los nombres coinciden con la información de tipo de *format* de izquierda a derecha. En caso de éxito, :c:func:`PyArg_ParseTupleAndKeywords` devuelve true, en caso contrario devuelve false y lanza una excepción apropiada.

source: Nested tuples cannot be parsed when using keyword arguments! Keyword parameters passed in which are not present in the *kwlist* will cause :exc:`TypeError` to be raised.
es_es: Las tuplas anidadas no pueden analizarse cuando se utilizan argumentos de palabras clave. Los parámetros de palabra clave introducidos que no estén presentes en la *kwlist* provocarán la aparición de :exc:`TypeError`.

source: Here is an example module which uses keywords, based on an example by Geoff Philbrick (philbrick@hks.com)::
es_es: Aquí hay un módulo de ejemplo que utiliza palabras clave, basado en un ejemplo de Geoff Philbrick (philbrick@hks.com)::

source: Building Arbitrary Values
es_es: Construyendo valores arbitrarios

source: This function is the counterpart to :c:func:`PyArg_ParseTuple`. It is declared as follows::
es_es: Esta función es el contraparte de :c:func:`PyArg_ParseTuple`. Se declara de la siguiente manera:

source: It recognizes a set of format units similar to the ones recognized by :c:func:`PyArg_ParseTuple`, but the arguments (which are input to the function, not output) must not be pointers, just values. It returns a new Python object, suitable for returning from a C function called from Python.
es_es: Reconoce un conjunto de unidades de formato similares a las reconocidas por :c:func:`PyArg_ParseTuple`, pero los argumentos (que son de entrada a la función, no de salida) no deben ser punteros, solo valores. Devuelve un nuevo objeto de Python, adecuado para ser devuelto desde una función C llamada desde Python.

source: One difference with :c:func:`PyArg_ParseTuple`: while the latter requires its first argument to be a tuple (since Python argument lists are always represented as tuples internally), :c:func:`Py_BuildValue` does not always build a tuple. It builds a tuple only if its format string contains two or more format units. If the format string is empty, it returns ``None``; if it contains exactly one format unit, it returns whatever object is described by that format unit. To force it to return a tuple of size 0 or one, parenthesize the format string.
es_es: Una diferencia con :c:func:`PyArg_ParseTuple`: mientras que este último requiere que su primer argumento sea una tupla (ya que las listas de argumentos de Python siempre se representan internamente como tuplas), :c:func:`Py_BuildValue` no siempre construye una tupla. Sólo construye una tupla si su cadena de formato contiene dos o más unidades de formato. Si la cadena de formato está vacía, devuelve ``None``; si contiene exactamente una unidad de formato, devuelve cualquier objeto descrito por esa unidad de formato. Para forzarla a devolver una tupla de tamaño 0 o uno, ponga entre paréntesis la cadena de formato.

source: Examples (to the left the call, to the right the resulting Python value):
es_es: Ejemplos (a la izquierda la llamada, a la derecha el valor resultante en Python):

source: Reference Counts
es_es: Recuentos de referencia

source: In languages like C or C++, the programmer is responsible for dynamic allocation and deallocation of memory on the heap. In C, this is done using the functions :c:func:`malloc` and :c:func:`free`. In C++, the operators ``new`` and ``delete`` are used with essentially the same meaning and we'll restrict the following discussion to the C case.
es_es: En lenguajes como C o C++, el programador es responsable de la asignación y liberación dinámica de memoria en el montón. En C, esto se hace utilizando las funciones :c:func:`malloc` y :c:func:`free`. En C++, los operadores ``new`` y ``delete`` se utilizan con un significado esencialmente igual y limitaremos la siguiente discusión al caso de C.

source: Common causes of memory leaks are unusual paths through the code. For instance, a function may allocate a block of memory, do some calculation, and then free the block again. Now a change in the requirements for the function may add a test to the calculation that detects an error condition and can return prematurely from the function. It's easy to forget to free the allocated memory block when taking this premature exit, especially when it is added later to the code. Such leaks, once introduced, often go undetected for a long time: the error exit is taken only in a small fraction of all calls, and most modern machines have plenty of virtual memory, so the leak only becomes apparent in a long-running process that uses the leaking function frequently. Therefore, it's important to prevent leaks from happening by having a coding convention or strategy that minimizes this kind of errors.
es_es: Las causas comunes de las fugas de memoria son los caminos inusuales a través del código. Por ejemplo, una función puede asignar un bloque de memoria, hacer algunos cálculos y luego liberar el bloque nuevamente. Ahora, un cambio en los requisitos de la función puede agregar una prueba al cálculo que detecta una condición de error y puede retornar prematuramente de la función. Es fácil olvidar liberar el bloque de memoria asignado al tomar esta salida prematura, especialmente cuando se agrega más tarde al código. Tales fugas, una vez introducidas, a menudo pasan desapercibidas durante mucho tiempo: la salida de error solo se produce en una pequeña fracción de todas las llamadas, y la mayoría de las máquinas modernas tienen mucha memoria virtual, por lo que la fuga solo se hace evidente en un proceso de larga duración que utiliza la función con fugas con frecuencia. Por lo tanto, es importante prevenir las fugas evitando que ocurran mediante una convención de codificación o estrategia que minimice este tipo de errores.

source: Since Python makes heavy use of :c:func:`malloc` and :c:func:`free`, it needs a strategy to avoid memory leaks as well as the use of freed memory. The chosen method is called :dfn:`reference counting`. The principle is simple: every object contains a counter, which is incremented when a reference to the object is stored somewhere, and which is decremented when a reference to it is deleted. When the counter reaches zero, the last reference to the object has been deleted and the object is freed.
es_es: Dado que Python hace un uso intensivo de :c:func:`malloc` y :c:func:`free`, necesita una estrategia para evitar fugas de memoria, así como el uso de memoria liberada. El método elegido se llama :dfn:`reference counting`. El principio es simple: cada objeto contiene un contador, que se incrementa cuando se almacena una referencia al objeto en algún lugar, y que se decrementa cuando se elimina una referencia a él. Cuando el contador llega a cero, se ha eliminado la última referencia al objeto y se libera el objeto.

source: An alternative strategy is called :dfn:`automatic garbage collection`. (Sometimes, reference counting is also referred to as a garbage collection strategy, hence my use of "automatic" to distinguish the two.) The big advantage of automatic garbage collection is that the user doesn't need to call :c:func:`free` explicitly. (Another claimed advantage is an improvement in speed or memory usage --- this is no hard fact however.) The disadvantage is that for C, there is no truly portable automatic garbage collector, while reference counting can be implemented portably (as long as the functions :c:func:`malloc` and :c:func:`free` are available --- which the C Standard guarantees). Maybe some day a sufficiently portable automatic garbage collector will be available for C. Until then, we'll have to live with reference counts.
es_es: Una estrategia alternativa se llama :dfn:`recolección automática de basura`. (A veces, el recuento de referencias también se denomina estrategia de recolección de basura, de ahí mi uso de "automático" para distinguir los dos). La gran ventaja de la recolección automática de basura es que el usuario no necesita llamar explícitamente a :c:func:`free`. (Otra ventaja afirmada es una mejora en la velocidad o el uso de memoria, aunque esto no es un hecho comprobado). La desventaja es que para C, no hay un recolector de basura automático verdaderamente portátil, mientras que el recuento de referencias se puede implementar de forma portátil (siempre que las funciones :c:func:`malloc` y :c:func:`free` estén disponibles, lo cual garantiza el estándar de C). Tal vez algún día esté disponible un recolector de basura automático suficientemente portátil para C. Hasta entonces, tendremos que conformarnos con los recuentos de referencias.

source: While Python uses the traditional reference counting implementation, it also offers a cycle detector that works to detect reference cycles. This allows applications to not worry about creating direct or indirect circular references; these are the weakness of garbage collection implemented using only reference counting. Reference cycles consist of objects which contain (possibly indirect) references to themselves, so that each object in the cycle has a reference count which is non-zero. Typical reference counting implementations are not able to reclaim the memory belonging to any objects in a reference cycle, or referenced from the objects in the cycle, even though there are no further references to the cycle itself.
es_es: Mientras Python utiliza la implementación tradicional de conteo de referencias, también ofrece un detector de ciclos que funciona para detectar ciclos de referencias. Esto permite que las aplicaciones no se preocupen por crear referencias circulares directas o indirectas; estas son la debilidad de la recolección de basura implementada solo con conteo de referencias. Los ciclos de referencia consisten en objetos que contienen referencias (posiblemente indirectas) a sí mismos, de modo que cada objeto en el ciclo tiene un recuento de referencias que no es cero. Las implementaciones típicas de conteo de referencias no pueden recuperar la memoria perteneciente a ningún objeto en un ciclo de referencia, o referenciada desde los objetos en el ciclo, aunque no haya más referencias al ciclo en sí.

source: Reference Counting in Python
es_es: Recuento de referencias en Python

source: There are two macros, ``Py_INCREF(x)`` and ``Py_DECREF(x)``, which handle the incrementing and decrementing of the reference count. :c:func:`Py_DECREF` also frees the object when the count reaches zero. For flexibility, it doesn't call :c:func:`free` directly --- rather, it makes a call through a function pointer in the object's :dfn:`type object`. For this purpose (and others), every object also contains a pointer to its type object.
es_es: Hay dos macros, ``Py_INCREF(x)`` y ``Py_DECREF(x)``, que manejan el incremento y decremento de la cuenta de referencias. :c:func:`Py_DECREF` también libera el objeto cuando la cuenta llega a cero. Para mayor flexibilidad, no llama directamente a :c:func:`free`, sino que lo hace a través de un puntero de función en el :dfn:`type object` del objeto. Para este propósito (y otros), cada objeto también contiene un puntero a su objeto de tipo.
