Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/extending/extending.po
Languages: es_es

source: Finally it should be mentioned that Capsules offer additional functionality, which is especially useful for memory allocation and deallocation of the pointer stored in a Capsule. The details are described in the Python/C API Reference Manual in the section :ref:`capsules` and in the implementation of Capsules (files :file:`Include/pycapsule.h` and :file:`Objects/pycapsule.c` in the Python source code distribution).
es_es: Por último, cabe mencionar que las Cápsulas ofrecen una funcionalidad adicional, especialmente útil para la asignación y desasignación de memoria del puntero almacenado en una Cápsula. Los detalles se describen en el Manual de Referencia de la API de Python/C en la sección :ref:`capsules` y en la implementación de Cápsulas (archivos :file:`Include/pycapsule.h` y :file:`Objects/pycapsule.c` en la distribución del código fuente de Python).

source: Footnotes
es_es: Notas a pie de página

source: An interface for this function already exists in the standard module :mod:`os` --- it was chosen as a simple and straightforward example.
es_es: Ya existe una interfaz para esta función en el módulo estándar :mod:`os` --- se eligió como ejemplo simple y directo.

source: The metaphor of "borrowing" a reference is not completely correct: the owner still has a copy of the reference.
es_es: La metáfora de "tomar prestada" una referencia no es del todo correcta: el propietario sigue teniendo una copia de la referencia.

source: Checking that the reference count is at least 1 **does not work** --- the reference count itself could be in freed memory and may thus be reused for another object!
es_es: Comprobando que el recuento de referencias sea al menos 1 **no funciona** --- ¡el recuento de referencias en sí podría estar en memoria liberada y, por lo tanto, podría reutilizarse para otro objeto!

source: These guarantees don't hold when you use the "old" style calling convention --- this is still found in much existing code.
es_es: Estas garantías no se mantienen cuando se utiliza la convención de llamada "antigua" --- esto todavía se encuentra en gran parte del código existente.
