Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/extending/extending.po
Languages: es_es

source: Extending Python with C or C++
es_es: Extender Python con C o C++

source: It is quite easy to add new built-in modules to Python, if you know how to program in C. Such :dfn:`extension modules` can do two things that can't be done directly in Python: they can implement new built-in object types, and they can call C library functions and system calls.
es_es: Es bastante fácil añadir nuevos módulos integrados a Python, si sabes cómo programar en C. Tales :dfn:`módulos de extensión` pueden hacer dos cosas que no se pueden hacer directamente en Python: pueden implementar nuevos tipos de objetos integrados y pueden llamar a funciones de biblioteca C y llamadas al sistema.

source: To support extensions, the Python API (Application Programmers Interface) defines a set of functions, macros and variables that provide access to most aspects of the Python run-time system. The Python API is incorporated in a C source file by including the header ``"Python.h"``.
es_es: Para dar soporte a las extensiones, la API de Python (Application Programmers Interface) define un conjunto de funciones, macros y variables que proporcionan acceso a la mayoría de los aspectos del sistema de tiempo de ejecución de Python. La API de Python se incorpora en un archivo fuente C incluyendo la cabecera ``"Python.h"``.

source: The compilation of an extension module depends on its intended use as well as on your system setup; details are given in later chapters.
es_es: La compilación de un módulo de ampliación depende del uso que se le vaya a dar y de la configuración del sistema.

source: The C extension interface is specific to CPython, and extension modules do not work on other Python implementations. In many cases, it is possible to avoid writing C extensions and preserve portability to other implementations. For example, if your use case is calling C library functions or system calls, you should consider using the :mod:`ctypes` module or the `cffi <https://cffi.readthedocs.io/>`_ library rather than writing custom C code. These modules let you write Python code to interface with C code and are more portable between implementations of Python than writing and compiling a C extension module.
es_es: La interfaz de extensión C es específica de CPython, y los módulos de extensión no funcionan en otras implementaciones de Python. En muchos casos, es posible evitar escribir extensiones C y preservar la portabilidad a otras implementaciones. Por ejemplo, si tu caso de uso es llamar a funciones de librerías C o llamadas al sistema, deberías considerar usar el módulo :mod:`ctypes` o la librería `cffi <https://cffi.readthedocs.io/>`_ en lugar de escribir código C personalizado. Estos módulos te permiten escribir código Python para interactuar con código C y son más portables entre implementaciones de Python que escribir y compilar un módulo de extensión C.

source: A Simple Example
es_es: Un ejemplo sencillo

source: Let's create an extension module called ``spam`` (the favorite food of Monty Python fans...) and let's say we want to create a Python interface to the C library function :c:func:`system` [#]_. This function takes a null-terminated character string as argument and returns an integer. We want this function to be callable from Python as follows:
es_es: Vamos a crear un módulo de extensión llamado ``spam`` (la comida favorita de los fans de Monty Python...) y digamos que queremos crear una interfaz Python para la función de la biblioteca C :c:func:`system` [#]_. Esta función toma una cadena de caracteres terminada en cero como argumento y devuelve un entero. Queremos que esta función sea invocable desde Python de la siguiente manera:

source: Begin by creating a file :file:`spammodule.c`. (Historically, if a module is called ``spam``, the C file containing its implementation is called :file:`spammodule.c`; if the module name is very long, like ``spammify``, the module name can be just :file:`spammify.c`.)
es_es: Comience por crear un archivo :file:`spammodule.c`. (Históricamente, si un módulo se llama ``spam``, el archivo C que contiene su implementación se llama :file:`spammodule.c`; si el nombre del módulo es muy largo, como ``spammify``, el nombre del módulo puede ser simplemente :file:`spammify.c`).

source: The first two lines of our file can be::
es_es: Las primeras dos líneas de nuestro archivo pueden ser::

source: which pulls in the Python API (you can add a comment describing the purpose of the module and a copyright notice if you like).
es_es: que importa la API de Python (puedes agregar un comentario describiendo el propósito del módulo y un aviso de derechos de autor si lo deseas).

source: Since Python may define some pre-processor definitions which affect the standard headers on some systems, you *must* include :file:`Python.h` before any standard headers are included.
es_es: Dado que Python puede definir algunas definiciones de preprocesador que afectan a las cabeceras estándar en algunos sistemas, *debes* incluir :file:`Python.h` antes de incluir cualquier cabecera estándar.

source: All user-visible symbols defined by :file:`Python.h` have a prefix of ``Py`` or ``PY``, except those defined in standard header files. For convenience, and since they are used extensively by the Python interpreter, ``"Python.h"`` includes a few standard header files: ``<stdio.h>``, ``<string.h>``, ``<errno.h>``, and ``<stdlib.h>``. If the latter header file does not exist on your system, it declares the functions :c:func:`malloc`, :c:func:`free` and :c:func:`realloc` directly.
es_es: Todos los símbolos visibles para el usuario definidos por :file:`Python.h` tienen un prefijo de ``Py`` o ``PY``, excepto aquellos definidos en archivos de encabezado estándar. Por conveniencia, y dado que son utilizados extensivamente por el intérprete de Python, ``"Python.h"`` incluye algunos archivos de encabezado estándar: ``<stdio.h>``, ``<string.h>``, ``<errno.h>`` y ``<stdlib.h>``. Si el último archivo de encabezado no existe en su sistema, declara las funciones :c:func:`malloc`, :c:func:`free` y :c:func:`realloc` directamente.

source: The next thing we add to our module file is the C function that will be called when the Python expression ``spam.system(string)`` is evaluated (we'll see shortly how it ends up being called)::
es_es: Lo siguiente que añadimos a nuestro fichero de módulo es la función C que será llamada cuando se evalúe la expresión Python ``spam.system(string)`` (veremos en breve cómo acaba siendo llamada)::

source: There is a straightforward translation from the argument list in Python (for example, the single expression ``"ls -l"``) to the arguments passed to the C function. The C function always has two arguments, conventionally named *self* and *args*.
es_es: Existe una traducción directa de la lista de argumentos en Python (por ejemplo, la expresión única ``"ls -l"``) a los argumentos pasados a la función C. La función C siempre tiene dos argumentos, convencionalmente llamados *self* y *args*.

source: The *self* argument points to the module object for module-level functions; for a method it would point to the object instance.
es_es: El argumento *self* apunta al objeto del módulo para funciones a nivel de módulo; para un método apuntaría a la instancia del objeto.

source: The *args* argument will be a pointer to a Python tuple object containing the arguments. Each item of the tuple corresponds to an argument in the call's argument list. The arguments are Python objects --- in order to do anything with them in our C function we have to convert them to C values. The function :c:func:`PyArg_ParseTuple` in the Python API checks the argument types and converts them to C values. It uses a template string to determine the required types of the arguments as well as the types of the C variables into which to store the converted values. More about this later.
es_es: El argumento *args* será un puntero a un objeto tupla de Python que contiene los argumentos. Cada elemento de la tupla corresponde a un argumento de la lista de argumentos de la llamada. Los argumentos son objetos Python --- para poder hacer algo con ellos en nuestra función C tenemos que convertirlos a valores C. La función :c:func:`PyArg_ParseTuple` de la API de Python comprueba los tipos de argumentos y los convierte en valores C. Utiliza una cadena de plantilla para determinar los tipos requeridos de los argumentos, así como los tipos de las variables C en las que almacenar los valores convertidos. Más sobre esto más adelante.

source: :c:func:`PyArg_ParseTuple` returns true (nonzero) if all arguments have the right type and its components have been stored in the variables whose addresses are passed. It returns false (zero) if an invalid argument list was passed. In the latter case it also raises an appropriate exception so the calling function can return ``NULL`` immediately (as we saw in the example).
es_es: :c:func:`PyArg_ParseTuple` devuelve verdadero (distinto de cero) si todos los argumentos tienen el tipo correcto y sus componentes se han almacenado en las variables cuyas direcciones se han pasado. Devuelve false (cero) si se ha pasado una lista de argumentos no válida. En este último caso también lanza una excepción apropiada para que la función que llama pueda devolver ``NULL`` inmediatamente (como vimos en el ejemplo).

source: Intermezzo: Errors and Exceptions
es_es: Intermezzo: Errores y excepciones

source: An important convention throughout the Python interpreter is the following: when a function fails, it should set an exception condition and return an error value (usually ``-1`` or a ``NULL`` pointer). Exception information is stored in three members of the interpreter's thread state. These are ``NULL`` if there is no exception. Otherwise they are the C equivalents of the members of the Python tuple returned by :meth:`sys.exc_info`. These are the exception type, exception instance, and a traceback object. It is important to know about them to understand how errors are passed around.
es_es: Una convención importante en todo el intérprete de Python es la siguiente: cuando una función falla, debe establecer una condición de excepción y devolver un valor de error (normalmente ``-1`` o un puntero ``NULL``). La información de excepción se almacena en tres miembros del estado del hilo del intérprete. Estos son``NULL`` si no hay excepción. Si no, son los equivalentes en C de los miembros de la tupla Python devuelta por :meth:`sys.exc_info`. Estos son el tipo de excepción, la instancia de excepción, y un objeto traceback. Es importante conocerlos para entender cómo se transmiten los errores.

source: The Python API defines a number of functions to set various types of exceptions.
es_es: La API de Python define una serie de funciones para establecer varios tipos de excepciones.

source: The most common one is :c:func:`PyErr_SetString`. Its arguments are an exception object and a C string. The exception object is usually a predefined object like :c:data:`PyExc_ZeroDivisionError`. The C string indicates the cause of the error and is converted to a Python string object and stored as the "associated value" of the exception.
es_es: El más común es :c:func:`PyErr_SetString`. Sus argumentos son un objeto de excepción y una cadena C. El objeto de excepción suele ser un objeto predefinido como :c:data:`PyExc_ZeroDivisionError`. La cadena C indica la causa del error y se convierte en un objeto de cadena Python y se almacena como el "valor asociado" de la excepción.

source: Another useful function is :c:func:`PyErr_SetFromErrno`, which only takes an exception argument and constructs the associated value by inspection of the global variable :c:data:`errno`. The most general function is :c:func:`PyErr_SetObject`, which takes two object arguments, the exception and its associated value. You don't need to :c:func:`Py_INCREF` the objects passed to any of these functions.
es_es: Otra función útil es :c:func:`PyErr_SetFromErrno`, que sólo toma un argumento de excepción y construye el valor asociado mediante inspección de la variable global :c:data:`errno`. La función más general es :c:func:`PyErr_SetObject`, que toma dos argumentos de objeto, la excepción y su valor asociado. No es necesario que :c:func:`Py_INCREF` los objetos pasados a cualquiera de estas funciones.

source: You can test non-destructively whether an exception has been set with :c:func:`PyErr_Occurred`. This returns the current exception object, or ``NULL`` if no exception has occurred. You normally don't need to call :c:func:`PyErr_Occurred` to see whether an error occurred in a function call, since you should be able to tell from the return value.
es_es: Puede comprobar de forma no destructiva si se ha producido una excepción con :c:func:`PyErr_Occurred`. Esto devuelve el objeto de excepción actual, o ``NULL`` si no se ha producido ninguna excepción. Normalmente no es necesario llamar a :c:func:`PyErr_Occurred` para ver si se ha producido un error en una llamada a una función, ya que debería ser capaz de saberlo por el valor de retorno.

source: To ignore an exception set by a function call that failed, the exception condition must be cleared explicitly by calling :c:func:`PyErr_Clear`. The only time C code should call :c:func:`PyErr_Clear` is if it doesn't want to pass the error on to the interpreter but wants to handle it completely by itself (possibly by trying something else, or pretending nothing went wrong).
es_es: Para ignorar una excepción establecida por una llamada a una función que falló, la condición de excepción debe ser limpiada explícitamente llamando a :c:func:`PyErr_Clear`. La única vez que el código C debería llamar a :c:func:`PyErr_Clear` es si no quiere pasar el error al intérprete sino que quiere manejarlo completamente por sí mismo (posiblemente intentando algo más, o pretendiendo que nada ha ido mal).

source: Every failing :c:func:`malloc` call must be turned into an exception --- the direct caller of :c:func:`malloc` (or :c:func:`realloc`) must call :c:func:`PyErr_NoMemory` and return a failure indicator itself. All the object-creating functions (for example, :c:func:`PyLong_FromLong`) already do this, so this note is only relevant to those who call :c:func:`malloc` directly.
es_es: Cada llamada fallida a :c:func:`malloc` debe convertirse en una excepción --- el llamador directo de :c:func:`malloc` (o :c:func:`realloc`) debe llamar a :c:func:`PyErr_NoMemory` y devolver él mismo un indicador de fallo. Todas las funciones de creación de objetos (por ejemplo, :c:func:`PyLong_FromLong`) ya hacen esto, por lo que esta nota sólo es relevante para aquellos que llaman directamente a :c:func:`malloc`.

source: Also note that, with the important exception of :c:func:`PyArg_ParseTuple` and friends, functions that return an integer status usually return a positive value or zero for success and ``-1`` for failure, like Unix system calls.
es_es: También tenga en cuenta que, con la importante excepción de :c:func:`PyArg_ParseTuple` y amigos, las funciones que devuelven un estado entero generalmente devuelven un valor positivo o cero para el éxito y ``-1`` para el fallo, al igual que las llamadas al sistema Unix.

source: Finally, be careful to clean up garbage (by making :c:func:`Py_XDECREF` or :c:func:`Py_DECREF` calls for objects you have already created) when you return an error indicator!
es_es: Finalmente, ¡ten cuidado de limpiar la basura (haciendo llamadas a :c:func:`Py_XDECREF` o :c:func:`Py_DECREF` para los objetos que ya has creado) cuando devuelvas un indicador de error!

source: You can also define a new exception that is unique to your module. For this, you usually declare a static object variable at the beginning of your file::
es_es: También puedes definir una nueva excepción que sea única para tu módulo. Para esto, generalmente declaras una variable de objeto estático al principio de tu archivo::

source: Back to the Example
es_es: Volver al ejemplo

source: Going back to our example function, you should now be able to understand this statement::
es_es: Volviendo a nuestra función de ejemplo, ahora deberías ser capaz de entender esta afirmación::

source: The next statement is a call to the Unix function :c:func:`system`, passing it the string we just got from :c:func:`PyArg_ParseTuple`::
es_es: La siguiente sentencia es una llamada a la función Unix :c:func:`system`, pasándole la cadena que acabamos de obtener de :c:func:`PyArg_ParseTuple`::

source: In this case, it will return an integer object. (Yes, even integers are objects on the heap in Python!)
es_es: En este caso, devolverá un objeto entero. (¡Sí, incluso los enteros son objetos en el montón en Python!)

source: :c:data:`Py_None` is the C name for the special Python object ``None``. It is a genuine Python object rather than a ``NULL`` pointer, which means "error" in most contexts, as we have seen.
es_es: :c:data:`Py_None` es el nombre en C del objeto especial de Python ``None``. Es un objeto Python genuino en lugar de un puntero ``NULL``, que significa "error" en la mayoría de los contextos, como hemos visto.

source: The Module's Method Table and Initialization Function
es_es: Tabla de métodos del módulo y función de inicialización

source: Note the third entry (``METH_VARARGS``). This is a flag telling the interpreter the calling convention to be used for the C function. It should normally always be ``METH_VARARGS`` or ``METH_VARARGS | METH_KEYWORDS``; a value of ``0`` means that an obsolete variant of :c:func:`PyArg_ParseTuple` is used.
es_es: Observe la tercera entrada (``METH_VARARGS``). Se trata de una bandera que indica al intérprete la convención de llamada a utilizar para la función C. Normalmente debería ser siempre o . Normalmente debería ser siempre ``METH_VARARGS`` o ``METH_VARARGS | METH_KEYWORDS``; un valor de ``0`` significa que se usa una variante obsoleta de :c:func:`PyArg_ParseTuple`.

source: When using only ``METH_VARARGS``, the function should expect the Python-level parameters to be passed in as a tuple acceptable for parsing via :c:func:`PyArg_ParseTuple`; more information on this function is provided below.
es_es: Cuando sólo se utiliza ``METH_VARARGS``, la función debe esperar que los parámetros de nivel Python se pasen como una tupla aceptable para el análisis sintáctico a través de :c:func:`PyArg_ParseTuple`; más adelante se proporciona más información sobre esta función.

source: The method table must be referenced in the module definition structure::
es_es: La tabla de métodos debe estar referenciada en la estructura de definición del módulo::

source: Removing entries from ``sys.modules`` or importing compiled modules into multiple interpreters within a process (or following a :c:func:`fork` without an intervening :c:func:`exec`) can create problems for some extension modules. Extension module authors should exercise caution when initializing internal data structures.
es_es: La eliminación de entradas de ``sys.modules`` o la importación de módulos compilados en múltiples intérpretes dentro de un proceso (o después de un :c:func:`fork` sin un :c:func:`exec` intermedio) puede crear problemas para algunos módulos de extensión. Los autores de módulos de ampliación deben tener cuidado al inicializar estructuras de datos internas.

source: A more substantial example module is included in the Python source distribution as :file:`Modules/xxmodule.c`. This file may be used as a template or simply read as an example.
es_es: En la distribución del código fuente de Python se incluye un módulo de ejemplo más sustancial como :file:`Modules/xxmodule.c`. Este archivo puede utilizarse como plantilla o simplemente leerse como ejemplo.

source: Unlike our ``spam`` example, ``xxmodule`` uses *multi-phase initialization* (new in Python 3.5), where a PyModuleDef structure is returned from ``PyInit_spam``, and creation of the module is left to the import machinery. For details on multi-phase initialization, see :PEP:`489`.
es_es: A diferencia de nuestro ejemplo ``spam``, ``xxmodule`` usa *inicialización multifase* (nueva en Python 3.5), donde una estructura PyModuleDef es devuelta desde ``PyInit_spam``, y la creación del módulo se deja a la maquinaria de importación. Para más detalles sobre la inicialización multifase, vea :PEP:`489`.

source: Compilation and Linkage
es_es: Recopilación y enlace

source: There are two more things to do before you can use your new extension: compiling and linking it with the Python system. If you use dynamic loading, the details may depend on the style of dynamic loading your system uses; see the chapters about building extension modules (chapter :ref:`building`) and additional information that pertains only to building on Windows (chapter :ref:`building-on-windows`) for more information about this.
es_es: Hay dos cosas más que hacer antes de que puedas usar tu nueva extensión: compilarla y enlazarla con el sistema Python. Si usas carga dinámica, los detalles pueden depender del estilo de carga dinámica que use tu sistema; mira los capítulos sobre construcción de módulos de extensión (capítulo :ref:`building`) e información adicional que pertenece sólo a la construcción en Windows (capítulo :ref:`building-on-windows`) para más información sobre esto.

source: If you can't use dynamic loading, or if you want to make your module a permanent part of the Python interpreter, you will have to change the configuration setup and rebuild the interpreter. Luckily, this is very simple on Unix: just place your file (:file:`spammodule.c` for example) in the :file:`Modules/` directory of an unpacked source distribution, add a line to the file :file:`Modules/Setup.local` describing your file:
es_es: Si no puedes usar la carga dinámica, o si quieres hacer de tu módulo una parte permanente del intérprete de Python, tendrás que cambiar la configuración y reconstruir el intérprete. Afortunadamente, esto es muy simple en Unix: simplemente coloque su archivo (:file:`spammodule.c` por ejemplo) en el directorio :file:`Modules/` de una distribución fuente desempaquetada, añada una línea al archivo :file:`Modules/Setup.local` describiendo su archivo:

source: and rebuild the interpreter by running :program:`make` in the toplevel directory. You can also run :program:`make` in the :file:`Modules/` subdirectory, but then you must first rebuild :file:`Makefile` there by running ':program:`make` Makefile'. (This is necessary each time you change the :file:`Setup` file.)
es_es: y reconstruya el intérprete ejecutando :program:`make` en el directorio toplevel. También puede ejecutar :program:`make` en el subdirectorio :file:`Modules/`, pero entonces primero debe reconstruir :file:`Makefile` allí ejecutando ':program:`make` Makefile'. (Esto es necesario cada vez que cambie el archivo :file:`Setup` ).

source: If your module requires additional libraries to link with, these can be listed on the line in the configuration file as well, for instance:
es_es: Si su módulo requiere bibliotecas adicionales para enlazar, estas también se pueden listar en la línea del archivo de configuración, por ejemplo:

source: Calling Python Functions from C
es_es: Llamando a funciones de Python desde C
