Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/extending/newtypes_tutorial.po
Languages: ru

source: Defining Extension Types: Tutorial
ru: Определение типов расширений: Учебное пособие

source: Python allows the writer of a C extension module to define new types that can be manipulated from Python code, much like the built-in :class:`str` and :class:`list` types. The code for all extension types follows a pattern, but there are some details that you need to understand before you can get started. This document is a gentle introduction to the topic.
ru: Python позволяет разработчику модуля расширения C определять новые типы, которыми можно манипулировать из кода Python, во многом подобно встроенным типам :class:`str` и :class:`list`. Код для всех типов расширений соответствует шаблону, но есть некоторые детали, которые вам необходимо понять, прежде чем приступить к работе. Этот документ представляет собой краткое введение в тему.

source: The Basics
ru: Основы

source: The :term:`CPython` runtime sees all Python objects as variables of type :c:expr:`PyObject*`, which serves as a "base type" for all Python objects. The :c:type:`PyObject` structure itself only contains the object's :term:`reference count` and a pointer to the object's "type object". This is where the action is; the type object determines which (C) functions get called by the interpreter when, for instance, an attribute gets looked up on an object, a method called, or it is multiplied by another object. These C functions are called "type methods".
ru: Среда выполнения :term:`CPython` рассматривает все объекты Python как переменные типа :c:expr:`PyObject*`, который служит «базовым типом» для всех объектов Python. Сама структура :c:type:`PyObject` содержит только :term:`счётчик ссылок` объекта и указатель на «тип объекта». Вот где действие; объект типа определяет, какие функции (C) вызываются интерпретатором, когда, например, атрибут ищется в объекте, вызывается метод или он умножается на другой объект. Эти функции C называются «методами типов».

source: So, if you want to define a new extension type, you need to create a new type object.
ru: Итак, если вы хотите определить новый тип расширения, вам необходимо создать объект нового типа.

source: This sort of thing can only be explained by example, so here's a minimal, but complete, module that defines a new type named :class:`!Custom` inside a C extension module :mod:`!custom`:
ru: Подобные вещи можно объяснить только на примере, поэтому вот минимальный, но полный модуль, который определяет новый тип с именем :class:`!Custom` внутри модуля расширения C :mod:`!custom`:

source: What we're showing here is the traditional way of defining *static* extension types. It should be adequate for most uses. The C API also allows defining heap-allocated extension types using the :c:func:`PyType_FromSpec` function, which isn't covered in this tutorial.
ru: Здесь мы показываем традиционный способ определения *статических* типов расширений. Этого должно быть достаточно для большинства применений. API C также позволяет определять типы расширений, выделяемые в куче, с помощью функции :c:func:`PyType_FromSpec`, которая не рассматривается в этом руководстве.

source: Now that's quite a bit to take in at once, but hopefully bits will seem familiar from the previous chapter. This file defines three things:
ru: Это довольно много, что нужно усвоить сразу, но, надеюсь, некоторые моменты покажутся вам знакомыми из предыдущей главы. Этот файл определяет три вещи:

source: What a :class:`!Custom` **object** contains: this is the ``CustomObject`` struct, which is allocated once for each :class:`!Custom` instance.
ru: Что содержит :class:`!Custom` **объект**: это структура ``CustomObject``, которая выделяется один раз для каждого экземпляра :class:`!Custom`.

source: How the :class:`!Custom` **type** behaves: this is the ``CustomType`` struct, which defines a set of flags and function pointers that the interpreter inspects when specific operations are requested.
ru: Как ведет себя :class:`!Custom` **type**: это структура ``CustomType``, которая определяет набор флагов и указателей на функции, которые интерпретатор проверяет при запросе определенных операций.

source: How to initialize the :mod:`!custom` module: this is the ``PyInit_custom`` function and the associated ``custommodule`` struct.
ru: Как инициализировать модуль :mod:`!custom`: это функция ``PyInit_custom`` и связанная с ней структура ``custommodule``.

source: The first bit is::
ru: Первый бит::

source: This is what a Custom object will contain. ``PyObject_HEAD`` is mandatory at the start of each object struct and defines a field called ``ob_base`` of type :c:type:`PyObject`, containing a pointer to a type object and a reference count (these can be accessed using the macros :c:macro:`Py_TYPE` and :c:macro:`Py_REFCNT` respectively). The reason for the macro is to abstract away the layout and to enable additional fields in :ref:`debug builds <debug-build>`.
ru: Это то, что будет содержать пользовательский объект. ``PyObject_HEAD`` является обязательным в начале каждой структуры объекта и определяет поле ``ob_base`` типа :c:type:`PyObject`, содержащее указатель на объект типа и счетчик ссылок (они могут быть доступ осуществляется с помощью макросов :c:macro:`Py_TYPE` и :c:macro:`Py_REFCNT` соответственно). Целью использования макроса является абстрагирование макета и включение дополнительных полей в :ref:`debug builds <debug-build>`.

source: There is no semicolon above after the :c:macro:`PyObject_HEAD` macro. Be wary of adding one by accident: some compilers will complain.
ru: Точка с запятой выше после макроса :c:macro:`PyObject_HEAD` отсутствует. Будьте осторожны, добавляя его случайно: некоторые компиляторы будут жаловаться.

source: Of course, objects generally store additional data besides the standard ``PyObject_HEAD`` boilerplate; for example, here is the definition for standard Python floats::
ru: Конечно, объекты обычно хранят дополнительные данные помимо стандартного шаблона PyObject_HEAD; например, вот определение стандартных чисел с плавающей точкой Python:

source: The second bit is the definition of the type object. ::
ru: Второй бит — это определение типа объекта. ::

source: We recommend using C99-style designated initializers as above, to avoid listing all the :c:type:`PyTypeObject` fields that you don't care about and also to avoid caring about the fields' declaration order.
ru: Мы рекомендуем использовать назначенные инициализаторы в стиле C99, как указано выше, чтобы не перечислять все поля :c:type:`PyTypeObject`, которые вам не нужны, а также чтобы не заботиться о порядке объявления полей.

source: The actual definition of :c:type:`PyTypeObject` in :file:`object.h` has many more :ref:`fields <type-structs>` than the definition above. The remaining fields will be filled with zeros by the C compiler, and it's common practice to not specify them explicitly unless you need them.
ru: Фактическое определение :c:type:`PyTypeObject` в :file:`object.h` имеет гораздо больше :ref:`полей <type-structs>`, чем определение выше. Остальные поля будут заполнены нулями компилятором C, и общепринятой практикой является не указывать их явно, если они вам не нужны.

source: We're going to pick it apart, one field at a time::
ru: Мы собираемся разобрать его по одному полю за раз::

source: This line is mandatory boilerplate to initialize the ``ob_base`` field mentioned above. ::
ru: Эта строка является обязательным шаблоном для инициализации поля ob_base, упомянутого выше. ::

source: The name of our type. This will appear in the default textual representation of our objects and in some error messages, for example:
ru: Название нашего типа. Это будет отображаться в текстовом представлении наших объектов по умолчанию и в некоторых сообщениях об ошибках, например:

source: Note that the name is a dotted name that includes both the module name and the name of the type within the module. The module in this case is :mod:`!custom` and the type is :class:`!Custom`, so we set the type name to :class:`!custom.Custom`. Using the real dotted import path is important to make your type compatible with the :mod:`pydoc` and :mod:`pickle` modules. ::
ru: Обратите внимание, что имя представляет собой имя, разделенное точками, которое включает в себя как имя модуля, так и имя типа внутри модуля. В данном случае модуль — :mod:`!custom`, а тип — :class:`!Custom`, поэтому мы устанавливаем имя типа :class:`!custom.Custom`. Использование реального пути импорта, разделенного точками, важно для обеспечения совместимости вашего типа с модулями :mod:`pydoc` и :mod:`pickle`. ::

source: This is so that Python knows how much memory to allocate when creating new :class:`!Custom` instances. :c:member:`~PyTypeObject.tp_itemsize` is only used for variable-sized objects and should otherwise be zero.
ru: Это сделано для того, чтобы Python знал, сколько памяти следует выделить при создании новых экземпляров :class:`!Custom`. :c:member:`~PyTypeObject.tp_itemsize` используется только для объектов переменного размера и в противном случае должен быть равен нулю.

source: If you want your type to be subclassable from Python, and your type has the same :c:member:`~PyTypeObject.tp_basicsize` as its base type, you may have problems with multiple inheritance. A Python subclass of your type will have to list your type first in its :attr:`~type.__bases__`, or else it will not be able to call your type's :meth:`~object.__new__` method without getting an error. You can avoid this problem by ensuring that your type has a larger value for :c:member:`~PyTypeObject.tp_basicsize` than its base type does. Most of the time, this will be true anyway, because either your base type will be :class:`object`, or else you will be adding data members to your base type, and therefore increasing its size.
ru: Если вы хотите, чтобы ваш тип был подклассом Python, и ваш тип имеет тот же :c:member:`~PyTypeObject.tp_basicsize`, что и его базовый тип, у вас могут возникнуть проблемы с множественным наследованием. Подкласс Python вашего типа должен будет сначала указать ваш тип в своем :attr:`~type.__bases__`, иначе он не сможет вызвать метод :meth:`~object.__new__` вашего типа без получения ошибки. . Вы можете избежать этой проблемы, гарантируя, что ваш тип имеет большее значение для :c:member:`~PyTypeObject.tp_basicsize`, чем его базовый тип. В большинстве случаев это будет верно в любом случае, потому что либо вашим базовым типом будет :class:`object`, либо вы будете добавлять элементы данных к своему базовому типу и, следовательно, увеличивать его размер.

source: We set the class flags to :c:macro:`Py_TPFLAGS_DEFAULT`. ::
ru: Мы устанавливаем флаги класса :c:macro:`Py_TPFLAGS_DEFAULT`. ::

source: All types should include this constant in their flags. It enables all of the members defined until at least Python 3.3. If you need further members, you will need to OR the corresponding flags.
ru: Все типы должны включать эту константу в свои флаги. Он включает все члены, определенные как минимум до версии Python 3.3. Если вам нужны дополнительные члены, вам нужно будет ИЛИ соответствующие флаги.

source: We provide a doc string for the type in :c:member:`~PyTypeObject.tp_doc`. ::
ru: Мы предоставляем строку документа для типа в :c:member:`~PyTypeObject.tp_doc`. ::

source: To enable object creation, we have to provide a :c:member:`~PyTypeObject.tp_new` handler. This is the equivalent of the Python method :meth:`~object.__new__`, but has to be specified explicitly. In this case, we can just use the default implementation provided by the API function :c:func:`PyType_GenericNew`. ::
ru: Чтобы включить создание объекта, мы должны предоставить обработчик :c:member:`~PyTypeObject.tp_new`. Это эквивалент метода Python :meth:`~object.__new__`, но его необходимо указать явно. В этом случае мы можем просто использовать реализацию по умолчанию, предоставляемую функцией API :c:func:`PyType_GenericNew`. ::

source: Everything else in the file should be familiar, except for some code in :c:func:`!PyInit_custom`::
ru: Все остальное в файле должно быть вам знакомо, за исключением некоторого кода в :c:func:`!PyInit_custom`::

source: This initializes the :class:`!Custom` type, filling in a number of members to the appropriate default values, including :c:member:`~PyObject.ob_type` that we initially set to ``NULL``. ::
ru: Это инициализирует тип :class:`!Custom`, заполняя ряд членов соответствующими значениями по умолчанию, включая :c:member:`~PyObject.ob_type`, для которого мы изначально установили значение ``NULL``. ::

source: This adds the type to the module dictionary. This allows us to create :class:`!Custom` instances by calling the :class:`!Custom` class:
ru: Это добавит тип в словарь модуля. Это позволяет нам создавать экземпляры :class:`!Custom`, вызывая класс :class:`!Custom`:

source: That's it! All that remains is to build it; put the above code in a file called :file:`custom.c`,
ru: Вот и все! Остается только построить его; поместите приведенный выше код в файл с именем :file:`custom.c`,

source: in a file called :file:`pyproject.toml`, and
ru: в файле с именем :file:`pyproject.toml` и

source: in a file called :file:`setup.py`; then typing
ru: в файле с именем :file:`setup.py`; затем набираю

source: in a shell should produce a file :file:`custom.so` in a subdirectory and install it; now fire up Python --- you should be able to ``import custom`` and play around with ``Custom`` objects.
ru: в оболочке следует создать файл :file:`custom.so` в подкаталоге и установить его; теперь запустите Python --- вы сможете ``импортировать пользовательские`` и экспериментировать с ``Пользовательскими`` объектами.

source: That wasn't so hard, was it?
ru: Это было не так уж сложно, не так ли?

source: Of course, the current Custom type is pretty uninteresting. It has no data and doesn't do anything. It can't even be subclassed.
ru: Конечно, нынешний тип Custom довольно неинтересен. Он не имеет данных и ничего не делает. Его даже нельзя разделить на подклассы.

source: Adding data and methods to the Basic example
ru: Добавление данных и методов в пример Basic

source: Let's extend the basic example to add some data and methods. Let's also make the type usable as a base class. We'll create a new module, :mod:`!custom2` that adds these capabilities:
ru: Давайте расширим базовый пример, добавив некоторые данные и методы. Давайте также сделаем этот тип пригодным для использования в качестве базового класса. Мы создадим новый модуль :mod:`!custom2`, который добавит следующие возможности:

source: This version of the module has a number of changes.
ru: В этой версии модуля имеется ряд изменений.

source: The :class:`!Custom` type now has three data attributes in its C struct, *first*, *last*, and *number*. The *first* and *last* variables are Python strings containing first and last names. The *number* attribute is a C integer.
ru: Тип :class:`!Custom` теперь имеет три атрибута данных в своей структуре C: *first*, *last* и *number*. Переменные *first* и *last* представляют собой строки Python, содержащие имя и фамилию. Атрибут *number* представляет собой целое число C.

source: The object structure is updated accordingly::
ru: Структура объекта обновляется соответствующим образом:

source: Because we now have data to manage, we have to be more careful about object allocation and deallocation. At a minimum, we need a deallocation method::
ru: Поскольку теперь у нас есть данные, которыми нужно управлять, нам следует быть более осторожными при распределении и освобождении объектов. Как минимум, нам нужен метод освобождения::

source: which is assigned to the :c:member:`~PyTypeObject.tp_dealloc` member::
ru: который назначен члену :c:member:`~PyTypeObject.tp_dealloc`::

source: This method first clears the reference counts of the two Python attributes. :c:func:`Py_XDECREF` correctly handles the case where its argument is ``NULL`` (which might happen here if ``tp_new`` failed midway). It then calls the :c:member:`~PyTypeObject.tp_free` member of the object's type (computed by ``Py_TYPE(self)``) to free the object's memory. Note that the object's type might not be :class:`!CustomType`, because the object may be an instance of a subclass.
ru: Этот метод сначала очищает счетчики ссылок двух атрибутов Python. :c:func:`Py_XDECREF` правильно обрабатывает случай, когда его аргумент равен ``NULL`` (что может произойти здесь, если ``tp_new`` не удалось выполнить на полпути). Затем он вызывает член :c:member:`~PyTypeObject.tp_free` типа объекта (вычисленный ``Py_TYPE(self)``), чтобы освободить память объекта. Обратите внимание, что тип объекта может отличаться от :class:`!CustomType`, поскольку объект может быть экземпляром подкласса.

source: The explicit cast to ``destructor`` above is needed because we defined ``Custom_dealloc`` to take a ``CustomObject *`` argument, but the ``tp_dealloc`` function pointer expects to receive a ``PyObject *`` argument. Otherwise, the compiler will emit a warning. This is object-oriented polymorphism, in C!
ru: Явное приведение к ``destructor``, указанное выше, необходимо, поскольку мы определили ``Custom_dealloc`` для приема аргумента ``CustomObject *``, но указатель функции ``tp_dealloc`` ожидает получения ``PyObject *`` аргумент. В противном случае компилятор выдаст предупреждение. Это объектно-ориентированный полиморфизм в C!

source: We want to make sure that the first and last names are initialized to empty strings, so we provide a ``tp_new`` implementation::
ru: Мы хотим быть уверены, что имя и фамилия инициализируются пустыми строками, поэтому мы предоставляем реализацию ``tp_new``::

source: and install it in the :c:member:`~PyTypeObject.tp_new` member::
ru: и установите его в элементе :c:member:`~PyTypeObject.tp_new`::

source: The ``tp_new`` handler is responsible for creating (as opposed to initializing) objects of the type. It is exposed in Python as the :meth:`~object.__new__` method. It is not required to define a ``tp_new`` member, and indeed many extension types will simply reuse :c:func:`PyType_GenericNew` as done in the first version of the :class:`!Custom` type above. In this case, we use the ``tp_new`` handler to initialize the ``first`` and ``last`` attributes to non-``NULL`` default values.
ru: Обработчик tp_new отвечает за создание (в отличие от инициализации) объектов этого типа. В Python он представлен как метод :meth:`~object.__new__`. Не требуется определять член ``tp_new``, и действительно, многие типы расширений будут просто повторно использовать :c:func:`PyType_GenericNew`, как это было сделано в первой версии типа :class:`!Custom` выше. В этом случае мы используем обработчик tp_new для инициализации атрибутов first и Last со значениями по умолчанию, отличными от NULL.

source: ``tp_new`` is passed the type being instantiated (not necessarily ``CustomType``, if a subclass is instantiated) and any arguments passed when the type was called, and is expected to return the instance created. ``tp_new`` handlers always accept positional and keyword arguments, but they often ignore the arguments, leaving the argument handling to initializer (a.k.a. ``tp_init`` in C or ``__init__`` in Python) methods.
ru: ``tp_new`` передается тип, экземпляр которого создается (не обязательно CustomType, если создается экземпляр подкласса) и все аргументы, передаваемые при вызове типа, и ожидается, что он вернет созданный экземпляр. Обработчики ``tp_new`` всегда принимают позиционные и ключевые аргументы, но они часто игнорируют аргументы, оставляя обработку аргументов методам инициализатора (также известного как ``tp_init`` в C или ``__init__`` в Python).

source: ``tp_new`` shouldn't call ``tp_init`` explicitly, as the interpreter will do it itself.
ru: ``tp_new`` не должен вызывать ``tp_init`` явно, поскольку интерпретатор сделает это сам.

source: The ``tp_new`` implementation calls the :c:member:`~PyTypeObject.tp_alloc` slot to allocate memory::
ru: Реализация tp_new вызывает слот :c:member:`~PyTypeObject.tp_alloc` для выделения памяти:

source: Since memory allocation may fail, we must check the :c:member:`~PyTypeObject.tp_alloc` result against ``NULL`` before proceeding.
ru: Поскольку выделение памяти может оказаться неудачным, мы должны проверить результат :c:member:`~PyTypeObject.tp_alloc` на соответствие ``NULL``, прежде чем продолжить.

source: We didn't fill the :c:member:`~PyTypeObject.tp_alloc` slot ourselves. Rather :c:func:`PyType_Ready` fills it for us by inheriting it from our base class, which is :class:`object` by default. Most types use the default allocation strategy.
ru: Мы не заполняли слот :c:member:`~PyTypeObject.tp_alloc` самостоятельно. Скорее :c:func:`PyType_Ready` заполняет его за нас, наследуя от нашего базового класса, которым по умолчанию является :class:`object`. Большинство типов используют стратегию распределения по умолчанию.

source: If you are creating a co-operative :c:member:`~PyTypeObject.tp_new` (one that calls a base type's :c:member:`~PyTypeObject.tp_new` or :meth:`~object.__new__`), you must *not* try to determine what method to call using method resolution order at runtime. Always statically determine what type you are going to call, and call its :c:member:`~PyTypeObject.tp_new` directly, or via ``type->tp_base->tp_new``. If you do not do this, Python subclasses of your type that also inherit from other Python-defined classes may not work correctly. (Specifically, you may not be able to create instances of such subclasses without getting a :exc:`TypeError`.)
ru: Если вы создаете кооператив :c:member:`~PyTypeObject.tp_new` (который вызывает :c:member:`~PyTypeObject.tp_new` или :meth:`~object.__new__` базового типа), вы *не* должен пытаться определить, какой метод вызывать, используя порядок разрешения методов во время выполнения. Всегда статически определяйте, какой тип вы собираетесь вызывать, и вызывайте его :c:member:`~PyTypeObject.tp_new` напрямую или через ``type->tp_base->tp_new``. Если вы этого не сделаете, подклассы Python вашего типа, которые также наследуются от других классов, определенных Python, могут работать неправильно. (В частности, вы не сможете создавать экземпляры таких подклассов без получения :exc:`TypeError`.)

source: We also define an initialization function which accepts arguments to provide initial values for our instance::
ru: Мы также определяем функцию инициализации, которая принимает аргументы для предоставления начальных значений для нашего экземпляра:

source: by filling the :c:member:`~PyTypeObject.tp_init` slot. ::
ru: заполнив слот :c:member:`~PyTypeObject.tp_init`. ::

source: The :c:member:`~PyTypeObject.tp_init` slot is exposed in Python as the :meth:`~object.__init__` method. It is used to initialize an object after it's created. Initializers always accept positional and keyword arguments, and they should return either ``0`` on success or ``-1`` on error.
ru: Слот :c:member:`~PyTypeObject.tp_init` представлен в Python как метод :meth:`~object.__init__`. Он используется для инициализации объекта после его создания. Инициализаторы всегда принимают позиционные и ключевые аргументы и должны возвращать либо «0» в случае успеха, либо «-1» в случае ошибки.
