Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/extending/newtypes_tutorial.po
Languages: ru

source: The :c:type:`PyTypeObject` struct supports a :c:member:`~PyTypeObject.tp_base` specifying the type's concrete base class. Due to cross-platform compiler issues, you can't fill that field directly with a reference to :c:type:`PyList_Type`; it should be done later in the module initialization function::
ru: Структура :c:type:`PyTypeObject` поддерживает :c:member:`~PyTypeObject.tp_base`, определяющий конкретный базовый класс типа. Из-за проблем с кросс-платформенным компилятором вы не можете заполнить это поле напрямую ссылкой на :c:type:`PyList_Type`; это следует сделать позже в функции инициализации модуля::

source: Before calling :c:func:`PyType_Ready`, the type structure must have the :c:member:`~PyTypeObject.tp_base` slot filled in. When we are deriving an existing type, it is not necessary to fill out the :c:member:`~PyTypeObject.tp_alloc` slot with :c:func:`PyType_GenericNew` -- the allocation function from the base type will be inherited.
ru: Перед вызовом :c:func:`PyType_Ready` в структуре типа должен быть заполнен слот :c:member:`~PyTypeObject.tp_base`. Когда мы получаем существующий тип, нет необходимости заполнять :c :member:`~PyTypeObject.tp_alloc` слот с :c:func:`PyType_GenericNew` — функция выделения из базового типа будет унаследована.

source: After that, calling :c:func:`PyType_Ready` and adding the type object to the module is the same as with the basic :class:`!Custom` examples.
ru: После этого вызов :c:func:`PyType_Ready` и добавление объекта типа в модуль осуществляется так же, как и в базовых примерах :class:`!Custom`.

source: Footnotes
ru: Сноски

source: This is true when we know that the object is a basic type, like a string or a float.
ru: Это верно, когда мы знаем, что объект имеет базовый тип, например строку или число с плавающей запятой.

source: We relied on this in the :c:member:`~PyTypeObject.tp_dealloc` handler in this example, because our type doesn't support garbage collection.
ru: В этом примере мы полагались на это в обработчике :c:member:`~PyTypeObject.tp_dealloc`, поскольку наш тип не поддерживает сборку мусора.

source: We now know that the first and last members are strings, so perhaps we could be less careful about decrementing their reference counts, however, we accept instances of string subclasses. Even though deallocating normal strings won't call back into our objects, we can't guarantee that deallocating an instance of a string subclass won't call back into our objects.
ru: Теперь мы знаем, что первый и последний члены являются строками, поэтому, возможно, нам следует быть менее осторожными при уменьшении их счетчиков ссылок, однако мы принимаем экземпляры подклассов строк. Несмотря на то, что освобождение обычных строк не приведет к обратному вызову наших объектов, мы не можем гарантировать, что освобождение экземпляра подкласса строк не приведет к обратному вызову наших объектов.

source: Also, even with our attributes restricted to strings instances, the user could pass arbitrary :class:`str` subclasses and therefore still create reference cycles.
ru: Кроме того, даже несмотря на то, что наши атрибуты ограничены экземплярами строк, пользователь может передавать произвольные подклассы :class:`str` и, следовательно, по-прежнему создавать ссылочные циклы.
