Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/extending/newtypes_tutorial.po
Languages: ru

source: Unlike the ``tp_new`` handler, there is no guarantee that ``tp_init`` is called at all (for example, the :mod:`pickle` module by default doesn't call :meth:`~object.__init__` on unpickled instances). It can also be called multiple times. Anyone can call the :meth:`!__init__` method on our objects. For this reason, we have to be extra careful when assigning the new attribute values. We might be tempted, for example to assign the ``first`` member like this::
ru: В отличие от обработчика tp_new, нет никакой гарантии, что tp_init вообще будет вызван (например, модуль :mod:`pickle` по умолчанию не вызывает :meth:`~object.__init__` на немаринованных экземплярах). Его также можно вызывать несколько раз. Любой может вызвать метод :meth:`!__init__` для наших объектов. По этой причине мы должны быть особенно осторожны при назначении новых значений атрибутов. У нас может возникнуть соблазн, например, назначить ``первый`` член следующим образом:

source: But this would be risky. Our type doesn't restrict the type of the ``first`` member, so it could be any kind of object. It could have a destructor that causes code to be executed that tries to access the ``first`` member; or that destructor could release the :term:`Global interpreter Lock <GIL>` and let arbitrary code run in other threads that accesses and modifies our object.
ru: Но это было бы рискованно. Наш тип не ограничивает тип «первого» члена, поэтому это может быть объект любого типа. Он может иметь деструктор, вызывающий выполнение кода, пытающегося получить доступ к «первому» члену; или этот деструктор может освободить :term:`Глобальную блокировку интерпретатора <GIL>` и позволить произвольному коду выполняться в других потоках, которые обращаются к нашему объекту и изменяют его.

source: To be paranoid and protect ourselves against this possibility, we almost always reassign members before decrementing their reference counts. When don't we have to do this?
ru: Чтобы быть параноиками и защитить себя от такой возможности, мы почти всегда переназначаем членов перед уменьшением их счетчика ссылок. Когда нам не нужно это делать?

source: when we absolutely know that the reference count is greater than 1;
ru: когда мы абсолютно знаем, что счетчик ссылок больше 1;

source: when we know that deallocation of the object [#]_ will neither release the :term:`GIL` nor cause any calls back into our type's code;
ru: когда мы знаем, что освобождение объекта [#]_ не будет ни освобождать :term:`GIL`, ни вызывать какие-либо обратные вызовы в код нашего типа;

source: when decrementing a reference count in a :c:member:`~PyTypeObject.tp_dealloc` handler on a type which doesn't support cyclic garbage collection [#]_.
ru: при уменьшении счетчика ссылок в обработчике :c:member:`~PyTypeObject.tp_dealloc` для типа, который не поддерживает циклическую сборку мусора [#]_ .

source: We want to expose our instance variables as attributes. There are a number of ways to do that. The simplest way is to define member definitions::
ru: Мы хотим представить переменные экземпляра как атрибуты. Есть несколько способов сделать это. Самый простой способ — определить определения членов:

source: and put the definitions in the :c:member:`~PyTypeObject.tp_members` slot::
ru: и поместите определения в слот :c:member:`~PyTypeObject.tp_members`::

source: Each member definition has a member name, type, offset, access flags and documentation string. See the :ref:`Generic-Attribute-Management` section below for details.
ru: Каждое определение члена имеет имя члена, тип, смещение, флаги доступа и строку документации. Подробности смотрите в разделе Generic-Attribute-Management ниже.

source: A disadvantage of this approach is that it doesn't provide a way to restrict the types of objects that can be assigned to the Python attributes. We expect the first and last names to be strings, but any Python objects can be assigned. Further, the attributes can be deleted, setting the C pointers to ``NULL``. Even though we can make sure the members are initialized to non-``NULL`` values, the members can be set to ``NULL`` if the attributes are deleted.
ru: Недостатком этого подхода является то, что он не позволяет ограничить типы объектов, которые можно назначать атрибутам Python. Мы ожидаем, что имя и фамилия будут строками, но можно присваивать любые объекты Python. Кроме того, атрибуты можно удалить, установив для указателей C значение NULL. Несмотря на то, что мы можем быть уверены, что члены инициализируются значениями, отличными от NULL, члены могут быть установлены в NULL, если атрибуты удалены.

source: We define a single method, :meth:`!Custom.name`, that outputs the objects name as the concatenation of the first and last names. ::
ru: Мы определяем единственный метод :meth:`!Custom.name`, который выводит имя объекта как объединение имени и фамилии. ::

source: The method is implemented as a C function that takes a :class:`!Custom` (or :class:`!Custom` subclass) instance as the first argument. Methods always take an instance as the first argument. Methods often take positional and keyword arguments as well, but in this case we don't take any and don't need to accept a positional argument tuple or keyword argument dictionary. This method is equivalent to the Python method:
ru: Метод реализован как функция C, которая принимает экземпляр :class:`!Custom` (или подкласса :class:`!Custom`) в качестве первого аргумента. Методы всегда принимают экземпляр в качестве первого аргумента. Методы также часто принимают позиционные аргументы и аргументы по ключевым словам, но в этом случае мы их не принимаем и нам не нужно принимать кортеж позиционных аргументов или словарь аргументов ключевых слов. Этот метод эквивалентен методу Python:

source: Note that we have to check for the possibility that our :attr:`!first` and :attr:`!last` members are ``NULL``. This is because they can be deleted, in which case they are set to ``NULL``. It would be better to prevent deletion of these attributes and to restrict the attribute values to be strings. We'll see how to do that in the next section.
ru: Обратите внимание, что нам нужно проверить возможность того, что наши члены :attr:`!first` и :attr:`!last` имеют значение ``NULL``. Это связано с тем, что их можно удалить, и в этом случае для них устанавливается значение NULL. Было бы лучше предотвратить удаление этих атрибутов и ограничить значения атрибутов строками. Мы увидим, как это сделать, в следующем разделе.

source: Now that we've defined the method, we need to create an array of method definitions::
ru: Теперь, когда мы определили метод, нам нужно создать массив определений методов::

source: (note that we used the :c:macro:`METH_NOARGS` flag to indicate that the method is expecting no arguments other than *self*)
ru: (обратите внимание, что мы использовали флаг :c:macro:`METH_NOARGS`, чтобы указать, что метод не ожидает никаких аргументов, кроме *self*)

source: and assign it to the :c:member:`~PyTypeObject.tp_methods` slot::
ru: и назначьте его слоту :c:member:`~PyTypeObject.tp_methods`::

source: Finally, we'll make our type usable as a base class for subclassing. We've written our methods carefully so far so that they don't make any assumptions about the type of the object being created or used, so all we need to do is to add the :c:macro:`Py_TPFLAGS_BASETYPE` to our class flag definition::
ru: Наконец, мы сделаем наш тип пригодным для использования в качестве базового класса для создания подклассов. До сих пор мы тщательно писали наши методы, чтобы они не делали никаких предположений о типе создаваемого или используемого объекта, поэтому все, что нам нужно сделать, это добавить :c:macro:`Py_TPFLAGS_BASETYPE` в наш класс. определение флага::

source: We rename :c:func:`!PyInit_custom` to :c:func:`!PyInit_custom2`, update the module name in the :c:type:`PyModuleDef` struct, and update the full class name in the :c:type:`PyTypeObject` struct.
ru: Мы переименовываем :c:func:`!PyInit_custom` в :c:func:`!PyInit_custom2`, обновляем имя модуля в структуре :c:type:`PyModuleDef` и обновляем полное имя класса в :c:type :`PyTypeObject` структура.

source: Finally, we update our :file:`setup.py` file to include the new module,
ru: Наконец, мы обновляем наш файл :file:`setup.py`, включив в него новый модуль:

source: and then we re-install so that we can ``import custom2``:
ru: а затем переустанавливаем, чтобы иметь возможность ``импортировать custom2``:

source: Providing finer control over data attributes
ru: Обеспечение более точного контроля над атрибутами данных.

source: In this section, we'll provide finer control over how the :attr:`!first` and :attr:`!last` attributes are set in the :class:`!Custom` example. In the previous version of our module, the instance variables :attr:`!first` and :attr:`!last` could be set to non-string values or even deleted. We want to make sure that these attributes always contain strings.
ru: В этом разделе мы предоставим более тонкий контроль над тем, как устанавливаются атрибуты :attr:`!first` и :attr:`!last` в примере :class:`!Custom`. В предыдущей версии нашего модуля переменным экземпляра :attr:`!first` и :attr:`!last` можно было присвоить нестроковые значения или даже удалить. Мы хотим быть уверены, что эти атрибуты всегда содержат строки.

source: To provide greater control, over the :attr:`!first` and :attr:`!last` attributes, we'll use custom getter and setter functions. Here are the functions for getting and setting the :attr:`!first` attribute::
ru: Чтобы обеспечить больший контроль над атрибутами :attr:`!first` и :attr:`!last`, мы будем использовать специальные функции получения и установки. Вот функции для получения и установки атрибута :attr:`!first`::

source: The getter function is passed a :class:`!Custom` object and a "closure", which is a void pointer. In this case, the closure is ignored. (The closure supports an advanced usage in which definition data is passed to the getter and setter. This could, for example, be used to allow a single set of getter and setter functions that decide the attribute to get or set based on data in the closure.)
ru: В функцию-получатель передается объект :class:`!Custom` и «замыкание», которое представляет собой пустой указатель. В этом случае замыкание игнорируется. (Замыкание поддерживает расширенное использование, при котором данные определения передаются методам получения и установки. Это можно, например, использовать для того, чтобы разрешить единый набор функций получения и установки, которые решают, какой атрибут получить или установить на основе данных в закрытие.)

source: The setter function is passed the :class:`!Custom` object, the new value, and the closure. The new value may be ``NULL``, in which case the attribute is being deleted. In our setter, we raise an error if the attribute is deleted or if its new value is not a string.
ru: В функцию установки передается объект :class:`!Custom`, новое значение и замыкание. Новое значение может быть ``NULL``, и в этом случае атрибут удаляется. В нашем установщике мы выдаем ошибку, если атрибут удален или его новое значение не является строкой.

source: We create an array of :c:type:`PyGetSetDef` structures::
ru: Мы создаем массив структур :c:type:`PyGetSetDef`::

source: and register it in the :c:member:`~PyTypeObject.tp_getset` slot::
ru: и зарегистрируйте его в слоте :c:member:`~PyTypeObject.tp_getset`::

source: The last item in a :c:type:`PyGetSetDef` structure is the "closure" mentioned above. In this case, we aren't using a closure, so we just pass ``NULL``.
ru: Последний элемент в структуре :c:type:`PyGetSetDef` — это упомянутое выше «замыкание». В этом случае мы не используем замыкание, поэтому просто передаем NULL.

source: We also remove the member definitions for these attributes::
ru: Мы также удаляем определения членов для этих атрибутов:

source: We also need to update the :c:member:`~PyTypeObject.tp_init` handler to only allow strings [#]_ to be passed::
ru: Нам также необходимо обновить обработчик :c:member:`~PyTypeObject.tp_init`, чтобы он разрешал только строки. [#]_ предстоит пройти::

source: With these changes, we can assure that the ``first`` and ``last`` members are never ``NULL`` so we can remove checks for ``NULL`` values in almost all cases. This means that most of the :c:func:`Py_XDECREF` calls can be converted to :c:func:`Py_DECREF` calls. The only place we can't change these calls is in the ``tp_dealloc`` implementation, where there is the possibility that the initialization of these members failed in ``tp_new``.
ru: Благодаря этим изменениям мы можем гарантировать, что члены ``first`` и ``last`` никогда не будут равны ``NULL``, поэтому мы можем удалить проверки для значений ``NULL`` почти во всех случаях. Это означает, что большинство вызовов :c:func:`Py_XDECREF` можно преобразовать в вызовы :c:func:`Py_DECREF`. Единственное место, где мы не можем изменить эти вызовы, — это реализация tp_dealloc, где существует вероятность того, что инициализация этих членов не удалась в tp_new.

source: We also rename the module initialization function and module name in the initialization function, as we did before, and we add an extra definition to the :file:`setup.py` file.
ru: Мы также переименовываем функцию инициализации модуля и имя модуля в функции инициализации, как мы делали раньше, и добавляем дополнительное определение в файл :file:`setup.py`.

source: Supporting cyclic garbage collection
ru: Поддержка циклической сборки мусора

source: Python has a :term:`cyclic garbage collector (GC) <garbage collection>` that can identify unneeded objects even when their reference counts are not zero. This can happen when objects are involved in cycles. For example, consider:
ru: В Python есть циклический сборщик мусора (GC) <сборка мусора>, который может идентифицировать ненужные объекты, даже если их счетчик ссылок не равен нулю. Это может произойти, когда объекты участвуют в циклах. Например, рассмотрим:

source: In this example, we create a list that contains itself. When we delete it, it still has a reference from itself. Its reference count doesn't drop to zero. Fortunately, Python's cyclic garbage collector will eventually figure out that the list is garbage and free it.
ru: В этом примере мы создаем список, содержащий самого себя. Когда мы его удаляем, он все еще имеет ссылку на самого себя. Его счетчик ссылок не падает до нуля. К счастью, циклический сборщик мусора Python в конечном итоге обнаружит, что список — мусор, и освободит его.

source: In the second version of the :class:`!Custom` example, we allowed any kind of object to be stored in the :attr:`!first` or :attr:`!last` attributes [#]_. Besides, in the second and third versions, we allowed subclassing :class:`!Custom`, and subclasses may add arbitrary attributes. For any of those two reasons, :class:`!Custom` objects can participate in cycles:
ru: Во второй версии примера :class:`!Custom` мы разрешили хранить объекты любого типа в атрибутах :attr:`!first` или :attr:`!last`. [#]_ . Кроме того, во второй и третьей версиях мы разрешили создание подклассов :class:`!Custom`, а подклассы могут добавлять произвольные атрибуты. По любой из этих двух причин объекты :class:`!Custom` могут участвовать в циклах:

source: To allow a :class:`!Custom` instance participating in a reference cycle to be properly detected and collected by the cyclic GC, our :class:`!Custom` type needs to fill two additional slots and to enable a flag that enables these slots:
ru: Чтобы позволить экземпляру :class:`!Custom`, участвующему в эталонном цикле, быть должным образом обнаруженным и собранным циклическим сборщиком мусора, наш тип :class:`!Custom` должен заполнить два дополнительных слота и включить флаг, который включает их. слоты:

source: First, the traversal method lets the cyclic GC know about subobjects that could participate in cycles::
ru: Во-первых, метод обхода позволяет циклическому сборщику мусора узнать о подобъектах, которые могут участвовать в циклах:

source: For each subobject that can participate in cycles, we need to call the :c:func:`!visit` function, which is passed to the traversal method. The :c:func:`!visit` function takes as arguments the subobject and the extra argument *arg* passed to the traversal method. It returns an integer value that must be returned if it is non-zero.
ru: Для каждого подобъекта, который может участвовать в циклах, нам нужно вызвать функцию :c:func:`!visit`, которая передается методу обхода. Функция :c:func:`!visit` принимает в качестве аргументов подобъект и дополнительный аргумент *arg*, передаваемый методу обхода. Он возвращает целочисленное значение, которое должно быть возвращено, если оно не равно нулю.

source: Python provides a :c:func:`Py_VISIT` macro that automates calling visit functions. With :c:func:`Py_VISIT`, we can minimize the amount of boilerplate in ``Custom_traverse``::
ru: Python предоставляет макрос :c:func:`Py_VISIT`, который автоматизирует вызов функций посещения. С помощью :c:func:`Py_VISIT` мы можем минимизировать количество шаблонного кода в ``Custom_traverse``::

source: The :c:member:`~PyTypeObject.tp_traverse` implementation must name its arguments exactly *visit* and *arg* in order to use :c:func:`Py_VISIT`.
ru: Реализация :c:member:`~PyTypeObject.tp_traverse` должна точно называть свои аргументы *visit* и *arg*, чтобы использовать :c:func:`Py_VISIT`.

source: Second, we need to provide a method for clearing any subobjects that can participate in cycles::
ru: Во-вторых, нам нужно предоставить метод очистки любых подобъектов, которые могут участвовать в циклах:

source: Notice the use of the :c:func:`Py_CLEAR` macro. It is the recommended and safe way to clear data attributes of arbitrary types while decrementing their reference counts. If you were to call :c:func:`Py_XDECREF` instead on the attribute before setting it to ``NULL``, there is a possibility that the attribute's destructor would call back into code that reads the attribute again (*especially* if there is a reference cycle).
ru: Обратите внимание на использование макроса :c:func:`Py_CLEAR`. Это рекомендуемый и безопасный способ очистки атрибутов данных произвольных типов при уменьшении их счетчика ссылок. Если бы вы вместо этого вызвали :c:func:`Py_XDECREF` для атрибута перед установкой его в ``NULL``, существует вероятность того, что деструктор атрибута вызовет обратный вызов в код, который снова прочитает атрибут (*особенно*, если есть эталонный цикл).

source: Nevertheless, it is much easier and less error-prone to always use :c:func:`Py_CLEAR` when deleting an attribute. Don't try to micro-optimize at the expense of robustness!
ru: Тем не менее, гораздо проще и менее подвержено ошибкам всегда использовать :c:func:`Py_CLEAR` при удалении атрибута. Не пытайтесь микрооптимизировать в ущерб надежности!

source: The deallocator ``Custom_dealloc`` may call arbitrary code when clearing attributes. It means the circular GC can be triggered inside the function. Since the GC assumes reference count is not zero, we need to untrack the object from the GC by calling :c:func:`PyObject_GC_UnTrack` before clearing members. Here is our reimplemented deallocator using :c:func:`PyObject_GC_UnTrack` and ``Custom_clear``::
ru: Освободитель Custom_dealloc может вызывать произвольный код при очистке атрибутов. Это означает, что круговой сборщик мусора может быть запущен внутри функции. Поскольку сборщик мусора предполагает, что счетчик ссылок не равен нулю, нам нужно отменить отслеживание объекта из сборщика мусора, вызвав :c:func:`PyObject_GC_UnTrack` перед очисткой членов. Вот наш переопределенный механизм освобождения с использованием :c:func:`PyObject_GC_UnTrack` и ``Custom_clear``::

source: Finally, we add the :c:macro:`Py_TPFLAGS_HAVE_GC` flag to the class flags::
ru: Наконец, мы добавляем флаг :c:macro:`Py_TPFLAGS_HAVE_GC` к флагам класса::

source: That's pretty much it. If we had written custom :c:member:`~PyTypeObject.tp_alloc` or :c:member:`~PyTypeObject.tp_free` handlers, we'd need to modify them for cyclic garbage collection. Most extensions will use the versions automatically provided.
ru: Вот и все. Если бы мы написали собственные обработчики :c:member:`~PyTypeObject.tp_alloc` или :c:member:`~PyTypeObject.tp_free`, нам нужно было бы изменить их для циклической сборки мусора. Большинство расширений будут использовать автоматически предоставленные версии.

source: Subclassing other types
ru: Создание подклассов других типов

source: It is possible to create new extension types that are derived from existing types. It is easiest to inherit from the built in types, since an extension can easily use the :c:type:`PyTypeObject` it needs. It can be difficult to share these :c:type:`PyTypeObject` structures between extension modules.
ru: Можно создавать новые типы расширений, производные от существующих типов. Проще всего наследовать встроенные типы, поскольку расширение может легко использовать необходимый ему :c:type:`PyTypeObject`. Может быть сложно разделить эти структуры :c:type:`PyTypeObject` между модулями расширения.

source: In this example we will create a :class:`!SubList` type that inherits from the built-in :class:`list` type. The new type will be completely compatible with regular lists, but will have an additional :meth:`!increment` method that increases an internal counter:
ru: В этом примере мы создадим тип :class:`!SubList`, который наследуется от встроенного типа :class:`list`. Новый тип будет полностью совместим с обычными списками, но будет иметь дополнительный метод :meth:`!increment`, увеличивающий внутренний счетчик:

source: As you can see, the source code closely resembles the :class:`!Custom` examples in previous sections. We will break down the main differences between them. ::
ru: Как видите, исходный код очень похож на примеры :class:`!Custom` из предыдущих разделов. Мы разберем основные различия между ними. ::

source: The primary difference for derived type objects is that the base type's object structure must be the first value. The base type will already include the :c:func:`PyObject_HEAD` at the beginning of its structure.
ru: Основное отличие объектов производного типа состоит в том, что структура объекта базового типа должна быть первым значением. Базовый тип уже будет включать :c:func:`PyObject_HEAD` в начале своей структуры.

source: When a Python object is a :class:`!SubList` instance, its ``PyObject *`` pointer can be safely cast to both ``PyListObject *`` and ``SubListObject *``::
ru: Когда объект Python является экземпляром :class:`!SubList`, его указатель ``PyObject *`` можно безопасно привести как к ``PyListObject *``, так и к ``SubListObject *``::

source: We see above how to call through to the :meth:`~object.__init__` method of the base type.
ru: Выше мы видели, как вызвать метод :meth:`~object.__init__` базового типа.

source: This pattern is important when writing a type with custom :c:member:`~PyTypeObject.tp_new` and :c:member:`~PyTypeObject.tp_dealloc` members. The :c:member:`~PyTypeObject.tp_new` handler should not actually create the memory for the object with its :c:member:`~PyTypeObject.tp_alloc`, but let the base class handle it by calling its own :c:member:`~PyTypeObject.tp_new`.
ru: Этот шаблон важен при написании типа с пользовательскими членами :c:member:`~PyTypeObject.tp_new` и :c:member:`~PyTypeObject.tp_dealloc`. Обработчик :c:member:`~PyTypeObject.tp_new` на самом деле не должен создавать память для объекта с его :c:member:`~PyTypeObject.tp_alloc`, а должен позволить базовому классу обрабатывать его, вызывая свой собственный :c: член:`~PyTypeObject.tp_new`.
