Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/extending/windows.po
Languages: es_es

source: Building C and C++ Extensions on Windows
es_es: Construyendo extensiones de C y C++ en Windows

source: This chapter briefly explains how to create a Windows extension module for Python using Microsoft Visual C++, and follows with more detailed background information on how it works. The explanatory material is useful for both the Windows programmer learning to build Python extensions and the Unix programmer interested in producing software which can be successfully built on both Unix and Windows.
es_es: Este capítulo explica brevemente cómo crear un módulo de extensión de Windows para Python utilizando Microsoft Visual C++, y continúa con información de fondo más detallada sobre cómo funciona. El material explicativo es útil tanto para el programador de Windows que aprende a construir extensiones de Python como para el programador de Unix interesado en producir software que se pueda construir con éxito tanto en Unix como en Windows.

source: Module authors are encouraged to use the distutils approach for building extension modules, instead of the one described in this section. You will still need the C compiler that was used to build Python; typically Microsoft Visual C++.
es_es: Los autores de módulos son animados a utilizar el enfoque de distutils para construir módulos de extensión, en lugar del descrito en esta sección. Aún necesitarás el compilador C que se utilizó para construir Python; típicamente Microsoft Visual C++.

source: This chapter mentions a number of filenames that include an encoded Python version number. These filenames are represented with the version number shown as ``XY``; in practice, ``'X'`` will be the major version number and ``'Y'`` will be the minor version number of the Python release you're working with. For example, if you are using Python 2.2.1, ``XY`` will actually be ``22``.
es_es: Este capítulo menciona una serie de nombres de archivo que incluyen un número de versión de Python codificado. Estos nombres de archivo se representan con el número de versión mostrado como ``XY``; en la práctica, ``'X'`` será el número de versión mayor y ``'Y'`` será el número de versión menor de la versión de Python con la que estés trabajando. Por ejemplo, si estás usando Python 2.2.1, ``XY`` será en realidad ``22``.

source: A Cookbook Approach
es_es: Un enfoque de libro de cocina

source: Differences Between Unix and Windows
es_es: Diferencias entre Unix y Windows

source: Unix and Windows use completely different paradigms for run-time loading of code. Before you try to build a module that can be dynamically loaded, be aware of how your system works.
es_es: Unix y Windows utilizan paradigmas completamente distintos para la carga de código en tiempo de ejecución. Antes de intentar construir un módulo que pueda cargarse dinámicamente, sea consciente de cómo funciona su sistema.

source: In Unix, a shared object (:file:`.so`) file contains code to be used by the program, and also the names of functions and data that it expects to find in the program. When the file is joined to the program, all references to those functions and data in the file's code are changed to point to the actual locations in the program where the functions and data are placed in memory. This is basically a link operation.
es_es: En Unix, un archivo de objetos compartidos (:file:`.so`) contiene código para ser utilizado por el programa, y también los nombres de funciones y datos que espera encontrar en el programa. Cuando el archivo se une al programa, todas las referencias a esas funciones y datos en el código del archivo se cambian para apuntar a las ubicaciones reales en el programa donde las funciones y los datos se colocan en la memoria. Esto es básicamente una operación de enlace.

source: In Windows, a dynamic-link library (:file:`.dll`) file has no dangling references. Instead, an access to functions or data goes through a lookup table. So the DLL code does not have to be fixed up at runtime to refer to the program's memory; instead, the code already uses the DLL's lookup table, and the lookup table is modified at runtime to point to the functions and data.
es_es: En Windows, un archivo de biblioteca de vínculos dinámicos (:file:`.dll`) no tiene referencias colgantes. En su lugar, un acceso a funciones o datos pasa por una tabla de búsqueda. Así, el código de la DLL no tiene que ser arreglado en tiempo de ejecución para hacer referencia a la memoria del programa; en su lugar, el código ya utiliza la tabla de búsqueda de la DLL, y la tabla de búsqueda se modifica en tiempo de ejecución para apuntar a las funciones y datos.

source: In Unix, there is only one type of library file (:file:`.a`) which contains code from several object files (:file:`.o`). During the link step to create a shared object file (:file:`.so`), the linker may find that it doesn't know where an identifier is defined. The linker will look for it in the object files in the libraries; if it finds it, it will include all the code from that object file.
es_es: En Unix, sólo existe un tipo de archivo de biblioteca (:file:`.a`) que contiene código de varios archivos de objetos (:file:`.o`). Durante el paso de enlace para crear un fichero de objetos compartidos (:file:`.so`), el enlazador puede encontrarse con que no sabe dónde está definido un identificador. El enlazador lo buscará en los archivos objeto de las bibliotecas; si lo encuentra, incluirá todo el código de ese archivo objeto.

source: In Windows, there are two types of library, a static library and an import library (both called :file:`.lib`). A static library is like a Unix :file:`.a` file; it contains code to be included as necessary. An import library is basically used only to reassure the linker that a certain identifier is legal, and will be present in the program when the DLL is loaded. So the linker uses the information from the import library to build the lookup table for using identifiers that are not included in the DLL. When an application or a DLL is linked, an import library may be generated, which will need to be used for all future DLLs that depend on the symbols in the application or DLL.
es_es: En Windows, existen dos tipos de bibliotecas, una biblioteca estática y una biblioteca de importación (ambas denominadas :file:`.lib`). Una biblioteca estática es como un archivo Unix :file:`.a`; contiene código que se incluirá cuando sea necesario. Una biblioteca de importación se utiliza básicamente sólo para asegurar al enlazador que un determinado identificador es legal, y que estará presente en el programa cuando se cargue la DLL. Así, el enlazador utiliza la información de la librería de importación para construir la tabla de búsqueda para utilizar identificadores que no están incluidos en la DLL. Cuando se enlaza una aplicación o una DLL, puede generarse una biblioteca de importación, que deberá utilizarse para todas las DLL futuras que dependan de los símbolos de la aplicación o DLL.

source: Suppose you are building two dynamic-load modules, B and C, which should share another block of code A. On Unix, you would *not* pass :file:`A.a` to the linker for :file:`B.so` and :file:`C.so`; that would cause it to be included twice, so that B and C would each have their own copy. In Windows, building :file:`A.dll` will also build :file:`A.lib`. You *do* pass :file:`A.lib` to the linker for B and C. :file:`A.lib` does not contain code; it just contains information which will be used at runtime to access A's code.
es_es: Suponga que está construyendo dos módulos de carga dinámica, B y C, que deben compartir otro bloque de código A. En Unix, usted *no* pasaría :file:`A.a` al enlazador para :file:`B.so` y :file:`C.so`; eso haría que se incluyera dos veces, de modo que B y C tendrían cada uno su propia copia. En Windows, construir :file:`A.dll` también construirá :file:`A.lib`. Usted *sí* pasa :file:`A.lib` al enlazador para B y C. :file:`A.lib` no contiene código; sólo contiene información que se utilizará en tiempo de ejecución para acceder al código de A.

source: In Windows, using an import library is sort of like using ``import spam``; it gives you access to spam's names, but does not create a separate copy. On Unix, linking with a library is more like ``from spam import *``; it does create a separate copy.
es_es: En Windows, usar una biblioteca de importación es algo así como usar ``import spam``; le da acceso a los nombres de spam, pero no crea una copia separada. En Unix, enlazar con una biblioteca es más parecido a ``from spam import *``; sí crea una copia separada.

source: Using DLLs in Practice
es_es: Uso de DLL en la práctica

source: Windows Python is built in Microsoft Visual C++; using other compilers may or may not work. The rest of this section is MSVC++ specific.
es_es: Windows Python está construido en Microsoft Visual C++; el uso de otros compiladores puede o no funcionar. El resto de esta sección es específico de MSVC++.

source: When creating DLLs in Windows, you must pass :file:`pythonXY.lib` to the linker. To build two DLLs, spam and ni (which uses C functions found in spam), you could use these commands::
es_es: Al crear DLLs en Windows, debe pasar :file:`pythonXY.lib` al enlazador. Para construir dos DLLs, spam y ni (que utiliza funciones C encontradas en spam), podrías utilizar estos comandos::

source: The first command created three files: :file:`spam.obj`, :file:`spam.dll` and :file:`spam.lib`. :file:`Spam.dll` does not contain any Python functions (such as :c:func:`PyArg_ParseTuple`), but it does know how to find the Python code thanks to :file:`pythonXY.lib`.
es_es: El primer comando creó tres archivos: :file:`spam.obj`, :file:`spam.dll` y :file:`spam.lib`. :file:`Spam.dll` no contiene ninguna función Python (como :c:func:`PyArg_ParseTuple`), pero sabe encontrar el código Python gracias a :file:`pythonXY.lib`.

source: The second command created :file:`ni.dll` (and :file:`.obj` and :file:`.lib`), which knows how to find the necessary functions from spam, and also from the Python executable.
es_es: La segunda orden creó :file:`ni.dll` (y :file:`.obj` y :file:`.lib`), que sabe cómo encontrar las funciones necesarias de spam, y también del ejecutable de Python.

source: Not every identifier is exported to the lookup table. If you want any other modules (including Python) to be able to see your identifiers, you have to say ``_declspec(dllexport)``, as in ``void _declspec(dllexport) initspam(void)`` or ``PyObject _declspec(dllexport) *NiGetSpamData(void)``.
es_es: No todos los identificadores se exportan a la tabla de consulta. Si quieres que cualquier otro módulo (incluido Python) pueda ver tus identificadores, tienes que decir ``_declspec(dllexport)``, como en ``void _declspec(dllexport) initspam(void)`` o ``PyObject _declspec(dllexport) *NiGetSpamData(void)``.
