Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/faq/design.po
Languages: es_es, ru

source: In the 1970s people realized that unrestricted goto could lead to messy "spaghetti" code that was hard to understand and revise. In a high-level language, it is also unneeded as long as there are ways to branch (in Python, with :keyword:`if` statements and :keyword:`or`, :keyword:`and`, and :keyword:`if`/:keyword:`else` expressions) and loop (with :keyword:`while` and :keyword:`for` statements, possibly containing :keyword:`continue` and :keyword:`break`).
ru: В 1970-х годах люди поняли, что неограниченный переход может привести к созданию запутанного кода «спагетти», который будет трудно понять и редактировать. В языке высокого уровня в этом также нет необходимости, если есть способы ветвления (в Python с помощью операторов :keyword:`if` и :keyword:`or`, :keyword:`and` и :keyword: выражения `if`/:keyword:`else`) и цикл (с операторами :keyword:` while` и :keyword:`for`, возможно содержащими :keyword:`continue` и :keyword:`break`).

source: One can also use exceptions to provide a "structured goto" that works even across function calls. Many feel that exceptions can conveniently emulate all reasonable uses of the ``go`` or ``goto`` constructs of C, Fortran, and other languages. For example::
ru: Можно также использовать исключения для обеспечения «структурированного перехода», который работает даже при вызовах функций. Многие считают, что исключения могут удобно эмулировать все разумные варианты использования конструкций go или goto в C, Fortran и других языках. Например::

source: This doesn't allow you to jump into the middle of a loop, but that's usually considered an abuse of ``goto`` anyway. Use sparingly.
ru: Это не позволяет вам перейти в середину цикла, но в любом случае это обычно считается злоупотреблением ``goto``. Используйте экономно.

source: Why can't raw strings (r-strings) end with a backslash?
es_es: ¿Por qué las cadenas sin formato (r-strings) no pueden terminar con una barra invertida?
ru: Почему необработанные строки (r-строки) не могут заканчиваться обратной косой чертой?

source: More precisely, they can't end with an odd number of backslashes: the unpaired backslash at the end escapes the closing quote character, leaving an unterminated string.
es_es: Más precisamente, no pueden terminar con un número impar de barras invertidas: la barra invertida sin pareja al final escapa al carácter de comillas de cierre, dejando una cadena no terminada.
ru: Точнее, они не могут заканчиваться нечетным количеством обратных косых черт: непарная обратная косая черта в конце экранирует символ закрывающей кавычки, оставляя незавершенную строку.

source: Raw strings were designed to ease creating input for processors (chiefly regular expression engines) that want to do their own backslash escape processing. Such processors consider an unmatched trailing backslash to be an error anyway, so raw strings disallow that. In return, they allow you to pass on the string quote character by escaping it with a backslash. These rules work well when r-strings are used for their intended purpose.
es_es: Las cadenas sin procesar fueron diseñadas para facilitar la creación de entradas para procesadores (principalmente motores de expresiones regulares) que desean realizar su propio procesamiento de escape de barra invertida. Dichos procesadores consideran que una barra invertida final sin coincidencia es un error de todos modos, por lo que las cadenas sin procesar no lo permiten. A cambio, te permiten pasar el carácter de comillas de la cadena escapándolo con una barra invertida. Estas reglas funcionan bien cuando se utilizan cadenas sin procesar para su propósito previsto.
ru: Необработанные строки были разработаны для облегчения создания входных данных для процессоров (в основном механизмов регулярных выражений), которые хотят выполнять собственную обработку escape-слеша. Такие процессоры в любом случае считают несовпадающую обратную косую черту ошибкой, поэтому необработанные строки это не допускают. В свою очередь, они позволяют вам передавать символ строковой кавычки, экранируя его обратной косой чертой. Эти правила хорошо работают, когда r-строки используются по назначению.

source: If you're trying to build Windows pathnames, note that all Windows system calls accept forward slashes too::
es_es: Si estás intentando construir nombres de ruta de Windows, ten en cuenta que todas las llamadas del sistema de Windows también aceptan barras diagonales hacia adelante::
ru: Если вы пытаетесь создать пути Windows, обратите внимание, что все системные вызовы Windows также принимают косую черту::

source: If you're trying to build a pathname for a DOS command, try e.g. one of ::
es_es: Si estás intentando construir una ruta de acceso para un comando de DOS, prueba por ejemplo uno de ::
ru: Если вы пытаетесь создать путь для команды DOS, попробуйте, например, один из ::

source: Why doesn't Python have a "with" statement for attribute assignments?
es_es: ¿Por qué Python no tiene una declaración "with" para asignaciones de atributos?
ru: Почему в Python нет оператора «with» для назначения атрибутов?

source: Python has a :keyword:`with` statement that wraps the execution of a block, calling code on the entrance and exit from the block. Some languages have a construct that looks like this::
ru: В Python есть оператор :keyword:`with`, который завершает выполнение блока, вызывая код при входе и выходе из блока. В некоторых языках есть конструкция, которая выглядит следующим образом:

source: In Python, such a construct would be ambiguous.
es_es: En Python, tal construcción sería ambigua.
ru: В Python такая конструкция была бы неоднозначной.

source: Other languages, such as Object Pascal, Delphi, and C++, use static types, so it's possible to know, in an unambiguous way, what member is being assigned to. This is the main point of static typing -- the compiler *always* knows the scope of every variable at compile time.
es_es: Otros lenguajes, como Object Pascal, Delphi y C++, utilizan tipos estáticos, por lo que es posible saber, de manera inequívoca, a qué miembro se está asignando. Este es el punto principal de la tipificación estática: el compilador siempre conoce el ámbito de cada variable en tiempo de compilación.
ru: Другие языки, такие как Object Pascal, Delphi и C++, используют статические типы, поэтому можно однозначно узнать, какому члену присваивается значение. Это основной момент статической типизации — компилятор *всегда* знает область действия каждой переменной во время компиляции.

source: Python uses dynamic types. It is impossible to know in advance which attribute will be referenced at runtime. Member attributes may be added or removed from objects on the fly. This makes it impossible to know, from a simple reading, what attribute is being referenced: a local one, a global one, or a member attribute?
es_es: Python utiliza tipos dinámicos. Es imposible saber de antemano qué atributo se referenciará en tiempo de ejecución. Los atributos de los miembros pueden ser agregados o eliminados de los objetos sobre la marcha. Esto hace imposible saber, a simple vista, qué atributo se está referenciando: uno local, uno global o un atributo de miembro?
ru: Python использует динамические типы. Невозможно заранее знать, на какой атрибут будет ссылаться во время выполнения. Атрибуты членов можно добавлять или удалять из объектов «на лету». Это делает невозможным путем простого чтения определить, на какой атрибут ссылаются: локальный, глобальный или атрибут-член?

source: For instance, take the following incomplete snippet::
es_es: Por ejemplo, toma el siguiente fragmento incompleto:
ru: Например, возьмите следующий неполный фрагмент:

source: The snippet assumes that ``a`` must have a member attribute called ``x``. However, there is nothing in Python that tells the interpreter this. What should happen if ``a`` is, let us say, an integer? If there is a global variable named ``x``, will it be used inside the :keyword:`with` block? As you see, the dynamic nature of Python makes such choices much harder.
ru: Во фрагменте предполагается, что ``a`` должен иметь атрибут-член с именем ``x``. Однако в Python нет ничего, что сообщало бы интерпретатору об этом. Что произойдет, если ``a``, скажем, целое число? Если существует глобальная переменная с именем ``x``, будет ли она использоваться внутри блока :keyword:`with`? Как видите, динамическая природа Python значительно усложняет такой выбор.

source: The primary benefit of :keyword:`with` and similar language features (reduction of code volume) can, however, easily be achieved in Python by assignment. Instead of::
ru: Однако основное преимущество :keyword:`with` и подобных языковых функций (уменьшение объема кода) может быть легко достигнуто в Python путем присваивания. Вместо::

source: write this::
es_es: escribe esto::
ru: напиши это::

source: This also has the side-effect of increasing execution speed because name bindings are resolved at run-time in Python, and the second version only needs to perform the resolution once.
es_es: Esto también tiene el efecto secundario de aumentar la velocidad de ejecución porque las asignaciones de nombres se resuelven en tiempo de ejecución en Python, y la segunda versión solo necesita realizar la resolución una vez.
ru: Это также имеет побочный эффект увеличения скорости выполнения, поскольку привязки имен разрешаются во время выполнения в Python, а второй версии требуется выполнить разрешение только один раз.

source: Similar proposals that would introduce syntax to further reduce code volume, such as using a 'leading dot', have been rejected in favour of explicitness (see https://mail.python.org/pipermail/python-ideas/2016-May/040070.html).
ru: Подобные предложения, которые вводили бы синтаксис для дальнейшего уменьшения объема кода, например, использование «ведущей точки», были отклонены в пользу ясности (см. https://mail.python.org/pipermail/python-ideas/2016-May/ 040070.html).

source: Why don't generators support the with statement?
es_es: ¿Por qué los generadores no admiten la declaración "with"?
ru: Почему генераторы не поддерживают оператор with?

source: For technical reasons, a generator used directly as a context manager would not work correctly. When, as is most common, a generator is used as an iterator run to completion, no closing is needed. When it is, wrap it as :func:`contextlib.closing(generator) <contextlib.closing>` in the :keyword:`with` statement.
ru: По техническим причинам генератор, используемый непосредственно в качестве менеджера контекста, не будет работать корректно. Когда, как это обычно бывает, генератор используется в качестве итератора, работающего до завершения, закрытие не требуется. Когда это так, оберните его как :func:`contextlib.closing(generator) <contextlib.closing>` в операторе :keyword:`with`.

source: Why are colons required for the if/while/def/class statements?
es_es: ¿Por qué se requieren dos puntos para las declaraciones if/while/def/class?
ru: Почему для операторов if/ while/def/class требуются двоеточия?

source: The colon is required primarily to enhance readability (one of the results of the experimental ABC language). Consider this::
es_es: Los dos puntos son necesarios principalmente para mejorar la legibilidad (uno de los resultados del lenguaje experimental ABC). Considera esto::
ru: Двоеточие требуется в первую очередь для улучшения читаемости (один из результатов экспериментального языка ABC). Подумайте об этом:

source: versus ::
ru: против ::

source: Notice how the second one is slightly easier to read. Notice further how a colon sets off the example in this FAQ answer; it's a standard usage in English.
es_es: Fíjate cómo el segundo es un poco más fácil de leer. Observa además cómo dos puntos separan el ejemplo en esta respuesta del FAQ; es un uso estándar en inglés.
ru: Обратите внимание, что второй вариант читается немного легче. Обратите внимание, как двоеточие выделяет пример в этом ответе на часто задаваемые вопросы; это стандартное употребление в английском языке.

source: Another minor reason is that the colon makes it easier for editors with syntax highlighting; they can look for colons to decide when indentation needs to be increased instead of having to do a more elaborate parsing of the program text.
es_es: Otra razón menor es que los dos puntos facilitan el trabajo de los editores con resaltado de sintaxis; pueden buscar los dos puntos para decidir cuándo se debe aumentar la indentación en lugar de tener que realizar un análisis más elaborado del texto del programa.
ru: Другая незначительная причина заключается в том, что двоеточие упрощает работу редакторов с подсветкой синтаксиса; они могут искать двоеточия, чтобы решить, когда необходимо увеличить отступ, вместо того, чтобы выполнять более сложный анализ текста программы.

source: Why does Python allow commas at the end of lists and tuples?
es_es: ¿Por qué Python permite comas al final de las listas y tuplas?
ru: Почему Python допускает запятые в конце списков и кортежей?

source: Python lets you add a trailing comma at the end of lists, tuples, and dictionaries::
es_es: Python te permite agregar una coma final al final de las listas, tuplas y diccionarios::
ru: Python позволяет добавлять запятую в конце списков, кортежей и словарей:

source: There are several reasons to allow this.
es_es: Hay varias razones para permitir esto.
ru: Есть несколько причин позволить это.

source: When you have a literal value for a list, tuple, or dictionary spread across multiple lines, it's easier to add more elements because you don't have to remember to add a comma to the previous line. The lines can also be reordered without creating a syntax error.
es_es: Cuando tienes un valor literal para una lista, tupla o diccionario distribuido en varias líneas, es más fácil agregar más elementos porque no tienes que recordar agregar una coma a la línea anterior. Las líneas también se pueden reordenar sin crear un error de sintaxis.
ru: Если у вас есть буквальное значение для списка, кортежа или словаря, распределенное по нескольким строкам, проще добавить больше элементов, поскольку вам не нужно помнить о добавлении запятой в предыдущую строку. Строки также можно переупорядочить, не создавая синтаксической ошибки.

source: Accidentally omitting the comma can lead to errors that are hard to diagnose. For example::
es_es: Omitir accidentalmente la coma puede llevar a errores difíciles de diagnosticar. Por ejemplo::
ru: Случайный пропуск запятой может привести к ошибкам, которые трудно диагностировать. Например::

source: This list looks like it has four elements, but it actually contains three: "fee", "fiefoo" and "fum". Always adding the comma avoids this source of error.
es_es: Esta lista parece tener cuatro elementos, pero en realidad contiene tres: "fee", "fiefoo" y "fum". Siempre agregar la coma evita esta fuente de error.
ru: Кажется, что этот список состоит из четырех элементов, но на самом деле он содержит три: «плата», «фифу» и «фум». Всегдае добавление запятой позволяет избежать этого источника ошибок.

source: Allowing the trailing comma may also make programmatic code generation easier.
es_es: Permitir la coma final también puede facilitar la generación de código programático.
ru: Разрешение завершающей запятой также может упростить генерацию программного кода.
