Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/faq/design.po
Languages: es_es, ru

source: The first runs along the lines of: "It looks really ugly using a method of a string literal (string constant)", to which the answer is that it might, but a string literal is just a fixed value. If the methods are to be allowed on names bound to strings there is no logical reason to make them unavailable on literals.
es_es: La primera se ejecuta a lo largo de las líneas de: "Se ve realmente feo usando un método de un literal de cadena (constante de cadena)", a lo que la respuesta es que podría ser, pero un literal de cadena es solo un valor fijo. Si se permite que los métodos estén disponibles en los nombres vinculados a cadenas, no hay una razón lógica para hacerlos no disponibles en literales.
ru: Первый звучит примерно так: «Использование метода строкового литерала (строковой константы) выглядит очень некрасиво», на что ответ таков: возможно, но строковый литерал — это просто фиксированное значение. Если методы должны быть разрешены для имен, связанных со строками, нет никакой логической причины делать их недоступными для литералов.

source: The second objection is typically cast as: "I am really telling a sequence to join its members together with a string constant". Sadly, you aren't. For some reason there seems to be much less difficulty with having :meth:`~str.split` as a string method, since in that case it is easy to see that ::
es_es: La segunda objeción se suele presentar como: "Realmente estoy diciendo a una secuencia que una sus miembros con una constante de cadena". Lamentablemente, no lo estás haciendo. Por alguna razón parece haber mucha menos dificultad con tener :meth:`~str.split` como un método de cadena, ya que en ese caso es fácil ver que ::
ru: Второе возражение обычно звучит так: «Я действительно говорю последовательности объединить ее члены с помощью строковой константы». К сожалению, это не так. По какой-то причине кажется, что гораздо меньше сложностей с использованием :meth:`~str.split` в качестве строкового метода, поскольку в этом случае легко увидеть, что::

source: is an instruction to a string literal to return the substrings delimited by the given separator (or, by default, arbitrary runs of white space).
es_es: es una instrucción a un literal de cadena para que devuelva las subcadenas delimitadas por el separador dado (o, por defecto, tramos arbitrarios de espacio en blanco).
ru: — это инструкция строковому литералу вернуть подстроки, разделенные заданным разделителем (или, по умолчанию, произвольными пробелами).

source: :meth:`~str.join` is a string method because in using it you are telling the separator string to iterate over a sequence of strings and insert itself between adjacent elements. This method can be used with any argument which obeys the rules for sequence objects, including any new classes you might define yourself. Similar methods exist for bytes and bytearray objects.
es_es: :meth:`~str.join` es un método de cadena porque al usarlo estás indicando a la cadena separadora que itere sobre una secuencia de cadenas e inserte entre sí misma entre elementos adyacentes. Este método se puede utilizar con cualquier argumento que cumpla las reglas para objetos de secuencia, incluyendo cualquier nueva clase que puedas definir tú mismo. Métodos similares existen para objetos de bytes y bytearray.
ru: :meth:`~str.join` — это строковый метод, поскольку при его использовании вы сообщаете строке-разделителю перебирать последовательность строк и вставлять себя между соседними элементами. Этот метод можно использовать с любым аргументом, который подчиняется правилам для объектов последовательности, включая любые новые классы, которые вы можете определить самостоятельно. Аналогичные методы существуют для объектов bytes и bytearray.

source: How fast are exceptions?
es_es: ¿Cómo de rápidas son las excepciones?
ru: Насколько быстро возникают исключения?

source: A :keyword:`try`/:keyword:`except` block is extremely efficient if no exceptions are raised. Actually catching an exception is expensive. In versions of Python prior to 2.0 it was common to use this idiom::
ru: Блок :keyword:`try`/:keyword:`Exception` чрезвычайно эффективен, если никаких исключений не возникает. На самом деле перехват исключения обходится дорого. В версиях Python до 2.0 часто использовалась эта идиома:

source: This only made sense when you expected the dict to have the key almost all the time. If that wasn't the case, you coded it like this::
es_es: Esto solo tenía sentido cuando esperabas que el diccionario tuviera la clave casi todo el tiempo. Si ese no era el caso, lo codificaste así:
ru: Это имело смысл только в том случае, если вы ожидали, что ключ почти всегда будет у диктанта. Если это не так, вы закодировали это так::

source: For this specific case, you could also use ``value = dict.setdefault(key, getvalue(key))``, but only if the ``getvalue()`` call is cheap enough because it is evaluated in all cases.
es_es: Para este caso concreto, también podría utilizar ``value = dict.setdefault(key, getvalue(key))``, pero sólo si la llamada a ``getvalue()`` es lo suficientemente barata, ya que se evalúa en todos los casos.
ru: В этом конкретном случае вы также можете использовать ``value = dict.setdefault(key, getvalue(key))``, но только если вызов ``getvalue()`` достаточно дешев, поскольку он вычисляется во всех случаях.

source: Why isn't there a switch or case statement in Python?
es_es: ¿Por qué no existe la sentencia switch o case en Python?
ru: Почему в Python нет оператора switch или case?

source: In general, structured switch statements execute one block of code when an expression has a particular value or set of values. Since Python 3.10 one can easily match literal values, or constants within a namespace, with a ``match ... case`` statement. An older alternative is a sequence of ``if... elif... elif... else``.
ru: Как правило, структурированные операторы переключения выполняют один блок кода, когда выражение имеет определенное значение или набор значений. Начиная с Python 3.10, можно легко сопоставить литеральные значения или константы в пространстве имен с помощью оператора match...case. Более старая альтернатива — это последовательность ``if... elif... elif... else``.

source: For cases where you need to choose from a very large number of possibilities, you can create a dictionary mapping case values to functions to call. For example::
es_es: Para los casos en los que tenga que elegir entre un gran número de posibilidades, puede crear un diccionario que asigne los valores de los casos a las funciones a las que hay que llamar. Por ejemplo::
ru: В случаях, когда вам нужно выбирать из очень большого количества возможностей, вы можете создать словарь, сопоставляющий значения вариантов с вызываемыми функциями. Например::

source: For calling methods on objects, you can simplify yet further by using the :func:`getattr` built-in to retrieve methods with a particular name::
es_es: Para llamar a los métodos de los objetos, puede simplificar aún más el uso de la :func:`getattr` incorporado para recuperar los métodos con un nombre en particular::
ru: Вызов методов объектов можно еще больше упростить, используя встроенную функцию :func:`getattr` для получения методов с определенным именем::

source: It's suggested that you use a prefix for the method names, such as ``visit_`` in this example. Without such a prefix, if values are coming from an untrusted source, an attacker would be able to call any method on your object.
es_es: Se sugiere utilizar un prefijo para los nombres de los métodos, como ``visit_`` en este ejemplo. Sin este prefijo, si los valores proceden de una fuente no fiable, un atacante podría llamar a cualquier método de tu objeto.
ru: Предлагается использовать префикс для имен методов, например «visit_» в этом примере. Без такого префикса, если значения поступают из ненадежного источника, злоумышленник сможет вызвать любой метод вашего объекта.

source: Imitating switch with fallthrough, as with C's switch-case-default, is possible, much harder, and less needed.
ru: Имитация переключения с провалом, как в случае с switch-case-default в C, возможна, гораздо сложнее и менее необходима.

source: Can't you emulate threads in the interpreter instead of relying on an OS-specific thread implementation?
es_es: ¿No se pueden emular hilos en el intérprete en lugar de depender de una implementación de hilos específica del sistema operativo?
ru: Разве вы не можете эмулировать потоки в интерпретаторе вместо того, чтобы полагаться на реализацию потоков, специфичную для ОС?

source: Answer 1: Unfortunately, the interpreter pushes at least one C stack frame for each Python stack frame. Also, extensions can call back into Python at almost random moments. Therefore, a complete threads implementation requires thread support for C.
es_es: Respuesta 1: Desafortunadamente, el intérprete empuja al menos un marco de pila de C por cada marco de pila de Python. Además, las extensiones pueden volver a llamar a Python en momentos casi aleatorios. Por lo tanto, una implementación completa de hilos requiere soporte de hilos para C.
ru: Ответ 1: К сожалению, интерпретатор помещает как минимум один кадр стека C для каждого кадра стека Python. Кроме того, расширения могут вызывать Python почти в случайные моменты. Таким образом, полная реализация потоков требует поддержки потоков для C.

source: Answer 2: Fortunately, there is `Stackless Python <https://github.com/stackless-dev/stackless/wiki>`_, which has a completely redesigned interpreter loop that avoids the C stack.
es_es: Respuesta 2: Afortunadamente, existe `Stackless Python <https://github.com/stackless-dev/stackless/wiki>`_, que tiene un bucle de interpretación completamente rediseñado que evita la pila C.
ru: Ответ 2: К счастью, существует `Stackless Python <https://github.com/stackless-dev/stackless/wiki>`_, который имеет полностью переработанный цикл интерпретатора, позволяющий избежать использования стека C.

source: Why can't lambda expressions contain statements?
es_es: ¿Por qué las expresiones lambda no pueden contener declaraciones?
ru: Почему лямбда-выражения не могут содержать операторы?

source: Python lambda expressions cannot contain statements because Python's syntactic framework can't handle statements nested inside expressions. However, in Python, this is not a serious problem. Unlike lambda forms in other languages, where they add functionality, Python lambdas are only a shorthand notation if you're too lazy to define a function.
es_es: Las expresiones lambda de Python no pueden contener declaraciones porque el marco sintáctico de Python no puede manejar declaraciones anidadas dentro de expresiones. Sin embargo, en Python, esto no es un problema grave. A diferencia de las formas lambda en otros lenguajes, donde agregan funcionalidad, las lambdas de Python son solo una notación abreviada si eres demasiado perezoso para definir una función.
ru: Лямбда-выражения Python не могут содержать операторы, поскольку синтаксическая структура Python не может обрабатывать операторы, вложенные внутри выражений. Однако в Python это не является серьёзной проблемой. В отличие от лямбда-форм в других языках, где они добавляют функциональности, лямбда-выражения Python — это всего лишь сокращенная запись, если вам лень определять функцию.

source: Functions are already first class objects in Python, and can be declared in a local scope. Therefore the only advantage of using a lambda instead of a locally defined function is that you don't need to invent a name for the function -- but that's just a local variable to which the function object (which is exactly the same type of object that a lambda expression yields) is assigned!
ru: Функции уже являются объектами первого класса в Python и могут быть объявлены в локальной области. Поэтому единственное преимущество использования лямбды вместо локально определенной функции заключается в том, что вам не нужно придумывать имя для функции, а это просто локальная переменная, к которой относится объект функции (который представляет собой объект точно такого же типа). что дает лямбда-выражение) присваивается!

source: Can Python be compiled to machine code, C or some other language?
es_es: ¿Se puede compilar Python a código máquina, C o algún otro lenguaje?
ru: Можно ли скомпилировать Python в машинный код, C или какой-либо другой язык?

source: `Cython <https://cython.org/>`_ compiles a modified version of Python with optional annotations into C extensions. `Nuitka <https://nuitka.net/>`_ is an up-and-coming compiler of Python into C++ code, aiming to support the full Python language.
ru: `Cython <https://cython.org/>`_ компилирует модифицированную версию Python с дополнительными аннотациями в расширения C. `Nuitka <https://nuitka.net/>`_ — это многообещающий компилятор Python в код C++, целью которого является поддержка полного языка Python.

source: How does Python manage memory?
es_es: ¿Cómo gestiona Python la memoria?
ru: Как Python управляет памятью?

source: The details of Python memory management depend on the implementation. The standard implementation of Python, :term:`CPython`, uses reference counting to detect inaccessible objects, and another mechanism to collect reference cycles, periodically executing a cycle detection algorithm which looks for inaccessible cycles and deletes the objects involved. The :mod:`gc` module provides functions to perform a garbage collection, obtain debugging statistics, and tune the collector's parameters.
es_es: Los detalles de la gestión de memoria de Python dependen de la implementación. La implementación estándar de Python, :term:`CPython`, utiliza el recuento de referencias para detectar objetos inaccesibles, y otro mecanismo para recoger ciclos de referencia, ejecutando periódicamente un algoritmo de detección de ciclos que busca ciclos inaccesibles y borra los objetos implicados. El módulo :mod:`gc` proporciona funciones para realizar una recolección de basura, obtener estadísticas de depuración y ajustar los parámetros del recolector.
ru: Детали управления памятью Python зависят от реализации. Стандартная реализация Python, :term:`CPython`, использует подсчет ссылок для обнаружения недоступных объектов и другой механизм для сбора ссылочных циклов, периодически выполняя алгоритм обнаружения циклов, который ищет недоступные циклы и удаляет задействованные объекты. Модуль :mod:`gc` предоставляет функции для выполнения сборки мусора, получения статистики отладки и настройки параметров сборщика.

source: Other implementations (such as `Jython <https://www.jython.org>`_ or `PyPy <https://pypy.org>`_), however, can rely on a different mechanism such as a full-blown garbage collector. This difference can cause some subtle porting problems if your Python code depends on the behavior of the reference counting implementation.
ru: Однако другие реализации (такие как `Jython <https://www.jython.org>`_ или `PyPy <https://pypy.org>`_) могут полагаться на другой механизм, например полноценный сборщик мусора. Эта разница может вызвать некоторые тонкие проблемы при портировании, если ваш код Python зависит от поведения реализации подсчета ссылок.

source: In some Python implementations, the following code (which is fine in CPython) will probably run out of file descriptors::
es_es: En algunas implementaciones de Python, el siguiente código (que está bien en CPython) probablemente se quedará sin descriptores de archivo::
ru: В некоторых реализациях Python в следующем коде (который подходит для CPython), вероятно, не хватит файловых дескрипторов:

source: Indeed, using CPython's reference counting and destructor scheme, each new assignment to ``f`` closes the previous file. With a traditional GC, however, those file objects will only get collected (and closed) at varying and possibly long intervals.
ru: Действительно, используя схему подсчета ссылок и деструктора CPython, каждое новое присвоение ``f`` закрывает предыдущий файл. Однако при использовании традиционного GC эти файловые объекты будут собираться (и закрываться) только через разные и, возможно, длительные интервалы времени.

source: If you want to write code that will work with any Python implementation, you should explicitly close the file or use the :keyword:`with` statement; this will work regardless of memory management scheme::
es_es: Si quieres escribir código que funcione con cualquier implementación de Python, debes cerrar explícitamente el archivo o utilizar la sentencia :keyword:`with`; esto funcionará independientemente del esquema de gestión de memoria::
ru: Если вы хотите написать код, который будет работать с любой реализацией Python, вам следует явно закрыть файл или использовать оператор :keyword:`with`; это будет работать независимо от схемы управления памятью::

source: Why doesn't CPython use a more traditional garbage collection scheme?
es_es: ¿Por qué CPython no utiliza un esquema de recolección de basura más tradicional?
ru: Почему CPython не использует более традиционную схему сборки мусора?

source: For one thing, this is not a C standard feature and hence it's not portable. (Yes, we know about the Boehm GC library. It has bits of assembler code for *most* common platforms, not for all of them, and although it is mostly transparent, it isn't completely transparent; patches are required to get Python to work with it.)
es_es: Por un lado, no es una característica estándar de C y, por tanto, no es portable. (Sí, conocemos la biblioteca Boehm GC. Tiene trozos de código ensamblador para *la mayoría* de las plataformas comunes, no para todas, y aunque es transparente en su mayor parte, no lo es del todo; se necesitan parches para que Python funcione con ella).
ru: Во-первых, это не стандартная функция C и, следовательно, ее нельзя переносить. (Да, мы знаем о библиотеке Boehm GC. В ней есть фрагменты ассемблерного кода для *большинства* распространенных платформ, а не для всех, и хотя она в основном прозрачна, она не полностью прозрачна; для установки Python требуются патчи. работать с ним.)

source: Traditional GC also becomes a problem when Python is embedded into other applications. While in a standalone Python it's fine to replace the standard ``malloc()`` and ``free()`` with versions provided by the GC library, an application embedding Python may want to have its *own* substitute for ``malloc()`` and ``free()``, and may not want Python's. Right now, CPython works with anything that implements ``malloc()`` and ``free()`` properly.
ru: Традиционный сборщик мусора также становится проблемой, когда Python встроен в другие приложения. В то время как в автономном Python можно заменить стандартные ``malloc()`` и ``free()`` версиями, предоставленными библиотекой GC, приложение, встраивающее Python, может захотеть иметь свою *собственную* замену для `` malloc()`` и ``free()``, и, возможно, ему не нужен Python. На данный момент CPython работает со всем, что правильно реализует функции malloc() и free().

source: Why isn't all memory freed when CPython exits?
es_es: ¿Por qué no se libera toda la memoria cuando CPython se cierra?
ru: Почему не вся память освобождается при выходе из CPython?

source: Objects referenced from the global namespaces of Python modules are not always deallocated when Python exits. This may happen if there are circular references. There are also certain bits of memory that are allocated by the C library that are impossible to free (e.g. a tool like Purify will complain about these). Python is, however, aggressive about cleaning up memory on exit and does try to destroy every single object.
es_es: Los objetos referenciados desde los espacios de nombres globales de los módulos de Python no siempre se liberan cuando Python se cierra. Esto puede ocurrir si hay referencias circulares. También hay ciertos fragmentos de memoria que son asignados por la biblioteca C siendo imposibles de liberar (por ejemplo, una herramienta como Purify se quejará de esto). Sin embargo, Python es agresivo en la limpieza de memoria al salir e intenta destruir cada objeto individual.
ru: Объекты, на которые ссылаются глобальные пространства имен модулей Python, не всегда освобождаются при выходе Python. Это может произойти, если есть циклические ссылки. Существуют также определенные биты памяти, выделенные библиотекой C, которые невозможно освободить (например, такой инструмент, как Purify, будет жаловаться на это). Однако Python агрессивно очищает память при выходе и пытается уничтожить каждый объект.

source: If you want to force Python to delete certain things on deallocation use the :mod:`atexit` module to run a function that will force those deletions.
es_es: Si quieres forzar a Python a eliminar ciertas cosas en la desasignación, utiliza el módulo :mod:`atexit` para ejecutar una función que fuerce esas eliminaciones.
ru: Если вы хотите заставить Python удалить определенные объекты при освобождении, используйте модуль :mod:`atexit` для запуска функции, которая будет принудительно выполнять эти удаления.

source: Why are there separate tuple and list data types?
es_es: ¿Por qué existen tipos de datos separados para tuplas y listas?
ru: Почему существуют отдельные типы данных кортежа и списка?

source: Lists and tuples, while similar in many respects, are generally used in fundamentally different ways. Tuples can be thought of as being similar to Pascal ``records`` or C ``structs``; they're small collections of related data which may be of different types which are operated on as a group. For example, a Cartesian coordinate is appropriately represented as a tuple of two or three numbers.
ru: Списки и кортежи, хотя во многих отношениях схожи, обычно используются принципиально разными способами. Кортежи можно рассматривать как нечто подобное "записям" Паскаля или "структурам" Си; это небольшие коллекции связанных данных, которые могут быть разных типов и обрабатываются как группа. Например, декартова координата уместно представляется в виде кортежа из двух или трех чисел.

source: Lists, on the other hand, are more like arrays in other languages. They tend to hold a varying number of objects all of which have the same type and which are operated on one-by-one. For example, :func:`os.listdir('.') <os.listdir>` returns a list of strings representing the files in the current directory. Functions which operate on this output would generally not break if you added another file or two to the directory.
ru: С другой стороны, списки в других языках больше похожи на массивы. Они, как правило, содержат различное количество объектов одного типа, которые обрабатываются один за другим. Например, :func:`os.listdir('.') <os.listdir>` возвращает список строк, представляющих файлы в текущем каталоге. Функции, которые работают с этим выводом, обычно не прерываются, если вы добавляете в каталог еще один или два файла.
