Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/faq/design.po
Languages: es_es, ru

source: Design and History FAQ
es_es: FAQ sobre diseño e historia
ru: Часто задаваемые вопросы по дизайну и истории

source: Contents
es_es: Contenido
ru: Содержание

source: Why does Python use indentation for grouping of statements?
es_es: ¿Por qué Python utiliza la sangría para agrupar sentencias?
ru: Почему Python использует отступы для группировки операторов?

source: Guido van Rossum believes that using indentation for grouping is extremely elegant and contributes a lot to the clarity of the average Python program. Most people learn to love this feature after a while.
es_es: Guido van Rossum cree que usar la sangría para agrupar es extremadamente elegante y contribuye mucho a la claridad del programa Python. La mayoría de la gente aprende a amar esta característica después de un tiempo.
ru: Гвидо ван Россум считает, что использование отступов для группировки чрезвычайно элегантно и вносит большой вклад в ясность средней программы на Python. Большинству людей через некоторое время полюбится эта функция.

source: Since there are no begin/end brackets there cannot be a disagreement between grouping perceived by the parser and the human reader. Occasionally C programmers will encounter a fragment of code like this::
es_es: Como no hay corchetes de inicio/fin, no puede haber desacuerdo entre la agrupación percibida por el analizador sintáctico y el lector humano. Ocasionalmente los programadores de C se encontrarán con un fragmento de código como este::
ru: Поскольку начальных/концевых скобок нет, не может быть разногласий между группировкой, воспринимаемой синтаксическим анализатором, и читателем. Иногда программисты на языке C сталкиваются с таким фрагментом кода:

source: Only the ``x++`` statement is executed if the condition is true, but the indentation leads many to believe otherwise. Even experienced C programmers will sometimes stare at it a long time wondering as to why ``y`` is being decremented even for ``x > y``.
es_es: Sólo se ejecuta la sentencia ``x++`` si la condición es verdadera, pero la sangría lleva a muchos a creer lo contrario. Incluso los programadores de C experimentados a veces se quedan mirándola mucho tiempo preguntándose por qué ``y`` se decrementa incluso para ``x > y``.
ru: Если условие истинно, выполняется только оператор ``x++``, но отступ заставляет многих думать иначе. Даже опытные программисты на C иногда долго смотрят на это, задаваясь вопросом, почему ``y`` уменьшается даже для ``x > y``.

source: Because there are no begin/end brackets, Python is much less prone to coding-style conflicts. In C there are many different ways to place the braces. After becoming used to reading and writing code using a particular style, it is normal to feel somewhat uneasy when reading (or being required to write) in a different one.
es_es: Porque no hay corchetes de inicio/fin, Python es mucho menos propenso a conflictos de estilo de codificación. En C hay muchas formas diferentes de colocar las llaves. Después de acostumbrarse a leer y escribir código usando un estilo particular, es normal sentirse algo incómodo al leer (o ser requerido para escribir) en uno diferente.
ru: Поскольку здесь нет начальных/концевых скобок, Python гораздо менее подвержен конфликтам стилей кодирования. В C есть много разных способов расставить фигурные скобки. После привыкания к чтению и написанию кода с использованием определенного стиля вполне нормально чувствовать некоторую неловкость при чтении (или необходимости писать) в другом стиле.

source: Many coding styles place begin/end brackets on a line by themselves. This makes programs considerably longer and wastes valuable screen space, making it harder to get a good overview of a program. Ideally, a function should fit on one screen (say, 20--30 lines). 20 lines of Python can do a lot more work than 20 lines of C. This is not solely due to the lack of begin/end brackets -- the lack of declarations and the high-level data types are also responsible -- but the indentation-based syntax certainly helps.
es_es: Muchos estilos de codificación colocan los corchetes de inicio/fin en una línea aparte. Esto hace que los programas sean considerablemente más largos y desperdicia espacio en la pantalla, dificultando obtener una buena visión general de un programa. Idealmente, una función debería caber en una pantalla (digamos, 20-30 líneas). 20 líneas de Python pueden hacer mucho más trabajo que 20 líneas de C. Esto no se debe únicamente a la falta de corchetes de inicio/fin, sino que también se debe a la falta de declaraciones y a los tipos de datos de alto nivel, pero la sintaxis basada en la indentación ciertamente ayuda.
ru: Многие стили кодирования сами по себе помещают начальные/конечные скобки в строку. Это делает программы значительно длиннее и тратит ценное пространство на экране, что затрудняет получение хорошего обзора программы. В идеале функция должна умещаться на одном экране (скажем, 20–30 строк). 20 строк Python могут выполнить гораздо больше работы, чем 20 строк C. Это связано не только с отсутствием начальных/концевых скобок (отсутствие объявлений и типов данных высокого уровня также ответственно за это), но и с отступами. -based синтаксис, безусловно, помогает.

source: Why am I getting strange results with simple arithmetic operations?
es_es: ¿Por qué obtengo resultados extraños con operaciones aritméticas simples?
ru: Почему я получаю странные результаты при выполнении простых арифметических операций?

source: See the next question.
es_es: Ver la siguiente pregunta.
ru: Смотрите следующий вопрос.

source: Why are floating-point calculations so inaccurate?
es_es: ¿Por qué los cálculos de punto flotante son tan inexactos?
ru: Почему вычисления с плавающей запятой настолько неточны?

source: Users are often surprised by results like this::
es_es: Los usuarios a menudo se sorprenden por resultados como este:
ru: Пользователи часто удивляются таким результатам:

source: and think it is a bug in Python. It's not. This has little to do with Python, and much more to do with how the underlying platform handles floating-point numbers.
es_es: y piensa que es un error en Python. No lo es. Esto tiene poco que ver con Python y mucho más que ver con cómo la plataforma subyacente maneja los números de punto flotante.
ru: и думаю, что это ошибка в Python. Это не. Это не имеет ничего общего с Python и больше связано с тем, как базовая платформа обрабатывает числа с плавающей запятой.

source: The :class:`float` type in CPython uses a C ``double`` for storage. A :class:`float` object's value is stored in binary floating-point with a fixed precision (typically 53 bits) and Python uses C operations, which in turn rely on the hardware implementation in the processor, to perform floating-point operations. This means that as far as floating-point operations are concerned, Python behaves like many popular languages including C and Java.
es_es: El tipo :class:`float` en CPython utiliza un C ``double`` para el almacenamiento. El valor de un objeto :class:`float` se almacena en coma flotante binaria con una precisión fija (normalmente 53 bits) y Python utiliza operaciones C, que a su vez dependen de la implementación hardware en el procesador, para realizar operaciones en coma flotante. Esto significa que, en lo que respecta a las operaciones de coma flotante, Python se comporta como muchos lenguajes populares, incluidos C y Java.
ru: Тип :class:`float` в CPython использует для хранения данных тип C double. Значение объекта :class:`float` хранится в двоичном формате с плавающей запятой с фиксированной точностью (обычно 53 бита), а Python использует операции C, которые, в свою очередь, зависят от аппаратной реализации в процессоре для выполнения операций с плавающей запятой. Это означает, что в отношении операций с плавающей запятой Python ведет себя так же, как многие популярные языки, включая C и Java.

source: Many numbers that can be written easily in decimal notation cannot be expressed exactly in binary floating point. For example, after::
ru: Многие числа, которые можно легко записать в десятичной системе счисления, невозможно точно выразить в двоичной форме с плавающей запятой. Например, после::

source: the value stored for ``x`` is a (very good) approximation to the decimal value ``1.2``, but is not exactly equal to it. On a typical machine, the actual stored value is::
es_es: El valor almacenado para ``x`` es una (muy buena) aproximación al valor decimal ``1.2``, pero no es exactamente igual. En una máquina típica, el valor almacenado real es:
ru: значение, сохраненное для ``x``, является (очень хорошим) приближением к десятичному значению ``1,2``, но не совсем равно ему. На типичной машине фактическое сохраненное значение равно:

source: which is exactly::
es_es: que es exactamente::
ru: что в точности соответствует::

source: The typical precision of 53 bits provides Python floats with 15--16 decimal digits of accuracy.
es_es: La precisión típica de 53 bits proporciona flotantes Python con 15-16 dígitos decimales de precisión.
ru: Типичная точность в 53 бита обеспечивает точность чисел с плавающей запятой в Python 15–16 десятичных цифр.

source: For a fuller explanation, please see the :ref:`floating-point arithmetic <tut-fp-issues>` chapter in the Python tutorial.
ru: Более полное объяснение можно найти в главе :ref:`Арифметика с плавающей запятой <tut-fp-issues>` в руководстве по Python.

source: Why are Python strings immutable?
es_es: ¿Por qué las cadenas de Python son inmutables?
ru: Почему строки Python неизменяемы?

source: There are several advantages.
es_es: Hay varias ventajas.
ru: Есть несколько преимуществ.

source: One is performance: knowing that a string is immutable means we can allocate space for it at creation time, and the storage requirements are fixed and unchanging. This is also one of the reasons for the distinction between tuples and lists.
es_es: Una es el rendimiento: saber que una cadena es inmutable significa que podemos asignarle espacio en el momento de la creación, y los requisitos de almacenamiento son fijos e invariables. Esta es también una de las razones de la distinción entre tuplas y listas.
ru: Одним из них является производительность: знание того, что строка является неизменной, означает, что мы можем выделить для нее место во время создания, а требования к хранению фиксированы и неизменны. Это также одна из причин различия между кортежами и списками.

source: Another advantage is that strings in Python are considered as "elemental" as numbers. No amount of activity will change the value 8 to anything else, and in Python, no amount of activity will change the string "eight" to anything else.
es_es: Otra ventaja es que las cadenas de texto en Python se consideran tan "elementales" como los números. Ninguna cantidad de actividad cambiará el valor 8 a cualquier otra cosa, y en Python, ninguna cantidad de actividad cambiará la cadena "eight" a cualquier otra cosa.
ru: Еще одним преимуществом является то, что строки в Python считаются такими же «элементарными», как и числа. Никакие действия не изменят значение 8 ни на что другое, а в Python никакие действия не изменят строку «восемь» ни на что другое.

source: Why must 'self' be used explicitly in method definitions and calls?
es_es: ¿Por qué se debe usar 'self' explícitamente en las definiciones y llamadas de métodos?
ru: Почему «self» необходимо явно использовать в определениях и вызовах методов?

source: The idea was borrowed from Modula-3. It turns out to be very useful, for a variety of reasons.
es_es: La idea fue tomada prestada de Modula-3. Resulta ser muy útil, por diversas razones.
ru: Идея была позаимствована у Модулы-3. Это оказывается очень полезным по ряду причин.

source: First, it's more obvious that you are using a method or instance attribute instead of a local variable. Reading ``self.x`` or ``self.meth()`` makes it absolutely clear that an instance variable or method is used even if you don't know the class definition by heart. In C++, you can sort of tell by the lack of a local variable declaration (assuming globals are rare or easily recognizable) -- but in Python, there are no local variable declarations, so you'd have to look up the class definition to be sure. Some C++ and Java coding standards call for instance attributes to have an ``m_`` prefix, so this explicitness is still useful in those languages, too.
es_es: Primero, es más obvio que estás usando un método o atributo de instancia en lugar de una variable local. Leyendo ``self.x`` o ``self.meth()`` queda absolutamente claro que se utiliza una variable de instancia o un método, incluso si no te sabes la definición de la clase de memoria. En C++, puedes darte cuenta por la falta de una declaración de variable local (asumiendo que las globales son raras o fácilmente reconocibles) -- pero en Python, no hay declaraciones de variables locales, así que tendrías que buscar la definición de la clase para estar seguro. Algunos estándares de codificación de C++ y Java exigen que los atributos de instancia tengan un prefijo ``m_``, por lo que esta explicitud también es útil en esos lenguajes.
ru: Во-первых, более очевидно, что вы используете атрибут метода или экземпляра вместо локальной переменной. Чтение ``self.x`` или ``self.meth()`` делает абсолютно ясным, что используется переменная экземпляра или метод, даже если вы не знаете определение класса наизусть. В C++ это можно определить по отсутствию объявления локальной переменной (при условии, что глобальные переменные редки или легко распознаваемы), но в Python нет объявлений локальных переменных, поэтому вам придется искать определение класса, чтобы будьте уверены. Некоторые стандарты кодирования C++ и Java требуют, чтобы атрибуты экземпляра имели префикс ``m_``, поэтому эта явность по-прежнему полезна и в этих языках.

source: Second, it means that no special syntax is necessary if you want to explicitly reference or call the method from a particular class. In C++, if you want to use a method from a base class which is overridden in a derived class, you have to use the ``::`` operator -- in Python you can write ``baseclass.methodname(self, <argument list>)``. This is particularly useful for :meth:`~object.__init__` methods, and in general in cases where a derived class method wants to extend the base class method of the same name and thus has to call the base class method somehow.
ru: Во-вторых, это означает, что никакой специальный синтаксис не требуется, если вы хотите явно ссылаться на метод из определенного класса или вызывать его. В C++, если вы хотите использовать метод базового класса, который переопределен в производном классе, вам необходимо использовать оператор ``::`` - в Python вы можете написать ``baseclass.methodname(self, < список аргументов>)``. Это особенно полезно для методов :meth:`~object.__init__` и в целом в тех случаях, когда метод производного класса хочет расширить одноименный метод базового класса и, следовательно, должен каким-то образом вызвать метод базового класса.

source: Finally, for instance variables it solves a syntactic problem with assignment: since local variables in Python are (by definition!) those variables to which a value is assigned in a function body (and that aren't explicitly declared global), there has to be some way to tell the interpreter that an assignment was meant to assign to an instance variable instead of to a local variable, and it should preferably be syntactic (for efficiency reasons). C++ does this through declarations, but Python doesn't have declarations and it would be a pity having to introduce them just for this purpose. Using the explicit ``self.var`` solves this nicely. Similarly, for using instance variables, having to write ``self.var`` means that references to unqualified names inside a method don't have to search the instance's directories. To put it another way, local variables and instance variables live in two different namespaces, and you need to tell Python which namespace to use.
es_es: Finalmente, para las variables de instancia resuelve un problema sintáctico con las asignaciones: dado que las variables locales en Python son (¡por definición!) aquellas variables a las que se asigna un valor en el cuerpo de una función (y que no están explícitamente declaradas globales), tiene que haber alguna forma de decirle al intérprete que una asignación debía asignarse a una variable de instancia en lugar de a una variable local, y preferiblemente debería ser sintáctica (por razones de eficiencia). C++ hace esto mediante declaraciones, pero Python no tiene declaraciones y sería una pena tener que introducirlas sólo para este propósito. El uso explícito de ``self.var`` resuelve esto muy bien. De forma similar, para usar variables de instancia, tener que escribir ``self.var`` significa que las referencias a nombres no cualificados dentro de un método no tienen que buscar en los directorios de la instancia. Para decirlo de otra manera, las variables locales y las variables de instancia viven en dos espacios de nombres diferentes, y necesitas decirle a Python qué espacio de nombres usar.
ru: Наконец, например, переменные решают синтаксическую проблему с присвоением: поскольку локальные переменные в Python — это (по определению!) те переменные, которым присваивается значение в теле функции (и которые не объявлены явно глобальными), необходимо быть каким-то способом сообщить интерпретатору, что присваивание предназначено для присвоения переменной экземпляра, а не локальной переменной, и желательно, чтобы оно было синтаксическим (по соображениям эффективности). В C++ это делается посредством объявлений, но в Python объявлений нет, и было бы жаль вводить их только для этой цели. Использование явного ``self.var`` прекрасно решает эту проблему. Аналогично, при использовании переменных экземпляра необходимость записи self.var означает, что ссылки на неполные имена внутри метода не должны искать в каталогах экземпляра. Другими словами, локальные переменные и переменные экземпляра находятся в двух разных пространствах имен, и вам нужно указать Python, какое пространство имен использовать.

source: Why can't I use an assignment in an expression?
es_es: ¿Por qué no puedo usar una asignación en una expresión?
ru: Почему я не могу использовать присваивание в выражении?

source: Starting in Python 3.8, you can!
es_es: ¡A partir de Python 3.8, puedes hacerlo!
ru: Начиная с Python 3.8, вы можете!

source: Assignment expressions using the walrus operator ``:=`` assign a variable in an expression::
ru: Выражения присваивания с использованием оператора моржа ``:=`` присваивают переменную в выражении::

source: See :pep:`572` for more information.
es_es: Ver :pep:`572` para más información.
ru: См. :pep:`572` для получения дополнительной информации.

source: Why does Python use methods for some functionality (e.g. list.index()) but functions for other (e.g. len(list))?
es_es: ¿Por qué Python utiliza métodos para algunas funcionalidades (por ejemplo, list.index()) pero funciones para otras (por ejemplo, len(list))?
ru: Почему Python использует методы для некоторых функций (например, list.index()), а функции для других (например, len(list))?

source: As Guido said:
es_es: Como dijo Guido:
ru: Как сказал Гвидо:

source: (a) For some operations, prefix notation just reads better than postfix -- prefix (and infix!) operations have a long tradition in mathematics which likes notations where the visuals help the mathematician thinking about a problem. Compare the easy with which we rewrite a formula like x*(a+b) into x*a + x*b to the clumsiness of doing the same thing using a raw OO notation.
es_es: (a) Para algunas operaciones, la notación prefija simplemente se lee mejor que la posfija: las operaciones prefijas (¡e infijas!) tienen una larga tradición en las matemáticas, que prefieren notaciones donde lo visual ayuda al matemático a pensar en un problema. Compara lo fácil que es reescribir una fórmula como x*(a+b) en x*a + x*b con la torpeza de hacer lo mismo usando una notación de programación orientada a objetos sin procesar.
ru: Почему Python использует методы для некоторых функций (например, list.index()), а функции для других (например, len(list))?

source: (b) When I read code that says len(x) I *know* that it is asking for the length of something. This tells me two things: the result is an integer, and the argument is some kind of container. To the contrary, when I read x.len(), I have to already know that x is some kind of container implementing an interface or inheriting from a class that has a standard len(). Witness the confusion we occasionally have when a class that is not implementing a mapping has a get() or keys() method, or something that isn't a file has a write() method.
es_es: (b) Cuando leo código que dice len(x) *sé* que está pidiendo la longitud de algo. Esto me dice dos cosas: el resultado es un entero y el argumento es algún tipo de contenedor. Por el contrario, cuando leo x.len(), ya tengo que saber que x es algún tipo de contenedor que implementa una interfaz o hereda de una clase que tiene un len() estándar. Observa la confusión que ocasionalmente tenemos cuando una clase que no implementa un mapeo tiene un método get() o keys(), o cuando algo que no es un archivo tiene un método write().
ru: (б) Когда я читаю код, который говорит len(x), я *знаю*, что он запрашивает длину чего-то. Это говорит мне о двух вещах: результат — целое число, а аргумент — это своего рода контейнер. Напротив, когда я читаю x.len(), я уже должен знать, что x — это своего рода контейнер, реализующий интерфейс или наследуемый от класса, который имеет стандартный len(). Посмотрите, какая путаница иногда возникает, когда класс, не реализующий сопоставление, имеет метод get() илиkeys(), или что-то, не являющееся файлом, имеет метод write().

source: Why is join() a string method instead of a list or tuple method?
es_es: ¿Por qué join() es un método de cadena en lugar de un método de lista o tupla?
ru: Почему join() является строковым методом, а не методом списка или кортежа?

source: Strings became much more like other standard types starting in Python 1.6, when methods were added which give the same functionality that has always been available using the functions of the string module. Most of these new methods have been widely accepted, but the one which appears to make some programmers feel uncomfortable is::
es_es: Las cadenas se volvieron mucho más parecidas a otros tipos estándar a partir de Python 1.6, cuando se añadieron métodos que proporcionan la misma funcionalidad que siempre ha estado disponible utilizando las funciones del módulo string. La mayoría de estos nuevos métodos han sido ampliamente aceptados, pero el que parece incomodar a algunos programadores es::
ru: Строки стали намного больше походить на другие стандартные типы, начиная с Python 1.6, когда были добавлены методы, предоставляющие ту же функциональность, которая всегда была доступна при использовании функций строкового модуля. Большинство из этих новых методов получили широкое признание, но один из них, по-видимому, заставляет некоторых программистов чувствовать себя некомфортно:

source: which gives the result::
es_es: que da el resultado::
ru: что дает результат::

source: There are two common arguments against this usage.
es_es: Hay dos argumentos comunes en contra de este uso.
ru: Есть два распространенных аргумента против такого использования.
