Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/faq/design.po
Languages: es_es, ru

source: Tuples are immutable, meaning that once a tuple has been created, you can't replace any of its elements with a new value. Lists are mutable, meaning that you can always change a list's elements. Only immutable elements can be used as dictionary keys, and hence only tuples and not lists can be used as keys.
es_es: Las tuplas son inmutables, es decir, una vez creada una tupla, no puedes sustituir ninguno de sus elementos por un nuevo valor. Las listas son mutables, lo que significa que siempre puedes cambiar los elementos de una lista. Sólo los elementos inmutables pueden usarse como claves del diccionario, y por lo tanto sólo las tuplas y no las listas pueden usarse como claves.
ru: Кортежи неизменяемы. Это означает, что после создания кортежа вы не сможете заменить ни один из его элементов новым значением. Списки изменяемы, что означает, что вы всегда можете изменить элементы списка. В качестве ключей словаря можно использовать только неизменяемые элементы, и, следовательно, в качестве ключей можно использовать только кортежи, а не списки.

source: How are lists implemented in CPython?
es_es: ¿Cómo se implementan las listas en CPython?
ru: Как списки реализованы в CPython?

source: CPython's lists are really variable-length arrays, not Lisp-style linked lists. The implementation uses a contiguous array of references to other objects, and keeps a pointer to this array and the array's length in a list head structure.
es_es: Las listas de CPython son realmente matrices de longitud variable, no listas enlazadas al estilo Lisp. La implementación utiliza un array contiguo de referencias a otros objetos, y mantiene un puntero a este array y la longitud del array en una estructura de cabecera de lista.
ru: Списки CPython на самом деле представляют собой массивы переменной длины, а не связанные списки в стиле Lisp. Реализация использует непрерывный массив ссылок на другие объекты и сохраняет указатель на этот массив и длину массива в структуре заголовка списка.

source: This makes indexing a list ``a[i]`` an operation whose cost is independent of the size of the list or the value of the index.
es_es: Esto hace que indexar una lista ``a[i]`` sea una operación cuyo coste es independiente del tamaño de la lista o del valor del índice.
ru: Это делает индексацию списка ``a[i]`` операцией, стоимость которой не зависит от размера списка или значения индекса.

source: When items are appended or inserted, the array of references is resized. Some cleverness is applied to improve the performance of appending items repeatedly; when the array must be grown, some extra space is allocated so the next few times don't require an actual resize.
es_es: Cuando se añaden o insertan elementos, se redimensiona la matriz de referencias. Para mejorar el rendimiento de la adición repetida de elementos, se aplican algunas técnicas inteligentes: cuando la matriz debe crecer, se asigna espacio adicional para que las siguientes veces no sea necesario redimensionarla.
ru: Когда элементы добавляются или вставляются, размер массива ссылок изменяется. Некоторая хитрость применена для повышения производительности многократного добавления элементов; когда массив необходимо увеличить, выделяется некоторое дополнительное пространство, поэтому в следующие несколько раз фактического изменения размера не потребуется.

source: How are dictionaries implemented in CPython?
es_es: ¿Cómo se implementan los diccionarios en CPython?
ru: Как словари реализованы в CPython?

source: CPython's dictionaries are implemented as resizable hash tables. Compared to B-trees, this gives better performance for lookup (the most common operation by far) under most circumstances, and the implementation is simpler.
es_es: Los diccionarios de CPython se implementan como tablas hash redimensionables. En comparación con los árboles B, esto proporciona un mejor rendimiento para la búsqueda (la operación más común con diferencia) en la mayoría de las circunstancias, y la implementación es más sencilla.
ru: Словари CPython реализованы в виде хеш-таблиц изменяемого размера. По сравнению с B-деревьями это обеспечивает более высокую производительность поиска (самая распространенная операция) в большинстве случаев, а реализация проще.

source: Why must dictionary keys be immutable?
es_es: ¿Por qué deben ser inmutables las claves de un diccionario?
ru: Почему ключи словаря должны быть неизменяемыми?

source: The hash table implementation of dictionaries uses a hash value calculated from the key value to find the key. If the key were a mutable object, its value could change, and thus its hash could also change. But since whoever changes the key object can't tell that it was being used as a dictionary key, it can't move the entry around in the dictionary. Then, when you try to look up the same object in the dictionary it won't be found because its hash value is different. If you tried to look up the old value it wouldn't be found either, because the value of the object found in that hash bin would be different.
es_es: La implementación de tablas hash de los diccionarios utiliza un valor hash calculado a partir del valor clave para encontrar la clave. Si la clave fuera un objeto mutable, su valor podría cambiar y, por lo tanto, su hash también podría cambiar. Pero dado que quien cambia el objeto clave no puede saber que se está utilizando como clave de diccionario, no puede mover la entrada en el diccionario. Entonces, cuando intentas buscar el mismo objeto en el diccionario, no se encontrará porque su valor hash es diferente. Si intentaras buscar el valor antiguo, tampoco se encontraría, porque el valor del objeto encontrado en ese contenedor hash sería diferente.
ru: Реализация хэш-таблицы словарей использует хеш-значение, рассчитанное на основе значения ключа, для поиска ключа. Если бы ключ был изменяемым объектом, его значение могло бы измениться, и, следовательно, его хеш также мог бы измениться. Но поскольку тот, кто меняет ключевой объект, не может определить, что он использовался в качестве ключа словаря, он не может перемещать запись в словаре. Затем, когда вы попытаетесь найти тот же объект в словаре, он не будет найден, поскольку его хэш-значение отличается. Если бы вы попытались найти старое значение, оно также не было бы найдено, поскольку значение объекта, найденного в этом хеш-корзине, было бы другим.

source: If you want a dictionary indexed with a list, simply convert the list to a tuple first; the function ``tuple(L)`` creates a tuple with the same entries as the list ``L``. Tuples are immutable and can therefore be used as dictionary keys.
es_es: Si desea un diccionario indexado con una lista, simplemente convierta primero la lista en una tupla; la función ``tuple(L)`` crea una tupla con las mismas entradas que la lista ``L``. Las tuplas son inmutables y, por tanto, pueden utilizarse como claves de diccionario.
ru: Если вы хотите, чтобы словарь индексировался со списком, просто сначала преобразуйте список в кортеж; функция ``tuple(L)`` создает кортеж с теми же записями, что и список ``L``. Кортежи неизменяемы и поэтому могут использоваться в качестве ключей словаря.

source: Some unacceptable solutions that have been proposed:
es_es: Se han propuesto algunas soluciones inaceptables:
ru: Некоторые неприемлемые решения, которые были предложены:

source: Hash lists by their address (object ID). This doesn't work because if you construct a new list with the same value it won't be found; e.g.::
es_es: Listas hash por su dirección (ID de objeto). Esto no funciona porque si construyes una nueva lista con el mismo valor no se encontrará; por ejemplo::
ru: Хэш-листы по их адресу (идентификатору объекта). Это не работает, потому что если вы создадите новый список с тем же значением, он не будет найден; например::

source: would raise a :exc:`KeyError` exception because the id of the ``[1, 2]`` used in the second line differs from that in the first line. In other words, dictionary keys should be compared using ``==``, not using :keyword:`is`.
es_es: lanzaría una excepción :exc:`KeyError` porque el id del ``[1, 2]`` utilizado en la segunda línea difiere del de la primera línea. En otras palabras, las claves del diccionario deben compararse utilizando ``==``, no utilizando :keyword:`is`.
ru: вызовет исключение :exc:`KeyError`, поскольку идентификатор ``[1, 2]``, используемый во второй строке, отличается от идентификатора в первой строке. Другими словами, ключи словаря следует сравнивать с использованием ``==``, а не с использованием :keyword:`is`.

source: Make a copy when using a list as a key. This doesn't work because the list, being a mutable object, could contain a reference to itself, and then the copying code would run into an infinite loop.
es_es: Hacer una copia cuando se utiliza una lista como clave. Esto no funciona porque la lista, al ser un objeto mutable, podría contener una referencia a sí misma, y entonces el código de copia entraría en un bucle infinito.
ru: Сделайте копию при использовании списка в качестве ключа. Это не работает, поскольку список, будучи изменяемым объектом, может содержать ссылку на самого себя, и тогда код копирования запустится в бесконечный цикл.

source: Allow lists as keys but tell the user not to modify them. This would allow a class of hard-to-track bugs in programs when you forgot or modified a list by accident. It also invalidates an important invariant of dictionaries: every value in ``d.keys()`` is usable as a key of the dictionary.
es_es: Permitir listas como claves pero decirle al usuario que no las modifique. Esto permitiría una clase de errores difíciles de rastrear en los programas cuando se olvida o modifica una lista por accidente. También invalida una invariante importante de los diccionarios: cada valor en ``d.keys()`` es utilizable como clave del diccionario.
ru: Разрешите списки в качестве ключей, но попросите пользователя не изменять их. Это позволило бы выявить класс трудно отслеживаемых ошибок в программах, когда вы случайно забыли или изменили список. Это также делает недействительным важный инвариант словарей: каждое значение в d.keys() можно использовать в качестве ключа словаря.

source: Mark lists as read-only once they are used as a dictionary key. The problem is that it's not just the top-level object that could change its value; you could use a tuple containing a list as a key. Entering anything as a key into a dictionary would require marking all objects reachable from there as read-only -- and again, self-referential objects could cause an infinite loop.
es_es: Marcar las listas como de solo lectura una vez que se utilizan como clave de un diccionario. El problema es que no solo el objeto de nivel superior podría cambiar su valor; se podría utilizar una tupla que contenga una lista como clave. Ingresar cualquier cosa como clave en un diccionario requeriría marcar todos los objetos alcanzables desde allí como de solo lectura, y nuevamente, los objetos autorreferenciales podrían causar un bucle infinito.
ru: Помечайте списки как доступные только для чтения, если они используются в качестве ключа словаря. Проблема в том, что не только объект верхнего уровня может изменить свое значение; вы можете использовать кортеж, содержащий список, в качестве ключа. Ввод чего-либо в качестве ключа в словарь потребует пометки всех доступных оттуда объектов как доступных только для чтения — и опять же, самоссылающиеся объекты могут вызвать бесконечный цикл.

source: There is a trick to get around this if you need to, but use it at your own risk: You can wrap a mutable structure inside a class instance which has both a :meth:`~object.__eq__` and a :meth:`~object.__hash__` method. You must then make sure that the hash value for all such wrapper objects that reside in a dictionary (or other hash based structure), remain fixed while the object is in the dictionary (or other structure). ::
ru: Если вам нужно, есть способ обойти это, но используйте его на свой страх и риск: вы можете обернуть изменяемую структуру внутри экземпляра класса, который имеет как :meth:`~object.__eq__`, так и :meth:` Метод ~object.__hash__`. Затем вы должны убедиться, что хэш-значение для всех таких объектов-оболочек, которые находятся в словаре (или другой хеш-структуре), остается фиксированным, пока объект находится в словаре (или другой структуре). ::

source: Note that the hash computation is complicated by the possibility that some members of the list may be unhashable and also by the possibility of arithmetic overflow.
es_es: Tenga en cuenta que el cálculo del hash se complica por la posibilidad de que algunos miembros de la lista no sean hashables y también por la posibilidad de desbordamiento aritmético.
ru: Обратите внимание, что вычисление хэша осложняется возможностью того, что некоторые члены списка могут быть нехешируемыми, а также возможностью арифметического переполнения.

source: Furthermore it must always be the case that if ``o1 == o2`` (ie ``o1.__eq__(o2) is True``) then ``hash(o1) == hash(o2)`` (ie, ``o1.__hash__() == o2.__hash__()``), regardless of whether the object is in a dictionary or not. If you fail to meet these restrictions dictionaries and other hash based structures will misbehave.
es_es: Además, siempre debe darse el caso de que si ``o1 == o2`` (es decir, ``o1.__eq__(o2) is True``) entonces ``hash(o1) == hash(o2)`` (es decir, ``o1.__hash__() == o2.__hash__()``), independientemente de si el objeto está en un diccionario o no. Si no se cumplen estas restricciones, los diccionarios y otras estructuras basadas en hash se comportarán mal.
ru: Более того, всегда должно быть так, что если ``o1 == o2`` (т.е. ``o1.__eq__(o2) равно True``), то ``hash(o1) == hash(o2)`` (т.е. ``o1.__hash__() == o2.__hash__()``), независимо от того, находится ли объект в словаре или нет. Если вы не соблюли эти ограничения, словари и другие хэш-структуры будут работать неправильно.

source: In the case of :class:`!ListWrapper`, whenever the wrapper object is in a dictionary the wrapped list must not change to avoid anomalies. Don't do this unless you are prepared to think hard about the requirements and the consequences of not meeting them correctly. Consider yourself warned.
ru: В случае :class:`!ListWrapper`, всякий раз, когда объект-оболочка находится в словаре, обернутый список не должен меняться во избежание аномалий. Не делайте этого, если вы не готовы хорошенько подумать о требованиях и последствиях их неправильного выполнения. Считайте себя предупрежденным.

source: Why doesn't list.sort() return the sorted list?
es_es: ¿Por qué list.sort() no devuelve la lista ordenada?
ru: Почему list.sort() не возвращает отсортированный список?

source: In situations where performance matters, making a copy of the list just to sort it would be wasteful. Therefore, :meth:`list.sort` sorts the list in place. In order to remind you of that fact, it does not return the sorted list. This way, you won't be fooled into accidentally overwriting a list when you need a sorted copy but also need to keep the unsorted version around.
es_es: En situaciones donde el rendimiento es importante, hacer una copia de la lista solo para ordenarla sería un desperdicio. Por lo tanto, :meth:`list.sort` ordena la lista en su lugar. Para recordarte ese hecho, no devuelve la lista ordenada. De esta manera, no te engañarás al sobrescribir accidentalmente una lista cuando necesites una copia ordenada pero también necesites mantener la versión desordenada.
ru: В ситуациях, когда производительность имеет значение, создание копии списка только для его сортировки было бы расточительством. Таким образом, :meth:`list.sort` сортирует список на месте. Чтобы напомнить вам об этом факте, он не возвращает отсортированный список. Таким образом, вы не будете обмануты, случайно перезаписав список, когда вам нужна отсортированная копия, но вам также необходимо сохранить неотсортированную версию.

source: If you want to return a new list, use the built-in :func:`sorted` function instead. This function creates a new list from a provided iterable, sorts it and returns it. For example, here's how to iterate over the keys of a dictionary in sorted order::
es_es: Si quieres devolver una nueva lista, utiliza la función incorporada :func:`sorted` en su lugar. Esta función crea una nueva lista a partir de un iterable proporcionado, la ordena y la devuelve. Por ejemplo, así es como se itera sobre las claves de un diccionario en orden ordenado:
ru: Если вы хотите вернуть новый список, используйте вместо этого встроенную функцию :func:`sorted`. Эта функция создает новый список из предоставленной итерации, сортирует его и возвращает. Например, вот как перебирать ключи словаря в отсортированном порядке:

source: How do you specify and enforce an interface spec in Python?
es_es: ¿Cómo se especifica y se hace cumplir una especificación de interfaz en Python?
ru: Как указать и обеспечить соблюдение спецификации интерфейса в Python?

source: An interface specification for a module as provided by languages such as C++ and Java describes the prototypes for the methods and functions of the module. Many feel that compile-time enforcement of interface specifications helps in the construction of large programs.
es_es: Una especificación de interfaz para un módulo, tal como se proporciona en lenguajes como C++ y Java, describe los prototipos de los métodos y funciones del módulo. Muchos consideran que la aplicación de la especificación de interfaz en tiempo de compilación ayuda en la construcción de programas grandes.
ru: Спецификация интерфейса модуля, предоставляемая такими языками, как C++ и Java, описывает прототипы методов и функций модуля. Многие считают, что соблюдение спецификаций интерфейса во время компиляции помогает при создании больших программ.

source: Python 2.6 adds an :mod:`abc` module that lets you define Abstract Base Classes (ABCs). You can then use :func:`isinstance` and :func:`issubclass` to check whether an instance or a class implements a particular ABC. The :mod:`collections.abc` module defines a set of useful ABCs such as :class:`~collections.abc.Iterable`, :class:`~collections.abc.Container`, and :class:`~collections.abc.MutableMapping`.
es_es: Python 2.6 añade un módulo :mod:`abc` que te permite definir Clases Base Abstractas (ABCs). Luego puedes usar :func:`isinstance` y :func:`issubclass` para comprobar si una instancia o una clase implementa una determinada ABC. El módulo :mod:`collections.abc` define un conjunto de útiles ABCs como :class:`~collections.abc.Iterable`, :class:`~collections.abc.Container` y :class:`~collections.abc.MutableMapping`.
ru: В Python 2.6 добавлен модуль :mod:`abc`, который позволяет определять абстрактные базовые классы (ABC). Затем вы можете использовать :func:`isinstance` и :func:`issubclass`, чтобы проверить, реализует ли экземпляр или класс определенный ABC. Модуль :mod:`collections.abc` определяет набор полезных ABC, таких как :class:`~collections.abc.Iterable`, :class:`~collections.abc.Container` и :class:`~collections. abc.MutableMapping`.

source: For Python, many of the advantages of interface specifications can be obtained by an appropriate test discipline for components.
es_es: Para Python, muchos de los beneficios de las especificaciones de interfaz se pueden obtener mediante una disciplina de prueba adecuada para los componentes.
ru: Для Python многие преимущества спецификаций интерфейсов могут быть получены за счет соответствующей дисциплины тестирования компонентов.

source: A good test suite for a module can both provide a regression test and serve as a module interface specification and a set of examples. Many Python modules can be run as a script to provide a simple "self test." Even modules which use complex external interfaces can often be tested in isolation using trivial "stub" emulations of the external interface. The :mod:`doctest` and :mod:`unittest` modules or third-party test frameworks can be used to construct exhaustive test suites that exercise every line of code in a module.
es_es: Un buen conjunto de pruebas para un módulo puede proporcionar tanto una prueba de regresión como servir como una especificación de interfaz de módulo y un conjunto de ejemplos. Muchos módulos de Python se pueden ejecutar como un script para proporcionar una "auto prueba" simple. Incluso los módulos que utilizan interfaces externas complejas a menudo se pueden probar de forma aislada utilizando emulaciones triviales de "stub" de la interfaz externa. Los módulos :mod:`doctest` y :mod:`unittest` o marcos de pruebas de terceros se pueden utilizar para construir conjuntos de pruebas exhaustivos que ejerciten cada línea de código en un módulo.
ru: Хороший набор тестов для модуля может служить как регрессионным тестом, так и спецификацией интерфейса модуля и набором примеров. Многие модули Python можно запускать как сценарии для обеспечения простого «самотестирования». Даже модули, использующие сложные внешние интерфейсы, часто можно тестировать изолированно, используя тривиальную «заглушку» эмуляции внешнего интерфейса. Модули :mod:`doctest` и :mod:`unittest` или сторонние среды тестирования можно использовать для создания исчерпывающих наборов тестов, которые проверяют каждую строку кода в модуле.

source: An appropriate testing discipline can help build large complex applications in Python as well as having interface specifications would. In fact, it can be better because an interface specification cannot test certain properties of a program. For example, the :meth:`!list.append` method is expected to add new elements to the end of some internal list; an interface specification cannot test that your :meth:`!list.append` implementation will actually do this correctly, but it's trivial to check this property in a test suite.
ru: Соответствующая дисциплина тестирования может помочь создавать большие сложные приложения на Python, а также иметь спецификации интерфейса. На самом деле, это может быть лучше, поскольку спецификация интерфейса не может проверять определенные свойства программы. Например, ожидается, что метод :meth:`!list.append` добавит новые элементы в конец некоторого внутреннего списка; спецификация интерфейса не может проверить, что ваша реализация :meth:`!list.append` действительно сделает это правильно, но проверить это свойство в наборе тестов очень просто.

source: Writing test suites is very helpful, and you might want to design your code to make it easily tested. One increasingly popular technique, test-driven development, calls for writing parts of the test suite first, before you write any of the actual code. Of course Python allows you to be sloppy and not write test cases at all.
es_es: Escribir conjuntos de pruebas es muy útil, y es posible que desees diseñar tu código para que sea fácilmente probado. Una técnica cada vez más popular, el desarrollo guiado por pruebas, consiste en escribir partes del conjunto de pruebas primero, antes de escribir cualquier código real. Por supuesto, Python te permite ser descuidado y no escribir casos de prueba en absoluto.
ru: Написание наборов тестов очень полезно, и вы, возможно, захотите спроектировать свой код так, чтобы его можно было легко тестировать. Один из все более популярных методов — разработка через тестирование — требует сначала написания частей набора тестов, прежде чем писать какой-либо реальный код. Конечно, Python позволяет вам быть небрежным и вообще не писать тестовые примеры.

source: Why is there no goto?
es_es: ¿Por qué no hay goto?
ru: Почему нет перехода?
