Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/faq/general.po
Languages: es_es, ru

source: Many other aspects of Python make it a good first language. Like Java, Python has a large standard library so that students can be assigned programming projects very early in the course that *do* something. Assignments aren't restricted to the standard four-function calculator and check balancing programs. By using the standard library, students can gain the satisfaction of working on realistic applications as they learn the fundamentals of programming. Using the standard library also teaches students about code reuse. Third-party modules such as PyGame are also helpful in extending the students' reach.
es_es: Muchos otros aspectos de Python lo convierten en un buen primer lenguaje. Al igual que Java, Python cuenta con una amplia biblioteca estándar, de modo que a los estudiantes se les pueden asignar proyectos de programación muy pronto en el curso que *hagan* algo. Las tareas no se limitan a los programas estándar de calculadora de cuatro funciones y de balance de cheques. Mediante el uso de la biblioteca estándar, los estudiantes pueden obtener la satisfacción de trabajar en aplicaciones realistas a medida que aprenden los fundamentos de la programación. El uso de la biblioteca estándar también enseña a los estudiantes sobre la reutilización de código. Los módulos de terceros, como PyGame, también son útiles para ampliar el alcance de los estudiantes.
ru: Многие другие аспекты Python делают его хорошим первым языком. Как и Java, Python имеет большую стандартную библиотеку, поэтому на ранних этапах курса студентам могут быть поручены проекты по программированию, которые *делают* что-то. Задания не ограничиваются стандартным калькулятором с четырьмя функциями и программами проверки балансировки. Используя стандартную библиотеку, студенты могут получить удовлетворение от работы над реалистичными приложениями, изучая основы программирования. Использование стандартной библиотеки также учит студентов повторному использованию кода. Сторонние модули, такие как PyGame, также помогают расширить возможности учащихся.

source: Python's interactive interpreter enables students to test language features while they're programming. They can keep a window with the interpreter running while they enter their program's source in another window. If they can't remember the methods for a list, they can do something like this::
es_es: El intérprete interactivo de Python permite a los estudiantes probar las características del lenguaje mientras programan. Pueden mantener una ventana con el intérprete en funcionamiento mientras introducen el código fuente de su programa en otra ventana. Si no pueden recordar los métodos para una lista, pueden hacer algo como esto::
ru: Интерактивный интерпретатор Python позволяет учащимся тестировать возможности языка во время программирования. Они могут оставить окно с работающим интерпретатором, пока вводят исходный код своей программы в другом окне. Если они не могут вспомнить методы списка, они могут сделать что-то вроде этого:

source: With the interpreter, documentation is never far from the student as they are programming.
es_es: Con el intérprete, la documentación nunca está lejos del alumno mientras programa.
ru: Благодаря интерпретатору документация всегда находится под рукой у студента, пока он программирует.

source: There are also good IDEs for Python. IDLE is a cross-platform IDE for Python that is written in Python using Tkinter. Emacs users will be happy to know that there is a very good Python mode for Emacs. All of these programming environments provide syntax highlighting, auto-indenting, and access to the interactive interpreter while coding. Consult `the Python wiki <https://wiki.python.org/moin/PythonEditors>`_ for a full list of Python editing environments.
ru: Есть также хорошие IDE для Python. IDLE — это кроссплатформенная IDE для Python, написанная на Python с использованием Tkinter. Пользователи Emacs будут рады узнать, что для Emacs существует очень хороший режим Python. Все эти среды программирования обеспечивают подсветку синтаксиса, автоматические отступы и доступ к интерактивному интерпретатору во время кодирования. Обратитесь к `вики Python <https://wiki.python.org/moin/PythonEditors>`_ для получения полного списка сред редактирования Python.

source: If you want to discuss Python's use in education, you may be interested in joining `the edu-sig mailing list <https://www.python.org/community/sigs/current/edu-sig>`_.
es_es: Si quieres debatir sobre el uso de Python en la educación, quizá te interese unirte a `la lista de correo edu-sig <https://www.python.org/community/sigs/current/edu-sig>`_.
ru: Если вы хотите обсудить использование Python в образовании, возможно, вам будет интересно присоединиться к списку рассылки edu-sig <https://www.python.org/community/sigs/current/edu-sig>_.
