Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/faq/general.po
Languages: es_es, ru

source: The documentation is written in reStructuredText and processed by `the Sphinx documentation tool <https://www.sphinx-doc.org/>`__. The reStructuredText source for the documentation is part of the Python source distribution.
ru: Документация написана в reStructuredText и обрабатывается `инструментом документации Sphinx <https://www.sphinx-doc.org/>`__. Исходный код reStructuredText для документации является частью дистрибутива исходного кода Python.

source: I've never programmed before. Is there a Python tutorial?
es_es: Nunca he programado antes. ¿Hay un tutorial de Python?
ru: Я никогда раньше не программировал. Есть ли учебник по Python?

source: There are numerous tutorials and books available. The standard documentation includes :ref:`tutorial-index`.
es_es: Hay numerosos tutoriales y libros disponibles. La documentación estándar incluye :ref:`tutorial-index`.
ru: Доступно множество учебных пособий и книг. Стандартная документация включает:ref:`tutorial-index`.

source: Consult `the Beginner's Guide <https://wiki.python.org/moin/BeginnersGuide>`_ to find information for beginning Python programmers, including lists of tutorials.
es_es: Consulte `the Beginner's Guide <https://wiki.python.org/moin/BeginnersGuide>`_ para encontrar información para programadores principiantes de Python, incluyendo listas de tutoriales.
ru: Обратитесь к `Руководству для начинающих <https://wiki.python.org/moin/BeginnersGuide>`_, чтобы найти информацию для начинающих программистов Python, включая списки учебных пособий.

source: Is there a newsgroup or mailing list devoted to Python?
es_es: ¿Existe algún grupo de noticias o lista de correo dedicado a Python?
ru: Есть ли группа новостей или список рассылки, посвященные Python?

source: There is a newsgroup, :newsgroup:`comp.lang.python`, and a mailing list, `python-list <https://mail.python.org/mailman/listinfo/python-list>`_. The newsgroup and mailing list are gatewayed into each other -- if you can read news it's unnecessary to subscribe to the mailing list. :newsgroup:`comp.lang.python` is high-traffic, receiving hundreds of postings every day, and Usenet readers are often more able to cope with this volume.
es_es: Existe un grupo de noticias, :newsgroup:`comp.lang.python`, y una lista de correo, `python-list <https://mail.python.org/mailman/listinfo/python-list>`_. El grupo de noticias y la lista de correo están conectados entre sí: si puede leer las noticias, no es necesario que se suscriba a la lista de correo. :newsgroup:`comp.lang.python` es un grupo de alto tráfico, que recibe cientos de mensajes cada día, y los lectores de Usenet suelen ser más capaces de hacer frente a este volumen.
ru: Существует группа новостей :newsgroup:`comp.lang.python` и список рассылки `python-list <https://mail.python.org/mailman/listinfo/python-list>`_. Группа новостей и список рассылки связаны друг с другом — если вы можете читать новости, нет необходимости подписываться на список рассылки. :newsgroup:`comp.lang.python` имеет большой трафик, ежедневно получает сотни сообщений, и читатели Usenet зачастую более способны справиться с таким объемом.

source: Announcements of new software releases and events can be found in comp.lang.python.announce, a low-traffic moderated list that receives about five postings per day. It's available as `the python-announce mailing list <https://mail.python.org/mailman3/lists/python-announce-list.python.org/>`_.
ru: Объявления о новых выпусках программного обеспечения и мероприятиях можно найти в comp.lang.python.announce — модерируемом списке с низким трафиком, в который поступает около пяти публикаций в день. Он доступен как `список рассылки python-announce <https://mail.python.org/mailman3/lists/python-announce-list.python.org/>`_.

source: More info about other mailing lists and newsgroups can be found at https://www.python.org/community/lists/.
es_es: Encontrará más información sobre otras listas de correo y grupos de noticias en https://www.python.org/community/lists/.
ru: Дополнительную информацию о других списках рассылки и группах новостей можно найти по адресу https://www.python.org/community/lists/.

source: How do I get a beta test version of Python?
es_es: ¿Cómo puedo obtener una versión de prueba beta de Python?
ru: Как мне получить бета-тестовую версию Python?

source: Alpha and beta releases are available from https://www.python.org/downloads/. All releases are announced on the comp.lang.python and comp.lang.python.announce newsgroups and on the Python home page at https://www.python.org/; an RSS feed of news is available.
es_es: Las versiones alfa y beta están disponibles en https://www.python.org/downloads/. Todas las versiones se anuncian en los grupos de noticias comp.lang.python y comp.lang.python.announce y en la página de inicio de Python en https://www.python.org/; existe un canal RSS de noticias.
ru: Альфа- и бета-версии доступны по адресу https://www.python.org/downloads/. Обо всех выпусках объявляется в группах новостей comp.lang.python и comp.lang.python.announce, а также на домашней странице Python по адресу https://www.python.org/; доступен RSS-канал новостей.

source: You can also access the development version of Python through Git. See `The Python Developer's Guide <https://devguide.python.org/>`_ for details.
es_es: También puedes acceder a la versión de desarrollo de Python a través de Git. Para más detalles ver `The Python Developer's Guide <https://devguide.python.org/>`_ .
ru: Вы также можете получить доступ к разрабатываемой версии Python через Git. Подробности см. в `Руководстве разработчика Python <https://devguide.python.org/>`_.

source: How do I submit bug reports and patches for Python?
es_es: ¿Cómo puedo enviar informes de errores y parches para Python?
ru: Как отправлять отчеты об ошибках и исправления для Python?

source: To report a bug or submit a patch, use the issue tracker at https://github.com/python/cpython/issues.
ru: Чтобы сообщить об ошибке или отправить исправление, воспользуйтесь системой отслеживания проблем по адресу https://github.com/python/cpython/issues.

source: For more information on how Python is developed, consult `the Python Developer's Guide <https://devguide.python.org/>`_.
es_es: Para más información sobre cómo se desarrolla Python, ver `the Python Developer's Guide <https://devguide.python.org/>`_.
ru: Для получения дополнительной информации о том, как разрабатывается Python, обратитесь к `Руководству разработчика Python <https://devguide.python.org/>`_.

source: Are there any published articles about Python that I can reference?
es_es: ¿Hay algún artículo publicado sobre Python que pueda consultar?
ru: Есть ли опубликованные статьи о Python, на которые я могу сослаться?

source: It's probably best to cite your favorite book about Python.
es_es: Sería probablemente mejor citar tu libro favorito sobre Python.
ru: Вероятно, лучше всего процитировать вашу любимую книгу о Python.

source: The `very first article <https://ir.cwi.nl/pub/18204>`_ about Python was written in 1991 and is now quite outdated.
ru: `Самая первая статья <https://ir.cwi.nl/pub/18204>`_ о Python была написана в 1991 году и сейчас сильно устарела.

source: Guido van Rossum and Jelke de Boer, "Interactively Testing Remote Servers Using the Python Programming Language", CWI Quarterly, Volume 4, Issue 4 (December 1991), Amsterdam, pp 283--303.
es_es: Guido van Rossum y Jelke de Boer, "Interactively Testing Remote Servers Using the Python Programming Language", CWI Quarterly, Volume 4, Issue 4 (December 1991), Amsterdam, pp 283--303.
ru: Гвидо ван Россум и Йелке де Бур, «Интерактивное тестирование удаленных серверов с использованием языка программирования Python», CWI Quarterly, Volume 4, Issue 4 (декабрь 1991 г.), Амстердам, стр. 283–303.

source: Are there any books on Python?
es_es: ¿Existen libros sobre Python?
ru: Есть ли какие-нибудь книги по Python?

source: Yes, there are many, and more are being published. See the python.org wiki at https://wiki.python.org/moin/PythonBooks for a list.
es_es: Sí, hay muchos, y se están publicando más. Consulta la wiki de python.org en https://wiki.python.org/moin/PythonBooks para ver una lista.
ru: Да, их много, и публикуются еще больше. Список см. в вики python.org по адресу https://wiki.python.org/moin/PythonBooks.

source: You can also search online bookstores for "Python" and filter out the Monty Python references; or perhaps search for "Python" and "language".
es_es: También puede buscar "Python" en las librerías en línea y filtrar las referencias a Monty Python; o quizá buscar "Python" y "lenguaje".
ru: Вы также можете выполнить поиск в книжных интернет-магазинах по запросу «Python» и отфильтровать ссылки на Monty Python; или, возможно, найдите «Python» и «язык».

source: Where in the world is www.python.org located?
es_es: ¿En qué parte del mundo se encuentra www.python.org?
ru: Где находится www.python.org?

source: The Python project's infrastructure is located all over the world and is managed by the Python Infrastructure Team. Details `here <https://infra.psf.io>`__.
ru: Инфраструктура проекта Python расположена по всему миру и управляется командой инфраструктуры Python. Подробности `здесь <https://infra.psf.io>`__.

source: Why is it called Python?
es_es: ¿Por qué se llama Python?
ru: Почему он называется Питон?

source: When he began implementing Python, Guido van Rossum was also reading the published scripts from `"Monty Python's Flying Circus" <https://en.wikipedia.org/wiki/Monty_Python>`__, a BBC comedy series from the 1970s. Van Rossum thought he needed a name that was short, unique, and slightly mysterious, so he decided to call the language Python.
es_es: Cuando comenzó a implementar Python, Guido van Rossum también estaba leyendo los guiones publicados de "Monty Python's Flying Circus" <https://en.wikipedia.org/wiki/Monty_Python>`__, una serie de comedia de la BBC de los años 1970. Van Rossum pensó que necesitaba un nombre corto, único y ligeramente misterioso, así que decidió llamar al lenguaje Python.
ru: Когда он начал внедрять Python, Гвидо ван Россум также читал опубликованные сценарии из «Летающий цирк Монти Пайтона» <https://en.wikipedia.org/wiki/Monty_Python>`__, комедийного сериала BBC 1970-х годов. Ван Россум подумал, что ему нужно короткое, уникальное и немного загадочное имя, поэтому он решил назвать язык Python.

source: Do I have to like "Monty Python's Flying Circus"?
es_es: ¿Tiene que gustarme "Monty Python's Flying Circus"?
ru: Должен ли мне нравиться «Летающий цирк Монти Пайтона»?

source: No, but it helps. :)
es_es: No, pero ayuda. :)
ru: Нет, но это помогает. :)

source: Python in the real world
es_es: Python en el mundo real
ru: Питон в реальном мире

source: How stable is Python?
es_es: ¿Es estable Python?
ru: Насколько стабилен Python?

source: Very stable. New, stable releases have been coming out roughly every 6 to 18 months since 1991, and this seems likely to continue. As of version 3.9, Python will have a new feature release every 12 months (:pep:`602`).
ru: Очень стабильный. Новые стабильные версии выходят примерно каждые 6–18 месяцев с 1991 года, и, похоже, так будет продолжаться. Начиная с версии 3.9, Python будет выпускать новую функцию каждые 12 месяцев (:pep:`602`).

source: The developers issue bugfix releases of older versions, so the stability of existing releases gradually improves. Bugfix releases, indicated by a third component of the version number (e.g. 3.5.3, 3.6.2), are managed for stability; only fixes for known problems are included in a bugfix release, and it's guaranteed that interfaces will remain the same throughout a series of bugfix releases.
ru: Разработчики выпускают исправления ошибок старых версий, поэтому стабильность существующих выпусков постепенно улучшается. Выпуски исправлений, обозначаемые третьим компонентом номера версии (например, 3.5.3, 3.6.2), контролируются в целях стабильности; в выпуск исправлений ошибок включены только исправления известных проблем, и гарантируется, что интерфейсы останутся неизменными на протяжении всей серии выпусков исправлений ошибок.

source: How many people are using Python?
es_es: ¿Cuánta gente utiliza Python?
ru: Сколько людей используют Python?

source: There are probably millions of users, though it's difficult to obtain an exact count.
es_es: Probablemente haya millones de usuarios, aunque es difícil obtener un recuento exacto.
ru: Вероятно, существуют миллионы пользователей, хотя точное число получить сложно.

source: Python is available for free download, so there are no sales figures, and it's available from many different sites and packaged with many Linux distributions, so download statistics don't tell the whole story either.
es_es: Python se puede descargar de forma libre, por lo que no hay cifras de ventas, y está disponible en muchos sitios diferentes y empaquetado con muchas distribuciones de Linux, por lo que las estadísticas de descargas tampoco cuentan toda la historia.
ru: Python доступен для бесплатной загрузки, поэтому данных о продажах нет, он доступен на многих разных сайтах и ​​входит в состав многих дистрибутивов Linux, поэтому статистика загрузок также не дает полной картины.

source: The comp.lang.python newsgroup is very active, but not all Python users post to the group or even read it.
es_es: El grupo de noticias comp.lang.python es muy activo, pero no todos los usuarios de Python publican en el grupo o incluso lo leen.
ru: Группа новостей comp.lang.python очень активна, но не все пользователи Python публикуют сообщения в группе или даже читают ее.

source: Have any significant projects been done in Python?
es_es: ¿Se ha realizado algún proyecto importante en Python?
ru: Были ли реализованы какие-либо важные проекты на Python?

source: See https://www.python.org/about/success for a list of projects that use Python. Consulting the proceedings for `past Python conferences <https://www.python.org/community/workshops/>`_ will reveal contributions from many different companies and organizations.
es_es: En https://www.python.org/about/success encontrará una lista de proyectos que utilizan Python. Si se consultan las actas de `pasadas conferencias sobre Python <https://www.python.org/community/workshops/>`_ se verán contribuciones de muchas empresas y organizaciones diferentes.
ru: См. https://www.python.org/about/success для получения списка проектов, использующих Python. Просмотр материалов «прошлых конференций Python <https://www.python.org/community/workshops/>» покажет вклад многих различных компаний и организаций.

source: High-profile Python projects include `the Mailman mailing list manager <https://www.list.org>`_ and `the Zope application server <https://www.zope.dev>`_. Several Linux distributions, most notably `Red Hat <https://www.redhat.com>`_, have written part or all of their installer and system administration software in Python. Companies that use Python internally include Google, Yahoo, and Lucasfilm Ltd.
ru: Среди наиболее известных проектов Python — `менеджер списков рассылки Mailman <https://www.list.org>`_ и `сервер приложений Zope <https://www.zope.dev>`_. Некоторые дистрибутивы Linux, в первую очередь Red Hat <https://www.redhat.com>`_, частично или полностью написали программы установки и системного администрирования на Python. В число компаний, использующих Python внутри себя, входят Google, Yahoo и Lucasfilm Ltd.

source: What new developments are expected for Python in the future?
es_es: ¿Qué novedades se esperan para Python en el futuro?
ru: Какие новые разработки ожидаются в Python в будущем?

source: See https://peps.python.org/ for the Python Enhancement Proposals (PEPs). PEPs are design documents describing a suggested new feature for Python, providing a concise technical specification and a rationale. Look for a PEP titled "Python X.Y Release Schedule", where X.Y is a version that hasn't been publicly released yet.
ru: См. https://peps.python.org/ для предложений по улучшению Python (PEP). PEP — это проектные документы, описывающие предлагаемую новую функцию Python, содержащие краткую техническую спецификацию и обоснование. Найдите PEP под названием «Расписание выпусков Python XY», где XY — это версия, которая еще не была публично выпущена.

source: New development is discussed on `the python-dev mailing list <https://mail.python.org/mailman3/lists/python-dev.python.org/>`_.
ru: Новая разработка обсуждается в `списке рассылки python-dev <https://mail.python.org/mailman3/lists/python-dev.python.org/>`_.

source: Is it reasonable to propose incompatible changes to Python?
es_es: ¿Es razonable proponer cambios incompatibles con Python?
ru: Разумно ли предлагать несовместимые изменения в Python?

source: In general, no. There are already millions of lines of Python code around the world, so any change in the language that invalidates more than a very small fraction of existing programs has to be frowned upon. Even if you can provide a conversion program, there's still the problem of updating all documentation; many books have been written about Python, and we don't want to invalidate them all at a single stroke.
es_es: En general, no. Ya hay millones de líneas de código Python en todo el mundo, así que cualquier cambio en el lenguaje que invalide más que una fracción muy pequeña de los programas existentes tiene que ser mal visto. Incluso si puedes proporcionar un programa de conversión, sigue existiendo el problema de actualizar toda la documentación; se han escrito muchos libros sobre Python, y no queremos invalidarlos todos de un plumazo.
ru: В общем, нет. Во всем мире уже существуют миллионы строк кода Python, поэтому любые изменения в языке, которые делают недействительными более чем небольшую часть существующих программ, должны осуждаться. Даже если вы можете предоставить программу преобразования, все равно остается проблема обновления всей документации; О Python написано много книг, и мы не хотим обесценивать их все одним махом.

source: Providing a gradual upgrade path is necessary if a feature has to be changed. :pep:`5` describes the procedure followed for introducing backward-incompatible changes while minimizing disruption for users.
es_es: Proporcionar un camino de actualización gradual es necesario si se tiene que cambiar una característica. :pep:`5` describe el procedimiento seguido para introducir cambios incompatibles con versiones anteriores minimizando la interrupción para los usuarios.
ru: Если необходимо изменить функцию, необходимо обеспечить поэтапное обновление. :pep:`5` описывает процедуру внесения обратно несовместимых изменений при минимизации неудобств для пользователей.

source: Is Python a good language for beginning programmers?
es_es: ¿Es Python un buen lenguaje para programadores principiantes?
ru: Является ли Python хорошим языком для начинающих программистов?

source: Yes.
es_es: Sí.
ru: Да.

source: It is still common to start students with a procedural and statically typed language such as Pascal, C, or a subset of C++ or Java. Students may be better served by learning Python as their first language. Python has a very simple and consistent syntax and a large standard library and, most importantly, using Python in a beginning programming course lets students concentrate on important programming skills such as problem decomposition and data type design. With Python, students can be quickly introduced to basic concepts such as loops and procedures. They can probably even work with user-defined objects in their very first course.
es_es: Sigue siendo habitual iniciar a los estudiantes con un lenguaje procedimental y de tipado estático, como Pascal, C o un subconjunto de C++ o Java. A los estudiantes les vendría mejor aprender Python como primer lenguaje. Python tiene una sintaxis muy simple y consistente y una gran biblioteca estándar y, lo que es más importante, el uso de Python en un curso de programación inicial permite a los estudiantes concentrarse en importantes habilidades de programación como la descomposición de problemas y el diseño de tipos de datos. Con Python, los alumnos pueden introducirse rápidamente en conceptos básicos como bucles y procedimientos. Probablemente incluso puedan trabajar con objetos definidos por el usuario en su primer curso.
ru: По-прежнему принято начинать обучение студентов с процедурного и статически типизированного языка, такого как Pascal, C или подмножества C++ или Java. Студентам будет лучше, если они будут изучать Python в качестве своего родного языка. Python имеет очень простой и последовательный синтаксис и большую стандартную библиотеку, и, что наиболее важно, использование Python в начальном курсе программирования позволяет студентам сконцентрироваться на важных навыках программирования, таких как декомпозиция задач и проектирование типов данных. С помощью Python учащиеся могут быстро познакомиться с базовыми понятиями, такими как циклы и процедуры. Вероятно, они смогут даже работать с объектами, определяемыми пользователем, на самом первом курсе.

source: For a student who has never programmed before, using a statically typed language seems unnatural. It presents additional complexity that the student must master and slows the pace of the course. The students are trying to learn to think like a computer, decompose problems, design consistent interfaces, and encapsulate data. While learning to use a statically typed language is important in the long term, it is not necessarily the best topic to address in the students' first programming course.
es_es: Para un estudiante que nunca ha programado antes, usar un lenguaje de tipado estático parece antinatural. Presenta una complejidad adicional que el estudiante debe dominar y ralentiza el ritmo del curso. Los estudiantes están tratando de aprender a pensar como una computadora, descomponer problemas, diseñar interfaces consistentes y encapsular datos. Aunque aprender a usar un lenguaje de tipado estático es importante a largo plazo, no es necesariamente el mejor tema para abordar en el primer curso de programación de los estudiantes.
ru: Для студента, который никогда раньше не программировал, использование статически типизированного языка кажется неестественным. Это представляет собой дополнительную сложность, которую студент должен освоить, и замедляет темп курса. Студенты пытаются научиться думать как компьютер, разлагать проблемы, проектировать согласованные интерфейсы и инкапсулировать данные. Хотя обучение использованию статически типизированного языка важно в долгосрочной перспективе, это не обязательно лучшая тема для изучения на первом курсе программирования для студентов.
