Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/faq/general.po
Languages: es_es, ru

source: General Python FAQ
es_es: FAQ general de Python
ru: Общие ЧаВО по Python

source: Contents
es_es: Contenido
ru: Содержание

source: General Information
es_es: Información general
ru: Общая информация

source: What is Python?
es_es: ¿Qué es Python?
ru: Что такое Python?

source: Python is an interpreted, interactive, object-oriented programming language. It incorporates modules, exceptions, dynamic typing, very high level dynamic data types, and classes. It supports multiple programming paradigms beyond object-oriented programming, such as procedural and functional programming. Python combines remarkable power with very clear syntax. It has interfaces to many system calls and libraries, as well as to various window systems, and is extensible in C or C++. It is also usable as an extension language for applications that need a programmable interface. Finally, Python is portable: it runs on many Unix variants including Linux and macOS, and on Windows.
es_es: Python es un lenguaje de programación interprete, interactivo y orientado a objetos. Incorpora módulos, excepciones, escritura dinámica, tipos de datos dinámicos de alto nivel y clases. Admite múltiples paradigmas de programación más allá de la programación orientada a objetos, como la programación procedural y funcional. Python combina un poder notable con una sintaxis muy clara. Tiene interfaces para muchas llamadas al sistema y bibliotecas, así como para varios sistemas de ventanas, y es extensible en C o C++. También se puede utilizar como lenguaje de extensión para aplicaciones que necesitan una interfaz programable. Por último, Python es portáblel: se ejecuta en muchas variantes de Unix, incluyendo Linux y macOS, y en Windows.
ru: Python — интерпретируемый, интерактивный, объектно-ориентированный язык программирования. Он включает в себя модули, исключения, динамическую типизацию, высокоуровневые динамичные типы данных и классы. Python поддерживает не только объектно-ориентированное программирование, но и другие парадигмы, например, функциональное и процедурное программирование. Он совмещает в себе выразительность и лёгкий для восприятия синтаксис. Python может взаимодействовать с многими системными вызовами и библиотеками, в том числе с графическими оболочками, и его можно расширить с помощью C или C++. Его можно использовать как язык расширений для приложений, которым нужен программируемый интерфейс. И наконец, переносимый: он поддерживает Unix-подобные системы, включая Linux и macOS, и Windows.

source: To find out more, start with :ref:`tutorial-index`. The `Beginner's Guide to Python <https://wiki.python.org/moin/BeginnersGuide>`_ links to other introductory tutorials and resources for learning Python.
es_es: Para saber más, comienza con :ref:`tutorial-index`. La `Guía para principiantes de Python <https://wiki.python.org/moin/BeginnersGuide>`_ enlaza con otros tutoriales introductorios y recursos para aprender Python.
ru: Чтобы узнать больше, начните со страницы :ref:`tutorial-index`. `Beginner's Guide to Python <https://wiki.python.org/moin/BeginnersGuide>` содержит ссылки на друие англоязычный руководства и ресурсы для изучения Python'а.

source: What is the Python Software Foundation?
es_es: ¿Qué es la Fundación de Software Python?
ru: Что такое Фонд программного обеспечения Python?

source: The Python Software Foundation is an independent non-profit organization that holds the copyright on Python versions 2.1 and newer. The PSF's mission is to advance open source technology related to the Python programming language and to publicize the use of Python. The PSF's home page is at https://www.python.org/psf/.
es_es: La Python Software Foundation es una organización independiente sin ánimo de lucro que posee los derechos de autor de las versiones de Python 2.1 y posteriores. La misión de la PSF es promover la tecnología de código abierto relacionada con el lenguaje de programación Python y dar a conocer el uso de Python. La página principal de la PSF se encuentra en https://www.python.org/psf/.
ru: Python Software Foundation — независимая некоммерческая организация, владеющая авторскими правами на Python версии 2.1 и новее. Миссия PSF — продвигать технологию с открытым исходным кодом, связанную с языком программирования Python, и пропагандировать использование Python. Домашняя страница PSF находится по адресу https://www.python.org/psf/.

source: Donations to the PSF are tax-exempt in the US. If you use Python and find it helpful, please contribute via `the PSF donation page <https://www.python.org/psf/donations/>`_.
es_es: Las donaciones a la PSF están exentas de impuestos en los Estados Unidos. Si utilizas Python y lo encuentras útil, por favor contribuye a través de la página de donaciones de la PSF: <https://www.python.org/psf/donations/>`_.
ru: Пожертвования в PSF не облагаются налогом в США. Если вы используете Python и считаете его полезным, внесите свой вклад через `страницу пожертвований PSF <https://www.python.org/psf/donations/>`_.

source: Are there copyright restrictions on the use of Python?
es_es: ¿Existen restricciones de copyright en el uso de Python?
ru: Существуют ли ограничения авторских прав на использование Python?

source: You can do anything you want with the source, as long as you leave the copyrights in and display those copyrights in any documentation about Python that you produce. If you honor the copyright rules, it's OK to use Python for commercial use, to sell copies of Python in source or binary form (modified or unmodified), or to sell products that incorporate Python in some form. We would still like to know about all commercial use of Python, of course.
es_es: Puedes hacer cualquier cosa que quieras con el código fuente, siempre y cuando dejes los derechos de autor y muestres esos derechos de autor en cualquier documentación sobre Python que produzcas. Si respetas las reglas de derechos de autor, está permitido utilizar Python con fines comerciales, vender copias de Python en forma de código fuente o binario (modificado o sin modificar), o vender productos que incorporen Python de alguna forma. Por supuesto, nos gustaría saber sobre cualquier uso comercial de Python.
ru: Вы можете делать с исходным кодом все, что захотите, при условии, что вы сохраняете авторские права и отображаете эти авторские права в любой документации о Python, которую вы создаете. Если вы соблюдаете правила авторского права, можно использовать Python для коммерческого использования, продавать копии Python в исходной или двоичной форме (модифицированной или немодифицированной) или продавать продукты, включающие Python в той или иной форме. Конечно, нам все равно хотелось бы знать обо всех случаях коммерческого использования Python.

source: See `the license page <https://docs.python.org/3/license.html>`_ to find further explanations and the full text of the PSF License.
ru: См. `страницу лицензии <https://docs.python.org/3/license.html>`_, чтобы найти дополнительные пояснения и полный текст лицензии PSF.

source: The Python logo is trademarked, and in certain cases permission is required to use it. Consult `the Trademark Usage Policy <https://www.python.org/psf/trademarks/>`__ for more information.
es_es: El logotipo de Python está registrado como marca comercial y en ciertos casos se requiere permiso para usarlo. Consulta la Trademark Usage Policy en <https://www.python.org/psf/trademarks/>`__` para más información.
ru: Логотип Python является товарным знаком, и в некоторых случаях для его использования требуется разрешение. Дополнительную информацию см. в «Политике использования товарных знаков <https://www.python.org/psf/trademarks/>».

source: Why was Python created in the first place?
es_es: ¿Por qué se creó Python en primer lugar?
ru: Почему Python был создан вообще?

source: Here's a *very* brief summary of what started it all, written by Guido van Rossum:
es_es: Aquí tienes un resumen *muy* breve de cómo comenzó todo, escrito por Guido van Rossum.
ru: Вот *очень* краткое изложение того, с чего все началось, написанное Гвидо ван Россумом:

source: I had extensive experience with implementing an interpreted language in the ABC group at CWI, and from working with this group I had learned a lot about language design. This is the origin of many Python features, including the use of indentation for statement grouping and the inclusion of very-high-level data types (although the details are all different in Python).
es_es: Tuve una amplia experiencia en la implementación de un lenguaje interpretado en el grupo ABC en CWI, y al trabajar con este grupo aprendí mucho sobre el diseño de lenguajes. Este es el origen de muchas características de Python, incluido el uso de la indentación para agrupar declaraciones y la inclusión de tipos de datos de muy alto nivel (aunque los detalles son diferentes en Python).
ru: У меня был обширный опыт внедрения интерпретируемого языка в группе ABC в CWI, и, работая с этой группой, я многому научился в области языкового проектирования. Это источник многих функций Python, включая использование отступов для группировки операторов и включение типов данных очень высокого уровня (хотя в Python все детали разные).

source: I had a number of gripes about the ABC language, but also liked many of its features. It was impossible to extend the ABC language (or its implementation) to remedy my complaints -- in fact its lack of extensibility was one of its biggest problems. I had some experience with using Modula-2+ and talked with the designers of Modula-3 and read the Modula-3 report. Modula-3 is the origin of the syntax and semantics used for exceptions, and some other Python features.
es_es: Tuve varias quejas sobre el lenguaje ABC, pero también me gustaron muchas de sus características. Era imposible extender el lenguaje ABC (o su implementación) para solucionar mis quejas, de hecho, su falta de extensibilidad era uno de sus mayores problemas. Tenía algo de experiencia usando Modula-2+ y hablé con los diseñadores de Modula-3 y leí el informe de Modula-3. Modula-3 es el origen de la sintaxis y semántica utilizada para las excepciones, y algunas otras características de Python.
ru: У меня было несколько претензий к языку ABC, но мне понравились и многие его особенности. Невозможно было расширить язык ABC (или его реализацию), чтобы исправить мои жалобы — на самом деле отсутствие расширяемости было одной из самых больших проблем. У меня был некоторый опыт использования Модулы-2+, я разговаривал с разработчиками Модулы-3 и читал отчет о Модуле-3. Modula-3 является источником синтаксиса и семантики, используемых для исключений, а также некоторых других функций Python.

source: I was working in the Amoeba distributed operating system group at CWI. We needed a better way to do system administration than by writing either C programs or Bourne shell scripts, since Amoeba had its own system call interface which wasn't easily accessible from the Bourne shell. My experience with error handling in Amoeba made me acutely aware of the importance of exceptions as a programming language feature.
es_es: Trabajaba en el grupo de sistemas operativos distribuidos Amoeba en CWI. Necesitábamos una forma mejor de administrar el sistema que escribir programas en C o scripts de Bourne shell, ya que Amoeba tenía su propia interfaz de llamadas al sistema que no era fácilmente accesible desde Bourne shell. Mi experiencia con el manejo de errores en Amoeba me hizo consciente de la importancia de las excepciones como característica de lenguaje de programación.
ru: Я работал в группе распределенных операционных систем Amoeba в CWI. Нам нужен был лучший способ администрирования системы, чем написание программ на C или сценариев оболочки Bourne, поскольку у Amoeba был собственный интерфейс системных вызовов, к которому было нелегко получить доступ из оболочки Bourne. Мой опыт обработки ошибок в Amoeba позволил мне остро осознать важность исключений как функции языка программирования.

source: It occurred to me that a scripting language with a syntax like ABC but with access to the Amoeba system calls would fill the need. I realized that it would be foolish to write an Amoeba-specific language, so I decided that I needed a language that was generally extensible.
es_es: Ocurrió a mí que un lenguaje de script con una sintaxis como ABC pero con acceso a las llamadas del sistema Amoeba llenaría la necesidad. Me di cuenta de que sería tonto escribir un lenguaje específico de Amoeba, así que decidí que necesitaba un lenguaje que fuera generalmente extensible.
ru: Мне пришло в голову, что язык сценариев с синтаксисом типа ABC, но с доступом к системным вызовам Amoeba, удовлетворит эту потребность. Я понял, что было бы глупо писать язык, специфичный для Amoeba, поэтому решил, что мне нужен язык, который в целом был бы расширяемым.

source: During the 1989 Christmas holidays, I had a lot of time on my hand, so I decided to give it a try. During the next year, while still mostly working on it in my own time, Python was used in the Amoeba project with increasing success, and the feedback from colleagues made me add many early improvements.
es_es: Durante las vacaciones de Navidad de 1989, tenía mucho tiempo libre, así que decidí intentarlo. Durante el año siguiente, mientras seguía trabajando principalmente en ello en mi tiempo libre, Python se utilizó en el proyecto Amoeba con cada vez más éxito, y los comentarios de mis colegas me hicieron añadir muchas mejoras tempranas.
ru: Во время рождественских каникул 1989 года у меня было много свободного времени, поэтому я решил попробовать. В течение следующего года, хотя я все еще в основном работал над этим в свое время, Python использовался в проекте Amoeba с все большим успехом, а отзывы коллег заставили меня добавить множество ранних улучшений.

source: In February 1991, after just over a year of development, I decided to post to USENET. The rest is in the ``Misc/HISTORY`` file.
es_es: En febrero de 1991, tras algo más de un año de desarrollo, decidí publicar en USENET. El resto está en el archivo ``Misc/HISTORY``.
ru: В феврале 1991 года, спустя чуть больше года разработки, я решил опубликовать сообщение в USENET. Остальное находится в файле «Misc/HISTORY».

source: What is Python good for?
es_es: ¿Para qué sirve Python?
ru: Чем хорош Python?

source: Python is a high-level general-purpose programming language that can be applied to many different classes of problems.
es_es: Python es un lenguaje de programación de propósito general de alto nivel que se puede aplicar a muchas clases diferentes de problemas.
ru: Python — это язык программирования общего назначения высокого уровня, который можно применять для решения множества различных классов задач.

source: The language comes with a large standard library that covers areas such as string processing (regular expressions, Unicode, calculating differences between files), internet protocols (HTTP, FTP, SMTP, XML-RPC, POP, IMAP), software engineering (unit testing, logging, profiling, parsing Python code), and operating system interfaces (system calls, filesystems, TCP/IP sockets). Look at the table of contents for :ref:`library-index` to get an idea of what's available. A wide variety of third-party extensions are also available. Consult `the Python Package Index <https://pypi.org>`_ to find packages of interest to you.
ru: Язык поставляется с большой стандартной библиотекой, которая охватывает такие области, как обработка строк (регулярные выражения, Unicode, вычисление различий между файлами), интернет-протоколы (HTTP, FTP, SMTP, XML-RPC, POP, IMAP), разработка программного обеспечения (модульное тестирование). ведение журнала, профилирование, анализ кода Python) и интерфейсы операционной системы (системные вызовы, файловые системы, сокеты TCP/IP). Посмотрите оглавление :ref:`library-index`, чтобы получить представление о том, что доступно. Также доступен широкий выбор сторонних расширений. Обратитесь к «Индексу пакетов Python <https://pypi.org>», чтобы найти интересующие вас пакеты.

source: How does the Python version numbering scheme work?
es_es: ¿Cómo funciona el sistema de numeración de versiones de Python?
ru: Как работает схема нумерации версий Python?

source: Python versions are numbered "A.B.C" or "A.B":
ru: Версии Python имеют номера «ABC» или «AB»:

source: *A* is the major version number -- it is only incremented for really major changes in the language.
ru: *A* — это основной номер версии. Он увеличивается только при действительно серьезных изменениях в языке.

source: *B* is the minor version number -- it is incremented for less earth-shattering changes.
ru: *B* — это младший номер версии. Он увеличивается для менее серьезных изменений.

source: *C* is the micro version number -- it is incremented for each bugfix release.
ru: *C* — это номер микроверсии, который увеличивается с каждым выпуском исправления ошибок.

source: Not all releases are bugfix releases. In the run-up to a new feature release, a series of development releases are made, denoted as alpha, beta, or release candidate. Alphas are early releases in which interfaces aren't yet finalized; it's not unexpected to see an interface change between two alpha releases. Betas are more stable, preserving existing interfaces but possibly adding new modules, and release candidates are frozen, making no changes except as needed to fix critical bugs.
ru: Не все выпуски являются выпусками с исправлениями ошибок. В преддверии выпуска новой функции создается серия разрабатываемых выпусков, обозначаемых как альфа, бета или кандидат на выпуск. Альфа-версии — это ранние выпуски, интерфейсы которых еще не доработаны; нет ничего неожиданного в том, что интерфейс изменился между двумя альфа-версиями. Бета-версии более стабильны: в них сохраняются существующие интерфейсы, но возможно добавление новых модулей, а кандидаты на выпуск замораживаются, не внося никаких изменений, кроме тех, которые необходимы для исправления критических ошибок.

source: Alpha, beta and release candidate versions have an additional suffix:
ru: Альфа-, бета-версии и версии-кандидаты имеют дополнительный суффикс:

source: The suffix for an alpha version is "aN" for some small number *N*.
ru: Суффикс альфа-версии — «aN» для небольшого числа *N*.

source: The suffix for a beta version is "bN" for some small number *N*.
ru: Суффикс бета-версии — «bN» для небольшого числа *N*.

source: The suffix for a release candidate version is "rcN" for some small number *N*.
ru: Суффикс версии-кандидата — «rcN» для небольшого числа *N*.

source: In other words, all versions labeled *2.0aN* precede the versions labeled *2.0bN*, which precede versions labeled *2.0rcN*, and *those* precede 2.0.
ru: Другими словами, все версии с меткой *2.0aN* предшествуют версиям с меткой *2.0bN*, которые предшествуют версиям с меткой *2.0rcN*, а *эти* предшествуют версии 2.0.

source: You may also find version numbers with a "+" suffix, e.g. "2.2+". These are unreleased versions, built directly from the CPython development repository. In practice, after a final minor release is made, the version is incremented to the next minor version, which becomes the "a0" version, e.g. "2.4a0".
es_es: También puedes encontrar números de versión con un sufijo "+", por ejemplo, "2.2+". Estas son versiones no lanzadas, construidas directamente desde el repositorio de desarrollo de CPython. En la práctica, después de que se realiza un lanzamiento menor final, la versión se incrementa a la siguiente versión menor, que se convierte en la versión "a0", por ejemplo, "2.4a0".
ru: Вы также можете найти номера версий с суффиксом «+», например «2.2+». Это невыпущенные версии, созданные непосредственно из репозитория разработки CPython. На практике после выпуска последней второстепенной версии версия увеличивается до следующей второстепенной версии, которая становится версией «a0», например «2.4a0».

source: See the `Developer's Guide <https://devguide.python.org/developer-workflow/development-cycle/>`__ for more information about the development cycle, and :pep:`387` to learn more about Python's backward compatibility policy. See also the documentation for :data:`sys.version`, :data:`sys.hexversion`, and :data:`sys.version_info`.
ru: Дополнительную информацию о цикле разработки см. в `Руководстве разработчика <https://devguide.python.org/developer-workflow/development-cycle/>`__ и в :pep:`387`, чтобы узнать больше о политике обратной совместимости Python. . См. также документацию по :data:`sys.version`, :data:`sys.hexversion` и :data:`sys.version_info`.

source: How do I obtain a copy of the Python source?
es_es: ¿Cómo puedo obtener una copia del código fuente de Python?
ru: Как получить копию исходного кода Python?

source: The latest Python source distribution is always available from python.org, at https://www.python.org/downloads/. The latest development sources can be obtained at https://github.com/python/cpython/.
es_es: La última distribución del código fuente de Python está siempre disponible en python.org, en https://www.python.org/downloads/. Las fuentes de desarrollo más recientes pueden obtenerse en https://github.com/python/cpython/.
ru: Последний дистрибутив исходного кода Python всегда доступен на сайте python.org по адресу https://www.python.org/downloads/. Последние исходные коды разработки можно получить по адресу https://github.com/python/cpython/.

source: The source distribution is a gzipped tar file containing the complete C source, Sphinx-formatted documentation, Python library modules, example programs, and several useful pieces of freely distributable software. The source will compile and run out of the box on most UNIX platforms.
es_es: La distribución del código fuente es un archivo tar comprimido con gzip que contiene el código fuente completo en C, documentación en formato Sphinx, módulos de biblioteca Python, programas de ejemplo y varias piezas útiles de software de libre distribución. El código fuente se compila y se ejecuta en la mayoría de las plataformas UNIX.
ru: Дистрибутив исходного кода представляет собой сжатый в формате gzip файл tar, содержащий полный исходный код C, документацию в формате Sphinx, библиотечные модули Python, примеры программ и несколько полезных частей свободно распространяемого программного обеспечения. Исходный код скомпилируется и запустится «из коробки» на большинстве платформ UNIX.

source: Consult the `Getting Started section of the Python Developer's Guide <https://devguide.python.org/setup/>`__ for more information on getting the source code and compiling it.
es_es: Consulte la sección `Cómo empezar` de la Guía del desarrollador de Python <https://devguide.python.org/setup/>`__ para más información sobre cómo obtener el código fuente y compilarlo.
ru: Обратитесь к разделу «Начало работы» Руководства разработчика Python <https://devguide.python.org/setup/>`__ для получения дополнительной информации о получении исходного кода и его компиляции.

source: How do I get documentation on Python?
es_es: ¿Cómo puedo obtener documentación sobre Python?
ru: Как мне получить документацию по Python?

source: The standard documentation for the current stable version of Python is available at https://docs.python.org/3/. PDF, plain text, and downloadable HTML versions are also available at https://docs.python.org/3/download.html.
es_es: La documentación estándar de la versión estable actual de Python está disponible en https://docs.python.org/3/. Las versiones en PDF, texto sin formato y HTML descargable también están disponibles en https://docs.python.org/3/download.html.
ru: Стандартная документация для текущей стабильной версии Python доступна по адресу https://docs.python.org/3/. Версии в формате PDF, обычный текст и загружаемые HTML-версии также доступны по адресу https://docs.python.org/3/download.html.
