Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/faq/gui.po
Languages: es_es, ru

source: Graphic User Interface FAQ
es_es: Interfaz gráfica de usuario FAQ
ru: ЧаВо по графическому интерфейсу пользователя

source: Contents
es_es: Contenido
ru: Содержание

source: General GUI Questions
es_es: Preguntas Generales de la GUI
ru: Общие вопросы по GUI

source: What GUI toolkits exist for Python?
es_es: ¿Qué kits de herramientas de interfaz gráfica de usuario existen para Python?
ru: Какие GUI инструменты существуют для Python?

source: Standard builds of Python include an object-oriented interface to the Tcl/Tk widget set, called :ref:`tkinter <Tkinter>`. This is probably the easiest to install (since it comes included with most `binary distributions <https://www.python.org/downloads/>`_ of Python) and use. For more info about Tk, including pointers to the source, see the `Tcl/Tk home page <https://www.tcl.tk>`_. Tcl/Tk is fully portable to the macOS, Windows, and Unix platforms.
es_es: Las versiones estándar de Python incluyen una interfaz orientada a objetos para el conjunto de widgets Tcl/Tk, llamada :ref:`tkinter <Tkinter>`. Esta es probablemente la más fácil de instalar (ya que viene incluida con la mayoría de las distribuciones binarias <https://www.python.org/downloads/>`_ of Python) y de usar. Para más información sobre Tk, incluyendo referencias al código fuente, consulte la página principal de `Tcl/Tk <https://www.tcl.tk>`_. Tcl/Tk es totalmente portable a las plataformas macOS, Windows y Unix.
ru: Стандартные сборки Python включают объектно-ориентированный интерфейс для набора виджетов Tcl/Tk, который называется :ref:`tkinter <Tkinter>`. Это, вероятно, самый простой в установке (поскольку он входит в состав большинства `бинарных дистрибутивов <https://www.python.org/downloads/>`_ Python) и использовании. Дополнительную информацию о Tk, включая ссылки на исходный код, смотрите на `домашней странице Tcl/Tk <https://www.tcl.tk>`_. Tcl/Tk полностью переносим на платформы macOS, Windows и Unix.

source: Depending on what platform(s) you are aiming at, there are also several alternatives. A `list of cross-platform <https://wiki.python.org/moin/GuiProgramming#Cross-Platform_Frameworks>`_ and `platform-specific <https://wiki.python.org/moin/GuiProgramming#Platform-specific_Frameworks>`_ GUI frameworks can be found on the python wiki.
es_es: Dependiendo de la(s) plataforma-s a la-s que te dirijas, también existen varias alternativas. En la wiki de python se puede encontrar una `lista de frameworks GUI multiplataforma <https://wiki.python.org/moin/GuiProgramming#Cross-Platform_Frameworks>`_ y `platform-specific <https://wiki.python.org/moin/GuiProgramming#Platform-specific_Frameworks>`_
ru: В зависимости от того, на какую платформу (платформы) вы ориентируетесь, есть также несколько альтернатив. `Список кросс-платформенных<https://wiki.python.org/moin/GuiProgramming#Cross-Platform_Frameworks>`_ и `платформо-зависимых <https://wiki.python.org/moin/GuiProgramming#Platform-specific_Frameworks>`_ фреймворков с графическим интерфейсом можно найти на python wiki.

source: Tkinter questions
es_es: Preguntas sobre Tkinter
ru: Вопросы по Tkinter

source: How do I freeze Tkinter applications?
es_es: ¿Cómo congelo aplicaciones Tkinter?
ru: Как мне заморозить приложения Tkinter?

source: Freeze is a tool to create stand-alone applications. When freezing Tkinter applications, the applications will not be truly stand-alone, as the application will still need the Tcl and Tk libraries.
es_es: Freeze es una herramienta para crear aplicaciones independientes. Al congelar aplicaciones Tkinter, las aplicaciones no serán realmente independientes, ya que la aplicación seguirá necesitando las bibliotecas Tcl y Tk.
ru: Freeze - это инструмент для создания автономных приложений. При замораживании приложений Tkinter они не будут по-настоящему автономными, поскольку приложению по-прежнему будут нужны библиотеки Tcl и Tk.

source: One solution is to ship the application with the Tcl and Tk libraries, and point to them at run-time using the :envvar:`!TCL_LIBRARY` and :envvar:`!TK_LIBRARY` environment variables.
ru: Одним из решений является поставка приложения с библиотеками Tcl и Tk и указание на них во время выполнения с помощью переменных окружения :envvar:`!TCL_LIBRARY` и :envvar:`!TK_LIBRARY`.

source: Various third-party freeze libraries such as py2exe and cx_Freeze have handling for Tkinter applications built-in.
ru: Различные сторонние библиотеки заморозки, такие как py2exe и cx_Freeze, имеют встроенную обработку приложений Tkinter.

source: Can I have Tk events handled while waiting for I/O?
es_es: ¿Puedo efectuar acciones Tk mientras espero E/S?
ru: Могу ли я обрабатывать события Tk во время ожидания ввода-вывода?

source: On platforms other than Windows, yes, and you don't even need threads! But you'll have to restructure your I/O code a bit. Tk has the equivalent of Xt's :c:func:`!XtAddInput` call, which allows you to register a callback function which will be called from the Tk mainloop when I/O is possible on a file descriptor. See :ref:`tkinter-file-handlers`.
ru: На платформах, отличных от Windows, да, и вам даже не нужны потоки! Но вам придется немного перестроить свой код ввода-вывода. Tk имеет эквивалент вызова Xt :c:func:`!XtAddInput`, который позволяет вам зарегистрировать функцию обратного вызова, которая будет вызываться из основного цикла Tk, когда возможен ввод-вывод по файловому дескриптору. Смотрите :ref:`tkinter-file-handlers`.

source: I can't get key bindings to work in Tkinter: why?
es_es: No consigo que las combinaciones de teclas funcionen en Tkinter: ¿por qué?
ru: Я не могу заставить привязки клавиш работать в Tkinter: почему?

source: An often-heard complaint is that event handlers :ref:`bound <bindings-and-events>` to events with the :meth:`!bind` method don't get handled even when the appropriate key is pressed.
ru: Часто можно услышать жалобу на то, что обработчики событий :ref:`bound <bindings-and-events>` привязанные с помощью метода :meth:`!bind` не обрабатываются даже при нажатии соответствующей клавиши.

source: The most common cause is that the widget to which the binding applies doesn't have "keyboard focus". Check out the Tk documentation for the focus command. Usually a widget is given the keyboard focus by clicking in it (but not for labels; see the takefocus option).
es_es: La causa más común es que el widget al que se aplica la vinculación no tiene "foco de teclado". Consulta la documentación de Tk para el comando de foco. Normalmente, a un widget se le da el foco de teclado al hacer clic en él (pero no para las etiquetas; consulta la opción takefocus).
ru: Наиболее распространенная причина заключается в том, что виджет, к которому применяется привязка, не имеет "фокуса клавиатуры". Ознакомьтесь с документацией по команде focus в технической документации. Обычно виджету задается фокус клавиатуры путем щелчка по нему (но не для меток; см. параметр takefocus).
