Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/faq/installed.po
Languages: ar, ru

source: "Why is Python Installed on my Computer?" FAQ
ar: "لماذا بايثون مثبَّتة على جهاز الحاسب الخاص بي؟" الأسئلة الشائعة
ru: "Почему на моем компьютере установлен Python?" ЧаВо

source: What is Python?
ar: ما هي بايثون؟
ru: Что такое Python?

source: Python is a programming language. It's used for many different applications. It's used in some high schools and colleges as an introductory programming language because Python is easy to learn, but it's also used by professional software developers at places such as Google, NASA, and Lucasfilm Ltd.
ar: بايثون هي لغة برمجة. يتم استخدامها للعديد من التطبيقات المختلفة. يتم استخدامها في بعض المدارس الثانوية والكليات كلغة برمجة تمهيدية لأن لغة بايثون سهلة التعلم، ولكنها تستخدم أيضًا من قِبل مطوري البرامج المحترفين في أماكن مثل Google و NASA و Lucasfilm Ltd.
ru: Python - это язык программирования. Он используется во многих различных приложениях. Также используется в некоторых средних школах и колледжах в качестве вводного языка программирования, поскольку Python прост в изучении, но в то же время используется профессиональными разработчиками программного обеспечения в таких компаниях, как Google, NASA и Lucasfilm Ltd.

source: If you wish to learn more about Python, start with the `Beginner's Guide to Python <https://wiki.python.org/moin/BeginnersGuide>`_.
ar: إذا كنت ترغب في معرفة المزيد عن بايثون، فابدأ بـ`دليل بايثون للمبتدئين <https://wiki.python.org/moin/BeginnersGuide>`_.
ru: Если вы хотите узнать больше о Python, начните с `Руководства для начинающих по Python <https://wiki.python.org/moin/BeginnersGuide>`_.

source: Why is Python installed on my machine?
ar: لماذا بايثون مثبَّتة على جهازي؟
ru: Почему Python установлен на моем компьютере?

source: If you find Python installed on your system but don't remember installing it, there are several possible ways it could have gotten there.
ar: إذا وجدت بايثون مثبتًا على نظامك ولكنك لا تتذكر تثبيته، هناك العديد من الاحتمالات الممكنة لكيفية وصوله إلى النظام.
ru: Если вы обнаружили, что в вашей системе установлен Python, но не помните, как его устанавливали, есть несколько возможных способов, которыми он мог туда попасть.

source: Perhaps another user on the computer wanted to learn programming and installed it; you'll have to figure out who's been using the machine and might have installed it.
ar: ربما أراد مستخدم آخر للحاسوب تعلم البرمجة وثبتها؛ سيتعين عليك معرفة من كان يستخدم الجهاز ربما يكون قد ثبَّتها.
ru: Возможно, другой пользователь компьютера захотел научиться программированию и установил его; вам нужно будет выяснить, кто пользовался этим компьютером и, возможно, установил его.

source: A third-party application installed on the machine might have been written in Python and included a Python installation. There are many such applications, from GUI programs to network servers and administrative scripts.
ar: ربما تمت كتابة تطبيق طرف ثالث مثبت على الجهاز بلغة بايثون وشمل تثبيت بايثون معه. هناك العديد من هذه التطبيقات، من برامج واجهة المستخدم الرسومية إلى خوادم الشبكة والبرامج النصية الإدارية.
ru: Возможно, на компьютере было установлено стороннее приложение, написанное на Python и включающее в себя установку на Python. Таких приложений существует множество, от программ с графическим интерфейсом пользователя до сетевых серверов и административных скриптов.

source: Some Windows machines also have Python installed. At this writing we're aware of computers from Hewlett-Packard and Compaq that include Python. Apparently some of HP/Compaq's administrative tools are written in Python.
ar: أيضًا تحتوي بعض أجهزة ويندوز على بايثون مثبتة. حتى كتابة هذه السطور، نحن على دراية بأن أجهزة الحاسب من Hewlett-Packard و Compaq تتضمن بايثون. يبدو أن بعض أدوات HP/Compaq الإدارية مكتوبة بلغة بايثون أيضًا.
ru: На некоторых компьютерах с Windows также установлен Python. На момент написания этой статьи нам было известно о компьютерах от Hewlett-Packard и Compaq, которые используют Python. Очевидно, что некоторые инструменты администрирования HP/Compaq написаны на Python.

source: Many Unix-compatible operating systems, such as macOS and some Linux distributions, have Python installed by default; it's included in the base installation.
ru: Во многих Unix-совместимых операционных системах, таких как macOS и некоторые дистрибутивы Linux, по умолчанию установлен Python; он включен в базовую установку.

source: Can I delete Python?
ar: هل يمكنني حذف بايثون؟
ru: Могу ли я удалить Python?

source: That depends on where Python came from.
ar: هذا يعتمد على مصدر بايثون.
ru: Это зависит от того, откуда взялся Python.

source: If someone installed it deliberately, you can remove it without hurting anything. On Windows, use the Add/Remove Programs icon in the Control Panel.
ar: إذا تنبتها شخص عن عمد، فيمكنك إزالتها دون الإضرار بأي شيء. في نظام التشغيل ويندوز، استخدم علامة إضافة/إزالة البرامج في لوحة التحكم.
ru: Если кто-то установил его намеренно, вы можете удалить его, ничего не повредив. В Windows используйте значок "Установка и удаление программ" на панели управления.

source: If Python was installed by a third-party application, you can also remove it, but that application will no longer work. You should use that application's uninstaller rather than removing Python directly.
ar: إذا تمَّ تثبيت بايثون بواسطة تطبيق طرف ثالث، فيمكنك أيضًا إزالتها، لكن التطبيق لن يعمل بعد الآن. يجب عليك استخدام برنامج إلغاء التثبيت الخاص بهذا التطبيق بدلاً من إزالة بايثون مباشرةً.
ru: Если Python был установлен сторонним приложением, вы также можете удалить его, но это приложение больше не будет работать. Вам следует использовать программу удаления этого приложения, а не удалять Python напрямую.

source: If Python came with your operating system, removing it is not recommended. If you remove it, whatever tools were written in Python will no longer run, and some of them might be important to you. Reinstalling the whole system would then be required to fix things again.
ar: إذا كانت بايثون تأتي مع نظام التشغيل الخاص بك، فلا يوصى بإزالتها. إذا أزلتها، فلن يتم تشغيل أي أدوات تمت كتابتها بلغة بايثون، قد يكون بعضها مهمًا بالنسبة لك. عندئذٍ ستكون هناك حاجة إلى إعادة تثبيت النظام بأكمله لإصلاح الأشياء مرة أخرى.
ru: Если Python поставляется вместе с вашей операционной системой, удалять его не рекомендуется. Если вы удалите его, все инструменты, написанные на Python, больше не будут работать, а некоторые из них могут быть важны для вас. Для исправления ситуации потребуется переустановка всей системы.
