Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/faq/programming.po
Languages: es_es

source: The last step fails, because Python isn't done with interpreting ``foo`` yet and the global symbol dictionary for ``foo`` is still empty.
es_es: El último paso falla, porque Python aún no ha terminado de interpretar ``foo`` y el diccionario global de símbolos para ``foo`` aún está vacío.

source: The same thing happens when you use ``import foo``, and then try to access ``foo.foo_var`` in global code.
es_es: Lo mismo ocurre cuando se utiliza ``import foo``, y luego se intenta acceder a ``foo.foo_var`` en código global.

source: There are (at least) three possible workarounds for this problem.
es_es: Existen (al menos) tres posibles soluciones a este problema.

source: Guido van Rossum recommends avoiding all uses of ``from <module> import ...``, and placing all code inside functions. Initializations of global variables and class variables should use constants or built-in functions only. This means everything from an imported module is referenced as ``<module>.<name>``.
es_es: Guido van Rossum recomienda evitar todo uso de ``from <module> import ...``, y colocar todo el código dentro de funciones. Las inicializaciones de variables globales y variables de clase deben usar sólo constantes o funciones integradas. Esto significa que todo lo que provenga de un módulo importado se referenciará como ``<module>.<name>``.

source: Jim Roskind suggests performing steps in the following order in each module:
es_es: Jim Roskind sugiere realizar los pasos en el siguiente orden en cada módulo:

source: exports (globals, functions, and classes that don't need imported base classes)
es_es: exportaciones (globales, funciones y clases que no necesitan clases base importadas)

source: ``import`` statements
es_es: ``import`` declaraciones

source: active code (including globals that are initialized from imported values).
es_es: código activo (incluidos los globales que se inicializan a partir de valores importados).

source: Van Rossum doesn't like this approach much because the imports appear in a strange place, but it does work.
es_es: A Van Rossum no le gusta mucho este enfoque porque las importaciones aparecen en un lugar extraño, pero funciona.

source: Matthias Urlichs recommends restructuring your code so that the recursive import is not necessary in the first place.
es_es: Matthias Urlichs recomienda reestructurar el código para que la importación recursiva no sea necesaria en primer lugar.

source: These solutions are not mutually exclusive.
es_es: Estas soluciones no se excluyen mutuamente.

source: __import__('x.y.z') returns <module 'x'>; how do I get z?
es_es: __import__('x.y.z') devuelve <module 'x'>; ¿cómo obtengo z?

source: Consider using the convenience function :func:`~importlib.import_module` from :mod:`importlib` instead::
es_es: Considere la posibilidad de utilizar la función :func:`~importlib.import_module` de :mod:`importlib` en su lugar::

source: When I edit an imported module and reimport it, the changes don't show up. Why does this happen?
es_es: Cuando edito un módulo importado y lo reimporto, los cambios no aparecen. ¿Por qué ocurre esto?

source: For reasons of efficiency as well as consistency, Python only reads the module file on the first time a module is imported. If it didn't, in a program consisting of many modules where each one imports the same basic module, the basic module would be parsed and re-parsed many times. To force re-reading of a changed module, do this::
es_es: Por razones de eficiencia y coherencia, Python sólo lee el archivo del módulo la primera vez que se importa un módulo. Si no lo hiciera, en un programa consistente en muchos módulos donde cada uno importa el mismo módulo básico, el módulo básico sería analizado y re-analizado muchas veces. Para forzar la relectura de un módulo modificado, haga lo siguiente::

source: Warning: this technique is not 100% fool-proof. In particular, modules containing statements like ::
es_es: Atención: esta técnica no es 100% infalible. En particular, los módulos que contienen declaraciones como ::

source: will continue to work with the old version of the imported objects. If the module contains class definitions, existing class instances will *not* be updated to use the new class definition. This can result in the following paradoxical behaviour::
es_es: seguirá funcionando con la versión antigua de los objetos importados. Si el módulo contiene definiciones de clase, las instancias de clase existentes *no* se actualizarán para utilizar la nueva definición de clase. Esto puede dar lugar al siguiente comportamiento paradójico::

source: The nature of the problem is made clear if you print out the "identity" of the class objects::
es_es: La naturaleza del problema queda clara si se imprime la "identidad" de los objetos de clase::
