Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/faq/programming.po
Languages: es_es

source: It is often expected that a function call creates new objects for default values. This is not what happens. Default values are created exactly once, when the function is defined. If that object is changed, like the dictionary in this example, subsequent calls to the function will refer to this changed object.
es_es: A menudo se espera que una llamada a una función cree nuevos objetos para los valores por defecto. Esto no es lo que ocurre. Los valores por defecto se crean exactamente una vez, cuando se define la función. Si ese objeto se modifica, como el diccionario en este ejemplo, las llamadas posteriores a la función harán referencia a este objeto modificado.

source: By definition, immutable objects such as numbers, strings, tuples, and ``None``, are safe from change. Changes to mutable objects such as dictionaries, lists, and class instances can lead to confusion.
es_es: Por definición, los objetos inmutables, como números, cadenas, tuplas y ``None``, están a salvo de cambios. Los cambios en objetos mutables, como diccionarios, listas e instancias de clases, pueden dar lugar a confusión.

source: Because of this feature, it is good programming practice to not use mutable objects as default values. Instead, use ``None`` as the default value and inside the function, check if the parameter is ``None`` and create a new list/dictionary/whatever if it is. For example, don't write::
es_es: Debido a esta característica, es una buena práctica de programación no utilizar objetos mutables como valores por defecto. En su lugar, utilice ``None`` como valor por defecto y dentro de la función, compruebe si el parámetro es ``None`` y cree una nueva lista/diccionario/lo que sea si lo es. Por ejemplo, no escriba::

source: but::
es_es: pero::

source: This feature can be useful. When you have a function that's time-consuming to compute, a common technique is to cache the parameters and the resulting value of each call to the function, and return the cached value if the same value is requested again. This is called "memoizing", and can be implemented like this::
es_es: Esta función puede ser útil. Cuando se tiene una función que lleva mucho tiempo calcular, una técnica común es almacenar en caché los parámetros y el valor resultante de cada llamada a la función, y devolver el valor almacenado en caché si se vuelve a solicitar el mismo valor. Esto se llama "memoizing", y se puede implementar de la siguiente manera::

source: You could use a global variable containing a dictionary instead of the default value; it's a matter of taste.
es_es: Puedes utilizar una variable global que contenga un diccionario en lugar del valor por defecto; es cuestión de gustos.

source: How can I pass optional or keyword parameters from one function to another?
es_es: ¿Cómo puedo pasar parámetros opcionales o de palabra clave de una función a otra?

source: Collect the arguments using the ``*`` and ``**`` specifiers in the function's parameter list; this gives you the positional arguments as a tuple and the keyword arguments as a dictionary. You can then pass these arguments when calling another function by using ``*`` and ``**``::
es_es: Recopile los argumentos utilizando los especificadores ``*`` y ``**`` en la lista de parámetros de la función; esto le proporciona los argumentos posicionales como una tupla y los argumentos de palabra clave como un diccionario. A continuación, puede pasar estos argumentos al llamar a otra función utilizando ``*`` y ``**``::

source: What is the difference between arguments and parameters?
es_es: ¿Cuál es la diferencia entre argumentos y parámetros?

source: :term:`Parameters <parameter>` are defined by the names that appear in a function definition, whereas :term:`arguments <argument>` are the values actually passed to a function when calling it. Parameters define what :term:`kind of arguments <parameter>` a function can accept. For example, given the function definition::
es_es: :term:`Parameters <parameter>` se definen por los nombres que aparecen en la definición de una función, mientras que :term:`arguments <argument>` son los valores que se pasan realmente a una función al llamarla. Los parámetros definen qué :term:`kind of arguments <parameter>` puede aceptar una función. Por ejemplo, dada la definición de función::

source: *foo*, *bar* and *kwargs* are parameters of ``func``. However, when calling ``func``, for example::
es_es: *foo*, *bar* y *kwargs* son parámetros de ``func``. Sin embargo, al llamar a ``func``, por ejemplo::

source: the values ``42``, ``314``, and ``somevar`` are arguments.
es_es: los valores ``42``, ``314``, y ``somevar`` son argumentos.

source: Why did changing list 'y' also change list 'x'?
es_es: ¿Por qué al cambiar la lista "y" también ha cambiado la lista "x"?

source: If you wrote code like::
es_es: Si escribieras código como::

source: you might be wondering why appending an element to ``y`` changed ``x`` too.
es_es: quizá se pregunte por qué al añadir un elemento a ``y`` también ha cambiado ``x``.

source: There are two factors that produce this result:
es_es: Hay dos factores que producen este resultado:

source: Variables are simply names that refer to objects. Doing ``y = x`` doesn't create a copy of the list -- it creates a new variable ``y`` that refers to the same object ``x`` refers to. This means that there is only one object (the list), and both ``x`` and ``y`` refer to it.
es_es: Las variables son simplemente nombres que se refieren a objetos. Hacer ``y = x`` no crea una copia de la lista -- crea una nueva variable ``y`` que se refiere al mismo objeto al que se refiere ``x``. Esto significa que sólo hay un objeto (la lista), y tanto ``x`` como ``y`` se refieren a él.

source: Lists are :term:`mutable`, which means that you can change their content.
es_es: Las listas son :term:`mutable`, lo que significa que puedes cambiar su contenido.

source: After the call to :meth:`~list.append`, the content of the mutable object has changed from ``[]`` to ``[10]``. Since both the variables refer to the same object, using either name accesses the modified value ``[10]``.
es_es: Tras la llamada a :meth:`~list.append`, el contenido del objeto mutable ha cambiado de ``[]`` a ``[10]``. Dado que ambas variables hacen referencia al mismo objeto, al utilizar cualquiera de los dos nombres se accede al valor modificado ``[10]``.

source: If we instead assign an immutable object to ``x``::
es_es: Si en su lugar asignamos un objeto inmutable a ``x``::

source: we can see that in this case ``x`` and ``y`` are not equal anymore. This is because integers are :term:`immutable`, and when we do ``x = x + 1`` we are not mutating the int ``5`` by incrementing its value; instead, we are creating a new object (the int ``6``) and assigning it to ``x`` (that is, changing which object ``x`` refers to). After this assignment we have two objects (the ints ``6`` and ``5``) and two variables that refer to them (``x`` now refers to ``6`` but ``y`` still refers to ``5``).
es_es: podemos ver que en este caso ``x`` y ``y`` ya no son iguales. Esto se debe a que los enteros son :term:`inmutables`, y cuando hacemos ``x = x + 1`` no estamos mutando el int ``5`` incrementando su valor, sino que estamos creando un nuevo objeto (el int ``6``) y asignándolo a ``x`` (es decir, cambiando a qué objeto se refiere ``x`` ). Después de esta asignación tenemos dos objetos (los int ``6`` y ``5``) y dos variables que hacen referencia a ellos (``x`` ahora hace referencia a ``6`` pero ``y`` sigue haciendo referencia a ``5``).

source: Some operations (for example ``y.append(10)`` and ``y.sort()``) mutate the object, whereas superficially similar operations (for example ``y = y + [10]`` and :func:`sorted(y) <sorted>`) create a new object. In general in Python (and in all cases in the standard library) a method that mutates an object will return ``None`` to help avoid getting the two types of operations confused. So if you mistakenly write ``y.sort()`` thinking it will give you a sorted copy of ``y``, you'll instead end up with ``None``, which will likely cause your program to generate an easily diagnosed error.
es_es: Algunas operaciones (por ejemplo ``y.append(10)`` y ``y.sort()``) mutan el objeto, mientras que operaciones superficialmente similares (por ejemplo ``y = y + [10]`` y :func:`sorted(y) <sorted>`) crean un nuevo objeto. En general en Python (y en todos los casos en la biblioteca estándar) un método que muta un objeto devolverá ``None`` para ayudar a evitar confundir los dos tipos de operaciones. Así que si escribes erróneamente ``y.sort()`` pensando que te dará una copia ordenada de ``y``, en su lugar acabarás con ``None``, lo que probablemente hará que tu programa genere un error fácilmente diagnosticable.

source: However, there is one class of operations where the same operation sometimes has different behaviors with different types: the augmented assignment operators. For example, ``+=`` mutates lists but not tuples or ints (``a_list += [1, 2, 3]`` is equivalent to ``a_list.extend([1, 2, 3])`` and mutates ``a_list``, whereas ``some_tuple += (1, 2, 3)`` and ``some_int += 1`` create new objects).
es_es: Sin embargo, hay una clase de operaciones en las que la misma operación tiene a veces comportamientos diferentes con tipos diferentes: los operadores de asignación aumentada. Por ejemplo, ``+=`` muta listas pero no tuplas o ints (``a_list += [1, 2, 3]`` es equivalente a ``a_list.extend([1, 2, 3])`` y muta ``a_list``, mientras que ``some_tuple += (1, 2, 3)`` y ``some_int += 1`` crean nuevos objetos).

source: In other words:
es_es: En otras palabras:

source: If we have a mutable object (:class:`list`, :class:`dict`, :class:`set`, etc.), we can use some specific operations to mutate it and all the variables that refer to it will see the change.
es_es: Si tenemos un objeto mutable (:class:`list`, :class:`dict`, :class:`set`, etc.), podemos utilizar algunas operaciones específicas para mutarlo y todas las variables que hagan referencia a él verán el cambio.

source: If we have an immutable object (:class:`str`, :class:`int`, :class:`tuple`, etc.), all the variables that refer to it will always see the same value, but operations that transform that value into a new value always return a new object.
es_es: Si tenemos un objeto inmutable (:class:`str`, :class:`int`, :class:`tuple`, etc.), todas las variables que hagan referencia a él verán siempre el mismo valor, pero las operaciones que transforman ese valor en un nuevo valor siempre devuelven un nuevo objeto.

source: If you want to know if two variables refer to the same object or not, you can use the :keyword:`is` operator, or the built-in function :func:`id`.
es_es: Si desea saber si dos variables se refieren al mismo objeto o no, puede utilizar el operador :keyword:`is`, o la función incorporada :func:`id`.

source: How do I write a function with output parameters (call by reference)?
es_es: ¿Cómo escribo una función con parámetros de salida (llamada por referencia)?

source: Remember that arguments are passed by assignment in Python. Since assignment just creates references to objects, there's no alias between an argument name in the caller and callee, and so no call-by-reference per se. You can achieve the desired effect in a number of ways.
es_es: Recuerda que en Python los argumentos se pasan por asignación. Dado que la asignación sólo crea referencias a objetos, no hay alias entre un nombre de argumento en el llamante y el llamado, y por lo tanto no hay llamada por referencia per se. Puedes conseguir el efecto deseado de varias maneras.

source: By returning a tuple of the results::
es_es: Devolviendo una tupla de los resultados::

source: This is almost always the clearest solution.
es_es: Esta es casi siempre la solución más clara.

source: By using global variables. This isn't thread-safe, and is not recommended.
es_es: Utilizando variables globales. Esto no es thread-safe, y no se recomienda.

source: By passing a mutable (changeable in-place) object::
es_es: Pasando un objeto mutable (cambiable in situ)::

source: By passing in a dictionary that gets mutated::
es_es: Pasando un diccionario que se muta::

source: Or bundle up values in a class instance::
es_es: O agrupar valores en una instancia de clase::

source: There's almost never a good reason to get this complicated.
es_es: Casi nunca hay una buena razón para complicarse tanto.

source: Your best choice is to return a tuple containing the multiple results.
es_es: Su mejor opción es devolver una tupla que contenga los resultados múltiples.

source: How do you make a higher order function in Python?
es_es: ¿Cómo se crea una función de orden superior en Python?

source: You have two choices: you can use nested scopes or you can use callable objects. For example, suppose you wanted to define ``linear(a,b)`` which returns a function ``f(x)`` that computes the value ``a*x+b``. Using nested scopes::
es_es: Tiene dos opciones: puede utilizar ámbitos anidados o puede utilizar objetos invocables. Por ejemplo, supongamos que desea definir ``linear(a,b)`` que devuelve una función ``f(x)`` que calcula el valor ``a*x+b``. Usando ámbitos anidados::

source: Or using a callable object::
es_es: O utilizando un objeto invocable::

source: In both cases, ::
es_es: En ambos casos, ::

source: gives a callable object where ``taxes(10e6) == 0.3 * 10e6 + 2``.
es_es: da un objeto invocable donde ``taxes(10e6) == 0.3 * 10e6 + 2``.

source: The callable object approach has the disadvantage that it is a bit slower and results in slightly longer code. However, note that a collection of callables can share their signature via inheritance::
es_es: El enfoque de objetos invocables tiene la desventaja de que es un poco más lento y resulta en un código ligeramente más largo. Sin embargo, ten en cuenta que una colección de objetos invocables puede compartir su firma a través de la herencia::

source: Object can encapsulate state for several methods::
es_es: Objeto puede encapsular el estado de varios métodos::

source: Here ``inc()``, ``dec()`` and ``reset()`` act like functions which share the same counting variable.
es_es: Aquí ``inc()``, ``dec()`` y ``reset()`` actúan como funciones que comparten la misma variable de recuento.

source: How do I copy an object in Python?
es_es: ¿Cómo se copia un objeto en Python?

source: In general, try :func:`copy.copy` or :func:`copy.deepcopy` for the general case. Not all objects can be copied, but most can.
es_es: En general, pruebe :func:`copy.copy` o :func:`copy.deepcopy` para el caso general. No todos los objetos pueden copiarse, pero sí la mayoría.

source: Some objects can be copied more easily. Dictionaries have a :meth:`~dict.copy` method::
es_es: Algunos objetos se pueden copiar más fácilmente. Los diccionarios tienen un método :meth:`~dict.copy`::

source: Sequences can be copied by slicing::
es_es: Las secuencias se pueden copiar mediante cortes::

source: How can I find the methods or attributes of an object?
es_es: ¿Cómo puedo encontrar los métodos o atributos de un objeto?

source: For an instance ``x`` of a user-defined class, :func:`dir(x) <dir>` returns an alphabetized list of the names containing the instance attributes and methods and attributes defined by its class.
es_es: Para una instancia ``x`` de una clase definida por el usuario, :func:`dir(x) <dir>` devuelve una lista alfabetizada de los nombres que contienen los atributos de instancia y los métodos y atributos definidos por su clase.

source: How can my code discover the name of an object?
es_es: ¿Cómo puede mi código descubrir el nombre de un objeto?

source: Generally speaking, it can't, because objects don't really have names. Essentially, assignment always binds a name to a value; the same is true of ``def`` and ``class`` statements, but in that case the value is a callable. Consider the following code::
es_es: En general, no puede, porque los objetos no tienen nombres. Esencialmente, la asignación siempre vincula un nombre a un valor; lo mismo ocurre con las sentencias ``def`` y ``class``, pero en ese caso el valor es un callable. Considere el siguiente código::

source: Arguably the class has a name: even though it is bound to two names and invoked through the name ``B`` the created instance is still reported as an instance of class ``A``. However, it is impossible to say whether the instance's name is ``a`` or ``b``, since both names are bound to the same value.
es_es: Podría decirse que la clase tiene un nombre: aunque esté vinculada a dos nombres y se invoque a través del nombre ``B``, la instancia creada se sigue reportando como una instancia de la clase ``A``. Sin embargo, es imposible decir si el nombre de la instancia es ``a`` o ``b``, ya que ambos nombres están vinculados al mismo valor.

source: Generally speaking it should not be necessary for your code to "know the names" of particular values. Unless you are deliberately writing introspective programs, this is usually an indication that a change of approach might be beneficial.
es_es: En general, no debería ser necesario que tu código "conozca los nombres" de determinados valores. A menos que esté escribiendo deliberadamente programas introspectivos, esto suele ser una indicación de que un cambio de enfoque podría ser beneficioso.

source: In comp.lang.python, Fredrik Lundh once gave an excellent analogy in answer to this question:
es_es: En comp.lang.python, Fredrik Lundh dio una vez una excelente analogía en respuesta a esta pregunta:

source: The same way as you get the name of that cat you found on your porch: the cat (object) itself cannot tell you its name, and it doesn't really care -- so the only way to find out what it's called is to ask all your neighbours (namespaces) if it's their cat (object)...
es_es: De la misma forma que obtienes el nombre de ese gato que encontraste en tu porche: el gato (objeto) en sí no puede decirte su nombre, y realmente no le importa -- así que la única forma de averiguar cómo se llama es preguntar a todos tus vecinos (namespaces) si es su gato (objeto)...

source: ....and don't be surprised if you'll find that it's known by many names, or no name at all!
es_es: ....y no se sorprenda si descubre que recibe muchos nombres, ¡o ninguno!

source: What's up with the comma operator's precedence?
es_es: ¿Qué pasa con la precedencia del operador coma?

source: Comma is not an operator in Python. Consider this session::
es_es: La coma no es un operador en Python. Considere esta sesión::

source: Since the comma is not an operator, but a separator between expressions the above is evaluated as if you had entered::
es_es: Dado que la coma no es un operador, sino un separador entre expresiones, lo anterior se evalúa como si hubiera introducido::

source: not::
es_es: no::

source: The same is true of the various assignment operators (``=``, ``+=`` etc). They are not truly operators but syntactic delimiters in assignment statements.
es_es: Lo mismo ocurre con los distintos operadores de asignación (``=``, ``+=`` etc). No son realmente operadores, sino delimitadores sintácticos en las sentencias de asignación.

source: Is there an equivalent of C's "?:" ternary operator?
es_es: ¿Existe un equivalente del operador ternario "?:" de C?

source: Yes, there is. The syntax is as follows::
es_es: Sí, existe. La sintaxis es la siguiente::

source: Before this syntax was introduced in Python 2.5, a common idiom was to use logical operators::
es_es: Antes de que se introdujera esta sintaxis en Python 2.5, era habitual utilizar los operadores lógicos::

source: However, this idiom is unsafe, as it can give wrong results when *on_true* has a false boolean value. Therefore, it is always better to use the ``... if ... else ...`` form.
es_es: Sin embargo, este modismo no es seguro, ya que puede dar resultados erróneos cuando *on_true* tiene un valor booleano falso. Por lo tanto, siempre es mejor utilizar la forma ``... if ... else ...``.

source: Is it possible to write obfuscated one-liners in Python?
es_es: ¿Es posible escribir frases de una sola línea ofuscadas en Python?

source: Yes. Usually this is done by nesting :keyword:`lambda` within :keyword:`!lambda`. See the following three examples, slightly adapted from Ulf Bartelt::
es_es: Sí. Normalmente, esto se hace anidando :keyword:`lambda` dentro de :keyword:`!lambda`. Ver los tres ejemplos siguientes, ligeramente adaptados de Ulf Bartelt::

source: Don't try this at home, kids!
es_es: ¡No intenten esto en casa, niños!

source: What does the slash(/) in the parameter list of a function mean?
es_es: ¿Qué significa la barra oblicua (/) en la lista de parámetros de una función?

source: A slash in the argument list of a function denotes that the parameters prior to it are positional-only. Positional-only parameters are the ones without an externally usable name. Upon calling a function that accepts positional-only parameters, arguments are mapped to parameters based solely on their position. For example, :func:`divmod` is a function that accepts positional-only parameters. Its documentation looks like this::
es_es: Una barra oblicua en la lista de argumentos de una función indica que los parámetros que la preceden son sólo posicionales. Los parámetros sólo posicionales son los que no tienen un nombre utilizable externamente. Al llamar a una función que acepta parámetros sólo posicionales, los argumentos se asignan a los parámetros basándose únicamente en su posición. Por ejemplo, :func:`divmod` es una función que acepta parámetros sólo posicionales. Su documentación tiene el siguiente aspecto::

source: The slash at the end of the parameter list means that both parameters are positional-only. Thus, calling :func:`divmod` with keyword arguments would lead to an error::
es_es: La barra al final de la lista de parámetros significa que ambos parámetros son sólo posicionales. Por lo tanto, llamar a :func:`divmod` con argumentos de palabra clave daría lugar a un error::

source: Numbers and strings
es_es: Números y cadenas

source: How do I specify hexadecimal and octal integers?
es_es: ¿Cómo se especifican los números enteros hexadecimales y octales?

source: To specify an octal digit, precede the octal value with a zero, and then a lower or uppercase "o". For example, to set the variable "a" to the octal value "10" (8 in decimal), type::
es_es: Para especificar un dígito octal, preceda el valor octal con un cero y, a continuación, una "o" minúscula o mayúscula. Por ejemplo, para asignar a la variable "a" el valor octal "10" (8 en decimal), escriba::

source: Hexadecimal is just as easy. Simply precede the hexadecimal number with a zero, and then a lower or uppercase "x". Hexadecimal digits can be specified in lower or uppercase. For example, in the Python interpreter::
es_es: El hexadecimal es igual de fácil. Basta con anteponer un cero al número hexadecimal y, a continuación, una "x" minúscula o mayúscula. Los dígitos hexadecimales pueden especificarse en minúsculas o mayúsculas. Por ejemplo, en el intérprete de Python::

source: Why does -22 // 10 return -3?
es_es: ¿Por qué -22 // 10 devuelve -3?

source: It's primarily driven by the desire that ``i % j`` have the same sign as ``j``. If you want that, and also want::
es_es: Está impulsado principalmente por el deseo de que ``i % j`` tenga el mismo signo que ``j``. Si quiere eso, y también quiere::

source: then integer division has to return the floor. C also requires that identity to hold, and then compilers that truncate ``i // j`` need to make ``i % j`` have the same sign as ``i``.
es_es: entonces la división entera tiene que devolver el piso. C también requiere que la identidad se mantenga, y entonces los compiladores que truncan ``i // j`` necesitan hacer que ``i % j`` tenga el mismo signo que ``i``.
