Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/faq/programming.po
Languages: es_es

source: Lists are equivalent to C or Pascal arrays in their time complexity; the primary difference is that a Python list can contain objects of many different types.
es_es: Las listas son equivalentes a las matrices de C o Pascal en su complejidad temporal; la principal diferencia es que una lista de Python puede contener objetos de muchos tipos diferentes.

source: The ``array`` module also provides methods for creating arrays of fixed types with compact representations, but they are slower to index than lists. Also note that `NumPy <https://numpy.org/>`_ and other third party packages define array-like structures with various characteristics as well.
es_es: El módulo ``array`` también proporciona métodos para crear arrays de tipos fijos con representaciones compactas, pero son más lentos de indexar que las listas. También hay que tener en cuenta que `NumPy <https://numpy.org/>`_ y otros paquetes de terceros definen también estructuras tipo array con diversas características.

source: To get Lisp-style linked lists, you can emulate *cons cells* using tuples::
es_es: Para obtener listas enlazadas al estilo Lisp, puedes emular *cons cells* utilizando tuplas::

source: If mutability is desired, you could use lists instead of tuples. Here the analogue of a Lisp *car* is ``lisp_list[0]`` and the analogue of *cdr* is ``lisp_list[1]``. Only do this if you're sure you really need to, because it's usually a lot slower than using Python lists.
es_es: Si se desea mutabilidad, se pueden utilizar listas en lugar de tuplas. Aquí el análogo de *car* en Lisp es ``lisp_list[0]`` y el análogo de *cdr* es ``lisp_list[1]``. Haz esto sólo si estás seguro de que realmente lo necesitas, porque suele ser mucho más lento que usar listas en Python.

source: How do I create a multidimensional list?
es_es: ¿Cómo crear una lista multidimensional?

source: You probably tried to make a multidimensional array like this::
es_es: Probablemente intentaste hacer un array multidimensional como este::

source: This looks correct if you print it:
es_es: Esto parece correcto si lo imprimes:

source: But when you assign a value, it shows up in multiple places:
es_es: Pero cuando asignas un valor, aparece en varios lugares:

source: The reason is that replicating a list with ``*`` doesn't create copies, it only creates references to the existing objects. The ``*3`` creates a list containing 3 references to the same list of length two. Changes to one row will show in all rows, which is almost certainly not what you want.
es_es: La razón es que replicar una lista con ``*`` no crea copias, sólo crea referencias a los objetos existentes. El ``*3`` crea una lista que contiene 3 referencias a la misma lista de longitud dos. Los cambios en una fila se mostrarán en todas las filas, que casi seguro no es lo que quieres.

source: The suggested approach is to create a list of the desired length first and then fill in each element with a newly created list::
es_es: El enfoque sugerido es crear primero una lista de la longitud deseada y luego rellenar cada elemento con una lista recién creada::

source: This generates a list containing 3 different lists of length two. You can also use a list comprehension::
es_es: Esto genera una lista que contiene 3 listas diferentes de longitud dos. También puede utilizar una comprensión de lista::

source: Or, you can use an extension that provides a matrix datatype; `NumPy <https://numpy.org/>`_ is the best known.
es_es: O bien, puede utilizar una extensión que proporcione un tipo de datos de matriz; `NumPy <https://numpy.org/>`_ es la más conocida.

source: How do I apply a method to a sequence of objects?
es_es: ¿Cómo aplicar un método a una secuencia de objetos?

source: Use a list comprehension::
es_es: Utiliza una lista de comprensión::

source: Why does a_tuple[i] += ['item'] raise an exception when the addition works?
es_es: ¿Por qué a_tuple[i] += ['item'] lanza una excepción cuando la suma funciona?

source: This is because of a combination of the fact that augmented assignment operators are *assignment* operators, and the difference between mutable and immutable objects in Python.
es_es: Esto se debe a una combinación del hecho de que los operadores de asignación aumentada son operadores de *asignación*, y a la diferencia entre objetos mutables e inmutables en Python.

source: This discussion applies in general when augmented assignment operators are applied to elements of a tuple that point to mutable objects, but we'll use a ``list`` and ``+=`` as our exemplar.
es_es: Esta discusión se aplica en general cuando los operadores de asignación aumentada se aplican a elementos de una tupla que apuntan a objetos mutables, pero utilizaremos ``list`` y ``+=`` como ejemplo.

source: If you wrote::
es_es: Si usted escribió::

source: The reason for the exception should be immediately clear: ``1`` is added to the object ``a_tuple[0]`` points to (``1``), producing the result object, ``2``, but when we attempt to assign the result of the computation, ``2``, to element ``0`` of the tuple, we get an error because we can't change what an element of a tuple points to.
es_es: La razón de la excepción debería ser inmediatamente clara: ``1`` se añade al objeto al que apunta ``a_tuple[0]`` (``1``), produciendo el objeto resultado, ``2``, pero cuando intentamos asignar el resultado del cálculo, ``2``, al elemento ``0`` de la tupla, obtenemos un error porque no podemos cambiar a qué apunta un elemento de una tupla.

source: Under the covers, what this augmented assignment statement is doing is approximately this::
es_es: Bajo las sábanas, lo que esta declaración de asignación aumentada está haciendo es aproximadamente esto::

source: It is the assignment part of the operation that produces the error, since a tuple is immutable.
es_es: Es la parte de asignación de la operación la que produce el error, ya que una tupla es inmutable.

source: When you write something like::
es_es: Cuando escribes algo como::

source: The exception is a bit more surprising, and even more surprising is the fact that even though there was an error, the append worked::
es_es: La excepción es un poco más sorprendente, y aún más sorprendente es el hecho de que a pesar de que hubo un error, el append funcionó::

source: To see why this happens, you need to know that (a) if an object implements an :meth:`~object.__iadd__` magic method, it gets called when the ``+=`` augmented assignment is executed, and its return value is what gets used in the assignment statement; and (b) for lists, :meth:`!__iadd__` is equivalent to calling :meth:`~list.extend` on the list and returning the list. That's why we say that for lists, ``+=`` is a "shorthand" for :meth:`!list.extend`::
es_es: Para ver por qué ocurre esto, necesita saber que (a) si un objeto implementa un método mágico :meth:`~object.__iadd__`, éste es llamado cuando se ejecuta la asignación aumentada ``+=``, y su valor de retorno es lo que se utiliza en la sentencia de asignación; y (b) para listas, :meth:`!__iadd__` es equivalente a llamar a :meth:`~list.extend` en la lista y devolver la lista. Por eso decimos que para las listas, ``+=`` es una "abreviatura" de :meth:`!list.extend`::

source: This is equivalent to::
es_es: Esto equivale a::

source: The object pointed to by a_list has been mutated, and the pointer to the mutated object is assigned back to ``a_list``. The end result of the assignment is a no-op, since it is a pointer to the same object that ``a_list`` was previously pointing to, but the assignment still happens.
es_es: El objeto apuntado por a_list ha sido mutado, y el puntero al objeto mutado se asigna de nuevo a ``a_list``. El resultado final de la asignación es un no-op, ya que es un puntero al mismo objeto que ``a_list`` estaba apuntando previamente, pero la asignación sigue ocurriendo.

source: Thus, in our tuple example what is happening is equivalent to::
es_es: Así, en nuestro ejemplo de tupla lo que ocurre es equivalente a::

source: The :meth:`!__iadd__` succeeds, and thus the list is extended, but even though ``result`` points to the same object that ``a_tuple[0]`` already points to, that final assignment still results in an error, because tuples are immutable.
es_es: El :meth:`!__iadd__` tiene éxito, y por lo tanto la lista se extiende, pero a pesar de que ``result`` apunta al mismo objeto que ``a_tuple[0]`` ya apunta, esa asignación final sigue dando lugar a un error, porque las tuplas son inmutables.

source: I want to do a complicated sort: can you do a Schwartzian Transform in Python?
es_es: Quiero hacer una ordenación complicada: ¿se puede hacer una Transformada Schwartziana en Python?

source: The technique, attributed to Randal Schwartz of the Perl community, sorts the elements of a list by a metric which maps each element to its "sort value". In Python, use the ``key`` argument for the :meth:`list.sort` method::
es_es: La técnica, atribuida a Randal Schwartz de la comunidad Perl, ordena los elementos de una lista mediante una métrica que asigna a cada elemento su "valor de ordenación". En Python, utilice el argumento ``key`` para el método :meth:`list.sort`::

source: How can I sort one list by values from another list?
es_es: ¿Cómo puedo ordenar una lista por los valores de otra lista?

source: Merge them into an iterator of tuples, sort the resulting list, and then pick out the element you want. ::
es_es: Fúndalos en un iterador de tuplas, ordena la lista resultante y luego elige el elemento que quieras. ::

source: Objects
es_es: Objetos

source: What is a class?
es_es: ¿Qué es una clase?

source: A class is the particular object type created by executing a class statement. Class objects are used as templates to create instance objects, which embody both the data (attributes) and code (methods) specific to a datatype.
es_es: Una clase es el tipo de objeto concreto que se crea al ejecutar una sentencia class. Los objetos de clase se utilizan como plantillas para crear objetos de instancia, que incorporan tanto los datos (atributos) como el código (métodos) específicos de un tipo de datos.

source: A class can be based on one or more other classes, called its base class(es). It then inherits the attributes and methods of its base classes. This allows an object model to be successively refined by inheritance. You might have a generic ``Mailbox`` class that provides basic accessor methods for a mailbox, and subclasses such as ``MboxMailbox``, ``MaildirMailbox``, ``OutlookMailbox`` that handle various specific mailbox formats.
es_es: Una clase puede basarse en otra u otras clases, denominadas clase(s) base. Entonces hereda los atributos y métodos de sus clases base. Esto permite refinar sucesivamente un modelo de objetos mediante la herencia. Puede tener una clase genérica ``Mailbox`` que proporcione métodos de acceso básicos para un buzón de correo, y subclases como ``MboxMailbox``, ``MaildirMailbox``, ``OutlookMailbox`` que manejen varios formatos de buzón específicos.

source: What is a method?
es_es: ¿Qué es un método?

source: A method is a function on some object ``x`` that you normally call as ``x.name(arguments...)``. Methods are defined as functions inside the class definition::
es_es: Un método es una función sobre algún objeto ``x`` que normalmente se llama como ``x.name(arguments...)``. Los métodos se definen como funciones dentro de la definición de la clase::

source: What is self?
es_es: ¿Qué es el yo?

source: Self is merely a conventional name for the first argument of a method. A method defined as ``meth(self, a, b, c)`` should be called as ``x.meth(a, b, c)`` for some instance ``x`` of the class in which the definition occurs; the called method will think it is called as ``meth(x, a, b, c)``.
es_es: Self es simplemente un nombre convencional para el primer argumento de un método. Un método definido como ``meth(self, a, b, c)`` debe ser llamado como ``x.meth(a, b, c)`` para alguna instancia ``x`` de la clase en la que se produce la definición; el método llamado pensará que es llamado como ``meth(x, a, b, c)``.

source: See also :ref:`why-self`.
es_es: Ver también :ref:`why-self`.

source: How do I check if an object is an instance of a given class or of a subclass of it?
es_es: ¿Cómo puedo comprobar si un objeto es una instancia de una clase determinada o de una subclase de la misma?

source: Use the built-in function :func:`isinstance(obj, cls) <isinstance>`. You can check if an object is an instance of any of a number of classes by providing a tuple instead of a single class, e.g. ``isinstance(obj, (class1, class2, ...))``, and can also check whether an object is one of Python's built-in types, e.g. ``isinstance(obj, str)`` or ``isinstance(obj, (int, float, complex))``.
es_es: Utilice la función incorporada :func:`isinstance(obj, cls) <isinstance>`. Puede comprobar si un objeto es una instancia de cualquiera de un número de clases proporcionando una tupla en lugar de una sola clase, por ejemplo ``isinstance(obj, (class1, class2, ...))``, y también puede comprobar si un objeto es uno de los tipos incorporados de Python, por ejemplo ``isinstance(obj, str)`` o ``isinstance(obj, (int, float, complex))``.

source: Note that :func:`isinstance` also checks for virtual inheritance from an :term:`abstract base class`. So, the test will return ``True`` for a registered class even if hasn't directly or indirectly inherited from it. To test for "true inheritance", scan the :term:`MRO` of the class:
es_es: Tenga en cuenta que :func:`isinstance` también comprueba la herencia virtual de una clase base :term:`abstract`. Por lo tanto, la prueba devolverá ``True`` para una clase registrada aunque no haya heredado directa o indirectamente de ella. Para comprobar la "herencia verdadera", explore el :term:`MRO` de la clase:

source: Note that most programs do not use :func:`isinstance` on user-defined classes very often. If you are developing the classes yourself, a more proper object-oriented style is to define methods on the classes that encapsulate a particular behaviour, instead of checking the object's class and doing a different thing based on what class it is. For example, if you have a function that does something::
es_es: Tenga en cuenta que la mayoría de los programas no utilizan :func:`isinstance` en clases definidas por el usuario muy a menudo. Si estás desarrollando las clases tú mismo, un estilo orientado a objetos más apropiado es definir métodos en las clases que encapsulen un comportamiento particular, en lugar de comprobar la clase del objeto y hacer una cosa diferente basándose en qué clase es. Por ejemplo, si tienes una función que hace algo::

source: A better approach is to define a ``search()`` method on all the classes and just call it::
es_es: Un enfoque mejor es definir un método ``search()`` en todas las clases y simplemente llamarlo::

source: What is delegation?
es_es: ¿Qué es la delegación?

source: Delegation is an object oriented technique (also called a design pattern). Let's say you have an object ``x`` and want to change the behaviour of just one of its methods. You can create a new class that provides a new implementation of the method you're interested in changing and delegates all other methods to the corresponding method of ``x``.
es_es: La delegación es una técnica orientada a objetos (también llamada patrón de diseño). Supongamos que tienes un objeto ``x`` y quieres cambiar el comportamiento de uno solo de sus métodos. Puedes crear una nueva clase que proporcione una nueva implementación del método que te interesa cambiar y delegar todos los demás métodos en el método correspondiente de ``x``.

source: Python programmers can easily implement delegation. For example, the following class implements a class that behaves like a file but converts all written data to uppercase::
es_es: Los programadores de Python pueden implementar fácilmente la delegación. Por ejemplo, la siguiente clase implementa una clase que se comporta como un archivo pero convierte todos los datos escritos a mayúsculas::

source: Here the ``UpperOut`` class redefines the ``write()`` method to convert the argument string to uppercase before calling the underlying ``self._outfile.write()`` method. All other methods are delegated to the underlying ``self._outfile`` object. The delegation is accomplished via the :meth:`~object.__getattr__` method; consult :ref:`the language reference <attribute-access>` for more information about controlling attribute access.
es_es: Aquí la clase ``UpperOut`` redefine el método ``write()`` para convertir la cadena del argumento a mayúsculas antes de llamar al método subyacente ``self._outfile.write()``. Todos los demás métodos se delegan en el objeto ``self._outfile`` subyacente. La delegación se realiza a través del método :meth:`~object.__getattr__`; consulte :ref:`the language reference <attribute-access>` para más información sobre el control de acceso a atributos.

source: Note that for more general cases delegation can get trickier. When attributes must be set as well as retrieved, the class must define a :meth:`~object.__setattr__` method too, and it must do so carefully. The basic implementation of :meth:`!__setattr__` is roughly equivalent to the following::
es_es: Ten en cuenta que, en casos más generales, la delegación puede resultar más complicada. Cuando los atributos deben establecerse además de recuperarse, la clase debe definir también un método :meth:`~object.__setattr__`, y debe hacerlo con cuidado. La implementación básica de :meth:`!__setattr__` es aproximadamente equivalente a la siguiente::

source: Most :meth:`!__setattr__` implementations must modify :meth:`self.__dict__ <object.__dict__>` to store local state for self without causing an infinite recursion.
es_es: La mayoría de las implementaciones de :meth:`!__setattr__` deben modificar :meth:`self.__dict__ <object.__dict__>` para almacenar el estado local de self sin provocar una recursión infinita.

source: How do I call a method defined in a base class from a derived class that extends it?
es_es: ¿Cómo se llama a un método definido en una clase base desde una clase derivada que la extiende?

source: Use the built-in :func:`super` function::
es_es: Utilice la función incorporada :func:`super`::

source: In the example, :func:`super` will automatically determine the instance from which it was called (the ``self`` value), look up the :term:`method resolution order` (MRO) with ``type(self).__mro__``, and return the next in line after ``Derived`` in the MRO: ``Base``.
es_es: En el ejemplo, :func:`super` determinará automáticamente la instancia desde la que se llamó (el valor ``self`` ), buscará el :term:`method resolution order` (MRO) con ``type(self).__mro__``, y devolverá el siguiente en la línea después de ``Derived`` en el MRO: ``Base``.

source: How can I organize my code to make it easier to change the base class?
es_es: ¿Cómo puedo organizar mi código para que sea más fácil cambiar la clase base?

source: You could assign the base class to an alias and derive from the alias. Then all you have to change is the value assigned to the alias. Incidentally, this trick is also handy if you want to decide dynamically (e.g. depending on availability of resources) which base class to use. Example::
es_es: Podría asignar la clase base a un alias y derivar del alias. Entonces todo lo que tienes que cambiar es el valor asignado al alias. Por cierto, este truco también es útil si desea decidir dinámicamente (por ejemplo, en función de la disponibilidad de recursos) qué clase base utilizar. Ejemplo::

source: How do I create static class data and static class methods?
es_es: ¿Cómo puedo crear datos de clase estáticos y métodos de clase estáticos?

source: Both static data and static methods (in the sense of C++ or Java) are supported in Python.
es_es: Tanto los datos estáticos como los métodos estáticos (en el sentido de C++ o Java) están soportados en Python.

source: For static data, simply define a class attribute. To assign a new value to the attribute, you have to explicitly use the class name in the assignment::
es_es: Para los datos estáticos, basta con definir un atributo de clase. Para asignar un nuevo valor al atributo, debe utilizar explícitamente el nombre de la clase en la asignación::

source: ``c.count`` also refers to ``C.count`` for any ``c`` such that ``isinstance(c, C)`` holds, unless overridden by ``c`` itself or by some class on the base-class search path from ``c.__class__`` back to ``C``.
es_es: ``c.count`` también se refiere a ``C.count`` para cualquier ``c`` tal que ``isinstance(c, C)`` se mantenga, a menos que sea anulado por el propio ``c`` o por alguna clase en la ruta de búsqueda de la clase base desde ``c.__class__`` de vuelta a ``C``.

source: Caution: within a method of C, an assignment like ``self.count = 42`` creates a new and unrelated instance named "count" in ``self``'s own dict. Rebinding of a class-static data name must always specify the class whether inside a method or not::
es_es: Precaución: dentro de un método de C, una asignación como ``self.count = 42`` crea una instancia nueva y no relacionada llamada "count" en ``self`` el propio diccionario. El reenlazado de un nombre de dato estático de clase siempre debe especificar la clase, ya sea dentro de un método o no::

source: Static methods are possible::
es_es: Los métodos estáticos son posibles::

source: However, a far more straightforward way to get the effect of a static method is via a simple module-level function::
es_es: Sin embargo, una forma mucho más directa de obtener el efecto de un método estático es mediante una simple función a nivel de módulo::

source: If your code is structured so as to define one class (or tightly related class hierarchy) per module, this supplies the desired encapsulation.
es_es: Si su código está estructurado para definir una clase (o una jerarquía de clases estrechamente relacionada) por módulo, esto proporciona la encapsulación deseada.

source: How can I overload constructors (or methods) in Python?
es_es: ¿Cómo puedo sobrecargar constructores (o métodos) en Python?

source: This answer actually applies to all methods, but the question usually comes up first in the context of constructors.
es_es: En realidad, esta respuesta se aplica a todos los métodos, pero la pregunta suele plantearse primero en el contexto de los constructores.

source: In C++ you'd write
es_es: En C++ se escribiría

source: In Python you have to write a single constructor that catches all cases using default arguments. For example::
es_es: En Python tienes que escribir un único constructor que atrape todos los casos usando argumentos por defecto. Por ejemplo::

source: This is not entirely equivalent, but close enough in practice.
es_es: No es totalmente equivalente, pero en la práctica se aproxima bastante.

source: You could also try a variable-length argument list, e.g. ::
es_es: También puedes probar con una lista de argumentos de longitud variable, por ejemplo ::

source: The same approach works for all method definitions.
es_es: El mismo enfoque funciona para todas las definiciones de métodos.

source: I try to use __spam and I get an error about _SomeClassName__spam.
es_es: Intento utilizar __spam y me aparece un error sobre _SomeClassName__spam.
