Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/faq/programming.po
Languages: es_es

source: Programming FAQ
es_es: Programación FAQ

source: Contents
es_es: Contenido

source: General Questions
es_es: Cuestiones generales

source: Is there a source code level debugger with breakpoints, single-stepping, etc.?
es_es: ¿Existe un depurador a nivel de código fuente con puntos de interrupción, paso a paso, etc.?

source: Yes.
es_es: Sí.

source: Several debuggers for Python are described below, and the built-in function :func:`breakpoint` allows you to drop into any of them.
es_es: A continuación se describen varios depuradores para Python, y la función incorporada :func:`breakpoint` permite pasar a cualquiera de ellos.

source: The pdb module is a simple but adequate console-mode debugger for Python. It is part of the standard Python library, and is :mod:`documented in the Library Reference Manual <pdb>`. You can also write your own debugger by using the code for pdb as an example.
es_es: El módulo pdb es un depurador en modo consola simple pero adecuado para Python. Forma parte de la biblioteca estándar de Python, y está :mod:`documentado en el Manual de Referencia de la Biblioteca <pdb>`. También puedes escribir tu propio depurador usando el código de pdb como ejemplo.

source: The IDLE interactive development environment, which is part of the standard Python distribution (normally available as `Tools/scripts/idle3 <https://github.com/python/cpython/blob/main/Tools/scripts/idle3>`_), includes a graphical debugger.
es_es: El entorno de desarrollo interactivo IDLE, que forma parte de la distribución estándar de Python (normalmente disponible como `Tools/scripts/idle3 <https://github.com/python/cpython/blob/main/Tools/scripts/idle3>`_), incluye un depurador gráfico.

source: PythonWin is a Python IDE that includes a GUI debugger based on pdb. The PythonWin debugger colors breakpoints and has quite a few cool features such as debugging non-PythonWin programs. PythonWin is available as part of `pywin32 <https://github.com/mhammond/pywin32>`_ project and as a part of the `ActivePython <https://www.activestate.com/products/python/>`_ distribution.
es_es: PythonWin es un IDE de Python que incluye un depurador GUI basado en pdb. El depurador de PythonWin colorea los puntos de interrupción y tiene algunas características interesantes como la depuración de programas que no son PythonWin. PythonWin está disponible como parte del proyecto `pywin32 <https://github.com/mhammond/pywin32>`_ y como parte de la distribución `ActivePython <https://www.activestate.com/products/python/>`_.

source: `Eric <https://eric-ide.python-projects.org/>`_ is an IDE built on PyQt and the Scintilla editing component.
es_es: `Eric <https://eric-ide.python-projects.org/>`_ es un IDE construido sobre PyQt y el componente de edición Scintilla.

source: `trepan3k <https://github.com/rocky/python3-trepan/>`_ is a gdb-like debugger.
es_es: `trepan3k <https://github.com/rocky/python3-trepan/>`_ es un depurador similar a gdb.

source: `Visual Studio Code <https://code.visualstudio.com/>`_ is an IDE with debugging tools that integrates with version-control software.
es_es: Visual Studio Code <https://code.visualstudio.com/>`_ es un IDE con herramientas de depuración que se integra con software de control de versiones.

source: There are a number of commercial Python IDEs that include graphical debuggers. They include:
es_es: Existen varios IDE comerciales de Python que incluyen depuradores gráficos. Estos incluyen:

source: Are there tools to help find bugs or perform static analysis?
es_es: ¿Existen herramientas que ayuden a encontrar errores o a realizar análisis estáticos?

source: `Pylint <https://pylint.pycqa.org/en/latest/index.html>`_ and `Pyflakes <https://github.com/PyCQA/pyflakes>`_ do basic checking that will help you catch bugs sooner.
es_es: `Pylint <https://pylint.pycqa.org/en/latest/index.html>`_ y `Pyflakes <https://github.com/PyCQA/pyflakes>`_ realizan comprobaciones básicas que te ayudarán a detectar fallos antes.

source: Static type checkers such as `Mypy <http://mypy-lang.org/>`_, `Pyre <https://pyre-check.org/>`_, and `Pytype <https://github.com/google/pytype>`_ can check type hints in Python source code.
es_es: Los comprobadores de tipos estáticos como `Mypy <http://mypy-lang.org/>`_, `Pyre <https://pyre-check.org/>`_, y `Pytype <https://github.com/google/pytype>`_ pueden comprobar sugerencias de tipos en el código fuente de Python.

source: How can I create a stand-alone binary from a Python script?
es_es: ¿Cómo puedo crear un binario independiente a partir de un script de Python?

source: You don't need the ability to compile Python to C code if all you want is a stand-alone program that users can download and run without having to install the Python distribution first. There are a number of tools that determine the set of modules required by a program and bind these modules together with a Python binary to produce a single executable.
es_es: No necesitas la capacidad de compilar Python a código C si todo lo que quieres es un programa independiente que los usuarios puedan descargar y ejecutar sin tener que instalar primero la distribución de Python. Hay una serie de herramientas que determinan el conjunto de módulos necesarios para un programa y los unen a un binario de Python para producir un único ejecutable.

source: One is to use the freeze tool, which is included in the Python source tree as `Tools/freeze <https://github.com/python/cpython/tree/main/Tools/freeze>`_. It converts Python byte code to C arrays; with a C compiler you can embed all your modules into a new program, which is then linked with the standard Python modules.
es_es: Una es utilizar la herramienta freeze, que se incluye en el árbol de código fuente de Python como `Tools/freeze <https://github.com/python/cpython/tree/main/Tools/freeze>`_. Convierte el código de bytes de Python en matrices de C; con un compilador de C puedes incrustar todos tus módulos en un nuevo programa, que luego se enlaza con los módulos estándar de Python.

source: It works by scanning your source recursively for import statements (in both forms) and looking for the modules in the standard Python path as well as in the source directory (for built-in modules). It then turns the bytecode for modules written in Python into C code (array initializers that can be turned into code objects using the marshal module) and creates a custom-made config file that only contains those built-in modules which are actually used in the program. It then compiles the generated C code and links it with the rest of the Python interpreter to form a self-contained binary which acts exactly like your script.
es_es: Funciona escaneando tu código fuente recursivamente en busca de declaraciones import (en ambas formas) y buscando los módulos en la ruta estándar de Python así como en el directorio fuente (para los módulos incorporados). A continuación, convierte el código de bytes de los módulos escritos en Python en código C (inicializadores de matrices que pueden convertirse en objetos de código utilizando el módulo marshal) y crea un archivo de configuración personalizado que sólo contiene los módulos incorporados que se utilizan realmente en el programa. Luego compila el código C generado y lo enlaza con el resto del intérprete de Python para formar un binario autocontenido que actúa exactamente como tu script.

source: The following packages can help with the creation of console and GUI executables:
es_es: Los siguientes paquetes pueden ayudar a crear ejecutables de consola y GUI:

source: `Nuitka <https://nuitka.net/>`_ (Cross-platform)
es_es: `Nuitka <https://nuitka.net/>`_ (Multiplataforma)

source: `PyInstaller <https://pyinstaller.org/>`_ (Cross-platform)
es_es: `PyInstaller <https://pyinstaller.org/>`_ (Multiplataforma)

source: `PyOxidizer <https://pyoxidizer.readthedocs.io/en/stable/>`_ (Cross-platform)
es_es: `PyOxidizer <https://pyoxidizer.readthedocs.io/en/stable/>`_ (Multiplataforma)

source: `cx_Freeze <https://marcelotduarte.github.io/cx_Freeze/>`_ (Cross-platform)
es_es: `cx_Freeze <https://marcelotduarte.github.io/cx_Freeze/>`_ (Multiplataforma)

source: `py2app <https://github.com/ronaldoussoren/py2app>`_ (macOS only)
es_es: `py2app <https://github.com/ronaldoussoren/py2app>`_ (sólo para macOS)

source: `py2exe <https://www.py2exe.org/>`_ (Windows only)
es_es: `py2exe <https://www.py2exe.org/>`_ (sólo Windows)

source: Are there coding standards or a style guide for Python programs?
es_es: ¿Existen normas de codificación o una guía de estilo para los programas en Python?

source: Yes. The coding style required for standard library modules is documented as :pep:`8`.
es_es: Sí. El estilo de codificación requerido para los módulos de la biblioteca estándar está documentado como :pep:`8`.

source: Core Language
es_es: Lengua básica

source: Why am I getting an UnboundLocalError when the variable has a value?
es_es: ¿Por qué recibo un UnboundLocalError cuando la variable tiene un valor?

source: It can be a surprise to get the :exc:`UnboundLocalError` in previously working code when it is modified by adding an assignment statement somewhere in the body of a function.
es_es: Puede ser una sorpresa obtener el :exc:`UnboundLocalError` en código que funcionaba previamente cuando se modifica añadiendo una sentencia de asignación en algún lugar del cuerpo de una función.

source: This code:
es_es: Este código:

source: works, but this code:
es_es: funciona, pero este código:

source: results in an :exc:`!UnboundLocalError`:
es_es: resulta en un :exc:`!UnboundLocalError`:

source: This is because when you make an assignment to a variable in a scope, that variable becomes local to that scope and shadows any similarly named variable in the outer scope. Since the last statement in foo assigns a new value to ``x``, the compiler recognizes it as a local variable. Consequently when the earlier ``print(x)`` attempts to print the uninitialized local variable and an error results.
es_es: Esto es porque cuando haces una asignación a una variable en un ámbito, esa variable se convierte en local para ese ámbito y hace sombra a cualquier variable de nombre similar en el ámbito externo. Como la última sentencia de foo asigna un nuevo valor a ``x``, el compilador la reconoce como una variable local. En consecuencia, cuando el anterior ``print(x)`` intenta imprimir la variable local no inicializada y se produce un error.

source: In the example above you can access the outer scope variable by declaring it global:
es_es: En el ejemplo anterior puedes acceder a la variable de ámbito externo declarándola global:

source: This explicit declaration is required in order to remind you that (unlike the superficially analogous situation with class and instance variables) you are actually modifying the value of the variable in the outer scope:
es_es: Esta declaración explícita es necesaria para recordarle que (a diferencia de la situación superficialmente análoga con las variables de clase y de instancia) en realidad está modificando el valor de la variable en el ámbito externo:

source: You can do a similar thing in a nested scope using the :keyword:`nonlocal` keyword:
es_es: Puede hacer algo similar en un ámbito anidado utilizando la palabra clave :keyword:`nonlocal`:

source: What are the rules for local and global variables in Python?
es_es: ¿Cuáles son las reglas para las variables locales y globales en Python?

source: In Python, variables that are only referenced inside a function are implicitly global. If a variable is assigned a value anywhere within the function's body, it's assumed to be a local unless explicitly declared as global.
es_es: En Python, las variables a las que sólo se hace referencia dentro de una función son implícitamente globales. Si a una variable se le asigna un valor en cualquier lugar dentro del cuerpo de la función, se asume que es local a menos que se declare explícitamente como global.

source: Though a bit surprising at first, a moment's consideration explains this. On one hand, requiring :keyword:`global` for assigned variables provides a bar against unintended side-effects. On the other hand, if ``global`` was required for all global references, you'd be using ``global`` all the time. You'd have to declare as global every reference to a built-in function or to a component of an imported module. This clutter would defeat the usefulness of the ``global`` declaration for identifying side-effects.
es_es: Aunque a primera vista resulte un poco sorprendente, un momento de reflexión lo explica. Por un lado, requerir :keyword:`global` para las variables asignadas proporciona una barrera contra efectos secundarios no deseados. Por otro lado, si se exigiera ``global`` para todas las referencias globales, se estaría utilizando ``global`` todo el tiempo. Tendrías que declarar como global cada referencia a una función incorporada o a un componente de un módulo importado. Este desorden anularía la utilidad de la declaración ``global`` para identificar efectos secundarios.

source: Why do lambdas defined in a loop with different values all return the same result?
es_es: ¿Por qué las lambdas definidas en un bucle con valores diferentes devuelven todas el mismo resultado?

source: Assume you use a for loop to define a few different lambdas (or even plain functions), e.g.::
es_es: Supongamos que utiliza un bucle for para definir varias lambdas diferentes (o incluso funciones simples), por ejemplo::

source: This gives you a list that contains 5 lambdas that calculate ``x**2``. You might expect that, when called, they would return, respectively, ``0``, ``1``, ``4``, ``9``, and ``16``. However, when you actually try you will see that they all return ``16``::
es_es: Esto le da una lista que contiene 5 lambdas que calculan ``x**2``. Podrías esperar que, al llamarlas, devolvieran, respectivamente, ``0``, ``1``, ``4``, ``9``, y ``16``. Sin embargo, cuando lo intentes verás que todas devuelven ``16``::

source: This happens because ``x`` is not local to the lambdas, but is defined in the outer scope, and it is accessed when the lambda is called --- not when it is defined. At the end of the loop, the value of ``x`` is ``4``, so all the functions now return ``4**2``, i.e. ``16``. You can also verify this by changing the value of ``x`` and see how the results of the lambdas change::
es_es: Esto ocurre porque ``x`` no es local a las lambdas, sino que está definido en el ámbito externo, y se accede a él cuando se llama a la lambda --- no cuando se define. Al final del bucle, el valor de ``x`` es ``4``, por lo que ahora todas las funciones devuelven ``4**2``, es decir ``16``. También puedes comprobarlo cambiando el valor de ``x`` y ver cómo cambian los resultados de las lambdas::

source: In order to avoid this, you need to save the values in variables local to the lambdas, so that they don't rely on the value of the global ``x``::
es_es: Para evitar esto, es necesario guardar los valores en variables locales a las lambdas, para que no dependan del valor de la global ``x``::

source: Here, ``n=x`` creates a new variable ``n`` local to the lambda and computed when the lambda is defined so that it has the same value that ``x`` had at that point in the loop. This means that the value of ``n`` will be ``0`` in the first lambda, ``1`` in the second, ``2`` in the third, and so on. Therefore each lambda will now return the correct result::
es_es: Aquí, ``n=x`` crea una nueva variable ``n`` local a la lambda y computada cuando se define la lambda para que tenga el mismo valor que ``x`` tenía en ese punto del bucle. Esto significa que el valor de ``n`` será ``0`` en la primera lambda, ``1`` en la segunda, ``2`` en la tercera, y así sucesivamente. Por lo tanto cada lambda devolverá ahora el resultado correcto::

source: Note that this behaviour is not peculiar to lambdas, but applies to regular functions too.
es_es: Tenga en cuenta que este comportamiento no es propio de las lambdas, sino que también se aplica a las funciones normales.

source: How do I share global variables across modules?
es_es: ¿Cómo comparto variables globales entre módulos?

source: The canonical way to share information across modules within a single program is to create a special module (often called config or cfg). Just import the config module in all modules of your application; the module then becomes available as a global name. Because there is only one instance of each module, any changes made to the module object get reflected everywhere. For example:
es_es: La forma canónica de compartir información entre módulos dentro de un mismo programa es crear un módulo especial (a menudo llamado config o cfg). Sólo tienes que importar el módulo config en todos los módulos de tu aplicación; el módulo pasa entonces a estar disponible como nombre global. Dado que sólo hay una instancia de cada módulo, cualquier cambio realizado en el objeto del módulo se refleja en todas partes. Por ejemplo:

source: Note that using a module is also the basis for implementing the singleton design pattern, for the same reason.
es_es: Tenga en cuenta que el uso de un módulo es también la base para implementar el patrón de diseño singleton, por la misma razón.

source: What are the "best practices" for using import in a module?
es_es: ¿Cuáles son las "mejores prácticas" para utilizar la importación en un módulo?

source: In general, don't use ``from modulename import *``. Doing so clutters the importer's namespace, and makes it much harder for linters to detect undefined names.
es_es: En general, no utilice ``from modulename import *``. Si lo haces, el espacio de nombres del importador se verá saturado y será mucho más difícil para los analizadores detectar nombres indefinidos.

source: Import modules at the top of a file. Doing so makes it clear what other modules your code requires and avoids questions of whether the module name is in scope. Using one import per line makes it easy to add and delete module imports, but using multiple imports per line uses less screen space.
es_es: Importe módulos al principio de un archivo. De este modo, queda claro qué otros módulos necesita el código y se evitan las dudas sobre si el nombre del módulo está dentro del ámbito. Utilizar una importación por línea facilita añadir y eliminar importaciones de módulos, pero utilizar varias importaciones por línea ocupa menos espacio en pantalla.

source: It's good practice if you import modules in the following order:
es_es: Es una buena práctica importar los módulos en el siguiente orden:

source: standard library modules -- e.g. :mod:`sys`, :mod:`os`, :mod:`argparse`, :mod:`re`
es_es: módulos de biblioteca estándar -- por ejemplo :mod:`sys`, :mod:`os`, :mod:`argparse`, :mod:`re`

source: third-party library modules (anything installed in Python's site-packages directory) -- e.g. :mod:`!dateutil`, :mod:`!requests`, :mod:`!PIL.Image`
es_es: módulos de bibliotecas de terceros (cualquier cosa instalada en el directorio site-packages de Python) -- por ejemplo :mod:`!dateutil`, :mod:`!requests`, :mod:`!PIL.Image`

source: locally developed modules
es_es: módulos desarrollados localmente

source: It is sometimes necessary to move imports to a function or class to avoid problems with circular imports. Gordon McMillan says:
es_es: A veces es necesario mover las importaciones a una función o clase para evitar problemas con las importaciones circulares. Gordon McMillan dice:

source: Circular imports are fine where both modules use the "import <module>" form of import. They fail when the 2nd module wants to grab a name out of the first ("from module import name") and the import is at the top level. That's because names in the 1st are not yet available, because the first module is busy importing the 2nd.
es_es: Las importaciones circulares están bien cuando ambos módulos utilizan la forma de importación "import <module>". Fallan cuando el 2º módulo quiere coger un nombre del primero ("from module import name") y la importación está en el nivel superior. Esto se debe a que los nombres en el 1er módulo aún no están disponibles, porque el primer módulo está ocupado importando el segundo.

source: In this case, if the second module is only used in one function, then the import can easily be moved into that function. By the time the import is called, the first module will have finished initializing, and the second module can do its import.
es_es: En este caso, si el segundo módulo sólo se utiliza en una función, entonces la importación se puede mover fácilmente a esa función. En el momento en que se llama a la importación, el primer módulo habrá terminado de inicializarse, y el segundo módulo puede hacer su importación.

source: It may also be necessary to move imports out of the top level of code if some of the modules are platform-specific. In that case, it may not even be possible to import all of the modules at the top of the file. In this case, importing the correct modules in the corresponding platform-specific code is a good option.
es_es: También puede ser necesario mover las importaciones fuera del nivel superior de código si algunos de los módulos son específicos de la plataforma. En ese caso, puede que ni siquiera sea posible importar todos los módulos en la parte superior del archivo. En este caso, importar los módulos correctos en el código específico de la plataforma correspondiente es una buena opción.

source: Only move imports into a local scope, such as inside a function definition, if it's necessary to solve a problem such as avoiding a circular import or are trying to reduce the initialization time of a module. This technique is especially helpful if many of the imports are unnecessary depending on how the program executes. You may also want to move imports into a function if the modules are only ever used in that function. Note that loading a module the first time may be expensive because of the one time initialization of the module, but loading a module multiple times is virtually free, costing only a couple of dictionary lookups. Even if the module name has gone out of scope, the module is probably available in :data:`sys.modules`.
es_es: Sólo mueva las importaciones a un ámbito local, como dentro de una definición de función, si es necesario para resolver un problema como evitar una importación circular o si está intentando reducir el tiempo de inicialización de un módulo. Esta técnica es especialmente útil si muchas de las importaciones son innecesarias dependiendo de cómo se ejecute el programa. También es posible que desee mover las importaciones a una función si los módulos sólo se utilizan en esa función. Tenga en cuenta que cargar un módulo la primera vez puede ser costoso debido a la inicialización única del módulo, pero cargar un módulo varias veces es prácticamente gratis, costando sólo un par de búsquedas en el diccionario. Incluso si el nombre del módulo ha salido del ámbito, el módulo está probablemente disponible en :data:`sys.modules`.

source: Why are default values shared between objects?
es_es: ¿Por qué se comparten valores por defecto entre objetos?

source: This type of bug commonly bites neophyte programmers. Consider this function::
es_es: Este tipo de error suele afectar a los programadores neófitos. Considere esta función::

source: The first time you call this function, ``mydict`` contains a single item. The second time, ``mydict`` contains two items because when ``foo()`` begins executing, ``mydict`` starts out with an item already in it.
es_es: La primera vez que se llama a esta función, ``mydict`` contiene un único elemento. La segunda vez, ``mydict`` contiene dos elementos porque cuando ``foo()`` comienza a ejecutarse, ``mydict`` comienza con un elemento ya en él.
