Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/faq/programming.po
Languages: es_es

source: There are few real use cases for ``i % j`` when ``j`` is negative. When ``j`` is positive, there are many, and in virtually all of them it's more useful for ``i % j`` to be ``>= 0``. If the clock says 10 now, what did it say 200 hours ago? ``-190 % 12 == 2`` is useful; ``-190 % 12 == -10`` is a bug waiting to bite.
es_es: Hay pocos casos reales de uso de ``i % j`` cuando ``j`` es negativo. Cuando ``j`` es positivo, hay muchos, y en prácticamente todos ellos es más útil que ``i % j`` sea``>= 0``. Si el reloj marca las 10 ahora, ¿qué marcaba hace 200 horas? ``-190 % 12 == 2`` es útil; ``-190 % 12 == -10`` es un bug a punto de picar.

source: How do I get int literal attribute instead of SyntaxError?
es_es: ¿Cómo puedo obtener el atributo int literal en lugar de SyntaxError?

source: Trying to lookup an ``int`` literal attribute in the normal manner gives a :exc:`SyntaxError` because the period is seen as a decimal point::
es_es: Si se intenta buscar un atributo literal ``int`` de la forma habitual, se obtiene :exc:`SyntaxError` porque el punto se considera un punto decimal::

source: The solution is to separate the literal from the period with either a space or parentheses.
es_es: La solución es separar el literal del punto con un espacio o un paréntesis.

source: How do I convert a string to a number?
es_es: ¿Cómo convierto una cadena en un número?

source: For integers, use the built-in :func:`int` type constructor, e.g. ``int('144') == 144``. Similarly, :func:`float` converts to floating-point, e.g. ``float('144') == 144.0``.
es_es: Para números enteros, utilice el constructor de tipo incorporado :func:`int`, por ejemplo ``int('144') == 144``. Del mismo modo, :func:`float` convierte a coma flotante, por ejemplo ``float('144') == 144.0``.

source: By default, these interpret the number as decimal, so that ``int('0144') == 144`` holds true, and ``int('0x144')`` raises :exc:`ValueError`. ``int(string, base)`` takes the base to convert from as a second optional argument, so ``int( '0x144', 16) == 324``. If the base is specified as 0, the number is interpreted using Python's rules: a leading '0o' indicates octal, and '0x' indicates a hex number.
es_es: Por defecto, estos interpretan el número como decimal, por lo que ``int('0144') == 144`` es verdadero, y ``int('0x144')`` eleva :exc:`ValueError`. ``int(string, base)`` toma la base de la que convertir como un segundo argumento opcional, por lo que ``int( '0x144', 16) == 324``. Si la base se especifica como 0, el número se interpreta utilizando las reglas de Python: un '0o' inicial indica octal, y '0x' indica un número hexadecimal.

source: Do not use the built-in function :func:`eval` if all you need is to convert strings to numbers. :func:`eval` will be significantly slower and it presents a security risk: someone could pass you a Python expression that might have unwanted side effects. For example, someone could pass ``__import__('os').system("rm -rf $HOME")`` which would erase your home directory.
es_es: No utilice la función incorporada :func:`eval` si todo lo que necesita es convertir cadenas a números. :func:`eval` será significativamente más lenta y presenta un riesgo de seguridad: alguien podría pasarle una expresión Python que podría tener efectos secundarios no deseados. Por ejemplo, alguien podría pasar ``__import__('os').system("rm -rf $HOME")`` que borraría tu directorio personal.

source: :func:`eval` also has the effect of interpreting numbers as Python expressions, so that e.g. ``eval('09')`` gives a syntax error because Python does not allow leading '0' in a decimal number (except '0').
es_es: :func:`eval` también tiene el efecto de interpretar los números como expresiones de Python, de modo que, por ejemplo, ``eval('09')`` da un error de sintaxis porque Python no permite el '0' inicial en un número decimal (excepto '0').

source: How do I convert a number to a string?
es_es: ¿Cómo convierto un número en una cadena?

source: To convert, e.g., the number ``144`` to the string ``'144'``, use the built-in type constructor :func:`str`. If you want a hexadecimal or octal representation, use the built-in functions :func:`hex` or :func:`oct`. For fancy formatting, see the :ref:`f-strings` and :ref:`formatstrings` sections, e.g. ``"{:04d}".format(144)`` yields ``'0144'`` and ``"{:.3f}".format(1.0/3.0)`` yields ``'0.333'``.
es_es: Para convertir, por ejemplo, el número ``144`` en la cadena ``'144'``, utilice el constructor de tipos incorporado :func:`str`. Si desea una representación hexadecimal u octal, utilice las funciones integradas :func:`hex` o :func:`oct`. Para obtener un formato de fantasía, consulte las secciones :ref:`f-strings` y :ref:`formatstrings`; por ejemplo, ``"{:04d}".format(144)`` produce ``'0144'`` y ``"{:.3f}".format(1.0/3.0)`` produce ``'0.333'``.

source: How do I modify a string in place?
es_es: ¿Cómo se modifica una cadena in situ?

source: You can't, because strings are immutable. In most situations, you should simply construct a new string from the various parts you want to assemble it from. However, if you need an object with the ability to modify in-place unicode data, try using an :class:`io.StringIO` object or the :mod:`array` module::
es_es: No puede, porque las cadenas son inmutables. En la mayoría de las situaciones, simplemente debe construir una nueva cadena a partir de las distintas partes con las que desea ensamblarla. Sin embargo, si necesitas un objeto con la capacidad de modificar datos unicode in situ, prueba a utilizar un objeto :class:`io.StringIO` o el módulo :mod:`array`::

source: How do I use strings to call functions/methods?
es_es: ¿Cómo puedo utilizar cadenas para llamar a funciones/métodos?

source: There are various techniques.
es_es: Existen varias técnicas.

source: The best is to use a dictionary that maps strings to functions. The primary advantage of this technique is that the strings do not need to match the names of the functions. This is also the primary technique used to emulate a case construct::
es_es: Lo mejor es utilizar un diccionario que asigne cadenas a funciones. La principal ventaja de esta técnica es que no es necesario que las cadenas coincidan con los nombres de las funciones. Esta es también la principal técnica utilizada para emular una construcción case::

source: Use the built-in function :func:`getattr`::
es_es: Utilice la función integrada :func:`getattr`::

source: Note that :func:`getattr` works on any object, including classes, class instances, modules, and so on.
es_es: Tenga en cuenta que :func:`getattr` funciona con cualquier objeto, incluidas clases, instancias de clases, módulos, etc.

source: This is used in several places in the standard library, like this::
es_es: Esto se utiliza en varios lugares en la biblioteca estándar, así::

source: Use :func:`locals` to resolve the function name::
es_es: Utilice :func:`locals` para resolver el nombre de la función::

source: Is there an equivalent to Perl's chomp() for removing trailing newlines from strings?
es_es: ¿Existe un equivalente a chomp() de Perl para eliminar las nuevas líneas finales de las cadenas?

source: You can use ``S.rstrip("\r\n")`` to remove all occurrences of any line terminator from the end of the string ``S`` without removing other trailing whitespace. If the string ``S`` represents more than one line, with several empty lines at the end, the line terminators for all the blank lines will be removed::
es_es: Puede utilizar ``S.rstrip("\r\n")`` para eliminar todas las apariciones de cualquier terminador de línea del final de la cadena ``S`` sin eliminar otros espacios en blanco finales. Si la cadena ``S`` representa más de una línea, con varias líneas vacías al final, se eliminarán los terminadores de línea de todas las líneas vacías::

source: Since this is typically only desired when reading text one line at a time, using ``S.rstrip()`` this way works well.
es_es: Dado que esto sólo suele ser deseable cuando se lee el texto línea por línea, el uso de ``S.rstrip()`` de esta forma funciona bien.

source: Is there a scanf() or sscanf() equivalent?
es_es: ¿Existe un equivalente de scanf() o sscanf()?

source: Not as such.
es_es: No como tal.

source: For simple input parsing, the easiest approach is usually to split the line into whitespace-delimited words using the :meth:`~str.split` method of string objects and then convert decimal strings to numeric values using :func:`int` or :func:`float`. :meth:`!split()` supports an optional "sep" parameter which is useful if the line uses something other than whitespace as a separator.
es_es: Para el análisis sintáctico simple de la entrada, lo más sencillo suele ser dividir la línea en palabras delimitadas por espacios en blanco mediante el método :meth:`~str.split` de objetos de cadena y, a continuación, convertir las cadenas decimales en valores numéricos mediante :func:`int` o :func:`float`. :meth:`!split()` admite un parámetro "sep" opcional que resulta útil si la línea utiliza algo distinto de espacios en blanco como separador.

source: For more complicated input parsing, regular expressions are more powerful than C's ``sscanf`` and better suited for the task.
es_es: Para el análisis sintáctico de entradas más complejas, las expresiones regulares son más potentes que ``sscanf`` de C y más adecuadas para esta tarea.

source: What does 'UnicodeDecodeError' or 'UnicodeEncodeError' error mean?
es_es: ¿Qué significa el error 'UnicodeDecodeError' o 'UnicodeEncodeError'?

source: See the :ref:`unicode-howto`.
es_es: Ver la página :ref:`unicode-howto`.

source: Can I end a raw string with an odd number of backslashes?
es_es: ¿Puedo terminar una cadena sin formato con un número impar de barras invertidas?

source: A raw string ending with an odd number of backslashes will escape the string's quote::
es_es: Una cadena sin procesar que termine con un número impar de barras invertidas escapará de las comillas de la cadena::

source: There are several workarounds for this. One is to use regular strings and double the backslashes::
es_es: Existen varias soluciones. Una es utilizar cadenas normales y duplicar las barras invertidas::

source: Another is to concatenate a regular string containing an escaped backslash to the raw string::
es_es: Otra es concatenar una cadena regular que contenga una barra invertida escapada a la cadena sin procesar::

source: It is also possible to use :func:`os.path.join` to append a backslash on Windows::
es_es: También es posible utilizar :func:`os.path.join` para añadir una barra invertida en Windows::

source: Note that while a backslash will "escape" a quote for the purposes of determining where the raw string ends, no escaping occurs when interpreting the value of the raw string. That is, the backslash remains present in the value of the raw string::
es_es: Tenga en cuenta que aunque una barra invertida "escape" de una comilla para determinar dónde termina la cadena sin procesar, no se produce ningún escape al interpretar el valor de la cadena sin procesar. Es decir, la barra invertida sigue presente en el valor de la cadena sin procesar::

source: Also see the specification in the :ref:`language reference <strings>`.
es_es: Consulte también la especificación en :ref:`language reference <strings>`.

source: Performance
es_es: Rendimiento

source: My program is too slow. How do I speed it up?
es_es: Mi programa es demasiado lento. ¿Cómo puedo acelerarlo?

source: That's a tough one, in general. First, here are a list of things to remember before diving further:
es_es: Es difícil, en general. En primer lugar, he aquí una lista de cosas que hay que recordar antes de seguir buceando:

source: Performance characteristics vary across Python implementations. This FAQ focuses on :term:`CPython`.
es_es: Las características de rendimiento varían según las implementaciones de Python. Esta FAQ se centra en :term:`CPython`.

source: Behaviour can vary across operating systems, especially when talking about I/O or multi-threading.
es_es: El comportamiento puede variar de un sistema operativo a otro, especialmente cuando hablamos de E/S o multihilo.

source: You should always find the hot spots in your program *before* attempting to optimize any code (see the :mod:`profile` module).
es_es: Siempre debe encontrar los puntos calientes de su programa *antes* de intentar optimizar cualquier código (consulte el módulo :mod:`profile` ).

source: Writing benchmark scripts will allow you to iterate quickly when searching for improvements (see the :mod:`timeit` module).
es_es: Escribir scripts de benchmark le permitirá iterar rápidamente en la búsqueda de mejoras (consulte el módulo :mod:`timeit` ).

source: It is highly recommended to have good code coverage (through unit testing or any other technique) before potentially introducing regressions hidden in sophisticated optimizations.
es_es: Es muy recomendable tener una buena cobertura de código (mediante pruebas unitarias o cualquier otra técnica) antes de introducir potencialmente regresiones ocultas en optimizaciones sofisticadas.

source: That being said, there are many tricks to speed up Python code. Here are some general principles which go a long way towards reaching acceptable performance levels:
es_es: Dicho esto, existen muchos trucos para acelerar el código Python. He aquí algunos principios generales que contribuyen en gran medida a alcanzar niveles de rendimiento aceptables:

source: Making your algorithms faster (or changing to faster ones) can yield much larger benefits than trying to sprinkle micro-optimization tricks all over your code.
es_es: Hacer que sus algoritmos sean más rápidos (o cambiar a otros más rápidos) puede reportar beneficios mucho mayores que intentar espolvorear trucos de microoptimización por todo su código.

source: Use the right data structures. Study documentation for the :ref:`bltin-types` and the :mod:`collections` module.
es_es: Utilizar las estructuras de datos adecuadas. Estudia la documentación de los módulos :ref:`bltin-types` y :mod:`collections`.

source: When the standard library provides a primitive for doing something, it is likely (although not guaranteed) to be faster than any alternative you may come up with. This is doubly true for primitives written in C, such as builtins and some extension types. For example, be sure to use either the :meth:`list.sort` built-in method or the related :func:`sorted` function to do sorting (and see the :ref:`sortinghowto` for examples of moderately advanced usage).
es_es: Cuando la biblioteca estándar proporciona una primitiva para hacer algo, es probable (aunque no está garantizado) que sea más rápida que cualquier alternativa que se te ocurra. Esto es doblemente cierto para las primitivas escritas en C, como los builtins y algunos tipos de extensión. Por ejemplo, asegúrese de utilizar el método incorporado :meth:`list.sort` o la función relacionada :func:`sorted` para realizar la ordenación (y consulte :ref:`sortinghowto` para ver ejemplos de uso moderadamente avanzado).

source: Abstractions tend to create indirections and force the interpreter to work more. If the levels of indirection outweigh the amount of useful work done, your program will be slower. You should avoid excessive abstraction, especially under the form of tiny functions or methods (which are also often detrimental to readability).
es_es: Las abstracciones tienden a crear indirecciones y obligan al intérprete a trabajar más. Si los niveles de indirección superan la cantidad de trabajo útil realizado, tu programa será más lento. Debes evitar la abstracción excesiva, especialmente bajo la forma de funciones o métodos diminutos (que también suelen ser perjudiciales para la legibilidad).

source: If you have reached the limit of what pure Python can allow, there are tools to take you further away. For example, `Cython <https://cython.org>`_ can compile a slightly modified version of Python code into a C extension, and can be used on many different platforms. Cython can take advantage of compilation (and optional type annotations) to make your code significantly faster than when interpreted. If you are confident in your C programming skills, you can also :ref:`write a C extension module <extending-index>` yourself.
es_es: Si has llegado al límite de lo que Python puro puede permitirte, existen herramientas para llevarte más lejos. Por ejemplo, `Cython <https://cython.org>`_ puede compilar una versión ligeramente modificada del código Python en una extensión C, y puede utilizarse en muchas plataformas diferentes. Cython puede aprovechar la compilación (y las anotaciones de tipo opcionales) para hacer que tu código sea significativamente más rápido que cuando se interpreta. Si tiene confianza en sus habilidades de programación en C, también puede :ref:`write a C extension module <extending-index>` usted mismo.

source: The wiki page devoted to `performance tips <https://wiki.python.org/moin/PythonSpeed/PerformanceTips>`_.
es_es: La página wiki dedicada a los `consejos de rendimiento <https://wiki.python.org/moin/PythonSpeed/PerformanceTips>`_.

source: What is the most efficient way to concatenate many strings together?
es_es: ¿Cuál es la forma más eficaz de concatenar varias cadenas?

source: :class:`str` and :class:`bytes` objects are immutable, therefore concatenating many strings together is inefficient as each concatenation creates a new object. In the general case, the total runtime cost is quadratic in the total string length.
es_es: :class:`str` y :class:`bytes` son inmutables, por lo que concatenar muchas cadenas es ineficiente, ya que cada concatenación crea un nuevo objeto. En el caso general, el coste total del tiempo de ejecución es cuadrático en la longitud total de la cadena.

source: To accumulate many :class:`str` objects, the recommended idiom is to place them into a list and call :meth:`str.join` at the end::
es_es: Para acumular muchos objetos :class:`str`, lo recomendable es colocarlos en una lista y llamar a :meth:`str.join` al final::

source: (another reasonably efficient idiom is to use :class:`io.StringIO`)
es_es: (otro modismo razonablemente eficaz es utilizar :class:`io.StringIO`)

source: To accumulate many :class:`bytes` objects, the recommended idiom is to extend a :class:`bytearray` object using in-place concatenation (the ``+=`` operator)::
es_es: Para acumular muchos objetos :class:`bytes`, el lenguaje recomendado es ampliar un objeto :class:`bytearray` utilizando la concatenación en el lugar (el operador ``+=`` )::

source: Sequences (Tuples/Lists)
es_es: Secuencias (tuplas/listas)

source: How do I convert between tuples and lists?
es_es: ¿Cómo convierto entre tuplas y listas?

source: The type constructor ``tuple(seq)`` converts any sequence (actually, any iterable) into a tuple with the same items in the same order.
es_es: El constructor de tipo ``tuple(seq)`` convierte cualquier secuencia (en realidad, cualquier iterable) en una tupla con los mismos elementos en el mismo orden.

source: For example, ``tuple([1, 2, 3])`` yields ``(1, 2, 3)`` and ``tuple('abc')`` yields ``('a', 'b', 'c')``. If the argument is a tuple, it does not make a copy but returns the same object, so it is cheap to call :func:`tuple` when you aren't sure that an object is already a tuple.
es_es: Por ejemplo, ``tuple([1, 2, 3])`` devuelve ``(1, 2, 3)`` y ``tuple('abc')`` devuelve ``('a', 'b', 'c')``. Si el argumento es una tupla, no hace una copia sino que devuelve el mismo objeto, por lo que es barato llamar a :func:`tuple` cuando no se está seguro de que un objeto sea ya una tupla.

source: The type constructor ``list(seq)`` converts any sequence or iterable into a list with the same items in the same order. For example, ``list((1, 2, 3))`` yields ``[1, 2, 3]`` and ``list('abc')`` yields ``['a', 'b', 'c']``. If the argument is a list, it makes a copy just like ``seq[:]`` would.
es_es: El constructor de tipo ``list(seq)`` convierte cualquier secuencia o iterable en una lista con los mismos elementos en el mismo orden. Por ejemplo, ``list((1, 2, 3))`` produce ``[1, 2, 3]`` y ``list('abc')`` produce ``['a', 'b', 'c']``. Si el argumento es una lista, hace una copia igual que ``seq[:]``.

source: What's a negative index?
es_es: ¿Qué es un índice negativo?

source: Python sequences are indexed with positive numbers and negative numbers. For positive numbers 0 is the first index 1 is the second index and so forth. For negative indices -1 is the last index and -2 is the penultimate (next to last) index and so forth. Think of ``seq[-n]`` as the same as ``seq[len(seq)-n]``.
es_es: Las secuencias de Python se indexan con números positivos y negativos. Para números positivos 0 es el primer índice 1 es el segundo índice y así sucesivamente. Para índices negativos -1 es el último índice y -2 es el penúltimo (penúltimo) índice y así sucesivamente. Piense que ``seq[-n]`` es lo mismo que ``seq[len(seq)-n]``.

source: Using negative indices can be very convenient. For example ``S[:-1]`` is all of the string except for its last character, which is useful for removing the trailing newline from a string.
es_es: El uso de índices negativos puede resultar muy práctico. Por ejemplo, ``S[:-1]`` es toda la cadena excepto su último carácter, lo que resulta útil para eliminar la última línea de una cadena.

source: How do I iterate over a sequence in reverse order?
es_es: ¿Cómo itero sobre una secuencia en orden inverso?

source: Use the :func:`reversed` built-in function::
es_es: Utilice la función integrada :func:`reversed`::

source: This won't touch your original sequence, but build a new copy with reversed order to iterate over.
es_es: Esto no tocará tu secuencia original, sino que construirá una nueva copia con el orden invertido para iterar sobre ella.

source: How do you remove duplicates from a list?
es_es: ¿Cómo se eliminan los duplicados de una lista?

source: See the Python Cookbook for a long discussion of many ways to do this:
es_es: Consulte el Python Cookbook para una larga discusión de muchas maneras de hacer esto:

source: If you don't mind reordering the list, sort it and then scan from the end of the list, deleting duplicates as you go::
es_es: Si no te importa reordenar la lista, ordénala y luego escanea desde el final de la lista, eliminando los duplicados a medida que avanzas::

source: If all elements of the list may be used as set keys (i.e. they are all :term:`hashable`) this is often faster ::
es_es: Si todos los elementos de la lista pueden utilizarse como claves del conjunto (es decir, si todos son :term:`hashable`) esto suele ser más rápido ::

source: This converts the list into a set, thereby removing duplicates, and then back into a list.
es_es: Esto convierte la lista en un conjunto, eliminando así los duplicados, y luego de nuevo en una lista.

source: How do you remove multiple items from a list
es_es: Cómo eliminar varios elementos de una lista

source: As with removing duplicates, explicitly iterating in reverse with a delete condition is one possibility. However, it is easier and faster to use slice replacement with an implicit or explicit forward iteration. Here are three variations.::
es_es: Al igual que con la eliminación de duplicados, una posibilidad es iterar explícitamente en sentido inverso con una condición de borrado. Sin embargo, es más fácil y rápido utilizar el reemplazo de trozos con una iteración hacia delante implícita o explícita. He aquí tres variaciones::

source: The list comprehension may be fastest.
es_es: La comprensión de la lista puede ser más rápida.

source: How do you make an array in Python?
es_es: ¿Cómo se forma un array en Python?

source: Use a list::
es_es: Utiliza una lista::
