Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/faq/programming.po
Languages: es_es

source: Variable names with double leading underscores are "mangled" to provide a simple but effective way to define class private variables. Any identifier of the form ``__spam`` (at least two leading underscores, at most one trailing underscore) is textually replaced with ``_classname__spam``, where ``classname`` is the current class name with any leading underscores stripped.
es_es: Los nombres de variables con doble guión bajo inicial se "manipulan" para proporcionar una forma simple pero eficaz de definir variables privadas de clase. Cualquier identificador de la forma ``__spam`` (al menos dos guiones bajos iniciales, como máximo un guión bajo final) se sustituye textualmente por ``_classname__spam``, donde ``classname`` es el nombre de la clase actual sin los guiones bajos iniciales.

source: This doesn't guarantee privacy: an outside user can still deliberately access the "_classname__spam" attribute, and private values are visible in the object's ``__dict__``. Many Python programmers never bother to use private variable names at all.
es_es: Esto no garantiza la privacidad: un usuario externo todavía puede acceder deliberadamente al atributo "_classname__spam", y los valores privados son visibles en el objeto ``__dict__``. Muchos programadores de Python nunca se molestan en utilizar nombres de variables privadas.

source: My class defines __del__ but it is not called when I delete the object.
es_es: Mi clase define __del__ pero no se llama cuando borro el objeto.

source: There are several possible reasons for this.
es_es: Hay varias razones posibles para ello.

source: The :keyword:`del` statement does not necessarily call :meth:`~object.__del__` -- it simply decrements the object's reference count, and if this reaches zero :meth:`!__del__` is called.
es_es: La sentencia :keyword:`del` no llama necesariamente a :meth:`~object.__del__` -- simplemente decrementa la cuenta de referencias del objeto, y si ésta llega a cero se llama a :meth:`!__del__`.

source: If your data structures contain circular links (e.g. a tree where each child has a parent reference and each parent has a list of children) the reference counts will never go back to zero. Once in a while Python runs an algorithm to detect such cycles, but the garbage collector might run some time after the last reference to your data structure vanishes, so your :meth:`!__del__` method may be called at an inconvenient and random time. This is inconvenient if you're trying to reproduce a problem. Worse, the order in which object's :meth:`!__del__` methods are executed is arbitrary. You can run :func:`gc.collect` to force a collection, but there *are* pathological cases where objects will never be collected.
es_es: Si tus estructuras de datos contienen enlaces circulares (por ejemplo, un árbol donde cada hijo tiene una referencia padre y cada padre tiene una lista de hijos) los recuentos de referencias nunca volverán a cero. De vez en cuando Python ejecuta un algoritmo para detectar tales ciclos, pero el recolector de basura puede ejecutarse algún tiempo después de que la última referencia a tu estructura de datos desaparezca, por lo que tu método :meth:`!__del__` puede ser llamado en un momento inconveniente y aleatorio. Esto es inconveniente si estás intentando reproducir un problema. Peor aún, el orden en que se ejecutan los métodos :meth:`!__del__` del objeto es arbitrario. Puedes ejecutar :func:`gc.collect` para forzar una recolección, pero *hay* casos patológicos en los que los objetos nunca serán recolectados.

source: Despite the cycle collector, it's still a good idea to define an explicit ``close()`` method on objects to be called whenever you're done with them. The ``close()`` method can then remove attributes that refer to subobjects. Don't call :meth:`!__del__` directly -- :meth:`!__del__` should call ``close()`` and ``close()`` should make sure that it can be called more than once for the same object.
es_es: A pesar del colector de ciclos, sigue siendo una buena idea definir un método ``close()`` explícito en los objetos para que se llame a él siempre que se haya terminado con ellos. El método ``close()`` puede entonces eliminar atributos que hagan referencia a subobjetos. No llames a :meth:`!__del__` directamente -- :meth:`!__del__` debe llamar a ``close()`` y ``close()`` debe asegurarse de que puede ser llamado más de una vez para el mismo objeto.

source: Another way to avoid cyclical references is to use the :mod:`weakref` module, which allows you to point to objects without incrementing their reference count. Tree data structures, for instance, should use weak references for their parent and sibling references (if they need them!).
es_es: Otra forma de evitar las referencias cíclicas es utilizar el módulo :mod:`weakref`, que permite apuntar a objetos sin incrementar su número de referencias. Las estructuras de datos en árbol, por ejemplo, deberían utilizar referencias débiles para sus referencias a padres y hermanos (¡si las necesitan!).

source: Finally, if your :meth:`!__del__` method raises an exception, a warning message is printed to :data:`sys.stderr`.
es_es: Por último, si el método :meth:`!__del__` genera una excepción, se imprime un mensaje de advertencia en :data:`sys.stderr`.

source: How do I get a list of all instances of a given class?
es_es: ¿Cómo puedo obtener una lista de todas las instancias de una clase determinada?

source: Python does not keep track of all instances of a class (or of a built-in type). You can program the class's constructor to keep track of all instances by keeping a list of weak references to each instance.
es_es: Python no mantiene un registro de todas las instancias de una clase (o de un tipo incorporado). Puedes programar el constructor de la clase para que lleve la cuenta de todas las instancias manteniendo una lista de referencias débiles a cada instancia.

source: Why does the result of ``id()`` appear to be not unique?
es_es: ¿Por qué parece que el resultado de ``id()`` no es único?

source: The :func:`id` builtin returns an integer that is guaranteed to be unique during the lifetime of the object. Since in CPython, this is the object's memory address, it happens frequently that after an object is deleted from memory, the next freshly created object is allocated at the same position in memory. This is illustrated by this example:
es_es: El builtin :func:`id` devuelve un entero que se garantiza que es único durante la vida del objeto. Como en CPython, esta es la dirección de memoria del objeto, ocurre frecuentemente que después de que un objeto es borrado de la memoria, el siguiente objeto recién creado es asignado en la misma posición en la memoria. Esto se ilustra con este ejemplo:

source: The two ids belong to different integer objects that are created before, and deleted immediately after execution of the ``id()`` call. To be sure that objects whose id you want to examine are still alive, create another reference to the object:
es_es: Los dos ids pertenecen a objetos enteros diferentes que se crean antes, y se borran inmediatamente después de la ejecución de la llamada a ``id()``. Para asegurarse de que los objetos cuyo id desea examinar siguen vivos, cree otra referencia al objeto:

source: When can I rely on identity tests with the *is* operator?
es_es: ¿Cuándo puedo confiar en las pruebas de identidad con el operador *is*?

source: The ``is`` operator tests for object identity. The test ``a is b`` is equivalent to ``id(a) == id(b)``.
es_es: El operador ``is`` comprueba la identidad del objeto. La prueba ``a is b`` es equivalente a ``id(a) == id(b)``.

source: The most important property of an identity test is that an object is always identical to itself, ``a is a`` always returns ``True``. Identity tests are usually faster than equality tests. And unlike equality tests, identity tests are guaranteed to return a boolean ``True`` or ``False``.
es_es: La propiedad más importante de una prueba de identidad es que un objeto siempre es idéntico a sí mismo, ``a is a`` siempre devuelve ``True``. Las pruebas de identidad suelen ser más rápidas que las pruebas de igualdad. Y a diferencia de las pruebas de igualdad, las pruebas de identidad tienen garantizado el retorno de un booleano ``True`` o ``False``.

source: However, identity tests can *only* be substituted for equality tests when object identity is assured. Generally, there are three circumstances where identity is guaranteed:
es_es: Sin embargo, las pruebas de identidad *sólo* pueden sustituir a las pruebas de igualdad cuando la identidad del objeto está garantizada. En general, hay tres circunstancias en las que la identidad está garantizada:

source: 1) Assignments create new names but do not change object identity. After the assignment ``new = old``, it is guaranteed that ``new is old``.
es_es: 1) Las asignaciones crean nuevos nombres pero no cambian la identidad de los objetos. Tras la asignación ``new = old``, se garantiza que ``new is old``.

source: 2) Putting an object in a container that stores object references does not change object identity. After the list assignment ``s[0] = x``, it is guaranteed that ``s[0] is x``.
es_es: 2) Colocar un objeto en un contenedor que almacena referencias a objetos no cambia la identidad del objeto. Tras la asignación de la lista ``s[0] = x``, se garantiza que ``s[0] is x``.

source: 3) If an object is a singleton, it means that only one instance of that object can exist. After the assignments ``a = None`` and ``b = None``, it is guaranteed that ``a is b`` because ``None`` is a singleton.
es_es: 3) Si un objeto es un singleton, significa que sólo puede existir una instancia de ese objeto. Después de las asignaciones ``a = None`` y ``b = None``, se garantiza que ``a is b`` porque ``None`` es un singleton.

source: In most other circumstances, identity tests are inadvisable and equality tests are preferred. In particular, identity tests should not be used to check constants such as :class:`int` and :class:`str` which aren't guaranteed to be singletons::
es_es: En la mayoría de las demás circunstancias, las pruebas de identidad son desaconsejables y se prefieren las pruebas de igualdad. En particular, las pruebas de identidad no deben utilizarse para comprobar constantes como :class:`int` y :class:`str`, que no se garantiza que sean unívocas::

source: Likewise, new instances of mutable containers are never identical::
es_es: Del mismo modo, las nuevas instancias de contenedores mutables nunca son idénticas::

source: In the standard library code, you will see several common patterns for correctly using identity tests:
es_es: En el código de la biblioteca estándar, verá varios patrones comunes para utilizar correctamente las pruebas de identidad:

source: 1) As recommended by :pep:`8`, an identity test is the preferred way to check for ``None``. This reads like plain English in code and avoids confusion with other objects that may have boolean values that evaluate to false.
es_es: 1) Tal y como recomienda :pep:`8`, una prueba de identidad es la forma preferida de comprobar ``None``. Esto se lee como inglés sencillo en el código y evita la confusión con otros objetos que pueden tener valores booleanos que se evalúan como falso.

source: 2) Detecting optional arguments can be tricky when ``None`` is a valid input value. In those situations, you can create a singleton sentinel object guaranteed to be distinct from other objects. For example, here is how to implement a method that behaves like :meth:`dict.pop`::
es_es: 2) La detección de argumentos opcionales puede ser complicada cuando ``None`` es un valor de entrada válido. En esas situaciones, puede crear un objeto centinela singleton que garantice que es distinto de otros objetos. Por ejemplo, así es como se implementa un método que se comporta como :meth:`dict.pop`::

source: 3) Container implementations sometimes need to augment equality tests with identity tests. This prevents the code from being confused by objects such as ``float('NaN')`` that are not equal to themselves.
es_es: 3) Las implementaciones de contenedores a veces necesitan aumentar las pruebas de igualdad con pruebas de identidad. Esto evita que el código se confunda con objetos como ``float('NaN')`` que no son iguales a sí mismos.

source: For example, here is the implementation of :meth:`collections.abc.Sequence.__contains__`::
es_es: Por ejemplo, aquí está la implementación de :meth:`collections.abc.Sequence.__contains__`::

source: How can a subclass control what data is stored in an immutable instance?
es_es: ¿Cómo puede una subclase controlar qué datos se almacenan en una instancia inmutable?

source: When subclassing an immutable type, override the :meth:`~object.__new__` method instead of the :meth:`~object.__init__` method. The latter only runs *after* an instance is created, which is too late to alter data in an immutable instance.
es_es: Al subclasificar un tipo inmutable, anule el método :meth:`~object.__new__` en lugar del método :meth:`~object.__init__`. Este último sólo se ejecuta *después* de que se crea una instancia, que es demasiado tarde para alterar los datos en una instancia inmutable.

source: All of these immutable classes have a different signature than their parent class:
es_es: Todas estas clases inmutables tienen una firma diferente a la de su clase padre:

source: The classes can be used like this:
es_es: Las clases pueden utilizarse así:

source: How do I cache method calls?
es_es: ¿Cómo se almacenan en caché las llamadas a métodos?

source: The two principal tools for caching methods are :func:`functools.cached_property` and :func:`functools.lru_cache`. The former stores results at the instance level and the latter at the class level.
es_es: Las dos herramientas principales para almacenar métodos en caché son :func:`functools.cached_property` y :func:`functools.lru_cache`. La primera almacena los resultados a nivel de instancia y la segunda a nivel de clase.

source: The *cached_property* approach only works with methods that do not take any arguments. It does not create a reference to the instance. The cached method result will be kept only as long as the instance is alive.
es_es: El método *cached_property* sólo funciona con métodos que no reciben argumentos. No crea una referencia a la instancia. El resultado del método almacenado en caché sólo se mantendrá mientras la instancia esté viva.

source: The advantage is that when an instance is no longer used, the cached method result will be released right away. The disadvantage is that if instances accumulate, so too will the accumulated method results. They can grow without bound.
es_es: La ventaja es que cuando una instancia deja de utilizarse, el resultado del método almacenado en caché se libera de inmediato. La desventaja es que si las instancias se acumulan, también lo harán los resultados de método acumulados. Pueden crecer sin límite.

source: The *lru_cache* approach works with methods that have :term:`hashable` arguments. It creates a reference to the instance unless special efforts are made to pass in weak references.
es_es: El enfoque *lru_cache* funciona con métodos que tienen argumentos :term:`hashable`. Crea una referencia a la instancia a menos que se hagan esfuerzos especiales para pasar referencias débiles.

source: The advantage of the least recently used algorithm is that the cache is bounded by the specified *maxsize*. The disadvantage is that instances are kept alive until they age out of the cache or until the cache is cleared.
es_es: La ventaja del algoritmo de uso menos reciente es que la caché está limitada por el *maxsize* especificado. La desventaja es que las instancias se mantienen vivas hasta que envejecen fuera de la caché o hasta que se borra la caché.

source: This example shows the various techniques::
es_es: Este ejemplo muestra las distintas técnicas::

source: The above example assumes that the *station_id* never changes. If the relevant instance attributes are mutable, the *cached_property* approach can't be made to work because it cannot detect changes to the attributes.
es_es: El ejemplo anterior asume que *station_id* nunca cambia. Si los atributos de instancia relevantes son mutables, el enfoque *cached_property* no puede funcionar porque no puede detectar cambios en los atributos.

source: The *lru_cache* approach can be made to work, but the class needs to define the *__eq__* and *__hash__* methods so the cache can detect relevant attribute updates::
es_es: El enfoque *lru_cache* puede funcionar, pero la clase debe definir los métodos *__eq__* y *__hash__* para que la caché pueda detectar las actualizaciones de atributos relevantes::

source: Modules
es_es: Módulos

source: How do I create a .pyc file?
es_es: ¿Cómo se crea un archivo .pyc?

source: When a module is imported for the first time (or when the source file has changed since the current compiled file was created) a ``.pyc`` file containing the compiled code should be created in a ``__pycache__`` subdirectory of the directory containing the ``.py`` file. The ``.pyc`` file will have a filename that starts with the same name as the ``.py`` file, and ends with ``.pyc``, with a middle component that depends on the particular ``python`` binary that created it. (See :pep:`3147` for details.)
es_es: Cuando se importa un módulo por primera vez (o cuando el archivo fuente ha cambiado desde que se creó el archivo compilado actual) debe crearse un archivo ``.pyc`` que contenga el código compilado en un subdirectorio ``__pycache__`` del directorio que contiene el archivo ``.py``. El archivo ``.pyc`` tendrá un nombre de archivo que comienza con el mismo nombre que el archivo ``.py``, y termina con ``.pyc``, con un componente intermedio que depende del binario ``python`` particular que lo creó. (Para más detalles, ver :pep:`3147`).

source: One reason that a ``.pyc`` file may not be created is a permissions problem with the directory containing the source file, meaning that the ``__pycache__`` subdirectory cannot be created. This can happen, for example, if you develop as one user but run as another, such as if you are testing with a web server.
es_es: Una de las razones por las que puede no crearse un archivo ``.pyc`` es un problema de permisos en el directorio que contiene el archivo fuente, lo que significa que no puede crearse el subdirectorio ``__pycache__``. Esto puede ocurrir, por ejemplo, si desarrollas como un usuario pero ejecutas como otro, como si estuvieras probando con un servidor web.

source: Unless the :envvar:`PYTHONDONTWRITEBYTECODE` environment variable is set, creation of a .pyc file is automatic if you're importing a module and Python has the ability (permissions, free space, etc...) to create a ``__pycache__`` subdirectory and write the compiled module to that subdirectory.
es_es: A menos que se establezca la variable de entorno :envvar:`PYTHONDONTWRITEBYTECODE`, la creación de un archivo .pyc es automática si estás importando un módulo y Python tiene la capacidad (permisos, espacio libre, etc...) de crear un subdirectorio ``__pycache__`` y escribir el módulo compilado en ese subdirectorio.

source: Running Python on a top level script is not considered an import and no ``.pyc`` will be created. For example, if you have a top-level module ``foo.py`` that imports another module ``xyz.py``, when you run ``foo`` (by typing ``python foo.py`` as a shell command), a ``.pyc`` will be created for ``xyz`` because ``xyz`` is imported, but no ``.pyc`` file will be created for ``foo`` since ``foo.py`` isn't being imported.
es_es: Ejecutar Python en un script de nivel superior no se considera una importación y no se creará ningún ``.pyc``. Por ejemplo, si tiene un módulo de nivel superior ``foo.py`` que importa otro módulo ``xyz.py``, cuando ejecute ``foo`` (escribiendo ``python foo.py`` como comando del shell), se creará un archivo ``.pyc`` para ``xyz`` porque se importa ``xyz``, pero no se creará ningún archivo ``.pyc`` para ``foo`` porque no se importa ``foo.py``.

source: If you need to create a ``.pyc`` file for ``foo`` -- that is, to create a ``.pyc`` file for a module that is not imported -- you can, using the :mod:`py_compile` and :mod:`compileall` modules.
es_es: Si necesita crear un archivo ``.pyc`` para ``foo`` -- es decir, crear un archivo ``.pyc`` para un módulo que no se importa -- puede hacerlo, utilizando los módulos :mod:`py_compile` y :mod:`compileall`.

source: The :mod:`py_compile` module can manually compile any module. One way is to use the ``compile()`` function in that module interactively::
es_es: El módulo :mod:`py_compile` puede compilar manualmente cualquier módulo. Una forma es utilizar la función ``compile()`` en ese módulo de forma interactiva::

source: This will write the ``.pyc`` to a ``__pycache__`` subdirectory in the same location as ``foo.py`` (or you can override that with the optional parameter ``cfile``).
es_es: Esto escribirá ``.pyc`` en un subdirectorio ``__pycache__`` en la misma ubicación que ``foo.py`` (o puede anularlo con el parámetro opcional ``cfile``).

source: You can also automatically compile all files in a directory or directories using the :mod:`compileall` module. You can do it from the shell prompt by running ``compileall.py`` and providing the path of a directory containing Python files to compile::
es_es: También puedes compilar automáticamente todos los archivos de un directorio o directorios utilizando el módulo :mod:`compileall`. Puede hacerlo desde el intérprete de comandos ejecutando ``compileall.py`` y proporcionando la ruta de un directorio que contenga archivos Python para compilar::

source: How do I find the current module name?
es_es: ¿Cómo encuentro el nombre del módulo actual?

source: A module can find out its own module name by looking at the predefined global variable ``__name__``. If this has the value ``'__main__'``, the program is running as a script. Many modules that are usually used by importing them also provide a command-line interface or a self-test, and only execute this code after checking ``__name__``::
es_es: Un módulo puede averiguar su propio nombre de módulo consultando la variable global predefinida ``__name__``. Si ésta tiene el valor ``'__main__'``, el programa se está ejecutando como un script. Muchos módulos que se suelen utilizar importándolos también proporcionan una interfaz de línea de comandos o una autocomprobación, y sólo ejecutan este código después de comprobar ``__name__``::

source: How can I have modules that mutually import each other?
es_es: ¿Cómo puedo tener módulos que se importen mutuamente?

source: Suppose you have the following modules:
es_es: Supongamos que tiene los siguientes módulos:

source: The problem is that the interpreter will perform the following steps:
es_es: El problema es que el intérprete realizará los siguientes pasos:

source: main imports ``foo``
es_es: principales importaciones ``foo``

source: Empty globals for ``foo`` are created
es_es: Se crean globales vacíos para ``foo``

source: ``foo`` is compiled and starts executing
es_es: ``foo`` se compila y comienza a ejecutarse

source: ``foo`` imports ``bar``
es_es: ``foo`` importaciones ``bar``

source: Empty globals for ``bar`` are created
es_es: Se crean globales vacíos para ``bar``

source: ``bar`` is compiled and starts executing
es_es: ``bar`` se compila y comienza a ejecutarse

source: ``bar`` imports ``foo`` (which is a no-op since there already is a module named ``foo``)
es_es: ``bar`` importa ``foo`` (que es un no-op puesto que ya existe un módulo llamado ``foo``)

source: The import mechanism tries to read ``foo_var`` from ``foo`` globals, to set ``bar.foo_var = foo.foo_var``
es_es: El mecanismo de importación intenta leer ``foo_var`` desde ``foo`` globals, para establecer ``bar.foo_var = foo.foo_var``
