Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/using/android.po
Languages: ru

source: Using Python on Android
ru: Использование Python на Android

source: Python on Android is unlike Python on desktop platforms. On a desktop platform, Python is generally installed as a system resource that can be used by any user of that computer. Users then interact with Python by running a :program:`python` executable and entering commands at an interactive prompt, or by running a Python script.
ru: Python на Android отличается от Python на настольных платформах. На настольной платформе Python обычно устанавливается как системный ресурс, который может использовать любой пользователь этого компьютера. Затем пользователи взаимодействуют с Python, запуская исполняемый файл :program:`python` и вводя команды в интерактивной подсказке или запуская скрипт Python.

source: On Android, there is no concept of installing as a system resource. The only unit of software distribution is an "app". There is also no console where you could run a :program:`python` executable, or interact with a Python REPL.
ru: На Android нет понятия установки как системного ресурса. Единственной единицей распространения программного обеспечения является «приложение». Также нет консоли, на которой вы могли бы запустить исполняемый файл :program:`python` или взаимодействовать с Python REPL.

source: As a result, the only way you can use Python on Android is in embedded mode – that is, by writing a native Android application, embedding a Python interpreter using ``libpython``, and invoking Python code using the :ref:`Python embedding API <embedding>`. The full Python interpreter, the standard library, and all your Python code is then packaged into your app for its own private use.
ru: В результате единственный способ использовать Python на Android — это встроенный режим, то есть написание собственного приложения для Android, встраивание интерпретатора Python с помощью libpython и вызов кода Python с помощью :ref:`Python. API встраивания <embedding>`. Полный интерпретатор Python, стандартная библиотека и весь ваш код Python затем упаковываются в ваше приложение для личного использования.

source: The Python standard library has some notable omissions and restrictions on Android. See the :ref:`API availability guide <mobile-availability>` for details.
ru: В стандартной библиотеке Python есть некоторые заметные упущения и ограничения для Android. Подробности см. в :ref:`Руководстве по доступности API <mobile-availability>`.

source: Adding Python to an Android app
ru: Добавление Python в приложение для Android

source: These instructions are only needed if you're planning to compile Python for Android yourself. Most users should *not* need to do this. Instead, use one of the following tools, which will provide a much easier experience:
ru: Эти инструкции необходимы только в том случае, если вы планируете самостоятельно скомпилировать Python для Android. Большинству пользователей *не* нужно это делать. Вместо этого используйте один из следующих инструментов, который значительно упростит работу:

source: `Briefcase <https://briefcase.readthedocs.io>`__, from the BeeWare project
ru: `Портфель <https://briefcase.readthedocs.io>`__, из проекта BeeWare

source: `Buildozer <https://buildozer.readthedocs.io>`__, from the Kivy project
ru: `Buildozer <https://buildozer.readthedocs.io>`__, из проекта Kivy

source: If you're sure you want to do all of this manually, read on. You can use the :source:`testbed app <Android/testbed>` as a guide; each step below contains a link to the relevant file.
ru: Если вы уверены, что хотите сделать все это вручную, читайте дальше. Вы можете использовать приложение :source:`testbed <Android/testbed>` в качестве руководства; каждый шаг ниже содержит ссылку на соответствующий файл.

source: Build Python by following the instructions in :source:`Android/README.md`.
ru: Соберите Python, следуя инструкциям в :source:`Android/README.md`.

source: Add code to your :source:`build.gradle <Android/testbed/app/build.gradle.kts>` file to copy the following items into your project. All except your own Python code can be copied from ``cross-build/HOST/prefix/lib``:
ru: Добавьте код в файл :source:`build.gradle <Android/testbed/app/build.gradle.kts>`, чтобы скопировать следующие элементы в ваш проект. Весь код Python, кроме вашего собственного, можно скопировать из ``cross-build/HOST/prefix/lib``:

source: In your JNI libraries:
ru: В ваших библиотеках JNI:

source: ``lib*_python.so`` (external libraries such as OpenSSL)
ru: ``lib*_python.so`` (внешние библиотеки, такие как OpenSSL)

source: In your assets:
ru: В ваших активах:

source: ``python*.*`` (the Python standard library)
ru: ``python*.*`` (стандартная библиотека Python)

source: ``python*.*/site-packages`` (your own Python code)
ru: ``python*.*/site-packages`` (ваш собственный код Python)

source: Add code to your app to :source:`extract the assets to the filesystem <Android/testbed/app/src/main/java/org/python/testbed/MainActivity.kt>`.
ru: Добавьте в свое приложение код, чтобы :source:`извлечь ресурсы в файловую систему <Android/testbed/app/src/main/java/org/python/testbed/MainActivity.kt>`.

source: Add code to your app to :source:`start Python in embedded mode <Android/testbed/app/src/main/c/main_activity.c>`. This will need to be C code called via JNI.
ru: Добавьте в свое приложение код, который :source:`запустит Python во встроенном режиме <Android/testbed/app/src/main/c/main_activity.c>`. Это должен быть код C, вызываемый через JNI.
