Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/using/cmdline.po
Languages: uk

source: Command line and environment
uk: Командний рядок і середовище

source: The CPython interpreter scans the command line and the environment for various settings.
uk: Інтерпретатор CPython сканує командний рядок і середовище на наявність різних параметрів.

source: Other implementations' command line schemes may differ. See :ref:`implementations` for further resources.
uk: Схеми командного рядка інших реалізацій можуть відрізнятися. Перегляньте :ref:`implementations` для отримання додаткових ресурсів.

source: Command line
uk: Командний рядок

source: When invoking Python, you may specify any of these options::
uk: Під час виклику Python ви можете вказати будь-який із цих параметрів:

source: The most common use case is, of course, a simple invocation of a script::
uk: Найпоширенішим випадком використання є, звичайно, простий виклик сценарію::

source: Interface options
uk: Параметри інтерфейсу

source: The interpreter interface resembles that of the UNIX shell, but provides some additional methods of invocation:
uk: Інтерфейс інтерпретатора нагадує інтерфейс оболонки UNIX, але надає деякі додаткові методи виклику:

source: When called with standard input connected to a tty device, it prompts for commands and executes them until an EOF (an end-of-file character, you can produce that with :kbd:`Ctrl-D` on UNIX or :kbd:`Ctrl-Z, Enter` on Windows) is read.
uk: Під час виклику за допомогою стандартного введення, підключеного до пристрою tty, він запитує команди та виконує їх до EOF (символ кінця файлу, ви можете створити його за допомогою :kbd:`Ctrl-D` в UNIX або :kbd:`Ctrl-Z, Enter` у Windows).

source: When called with a file name argument or with a file as standard input, it reads and executes a script from that file.
uk: При виклику з аргументом імені файлу або з файлом як стандартним введенням він читає та виконує сценарій із цього файлу.

source: When called with a directory name argument, it reads and executes an appropriately named script from that directory.
uk: При виклику з аргументом назви каталогу він читає та виконує сценарій із відповідною назвою з цього каталогу.

source: When called with ``-c command``, it executes the Python statement(s) given as *command*. Here *command* may contain multiple statements separated by newlines. Leading whitespace is significant in Python statements!
uk: При виклику за допомогою команди ``-c`` виконується оператор(и) Python, наданий як *команда*. Тут *команда* може містити декілька операторів, розділених символом нового рядка. Пробіли на початку є важливими в операторах Python!

source: When called with ``-m module-name``, the given module is located on the Python module path and executed as a script.
uk: При виклику за допомогою ``-m назва-модуля`` заданий модуль розташовується на шляху модуля Python і виконується як сценарій.

source: In non-interactive mode, the entire input is parsed before it is executed.
uk: У неінтерактивному режимі весь вхід аналізується перед виконанням.

source: An interface option terminates the list of options consumed by the interpreter, all consecutive arguments will end up in :data:`sys.argv` -- note that the first element, subscript zero (``sys.argv[0]``), is a string reflecting the program's source.
uk: Опція інтерфейсу завершує список опцій, які використовує інтерпретатор, усі послідовні аргументи закінчаться в :data:`sys.argv` -- зверніть увагу, що перший елемент, індекс нуль (``sys.argv[0]``) , це рядок, що відображає джерело програми.

source: Execute the Python code in *command*. *command* can be one or more statements separated by newlines, with significant leading whitespace as in normal module code.
uk: Виконайте код Python у *команді*. *команда* може бути одним або декількома операторами, розділеними символом нового рядка, зі значними пробілами на початку, як у звичайному коді модуля.

source: If this option is given, the first element of :data:`sys.argv` will be ``"-c"`` and the current directory will be added to the start of :data:`sys.path` (allowing modules in that directory to be imported as top level modules).
uk: Якщо вказано цей параметр, першим елементом :data:`sys.argv` буде ``"-c"``, а поточний каталог буде додано до початку :data:`sys.path` (дозволяючи модулі у цьому каталозі, який буде імпортовано як модулі верхнього рівня).

source: Raises an :ref:`auditing event <auditing>` ``cpython.run_command`` with argument ``command``.
uk: Викликає :ref:`подію аудиту <auditing>` ``cpython.run_command`` з аргументом ``command``.

source: Search :data:`sys.path` for the named module and execute its contents as the :mod:`__main__` module.
uk: Знайдіть у :data:`sys.path` названий модуль і виконайте його вміст як модуль :mod:`__main__`.

source: Since the argument is a *module* name, you must not give a file extension (``.py``). The module name should be a valid absolute Python module name, but the implementation may not always enforce this (e.g. it may allow you to use a name that includes a hyphen).
uk: Оскільки аргументом є назва *модуля*, ви не повинні вказувати розширення файлу (``.py``). Ім’я модуля має бути дійсним абсолютним ім’ям модуля Python, але реалізація може не завжди забезпечити це (наприклад, вона може дозволити вам використовувати ім’я, яке містить дефіс).

source: Package names (including namespace packages) are also permitted. When a package name is supplied instead of a normal module, the interpreter will execute ``<pkg>.__main__`` as the main module. This behaviour is deliberately similar to the handling of directories and zipfiles that are passed to the interpreter as the script argument.
uk: Імена пакетів (включаючи пакети простору імен) також дозволені. Якщо замість звичайного модуля вказано назву пакета, інтерпретатор виконає ``<pkg> .__main__`` як головний модуль. Ця поведінка навмисно подібна до обробки каталогів і zip-файлів, які передаються інтерпретатору як аргумент сценарію.

source: This option cannot be used with built-in modules and extension modules written in C, since they do not have Python module files. However, it can still be used for precompiled modules, even if the original source file is not available.
uk: Цей параметр не можна використовувати з вбудованими модулями та модулями розширення, написаними мовою C, оскільки вони не мають файлів модулів Python. Однак його все одно можна використовувати для попередньо скомпільованих модулів, навіть якщо вихідний вихідний файл недоступний.

source: If this option is given, the first element of :data:`sys.argv` will be the full path to the module file (while the module file is being located, the first element will be set to ``"-m"``). As with the :option:`-c` option, the current directory will be added to the start of :data:`sys.path`.
uk: Якщо вказано цей параметр, перший елемент :data:`sys.argv` буде повним шляхом до файлу модуля (під час пошуку файлу модуля для першого елемента буде встановлено значення ``"-m"``). Як і з опцією :option:`-c`, поточний каталог буде додано на початок :data:`sys.path`.

source: :option:`-I` option can be used to run the script in isolated mode where :data:`sys.path` contains neither the current directory nor the user's site-packages directory. All :envvar:`PYTHON*` environment variables are ignored, too.
uk: Параметр :option:`-I` можна використовувати для запуску сценарію в ізольованому режимі, де :data:`sys.path` не містить ані поточного каталогу, ані каталогу пакетів сайту користувача. Усі змінні середовища :envvar:`PYTHON*` також ігноруються.

source: Many standard library modules contain code that is invoked on their execution as a script. An example is the :mod:`timeit` module::
uk: Багато модулів стандартної бібліотеки містять код, який викликається під час їх виконання як сценарій. Прикладом є модуль :mod:`timeit`::

source: Raises an :ref:`auditing event <auditing>` ``cpython.run_module`` with argument ``module-name``.
uk: Викликає :ref:`подію аудиту <auditing>` ``cpython.run_module`` з аргументом ``module-name``.

source: Equivalent functionality directly available to Python code
uk: Еквівалентна функція, безпосередньо доступна для коду Python

source: :pep:`338` -- Executing modules as scripts
uk: :pep:`338` -- Виконання модулів як скриптів

source: Supply the package name to run a ``__main__`` submodule.
uk: Укажіть назву пакета для запуску підмодуля ``__main__``.

source: namespace packages are also supported
uk: також підтримуються пакети простору імен

source: Read commands from standard input (:data:`sys.stdin`). If standard input is a terminal, :option:`-i` is implied.
uk: Читання команд зі стандартного введення (:data:`sys.stdin`). Якщо стандартним введенням є термінал, мається на увазі :option:`-i`.

source: If this option is given, the first element of :data:`sys.argv` will be ``"-"`` and the current directory will be added to the start of :data:`sys.path`.
uk: Якщо вказано цей параметр, першим елементом :data:`sys.argv` буде ``"-"``, а поточний каталог буде додано до початку :data:`sys.path`.

source: Raises an :ref:`auditing event <auditing>` ``cpython.run_stdin`` with no arguments.
uk: Викликає :ref:`подію аудиту <auditing>` ``cpython.run_stdin`` без аргументів.

source: Execute the Python code contained in *script*, which must be a filesystem path (absolute or relative) referring to either a Python file, a directory containing a ``__main__.py`` file, or a zipfile containing a ``__main__.py`` file.
uk: Виконайте код Python, що міститься в *script*, який має бути шляхом до файлової системи (абсолютним або відносним), що посилається на файл Python, каталог, що містить файл ``__main__.py``, або файл zip, що містить ``__main__. файл py``.

source: If this option is given, the first element of :data:`sys.argv` will be the script name as given on the command line.
uk: Якщо вказано цей параметр, першим елементом :data:`sys.argv` буде ім’я сценарію, подане в командному рядку.

source: If the script name refers directly to a Python file, the directory containing that file is added to the start of :data:`sys.path`, and the file is executed as the :mod:`__main__` module.
uk: Якщо назва сценарію посилається безпосередньо на файл Python, каталог, що містить цей файл, додається до початку :data:`sys.path`, і файл виконується як модуль :mod:`__main__`.

source: If the script name refers to a directory or zipfile, the script name is added to the start of :data:`sys.path` and the ``__main__.py`` file in that location is executed as the :mod:`__main__` module.
uk: Якщо назва сценарію посилається на каталог або zip-файл, назва сценарію додається до початку :data:`sys.path`, а файл ``__main__.py`` у цьому місці виконується як :mod:`__main__` модуль.

source: :option:`-I` option can be used to run the script in isolated mode where :data:`sys.path` contains neither the script's directory nor the user's site-packages directory. All :envvar:`PYTHON*` environment variables are ignored, too.
uk: Параметр :option:`-I` можна використовувати для запуску сценарію в ізольованому режимі, де :data:`sys.path` не містить ані каталогу сценарію, ані каталогу пакетів сайту користувача. Усі змінні середовища :envvar:`PYTHON*` також ігноруються.

source: Raises an :ref:`auditing event <auditing>` ``cpython.run_file`` with argument ``filename``.
uk: Викликає :ref:`подію аудиту <auditing>` ``cpython.run_file`` з аргументом ``filename``.

source: If no interface option is given, :option:`-i` is implied, ``sys.argv[0]`` is an empty string (``""``) and the current directory will be added to the start of :data:`sys.path`. Also, tab-completion and history editing is automatically enabled, if available on your platform (see :ref:`rlcompleter-config`).
uk: Якщо параметр інтерфейсу не вказано, мається на увазі :option:`-i`, ``sys.argv[0]`` є порожнім рядком (``""``), і поточний каталог буде додано на початку :data:`sys.path`. Крім того, автоматично вмикається завершення вкладок і редагування історії, якщо вони доступні на вашій платформі (див. :ref:`rlcompleter-config`).

source: Automatic enabling of tab-completion and history editing.
uk: Автоматичне ввімкнення табуляції та редагування історії.

source: Generic options
uk: Загальні варіанти

source: Print the Python version number and exit. Example output could be:
uk: Надрукуйте номер версії Python і вийдіть. Приклад результату може бути таким:

source: When given twice, print more information about the build, like:
uk: Якщо надати двічі, надрукувати більше інформації про збірку, наприклад:

source: The ``-VV`` option.
uk: Параметр ``-VV``.

source: Miscellaneous options
uk: Різні варіанти

source: Issue a warning when comparing :class:`bytes` or :class:`bytearray` with :class:`str` or :class:`bytes` with :class:`int`. Issue an error when the option is given twice (:option:`!-bb`).
uk: Видає попередження, коли порівнює :class:`bytes` або :class:`bytearray` з :class:`str` або :class:`bytes` з :class:`int`. Видає помилку, коли опцію вказано двічі (:option:`!-bb`).

source: Affects comparisons of :class:`bytes` with :class:`int`.
uk: Впливає на порівняння :class:`bytes` з :class:`int`.

source: If given, Python won't try to write ``.pyc`` files on the import of source modules. See also :envvar:`PYTHONDONTWRITEBYTECODE`.
uk: Якщо дано, Python не намагатиметься записати файли ``.pyc`` під час імпорту вихідних модулів. Дивіться також :envvar:`PYTHONDONTWRITEBYTECODE`.

source: Control the validation behavior of hash-based ``.pyc`` files. See :ref:`pyc-invalidation`. When set to ``default``, checked and unchecked hash-based bytecode cache files are validated according to their default semantics. When set to ``always``, all hash-based ``.pyc`` files, whether checked or unchecked, are validated against their corresponding source file. When set to ``never``, hash-based ``.pyc`` files are not validated against their corresponding source files.
uk: Керуйте поведінкою перевірки файлів ``.pyc`` на основі хешу. Перегляньте :ref:`pyc-invalidation`. Якщо встановлено ``за замовчуванням``, позначені та не позначені файли кешу на основі хеш-коду перевіряються відповідно до їх семантики за замовчуванням. Якщо встановлено значення ``always``, усі файли ``.pyc`` на основі хешу, позначені чи не позначені, перевіряються на відповідність їхньому вихідному файлу. Якщо встановлено значення ``never``, файли ``.pyc`` на основі хешу не перевіряються на відповідність відповідним вихідним файлам.

source: The semantics of timestamp-based ``.pyc`` files are unaffected by this option.
uk: Цей параметр не впливає на семантику файлів ``.pyc`` на основі часових позначок.

source: Turn on parser debugging output (for expert only, depending on compilation options). See also :envvar:`PYTHONDEBUG`.
uk: Увімкніть вихід налагодження аналізатора (лише для експерта, залежно від параметрів компіляції). Дивіться також :envvar:`PYTHONDEBUG`.

source: Ignore all :envvar:`PYTHON*` environment variables, e.g. :envvar:`PYTHONPATH` and :envvar:`PYTHONHOME`, that might be set.
uk: Ігноруйте всі змінні середовища :envvar:`PYTHON*`, напр. :envvar:`PYTHONPATH` і :envvar:`PYTHONHOME`, які можуть бути встановлені.

source: When a script is passed as first argument or the :option:`-c` option is used, enter interactive mode after executing the script or the command, even when :data:`sys.stdin` does not appear to be a terminal. The :envvar:`PYTHONSTARTUP` file is not read.
uk: Якщо сценарій передається як перший аргумент або використовується параметр :option:`-c`, увійдіть в інтерактивний режим після виконання сценарію або команди, навіть якщо :data:`sys.stdin` не виглядає як термінал. Файл :envvar:`PYTHONSTARTUP` не читається.

source: This can be useful to inspect global variables or a stack trace when a script raises an exception. See also :envvar:`PYTHONINSPECT`.
uk: Це може бути корисно для перевірки глобальних змінних або трасування стека, коли сценарій викликає виняткову ситуацію. Дивіться також :envvar:`PYTHONINSPECT`.

source: Remove assert statements and any code conditional on the value of :const:`__debug__`. Augment the filename for compiled (:term:`bytecode`) files by adding ``.opt-1`` before the ``.pyc`` extension (see :pep:`488`). See also :envvar:`PYTHONOPTIMIZE`.
uk: Видаліть оператори assert і будь-який код, який залежить від значення :const:`__debug__`. Збільште назву файлу для скомпільованих (:term:`bytecode`) файлів, додавши ``.opt-1`` перед розширенням ``.pyc`` (див. :pep:`488`). Дивіться також :envvar:`PYTHONOPTIMIZE`.

source: Modify ``.pyc`` filenames according to :pep:`488`.
uk: Змініть назви файлів ``.pyc`` відповідно до :pep:`488`.

source: Do :option:`-O` and also discard docstrings. Augment the filename for compiled (:term:`bytecode`) files by adding ``.opt-2`` before the ``.pyc`` extension (see :pep:`488`).
uk: Виконайте :option:`-O` і також відкиньте рядки документації. Збільште назву файлу для скомпільованих (:term:`bytecode`) файлів, додавши ``.opt-2`` перед розширенням ``.pyc`` (див. :pep:`488`).

source: Don't display the copyright and version messages even in interactive mode.
uk: Не відображайте повідомлення про авторські права та версію навіть в інтерактивному режимі.

source: Turn on hash randomization. This option only has an effect if the :envvar:`PYTHONHASHSEED` environment variable is set to ``0``, since hash randomization is enabled by default.
uk: Увімкніть хеш-рандомізацію. Цей параметр діє, лише якщо для змінної середовища :envvar:`PYTHONHASHSEED` встановлено значення ``0``, оскільки рандомізацію хешу ввімкнено за замовчуванням.

source: On previous versions of Python, this option turns on hash randomization, so that the :meth:`__hash__` values of str and bytes objects are "salted" with an unpredictable random value. Although they remain constant within an individual Python process, they are not predictable between repeated invocations of Python.
uk: У попередніх версіях Python ця опція вмикає рандомізацію хешу, так що значення :meth:`__hash__` об’єктів str і bytes "підсолюються" непередбачуваним випадковим значенням. Хоча вони залишаються постійними в окремому процесі Python, вони не передбачувані між повторними викликами Python.

source: Hash randomization is intended to provide protection against a denial-of-service caused by carefully-chosen inputs that exploit the worst case performance of a dict construction, O(n\ :sup:`2`) complexity. See http://www.ocert.org/advisories/ocert-2011-003.html for details.
uk: Хеш-рандомізація призначена для забезпечення захисту від відмови в обслуговуванні, спричиненої ретельно вибраними вхідними даними, які використовують найгіршу продуктивність конструкції dict, складність O(n\ :sup:`2`). Див. http://www.ocert.org/advisories/ocert-2011-003.html для отримання додаткової інформації.

source: :envvar:`PYTHONHASHSEED` allows you to set a fixed value for the hash seed secret.
uk: :envvar:`PYTHONHASHSEED` дозволяє встановити фіксоване значення для початкового секрету хешу.

source: The option is no longer ignored.
uk: Опція більше не ігнорується.

source: Don't add the :data:`user site-packages directory <site.USER_SITE>` to :data:`sys.path`.
uk: Не додавайте каталог :data:`user site-packages <site.USER_SITE>` до :data:`sys.path`.

source: :pep:`370` -- Per user site-packages directory
uk: :pep:`370` -- Каталог пакетів сайту для кожного користувача

source: Disable the import of the module :mod:`site` and the site-dependent manipulations of :data:`sys.path` that it entails. Also disable these manipulations if :mod:`site` is explicitly imported later (call :func:`site.main` if you want them to be triggered).
uk: Вимкніть імпорт модуля :mod:`site` і залежні від сайту маніпуляції :data:`sys.path`, які він передбачає. Також вимкніть ці маніпуляції, якщо :mod:`site` буде явно імпортовано пізніше (викличте :func:`site.main`, якщо ви хочете, щоб вони були активовані).

source: Force the stdout and stderr streams to be unbuffered. This option has no effect on the stdin stream.
uk: Примусово розбуферизувати потоки stdout і stderr. Цей параметр не впливає на потік stdin.

source: See also :envvar:`PYTHONUNBUFFERED`.
uk: Дивіться також :envvar:`PYTHONUNBUFFERED`.

source: The text layer of the stdout and stderr streams now is unbuffered.
uk: Текстовий рівень потоків stdout і stderr тепер не буферизується.

source: The simplest settings apply a particular action unconditionally to all warnings emitted by a process (even those that are otherwise ignored by default)::
uk: Найпростіші налаштування безумовно застосовують певну дію до всіх попереджень, виданих процесом (навіть до тих, які інакше ігноруються за замовчуванням):

source: See :ref:`warning-filter` and :ref:`describing-warning-filters` for more details.
uk: Перегляньте :ref:`warning-filter` і :ref:`describing-warning-filters` для отримання додаткової інформації.

source: Skip the first line of the source, allowing use of non-Unix forms of ``#!cmd``. This is intended for a DOS specific hack only.
uk: Пропустіть перший рядок джерела, дозволяючи використовувати не-Unix форми ``#!cmd``. Це призначено лише для спеціального злому DOS.

source: Reserved for various implementation-specific options. CPython currently defines the following possible values:
uk: Зарезервовано для різних варіантів реалізації. Наразі CPython визначає такі можливі значення:

source: ``-X faulthandler`` to enable :mod:`faulthandler`;
uk: ``-X faulthandler``, щоб увімкнути :mod:`faulthandler`;

source: ``-X tracemalloc`` to start tracing Python memory allocations using the :mod:`tracemalloc` module. By default, only the most recent frame is stored in a traceback of a trace. Use ``-X tracemalloc=NFRAME`` to start tracing with a traceback limit of *NFRAME* frames. See the :func:`tracemalloc.start` for more information.
uk: ``-X tracemalloc``, щоб розпочати відстеження виділення пам’яті Python за допомогою модуля :mod:`tracemalloc`. За замовчуванням лише останній кадр зберігається у зворотній трасі трасування. Використовуйте ``-X tracemalloc=NFRAME``, щоб почати відстеження з обмеженням відстеження кадрів *NFRAME*. Дивіться :func:`tracemalloc.start` для отримання додаткової інформації.

source: ``-X importtime`` to show how long each import takes. It shows module name, cumulative time (including nested imports) and self time (excluding nested imports). Note that its output may be broken in multi-threaded application. Typical usage is ``python3 -X importtime -c 'import asyncio'``. See also :envvar:`PYTHONPROFILEIMPORTTIME`.
uk: ``-X importtime``, щоб показати, скільки часу займає кожен імпорт. Він показує назву модуля, сукупний час (включно з вкладеним імпортом) і власний час (за винятком вкладеного імпорту). Зверніть увагу, що його вихід може бути порушений у багатопотоковій програмі. Типовим використанням є ``python3 -X importtime -c 'import asyncio'``. Дивіться також :envvar:`PYTHONPROFILEIMPORTTIME`.

source: ``-X dev``: enable :ref:`Python Development Mode <devmode>`, introducing additional runtime checks that are too expensive to be enabled by default.
uk: ``-X dev``: увімкнути :ref:`Режим розробки Python <devmode>`, запроваджуючи додаткові перевірки під час виконання, які надто дорогі, щоб їх увімкнути за замовчуванням.

source: ``-X pycache_prefix=PATH`` enables writing ``.pyc`` files to a parallel tree rooted at the given directory instead of to the code tree. See also :envvar:`PYTHONPYCACHEPREFIX`.
uk: ``-X pycache_prefix=PATH`` дає змогу записувати файли ``.pyc`` до паралельного дерева з коренем у вказаному каталозі замість дерева коду. Дивіться також :envvar:`PYTHONPYCACHEPREFIX`.

source: It also allows passing arbitrary values and retrieving them through the :data:`sys._xoptions` dictionary.
uk: Це також дозволяє передавати довільні значення та отримувати їх через словник :data:`sys._xoptions`.

source: The :option:`-X` option was added.
uk: Додано параметр :option:`-X`.

source: The ``-X faulthandler`` option.
uk: Параметр ``-X faulthandler``.
