Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/using/cmdline.po
Languages: uk

source: Configuring one of these locales (either explicitly or via the above implicit locale coercion) automatically enables the ``surrogateescape`` :ref:`error handler <error-handlers>` for :data:`sys.stdin` and :data:`sys.stdout` (:data:`sys.stderr` continues to use ``backslashreplace`` as it does in any other locale). This stream handling behavior can be overridden using :envvar:`PYTHONIOENCODING` as usual.
uk: Налаштування однієї з цих локалей (явно або за допомогою зазначеного вище неявного примусу до локалі) автоматично вмикає ``surrogateescape`` :ref:`обробник помилок <error-handlers>` для :data:`sys.stdin` і :data:`sys.stdout` (:data:`sys.stderr` продовжує використовувати ``backslashreplace``, як і в будь-якій іншій локалі). Цю поведінку обробки потоку можна змінити за допомогою :envvar:`PYTHONIOENCODING`, як зазвичай.

source: For debugging purposes, setting ``PYTHONCOERCECLOCALE=warn`` will cause Python to emit warning messages on ``stderr`` if either the locale coercion activates, or else if a locale that *would* have triggered coercion is still active when the Python runtime is initialized.
uk: З метою налагодження налаштування ``PYTHONCOERCECLOCALE=warn`` призведе до того, що Python видаватиме попереджувальні повідомлення на ``stderr``, якщо або активується примусове налаштування локалі, або якщо локаль, яка *могла б* ініціювати примусове налаштування, все ще активна, коли Python час виконання ініціалізовано.

source: Also note that even when locale coercion is disabled, or when it fails to find a suitable target locale, :envvar:`PYTHONUTF8` will still activate by default in legacy ASCII-based locales. Both features must be disabled in order to force the interpreter to use ``ASCII`` instead of ``UTF-8`` for system interfaces.
uk: Також зауважте, що навіть якщо примусове налаштування локалі вимкнено або якщо йому не вдається знайти відповідну цільову локаль, :envvar:`PYTHONUTF8` усе одно активується за замовчуванням у застарілих локалях на основі ASCII. Обидві функції мають бути вимкнені, щоб змусити інтерпретатор використовувати ``ASCII`` замість ``UTF-8`` для системних інтерфейсів.

source: :ref:`Availability <availability>`: \*nix.
uk: :ref:`Наявність <availability>`: \*nix.

source: See :pep:`538` for more details.
uk: Дивіться :pep:`538` для більш детальної інформації.

source: If this environment variable is set to a non-empty string, enable :ref:`Python Development Mode <devmode>`, introducing additional runtime checks that are too expensive to be enabled by default.
uk: Якщо для цієї змінної середовища встановлено непорожній рядок, увімкніть :ref:`Режим розробки Python <devmode>`, запроваджуючи додаткові перевірки під час виконання, які є надто дорогими, щоб їх увімкнути за замовчуванням.

source: :data:`sys.stdin`, :data:`sys.stdout`, and :data:`sys.stderr` all use UTF-8 as their text encoding, with the ``surrogateescape`` :ref:`error handler <error-handlers>` being enabled for :data:`sys.stdin` and :data:`sys.stdout` (:data:`sys.stderr` continues to use ``backslashreplace`` as it does in the default locale-aware mode)
uk: :data:`sys.stdin`, :data:`sys.stdout` і :data:`sys.stderr` використовують UTF-8 як кодування тексту з ``surrogateescape`` :ref:`обробником помилок <error-handlers>` увімкнено для :data:`sys.stdin` і :data:`sys.stdout` (:data:`sys.stderr` продовжує використовувати ``backslashreplace``, як це робиться в режимі з урахуванням локалі за замовчуванням)

source: As a consequence of the changes in those lower level APIs, other higher level APIs also exhibit different default behaviours:
uk: Як наслідок змін у цих API нижчого рівня, інші API вищого рівня також демонструють іншу поведінку за замовчуванням:

source: Command line arguments, environment variables and filenames are decoded to text using the UTF-8 encoding.
uk: Аргументи командного рядка, змінні середовища та імена файлів декодуються в текст за допомогою кодування UTF-8.

source: :func:`os.fsdecode()` and :func:`os.fsencode()` use the UTF-8 encoding.
uk: :func:`os.fsdecode()` і :func:`os.fsencode()` використовують кодування UTF-8.

source: :func:`open()`, :func:`io.open()`, and :func:`codecs.open()` use the UTF-8 encoding by default. However, they still use the strict error handler by default so that attempting to open a binary file in text mode is likely to raise an exception rather than producing nonsense data.
uk: :func:`open()`, :func:`io.open()` і :func:`codecs.open()` використовують кодування UTF-8 за умовчанням. Однак вони все ще використовують строгий обробник помилок за замовчуванням, тому спроба відкрити двійковий файл у текстовому режимі швидше за все призведе до виключення, а не до безглуздих даних.

source: Note that the standard stream settings in UTF-8 mode can be overridden by :envvar:`PYTHONIOENCODING` (just as they can be in the default locale-aware mode).
uk: Зауважте, що стандартні параметри потоку в режимі UTF-8 можна замінити :envvar:`PYTHONIOENCODING` (так само, як вони можуть бути в режимі з урахуванням локалі за замовчуванням).

source: Setting any other non-empty string causes an error during interpreter initialisation.
uk: Встановлення будь-якого іншого непорожнього рядка викликає помилку під час ініціалізації інтерпретатора.

source: See :pep:`540` for more details.
uk: Дивіться :pep:`540` для більш детальної інформації.

source: Debug-mode variables
uk: Змінні режиму налагодження

source: If set, Python will dump objects and reference counts still alive after shutting down the interpreter.
uk: Якщо встановлено, Python виводитиме об’єкти та лічильники посилань, які ще живі після вимкнення інтерпретатора.
