Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/using/cmdline.po
Languages: uk

source: The ``-X showrefcount`` and ``-X tracemalloc`` options.
uk: Параметри ``-X showrefcount`` і ``-X tracemalloc``.

source: The ``-X showalloccount`` option.
uk: Параметр ``-X showalloccount``.

source: The ``-X importtime``, ``-X dev`` and ``-X utf8`` options.
uk: Параметри ``-X importtime``, ``-X dev`` і ``-X utf8``.

source: The ``-X pycache_prefix`` option. The ``-X dev`` option now logs ``close()`` exceptions in :class:`io.IOBase` destructor.
uk: Параметр ``-X pycache_prefix``. Параметр ``-X dev`` тепер реєструє винятки ``close()`` у деструкторі :class:`io.IOBase`.

source: Using ``-X dev`` option, check *encoding* and *errors* arguments on string encoding and decoding operations.
uk: Використовуючи параметр ``-X dev``, перевірте аргументи *encoding* і *errors* в операціях кодування та декодування рядків.

source: The ``-X showalloccount`` option has been removed.
uk: Опцію ``-X showalloccount`` видалено.

source: The ``-X oldparser`` option.
uk: Параметр ``-X oldparser``.

source: Options you shouldn't use
uk: Параметри, якими не варто користуватися

source: Reserved for use by Jython_.
uk: Зарезервовано для використання Jython_.

source: Environment variables
uk: Змінні середовища

source: These environment variables influence Python's behavior, they are processed before the command-line switches other than -E or -I. It is customary that command-line switches override environmental variables where there is a conflict.
uk: Ці змінні середовища впливають на поведінку Python, вони обробляються перед перемикачами командного рядка, відмінними від -E або -I. Зазвичай параметри командного рядка перевизначають змінні середовища, де є конфлікт.

source: Change the location of the standard Python libraries. By default, the libraries are searched in :file:`{prefix}/lib/python{version}` and :file:`{exec_prefix}/lib/python{version}`, where :file:`{prefix}` and :file:`{exec_prefix}` are installation-dependent directories, both defaulting to :file:`/usr/local`.
uk: Змініть розташування стандартних бібліотек Python. За замовчуванням бібліотеки шукаються в :file:`{prefix}/lib/python{version}` і :file:`{exec_prefix}/lib/python{version}`, де :file:`{prefix}` та :file:`{exec_prefix}` є каталогами, що залежать від інсталяції, обидва за умовчанням мають :file:`/usr/local`.

source: When :envvar:`PYTHONHOME` is set to a single directory, its value replaces both :file:`{prefix}` and :file:`{exec_prefix}`. To specify different values for these, set :envvar:`PYTHONHOME` to :file:`{prefix}:{exec_prefix}`.
uk: Коли для :envvar:`PYTHONHOME` встановлено один каталог, його значення замінює як :file:`{prefix}`, так і :file:`{exec_prefix}`. Щоб указати різні значення для них, установіть :envvar:`PYTHONHOME` на :file:`{prefix}:{exec_prefix}`.

source: Augment the default search path for module files. The format is the same as the shell's :envvar:`PATH`: one or more directory pathnames separated by :data:`os.pathsep` (e.g. colons on Unix or semicolons on Windows). Non-existent directories are silently ignored.
uk: Доповніть шлях пошуку за замовчуванням для файлів модулів. Формат такий самий, як і :envvar:`PATH` оболонки: одне або більше імен шляхів до каталогу, розділених :data:`os.pathsep` (наприклад, двокрапка в Unix або крапка з комою в Windows). Неіснуючі каталоги мовчки ігноруються.

source: In addition to normal directories, individual :envvar:`PYTHONPATH` entries may refer to zipfiles containing pure Python modules (in either source or compiled form). Extension modules cannot be imported from zipfiles.
uk: На додаток до звичайних каталогів, окремі записи :envvar:`PYTHONPATH` можуть посилатися на zip-файли, що містять чисті модулі Python (у початковій або скомпільованій формі). Модулі розширення не можна імпортувати з zip-файлів.

source: The default search path is installation dependent, but generally begins with :file:`{prefix}/lib/python{version}` (see :envvar:`PYTHONHOME` above). It is *always* appended to :envvar:`PYTHONPATH`.
uk: Шлях пошуку за умовчанням залежить від встановлення, але зазвичай починається з :file:`{prefix}/lib/python{version}` (див. :envvar:`PYTHONHOME` вище). Він *завжди* додається до :envvar:`PYTHONPATH`.

source: An additional directory will be inserted in the search path in front of :envvar:`PYTHONPATH` as described above under :ref:`using-on-interface-options`. The search path can be manipulated from within a Python program as the variable :data:`sys.path`.
uk: Додатковий каталог буде вставлено в шлях пошуку перед :envvar:`PYTHONPATH`, як описано вище в розділі :ref:`using-on-interface-options`. Шляхом пошуку можна керувати з програми Python за допомогою змінної :data:`sys.path`.

source: If this is set to a non-empty string, it overrides the :data:`sys.platlibdir` value.
uk: Якщо для цього значення встановлено непорожній рядок, воно перевизначає значення :data:`sys.platlibdir`.

source: If this is the name of a readable file, the Python commands in that file are executed before the first prompt is displayed in interactive mode. The file is executed in the same namespace where interactive commands are executed so that objects defined or imported in it can be used without qualification in the interactive session. You can also change the prompts :data:`sys.ps1` and :data:`sys.ps2` and the hook :data:`sys.__interactivehook__` in this file.
uk: Якщо це ім’я файлу, який можна читати, команди Python у цьому файлі виконуються до того, як в інтерактивному режимі відобразиться перше повідомлення. Файл виконується в тому самому просторі імен, де виконуються інтерактивні команди, щоб об’єкти, визначені або імпортовані в ньому, можна було використовувати без застережень в інтерактивному сеансі. Ви також можете змінити підказки :data:`sys.ps1` і :data:`sys.ps2` і хук :data:`sys.__interactivehook__` у цьому файлі.

source: Raises an :ref:`auditing event <auditing>` ``cpython.run_startup`` with argument ``filename``.
uk: Викликає :ref:`подію аудиту <auditing>` ``cpython.run_startup`` з аргументом ``filename``.

source: Raises an :ref:`auditing event <auditing>` ``cpython.run_startup`` with the filename as the argument when called on startup.
uk: Викликає :ref:`подію аудиту <auditing>` ``cpython.run_startup`` з іменем файлу як аргументом під час виклику під час запуску.

source: If this is set to a non-empty string it is equivalent to specifying the :option:`-O` option. If set to an integer, it is equivalent to specifying :option:`-O` multiple times.
uk: Якщо для цього значення встановлено непорожній рядок, це еквівалентно вказівці параметра :option:`-O`. Якщо встановлено ціле число, це еквівалентно вказівці :option:`-O` кілька разів.

source: If this is set, it names a callable using dotted-path notation. The module containing the callable will be imported and then the callable will be run by the default implementation of :func:`sys.breakpointhook` which itself is called by built-in :func:`breakpoint`. If not set, or set to the empty string, it is equivalent to the value "pdb.set_trace". Setting this to the string "0" causes the default implementation of :func:`sys.breakpointhook` to do nothing but return immediately.
uk: Якщо це встановлено, він називає виклик, використовуючи позначення шляху з пунктиром. Модуль, що містить виклик, буде імпортований, а потім виклик запускатиметься реалізацією за замовчуванням :func:`sys.breakpointhook`, яка сама викликається вбудованою :func:`breakpoint`. Якщо не встановлено або встановлено порожній рядок, це еквівалентно значенню "pdb.set_trace". Встановлення рядка "0" призводить до того, що реалізація за замовчуванням :func:`sys.breakpointhook` не робить нічого, крім негайного повернення.

source: If this is set to a non-empty string it is equivalent to specifying the :option:`-d` option. If set to an integer, it is equivalent to specifying :option:`-d` multiple times.
uk: Якщо для цього значення встановлено непорожній рядок, це еквівалентно вказівці параметра :option:`-d`. Якщо встановлено ціле число, це еквівалентно вказівці :option:`-d` кілька разів.

source: If this is set to a non-empty string it is equivalent to specifying the :option:`-i` option.
uk: Якщо для цього значення встановлено непорожній рядок, це еквівалентно вказуванню параметра :option:`-i`.

source: This variable can also be modified by Python code using :data:`os.environ` to force inspect mode on program termination.
uk: Цю змінну також можна змінити за допомогою коду Python за допомогою :data:`os.environ` для примусового режиму перевірки після завершення програми.

source: If this is set to a non-empty string it is equivalent to specifying the :option:`-u` option.
uk: Якщо для цього значення встановлено непорожній рядок, це еквівалентно вказівці параметра :option:`-u`.

source: If this is set to a non-empty string it is equivalent to specifying the :option:`-v` option. If set to an integer, it is equivalent to specifying :option:`-v` multiple times.
uk: Якщо для цього значення встановлено непорожній рядок, це еквівалентно вказівці параметра :option:`-v`. Якщо встановлено ціле число, це еквівалентно вказівці :option:`-v` кілька разів.

source: If this is set, Python ignores case in :keyword:`import` statements. This only works on Windows and macOS.
uk: Якщо це встановлено, Python ігнорує регістр у операторах :keyword:`import`. Це працює лише в Windows і macOS.

source: If this is set to a non-empty string, Python won't try to write ``.pyc`` files on the import of source modules. This is equivalent to specifying the :option:`-B` option.
uk: Якщо для цього значення встановлено непорожній рядок, Python не намагатиметься записати файли ``.pyc`` під час імпорту вихідних модулів. Це еквівалентно вказівці параметра :option:`-B`.

source: If this is set, Python will write ``.pyc`` files in a mirror directory tree at this path, instead of in ``__pycache__`` directories within the source tree. This is equivalent to specifying the :option:`-X` ``pycache_prefix=PATH`` option.
uk: Якщо це встановлено, Python записуватиме файли ``.pyc`` у дзеркальному дереві каталогів за цим шляхом, а не в ``__pycache__`` каталогах у вихідному дереві. Це еквівалентно вказівці параметра :option:`-X` ``pycache_prefix=PATH``.

source: If this variable is not set or set to ``random``, a random value is used to seed the hashes of str and bytes objects.
uk: Якщо ця змінна не встановлена або має значення ``random``, для заповнення хешів об’єктів str і bytes використовується випадкове значення.

source: If :envvar:`PYTHONHASHSEED` is set to an integer value, it is used as a fixed seed for generating the hash() of the types covered by the hash randomization.
uk: Якщо :envvar:`PYTHONHASHSEED` має ціле значення, воно використовується як фіксоване початкове значення для генерації hash() типів, охоплених рандомізацією хешу.

source: Its purpose is to allow repeatable hashing, such as for selftests for the interpreter itself, or to allow a cluster of python processes to share hash values.
uk: Його мета полягає в тому, щоб дозволити повторюване хешування, наприклад, для самоперевірки для самого інтерпретатора, або дозволити кластеру процесів Python спільно використовувати хеш-значення.

source: The integer must be a decimal number in the range [0,4294967295]. Specifying the value 0 will disable hash randomization.
uk: Ціле число має бути десятковим числом у діапазоні [0,4294967295]. Якщо вказати значення 0, рандомізацію хешу буде вимкнено.

source: If this is set before running the interpreter, it overrides the encoding used for stdin/stdout/stderr, in the syntax ``encodingname:errorhandler``. Both the ``encodingname`` and the ``:errorhandler`` parts are optional and have the same meaning as in :func:`str.encode`.
uk: Якщо це встановлено перед запуском інтерпретатора, воно замінює кодування, що використовується для stdin/stdout/stderr, у синтаксисі ``encodingname:errorhandler``. Частини ``encodingname`` і ``:errorhandler`` є необов’язковими та мають те ж значення, що й у :func:`str.encode`.

source: For stderr, the ``:errorhandler`` part is ignored; the handler will always be ``'backslashreplace'``.
uk: Для stderr частина ``:errorhandler`` ігнорується; обробник завжди буде ``'backslashreplace'``.

source: The ``encodingname`` part is now optional.
uk: Частина ``назва кодування`` тепер необов'язкова.

source: On Windows, the encoding specified by this variable is ignored for interactive console buffers unless :envvar:`PYTHONLEGACYWINDOWSSTDIO` is also specified. Files and pipes redirected through the standard streams are not affected.
uk: У Windows кодування, визначене цією змінною, ігнорується для інтерактивних буферів консолі, якщо також не вказано :envvar:`PYTHONLEGACYWINDOWSSTDIO`. Файли та канали, переспрямовані через стандартні потоки, не впливають.

source: If this is set, Python won't add the :data:`user site-packages directory <site.USER_SITE>` to :data:`sys.path`.
uk: Якщо це встановлено, Python не додаватиме каталог :data:`user site-packages <site.USER_SITE>` до :data:`sys.path`.

source: Defines the :data:`user base directory <site.USER_BASE>`, which is used to compute the path of the :data:`user site-packages directory <site.USER_SITE>` and :ref:`Distutils installation paths <inst-alt-install-user>` for ``python setup.py install --user``.
uk: Визначає :data:`базовий каталог користувача <site.USER_BASE>`, який використовується для обчислення шляху до :data:`каталогу пакетів сайту користувача <site.USER_SITE>` та :ref:`шляхів встановлення Distutils <inst-alt-install-user>` для ``інсталяції python setup.py --користувач``.

source: If this environment variable is set, ``sys.argv[0]`` will be set to its value instead of the value got through the C runtime. Only works on macOS.
uk: Якщо цю змінну середовища встановлено, ``sys.argv[0]`` буде встановлено її значення замість значення, отриманого через середовище виконання C. Працює лише на macOS.

source: This is equivalent to the :option:`-W` option. If set to a comma separated string, it is equivalent to specifying :option:`-W` multiple times, with filters later in the list taking precedence over those earlier in the list.
uk: Це еквівалентно параметру :option:`-W`. Якщо встановлено рядок, розділений комами, це еквівалентно вказівці :option:`-W` кілька разів, причому фільтри, розташовані далі в списку, матимуть перевагу над тими, які є раніше в списку.

source: If this environment variable is set to a non-empty string, :func:`faulthandler.enable` is called at startup: install a handler for :const:`SIGSEGV`, :const:`SIGFPE`, :const:`SIGABRT`, :const:`SIGBUS` and :const:`SIGILL` signals to dump the Python traceback. This is equivalent to :option:`-X` ``faulthandler`` option.
uk: Якщо для цієї змінної середовища встановлено значення непорожнього рядка, :func:`faulthandler.enable` викликається під час запуску: установіть обробник для :const:`SIGSEGV`, :const:`SIGFPE`, :const:`SIGABRT` , :const:`SIGBUS` і :const:`SIGILL` сигнали для створення дампу зворотного відстеження Python. Це еквівалентно параметру :option:`-X` ``faulthandler``.

source: If this environment variable is set to a non-empty string, start tracing Python memory allocations using the :mod:`tracemalloc` module. The value of the variable is the maximum number of frames stored in a traceback of a trace. For example, ``PYTHONTRACEMALLOC=1`` stores only the most recent frame. See the :func:`tracemalloc.start` for more information.
uk: Якщо для цієї змінної середовища встановлено непорожній рядок, почніть відстежувати виділення пам’яті Python за допомогою модуля :mod:`tracemalloc`. Значення змінної — це максимальна кількість кадрів, що зберігаються в зворотній трасі. Наприклад, ``PYTHONTRACEMALLOC=1`` зберігає лише останній кадр. Дивіться :func:`tracemalloc.start` для отримання додаткової інформації.

source: If this environment variable is set to a non-empty string, Python will show how long each import takes. This is exactly equivalent to setting ``-X importtime`` on the command line.
uk: Якщо для цієї змінної середовища встановлено непорожній рядок, Python покаже, скільки часу займає кожен імпорт. Це точно еквівалентно встановленню ``-X importtime`` у командному рядку.

source: If this environment variable is set to a non-empty string, enable the :ref:`debug mode <asyncio-debug-mode>` of the :mod:`asyncio` module.
uk: Якщо для цієї змінної середовища встановлено непорожній рядок, увімкніть :ref:`режим налагодження <asyncio-debug-mode>` модуля :mod:`asyncio`.

source: Set the Python memory allocators and/or install debug hooks.
uk: Налаштуйте розподільники пам’яті Python та/або встановіть хуки налагодження.

source: Set the family of memory allocators used by Python:
uk: Встановіть сімейство розподільників пам’яті, яке використовує Python:

source: ``default``: use the :ref:`default memory allocators <default-memory-allocators>`.
uk: ``за замовчуванням``: використовуйте :ref:`розподільники пам'яті за замовчуванням <default-memory-allocators>`.

source: ``malloc``: use the :c:func:`malloc` function of the C library for all domains (:c:data:`PYMEM_DOMAIN_RAW`, :c:data:`PYMEM_DOMAIN_MEM`, :c:data:`PYMEM_DOMAIN_OBJ`).
uk: ``malloc``: використовуйте функцію :c:func:`malloc` бібліотеки C для всіх доменів (:c:data:`PYMEM_DOMAIN_RAW`, :c:data:`PYMEM_DOMAIN_MEM`, :c:data:`PYMEM_DOMAIN_OBJ`).

source: ``pymalloc``: use the :ref:`pymalloc allocator <pymalloc>` for :c:data:`PYMEM_DOMAIN_MEM` and :c:data:`PYMEM_DOMAIN_OBJ` domains and use the :c:func:`malloc` function for the :c:data:`PYMEM_DOMAIN_RAW` domain.
uk: ``pymalloc``: використовуйте :ref:`pymalloc allocator <pymalloc>` для доменів :c:data:`PYMEM_DOMAIN_MEM` і :c:data:`PYMEM_DOMAIN_OBJ` і використовуйте функцію :c:func:`malloc` для :c:data:`PYMEM_DOMAIN_RAW` домен.

source: ``debug``: install debug hooks on top of the :ref:`default memory allocators <default-memory-allocators>`.
uk: ``debug``: установіть хуки налагодження поверх :ref:`розподілювачів пам'яті за замовчуванням <default-memory-allocators>`.

source: ``malloc_debug``: same as ``malloc`` but also install debug hooks.
uk: ``malloc_debug``: те саме, що ``malloc``, але також встановлює хуки налагодження.

source: ``pymalloc_debug``: same as ``pymalloc`` but also install debug hooks.
uk: ``pymalloc_debug``: те саме, що ``pymalloc``, але також встановлює хуки налагодження.

source: Added the ``"default"`` allocator.
uk: Додано розподільник ``"default"``.

source: If set to a non-empty string, Python will print statistics of the :ref:`pymalloc memory allocator <pymalloc>` every time a new pymalloc object arena is created, and on shutdown.
uk: Якщо встановлено непорожній рядок, Python друкуватиме статистику :ref:`розподільника пам’яті pymalloc <pymalloc>` кожного разу, коли створюється нова арена об’єкта pymalloc, а також після завершення роботи.

source: This variable is ignored if the :envvar:`PYTHONMALLOC` environment variable is used to force the :c:func:`malloc` allocator of the C library, or if Python is configured without ``pymalloc`` support.
uk: Ця змінна ігнорується, якщо змінна середовища :envvar:`PYTHONMALLOC` використовується для примусового виділення :c:func:`malloc` бібліотеки C, або якщо Python налаштовано без підтримки ``pymalloc``.

source: This variable can now also be used on Python compiled in release mode. It now has no effect if set to an empty string.
uk: Цю змінну тепер також можна використовувати на Python, скомпільованому в режимі випуску. Тепер це не має ефекту, якщо встановлено порожній рядок.

source: This may also be enabled at runtime with :func:`sys._enablelegacywindowsfsencoding()`.
uk: Це також можна ввімкнути під час виконання за допомогою :func:`sys._enablelegacywindowsfsencoding()`.

source: :ref:`Availability <availability>`: Windows.
uk: :ref:`Наявність <availability>`: Windows.

source: See :pep:`529` for more details.
uk: Дивіться :pep:`529` для більш детальної інформації.

source: If set to a non-empty string, does not use the new console reader and writer. This means that Unicode characters will be encoded according to the active console code page, rather than using utf-8.
uk: Якщо встановлено непорожній рядок, новий засіб читання та запису консолі не використовується. Це означає, що символи Unicode кодуватимуться відповідно до активної кодової сторінки консолі, а не за допомогою utf-8.

source: This variable is ignored if the standard streams are redirected (to files or pipes) rather than referring to console buffers.
uk: Ця змінна ігнорується, якщо стандартні потоки перенаправляються (до файлів або каналів), а не посилаються на буфери консолі.

source: If set to the value ``0``, causes the main Python command line application to skip coercing the legacy ASCII-based C and POSIX locales to a more capable UTF-8 based alternative.
uk: Якщо встановлено значення ``0``, основна програма командного рядка Python пропускає приведення застарілих локалей на основі ASCII C і POSIX до більш дієвої альтернативи на основі UTF-8.

source: If this variable is *not* set (or is set to a value other than ``0``), the ``LC_ALL`` locale override environment variable is also not set, and the current locale reported for the ``LC_CTYPE`` category is either the default ``C`` locale, or else the explicitly ASCII-based ``POSIX`` locale, then the Python CLI will attempt to configure the following locales for the ``LC_CTYPE`` category in the order listed before loading the interpreter runtime:
uk: Якщо цю змінну *не* встановлено (або встановлено значення, відмінне від ``0``), змінна середовища ``LC_ALL``, яка замінює локаль, також не встановлена, і поточна локаль повідомляється для ``LC_CTYPE`` категорія є або локаллю ``C`` за замовчуванням, або явно заснованою на ASCII локаллю ``POSIX``, тоді Python CLI спробує налаштувати такі мови для категорії ``LC_CTYPE`` у зазначеному порядку перед завантаженням середовища виконання інтерпретатора:

source: If setting one of these locale categories succeeds, then the ``LC_CTYPE`` environment variable will also be set accordingly in the current process environment before the Python runtime is initialized. This ensures that in addition to being seen by both the interpreter itself and other locale-aware components running in the same process (such as the GNU ``readline`` library), the updated setting is also seen in subprocesses (regardless of whether or not those processes are running a Python interpreter), as well as in operations that query the environment rather than the current C locale (such as Python's own :func:`locale.getdefaultlocale`).
uk: Якщо встановлення однієї з цих категорій локалі вдасться, тоді змінна середовища ``LC_CTYPE`` також буде встановлена відповідним чином у поточному середовищі процесу до ініціалізації середовища виконання Python. Це гарантує, що окрім перегляду як самим інтерпретатором, так і іншими компонентами, що працюють у тому самому процесі (таких як бібліотека GNU ``readline``), оновлене налаштування також видно у підпроцесах (незалежно від того, чи не ці процеси запускають інтерпретатор Python), а також в операціях, які запитують середовище, а не поточну локаль C (наприклад, власний :func:`locale.getdefaultlocale` Python).
