Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/using/configure.po
Languages: ru

source: Configure Python
ru: Настроить Python

source: Build Requirements
ru: Требования к сборке

source: Features and minimum versions required to build CPython:
ru: Функции и минимальные версии, необходимые для сборки CPython:

source: A `C11 <https://en.cppreference.com/w/c/11>`_ compiler. `Optional C11 features <https://en.wikipedia.org/wiki/C11_(C_standard_revision)#Optional_features>`_ are not required.
ru: Компилятор `C11 <https://en.cppreference.com/w/c/11>`_. `Дополнительные функции C11 <https://en.wikipedia.org/wiki/C11_(C_standard_revision)#Optional_features>`_ не требуются.

source: On Windows, Microsoft Visual Studio 2017 or later is required.
ru: В Windows требуется Microsoft Visual Studio 2017 или новее.

source: Support for `IEEE 754 <https://en.wikipedia.org/wiki/IEEE_754>`_ floating-point numbers and `floating-point Not-a-Number (NaN) <https://en.wikipedia.org/wiki/NaN#Floating_point>`_.
ru: Поддержка `IEEE 754 <https://en.wikipedia.org/wiki/IEEE_754>`_ чисел с плавающей запятой и `числа с плавающей запятой Not-a-Number (NaN) <https://en.wikipedia.org/ wiki/NaN#Floating_point>`_.

source: Support for threads.
ru: Поддержка потоков.

source: OpenSSL 1.1.1 is the minimum version and OpenSSL 3.0.9 is the recommended minimum version for the :mod:`ssl` and :mod:`hashlib` extension modules.
ru: OpenSSL 1.1.1 — это минимальная версия, а OpenSSL 3.0.9 — рекомендуемая минимальная версия для модулей расширения :mod:`ssl` и :mod:`hashlib`.

source: SQLite 3.15.2 for the :mod:`sqlite3` extension module.
ru: SQLite 3.15.2 для модуля расширения :mod:`sqlite3`.

source: Tcl/Tk 8.5.12 for the :mod:`tkinter` module.
ru: Tcl/Tk 8.5.12 для модуля :mod:`tkinter`.

source: Autoconf 2.71 and aclocal 1.16.5 are required to regenerate the :file:`configure` script.
ru: Autoconf 2.71 и aclocal 1.16.5 необходимы для повторного создания сценария :file:`configure`.

source: Tcl/Tk version 8.3.1 is now required.
ru: Теперь требуется Tcl/Tk версии 8.3.1.

source: On Windows, Visual Studio 2015 or later is now required. Tcl/Tk version 8.4 is now required.
ru: В Windows теперь требуется Visual Studio 2015 или более поздней версии. Теперь требуется Tcl/Tk версии 8.4.

source: Selected C99 features are now required, like ``<stdint.h>`` and ``static inline`` functions.
ru: Теперь требуются некоторые функции C99, такие как ``<stdint.h>`` и ``статические встроенные`` функции.

source: Thread support and OpenSSL 1.0.2 are now required.
ru: Теперь требуется поддержка потоков и OpenSSL 1.0.2.

source: OpenSSL 1.1.1 is now required. Require SQLite 3.7.15.
ru: Теперь требуется OpenSSL 1.1.1. Требуется SQLite 3.7.15.

source: C11 compiler, IEEE 754 and NaN support are now required. On Windows, Visual Studio 2017 or later is required. Tcl/Tk version 8.5.12 is now required for the :mod:`tkinter` module.
ru: Теперь требуется компилятор C11, поддержка IEEE 754 и NaN. В Windows требуется Visual Studio 2017 или более поздней версии. Tcl/Tk версии 8.5.12 теперь требуется для модуля :mod:`tkinter`.

source: Autoconf 2.71, aclocal 1.16.5 and SQLite 3.15.2 are now required.
ru: Теперь требуются Autoconf 2.71, aclocal 1.16.5 и SQLite 3.15.2.

source: See also :pep:`7` "Style Guide for C Code" and :pep:`11` "CPython platform support".
ru: См. также :pep:`7` "Руководство по стилю для кода C" и :pep:`11` "Поддержка платформы CPython".

source: Generated files
ru: Сгенерированные файлы

source: To reduce build dependencies, Python source code contains multiple generated files. Commands to regenerate all generated files::
ru: Чтобы уменьшить зависимости сборки, исходный код Python содержит несколько сгенерированных файлов. Команды для регенерации всех сгенерированных файлов::

source: The ``Makefile.pre.in`` file documents generated files, their inputs, and tools used to regenerate them. Search for ``regen-*`` make targets.
ru: Файл ``Makefile.pre.in`` документирует сгенерированные файлы, их входные данные и инструменты, используемые для их восстановления. Найдите ``regen-*`` make target.

source: configure script
ru: настроить скрипт

source: The ``make regen-configure`` command regenerates the ``aclocal.m4`` file and the ``configure`` script using the ``Tools/build/regen-configure.sh`` shell script which uses an Ubuntu container to get the same tools versions and have a reproducible output.
ru: Команда make regen-configure восстанавливает файл aclocal.m4 и сценарий configure с помощью сценария оболочки Tools/build/regen-configure.sh, который использует контейнер Ubuntu. чтобы получить одни и те же версии инструментов и иметь воспроизводимый результат.

source: The container is optional, the following command can be run locally::
ru: Контейнер не является обязательным, следующую команду можно запустить локально:

source: The generated files can change depending on the exact ``autoconf-archive``, ``aclocal`` and ``pkg-config`` versions.
ru: Сгенерированные файлы могут меняться в зависимости от конкретных версий autoconf-archive, aclocal и pkg-config.

source: Configure Options
ru: Настроить параметры

source: List all :file:`configure` script options using::
ru: Перечислите все параметры сценария :file:`configure`, используя::

source: See also the :file:`Misc/SpecialBuilds.txt` in the Python source distribution.
ru: См. также файл :file:`Misc/SpecialBuilds.txt` в дистрибутиве исходного кода Python.

source: General Options
ru: Общие параметры

source: Support loadable extensions in the :mod:`!_sqlite` extension module (default is no) of the :mod:`sqlite3` module.
ru: Поддержка загружаемых расширений в модуле расширения :mod:`!_sqlite` (по умолчанию — нет) модуля :mod:`sqlite3`.

source: See the :meth:`sqlite3.Connection.enable_load_extension` method of the :mod:`sqlite3` module.
ru: См. метод :meth:`sqlite3.Connection.enable_load_extension` модуля :mod:`sqlite3`.

source: Disable IPv6 support (enabled by default if supported), see the :mod:`socket` module.
ru: Отключите поддержку IPv6 (включена по умолчанию, если поддерживается), см. модуль :mod:`socket`.

source: Define the size in bits of Python :class:`int` digits: 15 or 30 bits.
ru: Определите размер в битах Python: цифры: class:`int`: 15 или 30 бит.

source: By default, the digit size is 30.
ru: По умолчанию размер цифр равен 30.

source: Define the ``PYLONG_BITS_IN_DIGIT`` to ``15`` or ``30``.
ru: Определите для ``PYLONG_BITS_IN_DIGIT`` значение ``15`` или ``30``.

source: See :data:`sys.int_info.bits_per_digit <sys.int_info>`.
ru: См. :data:`sys.int_info.bits_per_digit <sys.int_info>`.

source: Set the Python executable suffix to *SUFFIX*.
ru: Установите суффикс исполняемого файла Python на *SUFFIX*.

source: The default suffix is ``.exe`` on Windows and macOS (``python.exe`` executable), ``.js`` on Emscripten node, ``.html`` on Emscripten browser, ``.wasm`` on WASI, and an empty string on other platforms (``python`` executable).
ru: Суффиксом по умолчанию является ``.exe`` в Windows и macOS (исполняемый файл ``python.exe``), ``.js`` на узле Emscripten, ``.html`` в браузере Emscripten, ``.wasm` ` на WASI и пустая строка на других платформах (исполняемый файл ``python``).

source: The default suffix on WASM platform is one of ``.js``, ``.html`` or ``.wasm``.
ru: Суффиксом по умолчанию на платформе WASM является один из ``.js``, ``.html`` или ``.wasm``.

source: Select the default time zone search path for :const:`zoneinfo.TZPATH`. See the :ref:`Compile-time configuration <zoneinfo_data_compile_time_config>` of the :mod:`zoneinfo` module.
ru: Выберите путь поиска часового пояса по умолчанию для :const:`zoneinfo.TZPATH`. См. конфигурацию времени компиляции <zoneinfo_data_compile_time_config> модуля :mod:`zoneinfo`.

source: Default: ``/usr/share/zoneinfo:/usr/lib/zoneinfo:/usr/share/lib/zoneinfo:/etc/zoneinfo``.
ru: По умолчанию: ``/usr/share/zoneinfo:/usr/lib/zoneinfo:/usr/share/lib/zoneinfo:/etc/zoneinfo``

source: See :data:`os.pathsep` path separator.
ru: См. разделитель путей :data:`os.pathsep`.

source: Build the ``_decimal`` extension module using a thread-local context rather than a coroutine-local context (default), see the :mod:`decimal` module.
ru: Создайте модуль расширения ``_decimal``, используя локальный контекст потока, а не локальный контекст сопрограммы (по умолчанию), см. модуль :mod:`decimal`.

source: See :const:`decimal.HAVE_CONTEXTVAR` and the :mod:`contextvars` module.
ru: См. :const:`decimal.HAVE_CONTEXTVAR` и модуль :mod:`contextvars`.

source: Override order to check db backends for the :mod:`dbm` module
ru: Переопределить порядок проверки серверных частей БД для модуля :mod:`dbm`

source: A valid value is a colon (``:``) separated string with the backend names:
ru: Допустимым значением является строка с именами серверов, разделенная двоеточием (``:``):

source: Disable C locale coercion to a UTF-8 based locale (enabled by default).
ru: Отключите приведение локали C к локали на основе UTF-8 (включено по умолчанию).

source: Don't define the ``PY_COERCE_C_LOCALE`` macro.
ru: Не определяйте макрос PY_COERCE_C_LOCALE.

source: See :envvar:`PYTHONCOERCECLOCALE` and the :pep:`538`.
ru: См. :envvar:`PYTHONCOERCECLOCALE` и :pep:`538`.

source: Disable all freelists except the empty tuple singleton.
ru: Отключите все свободные списки, кроме пустого одиночного кортежа.

source: Python library directory name (default is ``lib``).
ru: Имя каталога библиотеки Python (по умолчанию — ``lib``).

source: Fedora and SuSE use ``lib64`` on 64-bit platforms.
ru: Fedora и SuSE используют lib64 на 64-битных платформах.

source: See :data:`sys.platlibdir`.
ru: См. :data:`sys.platlibdir`.

source: Directory of wheel packages used by the :mod:`ensurepip` module (none by default).
ru: Каталог пакетов колес, используемых модулем :mod:`ensurepip` (по умолчанию нет).

source: Some Linux distribution packaging policies recommend against bundling dependencies. For example, Fedora installs wheel packages in the ``/usr/share/python-wheels/`` directory and don't install the :mod:`!ensurepip._bundled` package.
ru: Некоторые политики упаковки дистрибутива Linux не рекомендуют объединять зависимости. Например, Fedora устанавливает пакеты Wheel в каталог ``/usr/share/python-wheels/`` и не устанавливает пакет :mod:`!ensurepip._bundled`.

source: Whether configure should use :program:`pkg-config` to detect build dependencies.
ru: Должен ли configure использовать :program:`pkg-config` для обнаружения зависимостей сборки.

source: ``check`` (default): :program:`pkg-config` is optional
ru: ``check`` (по умолчанию): :program:`pkg-config` не является обязательным.

source: ``yes``: :program:`pkg-config` is mandatory
ru: ``да``: :program:`pkg-config` является обязательным

source: ``no``: configure does not use :program:`pkg-config` even when present
ru: ``no``: configure не использует :program:`pkg-config`, даже если он присутствует.

source: Turn on internal Python performance statistics gathering.
ru: Включите сбор внутренней статистики производительности Python.

source: By default, statistics gathering is off. Use ``python3 -X pystats`` command or set ``PYTHONSTATS=1`` environment variable to turn on statistics gathering at Python startup.
ru: По умолчанию сбор статистики отключен. Используйте команду ``python3 -X pystats`` или установите переменную среды ``PYTHONSTATS=1``, чтобы включить сбор статистики при запуске Python.

source: At Python exit, dump statistics if statistics gathering was on and not cleared.
ru: При выходе Python выгрузить статистику, если сбор статистики был включен и не очищен.

source: Effects:
ru: Эффекты:

source: Add :option:`-X pystats <-X>` command line option.
ru: Добавьте параметр командной строки :option:`-X pystats <-X>`.

source: Add :envvar:`!PYTHONSTATS` environment variable.
ru: Добавьте переменную среды :envvar:`!PYTHONSTATS`.

source: Define the ``Py_STATS`` macro.
ru: Определите макрос ``Py_STATS``.

source: Add functions to the :mod:`sys` module:
ru: Добавьте функции в модуль :mod:`sys`:

source: :func:`!sys._stats_on`: Turns on statistics gathering.
ru: :func:`!sys._stats_on`: Включает сбор статистики.

source: :func:`!sys._stats_off`: Turns off statistics gathering.
ru: :func:`!sys._stats_off`: Отключает сбор статистики.

source: :func:`!sys._stats_clear`: Clears the statistics.
ru: :func:`!sys._stats_clear`: Очищает статистику.

source: :func:`!sys._stats_dump`: Dump statistics to file, and clears the statistics.
ru: :func:`!sys._stats_dump`: Сбрасывает статистику в файл и очищает ее.

source: The statistics will be dumped to a arbitrary (probably unique) file in ``/tmp/py_stats/`` (Unix) or ``C:\temp\py_stats\`` (Windows). If that directory does not exist, results will be printed on stderr.
ru: Статистика будет сохранена в произвольный (возможно, уникальный) файл в ``/tmp/py_stats/`` (Unix) или ``C:\temp\py_stats\`` (Windows). Если этот каталог не существует, результаты будут напечатаны в stderr.

source: Use ``Tools/scripts/summarize_stats.py`` to read the stats.
ru: Используйте «Инструменты/скрипты/summarize_stats.py», чтобы прочитать статистику.

source: Statistics:
ru: Статистика:

source: Opcode:
ru: Код операции:

source: Specialization: success, failure, hit, deferred, miss, deopt, failures;
ru: Специализация: успех, неудача, попадание, отсрочка, промах, деоптация, неудачи;

source: Execution count;
ru: количество выполнений;

source: Pair count.
ru: Парный счет.

source: Call:
ru: Вызов:

source: Inlined Python calls;
ru: Встроенные вызовы Python;

source: PyEval calls;
ru: PyEval вызовы;

source: Frames pushed;
ru: Рамки сдвинуты;

source: Frame object created;
ru: Объект фрейма создан;

source: Eval calls: vector, generator, legacy, function VECTORCALL, build class, slot, function "ex", API, method.
ru: Вызовы Eval: вектор, генератор, наследие, функция VECTORCALL, класс сборки, слот, функция «ex», API, метод.

source: Object:
ru: Объект:

source: incref and decref;
ru: увеличение и уменьшение;

source: interpreter incref and decref;
ru: интерпретатор incref и decref;

source: allocations: all, 512 bytes, 4 kiB, big;
ru: выделения: все, 512 байт, 4 КБ, большие;

source: free;
ru: бесплатно;

source: to/from free lists;
ru: в/из бесплатных списков;

source: dictionary materialized/dematerialized;
ru: словарь материализованный/дематериализованный;

source: type cache;
ru: тип кэша;

source: optimization attempts;
ru: попытки оптимизации;

source: optimization traces created/executed;
ru: трассы оптимизации созданы/выполнены;

source: uops executed.
ru: uops выполнено.

source: Garbage collector:
ru: Сборщик мусора:

source: Garbage collections;
ru: Сбор мусора;

source: Objects visited;
ru: Посещенные объекты;

source: Objects collected.
ru: Предметы собраны.

source: Enables **experimental** support for running Python without the :term:`global interpreter lock` (GIL): free threading build.
ru: Включает **экспериментальную** поддержку запуска Python без :term:`глобальной блокировки интерпретатора` (GIL): бесплатная многопоточная сборка.

source: Defines the ``Py_GIL_DISABLED`` macro and adds ``"t"`` to :data:`sys.abiflags`.
ru: Определяет макрос ``Py_GIL_DISABLED`` и добавляет ``"t"`` в :data:`sys.abiflags`.

source: See :ref:`whatsnew313-free-threaded-cpython` for more detail.
ru: Более подробную информацию смотрите в разделе :ref:`whatsnew313-free-threaded-cpython`.

source: Indicate how to integrate the :ref:`JIT compiler <whatsnew313-jit-compiler>`.
ru: Укажите, как интегрировать :ref:`JIT-компилятор <whatsnew313-jit-compiler>`.

source: ``no`` - build the interpreter without the JIT.
ru: ``no`` - собрать интерпретатор без JIT.

source: ``yes`` - build the interpreter with the JIT.
ru: ``yes`` - собрать интерпретатор с помощью JIT.

source: ``yes-off`` - build the interpreter with the JIT but disable it by default.
ru: ``yes-off`` — собрать интерпретатор с помощью JIT, но отключить его по умолчанию.

source: ``interpreter`` - build the interpreter without the JIT, but with the tier 2 enabled interpreter.
ru: ``interpreter`` — создайте интерпретатор без JIT, но с включенным интерпретатором уровня 2.

source: By convention, ``--enable-experimental-jit`` is a shorthand for ``--enable-experimental-jit=yes``.
ru: По соглашению ``--enable-experimental-jit`` является сокращением ``--enable-experimental-jit=yes``.

source: Path to ``pkg-config`` utility.
ru: Путь к утилите pkg-config.

source: ``pkg-config`` options.
ru: Опции ``pkg-config``.

source: C compiler options
ru: Параметры компилятора C

source: C compiler command.
ru: Команда компилятора C.

source: C compiler flags.
ru: Флаги компилятора C.

source: C preprocessor command.
ru: Команда препроцессора C.

source: C preprocessor flags, e.g. :samp:`-I{include_dir}`.
ru: Флаги препроцессора C, например :samp:`-I{include_dir}`.

source: Linker options
ru: Параметры компоновщика

source: Linker flags, e.g. :samp:`-L{library_directory}`.
ru: Флаги компоновщика, например :samp:`-L{library_directory}`.

source: Libraries to pass to the linker, e.g. :samp:`-l{library}`.
ru: Библиотеки, которые нужно передать компоновщику, например :samp:`-l{library}`.

source: Name for machine-dependent library files.
ru: Имя для файлов машинно-зависимой библиотеки.

source: Options for third-party dependencies
ru: Варианты сторонних зависимостей

source: C compiler and linker flags to link Python to ``libbz2``, used by :mod:`bz2` module, overriding ``pkg-config``.
ru: Флаги компилятора C и компоновщика для связывания Python с libbz2, используемые модулем :mod:bz2, переопределяющие pkg-config.

source: C compiler and linker flags for ``libncurses`` or ``libncursesw``, used by :mod:`curses` module, overriding ``pkg-config``.
ru: Флаги компилятора и компоновщика C для ``libncurses`` или ``libncursesw``, используемые модулем :mod:`curses`, переопределяющие ``pkg-config``.

source: C compiler and linker flags for ``gdbm``.
ru: Флаги компилятора C и компоновщика для ``gdbm``.

source: C compiler and linker flags for ``libb2`` (:ref:`BLAKE2 <hashlib-blake2>`), used by :mod:`hashlib` module, overriding ``pkg-config``.
ru: Флаги компилятора и компоновщика C для libb2 (:ref:`BLAKE2 <hashlib-blake2>`), используемые модулем :mod:`hashlib`, переопределяющие ``pkg-config``.

source: C compiler and linker flags for ``libedit``, used by :mod:`readline` module, overriding ``pkg-config``.
ru: Флаги компилятора C и компоновщика для ``libedit``, используемые модулем :mod:`readline`, переопределяющие ``pkg-config``.

source: C compiler and linker flags for ``libffi``, used by :mod:`ctypes` module, overriding ``pkg-config``.
ru: Флаги компилятора C и компоновщика для ``libffi``, используемые модулем :mod:`ctypes`, переопределяющие ``pkg-config``.

source: C compiler and linker flags for ``libmpdec``, used by :mod:`decimal` module, overriding ``pkg-config``.
ru: Флаги компилятора C и компоновщика для ``libmpdec``, используемые модулем :mod:`decimal`, переопределяющие ``pkg-config``.

source: These environment variables have no effect unless :option:`--with-system-libmpdec` is specified.
ru: Эти переменные среды не имеют никакого эффекта, если не указан :option:`--with-system-libmpdec`.

source: C compiler and linker flags for ``liblzma``, used by :mod:`lzma` module, overriding ``pkg-config``.
ru: Флаги компилятора и компоновщика C для ``liblzma``, используемые модулем :mod:`lzma`, переопределяющие ``pkg-config``.

source: C compiler and linker flags for ``libreadline``, used by :mod:`readline` module, overriding ``pkg-config``.
ru: Флаги компилятора C и компоновщика для ``libreadline``, используемые модулем :mod:`readline`, переопределяющие ``pkg-config``.

source: C compiler and linker flags for ``libsqlite3``, used by :mod:`sqlite3` module, overriding ``pkg-config``.
ru: Флаги компилятора и компоновщика C для ``libsqlite3``, используемые модулем :mod:`sqlite3`, переопределяющие ``pkg-config``.

source: C compiler and linker flags for ``libuuid``, used by :mod:`uuid` module, overriding ``pkg-config``.
ru: Флаги компилятора C и компоновщика для ``libuuid``, используемые модулем :mod:`uuid`, переопределяющие ``pkg-config``.

source: C compiler and linker flags for PANEL, overriding ``pkg-config``.
ru: Флаги компилятора C и компоновщика для PANEL, переопределяющие ``pkg-config``.

source: C compiler and linker flags for ``libpanel`` or ``libpanelw``, used by :mod:`curses.panel` module, overriding ``pkg-config``.
ru: Флаги компилятора и компоновщика C для ``libpanel`` или ``libpanelw``, используемые модулем :mod:`curses.panel`, переопределяющие ``pkg-config``.

source: C compiler and linker flags for TCLTK, overriding ``pkg-config``.
ru: Флаги компилятора и компоновщика C для TCLTK, переопределяющие ``pkg-config``.

source: C compiler and linker flags for ``libzlib``, used by :mod:`gzip` module, overriding ``pkg-config``.
ru: Флаги компилятора C и компоновщика для ``libzlib``, используемые модулем :mod:`gzip`, переопределяющие ``pkg-config``.

source: WebAssembly Options
ru: опции WebAssembly

source: Set build flavor for ``wasm32-emscripten``.
ru: Установите вариант сборки для «wasm32-emscripten».

source: ``browser`` (default): preload minimal stdlib, default MEMFS.
ru: ``браузер`` (по умолчанию): предварительная загрузка минимальной стандартной библиотеки, по умолчанию MEMFS.

source: ``node``: NODERAWFS and pthread support.
ru: ``node``: поддержка NODERAWFS и pthread.

source: Turn on dynamic linking support for WASM.
ru: Включите поддержку динамического связывания для WASM.

source: Dynamic linking enables ``dlopen``. File size of the executable increases due to limited dead code elimination and additional features.
ru: Динамическое связывание включает ``dlopen``. Размер исполняемого файла увеличивается из-за ограниченного устранения мертвого кода и дополнительных функций.

source: Turn on pthreads support for WASM.
ru: Включите поддержку pthreads для WASM.

source: Install Options
ru: Варианты установки

source: Install architecture-independent files in PREFIX. On Unix, it defaults to :file:`/usr/local`.
ru: Установите независимые от архитектуры файлы в PREFIX. В Unix по умолчанию это :file:`/usr/local`.

source: This value can be retrieved at runtime using :data:`sys.prefix`.
ru: Это значение можно получить во время выполнения, используя :data:`sys.prefix`.

source: As an example, one can use ``--prefix="$HOME/.local/"`` to install a Python in its home directory.
ru: Например, можно использовать ``--prefix="$HOME/.local/"`` для установки Python в его домашний каталог.

source: Install architecture-dependent files in EPREFIX, defaults to :option:`--prefix`.
ru: Устанавливайте файлы, зависящие от архитектуры, в EPREFIX, по умолчанию используется :option:`--prefix`.

source: This value can be retrieved at runtime using :data:`sys.exec_prefix`.
ru: Это значение можно получить во время выполнения с помощью :data:`sys.exec_prefix`.

source: Don't build nor install test modules, like the :mod:`test` package or the :mod:`!_testcapi` extension module (built and installed by default).
ru: Не создавайте и не устанавливайте тестовые модули, такие как пакет :mod:`test` или модуль расширения :mod:`!_testcapi` (собранный и установленный по умолчанию).

source: Select the :mod:`ensurepip` command run on Python installation:
ru: Выберите команду :mod:`ensurepip`, запускаемую при установке Python:

source: ``upgrade`` (default): run ``python -m ensurepip --altinstall --upgrade`` command.
ru: ``upgrade`` (по умолчанию): запустите команду ``python -m securepip --altinstall --upgrade``.

source: ``install``: run ``python -m ensurepip --altinstall`` command;
ru: ``install``: запустите команду ``python -m securepip --altinstall``;

source: ``no``: don't run ensurepip;
ru: ``нет``: не запускать обеспечения;

source: Performance options
ru: Параметры производительности
