Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/using/configure.po
Languages: ru

source: Configuring Python using ``--enable-optimizations --with-lto`` (PGO + LTO) is recommended for best performance. The experimental ``--enable-bolt`` flag can also be used to improve performance.
ru: Для достижения наилучшей производительности рекомендуется настроить Python с использованием ``--enable-optimizations --with-lto`` (PGO + LTO). Экспериментальный флаг --enable-bolt также можно использовать для повышения производительности.

source: Enable Profile Guided Optimization (PGO) using :envvar:`PROFILE_TASK` (disabled by default).
ru: Включите оптимизацию по профилю (PGO), используя :envvar:`PROFILE_TASK` (по умолчанию отключено).

source: The C compiler Clang requires ``llvm-profdata`` program for PGO. On macOS, GCC also requires it: GCC is just an alias to Clang on macOS.
ru: Компилятору C Clang требуется программа ``llvm-profdata`` для PGO. В macOS этого также требует GCC: GCC — это просто псевдоним Clang в macOS.

source: Disable also semantic interposition in libpython if ``--enable-shared`` and GCC is used: add ``-fno-semantic-interposition`` to the compiler and linker flags.
ru: Отключите также семантическую интерпозицию в libpython, если используется ``--enable-shared`` и GCC: добавьте ``-fno-semantic-interposition`` к флагам компилятора и компоновщика.

source: During the build, you may encounter compiler warnings about profile data not being available for some source files. These warnings are harmless, as only a subset of the code is exercised during profile data acquisition. To disable these warnings on Clang, manually suppress them by adding ``-Wno-profile-instr-unprofiled`` to :envvar:`CFLAGS`.
ru: Во время сборки вы можете столкнуться с предупреждениями компилятора о том, что данные профиля недоступны для некоторых исходных файлов. Эти предупреждения безвредны, поскольку при получении данных профиля используется только часть кода. Чтобы отключить эти предупреждения в Clang, вручную подавите их, добавив ``-Wno-profile-instr-unprofiled`` в :envvar:`CFLAGS`.

source: Use ``-fno-semantic-interposition`` on GCC.
ru: Используйте ``-fno-semantic-interposition`` в GCC.

source: Environment variable used in the Makefile: Python command line arguments for the PGO generation task.
ru: Переменная среды, используемая в аргументах командной строки Makefile: Python для задачи создания PGO.

source: Default: ``-m test --pgo --timeout=$(TESTTIMEOUT)``.
ru: По умолчанию: ``-m test --pgo --timeout=$(TESTTIMEOUT)``.

source: Task failure is no longer ignored silently.
ru: Сбой задачи больше не игнорируется молча.

source: Enable Link Time Optimization (LTO) in any build (disabled by default).
ru: Включите оптимизацию времени соединения (LTO) в любой сборке (по умолчанию отключено).

source: The C compiler Clang requires ``llvm-ar`` for LTO (``ar`` on macOS), as well as an LTO-aware linker (``ld.gold`` or ``lld``).
ru: Компилятору C Clang требуется ``llvm-ar`` для LTO (``ar`` в macOS), а также компоновщик, поддерживающий LTO (``ld.gold`` или ``lld``).

source: To use ThinLTO feature, use ``--with-lto=thin`` on Clang.
ru: Чтобы использовать функцию ThinLTO, используйте ``--with-lto=thin`` в Clang.

source: Use ThinLTO as the default optimization policy on Clang if the compiler accepts the flag.
ru: Используйте ThinLTO в качестве политики оптимизации по умолчанию в Clang, если компилятор принимает этот флаг.

source: Enable usage of the `BOLT post-link binary optimizer <https://github.com/llvm/llvm-project/tree/main/bolt>`_ (disabled by default).
ru: Включите использование `двоичного оптимизатора post-link BOLT <https://github.com/llvm/llvm-project/tree/main/bolt>`_ (отключено по умолчанию).

source: BOLT is part of the LLVM project but is not always included in their binary distributions. This flag requires that ``llvm-bolt`` and ``merge-fdata`` are available.
ru: BOLT является частью проекта LLVM, но не всегда включается в их бинарные дистрибутивы. Этот флаг требует, чтобы были доступны ``llvm-bolt`` и ``merge-fdata``.

source: BOLT is still a fairly new project so this flag should be considered experimental for now. Because this tool operates on machine code its success is dependent on a combination of the build environment + the other optimization configure args + the CPU architecture, and not all combinations are supported. BOLT versions before LLVM 16 are known to crash BOLT under some scenarios. Use of LLVM 16 or newer for BOLT optimization is strongly encouraged.
ru: BOLT — все еще довольно новый проект, поэтому этот флаг пока следует считать экспериментальным. Поскольку этот инструмент работает с машинным кодом, его успех зависит от комбинации среды сборки + других аргументов оптимизации + архитектуры ЦП, и не все комбинации поддерживаются. Известно, что версии BOLT до LLVM 16 приводят к сбою BOLT в некоторых сценариях. Настоятельно рекомендуется использовать LLVM 16 или новее для оптимизации BOLT.

source: The :envvar:`!BOLT_INSTRUMENT_FLAGS` and :envvar:`!BOLT_APPLY_FLAGS` :program:`configure` variables can be defined to override the default set of arguments for :program:`llvm-bolt` to instrument and apply BOLT data to binaries, respectively.
ru: Переменные :envvar:`!BOLT_INSTRUMENT_FLAGS` и :envvar:`!BOLT_APPLY_FLAGS` :program:`configure` могут быть определены для переопределения набора аргументов по умолчанию для :program:`llvm-bolt` для инструментирования и применения данных BOLT к двоичным файлам. , соответственно.

source: Arguments to ``llvm-bolt`` when creating a `BOLT optimized binary <https://github.com/facebookarchive/BOLT>`_.
ru: Аргументы ``llvm-bolt`` при создании ``BOLT-оптимизированного двоичного файла <https://github.com/facebookarchive/BOLT>`_.

source: Arguments to ``llvm-bolt`` when instrumenting binaries.
ru: Аргументы ``llvm-bolt`` при инструментировании двоичных файлов.

source: Enable computed gotos in evaluation loop (enabled by default on supported compilers).
ru: Включить вычисляемые переходы в цикле оценки (включено по умолчанию в поддерживаемых компиляторах).

source: Disable the fast :ref:`mimalloc <mimalloc>` allocator (enabled by default).
ru: Отключите быстрый распределитель :ref:`mimalloc <mimalloc>` (включен по умолчанию).

source: See also :envvar:`PYTHONMALLOC` environment variable.
ru: См. также переменную среды :envvar:`PYTHONMALLOC`.

source: Disable the specialized Python memory allocator :ref:`pymalloc <pymalloc>` (enabled by default).
ru: Отключите специализированный распределитель памяти Python :ref:`pymalloc <pymalloc>` (включен по умолчанию).

source: Disable static documentation strings to reduce the memory footprint (enabled by default). Documentation strings defined in Python are not affected.
ru: Отключите статические строки документации, чтобы уменьшить объем памяти (включено по умолчанию). Строки документации, определенные в Python, не затрагиваются.

source: Don't define the ``WITH_DOC_STRINGS`` macro.
ru: Не определяйте макрос ``WITH_DOC_STRINGS``.

source: See the ``PyDoc_STRVAR()`` macro.
ru: См. макрос ``PyDoc_STRVAR()``.

source: Enable C-level code profiling with ``gprof`` (disabled by default).
ru: Включите профилирование кода уровня C с помощью gprof (по умолчанию отключено).

source: Add ``-fstrict-overflow`` to the C compiler flags (by default we add ``-fno-strict-overflow`` instead).
ru: Добавьте «-fstrict-overflow» к флагам компилятора C (по умолчанию вместо этого мы добавляем «-fno-strict-overflow»).

source: Python Debug Build
ru: Отладочная сборка Python

source: A debug build is Python built with the :option:`--with-pydebug` configure option.
ru: Отладочная сборка — это Python, созданный с параметром конфигурации :option:`--with-pydebug`.

source: Effects of a debug build:
ru: Эффекты отладочной сборки:

source: Display all warnings by default: the list of default warning filters is empty in the :mod:`warnings` module.
ru: По умолчанию отображать все предупреждения: список фильтров предупреждений по умолчанию пуст в модуле :mod:`warnings`.

source: Add ``d`` to :data:`sys.abiflags`.
ru: Добавьте ``d`` в :data:`sys.abiflags`.

source: Add :func:`!sys.gettotalrefcount` function.
ru: Добавьте функцию :func:`!sys.gettotalrefcount`.

source: Add :option:`-X showrefcount <-X>` command line option.
ru: Добавьте параметр командной строки :option:`-X showrefcount <-X>`.

source: Add :option:`-d` command line option and :envvar:`PYTHONDEBUG` environment variable to debug the parser.
ru: Добавьте параметр командной строки :option:`-d` и переменную среды :envvar:`PYTHONDEBUG` для отладки парсера.

source: Add support for the ``__lltrace__`` variable: enable low-level tracing in the bytecode evaluation loop if the variable is defined.
ru: Добавьте поддержку переменной ``__lltrace__``: включите низкоуровневую трассировку в цикле оценки байт-кода, если переменная определена.

source: Install :ref:`debug hooks on memory allocators <default-memory-allocators>` to detect buffer overflow and other memory errors.
ru: Установите :ref:`перехватчики отладки на распределителях памяти <default-memory-allocators>` для обнаружения переполнения буфера и других ошибок памяти.

source: Define ``Py_DEBUG`` and ``Py_REF_DEBUG`` macros.
ru: Определите макросы Py_DEBUG и Py_REF_DEBUG.

source: Add runtime checks: code surrounded by ``#ifdef Py_DEBUG`` and ``#endif``. Enable ``assert(...)`` and ``_PyObject_ASSERT(...)`` assertions: don't set the ``NDEBUG`` macro (see also the :option:`--with-assertions` configure option). Main runtime checks:
ru: Добавьте проверки во время выполнения: код, окруженный ``#ifdef Py_DEBUG`` и ``#endif``. Включите утверждения ``assert(...)`` и ``_PyObject_ASSERT(...)``: не устанавливайте макрос ``NDEBUG`` (см. также настройку :option:`--with-assertions` вариант). Основные проверки во время выполнения:

source: Add sanity checks on the function arguments.
ru: Добавьте проверки работоспособности аргументов функции.

source: Unicode and int objects are created with their memory filled with a pattern to detect usage of uninitialized objects.
ru: Объекты Unicode и int создаются, память которых заполняется шаблоном для обнаружения использования неинициализированных объектов.

source: Ensure that functions which can clear or replace the current exception are not called with an exception raised.
ru: Убедитесь, что функции, которые могут очистить или заменить текущее исключение, не вызываются при возникновении исключения.

source: Check that deallocator functions don't change the current exception.
ru: Убедитесь, что функции освобождения не изменяют текущее исключение.

source: The garbage collector (:func:`gc.collect` function) runs some basic checks on objects consistency.
ru: Сборщик мусора (функция:func:`gc.collect`) выполняет некоторые базовые проверки согласованности объектов.

source: The :c:macro:`!Py_SAFE_DOWNCAST()` macro checks for integer underflow and overflow when downcasting from wide types to narrow types.
ru: Макрос :c:macro:`!Py_SAFE_DOWNCAST()` проверяет отсутствие переполнения и переполнения целочисленных значений при понижающем приведении от широких типов к узким типам.

source: See also the :ref:`Python Development Mode <devmode>` and the :option:`--with-trace-refs` configure option.
ru: См. также :ref:`Режим разработки Python <devmode>` и параметр конфигурации :option:`--with-trace-refs`.

source: Release builds and debug builds are now ABI compatible: defining the ``Py_DEBUG`` macro no longer implies the ``Py_TRACE_REFS`` macro (see the :option:`--with-trace-refs` option).
ru: Релизные сборки и отладочные сборки теперь совместимы с ABI: определение макроса Py_DEBUG больше не подразумевает использование макроса Py_TRACE_REFS (см. параметр :option:`--with-trace-refs`).

source: Debug options
ru: Параметры отладки

source: :ref:`Build Python in debug mode <debug-build>`: define the ``Py_DEBUG`` macro (disabled by default).
ru: :ref:`Сборка Python в режиме отладки <debug-build>`: определите макрос ``Py_DEBUG`` (отключен по умолчанию).

source: Enable tracing references for debugging purpose (disabled by default).
ru: Включите отслеживание ссылок для целей отладки (по умолчанию отключено).

source: Define the ``Py_TRACE_REFS`` macro.
ru: Определите макрос ``Py_TRACE_REFS``.

source: Add :func:`sys.getobjects` function.
ru: Добавьте функцию :func:`sys.getobjects`.

source: Add :envvar:`PYTHONDUMPREFS` environment variable.
ru: Добавьте переменную среды :envvar:`PYTHONDUMPREFS`.

source: The :envvar:`PYTHONDUMPREFS` environment variable can be used to dump objects and reference counts still alive at Python exit.
ru: Переменная среды :envvar:`PYTHONDUMPREFS` может использоваться для вывода объектов и счетчиков ссылок, остающихся живыми при выходе Python.

source: :ref:`Statically allocated objects <static-types>` are not traced.
ru: :ref:`Статически выделенные объекты <static-types>` не отслеживаются.

source: This build is now ABI compatible with release build and :ref:`debug build <debug-build>`.
ru: Эта сборка теперь ABI совместима с выпускной сборкой и :ref:`debug build <debug-build>`.

source: Build with C assertions enabled (default is no): ``assert(...);`` and ``_PyObject_ASSERT(...);``.
ru: Сборка с включенными утверждениями C (по умолчанию нет): ``assert(...);`` и ``_PyObject_ASSERT(...);``.

source: If set, the ``NDEBUG`` macro is not defined in the :envvar:`OPT` compiler variable.
ru: Если он установлен, макрос NDEBUG не определен в переменной компилятора :envvar:OPT.

source: See also the :option:`--with-pydebug` option (:ref:`debug build <debug-build>`) which also enables assertions.
ru: См. также параметр :option:`--with-pydebug` (:ref:`debug build <debug-build>`), который также включает утверждения.

source: Enable Valgrind support (default is no).
ru: Включите поддержку Valgrind (по умолчанию нет).

source: Enable DTrace support (default is no).
ru: Включить поддержку DTrace (по умолчанию нет).

source: See :ref:`Instrumenting CPython with DTrace and SystemTap <instrumentation>`.
ru: См. :ref:`Инструментирование CPython с помощью DTrace и SystemTap <инструментация>`.

source: Enable AddressSanitizer memory error detector, ``asan`` (default is no).
ru: Включить детектор ошибок памяти AddressSanitizer, ``asan`` (по умолчанию — нет).

source: Enable MemorySanitizer allocation error detector, ``msan`` (default is no).
ru: Включить детектор ошибок выделения памяти MemorySanitizer, msan (по умолчанию нет).

source: Enable UndefinedBehaviorSanitizer undefined behaviour detector, ``ubsan`` (default is no).
ru: Включить детектор неопределенного поведения UndefineBehaviorSanitizer, ``ubsan`` (по умолчанию — нет).

source: Enable ThreadSanitizer data race detector, ``tsan`` (default is no).
ru: Включить детектор гонки данных ThreadSanitizer, ``tsan`` (по умолчанию — нет).

source: Enable building a shared Python library: ``libpython`` (default is no).
ru: Включите создание общей библиотеки Python: libpython (по умолчанию нет).

source: Do not build ``libpythonMAJOR.MINOR.a`` and do not install ``python.o`` (built and enabled by default).
ru: Не собирайте libpythonMAJOR.MINOR.a и не устанавливайте python.o (собран и включен по умолчанию).

source: Libraries options
ru: Параметры библиотек

source: Link against additional libraries (default is no).
ru: Ссылка на дополнительные библиотеки (по умолчанию нет).

source: Build the :mod:`!pyexpat` module using an installed ``expat`` library (default is no).
ru: Соберите модуль :mod:`!pyexpat`, используя установленную библиотеку ``expat`` (по умолчанию — no).

source: Build the ``_decimal`` extension module using an installed ``mpdecimal`` library, see the :mod:`decimal` module (default is yes).
ru: Создайте модуль расширения ``_decimal``, используя установленную библиотеку ``mpdecimal``, см. модуль :mod:`decimal` (по умолчанию — Yes).

source: Default to using the installed ``mpdecimal`` library.
ru: По умолчанию используется установленная библиотека mpdecimal.

source: A copy of the ``mpdecimal`` library sources will no longer be distributed with Python 3.15.
ru: Копия исходного кода библиотеки ``mpdecimal`` больше не будет распространяться вместе с Python 3.15.

source: :option:`LIBMPDEC_CFLAGS` and :option:`LIBMPDEC_LIBS`.
ru: :option:`LIBMPDEC_CFLAGS` и :option:`LIBMPDEC_LIBS`.

source: Designate a backend library for the :mod:`readline` module.
ru: Назначьте серверную библиотеку для модуля :mod:`readline`.

source: readline: Use readline as the backend.
ru: readline: используйте readline в качестве бэкэнда.

source: editline: Use editline as the backend.
ru: editline: используйте Editline в качестве бэкэнда.

source: Don't build the :mod:`readline` module (built by default).
ru: Не создавайте модуль :mod:`readline` (собирается по умолчанию).

source: Don't define the ``HAVE_LIBREADLINE`` macro.
ru: Не определяйте макрос HAVE_LIBREADLINE.

source: Override ``libm`` math library to *STRING* (default is system-dependent).
ru: Заменить математическую библиотеку ``libm`` на *STRING* (по умолчанию зависит от системы).

source: Override ``libc`` C library to *STRING* (default is system-dependent).
ru: Заменить библиотеку ``libc`` C на *STRING* (по умолчанию зависит от системы).

source: Root of the OpenSSL directory.
ru: Корень каталога OpenSSL.

source: Set runtime library directory (rpath) for OpenSSL libraries:
ru: Установите каталог библиотеки времени выполнения (rpath) для библиотек OpenSSL:

source: ``no`` (default): don't set rpath;
ru: ``no`` (по умолчанию): не устанавливать rpath;

source: ``auto``: auto-detect rpath from :option:`--with-openssl` and ``pkg-config``;
ru: ``auto``: автоматическое определение rpath из :option:`--with-openssl` и ``pkg-config``;

source: *DIR*: set an explicit rpath.
ru: *DIR*: укажите явный путь.

source: Security Options
ru: Параметры безопасности

source: Select hash algorithm for use in ``Python/pyhash.c``:
ru: Выберите алгоритм хэширования для использования в ``Python/pyhash.c``:

source: ``siphash13`` (default);
ru: ``siphash13`` (по умолчанию);

source: ``siphash13`` is added and it is the new default.
ru: Добавлен ``siphash13``, и это новое значение по умолчанию.

source: Built-in hash modules:
ru: Встроенные хеш-модули:

source: ``sha3`` (with shake);
ru: ``sha3`` (с встряхиванием);

source: Override the OpenSSL default cipher suites string:
ru: Переопределить строку наборов шифров OpenSSL по умолчанию:

source: ``python`` (default): use Python's preferred selection;
ru: ``python`` (по умолчанию): использовать предпочтительный выбор Python;

source: ``openssl``: leave OpenSSL's defaults untouched;
ru: ``openssl``: оставьте настройки OpenSSL по умолчанию нетронутыми;

source: *STRING*: use a custom string
ru: *STRING*: использовать пользовательскую строку

source: See the :mod:`ssl` module.
ru: См. модуль :mod:`ssl`.

source: The settings ``python`` and *STRING* also set TLS 1.2 as minimum protocol version.
ru: Настройки ``python`` и *STRING* также устанавливают TLS 1.2 в качестве минимальной версии протокола.

source: macOS Options
ru: Параметры macOS

source: See :source:`Mac/README.rst`.
ru: См. :source:`Mac/README.rst`.

source: Create a universal binary build. *SDKDIR* specifies which macOS SDK should be used to perform the build (default is no).
ru: Создайте универсальную бинарную сборку. *SDKDIR* указывает, какой пакет SDK macOS следует использовать для выполнения сборки (по умолчанию — нет).

source: Create a Python.framework rather than a traditional Unix install. Optional *INSTALLDIR* specifies the installation path (default is no).
ru: Создайте Python.framework вместо традиционной установки Unix. Необязательный *INSTALLDIR* указывает путь установки (по умолчанию — нет).

source: Specify the kind of universal binary that should be created. This option is only valid when :option:`--enable-universalsdk` is set.
ru: Укажите тип универсального двоичного файла, который следует создать. Этот параметр действителен только в том случае, если установлен :option:`--enable-universalsdk`.

source: Options:
ru: Параметры:

source: Specify the name for the python framework on macOS only valid when :option:`--enable-framework` is set (default: ``Python``).
ru: Укажите имя платформы Python в macOS, которое допустимо только в том случае, если установлен :option:`--enable-framework` (по умолчанию: ``Python``).

source: The Python standard library contains strings that are known to trigger automated inspection tool errors when submitted for distribution by the macOS and iOS App Stores. If enabled, this option will apply the list of patches that are known to correct app store compliance. A custom patch file can also be specified. This option is disabled by default.
ru: Стандартная библиотека Python содержит строки, которые, как известно, вызывают ошибки средства автоматической проверки при отправке для распространения в магазинах приложений macOS и iOS. Если этот параметр включен, этот параметр будет применять список исправлений, которые, как известно, исправляют соответствие требованиям магазина приложений. Также можно указать собственный файл патча. Эта опция отключена по умолчанию.

source: iOS Options
ru: Параметры iOS

source: See :source:`iOS/README.rst`.
ru: См. :source:`iOS/README.rst`.

source: Create a Python.framework. Unlike macOS, the *INSTALLDIR* argument specifying the installation path is mandatory.
ru: Создайте Python.framework. В отличие от macOS, аргумент *INSTALLDIR*, указывающий путь установки, является обязательным.

source: Specify the name for the framework (default: ``Python``).
ru: Укажите имя платформы (по умолчанию: ``Python``).

source: Cross Compiling Options
ru: Параметры кросс-компиляции

source: Cross compiling, also known as cross building, can be used to build Python for another CPU architecture or platform. Cross compiling requires a Python interpreter for the build platform. The version of the build Python must match the version of the cross compiled host Python.
ru: Кросс-компиляция, также известная как кросс-сборка, может использоваться для сборки Python для другой архитектуры или платформы ЦП. Для кросс-компиляции требуется интерпретатор Python для платформы сборки. Версия Python сборки должна совпадать с версией кросс-скомпилированного хоста Python.

source: configure for building on BUILD, usually guessed by :program:`config.guess`.
ru: configure для сборки на BUILD, обычно угадывается с помощью :program:`config.guess`.

source: cross-compile to build programs to run on HOST (target platform)
ru: кросс-компиляция для создания программ для запуска на HOST (целевая платформа)

source: path to build ``python`` binary for cross compiling
ru: путь для сборки двоичного файла ``python`` для кросс-компиляции

source: An environment variable that points to a file with configure overrides.
ru: Переменная среды, указывающая на файл с переопределениями конфигурации.

source: Example *config.site* file:
ru: Пример файла *config.site*:

source: Program to run CPython for the host platform for cross-compilation.
ru: Программа для запуска CPython на хост-платформе для кросс-компиляции.

source: Cross compiling example::
ru: Пример кросс-компиляции::

source: Python Build System
ru: Система сборки Python

source: Main files of the build system
ru: Основные файлы системы сборки

source: :file:`Makefile.pre.in` => :file:`Makefile` (created by :file:`configure`);
ru: :file:`Makefile.pre.in` => :file:`Makefile` (создан :file:`configure`);

source: :file:`Modules/Setup`: C extensions built by the Makefile using :file:`Module/makesetup` shell script;
ru: :file:`Modules/Setup`: расширения C, созданные Makefile с использованием сценария оболочки :file:`Module/makesetup`;

source: Main build steps
ru: Основные этапы сборки

source: C files (``.c``) are built as object files (``.o``).
ru: Файлы C (``.c``) создаются как объектные файлы (``.o``).
