Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/using/ios.po
Languages: ru

source: You need to ensure that any folders containing third-party binaries are either associated with the app target, or copied in as part of step 8. Step 8 should also purge any binaries that are not appropriate for the platform a specific build is targeting (i.e., delete any device binaries if you're building an app targeting the simulator).
ru: Вам необходимо убедиться, что все папки, содержащие сторонние двоичные файлы, либо связаны с целевым приложением, либо скопированы в рамках шага 8. Шаг 8 также должен удалить все двоичные файлы, которые не подходят для платформы, на которую нацелена конкретная сборка (т. е. , удалите все двоичные файлы устройств, если вы создаете приложение, предназначенное для симулятора).

source: Any folders that contain third-party binaries must be processed into framework form by step 9. The invocation of ``install_dylib`` that processes the ``lib-dynload`` folder can be copied and adapted for this purpose.
ru: Любые папки, содержащие сторонние двоичные файлы, должны быть преобразованы в форму платформы на шаге 9. Вызов install_dylib, который обрабатывает папку lib-dynload, можно скопировать и адаптировать для этой цели.

source: If you're using a separate folder for third-party packages, ensure that folder is included as part of the ``PYTHONPATH`` configuration in step 10.
ru: Если вы используете отдельную папку для сторонних пакетов, убедитесь, что эта папка включена в конфигурацию PYTHONPATH на шаге 10.

source: App Store Compliance
ru: Соответствие магазинам приложений

source: The only mechanism for distributing apps to third-party iOS devices is to submit the app to the iOS App Store; apps submitted for distribution must pass Apple's app review process. This process includes a set of automated validation rules that inspect the submitted application bundle for problematic code.
ru: Единственный механизм распространения приложений на сторонние устройства iOS — это размещение приложения в iOS App Store; приложения, представленные для распространения, должны пройти процедуру проверки приложений Apple. Этот процесс включает в себя набор автоматических правил проверки, которые проверяют отправленный пакет приложения на наличие проблемного кода.

source: The Python standard library contains some code that is known to violate these automated rules. While these violations appear to be false positives, Apple's review rules cannot be challenged; so, it is necessary to modify the Python standard library for an app to pass App Store review.
ru: Стандартная библиотека Python содержит некоторый код, который, как известно, нарушает эти автоматические правила. Хотя эти нарушения кажутся ложноположительными, правила проверки Apple не могут быть оспорены; поэтому необходимо изменить стандартную библиотеку Python, чтобы приложение прошло проверку в App Store.

source: The Python source tree contains :source:`a patch file <Mac/Resources/app-store-compliance.patch>` that will remove all code that is known to cause issues with the App Store review process. This patch is applied automatically when building for iOS.
ru: Дерево исходного кода Python содержит :source:`файл исправления <Mac/Resources/app-store-compliance.patch>`, который удалит весь код, который, как известно, вызывает проблемы в процессе проверки App Store. Этот патч применяется автоматически при сборке для iOS.
