Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/using/ios.po
Languages: ru

source: Using Python on iOS
ru: Использование Python на iOS

source: Authors
ru: Авторы

source: Russell Keith-Magee (2024-03)
ru: Рассел Кейт-Маги (2024–03)

source: Python on iOS is unlike Python on desktop platforms. On a desktop platform, Python is generally installed as a system resource that can be used by any user of that computer. Users then interact with Python by running a :program:`python` executable and entering commands at an interactive prompt, or by running a Python script.
ru: Python для iOS отличается от Python на настольных платформах. На настольной платформе Python обычно устанавливается как системный ресурс, который может использовать любой пользователь этого компьютера. Затем пользователи взаимодействуют с Python, запуская исполняемый файл :program:`python` и вводя команды в интерактивной подсказке или запуская скрипт Python.

source: On iOS, there is no concept of installing as a system resource. The only unit of software distribution is an "app". There is also no console where you could run a :program:`python` executable, or interact with a Python REPL.
ru: В iOS нет понятия установки как системного ресурса. Единственной единицей распространения программного обеспечения является «приложение». Также нет консоли, на которой вы могли бы запустить исполняемый файл :program:`python` или взаимодействовать с Python REPL.

source: As a result, the only way you can use Python on iOS is in embedded mode - that is, by writing a native iOS application, and embedding a Python interpreter using ``libPython``, and invoking Python code using the :ref:`Python embedding API <embedding>`. The full Python interpreter, the standard library, and all your Python code is then packaged as a standalone bundle that can be distributed via the iOS App Store.
ru: В результате единственный способ использовать Python в iOS — это встроенный режим, то есть написание собственного приложения для iOS, встраивание интерпретатора Python с помощью libPython и вызов кода Python с помощью :ref:` API встраивания Python <embedding>`. Полный интерпретатор Python, стандартная библиотека и весь ваш код Python затем упаковываются в отдельный пакет, который можно распространять через iOS App Store.

source: If you're looking to experiment for the first time with writing an iOS app in Python, projects such as `BeeWare <https://beeware.org>`__ and `Kivy <https://kivy.org>`__ will provide a much more approachable user experience. These projects manage the complexities associated with getting an iOS project running, so you only need to deal with the Python code itself.
ru: Если вы впервые хотите поэкспериментировать с написанием приложения iOS на Python, вам подойдут такие проекты, как `BeeWare <https://beeware.org>`__ и `Kivy <https://kivy.org>`__. обеспечить гораздо более доступный пользовательский опыт. Эти проекты решают сложности, связанные с запуском проекта iOS, поэтому вам нужно иметь дело только с самим кодом Python.

source: Python at runtime on iOS
ru: Python во время выполнения на iOS

source: iOS version compatibility
ru: Совместимость версий iOS

source: The minimum supported iOS version is specified at compile time, using the :option:`--host` option to ``configure``. By default, when compiled for iOS, Python will be compiled with a minimum supported iOS version of 13.0. To use a different minimum iOS version, provide the version number as part of the :option:`!--host` argument - for example, ``--host=arm64-apple-ios15.4-simulator`` would compile an ARM64 simulator build with a deployment target of 15.4.
ru: Минимальная поддерживаемая версия iOS указывается во время компиляции с использованием параметра :option:`--host` для ``configure``. По умолчанию при компиляции для iOS Python будет скомпилирован с минимальной поддерживаемой версией iOS 13.0. Чтобы использовать другую минимальную версию iOS, укажите номер версии как часть аргумента :option:`!--host` — например, ``--host=arm64-apple-ios15.4-simulator`` скомпилирует Сборка симулятора ARM64 с целевой версией 15.4.

source: Platform identification
ru: Идентификация платформы

source: When executing on iOS, ``sys.platform`` will report as ``ios``. This value will be returned on an iPhone or iPad, regardless of whether the app is running on the simulator or a physical device.
ru: При запуске на iOS ``sys.platform`` будет сообщаться как ``ios``. Это значение будет возвращено на iPhone или iPad независимо от того, работает ли приложение на симуляторе или на физическом устройстве.

source: Information about the specific runtime environment, including the iOS version, device model, and whether the device is a simulator, can be obtained using :func:`platform.ios_ver`. :func:`platform.system` will report ``iOS`` or ``iPadOS``, depending on the device.
ru: Информацию о конкретной среде выполнения, включая версию iOS, модель устройства и то, является ли устройство симулятором, можно получить с помощью :func:`platform.ios_ver`. :func:`platform.system` сообщит ``iOS`` или ``iPadOS``, в зависимости от устройства.

source: :func:`os.uname` reports kernel-level details; it will report a name of ``Darwin``.
ru: :func:`os.uname` сообщает подробности уровня ядра; он сообщит имя «Дарвин».

source: Standard library availability
ru: Наличие стандартной библиотеки

source: The Python standard library has some notable omissions and restrictions on iOS. See the :ref:`API availability guide for iOS <mobile-availability>` for details.
ru: Стандартная библиотека Python имеет некоторые заметные упущения и ограничения для iOS. Подробности см. в руководстве по доступности API для iOS <mobile-availability>.

source: Binary extension modules
ru: Бинарные модули расширения

source: One notable difference about iOS as a platform is that App Store distribution imposes hard requirements on the packaging of an application. One of these requirements governs how binary extension modules are distributed.
ru: Одним из заметных отличий iOS как платформы является то, что распространение в App Store предъявляет жесткие требования к упаковке приложения. Одно из этих требований определяет способ распространения двоичных модулей расширения.

source: The iOS App Store requires that *all* binary modules in an iOS app must be dynamic libraries, contained in a framework with appropriate metadata, stored in the ``Frameworks`` folder of the packaged app. There can be only a single binary per framework, and there can be no executable binary material outside the ``Frameworks`` folder.
ru: Магазин приложений iOS требует, чтобы *все* бинарные модули в приложении iOS были динамическими библиотеками, содержащимися в фреймворке с соответствующими метаданными, хранящимися в папке ``Frameworks`` упакованного приложения. Для каждого фреймворка может быть только один двоичный файл, и за пределами папки «Frameworks» не может быть исполняемого двоичного материала.

source: This conflicts with the usual Python approach for distributing binaries, which allows a binary extension module to be loaded from any location on ``sys.path``. To ensure compliance with App Store policies, an iOS project must post-process any Python packages, converting ``.so`` binary modules into individual standalone frameworks with appropriate metadata and signing. For details on how to perform this post-processing, see the guide for :ref:`adding Python to your project <adding-ios>`.
ru: Это противоречит обычному подходу Python к распространению двоичных файлов, который позволяет загружать двоичный модуль расширения из любого места в ``sys.path``. Чтобы обеспечить соответствие политикам App Store, проект iOS должен выполнить постобработку любых пакетов Python, преобразовав двоичные модули ``.so`` в отдельные автономные платформы с соответствующими метаданными и подписью. Подробную информацию о том, как выполнить эту постобработку, см. в руководстве по :ref:`добавлению Python в ваш проект <adding-ios>`.

source: To help Python discover binaries in their new location, the original ``.so`` file on ``sys.path`` is replaced with a ``.fwork`` file. This file is a text file containing the location of the framework binary, relative to the app bundle. To allow the framework to resolve back to the original location, the framework must contain a ``.origin`` file that contains the location of the ``.fwork`` file, relative to the app bundle.
ru: Чтобы помочь Python обнаружить двоичные файлы в новом расположении, исходный файл ``.so`` в ``sys.path`` заменяется файлом ``.fwork``. Этот файл представляет собой текстовый файл, содержащий расположение двоичного файла платформы относительно пакета приложения. Чтобы платформа могла вернуться в исходное местоположение, она должна содержать файл ``.origin``, содержащий местоположение файла ``.fwork`` относительно пакета приложения.

source: For example, consider the case of an import ``from foo.bar import _whiz``, where ``_whiz`` is implemented with the binary module ``sources/foo/bar/_whiz.abi3.so``, with ``sources`` being the location registered on ``sys.path``, relative to the application bundle. This module *must* be distributed as ``Frameworks/foo.bar._whiz.framework/foo.bar._whiz`` (creating the framework name from the full import path of the module), with an ``Info.plist`` file in the ``.framework`` directory identifying the binary as a framework. The ``foo.bar._whiz`` module would be represented in the original location with a ``sources/foo/bar/_whiz.abi3.fwork`` marker file, containing the path ``Frameworks/foo.bar._whiz/foo.bar._whiz``. The framework would also contain ``Frameworks/foo.bar._whiz.framework/foo.bar._whiz.origin``, containing the path to the ``.fwork`` file.
ru: Например, рассмотрим случай импорта ``из foo.bar import _whiz``, где ``_whiz`` реализуется с помощью двоичного модуля ``sources/foo/bar/_whiz.abi3.so``, с `` `sources`` — это местоположение, зарегистрированное в ``sys.path`` относительно пакета приложения. Этот модуль *должен* распространяться как ``Frameworks/foo.bar._whiz.framework/foo.bar._whiz`` (имя платформы создается из полного пути импорта модуля) с ``Info.plist` `файл в каталоге ``.framework``, идентифицирующий двоичный файл как фреймворк. Модуль ``foo.bar._whiz`` будет представлен в исходном месте с помощью файла маркера ``sources/foo/bar/_whiz.abi3.fwork``, содержащего путь ``Frameworks/foo.bar._whiz``. /foo.bar._whiz``. Фреймворк также будет содержать ``Frameworks/foo.bar._whiz.framework/foo.bar._whiz.origin``, содержащий путь к файлу ``.fwork``.

source: When running on iOS, the Python interpreter will install an :class:`~importlib.machinery.AppleFrameworkLoader` that is able to read and import ``.fwork`` files. Once imported, the ``__file__`` attribute of the binary module will report as the location of the ``.fwork`` file. However, the :class:`~importlib.machinery.ModuleSpec` for the loaded module will report the ``origin`` as the location of the binary in the framework folder.
ru: При работе на iOS интерпретатор Python установит :class:`~importlib.machinery.AppleFrameworkLoader`, который сможет читать и импортировать файлы ``.fwork``. После импорта атрибут ``__file__`` двоичного модуля будет указывать местоположение файла ``.fwork``. Однако :class:`~importlib.machinery.ModuleSpec` для загруженного модуля сообщит ``origin`` как местоположение двоичного файла в папке фреймворка.

source: Compiler stub binaries
ru: Двоичные файлы-заглушки компилятора

source: Xcode doesn't expose explicit compilers for iOS; instead, it uses an ``xcrun`` script that resolves to a full compiler path (e.g., ``xcrun --sdk iphoneos clang`` to get the ``clang`` for an iPhone device). However, using this script poses two problems:
ru: Xcode не предоставляет явных компиляторов для iOS; вместо этого он использует сценарий ``xcrun``, который преобразует полный путь компилятора (например, ``xcrun --sdk iphoneos clang`` для получения ``clang`` для устройства iPhone). Однако использование этого сценария создает две проблемы:

source: The output of ``xcrun`` includes paths that are machine specific, resulting in a sysconfig module that cannot be shared between users; and
ru: Вывод ``xcrun`` включает в себя пути, специфичные для машины, в результате чего модуль sysconfig не может быть разделен между пользователями; и

source: It results in ``CC``/``CPP``/``LD``/``AR`` definitions that include spaces. There is a lot of C ecosystem tooling that assumes that you can split a command line at the first space to get the path to the compiler executable; this isn't the case when using ``xcrun``.
ru: В результате получаются определения ``CC``/``CPP``/``LD``/``AR``, содержащие пробелы. Существует множество инструментов экосистемы C, которые предполагают, что вы можете разделить командную строку на первый пробел, чтобы получить путь к исполняемому файлу компилятора; это не тот случай, когда используется ``xcrun``.

source: To avoid these problems, Python provided stubs for these tools. These stubs are shell script wrappers around the underingly ``xcrun`` tools, distributed in a ``bin`` folder distributed alongside the compiled iOS framework. These scripts are relocatable, and will always resolve to the appropriate local system paths. By including these scripts in the bin folder that accompanies a framework, the contents of the ``sysconfig`` module becomes useful for end-users to compile their own modules. When compiling third-party Python modules for iOS, you should ensure these stub binaries are on your path.
ru: Чтобы избежать этих проблем, Python предоставил заглушки для этих инструментов. Эти заглушки представляют собой оболочки сценариев оболочки вокруг инструментов xcrun, распространяемых в папке bin, распространяемой вместе со скомпилированной платформой iOS. Эти сценарии можно перемещать, и они всегда будут соответствовать соответствующим локальным системным путям. Включив эти сценарии в папку bin, которая прилагается к фреймворку, содержимое модуля ``sysconfig`` становится полезным для конечных пользователей при компиляции своих собственных модулей. При компиляции сторонних модулей Python для iOS вам следует убедиться, что эти двоичные файлы-заглушки находятся на вашем пути.

source: Installing Python on iOS
ru: Установка Python на iOS

source: Tools for building iOS apps
ru: Инструменты для создания приложений iOS

source: Building for iOS requires the use of Apple's Xcode tooling. It is strongly recommended that you use the most recent stable release of Xcode. This will require the use of the most (or second-most) recently released macOS version, as Apple does not maintain Xcode for older macOS versions. The Xcode Command Line Tools are not sufficient for iOS development; you need a *full* Xcode install.
ru: Для сборки iOS требуется использование инструментов Apple Xcode. Настоятельно рекомендуется использовать самую последнюю стабильную версию Xcode. Для этого потребуется использовать самую последнюю (или вторую по популярности) недавно выпущенную версию macOS, поскольку Apple не поддерживает Xcode для более старых версий macOS. Инструментов командной строки Xcode недостаточно для разработки iOS; вам нужна *полная* установка Xcode.

source: If you want to run your code on the iOS simulator, you'll also need to install an iOS Simulator Platform. You should be prompted to select an iOS Simulator Platform when you first run Xcode. Alternatively, you can add an iOS Simulator Platform by selecting from the Platforms tab of the Xcode Settings panel.
ru: Если вы хотите запустить свой код на симуляторе iOS, вам также потребуется установить платформу симулятора iOS. При первом запуске Xcode вам будет предложено выбрать платформу симулятора iOS. Альтернативно вы можете добавить платформу симулятора iOS, выбрав ее на вкладке «Платформы» на панели «Настройки Xcode».

source: Adding Python to an iOS project
ru: Добавление Python в проект iOS

source: Python can be added to any iOS project, using either Swift or Objective C. The following examples will use Objective C; if you are using Swift, you may find a library like `PythonKit <https://github.com/pvieito/PythonKit>`__ to be helpful.
ru: Python можно добавить в любой проект iOS, используя Swift или Objective C. В следующих примерах будет использоваться Objective C; если вы используете Swift, вам может пригодиться такая библиотека, как `PythonKit <https://github.com/pvieito/PythonKit>`__.

source: To add Python to an iOS Xcode project:
ru: Чтобы добавить Python в проект iOS Xcode:

source: Build or obtain a Python ``XCFramework``. See the instructions in :source:`iOS/README.rst` (in the CPython source distribution) for details on how to build a Python ``XCFramework``. At a minimum, you will need a build that supports ``arm64-apple-ios``, plus one of either ``arm64-apple-ios-simulator`` or ``x86_64-apple-ios-simulator``.
ru: Создайте или получите Python XCFramework. См. инструкции в :source:`iOS/README.rst` (в дистрибутиве исходного кода CPython) для получения подробной информации о том, как собрать Python ``XCFramework``. Как минимум, вам понадобится сборка, поддерживающая «arm64-apple-ios», а также один из «arm64-apple-ios-simulator» или «x86_64-apple-ios-simulator».

source: Drag the ``XCframework`` into your iOS project. In the following instructions, we'll assume you've dropped the ``XCframework`` into the root of your project; however, you can use any other location that you want by adjusting paths as needed.
ru: Перетащите XCframework в свой проект iOS. В следующих инструкциях мы предполагаем, что вы поместили XCframework в корень вашего проекта; однако вы можете использовать любое другое местоположение, изменив пути по мере необходимости.

source: Drag the ``iOS/Resources/dylib-Info-template.plist`` file into your project, and ensure it is associated with the app target.
ru: Перетащите файл ``iOS/Resources/dylib-Info-template.plist`` в свой проект и убедитесь, что он связан с целевым приложением.

source: Add your application code as a folder in your Xcode project. In the following instructions, we'll assume that your user code is in a folder named ``app`` in the root of your project; you can use any other location by adjusting paths as needed. Ensure that this folder is associated with your app target.
ru: Добавьте код приложения в виде папки в свой проект Xcode. В следующих инструкциях мы предполагаем, что ваш пользовательский код находится в папке с именем ``app`` в корне вашего проекта; вы можете использовать любое другое местоположение, изменив пути по мере необходимости. Убедитесь, что эта папка связана с целью вашего приложения.

source: Select the app target by selecting the root node of your Xcode project, then the target name in the sidebar that appears.
ru: Выберите цель приложения, выбрав корневой узел вашего проекта Xcode, а затем имя цели на появившейся боковой панели.

source: In the "General" settings, under "Frameworks, Libraries and Embedded Content", add ``Python.xcframework``, with "Embed & Sign" selected.
ru: В настройках «Общие» в разделе «Фреймворки, библиотеки и встроенный контент» добавьте Python.xcframework с выбранным параметром «Встроить и подписать».

source: In the "Build Settings" tab, modify the following:
ru: На вкладке «Настройки сборки» измените следующее:

source: Build Options
ru: Варианты сборки

source: User Script Sandboxing: No
ru: Песочница пользовательских сценариев: Нет

source: Enable Testability: Yes
ru: Включить возможность тестирования: Да

source: Search Paths
ru: Пути поиска

source: Framework Search Paths: ``$(PROJECT_DIR)``
ru: Пути поиска платформы: ``$(PROJECT_DIR)``

source: Apple Clang - Warnings - All languages
ru: Apple Clang – Предупреждения – Все языки

source: Quoted Include In Framework Header: No
ru: Цитируемое включение в заголовок платформы: Нет

source: Add a build step that copies the Python standard library into your app. In the "Build Phases" tab, add a new "Run Script" build step *before* the "Embed Frameworks" step, but *after* the "Copy Bundle Resources" step. Name the step "Install Target Specific Python Standard Library", disable the "Based on dependency analysis" checkbox, and set the script content to:
ru: Добавьте шаг сборки, который копирует стандартную библиотеку Python в ваше приложение. На вкладке «Фазы сборки» добавьте новый шаг сборки «Запуск сценария» *перед* шагом «Внедрение платформ», но *после* шага «Копировать ресурсы пакета». Назовите шаг «Установить целевую стандартную библиотеку Python», снимите флажок «На основе анализа зависимостей» и установите для содержимого сценария следующее значение:

source: Note that the name of the simulator "slice" in the XCframework may be different, depending the CPU architectures your ``XCFramework`` supports.
ru: Обратите внимание, что имя «среза» симулятора в XCframework может быть другим, в зависимости от архитектуры ЦП, которую поддерживает ваш «XCFramework».

source: Add a second build step that processes the binary extension modules in the standard library into "Framework" format. Add a "Run Script" build step *directly after* the one you added in step 8, named "Prepare Python Binary Modules". It should also have "Based on dependency analysis" unchecked, with the following script content:
ru: Добавьте второй шаг сборки, который преобразует двоичные модули расширения стандартной библиотеки в формат «Framework». Добавьте шаг сборки «Выполнить сценарий» *сразу после* того, который вы добавили на шаге 8, под названием «Подготовка двоичных модулей Python». Также должен быть снят флажок «На основе анализа зависимостей» со следующим содержимым сценария:

source: Add Objective C code to initialize and use a Python interpreter in embedded mode. You should ensure that:
ru: Добавьте код Objective C для инициализации и использования интерпретатора Python во встроенном режиме. Вы должны убедиться, что:

source: :c:member:`UTF-8 mode <PyPreConfig.utf8_mode>` is *enabled*;
ru: :c:member:`Режим UTF-8 <PyPreConfig.utf8_mode>` *включен*;

source: :c:member:`Buffered stdio <PyConfig.buffered_stdio>` is *disabled*;
ru: :c:member:`Буферизованное stdio <PyConfig.buffered_stdio>` *отключено*;

source: :c:member:`Writing bytecode <PyConfig.write_bytecode>` is *disabled*;
ru: :c:member:`Запись байт-кода <PyConfig.write_bytecode>` *отключена*;

source: :c:member:`Signal handlers <PyConfig.install_signal_handlers>` are *enabled*;
ru: :c:member:`Обработчики сигналов <PyConfig.install_signal_handlers>` *включены*;

source: ``PYTHONHOME`` for the interpreter is configured to point at the ``python`` subfolder of your app's bundle; and
ru: ``PYTHONHOME`` для интерпретатора настроен так, чтобы указывать на подпапку ``python`` в комплекте вашего приложения; и

source: The ``PYTHONPATH`` for the interpreter includes:
ru: ``PYTHONPATH`` для интерпретатора включает в себя:

source: the ``python/lib/python3.X`` subfolder of your app's bundle,
ru: подпапка ``python/lib/python3.X`` в комплекте вашего приложения,

source: the ``python/lib/python3.X/lib-dynload`` subfolder of your app's bundle, and
ru: подпапка ``python/lib/python3.X/lib-dynload`` в комплекте вашего приложения и

source: the ``app`` subfolder of your app's bundle
ru: подпапка ``app`` в пакете вашего приложения

source: Your app's bundle location can be determined using ``[[NSBundle mainBundle] resourcePath]``.
ru: Местоположение пакета вашего приложения можно определить с помощью ``[[NSBundle mainBundle] resourcesPath]``.

source: Steps 8, 9 and 10 of these instructions assume that you have a single folder of pure Python application code, named ``app``. If you have third-party binary modules in your app, some additional steps will be required:
ru: Шаги 8, 9 и 10 этих инструкций предполагают, что у вас есть одна папка с чистым кодом приложения Python с именем «app». Если в вашем приложении есть сторонние бинарные модули, потребуются некоторые дополнительные действия:
