Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/using/mac.po
Languages: ru

source: Using Python on macOS
ru: Использование Python в macOS

source: This document aims to give an overview of macOS-specific behavior you should know about to get started with Python on Mac computers. Python on a Mac running macOS is very similar to Python on other Unix-derived platforms, but there are some differences in installation and some features.
ru: Целью этого документа является предоставление обзора поведения, специфичного для macOS, о котором вам следует знать, чтобы начать работу с Python на компьютерах Mac. Python на Mac под управлением macOS очень похож на Python на других платформах, основанных на Unix, но есть некоторые различия в установке и некоторых функциях.

source: There are various ways to obtain and install Python for macOS. Pre-built versions of the most recent versions of Python are available from a number of distributors. Much of this document describes use of the Pythons provided by the CPython release team for download from the `python.org website <https://www.python.org/downloads/>`_. See :ref:`alternative_bundles` for some other options.
ru: Существуют различные способы получения и установки Python для macOS. Предварительно собранные версии самых последних версий Python доступны у ряда дистрибьюторов. Большая часть этого документа описывает использование Python, предоставленного командой выпуска CPython для загрузки с веб-сайта `python.org <https://www.python.org/downloads/>`_. См. :ref:`alternative_bundles` для ознакомления с некоторыми другими вариантами.

source: Using Python for macOS from ``python.org``
ru: Использование Python для macOS с сайта ``python.org``

source: Installation steps
ru: Этапы установки

source: For `current Python versions <https://www.python.org/downloads/>`_ (other than those in ``security`` status), the release team produces a **Python for macOS** installer package for each new release. A list of available installers is available `here <https://www.python.org/downloads/macos/>`_. We recommend using the most recent supported Python version where possible. Current installers provide a `universal2 binary <https://en.wikipedia.org/wiki/Universal_binary>`_ build of Python which runs natively on all Macs (Apple Silicon and Intel) that are supported by a wide range of macOS versions, currently typically from at least **macOS 10.13 High Sierra** on.
ru: Для `текущих версий Python <https://www.python.org/downloads/>`_ (кроме тех, которые находятся в статусе ``security``), группа выпуска создает установочный пакет **Python для macOS** для каждой новый выпуск. Список доступных установщиков доступен здесь <https://www.python.org/downloads/macos/>_. Мы рекомендуем использовать самую последнюю поддерживаемую версию Python, где это возможно. Текущие установщики предоставляют бинарную сборку Universal2 <https://en.wikipedia.org/wiki/Universal_binary>`_, которая изначально работает на всех компьютерах Mac (Apple Silicon и Intel), которые поддерживаются широким спектром версий macOS. в настоящее время обычно начиная с **macOS 10.13 High Sierra**.

source: The downloaded file is a standard macOS installer package file (``.pkg``). File integrity information (checksum, size, sigstore signature, etc) for each file is included on the release download page. Installer packages and their contents are signed and notarized with ``Python Software Foundation`` Apple Developer ID certificates to meet `macOS Gatekeeper requirements <https://support.apple.com/en-us/102445>`_.
ru: Загруженный файл представляет собой стандартный пакет установщика macOS (``.pkg``). Информация о целостности файла (контрольная сумма, размер, подпись sigstore и т. д.) для каждого файла включена на страницу загрузки выпуска. Установочные пакеты и их содержимое подписываются и нотариально заверяются сертификатами Apple Developer ID ``Python Software Foundation`` для соответствия ``требованиям macOS Gatekeeper <https://support.apple.com/en-us/102445>`_.

source: For a default installation, double-click on the downloaded installer package file. This should launch the standard macOS Installer app and display the first of several installer windows steps.
ru: Для установки по умолчанию дважды щелкните загруженный файл пакета установщика. Это должно запустить стандартное приложение установщика macOS и отобразить первый из нескольких шагов окна установщика.

source: Clicking on the **Continue** button brings up the **Read Me** for this installer. Besides other important information, the **Read Me** documents which Python version is going to be installed and on what versions of macOS it is supported. You may need to scroll through to read the whole file. By default, this **Read Me** will also be installed in |usemac_applications_folder_version| and available to read anytime.
ru: При нажатии кнопки **Продолжить** откроется окно **Прочитать** для этого установщика. Помимо другой важной информации, в **Read Me** указано, какая версия Python будет установлена ​​и в каких версиях macOS она поддерживается. Возможно, вам придется пролистать, чтобы прочитать весь файл. По умолчанию это **Read Me** также будет установлено в |usemac_applications_folder_version| и доступны для чтения в любое время.

source: Clicking on **Continue** proceeds to display the license for Python and for other included software. You will then need to **Agree** to the license terms before proceeding to the next step. This license file will also be installed and available to be read later.
ru: Нажав **Продолжить**, вы увидите лицензию на Python и другое включенное в комплект программное обеспечение. Затем вам нужно будет **Согласиться** с условиями лицензии, прежде чем перейти к следующему шагу. Этот файл лицензии также будет установлен и доступен для чтения позже.

source: After the license terms are accepted, the next step is the **Installation Type** display. For most uses, the standard set of installation operations is appropriate.
ru: После принятия условий лицензии следующим шагом будет отображение **Тип установки**. Для большинства случаев использования подходит стандартный набор операций установки.

source: By pressing the **Customize** button, you can choose to omit or select certain package components of the installer. Click on each package name to see a description of what it installs. To also install support for the optional experimental free-threaded feature, see :ref:`install-freethreaded-macos`.
ru: Нажав кнопку **Настроить**, вы можете пропустить или выбрать определенные компоненты пакета установщика. Нажмите на имя каждого пакета, чтобы просмотреть описание того, что он устанавливает. Чтобы также установить поддержку дополнительной экспериментальной функции free-threaded, см. :ref:`install-freethreaded-macos`.

source: In either case, clicking **Install** will begin the install process by asking permission to install new software. A macOS user name with ``Administrator`` privilege is needed as the installed Python will be available to all users of the Mac.
ru: В любом случае нажатие **Установить** приведет к началу процесса установки с запроса разрешения на установку нового программного обеспечения. Требуется имя пользователя macOS с привилегиями администратора, поскольку установленный Python будет доступен всем пользователям Mac.

source: When the installation is complete, the **Summary** window will appear.
ru: По завершении установки появится окно **Сводка**.

source: Double-click on the :command:`Install Certificates.command` icon or file in the |usemac_applications_folder_version| window to complete the installation.
ru: Дважды щелкните значок :command:`Install Certificates.command` или файл в |usemac_applications_folder_version| окно для завершения установки.

source: This will open a temporary :program:`Terminal` shell window that will use the new Python to download and install SSL root certificates for its use.
ru: Откроется временное окно оболочки :program:`Terminal`, которое будет использовать новый Python для загрузки и установки корневых сертификатов SSL для его использования.

source: If ``Successfully installed certifi`` and ``update complete`` appears in the terminal window, the installation is complete. Close this terminal window and the installer window.
ru: Если в окне терминала появятся сообщения «Успешно установлен сертификат» и «Обновление завершено», установка завершена. Закройте это окно терминала и окно установщика.

source: A default install will include:
ru: Установка по умолчанию будет включать в себя:

source: A |usemac_applications_folder_name| folder in your :file:`Applications` folder. In here you find :program:`IDLE`, the development environment that is a standard part of official Python distributions; and :program:`Python Launcher`, which handles double-clicking Python scripts from the macOS `Finder <https://support.apple.com/en-us/HT201732>`_.
ru: А |usemac_applications_folder_name| в папке :file:`Applications`. Здесь вы найдете :program:`IDLE`, среду разработки, которая является стандартной частью официальных дистрибутивов Python; и :program:`Python Launcher`, который обрабатывает сценарии Python при двойном щелчке из `_ Finder <https://support.apple.com/en-us/HT201732>`_ macOS.

source: A framework :file:`/Library/Frameworks/Python.framework`, which includes the Python executable and libraries. The installer adds this location to your shell path. To uninstall Python, you can remove these three things. Symlinks to the Python executable are placed in :file:`/usr/local/bin/`.
ru: Фреймворк :file:`/Library/Frameworks/Python.framework`, который включает исполняемый файл Python и библиотеки. Установщик добавляет это местоположение в путь к вашей оболочке. Чтобы удалить Python, вы можете удалить эти три вещи. Символические ссылки на исполняемый файл Python размещаются в :file:`/usr/local/bin/`.

source: Recent versions of macOS include a :command:`python3` command in :file:`/usr/bin/python3` that links to a usually older and incomplete version of Python provided by and for use by the Apple development tools, :program:`Xcode` or the :program:`Command Line Tools for Xcode`. You should never modify or attempt to delete this installation, as it is Apple-controlled and is used by Apple-provided or third-party software. If you choose to install a newer Python version from ``python.org``, you will have two different but functional Python installations on your computer that can co-exist. The default installer options should ensure that its :command:`python3` will be used instead of the system :command:`python3`.
ru: Последние версии macOS включают команду :command:`python3` в :file:`/usr/bin/python3`, которая ссылается на обычно более старую и неполную версию Python, предоставляемую и предназначенную для использования инструментами разработки Apple, :program: `Xcode` или :program:`Инструменты командной строки для Xcode`. Никогда не следует изменять или пытаться удалить эту установку, поскольку она контролируется Apple и используется программным обеспечением, предоставленным Apple или сторонним программным обеспечением. Если вы решите установить более новую версию Python с сайта ``python.org``, у вас на компьютере будут две разные, но функциональные установки Python, которые могут сосуществовать. Параметры установщика по умолчанию должны гарантировать, что вместо системного :command:`python3` будет использоваться его :command:`python3`.

source: How to run a Python script
ru: Как запустить скрипт Python

source: There are two ways to invoke the Python interpreter. If you are familiar with using a Unix shell in a terminal window, you can invoke |usemac_python_x_dot_y_literal| or ``python3`` optionally followed by one or more command line options (described in :ref:`using-on-general`). The Python tutorial also has a useful section on :ref:`using Python interactively from a shell <tut-interac>`.
ru: Существует два способа вызвать интерпретатор Python. Если вы знакомы с использованием оболочки Unix в окне терминала, вы можете вызвать |usemac_python_x_dot_y_literal| или ``python3``, за которым (необязательно) следует один или несколько параметров командной строки (описано в :ref:`using-on-general`). В руководстве по Python также есть полезный раздел об интерактивном использовании Python из оболочки <tut-interac>`.

source: You can also invoke the interpreter through an integrated development environment. :ref:`idle` is a basic editor and interpreter environment which is included with the standard distribution of Python. :program:`IDLE` includes a Help menu that allows you to access Python documentation. If you are completely new to Python, you can read the tutorial introduction in that document.
ru: Вы также можете вызвать интерпретатор через интегрированную среду разработки. :ref:`idle` — это базовая среда редактора и интерпретатора, включенная в стандартный дистрибутив Python. :program:`IDLE` включает меню «Справка», которое позволяет получить доступ к документации Python. Если вы новичок в Python, вы можете прочитать введение в этот документ.

source: There are many other editors and IDEs available, see :ref:`editors` for more information.
ru: Существует множество других редакторов и IDE, дополнительную информацию см. в разделе :ref:`editors`.

source: To run a Python script file from the terminal window, you can invoke the interpreter with the name of the script file:
ru: Чтобы запустить файл сценария Python из окна терминала, вы можете вызвать интерпретатор с именем файла сценария:

source: To run your script from the Finder, you can either:
ru: Чтобы запустить скрипт из Finder, вы можете:

source: Drag it to :program:`Python Launcher`.
ru: Перетащите его в :program:`Python Launcher`.

source: Select :program:`Python Launcher` as the default application to open your script (or any ``.py`` script) through the Finder Info window and double-click it. :program:`Python Launcher` has various preferences to control how your script is launched. Option-dragging allows you to change these for one invocation, or use its ``Preferences`` menu to change things globally.
ru: Выберите :program:`Python Launcher` в качестве приложения по умолчанию, чтобы открыть ваш скрипт (или любой ``.py`` скрипт) через окно Finder Info, и дважды щелкните его. :program:`Python Launcher` имеет различные настройки для управления запуском вашего скрипта. Перетаскивание опций позволяет вам изменить их за один вызов или использовать меню «Настройки» для глобального изменения.

source: Be aware that running the script directly from the macOS Finder might produce different results than when running from a terminal window as the script will not be run in the usual shell environment including any setting of environment variables in shell profiles. And, as with any other script or program, be certain of what you are about to run.
ru: Имейте в виду, что запуск сценария непосредственно из macOS Finder может привести к результатам, отличным от результатов при запуске из окна терминала, поскольку сценарий не будет запускаться в обычной среде оболочки, включая любые настройки переменных среды в профилях оболочки. И, как и в случае с любым другим скриптом или программой, будьте уверены в том, что вы собираетесь запустить.

source: Alternative Distributions
ru: Альтернативные дистрибутивы

source: Besides the standard ``python.org`` for macOS installer, there are third-party distributions for macOS that may include additional functionality. Some popular distributions and their key features:
ru: Помимо стандартного установщика ``python.org`` для macOS, существуют сторонние дистрибутивы для macOS, которые могут включать дополнительные функции. Некоторые популярные дистрибутивы и их ключевые особенности:

source: Installer with multi-platform compatibility, documentation
ru: Установщик с мультиплатформенной совместимостью, документация.

source: Popular scientific modules (such as numpy, scipy, and pandas) and the ``conda`` package manager.
ru: Научно-популярные модули (такие как numpy, scipy и pandas) и менеджер пакетов conda.

source: `Homebrew <https://brew.sh>`_
ru: `Домашнее пиво <https://brew.sh>`_

source: Package manager for macOS including multiple versions of Python and many third-party Python-based packages (including numpy, scipy, and pandas).
ru: Менеджер пакетов для macOS, включая несколько версий Python и множество сторонних пакетов на основе Python (включая numpy, scipy и pandas).

source: Another package manager for macOS including multiple versions of Python and many third-party Python-based packages. May include pre-built versions of Python and many packages for older versions of macOS.
ru: Еще один менеджер пакетов для macOS, включающий несколько версий Python и множество сторонних пакетов на основе Python. Может включать готовые версии Python и множество пакетов для более старых версий macOS.

source: Note that distributions might not include the latest versions of Python or other libraries, and are not maintained or supported by the core Python team.
ru: Обратите внимание, что дистрибутивы могут не включать последние версии Python или других библиотек и не обслуживаются и не поддерживаются основной командой Python.

source: Installing Additional Python Packages
ru: Установка дополнительных пакетов Python

source: Refer to the `Python Packaging User Guide`_ for more information.
ru: Для получения дополнительной информации обратитесь к `Руководству пользователя по упаковке Python`_.

source: GUI Programming
ru: Программирование с графическим интерфейсом

source: There are several options for building GUI applications on the Mac with Python.
ru: Существует несколько вариантов создания приложений с графическим интерфейсом на Mac с помощью Python.

source: The standard Python GUI toolkit is :mod:`tkinter`, based on the cross-platform Tk toolkit (https://www.tcl.tk). A macOS-native version of Tk is included with the installer.
ru: Стандартный набор инструментов Python GUI — :mod:`tkinter`, основанный на кроссплатформенном наборе инструментов Tk (https://www.tcl.tk). В установщик включена собственная версия Tk для macOS.

source: *PyObjC* is a Python binding to Apple's Objective-C/Cocoa framework. Information on PyObjC is available from :pypi:`pyobjc`.
ru: *PyObjC* — это привязка Python к платформе Apple Objective-C/Cocoa. Информацию о PyObjC можно получить на сайте :pypi:`pyobjc`.

source: A number of alternative macOS GUI toolkits are available including:
ru: Доступен ряд альтернативных наборов инструментов графического интерфейса macOS, в том числе:

source: `PySide <https://www.qt.io/qt-for-python>`_: Official Python bindings to the `Qt GUI toolkit <https://wiki.qt.io/Qt_for_Python>`_.
ru: `PySide <https://www.qt.io/qt-for-python>`_: официальные привязки Python к `набору инструментов Qt GUI <https://wiki.qt.io/Qt_for_Python>`_.

source: `PyQt <https://riverbankcomputing.com/software/pyqt/>`_: Alternative Python bindings to Qt.
ru: `PyQt <https://riverbankcomputing.com/software/pyqt/>`_: альтернативные привязки Python к Qt.

source: `Kivy <https://kivy.org>`_: A cross-platform GUI toolkit that supports desktop and mobile platforms.
ru: `Kivy <https://kivy.org>`_: кроссплатформенный набор инструментов с графическим интерфейсом, поддерживающий настольные и мобильные платформы.

source: `Toga <https://toga.readthedocs.io>`_: Part of the `BeeWare Project <https://beeware.org>`_; supports desktop, mobile, web and console apps.
ru: `Toga <https://toga.readthedocs.io>`_: часть `BeeWare Project <https://beeware.org>`_; поддерживает настольные, мобильные, веб-приложения и консольные приложения.

source: `wxPython <https://wxpython.org>`_: A cross-platform toolkit that supports desktop operating systems.
ru: `wxPython <https://wxpython.org>`_: кроссплатформенный набор инструментов, поддерживающий настольные операционные системы.

source: Advanced Topics
ru: Продвинутые темы

source: Installing Free-threaded Binaries
ru: Установка двоичных файлов с свободной резьбой

source: (Experimental)
ru: (Экспериментальный)

source: Everything described in this section is considered experimental, and should be expected to change in future releases.
ru: Все, что описано в этом разделе, считается экспериментальным и должно быть изменено в будущих выпусках.

source: The ``python.org`` :ref:`Python for macOS <getting-and-installing-macpython>` installer package can optionally install an additional build of Python |usemac_x_dot_y| that supports :pep:`703`, the experimental free-threading feature (running with the :term:`global interpreter lock` disabled). Check the release page on ``python.org`` for possible updated information.
ru: Установочный пакет ``python.org`` :ref:`Python для macOS <getting-and-installing-macpython>` может дополнительно установить дополнительную сборку Python. |usemac_x_dot_y| который поддерживает :pep:`703`, экспериментальную функцию свободной многопоточности (работающую с отключенной :term:`глобальной блокировкой интерпретатора`). Проверьте страницу выпуска на ``python.org`` для возможной обновленной информации.

source: Because this feature is still considered experimental, the support for it is not installed by default. It is packaged as a separate install option, available by clicking the **Customize** button on the **Installation Type** step of the installer as described above.
ru: Поскольку эта функция все еще считается экспериментальной, ее поддержка не установлена ​​по умолчанию. Он поставляется в виде отдельного варианта установки, доступного после нажатия кнопки **Настроить** на этапе **Тип установки** установщика, как описано выше.

source: If the box next to the **Free-threaded Python** package name is checked, a separate :file:`PythonT.framework` will also be installed alongside the normal :file:`Python.framework` in :file:`/Library/Frameworks`. This configuration allows a free-threaded Python |usemac_x_dot_y| build to co-exist on your system with a traditional (GIL only) Python |usemac_x_dot_y| build with minimal risk while installing or testing. This installation layout is itself experimental and is subject to change in future releases.
ru: Если флажок рядом с именем пакета **Free-threaded Python** установлен, отдельный :file:`PythonT.framework` также будет установлен вместе с обычным :file:`Python.framework` в :file:`/ Библиотека/Фреймворки`. Эта конфигурация позволяет использовать Python со свободным потоком. |usemac_x_dot_y| построить для сосуществования в вашей системе с традиционным (только GIL) Python |usemac_x_dot_y| создавайте с минимальным риском при установке или тестировании. Эта схема установки сама по себе является экспериментальной и может быть изменена в будущих выпусках.

source: Known cautions and limitations:
ru: Известные предостережения и ограничения:

source: The **UNIX command-line tools** package, which is selected by default, will install links in :file:`/usr/local/bin` for |usemac_python_x_dot_y_t_literal|, the free-threaded interpreter, and |usemac_python_x_dot_y_t_literal_config|, a configuration utility which may be useful for package builders. Since :file:`/usr/local/bin` is typically included in your shell ``PATH``, in most cases no changes to your ``PATH`` environment variables should be needed to use |usemac_python_x_dot_y_t_literal|.
ru: Пакет **Инструменты командной строки UNIX**, выбранный по умолчанию, установит ссылки в :file:`/usr/local/bin` для |usemac_python_x_dot_y_t_literal| , свободнопоточный интерпретатор и |usemac_python_x_dot_y_t_literal_config| , утилита настройки, которая может быть полезна для сборщиков пакетов. Поскольку :file:`/usr/local/bin` обычно включается в ``PATH`` вашей оболочки, в большинстве случаев для использования не требуется никаких изменений в переменных среды ``PATH``. |usemac_python_x_dot_y_t_literal| .
