Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/using/mac.po
Languages: ru

source: For this release, the **Shell profile updater** package and the :file:`Update Shell Profile.command` in |usemac_applications_folder_version| do not support the free-threaded package.
ru: В этом выпуске пакет **Профиля обновления оболочки** и :file:`Update Shell Profile.command` в |usemac_applications_folder_version| не поддерживают пакет со свободной резьбой.

source: The free-threaded build and the traditional build have separate search paths and separate :file:`site-packages` directories so, by default, if you need a package available in both builds, it may need to be installed in both. The free-threaded package will install a separate instance of :program:`pip` for use with |usemac_python_x_dot_y_t_literal|.
ru: Сборка со свободным потоком и традиционная сборка имеют отдельные пути поиска и отдельные каталоги :file:`site-packages`, поэтому по умолчанию, если вам нужен пакет, доступный в обеих сборках, возможно, его потребуется установить в обеих. Пакет со свободным потоком установит отдельный экземпляр :program:`pip` для использования с |usemac_python_x_dot_y_t_literal| .

source: To install a package using :command:`pip` without a :command:`venv`:
ru: Чтобы установить пакет с помощью :command:`pip` без :command:`venv`:

source: When working with multiple Python environments, it is usually safest and easiest to :ref:`create and use virtual environments <tut-venv>`. This can avoid possible command name conflicts and confusion about which Python is in use:
ru: При работе с несколькими средами Python обычно безопаснее и проще :ref:`создавать и использовать виртуальные среды <tut-venv>`. Это поможет избежать возможных конфликтов имен команд и путаницы в отношении того, какой Python используется:

source: then :command:`activate`.
ru: затем :command:`activate`.

source: To run a free-threaded version of IDLE:
ru: Чтобы запустить версию IDLE со свободным потоком:

source: The interpreters in both builds respond to the same :ref:`PYTHON environment variables <using-on-envvars>` which may have unexpected results, for example, if you have ``PYTHONPATH`` set in a shell profile. If necessary, there are :ref:`command line options <using-on-interface-options>` like ``-E`` to ignore these environment variables.
ru: Интерпретаторы в обеих сборках реагируют на одни и те же переменные среды PYTHON <using-on-envvars>`, что может привести к неожиданным результатам, например, если в профиле оболочки установлен ``PYTHONPATH``. При необходимости есть :ref:`опции командной строки <using-on-interface-options>`, такие как ``-E``, чтобы игнорировать эти переменные среды.

source: The free-threaded build links to the third-party shared libraries, such as ``OpenSSL`` and ``Tk``, installed in the traditional framework. This means that both builds also share one set of trust certificates as installed by the :command:`Install Certificates.command` script, thus it only needs to be run once.
ru: Беспоточная сборка связана со сторонними общими библиотеками, такими как OpenSSL и Tk, установленными в традиционной среде. Это означает, что обе сборки также используют один набор доверенных сертификатов, установленный сценарием :command:`Install Certificates.command`, поэтому его нужно запустить только один раз.

source: If you cannot depend on the link in ``/usr/local/bin`` pointing to the ``python.org`` free-threaded |usemac_python_x_dot_y_t_literal| (for example, if you want to install your own version there or some other distribution does), you can explicitly set your shell ``PATH`` environment variable to include the ``PythonT`` framework ``bin`` directory:
ru: Если вы не можете зависеть от ссылки в ``/usr/local/bin``, указывающей на ``python.org``, |usemac_python_x_dot_y_t_literal| (например, если вы хотите установить туда свою собственную версию или какой-либо другой дистрибутив), вы можете явно установить переменную среды оболочки ``PATH``, включив в нее каталог ``bin`` фреймворка ``PythonT``:

source: The traditional framework installation by default does something similar, except for :file:`Python.framework`. Be aware that having both framework ``bin`` directories in ``PATH`` can lead to confusion if there are duplicate names like ``python3.13`` in both; which one is actually used depends on the order they appear in ``PATH``. The ``which python3.x`` or ``which python3.xt`` commands can show which path is being used. Using virtual environments can help avoid such ambiguities. Another option might be to create a shell :command:`alias` to the desired interpreter, like:
ru: Традиционная установка фреймворка по умолчанию делает нечто подобное, за исключением :file:`Python.framework`. Имейте в виду, что наличие обоих каталогов ``bin`` платформы в ``PATH`` может привести к путанице, если в обоих есть повторяющиеся имена, такие как ``python3.13``; какой из них фактически используется, зависит от порядка их появления в PATH. Команды «который python3.x» или «который Python3.xt» могут показать, какой путь используется. Использование виртуальных сред может помочь избежать подобных двусмысленностей. Другим вариантом может быть создание оболочки :command:`alias` для желаемого интерпретатора, например:

source: Installing using the command line
ru: Установка с помощью командной строки

source: If you want to use automation to install the ``python.org`` installer package (rather than by using the familiar macOS :program:`Installer` GUI app), the macOS command line :command:`installer` utility lets you select non-default options, too. If you are not familiar with :command:`installer`, it can be somewhat cryptic (see :command:`man installer` for more information). As an example, the following shell snippet shows one way to do it, using the ``3.13.0b2`` release and selecting the free-threaded interpreter option:
ru: Если вы хотите использовать автоматизацию для установки установочного пакета ``python.org`` (вместо использования знакомого приложения :program:`Installer` для macOS), утилита командной строки macOS :command:`installer` позволяет вам выбрать нестандартные варианты тоже. Если вы не знакомы с :command:`installer`, он может быть несколько загадочным (см. :command:`man installer` для получения дополнительной информации). В качестве примера следующий фрагмент оболочки показывает один из способов сделать это, используя версию ``3.13.0b2`` и выбрав опцию интерпретатора со свободным потоком:

source: You can then test that both installer builds are now available with something like:
ru: Затем вы можете проверить, что обе сборки установщика теперь доступны, например:

source: Current ``python.org`` installers only install to fixed locations like :file:`/Library/Frameworks/`, :file:`/Applications`, and :file:`/usr/local/bin`. You cannot use the :command:`installer` ``-domain`` option to install to other locations.
ru: Текущие установщики ``python.org`` устанавливаются только в фиксированные места, такие как :file:`/Library/Frameworks/`, :file:`/Applications` и :file:`/usr/local/bin`. Вы не можете использовать опцию :command:`installer` ``-domain`` для установки в другие места.

source: Distributing Python Applications
ru: Распространение приложений Python

source: A range of tools exist for converting your Python code into a standalone distributable application:
ru: Существует ряд инструментов для преобразования вашего кода Python в автономное распространяемое приложение:

source: :pypi:`py2app`: Supports creating macOS ``.app`` bundles from a Python project.
ru: :pypi:`py2app`: поддерживает создание пакетов macOS ``.app`` из проекта Python.

source: `Briefcase <https://briefcase.readthedocs.io>`_: Part of the `BeeWare Project <https://beeware.org>`_; a cross-platform packaging tool that supports creation of ``.app`` bundles on macOS, as well as managing signing and notarization.
ru: `Портфель <https://briefcase.readthedocs.io>`_: часть `BeeWare Project <https://beeware.org>`_; кросс-платформенный инструмент упаковки, который поддерживает создание пакетов .app в macOS, а также управление подписанием и нотариальным заверением.

source: `PyInstaller <https://pyinstaller.org/>`_: A cross-platform packaging tool that creates a single file or folder as a distributable artifact.
ru: `PyInstaller <https://pyinstaller.org/>`_: кросс-платформенный инструмент упаковки, который создает один файл или папку в качестве распространяемого артефакта.

source: App Store Compliance
ru: Соответствие магазинам приложений

source: Apps submitted for distribution through the macOS App Store must pass Apple's app review process. This process includes a set of automated validation rules that inspect the submitted application bundle for problematic code.
ru: Приложения, отправленные для распространения через MacOS App Store, должны пройти процедуру проверки приложений Apple. Этот процесс включает в себя набор автоматических правил проверки, которые проверяют отправленный пакет приложения на наличие проблемного кода.

source: The Python standard library contains some code that is known to violate these automated rules. While these violations appear to be false positives, Apple's review rules cannot be challenged. Therefore, it is necessary to modify the Python standard library for an app to pass App Store review.
ru: Стандартная библиотека Python содержит некоторый код, который, как известно, нарушает эти автоматические правила. Хотя эти нарушения кажутся ложноположительными, правила проверки Apple не могут быть оспорены. Поэтому необходимо изменить стандартную библиотеку Python, чтобы приложение прошло проверку в App Store.

source: The Python source tree contains :source:`a patch file <Mac/Resources/app-store-compliance.patch>` that will remove all code that is known to cause issues with the App Store review process. This patch is applied automatically when CPython is configured with the :option:`--with-app-store-compliance` option.
ru: Дерево исходного кода Python содержит :source:`файл исправления <Mac/Resources/app-store-compliance.patch>`, который удалит весь код, который, как известно, вызывает проблемы в процессе проверки App Store. Этот патч применяется автоматически, когда CPython настроен с опцией :option:`--with-app-store-compliance`.

source: This patch is not normally required to use CPython on a Mac; nor is it required if you are distributing an app *outside* the macOS App Store. It is *only* required if you are using the macOS App Store as a distribution channel.
ru: Этот патч обычно не требуется для использования CPython на Mac; это также не требуется, если вы распространяете приложение *за пределами* MacOS App Store. Это *только* требуется, если вы используете MacOS App Store в качестве канала распространения.

source: Other Resources
ru: Другие ресурсы

source: The `python.org Help page <https://www.python.org/about/help/>`_ has links to many useful resources. The `Pythonmac-SIG mailing list <https://www.python.org/community/sigs/current/pythonmac-sig/>`_ is another support resource specifically for Python users and developers on the Mac.
ru: Страница справки `python.org <https://www.python.org/about/help/>`_ содержит ссылки на множество полезных ресурсов. `Список рассылки Pythonmac-SIG <https://www.python.org/community/sigs/current/pythonmac-sig/>`_ — это еще один ресурс поддержки, предназначенный специально для пользователей и разработчиков Python на Mac.
