Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/using/windows.po
Languages: ru

source: The "-64" suffix is deprecated, and now implies "any architecture that is not provably i386/32-bit". To request a specific environment, use the new :samp:`-V:{TAG}` argument with the complete tag.
ru: Суффикс «-64» устарел и теперь подразумевает «любую архитектуру, которая не является i386/32-битной». Чтобы запросить конкретную среду, используйте новый аргумент :samp:`-V:{TAG}` с полным тегом.

source: Virtual commands referencing ``python`` now prefer an active virtual environment rather than searching :envvar:`PATH`. This handles cases where the shebang specifies ``/usr/bin/env python3`` but :file:`python3.exe` is not present in the active environment.
ru: Виртуальные команды, ссылающиеся на ``python``, теперь предпочитают активную виртуальную среду, а не поиск по :envvar:`PATH`. Это обрабатывает случаи, когда shebang указывает ``/usr/bin/env python3``, но :file:`python3.exe` отсутствует в активной среде.

source: The ``/usr/bin/env`` form of shebang line has one further special property. Before looking for installed Python interpreters, this form will search the executable :envvar:`PATH` for a Python executable matching the name provided as the first argument. This corresponds to the behaviour of the Unix ``env`` program, which performs a :envvar:`PATH` search. If an executable matching the first argument after the ``env`` command cannot be found, but the argument starts with ``python``, it will be handled as described for the other virtual commands. The environment variable :envvar:`PYLAUNCHER_NO_SEARCH_PATH` may be set (to any value) to skip this search of :envvar:`PATH`.
ru: Форма ``/usr/bin/env`` строки shebang имеет еще одно особое свойство. Прежде чем искать установленные интерпретаторы Python, эта форма выполнит поиск исполняемого файла :envvar:`PATH` для исполняемого файла Python, соответствующего имени, указанному в качестве первого аргумента. Это соответствует поведению программы env в Unix, которая выполняет поиск по :envvar:`PATH`. Если исполняемый файл, соответствующий первому аргументу после команды env, не может быть найден, но аргумент начинается с Python, он будет обработан, как описано для других виртуальных команд. Переменная среды :envvar:`PYLAUNCHER_NO_SEARCH_PATH` может быть установлена ​​(любое значение), чтобы пропустить этот поиск :envvar:`PATH`.

source: Shebang lines that do not match any of these patterns are looked up in the ``[commands]`` section of the launcher's :ref:`.INI file <launcher-ini>`. This may be used to handle certain commands in a way that makes sense for your system. The name of the command must be a single argument (no spaces in the shebang executable), and the value substituted is the full path to the executable (additional arguments specified in the .INI will be quoted as part of the filename).
ru: Строки Shebang, которые не соответствуют ни одному из этих шаблонов, ищутся в разделе ``[commands]`` :ref:`.INI-файла программы запуска <launcher-ini>`. Это можно использовать для обработки определенных команд способом, который имеет смысл для вашей системы. Имя команды должно быть одним аргументом (без пробелов в исполняемом файле shebang), а подставляемое значение — это полный путь к исполняемому файлу (дополнительные аргументы, указанные в .INI, будут заключены в кавычки как часть имени файла).

source: Any commands not found in the .INI file are treated as **Windows** executable paths that are absolute or relative to the directory containing the script file. This is a convenience for Windows-only scripts, such as those generated by an installer, since the behavior is not compatible with Unix-style shells. These paths may be quoted, and may include multiple arguments, after which the path to the script and any additional arguments will be appended.
ru: Любые команды, не найденные в файле .INI, рассматриваются как пути к исполняемым файлам **Windows**, которые являются абсолютными или относительными к каталогу, содержащему файл сценария. Это удобно для сценариев только для Windows, например, созданных установщиком, поскольку такое поведение несовместимо с оболочками в стиле Unix. Эти пути могут быть заключены в кавычки и могут включать несколько аргументов, после которых будет добавлен путь к сценарию и любые дополнительные аргументы.

source: Arguments in shebang lines
ru: Аргументы в строках shebang

source: The shebang lines can also specify additional options to be passed to the Python interpreter. For example, if you have a shebang line:
ru: Строки shebang также могут указывать дополнительные параметры, которые будут переданы интерпретатору Python. Например, если у вас есть строка shebang:

source: Then Python will be started with the ``-v`` option
ru: Затем Python запустится с опцией ``-v``.

source: Customization
ru: Настройка

source: Customization via INI files
ru: Настройка через INI-файлы

source: Two .ini files will be searched by the launcher - ``py.ini`` in the current user's application data directory (``%LOCALAPPDATA%`` or ``$env:LocalAppData``) and ``py.ini`` in the same directory as the launcher. The same .ini files are used for both the 'console' version of the launcher (i.e. py.exe) and for the 'windows' version (i.e. pyw.exe).
ru: Программа запуска будет искать два файла .ini: ``py.ini`` в каталоге данных приложения текущего пользователя (``%LOCALAPPDATA%`` или ``$env:LocalAppData``) и ``py.ini` `в том же каталоге, что и программа запуска. Одни и те же файлы .ini используются как для «консольной» версии программы запуска (т. е. py.exe), так и для «виндовской» версии (т. е. pyw.exe).

source: Customization specified in the "application directory" will have precedence over the one next to the executable, so a user, who may not have write access to the .ini file next to the launcher, can override commands in that global .ini file.
ru: Настройка, указанная в «каталоге приложения», будет иметь приоритет над той, которая находится рядом с исполняемым файлом, поэтому пользователь, у которого может не быть доступа на запись в файл .ini рядом с программой запуска, может переопределить команды в этом глобальном файле .ini.

source: Customizing default Python versions
ru: Настройка версий Python по умолчанию

source: In some cases, a version qualifier can be included in a command to dictate which version of Python will be used by the command. A version qualifier starts with a major version number and can optionally be followed by a period ('.') and a minor version specifier. Furthermore it is possible to specify if a 32 or 64 bit implementation shall be requested by adding "-32" or "-64".
ru: В некоторых случаях в команду можно включить квалификатор версии, чтобы указать, какая версия Python будет использоваться командой. Спецификатор версии начинается с основного номера версии, за которым при необходимости может следовать точка («.») и дополнительный спецификатор версии. Кроме того, можно указать, должна ли запрашиваться 32- или 64-битная реализация, добавив «-32» или «-64».

source: For example, a shebang line of ``#!python`` has no version qualifier, while ``#!python3`` has a version qualifier which specifies only a major version.
ru: Например, строка shebang ``#!python`` не имеет квалификатора версии, а ``#!python3`` имеет квалификатор версии, который указывает только основную версию.

source: If no version qualifiers are found in a command, the environment variable :envvar:`PY_PYTHON` can be set to specify the default version qualifier. If it is not set, the default is "3". The variable can specify any value that may be passed on the command line, such as "3", "3.7", "3.7-32" or "3.7-64". (Note that the "-64" option is only available with the launcher included with Python 3.7 or newer.)
ru: Если в команде не найдены квалификаторы версии, переменная среды :envvar:`PY_PYTHON` может быть установлена ​​для указания квалификатора версии по умолчанию. Если он не установлен, значением по умолчанию является «3». Переменная может указывать любое значение, которое можно передать в командной строке, например «3», «3,7», «3,7-32» или «3,7-64». (Обратите внимание, что опция «-64» доступна только в средстве запуска, входящем в состав Python 3.7 или новее.)

source: If no minor version qualifiers are found, the environment variable ``PY_PYTHON{major}`` (where ``{major}`` is the current major version qualifier as determined above) can be set to specify the full version. If no such option is found, the launcher will enumerate the installed Python versions and use the latest minor release found for the major version, which is likely, although not guaranteed, to be the most recently installed version in that family.
ru: Если квалификаторы младшей версии не найдены, переменная среды PY_PYTHON{major}`` (где {major}`` — это текущий квалификатор основной версии, как определено выше) может быть установлена ​​для указания полной версии. Если такая опция не найдена, программа запуска перечисляет установленные версии Python и использует последнюю второстепенную версию, найденную для основной версии, которая, скорее всего, хотя и не гарантированно, будет самой последней установленной версией в этом семействе.

source: On 64-bit Windows with both 32-bit and 64-bit implementations of the same (major.minor) Python version installed, the 64-bit version will always be preferred. This will be true for both 32-bit and 64-bit implementations of the launcher - a 32-bit launcher will prefer to execute a 64-bit Python installation of the specified version if available. This is so the behavior of the launcher can be predicted knowing only what versions are installed on the PC and without regard to the order in which they were installed (i.e., without knowing whether a 32 or 64-bit version of Python and corresponding launcher was installed last). As noted above, an optional "-32" or "-64" suffix can be used on a version specifier to change this behaviour.
ru: В 64-разрядной версии Windows с установленными как 32-разрядной, так и 64-разрядной реализациями одной и той же (основной.второстепенной) версии Python 64-разрядная версия всегда будет предпочтительнее. Это будет справедливо как для 32-битной, так и для 64-битной реализации средства запуска — 32-разрядное средство запуска предпочтет выполнить 64-разрядную установку Python указанной версии, если она доступна. Это сделано для того, чтобы поведение программы запуска можно было предсказать, зная только, какие версии установлены на ПК, и без учета порядка их установки (т. е. не зная, была ли установлена ​​32- или 64-битная версия Python и соответствующая программа запуска). установлен последним). Как отмечалось выше, для изменения этого поведения в спецификаторе версии можно использовать необязательный суффикс «-32» или «-64».

source: Examples:
ru: Примеры:

source: If no relevant options are set, the commands ``python`` and ``python2`` will use the latest Python 2.x version installed and the command ``python3`` will use the latest Python 3.x installed.
ru: Если соответствующие параметры не установлены, команды ``python`` и ``python2`` будут использовать последнюю установленную версию Python 2.x, а команда ``python3`` будет использовать последнюю установленную версию Python 3.x.

source: The command ``python3.7`` will not consult any options at all as the versions are fully specified.
ru: Команда ``python3.7`` вообще не будет просматривать какие-либо параметры, поскольку версии полностью указаны.

source: If ``PY_PYTHON=3``, the commands ``python`` and ``python3`` will both use the latest installed Python 3 version.
ru: Если PY_PYTHON=3, команды python и python3 будут использовать последнюю установленную версию Python 3.

source: If ``PY_PYTHON=3.7-32``, the command ``python`` will use the 32-bit implementation of 3.7 whereas the command ``python3`` will use the latest installed Python (PY_PYTHON was not considered at all as a major version was specified.)
ru: Если PY_PYTHON=3.7-32, команда Python будет использовать 32-битную реализацию версии 3.7, тогда как команда Python3 будет использовать последнюю установленную версию Python (PY_PYTHON вообще не рассматривался как была указана основная версия.)

source: If ``PY_PYTHON=3`` and ``PY_PYTHON3=3.7``, the commands ``python`` and ``python3`` will both use specifically 3.7
ru: Если ``PY_PYTHON=3`` и ``PY_PYTHON3=3.7``, команды ``python`` и ``python3`` будут использовать именно версию 3.7.

source: In addition to environment variables, the same settings can be configured in the .INI file used by the launcher. The section in the INI file is called ``[defaults]`` and the key name will be the same as the environment variables without the leading ``PY_`` prefix (and note that the key names in the INI file are case insensitive.) The contents of an environment variable will override things specified in the INI file.
ru: Помимо переменных среды, те же параметры можно настроить в файле .INI, используемом программой запуска. Раздел в INI-файле называется ``[defaults]``, и имя ключа будет таким же, как и переменные среды, без ведущего префикса ``PY_`` (обратите внимание, что имена ключей в INI-файле нечувствительны к регистру). .) Содержимое переменной среды переопределяет данные, указанные в INI-файле.

source: For example:
ru: Например:

source: Setting ``PY_PYTHON=3.7`` is equivalent to the INI file containing:
ru: Установка ``PY_PYTHON=3.7`` эквивалентна INI-файлу, содержащему:

source: Setting ``PY_PYTHON=3`` and ``PY_PYTHON3=3.7`` is equivalent to the INI file containing:
ru: Установка ``PY_PYTHON=3`` и ``PY_PYTHON3=3.7`` эквивалентна INI-файлу, содержащему:

source: Diagnostics
ru: Диагностика

source: If an environment variable :envvar:`PYLAUNCHER_DEBUG` is set (to any value), the launcher will print diagnostic information to stderr (i.e. to the console). While this information manages to be simultaneously verbose *and* terse, it should allow you to see what versions of Python were located, why a particular version was chosen and the exact command-line used to execute the target Python. It is primarily intended for testing and debugging.
ru: Если переменная среды :envvar:`PYLAUNCHER_DEBUG` установлена ​​(любое значение), программа запуска будет печатать диагностическую информацию в stderr (т.е. на консоль). Хотя эта информация может быть одновременно подробной *и* краткой, она должна позволить вам увидеть, какие версии Python были расположены, почему была выбрана конкретная версия и точная командная строка, использованная для выполнения целевого Python. Он в первую очередь предназначен для тестирования и отладки.

source: Dry Run
ru: Пробный прогон

source: If an environment variable :envvar:`PYLAUNCHER_DRYRUN` is set (to any value), the launcher will output the command it would have run, but will not actually launch Python. This may be useful for tools that want to use the launcher to detect and then launch Python directly. Note that the command written to standard output is always encoded using UTF-8, and may not render correctly in the console.
ru: Если для переменной среды :envvar:`PYLAUNCHER_DRYRUN` установлено любое значение, программа запуска выведет команду, которую она должна была выполнить, но фактически не запустит Python. Это может быть полезно для инструментов, которые хотят использовать средство запуска для обнаружения и последующего запуска Python напрямую. Обратите внимание, что команда, записываемая в стандартный вывод, всегда кодируется с использованием UTF-8 и может неправильно отображаться в консоли.

source: Install on demand
ru: Установить по требованию

source: If an environment variable :envvar:`PYLAUNCHER_ALLOW_INSTALL` is set (to any value), and the requested Python version is not installed but is available on the Microsoft Store, the launcher will attempt to install it. This may require user interaction to complete, and you may need to run the command again.
ru: Если для переменной среды :envvar:`PYLAUNCHER_ALLOW_INSTALL` установлено (любое значение), а запрошенная версия Python не установлена, но доступна в Microsoft Store, программа запуска попытается установить ее. Для завершения может потребоваться взаимодействие с пользователем, и вам может потребоваться выполнить команду еще раз.

source: An additional :envvar:`PYLAUNCHER_ALWAYS_INSTALL` variable causes the launcher to always try to install Python, even if it is detected. This is mainly intended for testing (and should be used with :envvar:`PYLAUNCHER_DRYRUN`).
ru: Дополнительная переменная :envvar:`PYLAUNCHER_ALWAYS_INSTALL` заставляет программу запуска всегда пытаться установить Python, даже если он обнаружен. В основном это предназначено для тестирования (и его следует использовать с :envvar:`PYLAUNCHER_DRYRUN`).

source: Return codes
ru: Коды возврата

source: The following exit codes may be returned by the Python launcher. Unfortunately, there is no way to distinguish these from the exit code of Python itself.
ru: Следующие коды завершения могут быть возвращены программой запуска Python. К сожалению, невозможно отличить их от кода завершения самого Python.

source: The names of codes are as used in the sources, and are only for reference. There is no way to access or resolve them apart from reading this page. Entries are listed in alphabetical order of names.
ru: Названия кодов приведены в источниках и предназначены только для справки. Невозможно получить доступ к ним или решить их, кроме как прочитать эту страницу. Записи перечислены в алфавитном порядке названий.

source: Value
ru: Значение

source: A :file:`pyvenv.cfg` was found but is corrupt.
ru: Файл :file:`pyvenv.cfg` найден, но поврежден.

source: Failed to launch Python.
ru: Не удалось запустить Python.

source: An install was started, but the command will need to be re-run after it completes.
ru: Установка была начата, но после ее завершения команду необходимо будет запустить повторно.

source: Unexpected error. Please report a bug.
ru: Неожиданная ошибка. Пожалуйста, сообщите об ошибке.

source: Unable to obtain command line from the operating system.
ru: Невозможно получить командную строку из операционной системы.

source: Unable to locate the requested version.
ru: Не удалось найти запрошенную версию.

source: A :file:`pyvenv.cfg` was required but not found.
ru: Файл :file:`pyvenv.cfg` был необходим, но не найден.

source: Finding modules
ru: Поиск модулей

source: These notes supplement the description at :ref:`sys-path-init` with detailed Windows notes.
ru: Эти примечания дополняют описание в :ref:`sys-path-init` подробными примечаниями по Windows.

source: When no ``._pth`` file is found, this is how :data:`sys.path` is populated on Windows:
ru: Если файл ``._pth`` не найден, в Windows заполняется :data:`sys.path`:

source: An empty entry is added at the start, which corresponds to the current directory.
ru: В начало добавляется пустая запись, соответствующая текущему каталогу.

source: If the environment variable :envvar:`PYTHONPATH` exists, as described in :ref:`using-on-envvars`, its entries are added next. Note that on Windows, paths in this variable must be separated by semicolons, to distinguish them from the colon used in drive identifiers (``C:\`` etc.).
ru: Если переменная среды :envvar:`PYTHONPATH` существует, как описано в :ref:`using-on-envvars`, ее записи добавляются следующими. Обратите внимание, что в Windows пути в этой переменной должны быть разделены точкой с запятой, чтобы отличить их от двоеточия, используемого в идентификаторах дисков (``C:\`` и т. д.).

source: Additional "application paths" can be added in the registry as subkeys of :samp:`\\SOFTWARE\\Python\\PythonCore\\{version}\\PythonPath` under both the ``HKEY_CURRENT_USER`` and ``HKEY_LOCAL_MACHINE`` hives. Subkeys which have semicolon-delimited path strings as their default value will cause each path to be added to :data:`sys.path`. (Note that all known installers only use HKLM, so HKCU is typically empty.)
ru: Дополнительные «пути к приложениям» можно добавить в реестр как подразделы :samp:`\\SOFTWARE\\Python\\PythonCore\\{version}\\PythonPath` как в ``HKEY_CURRENT_USER``, так и в ``HKEY_LOCAL_MACHINE`` крапивница. Подключи, которые имеют строки пути, разделенные точкой с запятой, в качестве значения по умолчанию, приведут к добавлению каждого пути в :data:`sys.path`. (Обратите внимание, что все известные установщики используют только HKLM, поэтому HKCU обычно пуст.)

source: If the environment variable :envvar:`PYTHONHOME` is set, it is assumed as "Python Home". Otherwise, the path of the main Python executable is used to locate a "landmark file" (either ``Lib\os.py`` or ``pythonXY.zip``) to deduce the "Python Home". If a Python home is found, the relevant sub-directories added to :data:`sys.path` (``Lib``, ``plat-win``, etc) are based on that folder. Otherwise, the core Python path is constructed from the PythonPath stored in the registry.
ru: Если установлена ​​переменная среды :envvar:`PYTHONHOME`, она считается «Python Home». В противном случае путь к основному исполняемому файлу Python используется для поиска «файла ориентира» (либо ``Lib\os.py``, либо ``pythonXY.zip``), чтобы определить «домой Python». Если домашний каталог Python найден, соответствующие подкаталоги, добавленные в :data:`sys.path` (``Lib``, ``plat-win`` и т. д.), основаны на этой папке. В противном случае основной путь Python создается на основе PythonPath, хранящегося в реестре.

source: If the Python Home cannot be located, no :envvar:`PYTHONPATH` is specified in the environment, and no registry entries can be found, a default path with relative entries is used (e.g. ``.\Lib;.\plat-win``, etc).
ru: Если невозможно найти домашнюю страницу Python, в среде не указан :envvar:`PYTHONPATH` и не удается найти записи реестра, используется путь по умолчанию с относительными записями (например, ``.\Lib;.\plat-win `` и т. д.).

source: If a ``pyvenv.cfg`` file is found alongside the main executable or in the directory one level above the executable, the following variations apply:
ru: Если файл ``pyvenv.cfg`` находится рядом с основным исполняемым файлом или в каталоге на один уровень выше исполняемого файла, применяются следующие варианты:

source: If ``home`` is an absolute path and :envvar:`PYTHONHOME` is not set, this path is used instead of the path to the main executable when deducing the home location.
ru: Если ``home`` является абсолютным путем и :envvar:`PYTHONHOME` не установлен, этот путь используется вместо пути к основному исполняемому файлу при определении домашнего местоположения.

source: The end result of all this is:
ru: Конечным результатом всего этого является:

source: When running :file:`python.exe`, or any other .exe in the main Python directory (either an installed version, or directly from the PCbuild directory), the core path is deduced, and the core paths in the registry are ignored. Other "application paths" in the registry are always read.
ru: При запуске :file:`python.exe` или любого другого .exe в основном каталоге Python (либо установленной версии, либо непосредственно из каталога PCbuild) выводится основной путь, а основные пути в реестре игнорируются. . Другие «пути приложений» в реестре всегда читаются.

source: When Python is hosted in another .exe (different directory, embedded via COM, etc), the "Python Home" will not be deduced, so the core path from the registry is used. Other "application paths" in the registry are always read.
ru: Когда Python размещен в другом .exe-файле (другом каталоге, внедренном через COM и т. д.), «Python Home» не будет выведен, поэтому используется основной путь из реестра. Другие «пути приложений» в реестре всегда читаются.
