Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/using/windows.po
Languages: ru

source: Using Python on Windows
ru: Использование Python в Windows

source: This document aims to give an overview of Windows-specific behaviour you should know about when using Python on Microsoft Windows.
ru: Целью этого документа является предоставление обзора поведения, специфичного для Windows, о котором вам следует знать при использовании Python в Microsoft Windows.

source: Unlike most Unix systems and services, Windows does not include a system supported installation of Python. To make Python available, the CPython team has compiled Windows installers with every `release <https://www.python.org/downloads/>`_ for many years. These installers are primarily intended to add a per-user installation of Python, with the core interpreter and library being used by a single user. The installer is also able to install for all users of a single machine, and a separate ZIP file is available for application-local distributions.
ru: В отличие от большинства систем и служб Unix, Windows не включает поддерживаемую системой установку Python. Чтобы сделать Python доступным, команда CPython на протяжении многих лет компилировала установщики Windows с каждым `выпуском <https://www.python.org/downloads/>`_. Эти установщики в первую очередь предназначены для добавления индивидуальной установки Python, при этом основной интерпретатор и библиотека используются одним пользователем. Установщик также может устанавливаться для всех пользователей одного компьютера, а для локальных дистрибутивов приложения доступен отдельный ZIP-файл.

source: As specified in :pep:`11`, a Python release only supports a Windows platform while Microsoft considers the platform under extended support. This means that Python |version| supports Windows 8.1 and newer. If you require Windows 7 support, please install Python 3.8.
ru: Как указано в :pep:`11`, версия Python поддерживает только платформу Windows, в то время как Microsoft рассматривает платформу с расширенной поддержкой. Это означает, что Питон |версия| поддерживает Windows 8.1 и новее. Если вам требуется поддержка Windows 7, установите Python 3.8.

source: There are a number of different installers available for Windows, each with certain benefits and downsides.
ru: Для Windows доступно несколько различных установщиков, каждый из которых имеет определенные преимущества и недостатки.

source: :ref:`windows-full` contains all components and is the best option for developers using Python for any kind of project.
ru: :ref:`windows-full` содержит все компоненты и является лучшим вариантом для разработчиков, использующих Python для любого проекта.

source: :ref:`windows-store` is a simple installation of Python that is suitable for running scripts and packages, and using IDLE or other development environments. It requires Windows 10 and above, but can be safely installed without corrupting other programs. It also provides many convenient commands for launching Python and its tools.
ru: :ref:`windows-store` — это простая установка Python, которая подходит для запуска скриптов и пакетов, а также использования IDLE или других сред разработки. Для него требуется Windows 10 и выше, но его можно безопасно установить, не повреждая другие программы. Он также предоставляет множество удобных команд для запуска Python и его инструментов.

source: :ref:`windows-nuget` are lightweight installations intended for continuous integration systems. It can be used to build Python packages or run scripts, but is not updateable and has no user interface tools.
ru: :ref:`windows-nuget` — это облегченные установки, предназначенные для систем непрерывной интеграции. Его можно использовать для сборки пакетов Python или запуска сценариев, но он не подлежит обновлению и не имеет инструментов пользовательского интерфейса.

source: :ref:`windows-embeddable` is a minimal package of Python suitable for embedding into a larger application.
ru: :ref:`windows-embeddable` — это минимальный пакет Python, подходящий для встраивания в более крупное приложение.

source: The full installer
ru: Полная программа установки

source: Installation steps
ru: Этапы установки

source: Four Python |version| installers are available for download - two each for the 32-bit and 64-bit versions of the interpreter. The *web installer* is a small initial download, and it will automatically download the required components as necessary. The *offline installer* includes the components necessary for a default installation and only requires an internet connection for optional features. See :ref:`install-layout-option` for other ways to avoid downloading during installation.
ru: Четыре питона |версия| для скачивания доступны установщики — по два для 32-битной и 64-битной версии интерпретатора. *Веб-установщик* — это небольшая первоначальная загрузка, которая при необходимости автоматически загрузит необходимые компоненты. *Автономный установщик* включает в себя компоненты, необходимые для установки по умолчанию, и требует только подключения к Интернету для использования дополнительных функций. См. :ref:`install-layout-option`, чтобы узнать о других способах избежать загрузки во время установки.

source: After starting the installer, one of two options may be selected:
ru: После запуска установщика можно выбрать один из двух вариантов:

source: If you select "Install Now":
ru: Если вы выберете «Установить сейчас»:

source: You will *not* need to be an administrator (unless a system update for the C Runtime Library is required or you install the :ref:`launcher` for all users)
ru: Вам *не* обязательно быть администратором (если не требуется обновление системы для библиотеки времени выполнения C или если вы не устанавливаете :ref:`launcher` для всех пользователей)

source: Python will be installed into your user directory
ru: Python будет установлен в ваш пользовательский каталог.

source: The :ref:`launcher` will be installed according to the option at the bottom of the first page
ru: :ref:`launcher` будет установлен в соответствии с опцией внизу первой страницы.

source: The standard library, test suite, launcher and pip will be installed
ru: Будет установлена ​​стандартная библиотека, набор тестов, программа запуска и pip.

source: If selected, the install directory will be added to your :envvar:`PATH`
ru: Если этот флажок установлен, каталог установки будет добавлен в ваш :envvar:`PATH`

source: Shortcuts will only be visible for the current user
ru: Ярлыки будут видны только текущему пользователю.

source: Selecting "Customize installation" will allow you to select the features to install, the installation location and other options or post-install actions. To install debugging symbols or binaries, you will need to use this option.
ru: Выбор «Настроить установку» позволит вам выбрать функции для установки, место установки и другие параметры или действия после установки. Чтобы установить символы отладки или двоичные файлы, вам нужно будет использовать эту опцию.

source: To perform an all-users installation, you should select "Customize installation". In this case:
ru: Чтобы выполнить установку для всех пользователей, следует выбрать «Настроить установку». В этом случае:

source: You may be required to provide administrative credentials or approval
ru: Вам может потребоваться предоставить административные полномочия или разрешение.

source: Python will be installed into the Program Files directory
ru: Python будет установлен в каталог Program Files.

source: The :ref:`launcher` will be installed into the Windows directory
ru: :ref:`launcher` будет установлен в каталог Windows.

source: Optional features may be selected during installation
ru: Дополнительные функции могут быть выбраны во время установки.

source: The standard library can be pre-compiled to bytecode
ru: Стандартную библиотеку можно предварительно скомпилировать в байт-код.

source: If selected, the install directory will be added to the system :envvar:`PATH`
ru: Если выбрано, каталог установки будет добавлен в систему :envvar:`PATH`

source: Shortcuts are available for all users
ru: Ярлыки доступны всем пользователям.

source: Removing the MAX_PATH Limitation
ru: Удаление ограничения MAX_PATH

source: Windows historically has limited path lengths to 260 characters. This meant that paths longer than this would not resolve and errors would result.
ru: Windows исторически имеет ограничение длины пути до 260 символов. Это означало, что пути, более длинные, не разрешались, и это приводило к ошибкам.

source: In the latest versions of Windows, this limitation can be expanded to approximately 32,000 characters. Your administrator will need to activate the "Enable Win32 long paths" group policy, or set ``LongPathsEnabled`` to ``1`` in the registry key ``HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\FileSystem``.
ru: В последних версиях Windows это ограничение можно расширить примерно до 32 000 символов. Вашему администратору необходимо будет активировать групповую политику «Включить длинные пути Win32» или установить для параметра «LongPathsEnabled» значение «1» в ключе реестра «HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\FileSystem».

source: This allows the :func:`open` function, the :mod:`os` module and most other path functionality to accept and return paths longer than 260 characters.
ru: Это позволяет функции :func:`open`, модулю :mod:`os` и большинству других функций пути принимать и возвращать пути длиной более 260 символов.

source: After changing the above option, no further configuration is required.
ru: После изменения вышеуказанной опции дальнейшая настройка не требуется.

source: Support for long paths was enabled in Python.
ru: В Python включена поддержка длинных путей.

source: Installing Without UI
ru: Установка без пользовательского интерфейса

source: All of the options available in the installer UI can also be specified from the command line, allowing scripted installers to replicate an installation on many machines without user interaction. These options may also be set without suppressing the UI in order to change some of the defaults.
ru: Все параметры, доступные в пользовательском интерфейсе установщика, также можно указать из командной строки, что позволяет установщикам по сценарию реплицировать установку на многих компьютерах без взаимодействия с пользователем. Эти параметры также можно установить без отключения пользовательского интерфейса, чтобы изменить некоторые значения по умолчанию.

source: The following options (found by executing the installer with ``/?``) can be passed into the installer:
ru: Следующие параметры (которые можно найти, запустив установщик с помощью ``/?``) можно передать в установщик:

source: Name
ru: Имя

source: Description
ru: Описание

source: to display progress without requiring user interaction
ru: для отображения прогресса без необходимости взаимодействия с пользователем

source: to install/uninstall without displaying any UI
ru: для установки/удаления без отображения какого-либо пользовательского интерфейса

source: to prevent user customization
ru: чтобы предотвратить настройку пользователя

source: to remove Python (without confirmation)
ru: удалить Python (без подтверждения)

source: to pre-download all components
ru: предварительно скачать все компоненты

source: to specify log files location
ru: указать расположение файлов журналов

source: All other options are passed as ``name=value``, where the value is usually ``0`` to disable a feature, ``1`` to enable a feature, or a path. The full list of available options is shown below.
ru: Все остальные параметры передаются как ``name=value``, где значение обычно равно ``0`` для отключения функции, ``1`` для включения функции или пути. Полный список доступных опций показан ниже.

source: Default
ru: значение по умолчанию

source: Perform a system-wide installation.
ru: Выполните общесистемную установку.

source: The installation directory
ru: Каталог установки

source: Selected based on InstallAllUsers
ru: Выбрано на основе InstallAllUsers

source: The default installation directory for all-user installs
ru: Каталог установки по умолчанию для общепользовательских установок.

source: The default install directory for just-for-me installs
ru: Каталог установки по умолчанию для установки «только для меня».

source: The default custom install directory displayed in the UI
ru: Каталог выборочной установки по умолчанию, отображаемый в пользовательском интерфейсе.

source: (empty)
ru: (пусто)

source: Create file associations if the launcher is also installed.
ru: Создайте ассоциации файлов, если программа запуска также установлена.

source: Compile all ``.py`` files to ``.pyc``.
ru: Скомпилируйте все файлы ``.py`` в ``.pyc``.

source: Prepend install and Scripts directories to :envvar:`PATH` and add ``.PY`` to :envvar:`PATHEXT`
ru: Добавьте каталоги установки и сценариев к :envvar:`PATH` и добавьте ``.PY`` к :envvar:`PATHEXT`

source: Append install and Scripts directories to :envvar:`PATH` and add ``.PY`` to :envvar:`PATHEXT`
ru: Добавьте каталоги установки и скриптов в :envvar:`PATH` и добавьте ``.PY`` в :envvar:`PATHEXT`

source: Shortcuts
ru: Ярлыки

source: Create shortcuts for the interpreter, documentation and IDLE if installed.
ru: Создайте ярлыки для интерпретатора, документации и IDLE, если они установлены.

source: Install Python manual
ru: Руководство по установке Python

source: Install debug binaries
ru: Установите двоичные файлы отладки

source: Install developer headers and libraries. Omitting this may lead to an unusable installation.
ru: Установите заголовки и библиотеки разработчика. Если этого не сделать, установка может оказаться непригодной для использования.

source: Install :file:`python.exe` and related files. Omitting this may lead to an unusable installation.
ru: Установите :file:`python.exe` и связанные файлы. Если этого не сделать, установка может оказаться непригодной для использования.

source: Install :ref:`launcher`.
ru: Установите :ref:`launcher`.

source: Installs the launcher for all users. Also requires ``Include_launcher`` to be set to 1
ru: Устанавливает лаунчер для всех пользователей. Также требуется, чтобы для Include_launcher было установлено значение 1.

source: Install standard library and extension modules. Omitting this may lead to an unusable installation.
ru: Установите стандартную библиотеку и модули расширения. Если этого не сделать, установка может оказаться непригодной для использования.

source: Install bundled pip and setuptools
ru: Установите прилагаемые pip и setuptools.

source: Install debugging symbols (``*.pdb``)
ru: Установите символы отладки (``*.pdb``)

source: Install Tcl/Tk support and IDLE
ru: Установите поддержку Tcl/Tk и IDLE.

source: Include_test
ru: Включить_тест

source: Install standard library test suite
ru: Установите набор тестов стандартной библиотеки.

source: Install utility scripts
ru: Установка служебных скриптов

source: Only installs the launcher. This will override most other options.
ru: Устанавливает только лаунчер. Это переопределит большинство других опций.

source: Disable most install UI
ru: Отключить большинство установочных интерфейсов

source: A custom message to display when the simplified install UI is used.
ru: Пользовательское сообщение, отображаемое при использовании упрощенного пользовательского интерфейса установки.

source: For example, to silently install a default, system-wide Python installation, you could use the following command (from an elevated command prompt)::
ru: Например, чтобы в автоматическом режиме установить общесистемную установку Python по умолчанию, вы можете использовать следующую команду (из командной строки с повышенными привилегиями):

source: To allow users to easily install a personal copy of Python without the test suite, you could provide a shortcut with the following command. This will display a simplified initial page and disallow customization::
ru: Чтобы пользователи могли легко установить личную копию Python без набора тестов, вы можете предоставить ярлык с помощью следующей команды. Это отобразит упрощенную начальную страницу и запретит настройку::

source: (Note that omitting the launcher also omits file associations, and is only recommended for per-user installs when there is also a system-wide installation that included the launcher.)
ru: (Обратите внимание, что при исключении средства запуска также игнорируются ассоциации файлов, и это рекомендуется только для индивидуальных установок, когда существует также общесистемная установка, включающая средство запуска.)

source: The options listed above can also be provided in a file named ``unattend.xml`` alongside the executable. This file specifies a list of options and values. When a value is provided as an attribute, it will be converted to a number if possible. Values provided as element text are always left as strings. This example file sets the same options as the previous example:
ru: Перечисленные выше параметры также можно предоставить в файле unattend.xml вместе с исполняемым файлом. Этот файл определяет список параметров и значений. Если значение предоставляется в качестве атрибута, оно будет преобразовано в число, если это возможно. Значения, предоставленные в виде текста элемента, всегда остаются в виде строк. В этом примере файла установлены те же параметры, что и в предыдущем примере:

source: Installing Without Downloading
ru: Установка без загрузки

source: As some features of Python are not included in the initial installer download, selecting those features may require an internet connection. To avoid this need, all possible components may be downloaded on-demand to create a complete *layout* that will no longer require an internet connection regardless of the selected features. Note that this download may be bigger than required, but where a large number of installations are going to be performed it is very useful to have a locally cached copy.
ru: Поскольку некоторые функции Python не включены в первоначальную загрузку установщика, для их выбора может потребоваться подключение к Интернету. Чтобы избежать этой необходимости, все возможные компоненты могут быть загружены по требованию для создания полного *макета*, который больше не потребует подключения к Интернету, независимо от выбранных функций. Обратите внимание, что эта загрузка может быть больше, чем требуется, но если планируется выполнить большое количество установок, очень полезно иметь локально кэшированную копию.

source: Execute the following command from Command Prompt to download all possible required files. Remember to substitute ``python-3.9.0.exe`` for the actual name of your installer, and to create layouts in their own directories to avoid collisions between files with the same name.
ru: Выполните следующую команду из командной строки, чтобы загрузить все возможные необходимые файлы. Не забудьте заменить фактическое имя вашего установщика на ``python-3.9.0.exe`` и создавать макеты в своих собственных каталогах, чтобы избежать конфликтов между файлами с одинаковыми именами.

source: You may also specify the ``/quiet`` option to hide the progress display.
ru: Вы также можете указать опцию ``/quiet``, чтобы скрыть отображение прогресса.

source: Modifying an install
ru: Изменение установки

source: Once Python has been installed, you can add or remove features through the Programs and Features tool that is part of Windows. Select the Python entry and choose "Uninstall/Change" to open the installer in maintenance mode.
ru: После установки Python вы можете добавлять или удалять функции с помощью инструмента «Программы и компоненты», входящего в состав Windows. Выберите запись Python и выберите «Удалить/Изменить», чтобы открыть установщик в режиме обслуживания.

source: "Modify" allows you to add or remove features by modifying the checkboxes - unchanged checkboxes will not install or remove anything. Some options cannot be changed in this mode, such as the install directory; to modify these, you will need to remove and then reinstall Python completely.
ru: «Изменить» позволяет добавлять или удалять функции путем изменения флажков — неизмененные флажки ничего не устанавливают и не удаляют. Некоторые параметры невозможно изменить в этом режиме, например каталог установки; чтобы изменить их, вам нужно будет удалить, а затем полностью переустановить Python.

source: "Repair" will verify all the files that should be installed using the current settings and replace any that have been removed or modified.
ru: «Восстановление» проверит все файлы, которые следует установить, с использованием текущих настроек, и заменит все файлы, которые были удалены или изменены.

source: "Uninstall" will remove Python entirely, with the exception of the :ref:`launcher`, which has its own entry in Programs and Features.
ru: «Удалить» полностью удалит Python, за исключением :ref:`launcher`, у которого есть отдельная запись в разделе «Программы и компоненты».

source: Installing Free-threaded Binaries
ru: Установка двоичных файлов с свободной резьбой

source: (Experimental)
ru: (Экспериментальный)

source: Everything described in this section is considered experimental, and should be expected to change in future releases.
ru: Все, что описано в этом разделе, считается экспериментальным и должно быть изменено в будущих выпусках.

source: To install pre-built binaries with free-threading enabled (see :pep:`703`), you should select "Customize installation". The second page of options includes the "Download free-threaded binaries" checkbox.
ru: Чтобы установить предварительно собранные двоичные файлы с включенной поддержкой многопоточности (см. :pep:`703`), вам следует выбрать «Настроить установку». На второй странице параметров есть флажок «Загружать бесплатные двоичные файлы».

source: Selecting this option will download and install additional binaries to the same location as the main Python install. The main executable is called ``python3.13t.exe``, and other binaries either receive a ``t`` suffix or a full ABI suffix. Python source files and bundled third-party dependencies are shared with the main install.
ru: При выборе этой опции дополнительные двоичные файлы будут загружены и установлены в то же место, где находится основная установка Python. Основной исполняемый файл называется «python3.13t.exe», а другие двоичные файлы получают либо суффикс «t», либо полный суффикс ABI. Исходные файлы Python и связанные сторонние зависимости используются совместно с основной установкой.

source: The free-threaded version is registered as a regular Python install with the tag ``3.13t`` (with a ``-32`` or ``-arm64`` suffix as normal for those platforms). This allows tools to discover it, and for the :ref:`launcher` to support ``py.exe -3.13t``. Note that the launcher will interpret ``py.exe -3`` (or a ``python3`` shebang) as "the latest 3.x install", which will prefer the free-threaded binaries over the regular ones, while ``py.exe -3.13`` will not. If you use the short style of option, you may prefer to not install the free-threaded binaries at this time.
ru: Версия со свободным потоком регистрируется как обычная установка Python с тегом ``3.13t`` (с суффиксом ``-32`` или ``-arm64``, как обычно для этих платформ). Это позволяет инструментам обнаружить его, а :ref:`launcher` поддерживать py.exe -3.13t``. Обратите внимание, что программа запуска будет интерпретировать ``py.exe -3`` (или ``python3`` shebang) как "последнюю установку 3.x", которая будет предпочитать свободные поточные двоичные файлы обычным, в то время как `` `py.exe -3.13`` не будет. Если вы используете короткий стиль, вы можете предпочесть не устанавливать на данный момент двоичные файлы со свободной резьбой.
