Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/using/windows.po
Languages: ru

source: Previously Enthought provided Canopy, but it `reached end of life in 2016 <https://support.enthought.com/hc/en-us/articles/360038600051-Canopy-GUI-end-of-life-transition-to-the-Enthought-Deployment-Manager-EDM-and-Visual-Studio-Code>`_.
ru: Ранее En Thought предоставляла Canopy, но в 2016 году срок его службы истек -En Thought-Deployment-Manager-EDM-and-Visual-Studio-Code>`_.

source: Windows-specific distribution with prebuilt scientific packages and tools for building packages.
ru: Дистрибутив для Windows с готовыми научными пакетами и инструментами для сборки пакетов.

source: Note that these packages may not include the latest versions of Python or other libraries, and are not maintained or supported by the core Python team.
ru: Обратите внимание, что эти пакеты могут не включать последние версии Python или других библиотек, а также не обслуживаются и не поддерживаются основной командой Python.

source: Configuring Python
ru: Настройка Python

source: To run Python conveniently from a command prompt, you might consider changing some default environment variables in Windows. While the installer provides an option to configure the PATH and PATHEXT variables for you, this is only reliable for a single, system-wide installation. If you regularly use multiple versions of Python, consider using the :ref:`launcher`.
ru: Чтобы удобно запускать Python из командной строки, вы можете рассмотреть возможность изменения некоторых переменных среды по умолчанию в Windows. Хотя установщик предоставляет возможность настроить переменные PATH и PATHEXT, это надежно только для одной общесистемной установки. Если вы регулярно используете несколько версий Python, рассмотрите возможность использования :ref:`launcher`.

source: Excursus: Setting environment variables
ru: Экскурс: Установка переменных среды

source: Windows allows environment variables to be configured permanently at both the User level and the System level, or temporarily in a command prompt.
ru: Windows позволяет постоянно настраивать переменные среды как на уровне пользователя, так и на уровне системы или временно в командной строке.

source: To temporarily set environment variables, open Command Prompt and use the :command:`set` command:
ru: Чтобы временно установить переменные среды, откройте командную строку и используйте команду :command:`set`:

source: These changes will apply to any further commands executed in that console, and will be inherited by any applications started from the console.
ru: Эти изменения будут применяться ко всем дальнейшим командам, выполняемым в этой консоли, и будут унаследованы всеми приложениями, запускаемыми с консоли.

source: Including the variable name within percent signs will expand to the existing value, allowing you to add your new value at either the start or the end. Modifying :envvar:`PATH` by adding the directory containing :program:`python.exe` to the start is a common way to ensure the correct version of Python is launched.
ru: Включение имени переменной в знаки процентов расширит существующее значение, что позволит вам добавить новое значение либо в начало, либо в конец. Изменение :envvar:`PATH` путем добавления в начало каталога, содержащего :program:`python.exe`, является распространенным способом гарантировать запуск правильной версии Python.

source: To permanently modify the default environment variables, click Start and search for 'edit environment variables', or open System properties, :guilabel:`Advanced system settings` and click the :guilabel:`Environment Variables` button. In this dialog, you can add or modify User and System variables. To change System variables, you need non-restricted access to your machine (i.e. Administrator rights).
ru: Чтобы навсегда изменить переменные среды по умолчанию, нажмите «Пуск» и найдите «изменить переменные среды» или откройте свойства системы, :guilabel:`Дополнительные настройки системы` и нажмите кнопку :guilabel:`Переменные среды`. В этом диалоговом окне вы можете добавлять или изменять пользовательские и системные переменные. Чтобы изменить системные переменные, вам необходим неограниченный доступ к вашему компьютеру (т.е. права администратора).

source: Windows will concatenate User variables *after* System variables, which may cause unexpected results when modifying :envvar:`PATH`.
ru: Windows будет объединять пользовательские переменные *после* системных переменных, что может привести к неожиданным результатам при изменении :envvar:`PATH`.

source: The :envvar:`PYTHONPATH` variable is used by all versions of Python, so you should not permanently configure it unless the listed paths only include code that is compatible with all of your installed Python versions.
ru: Переменная :envvar:`PYTHONPATH` используется всеми версиями Python, поэтому вам не следует настраивать ее постоянно, если только перечисленные пути не содержат только код, совместимый со всеми установленными вами версиями Python.

source: Overview of environment variables on Windows
ru: Обзор переменных среды в Windows

source: The ``set`` command, for temporarily modifying environment variables
ru: Команда ``set`` для временного изменения переменных среды.

source: The ``setx`` command, for permanently modifying environment variables
ru: Команда setx для постоянного изменения переменных среды.

source: Finding the Python executable
ru: Находим исполняемый файл Python

source: Besides using the automatically created start menu entry for the Python interpreter, you might want to start Python in the command prompt. The installer has an option to set that up for you.
ru: Помимо использования автоматически созданного пункта меню «Пуск» для интерпретатора Python, вы можете запустить Python из командной строки. У установщика есть возможность настроить это за вас.

source: On the first page of the installer, an option labelled "Add Python to PATH" may be selected to have the installer add the install location into the :envvar:`PATH`. The location of the :file:`Scripts\\` folder is also added. This allows you to type :command:`python` to run the interpreter, and :command:`pip` for the package installer. Thus, you can also execute your scripts with command line options, see :ref:`using-on-cmdline` documentation.
ru: На первой странице установщика можно выбрать опцию «Добавить Python в PATH», чтобы установщик добавил место установки в :envvar:`PATH`. Также добавляется местоположение папки :file:`Scripts\\`. Это позволяет вам ввести :command:`python` для запуска интерпретатора и :command:`pip` для установщика пакета. Таким образом, вы также можете выполнять свои сценарии с параметрами командной строки, см. документацию :ref:`using-on-cmdline`.

source: If you don't enable this option at install time, you can always re-run the installer, select Modify, and enable it. Alternatively, you can manually modify the :envvar:`PATH` using the directions in :ref:`setting-envvars`. You need to set your :envvar:`PATH` environment variable to include the directory of your Python installation, delimited by a semicolon from other entries. An example variable could look like this (assuming the first two entries already existed)::
ru: Если вы не включите эту опцию во время установки, вы всегда можете перезапустить установщик, выбрать «Изменить» и включить его. Альтернативно, вы можете вручную изменить :envvar:`PATH`, используя указания в :ref:`setting-envvars`. Вам необходимо установить переменную среды :envvar:`PATH`, чтобы она включала каталог вашей установки Python, отделенный точкой с запятой от других записей. Пример переменной может выглядеть следующим образом (при условии, что первые две записи уже существуют)::

source: UTF-8 mode
ru: Режим UTF-8

source: Windows still uses legacy encodings for the system encoding (the ANSI Code Page). Python uses it for the default encoding of text files (e.g. :func:`locale.getencoding`).
ru: Windows по-прежнему использует устаревшие кодировки для системной кодировки (кодовая страница ANSI). Python использует его для кодировки текстовых файлов по умолчанию (например, :func:`locale.getencoding`).

source: This may cause issues because UTF-8 is widely used on the internet and most Unix systems, including WSL (Windows Subsystem for Linux).
ru: Это может вызвать проблемы, поскольку UTF-8 широко используется в Интернете и большинстве систем Unix, включая WSL (подсистема Windows для Linux).

source: You can use the :ref:`Python UTF-8 Mode <utf8-mode>` to change the default text encoding to UTF-8. You can enable the :ref:`Python UTF-8 Mode <utf8-mode>` via the ``-X utf8`` command line option, or the ``PYTHONUTF8=1`` environment variable. See :envvar:`PYTHONUTF8` for enabling UTF-8 mode, and :ref:`setting-envvars` for how to modify environment variables.
ru: Вы можете использовать :ref:`Режим Python UTF-8 <utf8-mode>`, чтобы изменить кодировку текста по умолчанию на UTF-8. Вы можете включить режим Python UTF-8 <utf8-mode>` с помощью параметра командной строки ``-X utf8`` или переменной среды ``PYTHONUTF8=1``. См. :envvar:`PYTHONUTF8` для включения режима UTF-8 и :ref:`setting-envvars` для получения информации о том, как изменять переменные среды.

source: When the :ref:`Python UTF-8 Mode <utf8-mode>` is enabled, you can still use the system encoding (the ANSI Code Page) via the "mbcs" codec.
ru: Когда режим Python UTF-8 <utf8-mode> включен, вы все равно можете использовать системную кодировку (кодовую страницу ANSI) через кодек «mbcs».

source: Note that adding ``PYTHONUTF8=1`` to the default environment variables will affect all Python 3.7+ applications on your system. If you have any Python 3.7+ applications which rely on the legacy system encoding, it is recommended to set the environment variable temporarily or use the ``-X utf8`` command line option.
ru: Обратите внимание, что добавление PYTHONUTF8=1 к переменным среды по умолчанию повлияет на все приложения Python 3.7+ в вашей системе. Если у вас есть какие-либо приложения Python 3.7+, которые используют устаревшую системную кодировку, рекомендуется временно установить переменную среды или использовать параметр командной строки ``-X utf8``.

source: Even when UTF-8 mode is disabled, Python uses UTF-8 by default on Windows for:
ru: Даже если режим UTF-8 отключен, Python по умолчанию использует UTF-8 в Windows для:

source: Console I/O including standard I/O (see :pep:`528` for details).
ru: Даже если режим UTF-8 отключен, Python по умолчанию использует UTF-8 в Windows для:

source: The :term:`filesystem encoding <filesystem encoding and error handler>` (see :pep:`529` for details).
ru: Кодировка файловой системы :term:`<кодировка файловой системы и обработчик ошибок>` (подробности см. в :pep:`529`).

source: Python Launcher for Windows
ru: Python Launcher для Windows

source: The Python launcher for Windows is a utility which aids in locating and executing of different Python versions. It allows scripts (or the command-line) to indicate a preference for a specific Python version, and will locate and execute that version.
ru: Средство запуска Python для Windows — это утилита, которая помогает находить и запускать различные версии Python. Он позволяет сценариям (или командной строке) указывать предпочтение конкретной версии Python, а также находить и выполнять эту версию.

source: Unlike the :envvar:`PATH` variable, the launcher will correctly select the most appropriate version of Python. It will prefer per-user installations over system-wide ones, and orders by language version rather than using the most recently installed version.
ru: В отличие от переменной :envvar:`PATH`, программа запуска правильно выберет наиболее подходящую версию Python. Он будет предпочитать установку для каждого пользователя общесистемным и упорядочивать по языковой версии, а не использовать самую последнюю установленную версию.

source: The launcher was originally specified in :pep:`397`.
ru: Изначально программа запуска была указана в :pep:`397`.

source: Getting started
ru: Приступая к работе

source: From the command-line
ru: Из командной строки

source: System-wide installations of Python 3.3 and later will put the launcher on your :envvar:`PATH`. The launcher is compatible with all available versions of Python, so it does not matter which version is installed. To check that the launcher is available, execute the following command in Command Prompt::
ru: При общесистемной установке Python 3.3 и более поздних версий программа запуска будет помещена в ваш :envvar:`PATH`. Лаунчер совместим со всеми доступными версиями Python, поэтому не имеет значения, какая версия установлена. Чтобы проверить доступность средства запуска, выполните в командной строке следующую команду::

source: You should find that the latest version of Python you have installed is started - it can be exited as normal, and any additional command-line arguments specified will be sent directly to Python.
ru: Вы должны обнаружить, что запущена последняя установленная вами версия Python — выйти из нее можно как обычно, и любые указанные дополнительные аргументы командной строки будут отправлены непосредственно в Python.

source: If you have multiple versions of Python installed (e.g., 3.7 and |version|) you will have noticed that Python |version| was started - to launch Python 3.7, try the command::
ru: Если у вас установлено несколько версий Python (например, 3.7 и |версия| ) вы заметили, что Python |версия| был запущен — для запуска Python 3.7 попробуйте команду::

source: If you want the latest version of Python 2 you have installed, try the command::
ru: Если вам нужна последняя установленная версия Python 2, попробуйте команду::

source: If you see the following error, you do not have the launcher installed::
ru: Если вы видите следующую ошибку, у вас не установлена ​​программа запуска:

source: 'py' is not recognized as an internal or external command, operable program or batch file.
ru: «py» не распознается как внутренняя или внешняя команда, действующая программа или командный файл.

source: The command::
ru: Команда::

source: displays the currently installed version(s) of Python.
ru: отображает текущие установленные версии Python.

source: The ``-x.y`` argument is the short form of the ``-V:Company/Tag`` argument, which allows selecting a specific Python runtime, including those that may have come from somewhere other than python.org. Any runtime registered by following :pep:`514` will be discoverable. The ``--list`` command lists all available runtimes using the ``-V:`` format.
ru: Аргумент ``-xy`` представляет собой короткую форму аргумента ``-V:Company/Tag``, который позволяет выбрать конкретную среду выполнения Python, включая те, которые могли быть получены откуда-либо, кроме python.org. Любая среда выполнения, зарегистрированная с помощью следующего :pep:`514`, будет доступна для обнаружения. Команда ``--list`` выводит список всех доступных сред выполнения в формате ``-V:``.

source: When using the ``-V:`` argument, specifying the Company will limit selection to runtimes from that provider, while specifying only the Tag will select from all providers. Note that omitting the slash implies a tag::
ru: При использовании аргумента ``-V:`` указание компании ограничит выбор средами выполнения от этого поставщика, а указание только тега будет выбрано из всех поставщиков. Обратите внимание, что отсутствие косой черты подразумевает тег::

source: The short form of the argument (``-3``) only ever selects from core Python releases, and not other distributions. However, the longer form (``-V:3``) will select from any.
ru: Краткая форма аргумента (``-3``) всегда выбирает только из основных выпусков Python, а не из других дистрибутивов. Однако более длинная форма (``-V:3``) будет выбирать любой.

source: The Company is matched on the full string, case-insensitive. The Tag is matched on either the full string, or a prefix, provided the next character is a dot or a hyphen. This allows ``-V:3.1`` to match ``3.1-32``, but not ``3.10``. Tags are sorted using numerical ordering (``3.10`` is newer than ``3.1``), but are compared using text (``-V:3.01`` does not match ``3.1``).
ru: Компания сопоставляется по полной строке без учета регистра. Тег сопоставляется либо по всей строке, либо по префиксу, при условии, что следующим символом является точка или дефис. Это позволяет ``-V:3.1`` соответствовать ``3.1-32``, но не ``3.10``. Теги сортируются с использованием числового порядка (``3.10`` новее, чем ``3.1``), но сравниваются с использованием текста (``-V:3.01`` не соответствует ``3.1``).

source: Virtual environments
ru: Виртуальные среды

source: If the launcher is run with no explicit Python version specification, and a virtual environment (created with the standard library :mod:`venv` module or the external ``virtualenv`` tool) active, the launcher will run the virtual environment's interpreter rather than the global one. To run the global interpreter, either deactivate the virtual environment, or explicitly specify the global Python version.
ru: Если программа запуска запускается без явного указания версии Python и активна виртуальная среда (созданная с помощью модуля стандартной библиотеки :mod:`venv` или внешнего инструмента ``virtualenv``), программа запуска скорее запустит интерпретатор виртуальной среды. чем глобальный. Чтобы запустить глобальный интерпретатор, либо деактивируйте виртуальную среду, либо явно укажите глобальную версию Python.

source: From a script
ru: Из скрипта

source: Let's create a test Python script - create a file called ``hello.py`` with the following contents
ru: Давайте создадим тестовый скрипт Python — создайте файл с именем hello.py со следующим содержимым.

source: From the directory in which hello.py lives, execute the command::
ru: Из каталога, в котором находится hello.py, выполните команду::

source: You should notice the version number of your latest Python 2.x installation is printed. Now try changing the first line to be:
ru: Вы должны заметить, что напечатан номер версии вашей последней установки Python 2.x. Теперь попробуйте изменить первую строку так:

source: Re-executing the command should now print the latest Python 3.x information. As with the above command-line examples, you can specify a more explicit version qualifier. Assuming you have Python 3.7 installed, try changing the first line to ``#! python3.7`` and you should find the 3.7 version information printed.
ru: Повторное выполнение команды теперь должно вывести последнюю информацию о Python 3.x. Как и в приведенных выше примерах командной строки, вы можете указать более явный квалификатор версии. Предполагая, что у вас установлен Python 3.7, попробуйте изменить первую строку на ``#! python3.7``, и вы должны найти напечатанную информацию о версии 3.7.

source: Note that unlike interactive use, a bare "python" will use the latest version of Python 2.x that you have installed. This is for backward compatibility and for compatibility with Unix, where the command ``python`` typically refers to Python 2.
ru: Обратите внимание, что в отличие от интерактивного использования, простой «python» будет использовать последнюю установленную вами версию Python 2.x. Это сделано для обратной совместимости и совместимости с Unix, где команда ``python`` обычно относится к Python 2.

source: From file associations
ru: Из ассоциаций файлов

source: The launcher should have been associated with Python files (i.e. ``.py``, ``.pyw``, ``.pyc`` files) when it was installed. This means that when you double-click on one of these files from Windows explorer the launcher will be used, and therefore you can use the same facilities described above to have the script specify the version which should be used.
ru: При установке программа запуска должна была быть связана с файлами Python (т. е. файлами ``.py``, ``.pyw``, ``.pyc``. Это означает, что при двойном щелчке по одному из этих файлов в проводнике Windows будет использоваться средство запуска, и поэтому вы можете использовать те же средства, которые описаны выше, чтобы сценарий указывал версию, которую следует использовать.

source: The key benefit of this is that a single launcher can support multiple Python versions at the same time depending on the contents of the first line.
ru: Ключевым преимуществом этого является то, что одна программа запуска может одновременно поддерживать несколько версий Python в зависимости от содержимого первой строки.

source: Shebang Lines
ru: Линии Шебанг

source: If the first line of a script file starts with ``#!``, it is known as a "shebang" line. Linux and other Unix like operating systems have native support for such lines and they are commonly used on such systems to indicate how a script should be executed. This launcher allows the same facilities to be used with Python scripts on Windows and the examples above demonstrate their use.
ru: Если первая строка файла сценария начинается с ``#!``, она называется строкой "шебанг". Linux и другие Unix-подобные операционные системы имеют встроенную поддержку таких строк, и они обычно используются в таких системах для указания того, как следует выполнять сценарий. Этот модуль запуска позволяет использовать те же возможности со сценариями Python в Windows, и приведенные выше примеры демонстрируют их использование.

source: To allow shebang lines in Python scripts to be portable between Unix and Windows, this launcher supports a number of 'virtual' commands to specify which interpreter to use. The supported virtual commands are:
ru: Чтобы строки shebang в сценариях Python можно было переносить между Unix и Windows, этот модуль запуска поддерживает ряд «виртуальных» команд, позволяющих указать, какой интерпретатор использовать. Поддерживаемые виртуальные команды:

source: For example, if the first line of your script starts with
ru: Например, если первая строка вашего скрипта начинается с

source: The default Python or an active virtual environment will be located and used. As many Python scripts written to work on Unix will already have this line, you should find these scripts can be used by the launcher without modification. If you are writing a new script on Windows which you hope will be useful on Unix, you should use one of the shebang lines starting with ``/usr``.
ru: Будет найден и использован Python по умолчанию или активная виртуальная среда. Поскольку многие сценарии Python, написанные для работы в Unix, уже содержат эту строку, вы обнаружите, что эти сценарии могут использоваться программой запуска без изменений. Если вы пишете новый сценарий для Windows, который, как вы надеетесь, будет полезен в Unix, вам следует использовать одну из строк shebang, начинающуюся с ``/usr``.

source: Any of the above virtual commands can be suffixed with an explicit version (either just the major version, or the major and minor version). Furthermore the 32-bit version can be requested by adding "-32" after the minor version. I.e. ``/usr/bin/python3.7-32`` will request usage of the 32-bit Python 3.7. If a virtual environment is active, the version will be ignored and the environment will be used.
ru: К любой из вышеперечисленных виртуальных команд может быть добавлена ​​явная версия (либо только основная версия, либо основная и второстепенная версии). Кроме того, 32-битную версию можно запросить, добавив «-32» после младшей версии. Т.е. ``/usr/bin/python3.7-32`` запросит использование 32-битного Python 3.7. Если виртуальная среда активна, версия будет игнорироваться и будет использоваться среда.

source: Beginning with python launcher 3.7 it is possible to request 64-bit version by the "-64" suffix. Furthermore it is possible to specify a major and architecture without minor (i.e. ``/usr/bin/python3-64``).
ru: Начиная с версии Python 3.7, можно запросить 64-битную версию с суффиксом «-64». Кроме того, можно указать основной и архитектуру без младшего (например, ``/usr/bin/python3-64``).
