Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/using/windows.po
Languages: ru

source: To specify the install option at the command line, use ``Include_freethreaded=1``. See :ref:`install-layout-option` for instructions on pre-emptively downloading the additional binaries for offline install. The options to include debug symbols and binaries also apply to the free-threaded builds.
ru: Чтобы указать параметр установки в командной строке, используйте Include_freethreaded=1. См. :ref:`install-layout-option` для получения инструкций по предварительной загрузке дополнительных двоичных файлов для автономной установки. Параметры включения символов отладки и двоичных файлов также применимы к сборкам со свободным потоком.

source: Free-threaded binaries are also available :ref:`on nuget.org <windows-nuget>`.
ru: Двоичные файлы со свободным потоком также доступны :ref:`на сайте nuget.org <windows-nuget>`.

source: The Microsoft Store package
ru: Пакет Магазина Microsoft

source: The Microsoft Store package is an easily installable Python interpreter that is intended mainly for interactive use, for example, by students.
ru: Пакет Microsoft Store представляет собой легко устанавливаемый интерпретатор Python, предназначенный в основном для интерактивного использования, например, студентами.

source: To install the package, ensure you have the latest Windows 10 updates and search the Microsoft Store app for "Python |version|". Ensure that the app you select is published by the Python Software Foundation, and install it.
ru: Чтобы установить пакет, убедитесь, что у вас установлены последние обновления Windows 10, и выполните поиск в приложении Microsoft Store по запросу «Python». |версия| «. Убедитесь, что выбранное вами приложение опубликовано Python Software Foundation, и установите его.

source: Python will always be available for free on the Microsoft Store. If you are asked to pay for it, you have not selected the correct package.
ru: Python всегда будет доступен бесплатно в Microsoft Store. Если вас попросят заплатить за это, значит, вы выбрали неправильный пакет.

source: After installation, Python may be launched by finding it in Start. Alternatively, it will be available from any Command Prompt or PowerShell session by typing ``python``. Further, pip and IDLE may be used by typing ``pip`` or ``idle``. IDLE can also be found in Start.
ru: После установки Python можно запустить, найдя его в меню «Пуск». Кроме того, он будет доступен из любой командной строки или сеанса PowerShell, набрав ``python``. Кроме того, pip и IDLE можно использовать, набрав ``pip`` или ``idle``. IDLE также можно найти в меню «Пуск».

source: All three commands are also available with version number suffixes, for example, as ``python3.exe`` and ``python3.x.exe`` as well as ``python.exe`` (where ``3.x`` is the specific version you want to launch, such as |version|). Open "Manage App Execution Aliases" through Start to select which version of Python is associated with each command. It is recommended to make sure that ``pip`` and ``idle`` are consistent with whichever version of ``python`` is selected.
ru: Все три команды также доступны с суффиксами номеров версий, например, как ``python3.exe`` и ``python3.x.exe``, а также ``python.exe`` (где ``3.x` ` — это конкретная версия, которую вы хотите запустить, например |версия| ). Откройте «Управление псевдонимами выполнения приложений» через «Пуск», чтобы выбрать, какая версия Python связана с каждой командой. Рекомендуется убедиться, что ``pip`` и ``idle`` соответствуют выбранной версии ``python``.

source: Virtual environments can be created with ``python -m venv`` and activated and used as normal.
ru: Виртуальные среды можно создать с помощью ``python -m venv``, активировать и использовать как обычно.

source: If you have installed another version of Python and added it to your ``PATH`` variable, it will be available as ``python.exe`` rather than the one from the Microsoft Store. To access the new installation, use ``python3.exe`` or ``python3.x.exe``.
ru: Если вы установили другую версию Python и добавили ее в переменную PATH, она будет доступна как python.exe, а не как версия из Microsoft Store. Чтобы получить доступ к новой установке, используйте python3.exe или python3.x.exe.

source: The ``py.exe`` launcher will detect this Python installation, but will prefer installations from the traditional installer.
ru: Программа запуска ``py.exe`` обнаружит эту установку Python, но предпочтет установку из традиционного установщика.

source: To remove Python, open Settings and use Apps and Features, or else find Python in Start and right-click to select Uninstall. Uninstalling will remove all packages you installed directly into this Python installation, but will not remove any virtual environments
ru: Чтобы удалить Python, откройте «Настройки» и выберите «Приложения и функции» или найдите Python в меню «Пуск» и щелкните правой кнопкой мыши, чтобы выбрать «Удалить». При удалении будут удалены все пакеты, которые вы установили непосредственно в эту установку Python, но не будут удалены виртуальные среды.

source: Known issues
ru: Известные проблемы

source: Redirection of local data, registry, and temporary paths
ru: Перенаправление локальных данных, реестра и временных путей

source: Because of restrictions on Microsoft Store apps, Python scripts may not have full write access to shared locations such as :envvar:`TEMP` and the registry. Instead, it will write to a private copy. If your scripts must modify the shared locations, you will need to install the full installer.
ru: Из-за ограничений для приложений Microsoft Store сценарии Python могут не иметь полного доступа на запись к общим местам, таким как :envvar:`TEMP` и реестр. Вместо этого он будет писать в частную копию. Если ваши сценарии должны изменить общие расположения, вам потребуется установить полную программу установки.

source: At runtime, Python will use a private copy of well-known Windows folders and the registry. For example, if the environment variable :envvar:`%APPDATA%` is :file:`c:\\Users\\<user>\\AppData\\`, then when writing to :file:`C:\\Users\\<user>\\AppData\\Local` will write to :file:`C:\\Users\\<user>\\AppData\\Local\\Packages\\PythonSoftwareFoundation.Python.3.8_qbz5n2kfra8p0\\LocalCache\\Local\\`.
ru: Во время выполнения Python будет использовать частную копию известных папок Windows и реестра. Например, если переменная среды :envvar:` %А PPDATA%` равен :file:`c:\\Users\\<user>\\AppData\\`, затем при записи в :file:`C:\\Users\\<user>\\AppData\\Local` будет писать в :file:`C:\\Users\\<user>\\AppData\\Local\\Packages\\PythonSoftwareFoundation.Python.3.8_qbz5n2kfra8p0\\LocalCache\\Local\\`.

source: When reading files, Windows will return the file from the private folder, or if that does not exist, the real Windows directory. For example reading :file:`C:\\Windows\\System32` returns the contents of :file:`C:\\Windows\\System32` plus the contents of :file:`C:\\Program Files\\WindowsApps\\package_name\\VFS\\SystemX86`.
ru: При чтении файлов Windows возвращает файл из личной папки или, если она не существует, из реального каталога Windows. Например, чтение :file:`C:\\Windows\\System32` возвращает содержимое :file:`C:\\Windows\\System32` плюс содержимое :file:`C:\\Program Files\\WindowsApps \\имя_пакета\\VFS\\SystemX86`.

source: You can find the real path of any existing file using :func:`os.path.realpath`:
ru: Вы можете найти реальный путь к любому существующему файлу, используя :func:`os.path.realpath`:

source: When writing to the Windows Registry, the following behaviors exist:
ru: При записи в реестр Windows наблюдается следующее поведение:

source: Reading from ``HKLM\\Software`` is allowed and results are merged with the :file:`registry.dat` file in the package.
ru: Чтение из ``HKLM\\Software`` разрешено, и результаты объединяются с файлом :file:`registry.dat` в пакете.

source: Writing to ``HKLM\\Software`` is not allowed if the corresponding key/value exists, i.e. modifying existing keys.
ru: Запись в ``HKLM\\Software`` не разрешена, если соответствующий ключ/значение существует, т.е. изменение существующих ключей.

source: Writing to ``HKLM\\Software`` is allowed as long as a corresponding key/value does not exist in the package and the user has the correct access permissions.
ru: Запись в ``HKLM\\Software`` разрешена, если соответствующий ключ/значение не существует в пакете и у пользователя есть правильные права доступа.

source: For more detail on the technical basis for these limitations, please consult Microsoft's documentation on packaged full-trust apps, currently available at `docs.microsoft.com/en-us/windows/msix/desktop/desktop-to-uwp-behind-the-scenes <https://learn.microsoft.com/windows/msix/desktop/desktop-to-uwp-behind-the-scenes>`_
ru: Для получения более подробной информации о технической основе этих ограничений обратитесь к документации Microsoft по пакетным приложениям с полным доверием, которая в настоящее время доступна по адресу `docs.microsoft.com/en-us/windows/msix/desktop/desktop-to-uwp-behind- the-scenes <https://learn.microsoft.com/windows/msix/desktop/desktop-to-uwp-behind-the-scenes>`_

source: The nuget.org packages
ru: Пакеты nuget.org

source: The nuget.org package is a reduced size Python environment intended for use on continuous integration and build systems that do not have a system-wide install of Python. While nuget is "the package manager for .NET", it also works perfectly fine for packages containing build-time tools.
ru: Пакет nuget.org — это среда Python уменьшенного размера, предназначенная для использования в системах непрерывной интеграции и сборки, в которых нет общесистемной установки Python. Хотя nuget является «менеджером пакетов для .NET», он также прекрасно работает для пакетов, содержащих инструменты времени сборки.

source: Visit `nuget.org <https://www.nuget.org/>`_ for the most up-to-date information on using nuget. What follows is a summary that is sufficient for Python developers.
ru: Посетите `nuget.org <https://www.nuget.org/>`_ для получения самой последней информации об использовании nuget. Далее следует краткое изложение, достаточное для разработчиков Python.

source: The ``nuget.exe`` command line tool may be downloaded directly from ``https://aka.ms/nugetclidl``, for example, using curl or PowerShell. With the tool, the latest version of Python for 64-bit or 32-bit machines is installed using::
ru: Инструмент командной строки nuget.exe можно загрузить непосредственно с https://aka.ms/nugetclidl, например, с помощью Curl или PowerShell. С помощью этого инструмента устанавливается последняя версия Python для 64-битных или 32-битных компьютеров с помощью:

source: nuget.exe install python -ExcludeVersion -OutputDirectory . nuget.exe install pythonx86 -ExcludeVersion -OutputDirectory .
ru: nuget.exe установите python -ExcludeVersion -OutputDirectory. nuget.exe установите pythonx86 -ExcludeVersion -OutputDirectory.

source: To select a particular version, add a ``-Version 3.x.y``. The output directory may be changed from ``.``, and the package will be installed into a subdirectory. By default, the subdirectory is named the same as the package, and without the ``-ExcludeVersion`` option this name will include the specific version installed. Inside the subdirectory is a ``tools`` directory that contains the Python installation:
ru: Чтобы выбрать конкретную версию, добавьте ``-Version 3.xy``. Выходной каталог можно изменить с ``.``, и пакет будет установлен в подкаталог. По умолчанию подкаталог называется так же, как и пакет, и без опции «-ExcludeVersion» это имя будет включать конкретную установленную версию. Внутри подкаталога находится каталог «tools», содержащий установку Python:

source: In general, nuget packages are not upgradeable, and newer versions should be installed side-by-side and referenced using the full path. Alternatively, delete the package directory manually and install it again. Many CI systems will do this automatically if they do not preserve files between builds.
ru: Как правило, пакеты nuget не подлежат обновлению, а более новые версии следует устанавливать параллельно, и на них можно ссылаться по полному пути. Либо удалите каталог пакета вручную и установите его снова. Многие системы CI делают это автоматически, если не сохраняют файлы между сборками.

source: Alongside the ``tools`` directory is a ``build\native`` directory. This contains a MSBuild properties file ``python.props`` that can be used in a C++ project to reference the Python install. Including the settings will automatically use the headers and import libraries in your build.
ru: Рядом с каталогом ``tools`` находится каталог ``build\native``. Он содержит файл свойств MSBuild ``python.props``, который можно использовать в проекте C++ для ссылки на установку Python. Включение настроек позволит автоматически использовать заголовки и импортировать библиотеки в вашу сборку.

source: The package information pages on nuget.org are `www.nuget.org/packages/python <https://www.nuget.org/packages/python>`_ for the 64-bit version, `www.nuget.org/packages/pythonx86 <https://www.nuget.org/packages/pythonx86>`_ for the 32-bit version, and `www.nuget.org/packages/pythonarm64 <https://www.nuget.org/packages/pythonarm64>`_ for the ARM64 version
ru: Страницы с информацией о пакете на nuget.org: www.nuget.org/packages/python <https://www.nuget.org/packages/python>`_ для 64-разрядной версии, `www.nuget.org/ packages/pythonx86 <https://www.nuget.org/packages/pythonx86>`_ для 32-разрядной версии и `www.nuget.org/packages/pythonarm64 <https://www.nuget.org/packages /pythonarm64>`_ для версии ARM64

source: Free-threaded packages
ru: Свободнопоточные пакеты

source: Packages containing free-threaded binaries are named `python-freethreaded <https://www.nuget.org/packages/python-freethreaded>`_ for the 64-bit version, `pythonx86-freethreaded <https://www.nuget.org/packages/pythonx86-freethreaded>`_ for the 32-bit version, and `pythonarm64-freethreaded <https://www.nuget.org/packages/pythonarm64-freethreaded>`_ for the ARM64 version. These packages contain both the ``python3.13t.exe`` and ``python.exe`` entry points, both of which run free threaded.
ru: Пакеты, содержащие двоичные файлы со свободным потоком, называются `python-freethreaded <https://www.nuget.org/packages/python-freethreaded>`_ для 64-разрядной версии, `pythonx86-freethreaded <https://www.nuget .org/packages/pythonx86-freethreaded>`_ для 32-битной версии и `pythonarm64-freethreaded <https://www.nuget.org/packages/pythonarm64-freethreaded>`_ для версии ARM64. Эти пакеты содержат точки входа ``python3.13t.exe`` и ``python.exe``, обе из которых работают без потоков.

source: The embeddable package
ru: Встраиваемый пакет

source: The embedded distribution is a ZIP file containing a minimal Python environment. It is intended for acting as part of another application, rather than being directly accessed by end-users.
ru: Встроенный дистрибутив представляет собой ZIP-файл, содержащий минимальную среду Python. Он предназначен для работы как часть другого приложения, а не для прямого доступа конечных пользователей.

source: When extracted, the embedded distribution is (almost) fully isolated from the user's system, including environment variables, system registry settings, and installed packages. The standard library is included as pre-compiled and optimized ``.pyc`` files in a ZIP, and ``python3.dll``, ``python37.dll``, ``python.exe`` and ``pythonw.exe`` are all provided. Tcl/tk (including all dependents, such as Idle), pip and the Python documentation are not included.
ru: При извлечении встроенный дистрибутив (почти) полностью изолирован от системы пользователя, включая переменные среды, настройки системного реестра и установленные пакеты. Стандартная библиотека включена в виде предварительно скомпилированных и оптимизированных файлов .pyc в ZIP-архиве, а также Python3.dll, Python37.dll, Python.exe и Python. .exe`` все предоставляются. Tcl/tk (включая все зависимости, такие как Idle), pip и документация Python не включены.

source: The embedded distribution does not include the `Microsoft C Runtime <https://learn.microsoft.com/cpp/windows/latest-supported-vc-redist#visual-studio-2015-2017-2019-and-2022>`_ and it is the responsibility of the application installer to provide this. The runtime may have already been installed on a user's system previously or automatically via Windows Update, and can be detected by finding ``ucrtbase.dll`` in the system directory.
ru: Встроенный дистрибутив не включает `Microsoft C Runtime <https://learn.microsoft.com/cpp/windows/latest-supported-vc-redist#visual-studio-2015-2017-2019-and-2022>`_ и ответственность за это лежит на установщике приложения. Среда выполнения может быть уже установлена ​​в системе пользователя ранее или автоматически через Центр обновления Windows, и ее можно обнаружить, найдя ``ucrtbase.dll`` в системном каталоге.

source: Third-party packages should be installed by the application installer alongside the embedded distribution. Using pip to manage dependencies as for a regular Python installation is not supported with this distribution, though with some care it may be possible to include and use pip for automatic updates. In general, third-party packages should be treated as part of the application ("vendoring") so that the developer can ensure compatibility with newer versions before providing updates to users.
ru: Сторонние пакеты должны устанавливаться установщиком приложения вместе со встроенным дистрибутивом. Использование pip для управления зависимостями, как и при обычной установке Python, не поддерживается в этом дистрибутиве, хотя при некоторой осторожности можно включить и использовать pip для автоматических обновлений. Как правило, сторонние пакеты следует рассматривать как часть приложения («вендоринг»), чтобы разработчик мог обеспечить совместимость с более новыми версиями, прежде чем предоставлять обновления пользователям.

source: The two recommended use cases for this distribution are described below.
ru: Ниже описаны два рекомендуемых варианта использования этого дистрибутива.

source: Python Application
ru: Приложение на Python

source: An application written in Python does not necessarily require users to be aware of that fact. The embedded distribution may be used in this case to include a private version of Python in an install package. Depending on how transparent it should be (or conversely, how professional it should appear), there are two options.
ru: Приложение, написанное на Python, не обязательно требует, чтобы пользователи знали об этом факте. В этом случае встроенный дистрибутив можно использовать для включения частной версии Python в установочный пакет. В зависимости от того, насколько прозрачно оно должно быть (или, наоборот, насколько профессионально оно должно выглядеть), есть два варианта.

source: Using a specialized executable as a launcher requires some coding, but provides the most transparent experience for users. With a customized launcher, there are no obvious indications that the program is running on Python: icons can be customized, company and version information can be specified, and file associations behave properly. In most cases, a custom launcher should simply be able to call ``Py_Main`` with a hard-coded command line.
ru: Использование специализированного исполняемого файла в качестве средства запуска требует некоторого написания кода, но обеспечивает наиболее понятный интерфейс для пользователей. При использовании настраиваемого средства запуска нет очевидных признаков того, что программа работает на Python: можно настраивать значки, указывать информацию о компании и версии, а ассоциации файлов ведут себя правильно. В большинстве случаев пользовательский лаунчер должен просто иметь возможность вызывать Py_Main с помощью жестко запрограммированной командной строки.

source: The simpler approach is to provide a batch file or generated shortcut that directly calls the ``python.exe`` or ``pythonw.exe`` with the required command-line arguments. In this case, the application will appear to be Python and not its actual name, and users may have trouble distinguishing it from other running Python processes or file associations.
ru: Более простой подход — предоставить пакетный файл или сгенерированный ярлык, который напрямую вызывает «python.exe» или «pythonw.exe» с необходимыми аргументами командной строки. В этом случае приложение будет выглядеть как Python, а не как его фактическое имя, и у пользователей могут возникнуть проблемы с отличением его от других запущенных процессов Python или ассоциаций файлов.

source: With the latter approach, packages should be installed as directories alongside the Python executable to ensure they are available on the path. With the specialized launcher, packages can be located in other locations as there is an opportunity to specify the search path before launching the application.
ru: При последнем подходе пакеты следует устанавливать в виде каталогов рядом с исполняемым файлом Python, чтобы обеспечить их доступность по пути. С помощью специализированного лаунчера пакеты могут располагаться в других местах, так как есть возможность указать путь поиска перед запуском приложения.

source: Embedding Python
ru: Внедрение Python

source: Applications written in native code often require some form of scripting language, and the embedded Python distribution can be used for this purpose. In general, the majority of the application is in native code, and some part will either invoke ``python.exe`` or directly use ``python3.dll``. For either case, extracting the embedded distribution to a subdirectory of the application installation is sufficient to provide a loadable Python interpreter.
ru: Приложения, написанные на собственном коде, часто требуют использования той или иной формы языка сценариев, и для этой цели можно использовать встроенный дистрибутив Python. Как правило, большая часть приложения находится в собственном коде, а некоторая часть либо вызывает ``python.exe``, либо напрямую использует ``python3.dll``. В любом случае извлечения встроенного дистрибутива в подкаталог установки приложения достаточно, чтобы получить загружаемый интерпретатор Python.

source: As with the application use, packages can be installed to any location as there is an opportunity to specify search paths before initializing the interpreter. Otherwise, there is no fundamental differences between using the embedded distribution and a regular installation.
ru: Как и при использовании приложения, пакеты можно устанавливать в любое место, поскольку есть возможность указать пути поиска перед инициализацией интерпретатора. В остальном принципиальных отличий между использованием встроенного дистрибутива и обычной установкой нет.

source: Alternative bundles
ru: Альтернативные пакеты

source: Besides the standard CPython distribution, there are modified packages including additional functionality. The following is a list of popular versions and their key features:
ru: Помимо стандартного дистрибутива CPython, существуют модифицированные пакеты, включающие дополнительный функционал. Ниже приведен список популярных версий и их ключевые особенности:

source: Installer with multi-platform compatibility, documentation, PyWin32
ru: Установщик с мультиплатформенной совместимостью, документация, PyWin32.

source: Popular scientific modules (such as numpy, scipy and pandas) and the ``conda`` package manager.
ru: Научно-популярные модули (такие как numpy, scipy и pandas) и менеджер пакетов conda.

source: `Enthought Deployment Manager <https://assets.enthought.com/downloads/edm/>`_
ru: `Менеджер развертывания En Thought <https://assets.en Thought.com/downloads/edm/>`_

source: "The Next Generation Python Environment and Package Manager".
ru: «Среда Python следующего поколения и менеджер пакетов».
