Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/using/windows.po
Languages: ru

source: If Python can't find its home and there are no registry value (frozen .exe, some very strange installation setup) you get a path with some default, but relative, paths.
ru: Если Python не может найти свой дом и в реестре нет значения (замороженный .exe, какая-то очень странная установка установки), вы получите путь с некоторыми путями по умолчанию, но относительными.

source: For those who want to bundle Python into their application or distribution, the following advice will prevent conflicts with other installations:
ru: Для тех, кто хочет включить Python в свое приложение или дистрибутив, следующие советы помогут предотвратить конфликты с другими установками:

source: Include a ``._pth`` file alongside your executable containing the directories to include. This will ignore paths listed in the registry and environment variables, and also ignore :mod:`site` unless ``import site`` is listed.
ru: Включите файл ``._pth`` вместе с вашим исполняемым файлом, содержащим каталоги, которые нужно включить. Это будет игнорировать пути, указанные в реестре и переменных среды, а также игнорировать :mod:`site`, если не указан ``import site``.

source: If you are loading :file:`python3.dll` or :file:`python37.dll` in your own executable, explicitly set :c:member:`PyConfig.module_search_paths` before :c:func:`Py_InitializeFromConfig`.
ru: Если вы загружаете :file:`python3.dll` или :file:`python37.dll` в свой собственный исполняемый файл, явно установите :c:member:`PyConfig.module_search_paths` перед :c:func:`Py_InitializeFromConfig`.

source: Clear and/or overwrite :envvar:`PYTHONPATH` and set :envvar:`PYTHONHOME` before launching :file:`python.exe` from your application.
ru: Очистите и/или перезапишите :envvar:`PYTHONPATH` и установите :envvar:`PYTHONHOME` перед запуском :file:`python.exe` из вашего приложения.

source: If you cannot use the previous suggestions (for example, you are a distribution that allows people to run :file:`python.exe` directly), ensure that the landmark file (:file:`Lib\\os.py`) exists in your install directory. (Note that it will not be detected inside a ZIP file, but a correctly named ZIP file will be detected instead.)
ru: Если вы не можете использовать предыдущие предложения (например, ваш дистрибутив позволяет людям запускать :file:`python.exe` напрямую), убедитесь, что файл ориентира (:file:`Lib\\os.py`) существует. в вашем каталоге установки. (Обратите внимание, что он не будет обнаружен внутри ZIP-файла, вместо этого будет обнаружен ZIP-файл с правильным именем.)

source: These will ensure that the files in a system-wide installation will not take precedence over the copy of the standard library bundled with your application. Otherwise, your users may experience problems using your application. Note that the first suggestion is the best, as the others may still be susceptible to non-standard paths in the registry and user site-packages.
ru: Это гарантирует, что файлы общесистемной установки не будут иметь приоритет над копией стандартной библиотеки, поставляемой в комплекте с вашим приложением. В противном случае у ваших пользователей могут возникнуть проблемы при использовании вашего приложения. Обратите внимание, что первое предложение является лучшим, поскольку остальные могут по-прежнему быть подвержены нестандартным путям в реестре и пакетах пользовательских сайтов.

source: Add ``._pth`` file support and removes ``applocal`` option from ``pyvenv.cfg``.
ru: Добавлена ​​поддержка файлов ``._pth`` и удалена опция ``applocal`` из ``pyvenv.cfg``.

source: Add :file:`python{XX}.zip` as a potential landmark when directly adjacent to the executable.
ru: Добавьте :file:`python{XX}.zip` в качестве потенциального ориентира, если он находится непосредственно рядом с исполняемым файлом.

source: Modules specified in the registry under ``Modules`` (not ``PythonPath``) may be imported by :class:`importlib.machinery.WindowsRegistryFinder`. This finder is enabled on Windows in 3.6.0 and earlier, but may need to be explicitly added to :data:`sys.meta_path` in the future.
ru: Модули, указанные в реестре в разделе «Модули» (не «PythonPath»), могут быть импортированы с помощью :class:`importlib.machinery.WindowsRegistryFinder`. Этот поисковик включен в Windows версии 3.6.0 и более ранних, но в будущем, возможно, его придется явно добавить в :data:`sys.meta_path`.

source: Additional modules
ru: Дополнительные модули

source: Even though Python aims to be portable among all platforms, there are features that are unique to Windows. A couple of modules, both in the standard library and external, and snippets exist to use these features.
ru: Несмотря на то, что Python стремится быть переносимым на все платформы, существуют функции, уникальные для Windows. Для использования этих функций существует несколько модулей, как в стандартной библиотеке, так и во внешних, а также фрагменты.

source: The Windows-specific standard modules are documented in :ref:`mswin-specific-services`.
ru: Стандартные модули, специфичные для Windows, описаны в :ref:`mswin-special-services`.

source: The :pypi:`PyWin32` module by Mark Hammond is a collection of modules for advanced Windows-specific support. This includes utilities for:
ru: Модуль :pypi:`PyWin32` от Марка Хаммонда представляет собой набор модулей для расширенной поддержки, специфичной для Windows. Сюда входят утилиты для:

source: `Component Object Model <https://learn.microsoft.com/windows/win32/com/component-object-model--com--portal>`_ (COM)
ru: `Объектная модель компонентов <https://learn.microsoft.com/windows/win32/com/comComponent-object-model--com--portal>`_ (COM)

source: Win32 API calls
ru: Вызовы Win32 API

source: Registry
ru: Реестр

source: Event log
ru: Журнал событий

source: `Microsoft Foundation Classes <https://learn.microsoft.com/cpp/mfc/mfc-desktop-applications>`_ (MFC) user interfaces
ru: `Классы Microsoft Foundation <https://learn.microsoft.com/cpp/mfc/mfc-desktop-applications>`_ (MFC) пользовательские интерфейсы

source: `PythonWin <https://web.archive.org/web/20060524042422/ https://www.python.org/windows/pythonwin/>`_ is a sample MFC application shipped with PyWin32. It is an embeddable IDE with a built-in debugger.
ru: `PythonWin <https://web.archive.org/web/20060524042422/ https://www.python.org/windows/pythonwin/>`_ — это пример приложения MFC, поставляемого с PyWin32. Это встраиваемая IDE со встроенным отладчиком.

source: `Win32 How Do I...? <https://timgolden.me.uk/python/win32_how_do_i.html>`_
ru: `Win32 Как мне...? <https://timgolden.me.uk/python/win32_how_do_i.html>`_

source: by Tim Golden
ru: Tim Golden

source: `Python and COM <https://www.boddie.org.uk/python/COM.html>`_
ru: `Python и COM <https://www.boddie.org.uk/python/COM.html>`_

source: by David and Paul Boddie
ru: Дэвид и Пол Бодди

source: `cx_Freeze <https://cx-freeze.readthedocs.io/en/latest/>`_ wraps Python scripts into executable Windows programs (:file:`{*}.exe` files). When you have done this, you can distribute your application without requiring your users to install Python.
ru: `cx_Freeze <https://cx-freeze.readthedocs.io/en/latest/>`_ оборачивает сценарии Python в исполняемые программы Windows (:file:`{*}.exe` файлы). Сделав это, вы сможете распространять свое приложение, не требуя от пользователей установки Python.

source: Compiling Python on Windows
ru: Компиляция Python в Windows

source: If you want to compile CPython yourself, first thing you should do is get the `source <https://www.python.org/downloads/source/>`_. You can download either the latest release's source or just grab a fresh `checkout <https://devguide.python.org/setup/#get-the-source-code>`_.
ru: Если вы хотите скомпилировать CPython самостоятельно, первое, что вам нужно сделать, это получить исходный код <https://www.python.org/downloads/source/>`_. Вы можете загрузить либо исходный код последней версии, либо просто получить новую `checkout <https://devguide.python.org/setup/#get-the-source-code>`_.

source: The source tree contains a build solution and project files for Microsoft Visual Studio, which is the compiler used to build the official Python releases. These files are in the :file:`PCbuild` directory.
ru: Дерево исходного кода содержит решение для сборки и файлы проекта для Microsoft Visual Studio — компилятора, используемого для сборки официальных выпусков Python. Эти файлы находятся в каталоге :file:`PCbuild`.

source: Check :file:`PCbuild/readme.txt` for general information on the build process.
ru: Проверьте :file:`PCbuild/readme.txt` для получения общей информации о процессе сборки.

source: For extension modules, consult :ref:`building-on-windows`.
ru: Для модулей расширения обратитесь к :ref:`building-on-windows`.

source: Other Platforms
ru: Другие платформы

source: With ongoing development of Python, some platforms that used to be supported earlier are no longer supported (due to the lack of users or developers). Check :pep:`11` for details on all unsupported platforms.
ru: В связи с продолжающимся развитием Python некоторые платформы, которые поддерживались ранее, больше не поддерживаются (из-за отсутствия пользователей или разработчиков). Проверьте :pep:`11` для получения подробной информации обо всех неподдерживаемых платформах.

source: `Windows CE <https://pythonce.sourceforge.net/>`_ is `no longer supported <https://github.com/python/cpython/issues/71542>`__ since Python 3 (if it ever was).
ru: `Windows CE <https://pythonce.sourceforge.net/>`_ `больше не поддерживается <https://github.com/python/cpython/issues/71542>`__ начиная с Python 3 (если он когда-либо был) .

source: The `Cygwin <https://cygwin.com/>`_ installer offers to install the `Python interpreter <https://cygwin.com/packages/summary/python3.html>`__ as well
ru: Установщик `Cygwin <https://cygwin.com/>`_ предлагает также установить `интерпретатор Python <https://cygwin.com/packages/summary/python3.html>`__

source: See `Python for Windows <https://www.python.org/downloads/windows/>`_ for detailed information about platforms with pre-compiled installers.
ru: См. `Python для Windows <https://www.python.org/downloads/windows/>`_ для получения подробной информации о платформах с предварительно скомпилированными установщиками.
