Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/*.po
Languages: ast

source: For nodes that were part of a collection of statements (that applies to all statement nodes), the visitor may also return a list of nodes rather than just a single node.
ast: Для вузлів, які були частиною набору операторів (що стосується всіх вузлів операторів), відвідувач також може повернути список вузлів, а не лише один вузол.

source: Usually you use the transformer like this::
ast: Зазвичай ви використовуєте трансформатор таким чином:

source: Return a formatted dump of the tree in *node*. This is mainly useful for debugging purposes. If *annotate_fields* is true (by default), the returned string will show the names and the values for fields. If *annotate_fields* is false, the result string will be more compact by omitting unambiguous field names. Attributes such as line numbers and column offsets are not dumped by default. If this is wanted, *include_attributes* can be set to true.
ast: Повернути відформатований дамп дерева у *node*. Це в основному корисно для цілей налагодження. Якщо *annotate_fields* має значення true (за замовчуванням), у поверненому рядку відображатимуться імена та значення для полів. Якщо *annotate_fields* має значення false, рядок результату буде більш компактним за рахунок пропуску однозначних імен полів. Такі атрибути, як номери рядків і зміщення стовпців, не скидаються за замовчуванням. Якщо це потрібно, *include_attributes* можна встановити на true.

source: If *indent* is a non-negative integer or string, then the tree will be pretty-printed with that indent level. An indent level of 0, negative, or ``""`` will only insert newlines. ``None`` (the default) selects the single line representation. Using a positive integer indent indents that many spaces per level. If *indent* is a string (such as ``"\t"``), that string is used to indent each level.
ast: Якщо *indent* є невід’ємним цілим числом або рядком, то дерево буде надруковано з таким рівнем відступу. Рівень відступу 0, негативний або ``""`` вставлятиме лише нові рядки. ``None`` (за замовчуванням) вибирає однорядкове представлення. Використання додатного цілого відступу робить стільки відступів на рівень. Якщо *indent* є рядком (наприклад, ``"\t"``), цей рядок використовується для відступу кожного рівня.

source: Added the *indent* option.
ast: Додано параметр *відступ*.

source: Compiler Flags
ast: Прапори компілятора

source: The following flags may be passed to :func:`compile` in order to change effects on the compilation of a program:
ast: Наступні прапорці можуть бути передані :func:`compile`, щоб змінити вплив на компіляцію програми:

source: Enables support for top-level ``await``, ``async for``, ``async with`` and async comprehensions.
ast: Вмикає підтримку ``await`` верхнього рівня, ``async for``, ``async with`` та асинхронне розуміння.

source: Generates and returns an abstract syntax tree instead of returning a compiled code object.
ast: Створює та повертає абстрактне синтаксичне дерево замість повернення скомпільованого об’єкта коду.

source: Enables support for :pep:`484` and :pep:`526` style type comments (``# type: <type>``, ``# type: ignore <stuff>``).
ast: Вмикає підтримку коментарів типу :pep:`484` і :pep:`526` (``# type: <type>``, ``# type: ignore <stuff>``).

source: Command-Line Usage
ast: Використання командного рядка

source: The :mod:`ast` module can be executed as a script from the command line. It is as simple as:
ast: Модуль :mod:`ast` можна запустити як скрипт із командного рядка. Це так просто:

source: The following options are accepted:
ast: Приймаються такі варіанти:

source: Show the help message and exit.
ast: Показати довідкове повідомлення та вийти.

source: Specify what kind of code must be compiled, like the *mode* argument in :func:`parse`.
ast: Укажіть тип коду, який потрібно скомпілювати, наприклад аргумент *mode* у :func:`parse`.

source: Don't parse type comments.
ast: Не аналізуйте коментарі типу.

source: Include attributes such as line numbers and column offsets.
ast: Додайте такі атрибути, як номери рядків і зміщення стовпців.

source: Indentation of nodes in AST (number of spaces).
ast: Відступ вузлів в AST (кількість пробілів).

source: If :file:`infile` is specified its contents are parsed to AST and dumped to stdout. Otherwise, the content is read from stdin.
ast: Якщо вказано :file:`infile`, його вміст аналізується в AST і скидається в stdout. В іншому випадку вміст читається зі стандартного вводу.

source: `Green Tree Snakes <https://greentreesnakes.readthedocs.io/>`_, an external documentation resource, has good details on working with Python ASTs.
ast: `Green Tree Snakes <https://greentreesnakes.readthedocs.io/>`_, зовнішній ресурс документації, містить хороші відомості про роботу з Python AST.

source: `ASTTokens <https://asttokens.readthedocs.io/en/latest/user-guide.html>`_ annotates Python ASTs with the positions of tokens and text in the source code that generated them. This is helpful for tools that make source code transformations.
ast: `ASTTokens <https://asttokens.readthedocs.io/en/latest/user-guide.html>`_ анотує AST Python за допомогою позицій токенів і тексту у вихідному коді, який їх створив. Це корисно для інструментів, які здійснюють перетворення вихідного коду.

source: `LibCST <https://libcst.readthedocs.io/>`_ parses code as a Concrete Syntax Tree that looks like an ast tree and keeps all formatting details. It's useful for building automated refactoring (codemod) applications and linters.
ast: `LibCST <https://libcst.readthedocs.io/>`_ аналізує код як конкретне синтаксичне дерево, яке виглядає як дерево ast і зберігає всі деталі форматування. Це корисно для створення додатків і лінтерів для автоматизованого рефакторинга (codemod).

source: ? (question mark)
ast: ? (знак питання)

source: * (asterisk)
ast: * (зірочка)
