Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/*.po
Languages: ast

source: **Source code:** :source:`Lib/ast.py`
ast: **Вихідний код:** :source:`Lib/ast.py`

source: The :mod:`ast` module helps Python applications to process trees of the Python abstract syntax grammar. The abstract syntax itself might change with each Python release; this module helps to find out programmatically what the current grammar looks like.
ast: Модуль :mod:`ast` допомагає програмам Python обробляти дерева граматики абстрактного синтаксису Python. Сам абстрактний синтаксис може змінюватися з кожним випуском Python; цей модуль допомагає програмно дізнатися, як виглядає поточна граматика.

source: An abstract syntax tree can be generated by passing :data:`ast.PyCF_ONLY_AST` as a flag to the :func:`compile` built-in function, or using the :func:`parse` helper provided in this module. The result will be a tree of objects whose classes all inherit from :class:`ast.AST`. An abstract syntax tree can be compiled into a Python code object using the built-in :func:`compile` function.
ast: Абстрактне синтаксичне дерево можна створити, передавши :data:`ast.PyCF_ONLY_AST` як прапорець вбудованій функції :func:`compile` або використовуючи помічник :func:`parse`, наданий у цьому модулі. Результатом буде дерево об’єктів, усі класи яких успадковуються від :class:`ast.AST`. Абстрактне синтаксичне дерево можна скомпілювати в об’єкт коду Python за допомогою вбудованої функції :func:`compile`.

source: Abstract Grammar
ast: Абстрактна граматика

source: The abstract grammar is currently defined as follows:
ast: Наразі абстрактна граматика визначається наступним чином:

source: Node classes
ast: Класи вузлів

source: There is one class defined for each left-hand side symbol in the abstract grammar (for example, :class:`ast.stmt` or :class:`ast.expr`). In addition, there is one class defined for each constructor on the right-hand side; these classes inherit from the classes for the left-hand side trees. For example, :class:`ast.BinOp` inherits from :class:`ast.expr`. For production rules with alternatives (aka "sums"), the left-hand side class is abstract: only instances of specific constructor nodes are ever created.
ast: Для кожного лівого символу в абстрактній граматиці визначено один клас (наприклад, :class:`ast.stmt` або :class:`ast.expr`). Крім того, є один клас, визначений для кожного конструктора в правій частині; ці класи успадковують класи для лівих дерев. Наприклад, :class:`ast.BinOp` успадковується від :class:`ast.expr`. Для виробничих правил з альтернативами (він же "суми") лівий клас є абстрактним: створюються лише екземпляри конкретних вузлів конструктора.

source: Each concrete class has an attribute :attr:`_fields` which gives the names of all child nodes.
ast: Кожен конкретний клас має атрибут :attr:`_fields`, який дає імена всіх дочірніх вузлів.

source: Each instance of a concrete class has one attribute for each child node, of the type as defined in the grammar. For example, :class:`ast.BinOp` instances have an attribute :attr:`left` of type :class:`ast.expr`.
ast: Кожен екземпляр конкретного класу має один атрибут для кожного дочірнього вузла типу, визначеного в граматиці. Наприклад, екземпляри :class:`ast.BinOp` мають атрибут :attr:`left` типу :class:`ast.expr`.

source: If these attributes are marked as optional in the grammar (using a question mark), the value might be ``None``. If the attributes can have zero-or-more values (marked with an asterisk), the values are represented as Python lists. All possible attributes must be present and have valid values when compiling an AST with :func:`compile`.
ast: Якщо ці атрибути позначені як необов’язкові в граматиці (використовуючи знак питання), значенням може бути ``None``. Якщо атрибути можуть мати нуль або більше значень (позначених зірочкою), значення представлені у вигляді списків Python. Під час компіляції AST за допомогою :func:`compile` усі можливі атрибути повинні бути присутніми та мати дійсні значення.

source: Instances of :class:`ast.expr` and :class:`ast.stmt` subclasses have :attr:`lineno`, :attr:`col_offset`, :attr:`end_lineno`, and :attr:`end_col_offset` attributes. The :attr:`lineno` and :attr:`end_lineno` are the first and last line numbers of source text span (1-indexed so the first line is line 1) and the :attr:`col_offset` and :attr:`end_col_offset` are the corresponding UTF-8 byte offsets of the first and last tokens that generated the node. The UTF-8 offset is recorded because the parser uses UTF-8 internally.
ast: Екземпляри підкласів :class:`ast.expr` і :class:`ast.stmt` мають атрибути :attr:`lineno`, :attr:`col_offset`, :attr:`end_lineno` і :attr:`end_col_offset` . :attr:`lineno` і :attr:`end_lineno` — це номери першого й останнього рядків вихідного текстового діапазону (з індексом 1, тому перший рядок — рядок 1), а також :attr:`col_offset` і :attr:`end_col_offset` — це відповідні зміщення байтів UTF-8 для першого й останнього маркерів, які створили вузол. Зсув UTF-8 записується, оскільки аналізатор використовує UTF-8 внутрішньо.

source: Note that the end positions are not required by the compiler and are therefore optional. The end offset is *after* the last symbol, for example one can get the source segment of a one-line expression node using ``source_line[node.col_offset : node.end_col_offset]``.
ast: Зауважте, що кінцеві позиції не потрібні компілятору і тому є необов’язковими. Кінцеве зміщення вказується *після* останнього символу, наприклад, можна отримати вихідний сегмент вузла однорядкового виразу за допомогою ``source_line[node.col_offset : node.end_col_offset]``.

source: The constructor of a class :class:`ast.T` parses its arguments as follows:
ast: Конструктор класу :class:`ast.T` аналізує його аргументи наступним чином:

source: If there are positional arguments, there must be as many as there are items in :attr:`T._fields`; they will be assigned as attributes of these names.
ast: Якщо є позиційні аргументи, їх має бути стільки, скільки елементів у :attr:`T._fields`; вони будуть призначені як атрибути цих імен.

source: If there are keyword arguments, they will set the attributes of the same names to the given values.
ast: Якщо є ключові аргументи, вони встановлять атрибути з однаковими іменами на задані значення.

source: For example, to create and populate an :class:`ast.UnaryOp` node, you could use ::
ast: Наприклад, щоб створити та заповнити вузол :class:`ast.UnaryOp`, ви можете використати ::

source: or the more compact ::
ast: або більш компактний ::

source: Class :class:`ast.Constant` is now used for all constants.
ast: Клас :class:`ast.Constant` тепер використовується для всіх констант.

source: Simple indices are represented by their value, extended slices are represented as tuples.
ast: Прості індекси представлені їх значеннями, розширені зрізи представлені у вигляді кортежів.

source: The descriptions of the specific node classes displayed here were initially adapted from the fantastic `Green Tree Snakes <https://greentreesnakes.readthedocs.io/en/latest/>`__ project and all its contributors.
ast: Описи конкретних класів вузлів, відображені тут, спочатку були адаптовані з фантастичного проекту `Green Tree Snakes <https://greentreesnakes.readthedocs.io/en/latest/>`__ та всіх його учасників.

source: Literals
ast: Літерали

source: A constant value. The ``value`` attribute of the ``Constant`` literal contains the Python object it represents. The values represented can be simple types such as a number, string or ``None``, but also immutable container types (tuples and frozensets) if all of their elements are constant.
ast: Постійне значення. Атрибут ``value`` літералу ``Constant`` містить об’єкт Python, який він представляє. Представлені значення можуть бути простими типами, такими як число, рядок або ``None``, а також незмінними типами контейнерів (кортежі та заморожені набори), якщо всі їхні елементи постійні.

source: Node representing a single formatting field in an f-string. If the string contains a single formatting field and nothing else the node can be isolated otherwise it appears in :class:`JoinedStr`.
ast: Вузол, що представляє одне поле форматування в f-рядку. Якщо рядок містить одне поле форматування та нічого іншого, вузол можна ізолювати, інакше він з’являється в :class:`JoinedStr`.

source: ``value`` is any expression node (such as a literal, a variable, or a function call).
ast: ``значення`` - будь-який вузол виразу (наприклад, літерал, змінна або виклик функції).

source: ``conversion`` is an integer:
ast: ``перетворення`` є цілим числом:

source: -1: no formatting
ast: -1: без форматування

source: 115: ``!s`` string formatting
ast: 115: форматування рядка ``!s``

source: 114: ``!r`` repr formatting
ast: 114: форматування ``!r`` repr

source: 97: ``!a`` ascii formatting
ast: 97: ``!a`` форматування ascii

source: ``format_spec`` is a :class:`JoinedStr` node representing the formatting of the value, or ``None`` if no format was specified. Both ``conversion`` and ``format_spec`` can be set at the same time.
ast: ``format_spec`` — це вузол :class:`JoinedStr`, який представляє форматування значення, або ``None``, якщо формат не вказано. І ``conversion``, і ``format_spec`` можна встановити одночасно.

source: An f-string, comprising a series of :class:`FormattedValue` and :class:`Constant` nodes.
ast: F-рядок, що містить ряд вузлів :class:`FormattedValue` і :class:`Constant`.

source: A list or tuple. ``elts`` holds a list of nodes representing the elements. ``ctx`` is :class:`Store` if the container is an assignment target (i.e. ``(x,y)=something``), and :class:`Load` otherwise.
ast: Список або кортеж. ``elts`` містить список вузлів, що представляють елементи. ``ctx`` є :class:`Store`, якщо контейнер є метою призначення (тобто ``(x,y)=something``), і :class:`Load` інакше.

source: A set. ``elts`` holds a list of nodes representing the set's elements.
ast: Набір. ``elts`` містить список вузлів, що представляють елементи набору.

source: A dictionary. ``keys`` and ``values`` hold lists of nodes representing the keys and the values respectively, in matching order (what would be returned when calling :code:`dictionary.keys()` and :code:`dictionary.values()`).
ast: Словник. ``keys`` і ``values`` містять списки вузлів, що представляють ключі та значення відповідно, у відповідному порядку (те, що буде повернуто під час виклику :code:`dictionary.keys()` і :code:`dictionary. значення()`).

source: When doing dictionary unpacking using dictionary literals the expression to be expanded goes in the ``values`` list, with a ``None`` at the corresponding position in ``keys``.
ast: Під час розпакування словника за допомогою словникових літералів вираз, який потрібно розгорнути, потрапляє до списку ``значень`` із ``None`` у відповідній позиції ``ключів``.

source: Variables
ast: Змінні

source: A variable name. ``id`` holds the name as a string, and ``ctx`` is one of the following types.
ast: Ім'я змінної. ``id`` містить назву як рядок, а ``ctx`` є одним із наступних типів.

source: Variable references can be used to load the value of a variable, to assign a new value to it, or to delete it. Variable references are given a context to distinguish these cases.
ast: Посилання на змінні можна використовувати, щоб завантажити значення змінної, призначити їй нове значення або видалити її. Посиланням на змінні надається контекст, щоб розрізняти ці випадки.

source: A ``*var`` variable reference. ``value`` holds the variable, typically a :class:`Name` node. This type must be used when building a :class:`Call` node with ``*args``.
ast: Посилання на змінну ``*var``. ``value`` містить змінну, як правило, вузол :class:`Name`. Цей тип необхідно використовувати під час створення вузла :class:`Call` з ``*args``.

source: Expressions
ast: Вирази

source: When an expression, such as a function call, appears as a statement by itself with its return value not used or stored, it is wrapped in this container. ``value`` holds one of the other nodes in this section, a :class:`Constant`, a :class:`Name`, a :class:`Lambda`, a :class:`Yield` or :class:`YieldFrom` node.
ast: Коли вираз, як-от виклик функції, з’являється як окремий оператор із невикористаним або збереженим значенням, що повертається, його загортають у цей контейнер. ``value`` містить один із інших вузлів у цьому розділі, :class:`Constant`, :class:`Name`, :class:`Lambda`, :class:`Yield` або :class:`YieldFrom`.

source: A unary operation. ``op`` is the operator, and ``operand`` any expression node.
ast: Унарна операція. ``op`` є оператором, а ``operand`` будь-яким вузлом виразу.

source: Unary operator tokens. :class:`Not` is the ``not`` keyword, :class:`Invert` is the ``~`` operator.
ast: Унарні маркери оператора. :class:`Not` - це ключове слово ``not``, :class:`Invert` - це оператор ``~``.

source: A binary operation (like addition or division). ``op`` is the operator, and ``left`` and ``right`` are any expression nodes.
ast: Двійкова операція (наприклад, додавання або ділення). ``op`` є оператором, ``left`` і ``right`` є будь-якими вузлами виразу.

source: Binary operator tokens.
ast: Бінарні операторські токени.

source: A boolean operation, 'or' or 'and'. ``op`` is :class:`Or` or :class:`And`. ``values`` are the values involved. Consecutive operations with the same operator, such as ``a or b or c``, are collapsed into one node with several values.
ast: Логічна операція "або" або "і". ``op`` - це :class:`Or` або :class:`And`. ``values`` - це значення, які беруть участь. Послідовні операції з тим самим оператором, наприклад ``a або b або c``, згортаються в один вузол з кількома значеннями.

source: This doesn't include ``not``, which is a :class:`UnaryOp`.
ast: Це не включає ``not``, який є :class:`UnaryOp`.

source: Boolean operator tokens.
ast: Логічні операторні маркери.

source: A comparison of two or more values. ``left`` is the first value in the comparison, ``ops`` the list of operators, and ``comparators`` the list of values after the first element in the comparison.
ast: Порівняння двох чи більше значень. ``left`` - це перше значення в порівнянні, ``ops`` - список операторів, ``comparators`` - список значень після першого елемента в порівнянні.

source: Comparison operator tokens.
ast: Лексими операторів порівняння.

source: A function call. ``func`` is the function, which will often be a :class:`Name` or :class:`Attribute` object. Of the arguments:
ast: Виклик функції. ``func`` – це функція, яка часто буде об’єктом :class:`Name` або :class:`Attribute`. З аргументів:

source: ``args`` holds a list of the arguments passed by position.
ast: ``args`` містить список аргументів, переданих за позицією.

source: A keyword argument to a function call or class definition. ``arg`` is a raw string of the parameter name, ``value`` is a node to pass in.
ast: Аргумент ключового слова для виклику функції або визначення класу. ``arg`` — це необроблений рядок назви параметра, ``value`` — це вузол для передачі.

source: An expression such as ``a if b else c``. Each field holds a single node, so in the following example, all three are :class:`Name` nodes.
ast: Вираз на зразок "a if b else c". Кожне поле містить один вузол, тому в наступному прикладі всі три є вузлами :class:`Name`.

source: Attribute access, e.g. ``d.keys``. ``value`` is a node, typically a :class:`Name`. ``attr`` is a bare string giving the name of the attribute, and ``ctx`` is :class:`Load`, :class:`Store` or :class:`Del` according to how the attribute is acted on.
ast: Доступ до атрибутів, напр. ``d.keys``. ``value`` - це вузол, як правило, :class:`Name`. ``attr`` — це чистий рядок, що дає назву атрибуту, а ``ctx`` — це :class:`Load`, :class:`Store` або :class:`Del` відповідно до того, як діє атрибут на.

source: A named expression. This AST node is produced by the assignment expressions operator (also known as the walrus operator). As opposed to the :class:`Assign` node in which the first argument can be multiple nodes, in this case both ``target`` and ``value`` must be single nodes.
ast: Іменований вираз. Цей вузол AST створюється оператором виразів присвоєння (також відомим як оператор моржа). На відміну від вузла :class:`Assign`, у якому першим аргументом може бути кілька вузлів, у цьому випадку як ``target``, так і ``value`` мають бути окремими вузлами.

source: Subscripting
ast: Підписка

source: A subscript, such as ``l[1]``. ``value`` is the subscripted object (usually sequence or mapping). ``slice`` is an index, slice or key. It can be a :class:`Tuple` and contain a :class:`Slice`. ``ctx`` is :class:`Load`, :class:`Store` or :class:`Del` according to the action performed with the subscript.
ast: Нижній індекс, наприклад "l[1]". ``значення`` - це об'єкт з індексом (зазвичай послідовність або відображення). ``slice`` - це індекс, зріз або ключ. Це може бути :class:`Tuple` і містити :class:`Slice`. ``ctx`` - це :class:`Load`, :class:`Store` або :class:`Del` відповідно до дії, виконаної з нижнім індексом.

source: Regular slicing (on the form ``lower:upper`` or ``lower:upper:step``). Can occur only inside the *slice* field of :class:`Subscript`, either directly or as an element of :class:`Tuple`.
ast: Звичайна нарізка (за формою ``lower:upper`` або ``lower:upper:step``). Може зустрічатися лише всередині поля *slice* :class:`Subscript`, або безпосередньо, або як елемент :class:`Tuple`.

source: Comprehensions
ast: Осягнення

source: List and set comprehensions, generator expressions, and dictionary comprehensions. ``elt`` (or ``key`` and ``value``) is a single node representing the part that will be evaluated for each item.
ast: Список і набір розуміння, генератор виразів і словник розуміння. ``elt`` (або ``key`` і ``value``) — це один вузол, що представляє частину, яка буде оцінюватися для кожного елемента.

source: ``generators`` is a list of :class:`comprehension` nodes.
ast: ``generators`` - це список вузлів :class:`comprehension`.

source: One ``for`` clause in a comprehension. ``target`` is the reference to use for each element - typically a :class:`Name` or :class:`Tuple` node. ``iter`` is the object to iterate over. ``ifs`` is a list of test expressions: each ``for`` clause can have multiple ``ifs``.
ast: Одне речення ``за`` для розуміння. ``target`` - це посилання для використання для кожного елемента - зазвичай :class:`Name` або :class:`Tuple` вузол. ``iter`` - це об'єкт для повторення. ``ifs`` — це список перевірочних виразів: кожен пункт ``for`` може мати кілька ``ifs``.

source: ``is_async`` indicates a comprehension is asynchronous (using an ``async for`` instead of ``for``). The value is an integer (0 or 1).
ast: ``is_async`` вказує, що розуміння є асинхронним (використовуючи ``async for`` замість ``for``). Значення є цілим числом (0 або 1).

source: Statements
ast: Заяви

source: An assignment. ``targets`` is a list of nodes, and ``value`` is a single node.
ast: Доручення. ``targets`` — це список вузлів, а ``value`` — один вузол.

source: Multiple nodes in ``targets`` represents assigning the same value to each. Unpacking is represented by putting a :class:`Tuple` or :class:`List` within ``targets``.
ast: Кілька вузлів у ``цілях`` представляють призначення однакового значення кожному. Розпакування представлено розміщенням :class:`Tuple` або :class:`List` у ``targets``.

source: ``type_comment`` is an optional string with the type annotation as a comment.
ast: ``type_comment`` – необов’язковий рядок із анотацією типу як коментаря.

source: Augmented assignment, such as ``a += 1``. In the following example, ``target`` is a :class:`Name` node for ``x`` (with the :class:`Store` context), ``op`` is :class:`Add`, and ``value`` is a :class:`Constant` with value for 1.
ast: Доповнене присвоювання, наприклад ``a += 1``. У наступному прикладі ``target`` є вузлом :class:`Name` для ``x`` (з контекстом :class:`Store`), ``op`` це :class:`Add`, а ``значення`` є :class:`Constant` зі значенням 1.

source: The ``target`` attribute cannot be of class :class:`Tuple` or :class:`List`, unlike the targets of :class:`Assign`.
ast: Атрибут ``target`` не може належати до класу :class:`Tuple` або :class:`List`, на відміну від цілей :class:`Assign`.

source: A ``raise`` statement. ``exc`` is the exception object to be raised, normally a :class:`Call` or :class:`Name`, or ``None`` for a standalone ``raise``. ``cause`` is the optional part for ``y`` in ``raise x from y``.
ast: Оператор ``raise``. ``exc`` — це об’єкт винятку, який потрібно викликати, зазвичай це :class:`Call` або :class:`Name`, або ``None`` для окремого ``raise``. ``cause`` є необов’язковою частиною для ``y`` у ``raise x from y``.

source: An assertion. ``test`` holds the condition, such as a :class:`Compare` node. ``msg`` holds the failure message.
ast: Твердження. ``test`` містить умову, як-от вузол :class:`Compare`. ``msg`` містить повідомлення про помилку.

source: Represents a ``del`` statement. ``targets`` is a list of nodes, such as :class:`Name`, :class:`Attribute` or :class:`Subscript` nodes.
ast: Представляє оператор ``del``. ``targets`` – це список вузлів, наприклад вузли :class:`Name`, :class:`Attribute` або :class:`Subscript`.

source: A ``pass`` statement.
ast: Заява ``pass``.

source: Other statements which are only applicable inside functions or loops are described in other sections.
ast: Інші оператори, які застосовуються лише всередині функцій або циклів, описані в інших розділах.

source: Imports
ast: Імпорт

source: An import statement. ``names`` is a list of :class:`alias` nodes.
ast: Заява про імпорт. ``names`` - це список вузлів :class:`alias`.

source: Represents ``from x import y``. ``module`` is a raw string of the 'from' name, without any leading dots, or ``None`` for statements such as ``from . import foo``. ``level`` is an integer holding the level of the relative import (0 means absolute import).
ast: Представляє ``from x import y``. ``module`` — це необроблений рядок назви 'from' без будь-яких крапок на початку або ``None`` для операторів, таких як ``from . імпортувати foo``. ``level`` — це ціле число, що містить рівень відносного імпорту (0 означає абсолютний імпорт).

source: Both parameters are raw strings of the names. ``asname`` can be ``None`` if the regular name is to be used.
ast: Обидва параметри є необробленими рядками імен. ``asname`` може бути ``None``, якщо має використовуватися звичайна назва.

source: Control flow
ast: Контроль потоку

source: Optional clauses such as ``else`` are stored as an empty list if they're not present.
ast: Необов’язкові пропозиції, такі як ``else``, зберігаються як порожній список, якщо їх немає.

source: An ``if`` statement. ``test`` holds a single node, such as a :class:`Compare` node. ``body`` and ``orelse`` each hold a list of nodes.
ast: Оператор ``if``. ``test`` містить один вузол, наприклад вузол :class:`Compare`. ``body`` і ``orelse`` містять список вузлів.

source: ``elif`` clauses don't have a special representation in the AST, but rather appear as extra :class:`If` nodes within the ``orelse`` section of the previous one.
ast: Речення ``elif`` не мають спеціального представлення в AST, а радше з’являються як додаткові вузли :class:`If` у розділі ``orelse`` попереднього.

source: A ``while`` loop. ``test`` holds the condition, such as a :class:`Compare` node.
ast: Цикл ``while``. ``test`` містить умову, як-от вузол :class:`Compare`.

source: The ``break`` and ``continue`` statements.
ast: Оператори ``break`` і ``continue``.

source: ``try`` blocks. All attributes are list of nodes to execute, except for ``handlers``, which is a list of :class:`ExceptHandler` nodes.
ast: блоки ``try``. Усі атрибути є списком вузлів для виконання, за винятком ``обробників``, який є списком :class:`ExceptHandler` вузлів.
