Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/*.po
Languages: ast

source: A single ``except`` clause. ``type`` is the exception type it will match, typically a :class:`Name` node (or ``None`` for a catch-all ``except:`` clause). ``name`` is a raw string for the name to hold the exception, or ``None`` if the clause doesn't have ``as foo``. ``body`` is a list of nodes.
ast: Єдине речення ``крім``. ``type`` — це тип винятку, якому він відповідатиме, як правило, вузол :class:`Name` (або ``None`` для речення catch-all ``except:``). ``name`` — це необроблений рядок для імені, який містить виняток, або ``None``, якщо в пропозиції немає ``as foo``. ``body`` - це список вузлів.

source: A ``with`` block. ``items`` is a list of :class:`withitem` nodes representing the context managers, and ``body`` is the indented block inside the context.
ast: Блок ``with``. ``items`` — це список вузлів :class:`withitem`, що представляють контекстні менеджери, а ``body`` — блок із відступом усередині контексту.

source: A single context manager in a ``with`` block. ``context_expr`` is the context manager, often a :class:`Call` node. ``optional_vars`` is a :class:`Name`, :class:`Tuple` or :class:`List` for the ``as foo`` part, or ``None`` if that isn't used.
ast: Єдиний контекстний менеджер у блоці ``with``. ``context_expr`` - це менеджер контексту, часто вузол :class:`Call`. ``optional_vars`` — це :class:`Name`, :class:`Tuple` або :class:`List` для частини ``as foo``, або ``None``, якщо вона не використовується.

source: Pattern matching
ast: Зіставлення шаблону

source: A ``match`` statement. ``subject`` holds the subject of the match (the object that is being matched against the cases) and ``cases`` contains an iterable of :class:`match_case` nodes with the different cases.
ast: Оператор ``збігу``. ``subject`` містить предмет відповідності (об’єкт, який зіставляється з регістрами), а ``cases`` містить ітерацію вузлів :class:`match_case` з різними регістрами.

source: A single case pattern in a ``match`` statement. ``pattern`` contains the match pattern that the subject will be matched against. Note that the :class:`AST` nodes produced for patterns differ from those produced for expressions, even when they share the same syntax.
ast: Шаблон одного регістру в операторі ``match``. ``шаблон`` містить шаблон відповідності, з яким буде зіставлятися предмет. Зверніть увагу, що вузли :class:`AST`, створені для шаблонів, відрізняються від вузлів, створених для виразів, навіть якщо вони мають однаковий синтаксис.

source: The ``guard`` attribute contains an expression that will be evaluated if the pattern matches the subject.
ast: Атрибут ``guard`` містить вираз, який буде оцінено, якщо шаблон відповідає темі.

source: ``body`` contains a list of nodes to execute if the pattern matches and the result of evaluating the guard expression is true.
ast: ``body`` містить список вузлів для виконання, якщо шаблон збігається і результат оцінки виразу guard є істинним.

source: A match literal or value pattern that compares by equality. ``value`` is an expression node. Permitted value nodes are restricted as described in the match statement documentation. This pattern succeeds if the match subject is equal to the evaluated value.
ast: Літерал відповідності або шаблон значення, який порівнює за рівністю. ``значення`` є вузлом виразу. Дозволені вузли значень обмежені, як описано в документації оператора відповідності. Цей шаблон успішно працює, якщо суб’єкт відповідності дорівнює оцінюваному значенню.

source: A match literal pattern that compares by identity. ``value`` is the singleton to be compared against: ``None``, ``True``, or ``False``. This pattern succeeds if the match subject is the given constant.
ast: Зразок буквального збігу, який порівнює за ідентичністю. ``value`` — це синглтон, з яким слід порівнювати: ``None``, ``True`` або ``False``. Цей шаблон успішний, якщо суб’єкт відповідності є заданою константою.

source: A match sequence pattern. ``patterns`` contains the patterns to be matched against the subject elements if the subject is a sequence. Matches a variable length sequence if one of the subpatterns is a ``MatchStar`` node, otherwise matches a fixed length sequence.
ast: Шаблон послідовності відповідності. ``patterns`` містить шаблони, які потрібно зіставити з елементами теми, якщо тема є послідовністю. Відповідає послідовності змінної довжини, якщо один із підшаблонів є вузлом ``MatchStar``, інакше відповідає послідовності фіксованої довжини.

source: Matches the rest of the sequence in a variable length match sequence pattern. If ``name`` is not ``None``, a list containing the remaining sequence elements is bound to that name if the overall sequence pattern is successful.
ast: Збігається з рештою послідовності в шаблоні послідовності відповідності змінної довжини. Якщо ``name`` не ``None``, список, що містить решту елементів послідовності, прив’язується до цього імені, якщо загальний шаблон послідовності успішний.

source: A match mapping pattern. ``keys`` is a sequence of expression nodes. ``patterns`` is a corresponding sequence of pattern nodes. ``rest`` is an optional name that can be specified to capture the remaining mapping elements. Permitted key expressions are restricted as described in the match statement documentation.
ast: Шаблон відображення відповідності. ``ключі`` - це послідовність вузлів експресії. ``паттерни`` - це відповідна послідовність вузлів шаблону. ``rest`` - це необов'язкове ім'я, яке можна вказати для захоплення решти елементів відображення. Дозволені ключові вирази обмежені, як описано в документації оператора відповідності.

source: This pattern succeeds if the subject is a mapping, all evaluated key expressions are present in the mapping, and the value corresponding to each key matches the corresponding subpattern. If ``rest`` is not ``None``, a dict containing the remaining mapping elements is bound to that name if the overall mapping pattern is successful.
ast: Цей шаблон виконується успішно, якщо суб’єктом є відображення, усі оцінені ключові вирази присутні у відображенні, а значення, що відповідає кожному ключу, відповідає відповідному підшаблону. Якщо ``rest`` не є ``None``, dict, що містить решту елементів відображення, прив’язується до цього імені, якщо загальний шаблон відображення успішний.

source: A match class pattern. ``cls`` is an expression giving the nominal class to be matched. ``patterns`` is a sequence of pattern nodes to be matched against the class defined sequence of pattern matching attributes. ``kwd_attrs`` is a sequence of additional attributes to be matched (specified as keyword arguments in the class pattern), ``kwd_patterns`` are the corresponding patterns (specified as keyword values in the class pattern).
ast: Шаблон класу відповідності. ``cls`` - це вираз, який дає номінальний клас, який потрібно знайти. ``шаблони`` - це послідовність вузлів шаблону, які потрібно зіставити з визначеною класом послідовністю атрибутів відповідності шаблону. ``kwd_attrs`` — це послідовність додаткових атрибутів, які потрібно зіставити (зазначені як аргументи ключових слів у шаблоні класу), ``kwd_patterns`` — це відповідні шаблони (зазначені як значення ключових слів у шаблоні класу).

source: This pattern succeeds if the subject is an instance of the nominated class, all positional patterns match the corresponding class-defined attributes, and any specified keyword attributes match their corresponding pattern.
ast: Цей шаблон успішний, якщо суб’єкт є екземпляром призначеного класу, усі позиційні шаблони відповідають відповідним атрибутам, визначеним класом, і будь-які вказані атрибути ключового слова відповідають своєму відповідному шаблону.

source: Note: classes may define a property that returns self in order to match a pattern node against the instance being matched. Several builtin types are also matched that way, as described in the match statement documentation.
ast: Примітка: класи можуть визначати властивість, яка повертає self, щоб зіставити вузол шаблону з екземпляром, який відповідає. Кілька вбудованих типів також зіставляються таким чином, як описано в документації оператора збігу.

source: A match "as-pattern", capture pattern or wildcard pattern. ``pattern`` contains the match pattern that the subject will be matched against. If the pattern is ``None``, the node represents a capture pattern (i.e a bare name) and will always succeed.
ast: Збіг "як шаблон", шаблон захоплення або шаблон підстановки. ``шаблон`` містить шаблон відповідності, з яким буде зіставлятися предмет. Якщо шаблон ``None``, вузол представляє шаблон захоплення (тобто голе ім’я) і завжди матиме успіх.

source: The ``name`` attribute contains the name that will be bound if the pattern is successful. If ``name`` is ``None``, ``pattern`` must also be ``None`` and the node represents the wildcard pattern.
ast: Атрибут ``name`` містить ім'я, яке буде зв'язано, якщо шаблон буде успішним. Якщо ``name`` має значення ``None``, ``pattern`` також має бути ``None``, а вузол представляє шаблон підстановки.

source: A match "or-pattern". An or-pattern matches each of its subpatterns in turn to the subject, until one succeeds. The or-pattern is then deemed to succeed. If none of the subpatterns succeed the or-pattern fails. The ``patterns`` attribute contains a list of match pattern nodes that will be matched against the subject.
ast: Збіг "або шаблон". Або-шаблон по черзі зіставляє кожен із своїх підшаблонів із суб’єктом, поки один не досягне успіху. Після цього шаблон або вважається успішним. Якщо жоден із підшаблонів не вдався, шаблон or-не вдається. Атрибут ``patterns`` містить список вузлів шаблону відповідності, які будуть зіставлятися з предметом.

source: Function and class definitions
ast: Визначення функцій і класів

source: A function definition.
ast: Визначення функції.

source: ``name`` is a raw string of the function name.
ast: ``name`` - це необроблений рядок назви функції.

source: ``args`` is an :class:`arguments` node.
ast: ``args`` є вузлом :class:`arguments`.

source: ``body`` is the list of nodes inside the function.
ast: ``body`` - це список вузлів усередині функції.

source: ``decorator_list`` is the list of decorators to be applied, stored outermost first (i.e. the first in the list will be applied last).
ast: ``decorator_list`` — це список декораторів, які будуть застосовані, зберігаються в першу чергу (тобто перший у списку буде застосовано останнім).

source: ``returns`` is the return annotation.
ast: ``returns`` - це анотація повернення.

source: ``lambda`` is a minimal function definition that can be used inside an expression. Unlike :class:`FunctionDef`, ``body`` holds a single node.
ast: ``лямбда`` - це мінімальне визначення функції, яке можна використовувати всередині виразу. На відміну від :class:`FunctionDef`, ``body`` містить один вузол.

source: The arguments for a function.
ast: Аргументи функції.

source: ``posonlyargs``, ``args`` and ``kwonlyargs`` are lists of :class:`arg` nodes.
ast: ``posonlyargs``, ``args`` і ``kwonlyargs`` - це списки вузлів :class:`arg`.

source: ``vararg`` and ``kwarg`` are single :class:`arg` nodes, referring to the ``*args, **kwargs`` parameters.
ast: ``vararg`` і ``kwarg`` є окремими вузлами :class:`arg`, які посилаються на параметри ``*args, **kwargs``.

source: ``kw_defaults`` is a list of default values for keyword-only arguments. If one is ``None``, the corresponding argument is required.
ast: ``kw_defaults`` - це список значень за замовчуванням для аргументів, що містять лише ключові слова. Якщо одне значення ``None``, потрібен відповідний аргумент.

source: ``defaults`` is a list of default values for arguments that can be passed positionally. If there are fewer defaults, they correspond to the last n arguments.
ast: ``defaults`` - це список значень за замовчуванням для аргументів, які можна передати позиційно. Якщо стандартних значень менше, вони відповідають останнім n аргументам.

source: ``type_comment`` is an optional string with the type annotation as a comment
ast: ``type_comment`` – необов’язковий рядок із анотацією типу як коментаря

source: A ``return`` statement.
ast: Оператор ``повернення``.

source: ``global`` and ``nonlocal`` statements. ``names`` is a list of raw strings.
ast: ``глобальні`` і ``нелокальні`` заяви. ``names`` - це список необроблених рядків.

source: A class definition.
ast: Визначення класу.

source: ``name`` is a raw string for the class name
ast: ``name`` - це необроблений рядок для імені класу

source: ``bases`` is a list of nodes for explicitly specified base classes.
ast: ``бази`` - це список вузлів для явно визначених базових класів.

source: ``body`` is a list of nodes representing the code within the class definition.
ast: ``body`` - це список вузлів, що представляють код у визначенні класу.

source: ``decorator_list`` is a list of nodes, as in :class:`FunctionDef`.
ast: ``decorator_list`` - це список вузлів, як у :class:`FunctionDef`.

source: Async and await
ast: Async і очікування

source: An ``async def`` function definition. Has the same fields as :class:`FunctionDef`.
ast: Визначення функції ``async def``. Має ті самі поля, що й :class:`FunctionDef`.

source: An ``await`` expression. ``value`` is what it waits for. Only valid in the body of an :class:`AsyncFunctionDef`.
ast: Вираз ``очікування``. ``value`` це те, на що він чекає. Дійсний лише в тілі :class:`AsyncFunctionDef`.

source: ``async for`` loops and ``async with`` context managers. They have the same fields as :class:`For` and :class:`With`, respectively. Only valid in the body of an :class:`AsyncFunctionDef`.
ast: ``async for`` цикли ``async with`` контекстні менеджери. Вони мають ті самі поля, що й :class:`For` і :class:`With` відповідно. Дійсний лише в тілі :class:`AsyncFunctionDef`.

source: When a string is parsed by :func:`ast.parse`, operator nodes (subclasses of :class:`ast.operator`, :class:`ast.unaryop`, :class:`ast.cmpop`, :class:`ast.boolop` and :class:`ast.expr_context`) on the returned tree will be singletons. Changes to one will be reflected in all other occurrences of the same value (e.g. :class:`ast.Add`).
ast: Коли рядок аналізується :func:`ast.parse`, вузли оператора (підкласи :class:`ast.operator`, :class:`ast.unaryop`, :class:`ast.cmpop`, :class:`ast.boolop` і :class:`ast.expr_context`) у повернутому дереві будуть одиночними елементами. Зміни в одному буде відображено в усіх інших входженнях того самого значення (наприклад, :class:`ast.Add`).

source: :mod:`ast` Helpers
ast: :mod:`ast` Помічники

source: Apart from the node classes, the :mod:`ast` module defines these utility functions and classes for traversing abstract syntax trees:
ast: Окрім класів вузлів, модуль :mod:`ast` визначає ці службові функції та класи для обходу абстрактних синтаксичних дерев:

source: Parse the source into an AST node. Equivalent to ``compile(source, filename, mode, ast.PyCF_ONLY_AST)``.
ast: Розберіть джерело на вузол AST. Еквівалент ``compile(source, filename, mode, ast.PyCF_ONLY_AST)``.

source: In addition, if ``mode`` is ``'func_type'``, the input syntax is modified to correspond to :pep:`484` "signature type comments", e.g. ``(str, int) -> List[str]``.
ast: Крім того, якщо ``mode`` є ``'func_type'``, синтаксис введення змінюється відповідно до :pep:`484` "коментарів типу підпису", напр. ``(str, int) -> Список[str]``.

source: Note that successfully parsing source code into an AST object doesn't guarantee that the source code provided is valid Python code that can be executed as the compilation step can raise further :exc:`SyntaxError` exceptions. For instance, the source ``return 42`` generates a valid AST node for a return statement, but it cannot be compiled alone (it needs to be inside a function node).
ast: Зауважте, що успішний розбір вихідного коду в об’єкт AST не гарантує, що наданий вихідний код є дійсним кодом Python, який можна виконати, оскільки етап компіляції може викликати подальші винятки :exc:`SyntaxError`. Наприклад, вихідний ``return 42`` генерує дійсний вузол AST для оператора return, але його не можна скомпілювати окремо (він має бути всередині функціонального вузла).

source: In particular, :func:`ast.parse` won't do any scoping checks, which the compilation step does.
ast: Зокрема, :func:`ast.parse` не виконуватиме жодних перевірок обсягу, що робить крок компіляції.

source: It is possible to crash the Python interpreter with a sufficiently large/complex string due to stack depth limitations in Python's AST compiler.
ast: Можливий збій інтерпретатора Python із досить великим/складним рядком через обмеження глибини стеку в компіляторі AST Python.

source: Added ``type_comments``, ``mode='func_type'`` and ``feature_version``.
ast: Додано ``type_comments``, ``mode='func_type'`` і ``feature_version``.

source: Unparse an :class:`ast.AST` object and generate a string with code that would produce an equivalent :class:`ast.AST` object if parsed back with :func:`ast.parse`.
ast: Розберіть об’єкт :class:`ast.AST` і згенеруйте рядок із кодом, який створить еквівалентний об’єкт :class:`ast.AST`, якщо його проаналізувати назад за допомогою :func:`ast.parse`.

source: The produced code string will not necessarily be equal to the original code that generated the :class:`ast.AST` object (without any compiler optimizations, such as constant tuples/frozensets).
ast: Створений рядок коду не обов’язково дорівнюватиме вихідному коду, який згенерував об’єкт :class:`ast.AST` (без будь-яких оптимізацій компілятора, таких як константні кортежі/заморожені набори).

source: Trying to unparse a highly complex expression would result with :exc:`RecursionError`.
ast: Спроба розібрати дуже складний вираз призведе до :exc:`RecursionError`.

source: It can raise :exc:`ValueError`, :exc:`TypeError`, :exc:`SyntaxError`, :exc:`MemoryError` and :exc:`RecursionError` depending on the malformed input.
ast: Він може викликати :exc:`ValueError`, :exc:`TypeError`, :exc:`SyntaxError`, :exc:`MemoryError` і :exc:`RecursionError` залежно від неправильного введення.

source: Now allows bytes and set literals.
ast: Тепер дозволяє байти та встановлені літерали.

source: Now supports creating empty sets with ``'set()'``.
ast: Тепер підтримується створення порожніх наборів за допомогою ``'set()'``.

source: For string inputs, leading spaces and tabs are now stripped.
ast: Для вводу рядків початкові пробіли та табуляції тепер видалені.

source: Return the docstring of the given *node* (which must be a :class:`FunctionDef`, :class:`AsyncFunctionDef`, :class:`ClassDef`, or :class:`Module` node), or ``None`` if it has no docstring. If *clean* is true, clean up the docstring's indentation with :func:`inspect.cleandoc`.
ast: Повертає рядок документації даного *вузла* (який має бути :class:`FunctionDef`, :class:`AsyncFunctionDef`, :class:`ClassDef` або :class:`Module` вузол), або ``None``, якщо він не має рядка документації. Якщо *clean* має значення true, очистіть відступ у рядку документа за допомогою :func:`inspect.cleandoc`.

source: :class:`AsyncFunctionDef` is now supported.
ast: :class:`AsyncFunctionDef` тепер підтримується.

source: If *padded* is ``True``, the first line of a multi-line statement will be padded with spaces to match its original position.
ast: Якщо *paded* має значення ``True``, перший рядок багаторядкового оператора буде доповнено пробілами відповідно до його вихідної позиції.

source: Increment the line number and end line number of each node in the tree starting at *node* by *n*. This is useful to "move code" to a different location in a file.
ast: Збільште номер рядка та номер кінцевого рядка кожного вузла в дереві, починаючи з *вузла*, на *n*. Це корисно для "переміщення коду" в інше місце у файлі.

source: Yield a tuple of ``(fieldname, value)`` for each field in ``node._fields`` that is present on *node*.
ast: Отримайте кортеж ``(fieldname, value)`` для кожного поля ``node._fields``, який присутній на *node*.

source: Yield all direct child nodes of *node*, that is, all fields that are nodes and all items of fields that are lists of nodes.
ast: Видає всі прямі дочірні вузли *node*, тобто всі поля, які є вузлами, і всі елементи полів, які є списками вузлів.

source: Recursively yield all descendant nodes in the tree starting at *node* (including *node* itself), in no specified order. This is useful if you only want to modify nodes in place and don't care about the context.
ast: Рекурсивно створювати всі вузли-нащадки в дереві, починаючи з *node* (включаючи сам *node*), у невизначеному порядку. Це корисно, якщо ви хочете лише змінити вузли на місці й не дбаєте про контекст.

source: A node visitor base class that walks the abstract syntax tree and calls a visitor function for every node found. This function may return a value which is forwarded by the :meth:`visit` method.
ast: Базовий клас відвідувача вузла, який проходить абстрактне синтаксичне дерево та викликає функцію відвідувача для кожного знайденого вузла. Ця функція може повертати значення, яке пересилається методом :meth:`visit`.

source: This class is meant to be subclassed, with the subclass adding visitor methods.
ast: Цей клас призначений для створення підкласу, який додає методи відвідувачів.

source: Visit a node. The default implementation calls the method called :samp:`self.visit_{classname}` where *classname* is the name of the node class, or :meth:`generic_visit` if that method doesn't exist.
ast: Відвідайте вузол. Стандартна реалізація викликає метод під назвою :samp:`self.visit_{classname}`, де *classname* є назвою класу вузла, або :meth:`generic_visit`, якщо цей метод не існує.

source: This visitor calls :meth:`visit` on all children of the node.
ast: Цей відвідувач викликає :meth:`visit` для всіх дітей вузла.

source: Note that child nodes of nodes that have a custom visitor method won't be visited unless the visitor calls :meth:`generic_visit` or visits them itself.
ast: Зауважте, що дочірні вузли вузлів, які мають спеціальний метод відвідувача, не будуть відвідані, якщо відвідувач не викличе :meth:`generic_visit` або відвідає їх сам.

source: Don't use the :class:`NodeVisitor` if you want to apply changes to nodes during traversal. For this a special visitor exists (:class:`NodeTransformer`) that allows modifications.
ast: Не використовуйте :class:`NodeVisitor`, якщо ви хочете застосувати зміни до вузлів під час обходу. Для цього існує спеціальний відвідувач (:class:`NodeTransformer`), який дозволяє вносити зміни.

source: A :class:`NodeVisitor` subclass that walks the abstract syntax tree and allows modification of nodes.
ast: Підклас :class:`NodeVisitor`, який проходить абстрактне синтаксичне дерево та дозволяє модифікувати вузли.

source: The :class:`NodeTransformer` will walk the AST and use the return value of the visitor methods to replace or remove the old node. If the return value of the visitor method is ``None``, the node will be removed from its location, otherwise it is replaced with the return value. The return value may be the original node in which case no replacement takes place.
ast: :class:`NodeTransformer` пройде AST і використає значення, що повертається методами відвідувача, щоб замінити або видалити старий вузол. Якщо значенням, що повертається методом відвідувача, є ``None``, вузол буде видалено зі свого розташування, інакше він замінюється значенням, що повертається. Поверненим значенням може бути вихідний вузол, і в цьому випадку заміна не відбувається.

source: Here is an example transformer that rewrites all occurrences of name lookups (``foo``) to ``data['foo']``::
ast: Ось приклад трансформатора, який переписує всі випадки пошуку імен (``foo``) на ``data['foo']``::
