Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/__future__.po
Languages: ru

source: :mod:`!__future__` --- Future statement definitions
ru: :mod:`!__future__` --- Определения будущих операторов

source: **Source code:** :source:`Lib/__future__.py`
ru: **Исходный код:** :source:`Lib/__future__.py`

source: Imports of the form ``from __future__ import feature`` are called :ref:`future statements <future>`. These are special-cased by the Python compiler to allow the use of new Python features in modules containing the future statement before the release in which the feature becomes standard.
ru: Импорт в форме ``из функции импорта __future__`` называется :ref:`future операторами <future>`. Компилятор Python создает специальные возможности, позволяющие использовать новые функции Python в модулях, содержащих оператор Future, до выпуска, в котором эта функция станет стандартной.

source: While these future statements are given additional special meaning by the Python compiler, they are still executed like any other import statement and the :mod:`__future__` exists and is handled by the import system the same way any other Python module would be. This design serves three purposes:
ru: Хотя компилятор Python придает этим операторам будущего дополнительное особое значение, они по-прежнему выполняются как любой другой оператор импорта, а :mod:`__future__` существует и обрабатывается системой импорта так же, как и любой другой модуль Python. Эта конструкция служит трем целям:

source: To avoid confusing existing tools that analyze import statements and expect to find the modules they're importing.
ru: Чтобы не запутать существующие инструменты, которые анализируют операторы импорта и ожидают найти импортируемые модули.

source: To document when incompatible changes were introduced, and when they will be --- or were --- made mandatory. This is a form of executable documentation, and can be inspected programmatically via importing :mod:`__future__` and examining its contents.
ru: Документировать, когда были внесены несовместимые изменения и когда они будут --- или были --- обязательными. Это форма исполняемой документации, которую можно проверить программно, импортировав :mod:`__future__` и проверив его содержимое.

source: To ensure that :ref:`future statements <future>` run under releases prior to Python 2.1 at least yield runtime exceptions (the import of :mod:`__future__` will fail, because there was no module of that name prior to 2.1).
ru: Чтобы гарантировать, что операторы :ref:`future <future>` выполняются в версиях до Python 2.1, по крайней мере, создают исключения во время выполнения (импорт :mod:`__future__` завершится неудачей, поскольку до версии 2.1 не было модуля с таким именем) .

source: Module Contents
ru: Содержимое модуля

source: No feature description will ever be deleted from :mod:`__future__`. Since its introduction in Python 2.1 the following features have found their way into the language using this mechanism:
ru: Ни одно описание функции никогда не будет удалено из :mod:`__future__`. С момента его появления в Python 2.1 с помощью этого механизма в язык вошли следующие функции:

source: feature
ru: фича

source: optional in
ru: необязательный в

source: mandatory in
ru: обязательный в

source: effect
ru: эффект

source: :pep:`227`: *Statically Nested Scopes*
ru: :pep:`227`: *Статически вложенные области*

source: generators
ru: генераторы

source: :pep:`255`: *Simple Generators*
ru: :pep:`255`: *Простые генераторы*

source: division
ru: деление

source: :pep:`238`: *Changing the Division Operator*
ru: :pep:`238`: *Изменение оператора разделения*

source: :pep:`328`: *Imports: Multi-Line and Absolute/Relative*
ru: :pep:`328`: *Импорт: Многострочный и абсолютный/относительный*

source: :pep:`343`: *The "with" Statement*
ru: :pep:`343`: *Оператор "with"*

source: :pep:`3105`: *Make print a function*
ru: :pep:`3105`: *Сделать печать функцией*

source: :pep:`3112`: *Bytes literals in Python 3000*
ru: :pep:`3112`: *Байтовые литералы в Python 3000*

source: :pep:`479`: *StopIteration handling inside generators*
ru: :pep:`479`: *обработка остановки внутри генераторов*

source: annotations
ru: аннотации

source: :pep:`563`: *Postponed evaluation of annotations*
ru: :pep:`563`: *Отложенная оценка аннотаций*

source: Each statement in :file:`__future__.py` is of the form::
ru: Каждый оператор в :file:`__future__.py` имеет форму::

source: FeatureName = _Feature(OptionalRelease, MandatoryRelease, CompilerFlag)
ru: FeatureName = _Feature(OptionalRelease, MandatoryRelease, Флаг Компилятора)

source: where, normally, *OptionalRelease* is less than *MandatoryRelease*, and both are 5-tuples of the same form as :data:`sys.version_info`::
ru: где обычно *OptionalRelease* меньше, чем *MandatoryRelease*, и оба представляют собой 5-кортежи той же формы, что и :data:`sys.version_info`::

source: *OptionalRelease* records the first release in which the feature was accepted.
ru: *OptionalRelease* записывает первый выпуск, в котором эта функция была принята.

source: In the case of a *MandatoryRelease* that has not yet occurred, *MandatoryRelease* predicts the release in which the feature will become part of the language.
ru: В случае *MandatoryRelease*, который еще не произошел, *MandatoryRelease* прогнозирует выпуск, в котором данная функция станет частью языка.

source: Else *MandatoryRelease* records when the feature became part of the language; in releases at or after that, modules no longer need a future statement to use the feature in question, but may continue to use such imports.
ru: В противном случае *MandatoryRelease* записывает, когда функция стала частью языка; в выпусках после этого модулям больше не требуется оператор будущего для использования рассматриваемой функции, но они могут продолжать использовать такой импорт.

source: *MandatoryRelease* may also be ``None``, meaning that a planned feature got dropped or that it is not yet decided.
ru: *MandatoryRelease* также может иметь значение None, что означает, что запланированная функция была удалена или еще не решена.

source: *CompilerFlag* is the (bitfield) flag that should be passed in the fourth argument to the built-in function :func:`compile` to enable the feature in dynamically compiled code. This flag is stored in the :attr:`_Feature.compiler_flag` attribute on :class:`_Feature` instances.
ru: *CompilerFlag* — это флаг (битовое поле), который следует передать в четвертом аргументе встроенной функции :func:`compile`, чтобы включить эту функцию в динамически скомпилированном коде. Этот флаг хранится в атрибуте :attr:`_Feature.compiler_flag` в экземплярах :class:`_Feature`.

source: ``from __future__ import annotations`` was previously scheduled to become mandatory in Python 3.10, but the Python Steering Council twice decided to delay the change (`announcement for Python 3.10 <https://mail.python.org/archives/list/python-dev@python.org/message/CLVXXPQ2T2LQ5MP2Y53VVQFCXYWQJHKZ/>`__; `announcement for Python 3.11 <https://mail.python.org/archives/list/python-dev@python.org/message/VIZEBX5EYMSYIJNDBF6DMUMZOCWHARSO/>`__). No final decision has been made yet. See also :pep:`563` and :pep:`649`.
ru: Ранее планировалось, что аннотации импорта from __future__ станут обязательными в Python 3.10, но Руководящий совет Python дважды решил отложить это изменение («объявление для Python 3.10 <https://mail.python.org/archives/list/ python-dev@python.org/message/CLVXXPQ2T2LQ5MP2Y53VVQFCXYWQJHKZ/>`__ `объявление о Python 3.11 <https://mail.python.org/archives/list/python-dev@python.org/message/VIZEBX5EYMSYIJNDBF6DMUMZOCWHARSO/>` __). Окончательное решение еще не принято. См. также :pep:`563` и :pep:`649`.

source: How the compiler treats future imports.
ru: Как компилятор обрабатывает будущий импорт.

source: :pep:`236` - Back to the __future__
ru: :pep:`236` - Назад в __будущее__

source: The original proposal for the __future__ mechanism.
ru: Исходное предложение механизма __future__.
