Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/__main__.po
Languages: ru

source: :mod:`!__main__` --- Top-level code environment
ru: :mod:`!__main__` --- Среда кода верхнего уровня

source: In Python, the special name ``__main__`` is used for two important constructs:
ru: В Python специальное имя __main__ используется для двух важных конструкций:

source: the name of the top-level environment of the program, which can be checked using the ``__name__ == '__main__'`` expression; and
ru: имя среды верхнего уровня программы, которое можно проверить с помощью выражения ``__name__ == '__main__'``; и

source: the ``__main__.py`` file in Python packages.
ru: файл ``__main__.py`` в пакетах Python.

source: Both of these mechanisms are related to Python modules; how users interact with them and how they interact with each other. They are explained in detail below. If you're new to Python modules, see the tutorial section :ref:`tut-modules` for an introduction.
ru: Оба эти механизма связаны с модулями Python; как пользователи взаимодействуют с ними и как они взаимодействуют друг с другом. Они подробно описаны ниже. Если вы новичок в модулях Python, ознакомьтесь с разделом учебника :ref:`tut-modules` для ознакомления.

source: When a Python module or package is imported, ``__name__`` is set to the module's name. Usually, this is the name of the Python file itself without the ``.py`` extension::
ru: Когда импортируется модуль или пакет Python, ``__name__`` устанавливается как имя модуля. Обычно это имя самого файла Python без расширения .py:

source: If the file is part of a package, ``__name__`` will also include the parent package's path::
ru: Если файл является частью пакета, ``__name__`` также будет включать путь родительского пакета::

source: However, if the module is executed in the top-level code environment, its ``__name__`` is set to the string ``'__main__'``.
ru: Однако, если модуль выполняется в среде кода верхнего уровня, его ``__name__`` устанавливается в строку ``'__main__'``.

source: What is the "top-level code environment"?
ru: Что такое «среда кода верхнего уровня»?

source: ``__main__`` is the name of the environment where top-level code is run. "Top-level code" is the first user-specified Python module that starts running. It's "top-level" because it imports all other modules that the program needs. Sometimes "top-level code" is called an *entry point* to the application.
ru: ``__main__`` — это имя среды, в которой выполняется код верхнего уровня. «Код верхнего уровня» — это первый указанный пользователем модуль Python, который начинает работать. Это «верхний уровень», поскольку он импортирует все остальные модули, необходимые программе. Иногда «код верхнего уровня» называют *точкой входа* в приложение.

source: The top-level code environment can be:
ru: Среда кода верхнего уровня может быть:

source: the scope of an interactive prompt::
ru: объем интерактивной подсказки::

source: the Python module passed to the Python interpreter as a file argument:
ru: модуль Python передается интерпретатору Python в качестве аргумента файла:

source: the Python module or package passed to the Python interpreter with the :option:`-m` argument:
ru: модуль или пакет Python, передаваемый интерпретатору Python с аргументом :option:`-m`:

source: Python code read by the Python interpreter from standard input:
ru: Код Python, считываемый интерпретатором Python со стандартного ввода:

source: Python code passed to the Python interpreter with the :option:`-c` argument:
ru: Код Python передается интерпретатору Python с аргументом :option:`-c`:

source: In each of these situations, the top-level module's ``__name__`` is set to ``'__main__'``.
ru: В каждой из этих ситуаций ``__name__`` модуля верхнего уровня устанавливается в ``'__main__'``.

source: As a result, a module can discover whether or not it is running in the top-level environment by checking its own ``__name__``, which allows a common idiom for conditionally executing code when the module is not initialized from an import statement::
ru: В результате модуль может определить, работает ли он в среде верхнего уровня, проверив свое собственное ``__name__``, что позволяет использовать общепринятую идиому для условного выполнения кода, когда модуль не инициализируется из оператора импорта: :

source: For a more detailed look at how ``__name__`` is set in all situations, see the tutorial section :ref:`tut-modules`.
ru: Для более подробного ознакомления с тем, как устанавливается ``__name__`` во всех ситуациях, см. раздел руководства :ref:`tut-modules`.

source: Idiomatic Usage
ru: Идиоматическое использование

source: Some modules contain code that is intended for script use only, like parsing command-line arguments or fetching data from standard input. If a module like this was imported from a different module, for example to unit test it, the script code would unintentionally execute as well.
ru: Некоторые модули содержат код, предназначенный только для использования в сценариях, например анализ аргументов командной строки или получение данных из стандартного ввода. Если такой модуль был импортирован из другого модуля, например, для его модульного тестирования, код сценария также будет непреднамеренно выполнен.

source: This is where using the ``if __name__ == '__main__'`` code block comes in handy. Code within this block won't run unless the module is executed in the top-level environment.
ru: Вот тут-то и пригодится блок кода ``if __name__ == '__main__'``. Код внутри этого блока не будет выполняться, если модуль не будет выполнен в среде верхнего уровня.

source: Putting as few statements as possible in the block below ``if __name__ == '__main__'`` can improve code clarity and correctness. Most often, a function named ``main`` encapsulates the program's primary behavior::
ru: Размещение как можно меньшего количества операторов в блоке ниже ``if __name__ == '__main__'`` может улучшить ясность и правильность кода. Чаще всего функция с именем main инкапсулирует основное поведение программы:

source: Note that if the module didn't encapsulate code inside the ``main`` function but instead put it directly within the ``if __name__ == '__main__'`` block, the ``phrase`` variable would be global to the entire module. This is error-prone as other functions within the module could be unintentionally using the global variable instead of a local name. A ``main`` function solves this problem.
ru: Обратите внимание: если модуль не инкапсулировал код внутри функции main, а вместо этого поместил его непосредственно в блок if __name__ == '__main__'`, переменная ``phrase`` была бы глобальной для весь модуль. Это чревато ошибками, поскольку другие функции внутри модуля могут непреднамеренно использовать глобальную переменную вместо локального имени. Функция main решает эту проблему.

source: Using a ``main`` function has the added benefit of the ``echo`` function itself being isolated and importable elsewhere. When ``echo.py`` is imported, the ``echo`` and ``main`` functions will be defined, but neither of them will be called, because ``__name__ != '__main__'``.
ru: Использование функции main имеет дополнительное преимущество, заключающееся в том, что сама функция echo изолирована и может быть импортирована в другое место. При импорте ``echo.py`` функции ``echo`` и ``main`` будут определены, но ни одна из них не будет вызвана, потому что ``__name__ != '__main__'``.

source: Packaging Considerations
ru: Рекомендации по упаковке

source: ``main`` functions are often used to create command-line tools by specifying them as entry points for console scripts. When this is done, `pip <https://pip.pypa.io/>`_ inserts the function call into a template script, where the return value of ``main`` is passed into :func:`sys.exit`. For example::
ru: Функции ``main`` часто используются для создания инструментов командной строки, определяя их в качестве точек входа для консольных сценариев. Когда это будет сделано, ``pip <https://pip.pypa.io/>`_ вставит вызов функции в шаблонный скрипт, где возвращаемое значение ``main`` передается в :func:`sys.exit. `. Например::

source: Since the call to ``main`` is wrapped in :func:`sys.exit`, the expectation is that your function will return some value acceptable as an input to :func:`sys.exit`; typically, an integer or ``None`` (which is implicitly returned if your function does not have a return statement).
ru: Поскольку вызов main заключен в :func:`sys.exit`, ожидается, что ваша функция вернет некоторое значение, приемлемое в качестве входных данных для :func:`sys.exit`; обычно это целое число или None (которое неявно возвращается, если ваша функция не имеет оператора return).

source: By proactively following this convention ourselves, our module will have the same behavior when run directly (i.e. ``python echo.py``) as it will have if we later package it as a console script entry-point in a pip-installable package.
ru: Если мы сами активно следуем этому соглашению, наш модуль будет иметь такое же поведение при непосредственном запуске (т. е. ``python echo.py``), как если бы мы позже упаковали его как точку входа консольного сценария в пакет, устанавливаемый с помощью pip. .

source: In particular, be careful about returning strings from your ``main`` function. :func:`sys.exit` will interpret a string argument as a failure message, so your program will have an exit code of ``1``, indicating failure, and the string will be written to :data:`sys.stderr`. The ``echo.py`` example from earlier exemplifies using the ``sys.exit(main())`` convention.
ru: В частности, будьте осторожны с возвратом строк из функции main. :func:`sys.exit` интерпретирует строковый аргумент как сообщение об ошибке, поэтому ваша программа будет иметь код выхода ``1``, указывающий на ошибку, и строка будет записана в :data:`sys.stderr. `. Приведенный ранее пример ``echo.py`` иллюстрирует использование соглашения ``sys.exit(main())``.

source: `Python Packaging User Guide <https://packaging.python.org/>`_ contains a collection of tutorials and references on how to distribute and install Python packages with modern tools.
ru: `Руководство пользователя по упаковке Python <https://packaging.python.org/>`_ содержит коллекцию учебных пособий и справок о том, как распространять и устанавливать пакеты Python с помощью современных инструментов.

source: ``__main__.py`` in Python Packages
ru: ``__main__.py`` в пакетах Python

source: If you are not familiar with Python packages, see section :ref:`tut-packages` of the tutorial. Most commonly, the ``__main__.py`` file is used to provide a command-line interface for a package. Consider the following hypothetical package, "bandclass":
ru: Если вы не знакомы с пакетами Python, см. раздел :ref:`tut-packages` руководства. Чаще всего файл ``__main__.py`` используется для предоставления интерфейса командной строки для пакета. Рассмотрим следующий гипотетический пакет «bandclass»:

source: ``__main__.py`` will be executed when the package itself is invoked directly from the command line using the :option:`-m` flag. For example:
ru: ``__main__.py`` будет выполняться, когда сам пакет вызывается непосредственно из командной строки с использованием флага :option:`-m`. Например:

source: This command will cause ``__main__.py`` to run. How you utilize this mechanism will depend on the nature of the package you are writing, but in this hypothetical case, it might make sense to allow the teacher to search for students::
ru: Эта команда запустит ``__main__.py``. То, как вы будете использовать этот механизм, будет зависеть от характера пакета, который вы пишете, но в этом гипотетическом случае может иметь смысл разрешить преподавателю искать учеников:

source: Note that ``from .student import search_students`` is an example of a relative import. This import style can be used when referencing modules within a package. For more details, see :ref:`intra-package-references` in the :ref:`tut-modules` section of the tutorial.
ru: Обратите внимание, что ``from .student import search_students`` является примером относительного импорта. Этот стиль импорта можно использовать при ссылке на модули внутри пакета. Более подробную информацию см. в разделе :ref:`intra-package-references` в разделе :ref:`tut-modules` руководства.

source: The content of ``__main__.py`` typically isn't fenced with an ``if __name__ == '__main__'`` block. Instead, those files are kept short and import functions to execute from other modules. Those other modules can then be easily unit-tested and are properly reusable.
ru: Содержимое ``__main__.py`` обычно не ограждено блоком ``if __name__ == '__main__'``. Вместо этого эти файлы сохраняются короткими и импортируют функции для выполнения из других модулей. Эти другие модули затем можно легко протестировать и повторно использовать.

source: If used, an ``if __name__ == '__main__'`` block will still work as expected for a ``__main__.py`` file within a package, because its ``__name__`` attribute will include the package's path if imported::
ru: Если он используется, блок ``if __name__ == '__main__'`` по-прежнему будет работать должным образом для файла ``__main__.py`` внутри пакета, поскольку его атрибут ``__name__`` будет включать путь к пакету, если он импортирован. ::

source: This won't work for ``__main__.py`` files in the root directory of a ``.zip`` file though. Hence, for consistency, a minimal ``__main__.py`` without a ``__name__`` check is preferred.
ru: Однако это не будет работать для файлов ``__main__.py`` в корневом каталоге файла ``.zip``. Следовательно, для обеспечения согласованности предпочтителен минимальный файл ``__main__.py`` без проверки ``__name__``.

source: See :mod:`venv` for an example of a package with a minimal ``__main__.py`` in the standard library. It doesn't contain a ``if __name__ == '__main__'`` block. You can invoke it with ``python -m venv [directory]``.
ru: См. :mod:`venv` для примера пакета с минимальным ``__main__.py`` в стандартной библиотеке. Он не содержит блок if __name__ == '__main__'``. Вы можете вызвать его с помощью ``python -m venv [directory]``.

source: See :mod:`runpy` for more details on the :option:`-m` flag to the interpreter executable.
ru: См. :mod:`runpy` для получения более подробной информации о флаге :option:`-m` для исполняемого файла интерпретатора.

source: See :mod:`zipapp` for how to run applications packaged as *.zip* files. In this case Python looks for a ``__main__.py`` file in the root directory of the archive.
ru: См. :mod:`zipapp`, чтобы узнать, как запускать приложения, упакованные в файлы *.zip*. В этом случае Python ищет файл ``__main__.py`` в корневом каталоге архива.

source: Regardless of which module a Python program was started with, other modules running within that same program can import the top-level environment's scope (:term:`namespace`) by importing the ``__main__`` module. This doesn't import a ``__main__.py`` file but rather whichever module that received the special name ``'__main__'``.
ru: Независимо от того, с каким модулем была запущена программа Python, другие модули, работающие в этой же программе, могут импортировать область действия среды верхнего уровня (:term:`namespace`), импортировав модуль ``__main__``. При этом импортируется не файл ``__main__.py``, а любой модуль, получивший специальное имя ``'__main__'``.

source: Here is an example module that consumes the ``__main__`` namespace::
ru: Вот пример модуля, который использует пространство имен ``__main__``:

source: Example usage of this module could be as follows::
ru: Пример использования этого модуля может быть следующим:

source: Now, if we started our program, the result would look like this:
ru: Теперь, если бы мы запустили нашу программу, результат выглядел бы так:

source: The exit code of the program would be 1, indicating an error. Uncommenting the line with ``my_name = "Dinsdale"`` fixes the program and now it exits with status code 0, indicating success:
ru: Код выхода программы будет 1, что указывает на ошибку. Раскомментирование строки с ``my_name = "Dinsdale"`` исправляет программу, и теперь она завершает работу с кодом состояния 0, что указывает на успех:

source: Note that importing ``__main__`` doesn't cause any issues with unintentionally running top-level code meant for script use which is put in the ``if __name__ == "__main__"`` block of the ``start`` module. Why does this work?
ru: Обратите внимание, что импорт ``__main__`` не вызывает проблем с непреднамеренным запуском кода верхнего уровня, предназначенного для использования скриптом, который помещается в блок ``if __name__ == "__main__"`` модуля ``start``. . Почему это работает?

source: Python inserts an empty ``__main__`` module in :data:`sys.modules` at interpreter startup, and populates it by running top-level code. In our example this is the ``start`` module which runs line by line and imports ``namely``. In turn, ``namely`` imports ``__main__`` (which is really ``start``). That's an import cycle! Fortunately, since the partially populated ``__main__`` module is present in :data:`sys.modules`, Python passes that to ``namely``. See :ref:`Special considerations for __main__ <import-dunder-main>` in the import system's reference for details on how this works.
ru: Python вставляет пустой модуль ``__main__`` в :data:`sys.modules` при запуске интерпретатора и заполняет его, запуская код верхнего уровня. В нашем примере это модуль «start», который выполняется построчно и импортирует «а именно». В свою очередь, ``namely`` импортирует ``__main__`` (который на самом деле является ``start``). Это цикл импорта! К счастью, поскольку частично заполненный модуль ``__main__`` присутствует в :data:`sys.modules`, Python передает его ``namely``. Подробную информацию о том, как это работает, см. в разделе :ref:`Особые особенности __main__ <import-dunder-main>` в справочнике по системе импорта.

source: The Python REPL is another example of a "top-level environment", so anything defined in the REPL becomes part of the ``__main__`` scope::
ru: Python REPL — это еще один пример «среды верхнего уровня», поэтому все, что определено в REPL, становится частью области видимости ``__main__``::

source: Note that in this case the ``__main__`` scope doesn't contain a ``__file__`` attribute as it's interactive.
ru: Обратите внимание, что в этом случае область действия ``__main__`` не содержит атрибута ``__file__``, поскольку она интерактивна.

source: The ``__main__`` scope is used in the implementation of :mod:`pdb` and :mod:`rlcompleter`.
ru: Область ``__main__`` используется в реализации :mod:`pdb` и :mod:`rlcompleter`.
