Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/aifc.po
Languages: es_es

source: :mod:`aifc` --- Read and write AIFF and AIFC files
es_es: :mod:`aifc` --- Leer y escribir archivos AIFF y AIFC

source: **Source code:** :source:`Lib/aifc.py`
es_es: **Código fuente:** :source:`Lib/aifc.py`

source: The :mod:`aifc` module is deprecated (see :pep:`PEP 594 <594#aifc>` for details).
es_es: El módulo :mod:`aifc` está obsoleto (ver :pep:`PEP 594 <594#aifc>` para más detalles).

source: This module provides support for reading and writing AIFF and AIFF-C files. AIFF is Audio Interchange File Format, a format for storing digital audio samples in a file. AIFF-C is a newer version of the format that includes the ability to compress the audio data.
es_es: Este módulo permite leer y escribir archivos AIFF y AIFF-C. AIFF es Audio Interchange File Format, un formato para almacenar muestras de audio digital en un archivo. AIFF-C es una versión más reciente del formato que incluye la capacidad de comprimir los datos de audio.

source: Audio files have a number of parameters that describe the audio data. The sampling rate or frame rate is the number of times per second the sound is sampled. The number of channels indicate if the audio is mono, stereo, or quadro. Each frame consists of one sample per channel. The sample size is the size in bytes of each sample. Thus a frame consists of ``nchannels * samplesize`` bytes, and a second's worth of audio consists of ``nchannels * samplesize * framerate`` bytes.
es_es: Los archivos de audio tienen una serie de parámetros que describen los datos de audio. La frecuencia de muestreo o frecuencia de imagen es el número de veces por segundo que se muestrea el sonido. El número de canales indica si el audio es mono, estéreo o cuádruple. Cada trama consta de una muestra por canal. El tamaño de la muestra es el tamaño en bytes de cada muestra. Así, un fotograma consta de ``nchannels * samplesize`` bytes, y un segundo de audio consta de ``nchannels * samplesize * framerate`` bytes.

source: For example, CD quality audio has a sample size of two bytes (16 bits), uses two channels (stereo) and has a frame rate of 44,100 frames/second. This gives a frame size of 4 bytes (2\*2), and a second's worth occupies 2\*2\*44100 bytes (176,400 bytes).
es_es: Por ejemplo, el audio de calidad CD tiene un tamaño de muestra de dos bytes (16 bits), utiliza dos canales (estéreo) y tiene una frecuencia de 44.100 fotogramas/segundo. Esto da un tamaño de fotograma de 4 bytes (2\*2), y un segundo ocupa 2\*2\*44100 bytes (176.400 bytes).

source: Module :mod:`aifc` defines the following function:
es_es: El módulo :mod:`aifc` define la siguiente función:

source: Open an AIFF or AIFF-C file and return an object instance with methods that are described below. The argument *file* is either a string naming a file or a :term:`file object`. *mode* must be ``'r'`` or ``'rb'`` when the file must be opened for reading, or ``'w'`` or ``'wb'`` when the file must be opened for writing. If omitted, ``file.mode`` is used if it exists, otherwise ``'rb'`` is used. When used for writing, the file object should be seekable, unless you know ahead of time how many samples you are going to write in total and use :meth:`writeframesraw` and :meth:`setnframes`. The :func:`.open` function may be used in a :keyword:`with` statement. When the :keyword:`!with` block completes, the :meth:`~aifc.close` method is called.
es_es: Abre un archivo AIFF o AIFF-C y devuelve una instancia de objeto con los métodos que se describen a continuación. El argumento *file* es una cadena que nombra un fichero o un :term:`file object`. *mode* debe ser ``'r'`` o ``'rb'`` cuando el archivo debe abrirse para lectura, o ``'w'`` o ``'wb'`` cuando el archivo debe abrirse para escritura. Si se omite, se utiliza ``file.mode`` si existe; en caso contrario, se utiliza ``'rb'``. Cuando se utiliza para escribir, el objeto de archivo debe ser buscable, a menos que sepa de antemano cuántas muestras va a escribir en total y utilice :meth:`writeframesraw` y :meth:`setnframes`. La función :func:`.open` puede utilizarse en una sentencia :keyword:`with`. Cuando finaliza el bloque :keyword:`!with`, se llama al método :meth:`~aifc.close`.

source: Support for the :keyword:`with` statement was added.
es_es: Se ha añadido soporte para la declaración :keyword:`with`.

source: Objects returned by :func:`.open` when a file is opened for reading have the following methods:
es_es: Los objetos devueltos por :func:`.open` cuando se abre un archivo para su lectura tienen los siguientes métodos:

source: Return the number of audio channels (1 for mono, 2 for stereo).
es_es: Devuelve el número de canales de audio (1 para mono, 2 para estéreo).

source: Return the size in bytes of individual samples.
es_es: Devuelve el tamaño en bytes de las muestras individuales.

source: Return the sampling rate (number of audio frames per second).
es_es: Devuelve la frecuencia de muestreo (número de fotogramas de audio por segundo).

source: Return the number of audio frames in the file.
es_es: Devuelve el número de fotogramas de audio del archivo.

source: Return a bytes array of length 4 describing the type of compression used in the audio file. For AIFF files, the returned value is ``b'NONE'``.
es_es: Devuelve una matriz de bytes de longitud 4 que describe el tipo de compresión utilizado en el archivo de audio. Para archivos AIFF, el valor devuelto es ``b'NONE'``.

source: Return a bytes array convertible to a human-readable description of the type of compression used in the audio file. For AIFF files, the returned value is ``b'not compressed'``.
es_es: Devuelve una matriz de bytes convertible en una descripción legible por humanos del tipo de compresión utilizado en el archivo de audio. Para los archivos AIFF, el valor devuelto es ``b'not compressed'``.

source: Returns a :func:`~collections.namedtuple` ``(nchannels, sampwidth, framerate, nframes, comptype, compname)``, equivalent to output of the :meth:`get\*` methods.
es_es: Devuelve un :func:`~collections.namedtuple` ``(nchannels, sampwidth, framerate, nframes, comptype, compname)`` , equivalente a la salida de los métodos :meth:`get\*`.

source: Return a list of markers in the audio file. A marker consists of a tuple of three elements. The first is the mark ID (an integer), the second is the mark position in frames from the beginning of the data (an integer), the third is the name of the mark (a string).
es_es: Devuelve una lista de marcadores en el archivo de audio. Un marcador consiste en una tupla de tres elementos. El primero es el ID de la marca (un entero), el segundo es la posición de la marca en fotogramas desde el inicio de los datos (un entero), el tercero es el nombre de la marca (una cadena).

source: Return the tuple as described in :meth:`getmarkers` for the mark with the given *id*.
es_es: Devuelve la tupla descrita en :meth:`getmarkers` para la marca con el *id* dado.

source: Read and return the next *nframes* frames from the audio file. The returned data is a string containing for each frame the uncompressed samples of all channels.
es_es: Lee y devuelve los siguientes *nframes* fotogramas del archivo de audio. Los datos devueltos son una cadena que contiene para cada fotograma las muestras sin comprimir de todos los canales.

source: Rewind the read pointer. The next :meth:`readframes` will start from the beginning.
es_es: Rebobine el puntero de lectura. El siguiente :meth:`readframes` empezará desde el principio.

source: Seek to the specified frame number.
es_es: Busca el número de fotograma especificado.

source: Return the current frame number.
es_es: Devuelve el número de fotograma actual.

source: Close the AIFF file. After calling this method, the object can no longer be used.
es_es: Cierra el archivo AIFF. Después de llamar a este método, el objeto ya no se puede utilizar.

source: Objects returned by :func:`.open` when a file is opened for writing have all the above methods, except for :meth:`readframes` and :meth:`setpos`. In addition the following methods exist. The :meth:`get\*` methods can only be called after the corresponding :meth:`set\*` methods have been called. Before the first :meth:`writeframes` or :meth:`writeframesraw`, all parameters except for the number of frames must be filled in.
es_es: Los objetos devueltos por :func:`.open` cuando se abre un archivo para escritura tienen todos los métodos anteriores, excepto :meth:`readframes` y :meth:`setpos`. Además, existen los siguientes métodos. Los métodos :meth:`get\*` sólo pueden llamarse después de haber llamado a los métodos :meth:`set\*` correspondientes. Antes de la primera :meth:`writeframes` o :meth:`writeframesraw`, deben rellenarse todos los parámetros excepto el número de fotogramas.

source: Create an AIFF file. The default is that an AIFF-C file is created, unless the name of the file ends in ``'.aiff'`` in which case the default is an AIFF file.
es_es: Crear un archivo AIFF. Por defecto, se crea un archivo AIFF-C, a menos que el nombre del archivo termine en ``'.aiff'``, en cuyo caso el valor predeterminado es un archivo AIFF.

source: Create an AIFF-C file. The default is that an AIFF-C file is created, unless the name of the file ends in ``'.aiff'`` in which case the default is an AIFF file.
es_es: Crear un archivo AIFF-C. Por defecto se crea un archivo AIFF-C, a menos que el nombre del archivo termine en ``'.aiff'`` en cuyo caso el valor por defecto es un archivo AIFF.

source: Specify the number of channels in the audio file.
es_es: Especifica el número de canales del archivo de audio.

source: Specify the size in bytes of audio samples.
es_es: Especifica el tamaño en bytes de las muestras de audio.

source: Specify the sampling frequency in frames per second.
es_es: Especifique la frecuencia de muestreo en fotogramas por segundo.

source: Specify the number of frames that are to be written to the audio file. If this parameter is not set, or not set correctly, the file needs to support seeking.
es_es: Especifica el número de fotogramas que deben escribirse en el archivo de audio. Si este parámetro no está definido, o no está definido correctamente, el archivo debe admitir la búsqueda.

source: Specify the compression type. If not specified, the audio data will not be compressed. In AIFF files, compression is not possible. The name parameter should be a human-readable description of the compression type as a bytes array, the type parameter should be a bytes array of length 4. Currently the following compression types are supported: ``b'NONE'``, ``b'ULAW'``, ``b'ALAW'``, ``b'G722'``.
es_es: Especifica el tipo de compresión. Si no se especifica, los datos de audio no se comprimirán. En los archivos AIFF, la compresión no es posible. El parámetro name debe ser una descripción legible del tipo de compresión como matriz de bytes, el parámetro type debe ser una matriz de bytes de longitud 4. Actualmente se admiten los siguientes tipos de compresión: ``b'NONE'``, ``b'ULAW'``, ``b'ALAW'``, ``b'G722'``.

source: Set all the above parameters at once. The argument is a tuple consisting of the various parameters. This means that it is possible to use the result of a :meth:`getparams` call as argument to :meth:`setparams`.
es_es: Establece todos los parámetros anteriores a la vez. El argumento es una tupla formada por los distintos parámetros. Esto significa que es posible utilizar el resultado de una llamada a :meth:`getparams` como argumento de :meth:`setparams`.

source: Add a mark with the given id (larger than 0), and the given name at the given position. This method can be called at any time before :meth:`close`.
es_es: Añade una marca con el id dado (mayor que 0), y el nombre dado en la posición dada. Este método puede invocarse en cualquier momento antes de :meth:`close`.

source: Return the current write position in the output file. Useful in combination with :meth:`setmark`.
es_es: Devuelve la posición de escritura actual en el archivo de salida. Útil en combinación con :meth:`setmark`.

source: Write data to the output file. This method can only be called after the audio file parameters have been set.
es_es: Escribe datos en el archivo de salida. Este método sólo puede invocarse después de haber configurado los parámetros del archivo de audio.

source: Any :term:`bytes-like object` is now accepted.
es_es: Ahora se acepta cualquier :term:`bytes-like object`.

source: Like :meth:`writeframes`, except that the header of the audio file is not updated.
es_es: Como :meth:`writeframes`, salvo que la cabecera del archivo de audio no se actualiza.

source: Close the AIFF file. The header of the file is updated to reflect the actual size of the audio data. After calling this method, the object can no longer be used.
es_es: Cierre el archivo AIFF. La cabecera del archivo se actualiza para reflejar el tamaño real de los datos de audio. Después de llamar a este método, el objeto ya no se puede utilizar.

source: Audio Interchange File Format
es_es: Formato de archivo de intercambio de audio
