Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/asyncio-task.po
Languages: ru, uk

source: Coroutines and Tasks
ru: Сопрограммы и задачи
uk: Співпрограми та завдання

source: This section outlines high-level asyncio APIs to work with coroutines and Tasks.
ru: В этом разделе описываются высокоуровневые API-интерфейсы asyncio для работы с сопрограммами и задачами.
uk: У цьому розділі описано асинхронні API високого рівня для роботи з співпрограмами та завданнями.

source: Coroutines
ru: Сопрограммы
uk: Співпрограми

source: **Source code:** :source:`Lib/asyncio/coroutines.py`
ru: **Исходный код:** :source:`Lib/asyncio/coroutines.py`

source: :term:`Coroutines <coroutine>` declared with the async/await syntax is the preferred way of writing asyncio applications. For example, the following snippet of code prints "hello", waits 1 second, and then prints "world"::
ru: :term:`Сопрограммы <coroutine>`, объявленные с синтаксисом async/await, являются предпочтительным способом написания асинхронных приложений. Например, следующий фрагмент кода печатает «привет», ждет 1 секунду, а затем печатает «мир»::
uk: :term:`Coroutines <coroutine>`, оголошений із синтаксисом async/await, є кращим способом написання асинхронних програм. Наприклад, наступний фрагмент коду друкує "hello", чекає 1 секунду, а потім друкує "world"::

source: Note that simply calling a coroutine will not schedule it to be executed::
ru: Обратите внимание, что простой вызов сопрограммы не запланирует ее выполнение::
uk: Зауважте, що простий виклик співпрограми не запланує її виконання:

source: To actually run a coroutine, asyncio provides the following mechanisms:
ru: Для фактического запуска сопрограммы asyncio предоставляет следующие механизмы:

source: The :func:`asyncio.run` function to run the top-level entry point "main()" function (see the above example.)
ru: Функция :func:`asyncio.run` для запуска функции main() точки входа верхнего уровня (см. пример выше).
uk: Функція :func:`asyncio.run` для запуску функції точки входу верхнього рівня "main()" (див. приклад вище).

source: Awaiting on a coroutine. The following snippet of code will print "hello" after waiting for 1 second, and then print "world" after waiting for *another* 2 seconds::
ru: Ожидание сопрограммы. Следующий фрагмент кода выведет «hello» после ожидания в течение 1 секунды, а затем выведет «world» после ожидания *еще* 2 секунд::
uk: Очікування співпрограми. Наступний фрагмент коду надрукує "привіт" після очікування 1 секунду, а потім надрукує "світ" після очікування *ще* 2 секунди::

source: Expected output::
ru: Ожидаемый результат::
uk: Очікуваний результат::

source: The :func:`asyncio.create_task` function to run coroutines concurrently as asyncio :class:`Tasks <Task>`.
ru: Функция :func:`asyncio.create_task` для одновременного запуска сопрограмм как asyncio :class:`Tasks <Task>`.
uk: Функція :func:`asyncio.create_task` для одночасного запуску співпрограм як asyncio :class:`Tasks <Task>`.

source: Let's modify the above example and run two ``say_after`` coroutines *concurrently*::
ru: Давайте изменим приведенный выше пример и запустим две сопрограммы Say_after *параллельно*::
uk: Давайте змінимо наведений вище приклад і запустимо дві співпрограми ``say_after`` *одночасно*::

source: Note that expected output now shows that the snippet runs 1 second faster than before::
ru: Обратите внимание, что ожидаемый результат теперь показывает, что фрагмент выполняется на 1 секунду быстрее, чем раньше:
uk: Зауважте, що очікуваний вихід тепер показує, що фрагмент працює на 1 секунду швидше, ніж раніше:

source: The :class:`asyncio.TaskGroup` class provides a more modern alternative to :func:`create_task`. Using this API, the last example becomes::
ru: Класс :class:`asyncio.TaskGroup` предоставляет более современную альтернативу :func:`create_task`. Используя этот API, последний пример становится::

source: The timing and output should be the same as for the previous version.
ru: Время и результат должны быть такими же, как и в предыдущей версии.

source: Awaitables
ru: Ожидаемые события
uk: очікування

source: We say that an object is an **awaitable** object if it can be used in an :keyword:`await` expression. Many asyncio APIs are designed to accept awaitables.
ru: Мы говорим, что объект является **ожидаемым** объектом, если его можно использовать в выражении :keyword:`await`. Многие API-интерфейсы asyncio предназначены для приема ожидаемых данных.
uk: Ми кажемо, що об’єкт є **очікуваним** об’єктом, якщо його можна використовувати у виразі :keyword:`await`. Багато асинхронних API розроблено для прийняття очікуваних.

source: There are three main types of *awaitable* objects: **coroutines**, **Tasks**, and **Futures**.
ru: Существует три основных типа *ожидаемых* объектов: **сопрограммы**, **Задачи** и **Фьючерсы**.
uk: Існує три основних типи *очікуваних* об’єктів: **співпрограми**, **Завдання** та **Ф’ючерси**.

source: Python coroutines are *awaitables* and therefore can be awaited from other coroutines::
ru: Сопрограммы Python являются *ожидаемыми* и поэтому их можно ожидать от других сопрограмм::
uk: Співпрограми Python є *очікуваними*, тому їх можна очікувати від інших співпрограм:

source: In this documentation the term "coroutine" can be used for two closely related concepts:
ru: В этой документации термин «сопрограмма» может использоваться для двух тесно связанных понятий:
uk: У цій документації термін "співпрограма" може використовуватися для двох тісно пов’язаних понять:

source: a *coroutine function*: an :keyword:`async def` function;
ru: *функция сопрограммы*: функция :keyword:`async def`;
uk: *співпрограма*: функція :keyword:`async def`;

source: a *coroutine object*: an object returned by calling a *coroutine function*.
ru: *объект сопрограммы*: объект, возвращаемый вызовом *функции сопрограммы*.
uk: *об’єкт співпрограми*: об’єкт, повернутий викликом *функції співпрограми*.

source: Tasks
ru: Задачи
uk: завдання

source: *Tasks* are used to schedule coroutines *concurrently*.
ru: *Задачи* используются для планирования сопрограмм *одновременно*.
uk: *Завдання* використовуються для *одночасного* планування співпрограм.

source: When a coroutine is wrapped into a *Task* with functions like :func:`asyncio.create_task` the coroutine is automatically scheduled to run soon::
ru: Когда сопрограмма заключена в *Task* с такими функциями, как :func:`asyncio.create_task`, сопрограмма автоматически планируется к скорому запуску::
uk: Коли співпрограму загорнуто в *Task* із такими функціями, як :func:`asyncio.create_task`, співпрограма автоматично планується для незабаром:

source: Futures
ru: Фьючерсы
uk: Ф'ючерси

source: A :class:`Future` is a special **low-level** awaitable object that represents an **eventual result** of an asynchronous operation.
ru: :class:`Future` — это специальный **низкоуровневый** ожидаемый объект, который представляет **конечный результат** асинхронной операции.
uk: :class:`Future` — це спеціальний **низькорівневий** очікуваний об’єкт, який представляє **кінцевий результат** асинхронної операції.

source: When a Future object is *awaited* it means that the coroutine will wait until the Future is resolved in some other place.
ru: Когда объект Future является *ожидаемым*, это означает, что сопрограмма будет ждать, пока Future не будет разрешена в каком-то другом месте.
uk: Коли об’єкт Future *очікується*, це означає, що співпрограма чекатиме, поки Future не буде дозволено в іншому місці.

source: Future objects in asyncio are needed to allow callback-based code to be used with async/await.
ru: Будущие объекты в asyncio необходимы, чтобы разрешить использование кода обратного вызова с async/await.
uk: Майбутні об’єкти в asyncio потрібні для того, щоб код на основі зворотного виклику використовувався з async/await.

source: Normally **there is no need** to create Future objects at the application level code.
ru: Обычно **нет необходимости** создавать объекты Future на уровне кода приложения.
uk: Зазвичай **немає необхідності** створювати об’єкти Future на рівні програми.

source: Future objects, sometimes exposed by libraries and some asyncio APIs, can be awaited::
ru: Будущие объекты, иногда предоставляемые библиотеками и некоторыми API-интерфейсами asyncio, могут ожидаться:
uk: Майбутні об’єкти, іноді доступні бібліотеками та деякими асинхронними API, можна очікувати:

source: A good example of a low-level function that returns a Future object is :meth:`loop.run_in_executor`.
ru: Хорошим примером низкоуровневой функции, возвращающей объект Future, является :meth:`loop.run_in_executor`.
uk: Хорошим прикладом функції низького рівня, яка повертає об’єкт Future, є :meth:`loop.run_in_executor`.

source: Creating Tasks
ru: Создание задач
uk: Створення завдань

source: **Source code:** :source:`Lib/asyncio/tasks.py`
ru: **Исходный код:** :source:`Lib/asyncio/tasks.py`

source: Wrap the *coro* :ref:`coroutine <coroutine>` into a :class:`Task` and schedule its execution. Return the Task object.
ru: Оберните *coro* :ref:`coroutine <coroutine>` в :class:`Task` и запланируйте его выполнение. Верните объект Task.
uk: Загорніть *coro* :ref:`coroutine <coroutine>` в :class:`Task` і заплануйте його виконання. Повернути об’єкт Task.

source: If *name* is not ``None``, it is set as the name of the task using :meth:`Task.set_name`.
ru: Если *name* не ``None``, оно устанавливается как имя задачи с помощью :meth:`Task.set_name`.
uk: Якщо *name* не є ``None``, воно встановлюється як назва завдання за допомогою :meth:`Task.set_name`.

source: An optional keyword-only *context* argument allows specifying a custom :class:`contextvars.Context` for the *coro* to run in. The current context copy is created when no *context* is provided.
ru: Необязательный аргумент *context*, содержащий только ключевые слова, позволяет указать собственный :class:`contextvars.Context` для запуска *coro*. Текущая копия контекста создается, когда *context* не указан.

source: The task is executed in the loop returned by :func:`get_running_loop`, :exc:`RuntimeError` is raised if there is no running loop in current thread.
ru: Задача выполняется в цикле, возвращаемом :func:`get_running_loop`, :exc:`RuntimeError` возникает, если в текущем потоке нет работающего цикла.
uk: Завдання виконується в циклі, який повертає :func:`get_running_loop`, :exc:`RuntimeError` виникає, якщо в поточному потоці немає запущеного циклу.

source: :meth:`asyncio.TaskGroup.create_task` is a new alternative leveraging structural concurrency; it allows for waiting for a group of related tasks with strong safety guarantees.
ru: :meth:`asyncio.TaskGroup.create_task` — это новая альтернатива, использующая структурный параллелизм; это позволяет ожидать выполнения группы связанных задач с надежными гарантиями безопасности.

source: Save a reference to the result of this function, to avoid a task disappearing mid-execution. The event loop only keeps weak references to tasks. A task that isn't referenced elsewhere may get garbage collected at any time, even before it's done. For reliable "fire-and-forget" background tasks, gather them in a collection::
ru: Сохраните ссылку на результат этой функции, чтобы избежать исчезновения задачи в середине выполнения. Цикл событий сохраняет только слабые ссылки на задачи. Задача, на которую нигде нет ссылок, может быть удалена сборщиком мусора в любое время, даже до того, как она будет выполнена. Для надежных фоновых задач по принципу «выстрелил и забыл» соберите их в коллекцию:

source: Added the *name* parameter.
ru: Добавлен параметр *имя*.

source: Added the *context* parameter.
ru: Добавлен параметр *context*.

source: Task Cancellation
ru: Отмена задачи

source: Tasks can easily and safely be cancelled. When a task is cancelled, :exc:`asyncio.CancelledError` will be raised in the task at the next opportunity.
ru: Задачи можно легко и безопасно отменить. Когда задача отменяется, при следующей возможности в задаче будет вызвано :exc:`asyncio.CancelledError`.

source: It is recommended that coroutines use ``try/finally`` blocks to robustly perform clean-up logic. In case :exc:`asyncio.CancelledError` is explicitly caught, it should generally be propagated when clean-up is complete. :exc:`asyncio.CancelledError` directly subclasses :exc:`BaseException` so most code will not need to be aware of it.
ru: Рекомендуется, чтобы сопрограммы использовали блоки try/finally для надежного выполнения логики очистки. В случае явного обнаружения :exc:`asyncio.CancelledError`, его обычно следует распространять после завершения очистки. :exc:`asyncio.CancelledError` напрямую является подклассом :exc:`BaseException`, поэтому большинству кода не нужно будет об этом знать.

source: The asyncio components that enable structured concurrency, like :class:`asyncio.TaskGroup` and :func:`asyncio.timeout`, are implemented using cancellation internally and might misbehave if a coroutine swallows :exc:`asyncio.CancelledError`. Similarly, user code should not generally call :meth:`uncancel <asyncio.Task.uncancel>`. However, in cases when suppressing :exc:`asyncio.CancelledError` is truly desired, it is necessary to also call ``uncancel()`` to completely remove the cancellation state.
ru: Компоненты asyncio, обеспечивающие структурированный параллелизм, такие как :class:`asyncio.TaskGroup` и :func:`asyncio.timeout`, реализуются с использованием внутренней отмены и могут работать неправильно, если сопрограмма проглотит :exc:`asyncio.CancelledError`. Аналогично, пользовательский код обычно не должен вызывать :meth:`uncancel <asyncio.Task.uncancel>`. Однако в случаях, когда подавление :exc:`asyncio.CancelledError` действительно желательно, необходимо также вызвать ``uncancel()``, чтобы полностью удалить состояние отмены.

source: Task Groups
ru: Группы задач

source: Task groups combine a task creation API with a convenient and reliable way to wait for all tasks in the group to finish.
ru: Группы задач сочетают в себе API создания задач с удобным и надежным способом ожидания завершения всех задач в группе.

source: An :ref:`asynchronous context manager <async-context-managers>` holding a group of tasks. Tasks can be added to the group using :meth:`create_task`. All tasks are awaited when the context manager exits.
ru: :ref:`асинхронный контекстный менеджер <async-context-managers>`, содержащий группу задач. Задачи можно добавлять в группу с помощью :meth:`create_task`. Все задачи ожидаются после выхода из контекстного менеджера.

source: Create a task in this task group. The signature matches that of :func:`asyncio.create_task`. If the task group is inactive (e.g. not yet entered, already finished, or in the process of shutting down), we will close the given ``coro``.
ru: Создайте задачу в этой группе задач. Подпись соответствует подписи :func:`asyncio.create_task`. Если группа задач неактивна (например, еще не введена, уже завершена или находится в процессе закрытия), мы закроем данное ``coro``.

source: Close the given coroutine if the task group is not active.
ru: Закройте данную сопрограмму, если группа задач не активна.

source: Example::
ru: Пример::
uk: Приклад::

source: The ``async with`` statement will wait for all tasks in the group to finish. While waiting, new tasks may still be added to the group (for example, by passing ``tg`` into one of the coroutines and calling ``tg.create_task()`` in that coroutine). Once the last task has finished and the ``async with`` block is exited, no new tasks may be added to the group.
ru: Оператор ``async with`` будет ждать завершения всех задач в группе. Во время ожидания в группу все равно можно добавлять новые задачи (например, передав ``tg`` в одну из сопрограмм и вызвав ``tg.create_task()`` в этой сопрограмме). После завершения последней задачи и выхода из блока async with в группу нельзя добавлять новые задачи.

source: The first time any of the tasks belonging to the group fails with an exception other than :exc:`asyncio.CancelledError`, the remaining tasks in the group are cancelled. No further tasks can then be added to the group. At this point, if the body of the ``async with`` statement is still active (i.e., :meth:`~object.__aexit__` hasn't been called yet), the task directly containing the ``async with`` statement is also cancelled. The resulting :exc:`asyncio.CancelledError` will interrupt an ``await``, but it will not bubble out of the containing ``async with`` statement.
ru: При первом сбое какой-либо задачи, принадлежащей группе, за исключением исключения :exc:`asyncio.CancelledError`, остальные задачи в группе отменяются. После этого в группу невозможно будет добавить никакие дальнейшие задачи. На этом этапе, если тело оператора ``async with`` все еще активно (т.е. :meth:`~object.__aexit__` еще не был вызван), задача, непосредственно содержащая ``async with`` заявление также аннулируется. Полученный :exc:`asyncio.CancelledError` прервет ``await``, но он не выйдет за пределы содержащегося ``async with`` оператора.

source: Once all tasks have finished, if any tasks have failed with an exception other than :exc:`asyncio.CancelledError`, those exceptions are combined in an :exc:`ExceptionGroup` or :exc:`BaseExceptionGroup` (as appropriate; see their documentation) which is then raised.
ru: Если после завершения всех задач какие-либо задачи завершились сбоем с исключением, отличным от :exc:`asyncio.CancelledError`, эти исключения объединяются в :exc:`ExceptionGroup` или :exc:`BaseExceptionGroup` (в зависимости от ситуации; см. документации), которая затем поднимается.

source: Two base exceptions are treated specially: If any task fails with :exc:`KeyboardInterrupt` or :exc:`SystemExit`, the task group still cancels the remaining tasks and waits for them, but then the initial :exc:`KeyboardInterrupt` or :exc:`SystemExit` is re-raised instead of :exc:`ExceptionGroup` or :exc:`BaseExceptionGroup`.
ru: Два базовых исключения обрабатываются особым образом: если какая-либо задача завершается с ошибкой :exc:`KeyboardInterrupt` или :exc:`SystemExit`, группа задач по-прежнему отменяет оставшиеся задачи и ожидает их, но затем начальный :exc:`KeyboardInterrupt` или :exc:`SystemExit` повторно вызывается вместо :exc:`ExceptionGroup` или :exc:`BaseExceptionGroup`.

source: If the body of the ``async with`` statement exits with an exception (so :meth:`~object.__aexit__` is called with an exception set), this is treated the same as if one of the tasks failed: the remaining tasks are cancelled and then waited for, and non-cancellation exceptions are grouped into an exception group and raised. The exception passed into :meth:`~object.__aexit__`, unless it is :exc:`asyncio.CancelledError`, is also included in the exception group. The same special case is made for :exc:`KeyboardInterrupt` and :exc:`SystemExit` as in the previous paragraph.
ru: Если тело оператора ``async with`` завершается с исключением (поэтому :meth:`~object.__aexit__` вызывается с набором исключений), это обрабатывается так же, как если бы одна из задач завершилась неудачно: оставшиеся задачи отменяются, а затем ожидаются, а исключения, не подлежащие отмене, группируются в группу исключений и вызываются. Исключение, переданное в :meth:`~object.__aexit__`, если оно не является :exc:`asyncio.CancelledError`, также включается в группу исключений. Для :exc:`KeyboardInterrupt` и :exc:`SystemExit` предусмотрен тот же особый случай, что и в предыдущем абзаце.

source: Task groups are careful not to mix up the internal cancellation used to "wake up" their :meth:`~object.__aexit__` with cancellation requests for the task in which they are running made by other parties. In particular, when one task group is syntactically nested in another, and both experience an exception in one of their child tasks simultaneously, the inner task group will process its exceptions, and then the outer task group will receive another cancellation and process its own exceptions.
ru: Группы задач стараются не путать внутреннюю отмену, используемую для «пробуждения» их :meth:`~object.__aexit__`, с запросами на отмену задачи, в которой они выполняются, сделанными другими сторонами. В частности, когда одна группа задач синтаксически вложена в другую и обе одновременно испытывают исключение в одной из своих дочерних задач, внутренняя группа задач будет обрабатывать свои исключения, а затем внешняя группа задач получит еще одну отмену и обработает свои собственные исключения. .

source: In the case where a task group is cancelled externally and also must raise an :exc:`ExceptionGroup`, it will call the parent task's :meth:`~asyncio.Task.cancel` method. This ensures that a :exc:`asyncio.CancelledError` will be raised at the next :keyword:`await`, so the cancellation is not lost.
ru: В случае, когда группа задач отменяется извне и ей также необходимо вызвать :exc:`ExceptionGroup`, она вызывает метод :meth:`~asyncio.Task.cancel` родительской задачи. Это гарантирует, что при следующем :keyword:`await` будет вызвана ошибка :exc:`asyncio.CancelledError`, поэтому отмена не будет потеряна.

source: Task groups preserve the cancellation count reported by :meth:`asyncio.Task.cancelling`.
ru: Группы задач сохраняют количество отмен, сообщаемое :meth:`asyncio.Task.cancelling`.

source: Improved handling of simultaneous internal and external cancellations and correct preservation of cancellation counts.
ru: Улучшена обработка одновременных внутренних и внешних отмен, а также правильное сохранение количества отмен.

source: Terminating a Task Group
ru: Завершение группы задач

source: While terminating a task group is not natively supported by the standard library, termination can be achieved by adding an exception-raising task to the task group and ignoring the raised exception:
ru: Хотя завершение группы задач не поддерживается стандартной библиотекой, завершение может быть достигнуто путем добавления задачи, вызывающей исключение, в группу задач и игнорирования возникшего исключения:

source: Expected output:
ru: Ожидаемый результат:

source: Sleeping
ru: Спящий
uk: спить

source: Block for *delay* seconds.
ru: Блокировка на *delay* секунд.
uk: Блокувати на *затримку* секунд.

source: If *result* is provided, it is returned to the caller when the coroutine completes.
ru: Если указан *result*, он возвращается вызывающей стороне после завершения сопрограммы.
uk: Якщо надано *результат*, він повертається абоненту після завершення співпрограми.

source: ``sleep()`` always suspends the current task, allowing other tasks to run.
ru: ``sleep()`` всегда приостанавливает текущую задачу, позволяя запустить другие задачи.
uk: ``sleep()`` завжди призупиняє поточне завдання, дозволяючи виконувати інші завдання.

source: Setting the delay to 0 provides an optimized path to allow other tasks to run. This can be used by long-running functions to avoid blocking the event loop for the full duration of the function call.
ru: Установка задержки на 0 обеспечивает оптимизированный путь для запуска других задач. Это может использоваться долго выполняющимися функциями, чтобы избежать блокировки цикла событий на весь период вызова функции.
uk: Встановлення затримки на 0 забезпечує оптимізований шлях для виконання інших завдань. Це може бути використано функціями, які довго виконуються, щоб уникнути блокування циклу подій протягом повної тривалості виклику функції.

source: Example of coroutine displaying the current date every second for 5 seconds::
ru: Пример сопрограммы, отображающей текущую дату каждую секунду в течение 5 секунд::
uk: Приклад співпрограми, що відображає поточну дату кожну секунду протягом 5 секунд:

source: Removed the *loop* parameter.
ru: Удален параметр *loop*.

source: Raises :exc:`ValueError` if *delay* is :data:`~math.nan`.
ru: Вызывает :exc:`ValueError`, если *delay* равен :data:`~math.nan`.

source: Running Tasks Concurrently
ru: Одновременное выполнение задач
uk: Одночасне виконання завдань
