Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/asyncio-task.po
Languages: ru, uk

source: Run :ref:`awaitable objects <asyncio-awaitables>` in the *aws* sequence *concurrently*.
ru: Запустите :ref:`awaitable объекты <asyncio-awaitables>` в последовательности *aws* *параллельно*.
uk: Запустіть :ref:`waitable objects <asyncio-awaitables>` у послідовності *aws* *одночасно*.

source: If any awaitable in *aws* is a coroutine, it is automatically scheduled as a Task.
ru: Если какое-либо ожидаемое событие в *aws* является сопрограммой, оно автоматически назначается как Задача.
uk: Якщо будь-який awaitable у *aws* є співпрограмою, він автоматично запланований як завдання.

source: If all awaitables are completed successfully, the result is an aggregate list of returned values. The order of result values corresponds to the order of awaitables in *aws*.
ru: Если все ожидаемые объекты выполнены успешно, результатом является совокупный список возвращаемых значений. Порядок значений результатов соответствует порядку ожидаемых объектов в *aws*.
uk: Якщо всі очікування виконано успішно, результатом буде зведений список повернутих значень. Порядок значень результатів відповідає порядку очікуваних значень у *aws*.

source: If *return_exceptions* is ``False`` (default), the first raised exception is immediately propagated to the task that awaits on ``gather()``. Other awaitables in the *aws* sequence **won't be cancelled** and will continue to run.
ru: Если *return_Exceptions* имеет значение False (по умолчанию), первое возникшее исключение немедленно распространяется на задачу, ожидающую Gather(). Другие ожидаемые объекты в последовательности *aws* **не будут отменены** и продолжат выполняться.
uk: Якщо *return_exceptions* має значення ``False`` (за замовчуванням), перший викликаний виняток негайно поширюється на завдання, яке очікує на ``gather()``. Інші очікування в послідовності *aws* **не будуть скасовані** і продовжуватимуть працювати.

source: If *return_exceptions* is ``True``, exceptions are treated the same as successful results, and aggregated in the result list.
ru: Если *return_Exceptions* имеет значение True, исключения обрабатываются так же, как успешные результаты, и объединяются в список результатов.
uk: Якщо *return_exceptions* має значення ``True``, винятки обробляються так само, як успішні результати, і агрегуються в списку результатів.

source: If ``gather()`` is *cancelled*, all submitted awaitables (that have not completed yet) are also *cancelled*.
ru: Если ``gather()`` *отменяется*, все отправленные ожидаемые объекты (которые еще не завершены) также *отменяются*.
uk: Якщо ``gather()`` *скасовано*, усі надіслані очікування (які ще не завершені) також *скасуються*.

source: If any Task or Future from the *aws* sequence is *cancelled*, it is treated as if it raised :exc:`CancelledError` -- the ``gather()`` call is **not** cancelled in this case. This is to prevent the cancellation of one submitted Task/Future to cause other Tasks/Futures to be cancelled.
ru: Если какая-либо Задача или Future из последовательности *aws* *отменена*, она рассматривается так, как если бы она вызвала :exc:`CancelledError` — вызов ``gather()`` в этом случае **не** отменяется. . Это сделано для того, чтобы предотвратить отмену одной отправленной задачи/фьючерса, которая может привести к отмене других задач/фьючерсов.
uk: Якщо будь-яке завдання або майбутнє з послідовності *aws* *скасовано*, воно розглядається як викликане :exc:`CancelledError` -- у цьому випадку виклик ``gather()`` **не** скасовується . Це робиться для того, щоб запобігти скасуванню одного поданого Завдання/Майбутнього, що спричинить скасування інших Завдань/Ф’ючерсів.

source: A new alternative to create and run tasks concurrently and wait for their completion is :class:`asyncio.TaskGroup`. *TaskGroup* provides stronger safety guarantees than *gather* for scheduling a nesting of subtasks: if a task (or a subtask, a task scheduled by a task) raises an exception, *TaskGroup* will, while *gather* will not, cancel the remaining scheduled tasks).
ru: Новой альтернативой для одновременного создания и запуска задач и ожидания их завершения является :class:`asyncio.TaskGroup`. *TaskGroup* обеспечивает более сильные гарантии безопасности, чем *gather*, при планировании вложенности подзадач: если задача (или подзадача, задача, запланированная задачей) вызывает исключение, *TaskGroup* ее отменит, а *gather* нет. оставшиеся запланированные задачи).

source: If *return_exceptions* is false, cancelling gather() after it has been marked done won't cancel any submitted awaitables. For instance, gather can be marked done after propagating an exception to the caller, therefore, calling ``gather.cancel()`` after catching an exception (raised by one of the awaitables) from gather won't cancel any other awaitables.
ru: Если *return_Exceptions* имеет значение false, отмена метода сбора() после того, как он был помечен как выполненный, не отменит отправленные ожидаемые объекты. Например, сбор может быть помечен как выполненный после распространения исключения вызывающему объекту, поэтому вызов Gather.cancel() после перехвата исключения (вызванного одним из ожидаемых объектов) из сбора не отменит другие ожидаемые объекты.

source: If the *gather* itself is cancelled, the cancellation is propagated regardless of *return_exceptions*.
ru: Если сам *сбор* отменен, отмена распространяется независимо от *return_Exceptions*.
uk: Якщо сам *gather* скасовано, скасування поширюється незалежно від *return_exceptions*.

source: Deprecation warning is emitted if no positional arguments are provided or not all positional arguments are Future-like objects and there is no running event loop.
ru: Предупреждение об устаревании выдается, если позиционные аргументы не предоставлены или не все позиционные аргументы являются объектами типа Future и нет текущего цикла событий.

source: Eager Task Factory
ru: Фабрика нетерпеливых задач

source: A task factory for eager task execution.
ru: Фабрика задач для оперативного выполнения задач.

source: When using this factory (via :meth:`loop.set_task_factory(asyncio.eager_task_factory) <loop.set_task_factory>`), coroutines begin execution synchronously during :class:`Task` construction. Tasks are only scheduled on the event loop if they block. This can be a performance improvement as the overhead of loop scheduling is avoided for coroutines that complete synchronously.
ru: При использовании этой фабрики (через :meth:`loop.set_task_factory(asyncio.eager_task_factory) <loop.set_task_factory>`) сопрограммы начинают выполнение синхронно во время построения :class:`Task`. Задачи планируются в цикле событий только в том случае, если они блокируются. Это может повысить производительность, поскольку для сопрограмм, которые выполняются синхронно, можно избежать накладных расходов на планирование циклов.

source: A common example where this is beneficial is coroutines which employ caching or memoization to avoid actual I/O when possible.
ru: Типичным примером, когда это полезно, являются сопрограммы, которые используют кеширование или мемоизацию, чтобы избежать фактического ввода-вывода, когда это возможно.

source: Immediate execution of the coroutine is a semantic change. If the coroutine returns or raises, the task is never scheduled to the event loop. If the coroutine execution blocks, the task is scheduled to the event loop. This change may introduce behavior changes to existing applications. For example, the application's task execution order is likely to change.
ru: Немедленное выполнение сопрограммы является семантическим изменением. Если сопрограмма возвращает или вызывает вызов, задача никогда не назначается в цикле событий. Если выполнение сопрограммы блокируется, задача назначается в цикле событий. Это изменение может привести к изменению поведения существующих приложений. Например, может измениться порядок выполнения задач приложения.

source: Create an eager task factory, similar to :func:`eager_task_factory`, using the provided *custom_task_constructor* when creating a new task instead of the default :class:`Task`.
ru: Создайте фабрику активных задач, аналогичную :func:`eager_task_factory`, используя предоставленный *custom_task_constructor* при создании новой задачи вместо стандартного :class:`Task`.

source: *custom_task_constructor* must be a *callable* with the signature matching the signature of :class:`Task.__init__ <Task>`. The callable must return a :class:`asyncio.Task`-compatible object.
ru: *custom_task_constructor* должен быть *вызываемым* с сигнатурой, соответствующей сигнатуре :class:`Task.__init__ <Task>`. Вызываемый объект должен возвращать объект, совместимый с :class:`asyncio.Task`.

source: This function returns a *callable* intended to be used as a task factory of an event loop via :meth:`loop.set_task_factory(factory) <loop.set_task_factory>`).
ru: Эта функция возвращает *вызываемый* объект, предназначенный для использования в качестве фабрики задач в цикле событий через :meth:`loop.set_task_factory(factory) <loop.set_task_factory>`).

source: Shielding From Cancellation
ru: Защита от отмены
uk: Захист від скасування

source: Protect an :ref:`awaitable object <asyncio-awaitables>` from being :meth:`cancelled <Task.cancel>`.
ru: Защитите :ref:`ожидаемый объект <asyncio-awaitables>` от :meth:`отмены <Task.cancel>`.
uk: Захист :ref:`очікуваного об’єкта <asyncio-awaitables>` від :meth:`скасування <Task.cancel>`.

source: If *aw* is a coroutine it is automatically scheduled as a Task.
ru: Если *aw* является сопрограммой, она автоматически назначается как Задача.
uk: Якщо *aw* є співпрограмою, вона автоматично запланована як завдання.

source: The statement::
ru: Заявление::
uk: Заява::

source: is equivalent to::
ru: эквивалентно::
uk: еквівалентно::

source: *except* that if the coroutine containing it is cancelled, the Task running in ``something()`` is not cancelled. From the point of view of ``something()``, the cancellation did not happen. Although its caller is still cancelled, so the "await" expression still raises a :exc:`CancelledError`.
ru: *за исключением* того, что если сопрограмма, содержащая ее, отменена, Задача, выполняющаяся в ``something()``, не отменяется. С точки зрения ``something()`` отмены не произошло. Хотя вызывающая сторона по-прежнему отменяется, выражение await по-прежнему вызывает ошибку :exc:`CancelledError`.
uk: *за винятком* того, що якщо співпрограму, яка містить його, скасовується, Завдання, що виконується в ``something()``, не скасовується. З точки зору ``something()``, скасування не відбулося. Хоча його виклик все ще скасовано, тому вираз "чекати" все ще викликає :exc:`CancelledError`.

source: If ``something()`` is cancelled by other means (i.e. from within itself) that would also cancel ``shield()``.
ru: Если ``something()`` отменяется другими способами (т.е. изнутри самого себя), это также отменяет ``shield()``.
uk: Якщо ``something()`` скасовано іншими засобами (тобто зсередини), це також скасує ``shield()``.

source: If it is desired to completely ignore cancellation (not recommended) the ``shield()`` function should be combined with a try/except clause, as follows::
ru: Если желательно полностью игнорировать отмену (не рекомендуется), функцию «shield()» следует объединить с предложением try/Exception следующим образом:
uk: Якщо потрібно повністю ігнорувати скасування (не рекомендовано), функцію ``shield()`` слід поєднати з реченням try/except, як показано нижче:

source: Save a reference to tasks passed to this function, to avoid a task disappearing mid-execution. The event loop only keeps weak references to tasks. A task that isn't referenced elsewhere may get garbage collected at any time, even before it's done.
ru: Сохраните ссылку на задачи, переданные в эту функцию, чтобы задача не исчезла в середине выполнения. Цикл событий сохраняет только слабые ссылки на задачи. Задача, на которую нигде нет ссылок, может быть удалена сборщиком мусора в любое время, даже до того, как она будет выполнена.

source: Deprecation warning is emitted if *aw* is not Future-like object and there is no running event loop.
ru: Предупреждение об устаревании выдается, если *aw* не является объектом типа Future и нет текущего цикла событий.

source: Timeouts
ru: Таймауты
uk: Тайм-аути

source: Return an :ref:`asynchronous context manager <async-context-managers>` that can be used to limit the amount of time spent waiting on something.
ru: Возвращает :ref:`асинхронный контекстный менеджер <async-context-managers>`, который можно использовать для ограничения времени, затрачиваемого на ожидание чего-либо.

source: *delay* can either be ``None``, or a float/int number of seconds to wait. If *delay* is ``None``, no time limit will be applied; this can be useful if the delay is unknown when the context manager is created.
ru: *delay* может быть либо None, либо числом в секундах ожидания с плавающей запятой/int. Если *delay* имеет значение «None», ограничение по времени применяться не будет; это может быть полезно, если задержка неизвестна при создании диспетчера контекста.

source: In either case, the context manager can be rescheduled after creation using :meth:`Timeout.reschedule`.
ru: В любом случае диспетчер контекста может быть перепланирован после создания с помощью :meth:`Timeout.reschedule`.

source: If ``long_running_task`` takes more than 10 seconds to complete, the context manager will cancel the current task and handle the resulting :exc:`asyncio.CancelledError` internally, transforming it into a :exc:`TimeoutError` which can be caught and handled.
ru: Если выполнение ``long_running_task`` занимает более 10 секунд, контекстный менеджер отменит текущую задачу и обработает полученную :exc:`asyncio.CancelledError` внутри себя, преобразуя ее в :exc:`TimeoutError`, которую можно перехватить. и справился.

source: The :func:`asyncio.timeout` context manager is what transforms the :exc:`asyncio.CancelledError` into a :exc:`TimeoutError`, which means the :exc:`TimeoutError` can only be caught *outside* of the context manager.
ru: Контекстный менеджер :func:`asyncio.timeout` преобразует :exc:`asyncio.CancelledError` в :exc:`TimeoutError`, что означает, что :exc:`TimeoutError` может быть обнаружен только *вне* контекстный менеджер.

source: Example of catching :exc:`TimeoutError`::
ru: Пример перехвата :exc:`TimeoutError`::

source: The context manager produced by :func:`asyncio.timeout` can be rescheduled to a different deadline and inspected.
ru: Менеджер контекста, созданный :func:`asyncio.timeout`, может быть перенесен на другой крайний срок и проверен.

source: An :ref:`asynchronous context manager <async-context-managers>` for cancelling overdue coroutines.
ru: :ref:`асинхронный контекстный менеджер <async-context-managers>` для отмены просроченных сопрограмм.

source: ``when`` should be an absolute time at which the context should time out, as measured by the event loop's clock:
ru: ``when`` должно быть абсолютным временем, в которое контекст должен истечь, измеряемым часами цикла событий:

source: If ``when`` is ``None``, the timeout will never trigger.
ru: If ``when`` is ``None``, тайм-аут никогда не сработает.

source: If ``when < loop.time()``, the timeout will trigger on the next iteration of the event loop.
ru: If ``when < loop.time()``, тайм-аут сработает на следующей итерации цикла событий.

source: Return the current deadline, or ``None`` if the current deadline is not set.
ru: Возвращает текущий срок или «Нет», если текущий срок не установлен.

source: Reschedule the timeout.
ru: Перепланируйте тайм-аут.

source: Return whether the context manager has exceeded its deadline (expired).
ru: Перепланируйте тайм-аут.

source: Timeout context managers can be safely nested.
ru: Менеджеры контекста таймаута могут быть безопасно вложены.

source: Similar to :func:`asyncio.timeout`, except *when* is the absolute time to stop waiting, or ``None``.
ru: Аналогично :func:`asyncio.timeout`, за исключением того, что *when* — это абсолютное время прекращения ожидания или ``None``.

source: Wait for the *aw* :ref:`awaitable <asyncio-awaitables>` to complete with a timeout.
ru: Подождите, пока *aw* :ref:`awaitable <asyncio-awaitables>` завершится с таймаутом.
uk: Зачекайте, поки *aw* :ref:`awaitable <asyncio-awaitables>` завершиться з тайм-аутом.

source: *timeout* can either be ``None`` or a float or int number of seconds to wait for. If *timeout* is ``None``, block until the future completes.
ru: *timeout* может быть либо ``None``, либо числом с плавающей запятой или целым числом секунд ожидания. Если *timeout* имеет значение «None», блокируется до завершения будущего.
uk: *timeout* може бути або ``None``, або числом секунд для очікування з плаваючою точкою або int. Якщо *timeout* має значення ``None``, блокуйте до завершення майбутнього.

source: If a timeout occurs, it cancels the task and raises :exc:`TimeoutError`.
ru: Если происходит таймаут, задача отменяется и выдается :exc:`TimeoutError`.

source: To avoid the task :meth:`cancellation <Task.cancel>`, wrap it in :func:`shield`.
ru: Чтобы избежать выполнения задачи :meth:`cancellation <Task.cancel>`, оберните ее в :func:`shield`.
uk: Щоб уникнути завдання :meth:`скасування <Task.cancel>`, загорніть його в :func:`shield`.

source: The function will wait until the future is actually cancelled, so the total wait time may exceed the *timeout*. If an exception happens during cancellation, it is propagated.
ru: Функция будет ждать до тех пор, пока фьючерс не будет фактически отменен, поэтому общее время ожидания может превысить *таймаут*. Если во время отмены возникает исключение, оно распространяется.
uk: Функція чекатиме, доки майбутнє фактично не буде скасовано, тому загальний час очікування може перевищити *тайм-аут*. Якщо під час скасування виникає виняток, він поширюється.

source: If the wait is cancelled, the future *aw* is also cancelled.
ru: Если ожидание отменяется, будущее *aw* также отменяется.
uk: Якщо очікування скасовується, майбутнє *aw* також скасовується.

source: When *aw* is cancelled due to a timeout, ``wait_for`` waits for *aw* to be cancelled. Previously, it raised :exc:`TimeoutError` immediately.
ru: Когда *aw* отменяется из-за таймаута, ``wait_for`` ожидает отмены *aw*. Раньше он немедленно вызывал :exc:`TimeoutError`.

source: Raises :exc:`TimeoutError` instead of :exc:`asyncio.TimeoutError`.
ru: Вызывает :exc:`TimeoutError` вместо :exc:`asyncio.TimeoutError`.

source: Waiting Primitives
ru: Ожидающие примитивы
uk: Очікування примітивів

source: Run :class:`~asyncio.Future` and :class:`~asyncio.Task` instances in the *aws* iterable concurrently and block until the condition specified by *return_when*.
ru: Запускайте экземпляры :class:`~asyncio.Future` и :class:`~asyncio.Task` в итерации *aws* одновременно и блокируйте их до тех пор, пока не будет выполнено условие, указанное в *return_when*.

source: The *aws* iterable must not be empty.
ru: Итерируемый *aws* не должен быть пустым.
uk: Ітерація *aws* не має бути порожньою.

source: Returns two sets of Tasks/Futures: ``(done, pending)``.
ru: Возвращает два набора задач/фьючерсов: ``(выполнено, ожидается)``.
uk: Повертає два набори Tasks/Futures: ``(done, pending)``.

source: Usage::
ru: Использование::
uk: Використання::

source: *timeout* (a float or int), if specified, can be used to control the maximum number of seconds to wait before returning.
ru: *timeout* (число с плавающей запятой или целое число), если указано, можно использовать для управления максимальным количеством секунд ожидания перед возвратом.
uk: *timeout* (float або int), якщо вказано, можна використовувати для керування максимальною кількістю секунд очікування перед поверненням.

source: Note that this function does not raise :exc:`TimeoutError`. Futures or Tasks that aren't done when the timeout occurs are simply returned in the second set.
ru: Обратите внимание, что эта функция не вызывает :exc:`TimeoutError`. Фьючерсы или задачи, которые не выполнены по истечении тайм-аута, просто возвращаются во втором наборе.

source: *return_when* indicates when this function should return. It must be one of the following constants:
ru: *return_when* указывает, когда эта функция должна вернуться. Это должна быть одна из следующих констант:
uk: *return_when* вказує, коли ця функція має повернутися. Це має бути одна з таких констант:

source: Constant
ru: Константа
uk: Постійний

source: Description
ru: Описание
uk: опис

source: The function will return when any future finishes or is cancelled.
ru: Функция вернется, когда любое будущее завершится или будет отменено.
uk: Функція повернеться, коли будь-який майбутній завершиться або буде скасовано.

source: The function will return when any future finishes by raising an exception. If no future raises an exception then it is equivalent to :const:`ALL_COMPLETED`.
ru: Функция вернется, когда любое будущее завершится вызовом исключения. Если никакое будущее не вызывает исключение, это эквивалентно :const:`ALL_COMPLETED`.

source: The function will return when all futures finish or are cancelled.
ru: Функция вернется, когда все фьючерсы закончатся или будут отменены.
uk: Функція повернеться, коли всі ф’ючерси закінчаться або будуть скасовані.

source: Unlike :func:`~asyncio.wait_for`, ``wait()`` does not cancel the futures when a timeout occurs.
ru: В отличие от :func:`~asyncio.wait_for`, ``wait()`` не отменяет фьючерсы, когда происходит таймаут.
uk: На відміну від :func:`~asyncio.wait_for`, ``wait()`` не скасовує ф’ючерси, коли настає тайм-аут.

source: Passing coroutine objects to ``wait()`` directly is forbidden.
ru: Передача объектов сопрограммы напрямую в wait() запрещена.

source: Added support for generators yielding tasks.
ru: Добавлена ​​поддержка генераторов, дающих задачи.

source: Run :ref:`awaitable objects <asyncio-awaitables>` in the *aws* iterable concurrently. The returned object can be iterated to obtain the results of the awaitables as they finish.
ru: Запустите :ref:`awaitable объекты <asyncio-awaitables>` в итерации *aws* одновременно. Возвращенный объект можно повторять, чтобы получить результаты ожидаемых объектов по мере их завершения.

source: The object returned by ``as_completed()`` can be iterated as an :term:`asynchronous iterator` or a plain :term:`iterator`. When asynchronous iteration is used, the originally-supplied awaitables are yielded if they are tasks or futures. This makes it easy to correlate previously-scheduled tasks with their results. Example::
ru: Объект, возвращаемый функцией as_completed(), может быть повторен как :term:`асинхронный итератор` или как обычный :term:`итератор`. При использовании асинхронной итерации выдаются исходно предоставленные ожидаемые объекты, если они являются задачами или будущими событиями. Это позволяет легко соотносить ранее запланированные задачи с их результатами. Пример::

source: During asynchronous iteration, implicitly-created tasks will be yielded for supplied awaitables that aren't tasks or futures.
ru: Во время асинхронной итерации неявно созданные задачи будут создаваться для предоставленных ожидаемых объектов, которые не являются задачами или фьючерсами.

source: When used as a plain iterator, each iteration yields a new coroutine that returns the result or raises the exception of the next completed awaitable. This pattern is compatible with Python versions older than 3.13::
ru: При использовании в качестве простого итератора каждая итерация создает новую сопрограмму, которая возвращает результат или вызывает исключение следующего завершенного ожидаемого объекта. Этот шаблон совместим с версиями Python старше 3.13:
