Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/asyncio-dev.po
Languages: ru

source: Developing with asyncio
ru: Разработка с помощью asyncio

source: Asynchronous programming is different from classic "sequential" programming.
ru: Асинхронное программирование отличается от классического «последовательного» программирования.

source: This page lists common mistakes and traps and explains how to avoid them.
ru: На этой странице перечислены распространенные ошибки и ловушки, а также объясняется, как их избежать.

source: Debug Mode
ru: Режим отладки

source: By default asyncio runs in production mode. In order to ease the development asyncio has a *debug mode*.
ru: По умолчанию asyncio работает в производственном режиме. Чтобы облегчить разработку, в asyncio предусмотрен *режим отладки*.

source: There are several ways to enable asyncio debug mode:
ru: Есть несколько способов включить режим отладки asyncio:

source: Setting the :envvar:`PYTHONASYNCIODEBUG` environment variable to ``1``.
ru: Установка переменной среды :envvar:`PYTHONASYNCIODEBUG` в значение ``1``.

source: Using the :ref:`Python Development Mode <devmode>`.
ru: Использование :ref:`Режима разработки Python <devmode>`.

source: Passing ``debug=True`` to :func:`asyncio.run`.
ru: Передача ``debug=True`` в :func:`asyncio.run`.

source: Calling :meth:`loop.set_debug`.
ru: Вызов :meth:`loop.set_debug`.

source: In addition to enabling the debug mode, consider also:
ru: Помимо включения режима отладки, учтите также:

source: setting the log level of the :ref:`asyncio logger <asyncio-logger>` to :py:const:`logging.DEBUG`, for example the following snippet of code can be run at startup of the application::
ru: установка уровня журнала :ref:`asyncio logger <asyncio-logger>` на :py:const:`logging.DEBUG`, например, следующий фрагмент кода может быть запущен при запуске приложения:

source: configuring the :mod:`warnings` module to display :exc:`ResourceWarning` warnings. One way of doing that is by using the :option:`-W` ``default`` command line option.
ru: настройка модуля :mod:`warnings` для отображения предупреждений :exc:`ResourceWarning`. Один из способов сделать это — использовать параметр командной строки :option:`-W` ``default``.

source: When the debug mode is enabled:
ru: Когда режим отладки включен:

source: asyncio checks for :ref:`coroutines that were not awaited <asyncio-coroutine-not-scheduled>` and logs them; this mitigates the "forgotten await" pitfall.
ru: asyncio проверяет наличие неожиданных сопрограмм <asyncio-coroutine-not-scheduled>` и записывает их в журнал; это смягчает ловушку «забытого ожидания».

source: Many non-threadsafe asyncio APIs (such as :meth:`loop.call_soon` and :meth:`loop.call_at` methods) raise an exception if they are called from a wrong thread.
ru: Многие непотокобезопасные асинхронные API (например, методы :meth:`loop.call_soon` и :meth:`loop.call_at`) вызывают исключение, если они вызываются из неправильного потока.

source: The execution time of the I/O selector is logged if it takes too long to perform an I/O operation.
ru: Время выполнения селектора ввода-вывода регистрируется, если выполнение операции ввода-вывода занимает слишком много времени.

source: Callbacks taking longer than 100 milliseconds are logged. The :attr:`loop.slow_callback_duration` attribute can be used to set the minimum execution duration in seconds that is considered "slow".
ru: Обратные вызовы, занимающие более 100 миллисекунд, регистрируются. Атрибут :attr:`loop.slow_callback_duration` можно использовать для установки минимальной продолжительности выполнения в секундах, которая считается «медленной».

source: Concurrency and Multithreading
ru: Параллелизм и многопоточность

source: An event loop runs in a thread (typically the main thread) and executes all callbacks and Tasks in its thread. While a Task is running in the event loop, no other Tasks can run in the same thread. When a Task executes an ``await`` expression, the running Task gets suspended, and the event loop executes the next Task.
ru: Цикл событий выполняется в потоке (обычно в основном потоке) и выполняет все обратные вызовы и задачи в своем потоке. Пока задача выполняется в цикле событий, никакие другие задачи не могут выполняться в том же потоке. Когда Задача выполняет выражение ``await``, выполняющаяся Задача приостанавливается, и цикл событий выполняет следующую Задача.

source: To schedule a :term:`callback` from another OS thread, the :meth:`loop.call_soon_threadsafe` method should be used. Example::
ru: Чтобы запланировать обратный вызов :term:`call` из другого потока ОС, следует использовать метод :meth:`loop.call_soon_threadsafe`. Пример::

source: Almost all asyncio objects are not thread safe, which is typically not a problem unless there is code that works with them from outside of a Task or a callback. If there's a need for such code to call a low-level asyncio API, the :meth:`loop.call_soon_threadsafe` method should be used, e.g.::
ru: Почти все объекты asyncio не являются потокобезопасными, что обычно не является проблемой, если нет кода, который работает с ними вне задачи или обратного вызова. Если необходимо, чтобы такой код вызывал низкоуровневый асинхронный API, следует использовать метод :meth:`loop.call_soon_threadsafe`, например::

source: To schedule a coroutine object from a different OS thread, the :func:`run_coroutine_threadsafe` function should be used. It returns a :class:`concurrent.futures.Future` to access the result::
ru: Чтобы запланировать объект сопрограммы из другого потока ОС, следует использовать функцию :func:`run_coroutine_threadsafe`. Он возвращает :class:`concurrent.futures.Future` для доступа к результату::

source: To handle signals the event loop must be run in the main thread.
ru: Для обработки сигналов цикл событий должен запускаться в основном потоке.

source: The :meth:`loop.run_in_executor` method can be used with a :class:`concurrent.futures.ThreadPoolExecutor` to execute blocking code in a different OS thread without blocking the OS thread that the event loop runs in.
ru: Метод :meth:`loop.run_in_executor` можно использовать с :class:`concurrent.futures.ThreadPoolExecutor` для выполнения блокирующего кода в другом потоке ОС без блокировки потока ОС, в котором выполняется цикл событий.

source: There is currently no way to schedule coroutines or callbacks directly from a different process (such as one started with :mod:`multiprocessing`). The :ref:`asyncio-event-loop-methods` section lists APIs that can read from pipes and watch file descriptors without blocking the event loop. In addition, asyncio's :ref:`Subprocess <asyncio-subprocess>` APIs provide a way to start a process and communicate with it from the event loop. Lastly, the aforementioned :meth:`loop.run_in_executor` method can also be used with a :class:`concurrent.futures.ProcessPoolExecutor` to execute code in a different process.
ru: В настоящее время невозможно запланировать сопрограммы или обратные вызовы непосредственно из другого процесса (например, запущенного с :mod:`multiprocessing`). В разделе :ref:`asyncio-event-loop-methods` перечислены API, которые могут читать из каналов и просматривать файловые дескрипторы, не блокируя цикл событий. Кроме того, API-интерфейсы :ref:`Subprocess <asyncio-subprocess>` asyncio предоставляют способ запустить процесс и взаимодействовать с ним из цикла событий. Наконец, вышеупомянутый метод :meth:`loop.run_in_executor` также можно использовать с :class:`concurrent.futures.ProcessPoolExecutor` для выполнения кода в другом процессе.

source: Running Blocking Code
ru: Запуск блокирующего кода

source: Blocking (CPU-bound) code should not be called directly. For example, if a function performs a CPU-intensive calculation for 1 second, all concurrent asyncio Tasks and IO operations would be delayed by 1 second.
ru: Блокирующий (привязанный к процессору) код не следует вызывать напрямую. Например, если функция выполняет вычисления с интенсивным использованием ЦП в течение 1 секунды, все одновременные асинхронные задачи и операции ввода-вывода будут задержаны на 1 секунду.

source: An executor can be used to run a task in a different thread or even in a different process to avoid blocking the OS thread with the event loop. See the :meth:`loop.run_in_executor` method for more details.
ru: Исполнитель можно использовать для запуска задачи в другом потоке или даже в другом процессе, чтобы избежать блокировки потока ОС с помощью цикла событий. Подробнее см. в методе :meth:`loop.run_in_executor`.

source: Logging
ru: Логирование

source: asyncio uses the :mod:`logging` module and all logging is performed via the ``"asyncio"`` logger.
ru: asyncio использует модуль :mod:`logging`, и все журналирование выполняется с помощью регистратора ``"asyncio"``.

source: The default log level is :py:const:`logging.INFO`, which can be easily adjusted::
ru: Уровень журнала по умолчанию — :py:const:`logging.INFO`, который можно легко настроить::

source: Network logging can block the event loop. It is recommended to use a separate thread for handling logs or use non-blocking IO. For example, see :ref:`blocking-handlers`.
ru: Ведение журнала сети может заблокировать цикл событий. Рекомендуется использовать отдельный поток для обработки логов или использовать неблокирующий ввод-вывод. Например, см. :ref:`blocking-handlers`.

source: Detect never-awaited coroutines
ru: Обнаружение неожиданных сопрограмм

source: When a coroutine function is called, but not awaited (e.g. ``coro()`` instead of ``await coro()``) or the coroutine is not scheduled with :meth:`asyncio.create_task`, asyncio will emit a :exc:`RuntimeWarning`::
ru: Когда функция сопрограммы вызывается, но не ожидается (например, ``coro()`` вместо ``await coro()``) или сопрограмма не запланирована с помощью :meth:`asyncio.create_task`, asyncio выдаст сообщение :exc:`RuntimeWarning`::

source: Output::
ru: Вывод::

source: test.py:7: RuntimeWarning: coroutine 'test' was never awaited test()
ru: test.py:7: RuntimeWarning: сопрограмма «тест» никогда не ожидалась тест()

source: Output in debug mode::
ru: Вывод в режиме отладки::

source: The usual fix is to either await the coroutine or call the :meth:`asyncio.create_task` function::
ru: Обычное решение — либо дождаться сопрограммы, либо вызвать функцию :meth:`asyncio.create_task`::

source: Detect never-retrieved exceptions
ru: Обнаружение никогда не извлекаемых исключений

source: If a :meth:`Future.set_exception` is called but the Future object is never awaited on, the exception would never be propagated to the user code. In this case, asyncio would emit a log message when the Future object is garbage collected.
ru: Если :meth:`Future.set_Exception` вызывается, но объект Future никогда не ожидается, исключение никогда не будет распространено на пользовательский код. В этом случае asyncio выдаст сообщение журнала, когда объект Future будет собран мусором.

source: Example of an unhandled exception::
ru: Пример необработанного исключения::

source: Task exception was never retrieved future: <Task finished coro=<bug() done, defined at test.py:3> exception=Exception('not consumed')> Traceback (most recent call last): File "test.py", line 4, in bug raise Exception("not consumed") Exception: not consumed
ru: Исключение задачи никогда не было получено будущее: <Задача завершена coro=<bug() выполнена, определено в test.py:3> исключение=Исключение('не используется')> Traceback (последний вызов последний): Файл «test.py», строка 4, в ошибке поднять исключение («не использовано») Исключение: не потребляется

source: :ref:`Enable the debug mode <asyncio-debug-mode>` to get the traceback where the task was created::
ru: :ref:`Включите режим отладки <asyncio-debug-mode>`, чтобы получить обратную трассировку места создания задачи::
