Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/asyncio-future.po
Languages: ru

source: Futures
ru: Фьючерсы

source: **Source code:** :source:`Lib/asyncio/futures.py`, :source:`Lib/asyncio/base_futures.py`
ru: **Исходный код:** :source:`Lib/asyncio/futures.py`, :source:`Lib/asyncio/base_futures.py`

source: *Future* objects are used to bridge **low-level callback-based code** with high-level async/await code.
ru: Объекты *Future* используются для соединения **низкоуровневого кода обратного вызова** с высокоуровневым кодом async/await.

source: Future Functions
ru: Будущие функции

source: Return ``True`` if *obj* is either of:
ru: Верните ``True``, если *obj* имеет одно из следующих значений:

source: an instance of :class:`asyncio.Future`,
ru: экземпляр :class:`asyncio.Future`,

source: an instance of :class:`asyncio.Task`,
ru: экземпляр :class:`asyncio.Task`,

source: a Future-like object with a ``_asyncio_future_blocking`` attribute.
ru: объект типа Future с атрибутом ``_asyncio_future_blocking``.

source: Return:
ru: Возвращаться:

source: *obj* argument as is, if *obj* is a :class:`Future`, a :class:`Task`, or a Future-like object (:func:`isfuture` is used for the test.)
ru: Аргумент *obj* как есть, если *obj* является :class:`Future`, :class:`Task` или объектом, подобным Future (для теста используется :func:`isfuture`.)

source: a :class:`Task` object wrapping *obj*, if *obj* is a coroutine (:func:`iscoroutine` is used for the test); in this case the coroutine will be scheduled by ``ensure_future()``.
ru: обертка объекта :class:`Task` *obj*, если *obj* является сопрограммой (для теста используется :func:`iscoroutine`); в этом случае сопрограмма будет запланирована с помощью ``ensure_future()``.

source: a :class:`Task` object that would await on *obj*, if *obj* is an awaitable (:func:`inspect.isawaitable` is used for the test.)
ru: объект :class:`Task`, который будет ожидать *obj*, если *obj* является ожидаемым (для теста используется :func:`inspect.isawaitable`).

source: If *obj* is neither of the above a :exc:`TypeError` is raised.
ru: Если *obj* не является ни одним из вышеперечисленных, возникает ошибка :exc:`TypeError`.

source: See also the :func:`create_task` function which is the preferred way for creating new Tasks.
ru: См. также функцию :func:`create_task`, которая является предпочтительным способом создания новых задач.

source: Save a reference to the result of this function, to avoid a task disappearing mid-execution.
ru: Сохраните ссылку на результат этой функции, чтобы избежать исчезновения задачи в середине выполнения.

source: The function accepts any :term:`awaitable` object.
ru: Функция принимает любой объект :term:`awaitable`.

source: Deprecation warning is emitted if *obj* is not a Future-like object and *loop* is not specified and there is no running event loop.
ru: Предупреждение об устаревании выдается, если *obj* не является объектом типа Future, а *loop* не указан и нет текущего цикла событий.

source: Wrap a :class:`concurrent.futures.Future` object in a :class:`asyncio.Future` object.
ru: Оберните объект :class:`concurrent.futures.Future` в объект :class:`asyncio.Future`.

source: Deprecation warning is emitted if *future* is not a Future-like object and *loop* is not specified and there is no running event loop.
ru: Предупреждение об устаревании выдается, если *future* не является объектом типа Future, а *loop* не указан и нет текущего цикла событий.

source: Future Object
ru: Будущий объект

source: A Future represents an eventual result of an asynchronous operation. Not thread-safe.
ru: Future представляет собой конечный результат асинхронной операции. Не потокобезопасный.

source: Future is an :term:`awaitable` object. Coroutines can await on Future objects until they either have a result or an exception set, or until they are cancelled. A Future can be awaited multiple times and the result is same.
ru: Future — это :term:`awaitable` объект. Сопрограммы могут ожидать объектов Future до тех пор, пока для них не будет установлен результат или исключение, или пока они не будут отменены. Future можно ожидать несколько раз, и результат будет одинаковым.

source: Typically Futures are used to enable low-level callback-based code (e.g. in protocols implemented using asyncio :ref:`transports <asyncio-transports-protocols>`) to interoperate with high-level async/await code.
ru: Обычно Futures используются для обеспечения возможности низкоуровневого кода на основе обратного вызова (например, в протоколах, реализованных с использованием asyncio :ref:`transports <asyncio-transports-protocols>`) для взаимодействия с высокоуровневым кодом async/await.

source: The rule of thumb is to never expose Future objects in user-facing APIs, and the recommended way to create a Future object is to call :meth:`loop.create_future`. This way alternative event loop implementations can inject their own optimized implementations of a Future object.
ru: Эмпирическое правило заключается в том, чтобы никогда не раскрывать объекты Future в API-интерфейсах, ориентированных на пользователя, и рекомендуемый способ создания объекта Future — вызвать :meth:`loop.create_future`. Таким образом, альтернативные реализации цикла событий могут внедрять собственные оптимизированные реализации объекта Future.

source: Added support for the :mod:`contextvars` module.
ru: Добавлена ​​поддержка модуля :mod:`contextvars`.

source: Deprecation warning is emitted if *loop* is not specified and there is no running event loop.
ru: Предупреждение об устаревании выдается, если *loop* не указан и нет работающего цикла событий.

source: Return the result of the Future.
ru: Вернуть результат Future.

source: If the Future is *done* and has a result set by the :meth:`set_result` method, the result value is returned.
ru: Если Future выполнено *done* и имеет результат, установленный методом :meth:`set_result`, возвращается значение результата.

source: If the Future is *done* and has an exception set by the :meth:`set_exception` method, this method raises the exception.
ru: Если Future *done* и имеет исключение, установленное методом :meth:`set_Exception`, этот метод вызывает исключение.

source: If the Future has been *cancelled*, this method raises a :exc:`CancelledError` exception.
ru: Если Future было *отменено*, этот метод вызывает исключение :exc:`CancelledError`.

source: If the Future's result isn't yet available, this method raises an :exc:`InvalidStateError` exception.
ru: Если результат Future еще недоступен, этот метод вызывает исключение :exc:`InvalidStateError`.

source: Mark the Future as *done* and set its result.
ru: Отметьте будущее как *готовое* и установите его результат.

source: Raises an :exc:`InvalidStateError` error if the Future is already *done*.
ru: Вызывает ошибку :exc:`InvalidStateError`, если Future уже *сделано*.

source: Mark the Future as *done* and set an exception.
ru: Отметьте будущее как *выполненное* и установите исключение.

source: Return ``True`` if the Future is *done*.
ru: Верните ``True``, если Future *сделано*.

source: A Future is *done* if it was *cancelled* or if it has a result or an exception set with :meth:`set_result` or :meth:`set_exception` calls.
ru: Фьючерс считается *выполненным*, если он был *отменен* или если у него есть результат или исключение, установленное с помощью вызовов :meth:`set_result` или :meth:`set_Exception`.

source: Return ``True`` if the Future was *cancelled*.
ru: Верните ``True``, если Future было *отменено*.

source: The method is usually used to check if a Future is not *cancelled* before setting a result or an exception for it::
ru: Этот метод обычно используется для проверки того, не *отменено* ли будущее, прежде чем устанавливать для него результат или исключение::

source: Add a callback to be run when the Future is *done*.
ru: Добавьте обратный вызов, который будет выполняться, когда Future *готово*.

source: The *callback* is called with the Future object as its only argument.
ru: *Обратный вызов* вызывается с объектом Future в качестве единственного аргумента.

source: If the Future is already *done* when this method is called, the callback is scheduled with :meth:`loop.call_soon`.
ru: Если Future уже *сделано*, когда вызывается этот метод, обратный вызов запланирован с помощью :meth:`loop.call_soon`.

source: An optional keyword-only *context* argument allows specifying a custom :class:`contextvars.Context` for the *callback* to run in. The current context is used when no *context* is provided.
ru: Необязательный аргумент *context*, содержащий только ключевые слова, позволяет указать собственный :class:`contextvars.Context` для выполнения *обратного вызова*. Текущий контекст используется, когда *context* не указан.

source: :func:`functools.partial` can be used to pass parameters to the callback, e.g.::
ru: :func:`functools.partial` можно использовать для передачи параметров обратному вызову, например::

source: # Call 'print("Future:", fut)' when "fut" is done. fut.add_done_callback( functools.partial(print, "Future:"))
ru: # Вызовите 'print("Future:", fut)', когда "fut" будет выполнен. fut.add_done_callback( functools.partial(print, "Будущее:"))

source: The *context* keyword-only parameter was added. See :pep:`567` for more details.
ru: Был добавлен параметр *context*, доступный только по ключевым словам. См. :pep:`567` для более подробной информации.

source: Remove *callback* from the callbacks list.
ru: Удалите *callback* из списка обратных вызовов.

source: Returns the number of callbacks removed, which is typically 1, unless a callback was added more than once.
ru: Возвращает количество удаленных обратных вызовов, которое обычно равно 1, если обратный вызов не добавлялся более одного раза.

source: Cancel the Future and schedule callbacks.
ru: Отмените будущее и запланируйте обратные вызовы.

source: If the Future is already *done* or *cancelled*, return ``False``. Otherwise, change the Future's state to *cancelled*, schedule the callbacks, and return ``True``.
ru: Если Future уже *сделано* или *отменено*, верните ``False``. В противном случае измените состояние Future на *cancelled*, запланируйте обратные вызовы и верните ``True``.

source: Added the *msg* parameter.
ru: Добавлен параметр *msg*.

source: Return the exception that was set on this Future.
ru: Верните исключение, которое было установлено в этом будущем.

source: The exception (or ``None`` if no exception was set) is returned only if the Future is *done*.
ru: Исключение (или None, если исключение не было установлено) возвращается только в том случае, если Future выполнено *done*.

source: If the Future isn't *done* yet, this method raises an :exc:`InvalidStateError` exception.
ru: Если Future еще не *сделано*, этот метод вызывает исключение :exc:`InvalidStateError`.

source: Return the event loop the Future object is bound to.
ru: Верните цикл событий, к которому привязан объект Future.

source: This example creates a Future object, creates and schedules an asynchronous Task to set result for the Future, and waits until the Future has a result::
ru: В этом примере создается объект Future, создается и планируется асинхронная задача для установки результата для Future, и ожидается, пока Future не получит результат:

source: The Future object was designed to mimic :class:`concurrent.futures.Future`. Key differences include:
ru: Объект Future был разработан для имитации :class:`concurrent.futures.Future`. Ключевые различия включают в себя:

source: unlike asyncio Futures, :class:`concurrent.futures.Future` instances cannot be awaited.
ru: в отличие от asyncio Futures, экземпляры :class:`concurrent.futures.Future` не могут быть ожидаемы.

source: :meth:`asyncio.Future.result` and :meth:`asyncio.Future.exception` do not accept the *timeout* argument.
ru: :meth:`asyncio.Future.result` и :meth:`asyncio.Future.Exception` не принимают аргумент *timeout*.

source: :meth:`asyncio.Future.result` and :meth:`asyncio.Future.exception` raise an :exc:`InvalidStateError` exception when the Future is not *done*.
ru: :meth:`asyncio.Future.result` и :meth:`asyncio.Future.Exception` вызывают исключение :exc:`InvalidStateError`, когда Future не *выполнено*.

source: Callbacks registered with :meth:`asyncio.Future.add_done_callback` are not called immediately. They are scheduled with :meth:`loop.call_soon` instead.
ru: Обратные вызовы, зарегистрированные с помощью :meth:`asyncio.Future.add_done_callback`, не вызываются немедленно. Вместо этого они планируются с помощью :meth:`loop.call_soon`.

source: asyncio Future is not compatible with the :func:`concurrent.futures.wait` and :func:`concurrent.futures.as_completed` functions.
ru: asyncio Future несовместим с функциями :func:`concurrent.futures.wait` и :func:`concurrent.futures.as_completed`.

source: :meth:`asyncio.Future.cancel` accepts an optional ``msg`` argument, but :meth:`concurrent.futures.Future.cancel` does not.
ru: :meth:`asyncio.Future.cancel` принимает необязательный аргумент ``msg``, а :meth:`concurrent.futures.Future.cancel` — нет.
