Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/asyncio-eventloop.po
Languages: ru

source: Event Loop
ru: Цикл событий

source: **Source code:** :source:`Lib/asyncio/events.py`, :source:`Lib/asyncio/base_events.py`
ru: **Исходный код:** :source:`Lib/asyncio/events.py`, :source:`Lib/asyncio/base_events.py`

source: Preface
ru: Введение

source: The event loop is the core of every asyncio application. Event loops run asynchronous tasks and callbacks, perform network IO operations, and run subprocesses.
ru: Цикл событий — это ядро ​​каждого асинхронного приложения. Циклы событий запускают асинхронные задачи и обратные вызовы, выполняют сетевые операции ввода-вывода и запускают подпроцессы.

source: Application developers should typically use the high-level asyncio functions, such as :func:`asyncio.run`, and should rarely need to reference the loop object or call its methods. This section is intended mostly for authors of lower-level code, libraries, and frameworks, who need finer control over the event loop behavior.
ru: Разработчикам приложений обычно следует использовать функции asyncio высокого уровня, такие как :func:`asyncio.run`, и им редко приходится ссылаться на объект цикла или вызывать его методы. Этот раздел предназначен в основном для авторов низкоуровневого кода, библиотек и фреймворков, которым требуется более тонкий контроль над поведением цикла событий.

source: Obtaining the Event Loop
ru: Получение цикла событий

source: The following low-level functions can be used to get, set, or create an event loop:
ru: Следующие низкоуровневые функции можно использовать для получения, установки или создания цикла событий:

source: Return the running event loop in the current OS thread.
ru: Верните текущий цикл событий в текущий поток ОС.

source: Raise a :exc:`RuntimeError` if there is no running event loop.
ru: Вызовите :exc:`RuntimeError`, если нет текущего цикла событий.

source: This function can only be called from a coroutine or a callback.
ru: Эту функцию можно вызвать только из сопрограммы или обратного вызова.

source: Get the current event loop.
ru: Получить текущий цикл событий.

source: When called from a coroutine or a callback (e.g. scheduled with call_soon or similar API), this function will always return the running event loop.
ru: При вызове из сопрограммы или обратного вызова (например, запланированного с помощью call_soon или аналогичного API) эта функция всегда будет возвращать текущий цикл событий.

source: If there is no running event loop set, the function will return the result of the ``get_event_loop_policy().get_event_loop()`` call.
ru: Если не установлен текущий цикл событий, функция вернет результат вызова ``get_event_loop_policy().get_event_loop()``.

source: Because this function has rather complex behavior (especially when custom event loop policies are in use), using the :func:`get_running_loop` function is preferred to :func:`get_event_loop` in coroutines and callbacks.
ru: Поскольку эта функция имеет довольно сложное поведение (особенно когда используются пользовательские политики цикла событий), использование функции :func:`get_running_loop` предпочтительнее, чем :func:`get_event_loop` в сопрограммах и обратных вызовах.

source: As noted above, consider using the higher-level :func:`asyncio.run` function, instead of using these lower level functions to manually create and close an event loop.
ru: Как отмечалось выше, рассмотрите возможность использования функции :func:`asyncio.run` более высокого уровня вместо использования этих функций более низкого уровня для ручного создания и закрытия цикла событий.

source: Deprecation warning is emitted if there is no current event loop. In some future Python release this will become an error.
ru: Предупреждение об устаревании выдается, если текущий цикл событий отсутствует. В некоторых будущих выпусках Python это станет ошибкой.

source: Set *loop* as the current event loop for the current OS thread.
ru: Установите *loop* в качестве текущего цикла событий для текущего потока ОС.

source: Create and return a new event loop object.
ru: Создайте и верните новый объект цикла событий.

source: Note that the behaviour of :func:`get_event_loop`, :func:`set_event_loop`, and :func:`new_event_loop` functions can be altered by :ref:`setting a custom event loop policy <asyncio-policies>`.
ru: Обратите внимание, что поведение функций :func:`get_event_loop`, :func:`set_event_loop` и :func:`new_event_loop` можно изменить, :ref:`устанавливая пользовательскую политику цикла событий <asyncio-policies>`.

source: Contents
ru: Содержание

source: This documentation page contains the following sections:
ru: Эта страница документации содержит следующие разделы:

source: The `Event Loop Methods`_ section is the reference documentation of the event loop APIs;
ru: Раздел «Методы цикла событий» представляет собой справочную документацию по API цикла событий;

source: The `Callback Handles`_ section documents the :class:`Handle` and :class:`TimerHandle` instances which are returned from scheduling methods such as :meth:`loop.call_soon` and :meth:`loop.call_later`;
ru: В разделе `Callback Handles`_ описаны экземпляры :class:`Handle` и :class:`TimerHandle`, которые возвращаются из методов планирования, таких как :meth:`loop.call_soon` и :meth:`loop.call_later`;

source: The `Server Objects`_ section documents types returned from event loop methods like :meth:`loop.create_server`;
ru: Типы документов раздела `Server Objects`_, возвращаемые методами цикла событий, такими как :meth:`loop.create_server`;

source: The `Event Loop Implementations`_ section documents the :class:`SelectorEventLoop` and :class:`ProactorEventLoop` classes;
ru: В разделе `Реализации цикла событий`_ описаны классы :class:`SelectorEventLoop` и :class:`ProactorEventLoop`;

source: The `Examples`_ section showcases how to work with some event loop APIs.
ru: В разделе «Примеры» показано, как работать с некоторыми API-интерфейсами цикла событий.

source: Event Loop Methods
ru: Методы цикла событий

source: Event loops have **low-level** APIs for the following:
ru: Циклы событий имеют **низкоуровневые** API для следующих целей:

source: Running and stopping the loop
ru: Запуск и остановка цикла

source: Run until the *future* (an instance of :class:`Future`) has completed.
ru: Выполнять до тех пор, пока *future* (экземпляр :class:`Future`) не завершится.

source: If the argument is a :ref:`coroutine object <coroutine>` it is implicitly scheduled to run as a :class:`asyncio.Task`.
ru: Если аргументом является :ref:`объект сопрограммы <coroutine>`, он неявно запланирован для запуска как :class:`asyncio.Task`.

source: Return the Future's result or raise its exception.
ru: Верните результат Future или вызовите его исключение.

source: Run the event loop until :meth:`stop` is called.
ru: Запускайте цикл событий до тех пор, пока не будет вызван :meth:`stop`.

source: If :meth:`stop` is called before :meth:`run_forever` is called, the loop will poll the I/O selector once with a timeout of zero, run all callbacks scheduled in response to I/O events (and those that were already scheduled), and then exit.
ru: Если :meth:`stop` вызывается до вызова :meth:`run_forever`, цикл один раз опрашивает селектор ввода-вывода с нулевым тайм-аутом, запускает все запланированные обратные вызовы в ответ на события ввода-вывода (и те, которые уже запланированы), а затем выйти.

source: If :meth:`stop` is called while :meth:`run_forever` is running, the loop will run the current batch of callbacks and then exit. Note that new callbacks scheduled by callbacks will not run in this case; instead, they will run the next time :meth:`run_forever` or :meth:`run_until_complete` is called.
ru: Если :meth:`stop` вызывается во время работы :meth:`run_forever`, цикл выполнит текущий пакет обратных вызовов и затем завершит работу. Обратите внимание, что новые обратные вызовы, запланированные обратными вызовами, в этом случае не будут выполняться; вместо этого они будут запущены при следующем вызове :meth:`run_forever` или :meth:`run_until_complete`.

source: Stop the event loop.
ru: Остановите цикл событий.

source: Return ``True`` if the event loop is currently running.
ru: Верните ``True``, если цикл обработки событий в данный момент выполняется.

source: Return ``True`` if the event loop was closed.
ru: Верните True, если цикл обработки событий был закрыт.

source: Close the event loop.
ru: Закройте цикл событий.

source: The loop must not be running when this function is called. Any pending callbacks will be discarded.
ru: Цикл не должен выполняться при вызове этой функции. Любые ожидающие обратные вызовы будут отменены.

source: This method clears all queues and shuts down the executor, but does not wait for the executor to finish.
ru: Этот метод очищает все очереди и завершает работу исполнителя, но не дожидается его завершения.

source: This method is idempotent and irreversible. No other methods should be called after the event loop is closed.
ru: Этот метод идемпотентен и необратим. Никакие другие методы не должны вызываться после закрытия цикла обработки событий.

source: Schedule all currently open :term:`asynchronous generator` objects to close with an :meth:`~agen.aclose` call. After calling this method, the event loop will issue a warning if a new asynchronous generator is iterated. This should be used to reliably finalize all scheduled asynchronous generators.
ru: Запланируйте закрытие всех открытых в данный момент объектов асинхронного генератора с помощью вызова :meth:`~agen.aclose`. После вызова этого метода цикл событий выдаст предупреждение, если будет запущен новый асинхронный генератор. Это следует использовать для надежной финализации всех запланированных асинхронных генераторов.

source: Note that there is no need to call this function when :func:`asyncio.run` is used.
ru: Обратите внимание, что нет необходимости вызывать эту функцию, когда используется :func:`asyncio.run`.

source: Example::
ru: Пример::

source: Schedule the closure of the default executor and wait for it to join all of the threads in the :class:`~concurrent.futures.ThreadPoolExecutor`. Once this method has been called, using the default executor with :meth:`loop.run_in_executor` will raise a :exc:`RuntimeError`.
ru: Запланируйте закрытие исполнителя по умолчанию и подождите, пока он присоединится ко всем потокам в :class:`~concurrent.futures.ThreadPoolExecutor`. После вызова этого метода использование исполнителя по умолчанию с :meth:`loop.run_in_executor` вызовет :exc:`RuntimeError`.

source: The *timeout* parameter specifies the amount of time (in :class:`float` seconds) the executor will be given to finish joining. With the default, ``None``, the executor is allowed an unlimited amount of time.
ru: Параметр *timeout* указывает количество времени (в секундах), которое будет предоставлено исполнителю для завершения присоединения. При значении по умолчанию «Нет» исполнителю разрешено неограниченное количество времени.

source: If the *timeout* is reached, a :exc:`RuntimeWarning` is emitted and the default executor is terminated without waiting for its threads to finish joining.
ru: Если *тайм-аут* достигнут, выдается :exc:`RuntimeWarning` и исполнитель по умолчанию завершается, не дожидаясь завершения соединения своих потоков.

source: Do not call this method when using :func:`asyncio.run`, as the latter handles default executor shutdown automatically.
ru: Не вызывайте этот метод при использовании :func:`asyncio.run`, поскольку последний автоматически обрабатывает завершение работы исполнителя по умолчанию.

source: Added the *timeout* parameter.
ru: Добавлен параметр *timeout*.

source: Scheduling callbacks
ru: Планирование обратных вызовов

source: Schedule the *callback* :term:`callback` to be called with *args* arguments at the next iteration of the event loop.
ru: Запланируйте вызов *callback* :term:`callback` с аргументами *args* на следующей итерации цикла обработки событий.

source: Return an instance of :class:`asyncio.Handle`, which can be used later to cancel the callback.
ru: Верните экземпляр :class:`asyncio.Handle`, который можно использовать позже для отмены обратного вызова.

source: Callbacks are called in the order in which they are registered. Each callback will be called exactly once.
ru: Обратные вызовы вызываются в том порядке, в котором они зарегистрированы. Каждый обратный вызов будет вызван ровно один раз.

source: The optional keyword-only *context* argument specifies a custom :class:`contextvars.Context` for the *callback* to run in. Callbacks use the current context when no *context* is provided.
ru: Необязательный аргумент *context*, содержащий только ключевые слова, указывает пользовательский :class:`contextvars.Context` для выполнения *обратного вызова*. Обратные вызовы используют текущий контекст, если *context* не указан.

source: Unlike :meth:`call_soon_threadsafe`, this method is not thread-safe.
ru: В отличие от :meth:`call_soon_threadsafe`, этот метод не является потокобезопасным.

source: A thread-safe variant of :meth:`call_soon`. When scheduling callbacks from another thread, this function *must* be used, since :meth:`call_soon` is not thread-safe.
ru: Потокобезопасный вариант :meth:`call_soon`. При планировании обратных вызовов из другого потока эта функция *должна* использоваться, поскольку :meth:`call_soon` не является потокобезопасным.

source: Raises :exc:`RuntimeError` if called on a loop that's been closed. This can happen on a secondary thread when the main application is shutting down.
ru: Вызывает :exc:`RuntimeError`, если вызывается в закрытом цикле. Это может произойти во вторичном потоке, когда основное приложение завершает работу.

source: See the :ref:`concurrency and multithreading <asyncio-multithreading>` section of the documentation.
ru: См. раздел документации о :ref:`параллелизме и многопоточности <asyncio-multithreading>`.

source: The *context* keyword-only parameter was added. See :pep:`567` for more details.
ru: Был добавлен параметр *context*, доступный только по ключевым словам. См. :pep:`567` для более подробной информации.

source: Most :mod:`asyncio` scheduling functions don't allow passing keyword arguments. To do that, use :func:`functools.partial`::
ru: Большинство функций планирования :mod:`asyncio` не позволяют передавать аргументы ключевых слов. Для этого используйте :func:`functools.partial`::

source: Using partial objects is usually more convenient than using lambdas, as asyncio can render partial objects better in debug and error messages.
ru: Использование частичных объектов обычно более удобно, чем использование лямбда-выражений, поскольку asyncio может лучше отображать частичные объекты в сообщениях отладки и ошибках.

source: Scheduling delayed callbacks
ru: Планирование отложенных обратных вызовов

source: Event loop provides mechanisms to schedule callback functions to be called at some point in the future. Event loop uses monotonic clocks to track time.
ru: Цикл событий предоставляет механизмы для планирования вызова функций обратного вызова в определенный момент в будущем. Цикл событий использует монотонные часы для отслеживания времени.

source: Schedule *callback* to be called after the given *delay* number of seconds (can be either an int or a float).
ru: Запланируйте вызов *callback* через заданное *delay* количество секунд (может быть как int, так и с плавающей запятой).

source: An instance of :class:`asyncio.TimerHandle` is returned which can be used to cancel the callback.
ru: Возвращается экземпляр :class:`asyncio.TimerHandle`, который можно использовать для отмены обратного вызова.

source: *callback* will be called exactly once. If two callbacks are scheduled for exactly the same time, the order in which they are called is undefined.
ru: *callback* будет вызван ровно один раз. Если два обратных вызова запланированы на одно и то же время, порядок их вызова не определен.

source: The optional positional *args* will be passed to the callback when it is called. If you want the callback to be called with keyword arguments use :func:`functools.partial`.
ru: Необязательный позиционный *args* будет передан обратному вызову при его вызове. Если вы хотите, чтобы обратный вызов вызывался с ключевыми словами, используйте :func:`functools.partial`.

source: An optional keyword-only *context* argument allows specifying a custom :class:`contextvars.Context` for the *callback* to run in. The current context is used when no *context* is provided.
ru: Необязательный аргумент *context*, содержащий только ключевые слова, позволяет указать собственный :class:`contextvars.Context` для выполнения *обратного вызова*. Текущий контекст используется, когда *context* не указан.

source: In Python 3.7 and earlier with the default event loop implementation, the *delay* could not exceed one day. This has been fixed in Python 3.8.
ru: В Python 3.7 и более ранних версиях с реализацией цикла событий по умолчанию *задержка* не могла превышать одного дня. Это было исправлено в Python 3.8.

source: Schedule *callback* to be called at the given absolute timestamp *when* (an int or a float), using the same time reference as :meth:`loop.time`.
ru: Запланируйте вызов *callback* в заданную абсолютную временную метку *when* (int или float), используя ту же ссылку на время, что и :meth:`loop.time`.

source: This method's behavior is the same as :meth:`call_later`.
ru: Поведение этого метода такое же, как и у :meth:`call_later`.

source: In Python 3.7 and earlier with the default event loop implementation, the difference between *when* and the current time could not exceed one day. This has been fixed in Python 3.8.
ru: В Python 3.7 и более ранних версиях с реализацией цикла событий по умолчанию разница между *when* и текущим временем не могла превышать одного дня. Это было исправлено в Python 3.8.

source: Return the current time, as a :class:`float` value, according to the event loop's internal monotonic clock.
ru: Возвращает текущее время в виде значения :class:`float` в соответствии с внутренними монотонными часами цикла событий.

source: In Python 3.7 and earlier timeouts (relative *delay* or absolute *when*) should not exceed one day. This has been fixed in Python 3.8.
ru: В Python 3.7 и более ранних версиях таймауты (относительная *задержка* или абсолютные *когда*) не должны превышать один день. Это было исправлено в Python 3.8.

source: The :func:`asyncio.sleep` function.
ru: Функция :func:`asyncio.sleep`

source: Creating Futures and Tasks
ru: Создание будущего и задач

source: Create an :class:`asyncio.Future` object attached to the event loop.
ru: Создайте объект :class:`asyncio.Future`, прикрепленный к циклу событий.

source: This is the preferred way to create Futures in asyncio. This lets third-party event loops provide alternative implementations of the Future object (with better performance or instrumentation).
ru: Это предпочтительный способ создания фьючерсов в asyncio. Это позволяет сторонним циклам событий предоставлять альтернативные реализации объекта Future (с лучшей производительностью или инструментированием).

source: Schedule the execution of :ref:`coroutine <coroutine>` *coro*. Return a :class:`Task` object.
ru: Запланируйте выполнение :ref:`coroutine <coroutine>` *coro*. Верните объект :class:`Task`.

source: Third-party event loops can use their own subclass of :class:`Task` for interoperability. In this case, the result type is a subclass of :class:`Task`.
ru: Сторонние циклы событий могут использовать собственный подкласс :class:`Task` для обеспечения совместимости. В этом случае тип результата является подклассом :class:`Task`.

source: If the *name* argument is provided and not ``None``, it is set as the name of the task using :meth:`Task.set_name`.
ru: Если указан аргумент *name*, а не ``None``, он устанавливается как имя задачи с использованием :meth:`Task.set_name`.

source: An optional keyword-only *context* argument allows specifying a custom :class:`contextvars.Context` for the *coro* to run in. The current context copy is created when no *context* is provided.
ru: Необязательный аргумент *context*, содержащий только ключевые слова, позволяет указать собственный :class:`contextvars.Context` для запуска *coro*. Текущая копия контекста создается, когда *context* не указан.

source: Added the *name* parameter.
ru: Добавлен параметр *имя*.

source: Added the *context* parameter.
ru: Добавлен параметр *context*.

source: Set a task factory that will be used by :meth:`loop.create_task`.
ru: Установите фабрику задач, которая будет использоваться :meth:`loop.create_task`.

source: If *factory* is ``None`` the default task factory will be set. Otherwise, *factory* must be a *callable* with the signature matching ``(loop, coro, context=None)``, where *loop* is a reference to the active event loop, and *coro* is a coroutine object. The callable must return a :class:`asyncio.Future`-compatible object.
ru: Если *factory* имеет значение ``None``, будет установлена ​​фабрика задач по умолчанию. В противном случае *фабрика* должна быть *вызываемой* с сигнатурой, соответствующей ``(loop, coro, context=None)``, где *loop* — это ссылка на активный цикл событий, а *coro* — объект сопрограммы. . Вызываемый объект должен возвращать объект, совместимый с :class:`asyncio.Future`.

source: Return a task factory or ``None`` if the default one is in use.
ru: Возвращает фабрику задач или None, если используется фабрика по умолчанию.

source: Opening network connections
ru: Открытие сетевых подключений

source: Open a streaming transport connection to a given address specified by *host* and *port*.
ru: Откройте потоковое транспортное соединение по заданному адресу, указанному *host* и *port*.

source: The socket family can be either :py:const:`~socket.AF_INET` or :py:const:`~socket.AF_INET6` depending on *host* (or the *family* argument, if provided).
ru: Семейство сокетов может быть либо :py:const:`~socket.AF_INET`, либо :py:const:`~socket.AF_INET6` в зависимости от *host* (или аргумента *family*, если он указан).

source: The socket type will be :py:const:`~socket.SOCK_STREAM`.
ru: Тип сокета будет :py:const:`~socket.SOCK_STREAM`.

source: *protocol_factory* must be a callable returning an :ref:`asyncio protocol <asyncio-protocol>` implementation.
ru: *protocol_factory* должен быть вызываемым объектом, возвращающим реализацию протокола asyncio <asyncio-protocol>`.

source: This method will try to establish the connection in the background. When successful, it returns a ``(transport, protocol)`` pair.
ru: Этот метод попытается установить соединение в фоновом режиме. В случае успеха он возвращает пару ``(транспорт, протокол)``.

source: The chronological synopsis of the underlying operation is as follows:
ru: Хронологический синопсис основной операции следующий:

source: The connection is established and a :ref:`transport <asyncio-transport>` is created for it.
ru: Соединение устанавливается и для него создается транспорт <asyncio-transport>`.

source: *protocol_factory* is called without arguments and is expected to return a :ref:`protocol <asyncio-protocol>` instance.
ru: *protocol_factory* вызывается без аргументов и, как ожидается, вернет экземпляр протокола <asyncio-protocol>`.

source: The protocol instance is coupled with the transport by calling its :meth:`~BaseProtocol.connection_made` method.
ru: Экземпляр протокола соединяется с транспортом путем вызова его метода :meth:`~BaseProtocol.connection_made`.

source: A ``(transport, protocol)`` tuple is returned on success.
ru: В случае успеха возвращается кортеж ``(транспорт, протокол)``.

source: The created transport is an implementation-dependent bidirectional stream.
ru: Созданный транспорт представляет собой двунаправленный поток, зависящий от реализации.

source: Other arguments:
ru: Другие аргументы:
