Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/asyncio-policy.po
Languages: ru

source: Policies
ru: Политика

source: Policy objects should implement the APIs defined in the :class:`AbstractEventLoopPolicy` abstract base class.
ru: Объекты политики должны реализовывать API, определенные в абстрактном базовом классе :class:`AbstractEventLoopPolicy`.

source: Getting and Setting the Policy
ru: Получение и настройка политики

source: The following functions can be used to get and set the policy for the current process:
ru: Следующие функции можно использовать для получения и установки политики для текущего процесса:

source: Return the current process-wide policy.
ru: Верните текущую политику всего процесса.

source: Set the current process-wide policy to *policy*.
ru: Установите для текущей общепроцессной политики значение *policy*.

source: If *policy* is set to ``None``, the default policy is restored.
ru: Если для *policy* установлено значение None, восстанавливается политика по умолчанию.

source: Policy Objects
ru: Объекты политик

source: The abstract event loop policy base class is defined as follows:
ru: Базовый класс политики абстрактного цикла событий определяется следующим образом:

source: An abstract base class for asyncio policies.
ru: Абстрактный базовый класс для политик asyncio.

source: Get the event loop for the current context.
ru: Получите цикл событий для текущего контекста.

source: Return an event loop object implementing the :class:`AbstractEventLoop` interface.
ru: Возвращает объект цикла событий, реализующий интерфейс :class:`AbstractEventLoop`.

source: This method should never return ``None``.
ru: Этот метод никогда не должен возвращать None.

source: Set the event loop for the current context to *loop*.
ru: Установите цикл событий для текущего контекста на *loop*.

source: Create and return a new event loop object.
ru: Создайте и верните новый объект цикла событий.

source: Get a child process watcher object.
ru: Получите объект наблюдателя дочерних процессов.

source: Return a watcher object implementing the :class:`AbstractChildWatcher` interface.
ru: Возвращает объект-наблюдатель, реализующий интерфейс :class:`AbstractChildWatcher`.

source: This function is Unix specific.
ru: Эта функция специфична для Unix.

source: Set the current child process watcher to *watcher*.
ru: Установите наблюдателя текущего дочернего процесса на *watcher*.

source: asyncio ships with the following built-in policies:
ru: asyncio поставляется со следующими встроенными политиками:

source: The default asyncio policy. Uses :class:`SelectorEventLoop` on Unix and :class:`ProactorEventLoop` on Windows.
ru: Политика asyncio по умолчанию. Использует :class:`SelectorEventLoop` в Unix и :class:`ProactorEventLoop` в Windows.

source: There is no need to install the default policy manually. asyncio is configured to use the default policy automatically.
ru: Нет необходимости устанавливать политику по умолчанию вручную. asyncio настроен на автоматическое использование политики по умолчанию.

source: On Windows, :class:`ProactorEventLoop` is now used by default.
ru: В Windows :class:`ProactorEventLoop` теперь используется по умолчанию.

source: An alternative event loop policy that uses the :class:`SelectorEventLoop` event loop implementation.
ru: Альтернативная политика цикла событий, использующая реализацию цикла событий :class:`SelectorEventLoop`.

source: An alternative event loop policy that uses the :class:`ProactorEventLoop` event loop implementation.
ru: Альтернативная политика цикла событий, использующая реализацию цикла событий :class:`ProactorEventLoop`.

source: Process Watchers
ru: Наблюдатели за процессом

source: A process watcher allows customization of how an event loop monitors child processes on Unix. Specifically, the event loop needs to know when a child process has exited.
ru: Наблюдатель процессов позволяет настроить способ мониторинга дочерних процессов в Unix с помощью цикла событий. В частности, цикл событий должен знать, когда дочерний процесс завершился.

source: In asyncio, child processes are created with :func:`create_subprocess_exec` and :meth:`loop.subprocess_exec` functions.
ru: В asyncio дочерние процессы создаются с помощью функций :func:`create_subprocess_exec` и :meth:`loop.subprocess_exec`.

source: asyncio defines the :class:`AbstractChildWatcher` abstract base class, which child watchers should implement, and has four different implementations: :class:`ThreadedChildWatcher` (configured to be used by default), :class:`MultiLoopChildWatcher`, :class:`SafeChildWatcher`, and :class:`FastChildWatcher`.
ru: asyncio определяет абстрактный базовый класс :class:`AbstractChildWatcher`, который должны реализовать наблюдатели за детьми, и имеет четыре различных реализации: :class:`ThreadedChildWatcher` (настроен для использования по умолчанию), :class:`MultiLoopChildWatcher`, :class: `SafeChildWatcher` и :class:`FastChildWatcher`.

source: See also the :ref:`Subprocess and Threads <asyncio-subprocess-threads>` section.
ru: См. также раздел :ref:`Подпроцесс и потоки <asyncio-subprocess-threads>`.

source: The following two functions can be used to customize the child process watcher implementation used by the asyncio event loop:
ru: Следующие две функции можно использовать для настройки реализации наблюдателя дочерних процессов, используемой циклом событий asyncio:

source: Return the current child watcher for the current policy.
ru: Возвращает текущего дочернего наблюдателя для текущей политики.

source: Set the current child watcher to *watcher* for the current policy. *watcher* must implement methods defined in the :class:`AbstractChildWatcher` base class.
ru: Установите для текущего дочернего наблюдателя значение *watcher* для текущей политики. *watcher* должен реализовывать методы, определенные в базовом классе :class:`AbstractChildWatcher`.

source: Third-party event loops implementations might not support custom child watchers. For such event loops, using :func:`set_child_watcher` might be prohibited or have no effect.
ru: Сторонние реализации циклов событий могут не поддерживать пользовательские дочерние наблюдатели. Для таких циклов событий использование :func:`set_child_watcher` может быть запрещено или не иметь никакого эффекта.

source: Register a new child handler.
ru: Зарегистрируйте новый дочерний обработчик.

source: Arrange for ``callback(pid, returncode, *args)`` to be called when a process with PID equal to *pid* terminates. Specifying another callback for the same process replaces the previous handler.
ru: Организуйте вызов ``callback(pid, returncode, *args)``, когда процесс с PID, равным *pid*, завершается. Указание другого обратного вызова для того же процесса заменяет предыдущий обработчик.

source: The *callback* callable must be thread-safe.
ru: Вызываемая функция *callback* должна быть потокобезопасной.

source: Removes the handler for process with PID equal to *pid*.
ru: Удаляет обработчик процесса с PID, равным *pid*.

source: The function returns ``True`` if the handler was successfully removed, ``False`` if there was nothing to remove.
ru: Функция возвращает True, если обработчик был успешно удален, и False, если удалять нечего.

source: Attach the watcher to an event loop.
ru: Присоедините наблюдателя к циклу событий.

source: If the watcher was previously attached to an event loop, then it is first detached before attaching to the new loop.
ru: Если наблюдатель ранее был подключен к циклу событий, то перед подключением к новому циклу он сначала отключается.

source: Note: loop may be ``None``.
ru: Примечание: цикл может иметь значение «Нет».

source: Return ``True`` if the watcher is ready to use.
ru: Верните True, если наблюдатель готов к использованию.

source: Spawning a subprocess with *inactive* current child watcher raises :exc:`RuntimeError`.
ru: Порождение подпроцесса с *неактивным* текущим дочерним наблюдателем вызывает :exc:`RuntimeError`.

source: Close the watcher.
ru: Закройте наблюдатель.

source: This method has to be called to ensure that underlying resources are cleaned-up.
ru: Этот метод необходимо вызвать, чтобы гарантировать очистку базовых ресурсов.

source: This implementation starts a new waiting thread for every subprocess spawn.
ru: Эта реализация запускает новый поток ожидания для каждого запуска подпроцесса.

source: It works reliably even when the asyncio event loop is run in a non-main OS thread.
ru: Он работает надежно, даже если цикл событий asyncio запускается в неосновном потоке ОС.

source: This watcher is used by default.
ru: Этот наблюдатель используется по умолчанию.

source: This implementation registers a :py:data:`SIGCHLD` signal handler on instantiation. That can break third-party code that installs a custom handler for :py:data:`SIGCHLD` signal.
ru: Эта реализация регистрирует обработчик сигнала :py:data:`SIGCHLD` при создании экземпляра. Это может привести к поломке стороннего кода, который устанавливает собственный обработчик для сигнала :py:data:`SIGCHLD`.

source: The watcher avoids disrupting other code spawning processes by polling every process explicitly on a :py:data:`SIGCHLD` signal.
ru: Наблюдатель избегает нарушения других процессов создания кода, явно опрашивая каждый процесс по сигналу :py:data:`SIGCHLD`.

source: There is no limitation for running subprocesses from different threads once the watcher is installed.
ru: После установки наблюдателя нет ограничений на запуск подпроцессов из разных потоков.

source: This implementation uses active event loop from the main thread to handle :py:data:`SIGCHLD` signal. If the main thread has no running event loop another thread cannot spawn a subprocess (:exc:`RuntimeError` is raised).
ru: Эта реализация использует активный цикл событий из основного потока для обработки сигнала :py:data:`SIGCHLD`. Если в основном потоке нет работающего цикла событий, другой поток не может запустить подпроцесс (возникает:exc:`RuntimeError`).

source: This implementation reaps every terminated processes by calling ``os.waitpid(-1)`` directly, possibly breaking other code spawning processes and waiting for their termination.
ru: Эта реализация извлекает все завершенные процессы путем прямого вызова ``os.waitpid(-1)``, возможно, прерывая другие процессы, порождающие код, и ожидая их завершения.

source: This solution requires a running event loop in the main thread to work, as :class:`SafeChildWatcher`.
ru: Для работы этого решения требуется работающий цикл событий в основном потоке, как :class:`SafeChildWatcher`.

source: This implementation polls process file descriptors (pidfds) to await child process termination. In some respects, :class:`PidfdChildWatcher` is a "Goldilocks" child watcher implementation. It doesn't require signals or threads, doesn't interfere with any processes launched outside the event loop, and scales linearly with the number of subprocesses launched by the event loop. The main disadvantage is that pidfds are specific to Linux, and only work on recent (5.3+) kernels.
ru: Эта реализация опрашивает дескрипторы файлов процессов (pidfds) в ожидании завершения дочернего процесса. В некотором смысле :class:`PidfdChildWatcher` является реализацией наблюдателя за детьми типа "Златовласка". Он не требует сигналов или потоков, не мешает никаким процессам, запускаемым вне цикла событий, и линейно масштабируется в зависимости от количества подпроцессов, запускаемых циклом событий. Основным недостатком является то, что pidfds специфичны для Linux и работают только с последними ядрами (5.3+).

source: Custom Policies
ru: Пользовательские политики

source: To implement a new event loop policy, it is recommended to subclass :class:`DefaultEventLoopPolicy` and override the methods for which custom behavior is wanted, e.g.::
ru: Чтобы реализовать новую политику цикла событий, рекомендуется создать подкласс :class:`DefaultEventLoopPolicy` и переопределить методы, для которых требуется пользовательское поведение, например::
