Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/asyncio-extending.po
Languages: ru

source: Extending
ru: Расширение

source: The main direction for :mod:`asyncio` extending is writing custom *event loop* classes. Asyncio has helpers that could be used to simplify this task.
ru: Основное направление для :mod:`asyncio` расширение — это написание пользовательских классов *цикла событий*. В Asyncio есть помощники, которые можно использовать для упрощения этой задачи.

source: Third-parties should reuse existing asyncio code with caution, a new Python version is free to break backward compatibility in *internal* part of API.
ru: Третьим сторонам следует с осторожностью повторно использовать существующий код asyncio, новая версия Python может нарушить обратную совместимость во *внутренней* части API.

source: Writing a Custom Event Loop
ru: Написание пользовательского цикла событий

source: :class:`asyncio.AbstractEventLoop` declares very many methods. Implementing all them from scratch is a tedious job.
ru: :class:`asyncio.AbstractEventLoop` объявляет очень много методов. Реализация всего этого с нуля — утомительная работа.

source: A loop can get many common methods implementation for free by inheriting from :class:`asyncio.BaseEventLoop`.
ru: Цикл может бесплатно получить реализацию многих распространенных методов, наследуя от :class:`asyncio.BaseEventLoop` .

source: In turn, the successor should implement a bunch of *private* methods declared but not implemented in :class:`asyncio.BaseEventLoop`.
ru: В свою очередь, преемник должен реализовать набор *частных* методов, объявленных, но не реализованных в :class:`asyncio.BaseEventLoop` .

source: For example, ``loop.create_connection()`` checks arguments, resolves DNS addresses, and calls ``loop._make_socket_transport()`` that should be implemented by inherited class. The ``_make_socket_transport()`` method is not documented and is considered as an *internal* API.
ru: Например, ``loop.create_connection()`` проверяет аргументы, разрешает DNS-адреса и вызывает ``loop._make_socket_transport()`` это должно быть реализовано унаследованным классом. ``_make_socket_transport()`` метод не документирован и считается *внутренним* API.

source: Future and Task private constructors
ru: Частные конструкторы Future и Task

source: :class:`asyncio.Future` and :class:`asyncio.Task` should be never created directly, please use corresponding :meth:`loop.create_future` and :meth:`loop.create_task`, or :func:`asyncio.create_task` factories instead.
ru: :class:`asyncio.Будущее` и :class:`asyncio.Task` никогда не следует создавать напрямую, используйте соответствующие :meth:`loop.create_future` и :meth:`loop.create_task` , или :func:`asyncio.create_task` вместо этого заводы.

source: However, third-party *event loops* may *reuse* built-in future and task implementations for the sake of getting a complex and highly optimized code for free.
ru: Однако сторонние *циклы событий* могут *повторно использовать* встроенные реализации будущих проектов и задач ради бесплатного получения сложного и высокооптимизированного кода.

source: For this purpose the following, *private* constructors are listed:
ru: Для этой цели перечислены следующие *частные* конструкторы:

source: Create a built-in future instance.
ru: Создайте встроенный экземпляр будущего.

source: *loop* is an optional event loop instance.
ru: *loop* — необязательный экземпляр цикла событий.

source: Create a built-in task instance.
ru: Создайте встроенный экземпляр задачи.

source: *loop* is an optional event loop instance. The rest of arguments are described in :meth:`loop.create_task` description.
ru: *loop* — необязательный экземпляр цикла событий. Остальные аргументы описаны в :meth:`loop.create_task` описание.

source: *context* argument is added.
ru: Добавлен аргумент *context*.

source: Task lifetime support
ru: Поддержка пожизненной задачи

source: A third party task implementation should call the following functions to keep a task visible by :func:`asyncio.all_tasks` and :func:`asyncio.current_task`:
ru: Сторонняя реализация задачи должна вызывать следующие функции, чтобы задача оставалась видимой для :func:`asyncio.all_tasks` и :func:`asyncio.current_task` :

source: Register a new *task* as managed by *asyncio*.
ru: Зарегистрируйте новую *задачу* под управлением *asyncio*.

source: Call the function from a task constructor.
ru: Вызовите функцию из конструктора задачи.

source: Unregister a *task* from *asyncio* internal structures.
ru: Отмените регистрацию *задачи* во внутренних структурах *asyncio*.

source: The function should be called when a task is about to finish.
ru: Функцию следует вызывать, когда задача приближается к завершению.

source: Switch the current task to the *task* argument.
ru: Переключите текущую задачу на аргумент *task*.

source: Call the function just before executing a portion of embedded *coroutine* (:meth:`coroutine.send` or :meth:`coroutine.throw`).
ru: Вызовите функцию непосредственно перед выполнением части встроенной *сопрограммы* ( :meth:`coroutine.send` или :meth:`coroutine.throw` ).

source: Switch the current task back from *task* to ``None``.
ru: Переключите текущую задачу обратно с *задачи* на ``Нет`` .

source: Call the function just after :meth:`coroutine.send` or :meth:`coroutine.throw` execution.
ru: Вызовите функцию сразу после :meth:`coroutine.send` или :meth:`coroutine.throw` исполнение.
