Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/asyncio-protocol.po
Languages: ru

source: On POSIX systems, this method sends :py:const:`~signal.SIGTERM` to the subprocess. On Windows, the Windows API function :c:func:`!TerminateProcess` is called to stop the subprocess.
ru: В системах POSIX этот метод отправляет :py:const:`~signal.SIGTERM` в подпроцесс. В Windows функция Windows API :c:func:`!TerminateProcess` вызывается для остановки подпроцесса.

source: See also :meth:`subprocess.Popen.terminate`.
ru: См. также :meth:`subprocess.Popen.terminate`.

source: Kill the subprocess by calling the :meth:`kill` method.
ru: Завершите подпроцесс, вызвав метод :meth:`kill`.

source: If the subprocess hasn't returned yet, and close transports of *stdin*, *stdout*, and *stderr* pipes.
ru: Если подпроцесс еще не вернулся, закройте транспорты каналов *stdin*, *stdout* и *stderr*.

source: Protocols
ru: Протоколы

source: **Source code:** :source:`Lib/asyncio/protocols.py`
ru: **Исходный код:** :source:`Lib/asyncio/protocols.py`

source: asyncio provides a set of abstract base classes that should be used to implement network protocols. Those classes are meant to be used together with :ref:`transports <asyncio-transport>`.
ru: asyncio предоставляет набор абстрактных базовых классов, которые следует использовать для реализации сетевых протоколов. Эти классы предназначены для использования вместе с :ref:`transports <asyncio-transport>`.

source: Subclasses of abstract base protocol classes may implement some or all methods. All these methods are callbacks: they are called by transports on certain events, for example when some data is received. A base protocol method should be called by the corresponding transport.
ru: Подклассы абстрактных классов базового протокола могут реализовывать некоторые или все методы. Все эти методы являются обратными вызовами: они вызываются транспортами при определенных событиях, например при получении каких-то данных. Метод базового протокола должен вызываться соответствующим транспортом.

source: Base Protocols
ru: Базовые протоколы

source: Base protocol with methods that all protocols share.
ru: Базовый протокол с методами, общими для всех протоколов.

source: The base class for implementing streaming protocols (TCP, Unix sockets, etc).
ru: Базовый класс для реализации протоколов потоковой передачи (TCP, сокеты Unix и т. д.).

source: A base class for implementing streaming protocols with manual control of the receive buffer.
ru: Базовый класс для реализации протоколов потоковой передачи с ручным управлением буфером приема.

source: The base class for implementing datagram (UDP) protocols.
ru: Базовый класс для реализации протоколов датаграмм (UDP).

source: The base class for implementing protocols communicating with child processes (unidirectional pipes).
ru: Базовый класс для реализации протоколов взаимодействия с дочерними процессами (однонаправленные каналы).

source: Base Protocol
ru: Базовый протокол

source: All asyncio protocols can implement Base Protocol callbacks.
ru: Все протоколы asyncio могут реализовывать обратные вызовы базового протокола.

source: Connection Callbacks
ru: Обратные вызовы соединения

source: Connection callbacks are called on all protocols, exactly once per a successful connection. All other protocol callbacks can only be called between those two methods.
ru: Обратные вызовы соединения вызываются для всех протоколов ровно один раз за успешное соединение. Все остальные обратные вызовы протокола могут вызываться только между этими двумя методами.

source: Called when a connection is made.
ru: Вызывается при установлении соединения.

source: The *transport* argument is the transport representing the connection. The protocol is responsible for storing the reference to its transport.
ru: Аргумент *transport* — это транспорт, представляющий соединение. Протокол отвечает за хранение ссылки на свой транспорт.

source: Called when the connection is lost or closed.
ru: Вызывается, когда соединение потеряно или закрыто.

source: The argument is either an exception object or :const:`None`. The latter means a regular EOF is received, or the connection was aborted or closed by this side of the connection.
ru: Аргументом является либо объект исключения, либо :const:`None`. Последнее означает, что получен обычный EOF или соединение было прервано или закрыто на этой стороне соединения.

source: Flow Control Callbacks
ru: Обратные вызовы управления потоком

source: Flow control callbacks can be called by transports to pause or resume writing performed by the protocol.
ru: Обратные вызовы управления потоком могут вызываться транспортами для приостановки или возобновления записи, выполняемой протоколом.

source: See the documentation of the :meth:`~WriteTransport.set_write_buffer_limits` method for more details.
ru: Дополнительную информацию см. в документации метода :meth:`~WriteTransport.set_write_buffer_limits`.

source: Called when the transport's buffer goes over the high watermark.
ru: Вызывается, когда буфер транспорта превышает верхнюю границу.

source: Called when the transport's buffer drains below the low watermark.
ru: Вызывается, когда буфер транспорта опустошается ниже нижнего уровня.

source: If the buffer size equals the high watermark, :meth:`~BaseProtocol.pause_writing` is not called: the buffer size must go strictly over.
ru: Если размер буфера равен верхнему уровню, :meth:`~BaseProtocol.pause_writing` не вызывается: размер буфера должен строго превышаться.

source: Conversely, :meth:`~BaseProtocol.resume_writing` is called when the buffer size is equal or lower than the low watermark. These end conditions are important to ensure that things go as expected when either mark is zero.
ru: И наоборот, :meth:`~BaseProtocol.resume_writing` вызывается, когда размер буфера равен или меньше нижнего водяного знака. Эти конечные условия важны для обеспечения того, чтобы все шло так, как ожидалось, когда любая отметка равна нулю.

source: Streaming Protocols
ru: Потоковые протоколы

source: Event methods, such as :meth:`loop.create_server`, :meth:`loop.create_unix_server`, :meth:`loop.create_connection`, :meth:`loop.create_unix_connection`, :meth:`loop.connect_accepted_socket`, :meth:`loop.connect_read_pipe`, and :meth:`loop.connect_write_pipe` accept factories that return streaming protocols.
ru: Методы событий, такие как :meth:`loop.create_server`, :meth:`loop.create_unix_server`, :meth:`loop.create_connection`, :meth:`loop.create_unix_connection`, :meth:`loop.connect_accepted_socket`, :meth:`loop.connect_read_pipe` и :meth:`loop.connect_write_pipe` принимают фабрики, которые возвращают протоколы потоковой передачи.

source: Called when some data is received. *data* is a non-empty bytes object containing the incoming data.
ru: Вызывается при получении некоторых данных. *data* — это непустой байтовый объект, содержащий входящие данные.

source: Whether the data is buffered, chunked or reassembled depends on the transport. In general, you shouldn't rely on specific semantics and instead make your parsing generic and flexible. However, data is always received in the correct order.
ru: Будут ли данные буферизованы, фрагментированы или повторно собраны, зависит от транспорта. В общем, вам не следует полагаться на конкретную семантику, а вместо этого сделайте свой синтаксический анализ универсальным и гибким. Однако данные всегда принимаются в правильном порядке.

source: The method can be called an arbitrary number of times while a connection is open.
ru: Метод можно вызывать произвольное количество раз, пока соединение открыто.

source: However, :meth:`protocol.eof_received() <Protocol.eof_received>` is called at most once. Once ``eof_received()`` is called, ``data_received()`` is not called anymore.
ru: Однако :meth:`protocol.eof_received() <Protocol.eof_received>` вызывается не более одного раза. После вызова eof_received() data_received() больше не вызывается.

source: Called when the other end signals it won't send any more data (for example by calling :meth:`transport.write_eof() <WriteTransport.write_eof>`, if the other end also uses asyncio).
ru: Вызывается, когда другой конец сигнализирует, что он больше не будет отправлять данные (например, путем вызова :meth:`transport.write_eof() <WriteTransport.write_eof>`, если другой конец также использует asyncio).

source: This method may return a false value (including ``None``), in which case the transport will close itself. Conversely, if this method returns a true value, the protocol used determines whether to close the transport. Since the default implementation returns ``None``, it implicitly closes the connection.
ru: Этот метод может возвращать ложное значение (включая None), и в этом случае транспорт закроется сам. И наоборот, если этот метод возвращает истинное значение, используемый протокол определяет, следует ли закрывать транспорт. Поскольку реализация по умолчанию возвращает None, она неявно закрывает соединение.

source: Some transports, including SSL, don't support half-closed connections, in which case returning true from this method will result in the connection being closed.
ru: Некоторые транспорты, включая SSL, не поддерживают полузакрытые соединения, и в этом случае возврат true из этого метода приведет к закрытию соединения.

source: State machine:
ru: Машина состояний

source: Buffered Streaming Protocols
ru: Протоколы буферизованной потоковой передачи

source: Buffered Protocols can be used with any event loop method that supports `Streaming Protocols`_.
ru: Буферизованные протоколы можно использовать с любым методом цикла событий, который поддерживает `Streaming Protocols`_.

source: ``BufferedProtocol`` implementations allow explicit manual allocation and control of the receive buffer. Event loops can then use the buffer provided by the protocol to avoid unnecessary data copies. This can result in noticeable performance improvement for protocols that receive big amounts of data. Sophisticated protocol implementations can significantly reduce the number of buffer allocations.
ru: Реализации BufferedProtocol позволяют явно вручную выделять и контролировать буфер приема. Циклы событий могут затем использовать буфер, предоставленный протоколом, чтобы избежать ненужных копий данных. Это может привести к заметному повышению производительности протоколов, которые получают большие объемы данных. Сложные реализации протоколов могут значительно сократить количество выделений буфера.

source: The following callbacks are called on :class:`BufferedProtocol` instances:
ru: Следующие обратные вызовы вызываются в экземплярах :class:`BufferedProtocol`:

source: Called to allocate a new receive buffer.
ru: Вызывается для выделения нового буфера приема.

source: *sizehint* is the recommended minimum size for the returned buffer. It is acceptable to return smaller or larger buffers than what *sizehint* suggests. When set to -1, the buffer size can be arbitrary. It is an error to return a buffer with a zero size.
ru: *sizehint* — рекомендуемый минимальный размер возвращаемого буфера. Допустимо возвращать буферы меньшего или большего размера, чем предлагает *sizehint*. Если установлено значение -1, размер буфера может быть произвольным. Возврат буфера нулевого размера является ошибкой.

source: ``get_buffer()`` must return an object implementing the :ref:`buffer protocol <bufferobjects>`.
ru: ``get_buffer()`` должен возвращать объект, реализующий :ref:`буферный протокол <bufferobjects>`.

source: Called when the buffer was updated with the received data.
ru: Вызывается, когда буфер обновляется полученными данными.

source: *nbytes* is the total number of bytes that were written to the buffer.
ru: *nbytes* — общее количество байтов, записанных в буфер.

source: See the documentation of the :meth:`protocol.eof_received() <Protocol.eof_received>` method.
ru: См. документацию по методу :meth:`protocol.eof_received() <Protocol.eof_received>`.

source: :meth:`~BufferedProtocol.get_buffer` can be called an arbitrary number of times during a connection. However, :meth:`protocol.eof_received() <Protocol.eof_received>` is called at most once and, if called, :meth:`~BufferedProtocol.get_buffer` and :meth:`~BufferedProtocol.buffer_updated` won't be called after it.
ru: :meth:`~BufferedProtocol.get_buffer` может вызываться произвольное количество раз во время соединения. Однако :meth:`protocol.eof_received() <Protocol.eof_received>` вызывается не более одного раза, и, если они вызваны, :meth:`~BufferedProtocol.get_buffer` и :meth:`~BufferedProtocol.buffer_updated` не будут позвонил после этого.

source: Datagram Protocols
ru: Протоколы датаграмм

source: Datagram Protocol instances should be constructed by protocol factories passed to the :meth:`loop.create_datagram_endpoint` method.
ru: Экземпляры протокола дейтаграмм должны создаваться фабриками протоколов, передаваемыми в метод :meth:`loop.create_datagram_endpoint`.

source: Called when a datagram is received. *data* is a bytes object containing the incoming data. *addr* is the address of the peer sending the data; the exact format depends on the transport.
ru: Вызывается при получении датаграммы. *data* — это байтовый объект, содержащий входящие данные. *addr* — адрес узла, отправляющего данные; точный формат зависит от транспорта.

source: Called when a previous send or receive operation raises an :class:`OSError`. *exc* is the :class:`OSError` instance.
ru: Вызывается, когда предыдущая операция отправки или получения вызывает ошибку :class:`OSError`. *exc* — это экземпляр :class:`OSError`.

source: This method is called in rare conditions, when the transport (e.g. UDP) detects that a datagram could not be delivered to its recipient. In many conditions though, undeliverable datagrams will be silently dropped.
ru: Этот метод вызывается в редких случаях, когда транспорт (например, UDP) обнаруживает, что дейтаграмма не может быть доставлена ​​получателю. Однако во многих случаях недоставленные датаграммы будут автоматически отброшены.

source: On BSD systems (macOS, FreeBSD, etc.) flow control is not supported for datagram protocols, because there is no reliable way to detect send failures caused by writing too many packets.
ru: В системах BSD (macOS, FreeBSD и т. д.) управление потоком данных не поддерживается для протоколов датаграмм, поскольку не существует надежного способа обнаружения сбоев отправки, вызванных записью слишком большого количества пакетов.

source: The socket always appears 'ready' and excess packets are dropped. An :class:`OSError` with ``errno`` set to :const:`errno.ENOBUFS` may or may not be raised; if it is raised, it will be reported to :meth:`DatagramProtocol.error_received` but otherwise ignored.
ru: Сокет всегда отображается как «готовый», и лишние пакеты отбрасываются. Ошибка :class:`OSError` с ``errno``, установленным в :const:`errno.ENOBUFS`, может быть вызвана, а может и не возникнуть; если он возникнет, об этом будет сообщено в :meth:`DatagramProtocol.error_received`, но в противном случае оно будет проигнорировано.

source: Subprocess Protocols
ru: Протоколы подпроцессов

source: Subprocess Protocol instances should be constructed by protocol factories passed to the :meth:`loop.subprocess_exec` and :meth:`loop.subprocess_shell` methods.
ru: Экземпляры протокола подпроцесса должны создаваться фабриками протоколов, передаваемыми методам :meth:`loop.subprocess_exec` и :meth:`loop.subprocess_shell`.

source: Called when the child process writes data into its stdout or stderr pipe.
ru: Вызывается, когда дочерний процесс записывает данные в свой канал stdout или stderr.

source: *fd* is the integer file descriptor of the pipe.
ru: *fd* — целочисленный файловый дескриптор канала.

source: *data* is a non-empty bytes object containing the received data.
ru: *data* — это непустой байтовый объект, содержащий полученные данные.

source: Called when one of the pipes communicating with the child process is closed.
ru: Вызывается, когда закрывается один из каналов, взаимодействующих с дочерним процессом.

source: *fd* is the integer file descriptor that was closed.
ru: *fd* — целочисленный дескриптор файла, который был закрыт.

source: Called when the child process has exited.
ru: Вызывается при выходе дочернего процесса.

source: It can be called before :meth:`~SubprocessProtocol.pipe_data_received` and :meth:`~SubprocessProtocol.pipe_connection_lost` methods.
ru: Его можно вызвать перед методами :meth:`~SubprocessProtocol.pipe_data_received` и :meth:`~SubprocessProtocol.pipe_connection_lost`.

source: Examples
ru: Примеры

source: TCP Echo Server
ru: Эхо-сервер TCP

source: Create a TCP echo server using the :meth:`loop.create_server` method, send back received data, and close the connection::
ru: Создайте эхо-сервер TCP, используя метод :meth:`loop.create_server`, отправьте обратно полученные данные и закройте соединение::

source: The :ref:`TCP echo server using streams <asyncio-tcp-echo-server-streams>` example uses the high-level :func:`asyncio.start_server` function.
ru: В примере эхо-сервера TCP с использованием потоков <asyncio-tcp-echo-server-streams>` используется высокоуровневая функция :func:`asyncio.start_server`.

source: TCP Echo Client
ru: Эхо-клиент TCP

source: A TCP echo client using the :meth:`loop.create_connection` method, sends data, and waits until the connection is closed::
ru: Эхо-клиент TCP, использующий метод :meth:`loop.create_connection`, отправляет данные и ждет, пока соединение не закроется::

source: The :ref:`TCP echo client using streams <asyncio-tcp-echo-client-streams>` example uses the high-level :func:`asyncio.open_connection` function.
ru: В примере :ref:`TCP echo client с использованием потоков <asyncio-tcp-echo-client-streams>` используется высокоуровневая функция :func:`asyncio.open_connection`.

source: UDP Echo Server
ru: Эхо-сервер UDP

source: A UDP echo server, using the :meth:`loop.create_datagram_endpoint` method, sends back received data::
ru: Эхо-сервер UDP, используя метод :meth:`loop.create_datagram_endpoint`, отправляет обратно полученные данные:

source: UDP Echo Client
ru: Эхо-клиент UDP

source: A UDP echo client, using the :meth:`loop.create_datagram_endpoint` method, sends data and closes the transport when it receives the answer::
ru: Эхо-клиент UDP, используя метод :meth:`loop.create_datagram_endpoint`, отправляет данные и закрывает транспорт, когда получает ответ:

source: Connecting Existing Sockets
ru: Подключение существующих сокетов

source: Wait until a socket receives data using the :meth:`loop.create_connection` method with a protocol::
ru: Подождите, пока сокет не получит данные с помощью метода :meth:`loop.create_connection` с протоколом::

source: The :ref:`watch a file descriptor for read events <asyncio_example_watch_fd>` example uses the low-level :meth:`loop.add_reader` method to register an FD.
ru: В примере :ref:`наблюдения за файловым дескриптором на предмет событий чтения <asyncio_example_watch_fd>` используется низкоуровневый метод :meth:`loop.add_reader` для регистрации FD.

source: The :ref:`register an open socket to wait for data using streams <asyncio_example_create_connection-streams>` example uses high-level streams created by the :func:`open_connection` function in a coroutine.
ru: В примере :ref:`наблюдения за файловым дескриптором на предмет событий чтения <asyncio_example_watch_fd>` используется низкоуровневый метод :meth:`loop.add_reader` для регистрации FD.

source: loop.subprocess_exec() and SubprocessProtocol
ru: loop.subprocess_exec() и SubprocessProtocol

source: An example of a subprocess protocol used to get the output of a subprocess and to wait for the subprocess exit.
ru: Пример протокола подпроцесса, используемого для получения выходных данных подпроцесса и ожидания выхода из подпроцесса.

source: The subprocess is created by the :meth:`loop.subprocess_exec` method::
ru: Подпроцесс создается методом :meth:`loop.subprocess_exec`::

source: See also the :ref:`same example <asyncio_example_create_subprocess_exec>` written using high-level APIs.
ru: См. также тот же пример <asyncio_example_create_subprocess_exec>, написанный с использованием API высокого уровня.
