Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/asyncio-eventloop.po
Languages: ru

source: *ssl*: if given and not false, a SSL/TLS transport is created (by default a plain TCP transport is created). If *ssl* is a :class:`ssl.SSLContext` object, this context is used to create the transport; if *ssl* is :const:`True`, a default context returned from :func:`ssl.create_default_context` is used.
ru: *ssl*: если задано и не является ложным, создается транспорт SSL/TLS (по умолчанию создается простой транспорт TCP). Если *ssl* является объектом :class:`ssl.SSLContext`, этот контекст используется для создания транспорта; если *ssl* имеет значение :const:`True`, используется контекст по умолчанию, возвращаемый из :func:`ssl.create_default_context`.

source: *server_hostname* sets or overrides the hostname that the target server's certificate will be matched against. Should only be passed if *ssl* is not ``None``. By default the value of the *host* argument is used. If *host* is empty, there is no default and you must pass a value for *server_hostname*. If *server_hostname* is an empty string, hostname matching is disabled (which is a serious security risk, allowing for potential man-in-the-middle attacks).
ru: *server_hostname* устанавливает или переопределяет имя хоста, с которым будет сопоставляться сертификат целевого сервера. Следует передавать только в том случае, если *ssl* не равен None. По умолчанию используется значение аргумента *host*. Если *host* пуст, значения по умолчанию нет, и вам необходимо передать значение для *server_hostname*. Если *server_hostname* — пустая строка, сопоставление имен хостов отключено (что представляет собой серьезную угрозу безопасности, допускающую потенциальные атаки «человек посередине»).

source: *family*, *proto*, *flags* are the optional address family, protocol and flags to be passed through to getaddrinfo() for *host* resolution. If given, these should all be integers from the corresponding :mod:`socket` module constants.
ru: *family*, *proto*, *flags* — это необязательное семейство адресов, протокол и флаги, которые необходимо передать в getaddrinfo() для разрешения *host*. Если они заданы, все они должны быть целыми числами из соответствующих констант модуля :mod:`socket`.

source: *happy_eyeballs_delay*, if given, enables Happy Eyeballs for this connection. It should be a floating-point number representing the amount of time in seconds to wait for a connection attempt to complete, before starting the next attempt in parallel. This is the "Connection Attempt Delay" as defined in :rfc:`8305`. A sensible default value recommended by the RFC is ``0.25`` (250 milliseconds).
ru: *happy_eyeballs_delay*, если задано, включает функцию Happy Eyeballs для этого соединения. Это должно быть число с плавающей запятой, обозначающее время в секундах ожидания завершения попытки подключения перед параллельным запуском следующей попытки. Это «Задержка попытки подключения», как определено в :rfc:`8305`. Разумное значение по умолчанию, рекомендованное RFC, составляет «0,25» (250 миллисекунд).

source: *interleave* controls address reordering when a host name resolves to multiple IP addresses. If ``0`` or unspecified, no reordering is done, and addresses are tried in the order returned by :meth:`getaddrinfo`. If a positive integer is specified, the addresses are interleaved by address family, and the given integer is interpreted as "First Address Family Count" as defined in :rfc:`8305`. The default is ``0`` if *happy_eyeballs_delay* is not specified, and ``1`` if it is.
ru: *interleave* управляет переупорядочением адресов, когда имя хоста преобразуется в несколько IP-адресов. Если ``0`` или не указано, переупорядочение не производится, и адреса проверяются в порядке, возвращаемом :meth:`getaddrinfo`. Если указано положительное целое число, адреса чередуются по семействам адресов, и данное целое число интерпретируется как «Счетчик первого семейства адресов», как определено в :rfc:`8305`. По умолчанию установлено ``0``, если *happy_eyeballs_delay* не указано, и ``1``, если оно указано.

source: *sock*, if given, should be an existing, already connected :class:`socket.socket` object to be used by the transport. If *sock* is given, none of *host*, *port*, *family*, *proto*, *flags*, *happy_eyeballs_delay*, *interleave* and *local_addr* should be specified.
ru: *sock*, если он указан, должен быть существующим, уже подключенным объектом :class:`socket.socket`, который будет использоваться транспортом. Если указан *sock*, не следует указывать ни одно из *host*, *port*, *family*, *proto*, *flags*, *happy_eyeballs_delay*, *interleave* и *local_addr*.

source: The *sock* argument transfers ownership of the socket to the transport created. To close the socket, call the transport's :meth:`~asyncio.BaseTransport.close` method.
ru: Аргумент *sock* передает право собственности на сокет созданному транспорту. Чтобы закрыть сокет, вызовите метод транспорта :meth:`~asyncio.BaseTransport.close`.

source: *local_addr*, if given, is a ``(local_host, local_port)`` tuple used to bind the socket locally. The *local_host* and *local_port* are looked up using ``getaddrinfo()``, similarly to *host* and *port*.
ru: *local_addr*, если он указан, представляет собой кортеж ``(local_host, local_port)``, используемый для локальной привязки сокета. *local_host* и *local_port* ищутся с помощью ``getaddrinfo()``, аналогично *host* и *port*.

source: *ssl_handshake_timeout* is (for a TLS connection) the time in seconds to wait for the TLS handshake to complete before aborting the connection. ``60.0`` seconds if ``None`` (default).
ru: *ssl_handshake_timeout* — это (для TLS-соединения) время в секундах ожидания завершения TLS-квитирования перед прерыванием соединения. ``60,0`` секунд, если ``Нет`` (по умолчанию).

source: *ssl_shutdown_timeout* is the time in seconds to wait for the SSL shutdown to complete before aborting the connection. ``30.0`` seconds if ``None`` (default).
ru: *ssl_shutdown_timeout* — время в секундах ожидания завершения завершения работы SSL перед прерыванием соединения. ``30,0`` секунд, если ``Нет`` (по умолчанию).

source: *all_errors* determines what exceptions are raised when a connection cannot be created. By default, only a single ``Exception`` is raised: the first exception if there is only one or all errors have same message, or a single ``OSError`` with the error messages combined. When ``all_errors`` is ``True``, an ``ExceptionGroup`` will be raised containing all exceptions (even if there is only one).
ru: *all_errors* определяет, какие исключения возникают, когда соединение не может быть создано. По умолчанию возникает только одно исключение: первое исключение, если есть только одна или все ошибки имеют одинаковое сообщение, или одно исключение OSError с объединенными сообщениями об ошибках. Когда ``all_errors`` имеет значение ``True``, будет создана группа ``ExceptionGroup``, содержащая все исключения (даже если есть только одно).

source: Added support for SSL/TLS in :class:`ProactorEventLoop`.
ru: Добавлена ​​поддержка SSL/TLS в :class:`ProactorEventLoop`.

source: The socket option :ref:`socket.TCP_NODELAY <socket-unix-constants>` is set by default for all TCP connections.
ru: Опция сокета :ref:`socket.TCP_NODELAY <socket-unix-constants>` установлена ​​по умолчанию для всех TCP-соединений.

source: Added the *ssl_handshake_timeout* parameter.
ru: Добавлен параметр *ssl_handshake_timeout*.

source: Added the *happy_eyeballs_delay* and *interleave* parameters.
ru: Добавлены параметры *happy_eyeballs_delay* и *interleave*.

source: Happy Eyeballs Algorithm: Success with Dual-Stack Hosts. When a server's IPv4 path and protocol are working, but the server's IPv6 path and protocol are not working, a dual-stack client application experiences significant connection delay compared to an IPv4-only client. This is undesirable because it causes the dual-stack client to have a worse user experience. This document specifies requirements for algorithms that reduce this user-visible delay and provides an algorithm.
ru: Алгоритм счастливых глаз: успех с хостами с двумя стеками. Если путь и протокол IPv4 сервера работают, но путь и протокол IPv6 сервера не работают, клиентское приложение с двойным стеком испытывает значительную задержку подключения по сравнению с клиентом, поддерживающим только IPv4. Это нежелательно, поскольку это приводит к ухудшению пользовательского опыта клиента с двойным стеком. Этот документ определяет требования к алгоритмам, которые уменьшают эту видимую пользователю задержку, и предоставляет алгоритм.

source: For more information: https://datatracker.ietf.org/doc/html/rfc6555
ru: Для получения дополнительной информации: https://datatracker.ietf.org/doc/html/rfc6555.

source: Added the *ssl_shutdown_timeout* parameter.
ru: Добавлен параметр *ssl_shutdown_timeout*.

source: *all_errors* was added.
ru: Добавлено *all_errors*.

source: The :func:`open_connection` function is a high-level alternative API. It returns a pair of (:class:`StreamReader`, :class:`StreamWriter`) that can be used directly in async/await code.
ru: Функция :func:`open_connection` — это альтернативный API высокого уровня. Он возвращает пару (:class:`StreamReader`, :class:`StreamWriter`), которую можно использовать непосредственно в коде async/await.

source: Create a datagram connection.
ru: Создайте дейтаграммное соединение.

source: The socket family can be either :py:const:`~socket.AF_INET`, :py:const:`~socket.AF_INET6`, or :py:const:`~socket.AF_UNIX`, depending on *host* (or the *family* argument, if provided).
ru: Семейство сокетов может быть :py:const:`~socket.AF_INET`, :py:const:`~socket.AF_INET6` или :py:const:`~socket.AF_UNIX`, в зависимости от *хоста* (или аргумент *family*, если он указан).

source: The socket type will be :py:const:`~socket.SOCK_DGRAM`.
ru: Тип сокета будет :py:const:`~socket.SOCK_DGRAM`.

source: *protocol_factory* must be a callable returning a :ref:`protocol <asyncio-protocol>` implementation.
ru: *protocol_factory* должен быть вызываемым объектом, возвращающим реализацию протокола <asyncio-protocol>`.

source: A tuple of ``(transport, protocol)`` is returned on success.
ru: В случае успеха возвращается кортеж ``(транспорт, протокол)``.

source: *local_addr*, if given, is a ``(local_host, local_port)`` tuple used to bind the socket locally. The *local_host* and *local_port* are looked up using :meth:`getaddrinfo`.
ru: *local_addr*, если он указан, представляет собой кортеж ``(local_host, local_port)``, используемый для локальной привязки сокета. *local_host* и *local_port* ищутся с помощью :meth:`getaddrinfo`.

source: *remote_addr*, if given, is a ``(remote_host, remote_port)`` tuple used to connect the socket to a remote address. The *remote_host* and *remote_port* are looked up using :meth:`getaddrinfo`.
ru: *remote_addr*, если он указан, представляет собой кортеж ``(remote_host, Remote_port)``, используемый для подключения сокета к удаленному адресу. *remote_host* и *remote_port* ищутся с помощью :meth:`getaddrinfo`.

source: *family*, *proto*, *flags* are the optional address family, protocol and flags to be passed through to :meth:`getaddrinfo` for *host* resolution. If given, these should all be integers from the corresponding :mod:`socket` module constants.
ru: *family*, *proto*, *flags* — это необязательное семейство адресов, протокол и флаги, которые необходимо передать в :meth:`getaddrinfo` для разрешения *host*. Если они заданы, все они должны быть целыми числами из соответствующих констант модуля :mod:`socket`.

source: *reuse_port* tells the kernel to allow this endpoint to be bound to the same port as other existing endpoints are bound to, so long as they all set this flag when being created. This option is not supported on Windows and some Unixes. If the :ref:`socket.SO_REUSEPORT <socket-unix-constants>` constant is not defined then this capability is unsupported.
ru: *reuse_port* указывает ядру разрешить привязку этой конечной точки к тому же порту, к которому привязаны другие существующие конечные точки, при условии, что все они установили этот флаг при создании. Эта опция не поддерживается в Windows и некоторых Unix-системах. Если константа :ref:`socket.SO_REUSEPORT <socket-unix-constants>` не определена, то эта возможность не поддерживается.

source: *allow_broadcast* tells the kernel to allow this endpoint to send messages to the broadcast address.
ru: *allow_broadcast* сообщает ядру, что нужно разрешить этой конечной точке отправлять сообщения на широковещательный адрес.

source: *sock* can optionally be specified in order to use a preexisting, already connected, :class:`socket.socket` object to be used by the transport. If specified, *local_addr* and *remote_addr* should be omitted (must be :const:`None`).
ru: *sock* может быть указан дополнительно, чтобы использовать уже существующий, уже подключенный объект :class:`socket.socket`, который будет использоваться транспортом. Если указано, *local_addr* и *remote_addr* следует опустить (должно быть :const:`None`).

source: See :ref:`UDP echo client protocol <asyncio-udp-echo-client-protocol>` and :ref:`UDP echo server protocol <asyncio-udp-echo-server-protocol>` examples.
ru: См. примеры протокола эхо-клиента UDP <asyncio-udp-echo-client-protocol> и протокола эхо-сервера UDP <asyncio-udp-echo-server-protocol>.

source: The *family*, *proto*, *flags*, *reuse_address*, *reuse_port*, *allow_broadcast*, and *sock* parameters were added.
ru: Были добавлены параметры *family*, *proto*, *flags*, *reuse_address*, *reuse_port*, *allow_broadcast* и *sock*.

source: Added support for Windows.
ru: Добавлена поддержка Windows.

source: The *reuse_address* parameter is no longer supported, as using :ref:`socket.SO_REUSEADDR <socket-unix-constants>` poses a significant security concern for UDP. Explicitly passing ``reuse_address=True`` will raise an exception.
ru: Параметр *reuse_address* больше не поддерживается, поскольку использование :ref:`socket.SO_REUSEADDR <socket-unix-constants>` представляет собой серьезную проблему безопасности для UDP. Явная передача ``reuse_address=True`` вызовет исключение.

source: When multiple processes with differing UIDs assign sockets to an identical UDP socket address with ``SO_REUSEADDR``, incoming packets can become randomly distributed among the sockets.
ru: Когда несколько процессов с разными UID назначают сокетам одинаковый адрес сокета UDP с помощью SO_REUSEADDR, входящие пакеты могут случайным образом распределяться между сокетами.

source: For supported platforms, *reuse_port* can be used as a replacement for similar functionality. With *reuse_port*, :ref:`socket.SO_REUSEPORT <socket-unix-constants>` is used instead, which specifically prevents processes with differing UIDs from assigning sockets to the same socket address.
ru: Для поддерживаемых платформ *reuse_port* можно использовать в качестве замены аналогичной функциональности. При использовании *reuse_port* вместо этого используется :ref:`socket.SO_REUSEPORT <socket-unix-constants>`, что специально предотвращает назначение процессами с разными UID сокетов одному и тому же адресу сокета.

source: The *reuse_address* parameter, disabled since Python 3.8.1, 3.7.6 and 3.6.10, has been entirely removed.
ru: Параметр *reuse_address*, отключенный начиная с Python 3.8.1, 3.7.6 и 3.6.10, был полностью удален.

source: Create a Unix connection.
ru: Создайте соединение с Unix.

source: The socket family will be :py:const:`~socket.AF_UNIX`; socket type will be :py:const:`~socket.SOCK_STREAM`.
ru: Семейство сокетов будет :py:const:`~socket.AF_UNIX`; тип сокета будет :py:const:`~socket.SOCK_STREAM`.

source: *path* is the name of a Unix domain socket and is required, unless a *sock* parameter is specified. Abstract Unix sockets, :class:`str`, :class:`bytes`, and :class:`~pathlib.Path` paths are supported.
ru: *path* — это имя сокета домена Unix, оно является обязательным, если не указан параметр *sock*. Поддерживаются абстрактные сокеты Unix, пути :class:`str`, :class:`bytes` и :class:`~pathlib.Path`.

source: See the documentation of the :meth:`loop.create_connection` method for information about arguments to this method.
ru: См. документацию метода :meth:`loop.create_connection` для получения информации об аргументах этого метода.

source: Availability
ru: Доступность

source: Added the *ssl_handshake_timeout* parameter. The *path* parameter can now be a :term:`path-like object`.
ru: Добавлен параметр *ssl_handshake_timeout*. Параметр *path* теперь может быть объектом, похожим на путь.

source: Creating network servers
ru: Создание сетевых серверов

source: Create a TCP server (socket type :const:`~socket.SOCK_STREAM`) listening on *port* of the *host* address.
ru: Создайте TCP-сервер (тип сокета :const:`~socket.SOCK_STREAM`), прослушивающий *порт* адреса *хоста*.

source: Returns a :class:`Server` object.
ru: Возвращает объект :class:`Server`.

source: Arguments:
ru: Аргументы:

source: The *host* parameter can be set to several types which determine where the server would be listening:
ru: Параметру *host* можно задать несколько типов, которые определяют, где сервер будет прослушивать:

source: If *host* is a string, the TCP server is bound to a single network interface specified by *host*.
ru: Если *host* — это строка, TCP-сервер привязан к одному сетевому интерфейсу, указанному *host*.

source: If *host* is a sequence of strings, the TCP server is bound to all network interfaces specified by the sequence.
ru: Если *host* представляет собой последовательность строк, TCP-сервер привязан ко всем сетевым интерфейсам, указанным в этой последовательности.

source: If *host* is an empty string or ``None``, all interfaces are assumed and a list of multiple sockets will be returned (most likely one for IPv4 and another one for IPv6).
ru: Если *host* — пустая строка или ``None``, предполагаются все интерфейсы и будет возвращен список нескольких сокетов (скорее всего, один для IPv4, а другой для IPv6).

source: The *port* parameter can be set to specify which port the server should listen on. If ``0`` or ``None`` (the default), a random unused port will be selected (note that if *host* resolves to multiple network interfaces, a different random port will be selected for each interface).
ru: Параметр *port* можно установить, чтобы указать, какой порт должен прослушивать сервер. Если ``0`` или ``None`` (по умолчанию), будет выбран случайный неиспользуемый порт (обратите внимание, что если *host* разрешается для нескольких сетевых интерфейсов, для каждого интерфейса будет выбран другой случайный порт).

source: *family* can be set to either :const:`socket.AF_INET` or :const:`~socket.AF_INET6` to force the socket to use IPv4 or IPv6. If not set, the *family* will be determined from host name (defaults to :const:`~socket.AF_UNSPEC`).
ru: Для *family* может быть установлено значение :const:`socket.AF_INET` или :const:`~socket.AF_INET6`, чтобы заставить сокет использовать IPv4 или IPv6. Если не установлено, *семейство* будет определяться по имени хоста (по умолчанию :const:`~socket.AF_UNSPEC`).

source: *flags* is a bitmask for :meth:`getaddrinfo`.
ru: *flags* — это битовая маска для :meth:`getaddrinfo`.

source: *sock* can optionally be specified in order to use a preexisting socket object. If specified, *host* and *port* must not be specified.
ru: *sock* можно указать дополнительно, чтобы использовать уже существующий объект сокета. Если указано, *хост* и *порт* указывать нельзя.

source: The *sock* argument transfers ownership of the socket to the server created. To close the socket, call the server's :meth:`~asyncio.Server.close` method.
ru: Аргумент *sock* передает право собственности на сокет созданному серверу. Чтобы закрыть сокет, вызовите метод сервера :meth:`~asyncio.Server.close`.

source: *backlog* is the maximum number of queued connections passed to :meth:`~socket.socket.listen` (defaults to 100).
ru: *backlog* — максимальное количество соединений в очереди, передаваемых в :meth:`~socket.socket.listen` (по умолчанию 100).

source: *ssl* can be set to an :class:`~ssl.SSLContext` instance to enable TLS over the accepted connections.
ru: Для *ssl* может быть установлен экземпляр :class:`~ssl.SSLContext`, чтобы включить TLS для принятых соединений.

source: *reuse_address* tells the kernel to reuse a local socket in ``TIME_WAIT`` state, without waiting for its natural timeout to expire. If not specified will automatically be set to ``True`` on Unix.
ru: *reuse_address* сообщает ядру повторно использовать локальный сокет в состоянии ``TIME_WAIT``, не дожидаясь истечения его естественного таймаута. Если не указано, в Unix автоматически будет установлено значение «True».

source: *reuse_port* tells the kernel to allow this endpoint to be bound to the same port as other existing endpoints are bound to, so long as they all set this flag when being created. This option is not supported on Windows.
ru: *reuse_port* указывает ядру разрешить привязку этой конечной точки к тому же порту, к которому привязаны другие существующие конечные точки, при условии, что все они установили этот флаг при создании. Этот параметр не поддерживается в Windows.

source: *keep_alive* set to ``True`` keeps connections active by enabling the periodic transmission of messages.
ru: Для параметра *keep_alive* установлено значение ``True``, соединения остаются активными, позволяя периодическую передачу сообщений.

source: Added the *keep_alive* parameter.
ru: Добавлен параметр *keep_alive*.

source: *ssl_handshake_timeout* is (for a TLS server) the time in seconds to wait for the TLS handshake to complete before aborting the connection. ``60.0`` seconds if ``None`` (default).
ru: *ssl_handshake_timeout* — это (для сервера TLS) время в секундах ожидания завершения подтверждения TLS перед прерыванием соединения. ``60,0`` секунд, если ``Нет`` (по умолчанию).

source: *start_serving* set to ``True`` (the default) causes the created server to start accepting connections immediately. When set to ``False``, the user should await on :meth:`Server.start_serving` or :meth:`Server.serve_forever` to make the server to start accepting connections.
ru: Для параметра *start_serving* установлено значение ``True`` (по умолчанию) созданный сервер немедленно начинает принимать соединения. Если установлено значение «False», пользователь должен дождаться :meth:`Server.start_serving` или :meth:`Server.serve_forever`, чтобы сервер начал принимать соединения.

source: The *host* parameter can be a sequence of strings.
ru: Параметр *host* может представлять собой последовательность строк.

source: Added *ssl_handshake_timeout* and *start_serving* parameters. The socket option :ref:`socket.TCP_NODELAY <socket-unix-constants>` is set by default for all TCP connections.
ru: Добавлены параметры *ssl_handshake_timeout* и *start_serving*. Опция сокета :ref:`socket.TCP_NODELAY <socket-unix-constants>` установлена ​​по умолчанию для всех TCP-соединений.

source: The :func:`start_server` function is a higher-level alternative API that returns a pair of :class:`StreamReader` and :class:`StreamWriter` that can be used in an async/await code.
ru: Функция :func:`start_server` — это альтернативный API более высокого уровня, который возвращает пару :class:`StreamReader` и :class:`StreamWriter`, которые можно использовать в асинхронном/ожидающем коде.

source: Similar to :meth:`loop.create_server` but works with the :py:const:`~socket.AF_UNIX` socket family.
ru: Похож на :meth:`loop.create_server`, но работает с семейством сокетов :py:const:`~socket.AF_UNIX`.
