Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/asyncio-eventloop.po
Languages: ru

source: An alias to the most efficient available subclass of :class:`AbstractEventLoop` for the given platform.
ru: Псевдоним наиболее эффективного доступного подкласса :class:`AbstractEventLoop` для данной платформы.

source: It is an alias to :class:`SelectorEventLoop` on Unix and :class:`ProactorEventLoop` on Windows.
ru: Это псевдоним :class:`SelectorEventLoop` в Unix и :class:`ProactorEventLoop` в Windows.

source: Abstract base class for asyncio-compliant event loops.
ru: Абстрактный базовый класс для асинхронных циклов событий.

source: The :ref:`asyncio-event-loop-methods` section lists all methods that an alternative implementation of ``AbstractEventLoop`` should have defined.
ru: В разделе :ref:`asyncio-event-loop-methods` перечислены все методы, которые должна была определить альтернативная реализация ``AbstractEventLoop``.

source: Examples
ru: Примеры

source: Note that all examples in this section **purposefully** show how to use the low-level event loop APIs, such as :meth:`loop.run_forever` and :meth:`loop.call_soon`. Modern asyncio applications rarely need to be written this way; consider using the high-level functions like :func:`asyncio.run`.
ru: Обратите внимание, что все примеры в этом разделе **целенаправленно** показывают, как использовать API-интерфейсы низкоуровневого цикла событий, такие как :meth:`loop.run_forever` и :meth:`loop.call_soon`. Современные асинхронные приложения редко требуют написания таким образом; рассмотрите возможность использования функций высокого уровня, таких как :func:`asyncio.run`.

source: Hello World with call_soon()
ru: Привет, мир с помощью call_soon()

source: An example using the :meth:`loop.call_soon` method to schedule a callback. The callback displays ``"Hello World"`` and then stops the event loop::
ru: Пример использования метода :meth:`loop.call_soon` для планирования обратного вызова. Обратный вызов отображает ``Hello World'`, а затем останавливает цикл обработки событий::

source: A similar :ref:`Hello World <coroutine>` example created with a coroutine and the :func:`run` function.
ru: Аналогичный пример Hello World <coroutine>, созданный с помощью сопрограммы и функции :func:`run`.

source: Display the current date with call_later()
ru: Отобразите текущую дату с помощью call_later()

source: An example of a callback displaying the current date every second. The callback uses the :meth:`loop.call_later` method to reschedule itself after 5 seconds, and then stops the event loop::
ru: Пример обратного вызова, отображающего текущую дату каждую секунду. Обратный вызов использует метод :meth:`loop.call_later` для перепланирования себя через 5 секунд, а затем останавливает цикл событий::

source: A similar :ref:`current date <asyncio_example_sleep>` example created with a coroutine and the :func:`run` function.
ru: Аналогичный пример текущей даты <asyncio_example_sleep>, созданный с помощью сопрограммы и функции :func:`run`.

source: Watch a file descriptor for read events
ru: Следите за дескриптором файла на предмет событий чтения

source: Wait until a file descriptor received some data using the :meth:`loop.add_reader` method and then close the event loop::
ru: Подождите, пока дескриптор файла не получит некоторые данные с помощью метода :meth:`loop.add_reader`, а затем закройте цикл обработки событий::

source: A similar :ref:`example <asyncio_example_create_connection>` using transports, protocols, and the :meth:`loop.create_connection` method.
ru: Аналогичный :ref:`пример <asyncio_example_create_connection>` с использованием транспортов, протоколов и метода :meth:`loop.create_connection`.

source: Another similar :ref:`example <asyncio_example_create_connection-streams>` using the high-level :func:`asyncio.open_connection` function and streams.
ru: Другой похожий :ref:`пример <asyncio_example_create_connection-streams>` с использованием высокоуровневой :func:`asyncio.open_connection` функции и потоков.

source: Set signal handlers for SIGINT and SIGTERM
ru: Установите обработчики сигналов для SIGINT и SIGTERM

source: (This ``signals`` example only works on Unix.)
ru: (Этот пример сигналов работает только в Unix.)

source: Register handlers for signals :const:`~signal.SIGINT` and :const:`~signal.SIGTERM` using the :meth:`loop.add_signal_handler` method::
ru: Зарегистрируйте обработчики сигналов :const:`~signal.SIGINT` и :const:`~signal.SIGTERM` с помощью метода :meth:`loop.add_signal_handler`::
