Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/asyncio-queue.po
Languages: ru

source: Queues
ru: Очереди

source: **Source code:** :source:`Lib/asyncio/queues.py`
ru: **Исходный код:** :source:`Lib/asyncio/queues.py`

source: asyncio queues are designed to be similar to classes of the :mod:`queue` module. Although asyncio queues are not thread-safe, they are designed to be used specifically in async/await code.
ru: Очереди asyncio созданы так, чтобы быть похожими на классы модуля :mod:`queue`. Хотя очереди asyncio не являются потокобезопасными, они предназначены для использования специально в коде async/await.

source: Note that methods of asyncio queues don't have a *timeout* parameter; use :func:`asyncio.wait_for` function to do queue operations with a timeout.
ru: Обратите внимание, что методы очередей asyncio не имеют параметра *timeout*; используйте функцию :func:`asyncio.wait_for` для выполнения операций с очередью с таймаутом.

source: See also the `Examples`_ section below.
ru: См. также раздел «Примеры» ниже.

source: Queue
ru: Очередь

source: A first in, first out (FIFO) queue.
ru: Очередь «первым пришел — первым обслужен» (FIFO).

source: If *maxsize* is less than or equal to zero, the queue size is infinite. If it is an integer greater than ``0``, then ``await put()`` blocks when the queue reaches *maxsize* until an item is removed by :meth:`get`.
ru: Если *maxsize* меньше или равно нулю, размер очереди бесконечен. Если это целое число больше ``0``, то ``await put()`` блокируется, когда очередь достигает *maxsize*, пока элемент не будет удален с помощью :meth:`get`.

source: Unlike the standard library threading :mod:`queue`, the size of the queue is always known and can be returned by calling the :meth:`qsize` method.
ru: В отличие от потоковой обработки стандартной библиотеки :mod:`queue`, размер очереди всегда известен и может быть возвращен путем вызова метода :meth:`qsize`.

source: Removed the *loop* parameter.
ru: Удален параметр *loop*.

source: This class is :ref:`not thread safe <asyncio-multithreading>`.
ru: Этот класс :ref:`не потокобезопасен <asyncio-multithreading>`.

source: Number of items allowed in the queue.
ru: Количество элементов, разрешенных в очереди.

source: Return ``True`` if the queue is empty, ``False`` otherwise.
ru: Верните True, если очередь пуста, и False в противном случае.

source: Return ``True`` if there are :attr:`maxsize` items in the queue.
ru: Верните ``True``, если в очереди есть элементы :attr:`maxsize`.

source: If the queue was initialized with ``maxsize=0`` (the default), then :meth:`full` never returns ``True``.
ru: Если очередь была инициализирована с параметром maxsize=0 (по умолчанию), то :meth:`full` никогда не возвращает ``True``.

source: Remove and return an item from the queue. If queue is empty, wait until an item is available.
ru: Удалить и вернуть элемент из очереди. Если очередь пуста, подождите, пока элемент не станет доступен.

source: Raises :exc:`QueueShutDown` if the queue has been shut down and is empty, or if the queue has been shut down immediately.
ru: Вызывает :exc:`QueueShutDown`, если очередь была закрыта и пуста, или если очередь была закрыта немедленно.

source: Return an item if one is immediately available, else raise :exc:`QueueEmpty`.
ru: Вернуть элемент, если он доступен сразу, иначе поднять :exc:`QueueEmpty`.

source: Block until all items in the queue have been received and processed.
ru: Блокировать до тех пор, пока все элементы в очереди не будут получены и обработаны.

source: The count of unfinished tasks goes up whenever an item is added to the queue. The count goes down whenever a consumer coroutine calls :meth:`task_done` to indicate that the item was retrieved and all work on it is complete. When the count of unfinished tasks drops to zero, :meth:`join` unblocks.
ru: Количество незавершенных задач увеличивается каждый раз, когда элемент добавляется в очередь. Счетчик уменьшается всякий раз, когда сопрограмма потребителя вызывает :meth:`task_done`, чтобы указать, что элемент был получен и вся работа над ним завершена. Когда количество незавершенных задач падает до нуля, :meth:`join` разблокируется.

source: Put an item into the queue. If the queue is full, wait until a free slot is available before adding the item.
ru: Поместите элемент в очередь. Если очередь заполнена, подождите, пока освободится свободное место, прежде чем добавлять элемент.

source: Raises :exc:`QueueShutDown` if the queue has been shut down.
ru: Вызывает :exc:`QueueShutDown`, если очередь отключена.

source: Put an item into the queue without blocking.
ru: Поместите элемент в очередь без блокировки.

source: If no free slot is immediately available, raise :exc:`QueueFull`.
ru: Если в данный момент свободного места нет, поднимите :exc:`QueueFull`.

source: Return the number of items in the queue.
ru: Возвращает количество элементов в очереди.

source: Shut down the queue, making :meth:`~Queue.get` and :meth:`~Queue.put` raise :exc:`QueueShutDown`.
ru: Завершите работу очереди, заставив :meth:`~Queue.get` и :meth:`~Queue.put` поднять :exc:`QueueShutDown`.

source: By default, :meth:`~Queue.get` on a shut down queue will only raise once the queue is empty. Set *immediate* to true to make :meth:`~Queue.get` raise immediately instead.
ru: По умолчанию :meth:`~Queue.get` в очереди выключения активируется только тогда, когда очередь пуста. Установите для параметра *immediate* значение true, чтобы вместо этого немедленно вызвать :meth:`~Queue.get`.

source: All blocked callers of :meth:`~Queue.put` and :meth:`~Queue.get` will be unblocked. If *immediate* is true, a task will be marked as done for each remaining item in the queue, which may unblock callers of :meth:`~Queue.join`.
ru: Все заблокированные вызывающие :meth:`~Queue.put` и :meth:`~Queue.get` будут разблокированы. Если *immediate* имеет значение true, задача будет помечена как выполненная для каждого оставшегося элемента в очереди, что может разблокировать вызывающих :meth:`~Queue.join`.

source: If a :meth:`join` is currently blocking, it will resume when all items have been processed (meaning that a :meth:`task_done` call was received for every item that had been :meth:`~Queue.put` into the queue).
ru: Если :meth:`join` в данный момент блокируется, оно возобновится, когда все элементы будут обработаны (это означает, что вызов :meth:`task_done` был получен для каждого элемента, который был :meth:`~Queue.put` в очередь).

source: ``shutdown(immediate=True)`` calls :meth:`task_done` for each remaining item in the queue.
ru: ``shutdown(immediate=True)`` вызывает :meth:`task_done` для каждого оставшегося элемента в очереди.

source: Raises :exc:`ValueError` if called more times than there were items placed in the queue.
ru: Вызывает :exc:`ValueError`, если вызывается больше раз, чем было помещено в очередь элементов.

source: Priority Queue
ru: Приоритетная очередь

source: A variant of :class:`Queue`; retrieves entries in priority order (lowest first).
ru: Вариант :class:`Queue`; извлекает записи в порядке приоритета (сначала самый низкий).

source: Entries are typically tuples of the form ``(priority_number, data)``.
ru: Записи обычно представляют собой кортежи формы ``(priority_number, data)``.

source: LIFO Queue
ru: Очередь LIFO

source: A variant of :class:`Queue` that retrieves most recently added entries first (last in, first out).
ru: Вариант :class:`Queue`, который сначала извлекает самые последние добавленные записи (последними вошли, первыми вышли).

source: Exceptions
ru: Исключения

source: This exception is raised when the :meth:`~Queue.get_nowait` method is called on an empty queue.
ru: Это исключение возникает, когда метод :meth:`~Queue.get_nowait` вызывается в пустой очереди.

source: Exception raised when the :meth:`~Queue.put_nowait` method is called on a queue that has reached its *maxsize*.
ru: Исключение возникает, когда метод :meth:`~Queue.put_nowait` вызывается для очереди, достигшей своего *максимального размера*.

source: Exception raised when :meth:`~Queue.put` or :meth:`~Queue.get` is called on a queue which has been shut down.
ru: Исключение возникает, когда :meth:`~Queue.put` или :meth:`~Queue.get` вызывается в очереди, которая была отключена.

source: Examples
ru: Примеры

source: Queues can be used to distribute workload between several concurrent tasks::
ru: Очереди можно использовать для распределения рабочей нагрузки между несколькими одновременными задачами:
