Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/asyncio-stream.po
Languages: ru

source: Streams
ru: Потоки

source: **Source code:** :source:`Lib/asyncio/streams.py`
ru: **Исходный код:** :source:`Lib/asyncio/streams.py`

source: Streams are high-level async/await-ready primitives to work with network connections. Streams allow sending and receiving data without using callbacks or low-level protocols and transports.
ru: Потоки — это примитивы высокого уровня, готовые к асинхронности и ожиданию, для работы с сетевыми подключениями. Потоки позволяют отправлять и получать данные без использования обратных вызовов или низкоуровневых протоколов и транспортов.

source: Here is an example of a TCP echo client written using asyncio streams::
ru: Вот пример эхо-клиента TCP, написанного с использованием потоков asyncio:

source: See also the `Examples`_ section below.
ru: См. также раздел «Примеры» ниже.

source: Stream Functions
ru: Потоковые функции

source: The following top-level asyncio functions can be used to create and work with streams:
ru: Следующие функции asyncio верхнего уровня можно использовать для создания потоков и работы с ними:

source: Establish a network connection and return a pair of ``(reader, writer)`` objects.
ru: Установите сетевое соединение и верните пару объектов (читатель, писатель).

source: The returned *reader* and *writer* objects are instances of :class:`StreamReader` and :class:`StreamWriter` classes.
ru: Возвращенные объекты *reader* и *writer* являются экземплярами классов :class:`StreamReader` и :class:`StreamWriter`.

source: *limit* determines the buffer size limit used by the returned :class:`StreamReader` instance. By default the *limit* is set to 64 KiB.
ru: *limit* определяет предел размера буфера, используемый возвращаемым экземпляром :class:`StreamReader`. По умолчанию *предел* установлен на 64 КиБ.

source: The rest of the arguments are passed directly to :meth:`loop.create_connection`.
ru: Остальные аргументы передаются непосредственно в :meth:`loop.create_connection`.

source: The *sock* argument transfers ownership of the socket to the :class:`StreamWriter` created. To close the socket, call its :meth:`~asyncio.StreamWriter.close` method.
ru: Аргумент *sock* передает право собственности на сокет созданному :class:`StreamWriter`. Чтобы закрыть сокет, вызовите его метод :meth:`~asyncio.StreamWriter.close`.

source: Added the *ssl_handshake_timeout* parameter.
ru: Добавлен параметр *ssl_handshake_timeout*.

source: Added the *happy_eyeballs_delay* and *interleave* parameters.
ru: Добавлены параметры *happy_eyeballs_delay* и *interleave*.

source: Removed the *loop* parameter.
ru: Удален параметр *loop*.

source: Added the *ssl_shutdown_timeout* parameter.
ru: Добавлен параметр *ssl_shutdown_timeout*.

source: Start a socket server.
ru: Запустите сервер сокетов.

source: The *client_connected_cb* callback is called whenever a new client connection is established. It receives a ``(reader, writer)`` pair as two arguments, instances of the :class:`StreamReader` and :class:`StreamWriter` classes.
ru: Обратный вызов *client_connected_cb* вызывается всякий раз, когда устанавливается новое клиентское соединение. Он получает пару ``(читатель, писатель)`` в качестве двух аргументов, экземпляров классов :class:`StreamReader` и :class:`StreamWriter`.

source: *client_connected_cb* can be a plain callable or a :ref:`coroutine function <coroutine>`; if it is a coroutine function, it will be automatically scheduled as a :class:`Task`.
ru: *client_connected_cb* может быть простой вызываемой функцией или функцией сопрограммы <coroutine>`; если это функция сопрограммы, она будет автоматически запланирована как :class:`Task`.

source: The rest of the arguments are passed directly to :meth:`loop.create_server`.
ru: Остальные аргументы передаются непосредственно в :meth:`loop.create_server`.

source: The *sock* argument transfers ownership of the socket to the server created. To close the socket, call the server's :meth:`~asyncio.Server.close` method.
ru: Аргумент *sock* передает право собственности на сокет созданному серверу. Чтобы закрыть сокет, вызовите метод сервера :meth:`~asyncio.Server.close`.

source: Added the *ssl_handshake_timeout* and *start_serving* parameters.
ru: Добавлены параметры *ssl_handshake_timeout* и *start_serving*.

source: Unix Sockets
ru: Сокеты Unix

source: Establish a Unix socket connection and return a pair of ``(reader, writer)``.
ru: Установите соединение с сокетом Unix и верните пару ``(reader, Writer)``.

source: Similar to :func:`open_connection` but operates on Unix sockets.
ru: Похож на :func:`open_connection`, но работает с сокетами Unix.

source: See also the documentation of :meth:`loop.create_unix_connection`.
ru: См. также документацию :meth:`loop.create_unix_connection`.

source: Added the *ssl_handshake_timeout* parameter. The *path* parameter can now be a :term:`path-like object`
ru: Добавлен параметр *ssl_handshake_timeout*. Параметр *path* теперь может быть :term:`путеподобным объектом`

source: Start a Unix socket server.
ru: Запустите сервер сокетов Unix.

source: Similar to :func:`start_server` but works with Unix sockets.
ru: Похож на :func:`start_server`, но работает с сокетами Unix.

source: See also the documentation of :meth:`loop.create_unix_server`.
ru: См. также документацию :meth:`loop.create_unix_server`.

source: Added the *ssl_handshake_timeout* and *start_serving* parameters. The *path* parameter can now be a :term:`path-like object`.
ru: Добавлены параметры *ssl_handshake_timeout* и *start_serving*. Параметр *path* теперь может быть объектом, похожим на путь.

source: Represents a reader object that provides APIs to read data from the IO stream. As an :term:`asynchronous iterable`, the object supports the :keyword:`async for` statement.
ru: Представляет объект чтения, предоставляющий API для чтения данных из потока ввода-вывода. Как :term:`асинхронный итерируемый` объект поддерживает оператор :keyword:`async for`.

source: It is not recommended to instantiate *StreamReader* objects directly; use :func:`open_connection` and :func:`start_server` instead.
ru: Не рекомендуется создавать экземпляры объектов *StreamReader* напрямую; вместо этого используйте :func:`open_connection` и :func:`start_server`.

source: Acknowledge the EOF.
ru: Подтвердите EOF.

source: Read up to *n* bytes from the stream.
ru: Считайте до *n* байт из потока.

source: If *n* is not provided or set to ``-1``, read until EOF, then return all read :class:`bytes`. If EOF was received and the internal buffer is empty, return an empty ``bytes`` object.
ru: Если *n* не указано или установлено в ``-1``, читайте до EOF, затем возвращайте все прочитанные :class:`bytes`. Если получен EOF и внутренний буфер пуст, верните пустой объект ``bytes``.

source: If *n* is ``0``, return an empty ``bytes`` object immediately.
ru: Если *n* равно ``0``, немедленно вернуть пустой объект ``bytes``.

source: If *n* is positive, return at most *n* available ``bytes`` as soon as at least 1 byte is available in the internal buffer. If EOF is received before any byte is read, return an empty ``bytes`` object.
ru: Если *n* положительное значение, вернуть не более *n* доступных ``байтов``, как только во внутреннем буфере станет доступен хотя бы 1 байт. Если EOF получен до того, как прочитан какой-либо байт, верните пустой объект ``bytes``.

source: Read one line, where "line" is a sequence of bytes ending with ``\n``.
ru: Прочитайте одну строку, где «строка» — это последовательность байтов, заканчивающаяся ``\n``.

source: If EOF is received and ``\n`` was not found, the method returns partially read data.
ru: Если получен EOF и ``\n`` не найден, метод возвращает частично прочитанные данные.

source: If EOF is received and the internal buffer is empty, return an empty ``bytes`` object.
ru: Если получен EOF и внутренний буфер пуст, верните пустой объект ``bytes``.

source: Read exactly *n* bytes.
ru: Прочитайте ровно *n* байт.

source: Raise an :exc:`IncompleteReadError` if EOF is reached before *n* can be read. Use the :attr:`IncompleteReadError.partial` attribute to get the partially read data.
ru: Вызовите :exc:`IncompleteReadError`, если EOF достигнут до того, как *n* может быть прочитано. Используйте атрибут :attr:`IncompleteReadError.partial`, чтобы получить частично прочитанные данные.

source: Read data from the stream until *separator* is found.
ru: Чтение данных из потока до тех пор, пока не будет найден *разделитель*.

source: On success, the data and separator will be removed from the internal buffer (consumed). Returned data will include the separator at the end.
ru: В случае успеха данные и разделитель будут удалены из внутреннего буфера (израсходованы). Возвращенные данные будут содержать разделитель в конце.

source: If the amount of data read exceeds the configured stream limit, a :exc:`LimitOverrunError` exception is raised, and the data is left in the internal buffer and can be read again.
ru: Если объем прочитанных данных превышает настроенный предел потока, возникает исключение :exc:`LimitOverrunError`, и данные остаются во внутреннем буфере и могут быть прочитаны снова.

source: If EOF is reached before the complete separator is found, an :exc:`IncompleteReadError` exception is raised, and the internal buffer is reset. The :attr:`IncompleteReadError.partial` attribute may contain a portion of the separator.
ru: Если EOF достигается до того, как будет найден полный разделитель, возникает исключение :exc:`IncompleteReadError` и внутренний буфер сбрасывается. Атрибут :attr:`IncompleteReadError.partial` может содержать часть разделителя.

source: Return ``True`` if the buffer is empty and :meth:`feed_eof` was called.
ru: Верните ``True``, если буфер пуст и был вызван :meth:`feed_eof`.

source: Represents a writer object that provides APIs to write data to the IO stream.
ru: Представляет объект записи, предоставляющий API для записи данных в поток ввода-вывода.

source: It is not recommended to instantiate *StreamWriter* objects directly; use :func:`open_connection` and :func:`start_server` instead.
ru: Не рекомендуется создавать экземпляры объектов *StreamWriter* напрямую; вместо этого используйте :func:`open_connection` и :func:`start_server`.

source: The method attempts to write the *data* to the underlying socket immediately. If that fails, the data is queued in an internal write buffer until it can be sent.
ru: Метод пытается немедленно записать *данные* в базовый сокет. Если это не удается, данные помещаются в очередь во внутреннем буфере записи до тех пор, пока их нельзя будет отправить.

source: The method should be used along with the ``drain()`` method::
ru: Этот метод следует использовать вместе с методом ``drain()``::

source: The method writes a list (or any iterable) of bytes to the underlying socket immediately. If that fails, the data is queued in an internal write buffer until it can be sent.
ru: Метод немедленно записывает список (или любой итерируемый объект) байтов в базовый сокет. Если это не удается, данные помещаются в очередь во внутреннем буфере записи до тех пор, пока их нельзя будет отправить.

source: The method closes the stream and the underlying socket.
ru: Метод закрывает поток и базовый сокет.

source: The method should be used, though not mandatory, along with the ``wait_closed()`` method::
ru: Этот метод следует использовать, хотя и не обязательно, вместе с методом wait_closed():

source: Return ``True`` if the underlying transport supports the :meth:`write_eof` method, ``False`` otherwise.
ru: Возвращайте True, если базовый транспорт поддерживает метод :meth:write_eof, в противном случае — False.

source: Close the write end of the stream after the buffered write data is flushed.
ru: Закройте конец записи потока после того, как буферизованные данные записи будут очищены.

source: Return the underlying asyncio transport.
ru: Верните базовый транспорт asyncio.

source: Access optional transport information; see :meth:`BaseTransport.get_extra_info` for details.
ru: Доступ к дополнительной транспортной информации; подробности см. в :meth:`BaseTransport.get_extra_info`.

source: Wait until it is appropriate to resume writing to the stream. Example::
ru: Подождите, пока не станет возможным возобновить запись в поток. Пример::

source: This is a flow control method that interacts with the underlying IO write buffer. When the size of the buffer reaches the high watermark, *drain()* blocks until the size of the buffer is drained down to the low watermark and writing can be resumed. When there is nothing to wait for, the :meth:`drain` returns immediately.
ru: Это метод управления потоком, который взаимодействует с базовым буфером записи ввода-вывода. Когда размер буфера достигает верхнего уровня, *drain()* блокируется до тех пор, пока размер буфера не опустошится до нижнего уровня и запись не будет возобновлена. Когда ждать нечего, :meth:`drain` возвращается немедленно.

source: Upgrade an existing stream-based connection to TLS.
ru: Обновите существующее потоковое соединение до TLS.

source: Parameters:
ru: Параметры:

source: *sslcontext*: a configured instance of :class:`~ssl.SSLContext`.
ru: *sslcontext*: настроенный экземпляр :class:`~ssl.SSLContext`.

source: *server_hostname*: sets or overrides the host name that the target server's certificate will be matched against.
ru: *server_hostname*: устанавливает или переопределяет имя хоста, с которым будет сопоставляться сертификат целевого сервера.

source: *ssl_handshake_timeout* is the time in seconds to wait for the TLS handshake to complete before aborting the connection. ``60.0`` seconds if ``None`` (default).
ru: *ssl_handshake_timeout* — время в секундах ожидания завершения подтверждения TLS перед прерыванием соединения. ``60,0`` секунд, если ``Нет`` (по умолчанию).

source: Return ``True`` if the stream is closed or in the process of being closed.
ru: Верните True, если поток закрыт или находится в процессе закрытия.

source: Wait until the stream is closed.
ru: Подождите, пока поток не закроется.

source: Should be called after :meth:`close` to wait until the underlying connection is closed, ensuring that all data has been flushed before e.g. exiting the program.
ru: Должен вызываться после :meth:`close`, чтобы дождаться закрытия базового соединения, гарантируя, что все данные были сброшены, например, перед выходом из программы.

source: Examples
ru: Примеры

source: TCP echo client using streams
ru: TCP-эхо-клиент, использующий потоки

source: TCP echo client using the :func:`asyncio.open_connection` function::
ru: Эхо-клиент TCP, использующий функцию :func:`asyncio.open_connection`::

source: The :ref:`TCP echo client protocol <asyncio_example_tcp_echo_client_protocol>` example uses the low-level :meth:`loop.create_connection` method.
ru: В примере протокола клиента TCP echo <asyncio_example_tcp_echo_client_protocol>` используется низкоуровневый метод :meth:`loop.create_connection`.

source: TCP echo server using streams
ru: TCP-эхо-сервер, использующий потоки

source: TCP echo server using the :func:`asyncio.start_server` function::
ru: Эхо-сервер TCP, использующий функцию :func:`asyncio.start_server`::

source: The :ref:`TCP echo server protocol <asyncio_example_tcp_echo_server_protocol>` example uses the :meth:`loop.create_server` method.
ru: В примере протокола эхо-сервера TCP <asyncio_example_tcp_echo_server_protocol>` используется метод :meth:`loop.create_server`.

source: Get HTTP headers
ru: Получить HTTP-заголовки

source: Simple example querying HTTP headers of the URL passed on the command line::
ru: Простой пример запроса HTTP-заголовков URL-адреса, переданного в командной строке:

source: Usage::
ru: Использование::

source: or with HTTPS::
ru: или с HTTPS::

source: Register an open socket to wait for data using streams
ru: Зарегистрируйте открытый сокет для ожидания данных с помощью потоков

source: Coroutine waiting until a socket receives data using the :func:`open_connection` function::
ru: Сопрограмма ожидает, пока сокет не получит данные, используя функцию :func:`open_connection`::

source: The :ref:`register an open socket to wait for data using a protocol <asyncio_example_create_connection>` example uses a low-level protocol and the :meth:`loop.create_connection` method.
ru: В примере :ref:`регистрации открытого сокета для ожидания данных с использованием протокола <asyncio_example_create_connection>` используется протокол низкого уровня и метод :meth:`loop.create_connection`.

source: The :ref:`watch a file descriptor for read events <asyncio_example_watch_fd>` example uses the low-level :meth:`loop.add_reader` method to watch a file descriptor.
ru: В примере :ref:`наблюдения за файловым дескриптором на предмет событий чтения <asyncio_example_watch_fd>` используется низкоуровневый метод :meth:`loop.add_reader` для просмотра файлового дескриптора.
