Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/asyncio-task.po
Languages: ru, uk

source: A :exc:`TimeoutError` is raised if the timeout occurs before all awaitables are done. This is raised by the ``async for`` loop during asynchronous iteration or by the coroutines yielded during plain iteration.
ru: Ошибка :exc:`TimeoutError` возникает, если тайм-аут наступает до того, как все ожидаемые действия будут выполнены. Это вызывается циклом async for во время асинхронной итерации или сопрограммами, создаваемыми во время простой итерации.

source: Deprecation warning is emitted if not all awaitable objects in the *aws* iterable are Future-like objects and there is no running event loop.
ru: Предупреждение об устаревании выдается, если не все ожидаемые объекты в итерации *aws* являются объектами типа Future и не выполняется цикл обработки событий.

source: The result can now be used as either an :term:`asynchronous iterator` or as a plain :term:`iterator` (previously it was only a plain iterator).
ru: Результат теперь можно использовать либо как :term:`асинхронный итератор`, либо как простой :term:`итератор` (ранее это был только простой итератор).

source: Running in Threads
ru: Работа в потоках
uk: Запуск у потоках

source: Asynchronously run function *func* in a separate thread.
ru: Асинхронно запустите функцию *func* в отдельном потоке.
uk: Асинхронний запуск функції *func* в окремому потоці.

source: Any \*args and \*\*kwargs supplied for this function are directly passed to *func*. Also, the current :class:`contextvars.Context` is propagated, allowing context variables from the event loop thread to be accessed in the separate thread.
ru: Любые \*args и \*\*kwargs, предоставленные для этой функции, напрямую передаются в *func*. Кроме того, распространяется текущий :class:`contextvars.Context`, позволяя получать доступ к контекстным переменным из потока цикла событий в отдельном потоке.
uk: Будь-які \*args і \*\*kwargs, надані для цієї функції, безпосередньо передаються до *func*. Крім того, поточний :class:`contextvars.Context` поширюється, дозволяючи доступ до змінних контексту з потоку циклу подій в окремому потоці.

source: Return a coroutine that can be awaited to get the eventual result of *func*.
ru: Возвращает сопрограмму, которую можно ожидать, чтобы получить конечный результат *func*.
uk: Повертає співпрограму, яку можна очікувати, щоб отримати кінцевий результат *func*.

source: This coroutine function is primarily intended to be used for executing IO-bound functions/methods that would otherwise block the event loop if they were run in the main thread. For example::
ru: Эта функция сопрограммы в первую очередь предназначена для выполнения функций/методов, связанных с вводом-выводом, которые в противном случае заблокировали бы цикл событий, если бы они были запущены в основном потоке. Например::

source: Directly calling ``blocking_io()`` in any coroutine would block the event loop for its duration, resulting in an additional 1 second of run time. Instead, by using ``asyncio.to_thread()``, we can run it in a separate thread without blocking the event loop.
ru: Непосредственный вызов ``blocking_io()`` в любой сопрограмме заблокирует цикл событий на время его выполнения, что приведет к дополнительной 1 секунде выполнения. Вместо этого, используя asyncio.to_thread(), мы можем запустить его в отдельном потоке, не блокируя цикл событий.

source: Due to the :term:`GIL`, ``asyncio.to_thread()`` can typically only be used to make IO-bound functions non-blocking. However, for extension modules that release the GIL or alternative Python implementations that don't have one, ``asyncio.to_thread()`` can also be used for CPU-bound functions.
ru: Из-за :term:`GIL`, ``asyncio.to_thread()`` обычно можно использовать только для того, чтобы сделать неблокирующими функции, связанные с вводом-выводом. Однако для модулей расширения, выпускающих GIL, или альтернативных реализаций Python, у которых его нет, asyncio.to_thread() также можно использовать для функций, связанных с ЦП.

source: Scheduling From Other Threads
ru: Планирование из других потоков
uk: Планування з інших потоків

source: Submit a coroutine to the given event loop. Thread-safe.
ru: Отправьте сопрограмму в данный цикл событий. Потокобезопасный.
uk: Надішліть співпрограму в заданий цикл подій. Ниткобезпечний.

source: Return a :class:`concurrent.futures.Future` to wait for the result from another OS thread.
ru: Верните :class:`concurrent.futures.Future`, чтобы дождаться результата из другого потока ОС.
uk: Поверніть :class:`concurrent.futures.Future`, щоб дочекатися результату від іншого потоку ОС.

source: This function is meant to be called from a different OS thread than the one where the event loop is running. Example::
ru: Эта функция предназначена для вызова из другого потока ОС, отличного от того, в котором выполняется цикл событий. Пример::
uk: Цю функцію призначено для виклику з потоку ОС, відмінного від того, у якому виконується цикл подій. Приклад::

source: If an exception is raised in the coroutine, the returned Future will be notified. It can also be used to cancel the task in the event loop::
ru: Если в сопрограмме возникает исключение, возвращаемое Future будет уведомлено. Его также можно использовать для отмены задачи в цикле событий:
uk: Якщо в співпрограмі виникає виняток, буде повідомлено про повернутий Future. Його також можна використовувати для скасування завдання в циклі подій::

source: See the :ref:`concurrency and multithreading <asyncio-multithreading>` section of the documentation.
ru: См. раздел документации о :ref:`параллелизме и многопоточности <asyncio-multithreading>`.
uk: Перегляньте розділ :ref:`паралелізм і багатопотоковість <asyncio-multithreading>` документації.

source: Unlike other asyncio functions this function requires the *loop* argument to be passed explicitly.
ru: В отличие от других функций asyncio, эта функция требует явной передачи аргумента *loop*.
uk: На відміну від інших асинхронних функцій, ця функція вимагає явної передачі аргументу *loop*.

source: Introspection
ru: самоанализ
uk: самоаналіз

source: Return the currently running :class:`Task` instance, or ``None`` if no task is running.
ru: Возвращает текущий запущенный экземпляр :class:`Task` или ``None``, если ни одна задача не выполняется.
uk: Повертає поточний екземпляр :class:`Task` або ``None``, якщо жодне завдання не виконується.

source: If *loop* is ``None`` :func:`get_running_loop` is used to get the current loop.
ru: Если *loop* имеет значение ``None``, для получения текущего цикла используется :func:`get_running_loop`.
uk: Якщо *loop* має значення ``None`` :func:`get_running_loop` використовується для отримання поточного циклу.

source: Return a set of not yet finished :class:`Task` objects run by the loop.
ru: Возвращает набор еще не завершенных объектов :class:`Task`, запущенных в цикле.
uk: Повертає набір ще не завершених об’єктів :class:`Task`, які виконуються циклом.

source: If *loop* is ``None``, :func:`get_running_loop` is used for getting current loop.
ru: Если *loop* равен ``None``, для получения текущего цикла используется :func:`get_running_loop`.
uk: Якщо *loop* має значення ``None``, :func:`get_running_loop` використовується для отримання поточного циклу.

source: Return ``True`` if *obj* is a coroutine object.
ru: Верните ``True``, если *obj* является объектом сопрограммы.

source: Task Object
ru: Объект задачи
uk: Об'єкт завдання

source: A :class:`Future-like <Future>` object that runs a Python :ref:`coroutine <coroutine>`. Not thread-safe.
ru: :class:`Future-подобный объект <Future>`, который запускает Python :ref:`coroutine <coroutine>`. Не потокобезопасный.
uk: Об’єкт :class:`подібний до майбутнього <Future>`, який запускає :ref:`сопрограму Python <coroutine>`. Небезпечно для потоків.

source: Tasks are used to run coroutines in event loops. If a coroutine awaits on a Future, the Task suspends the execution of the coroutine and waits for the completion of the Future. When the Future is *done*, the execution of the wrapped coroutine resumes.
ru: Задачи используются для запуска сопрограмм в циклах событий. Если сопрограмма ожидает выполнения Future, Задача приостанавливает выполнение сопрограммы и ожидает завершения Future. Когда Future *done*, выполнение обернутой сопрограммы возобновляется.
uk: Завдання використовуються для виконання співпрограм у циклах подій. Якщо співпрограма очікує на Future, Завдання призупиняє виконання співпрограми та чекає завершення Future. Коли Future *done*, виконання загорнутої співпрограми відновлюється.

source: Event loops use cooperative scheduling: an event loop runs one Task at a time. While a Task awaits for the completion of a Future, the event loop runs other Tasks, callbacks, or performs IO operations.
ru: Циклы событий используют совместное планирование: цикл событий запускает одну задачу за раз. Пока Задача ожидает завершения Будущего, цикл событий запускает другие Задачи, обратные вызовы или выполняет операции ввода-вывода.
uk: Цикли подій використовують кооперативне планування: цикл подій виконує одне завдання за раз. Поки Завдання очікує завершення Майбутнього, цикл подій запускає інші Завдання, зворотні виклики або виконує операції введення-виведення.

source: Use the high-level :func:`asyncio.create_task` function to create Tasks, or the low-level :meth:`loop.create_task` or :func:`ensure_future` functions. Manual instantiation of Tasks is discouraged.
ru: Используйте функцию высокого уровня :func:`asyncio.create_task` для создания задач или функции низкого уровня :meth:`loop.create_task` или :func:`ensure_future`. Создание экземпляров задач вручную не рекомендуется.
uk: Використовуйте функцію високого рівня :func:`asyncio.create_task` для створення завдань або функції низького рівня :meth:`loop.create_task` або :func:`ensure_future`. Не рекомендується створювати завдання вручну.

source: To cancel a running Task use the :meth:`cancel` method. Calling it will cause the Task to throw a :exc:`CancelledError` exception into the wrapped coroutine. If a coroutine is awaiting on a Future object during cancellation, the Future object will be cancelled.
ru: Чтобы отменить запущенную Задачу, используйте метод :meth:`cancel`. Его вызов приведет к тому, что Задача выдаст исключение :exc:`CancelledError` в обернутую сопрограмму. Если сопрограмма ожидает объекта Future во время отмены, объект Future будет отменен.
uk: Щоб скасувати запущене завдання, використовуйте метод :meth:`cancel`. Його виклик призведе до того, що завдання створить виняток :exc:`CancelledError` у загорнутій співпрограмі. Якщо співпрограма очікує на об’єкті Future під час скасування, об’єкт Future буде скасовано.

source: :meth:`cancelled` can be used to check if the Task was cancelled. The method returns ``True`` if the wrapped coroutine did not suppress the :exc:`CancelledError` exception and was actually cancelled.
ru: :meth:`cancelled` можно использовать, чтобы проверить, была ли задача отменена. Метод возвращает True, если обернутая сопрограмма не подавила исключение :exc:`CancelledError` и была фактически отменена.
uk: :meth:`cancelled` можна використовувати, щоб перевірити, чи було скасовано завдання. Метод повертає ``True``, якщо загорнута співпрограма не придушила виняток :exc:`CancelledError` і була фактично скасована.

source: :class:`asyncio.Task` inherits from :class:`Future` all of its APIs except :meth:`Future.set_result` and :meth:`Future.set_exception`.
ru: :class:`asyncio.Task` наследует от :class:`Future` все его API, кроме :meth:`Future.set_result` и :meth:`Future.set_Exception`.
uk: :class:`asyncio.Task` успадковує від :class:`Future` усі його API, крім :meth:`Future.set_result` і :meth:`Future.set_exception`.

source: An optional keyword-only *context* argument allows specifying a custom :class:`contextvars.Context` for the *coro* to run in. If no *context* is provided, the Task copies the current context and later runs its coroutine in the copied context.
ru: Необязательный аргумент *context*, содержащий только ключевые слова, позволяет указать собственный :class:`contextvars.Context` для запуска *coro*. Если *context* не указан, Задача копирует текущий контекст и позже запускает свою сопрограмму в скопированный контекст.

source: An optional keyword-only *eager_start* argument allows eagerly starting the execution of the :class:`asyncio.Task` at task creation time. If set to ``True`` and the event loop is running, the task will start executing the coroutine immediately, until the first time the coroutine blocks. If the coroutine returns or raises without blocking, the task will be finished eagerly and will skip scheduling to the event loop.
ru: Необязательный аргумент *eager_start*, содержащий только ключевые слова, позволяет быстро начать выполнение :class:`asyncio.Task` во время создания задачи. Если установлено значение «True» и цикл событий запущен, задача начнет выполнение сопрограммы немедленно, пока сопрограмма не заблокируется в первый раз. Если сопрограмма возвращается или вызывается без блокировки, задача будет быстро завершена и планирование цикла событий будет пропущено.

source: Added support for the :mod:`contextvars` module.
ru: Добавлена ​​поддержка модуля :mod:`contextvars`.
uk: Додано підтримку модуля :mod:`contextvars`.

source: Deprecation warning is emitted if *loop* is not specified and there is no running event loop.
ru: Предупреждение об устаревании выдается, если *loop* не указан и нет работающего цикла событий.

source: Added the *eager_start* parameter.
ru: Добавлен параметр *eager_start*.

source: Return ``True`` if the Task is *done*.
ru: Верните ``True``, если Задача *done*.
uk: Повертає ``True``, якщо завдання *виконано*.

source: A Task is *done* when the wrapped coroutine either returned a value, raised an exception, or the Task was cancelled.
ru: Задача считается *выполненной*, когда обернутая сопрограмма либо вернула значение, вызвала исключение, либо Задача была отменена.
uk: Завдання вважається *виконаним*, коли загорнута співпрограма або повернула значення, викликала виняток, або завдання було скасовано.

source: Return the result of the Task.
ru: Вернуть результат задачи.
uk: Повернути результат Завдання.

source: If the Task is *done*, the result of the wrapped coroutine is returned (or if the coroutine raised an exception, that exception is re-raised.)
ru: Если Задача *done*, возвращается результат обернутой сопрограммы (или, если сопрограмма вызвала исключение, это исключение вызывается повторно.)
uk: Якщо завдання *виконано*, повертається результат загорнутої співпрограми (або якщо співпрограма викликала виняток, цей виняток викликається повторно).

source: If the Task has been *cancelled*, this method raises a :exc:`CancelledError` exception.
ru: Если Задача была *отменена*, этот метод вызывает исключение :exc:`CancelledError`.
uk: Якщо завдання було *скасовано*, цей метод викликає виняток :exc:`CancelledError`.

source: If the Task's result isn't yet available, this method raises an :exc:`InvalidStateError` exception.
ru: Если результат Задачи еще недоступен, этот метод вызывает исключение :exc:`InvalidStateError`.

source: Return the exception of the Task.
ru: Вернуть исключение задачи.
uk: Повернути виняток Завдання.

source: If the wrapped coroutine raised an exception that exception is returned. If the wrapped coroutine returned normally this method returns ``None``.
ru: Если обернутая сопрограмма вызвала исключение, это исключение возвращается. Если обернутая сопрограмма вернулась нормально, этот метод возвращает None.
uk: Якщо загорнута співпрограма викликала виняток, цей виняток повертається. Якщо загорнута співпрограма повертає нормальний результат, цей метод повертає ``None``.

source: If the Task isn't *done* yet, this method raises an :exc:`InvalidStateError` exception.
ru: Если Задача еще не *выполнена*, этот метод вызывает исключение :exc:`InvalidStateError`.
uk: Якщо завдання ще не *виконано*, цей метод викликає виняток :exc:`InvalidStateError`.

source: Add a callback to be run when the Task is *done*.
ru: Добавьте обратный вызов, который будет выполняться, когда Задача *выполнена*.
uk: Додайте зворотний виклик, який буде запущено, коли Завдання *виконано*.

source: This method should only be used in low-level callback-based code.
ru: Этот метод следует использовать только в низкоуровневом коде, основанном на обратном вызове.
uk: Цей метод слід використовувати лише в низькорівневому коді на основі зворотного виклику.

source: See the documentation of :meth:`Future.add_done_callback` for more details.
ru: Дополнительную информацию смотрите в документации :meth:`Future.add_done_callback`.
uk: Перегляньте документацію :meth:`Future.add_done_callback` для отримання додаткової інформації.

source: Remove *callback* from the callbacks list.
ru: Удалите *callback* из списка обратных вызовов.
uk: Видалити *callback* зі списку зворотних викликів.

source: See the documentation of :meth:`Future.remove_done_callback` for more details.
ru: Дополнительную информацию смотрите в документации :meth:`Future.remove_done_callback`.
uk: Перегляньте документацію :meth:`Future.remove_done_callback` для отримання додаткової інформації.

source: Return the list of stack frames for this Task.
ru: Верните список кадров стека для этой задачи.
uk: Повернути список фреймів стека для цього завдання.

source: If the wrapped coroutine is not done, this returns the stack where it is suspended. If the coroutine has completed successfully or was cancelled, this returns an empty list. If the coroutine was terminated by an exception, this returns the list of traceback frames.
ru: Если обернутая сопрограмма не завершена, возвращается стек, в котором она приостановлена. Если сопрограмма завершилась успешно или была отменена, возвращается пустой список. Если сопрограмма была прервана из-за исключения, возвращается список кадров обратной трассировки.
uk: Якщо загорнуту співпрограму не виконано, це повертає стек, де він був призупинений. Якщо співпрограма завершилася успішно або була скасована, повертається порожній список. Якщо співпрограму було припинено через виняток, повертається список кадрів трасування.

source: The frames are always ordered from oldest to newest.
ru: Кадры всегда располагаются в порядке от самого старого к самому новому.
uk: Рамки завжди впорядковуються від найстаріших до найновіших.

source: Only one stack frame is returned for a suspended coroutine.
ru: Для приостановленной сопрограммы возвращается только один кадр стека.
uk: Для призупиненої співпрограми повертається лише один кадр стека.

source: The optional *limit* argument sets the maximum number of frames to return; by default all available frames are returned. The ordering of the returned list differs depending on whether a stack or a traceback is returned: the newest frames of a stack are returned, but the oldest frames of a traceback are returned. (This matches the behavior of the traceback module.)
ru: Необязательный аргумент *limit* устанавливает максимальное количество возвращаемых кадров; по умолчанию возвращаются все доступные кадры. Порядок возвращаемого списка различается в зависимости от того, возвращается ли стек или обратная трассировка: возвращаются самые новые кадры стека, но возвращаются самые старые кадры обратной трассировки. (Это соответствует поведению модуля трассировки.)
uk: Необов'язковий аргумент *limit* встановлює максимальну кількість кадрів для повернення; за замовчуванням повертаються всі доступні кадри. Порядок поверненого списку відрізняється залежно від того, повертається стек чи трасування: повертаються найновіші кадри стеку, але повертаються найстаріші кадри трасування. (Це відповідає поведінці модуля відстеження.)

source: Print the stack or traceback for this Task.
ru: Распечатайте стек или обратную трассировку для этой задачи.
uk: Роздрукуйте стек або відстеження для цього завдання.

source: This produces output similar to that of the traceback module for the frames retrieved by :meth:`get_stack`.
ru: Это создает выходные данные, аналогичные выводам модуля трассировки для кадров, полученных с помощью :meth:`get_stack`.
uk: Це створює вихідні дані, подібні до результатів модуля трасування для кадрів, отриманих :meth:`get_stack`.

source: The *limit* argument is passed to :meth:`get_stack` directly.
ru: Аргумент *limit* передается непосредственно в :meth:`get_stack`.
uk: Аргумент *limit* передається безпосередньо в :meth:`get_stack`.

source: The *file* argument is an I/O stream to which the output is written; by default output is written to :data:`sys.stdout`.
ru: Аргумент *file* представляет собой поток ввода-вывода, в который записываются выходные данные; по умолчанию вывод записывается в :data:`sys.stdout`.

source: Return the coroutine object wrapped by the :class:`Task`.
ru: Верните объект сопрограммы, завернутый в :class:`Task`.
uk: Повертає об’єкт співпрограми, обгорнутий :class:`Task`.

source: This will return ``None`` for Tasks which have already completed eagerly. See the :ref:`Eager Task Factory <eager-task-factory>`.
ru: Это вернет None для задач, которые уже успешно завершены. См. :ref:`Eager Task Factory <eager-task-factory>`.

source: Newly added eager task execution means result may be ``None``.
ru: Недавно добавленное активное выполнение задачи означает, что результат может быть «Нет».

source: Return the :class:`contextvars.Context` object associated with the task.
ru: Верните объект :class:`contextvars.Context`, связанный с задачей.

source: Return the name of the Task.
ru: Верните имя задачи.
uk: Повернути назву завдання.

source: If no name has been explicitly assigned to the Task, the default asyncio Task implementation generates a default name during instantiation.
ru: Если задаче явно не присвоено имя, реализация задачи asyncio по умолчанию генерирует имя по умолчанию во время создания экземпляра.
uk: Якщо Завданню не було явно призначено ім’я, реалізація асинхронного Завдання за замовчуванням генерує ім’я за замовчуванням під час створення екземпляра.

source: Set the name of the Task.
ru: Задайте имя задачи.
uk: Встановіть назву завдання.

source: The *value* argument can be any object, which is then converted to a string.
ru: Аргументом *value* может быть любой объект, который затем преобразуется в строку.
uk: Аргументом *value* може бути будь-який об’єкт, який потім перетворюється на рядок.

source: In the default Task implementation, the name will be visible in the :func:`repr` output of a task object.
ru: В реализации задачи по умолчанию имя будет видно в выводе :func:`repr` объекта задачи.
uk: У реалізації Task за замовчуванням ім’я буде видно у виводі :func:`repr` об’єкта task.

source: Request the Task to be cancelled.
ru: Запросить отмену задачи.
uk: Вимагайте скасування Завдання.

source: This arranges for a :exc:`CancelledError` exception to be thrown into the wrapped coroutine on the next cycle of the event loop.
ru: Это обеспечивает выдачу исключения :exc:`CancelledError` в обернутую сопрограмму в следующем цикле цикла событий.
uk: Це організовує виняток :exc:`CancelledError`, який буде створено в загорнутій співпрограмі в наступному циклі циклу подій.
