Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/asyncio-task.po
Languages: ru, uk

source: The coroutine then has a chance to clean up or even deny the request by suppressing the exception with a :keyword:`try` ... ... ``except CancelledError`` ... :keyword:`finally` block. Therefore, unlike :meth:`Future.cancel`, :meth:`Task.cancel` does not guarantee that the Task will be cancelled, although suppressing cancellation completely is not common and is actively discouraged. Should the coroutine nevertheless decide to suppress the cancellation, it needs to call :meth:`Task.uncancel` in addition to catching the exception.
ru: Затем сопрограмма имеет возможность очистить или даже отклонить запрос, подавив исключение с помощью блока :keyword:`try` ... ... ``кроме CancelledError`` ... :keyword:`finally`. Таким образом, в отличие от :meth:`Future.cancel`, :meth:`Task.cancel` не гарантирует, что Задача будет отменена, хотя полное подавление отмены не является распространенным явлением и активно не рекомендуется. Если сопрограмма все же решит подавить отмену, в дополнение к перехвату исключения ей необходимо вызвать :meth:`Task.uncancel`.

source: Added the *msg* parameter.
ru: Добавлен параметр *msg*.

source: The ``msg`` parameter is propagated from cancelled task to its awaiter.
ru: Параметр ``msg`` передается от отмененной задачи к ее ожидающему.

source: The following example illustrates how coroutines can intercept the cancellation request::
ru: Следующий пример иллюстрирует, как сопрограммы могут перехватить запрос на отмену:
uk: Наступний приклад ілюструє, як співпрограми можуть перехопити запит на скасування:

source: Return ``True`` if the Task is *cancelled*.
ru: Верните ``True``, если Задача *отменена*.
uk: Повертає ``True``, якщо завдання *скасовано*.

source: The Task is *cancelled* when the cancellation was requested with :meth:`cancel` and the wrapped coroutine propagated the :exc:`CancelledError` exception thrown into it.
ru: Задача *отменяется*, когда отмена была запрошена с помощью :meth:`cancel` и обернутая сопрограмма распространила в нее исключение :exc:`CancelledError`.
uk: Завдання *скасовується*, коли запит на скасування надійшов за допомогою :meth:`cancel`, а загорнута співпрограма поширила виняткову ситуацію :exc:`CancelledError`, яка виникла в ній.

source: Decrement the count of cancellation requests to this Task.
ru: Уменьшите количество запросов на отмену этой задачи.

source: Returns the remaining number of cancellation requests.
ru: Возвращает оставшееся количество запросов на отмену.

source: Note that once execution of a cancelled task completed, further calls to :meth:`uncancel` are ineffective.
ru: Обратите внимание, что после завершения выполнения отмененной задачи дальнейшие вызовы :meth:`uncancel` становятся неэффективными.

source: This method is used by asyncio's internals and isn't expected to be used by end-user code. In particular, if a Task gets successfully uncancelled, this allows for elements of structured concurrency like :ref:`taskgroups` and :func:`asyncio.timeout` to continue running, isolating cancellation to the respective structured block. For example::
ru: Этот метод используется внутренними компонентами asyncio и не предполагается, что он будет использоваться кодом конечного пользователя. В частности, если Задача успешно отменена, это позволяет элементам структурированного параллелизма, таким как :ref:`taskgroups` и :func:`asyncio.timeout`, продолжать работу, изолируя отмену соответствующего структурированного блока. Например::

source: While the block with ``make_request()`` and ``make_another_request()`` might get cancelled due to the timeout, ``unrelated_code()`` should continue running even in case of the timeout. This is implemented with :meth:`uncancel`. :class:`TaskGroup` context managers use :func:`uncancel` in a similar fashion.
ru: Хотя блок с ``make_request()`` и ``make_another_request()`` может быть отменен из-за таймаута, ``unrelated_code()`` должен продолжать работу даже в случае таймаута. Это реализуется с помощью :meth:`uncancel`. Контекстные менеджеры :class:`TaskGroup` используют :func:`uncancel` аналогичным образом.

source: If end-user code is, for some reason, suppressing cancellation by catching :exc:`CancelledError`, it needs to call this method to remove the cancellation state.
ru: Если код конечного пользователя по какой-то причине подавляет отмену, перехватывая :exc:`CancelledError`, ему необходимо вызвать этот метод, чтобы удалить состояние отмены.

source: When this method decrements the cancellation count to zero, the method checks if a previous :meth:`cancel` call had arranged for :exc:`CancelledError` to be thrown into the task. If it hasn't been thrown yet, that arrangement will be rescinded (by resetting the internal ``_must_cancel`` flag).
ru: Когда этот метод уменьшает счетчик отмены до нуля, метод проверяет, был ли предыдущий вызов :meth:`cancel` организован для вызова :exc:`CancelledError` в задачу. Если он еще не был выбран, эта договоренность будет отменена (путем сброса внутреннего флага ``_must_cancel``).

source: Changed to rescind pending cancellation requests upon reaching zero.
ru: Изменено: отменять ожидающие запросы на отмену при достижении нуля.

source: Return the number of pending cancellation requests to this Task, i.e., the number of calls to :meth:`cancel` less the number of :meth:`uncancel` calls.
ru: Возвращает количество ожидающих запросов на отмену для этой задачи, т. е. количество вызовов :meth:`cancel` за вычетом количества вызовов :meth:`uncancel`.

source: Note that if this number is greater than zero but the Task is still executing, :meth:`cancelled` will still return ``False``. This is because this number can be lowered by calling :meth:`uncancel`, which can lead to the task not being cancelled after all if the cancellation requests go down to zero.
ru: Обратите внимание: если это число больше нуля, но Задача все еще выполняется, :meth:`cancelled` всё равно вернет ``False``. Это связано с тем, что это число можно уменьшить, вызвав :meth:`uncancel`, что может привести к тому, что задача вообще не будет отменена, если запросы на отмену упадут до нуля.

source: This method is used by asyncio's internals and isn't expected to be used by end-user code. See :meth:`uncancel` for more details.
ru: Этот метод используется внутренними компонентами asyncio и не предполагается, что он будет использоваться кодом конечного пользователя. См. :meth:`uncancel` для более подробной информации.

source: To actually run a coroutine, asyncio provides three main mechanisms:
uk: Щоб фактично запустити співпрограму, asyncio надає три основні механізми:

source: Save a reference to the result of this function, to avoid a task disappearing mid execution.
uk: Збережіть посилання на результат цієї функції, щоб уникнути зникнення завдання під час виконання.

source: If *return_exceptions* is False, cancelling gather() after it has been marked done won't cancel any submitted awaitables. For instance, gather can be marked done after propagating an exception to the caller, therefore, calling ``gather.cancel()`` after catching an exception (raised by one of the awaitables) from gather won't cancel any other awaitables.
uk: Якщо *return_exceptions* має значення False, скасування gather() після того, як його було позначено як виконане, не скасує жодних надісланих очікувань. Наприклад, gather можна позначити як виконане після передачі винятку викликаючому, отже, виклик ``gather.cancel()`` після перехоплення винятку (викликаного одним із очікуваних) від gather не скасує жодних інших очікуваних.

source: The function will return when any future finishes by raising an exception. If no future raises an exception then it is equivalent to :const:`ALL_COMPLETED`.
uk: Функція повернеться, коли будь-який майбутній завершиться, викликавши виняток. Якщо жодне майбутнє не викликає винятку, це еквівалентно :const:`ALL_COMPLETED`.

source: Run :ref:`awaitable objects <asyncio-awaitables>` in the *aws* iterable concurrently. Return an iterator of coroutines. Each coroutine returned can be awaited to get the earliest next result from the iterable of the remaining awaitables.
uk: Запустіть :ref:`waitable objects <asyncio-awaitables>` в *aws* iterable одночасно. Повертає ітератор співпрограм. Кожну повернуту співпрограму можна очікувати, щоб отримати найраніший наступний результат із ітерації решти очікуваних.

source: Directly calling `blocking_io()` in any coroutine would block the event loop for its duration, resulting in an additional 1 second of run time. Instead, by using `asyncio.to_thread()`, we can run it in a separate thread without blocking the event loop.
uk: Безпосередній виклик `blocking_io()` у будь-якій співпрограмі заблокує цикл подій на весь час, що призведе до додаткової 1 секунди часу виконання. Натомість, використовуючи `asyncio.to_thread()`, ми можемо запустити його в окремому потоці, не блокуючи цикл подій.

source: Due to the :term:`GIL`, `asyncio.to_thread()` can typically only be used to make IO-bound functions non-blocking. However, for extension modules that release the GIL or alternative Python implementations that don't have one, `asyncio.to_thread()` can also be used for CPU-bound functions.
uk: Завдяки :term:`GIL`, `asyncio.to_thread()` зазвичай можна використовувати лише для того, щоб зробити функції, пов’язані з IO, неблокуючими. Однак для модулів розширення, які випускають GIL або альтернативних реалізацій Python, у яких його немає, `asyncio.to_thread()` також можна використовувати для пов’язаних з ЦП функцій.

source: Tasks support the :mod:`contextvars` module. When a Task is created it copies the current context and later runs its coroutine in the copied context.
uk: Завдання підтримують модуль :mod:`contextvars`. Коли завдання створюється, воно копіює поточний контекст і пізніше виконує свою співпрограму в скопійованому контексті.

source: The coroutine then has a chance to clean up or even deny the request by suppressing the exception with a :keyword:`try` ... ... ``except CancelledError`` ... :keyword:`finally` block. Therefore, unlike :meth:`Future.cancel`, :meth:`Task.cancel` does not guarantee that the Task will be cancelled, although suppressing cancellation completely is not common and is actively discouraged.
uk: Тоді співпрограма має шанс очистити або навіть відхилити запит, придушивши виняток за допомогою блоку :keyword:`try` ... ... ``except CancelledError`` ... :keyword:`finally`. Таким чином, на відміну від :meth:`Future.cancel`, :meth:`Task.cancel` не гарантує, що Завдання буде скасовано, хоча повне придушення скасування не є поширеним явищем і активно не рекомендується.

source: If the Task's result isn't yet available, this method raises a :exc:`InvalidStateError` exception.
uk: Якщо результат завдання ще не доступний, цей метод викликає виняток :exc:`InvalidStateError`.

source: The *file* argument is an I/O stream to which the output is written; by default output is written to :data:`sys.stderr`.
uk: Аргумент *file* — це потік введення/виведення, до якого записується вихід; за замовчуванням вихід записується в :data:`sys.stderr`.
