Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/asyncio-eventloop.po
Languages: ru

source: *path* is the name of a Unix domain socket, and is required, unless a *sock* argument is provided. Abstract Unix sockets, :class:`str`, :class:`bytes`, and :class:`~pathlib.Path` paths are supported.
ru: *path* — это имя сокета домена Unix. Оно является обязательным, если не указан аргумент *sock*. Поддерживаются абстрактные сокеты Unix, пути :class:`str`, :class:`bytes` и :class:`~pathlib.Path`.

source: If *cleanup_socket* is true then the Unix socket will automatically be removed from the filesystem when the server is closed, unless the socket has been replaced after the server has been created.
ru: Если *cleanup_socket* имеет значение true, сокет Unix будет автоматически удален из файловой системы при закрытии сервера, если только сокет не был заменен после создания сервера.

source: See the documentation of the :meth:`loop.create_server` method for information about arguments to this method.
ru: См. документацию метода :meth:`loop.create_server` для получения информации об аргументах этого метода.

source: Added the *ssl_handshake_timeout* and *start_serving* parameters. The *path* parameter can now be a :class:`~pathlib.Path` object.
ru: Добавлены параметры *ssl_handshake_timeout* и *start_serving*. Параметр *path* теперь может быть объектом :class:`~pathlib.Path`.

source: Added the *cleanup_socket* parameter.
ru: Добавлен параметр *cleanup_socket*.

source: Wrap an already accepted connection into a transport/protocol pair.
ru: Оберните уже принятое соединение в пару транспорт/протокол.

source: This method can be used by servers that accept connections outside of asyncio but that use asyncio to handle them.
ru: Этот метод может использоваться серверами, которые принимают соединения вне asyncio, но используют asyncio для их обработки.

source: Parameters:
ru: Параметры:

source: *sock* is a preexisting socket object returned from :meth:`socket.accept <socket.socket.accept>`.
ru: *sock* — это уже существующий объект сокета, возвращаемый из :meth:`socket.accept <socket.socket.accept>`.

source: *ssl* can be set to an :class:`~ssl.SSLContext` to enable SSL over the accepted connections.
ru: Для *ssl* можно установить :class:`~ssl.SSLContext`, чтобы включить SSL для принятых соединений.

source: *ssl_handshake_timeout* is (for an SSL connection) the time in seconds to wait for the SSL handshake to complete before aborting the connection. ``60.0`` seconds if ``None`` (default).
ru: *ssl_handshake_timeout* — это (для SSL-соединения) время в секундах ожидания завершения SSL-квитирования перед прерыванием соединения. ``60,0`` секунд, если ``Нет`` (по умолчанию).

source: Returns a ``(transport, protocol)`` pair.
ru: Возвращает пару ``(транспорт, протокол)``.

source: Transferring files
ru: Передача файлов

source: Send a *file* over a *transport*. Return the total number of bytes sent.
ru: Отправьте *файл* через *транспорт*. Возвращает общее количество отправленных байтов.

source: The method uses high-performance :meth:`os.sendfile` if available.
ru: Этот метод использует высокопроизводительный :meth:`os.sendfile`, если он доступен.

source: *file* must be a regular file object opened in binary mode.
ru: *файл* должен быть обычным файловым объектом, открытым в двоичном режиме.

source: *offset* tells from where to start reading the file. If specified, *count* is the total number of bytes to transmit as opposed to sending the file until EOF is reached. File position is always updated, even when this method raises an error, and :meth:`file.tell() <io.IOBase.tell>` can be used to obtain the actual number of bytes sent.
ru: *offset* указывает, с чего начать чтение файла. Если указано, *count* — это общее количество байтов для передачи вместо отправки файла до достижения EOF. Позиция файла всегда обновляется, даже если этот метод вызывает ошибку, и :meth:`file.tell() <io.IOBase.tell>` можно использовать для получения фактического количества отправленных байтов.

source: *fallback* set to ``True`` makes asyncio to manually read and send the file when the platform does not support the sendfile system call (e.g. Windows or SSL socket on Unix).
ru: *fallback*, установленный в ``True``, заставляет asyncio вручную читать и отправлять файл, когда платформа не поддерживает системный вызов sendfile (например, сокет Windows или SSL в Unix).

source: Raise :exc:`SendfileNotAvailableError` if the system does not support the *sendfile* syscall and *fallback* is ``False``.
ru: Поднимите :exc:`SendfileNotAvailableError`, если система не поддерживает системный вызов *sendfile* и *fallback* имеет значение ``False``.

source: TLS Upgrade
ru: Обновление TLS

source: Upgrade an existing transport-based connection to TLS.
ru: Обновите существующее транспортное соединение до TLS.

source: Create a TLS coder/decoder instance and insert it between the *transport* and the *protocol*. The coder/decoder implements both *transport*-facing protocol and *protocol*-facing transport.
ru: Создайте экземпляр кодера/декодера TLS и вставьте его между *транспортом* и *протоколом*. Кодер/декодер реализует как протокол, ориентированный на *транспорт*, так и транспорт, ориентированный на *протокол*.

source: Return the created two-interface instance. After *await*, the *protocol* must stop using the original *transport* and communicate with the returned object only because the coder caches *protocol*-side data and sporadically exchanges extra TLS session packets with *transport*.
ru: Верните созданный двухинтерфейсный экземпляр. После *await* *протокол* должен прекратить использование исходного *транспорта* и взаимодействовать с возвращаемым объектом только потому, что кодер кэширует данные на стороне *протокола* и время от времени обменивается дополнительными пакетами сеанса TLS с *транспортом*.

source: In some situations (e.g. when the passed transport is already closing) this may return ``None``.
ru: В некоторых ситуациях (например, когда переданный транспорт уже закрывается) это может возвращать None.

source: *transport* and *protocol* instances that methods like :meth:`~loop.create_server` and :meth:`~loop.create_connection` return.
ru: экземпляры *transport* и *protocol*, возвращаемые такими методами, как :meth:`~loop.create_server` и :meth:`~loop.create_connection`.

source: *sslcontext*: a configured instance of :class:`~ssl.SSLContext`.
ru: *sslcontext*: настроенный экземпляр :class:`~ssl.SSLContext`.

source: *server_side* pass ``True`` when a server-side connection is being upgraded (like the one created by :meth:`~loop.create_server`).
ru: *server_side* передает ``True`` при обновлении соединения на стороне сервера (например, созданного :meth:`~loop.create_server`).

source: *server_hostname*: sets or overrides the host name that the target server's certificate will be matched against.
ru: *server_hostname*: устанавливает или переопределяет имя хоста, с которым будет сопоставляться сертификат целевого сервера.

source: Watching file descriptors
ru: Наблюдение за дескрипторами файлов

source: Start monitoring the *fd* file descriptor for read availability and invoke *callback* with the specified arguments once *fd* is available for reading.
ru: Начните отслеживать файловый дескриптор *fd* на доступность чтения и вызовите *callback* с указанными аргументами, как только *fd* станет доступным для чтения.

source: Stop monitoring the *fd* file descriptor for read availability. Returns ``True`` if *fd* was previously being monitored for reads.
ru: Прекратите мониторинг файлового дескриптора *fd* на предмет доступности чтения. Возвращает ``True``, если *fd* ранее отслеживался на предмет чтения.

source: Start monitoring the *fd* file descriptor for write availability and invoke *callback* with the specified arguments once *fd* is available for writing.
ru: Начните отслеживать файловый дескриптор *fd* на доступность записи и вызовите *callback* с указанными аргументами, как только *fd* станет доступен для записи.

source: Use :func:`functools.partial` :ref:`to pass keyword arguments <asyncio-pass-keywords>` to *callback*.
ru: Используйте :func:`functools.partial` :ref:`для передачи аргументов ключевого слова <asyncio-pass-keywords>` в *callback*.

source: Stop monitoring the *fd* file descriptor for write availability. Returns ``True`` if *fd* was previously being monitored for writes.
ru: Прекратите мониторинг файлового дескриптора *fd* на предмет доступности записи. Возвращает ``True``, если *fd* ранее отслеживался на предмет записи.

source: See also :ref:`Platform Support <asyncio-platform-support>` section for some limitations of these methods.
ru: См. также раздел :ref:`Поддержка платформы <asyncio-platform-support>`, где описаны некоторые ограничения этих методов.

source: Working with socket objects directly
ru: Работа с объектами сокетов напрямую

source: In general, protocol implementations that use transport-based APIs such as :meth:`loop.create_connection` and :meth:`loop.create_server` are faster than implementations that work with sockets directly. However, there are some use cases when performance is not critical, and working with :class:`~socket.socket` objects directly is more convenient.
ru: В общем, реализации протоколов, использующие API на основе транспорта, такие как :meth:`loop.create_connection` и :meth:`loop.create_server`, работают быстрее, чем реализации, которые работают с сокетами напрямую. Однако есть случаи использования, когда производительность не критична и удобнее работать напрямую с объектами :class:`~socket.socket`.

source: Receive up to *nbytes* from *sock*. Asynchronous version of :meth:`socket.recv() <socket.socket.recv>`.
ru: Получите до *нбайт* от *sock*. Асинхронная версия :meth:`socket.recv() <socket.socket.recv>`.

source: Return the received data as a bytes object.
ru: Верните полученные данные в виде байтового объекта.

source: *sock* must be a non-blocking socket.
ru: *sock* должен быть неблокирующим сокетом.

source: Even though this method was always documented as a coroutine method, releases before Python 3.7 returned a :class:`Future`. Since Python 3.7 this is an ``async def`` method.
ru: Несмотря на то, что этот метод всегда документировался как метод сопрограммы, версии до Python 3.7 возвращали :class:`Future`. Начиная с Python 3.7, это метод ``async def``.

source: Receive data from *sock* into the *buf* buffer. Modeled after the blocking :meth:`socket.recv_into() <socket.socket.recv_into>` method.
ru: Получите данные из *sock* в буфер *buf*. Создано по образцу блокирующего метода :meth:`socket.recv_into() <socket.socket.recv_into>`.

source: Return the number of bytes written to the buffer.
ru: Возвращает количество байтов, записанных в буфер.

source: Receive a datagram of up to *bufsize* from *sock*. Asynchronous version of :meth:`socket.recvfrom() <socket.socket.recvfrom>`.
ru: Получите датаграмму размером до *bufsize* от *sock*. Асинхронная версия :meth:`socket.recvfrom() <socket.socket.recvfrom>`.

source: Return a tuple of (received data, remote address).
ru: Вернуть кортеж (полученные данные, удаленный адрес).

source: Receive a datagram of up to *nbytes* from *sock* into *buf*. Asynchronous version of :meth:`socket.recvfrom_into() <socket.socket.recvfrom_into>`.
ru: Получите датаграмму размером до *nbytes* из *sock* в *buf*. Асинхронная версия :meth:`socket.recvfrom_into() <socket.socket.recvfrom_into>`.

source: Return a tuple of (number of bytes received, remote address).
ru: Вернуть кортеж (количество полученных байтов, удаленный адрес).

source: Send *data* to the *sock* socket. Asynchronous version of :meth:`socket.sendall() <socket.socket.sendall>`.
ru: Отправьте *данные* в сокет *sock*. Асинхронная версия :meth:`socket.sendall() <socket.socket.sendall>`.

source: This method continues to send to the socket until either all data in *data* has been sent or an error occurs. ``None`` is returned on success. On error, an exception is raised. Additionally, there is no way to determine how much data, if any, was successfully processed by the receiving end of the connection.
ru: Этот метод продолжает отправлять данные в сокет до тех пор, пока не будут отправлены все данные в *data* или не произойдет ошибка. ``None`` возвращается в случае успеха. В случае ошибки возникает исключение. Кроме того, невозможно определить, какой объем данных (если таковые имеются) был успешно обработан принимающей стороной соединения.

source: Even though the method was always documented as a coroutine method, before Python 3.7 it returned a :class:`Future`. Since Python 3.7, this is an ``async def`` method.
ru: Несмотря на то, что этот метод всегда документировался как метод сопрограммы, до Python 3.7 он возвращал :class:`Future`. Начиная с Python 3.7, это метод ``async def``.

source: Send a datagram from *sock* to *address*. Asynchronous version of :meth:`socket.sendto() <socket.socket.sendto>`.
ru: Отправьте датаграмму с *sock* на *address*. Асинхронная версия :meth:`socket.sendto() <socket.socket.sendto>`.

source: Return the number of bytes sent.
ru: Возвращает количество отправленных байтов.

source: Connect *sock* to a remote socket at *address*.
ru: Подключите *sock* к удаленному сокету по *адресу*.

source: Asynchronous version of :meth:`socket.connect() <socket.socket.connect>`.
ru: Асинхронная версия :meth:`socket.connect() <socket.socket.connect>`.

source: ``address`` no longer needs to be resolved. ``sock_connect`` will try to check if the *address* is already resolved by calling :func:`socket.inet_pton`. If not, :meth:`loop.getaddrinfo` will be used to resolve the *address*.
ru: ``адрес`` больше не требует разрешения. ``sock_connect`` попытается проверить, разрешен ли уже *адрес*, вызвав :func:`socket.inet_pton`. В противном случае для разрешения *адреса* будет использоваться :meth:`loop.getaddrinfo`.

source: :meth:`loop.create_connection` and :func:`asyncio.open_connection() <open_connection>`.
ru: :meth:`loop.create_connection` и :func:`asyncio.open_connection() <open_connection>`.

source: Accept a connection. Modeled after the blocking :meth:`socket.accept() <socket.socket.accept>` method.
ru: Примите соединение. Создано по образцу блокирующего метода :meth:`socket.accept() <socket.socket.accept>`.

source: The socket must be bound to an address and listening for connections. The return value is a pair ``(conn, address)`` where *conn* is a *new* socket object usable to send and receive data on the connection, and *address* is the address bound to the socket on the other end of the connection.
ru: Сокет должен быть привязан к адресу и прослушивать соединения. Возвращаемое значение представляет собой пару ``(conn, адрес)``, где *conn* — это *новый* объект сокета, используемый для отправки и получения данных по соединению, а *address* — это адрес, привязанный к сокету на другом конец соединения.

source: :meth:`loop.create_server` and :func:`start_server`.
ru: :meth:`loop.create_server` и :func:`start_server`.

source: Send a file using high-performance :mod:`os.sendfile` if possible. Return the total number of bytes sent.
ru: Если возможно, отправьте файл, используя высокопроизводительный :mod:`os.sendfile`. Возвращает общее количество отправленных байтов.

source: Asynchronous version of :meth:`socket.sendfile() <socket.socket.sendfile>`.
ru: Асинхронная версия :meth:`socket.sendfile() <socket.socket.sendfile>`.

source: *sock* must be a non-blocking :const:`socket.SOCK_STREAM` :class:`~socket.socket`.
ru: *sock* должен быть неблокирующим :const:`socket.SOCK_STREAM` :class:`~socket.socket`.

source: *file* must be a regular file object open in binary mode.
ru: *файл* должен быть обычным файловым объектом, открытым в двоичном режиме.

source: *fallback*, when set to ``True``, makes asyncio manually read and send the file when the platform does not support the sendfile syscall (e.g. Windows or SSL socket on Unix).
ru: *fallback*, если установлено значение ``True``, заставляет asyncio вручную читать и отправлять файл, когда платформа не поддерживает системный вызов sendfile (например, сокет Windows или SSL в Unix).

source: Raise :exc:`SendfileNotAvailableError` if the system does not support *sendfile* syscall and *fallback* is ``False``.
ru: Поднимите :exc:`SendfileNotAvailableError`, если система не поддерживает системный вызов *sendfile* и *fallback* имеет значение ``False``.

source: Asynchronous version of :meth:`socket.getaddrinfo`.
ru: Асинхронная версия :meth:`socket.getaddrinfo`.

source: Asynchronous version of :meth:`socket.getnameinfo`.
ru: Асинхронная версия :meth:`socket.getnameinfo`.

source: Both *getaddrinfo* and *getnameinfo* internally utilize their synchronous versions through the loop's default thread pool executor. When this executor is saturated, these methods may experience delays, which higher-level networking libraries may report as increased timeouts. To mitigate this, consider using a custom executor for other user tasks, or setting a default executor with a larger number of workers.
ru: И *getaddrinfo*, и *getnameinfo* внутренне используют свои синхронные версии через исполнителя пула потоков цикла по умолчанию. Когда этот исполнитель насыщен, эти методы могут испытывать задержки, о которых сетевые библиотеки более высокого уровня могут сообщать как увеличенные тайм-ауты. Чтобы избежать этого, рассмотрите возможность использования специального исполнителя для других пользовательских задач или установки исполнителя по умолчанию с большим количеством рабочих процессов.

source: Both *getaddrinfo* and *getnameinfo* methods were always documented to return a coroutine, but prior to Python 3.7 they were, in fact, returning :class:`asyncio.Future` objects. Starting with Python 3.7 both methods are coroutines.
ru: Оба метода *getaddrinfo* и *getnameinfo* всегда были документированы для возврата сопрограммы, но до Python 3.7 они фактически возвращали объекты :class:`asyncio.Future`. Начиная с Python 3.7, оба метода являются сопрограммами.

source: Working with pipes
ru: Работа с трубами

source: Register the read end of *pipe* in the event loop.
ru: Зарегистрируйте конец чтения *pipe* в цикле событий.

source: *pipe* is a :term:`file-like object <file object>`.
ru: *pipe* — это :term:`файлоподобный объект <файловый объект>`.

source: Return pair ``(transport, protocol)``, where *transport* supports the :class:`ReadTransport` interface and *protocol* is an object instantiated by the *protocol_factory*.
ru: Возвращаемая пара ``(транспорт, протокол)``, где *transport* поддерживает интерфейс :class:`ReadTransport`, а *protocol* — это объект, экземпляр которого создается *protocol_factory*.

source: With :class:`SelectorEventLoop` event loop, the *pipe* is set to non-blocking mode.
ru: В цикле событий :class:`SelectorEventLoop` *pipe* устанавливается в неблокирующий режим.

source: Register the write end of *pipe* in the event loop.
ru: Зарегистрируйте конец записи *pipe* в цикле событий.

source: *pipe* is :term:`file-like object <file object>`.
ru: *pipe* — это :term:`файлоподобный объект <файловый объект>`.

source: Return pair ``(transport, protocol)``, where *transport* supports :class:`WriteTransport` interface and *protocol* is an object instantiated by the *protocol_factory*.
ru: Возвращаемая пара ``(транспорт, протокол)``, где *transport* поддерживает интерфейс :class:`WriteTransport`, а *protocol* — это объект, экземпляр которого создается *protocol_factory*.

source: :class:`SelectorEventLoop` does not support the above methods on Windows. Use :class:`ProactorEventLoop` instead for Windows.
ru: :class:`SelectorEventLoop` не поддерживает вышеуказанные методы в Windows. Вместо этого используйте :class:`ProactorEventLoop` для Windows.

source: The :meth:`loop.subprocess_exec` and :meth:`loop.subprocess_shell` methods.
ru: Методы :meth:`loop.subprocess_exec` и :meth:`loop.subprocess_shell`.

source: Unix signals
ru: Сигналы Unix

source: Set *callback* as the handler for the *signum* signal.
ru: Установите *callback* в качестве обработчика сигнала *signum*.

source: The callback will be invoked by *loop*, along with other queued callbacks and runnable coroutines of that event loop. Unlike signal handlers registered using :func:`signal.signal`, a callback registered with this function is allowed to interact with the event loop.
ru: Обратный вызов будет вызван *loop* вместе с другими обратными вызовами в очереди и выполняемыми сопрограммами этого цикла событий. В отличие от обработчиков сигналов, зарегистрированных с помощью :func:`signal.signal`, обратному вызову, зарегистрированному с помощью этой функции, разрешено взаимодействовать с циклом событий.

source: Raise :exc:`ValueError` if the signal number is invalid or uncatchable. Raise :exc:`RuntimeError` if there is a problem setting up the handler.
ru: Поднимите :exc:`ValueError`, если номер сигнала недействителен или не может быть перехвачен. Поднимите :exc:`RuntimeError`, если возникла проблема с настройкой обработчика.

source: Like :func:`signal.signal`, this function must be invoked in the main thread.
ru: Как и :func:`signal.signal`, эта функция должна вызываться в основном потоке.

source: Remove the handler for the *sig* signal.
ru: Удалите обработчик сигнала *sig*.

source: Return ``True`` if the signal handler was removed, or ``False`` if no handler was set for the given signal.
ru: Верните True, если обработчик сигнала был удален, или False, если для данного сигнала не был установлен обработчик.

source: The :mod:`signal` module.
ru: Модуль :mod:`signal`

source: Executing code in thread or process pools
ru: Выполнение кода в пулах потоков или процессов

source: Arrange for *func* to be called in the specified executor.
ru: Организуйте вызов *func* в указанном исполнителе.

source: The *executor* argument should be an :class:`concurrent.futures.Executor` instance. The default executor is used if *executor* is ``None``. The default executor can be set by :meth:`loop.set_default_executor`, otherwise, a :class:`concurrent.futures.ThreadPoolExecutor` will be lazy-initialized and used by :func:`run_in_executor` if needed.
ru: Аргумент *executor* должен быть экземпляром :class:`concurrent.futures.Executor`. Исполнитель по умолчанию используется, если *executor* имеет значение «None». Исполнитель по умолчанию может быть установлен с помощью :meth:`loop.set_default_executor`, в противном случае :class:`concurrent.futures.ThreadPoolExecutor` будет лениво инициализирован и использован :func:`run_in_executor` при необходимости.

source: Note that the entry point guard (``if __name__ == '__main__'``) is required for option 3 due to the peculiarities of :mod:`multiprocessing`, which is used by :class:`~concurrent.futures.ProcessPoolExecutor`. See :ref:`Safe importing of main module <multiprocessing-safe-main-import>`.
ru: Обратите внимание, что защита точки входа (``if __name__ == '__main__'``) требуется для варианта 3 из-за особенностей :mod:`multiprocessing`, который используется :class:`~concurrent.futures.ProcessPoolExecutor `. См. :ref:`Безопасный импорт основного модуля <multiprocessing-safe-main-import>`.

source: This method returns a :class:`asyncio.Future` object.
ru: Этот метод возвращает объект :class:`asyncio.Future`.

source: Use :func:`functools.partial` :ref:`to pass keyword arguments <asyncio-pass-keywords>` to *func*.
ru: Используйте :func:`functools.partial` :ref:`для передачи аргументов ключевого слова <asyncio-pass-keywords>` в *func*.
