Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/asyncio-eventloop.po
Languages: ru

source: :meth:`loop.run_in_executor` no longer configures the ``max_workers`` of the thread pool executor it creates, instead leaving it up to the thread pool executor (:class:`~concurrent.futures.ThreadPoolExecutor`) to set the default.
ru: :meth:`loop.run_in_executor` больше не настраивает ``max_workers`` исполнителя пула потоков, который он создает, вместо этого оставляя это на усмотрение исполнителя пула потоков (:class:`~concurrent.futures.ThreadPoolExecutor`) для установки по умолчанию.

source: Set *executor* as the default executor used by :meth:`run_in_executor`. *executor* must be an instance of :class:`~concurrent.futures.ThreadPoolExecutor`.
ru: Установите *executor* в качестве исполнителя по умолчанию, используемого :meth:`run_in_executor`. *executor* должен быть экземпляром :class:`~concurrent.futures.ThreadPoolExecutor`.

source: *executor* must be an instance of :class:`~concurrent.futures.ThreadPoolExecutor`.
ru: *executor* должен быть экземпляром :class:`~concurrent.futures.ThreadPoolExecutor`.

source: Error Handling API
ru: API для обработки ошибок

source: Allows customizing how exceptions are handled in the event loop.
ru: Позволяет настраивать обработку исключений в цикле событий.

source: Set *handler* as the new event loop exception handler.
ru: Установите *handler* в качестве нового обработчика исключений цикла событий.

source: If *handler* is ``None``, the default exception handler will be set. Otherwise, *handler* must be a callable with the signature matching ``(loop, context)``, where ``loop`` is a reference to the active event loop, and ``context`` is a ``dict`` object containing the details of the exception (see :meth:`call_exception_handler` documentation for details about context).
ru: Если *handler* имеет значение «None», будет установлен обработчик исключений по умолчанию. В противном случае *handler* должен быть вызываемым объектом с сигнатурой, соответствующей ``(loop, context)``, где ``loop`` — это ссылка на активный цикл событий, а ``context`` — это ``dict`. `объект, содержащий подробную информацию об исключении (более подробную информацию о контексте см. в документации :meth:`call_Exception_handler`).

source: If the handler is called on behalf of a :class:`~asyncio.Task` or :class:`~asyncio.Handle`, it is run in the :class:`contextvars.Context` of that task or callback handle.
ru: Если обработчик вызывается от имени :class:`~asyncio.Task` или :class:`~asyncio.Handle`, он запускается в :class:`contextvars.Context` этой задачи или дескриптора обратного вызова.

source: The handler may be called in the :class:`~contextvars.Context` of the task or handle where the exception originated.
ru: Обработчик может быть вызван в :class:`~contextvars.Context` задачи или дескриптора, из которого возникло исключение.

source: Return the current exception handler, or ``None`` if no custom exception handler was set.
ru: Возвращает текущий обработчик исключений или None, если специальный обработчик исключений не был установлен.

source: Default exception handler.
ru: Обработчик исключений по умолчанию.

source: This is called when an exception occurs and no exception handler is set. This can be called by a custom exception handler that wants to defer to the default handler behavior.
ru: Он вызывается, когда возникает исключение и обработчик исключений не установлен. Это может быть вызвано пользовательским обработчиком исключений, который хочет перейти к поведению обработчика по умолчанию.

source: *context* parameter has the same meaning as in :meth:`call_exception_handler`.
ru: Параметр *context* имеет то же значение, что и в :meth:`call_Exception_handler`.

source: Call the current event loop exception handler.
ru: Вызовите текущий обработчик исключений цикла событий.

source: *context* is a ``dict`` object containing the following keys (new keys may be introduced in future Python versions):
ru: *context* — это объект ``dict``, содержащий следующие ключи (новые ключи могут быть добавлены в будущих версиях Python):

source: 'message': Error message;
ru: «сообщение»: сообщение об ошибке;

source: 'exception' (optional): Exception object;
ru: «исключение» (необязательно): объект исключения;

source: 'future' (optional): :class:`asyncio.Future` instance;
ru: 'future' (необязательно): экземпляр :class:`asyncio.Future`;

source: 'task' (optional): :class:`asyncio.Task` instance;
ru: 'task' (необязательно): экземпляр :class:`asyncio.Task`;

source: 'handle' (optional): :class:`asyncio.Handle` instance;
ru: 'handle' (необязательно): экземпляр :class:`asyncio.Handle`;

source: 'protocol' (optional): :ref:`Protocol <asyncio-protocol>` instance;
ru: 'protocol' (необязательно): :ref:`Protocol <asyncio-protocol>` экземпляр;

source: 'transport' (optional): :ref:`Transport <asyncio-transport>` instance;
ru: 'transport' (необязательно): :ref:`Transport <asyncio-transport>` экземпляр;

source: 'socket' (optional): :class:`socket.socket` instance;
ru: 'socket' (необязательно): экземпляр :class:`socket.socket`;

source: 'asyncgen' (optional): Asynchronous generator that caused
ru: 'asyncgen' (необязательно): асинхронный генератор, вызвавший

source: the exception.
ru: Исключение.

source: This method should not be overloaded in subclassed event loops. For custom exception handling, use the :meth:`set_exception_handler` method.
ru: Этот метод не следует перегружать в циклах событий подклассов. Для пользовательской обработки исключений используйте метод :meth:`set_Exception_handler`.

source: Enabling debug mode
ru: Включение режима отладки

source: Get the debug mode (:class:`bool`) of the event loop.
ru: Получите режим отладки (:class:`bool`) цикла событий.

source: The default value is ``True`` if the environment variable :envvar:`PYTHONASYNCIODEBUG` is set to a non-empty string, ``False`` otherwise.
ru: Значением по умолчанию является ``True``, если для переменной среды :envvar:`PYTHONASYNCIODEBUG` задана непустая строка, в противном случае ``False``.

source: Set the debug mode of the event loop.
ru: Установите режим отладки цикла событий.

source: The new :ref:`Python Development Mode <devmode>` can now also be used to enable the debug mode.
ru: Новый :ref:`Режим разработки Python <devmode>` теперь также можно использовать для включения режима отладки.

source: This attribute can be used to set the minimum execution duration in seconds that is considered "slow". When debug mode is enabled, "slow" callbacks are logged.
ru: Этот атрибут можно использовать для установки минимальной продолжительности выполнения в секундах, которая считается «медленной». Когда режим отладки включен, регистрируются «медленные» обратные вызовы.

source: Default value is 100 milliseconds.
ru: Значение по умолчанию — 100 миллисекунд.

source: The :ref:`debug mode of asyncio <asyncio-debug-mode>`.
ru: :ref:`Режим отладки asyncio <asyncio-debug-mode>`.

source: Running Subprocesses
ru: Исполняемые подпроцессы

source: Methods described in this subsections are low-level. In regular async/await code consider using the high-level :func:`asyncio.create_subprocess_shell` and :func:`asyncio.create_subprocess_exec` convenience functions instead.
ru: Методы, описанные в этом подразделе, являются низкоуровневыми. В обычном коде async/await вместо этого рассмотрите возможность использования вспомогательных функций высокого уровня :func:`asyncio.create_subprocess_shell` и :func:`asyncio.create_subprocess_exec`.

source: On Windows, the default event loop :class:`ProactorEventLoop` supports subprocesses, whereas :class:`SelectorEventLoop` does not. See :ref:`Subprocess Support on Windows <asyncio-windows-subprocess>` for details.
ru: В Windows цикл событий по умолчанию :class:`ProactorEventLoop` поддерживает подпроцессы, а :class:`SelectorEventLoop` — нет. Подробности см. в разделе «Поддержка подпроцессов в Windows <asyncio-windows-subprocess>».

source: Create a subprocess from one or more string arguments specified by *args*.
ru: Создайте подпроцесс из одного или нескольких строковых аргументов, указанных в *args*.

source: *args* must be a list of strings represented by:
ru: *args* должен быть списком строк, представленных:

source: or :class:`bytes`, encoded to the :ref:`filesystem encoding <filesystem-encoding>`.
ru: или :class:`bytes`, закодированный в :ref:`кодировке файловой системы <filesystem-encoding>`.

source: The first string specifies the program executable, and the remaining strings specify the arguments. Together, string arguments form the ``argv`` of the program.
ru: Первая строка указывает исполняемый файл программы, а остальные строки указывают аргументы. Вместе строковые аргументы образуют argv программы.

source: This is similar to the standard library :class:`subprocess.Popen` class called with ``shell=False`` and the list of strings passed as the first argument; however, where :class:`~subprocess.Popen` takes a single argument which is list of strings, *subprocess_exec* takes multiple string arguments.
ru: Это похоже на класс стандартной библиотеки :class:`subprocess.Popen`, вызываемый с ``shell=False`` и списком строк, передаваемых в качестве первого аргумента; однако, где :class:`~subprocess.Popen` принимает один аргумент, который представляет собой список строк, *subprocess_exec* принимает несколько строковых аргументов.

source: The *protocol_factory* must be a callable returning a subclass of the :class:`asyncio.SubprocessProtocol` class.
ru: *protocol_factory* должен быть вызываемым объектом, возвращающим подкласс класса :class:`asyncio.SubprocessProtocol`.

source: Other parameters:
ru: Другие параметры:

source: *stdin* can be any of these:
ru: *stdin* может быть любым из следующих:

source: a file-like object
ru: файлоподобный объект

source: an existing file descriptor (a positive integer), for example those created with :meth:`os.pipe`
ru: существующий файловый дескриптор (положительное целое число), например созданный с помощью :meth:`os.pipe`

source: the :const:`subprocess.PIPE` constant (default) which will create a new pipe and connect it,
ru: константа :const:`subprocess.PIPE` (по умолчанию), которая создаст новый канал и подключит его,

source: the value ``None`` which will make the subprocess inherit the file descriptor from this process
ru: значение ``None``, которое заставит подпроцесс наследовать файловый дескриптор от этого процесса

source: the :const:`subprocess.DEVNULL` constant which indicates that the special :data:`os.devnull` file will be used
ru: константа :const:`subprocess.DEVNULL`, которая указывает, что будет использоваться специальный файл :data:`os.devnull`

source: *stdout* can be any of these:
ru: *stdout* может быть любым из следующих:

source: *stderr* can be any of these:
ru: *stderr* может быть любым из следующих:

source: the :const:`subprocess.STDOUT` constant which will connect the standard error stream to the process' standard output stream
ru: константа :const:`subprocess.STDOUT`, которая соединит стандартный поток ошибок со стандартным потоком вывода процесса.

source: All other keyword arguments are passed to :class:`subprocess.Popen` without interpretation, except for *bufsize*, *universal_newlines*, *shell*, *text*, *encoding* and *errors*, which should not be specified at all.
ru: Все остальные аргументы ключевого слова передаются в :class:`subprocess.Popen` без интерпретации, за исключением *bufsize*, *universal_newlines*, *shell*, *text*, *encoding* и *errors*, которые не следует указывать в все.

source: The ``asyncio`` subprocess API does not support decoding the streams as text. :func:`bytes.decode` can be used to convert the bytes returned from the stream to text.
ru: API подпроцесса asyncio не поддерживает декодирование потоков в текст. :func:`bytes.decode` можно использовать для преобразования байтов, возвращаемых из потока, в текст.

source: If a file-like object passed as *stdin*, *stdout* or *stderr* represents a pipe, then the other side of this pipe should be registered with :meth:`~loop.connect_write_pipe` or :meth:`~loop.connect_read_pipe` for use with the event loop.
ru: Если файлоподобный объект, передаваемый как *stdin*, *stdout* или *stderr*, представляет канал, то другая сторона этого канала должна быть зарегистрирована с помощью :meth:`~loop.connect_write_pipe` или :meth:`~loop. .connect_read_pipe` для использования с циклом событий.

source: See the constructor of the :class:`subprocess.Popen` class for documentation on other arguments.
ru: См. конструктор класса :class:`subprocess.Popen` для получения документации по другим аргументам.

source: Returns a pair of ``(transport, protocol)``, where *transport* conforms to the :class:`asyncio.SubprocessTransport` base class and *protocol* is an object instantiated by the *protocol_factory*.
ru: Возвращает пару ``(транспорт, протокол)``, где *transport* соответствует базовому классу :class:`asyncio.SubprocessTransport`, а *protocol* — это объект, экземпляр которого создается *protocol_factory*.

source: Create a subprocess from *cmd*, which can be a :class:`str` or a :class:`bytes` string encoded to the :ref:`filesystem encoding <filesystem-encoding>`, using the platform's "shell" syntax.
ru: Создайте подпроцесс из *cmd*, который может представлять собой строку :class:`str` или :class:`bytes`, закодированную в :ref:`кодировку файловой системы <filesystem-encoding>`, используя синтаксис оболочки платформы. .

source: This is similar to the standard library :class:`subprocess.Popen` class called with ``shell=True``.
ru: Это похоже на класс стандартной библиотеки :class:`subprocess.Popen`, вызываемый с ``shell=True``.

source: The *protocol_factory* must be a callable returning a subclass of the :class:`SubprocessProtocol` class.
ru: *protocol_factory* должен быть вызываемым объектом, возвращающим подкласс класса :class:`SubprocessProtocol`.

source: See :meth:`~loop.subprocess_exec` for more details about the remaining arguments.
ru: См. :meth:`~loop.subprocess_exec` для получения более подробной информации об остальных аргументах.

source: Returns a pair of ``(transport, protocol)``, where *transport* conforms to the :class:`SubprocessTransport` base class and *protocol* is an object instantiated by the *protocol_factory*.
ru: Возвращает пару ``(транспорт, протокол)``, где *transport* соответствует базовому классу :class:`SubprocessTransport`, а *protocol* — это объект, экземпляр которого создается *protocol_factory*.

source: It is the application's responsibility to ensure that all whitespace and special characters are quoted appropriately to avoid `shell injection <https://en.wikipedia.org/wiki/Shell_injection#Shell_injection>`_ vulnerabilities. The :func:`shlex.quote` function can be used to properly escape whitespace and special characters in strings that are going to be used to construct shell commands.
ru: Приложение несет ответственность за то, чтобы все пробелы и специальные символы были заключены в кавычки соответствующим образом, чтобы избежать `_ уязвимостей внедрения оболочки <https://en.wikipedia.org/wiki/Shell_injection#Shell_injection>`_. Функцию :func:`shlex.quote` можно использовать для правильного экранирования пробелов и специальных символов в строках, которые будут использоваться для создания команд оболочки.

source: Callback Handles
ru: Дескрипторы обратного вызова

source: A callback wrapper object returned by :meth:`loop.call_soon`, :meth:`loop.call_soon_threadsafe`.
ru: Объект-оболочка обратного вызова, возвращаемый :meth:`loop.call_soon`, :meth:`loop.call_soon_threadsafe`.

source: Return the :class:`contextvars.Context` object associated with the handle.
ru: Верните объект :class:`contextvars.Context`, связанный с дескриптором.

source: Cancel the callback. If the callback has already been canceled or executed, this method has no effect.
ru: Отмените обратный звонок. Если обратный вызов уже был отменен или выполнен, этот метод не имеет никакого эффекта.

source: Return ``True`` if the callback was cancelled.
ru: Верните True, если обратный вызов был отменен.

source: A callback wrapper object returned by :meth:`loop.call_later`, and :meth:`loop.call_at`.
ru: Объект-оболочка обратного вызова, возвращаемый :meth:`loop.call_later` и :meth:`loop.call_at`.

source: This class is a subclass of :class:`Handle`.
ru: Этот класс является подклассом :class:`Handle`.

source: Return a scheduled callback time as :class:`float` seconds.
ru: Возвращает запланированное время обратного вызова в виде :class:`float` секунд.

source: The time is an absolute timestamp, using the same time reference as :meth:`loop.time`.
ru: Время представляет собой абсолютную временную метку, использующую ту же ссылку времени, что и :meth:`loop.time`.

source: Server Objects
ru: Объекты сервера

source: Server objects are created by :meth:`loop.create_server`, :meth:`loop.create_unix_server`, :func:`start_server`, and :func:`start_unix_server` functions.
ru: Объекты сервера создаются функциями :meth:`loop.create_server`, :meth:`loop.create_unix_server`, :func:`start_server` и :func:`start_unix_server`.

source: Do not instantiate the :class:`Server` class directly.
ru: Не создавайте экземпляр класса :class:`Server` напрямую.

source: *Server* objects are asynchronous context managers. When used in an ``async with`` statement, it's guaranteed that the Server object is closed and not accepting new connections when the ``async with`` statement is completed::
ru: Объекты *Server* представляют собой асинхронные менеджеры контекста. При использовании в операторе ``async with`` гарантируется, что объект Сервер закроется и не будет принимать новые соединения после завершения оператора ``async with``:

source: Server object is an asynchronous context manager since Python 3.7.
ru: Объект сервера является асинхронным контекстным менеджером, начиная с Python 3.7.

source: This class was exposed publicly as ``asyncio.Server`` in Python 3.9.11, 3.10.3 and 3.11.
ru: Этот класс был публично представлен как asyncio.Server в Python 3.9.11, 3.10.3 и 3.11.

source: Stop serving: close listening sockets and set the :attr:`sockets` attribute to ``None``.
ru: Прекратите обслуживание: закройте сокеты прослушивания и установите для атрибута :attr:`sockets` значение ``None``.

source: The sockets that represent existing incoming client connections are left open.
ru: Сокеты, представляющие существующие входящие клиентские соединения, остаются открытыми.

source: The server is closed asynchronously; use the :meth:`wait_closed` coroutine to wait until the server is closed (and no more connections are active).
ru: Сервер закрывается асинхронно; используйте сопрограмму :meth:`wait_closed`, чтобы дождаться закрытия сервера (и отсутствия активных соединений).

source: Close all existing incoming client connections.
ru: Закройте все существующие входящие клиентские соединения.

source: Calls :meth:`~asyncio.BaseTransport.close` on all associated transports.
ru: Вызывает :meth:`~asyncio.BaseTransport.close` для всех связанных транспортов.

source: :meth:`close` should be called before :meth:`close_clients` when closing the server to avoid races with new clients connecting.
ru: :meth:`close` следует вызывать перед :meth:`close_clients` при закрытии сервера, чтобы избежать гонок при подключении новых клиентов.

source: Close all existing incoming client connections immediately, without waiting for pending operations to complete.
ru: Немедленно закройте все существующие входящие клиентские подключения, не дожидаясь завершения ожидающих операций.

source: Calls :meth:`~asyncio.WriteTransport.abort` on all associated transports.
ru: Вызывает :meth:`~asyncio.WriteTransport.abort` для всех связанных транспортов.

source: :meth:`close` should be called before :meth:`abort_clients` when closing the server to avoid races with new clients connecting.
ru: :meth:`close` следует вызывать перед :meth:`abort_clients` при закрытии сервера, чтобы избежать гонок при подключении новых клиентов.

source: Return the event loop associated with the server object.
ru: Верните цикл событий, связанный с объектом сервера.

source: Start accepting connections.
ru: Начните принимать соединения.

source: This method is idempotent, so it can be called when the server is already serving.
ru: Этот метод идемпотентен, поэтому его можно вызвать, когда сервер уже обслуживает.

source: The *start_serving* keyword-only parameter to :meth:`loop.create_server` and :meth:`asyncio.start_server` allows creating a Server object that is not accepting connections initially. In this case ``Server.start_serving()``, or :meth:`Server.serve_forever` can be used to make the Server start accepting connections.
ru: Параметр *start_serving*, содержащий только ключевые слова, для :meth:`loop.create_server` и :meth:`asyncio.start_server` позволяет создать объект Сервера, который изначально не принимает соединения. В этом случае можно использовать ``Server.start_serving()`` или :meth:`Server.serve_forever`, чтобы заставить Сервер начать принимать соединения.

source: Start accepting connections until the coroutine is cancelled. Cancellation of ``serve_forever`` task causes the server to be closed.
ru: Начните принимать соединения, пока сопрограмма не будет отменена. Отмена задачи «serve_forever» приводит к закрытию сервера.

source: This method can be called if the server is already accepting connections. Only one ``serve_forever`` task can exist per one *Server* object.
ru: Этот метод можно вызвать, если сервер уже принимает соединения. Для одного объекта *Server* может существовать только одна задача ``serve_forever``.

source: Return ``True`` if the server is accepting new connections.
ru: Верните True, если сервер принимает новые соединения.

source: Wait until the :meth:`close` method completes and all active connections have finished.
ru: Подождите, пока метод :meth:`close` завершится и все активные соединения не завершится.

source: List of socket-like objects, ``asyncio.trsock.TransportSocket``, which the server is listening on.
ru: Список объектов, подобных сокетам, asyncio.trsock.TransportSocket, которые прослушивает сервер.

source: Prior to Python 3.7 ``Server.sockets`` used to return an internal list of server sockets directly. In 3.7 a copy of that list is returned.
ru: До Python 3.7 ``Server.sockets`` использовался для прямого возврата внутреннего списка сокетов сервера. В версии 3.7 возвращается копия этого списка.

source: Event Loop Implementations
ru: Реализации цикла событий

source: asyncio ships with two different event loop implementations: :class:`SelectorEventLoop` and :class:`ProactorEventLoop`.
ru: asyncio поставляется с двумя различными реализациями цикла событий: :class:`SelectorEventLoop` и :class:`ProactorEventLoop`.

source: By default asyncio is configured to use :class:`EventLoop`.
ru: По умолчанию asyncio настроен на использование :class:`EventLoop`.

source: A subclass of :class:`AbstractEventLoop` based on the :mod:`selectors` module.
ru: Подкласс :class:`AbstractEventLoop`, основанный на модуле :mod:`selectors`.

source: Uses the most efficient *selector* available for the given platform. It is also possible to manually configure the exact selector implementation to be used::
ru: Использует наиболее эффективный *селектор*, доступный для данной платформы. Также можно вручную настроить конкретную реализацию селектора, которая будет использоваться:

source: A subclass of :class:`AbstractEventLoop` for Windows that uses "I/O Completion Ports" (IOCP).
ru: Подкласс :class:`AbstractEventLoop` для Windows, который использует «Порты завершения ввода-вывода» (IOCP).

source: `MSDN documentation on I/O Completion Ports <https://learn.microsoft.com/windows/win32/fileio/i-o-completion-ports>`_.
ru: `Документация MSDN по портам завершения ввода-вывода <https://learn.microsoft.com/windows/win32/fileio/io-completion-ports>`_.
