Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/asyncio-protocol.po
Languages: ru

source: Transports and Protocols
ru: Транспортировка и протоколы

source: Preface
ru: Введение

source: Transports and Protocols are used by the **low-level** event loop APIs such as :meth:`loop.create_connection`. They use callback-based programming style and enable high-performance implementations of network or IPC protocols (e.g. HTTP).
ru: Транспорты и протоколы используются API-интерфейсами **низкоуровневого** цикла событий, такими как :meth:`loop.create_connection`. Они используют стиль программирования на основе обратного вызова и обеспечивают высокопроизводительную реализацию сетевых протоколов или протоколов IPC (например, HTTP).

source: Essentially, transports and protocols should only be used in libraries and frameworks and never in high-level asyncio applications.
ru: По сути, транспорты и протоколы следует использовать только в библиотеках и платформах, а не в асинхронных приложениях высокого уровня.

source: This documentation page covers both `Transports`_ and `Protocols`_.
ru: На этой странице документации описаны как «Транспорты», так и «Протоколы».

source: Introduction
ru: Введение

source: At the highest level, the transport is concerned with *how* bytes are transmitted, while the protocol determines *which* bytes to transmit (and to some extent when).
ru: На самом высоком уровне транспорт занимается тем, *как* передаются байты, в то время как протокол определяет *какие* байты передавать (и, в некоторой степени, когда).

source: A different way of saying the same thing: a transport is an abstraction for a socket (or similar I/O endpoint) while a protocol is an abstraction for an application, from the transport's point of view.
ru: Другой способ сказать то же самое: транспорт — это абстракция для сокета (или аналогичной конечной точки ввода-вывода), тогда как протокол — это абстракция для приложения с точки зрения транспорта.

source: Yet another view is the transport and protocol interfaces together define an abstract interface for using network I/O and interprocess I/O.
ru: Еще одна точка зрения заключается в том, что транспортный и протокольный интерфейсы вместе определяют абстрактный интерфейс для использования сетевого ввода-вывода и межпроцессного ввода-вывода.

source: There is always a 1:1 relationship between transport and protocol objects: the protocol calls transport methods to send data, while the transport calls protocol methods to pass it data that has been received.
ru: Между объектами транспорта и протокола всегда существует соотношение 1:1: протокол вызывает методы транспорта для отправки данных, а транспорт вызывает методы протокола для передачи полученных данных.

source: Most of connection oriented event loop methods (such as :meth:`loop.create_connection`) usually accept a *protocol_factory* argument used to create a *Protocol* object for an accepted connection, represented by a *Transport* object. Such methods usually return a tuple of ``(transport, protocol)``.
ru: Большинство методов цикла событий, ориентированных на соединение (таких как :meth:`loop.create_connection`), обычно принимают аргумент *protocol_factory*, используемый для создания объекта *Protocol* для принятого соединения, представленного объектом *Transport*. Такие методы обычно возвращают кортеж ``(транспорт, протокол)``.

source: Contents
ru: Содержание

source: This documentation page contains the following sections:
ru: Эта страница документации содержит следующие разделы:

source: The `Transports`_ section documents asyncio :class:`BaseTransport`, :class:`ReadTransport`, :class:`WriteTransport`, :class:`Transport`, :class:`DatagramTransport`, and :class:`SubprocessTransport` classes.
ru: В разделе `Transports`_ документируются классы asyncio :class:`BaseTransport`, :class:`ReadTransport`, :class:`WriteTransport`, :class:`Transport`, :class:`DatagramTransport`, и :class:`SubprocessTransport`.

source: The `Protocols`_ section documents asyncio :class:`BaseProtocol`, :class:`Protocol`, :class:`BufferedProtocol`, :class:`DatagramProtocol`, and :class:`SubprocessProtocol` classes.
ru: В разделе `Protocols`_ документируются классы asyncio :class:`BaseProtocol`, :class:`Protocol`, :class:`BufferedProtocol`, :class:`DatagramProtocol`, и :class:`SubprocessProtocol`.

source: The `Examples`_ section showcases how to work with transports, protocols, and low-level event loop APIs.
ru: В разделе `Examples`_ показано, как работать с транспортом, протоколами и низкоуровневыми API цикла обработки событий.

source: Transports
ru: Транспорт

source: **Source code:** :source:`Lib/asyncio/transports.py`
ru: **Исходный код:** :source:`Lib/asyncio/transports.py`

source: Transports are classes provided by :mod:`asyncio` in order to abstract various kinds of communication channels.
ru: Транспорты — это классы, предоставляемые :mod:`asyncio` для абстрагирования различных видов каналов связи.

source: Transport objects are always instantiated by an :ref:`asyncio event loop <asyncio-event-loop>`.
ru: Транспортные объекты всегда создаются с помощью цикла событий asyncio <asyncio-event-loop>`.

source: asyncio implements transports for TCP, UDP, SSL, and subprocess pipes. The methods available on a transport depend on the transport's kind.
ru: asyncio реализует транспорт для TCP, UDP, SSL и каналов подпроцессов. Методы, доступные на транспорте, зависят от типа транспорта.

source: The transport classes are :ref:`not thread safe <asyncio-multithreading>`.
ru: Транспортные классы :ref:`не потокобезопасны <asyncio-multhreading>`.

source: Transports Hierarchy
ru: Иерархия транспорта

source: Base class for all transports. Contains methods that all asyncio transports share.
ru: Базовый класс для всех видов транспорта. Содержит методы, которые используются всеми транспортами asyncio.

source: A base transport for write-only connections.
ru: Базовый транспорт для соединений только для записи.

source: Instances of the *WriteTransport* class are returned from the :meth:`loop.connect_write_pipe` event loop method and are also used by subprocess-related methods like :meth:`loop.subprocess_exec`.
ru: Экземпляры класса *WriteTransport* возвращаются из метода цикла событий :meth:`loop.connect_write_pipe`, а также используются методами, связанными с подпроцессами, такими как :meth:`loop.subprocess_exec`.

source: A base transport for read-only connections.
ru: Базовый транспорт для соединений только для чтения.

source: Instances of the *ReadTransport* class are returned from the :meth:`loop.connect_read_pipe` event loop method and are also used by subprocess-related methods like :meth:`loop.subprocess_exec`.
ru: Экземпляры класса *ReadTransport* возвращаются из метода цикла событий :meth:`loop.connect_read_pipe`, а также используются методами, связанными с подпроцессами, такими как :meth:`loop.subprocess_exec`.

source: Interface representing a bidirectional transport, such as a TCP connection.
ru: Интерфейс, представляющий двунаправленный транспорт, например TCP-соединение.

source: The user does not instantiate a transport directly; they call a utility function, passing it a protocol factory and other information necessary to create the transport and protocol.
ru: Пользователь не создает экземпляр транспорта напрямую; они вызывают вспомогательную функцию, передавая ей фабрику протоколов и другую информацию, необходимую для создания транспорта и протокола.

source: Instances of the *Transport* class are returned from or used by event loop methods like :meth:`loop.create_connection`, :meth:`loop.create_unix_connection`, :meth:`loop.create_server`, :meth:`loop.sendfile`, etc.
ru: Экземпляры класса *Transport* возвращаются или используются методами цикла событий, такими как :meth:`loop.create_connection`, :meth:`loop.create_unix_connection`, :meth:`loop.create_server`, :meth:`loop. sendfile` и т. д.

source: A transport for datagram (UDP) connections.
ru: Транспорт для дейтаграммных (UDP) соединений.

source: Instances of the *DatagramTransport* class are returned from the :meth:`loop.create_datagram_endpoint` event loop method.
ru: Экземпляры класса *DatagramTransport* возвращаются из метода цикла событий :meth:`loop.create_datagram_endpoint`.

source: An abstraction to represent a connection between a parent and its child OS process.
ru: Абстракция, представляющая связь между родительским и дочерним процессами ОС.

source: Instances of the *SubprocessTransport* class are returned from event loop methods :meth:`loop.subprocess_shell` and :meth:`loop.subprocess_exec`.
ru: Экземпляры класса *SubprocessTransport* возвращаются из методов цикла событий :meth:`loop.subprocess_shell` и :meth:`loop.subprocess_exec`.

source: Base Transport
ru: Базовый транспорт

source: Close the transport.
ru: Закройте транспорт.

source: If the transport has a buffer for outgoing data, buffered data will be flushed asynchronously. No more data will be received. After all buffered data is flushed, the protocol's :meth:`protocol.connection_lost() <BaseProtocol.connection_lost>` method will be called with :const:`None` as its argument. The transport should not be used once it is closed.
ru: Если транспорт имеет буфер для исходящих данных, буферизованные данные будут сброшены асинхронно. Больше никаких данных получено не будет. После того, как все буферизованные данные будут очищены, будет вызван метод протокола :meth:`protocol.connection_lost() <BaseProtocol.connection_lost>` с :const:`None` в качестве аргумента. Транспорт не следует использовать, если он закрыт.

source: Return ``True`` if the transport is closing or is closed.
ru: Верните True, если транспорт закрывается или закрыт.

source: Return information about the transport or underlying resources it uses.
ru: Возвращает информацию о транспорте или базовых ресурсах, которые он использует.

source: *name* is a string representing the piece of transport-specific information to get.
ru: *имя* — это строка, представляющая часть информации, относящейся к транспорту, которую необходимо получить.

source: *default* is the value to return if the information is not available, or if the transport does not support querying it with the given third-party event loop implementation or on the current platform.
ru: *default* — это значение, возвращаемое, если информация недоступна или если транспорт не поддерживает ее запрос с помощью данной сторонней реализации цикла событий или на текущей платформе.

source: For example, the following code attempts to get the underlying socket object of the transport::
ru: Например, следующий код пытается получить базовый объект сокета транспорта:

source: Categories of information that can be queried on some transports:
ru: Категории информации, которую можно запросить на некоторых транспортах:

source: socket:
ru: сокет:

source: ``'peername'``: the remote address to which the socket is connected, result of :meth:`socket.socket.getpeername` (``None`` on error)
ru: ``'peername'``: удаленный адрес, к которому подключен сокет, результат :meth:`socket.socket.getpeername` (``None`` в случае ошибки)

source: ``'socket'``: :class:`socket.socket` instance
ru: ``'socket'``: экземпляр :class:`socket.socket`

source: ``'sockname'``: the socket's own address, result of :meth:`socket.socket.getsockname`
ru: ``'sockname'``: собственный адрес сокета, результат :meth:`socket.socket.getsockname`

source: SSL socket:
ru: SSL сокет:

source: ``'compression'``: the compression algorithm being used as a string, or ``None`` if the connection isn't compressed; result of :meth:`ssl.SSLSocket.compression`
ru: ``'сжатие'``: алгоритм сжатия, используемый как строка, или ``Нет``, если соединение не сжимается; результат :meth:`ssl.SSLSocket.compression`

source: ``'cipher'``: a three-value tuple containing the name of the cipher being used, the version of the SSL protocol that defines its use, and the number of secret bits being used; result of :meth:`ssl.SSLSocket.cipher`
ru: ``'cipher'``: кортеж из трех значений, содержащий имя используемого шифра, версию протокола SSL, определяющую его использование, и количество используемых секретных битов; результат :meth:`ssl.SSLSocket.cipher`

source: ``'peercert'``: peer certificate; result of :meth:`ssl.SSLSocket.getpeercert`
ru: ``'peercert'``: одноранговый сертификат; результат :meth:`ssl.SSLSocket.getpeercert`

source: ``'sslcontext'``: :class:`ssl.SSLContext` instance
ru: ``'sslcontext'``: экземпляр :class:`ssl.SSLContext`

source: ``'ssl_object'``: :class:`ssl.SSLObject` or :class:`ssl.SSLSocket` instance
ru: ``'ssl_object'``: :class:`ssl.SSLObject` или экземпляр :class:`ssl.SSLSocket`

source: pipe:
ru: канал:

source: ``'pipe'``: pipe object
ru: ``'pipe'``: объект канала

source: subprocess:
ru: подпроцесс

source: ``'subprocess'``: :class:`subprocess.Popen` instance
ru: ``'subprocess'``: экземпляр :class:`subprocess.Popen`

source: Set a new protocol.
ru: Установите новый протокол.

source: Switching protocol should only be done when both protocols are documented to support the switch.
ru: Переключение протокола следует выполнять только в том случае, если оба протокола документированы для поддержки переключения.

source: Return the current protocol.
ru: Вернуть текущий протокол.

source: Read-only Transports
ru: Транспорты, доступные только для чтения

source: Return ``True`` if the transport is receiving new data.
ru: Верните True, если транспорт получает новые данные.

source: Pause the receiving end of the transport. No data will be passed to the protocol's :meth:`protocol.data_received() <Protocol.data_received>` method until :meth:`resume_reading` is called.
ru: Приостановите принимающую сторону транспорта. Никакие данные не будут передаваться в метод протокола :meth:`protocol.data_received() <Protocol.data_received>` до тех пор, пока не будет вызван :meth:`resume_reading`.

source: The method is idempotent, i.e. it can be called when the transport is already paused or closed.
ru: Метод идемпотентен, т.е. его можно вызвать, когда транспорт уже приостановлен или закрыт.

source: Resume the receiving end. The protocol's :meth:`protocol.data_received() <Protocol.data_received>` method will be called once again if some data is available for reading.
ru: Возобновите приемную сторону. Метод протокола :meth:`protocol.data_received() <Protocol.data_received>` будет вызываться еще раз, если некоторые данные доступны для чтения.

source: The method is idempotent, i.e. it can be called when the transport is already reading.
ru: Метод идемпотентный, т.е. его можно вызвать, когда транспорт уже читает.

source: Write-only Transports
ru: Транспорты только для записи

source: Close the transport immediately, without waiting for pending operations to complete. Buffered data will be lost. No more data will be received. The protocol's :meth:`protocol.connection_lost() <BaseProtocol.connection_lost>` method will eventually be called with :const:`None` as its argument.
ru: Закройте транспорт немедленно, не дожидаясь завершения ожидающих операций. Буферизованные данные будут потеряны. Больше никаких данных получено не будет. Метод протокола :meth:`protocol.connection_lost() <BaseProtocol.connection_lost>` в конечном итоге будет вызван с :const:`None` в качестве аргумента.

source: Return :const:`True` if the transport supports :meth:`~WriteTransport.write_eof`, :const:`False` if not.
ru: Верните :const:`True`, если транспорт поддерживает :meth:`~WriteTransport.write_eof`, :const:`False` если нет.

source: Return the current size of the output buffer used by the transport.
ru: Возвращает текущий размер выходного буфера, используемого транспортом.

source: Get the *high* and *low* watermarks for write flow control. Return a tuple ``(low, high)`` where *low* and *high* are positive number of bytes.
ru: Получите водяные знаки *high* и *low* для управления потоком записи. Возвращает кортеж ``(low, high)``, где *low* и *high* — положительное количество байтов.

source: Use :meth:`set_write_buffer_limits` to set the limits.
ru: Используйте :meth:`set_write_buffer_limits`, чтобы установить ограничения.

source: Set the *high* and *low* watermarks for write flow control.
ru: Установите водяные знаки *high* и *low* для управления потоком записи.

source: These two values (measured in number of bytes) control when the protocol's :meth:`protocol.pause_writing() <BaseProtocol.pause_writing>` and :meth:`protocol.resume_writing() <BaseProtocol.resume_writing>` methods are called. If specified, the low watermark must be less than or equal to the high watermark. Neither *high* nor *low* can be negative.
ru: Эти два значения (измеренные в количестве байтов) управляют моментом вызова методов протокола :meth:`protocol.pause_writing() <BaseProtocol.pause_writing>` и :meth:`protocol.resume_writing() <BaseProtocol.resume_writing>`. Если указано, нижний водяной знак должен быть меньше или равен верхнему водяному знаку. Ни *высокое*, ни *низкое* не могут быть отрицательными.

source: :meth:`~BaseProtocol.pause_writing` is called when the buffer size becomes greater than or equal to the *high* value. If writing has been paused, :meth:`~BaseProtocol.resume_writing` is called when the buffer size becomes less than or equal to the *low* value.
ru: :meth:`~BaseProtocol.pause_writing` вызывается, когда размер буфера становится больше или равен значению *high*. Если запись была приостановлена, :meth:`~BaseProtocol.resume_writing` вызывается, когда размер буфера становится меньше или равен значению *low*.

source: The defaults are implementation-specific. If only the high watermark is given, the low watermark defaults to an implementation-specific value less than or equal to the high watermark. Setting *high* to zero forces *low* to zero as well, and causes :meth:`~BaseProtocol.pause_writing` to be called whenever the buffer becomes non-empty. Setting *low* to zero causes :meth:`~BaseProtocol.resume_writing` to be called only once the buffer is empty. Use of zero for either limit is generally sub-optimal as it reduces opportunities for doing I/O and computation concurrently.
ru: Значения по умолчанию зависят от реализации. Если указан только верхний водяной знак, нижний водяной знак по умолчанию принимает значение, зависящее от реализации, меньшее или равное верхнему водяному знаку. Установка *high* в ноль приводит к тому, что *low* также становится равным нулю и вызывает вызов :meth:`~BaseProtocol.pause_writing` всякий раз, когда буфер становится непустым. Установка *low* в ноль приводит к тому, что :meth:`~BaseProtocol.resume_writing` будет вызываться только тогда, когда буфер пуст. Использование нуля для любого ограничения обычно неоптимально, поскольку уменьшает возможности одновременного выполнения ввода-вывода и вычислений.

source: Use :meth:`~WriteTransport.get_write_buffer_limits` to get the limits.
ru: Используйте :meth:`~WriteTransport.get_write_buffer_limits`, чтобы получить ограничения.

source: Write some *data* bytes to the transport.
ru: Запишите несколько байтов *данных* в транспорт.

source: This method does not block; it buffers the data and arranges for it to be sent out asynchronously.
ru: Этот метод не блокирует; он буферизует данные и организует их асинхронную отправку.

source: Write a list (or any iterable) of data bytes to the transport. This is functionally equivalent to calling :meth:`write` on each element yielded by the iterable, but may be implemented more efficiently.
ru: Запишите список (или любой итерируемый) байтов данных в транспорт. Это функционально эквивалентно вызову :meth:`write` для каждого элемента, полученного в результате итерации, но может быть реализовано более эффективно.

source: Close the write end of the transport after flushing all buffered data. Data may still be received.
ru: Закройте конец записи транспорта после очистки всех буферизованных данных. Данные все еще могут быть получены.

source: This method can raise :exc:`NotImplementedError` if the transport (e.g. SSL) doesn't support half-closed connections.
ru: Этот метод может вызвать ошибку :exc:`NotImplementedError`, если транспорт (например, SSL) не поддерживает полузакрытые соединения.

source: Datagram Transports
ru: Транспортировка датаграмм

source: Send the *data* bytes to the remote peer given by *addr* (a transport-dependent target address). If *addr* is :const:`None`, the data is sent to the target address given on transport creation.
ru: Отправьте байты *данных* удаленному узлу, заданному *addr* (целевой адрес, зависящий от транспорта). Если *addr* имеет значение :const:`None`, данные отправляются на целевой адрес, указанный при создании транспорта.

source: This method can be called with an empty bytes object to send a zero-length datagram. The buffer size calculation used for flow control is also updated to account for the datagram header.
ru: Этот метод можно вызвать с объектом пустых байтов для отправки датаграммы нулевой длины. Расчет размера буфера, используемый для управления потоком, также обновляется с учетом заголовка дейтаграммы.

source: Close the transport immediately, without waiting for pending operations to complete. Buffered data will be lost. No more data will be received. The protocol's :meth:`protocol.connection_lost() <BaseProtocol.connection_lost>` method will eventually be called with :const:`None` as its argument.
ru: Закройте транспорт немедленно, не дожидаясь завершения ожидающих операций. Буферизованные данные будут потеряны. Больше никаких данных получено не будет. Метод протокола :meth:`protocol.connection_lost() <BaseProtocol.connection_lost>` в конечном итоге будет вызван с :const:`None` в качестве аргумента.

source: Subprocess Transports
ru: Транспорты подпроцессов

source: Return the subprocess process id as an integer.
ru: Верните идентификатор процесса подпроцесса в виде целого числа.

source: Return the transport for the communication pipe corresponding to the integer file descriptor *fd*:
ru: Возвращает транспорт для канала связи, соответствующий целочисленному файловому дескриптору *fd*:

source: ``0``: readable streaming transport of the standard input (*stdin*), or :const:`None` if the subprocess was not created with ``stdin=PIPE``
ru: ``0``: читаемый потоковый транспорт стандартного ввода (*stdin*) или :const:`None`, если подпроцесс не был создан с ``stdin=PIPE``

source: ``1``: writable streaming transport of the standard output (*stdout*), or :const:`None` if the subprocess was not created with ``stdout=PIPE``
ru: ``1``: записываемый потоковый транспорт стандартного вывода (*stdout*) или :const:`None`, если подпроцесс не был создан с ``stdout=PIPE``

source: ``2``: writable streaming transport of the standard error (*stderr*), or :const:`None` if the subprocess was not created with ``stderr=PIPE``
ru: ``2``: записываемый потоковый транспорт стандартной ошибки (*stderr*) или :const:`None`, если подпроцесс не был создан с ``stderr=PIPE``

source: other *fd*: :const:`None`
ru: другой *fd*: :const:`None`

source: Return the subprocess return code as an integer or :const:`None` if it hasn't returned, which is similar to the :attr:`subprocess.Popen.returncode` attribute.
ru: Верните код возврата подпроцесса в виде целого числа или :const:`None`, если он не вернулся, что аналогично атрибуту :attr:`subprocess.Popen.returncode`.

source: Kill the subprocess.
ru: Убейте подпроцесс.

source: On POSIX systems, the function sends SIGKILL to the subprocess. On Windows, this method is an alias for :meth:`terminate`.
ru: В системах POSIX функция отправляет SIGKILL подпроцессу. В Windows этот метод является псевдонимом :meth:`terminate`.

source: See also :meth:`subprocess.Popen.kill`.
ru: См. также :meth:`subprocess.Popen.kill`.

source: Send the *signal* number to the subprocess, as in :meth:`subprocess.Popen.send_signal`.
ru: Отправьте номер *сигнала* в подпроцесс, как в :meth:`subprocess.Popen.send_signal`.

source: Stop the subprocess.
ru: Остановите подпроцесс.
