Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/atexit.po
Languages: ru

source: The :mod:`atexit` module defines functions to register and unregister cleanup functions. Functions thus registered are automatically executed upon normal interpreter termination. :mod:`atexit` runs these functions in the *reverse* order in which they were registered; if you register ``A``, ``B``, and ``C``, at interpreter termination time they will be run in the order ``C``, ``B``, ``A``.
ru: Модуль :mod:`atexit` определяет функции для регистрации и отмены регистрации функций очистки. Зарегистрированные таким образом функции автоматически выполняются при обычном завершении работы интерпретатора. :mod:`atexit` запускает эти функции в *обратном* порядке их регистрации; если вы зарегистрируете ``A``, ``B`` и ``C``, во время завершения интерпретатора они будут выполняться в порядке ``C``, ``B``, ``A`` .

source: **Note:** The functions registered via this module are not called when the program is killed by a signal not handled by Python, when a Python fatal internal error is detected, or when :func:`os._exit` is called.
ru: **Примечание:** Функции, зарегистрированные через этот модуль, не вызываются, когда программа завершается сигналом, не обрабатываемым Python, когда обнаруживается фатальная внутренняя ошибка Python или когда вызывается :func:`os._exit`.

source: When used with C-API subinterpreters, registered functions are local to the interpreter they were registered in.
ru: При использовании с субинтерпретаторами C-API зарегистрированные функции являются локальными для интерпретатора, в котором они были зарегистрированы.

source: Register *func* as a function to be executed at termination. Any optional arguments that are to be passed to *func* must be passed as arguments to :func:`register`. It is possible to register the same function and arguments more than once.
ru: Зарегистрируйте *func* как функцию, которая будет выполняться при завершении. Любые необязательные аргументы, которые должны быть переданы в *func*, должны быть переданы в качестве аргументов в :func:`register`. Можно зарегистрировать одну и ту же функцию и аргументы более одного раза.

source: At normal program termination (for instance, if :func:`sys.exit` is called or the main module's execution completes), all functions registered are called in last in, first out order. The assumption is that lower level modules will normally be imported before higher level modules and thus must be cleaned up later.
ru: При обычном завершении программы (например, если вызывается :func:`sys.exit` или завершается выполнение основного модуля), все зарегистрированные функции вызываются в порядке последней входящей - первой исходящей. Предполагается, что модули более низкого уровня обычно импортируются раньше модулей более высокого уровня и, следовательно, их необходимо очистить позже.

source: If an exception is raised during execution of the exit handlers, a traceback is printed (unless :exc:`SystemExit` is raised) and the exception information is saved. After all exit handlers have had a chance to run, the last exception to be raised is re-raised.
ru: Если во время выполнения обработчиков выхода возникает исключение, выводится обратная трассировка (если не возникает :exc:`SystemExit`) и сохраняется информация об исключении. После того, как все обработчики выхода получили возможность выполниться, повторно вызывается последнее вызванное исключение.

source: This function returns *func*, which makes it possible to use it as a decorator.
ru: Эта функция возвращает *func*, что позволяет использовать ее в качестве декоратора.

source: Remove *func* from the list of functions to be run at interpreter shutdown. :func:`unregister` silently does nothing if *func* was not previously registered. If *func* has been registered more than once, every occurrence of that function in the :mod:`atexit` call stack will be removed. Equality comparisons (``==``) are used internally during unregistration, so function references do not need to have matching identities.
ru: Удалите *func* из списка функций, которые будут запускаться при завершении работы интерпретатора. :func:`unregister` ничего не делает, если *func* не была ранее зарегистрирована. Если *func* была зарегистрирована более одного раза, каждое появление этой функции в стеке вызовов :mod:`atexit` будет удалено. Сравнения на равенство (``==``) используются внутри во время отмены регистрации, поэтому ссылки на функции не обязательно должны иметь совпадающие идентификаторы.

source: Module :mod:`readline`
ru: Модуль :mod:`readline`

source: Useful example of :mod:`atexit` to read and write :mod:`readline` history files.
ru: Полезный пример :mod:`atexit` для чтения и записи :mod:`readline` файлов истории.

source: :mod:`atexit` Example
ru: Пример :mod:`atexit`

source: The following simple example demonstrates how a module can initialize a counter from a file when it is imported and save the counter's updated value automatically when the program terminates without relying on the application making an explicit call into this module at termination. ::
ru: Следующий простой пример демонстрирует, как модуль может инициализировать счетчик из файла при его импорте и автоматически сохранять обновленное значение счетчика при завершении программы, не полагаясь на то, что приложение выполняет явный вызов этого модуля при завершении. ::

source: Positional and keyword arguments may also be passed to :func:`register` to be passed along to the registered function when it is called::
ru: Позиционные и ключевые аргументы также могут быть переданы в :func:`register` для передачи зарегистрированной функции при ее вызове:

source: Usage as a :term:`decorator`::
ru: Использование в качестве :term:`декоратора`::

source: This only works with functions that can be called without arguments.
ru: Это работает только с функциями, которые можно вызывать без аргументов.
