Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/base64.po
Languages: ru

source: **Source code:** :source:`Lib/base64.py`
ru: **Исходный код:** :source:`Lib/base64.py`

source: The legacy interface does not support decoding from strings, but it does provide functions for encoding and decoding to and from :term:`file objects <file object>`. It only supports the Base64 standard alphabet, and it adds newlines every 76 characters as per :rfc:`2045`. Note that if you are looking for :rfc:`2045` support you probably want to be looking at the :mod:`email` package instead.
ru: Устаревший интерфейс не поддерживает декодирование строк, но предоставляет функции для кодирования и декодирования в/из файловых объектов <файловый объект>`. Он поддерживает только стандартный алфавит Base64 и добавляет новые строки через каждые 76 символов в соответствии с :rfc:`2045`. Обратите внимание, что если вам нужна поддержка :rfc:`2045`, вам, вероятно, стоит обратить внимание на пакет :mod:`email`.

source: ASCII-only Unicode strings are now accepted by the decoding functions of the modern interface.
ru: Строки Unicode, содержащие только ASCII, теперь принимаются функциями декодирования современного интерфейса.

source: Any :term:`bytes-like objects <bytes-like object>` are now accepted by all encoding and decoding functions in this module. Ascii85/Base85 support added.
ru: Любые :term:`байтоподобные объекты <байтоподобный объект>` теперь принимаются всеми функциями кодирования и декодирования в этом модуле. Добавлена ​​поддержка Ascii85/Base85.

source: The modern interface provides:
ru: Современный интерфейс обеспечивает:

source: Encode the :term:`bytes-like object` *s* using Base64 and return the encoded :class:`bytes`.
ru: Закодируйте :term:`bytes-подобный объект` *s* с помощью Base64 и верните закодированный :class:`bytes`.

source: Decode the Base64 encoded :term:`bytes-like object` or ASCII string *s* and return the decoded :class:`bytes`.
ru: Декодируйте закодированный в Base64 :term:`байтовый объект` или строку ASCII *s* и верните декодированный :class:`bytes`.

source: A :exc:`binascii.Error` exception is raised if *s* is incorrectly padded.
ru: Исключение :exc:`binascii.Error` возникает, если *s* заполнено неправильно.

source: If *validate* is ``False`` (the default), characters that are neither in the normal base-64 alphabet nor the alternative alphabet are discarded prior to the padding check. If *validate* is ``True``, these non-alphabet characters in the input result in a :exc:`binascii.Error`.
ru: Если *validate* имеет значение «False» (по умолчанию), символы, которые не входят ни в обычный алфавит Base64, ни в альтернативный алфавит, отбрасываются до проверки заполнения. Если *validate* имеет значение ``True``, эти неалфавитные символы во входных данных приводят к ошибке :exc:`binascii.Error`.

source: Encode :term:`bytes-like object` *s* using the standard Base64 alphabet and return the encoded :class:`bytes`.
ru: Закодируйте :term:`bytes-like object` *s*, используя стандартный алфавит Base64, и верните закодированный :class:`bytes`.

source: Decode :term:`bytes-like object` or ASCII string *s* using the standard Base64 alphabet and return the decoded :class:`bytes`.
ru: Декодируйте :term:`bytes-like object` или строку ASCII *s*, используя стандартный алфавит Base64, и возвращайте декодированный :class:`bytes`.

source: Encode :term:`bytes-like object` *s* using the URL- and filesystem-safe alphabet, which substitutes ``-`` instead of ``+`` and ``_`` instead of ``/`` in the standard Base64 alphabet, and return the encoded :class:`bytes`. The result can still contain ``=``.
ru: Кодируйте :term:`байтоподобный объект` *s*, используя алфавит, безопасный для URL и файловой системы, который заменяет ``-`` вместо ``+`` и ``_`` вместо ``/`` в стандартном алфавите Base64 и возвращает закодированные :class:`bytes`. Результат все еще может содержать ``=``.

source: Decode :term:`bytes-like object` or ASCII string *s* using the URL- and filesystem-safe alphabet, which substitutes ``-`` instead of ``+`` and ``_`` instead of ``/`` in the standard Base64 alphabet, and return the decoded :class:`bytes`.
ru: Декодируйте :term:`байтоподобный объект` или строку ASCII *s*, используя безопасный для URL-адресов и файловой системы алфавит, который заменяет ``-`` вместо ``+`` и ``_`` вместо `` /`` в стандартном алфавите Base64 и возвращаем декодированные :class:`bytes`.

source: Encode the :term:`bytes-like object` *s* using Base32 and return the encoded :class:`bytes`.
ru: Закодируйте :term:`bytes-подобный объект` *s* с помощью Base32 и верните закодированный :class:`bytes`.

source: Decode the Base32 encoded :term:`bytes-like object` or ASCII string *s* and return the decoded :class:`bytes`.
ru: Декодируйте закодированный в Base32 :term:`bytes-like объект` или строку ASCII *s* и верните декодированный :class:`bytes`.

source: Optional *casefold* is a flag specifying whether a lowercase alphabet is acceptable as input. For security purposes, the default is ``False``.
ru: Необязательный *casefold* — это флаг, определяющий, допустим ли строчный алфавит в качестве входных данных. В целях безопасности по умолчанию установлено значение «False».

source: A :exc:`binascii.Error` is raised if *s* is incorrectly padded or if there are non-alphabet characters present in the input.
ru: Ошибка :exc:`binascii.Error` возникает, если *s* неправильно дополнено или если во входных данных присутствуют символы, не являющиеся алфавитными.

source: Encode the :term:`bytes-like object` *s* using Base16 and return the encoded :class:`bytes`.
ru: Закодируйте :term:`bytes-подобный объект` *s*, используя Base16, и верните закодированный :class:`bytes`.

source: Decode the Base16 encoded :term:`bytes-like object` or ASCII string *s* and return the decoded :class:`bytes`.
ru: Декодируйте закодированный в Base16 :term:`bytes-like объект` или строку ASCII *s* и верните декодированный :class:`bytes`.

source: Encode the :term:`bytes-like object` *b* using Ascii85 and return the encoded :class:`bytes`.
ru: Закодируйте :term:`bytes-like объект` *b* с помощью Ascii85 и верните закодированный :class:`bytes`.

source: *foldspaces* is an optional flag that uses the special short sequence 'y' instead of 4 consecutive spaces (ASCII 0x20) as supported by 'btoa'. This feature is not supported by the "standard" Ascii85 encoding.
ru: *foldspaces* — это необязательный флаг, который использует специальную короткую последовательность «y» вместо 4 последовательных пробелов (ASCII 0x20), как это поддерживается «btoa». Эта функция не поддерживается «стандартной» кодировкой Ascii85.

source: *pad* controls whether the input is padded to a multiple of 4 before encoding. Note that the ``btoa`` implementation always pads.
ru: *pad* определяет, дополняется ли ввод до числа, кратного 4, перед кодированием. Обратите внимание, что реализация btoa всегда дополняет.

source: *adobe* controls whether the encoded byte sequence is framed with ``<~`` and ``~>``, which is used by the Adobe implementation.
ru: *adobe* определяет, будет ли закодированная последовательность байтов обрамлена символами ``<~`` и ``~>``, которые используются реализацией Adobe.

source: Decode the Ascii85 encoded :term:`bytes-like object` or ASCII string *b* and return the decoded :class:`bytes`.
ru: Декодируйте закодированный Ascii85 :term:`байтовый объект` или строку ASCII *b* и верните декодированный :class:`bytes`.

source: *foldspaces* is a flag that specifies whether the 'y' short sequence should be accepted as shorthand for 4 consecutive spaces (ASCII 0x20). This feature is not supported by the "standard" Ascii85 encoding.
ru: *foldspaces* — это флаг, который указывает, следует ли принимать короткую последовательность «y» в качестве сокращения для 4 последовательных пробелов (ASCII 0x20). Эта функция не поддерживается «стандартной» кодировкой Ascii85.

source: *adobe* controls whether the input sequence is in Adobe Ascii85 format (i.e. is framed with <~ and ~>).
ru: *adobe* определяет, находится ли входная последовательность в формате Adobe Ascii85 (т. е. заключена ли она в рамку <~ и ~>).

source: *ignorechars* should be a :term:`bytes-like object` or ASCII string containing characters to ignore from the input. This should only contain whitespace characters, and by default contains all whitespace characters in ASCII.
ru: *ignorechars* должен быть :term:`байтовым объектом` или строкой ASCII, содержащей символы, которые следует игнорировать во входных данных. Он должен содержать только пробельные символы и по умолчанию содержит все пробельные символы в ASCII.

source: Encode the :term:`bytes-like object` *b* using base85 (as used in e.g. git-style binary diffs) and return the encoded :class:`bytes`.
ru: Закодируйте :term:`bytes-like object` *b*, используя base85 (как это используется, например, в двоичных различиях в стиле git) и верните закодированный :class:`bytes`.

source: If *pad* is true, the input is padded with ``b'\0'`` so its length is a multiple of 4 bytes before encoding.
ru: Если *pad* имеет значение true, входные данные дополняются символом ``b'\0'``, поэтому его длина перед кодированием кратна 4 байтам.

source: Decode the base85-encoded :term:`bytes-like object` or ASCII string *b* and return the decoded :class:`bytes`. Padding is implicitly removed, if necessary.
ru: Декодируйте закодированный в base85 :term:`bytes-like объект` или строку ASCII *b* и верните декодированный :class:`bytes`. При необходимости отступы неявно удаляются.

source: The legacy interface:
ru: Устаревший интерфейс:

source: Decode the contents of the binary *input* file and write the resulting binary data to the *output* file. *input* and *output* must be :term:`file objects <file object>`. *input* will be read until ``input.readline()`` returns an empty bytes object.
ru: Декодируйте содержимое двоичного *входного* файла и запишите полученные двоичные данные в *выходной* файл. *входные* и *выходные* должны быть :term:`файловые объекты <файловый объект>`. *input* будет читаться до тех пор, пока ``input.readline()`` не вернет пустой байтовый объект.

source: Decode the :term:`bytes-like object` *s*, which must contain one or more lines of base64 encoded data, and return the decoded :class:`bytes`.
ru: Декодируйте :term:`bytes-like объект` *s*, который должен содержать одну или несколько строк данных в кодировке Base64, и верните декодированный :class:`bytes`.

source: Encode the contents of the binary *input* file and write the resulting base64 encoded data to the *output* file. *input* and *output* must be :term:`file objects <file object>`. *input* will be read until ``input.read()`` returns an empty bytes object. :func:`encode` inserts a newline character (``b'\n'``) after every 76 bytes of the output, as well as ensuring that the output always ends with a newline, as per :rfc:`2045` (MIME).
ru: Закодируйте содержимое двоичного *входного* файла и запишите полученные данные в кодировке Base64 в *выходной* файл. *входные* и *выходные* должны быть :term:`файловые объекты <файловый объект>`. *input* будет читаться до тех пор, пока ``input.read()`` не вернет пустой байтовый объект. :func:`encode` вставляет символ новой строки (``b'\n'``) после каждых 76 байт выходных данных, а также гарантирует, что вывод всегда заканчивается новой строкой, согласно :rfc:`2045` (МИМ).

source: Encode the :term:`bytes-like object` *s*, which can contain arbitrary binary data, and return :class:`bytes` containing the base64-encoded data, with newlines (``b'\n'``) inserted after every 76 bytes of output, and ensuring that there is a trailing newline, as per :rfc:`2045` (MIME).
ru: Закодируйте :term:`bytes-like объект` *s*, который может содержать произвольные двоичные данные, и верните :class:`bytes`, содержащий данные в кодировке Base64, с символами новой строки (``b'\n'``) вставляется после каждых 76 байт вывода и обеспечивает наличие завершающей новой строки в соответствии с :rfc:`2045` (MIME).

source: An example usage of the module:
ru: Пример использования модуля:

source: Module :mod:`binascii`
ru: Модуль :mod:`binascii`

source: Support module containing ASCII-to-binary and binary-to-ASCII conversions.
ru: Модуль поддержки, содержащий преобразования ASCII в двоичный и двоичный формат ASCII.

source: :rfc:`1521` - MIME (Multipurpose Internet Mail Extensions) Part One: Mechanisms for Specifying and Describing the Format of Internet Message Bodies
ru: :rfc:`1521` - MIME (многоцелевые расширения почты Интернета), часть первая: механизмы определения и описания формата тел интернет-сообщений

source: Section 5.2, "Base64 Content-Transfer-Encoding," provides the definition of the base64 encoding.
ru: Раздел 5.2, «Кодирование передачи контента Base64», содержит определение кодировки base64.
