Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/bdb.po
Languages: ru

source: **Source code:** :source:`Lib/bdb.py`
ru: **Исходный код:** :source:`Lib/bdb.py`

source: The :mod:`bdb` module handles basic debugger functions, like setting breakpoints or managing execution via the debugger.
ru: Модуль :mod:`bdb` выполняет основные функции отладчика, такие как установка точек останова или управление выполнением через отладчик.

source: The following exception is defined:
ru: Определено следующее исключение:

source: Exception raised by the :class:`Bdb` class for quitting the debugger.
ru: Исключение, вызываемое классом :class:`Bdb` для выхода из отладчика.

source: The :mod:`bdb` module also defines two classes:
ru: Модуль :mod:`bdb` также определяет два класса:

source: This class implements temporary breakpoints, ignore counts, disabling and (re-)enabling, and conditionals.
ru: Этот класс реализует временные точки останова, счетчик игнорирования, отключение и (повторное) включение, а также условные обозначения.

source: Breakpoints are indexed by number through a list called :attr:`bpbynumber` and by ``(file, line)`` pairs through :attr:`bplist`. The former points to a single instance of class :class:`Breakpoint`. The latter points to a list of such instances since there may be more than one breakpoint per line.
ru: Точки останова индексируются по номеру через список под названием :attr:`bpbynumber` и по парам ``(файл, строка)`` через :attr:`bplist`. Первый указывает на один экземпляр класса :class:`Breakpoint`. Последний указывает на список таких экземпляров, поскольку в каждой строке может быть более одной точки останова.

source: :class:`Breakpoint` instances have the following methods:
ru: Экземпляры :class:`Breakpoint` имеют следующие методы:

source: Delete the breakpoint from the list associated to a file/line. If it is the last breakpoint in that position, it also deletes the entry for the file/line.
ru: Удалить точку останова из списка, связанного с файлом/строкой. Если это последняя точка останова в этой позиции, она также удаляет запись для файла/строки.

source: Mark the breakpoint as enabled.
ru: Отметьте точку останова как включенную.

source: Mark the breakpoint as disabled.
ru: Отметьте точку останова как отключенную.

source: Return a string with all the information about the breakpoint, nicely formatted:
ru: Верните строку со всей информацией о точке останова в красивом формате:

source: Print the output of :meth:`bpformat` to the file *out*, or if it is ``None``, to standard output.
ru: Выведите вывод :meth:`bpformat` в файл *out* или, если он ``None``, в стандартный вывод.

source: The :class:`Bdb` class acts as a generic Python debugger base class.
ru: Класс :class:`Bdb` действует как общий базовый класс отладчика Python.

source: This class takes care of the details of the trace facility; a derived class should implement user interaction. The standard debugger class (:class:`pdb.Pdb`) is an example.
ru: Этот класс заботится о деталях трассировки; производный класс должен реализовывать взаимодействие с пользователем. Примером может служить стандартный класс отладчика (:class:`pdb.Pdb`).

source: The *skip* argument, if given, must be an iterable of glob-style module name patterns. The debugger will not step into frames that originate in a module that matches one of these patterns. Whether a frame is considered to originate in a certain module is determined by the ``__name__`` in the frame globals.
ru: Аргумент *skip*, если он указан, должен быть итерацией шаблонов имен модулей в стиле glob. Отладчик не будет входить в кадры, созданные в модуле, соответствующем одному из этих шаблонов. Будет ли кадр считаться происходящим из определенного модуля, определяется ``__name__`` в глобальных переменных кадра.

source: The *skip* argument.
ru: Аргумент *skip*.

source: The following methods of :class:`Bdb` normally don't need to be overridden.
ru: Следующие методы :class:`Bdb` обычно не требуют переопределения.

source: This function is installed as the trace function of debugged frames. Its return value is the new trace function (in most cases, that is, itself).
ru: Эта функция устанавливается как функция трассировки отлаживаемых кадров. Ее возвращаемое значение — это новая функция трассировки (в большинстве случаев она сама).

source: The default implementation decides how to dispatch a frame, depending on the type of event (passed as a string) that is about to be executed. *event* can be one of the following:
ru: Реализация по умолчанию решает, как отправить кадр, в зависимости от типа события (передаваемого в виде строки), которое должно быть выполнено. *событие* может быть одним из следующих:

source: ``"line"``: A new line of code is going to be executed.
ru: ``"line"``: будет выполнена новая строка кода.

source: ``"call"``: A function is about to be called, or another code block entered.
ru: ``"call"``: скоро будет вызвана функция или введен другой блок кода.

source: ``"return"``: A function or other code block is about to return.
ru: ``"return"``: функция или другой блок кода вот-вот вернется.

source: ``"exception"``: An exception has occurred.
ru: ``"exception"``: произошло исключение.

source: ``"c_call"``: A C function is about to be called.
ru: ``"c_call"``: функция AC скоро будет вызвана.

source: ``"c_return"``: A C function has returned.
ru: ``"c_return"``: функция AC вернулась.

source: ``"c_exception"``: A C function has raised an exception.
ru: ``"c_Exception"``: функция AC вызвала исключение.

source: For the Python events, specialized functions (see below) are called. For the C events, no action is taken.
ru: Для событий Python вызываются специализированные функции (см. ниже). Для событий C никаких действий не предпринимается.

source: The *arg* parameter depends on the previous event.
ru: Параметр *arg* зависит от предыдущего события.

source: See the documentation for :func:`sys.settrace` for more information on the trace function. For more information on code and frame objects, refer to :ref:`types`.
ru: Дополнительную информацию о функции трассировки смотрите в документации к :func:`sys.settrace`. Дополнительную информацию об объектах кода и фреймов см. в разделе :ref:`types`.

source: Normally derived classes don't override the following methods, but they may if they want to redefine the definition of stopping and breakpoints.
ru: Обычно производные классы не переопределяют следующие методы, но они могут это сделать, если хотят переопределить определения остановки и точек останова.

source: Derived classes should override these methods to gain control over debugger operation.
ru: Производные классы должны переопределить эти методы, чтобы получить контроль над работой отладчика.

source: Handle how a breakpoint must be removed when it is a temporary one.
ru: Укажите, как необходимо удалить точку останова, если она является временной.

source: This method must be implemented by derived classes.
ru: Этот метод должен быть реализован производными классами.

source: Derived classes and clients can call the following methods to affect the stepping state.
ru: Производные классы и клиенты могут вызывать следующие методы, чтобы влиять на состояние пошагового выполнения.

source: Stop after one line of code.
ru: Остановитесь после одной строки кода.

source: Stop on the next line in or below the given frame.
ru: Остановитесь на следующей строке в данном кадре или ниже.

source: Stop when returning from the given frame.
ru: Остановиться при возврате из данного кадра.

source: Start debugging from *frame*. If *frame* is not specified, debugging starts from caller's frame.
ru: Начать отладку с *кадра*. Если *frame* не указан, отладка начинается с кадра вызывающего абонента.

source: Stop only at breakpoints or when finished. If there are no breakpoints, set the system trace function to ``None``.
ru: Останавливайтесь только в точках останова или по завершении. Если точек останова нет, установите для функции трассировки системы значение «Нет».

source: Derived classes and clients can call the following methods to manipulate breakpoints. These methods return a string containing an error message if something went wrong, or ``None`` if all is well.
ru: Производные классы и клиенты могут вызывать следующие методы для управления точками останова. Эти методы возвращают строку, содержащую сообщение об ошибке, если что-то пошло не так, или «Нет», если все в порядке.

source: Set a new breakpoint. If the *lineno* line doesn't exist for the *filename* passed as argument, return an error message. The *filename* should be in canonical form, as described in the :meth:`canonic` method.
ru: Установите новую точку останова. Если строка *lineno* не существует для *имя_файла*, переданного в качестве аргумента, верните сообщение об ошибке. *имя файла* должно быть в канонической форме, как описано в методе :meth:`canonic`.

source: Delete the breakpoint which has the index *arg* in the :attr:`Breakpoint.bpbynumber`. If *arg* is not numeric or out of range, return an error message.
ru: Удалите точку останова, имеющую индекс *arg* в :attr:`Breakpoint.bpbynumber`. Если *arg* не является числовым или выходит за пределы диапазона, верните сообщение об ошибке.

source: Return a breakpoint specified by the given number. If *arg* is a string, it will be converted to a number. If *arg* is a non-numeric string, if the given breakpoint never existed or has been deleted, a :exc:`ValueError` is raised.
ru: Возвращает точку останова, указанную заданным номером. Если *arg* — строка, она будет преобразована в число. Если *arg* является нечисловой строкой, если данная точка останова никогда не существовала или была удалена, возникает ошибка :exc:`ValueError`.

source: Return all breakpoints for *lineno* in *filename*, or an empty list if none are set.
ru: Возвращает все точки останова для *lineno* в *filename* или пустой список, если ни один из них не установлен.

source: Return all breakpoints in *filename*, or an empty list if none are set.
ru: Вернуть все точки останова в *filename* или пустой список, если ни одна не установлена.

source: Return all breakpoints that are set.
ru: Возвращает все установленные точки останова.

source: Derived classes and clients can call the following methods to get a data structure representing a stack trace.
ru: Производные классы и клиенты могут вызывать следующие методы, чтобы получить структуру данных, представляющую трассировку стека.

source: The input arguments.
ru: Входные аргументы.

source: The return value.
ru: Возвращаемое значение.

source: The line of code (if it exists).
ru: Строка кода (если она существует).

source: The following two methods can be called by clients to use a debugger to debug a :term:`statement`, given as a string.
ru: Клиенты могут вызывать следующие два метода, чтобы использовать отладчик для отладки оператора :term:`statement`, заданного в виде строки.

source: Debug an expression executed via the :func:`eval` function. *globals* and *locals* have the same meaning as in :meth:`run`.
ru: Отладка выражения, выполняемого с помощью функции :func:`eval`. *globals* и *locals* имеют то же значение, что и в :meth:`run`.

source: For backwards compatibility. Calls the :meth:`run` method.
ru: Для обратной совместимости. Вызывает метод :meth:`run`.

source: Debug a single function call, and return its result.
ru: Отладка одного вызова функции и возврат ее результата.

source: Finally, the module defines the following functions:
ru: Наконец, модуль определяет следующие функции:

source: Start debugging with a :class:`Bdb` instance from caller's frame.
ru: Начните отладку с экземпляра :class:`Bdb` из фрейма вызывающего объекта.
