Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/binhex.po
Languages: pl

source: :mod:`binhex` --- Encode and decode binhex4 files
pl: :mod:`binhex` --- Koduj i dekoduj pliki binhex4

source: This module encodes and decodes files in binhex4 format, a format allowing representation of Macintosh files in ASCII. Only the data fork is handled.
pl: Ten moduł koduje i dekoduje pliki w formacie binhex4, formacie pozwalającym reprezentację plików Macintosha w ASCII. Tylko rozwidlenie danych jest obsługiwane.

source: The :mod:`binhex` module defines the following functions:
pl: moduł :mod:`binhex` definiuje następujące funkcje:

source: Convert a binary file with filename *input* to binhex file *output*. The *output* parameter can either be a filename or a file-like object (any object supporting a :meth:`write` and :meth:`close` method).
pl: Zamień plik binarny z nazwą pliku *input* do pliku binhex *output*. Parametr *output* może albo być nazwą pliku lub obiektem podobnym do pliku (dowolny obiekt wspierający metody :meth:`write` i :meth:`close`).

source: Decode a binhex file *input*. *input* may be a filename or a file-like object supporting :meth:`read` and :meth:`close` methods. The resulting file is written to a file named *output*, unless the argument is ``None`` in which case the output filename is read from the binhex file.
pl: Dekoduj plik binhex *input*. *input* może być nazwą pliku lub obiektem podobnym do pliku wspierającym metody :meth:`read` i :meth:`close`. Wynikający plik jest zapisywany do pliku nazwanego *output*, chyba, że parametr jest ``None``, w którym przypadku nazwa pliku jest wczytywana z pliku binhex.

source: The following exception is also defined:
pl: Zdefiniowany jest także następujący wyjątek:

source: Exception raised when something can't be encoded using the binhex format (for example, a filename is too long to fit in the filename field), or when input is not properly encoded binhex data.
pl: Wyjątek zgłaszany gdy coś nie może być zakodowane używając formatu binhex (dla przykładu, nazwa pliku jest za długa aby dopasować do pola nazwy pliku), lub gdy wejście nie jest poprawnie zakodowanymi danymi binhex.

source: Support module containing ASCII-to-binary and binary-to-ASCII conversions.
pl: Wspierający moduł zawierający konwersję ASCII-do-binarnego i binarnego-do-ASCII.

source: Notes
pl: Notatki

source: There is an alternative, more powerful interface to the coder and decoder, see the source for details.
pl: Istnieje alternatywny, bardziej silny interfejs kodera i dekodera, zobacz źródło dla szczegółów.

source: If you code or decode textfiles on non-Macintosh platforms they will still use the old Macintosh newline convention (carriage-return as end of line).
pl: Jeśli kodujesz lub dekodujesz pliki tekstowe na maszynie/środowisku nie-Macintoshu one będą wciąż używały starej konwencji znaków nowego wiersza z Macintosha (powrót-karetki jako końca linii).
