Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/bisect.po
Languages: ru

source: :mod:`!bisect` --- Array bisection algorithm
ru: :mod:`!bisect` --- Алгоритм деления массива пополам

source: **Source code:** :source:`Lib/bisect.py`
ru: **Исходный код:** :source:`Lib/bisect.py`

source: This module provides support for maintaining a list in sorted order without having to sort the list after each insertion. For long lists of items with expensive comparison operations, this can be an improvement over linear searches or frequent resorting.
ru: Этот модуль обеспечивает поддержку хранения списка в отсортированном порядке без необходимости сортировки списка после каждой вставки. Для длинных списков элементов с дорогостоящими операциями сравнения это может быть улучшением по сравнению с линейным поиском или частым обращением.

source: The module is called :mod:`bisect` because it uses a basic bisection algorithm to do its work. Unlike other bisection tools that search for a specific value, the functions in this module are designed to locate an insertion point. Accordingly, the functions never call an :meth:`~object.__eq__` method to determine whether a value has been found. Instead, the functions only call the :meth:`~object.__lt__` method and will return an insertion point between values in an array.
ru: Модуль называется :mod:`bisect`, потому что для своей работы он использует базовый алгоритм деления пополам. В отличие от других инструментов деления пополам, которые ищут определенное значение, функции в этом модуле предназначены для поиска точки вставки. Соответственно, функции никогда не вызывают метод :meth:`~object.__eq__`, чтобы определить, найдено ли значение. Вместо этого функции вызывают только метод :meth:`~object.__lt__` и возвращают точку вставки между значениями в массиве.

source: The following functions are provided:
ru: Предусмотрены следующие функции:

source: Locate the insertion point for *x* in *a* to maintain sorted order. The parameters *lo* and *hi* may be used to specify a subset of the list which should be considered; by default the entire list is used. If *x* is already present in *a*, the insertion point will be before (to the left of) any existing entries. The return value is suitable for use as the first parameter to ``list.insert()`` assuming that *a* is already sorted.
ru: Найдите точку вставки *x* в *a*, чтобы сохранить отсортированный порядок. Параметры *lo* и *hi* могут использоваться для указания подмножества списка, которое следует учитывать; по умолчанию используется весь список. Если *x* уже присутствует в *a*, точка вставки будет находиться перед (слева) любыми существующими записями. Возвращаемое значение подходит для использования в качестве первого параметра функции list.insert() при условии, что *a* уже отсортировано.

source: The returned insertion point *ip* partitions the array *a* into two slices such that ``all(elem < x for elem in a[lo : ip])`` is true for the left slice and ``all(elem >= x for elem in a[ip : hi])`` is true for the right slice.
ru: Возвращенная точка вставки *ip* разделяет массив *a* на два фрагмента так, что ``all(elem < x for elem in a[lo : ip])`` истинно для левого фрагмента и ``all(elem > = x for elem в a[ip : hi])`` верно для правого среза.

source: *key* specifies a :term:`key function` of one argument that is used to extract a comparison key from each element in the array. To support searching complex records, the key function is not applied to the *x* value.
ru: *key* определяет :term:`ключевую функцию` с одним аргументом, которая используется для извлечения ключа сравнения из каждого элемента массива. Для поддержки поиска по сложным записям функция ключа не применяется к значению *x*.

source: If *key* is ``None``, the elements are compared directly and no key function is called.
ru: Если *key* имеет значение None, элементы сравниваются напрямую, без вызова ключевой функции.

source: Added the *key* parameter.
ru: Добавлен параметр *key*.

source: Similar to :py:func:`~bisect.bisect_left`, but returns an insertion point which comes after (to the right of) any existing entries of *x* in *a*.
ru: Аналогично :py:func:`~bisect.bisect_left`, но возвращает точку вставки, которая идет после (справа) любых существующих записей *x* в *a*.

source: The returned insertion point *ip* partitions the array *a* into two slices such that ``all(elem <= x for elem in a[lo : ip])`` is true for the left slice and ``all(elem > x for elem in a[ip : hi])`` is true for the right slice.
ru: Возвращенная точка вставки *ip* разделяет массив *a* на два фрагмента так, что ``all(elem <= x for elem in a[lo : ip])`` истинно для левого фрагмента и ``all(elem > x for elem в a[ip : hi])`` верно для правого среза.

source: Insert *x* in *a* in sorted order.
ru: Вставьте *x* в *a* в отсортированном порядке.

source: This function first runs :py:func:`~bisect.bisect_left` to locate an insertion point. Next, it runs the :meth:`!insert` method on *a* to insert *x* at the appropriate position to maintain sort order.
ru: Эта функция сначала запускает :py:func:`~bisect.bisect_left`, чтобы найти точку вставки. Затем он запускает метод :meth:`!insert` для *a*, чтобы вставить *x* в соответствующую позицию для поддержания порядка сортировки.

source: To support inserting records in a table, the *key* function (if any) is applied to *x* for the search step but not for the insertion step.
ru: Для поддержки вставки записей в таблицу функция *key* (если есть) применяется к *x* на этапе поиска, но не на этапе вставки.

source: Keep in mind that the *O*\ (log *n*) search is dominated by the slow *O*\ (*n*) insertion step.
ru: Имейте в виду, что при поиске *O*\ (log *n*) преобладает медленный шаг вставки *O*\ (*n*).

source: Similar to :py:func:`~bisect.insort_left`, but inserting *x* in *a* after any existing entries of *x*.
ru: Аналогично :py:func:`~bisect.insort_left`, но вставляет *x* в *a* после любых существующих записей *x*.

source: This function first runs :py:func:`~bisect.bisect_right` to locate an insertion point. Next, it runs the :meth:`!insert` method on *a* to insert *x* at the appropriate position to maintain sort order.
ru: Эта функция сначала запускает :py:func:`~bisect.bisect_right`, чтобы найти точку вставки. Затем он запускает метод :meth:`!insert` для *a*, чтобы вставить *x* в соответствующую позицию для поддержания порядка сортировки.

source: Performance Notes
ru: Примечания по производительности

source: When writing time sensitive code using *bisect()* and *insort()*, keep these thoughts in mind:
ru: При написании кода, чувствительного к времени, с использованием *bisect()* и *insort()* имейте в виду следующие мысли:

source: Bisection is effective for searching ranges of values. For locating specific values, dictionaries are more performant.
ru: Разделение пополам эффективно для поиска диапазонов значений. Для поиска конкретных значений словари более эффективны.

source: The *insort()* functions are *O*\ (*n*) because the logarithmic search step is dominated by the linear time insertion step.
ru: Функции *insort()* имеют вид *O*\ (*n*), поскольку шаг логарифмического поиска доминирует шаг вставки линейного времени.

source: The search functions are stateless and discard key function results after they are used. Consequently, if the search functions are used in a loop, the key function may be called again and again on the same array elements. If the key function isn't fast, consider wrapping it with :py:func:`functools.cache` to avoid duplicate computations. Alternatively, consider searching an array of precomputed keys to locate the insertion point (as shown in the examples section below).
ru: Функции поиска не сохраняют состояние и отбрасывают результаты ключевых функций после их использования. Следовательно, если функции поиска используются в цикле, ключевая функция может вызываться снова и снова для одних и тех же элементов массива. Если ключевая функция не быстрая, рассмотрите возможность ее обертывания в :py:func:`functools.cache`, чтобы избежать дублирования вычислений. В качестве альтернативы рассмотрите возможность поиска в массиве предварительно вычисленных ключей, чтобы найти точку вставки (как показано в разделе примеров ниже).

source: `Sorted Collections <https://grantjenks.com/docs/sortedcollections/>`_ is a high performance module that uses *bisect* to managed sorted collections of data.
ru: `Sorted Collections <https://grantjenks.com/docs/sortedcollections/>`_ — это высокопроизводительный модуль, который использует *bisect* для управления отсортированными коллекциями данных.

source: The `SortedCollection recipe <https://code.activestate.com/recipes/577197-sortedcollection/>`_ uses bisect to build a full-featured collection class with straight-forward search methods and support for a key-function. The keys are precomputed to save unnecessary calls to the key function during searches.
ru: Рецепт SortedCollection <https://code.activestate.com/recipes/577197-sortedcollection/>`_ использует bisect для создания полнофункционального класса коллекции с прямыми методами поиска и поддержкой ключевых функций. Ключи предварительно вычисляются, чтобы избежать ненужных вызовов функции ключа во время поиска.

source: Searching Sorted Lists
ru: Поиск в отсортированных списках

source: The above `bisect functions`_ are useful for finding insertion points but can be tricky or awkward to use for common searching tasks. The following five functions show how to transform them into the standard lookups for sorted lists::
ru: Вышеупомянутые «функции пополам» полезны для поиска точек вставки, но их использование для обычных задач поиска может быть сложным или неудобным. Следующие пять функций показывают, как преобразовать их в стандартный поиск для отсортированных списков:

source: Examples
ru: Примеры

source: The :py:func:`~bisect.bisect` function can be useful for numeric table lookups. This example uses :py:func:`~bisect.bisect` to look up a letter grade for an exam score (say) based on a set of ordered numeric breakpoints: 90 and up is an 'A', 80 to 89 is a 'B', and so on::
ru: Функция :py:func:`~bisect.bisect` может быть полезна для числового поиска в таблице. В этом примере :py:func:`~bisect.bisect` используется для поиска буквенной оценки за экзамен (скажем) на основе набора упорядоченных числовых точек останова: от 90 и выше — это «А», от 80 до 89 — это «Б» и так далее::

source: The :py:func:`~bisect.bisect` and :py:func:`~bisect.insort` functions also work with lists of tuples. The *key* argument can serve to extract the field used for ordering records in a table::
ru: Функции :py:func:`~bisect.bisect` и :py:func:`~bisect.insort` также работают со списками кортежей. Аргумент *key* может служить для извлечения поля, используемого для упорядочивания записей в таблице::

source: If the key function is expensive, it is possible to avoid repeated function calls by searching a list of precomputed keys to find the index of a record::
ru: Если ключевая функция дорогая, можно избежать повторных вызовов функции, выполнив поиск по списку заранее вычисленных ключей, чтобы найти индекс записи:
