Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/cgitb.po
Languages: ru

source: :mod:`cgitb` --- Traceback manager for CGI scripts
ru: :mod:`cgitb` --- Менеджер трассировки для CGI-скриптов

source: **Source code:** :source:`Lib/cgitb.py`
ru: **Исходный код:** :source:`Lib/cgitb.py`

source: The :mod:`cgitb` module is deprecated (see :pep:`PEP 594 <594#cgitb>` for details).
ru: Модуль :mod:`cgitb` устарел (подробности см. в :pep:`PEP 594 <594#cgitb>`).

source: The :mod:`cgitb` module provides a special exception handler for Python scripts. (Its name is a bit misleading. It was originally designed to display extensive traceback information in HTML for CGI scripts. It was later generalized to also display this information in plain text.) After this module is activated, if an uncaught exception occurs, a detailed, formatted report will be displayed. The report includes a traceback showing excerpts of the source code for each level, as well as the values of the arguments and local variables to currently running functions, to help you debug the problem. Optionally, you can save this information to a file instead of sending it to the browser.
ru: Модуль :mod:`cgitb` предоставляет специальный обработчик исключений для скриптов Python. (Его название немного вводит в заблуждение. Первоначально он был разработан для отображения обширной информации обратной трассировки в HTML для сценариев CGI. Позже он был обобщен для отображения этой информации в виде простого текста.) После активации этого модуля, если возникает неперехваченное исключение, будет отображен подробный, отформатированный отчет. Отчет включает в себя обратную трассировку, показывающую фрагменты исходного кода для каждого уровня, а также значения аргументов и локальных переменных для текущих функций, чтобы помочь вам отладить проблему. При желании вы можете сохранить эту информацию в файл вместо отправки ее в браузер.

source: To enable this feature, simply add this to the top of your CGI script::
ru: Чтобы включить эту функцию, просто добавьте это в начало вашего CGI-скрипта:

source: The options to the :func:`enable` function control whether the report is displayed in the browser and whether the report is logged to a file for later analysis.
ru: Параметры функции :func:`enable` контролируют, будет ли отчет отображаться в браузере и записываться ли отчет в файл для последующего анализа.

source: This function causes the :mod:`cgitb` module to take over the interpreter's default handling for exceptions by setting the value of :attr:`sys.excepthook`.
ru: Эта функция заставляет модуль :mod:`cgitb` взять на себя обработку исключений интерпретатором по умолчанию, устанавливая значение :attr:`sys.excepthook`.

source: The optional argument *display* defaults to ``1`` and can be set to ``0`` to suppress sending the traceback to the browser. If the argument *logdir* is present, the traceback reports are written to files. The value of *logdir* should be a directory where these files will be placed. The optional argument *context* is the number of lines of context to display around the current line of source code in the traceback; this defaults to ``5``. If the optional argument *format* is ``"html"``, the output is formatted as HTML. Any other value forces plain text output. The default value is ``"html"``.
ru: Необязательный аргумент *display* по умолчанию имеет значение «1» и может быть установлен в «0», чтобы запретить отправку обратной трассировки в браузер. Если присутствует аргумент *logdir*, отчеты трассировки записываются в файлы. Значение *logdir* должно указывать каталог, в котором будут размещены эти файлы. Необязательный аргумент *context* — это количество строк контекста, отображаемых вокруг текущей строки исходного кода в обратной трассировке; по умолчанию это ``5``. Если необязательный аргумент *format* равен ``"html"``, выходные данные форматируются как HTML. Любое другое значение приводит к выводу в виде обычного текста. Значение по умолчанию — ``"html"``.

source: This function handles the exception described by *info* (a 3-tuple containing the result of :func:`sys.exc_info`), formatting its traceback as text and returning the result as a string. The optional argument *context* is the number of lines of context to display around the current line of source code in the traceback; this defaults to ``5``.
ru: Эта функция обрабатывает исключение, описанное *info* (кортеж из трех элементов, содержащий результат :func:`sys.exc_info`), форматируя его обратную трассировку как текст и возвращая результат в виде строки. Необязательный аргумент *context* — это количество строк контекста, отображаемых вокруг текущей строки исходного кода в обратной трассировке; по умолчанию это ``5``.

source: This function handles the exception described by *info* (a 3-tuple containing the result of :func:`sys.exc_info`), formatting its traceback as HTML and returning the result as a string. The optional argument *context* is the number of lines of context to display around the current line of source code in the traceback; this defaults to ``5``.
ru: Эта функция обрабатывает исключение, описанное *info* (кортеж из трех элементов, содержащий результат :func:`sys.exc_info`), форматируя его обратную трассировку как HTML и возвращая результат в виде строки. Необязательный аргумент *context* — это количество строк контекста, отображаемых вокруг текущей строки исходного кода в обратной трассировке; по умолчанию это ``5``.

source: This function handles an exception using the default settings (that is, show a report in the browser, but don't log to a file). This can be used when you've caught an exception and want to report it using :mod:`cgitb`. The optional *info* argument should be a 3-tuple containing an exception type, exception value, and traceback object, exactly like the tuple returned by :func:`sys.exc_info`. If the *info* argument is not supplied, the current exception is obtained from :func:`sys.exc_info`.
ru: Эта функция обрабатывает исключение, используя настройки по умолчанию (т. е. показывает отчет в браузере, но не записывает его в файл). Это можно использовать, если вы обнаружили исключение и хотите сообщить об этом с помощью :mod:`cgitb`. Необязательный аргумент *info* должен представлять собой кортеж из трех элементов, содержащий тип исключения, значение исключения и объект трассировки, точно так же, как кортеж, возвращаемый :func:`sys.exc_info`. Если аргумент *info* не указан, текущее исключение получается из :func:`sys.exc_info`.

source: exceptions
ru: исключения

source: tracebacks
ru: обратные трассировки

source: in CGI scripts
ru: в CGI-скриптах

source: excepthook() (in module sys)
ru: кромеhook() (в модуле sys)
