Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/cmath.po
Languages: ru

source: Conversions to and from polar coordinates
ru: Преобразования в полярные координаты и обратно

source: *Polar coordinates* give an alternative way to represent a complex number. In polar coordinates, a complex number *z* is defined by the modulus *r* and the phase angle *phi*. The modulus *r* is the distance from *z* to the origin, while the phase *phi* is the counterclockwise angle, measured in radians, from the positive x-axis to the line segment that joins the origin to *z*.
ru: *Полярные координаты* дают альтернативный способ представления комплексного числа. В полярных координатах комплексное число *z* определяется модулем *r* и фазовым углом *phi*. Модуль *r* — это расстояние от *z* до начала координат, а фаза *phi* — это угол против часовой стрелки, измеряемый в радианах, от положительной оси X до отрезка линии, соединяющего начало координат с *z*.

source: The following functions can be used to convert from the native rectangular coordinates to polar coordinates and back.
ru: Следующие функции можно использовать для преобразования собственных прямоугольных координат в полярные координаты и обратно.

source: The modulus (absolute value) of a complex number *x* can be computed using the built-in :func:`abs` function. There is no separate :mod:`cmath` module function for this operation.
ru: Модуль (абсолютное значение) комплексного числа *x* можно вычислить с помощью встроенной функции :func:`abs`. Для этой операции не существует отдельной функции модуля :mod:`cmath`.

source: Return the representation of *x* in polar coordinates. Returns a pair ``(r, phi)`` where *r* is the modulus of *x* and phi is the phase of *x*. ``polar(x)`` is equivalent to ``(abs(x), phase(x))``.
ru: Верните представление *x* в полярных координатах. Возвращает пару ``(r, phi)``, где *r* — модуль *x*, а phi — фаза *x*. ``polar(x)`` эквивалентен ``(abs(x),phase(x))``.

source: Power and logarithmic functions
ru: Степенные и логарифмические функции

source: Return *e* raised to the power *x*, where *e* is the base of natural logarithms.
ru: Верните *e*, возведённое в степень *x*, где *e* — это основание натуральных логарифмов.

source: Return the base-10 logarithm of *x*. This has the same branch cut as :func:`log`.
ru: Возвращает десятичный логарифм числа *x*. Он имеет тот же разрез ветки, что и :func:`log`.

source: Return the square root of *x*. This has the same branch cut as :func:`log`.
ru: Вернуть квадратный корень из *x*. Он имеет тот же разрез ветки, что и :func:`log`.

source: Trigonometric functions
ru: Тригонометрические функции

source: Return the arc sine of *x*. This has the same branch cuts as :func:`acos`.
ru: Возвращает арксинус *x*. Он имеет те же ветки, что и :func:`acos`.

source: Return the cosine of *x*.
ru: Возвращает косинус *x*.

source: Return the sine of *x*.
ru: Возвращает синус *x*.

source: Return the tangent of *x*.
ru: Возвращает тангенс *х*.

source: Hyperbolic functions
ru: Гиперболические функции

source: Return the hyperbolic cosine of *x*.
ru: Верните гиперболический косинус *x*.

source: Return the hyperbolic sine of *x*.
ru: Верните гиперболический синус *x*.

source: Return the hyperbolic tangent of *x*.
ru: Возвращает гиперболический тангенс *x*.

source: Classification functions
ru: Классифицирующие функции

source: Return ``True`` if both the real and imaginary parts of *x* are finite, and ``False`` otherwise.
ru: Возвращайте ``True``, если и действительная, и мнимая части *x* конечны, и ``False`` в противном случае.

source: Return ``True`` if either the real or the imaginary part of *x* is an infinity, and ``False`` otherwise.
ru: Возвращайте ``True``, если действительная или мнимая часть *x* равна бесконечности, и ``False`` в противном случае.

source: Return ``True`` if either the real or the imaginary part of *x* is a NaN, and ``False`` otherwise.
ru: Возвращайте ``True``, если действительная или мнимая часть *x* является NaN, и ``False`` в противном случае.

source: Return ``True`` if the values *a* and *b* are close to each other and ``False`` otherwise.
ru: Возвращайте ``True``, если значения *a* и *b* близки друг к другу, и ``False`` в противном случае.

source: Whether or not two values are considered close is determined according to given absolute and relative tolerances.
ru: Считаются ли два значения близкими, определяется в соответствии с заданными абсолютными и относительными допусками.

source: *rel_tol* is the relative tolerance -- it is the maximum allowed difference between *a* and *b*, relative to the larger absolute value of *a* or *b*. For example, to set a tolerance of 5%, pass ``rel_tol=0.05``. The default tolerance is ``1e-09``, which assures that the two values are the same within about 9 decimal digits. *rel_tol* must be greater than zero.
ru: *rel_tol* — это относительный допуск — это максимально допустимая разница между *a* и *b* относительно большего абсолютного значения *a* или *b*. Например, чтобы установить допуск 5 %, укажите rel_tol=0,05. Допуск по умолчанию — «1e-09», который гарантирует, что два значения одинаковы в пределах примерно 9 десятичных цифр. *rel_tol* должно быть больше нуля.

source: *abs_tol* is the minimum absolute tolerance -- useful for comparisons near zero. *abs_tol* must be at least zero.
ru: *abs_tol* — это минимальный абсолютный допуск, полезный для сравнений вблизи нуля. *abs_tol* должно быть не меньше нуля.

source: If no errors occur, the result will be: ``abs(a-b) <= max(rel_tol * max(abs(a), abs(b)), abs_tol)``.
ru: Если ошибок не возникнет, результатом будет: ``abs(ab) <= max(rel_tol * max(abs(a), abs(b)), abs_tol)``.

source: The IEEE 754 special values of ``NaN``, ``inf``, and ``-inf`` will be handled according to IEEE rules. Specifically, ``NaN`` is not considered close to any other value, including ``NaN``. ``inf`` and ``-inf`` are only considered close to themselves.
ru: Специальные значения IEEE 754 NaN, inf и -inf будут обрабатываться в соответствии с правилами IEEE. В частности, NaN не считается близким к какому-либо другому значению, включая NaN. ``inf`` и ``-inf`` считаются только близкими к себе.

source: :pep:`485` -- A function for testing approximate equality
ru: :pep:`485` -- Функция для проверки приблизительного равенства

source: Constants
ru: Константы

source: The mathematical constant *π*, as a float.
ru: Математическая константа *π* в виде числа с плавающей запятой.

source: The mathematical constant *e*, as a float.
ru: Математическая константа *e* в виде числа с плавающей запятой.

source: The mathematical constant *τ*, as a float.
ru: Математическая константа *τ* в виде числа с плавающей запятой.

source: Floating-point positive infinity. Equivalent to ``float('inf')``.
ru: Положительная бесконечность с плавающей запятой. Эквивалентно ``float('inf')``.

source: Complex number with zero real part and positive infinity imaginary part. Equivalent to ``complex(0.0, float('inf'))``.
ru: Комплексное число с нулевой действительной частью и положительной бесконечностью мнимой части. Эквивалент ``complex(0.0, float('inf'))``.

source: A floating-point "not a number" (NaN) value. Equivalent to ``float('nan')``.
ru: Значение с плавающей запятой, не являющееся числом (NaN). Эквивалентно ``float('nan')``.

source: Complex number with zero real part and NaN imaginary part. Equivalent to ``complex(0.0, float('nan'))``.
ru: Комплексное число с нулевой действительной частью и мнимой частью NaN. Эквивалент ``complex(0.0, float('nan'))``.

source: Note that the selection of functions is similar, but not identical, to that in module :mod:`math`. The reason for having two modules is that some users aren't interested in complex numbers, and perhaps don't even know what they are. They would rather have ``math.sqrt(-1)`` raise an exception than return a complex number. Also note that the functions defined in :mod:`cmath` always return a complex number, even if the answer can be expressed as a real number (in which case the complex number has an imaginary part of zero).
ru: Обратите внимание, что выбор функций аналогичен, но не идентичен выбору в модуле :mod:`math`. Причина наличия двух модулей заключается в том, что некоторые пользователи не интересуются комплексными числами и, возможно, даже не знают, что это такое. Они предпочли бы, чтобы math.sqrt(-1) вызывал исключение, а не возвращал комплексное число. Также обратите внимание, что функции, определенные в :mod:`cmath`, всегда возвращают комплексное число, даже если ответ может быть выражен действительным числом (в этом случае комплексное число имеет мнимую часть нуля).

source: A note on branch cuts: They are curves along which the given function fails to be continuous. They are a necessary feature of many complex functions. It is assumed that if you need to compute with complex functions, you will understand about branch cuts. Consult almost any (not too elementary) book on complex variables for enlightenment. For information of the proper choice of branch cuts for numerical purposes, a good reference should be the following:
ru: Примечание о разрезах ветвей: это кривые, вдоль которых данная функция не может быть непрерывной. Они являются необходимой особенностью многих сложных функций. Предполагается, что если вам нужно выполнять вычисления со сложными функциями, вы поймете, что такое разрезы ветвей. Чтобы получить представление, обратитесь практически к любой (не слишком элементарной) книге по комплексным переменным. Для получения информации о правильном выборе разрезов ветвей для численных целей хорошим справочным материалом может быть следующее:

source: Kahan, W: Branch cuts for complex elementary functions; or, Much ado about nothing's sign bit. In Iserles, A., and Powell, M. (eds.), The state of the art in numerical analysis. Clarendon Press (1987) pp165--211.
ru: Кахан, В.: Разрезы ветвей для сложных элементарных функций; или «Много шума из ничего». В книге Изерлес А. и Пауэлл М. (ред.), Современное состояние численного анализа. Кларендон Пресс (1987), стр. 165–211.
