Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/collections.po
Languages: es_es, ru

source: If the insertion would cause a bounded deque to grow beyond *maxlen*, an :exc:`IndexError` is raised.
es_es: Si la inserción hace que un deque acotado crezca más allá de *maxlen*, se genera un mensaje :exc:`IndexError`.
ru: Если вставка приведет к тому, что ограниченная дека выйдет за пределы *maxlen*, выдается ошибка :exc:`IndexError`.

source: Remove and return an element from the right side of the deque. If no elements are present, raises an :exc:`IndexError`.
es_es: Elimina y devuelve un elemento del lado derecho del deque. Si no hay ningún elemento, se genera un mensaje :exc:`IndexError`.
ru: Удалить и вернуть элемент из правой части двухсторонней очереди. Если элементы отсутствуют, выдается :exc:`IndexError`.

source: Remove and return an element from the left side of the deque. If no elements are present, raises an :exc:`IndexError`.
es_es: Elimina y devuelve un elemento del lado izquierdo del deque. Si no hay ningún elemento, se genera un mensaje :exc:`IndexError`.
ru: Удалить и вернуть элемент из левой части двухсторонней очереди. Если элементы отсутствуют, выдается :exc:`IndexError`.

source: Remove the first occurrence of *value*. If not found, raises a :exc:`ValueError`.
es_es: Elimina la primera aparición de *valor*. Si no se encuentra, emite un mensaje :exc:`ValueError`.
ru: Удалите первое вхождение *значения*. Если не найден, выдает :exc:`ValueError`.

source: Reverse the elements of the deque in-place and then return ``None``.
es_es: Invierte los elementos del deque en su lugar y luego devuelve ``None``.
ru: Поменяйте местами элементы двухсторонней очереди, а затем верните None.

source: Rotate the deque *n* steps to the right. If *n* is negative, rotate to the left.
es_es: Gira el deque *n* pasos a la derecha. Si *n* es negativo, gira a la izquierda.
ru: Поверните дек *n* шагов вправо. Если *n* отрицательно, поверните влево.

source: When the deque is not empty, rotating one step to the right is equivalent to ``d.appendleft(d.pop())``, and rotating one step to the left is equivalent to ``d.append(d.popleft())``.
es_es: Cuando el deque no está vacío, girar un paso a la derecha equivale a ``d.appendleft(d.pop())``, y girar un paso a la izquierda equivale a ``d.append(d.popleft())``.
ru: Когда дек не пуст, поворот на один шаг вправо эквивалентен ``d.appendleft(d.pop())``, а поворот на один шаг влево эквивалентен ``d.append(d.popleft) ())``.

source: Deque objects also provide one read-only attribute:
es_es: Los objetos Deque también proporcionan un atributo de sólo lectura:
ru: Объекты Deque также предоставляют один атрибут только для чтения:

source: Maximum size of a deque or ``None`` if unbounded.
es_es: Tamaño máximo de un deque o ``None`` si no tiene límite.
ru: Максимальный размер дека или «Нет», если он неограничен.

source: In addition to the above, deques support iteration, pickling, ``len(d)``, ``reversed(d)``, ``copy.copy(d)``, ``copy.deepcopy(d)``, membership testing with the :keyword:`in` operator, and subscript references such as ``d[0]`` to access the first element. Indexed access is *O*\ (1) at both ends but slows to *O*\ (*n*) in the middle. For fast random access, use lists instead.
es_es: Además de lo anterior, los deques admiten iteración, decapado, ``len(d)``, ``reversed(d)``, ``copy.copy(d)``, ``copy.deepcopy(d)``, comprobación de pertenencia con el operador :keyword:`in`, y referencias de subíndice como ``d[0]`` para acceder al primer elemento. El acceso indexado es *O* (1) en ambos extremos, pero se ralentiza a *O* (*n*) en el medio. Para un acceso aleatorio rápido, utilice listas.
ru: В дополнение к вышесказанному, деки поддерживают итерацию, травление, ``len(d)``, ``reversed(d)``, ``copy.copy(d)``, ``copy.deepcopy(d)` `, проверка членства с помощью оператора :keyword:`in` и ссылки на индексы, такие как ``d[0]`` для доступа к первому элементу. Индексированный доступ равен *O*\ (1) на обоих концах, но замедляется до *O*\ (*n*) в середине. Для быстрого произвольного доступа используйте вместо этого списки.

source: Starting in version 3.5, deques support ``__add__()``, ``__mul__()``, and ``__imul__()``.
es_es: A partir de la versión 3.5, las deques admiten ``__add__()``, ``__mul__()``, y ``__imul__()``.
ru: Начиная с версии 3.5, деки поддерживают ``__add__()``, ``__mul__()`` и ``__imul__()``.

source: Example:
es_es: Ejemplo:
ru: Пример:

source: >>> from collections import deque >>> d = deque('ghi') # make a new deque with three items >>> for elem in d: # iterate over the deque's elements ... print(elem.upper()) G H I >>> d.append('j') # add a new entry to the right side >>> d.appendleft('f') # add a new entry to the left side >>> d # show the representation of the deque deque(['f', 'g', 'h', 'i', 'j']) >>> d.pop() # return and remove the rightmost item 'j' >>> d.popleft() # return and remove the leftmost item 'f' >>> list(d) # list the contents of the deque ['g', 'h', 'i'] >>> d[0] # peek at leftmost item 'g' >>> d[-1] # peek at rightmost item 'i' >>> list(reversed(d)) # list the contents of a deque in reverse ['i', 'h', 'g'] >>> 'h' in d # search the deque True >>> d.extend('jkl') # add multiple elements at once >>> d deque(['g', 'h', 'i', 'j', 'k', 'l']) >>> d.rotate(1) # right rotation >>> d deque(['l', 'g', 'h', 'i', 'j', 'k']) >>> d.rotate(-1) # left rotation >>> d deque(['g', 'h', 'i', 'j', 'k', 'l']) >>> deque(reversed(d)) # make a new deque in reverse order deque(['l', 'k', 'j', 'i', 'h', 'g']) >>> d.clear() # empty the deque >>> d.pop() # cannot pop from an empty deque Traceback (most recent call last): File "<pyshell#6>", line 1, in -toplevel- d.pop() IndexError: pop from an empty deque >>> d.extendleft('abc') # extendleft() reverses the input order >>> d deque(['c', 'b', 'a'])
es_es: >>> from collections import deque >>> d = deque('ghi') # crea un nuevo deque con tres elementos >>> for elem in d: # iterar sobre los elementos del deque ... print(elem.upper()) G H I >>> d.append('j') # añade una nueva entrada al lado derecho >>> d.appendleft('f') # añade una nueva entrada al lado izquierdo >>> d # mostrar la representación del deque deque(['f', 'g', 'h', 'i', 'j']) >>> d.pop() # devuelve y elimina el elemento situado más a la derecha 'j' >>> d.popleft() # devuelve y elimina el elemento situado más a la izquierda 'f' >>> list(d) # lista el contenido del deque ['g', 'h', 'i'] >>> d[0] # mira el elemento más a la izquierda 'g' >>> d[-1] # mira el elemento más a la derecha 'i' >>> list(inversed(d)) # lista el contenido de un deque al revés ['i', 'h', 'g'] >>> 'h' in d # busca en el deque True >>> d.extend('jkl') # añade múltiples elementos a la vez >>> d deque(['g', 'h', 'i', 'j', 'k', 'l']) >>> d.rotate(1) # rotación a la derecha >>> d deque(['l', 'g', 'h', 'i', 'j', 'k']) >>> d.rotate(-1) # rotación izquierda >>> d deque(['g', 'h', 'i', 'j', 'k', 'l']) >>> deque(invertido(d)) # crea un nuevo deque en orden inverso deque(['l', 'k', 'j', 'i', 'h', 'g']) >>> d.clear() # vacía el deque >>> d.pop() # no puede salir de un deque vacío Traceback (última llamada más reciente): File "<pyshell#6>", line 1, in -toplevel- d.pop() IndexError: pop from an empty deque >>> d.extendleft('abc') # extendleft() invierte el orden de entrada >>> d deque(['c', 'b', 'a'])

source: :class:`deque` Recipes
es_es: :class:`deque` Recetas
ru: Рецепты :class:`deque`

source: This section shows various approaches to working with deques.
es_es: Esta sección muestra varios enfoques para trabajar con deques.
ru: В этом разделе показаны различные подходы к работе с деками.

source: Bounded length deques provide functionality similar to the ``tail`` filter in Unix::
es_es: Los deques de longitud limitada proporcionan una funcionalidad similar al filtro ``tail`` de Unix::
ru: Деки ограниченной длины предоставляют функциональность, аналогичную фильтру «хвост» в Unix:

source: Another approach to using deques is to maintain a sequence of recently added elements by appending to the right and popping to the left::
es_es: Otra forma de utilizar deques es mantener una secuencia de elementos añadidos recientemente añadiendo a la derecha y saltando a la izquierda::
ru: Другой подход к использованию деков — поддерживать последовательность недавно добавленных элементов путем добавления справа и удаления слева:

source: A `round-robin scheduler <https://en.wikipedia.org/wiki/Round-robin_scheduling>`_ can be implemented with input iterators stored in a :class:`deque`. Values are yielded from the active iterator in position zero. If that iterator is exhausted, it can be removed with :meth:`~deque.popleft`; otherwise, it can be cycled back to the end with the :meth:`~deque.rotate` method::
es_es: Se puede implementar un programador `round-robin <https://en.wikipedia.org/wiki/Round-robin_scheduling>`_ con iteradores de entrada almacenados en un :class:`deque`. Los valores se obtienen del iterador activo en la posición cero. Si ese iterador se agota, se puede eliminar con :meth:`~deque.popleft`; de lo contrario, se puede volver al final con el método :meth:`~deque.rotate`::
ru: `Планировщик циклического перебора <https://en.wikipedia.org/wiki/Round-robin_scheduling>`_ может быть реализован с помощью входных итераторов, хранящихся в :class:`deque`. Значения получаются из активного итератора в нулевой позиции. Если этот итератор исчерпан, его можно удалить с помощью :meth:`~deque.popleft`; в противном случае его можно вернуться к концу с помощью метода :meth:`~deque.rotate`::

source: def roundrobin(*iterables): "roundrobin('ABC', 'D', 'EF') --> A D E B F C" iterators = deque(map(iter, iterables)) while iterators: try: while True: yield next(iterators[0]) iterators.rotate(-1) except StopIteration: # Remove an exhausted iterator. iterators.popleft()
es_es: def roundrobin(*iterables): "roundrobin('ABC', 'D', 'EF') --> A D E B F C" iterators = deque(map(iter, iterables)) while iterators: try: while True: yield next(iterators[0]) iterators.rotate(-1) except StopIteration: #Elimina un iterador agotado. iterators.popleft()

source: The :meth:`~deque.rotate` method provides a way to implement :class:`deque` slicing and deletion. For example, a pure Python implementation of ``del d[n]`` relies on the ``rotate()`` method to position elements to be popped::
es_es: El método :meth:`~deque.rotate` proporciona una forma de implementar el troceado y borrado de :class:`deque`. Por ejemplo, una implementación pura en Python de ``del d[n]`` se basa en el método ``rotate()`` para posicionar los elementos que se van a rebanar::
ru: Метод :meth:`~deque.rotate` предоставляет способ реализации нарезки и удаления :class:`deque`. Например, реализация del d[n]`` на чистом Python использует метод Rotate() для позиционирования элементов, которые необходимо вытолкнуть:

source: To implement :class:`deque` slicing, use a similar approach applying :meth:`~deque.rotate` to bring a target element to the left side of the deque. Remove old entries with :meth:`~deque.popleft`, add new entries with :meth:`~deque.extend`, and then reverse the rotation. With minor variations on that approach, it is easy to implement Forth style stack manipulations such as ``dup``, ``drop``, ``swap``, ``over``, ``pick``, ``rot``, and ``roll``.
es_es: Para implementar :class:`deque` slicing, utilice un enfoque similar aplicando :meth:`~deque.rotate` para llevar un elemento de destino al lado izquierdo del deque. Elimine las entradas antiguas con :meth:`~deque.popleft`, añada entradas nuevas con :meth:`~deque.extend`, y luego invierta la rotación. Con pequeñas variaciones de este enfoque, es fácil implementar manipulaciones de pila al estilo Forth como ``dup``, ``drop``, ``swap``, ``over``, ``pick``, ``rot``, y ``roll``.
ru: Чтобы реализовать нарезку :class:`deque`, используйте аналогичный подход, применяя :meth:`~deque.rotate`, чтобы переместить целевой элемент в левую часть дека. Удалите старые записи с помощью :meth:`~deque.popleft`, добавьте новые записи с помощью :meth:`~deque.extend`, а затем измените вращение. С небольшими вариациями этого подхода легко реализовать такие манипуляции со стеком в стиле Форта, как ``dup``, ``drop``, ``swap``, ``over``, ``pick``, `` гниль`` и ``ролл``.

source: :class:`defaultdict` objects
es_es: :class:`defaultdict` objetos
ru: Объекты :class:`defaultdict`

source: Return a new dictionary-like object. :class:`defaultdict` is a subclass of the built-in :class:`dict` class. It overrides one method and adds one writable instance variable. The remaining functionality is the same as for the :class:`dict` class and is not documented here.
es_es: Devuelve un nuevo objeto tipo diccionario. :class:`defaultdict` es una subclase de la clase incorporada :class:`dict`. Sobrescribe un método y añade una variable de instancia escribible. El resto de la funcionalidad es la misma que para la clase :class:`dict` y no se documenta aquí.
ru: Верните новый объект, подобный словарю. :class:`defaultdict` является подклассом встроенного класса :class:`dict`. Он переопределяет один метод и добавляет одну записываемую переменную экземпляра. Остальная функциональность такая же, как и у класса :class:`dict`, и здесь не документирована.

source: The first argument provides the initial value for the :attr:`default_factory` attribute; it defaults to ``None``. All remaining arguments are treated the same as if they were passed to the :class:`dict` constructor, including keyword arguments.
es_es: El primer argumento proporciona el valor inicial del atributo :attr:`default_factory`; por defecto es ``None``. Todos los argumentos restantes se tratan igual que si se pasaran al constructor :class:`dict`, incluidos los argumentos de palabra clave.
ru: Первый аргумент предоставляет начальное значение атрибута :attr:`default_factory`; по умолчанию установлено значение «Нет». Все остальные аргументы обрабатываются так же, как если бы они были переданы конструктору :class:`dict`, включая аргументы ключевых слов.

source: :class:`defaultdict` objects support the following method in addition to the standard :class:`dict` operations:
es_es: :class:`defaultdict` admiten el siguiente método además de las operaciones estándar de :class:`dict`:
ru: Объекты :class:`defaultdict` поддерживают следующий метод в дополнение к стандартным операциям :class:`dict`:

source: If the :attr:`default_factory` attribute is ``None``, this raises a :exc:`KeyError` exception with the *key* as argument.
es_es: Si el atributo :attr:`default_factory` es ``None``, esto lanza una excepción :exc:`KeyError` con la *clave* como argumento.
ru: Если атрибут :attr:`default_factory` имеет значение ``None``, это вызывает исключение :exc:`KeyError` с аргументом *key*.

source: If :attr:`default_factory` is not ``None``, it is called without arguments to provide a default value for the given *key*, this value is inserted in the dictionary for the *key*, and returned.
es_es: Si :attr:`default_factory` no es ``None``, se llama sin argumentos para proporcionar un valor por defecto para la *clave* dada, este valor se inserta en el diccionario para la *clave*, y se devuelve.
ru: Если :attr:`default_factory` не равен ``None``, он вызывается без аргументов, чтобы предоставить значение по умолчанию для данного *ключа*, это значение вставляется в словарь для *ключа* и возвращается.

source: If calling :attr:`default_factory` raises an exception this exception is propagated unchanged.
es_es: Si al llamar a :attr:`default_factory` se produce una excepción, ésta se propaga sin cambios.
ru: Если вызов :attr:`default_factory` вызывает исключение, это исключение распространяется без изменений.

source: This method is called by the :meth:`~object.__getitem__` method of the :class:`dict` class when the requested key is not found; whatever it returns or raises is then returned or raised by :meth:`~object.__getitem__`.
es_es: Este método se llama por el método :meth:`~object.__getitem__` de la clase :class:`dict` cuando no se encuentra la clave solicitada; lo que devuelva o plantee será entonces devuelto o planteado por :meth:`~object.__getitem__`.
ru: Этот метод вызывается методом :meth:`~object.__getitem__` класса :class:`dict`, когда запрошенный ключ не найден; все, что он возвращает или генерирует, затем возвращается или вызывается :meth:`~object.__getitem__`.

source: Note that :meth:`__missing__` is *not* called for any operations besides :meth:`~object.__getitem__`. This means that :meth:`get` will, like normal dictionaries, return ``None`` as a default rather than using :attr:`default_factory`.
es_es: Observar que :meth:`__missing__` *no* se llama para ninguna operación aparte de :meth:`~object.__getitem__`. Esto significa que :meth:`get`, al igual que los diccionarios normales, devolverá ``None`` por defecto en lugar de utilizar :attr:`default_factory`.
ru: Обратите внимание, что :meth:`__missing__` *не* вызывается ни для каких операций, кроме :meth:`~object.__getitem__`. Это означает, что :meth:`get`, как и обычные словари, будет возвращать ``None`` по умолчанию, а не использовать :attr:`default_factory`.

source: :class:`defaultdict` objects support the following instance variable:
es_es: :class:`defaultdict` admiten la siguiente variable de instancia:
ru: Объекты :class:`defaultdict` поддерживают следующую переменную экземпляра:

source: This attribute is used by the :meth:`__missing__` method; it is initialized from the first argument to the constructor, if present, or to ``None``, if absent.
es_es: Este atributo es utilizado por el método :meth:`__missing__`; se inicializa a partir del primer argumento del constructor, si está presente, o a ``None``, si está ausente.
ru: Этот атрибут используется методом :meth:`__missing__`; он инициализируется первым аргументом конструктора, если он присутствует, или значением None, если он отсутствует.

source: Added merge (``|``) and update (``|=``) operators, specified in :pep:`584`.
es_es: Se han añadido los operadores merge (``|``) y update (``|=``), especificados en :pep:`584`.
ru: Добавлены операторы слияния (``|``) и обновления (``|=``), указанные в :pep:`584`.

source: :class:`defaultdict` Examples
es_es: :class:`defaultdict` Ejemplos
ru: :class:`defaultdict` примеры

source: Using :class:`list` as the :attr:`~defaultdict.default_factory`, it is easy to group a sequence of key-value pairs into a dictionary of lists:
es_es: Utilizando :class:`list` como :attr:`~defaultdict.default_factory`, es fácil agrupar una secuencia de pares clave-valor en un diccionario de listas:
ru: Используя :class:`list` в качестве :attr:`~defaultdict.default_factory`, можно легко сгруппировать последовательность пар ключ-значение в словарь списков:

source: Setting the :attr:`~defaultdict.default_factory` to :class:`int` makes the :class:`defaultdict` useful for counting (like a bag or multiset in other languages):
es_es: Configurar :attr:`~defaultdict.default_factory` como :class:`int` hace que :class:`defaultdict` sea útil para contar (como una bolsa o un multiconjunto en otros idiomas):
ru: Установка :attr:`~defaultdict.default_factory` в :class:`int` делает :class:`defaultdict` полезным для подсчета (как мешок или мультимножество на других языках):

source: When a letter is first encountered, it is missing from the mapping, so the :attr:`~defaultdict.default_factory` function calls :func:`int` to supply a default count of zero. The increment operation then builds up the count for each letter.
es_es: Cuando se encuentra una letra por primera vez, falta en la asignación, por lo que la función :attr:`~defaultdict.default_factory` llama a :func:`int` para proporcionar un recuento por defecto de cero. A continuación, la operación de incremento incrementa el recuento de cada letra.
ru: Когда буква встречается впервые, она отсутствует в сопоставлении, поэтому функция :attr:`~defaultdict.default_factory` вызывает :func:`int`, чтобы предоставить нулевой счетчик по умолчанию. Затем операция приращения увеличивает счетчик для каждой буквы.

source: The function :func:`int` which always returns zero is just a special case of constant functions. A faster and more flexible way to create constant functions is to use a lambda function which can supply any constant value (not just zero):
es_es: La función :func:`int`, que siempre devuelve cero, es sólo un caso especial de las funciones constantes. Una forma más rápida y flexible de crear funciones constantes es utilizar una función lambda que pueda suministrar cualquier valor constante (no sólo cero):
ru: Функция :func:`int`, которая всегда возвращает ноль, является частным случаем константных функций. Более быстрый и гибкий способ создания константных функций — использовать лямбда-функцию, которая может предоставлять любое постоянное значение (не только ноль):

source: Setting the :attr:`~defaultdict.default_factory` to :class:`set` makes the :class:`defaultdict` useful for building a dictionary of sets:
es_es: Si se establece :attr:`~defaultdict.default_factory` en :class:`set`, :class:`defaultdict` resulta útil para construir un diccionario de conjuntos:
ru: Установка для :attr:`~defaultdict.default_factory` значения :class:`set` делает :class:`defaultdict` полезным для создания словаря множеств:

source: :func:`namedtuple` Factory Function for Tuples with Named Fields
es_es: :func:`namedtuple` Función de fábrica para tuplas con campos con nombre
ru: :func:`namedtuple` фабрика функций для кортежей с именованными полями

source: Named tuples assign meaning to each position in a tuple and allow for more readable, self-documenting code. They can be used wherever regular tuples are used, and they add the ability to access fields by name instead of position index.
es_es: Las tuplas con nombre asignan un significado a cada posición de una tupla y permiten un código más legible y autodocumentado. Pueden utilizarse siempre que se empleen tuplas normales, y añaden la posibilidad de acceder a los campos por su nombre en lugar de por el índice de posición.
ru: Именованные кортежи присваивают значение каждой позиции в кортеже и обеспечивают более читаемый самодокументированный код. Они могут быть использованы там же, гже используются обычные кортежи и добавляют способность доступа к полю по имени вместо индекса позиции.

source: Returns a new tuple subclass named *typename*. The new subclass is used to create tuple-like objects that have fields accessible by attribute lookup as well as being indexable and iterable. Instances of the subclass also have a helpful docstring (with typename and field_names) and a helpful :meth:`__repr__` method which lists the tuple contents in a ``name=value`` format.
es_es: Devuelve una nueva subclase de tupla llamada *typename*. La nueva subclase se utiliza para crear objetos tipo tupla que tienen campos accesibles mediante la búsqueda de atributos, además de ser indexables e iterables. Las instancias de la subclase también tienen un útil docstring (con typename y field_names) y un útil método :meth:`__repr__` que lista el contenido de la tupla en un formato ``name=value``.
ru: Возвращает новый подкласс кортежей с именем *typename*. Новый подкласс используется для создания кортеж-подобных объектов, которые имеют поля, доступные для поиска атрибутов, также, как и индексируемые и итерируемые. Экземпляры подкласса также имеют полезную строку (с typename и field_name) и полезный метод :meth:`__repr__`, который перечисляет содержимое кортежа в формате ``name=value``.
