Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/collections.po
Languages: es_es, ru

source: The *field_names* are a sequence of strings such as ``['x', 'y']``. Alternatively, *field_names* can be a single string with each fieldname separated by whitespace and/or commas, for example ``'x y'`` or ``'x, y'``.
es_es: Los *nombres_de_campo* son una secuencia de cadenas como ``['x', 'y']``. Alternativamente, *field_names* puede ser una sola cadena con cada nombre de campo separado por espacios en blanco y/o comas, por ejemplo ``'x y'`` o ``'x, y'``.
ru: *field_names* это последовательность строк типа ``['x', 'y']``. Кроме того, *field_names* может быть одной строкой с каждым именем поля, разделенным пробелами и/или запятыми, например ``'x y'`` или ``'x, y'``.

source: Any valid Python identifier may be used for a fieldname except for names starting with an underscore. Valid identifiers consist of letters, digits, and underscores but do not start with a digit or underscore and cannot be a :mod:`keyword` such as *class*, *for*, *return*, *global*, *pass*, or *raise*.
es_es: Cualquier identificador válido de Python puede usarse como nombre de campo, excepto los nombres que empiecen por guión bajo. Los identificadores válidos constan de letras, dígitos y guiones bajos, pero no comienzan con un dígito o guión bajo y no pueden ser :mod:`keyword` como *class*, *for*, *return*, *global*, *pass* o *raise*.
ru: Для имени поля может использоваться любой допустимый идентификатор Python, за исключением имен, начинающихся с символа подчеркивания. Допустимые идентификаторы состоят из букв, подчеркивания, но не начинаются с цифры или подчеркивания и не могут быть ключевым словом :mod:`keyword`, таким как *class*, *for*, *return*, *global*, *pass*, or *raise*.

source: If *rename* is true, invalid fieldnames are automatically replaced with positional names. For example, ``['abc', 'def', 'ghi', 'abc']`` is converted to ``['abc', '_1', 'ghi', '_3']``, eliminating the keyword ``def`` and the duplicate fieldname ``abc``.
es_es: Si *rename* es verdadero, los nombres de campo no válidos se sustituyen automáticamente por nombres posicionales. Por ejemplo, ``['abc', 'def', 'ghi', 'abc']`` se convierte en ``['abc', '_1', 'ghi', '_3']``, eliminando la palabra clave ``def`` y el nombre de campo duplicado ``abc``.
ru: Если *rename* имеет значение true, недопустимые имена полей автоматически заменяются позиционными именами. Например, ``['abc', 'def', 'ghi', 'abc']`` преобразуется в ``['abc', '_1', 'ghi', '_3']``, исключая ключевое слово ``def`` и повторяющееся имя поля ``abc``.

source: *defaults* can be ``None`` or an :term:`iterable` of default values. Since fields with a default value must come after any fields without a default, the *defaults* are applied to the rightmost parameters. For example, if the fieldnames are ``['x', 'y', 'z']`` and the defaults are ``(1, 2)``, then ``x`` will be a required argument, ``y`` will default to ``1``, and ``z`` will default to ``2``.
es_es: *defaults* puede ser ``None`` o un :term:`iterable` de valores por defecto. Dado que los campos con un valor predeterminado deben ir después de los campos sin valor predeterminado, los *valores predeterminados* se aplican a los parámetros situados más a la derecha. Por ejemplo, si los nombres de campo son ``['x', 'y', 'z']`` y los valores por defecto son ``(1, 2)``, entonces ``x`` será un argumento obligatorio, ``y`` será por defecto ``1``, y ``z`` será por defecto ``2``.
ru: *defaults* может быть ``None`` или :term:`iterable` значений по умолчанию. Поскольку поля со значением по умолчанию должны идти после полей без значений по умолчанию, *значения по умолчанию* применяются к самым правым параметрам. Например, если имена полей — ``['x', 'y', 'z']`` и значения по умолчанию: ``(1, 2)``, то ``x`` будет обязательным аргументом, ``y`` будет иметь значение по умолчанию ``1``, а ``z`` будет иметь значение по умолчанию ``2``.

source: If *module* is defined, the :attr:`~type.__module__` attribute of the named tuple is set to that value.
es_es: Si se define *module*, el atributo :attr:`~type.__module__` de la tupla nombrada se establece en ese valor.
ru: Если *module* определен, атрибуту :attr:`~type.__module__` именованного кортежа присваивается это значение.

source: Named tuple instances do not have per-instance dictionaries, so they are lightweight and require no more memory than regular tuples.
es_es: Las instancias de tuplas con nombre no tienen diccionarios por instancia, por lo que son ligeras y no requieren más memoria que las tuplas normales.
ru: Именованные экземпляры кортежей не имеют словарей для каждого экземпляра, поэтому они легкие и требуют не больше памяти, чем обычные кортежи.

source: To support pickling, the named tuple class should be assigned to a variable that matches *typename*.
es_es: Para soportar el pickling, la clase de tupla nombrada debe ser asignada a una variable que coincida con *typename*.
ru: Для поддержки травления именованный класс кортежа должен быть присвоен переменной, соответствующей *typename*.

source: Added support for *rename*.
es_es: Añadido soporte para *renombrar*.
ru: Добавлена поддержка *rename*.

source: The *verbose* and *rename* parameters became :ref:`keyword-only arguments <keyword-only_parameter>`.
es_es: Los parámetros *verbose* y *rename* pasan a ser :ref:`keyword-only <keyword-only_parameter>`.
ru: Параметры *verbose* и *rename* стали :ref:`аргументами только для ключевых слов <keyword-only_parameter>`.

source: Added the *module* parameter.
es_es: Se ha añadido el parámetro *module*.
ru: Добавлен параметр *module*.

source: Removed the *verbose* parameter and the :attr:`_source` attribute.
es_es: Eliminado el parámetro *verbose* y el atributo :attr:`_source`.
ru: Удален параметр *verbose* и атрибут :attr:`_source`.

source: Added the *defaults* parameter and the :attr:`_field_defaults` attribute.
es_es: Se ha añadido el parámetro *defaults* y el atributo :attr:`_field_defaults`.
ru: Добавлен параметр *defaults* и атрибут :attr:`_field_defaults`.

source: >>> # Basic example >>> Point = namedtuple('Point', ['x', 'y']) >>> p = Point(11, y=22) # instantiate with positional or keyword arguments >>> p[0] + p[1] # indexable like the plain tuple (11, 22) 33 >>> x, y = p # unpack like a regular tuple >>> x, y (11, 22) >>> p.x + p.y # fields also accessible by name 33 >>> p # readable __repr__ with a name=value style Point(x=11, y=22)
es_es: >>> # Ejemplo básico >>> Point = namedtuple('Point', ['x', 'y']) >>> p = Point(11, y=22) # instanciar con argumentos posicionales o de palabra clave >>> p[0] + p[1] # indexable como la tupla simple (11, 22) 33 >>> x, y = p # descomprimible como una tupla normal >>> x, y (11, 22) >>> p.x + p.y # campos también accesibles por nombre 33 >>> p # readable __repr__ with a name=value style Point(x=11, y=22)

source: Named tuples are especially useful for assigning field names to result tuples returned by the :mod:`csv` or :mod:`sqlite3` modules::
es_es: Las tuplas con nombre son especialmente útiles para asignar nombres de campo a las tuplas de resultados devueltas por los módulos :mod:`csv` o :mod:`sqlite3`::
ru: Именованные кортежи особенно полезны для назначения имен полей к результирующим кортежам, возвращаемым через модули :mod:`csv` или :mod:`sqlite3` modules::

source: In addition to the methods inherited from tuples, named tuples support three additional methods and two attributes. To prevent conflicts with field names, the method and attribute names start with an underscore.
es_es: Además de los métodos heredados de las tuplas, las tuplas con nombre admiten tres métodos y dos atributos adicionales. Para evitar conflictos con los nombres de campo, los nombres de métodos y atributos empiezan por guión bajo.
ru: Помимо методов, унаследованных от кортежей, именованные кортежи поддерживают три дополнительных метода и два атрибута. Чтобы предотвратить конфликты с именами полей, имена методов и атрибутов начинаются с подчеркивания.

source: Class method that makes a new instance from an existing sequence or iterable.
es_es: Método de clase que crea una nueva instancia a partir de una secuencia o iterable existente.
ru: Метод класса создает новый экземпляр класса из существующей последовательности или итерируемого объекта.

source: Return a new :class:`dict` which maps field names to their corresponding values:
es_es: Devuelve un nuevo :class:`dict` que asigna los nombres de campo a sus valores correspondientes:
ru: Верните новый :class:`dict`, который сопоставляет имена полей с соответствующими значениями:

source: Returns an :class:`OrderedDict` instead of a regular :class:`dict`.
es_es: Devuelve un :class:`OrderedDict` en lugar de un :class:`dict` normal.
ru: Возвращает :class:`OrderedDict` вместо обычного :class:`dict`.

source: Returns a regular :class:`dict` instead of an :class:`OrderedDict`. As of Python 3.7, regular dicts are guaranteed to be ordered. If the extra features of :class:`OrderedDict` are required, the suggested remediation is to cast the result to the desired type: ``OrderedDict(nt._asdict())``.
es_es: Devuelve un :class:`dict` regular en lugar de un :class:`OrderedDict`. A partir de Python 3.7, se garantiza que los dicts regulares están ordenados. Si se necesitan las características adicionales de :class:`OrderedDict`, la solución sugerida es convertir el resultado al tipo deseado: ``OrderedDict(nt._asdict())``.
ru: Возвращает обычный :class:`dict` вместо :class:`OrderedDict`. Начиная с Python 3.7, обычные словари гарантированно упорядочиваются. Если требуются дополнительные возможности :class:`OrderedDict`, предлагаемое исправление состоит в том, чтобы привести результат к желаемому типу: ``OrderedDict(nt._asdict())``.

source: Return a new instance of the named tuple replacing specified fields with new values::
es_es: Devuelve una nueva instancia de la tupla nombrada sustituyendo los campos especificados por nuevos valores::
ru: Вернуть новый экземпляр именованного кортежа, заменив указанные поля новыми значениями::

source: Tuple of strings listing the field names. Useful for introspection and for creating new named tuple types from existing named tuples.
es_es: Tupla de cadenas que enumera los nombres de los campos. Útil para la introspección y para crear nuevos tipos de tuplas con nombre a partir de tuplas con nombre existentes.
ru: Кортеж строк, в котором перечислены имена полей. Полезно для самоанализа и создания новых именованных типов кортежей из существующих именованных кортежей.

source: Dictionary mapping field names to default values.
es_es: Diccionario que asigna nombres de campo a valores por defecto.
ru: Сопоставление имен полей словаря со значениями по умолчанию.

source: To retrieve a field whose name is stored in a string, use the :func:`getattr` function:
es_es: Para recuperar un campo cuyo nombre está almacenado en una cadena, utilice la función :func:`getattr`:
ru: Чтобы получить поле, имя которого хранится в строке, используйте функцию :func:`getattr`:

source: To convert a dictionary to a named tuple, use the double-star-operator (as described in :ref:`tut-unpacking-arguments`):
es_es: Para convertir un diccionario en una tupla con nombre, utilice el operador de doble estrella (como se describe en :ref:`tut-unpacking-arguments`):
ru: Чтобы преобразовать словарь в именованный кортеж, используйте оператор двойной звезды (как описано в :ref:`tut-unpacking-arguments`):

source: Since a named tuple is a regular Python class, it is easy to add or change functionality with a subclass. Here is how to add a calculated field and a fixed-width print format:
es_es: Dado que una tupla con nombre es una clase normal de Python, es fácil añadir o cambiar funcionalidades con una subclase. A continuación se muestra cómo añadir un campo calculado y un formato de impresión de ancho fijo:
ru: Поскольку именованный кортеж является обычным классом Python, функциональность легко добавить или изменить с помощью подкласса. Вот как добавить вычисляемое поле и формат печати фиксированной ширины:

source: The subclass shown above sets ``__slots__`` to an empty tuple. This helps keep memory requirements low by preventing the creation of instance dictionaries.
es_es: La subclase mostrada arriba establece ``__slots__`` en una tupla vacía. Esto ayuda a mantener bajos los requisitos de memoria al evitar la creación de diccionarios de instancias.
ru: Показанный выше подкласс устанавливает ``__slots__`` в пустой кортеж. Это помогает снизить требования к памяти, предотвращая создание словарей экземпляров.

source: Subclassing is not useful for adding new, stored fields. Instead, simply create a new named tuple type from the :attr:`~somenamedtuple._fields` attribute:
es_es: La subclase no es útil para añadir nuevos campos almacenados. En su lugar, basta con crear un nuevo tipo de tupla con nombre a partir del atributo :attr:`~somenamedtuple._fields`:
ru: Создание подклассов бесполезно для добавления новых сохраненных полей. Вместо этого просто создайте новый именованный тип кортежа из атрибута :attr:`~somenamedtuple._fields`:

source: Docstrings can be customized by making direct assignments to the ``__doc__`` fields:
es_es: Las docstrings pueden personalizarse realizando asignaciones directas a los campos de ``__doc__``:
ru: Строки документации можно настроить путем прямого присвоения полям ``__doc__``:

source: Property docstrings became writeable.
es_es: Los docstrings de propiedades son ahora escribibles.
ru: Строки документации свойств стали доступны для записи.

source: See :class:`typing.NamedTuple` for a way to add type hints for named tuples. It also provides an elegant notation using the :keyword:`class` keyword::
es_es: Véase :class:`typing.NamedTuple` para una forma de añadir sugerencias de tipo para tuplas con nombre. También proporciona una notación elegante utilizando la palabra clave :keyword:`class`::
ru: См. :class:`typing.NamedTuple`, чтобы узнать, как добавить подсказки типа для именованных кортежей. Он также предоставляет элегантную нотацию с использованием ключевого слова :keyword:`class`::

source: See :meth:`types.SimpleNamespace` for a mutable namespace based on an underlying dictionary instead of a tuple.
es_es: Véase :meth:`types.SimpleNamespace` para un espacio de nombres mutable basado en un diccionario subyacente en lugar de una tupla.
ru: См. :meth:`types.SimpleNamespace` для получения информации об изменяемом пространстве имен, основанном на базовом словаре, а не на кортеже.

source: The :mod:`dataclasses` module provides a decorator and functions for automatically adding generated special methods to user-defined classes.
es_es: El módulo :mod:`dataclasses` proporciona un decorador y funciones para añadir automáticamente métodos especiales generados a clases definidas por el usuario.
ru: Модуль :mod:`dataclasses` предоставляет декоратор и функции для автоматического добавления сгенерированных специальных методов в определяемые пользователем классы.

source: :class:`OrderedDict` objects
es_es: :class:`OrderedDict` objetos
ru: Объекты :class:`OrderedDict`

source: Ordered dictionaries are just like regular dictionaries but have some extra capabilities relating to ordering operations. They have become less important now that the built-in :class:`dict` class gained the ability to remember insertion order (this new behavior became guaranteed in Python 3.7).
es_es: Los diccionarios ordenados son como los diccionarios normales, pero tienen algunas capacidades adicionales relacionadas con las operaciones de ordenación. Se han vuelto menos importantes ahora que la clase incorporada :class:`dict` adquirió la capacidad de recordar el orden de inserción (este nuevo comportamiento se garantizó en Python 3.7).
ru: Упорядоченные словари аналогичны обычным словарям, но имеют некоторые дополнительные возможности, связанные с операциями упорядочивания. Они стали менее важными теперь, когда встроенный класс :class:`dict` получил возможность запоминать порядок вставки (это новое поведение стало гарантированным в Python 3.7).

source: Some differences from :class:`dict` still remain:
es_es: Aún persisten algunas diferencias con respecto a :class:`dict`:
ru: Некоторые отличия от :class:`dict` все еще остаются:

source: The regular :class:`dict` was designed to be very good at mapping operations. Tracking insertion order was secondary.
es_es: El :class:`dict` regular fue diseñado para ser muy bueno en operaciones de mapeo. El seguimiento del orden de inserción era secundario.
ru: Обычный :class:`dict` был разработан, чтобы очень хорошо справляться с операциями сопоставления. Отслеживание заказа на размещение было второстепенным.

source: The :class:`OrderedDict` was designed to be good at reordering operations. Space efficiency, iteration speed, and the performance of update operations were secondary.
es_es: El sitio :class:`OrderedDict` se diseñó para que fuera bueno en las operaciones de reordenación. La eficiencia espacial, la velocidad de iteración y el rendimiento de las operaciones de actualización eran secundarios.
ru: :class:`OrderedDict` был разработан для удобного изменения порядка операций. Эффективность использования пространства, скорость итераций и производительность операций обновления были второстепенными.

source: The :class:`OrderedDict` algorithm can handle frequent reordering operations better than :class:`dict`. As shown in the recipes below, this makes it suitable for implementing various kinds of LRU caches.
es_es: El algoritmo :class:`OrderedDict` puede manejar las operaciones de reordenación frecuentes mejor que :class:`dict`. Como se muestra en las recetas a continuación, esto lo hace adecuado para implementar varios tipos de cachés LRU.
ru: Алгоритм :class:`OrderedDict` может обрабатывать частые операции изменения порядка лучше, чем :class:`dict`. Как показано в рецептах ниже, это делает его подходящим для реализации различных типов кэшей LRU.

source: The equality operation for :class:`OrderedDict` checks for matching order.
es_es: La operación de igualdad para :class:`OrderedDict` comprueba el orden de coincidencia.
ru: Операция равенства для :class:`OrderedDict` проверяет соответствие порядка.

source: A regular :class:`dict` can emulate the order sensitive equality test with ``p == q and all(k1 == k2 for k1, k2 in zip(p, q))``.
es_es: Un :class:`dict` normal puede emular la prueba de igualdad sensible al orden con ``p == q and all(k1 == k2 for k1, k2 in zip(p, q))``.
ru: Обычный :class:`dict` может эмулировать чувствительную к порядку проверку равенства с помощью ``p == q и all(k1 == k2 for k1, k2 in zip(p, q))``.

source: The :meth:`popitem` method of :class:`OrderedDict` has a different signature. It accepts an optional argument to specify which item is popped.
es_es: El método :meth:`popitem` de :class:`OrderedDict` tiene una firma diferente. Acepta un argumento opcional para especificar qué elemento se salta.
ru: Метод :meth:`popitem` класса :class:`OrderedDict` имеет другую сигнатуру. Он принимает необязательный аргумент, указывающий, какой элемент вытаскивается.

source: A regular :class:`dict` can emulate OrderedDict's ``od.popitem(last=True)`` with ``d.popitem()`` which is guaranteed to pop the rightmost (last) item.
es_es: Un :class:`dict` normal puede emular el ``od.popitem(last=True)`` de OrderedDict con ``d.popitem()``, que garantiza la aparición del elemento situado más a la derecha (el último).
ru: Обычный :class:`dict` может эмулировать ``od.popitem(last=True)`` OrderedDict с помощью ``d.popitem()``, который гарантированно выталкивает самый правый (последний) элемент.

source: A regular :class:`dict` can emulate OrderedDict's ``od.popitem(last=False)`` with ``(k := next(iter(d)), d.pop(k))`` which will return and remove the leftmost (first) item if it exists.
es_es: Un :class:`dict` normal puede emular ``od.popitem(last=False)`` de OrderedDict con ``(k := next(iter(d)), d.pop(k))`` que devolverá y eliminará el elemento situado más a la izquierda (el primero) si existe.
ru: Обычный :class:`dict` может эмулировать ``od.popitem(last=False)`` OrderedDict с помощью ``(k := next(iter(d)), d.pop(k))``, который вернет и удалите самый левый (первый) элемент, если он существует.

source: :class:`OrderedDict` has a :meth:`move_to_end` method to efficiently reposition an element to an endpoint.
es_es: :class:`OrderedDict` tiene un método :meth:`move_to_end` para reposicionar eficientemente un elemento a un punto final.
ru: :class:`OrderedDict` имеет метод :meth:`move_to_end` для эффективного перемещения элемента в конечную точку.

source: A regular :class:`dict` can emulate OrderedDict's ``od.move_to_end(k, last=True)`` with ``d[k] = d.pop(k)`` which will move the key and its associated value to the rightmost (last) position.
es_es: Un :class:`dict` normal puede emular el ``od.move_to_end(k, last=True)`` de OrderedDict con ``d[k] = d.pop(k)`` que moverá la clave y su valor asociado a la posición más a la derecha (última).
ru: Обычный :class:`dict` может эмулировать ``od.move_to_end(k, Last=True)`` OrderedDict с ``d[k] = d.pop(k)``, который переместит ключ и связанное с ним значение. в крайнее правое (последнее) положение.

source: A regular :class:`dict` does not have an efficient equivalent for OrderedDict's ``od.move_to_end(k, last=False)`` which moves the key and its associated value to the leftmost (first) position.
es_es: Un :class:`dict` normal no tiene un equivalente eficiente para el ``od.move_to_end(k, last=False)`` de OrderedDict que mueve la clave y su valor asociado a la posición más a la izquierda (primera).
ru: Обычный :class:`dict` не имеет эффективного эквивалента ``od.move_to_end(k,last=False)`` OrderedDict, который перемещает ключ и связанное с ним значение в самую левую (первую) позицию.

source: Until Python 3.8, :class:`dict` lacked a :meth:`__reversed__` method.
es_es: Hasta Python 3.8, :class:`dict` carecía de un método :meth:`__reversed__`.
ru: До Python 3.8 в :class:`dict` не было метода :meth:`__reversed__`.

source: Return an instance of a :class:`dict` subclass that has methods specialized for rearranging dictionary order.
es_es: Devuelve una instancia de una subclase de :class:`dict` que tiene métodos especializados para reordenar el orden del diccionario.
ru: Возвращает экземпляр подкласса :class:`dict`, который имеет методы, специализированные для изменения порядка словаря.

source: The :meth:`popitem` method for ordered dictionaries returns and removes a (key, value) pair. The pairs are returned in :abbr:`LIFO (last-in, first-out)` order if *last* is true or :abbr:`FIFO (first-in, first-out)` order if false.
es_es: El método :meth:`popitem` para diccionarios ordenados devuelve y elimina un par (clave, valor). Los pares se devuelven en orden :abbr:`LIFO (last-in, first-out)` si *last* es verdadero o en orden :abbr:`FIFO (first-in, first-out)` si es falso.
ru: Метод :meth:`popitem` для упорядоченных словарей возвращает и удаляет пару (ключ, значение). Пары возвращаются в порядке :abbr:`LIFO (последний вошел, первый обслужен)`, если *last* имеет значение true, или в порядке :abbr:`FIFO (первым вошел, первым обслужен)`, если значение false.

source: Move an existing *key* to either end of an ordered dictionary. The item is moved to the right end if *last* is true (the default) or to the beginning if *last* is false. Raises :exc:`KeyError` if the *key* does not exist:
es_es: Mueve una *clave* existente a cualquiera de los extremos de un diccionario ordenado. El elemento se mueve al extremo derecho si *last* es verdadero (por defecto) o al principio si *last* es falso. Lanza :exc:`KeyError` si la *clave* no existe:
ru: Переместите существующий *ключ* в любой конец упорядоченного словаря. Элемент перемещается в правый конец, если *last* имеет значение true (по умолчанию), или в начало, если *last* имеет значение false. Вызывает :exc:`KeyError`, если *ключ* не существует:
