Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/collections.po
Languages: es_es, ru

source: In addition to the usual mapping methods, ordered dictionaries also support reverse iteration using :func:`reversed`.
es_es: Además de los métodos de asignación habituales, los diccionarios ordenados también admiten la iteración inversa mediante :func:`reversed`.
ru: В дополнение к обычным методам отображения упорядоченные словари также поддерживают обратную итерацию с использованием :func:`reversed`.

source: Equality tests between :class:`OrderedDict` objects are order-sensitive and are roughly equivalent to ``list(od1.items())==list(od2.items())``.
es_es: Las pruebas de igualdad entre objetos de :class:`OrderedDict` son sensibles al orden y equivalen aproximadamente a ``list(od1.items())==list(od2.items())``.
ru: Тесты на равенство между объектами :class:`OrderedDict` чувствительны к порядку и примерно эквивалентны ``list(od1.items())==list(od2.items())``.

source: Equality tests between :class:`OrderedDict` objects and other :class:`~collections.abc.Mapping` objects are order-insensitive like regular dictionaries. This allows :class:`OrderedDict` objects to be substituted anywhere a regular dictionary is used.
es_es: Las pruebas de igualdad entre objetos :class:`OrderedDict` y otros objetos :class:`~collections.abc.Mapping` son insensibles al orden, como los diccionarios normales. Esto permite sustituir objetos :class:`OrderedDict` en cualquier lugar donde se utilice un diccionario normal.
ru: Тесты на равенство между объектами :class:`OrderedDict` и другими объектами :class:`~collections.abc.Mapping` нечувствительны к порядку, как и обычные словари. Это позволяет заменять объекты :class:`OrderedDict` везде, где используется обычный словарь.

source: The items, keys, and values :term:`views <dictionary view>` of :class:`OrderedDict` now support reverse iteration using :func:`reversed`.
es_es: Los elementos, claves y valores :term:`views <dictionary view>` de :class:`OrderedDict` soportan ahora la iteración inversa utilizando :func:`reversed`.
ru: Элементы, ключи и значения :term:`views <dictionary view>` :class:`OrderedDict` теперь поддерживают обратную итерацию с использованием :func:`reversed`.

source: With the acceptance of :pep:`468`, order is retained for keyword arguments passed to the :class:`OrderedDict` constructor and its :meth:`update` method.
es_es: Con la aceptación de :pep:`468`, se mantiene el orden para los argumentos de palabra clave pasados al constructor :class:`OrderedDict` y a su método :meth:`update`.
ru: При принятии :pep:`468` порядок сохраняется для аргументов ключевых слов, передаваемых конструктору :class:`OrderedDict` и его методу :meth:`update`.

source: :class:`OrderedDict` Examples and Recipes
es_es: :class:`OrderedDict` Ejemplos y recetas
ru: :class:`OrderedDict` Примеры и рецепты

source: It is straightforward to create an ordered dictionary variant that remembers the order the keys were *last* inserted. If a new entry overwrites an existing entry, the original insertion position is changed and moved to the end::
es_es: Es sencillo crear una variante ordenada del diccionario que recuerde el orden en que se insertaron *últimamente* las claves. Si una nueva entrada sobrescribe una entrada existente, la posición de inserción original se cambia y se mueve al final::
ru: Создать упорядоченный вариант словаря, который запоминает порядок *последней* вставки* ключей, несложно. Если новая запись перезаписывает существующую, исходная позиция вставки изменяется и перемещается в конец:

source: class LastUpdatedOrderedDict(OrderedDict): 'Store items in the order the keys were last added' def __setitem__(self, key, value): super().__setitem__(key, value) self.move_to_end(key)
es_es: class LastUpdatedOrderedDict(OrderedDict): 'Almacena los elementos en el orden en que se añadieron las claves por última vez' def __setitem__(self, key, value): super().__setitem__(key, value) self.move_to_end(clave)

source: An :class:`OrderedDict` would also be useful for implementing variants of :func:`functools.lru_cache`:
es_es: Un :class:`OrderedDict` también sería útil para aplicar variantes de :func:`functools.lru_cache`:
ru: :class:`OrderedDict` также будет полезен для реализации вариантов :func:`functools.lru_cache`:

source: from collections import OrderedDict from time import time class TimeBoundedLRU: "LRU Cache that invalidates and refreshes old entries." def __init__(self, func, maxsize=128, maxage=30): self.cache = OrderedDict() # { args : (timestamp, result)} self.func = func self.maxsize = maxsize self.maxage = maxage def __call__(self, *args): if args in self.cache: self.cache.move_to_end(args) timestamp, result = self.cache[args] if time() - timestamp <= self.maxage: return result result = self.func(*args) self.cache[args] = time(), result if len(self.cache) > self.maxsize: self.cache.popitem(0) return result
es_es: from collections import OrderedDict from time import time class TimeBoundedLRU: "Caché LRU que invalida y refresca entradas antiguas". def __init__(self, func, maxsize=128, maxage=30): self.cache = OrderedDict() # { args : (timestamp, result)} self.func = func self.maxsize = maxsize self.maxage = maxage def __call__(self, *args): if args in self.cache: self.cache.move_to_end(args) timestamp, result = self.cache[args] if time() - timestamp <= self.maxage: return result result = self.func(*args) self.cache[args] = time(), result if len(self.cache) > self.maxsize: self.cache.popitem(0) return result

source: class MultiHitLRUCache: """ LRU cache that defers caching a result until it has been requested multiple times. To avoid flushing the LRU cache with one-time requests, we don't cache until a request has been made more than once. """ def __init__(self, func, maxsize=128, maxrequests=4096, cache_after=1): self.requests = OrderedDict() # { uncached_key : request_count } self.cache = OrderedDict() # { cached_key : function_result } self.func = func self.maxrequests = maxrequests # max number of uncached requests self.maxsize = maxsize # max number of stored return values self.cache_after = cache_after def __call__(self, *args): if args in self.cache: self.cache.move_to_end(args) return self.cache[args] result = self.func(*args) self.requests[args] = self.requests.get(args, 0) + 1 if self.requests[args] <= self.cache_after: self.requests.move_to_end(args) if len(self.requests) > self.maxrequests: self.requests.popitem(0) else: self.requests.pop(args, None) self.cache[args] = result if len(self.cache) > self.maxsize: self.cache.popitem(0) return result
es_es: class MultiHitLRUCache: """ Caché LRU que aplaza el almacenamiento en caché de un resultado hasta que que se haya solicitado varias veces. Para evitar vaciar la caché LRU con peticiones únicas, no se almacena en caché hasta que se ha realizado una petición más de una vez. """ def __init__(self, func, maxsize=128, maxrequests=4096, cache_after=1): self.requests = OrderedDict() # { uncached_key : request_count } self.cache = OrderedDict() # { cached_key : function_result } self.func = func self.maxrequests = maxrequests # número máximo de peticiones sin caché self.maxsize = maxsize # número máximo de valores de retorno almacenados self.cache_after = cache_after def __call__(self, *args): if args in self.cache: self.cache.move_to_end(args) return self.cache[args] result = self.func(*args) self.requests[args] = self.requests.get(args, 0) + 1 if self.requests[args] <= self.cache_after: self.requests.move_to_end(args) if len(self.requests) > self.maxrequests: self.requests.popitem(0) else self.requests.pop(args, None) self.cache[args] = result if len(self.cache) > self.maxsize: self.cache.popitem(0) return result

source: :class:`UserDict` objects
es_es: :class:`UserDict` objetos
ru: Объекты :class:`UserDict`

source: The class, :class:`UserDict` acts as a wrapper around dictionary objects. The need for this class has been partially supplanted by the ability to subclass directly from :class:`dict`; however, this class can be easier to work with because the underlying dictionary is accessible as an attribute.
es_es: La clase :class:`UserDict` actúa como envoltorio de los objetos diccionario. La necesidad de esta clase ha sido parcialmente suplantada por la capacidad de subclasificar directamente desde :class:`dict`; sin embargo, esta clase puede ser más fácil de trabajar porque el diccionario subyacente es accesible como un atributo.
ru: Класс :class:`UserDict` действует как оболочка вокруг объектов словаря. Потребность в этом классе была частично заменена возможностью создания подкласса непосредственно из :class:`dict`; однако с этим классом может быть проще работать, поскольку базовый словарь доступен как атрибут.

source: Class that simulates a dictionary. The instance's contents are kept in a regular dictionary, which is accessible via the :attr:`data` attribute of :class:`UserDict` instances. If *initialdata* is provided, :attr:`data` is initialized with its contents; note that a reference to *initialdata* will not be kept, allowing it to be used for other purposes.
es_es: Clase que simula un diccionario. El contenido de la instancia se guarda en un diccionario normal, accesible a través del atributo :attr:`data` de las instancias :class:`UserDict`. Si se proporciona *initialdata*, :attr:`data` se inicializa con su contenido; tenga en cuenta que no se guardará una referencia a *initialdata*, lo que permite utilizarla para otros fines.
ru: Класс, имитирующий словарь. Содержимое экземпляра хранится в обычном словаре, доступ к которому осуществляется через атрибут :attr:`data` экземпляров :class:`UserDict`. Если указано *initialdata*, :attr:`data` инициализируется своим содержимым; обратите внимание, что ссылка на *initialdata* не будет сохранена, что позволит использовать ее для других целей.

source: In addition to supporting the methods and operations of mappings, :class:`UserDict` instances provide the following attribute:
es_es: Además de soportar los métodos y operaciones de las asignaciones, las instancias de :class:`UserDict` proporcionan el siguiente atributo:
ru: Помимо поддержки методов и операций сопоставлений, экземпляры :class:`UserDict` предоставляют следующий атрибут:

source: A real dictionary used to store the contents of the :class:`UserDict` class.
es_es: Un diccionario real utilizado para almacenar el contenido de la clase :class:`UserDict`.
ru: Настоящий словарь, используемый для хранения содержимого класса :class:`UserDict`.

source: :class:`UserList` objects
es_es: :class:`UserList` objetos
ru: Объекты :class:`UserList`

source: This class acts as a wrapper around list objects. It is a useful base class for your own list-like classes which can inherit from them and override existing methods or add new ones. In this way, one can add new behaviors to lists.
es_es: Esta clase actúa como una envoltura alrededor de los objetos de lista. Es una clase base útil para sus propias clases tipo lista, que pueden heredar de ella y anular los métodos existentes o añadir otros nuevos. De esta forma, se pueden añadir nuevos comportamientos a las listas.
ru: Этот класс действует как оболочка объектов списка. Это полезный базовый класс для ваших собственных классов, похожих на списки, которые могут наследовать от них и переопределять существующие методы или добавлять новые. Таким образом, в списки можно добавлять новые варианты поведения.

source: The need for this class has been partially supplanted by the ability to subclass directly from :class:`list`; however, this class can be easier to work with because the underlying list is accessible as an attribute.
es_es: La necesidad de esta clase ha sido parcialmente suplantada por la capacidad de subclasificar directamente desde :class:`list`; sin embargo, esta clase puede ser más fácil de trabajar porque la lista subyacente es accesible como un atributo.
ru: Потребность в этом классе была частично заменена возможностью создания подкласса непосредственно из :class:`list`; однако с этим классом проще работать, поскольку базовый список доступен как атрибут.

source: Class that simulates a list. The instance's contents are kept in a regular list, which is accessible via the :attr:`data` attribute of :class:`UserList` instances. The instance's contents are initially set to a copy of *list*, defaulting to the empty list ``[]``. *list* can be any iterable, for example a real Python list or a :class:`UserList` object.
es_es: Clase que simula una lista. El contenido de la instancia se guarda en una lista normal, accesible a través del atributo :attr:`data` de las instancias :class:`UserList`. El contenido de la instancia se establece inicialmente como una copia de *list*, por defecto la lista vacía ``[]``. *list* puede ser cualquier iterable, por ejemplo una lista real de Python o un objeto :class:`UserList`.
ru: Класс, имитирующий список. Содержимое экземпляра хранится в обычном списке, доступ к которому осуществляется через атрибут :attr:`data` экземпляров :class:`UserList`. Содержимое экземпляра изначально установлено в копию *list*, по умолчанию используется пустой список ``[]``. *list* может быть любым итерируемым объектом, например реальным списком Python или объектом :class:`UserList`.

source: In addition to supporting the methods and operations of mutable sequences, :class:`UserList` instances provide the following attribute:
es_es: Además de soportar los métodos y operaciones de las secuencias mutables, las instancias de :class:`UserList` proporcionan el siguiente atributo:
ru: Помимо поддержки методов и операций изменяемых последовательностей, экземпляры :class:`UserList` предоставляют следующий атрибут:

source: A real :class:`list` object used to store the contents of the :class:`UserList` class.
es_es: Un objeto real :class:`list` utilizado para almacenar el contenido de la clase :class:`UserList`.
ru: Настоящий объект :class:`list`, используемый для хранения содержимого класса :class:`UserList`.

source: **Subclassing requirements:** Subclasses of :class:`UserList` are expected to offer a constructor which can be called with either no arguments or one argument. List operations which return a new sequence attempt to create an instance of the actual implementation class. To do so, it assumes that the constructor can be called with a single parameter, which is a sequence object used as a data source.
es_es: **Requisitos de las subclases:** Se espera que las subclases de :class:`UserList` ofrezcan un constructor al que se pueda llamar sin argumentos o con un argumento. Las operaciones de lista que devuelven una nueva secuencia intentan crear una instancia de la clase de implementación real. Para ello, asume que el constructor puede ser llamado con un único parámetro, que es un objeto secuencia utilizado como fuente de datos.
ru: **Требования к созданию подклассов:** Ожидается, что подклассы :class:`UserList` будут предлагать конструктор, который можно вызывать либо без аргументов, либо с одним аргументом. Операции со списком, которые возвращают новую последовательность, пытаются создать экземпляр фактического класса реализации. Для этого предполагается, что конструктор можно вызвать с одним параметром, который представляет собой объект последовательности, используемый в качестве источника данных.

source: If a derived class does not wish to comply with this requirement, all of the special methods supported by this class will need to be overridden; please consult the sources for information about the methods which need to be provided in that case.
es_es: Si una clase derivada no desea cumplir con este requisito, todos los métodos especiales soportados por esta clase tendrán que ser sobrescritos; por favor, consulte las fuentes para obtener información sobre los métodos que deben ser proporcionados en ese caso.
ru: Если производный класс не желает соответствовать этому требованию, все специальные методы, поддерживаемые этим классом, необходимо будет переопределить; пожалуйста, обратитесь к источникам за информацией о методах, которые необходимо предоставить в этом случае.

source: :class:`UserString` objects
es_es: :class:`UserString` objetos
ru: Объекты :class:`UserString`

source: The class, :class:`UserString` acts as a wrapper around string objects. The need for this class has been partially supplanted by the ability to subclass directly from :class:`str`; however, this class can be easier to work with because the underlying string is accessible as an attribute.
es_es: La clase :class:`UserString` actúa como una envoltura alrededor de los objetos de cadena. La necesidad de esta clase ha sido parcialmente suplantada por la capacidad de subclasificar directamente desde :class:`str`; sin embargo, esta clase puede ser más fácil de trabajar porque la cadena subyacente es accesible como un atributo.
ru: Класс :class:`UserString` действует как оболочка строковых объектов. Потребность в этом классе была частично заменена возможностью создания подкласса непосредственно из :class:`str`; однако с этим классом проще работать, поскольку базовая строка доступна как атрибут.

source: Class that simulates a string object. The instance's content is kept in a regular string object, which is accessible via the :attr:`data` attribute of :class:`UserString` instances. The instance's contents are initially set to a copy of *seq*. The *seq* argument can be any object which can be converted into a string using the built-in :func:`str` function.
es_es: Clase que simula un objeto string. El contenido de la instancia se guarda en un objeto de cadena normal, accesible a través del atributo :attr:`data` de las instancias de :class:`UserString`. El contenido de la instancia se establece inicialmente como una copia de *seq*. El argumento *seq* puede ser cualquier objeto que pueda convertirse en cadena mediante la función integrada :func:`str`.
ru: Класс, имитирующий строковый объект. Содержимое экземпляра хранится в обычном строковом объекте, доступ к которому осуществляется через атрибут :attr:`data` экземпляров :class:`UserString`. Содержимое экземпляра изначально установлено в копию *seq*. Аргументом *seq* может быть любой объект, который можно преобразовать в строку с помощью встроенной функции :func:`str`.

source: In addition to supporting the methods and operations of strings, :class:`UserString` instances provide the following attribute:
es_es: Además de soportar los métodos y operaciones de las cadenas, las instancias de :class:`UserString` proporcionan el siguiente atributo:
ru: Помимо поддержки методов и операций со строками, экземпляры :class:`UserString` предоставляют следующий атрибут:

source: A real :class:`str` object used to store the contents of the :class:`UserString` class.
es_es: Un objeto real :class:`str` utilizado para almacenar el contenido de la clase :class:`UserString`.
ru: Настоящий объект :class:`str`, используемый для хранения содержимого класса :class:`UserString`.

source: New methods ``__getnewargs__``, ``__rmod__``, ``casefold``, ``format_map``, ``isprintable``, and ``maketrans``.
es_es: Nuevos métodos ``__getnewargs__``, ``__rmod__``, ``casefold``, ``format_map``, ``isprintable``, y ``maketrans``.
ru: Новые методы ``__getnewargs__``, ``__rmod__``, ``casefold``, ``format_map``, ``isprintable`` и ``maketrans``.

source: Example of simulating Python's internal lookup chain::
ru: Пример моделирования внутренней цепочки поиска Python::

source: When each key is encountered for the first time, it is not already in the mapping; so an entry is automatically created using the :attr:`~defaultdict.default_factory` function which returns an empty :class:`list`. The :meth:`!list.append` operation then attaches the value to the new list. When keys are encountered again, the look-up proceeds normally (returning the list for that key) and the :meth:`!list.append` operation adds another value to the list. This technique is simpler and faster than an equivalent technique using :meth:`dict.setdefault`:
ru: Когда каждый ключ встречается впервые, его еще нет в сопоставлении; поэтому запись создается автоматически с помощью функции :attr:`~defaultdict.default_factory`, которая возвращает пустой :class:`list`. Затем операция :meth:`!list.append` присоединяет значение к новому списку. Когда ключи встречаются снова, поиск продолжается обычным образом (возвращается список для этого ключа), а операция :meth:`!list.append` добавляет в список еще одно значение. Этот метод проще и быстрее, чем эквивалентный метод, использующий :meth:`dict.setdefault`:

source: Named tuples are also supported by generic function :func:`copy.replace`.
ru: Именованные кортежи также поддерживаются общей функцией :func:`copy.replace`.

source: Raise :exc:`TypeError` instead of :exc:`ValueError` for invalid keyword arguments.
ru: Поднимите :exc:`TypeError` вместо :exc:`ValueError` для недопустимых аргументов ключевого слова.
