Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/collections.po
Languages: es_es, ru

source: As a :class:`dict` subclass, :class:`Counter` inherited the capability to remember insertion order. Math operations on *Counter* objects also preserve order. Results are ordered according to when an element is first encountered in the left operand and then by the order encountered in the right operand.
es_es: Como subclase de :class:`dict`, :class:`Counter` heredó la capacidad de recordar el orden de inserción. Las operaciones matemáticas sobre objetos *Counter* también conservan el orden. Los resultados se ordenan en función de cuándo se encuentra un elemento por primera vez en el operando izquierdo y, a continuación, por el orden encontrado en el operando derecho.
ru: Как подкласс :class:`dict`, :class:`Counter` унаследовал способность запоминать порядок вставки. Математические операции над объектами *Counter* также сохраняют порядок. Результаты упорядочены в соответствии с тем, когда элемент впервые встречается в левом операнде, а затем по порядку, который встречается в правом операнде.

source: Counter objects support additional methods beyond those available for all dictionaries:
es_es: Los objetos contadores admiten métodos adicionales a los disponibles para todos los diccionarios:
ru: Объекты-счетчики поддерживают дополнительные методы, помимо тех, которые доступны для всех словарей:

source: Return an iterator over elements repeating each as many times as its count. Elements are returned in the order first encountered. If an element's count is less than one, :meth:`elements` will ignore it.
es_es: Devuelve un iterador sobre elementos repitiendo cada uno tantas veces como su cuenta. Los elementos se devuelven en el orden en que se encuentran por primera vez. Si la cuenta de un elemento es menor que uno, :meth:`elements` lo ignorará.
ru: Возвращает итератор для элементов, повторяющих каждый столько раз, сколько его счетчик. Элементы возвращаются в том порядке, в котором они впервые встретились. Если количество элементов меньше единицы, :meth:`elements` проигнорирует его.

source: Return a list of the *n* most common elements and their counts from the most common to the least. If *n* is omitted or ``None``, :meth:`most_common` returns *all* elements in the counter. Elements with equal counts are ordered in the order first encountered:
es_es: Devuelve una lista de los *n* elementos más comunes y su recuento del más común al menos común. Si *n* se omite o ``None``, :meth:`most_common` devuelve *todos* los elementos del contador. Los elementos con recuentos iguales se ordenan en el orden en que se encuentran primero:
ru: Возвращает список *n* наиболее распространенных элементов и их количество от самого распространенного до наименьшего. Если *n* опущено или ``None``, :meth:`most_common` возвращает *все* элементы в счетчике. Элементы с одинаковым количеством упорядочены в порядке их первого появления:

source: Elements are subtracted from an *iterable* or from another *mapping* (or counter). Like :meth:`dict.update` but subtracts counts instead of replacing them. Both inputs and outputs may be zero or negative.
es_es: Los elementos se restan de un *iterable* o de otro *mapping* (o contador). Como :meth:`dict.update` pero resta conteos en lugar de reemplazarlos. Tanto las entradas como las salidas pueden ser cero o negativas.
ru: Элементы вычитаются из *итерируемого объекта* или из иного *маппинг объекта* (или счетчика). Похожий на метод :meth:`dict.update` метод substract подсчитывает элементы, вместо того, чтобы заменить их. Входы и выходы могут быть нулевыми или отрицательными.

source: Compute the sum of the counts.
es_es: Calcula la suma de los recuentos.
ru: Вычислите сумму чисел.

source: The usual dictionary methods are available for :class:`Counter` objects except for two which work differently for counters.
es_es: Los métodos de diccionario habituales están disponibles para los objetos :class:`Counter` excepto dos que funcionan de forma diferente para los contadores.
ru: Обычные методы словарей доступны для объектов :class:`Counter` , кроме двух, которые работают по-другому для счетчиков.

source: This class method is not implemented for :class:`Counter` objects.
es_es: Este método de clase no está implementado para los objetos :class:`Counter`.
ru: Этот метод класса не реализован для объектов :class:`Counter`.

source: Elements are counted from an *iterable* or added-in from another *mapping* (or counter). Like :meth:`dict.update` but adds counts instead of replacing them. Also, the *iterable* is expected to be a sequence of elements, not a sequence of ``(key, value)`` pairs.
es_es: Los elementos se cuentan a partir de un *iterable* o se añaden a partir de otro *mapping* (o contador). Como :meth:`dict.update` pero añade recuentos en lugar de reemplazarlos. Además, se espera que el *iterable* sea una secuencia de elementos, no una secuencia de pares ``(key, value)``.
ru: Элементы подсчитываются из *итерируемого* или добавляются из другого *отображения* (или счетчика). Подобно :meth:`dict.update`, но добавляет счетчики, а не заменяет их. Кроме того, ожидается, что *iterable* будет последовательностью элементов, а не последовательностью пар «(ключ, значение)».

source: Counters support rich comparison operators for equality, subset, and superset relationships: ``==``, ``!=``, ``<``, ``<=``, ``>``, ``>=``. All of those tests treat missing elements as having zero counts so that ``Counter(a=1) == Counter(a=1, b=0)`` returns true.
es_es: Los contadores admiten numerosos operadores de comparación para relaciones de igualdad, subconjunto y superconjunto: ``==`` ``!=`` , ``<``, ``<=``, ``>``, ``>=``. Todas estas pruebas tratan los elementos que faltan como si tuvieran recuento cero, de modo que ``Counter(a=1) == Counter(a=1, b=0)`` devuelve verdadero.
ru: Счетчики поддерживают расширенные операторы сравнения для отношений равенства, подмножества и надмножества: ``==``, ``!=``, ``<``, ``<=``, ``>``, ``> =``. Все эти тесты рассматривают отсутствующие элементы как имеющие нулевое количество, поэтому ``Counter(a=1) == Counter(a=1, b=0)`` возвращает true.

source: Rich comparison operations were added.
es_es: Se han añadido operaciones de comparación enriquecidas.
ru: Были добавлены расширенные операции сравнения.

source: In equality tests, missing elements are treated as having zero counts. Formerly, ``Counter(a=3)`` and ``Counter(a=3, b=0)`` were considered distinct.
es_es: En las pruebas de igualdad, los elementos que faltan se tratan como si tuvieran recuento cero. Anteriormente, ``Counter(a=3)`` y ``Counter(a=3, b=0)`` se consideraban distintos.
ru: В тестах на равенство отсутствующие элементы считаются имеющими нулевое значение. Раньше ``Counter(a=3)`` и ``Counter(a=3, b=0)`` считались разными.

source: Common patterns for working with :class:`Counter` objects::
es_es: Patrones comunes para trabajar con objetos :class:`Counter`::
ru: Общие шаблоны работы с объектами :class:`Counter`::

source: c.total() # total of all counts c.clear() # reset all counts list(c) # list unique elements set(c) # convert to a set dict(c) # convert to a regular dictionary c.items() # convert to a list of (elem, cnt) pairs Counter(dict(list_of_pairs)) # convert from a list of (elem, cnt) pairs c.most_common()[:-n-1:-1] # n least common elements +c # remove zero and negative counts
es_es: c.total() # total de todos los recuentos c.clear() # restablecer todos los recuentos list(c) # lista elementos únicos set(c) # convertir en un conjunto dict(c) # convertir en diccionario regular c.items() # convertir en una lista de pares (elem, cnt) Counter(dict(list_of_pairs)) # convertir a partir de una lista de pares (elem, cnt) c.most_common()[:-n-1:-1] # n elementos menos comunes +c # eliminar los recuentos cero y negativos

source: Several mathematical operations are provided for combining :class:`Counter` objects to produce multisets (counters that have counts greater than zero). Addition and subtraction combine counters by adding or subtracting the counts of corresponding elements. Intersection and union return the minimum and maximum of corresponding counts. Equality and inclusion compare corresponding counts. Each operation can accept inputs with signed counts, but the output will exclude results with counts of zero or less.
es_es: Existen varias operaciones matemáticas para combinar objetos de :class:`Counter` y producir conjuntos múltiples (contadores con recuentos superiores a cero). La suma y la resta combinan contadores sumando o restando los recuentos de los elementos correspondientes. La intersección y la unión devuelven el mínimo y el máximo de los recuentos correspondientes. La igualdad y la inclusión comparan los recuentos correspondientes. Cada operación puede aceptar entradas con recuentos con signo, pero la salida excluirá los resultados con recuentos iguales o inferiores a cero.
ru: Предусмотрено несколько математических операций для объединения объектов :class:`Counter` для создания мультимножеств (счетчиков со счетчиком больше нуля). Сложение и вычитание объединяют счетчики путем сложения или вычитания счетчиков соответствующих элементов. Пересечение и объединение возвращают минимум и максимум соответствующих значений. Равенство и инклюзивность сравнивают соответствующие значения. Каждая операция может принимать входные данные со знаковыми счетчиками, но выходные данные будут исключать результаты со счетчиками, равными нулю или меньше.

source: >>> c = Counter(a=3, b=1) >>> d = Counter(a=1, b=2) >>> c + d # add two counters together: c[x] + d[x] Counter({'a': 4, 'b': 3}) >>> c - d # subtract (keeping only positive counts) Counter({'a': 2}) >>> c & d # intersection: min(c[x], d[x]) Counter({'a': 1, 'b': 1}) >>> c | d # union: max(c[x], d[x]) Counter({'a': 3, 'b': 2}) >>> c == d # equality: c[x] == d[x] False >>> c <= d # inclusion: c[x] <= d[x] False
es_es: >>> c = Counter(a=3, b=1) >>> d = Counter(a=1, b=2) >>> c + d # suma dos contadores: c[x] + d[x] Contador({'a': 4, 'b': 3}) >>> c - d # resta (manteniendo sólo las cuentas positivas) Counter({'a': 2}) >>> c & d # intersección: min(c[x], d[x]) Counter({'a': 1, 'b': 1}) >>> c | d # unión: max(c[x], d[x]) Counter({'a': 3, 'b': 2}) >>> c == d # igualdad: c[x] == d[x] False >>> c <= d # inclusión: c[x] <= d[x] False

source: Unary addition and subtraction are shortcuts for adding an empty counter or subtracting from an empty counter.
es_es: La suma y la resta unarias son atajos para sumar un contador vacío o restar de un contador vacío.
ru: Унарное сложение и вычитание — это ярлыки для добавления пустого счетчика или вычитания из пустого счетчика.

source: Added support for unary plus, unary minus, and in-place multiset operations.
es_es: Se ha añadido soporte para operaciones unarias de más, menos y conjuntos múltiples.
ru: Добавлена ​​поддержка унарных операций плюс, унарный минус и операций с несколькими множествами на месте.

source: Counters were primarily designed to work with positive integers to represent running counts; however, care was taken to not unnecessarily preclude use cases needing other types or negative values. To help with those use cases, this section documents the minimum range and type restrictions.
es_es: Los contadores se diseñaron principalmente para trabajar con números enteros positivos para representar recuentos continuos; sin embargo, se tuvo cuidado de no excluir innecesariamente casos de uso que necesitaran otros tipos o valores negativos. Para ayudar con esos casos de uso, esta sección documenta el rango mínimo y las restricciones de tipo.
ru: Счетчики в первую очередь были разработаны для работы с положительными целыми числами для представления текущих значений; однако были приняты меры, чтобы не исключать без необходимости варианты использования, требующие других типов или отрицательных значений. Чтобы помочь в таких случаях использования, в этом разделе документированы ограничения минимального диапазона и типа.

source: The :class:`Counter` class itself is a dictionary subclass with no restrictions on its keys and values. The values are intended to be numbers representing counts, but you *could* store anything in the value field.
es_es: La propia clase :class:`Counter` es una subclase de diccionario sin restricciones en sus claves y valores. Los valores están pensados para ser números que representen recuentos, pero *podría* almacenar cualquier cosa en el campo de valor.
ru: Класс :class:`Counter` сам по себе является подклассом словаря без ограничений на его ключи и значения. Значения задуманы как числа, представляющие количество, но вы *можете* хранить в поле значения что угодно.

source: The :meth:`~Counter.most_common` method requires only that the values be orderable.
es_es: El método :meth:`~Counter.most_common` sólo requiere que los valores sean ordenables.
ru: Метод :meth:`~Counter.most_common` требует только того, чтобы значения можно было упорядочивать.

source: For in-place operations such as ``c[key] += 1``, the value type need only support addition and subtraction. So fractions, floats, and decimals would work and negative values are supported. The same is also true for :meth:`~Counter.update` and :meth:`~Counter.subtract` which allow negative and zero values for both inputs and outputs.
es_es: Para las operaciones in situ, como ``c[key] += 1``, el tipo de valor sólo debe admitir sumas y restas. Así que fracciones, flotantes y decimales funcionarían y se admiten valores negativos. Lo mismo ocurre con :meth:`~Counter.update` y :meth:`~Counter.subtract` que permiten valores negativos y cero tanto para las entradas como para las salidas.
ru: Для операций на месте, таких как ``c[key] += 1``, ​​тип значения должен поддерживать только сложение и вычитание. Таким образом, будут работать дроби, числа с плавающей запятой и десятичные дроби, а также поддерживаются отрицательные значения. То же самое справедливо и для :meth:`~Counter.update` и :meth:`~Counter.subtract`, которые допускают отрицательные и нулевые значения как для входных, так и для выходных данных.

source: The multiset methods are designed only for use cases with positive values. The inputs may be negative or zero, but only outputs with positive values are created. There are no type restrictions, but the value type needs to support addition, subtraction, and comparison.
es_es: Los métodos multiset están diseñados sólo para casos de uso con valores positivos. Las entradas pueden ser negativas o cero, pero sólo se crean salidas con valores positivos. No hay restricciones de tipo, pero el tipo de valor debe admitir sumas, restas y comparaciones.
ru: Мультимножественные методы предназначены только для случаев использования с положительными значениями. Входные данные могут быть отрицательными или нулевыми, но создаются только выходные данные с положительными значениями. Ограничений по типам нет, но тип значения должен поддерживать сложение, вычитание и сравнение.

source: The :meth:`~Counter.elements` method requires integer counts. It ignores zero and negative counts.
es_es: El método :meth:`~Counter.elements` requiere recuentos enteros. Ignora los recuentos cero y negativos.
ru: Метод :meth:`~Counter.elements` требует подсчета целых чисел. Он игнорирует нулевые и отрицательные значения.

source: `Bag class <https://www.gnu.org/software/smalltalk/manual-base/html_node/Bag.html>`_ in Smalltalk.
es_es: Clase `Bag <https://www.gnu.org/software/smalltalk/manual-base/html_node/Bag.html>`_ en Smalltalk.
ru: `Класс Bag <https://www.gnu.org/software/smalltalk/manual-base/html_node/Bag.html>`_ в Smalltalk.

source: Wikipedia entry for `Multisets <https://en.wikipedia.org/wiki/Multiset>`_.
es_es: Entrada de Wikipedia para `Multisets <https://en.wikipedia.org/wiki/Multiset>`_.
ru: Запись в Википедии о `Multisets <https://en.wikipedia.org/wiki/Multiset>`_.

source: `C++ multisets <http://www.java2s.com/Tutorial/Cpp/0380__set-multiset/Catalog0380__set-multiset.htm>`_ tutorial with examples.
es_es: `C++ multisets <http://www.java2s.com/Tutorial/Cpp/0380__set-multiset/Catalog0380__set-multiset.htm>`_ tutorial con ejemplos.
ru: `Мультимножества C++ <http://www.java2s.com/Tutorial/Cpp/0380__set-multiset/Catalog0380__set-multiset.htm>`_ учебник с примерами.

source: For mathematical operations on multisets and their use cases, see *Knuth, Donald. The Art of Computer Programming Volume II, Section 4.6.3, Exercise 19*.
es_es: Para operaciones matemáticas sobre conjuntos múltiples y sus casos de uso, véase *Knuth, Donald. The Art of Computer Programming Volume II, Section 4.6.3, Exercise 19*.
ru: О математических операциях над мультимножествами и вариантах их использования см. *Knuth, Donald. Искусство компьютерного программирования, том II, раздел 4.6.3, упражнение 19*.

source: To enumerate all distinct multisets of a given size over a given set of elements, see :func:`itertools.combinations_with_replacement`::
es_es: Para enumerar todos los multiconjuntos distintos de un tamaño dado sobre un conjunto dado de elementos, ver :func:`itertools.combinations_with_replacement`::
ru: Чтобы перечислить все различные мультимножества заданного размера по заданному набору элементов, см. :func:`itertools.combinations_with_replacement`::

source: :class:`deque` objects
es_es: :class:`deque` objetos
ru: Объекты :class:`deque`

source: Returns a new deque object initialized left-to-right (using :meth:`append`) with data from *iterable*. If *iterable* is not specified, the new deque is empty.
es_es: Devuelve un nuevo objeto deque inicializado de izquierda a derecha (usando :meth:`append`) con datos de *iterable*. Si no se especifica *iterable*, el nuevo deque está vacío.
ru: Возвращает новый объект двухсторонней очереди, инициализированный слева направо (с использованием :meth:`append`) с данными из *iterable*. Если *iterable* не указано, новая дек пуста.

source: Deques are a generalization of stacks and queues (the name is pronounced "deck" and is short for "double-ended queue"). Deques support thread-safe, memory efficient appends and pops from either side of the deque with approximately the same *O*\ (1) performance in either direction.
es_es: Los deques son una generalización de las pilas y colas (el nombre se pronuncia "deck" y es la abreviatura de "double-ended queue"). Los deques permiten añadir y extraer datos de cualquier lado del deque de forma segura y eficiente en memoria, con aproximadamente el mismo rendimiento *O* (1) en cualquier dirección.
ru: Деки — это обобщение стеков и очередей (название произносится как «колода» и является сокращением от «двусторонняя очередь»). Деки поддерживают поточно-ориентированное и эффективное использование памяти при добавлении и извлечении с любой стороны дека с примерно одинаковой производительностью *O*\ (1) в любом направлении.

source: Though :class:`list` objects support similar operations, they are optimized for fast fixed-length operations and incur *O*\ (*n*) memory movement costs for ``pop(0)`` and ``insert(0, v)`` operations which change both the size and position of the underlying data representation.
es_es: Aunque los objetos :class:`list` admiten operaciones similares, están optimizados para operaciones rápidas de longitud fija e incurren en *O*\ (*n*) costes de movimiento de memoria para las operaciones ``pop(0)`` y ``insert(0, v)`` que cambian tanto el tamaño como la posición de la representación de datos subyacente.
ru: Хотя объекты :class:`list` поддерживают аналогичные операции, они оптимизированы для быстрых операций фиксированной длины и требуют *O*\ (*n*) затрат на перемещение памяти для ``pop(0)`` и ``insert(0) , v)`` операции, которые изменяют как размер, так и положение базового представления данных.

source: If *maxlen* is not specified or is ``None``, deques may grow to an arbitrary length. Otherwise, the deque is bounded to the specified maximum length. Once a bounded length deque is full, when new items are added, a corresponding number of items are discarded from the opposite end. Bounded length deques provide functionality similar to the ``tail`` filter in Unix. They are also useful for tracking transactions and other pools of data where only the most recent activity is of interest.
es_es: Si *maxlen* no se especifica o es ``None``, los deques pueden crecer hasta una longitud arbitraria. En caso contrario, el deque se limita a la longitud máxima especificada. Una vez que un deque de longitud limitada está lleno, cuando se añaden nuevos elementos, se descarta un número correspondiente de elementos del extremo opuesto. Los deques de longitud limitada ofrecen una funcionalidad similar al filtro ``tail`` de Unix. También son útiles para rastrear transacciones y otros conjuntos de datos en los que sólo interesa la actividad más reciente.
ru: Если *maxlen* не указан или имеет значение None, деки могут вырасти до произвольной длины. В противном случае дек ограничен указанной максимальной длиной. После заполнения очереди ограниченной длины при добавлении новых элементов соответствующее количество элементов отбрасывается с противоположного конца. Деки ограниченной длины предоставляют функциональность, аналогичную хвостовому фильтру в Unix. Они также полезны для отслеживания транзакций и других пулов данных, где интерес представляют только самые последние действия.

source: Deque objects support the following methods:
es_es: Los objetos Deque admiten los siguientes métodos:
ru: Объекты Deque поддерживают следующие методы:

source: Add *x* to the right side of the deque.
es_es: Añade *x* a la parte derecha del deque.
ru: Добавьте *x* в правую часть дека.

source: Add *x* to the left side of the deque.
es_es: Añade *x* al lado izquierdo del deque.
ru: Добавьте *x* в левую часть дека.

source: Remove all elements from the deque leaving it with length 0.
es_es: Elimina todos los elementos del deque dejándolo con longitud 0.
ru: Удалите все элементы из дека, оставив его длину 0.

source: Create a shallow copy of the deque.
es_es: Crea una copia superficial del deque.
ru: Создайте неглубокую копию дека.

source: Count the number of deque elements equal to *x*.
es_es: Cuenta el número de elementos de deque iguales a *x*.
ru: Подсчитайте количество элементов дека, равное *x*.

source: Extend the right side of the deque by appending elements from the iterable argument.
es_es: Extiende el lado derecho del deque añadiendo elementos del argumento iterable.
ru: Расширьте правую часть дека, добавив элементы из итерируемого аргумента.

source: Extend the left side of the deque by appending elements from *iterable*. Note, the series of left appends results in reversing the order of elements in the iterable argument.
es_es: Extiende el lado izquierdo del deque añadiendo elementos de *iterable*. Tenga en cuenta que la serie de anexos a la izquierda invierte el orden de los elementos en el argumento iterable.
ru: Расширьте левую часть дека, добавив элементы из *iterable*. Обратите внимание: серия левых добавлений приводит к изменению порядка элементов в итерируемом аргументе.

source: Return the position of *x* in the deque (at or after index *start* and before index *stop*). Returns the first match or raises :exc:`ValueError` if not found.
es_es: Devuelve la posición de *x* en el deque (en o después del índice *start* y antes del índice *stop*). Devuelve la primera coincidencia o muestra :exc:`ValueError` si no se encuentra.
ru: Возвращает позицию *x* в двухсторонней очереди (в месте или после индекса *start* и перед индексом *stop*). Возвращает первое совпадение или выдает :exc:`ValueError`, если не найдено.

source: Insert *x* into the deque at position *i*.
es_es: Inserta *x* en el deque en la posición *i*.
ru: Вставьте *x* в дек в позиции *i*.
