Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/collections.po
Languages: es_es, ru

source: :mod:`!collections` --- Container datatypes
es_es: :mod:`!collections` --- Tipos de datos de contenedores
ru: :mod:`!collections` --- Типы данных контейнера

source: **Source code:** :source:`Lib/collections/__init__.py`
es_es: **Código fuente:** :source:`Lib/collections/__init__.py`

source: This module implements specialized container datatypes providing alternatives to Python's general purpose built-in containers, :class:`dict`, :class:`list`, :class:`set`, and :class:`tuple`.
es_es: Este módulo implementa tipos de datos contenedores especializados que proporcionan alternativas a los contenedores incorporados de propósito general de Python, :class:`dict`, :class:`list`, :class:`set`, y :class:`tuple`.
ru: Модуль реализует специализированные контейнеры типов данных, предоставляя альтернативу встроенным контейнерам Python общего назначения, :class:`dict`, :class:`list`, :class:`set`, and :class:`tuple`.

source: factory function for creating tuple subclasses with named fields
es_es: función de fábrica para crear subclases de tuplas con campos con nombre
ru: функция для создания подклассов кортежей с именованными полями

source: list-like container with fast appends and pops on either end
es_es: contenedor tipo lista con anexos y saltos rápidos en ambos extremos
ru: список с быстрым добавление и извлечением последнего элемента

source: dict-like class for creating a single view of multiple mappings
es_es: clase tipo dict para crear una vista única de múltiples asignaciones
ru: dict-подобный класс для создания единого представления нескольких сопоставлений

source: dict subclass for counting :term:`hashable` objects
es_es: subclase dict para contar objetos :term:`hashable
ru: Подкласс dict для подсчета :term:`hashable` объектов

source: dict subclass that remembers the order entries were added
es_es: subclase dict que recuerda el orden en que se añadieron las entradas
ru: подскласс словаря, запоминающий порядок добавленных записей

source: dict subclass that calls a factory function to supply missing values
es_es: subclase de dictado que llama a una función de fábrica para suministrar los valores que faltan
ru: подскласс словаря который вызывает функцию для заполнения отсутствующих значений

source: wrapper around dictionary objects for easier dict subclassing
es_es: envoltura de objetos de diccionario para facilitar la subclase dict
ru: оболочка вокруг объектов словаря для упрощения подклассов dict

source: wrapper around list objects for easier list subclassing
es_es: envoltura de objetos de lista para facilitar la subclasificación de listas
ru: оболочка вокруг объектов списка для упрощения создания подклассов списка

source: wrapper around string objects for easier string subclassing
es_es: envoltura de objetos de cadena para facilitar la subclasificación de cadenas
ru: оболочка вокруг строковых объектов для упрощения создания подклассов строк

source: :class:`ChainMap` objects
es_es: :class:`ChainMap` objetos

source: A :class:`ChainMap` class is provided for quickly linking a number of mappings so they can be treated as a single unit. It is often much faster than creating a new dictionary and running multiple :meth:`~dict.update` calls.
es_es: Se proporciona una clase :class:`ChainMap` para vincular rápidamente una serie de asignaciones de modo que puedan tratarse como una sola unidad. Suele ser mucho más rápido que crear un nuevo diccionario y ejecutar varias llamadas a :meth:`~dict.update`.
ru: Класс :class:`ChainMap` предназначен для быстрого связывания нескольких отображений, чтобы их можно было рассматривать как единое целое. Зачастую это намного быстрее, чем создавать новый словарь и выполнять несколько вызовов :meth:`~dict.update`.

source: The class can be used to simulate nested scopes and is useful in templating.
es_es: La clase se puede utilizar para simular ámbitos anidados y es útil en la creación de plantillas.
ru: Класс можно использовать для моделирования вложенных областей и полезен при создании шаблонов.

source: A :class:`ChainMap` groups multiple dicts or other mappings together to create a single, updateable view. If no *maps* are specified, a single empty dictionary is provided so that a new chain always has at least one mapping.
es_es: :class:`ChainMap` agrupa varios diccionarios u otras correspondencias para crear una única vista actualizable. Si no se especifican *maps*, se proporciona un único diccionario vacío para que una nueva cadena siempre tenga al menos un mapeo.
ru: :class:`ChainMap` группирует несколько диктовок или других сопоставлений вместе, чтобы создать единое обновляемое представление. Если *maps* не указаны, предоставляется один пустой словарь, так что новая цепочка всегда имеет хотя бы одно сопоставление.

source: The underlying mappings are stored in a list. That list is public and can be accessed or updated using the *maps* attribute. There is no other state.
es_es: Las asignaciones subyacentes se almacenan en una lista. Esa lista es pública y se puede acceder a ella o actualizarla utilizando el atributo *maps*. No hay ningún otro estado.
ru: Базовые сопоставления хранятся в списке. Этот список является общедоступным, и к нему можно получить доступ или обновить его с помощью атрибута *maps*. Другого государства нет.

source: Lookups search the underlying mappings successively until a key is found. In contrast, writes, updates, and deletions only operate on the first mapping.
es_es: Las búsquedas buscan sucesivamente en las correspondencias subyacentes hasta encontrar una clave. En cambio, las escrituras, actualizaciones y eliminaciones sólo operan en la primera asignación.
ru: Поиски последовательно ищут базовые сопоставления, пока не будет найден ключ. Напротив, записи, обновления и удаления выполняются только при первом сопоставлении.

source: A :class:`ChainMap` incorporates the underlying mappings by reference. So, if one of the underlying mappings gets updated, those changes will be reflected in :class:`ChainMap`.
es_es: :class:`ChainMap` incorpora las correspondencias subyacentes por referencia. Así, si una de las correspondencias subyacentes se actualiza, esos cambios se reflejarán en :class:`ChainMap`.
ru: :class:`ChainMap` включает базовые сопоставления по ссылке. Таким образом, если одно из базовых сопоставлений будет обновлено, эти изменения будут отражены в :class:`ChainMap`.

source: All of the usual dictionary methods are supported. In addition, there is a *maps* attribute, a method for creating new subcontexts, and a property for accessing all but the first mapping:
es_es: Se admiten todos los métodos habituales de diccionario. Además, hay un atributo *maps*, un método para crear nuevos subcontextos y una propiedad para acceder a todos los mapas menos al primero:
ru: Поддерживаются все обычные словарные методы. Кроме того, существует атрибут *maps*, метод для создания новых подконтекстов и свойство для доступа ко всем сопоставлениям, кроме первого:

source: A user updateable list of mappings. The list is ordered from first-searched to last-searched. It is the only stored state and can be modified to change which mappings are searched. The list should always contain at least one mapping.
es_es: Lista de correspondencias actualizable por el usuario. La lista se ordena de la primera a la última búsqueda. Es el único estado almacenado y puede modificarse para cambiar las correspondencias que se buscan. La lista debe contener siempre al menos una correspondencia.
ru: Обновляемый пользователем список сопоставлений. Список упорядочен от первого к последнему поиску. Это единственное сохраненное состояние, и его можно изменить, чтобы изменить поиск сопоставлений. Список всегда должен содержать хотя бы одно сопоставление.

source: Returns a new :class:`ChainMap` containing a new map followed by all of the maps in the current instance. If ``m`` is specified, it becomes the new map at the front of the list of mappings; if not specified, an empty dict is used, so that a call to ``d.new_child()`` is equivalent to: ``ChainMap({}, *d.maps)``. If any keyword arguments are specified, they update passed map or new empty dict. This method is used for creating subcontexts that can be updated without altering values in any of the parent mappings.
es_es: Devuelve un nuevo :class:`ChainMap` que contiene un nuevo mapa seguido de todos los mapas de la instancia actual. Si se especifica ``m``, se convierte en el nuevo mapa al principio de la lista de mapeos; si no se especifica, se utiliza un dict vacío, de modo que una llamada a ``d.new_child()`` equivale a: ``ChainMap({}, *d.maps)``. Si se especifica algún argumento de palabra clave, éste actualiza el mapa pasado o el nuevo dict vacío. Este método se utiliza para crear subcontextos que pueden actualizarse sin alterar los valores de ninguno de los mappings padre.
ru: Возвращает новый :class:`ChainMap`, содержащий новую карту, за которой следуют все карты в текущем экземпляре. Если указано ``m``, она становится новой картой в начале списка сопоставлений; если не указано, используется пустой dict, так что вызов ``d.new_child()`` эквивалентен: ``ChainMap({}, *d.maps)``. Если указаны какие-либо аргументы ключевого слова, они обновляют переданную карту или новый пустой словарь. Этот метод используется для создания подконтекстов, которые можно обновлять без изменения значений в любом из родительских сопоставлений.

source: The optional ``m`` parameter was added.
es_es: Se ha añadido el parámetro opcional ``m``.
ru: Был добавлен необязательный параметр ``m``.

source: Keyword arguments support was added.
es_es: Se ha añadido soporte para argumentos de palabras clave.
ru: Добавлена ​​поддержка аргументов ключевых слов.

source: Property returning a new :class:`ChainMap` containing all of the maps in the current instance except the first one. This is useful for skipping the first map in the search. Use cases are similar to those for the :keyword:`nonlocal` keyword used in :term:`nested scopes <nested scope>`. The use cases also parallel those for the built-in :func:`super` function. A reference to ``d.parents`` is equivalent to: ``ChainMap(*d.maps[1:])``.
es_es: Propiedad que devuelve un nuevo :class:`ChainMap` que contiene todos los mapas de la instancia actual excepto el primero. Esto es útil para saltarse el primer mapa de la búsqueda. Los casos de uso son similares a los de la palabra clave :keyword:`nonlocal` utilizada en :term:`nested scopes <nested scope>`. Los casos de uso también son paralelos a los de la función incorporada :func:`super`. Una referencia a ``d.parents`` equivale a: ``ChainMap(*d.maps[1:])``.
ru: Свойство, возвращающее новый :class:`ChainMap`, содержащий все карты текущего экземпляра, кроме первой. Это полезно для пропуска первой карты в поиске. Варианты использования аналогичны сценариям использования ключевого слова :keyword:`nonlocal`, используемого в :term:`вложенных областях <вложенная область>`. Варианты использования также аналогичны сценариям использования встроенной функции :func:`super`. Ссылка на ``d.parents`` эквивалентна: ``ChainMap(*d.maps[1:])``.

source: Note, the iteration order of a :class:`ChainMap` is determined by scanning the mappings last to first::
es_es: Tenga en cuenta que el orden de iteración de :class:`ChainMap` se determina recorriendo las asignaciones de último a primero::
ru: Обратите внимание: порядок итерации :class:`ChainMap` определяется путем сканирования сопоставлений от последнего к первому::

source: This gives the same ordering as a series of :meth:`dict.update` calls starting with the last mapping::
es_es: Esto da el mismo orden que una serie de llamadas a :meth:`dict.update` empezando por la última asignación::
ru: Это дает тот же порядок, что и серия вызовов :meth:`dict.update`, начиная с последнего сопоставления::

source: Added support for ``|`` and ``|=`` operators, specified in :pep:`584`.
es_es: Se ha añadido compatibilidad con los operadores ``|`` y ``|=``, especificados en :pep:`584`.
ru: Добавлена ​​поддержка операторов ``|`` и ``|=``, указанных в :pep:`584`.

source: The `MultiContext class <https://github.com/enthought/codetools/blob/4.0.0/codetools/contexts/multi_context.py>`_ in the Enthought `CodeTools package <https://github.com/enthought/codetools>`_ has options to support writing to any mapping in the chain.
es_es: La clase `MultiContext <https://github.com/enthought/codetools/blob/4.0.0/codetools/contexts/multi_context.py>`_ en el paquete Enthought `CodeTools <https://github.com/enthought/codetools>`_ tiene opciones para soportar la escritura en cualquier mapeo de la cadena.
ru: Класс MultiContext <https://github.com/enought/codetools/blob/4.0.0/codetools/contexts/multi_context.py>`_ в пакете En Thought `CodeTools <https://github.com/en Thought/ codetools>`_ имеет опции для поддержки записи в любое отображение в цепочке.

source: Django's `Context class <https://github.com/django/django/blob/main/django/template/context.py>`_ for templating is a read-only chain of mappings. It also features pushing and popping of contexts similar to the :meth:`~collections.ChainMap.new_child` method and the :attr:`~collections.ChainMap.parents` property.
es_es: La clase `Context class <https://github.com/django/django/blob/main/django/template/context.py>`_ de Django para plantillas es una cadena de mapeos de sólo lectura. También cuenta con push y popping de contextos similares al método :meth:`~collections.ChainMap.new_child` y la propiedad :attr:`~collections.ChainMap.parents`.
ru: Класс контекста Django <https://github.com/django/django/blob/main/django/template/context.py>`_ для шаблонов представляет собой цепочку сопоставлений, доступную только для чтения. Он также поддерживает отправку и извлечение контекстов, аналогично методу :meth:`~collections.ChainMap.new_child` и свойству :attr:`~collections.ChainMap.parents`.

source: The `Nested Contexts recipe <https://code.activestate.com/recipes/577434-nested-contexts-a-chain-of-mapping-objects/>`_ has options to control whether writes and other mutations apply only to the first mapping or to any mapping in the chain.
es_es: La receta `Nested Contexts' <https://code.activestate.com/recipes/577434-nested-contexts-a-chain-of-mapping-objects/>`_ tiene opciones para controlar si las escrituras y otras mutaciones se aplican sólo al primer mapeo o a cualquier mapeo de la cadena.
ru: `Рецепт вложенных контекстов <https://code.activestate.com/recipes/577434-nested-contexts-a-chain-of-mapping-objects/>`_ имеет параметры, позволяющие контролировать, применяются ли записи и другие мутации только к первому отображению или любому отображению в цепочке.

source: A `greatly simplified read-only version of Chainmap <https://code.activestate.com/recipes/305268/>`_.
es_es: Una `versión de sólo lectura muy simplificada de Chainmap <https://code.activestate.com/recipes/305268/>`_.
ru: `Значительно упрощенная версия Chainmap, доступная только для чтения <https://code.activestate.com/recipes/305268/>`_.

source: :class:`ChainMap` Examples and Recipes
es_es: :class:`ChainMap` Ejemplos y recetas
ru: :class:`ChainMap` Примеры и рецепты

source: This section shows various approaches to working with chained maps.
es_es: Esta sección muestra varios enfoques para trabajar con mapas encadenados.
ru: В этом разделе показаны различные подходы к работе с цепочками карт.

source: import builtins pylookup = ChainMap(locals(), globals(), vars(builtins))
es_es: importar builtins pylookup = ChainMap(locals(), globals(), vars(builtins))

source: Example of letting user specified command-line arguments take precedence over environment variables which in turn take precedence over default values::
es_es: Ejemplo de cómo dejar que los argumentos de línea de comandos especificados por el usuario tengan prioridad sobre las variables de entorno que, a su vez, tienen prioridad sobre los valores por defecto::
ru: Пример предоставления права аргументам командной строки, указанным пользователем, иметь приоритет над переменными среды, которые, в свою очередь, имеют приоритет над значениями по умолчанию:

source: Example patterns for using the :class:`ChainMap` class to simulate nested contexts::
es_es: Patrones de ejemplo para utilizar la clase :class:`ChainMap` para simular contextos anidados::
ru: Примеры шаблонов использования класса :class:`ChainMap` для имитации вложенных контекстов::

source: c = ChainMap() # Create root context d = c.new_child() # Create nested child context e = c.new_child() # Child of c, independent from d e.maps[0] # Current context dictionary -- like Python's locals() e.maps[-1] # Root context -- like Python's globals() e.parents # Enclosing context chain -- like Python's nonlocals d['x'] = 1 # Set value in current context d['x'] # Get first key in the chain of contexts del d['x'] # Delete from current context list(d) # All nested values k in d # Check all nested values len(d) # Number of nested values d.items() # All nested items dict(d) # Flatten into a regular dictionary
es_es: c = ChainMap() # Crear contexto raíz d = c.new_child() # Crear contexto hijo anidado e = c.new_child() # Hijo de c, independiente de d e.maps[0] # Diccionario del contexto actual -- como locals() de Python e.maps[-1] # Contexto raíz -- como globals() de Python e.parents # Cadena de contexto adjunta -- como nonlocals de Python d['x'] = 1 # Establece el valor en el contexto actual d['x'] # Obtener la primera clave en la cadena de contextos del d['x'] # Borrar del contexto actual list(d) # Todos los valores anidados k en d # Comprueba todos los valores anidados len(d) # Número de valores anidados d.items() # Todos los elementos anidados dict(d) # Convertir en un diccionario normal

source: The :class:`ChainMap` class only makes updates (writes and deletions) to the first mapping in the chain while lookups will search the full chain. However, if deep writes and deletions are desired, it is easy to make a subclass that updates keys found deeper in the chain::
es_es: La clase :class:`ChainMap` sólo realiza actualizaciones (escrituras y borrados) en el primer mapeo de la cadena, mientras que las búsquedas se realizan en toda la cadena. Sin embargo, si se desea realizar escrituras y borrados profundos, es fácil crear una subclase que actualice las claves que se encuentran a mayor profundidad en la cadena::
ru: Класс :class:`ChainMap` обновляет (записывает и удаляет) только первое сопоставление в цепочке, тогда как поиск будет выполнять поиск по всей цепочке. Однако, если желательны глубокие записи и удаления, легко создать подкласс, который обновляет ключи, находящиеся глубже в цепочке:

source: class DeepChainMap(ChainMap): 'Variant of ChainMap that allows direct updates to inner scopes' def __setitem__(self, key, value): for mapping in self.maps: if key in mapping: mapping[key] = value return self.maps[0][key] = value def __delitem__(self, key): for mapping in self.maps: if key in mapping: del mapping[key] return raise KeyError(key) >>> d = DeepChainMap({'zebra': 'black'}, {'elephant': 'blue'}, {'lion': 'yellow'}) >>> d['lion'] = 'orange' # update an existing key two levels down >>> d['snake'] = 'red' # new keys get added to the topmost dict >>> del d['elephant'] # remove an existing key one level down >>> d # display result DeepChainMap({'zebra': 'black', 'snake': 'red'}, {}, {'lion': 'orange'})
es_es: class DeepChainMap(ChainMap): 'Variant of ChainMap that allows direct updates to inner scopes' def __setitem__(self, key, value): for mapping in self.maps: if key in mapping: mapping[key] = value return self.maps[0][key] = value def __delitem__(self, key): for mapping in self.maps: if key in mapping: del mapping[key] return raise KeyError(key) >>> d = DeepChainMap({'zebra': 'black'}, {'elephant': 'blue'}, {'lion': 'yellow'}) >>> d['lion'] = 'orange' # actualizar una clave existente dos niveles abajo >>> d['snake'] = 'red' # se agregan nuevas claves al diccionario superior >>> del d['elephant'] # eliminar una clave existente en un nivel más abajo >>> d # visualizar el resultado DeepChainMap({'zebra': 'black', 'snake': 'red'}, {}, {'lion': 'orange'})

source: :class:`Counter` objects
es_es: :class:`Counter` objetos
ru: :class:`Counter` Счетчик

source: A counter tool is provided to support convenient and rapid tallies. For example::
es_es: Se proporciona una herramienta de recuento que permite realizar recuentos cómodos y rápidos. Por ejemplo::
ru: Инструмент счетчик предназначен для поддержки удобных и быстрых подсчетов. Например::

source: >>> # Tally occurrences of words in a list >>> cnt = Counter() >>> for word in ['red', 'blue', 'red', 'green', 'blue', 'blue']: ... cnt[word] += 1 ... >>> cnt Counter({'blue': 3, 'red': 2, 'green': 1}) >>> # Find the ten most common words in Hamlet >>> import re >>> words = re.findall(r'\w+', open('hamlet.txt').read().lower()) >>> Counter(words).most_common(10) [('the', 1143), ('and', 966), ('to', 762), ('of', 669), ('i', 631), ('you', 554), ('a', 546), ('my', 514), ('hamlet', 471), ('in', 451)]
es_es: >>> # Cuenta las ocurrencias de palabras en una lista >>> cnt = Counter() >>> for word in ['red', 'blue', 'red', 'green', 'blue', 'blue']: ... cnt[word] += 1 ... >>> cnt Counter({'blue': 3, 'red': 2, 'green' 1}) >>> # Encuentra las diez palabras más comunes en Hamlet >>> import re >>> words = re.findall(r'\w+', open('hamlet.txt').read().lower()) >>> Counter(words).most_common(10) [('the', 1143), ('and', 966), ('to', 762), ('of', 669), ('i', 631), ('you', 554), ('a', 546), ('my', 514), ('hamlet', 471), ('in', 451)]

source: A :class:`Counter` is a :class:`dict` subclass for counting :term:`hashable` objects. It is a collection where elements are stored as dictionary keys and their counts are stored as dictionary values. Counts are allowed to be any integer value including zero or negative counts. The :class:`Counter` class is similar to bags or multisets in other languages.
es_es: Un :class:`Counter` es una subclase de :class:`dict` para contar objetos :term:`hashable`. Es una colección en la que los elementos se almacenan como claves del diccionario y sus recuentos se almacenan como valores del diccionario. Los recuentos pueden ser cualquier valor entero, incluidos recuentos cero o negativos. La clase :class:`Counter` es similar a las bolsas o conjuntos múltiples de otros lenguajes.
ru: :class:`Counter` — это подкласс :class:`dict` для подсчёта :term:`hashable` объектов. Это коллекция, в которой элементы хранятся как ключи словаря, а их количество — как значения словаря. Число может иметь любое целочисленное значение, включая нулевое или отрицательное значение. Класс :class:`Counter` похож на сумки или мультинаборы в других языках.

source: Elements are counted from an *iterable* or initialized from another *mapping* (or counter):
es_es: Los elementos se cuentan a partir de un *iterable* o se inicializan a partir de otro *mapping* (o contador):
ru: Элементы подсчитываются из *итерируемого объекта* или инициализируются от иного *маппинг объекта* (или счетчика):

source: Counter objects have a dictionary interface except that they return a zero count for missing items instead of raising a :exc:`KeyError`:
es_es: Los objetos contadores tienen una interfaz de diccionario, salvo que devuelven un recuento cero para los elementos que faltan en lugar de lanzar un mensaje :exc:`KeyError`:
ru: Объекты Counter имеют интерфейс словаря за исключением того, что они возвращают ноль для отсутствующего элемента вместо выбрасывания исключения :exc:`KeyError`:

source: Setting a count to zero does not remove an element from a counter. Use ``del`` to remove it entirely:
es_es: Poner un contador a cero no elimina un elemento de un contador. Utilizar ``del`` para eliminarlo por completo:
ru: Установка нулевого количества не удаляет элемент из счетчика. Используйте ``del`` чтобы удалить его полностью.
