Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/colorsys.po
Languages: ru

source: **Source code:** :source:`Lib/colorsys.py`
ru: **Исходный код:** :source:`Lib/colorsys.py`

source: More information about color spaces can be found at https://poynton.ca/ColorFAQ.html and https://www.cambridgeincolour.com/tutorials/color-spaces.htm.
ru: Дополнительную информацию о цветовых пространствах можно найти на https://poynton.ca/ColorFAQ.html и https://www.cambridgeincolour.com/tutorials/color-spaces.htm.

source: The :mod:`colorsys` module defines the following functions:
ru: Модуль :mod:`colorsys` определяет следующие функции:

source: Convert the color from RGB coordinates to YIQ coordinates.
ru: Преобразуйте цвет из координат RGB в координаты YIQ.

source: Convert the color from YIQ coordinates to RGB coordinates.
ru: Преобразуйте цвет из координат YIQ в координаты RGB.

source: Convert the color from RGB coordinates to HLS coordinates.
ru: Преобразуйте цвет из координат RGB в координаты HLS.

source: Convert the color from HLS coordinates to RGB coordinates.
ru: Преобразуйте цвет из координат HLS в координаты RGB.

source: Convert the color from RGB coordinates to HSV coordinates.
ru: Преобразуйте цвет из координат RGB в координаты HSV.

source: Convert the color from HSV coordinates to RGB coordinates.
ru: Преобразуйте цвет из координат HSV в координаты RGB.

source: Example::
ru: Пример::
