Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/compileall.po
Languages: ru

source: **Source code:** :source:`Lib/compileall.py`
ru: **Исходный код:** :source:`Lib/compileall.py`

source: This module provides some utility functions to support installing Python libraries. These functions compile Python source files in a directory tree. This module can be used to create the cached byte-code files at library installation time, which makes them available for use even by users who don't have write permission to the library directories.
ru: Этот модуль предоставляет некоторые служебные функции для поддержки установки библиотек Python. Эти функции компилируют исходные файлы Python в дереве каталогов. Этот модуль можно использовать для создания кэшированных файлов байт-кода во время установки библиотеки, что делает их доступными для использования даже пользователями, у которых нет разрешения на запись в каталоги библиотеки.

source: Command-line use
ru: Использование командной строки

source: This module can work as a script (using :program:`python -m compileall`) to compile Python sources.
ru: Этот модуль может работать как скрипт (используя :program:`python -m compileall`) для компиляции исходного кода Python.

source: Do not recurse into subdirectories, only compile source code files directly contained in the named or implied directories.
ru: Не используйте рекурсию в подкаталогах, а компилируйте только файлы исходного кода, непосредственно содержащиеся в названных или подразумеваемых каталогах.

source: Force rebuild even if timestamps are up-to-date.
ru: Принудительное перестроение, даже если временные метки актуальны.

source: Do not print the list of files compiled. If passed once, error messages will still be printed. If passed twice (``-qq``), all output is suppressed.
ru: Не распечатывать список скомпилированных файлов. Если пройти один раз, сообщения об ошибках все равно будут печататься. Если передано дважды (``-qq``), весь вывод подавляется.

source: Directory prepended to the path to each file being compiled. This will appear in compilation time tracebacks, and is also compiled in to the byte-code file, where it will be used in tracebacks and other messages in cases where the source file does not exist at the time the byte-code file is executed.
ru: Каталог добавляется к пути к каждому компилируемому файлу. Он будет отображаться в обратных трассировках во время компиляции, а также компилируется в файл байт-кода, где он будет использоваться в обратных трассировках и других сообщениях в тех случаях, когда исходный файл не существует во время выполнения файла байт-кода.

source: Remove (``-s``) or append (``-p``) the given prefix of paths recorded in the ``.pyc`` files. Cannot be combined with ``-d``.
ru: Удалить (``-s``) или добавить (``-p``) заданный префикс путей, записанных в файлах ``.pyc``. Невозможно комбинировать с ``-d``.

source: regex is used to search the full path to each file considered for compilation, and if the regex produces a match, the file is skipped.
ru: Регулярное выражение используется для поиска полного пути к каждому файлу, рассматриваемому для компиляции, и если регулярное выражение дает совпадение, файл пропускается.

source: Read the file ``list`` and add each line that it contains to the list of files and directories to compile. If ``list`` is ``-``, read lines from ``stdin``.
ru: Прочтите файл ``list`` и добавьте каждую содержащуюся в нем строку в список файлов и каталогов для компиляции. Если ``list`` равен ``-``, читайте строки из ``stdin``.

source: Write the byte-code files to their legacy locations and names, which may overwrite byte-code files created by another version of Python. The default is to write files to their :pep:`3147` locations and names, which allows byte-code files from multiple versions of Python to coexist.
ru: Запишите файлы байт-кода в их устаревшие местоположения и имена, которые могут перезаписать файлы байт-кода, созданные другой версией Python. По умолчанию файлы записываются в их расположение и имена :pep:`3147`, что позволяет сосуществовать файлам байт-кода из нескольких версий Python.

source: Control the maximum recursion level for subdirectories. If this is given, then ``-l`` option will not be taken into account. :program:`python -m compileall <directory> -r 0` is equivalent to :program:`python -m compileall <directory> -l`.
ru: Управляйте максимальным уровнем рекурсии для подкаталогов. Если это указано, то опция ``-l`` не будет учитываться. :program:`python -m compileall <каталог> -r 0` эквивалентен :program:`python -m compileall <каталог> -l`.

source: Control how the generated byte-code files are invalidated at runtime. The ``timestamp`` value, means that ``.pyc`` files with the source timestamp and size embedded will be generated. The ``checked-hash`` and ``unchecked-hash`` values cause hash-based pycs to be generated. Hash-based pycs embed a hash of the source file contents rather than a timestamp. See :ref:`pyc-invalidation` for more information on how Python validates bytecode cache files at runtime. The default is ``timestamp`` if the :envvar:`SOURCE_DATE_EPOCH` environment variable is not set, and ``checked-hash`` if the ``SOURCE_DATE_EPOCH`` environment variable is set.
ru: Управляйте тем, как сгенерированные файлы байт-кода становятся недействительными во время выполнения. Значение ``timestamp`` означает, что будут созданы файлы ``.pyc`` со встроенной исходной меткой времени и размером. Значения ``checked-hash`` и ``unchecked-hash`` вызывают генерацию pycs на основе хеша. pycs на основе хеша встраивают хеш содержимого исходного файла, а не метку времени. См. :ref:`pyc-invalidation` для получения дополнительной информации о том, как Python проверяет файлы кэша байт-кода во время выполнения. По умолчанию используется ``timestamp``, если переменная среды SOURCE_DATE_EPOCH` не установлена, и ``checked-hash``, если переменная среды SOURCE_DATE_EPOCH`` установлена.

source: Compile with the given optimization level. May be used multiple times to compile for multiple levels at a time (for example, ``compileall -o 1 -o 2``).
ru: Скомпилируйте с заданным уровнем оптимизации. Может использоваться несколько раз для одновременной компиляции нескольких уровней (например, ``compileall -o 1 -o 2``).

source: Ignore symlinks pointing outside the given directory.
ru: Игнорируйте символические ссылки, указывающие за пределы данного каталога.

source: If two ``.pyc`` files with different optimization level have the same content, use hard links to consolidate duplicate files.
ru: Если два файла ``.pyc`` с разным уровнем оптимизации имеют одинаковое содержимое, используйте жесткие ссылки для объединения повторяющихся файлов.

source: Added the ``-i``, ``-b`` and ``-h`` options.
ru: Добавлены опции ``-i``, ``-b`` и ``-h``.

source: Added the ``-j``, ``-r``, and ``-qq`` options. ``-q`` option was changed to a multilevel value. ``-b`` will always produce a byte-code file ending in ``.pyc``, never ``.pyo``.
ru: Добавлены опции ``-j``, ``-r`` и ``-qq``. Опция ``-q`` изменена на многоуровневое значение. ``-b`` всегда будет создавать файл с байт-кодом, оканчивающийся на ``.pyc``, и никогда ``.pyo``.

source: Added the ``--invalidation-mode`` option.
ru: Добавлен параметр --invalidation-mode.

source: Added the ``-s``, ``-p``, ``-e`` and ``--hardlink-dupes`` options. Raised the default recursion limit from 10 to :py:func:`sys.getrecursionlimit()`. Added the possibility to specify the ``-o`` option multiple times.
ru: Добавлены опции ``-s``, ``-p``, ``-e`` и ``--hardlink-dupes``. Увеличен лимит рекурсии по умолчанию с 10 до :py:func:`sys.getrecursionlimit()`. Добавлена ​​возможность указать опцию ``-o`` несколько раз.

source: There is no command-line option to control the optimization level used by the :func:`compile` function, because the Python interpreter itself already provides the option: :program:`python -O -m compileall`.
ru: Не существует опции командной строки для управления уровнем оптимизации, используемой функцией :func:`compile`, поскольку сам интерпретатор Python уже предоставляет такую ​​опцию: :program:`python -O -m compileall`.

source: Public functions
ru: Публичные функции

source: Recursively descend the directory tree named by *dir*, compiling all :file:`.py` files along the way. Return a true value if all the files compiled successfully, and a false value otherwise.
ru: Рекурсивно спуститься по дереву каталогов, указанному в *dir*, по пути компилируя все файлы :file:`.py`. Возвращает истинное значение, если все файлы скомпилированы успешно, и ложное значение в противном случае.

source: The *maxlevels* parameter is used to limit the depth of the recursion; it defaults to ``sys.getrecursionlimit()``.
ru: Параметр *maxlevels* используется для ограничения глубины рекурсии; по умолчанию используется ``sys.getrecursionlimit()``.

source: If *ddir* is given, it is prepended to the path to each file being compiled for use in compilation time tracebacks, and is also compiled in to the byte-code file, where it will be used in tracebacks and other messages in cases where the source file does not exist at the time the byte-code file is executed.
ru: Если указано *ddir*, оно добавляется к пути к каждому компилируемому файлу для использования в обратных трассировках во время компиляции, а также компилируется в файл байт-кода, где оно будет использоваться в обратных трассировках и других сообщениях в тех случаях, когда исходный файл не существует на момент выполнения файла байт-кода.

source: If *force* is true, modules are re-compiled even if the timestamps are up to date.
ru: Если *force* имеет значение true, модули перекомпилируются, даже если временные метки актуальны.

source: If *rx* is given, its ``search`` method is called on the complete path to each file considered for compilation, and if it returns a true value, the file is skipped. This can be used to exclude files matching a regular expression, given as a :ref:`re.Pattern <re-objects>` object.
ru: Если задано *rx*, его метод ``search`` вызывается по полному пути к каждому файлу, рассматриваемому для компиляции, и если он возвращает истинное значение, файл пропускается. Это можно использовать для исключения файлов, соответствующих регулярному выражению, заданному как объект :ref:`re.Pattern <re-objects>`.

source: If *quiet* is ``False`` or ``0`` (the default), the filenames and other information are printed to standard out. Set to ``1``, only errors are printed. Set to ``2``, all output is suppressed.
ru: Если *quiet* имеет значение «False» или «0» (по умолчанию), имена файлов и другая информация выводятся на стандартный вывод. Если установлено значение «1», выводятся только ошибки. Если установлено значение «2», весь вывод подавляется.

source: If *legacy* is true, byte-code files are written to their legacy locations and names, which may overwrite byte-code files created by another version of Python. The default is to write files to their :pep:`3147` locations and names, which allows byte-code files from multiple versions of Python to coexist.
ru: Если *legacy* имеет значение true, файлы байт-кода записываются в свои устаревшие местоположения и имена, что может перезаписать файлы байт-кода, созданные другой версией Python. По умолчанию файлы записываются в их расположение и имена :pep:`3147`, что позволяет сосуществовать файлам байт-кода из нескольких версий Python.

source: *optimize* specifies the optimization level for the compiler. It is passed to the built-in :func:`compile` function. Accepts also a sequence of optimization levels which lead to multiple compilations of one :file:`.py` file in one call.
ru: *optimize* указывает уровень оптимизации компилятора. Он передается встроенной функции :func:`compile`. Принимает также последовательность уровней оптимизации, которая приводит к многократной компиляции одного файла :file:`.py` за один вызов.

source: The argument *workers* specifies how many workers are used to compile files in parallel. The default is to not use multiple workers. If the platform can't use multiple workers and *workers* argument is given, then sequential compilation will be used as a fallback. If *workers* is 0, the number of cores in the system is used. If *workers* is lower than ``0``, a :exc:`ValueError` will be raised.
ru: Аргумент *workers* указывает, сколько рабочих процессов используется для параллельной компиляции файлов. По умолчанию не используется несколько рабочих. Если платформа не может использовать несколько рабочих процессов и указан аргумент *workers*, то в качестве запасного варианта будет использоваться последовательная компиляция. Если *workers* равно 0, используется количество ядер в системе. Если *workers* меньше, чем ``0``, будет выдано :exc:`ValueError`.

source: *invalidation_mode* should be a member of the :class:`py_compile.PycInvalidationMode` enum and controls how the generated pycs are invalidated at runtime.
ru: *invalidation_mode* должен быть членом перечисления :class:`py_compile.PycInvalidationMode` и контролировать, как сгенерированные pycs становятся недействительными во время выполнения.

source: The *stripdir*, *prependdir* and *limit_sl_dest* arguments correspond to the ``-s``, ``-p`` and ``-e`` options described above. They may be specified as ``str`` or :py:class:`os.PathLike`.
ru: Аргументы *stripdir*, *prependdir* и *limit_sl_dest* соответствуют опциям ``-s``, ``-p`` и ``-e``, описанным выше. Они могут быть указаны как ``str`` или :py:class:`os.PathLike`.

source: If *hardlink_dupes* is true and two ``.pyc`` files with different optimization level have the same content, use hard links to consolidate duplicate files.
ru: Если *hardlink_dupes* имеет значение true и два файла ``.pyc`` с разным уровнем оптимизации имеют одинаковое содержимое, используйте жесткие ссылки для объединения повторяющихся файлов.

source: Added the *legacy* and *optimize* parameter.
ru: Добавлены параметры *legacy* и *optimize*.

source: Added the *workers* parameter.
ru: Добавлен параметр *workers*.

source: *quiet* parameter was changed to a multilevel value.
ru: Параметр *quiet* изменен на многоуровневое значение.

source: The *legacy* parameter only writes out ``.pyc`` files, not ``.pyo`` files no matter what the value of *optimize* is.
ru: Параметр *legacy* записывает только файлы ``.pyc``, а не ``.pyo``, независимо от значения *optimize*.

source: Accepts a :term:`path-like object`.
ru: Принимает :term:`объект, похожий на путь`.

source: The *invalidation_mode* parameter was added.
ru: Добавлен параметр *invalidation_mode*.

source: Setting *workers* to 0 now chooses the optimal number of cores.
ru: Установка *workers* на 0 теперь выбирает оптимальное количество ядер.

source: Added *stripdir*, *prependdir*, *limit_sl_dest* and *hardlink_dupes* arguments. Default value of *maxlevels* was changed from ``10`` to ``sys.getrecursionlimit()``
ru: Добавлены аргументы *stripdir*, *prependdir*, *limit_sl_dest* и *hardlink_dupes*. Значение по умолчанию *maxlevels* было изменено с ``10`` на ``sys.getrecursionlimit()``.

source: Compile the file with path *fullname*. Return a true value if the file compiled successfully, and a false value otherwise.
ru: Скомпилируйте файл с путем *полное имя*. Возвращает истинное значение, если файл скомпилирован успешно, и ложное значение в противном случае.

source: If *ddir* is given, it is prepended to the path to the file being compiled for use in compilation time tracebacks, and is also compiled in to the byte-code file, where it will be used in tracebacks and other messages in cases where the source file does not exist at the time the byte-code file is executed.
ru: Если указано *ddir*, оно добавляется к пути к компилируемому файлу для использования в обратных трассировках во время компиляции, а также компилируется в файл байт-кода, где оно будет использоваться в обратных трассировках и других сообщениях в тех случаях, когда исходный файл не существует на момент выполнения файла байт-кода.

source: If *rx* is given, its ``search`` method is passed the full path name to the file being compiled, and if it returns a true value, the file is not compiled and ``True`` is returned. This can be used to exclude files matching a regular expression, given as a :ref:`re.Pattern <re-objects>` object.
ru: Если задано *rx*, его методу ``search`` передается полный путь к компилируемому файлу, и если он возвращает истинное значение, файл не компилируется и возвращается ``True``. Это можно использовать для исключения файлов, соответствующих регулярному выражению, заданному как объект :ref:`re.Pattern <re-objects>`.

source: Added *stripdir*, *prependdir*, *limit_sl_dest* and *hardlink_dupes* arguments.
ru: Добавлены аргументы *stripdir*, *prependdir*, *limit_sl_dest* и *hardlink_dupes*.

source: Byte-compile all the :file:`.py` files found along ``sys.path``. Return a true value if all the files compiled successfully, and a false value otherwise.
ru: Побайтно-компилируйте все файлы :file:`.py`, найденные по ``sys.path``. Возвращает истинное значение, если все файлы скомпилированы успешно, и ложное значение в противном случае.

source: If *skip_curdir* is true (the default), the current directory is not included in the search. All other parameters are passed to the :func:`compile_dir` function. Note that unlike the other compile functions, ``maxlevels`` defaults to ``0``.
ru: Если *skip_curdir* имеет значение true (по умолчанию), текущий каталог не включается в поиск. Все остальные параметры передаются в функцию :func:`compile_dir`. Обратите внимание, что в отличие от других функций компиляции, maxlevels по умолчанию имеет значение 0.

source: To force a recompile of all the :file:`.py` files in the :file:`Lib/` subdirectory and all its subdirectories::
ru: Чтобы принудительно перекомпилировать все файлы :file:`.py` в подкаталоге :file:`Lib/` и во всех его подкаталогах:

source: Module :mod:`py_compile`
ru: Модуль :mod:`py_compile`

source: Byte-compile a single source file.
ru: Байтовая компиляция одного исходного файла.
