Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/concurrent.futures.po
Languages: ru

source: :mod:`!concurrent.futures` --- Launching parallel tasks
ru: :mod:`!concurrent.futures` --- Запуск параллельных задач

source: **Source code:** :source:`Lib/concurrent/futures/thread.py` and :source:`Lib/concurrent/futures/process.py`
ru: **Исходный код:** :source:`Lib/concurrent/futures/thread.py` и :source:`Lib/concurrent/futures/process.py`

source: The :mod:`concurrent.futures` module provides a high-level interface for asynchronously executing callables.
ru: Модуль :mod:`concurrent.futures` предоставляет высокоуровневый интерфейс для асинхронного выполнения вызываемых объектов.

source: The asynchronous execution can be performed with threads, using :class:`ThreadPoolExecutor`, or separate processes, using :class:`ProcessPoolExecutor`. Both implement the same interface, which is defined by the abstract :class:`Executor` class.
ru: Асинхронное выполнение может выполняться с помощью потоков, используя :class:`ThreadPoolExecutor`, или отдельных процессов, используя :class:`ProcessPoolExecutor`. Оба реализуют один и тот же интерфейс, который определяется абстрактным классом :class:`Executor`.

source: Availability
ru: Доступность

source: This module does not work or is not available on WebAssembly. See :ref:`wasm-availability` for more information.
ru: Этот модуль не работает или недоступен в WebAssembly. См. :ref:`wasm-availability` для получения дополнительной информации.

source: Executor Objects
ru: Объекты исполнителя

source: An abstract class that provides methods to execute calls asynchronously. It should not be used directly, but through its concrete subclasses.
ru: Абстрактный класс, предоставляющий методы для асинхронного выполнения вызовов. Его следует использовать не напрямую, а через его конкретные подклассы.

source: Schedules the callable, *fn*, to be executed as ``fn(*args, **kwargs)`` and returns a :class:`Future` object representing the execution of the callable. ::
ru: Планирует выполнение вызываемого объекта *fn* как ``fn(*args, **kwargs)`` и возвращает объект :class:`Future`, представляющий выполнение вызываемого объекта. ::

source: with ThreadPoolExecutor(max_workers=1) as executor: future = executor.submit(pow, 323, 1235) print(future.result())
ru: с ThreadPoolExecutor(max_workers=1) в качестве исполнителя: будущее = executor.submit(pow, 323, 1235) печать(будущее.результат())

source: Similar to :func:`map(fn, *iterables) <map>` except:
ru: Аналогично :func:`map(fn, *iterables) <map>`, за исключением:

source: the *iterables* are collected immediately rather than lazily;
ru: *итерации* собираются немедленно, а не лениво;

source: *fn* is executed asynchronously and several calls to *fn* may be made concurrently.
ru: *fn* выполняется асинхронно, и несколько вызовов *fn* могут выполняться одновременно.

source: The returned iterator raises a :exc:`TimeoutError` if :meth:`~iterator.__next__` is called and the result isn't available after *timeout* seconds from the original call to :meth:`Executor.map`. *timeout* can be an int or a float. If *timeout* is not specified or ``None``, there is no limit to the wait time.
ru: Возвращенный итератор вызывает :exc:`TimeoutError`, если :meth:`~iterator.__next__` вызывается и результат недоступен по истечении *timeout* секунд с момента исходного вызова :meth:`Executor.map`. *timeout* может быть целым числом или числом с плавающей запятой. Если *timeout* не указан или ``None``, время ожидания не ограничено.

source: If a *fn* call raises an exception, then that exception will be raised when its value is retrieved from the iterator.
ru: Если вызов *fn* вызывает исключение, то это исключение будет вызвано при получении его значения от итератора.

source: When using :class:`ProcessPoolExecutor`, this method chops *iterables* into a number of chunks which it submits to the pool as separate tasks. The (approximate) size of these chunks can be specified by setting *chunksize* to a positive integer. For very long iterables, using a large value for *chunksize* can significantly improve performance compared to the default size of 1. With :class:`ThreadPoolExecutor`, *chunksize* has no effect.
ru: При использовании :class:`ProcessPoolExecutor` этот метод разбивает *итерации* на несколько фрагментов, которые отправляются в пул как отдельные задачи. (Приблизительный) размер этих фрагментов можно указать, задав для параметра *chunksize* положительное целое число. Для очень длинных итераций использование большого значения *chunksize* может значительно улучшить производительность по сравнению с размером по умолчанию, равным 1. При использовании :class:`ThreadPoolExecutor` *chunksize* не имеет никакого эффекта.

source: Added the *chunksize* argument.
ru: Добавлен аргумент *chunksize*.

source: Signal the executor that it should free any resources that it is using when the currently pending futures are done executing. Calls to :meth:`Executor.submit` and :meth:`Executor.map` made after shutdown will raise :exc:`RuntimeError`.
ru: Сообщите исполнителю, что он должен освободить все ресурсы, которые он использует, когда выполнение ожидающих в данный момент фьючерсов будет завершено. Вызовы :meth:`Executor.submit` и :meth:`Executor.map`, сделанные после завершения работы, вызовут :exc:`RuntimeError`.

source: If *wait* is ``True`` then this method will not return until all the pending futures are done executing and the resources associated with the executor have been freed. If *wait* is ``False`` then this method will return immediately and the resources associated with the executor will be freed when all pending futures are done executing. Regardless of the value of *wait*, the entire Python program will not exit until all pending futures are done executing.
ru: Если *wait* имеет значение True, то этот метод не вернет результат до тех пор, пока все ожидающие фьючерсы не будут выполнены и ресурсы, связанные с исполнителем, не будут освобождены. Если *wait* имеет значение «False», то этот метод немедленно завершит работу, и ресурсы, связанные с исполнителем, будут освобождены, когда все ожидающие фьючерсы будут выполнены. Независимо от значения *wait*, вся программа Python не завершится до тех пор, пока не будут выполнены все ожидающие фьючерсы.

source: If *cancel_futures* is ``True``, this method will cancel all pending futures that the executor has not started running. Any futures that are completed or running won't be cancelled, regardless of the value of *cancel_futures*.
ru: Если *cancel_futures* имеет значение True, этот метод отменит все ожидающие фьючерсы, которые исполнитель не начал запускать. Любые фьючерсы, которые завершены или запущены, не будут отменены, независимо от значения *cancel_futures*.

source: If both *cancel_futures* and *wait* are ``True``, all futures that the executor has started running will be completed prior to this method returning. The remaining futures are cancelled.
ru: Если оба *cancel_futures* и *wait* имеют значение True, все фьючерсы, которые начал выполнять исполнитель, будут завершены до возврата этого метода. Остальные фьючерсы аннулируются.

source: You can avoid having to call this method explicitly if you use the :keyword:`with` statement, which will shutdown the :class:`Executor` (waiting as if :meth:`Executor.shutdown` were called with *wait* set to ``True``)::
ru: Вы можете избежать необходимости явного вызова этого метода, если используете оператор :keyword:`with`, который завершит работу :class:`Executor` (ожидание, как если бы :meth:`Executor.shutdown` был вызван с установленным *wait* на ``True``)::

source: Added *cancel_futures*.
ru: Добавлено *cancel_futures*.

source: :class:`ThreadPoolExecutor` is an :class:`Executor` subclass that uses a pool of threads to execute calls asynchronously.
ru: :class:`ThreadPoolExecutor` — это подкласс :class:`Executor`, который использует пул потоков для асинхронного выполнения вызовов.

source: Deadlocks can occur when the callable associated with a :class:`Future` waits on the results of another :class:`Future`. For example::
ru: Взаимные блокировки могут возникать, когда вызываемый объект, связанный с :class:`Future`, ожидает результатов другого :class:`Future`. Например::

source: And::
ru: И::

source: An :class:`Executor` subclass that uses a pool of at most *max_workers* threads to execute calls asynchronously.
ru: Подкласс :class:`Executor`, который использует пул не более чем *max_workers* потоков для асинхронного выполнения вызовов.

source: All threads enqueued to ``ThreadPoolExecutor`` will be joined before the interpreter can exit. Note that the exit handler which does this is executed *before* any exit handlers added using ``atexit``. This means exceptions in the main thread must be caught and handled in order to signal threads to exit gracefully. For this reason, it is recommended that ``ThreadPoolExecutor`` not be used for long-running tasks.
ru: Все потоки, поставленные в очередь в ThreadPoolExecutor, будут объединены до того, как интерпретатор сможет выйти. Обратите внимание, что обработчик выхода, который это делает, выполняется *перед* любыми обработчиками выхода, добавленными с помощью ``atexit``. Это означает, что исключения в основном потоке должны перехватываться и обрабатываться, чтобы сигнализировать потокам о корректном выходе. По этой причине не рекомендуется использовать ThreadPoolExecutor для долго выполняющихся задач.

source: *initializer* is an optional callable that is called at the start of each worker thread; *initargs* is a tuple of arguments passed to the initializer. Should *initializer* raise an exception, all currently pending jobs will raise a :exc:`~concurrent.futures.thread.BrokenThreadPool`, as well as any attempt to submit more jobs to the pool.
ru: *initializer* — это необязательный вызываемый объект, который вызывается в начале каждого рабочего потока; *initargs* — это кортеж аргументов, передаваемых инициализатору. Если *initializer* вызовет исключение, все ожидающие в данный момент задания вызовут :exc:`~concurrent.futures.thread.BrokenThreadPool`, а также любая попытка отправить больше заданий в пул.

source: If *max_workers* is ``None`` or not given, it will default to the number of processors on the machine, multiplied by ``5``, assuming that :class:`ThreadPoolExecutor` is often used to overlap I/O instead of CPU work and the number of workers should be higher than the number of workers for :class:`ProcessPoolExecutor`.
ru: Если *max_workers* имеет значение «None» или не задано, по умолчанию оно будет равно количеству процессоров на машине, умноженному на «5», предполагая, что :class:`ThreadPoolExecutor` часто используется для перекрытия операций ввода-вывода. вместо работы процессора, и количество рабочих должно быть больше, чем количество рабочих для :class:`ProcessPoolExecutor`.

source: Added the *thread_name_prefix* parameter to allow users to control the :class:`threading.Thread` names for worker threads created by the pool for easier debugging.
ru: Добавлен параметр *thread_name_prefix*, позволяющий пользователям управлять именами :class:`threading.Thread` для рабочих потоков, созданных пулом, для упрощения отладки.

source: Added the *initializer* and *initargs* arguments.
ru: Добавлены аргументы *initializer* и *initargs*.

source: Default value of *max_workers* is changed to ``min(32, os.cpu_count() + 4)``. This default value preserves at least 5 workers for I/O bound tasks. It utilizes at most 32 CPU cores for CPU bound tasks which release the GIL. And it avoids using very large resources implicitly on many-core machines.
ru: Значение по умолчанию *max_workers* изменено на ``min(32, os.cpu_count() + 4)``. Это значение по умолчанию сохраняет как минимум 5 рабочих процессов для задач, связанных с вводом-выводом. Он использует не более 32 ядер ЦП для задач, связанных с ЦП, которые освобождают GIL. И это позволяет избежать неявного использования очень больших ресурсов на многоядерных машинах.

source: ThreadPoolExecutor now reuses idle worker threads before starting *max_workers* worker threads too.
ru: ThreadPoolExecutor теперь повторно использует простаивающие рабочие потоки перед запуском рабочих потоков *max_workers*.

source: Default value of *max_workers* is changed to ``min(32, (os.process_cpu_count() or 1) + 4)``.
ru: Значение по умолчанию *max_workers* изменено на ``min(32, (os.process_cpu_count() или 1) + 4)``.

source: ThreadPoolExecutor Example
ru: Пример ThreadPoolExecutor

source: The :class:`ProcessPoolExecutor` class is an :class:`Executor` subclass that uses a pool of processes to execute calls asynchronously. :class:`ProcessPoolExecutor` uses the :mod:`multiprocessing` module, which allows it to side-step the :term:`Global Interpreter Lock <global interpreter lock>` but also means that only picklable objects can be executed and returned.
ru: Класс :class:`ProcessPoolExecutor` является подклассом :class:`Executor`, который использует пул процессов для асинхронного выполнения вызовов. :class:`ProcessPoolExecutor` использует модуль :mod:`multiprocessing`, который позволяет ему обойти :term:`Global Interpreter Lock <глобальную блокировку интерпретатора>`, но также означает, что могут выполняться и возвращаться только поддающиеся выбору объекты.

source: The ``__main__`` module must be importable by worker subprocesses. This means that :class:`ProcessPoolExecutor` will not work in the interactive interpreter.
ru: Модуль ``__main__`` должен быть доступен для импорта рабочими подпроцессами. Это означает, что :class:`ProcessPoolExecutor` не будет работать в интерактивном интерпретаторе.

source: Calling :class:`Executor` or :class:`Future` methods from a callable submitted to a :class:`ProcessPoolExecutor` will result in deadlock.
ru: Вызов методов :class:`Executor` или :class:`Future` из вызываемого объекта, отправленного в :class:`ProcessPoolExecutor`, приведет к взаимоблокировке.

source: An :class:`Executor` subclass that executes calls asynchronously using a pool of at most *max_workers* processes. If *max_workers* is ``None`` or not given, it will default to :func:`os.process_cpu_count`. If *max_workers* is less than or equal to ``0``, then a :exc:`ValueError` will be raised. On Windows, *max_workers* must be less than or equal to ``61``. If it is not then :exc:`ValueError` will be raised. If *max_workers* is ``None``, then the default chosen will be at most ``61``, even if more processors are available. *mp_context* can be a :mod:`multiprocessing` context or ``None``. It will be used to launch the workers. If *mp_context* is ``None`` or not given, the default :mod:`multiprocessing` context is used. See :ref:`multiprocessing-start-methods`.
ru: Подкласс :class:`Executor`, который выполняет вызовы асинхронно, используя пул, содержащий не более *max_workers* процессов. Если *max_workers* имеет значение «None» или не задано, по умолчанию будет использоваться :func:`os.process_cpu_count`. Если *max_workers* меньше или равно «0», то будет выдано :exc:`ValueError`. В Windows *max_workers* должно быть меньше или равно ``61``. Если это не так, то будет выдано :exc:`ValueError`. Если *max_workers* имеет значение None, то по умолчанию будет выбрано не более 61, даже если доступно больше процессоров. *mp_context* может быть :mod:`многопроцессорным` контекстом или ``Нет``. Он будет использоваться для запуска рабочих. Если *mp_context* имеет значение None или не указан, используется контекст :mod:`multiprocessing` по умолчанию. См. :ref:`мультипроцессорные-стартовые методы`.

source: *initializer* is an optional callable that is called at the start of each worker process; *initargs* is a tuple of arguments passed to the initializer. Should *initializer* raise an exception, all currently pending jobs will raise a :exc:`~concurrent.futures.process.BrokenProcessPool`, as well as any attempt to submit more jobs to the pool.
ru: *initializer* — это необязательный вызываемый объект, который вызывается в начале каждого рабочего процесса; *initargs* — это кортеж аргументов, передаваемых инициализатору. Если *initializer* выдаст исключение, все ожидающие в данный момент задания вызовут :exc:`~concurrent.futures.process.BrokenProcessPool`, а также любая попытка отправить больше заданий в пул.

source: *max_tasks_per_child* is an optional argument that specifies the maximum number of tasks a single process can execute before it will exit and be replaced with a fresh worker process. By default *max_tasks_per_child* is ``None`` which means worker processes will live as long as the pool. When a max is specified, the "spawn" multiprocessing start method will be used by default in absence of a *mp_context* parameter. This feature is incompatible with the "fork" start method.
ru: *max_tasks_per_child* — это необязательный аргумент, указывающий максимальное количество задач, которые может выполнить один процесс, прежде чем он завершится и будет заменен новым рабочим процессом. По умолчанию *max_tasks_per_child* имеет значение «Нет», что означает, что рабочие процессы будут существовать до тех пор, пока пул. Если указано максимальное значение, метод запуска многопроцессорной обработки «spawn» будет использоваться по умолчанию при отсутствии параметра *mp_context*. Эта функция несовместима с методом запуска «вилка».

source: When one of the worker processes terminates abruptly, a :exc:`~concurrent.futures.process.BrokenProcessPool` error is now raised. Previously, behaviour was undefined but operations on the executor or its futures would often freeze or deadlock.
ru: Когда один из рабочих процессов внезапно завершается, теперь возникает ошибка :exc:`~concurrent.futures.process.BrokenProcessPool`. Раньше поведение было неопределенным, но операции с исполнителем или его фьючерсами часто зависали или блокировались.

source: The *mp_context* argument was added to allow users to control the start_method for worker processes created by the pool.
ru: Аргумент *mp_context* был добавлен, чтобы позволить пользователям управлять start_method для рабочих процессов, созданных пулом.

source: The default :mod:`multiprocessing` start method (see :ref:`multiprocessing-start-methods`) will change away from *fork* in Python 3.14. Code that requires *fork* be used for their :class:`ProcessPoolExecutor` should explicitly specify that by passing a ``mp_context=multiprocessing.get_context("fork")`` parameter.
ru: Метод запуска :mod:`multiprocessing` по умолчанию (см. :ref:`multiprocessing-start-methods`) изменится с *fork* в Python 3.14. Код, который требует использования *fork* для своего :class:`ProcessPoolExecutor`, должен явно указать это, передав параметр mp_context=multiprocessing.get_context("fork")``.

source: The *max_tasks_per_child* argument was added to allow users to control the lifetime of workers in the pool.
ru: Аргумент *max_tasks_per_child* был добавлен, чтобы позволить пользователям контролировать время жизни воркеров в пуле.

source: On POSIX systems, if your application has multiple threads and the :mod:`multiprocessing` context uses the ``"fork"`` start method: The :func:`os.fork` function called internally to spawn workers may raise a :exc:`DeprecationWarning`. Pass a *mp_context* configured to use a different start method. See the :func:`os.fork` documentation for further explanation.
ru: В системах POSIX, если ваше приложение имеет несколько потоков и контекст :mod:`multiprocessing`` использует метод запуска ``"fork"``: Функция :func:`os.fork`, вызываемая внутренне для создания рабочих процессов, может вызвать : exc:`DeprecationWarning`. Передайте *mp_context*, настроенный на использование другого метода запуска. Дополнительную информацию смотрите в документации :func:`os.fork`.

source: *max_workers* uses :func:`os.process_cpu_count` by default, instead of :func:`os.cpu_count`.
ru: *max_workers* по умолчанию использует :func:`os.process_cpu_count` вместо :func:`os.cpu_count`.

source: ProcessPoolExecutor Example
ru: Пример ProcessPoolExecutor

source: Future Objects
ru: Объекты будущего

source: The :class:`Future` class encapsulates the asynchronous execution of a callable. :class:`Future` instances are created by :meth:`Executor.submit`.
ru: Класс :class:`Future` инкапсулирует асинхронное выполнение вызываемого объекта. Экземпляры :class:`Future` создаются с помощью :meth:`Executor.submit`.

source: Encapsulates the asynchronous execution of a callable. :class:`Future` instances are created by :meth:`Executor.submit` and should not be created directly except for testing.
ru: Инкапсулирует асинхронное выполнение вызываемого объекта. Экземпляры :class:`Future` создаются :meth:`Executor.submit` и не должны создаваться напрямую, за исключением случаев тестирования.

source: Attempt to cancel the call. If the call is currently being executed or finished running and cannot be cancelled then the method will return ``False``, otherwise the call will be cancelled and the method will return ``True``.
ru: Попытайтесь отменить звонок. Если вызов в данный момент выполняется или завершен и не может быть отменен, метод вернет «False», в противном случае вызов будет отменен, и метод вернет «True».

source: Return ``True`` if the call was successfully cancelled.
ru: Верните True, если вызов был успешно отменен.

source: Return ``True`` if the call is currently being executed and cannot be cancelled.
ru: Верните True, если вызов в данный момент выполняется и не может быть отменен.

source: Return ``True`` if the call was successfully cancelled or finished running.
ru: Верните True, если вызов был успешно отменен или завершен.

source: Return the value returned by the call. If the call hasn't yet completed then this method will wait up to *timeout* seconds. If the call hasn't completed in *timeout* seconds, then a :exc:`TimeoutError` will be raised. *timeout* can be an int or float. If *timeout* is not specified or ``None``, there is no limit to the wait time.
ru: Верните значение, возвращенное вызовом. Если вызов еще не завершен, этот метод будет ждать до *timeout* секунд. Если вызов не завершился в течение *timeout* секунд, то будет выдано :exc:`TimeoutError`. *timeout* может быть целым числом или числом с плавающей запятой. Если *timeout* не указан или ``None``, время ожидания не ограничено.

source: If the future is cancelled before completing then :exc:`.CancelledError` will be raised.
ru: Если будущее отменено до завершения, то будет поднято :exc:`.CancelledError`.

source: If the call raised an exception, this method will raise the same exception.
ru: Если вызов вызвал исключение, этот метод вызовет то же исключение.

source: Return the exception raised by the call. If the call hasn't yet completed then this method will wait up to *timeout* seconds. If the call hasn't completed in *timeout* seconds, then a :exc:`TimeoutError` will be raised. *timeout* can be an int or float. If *timeout* is not specified or ``None``, there is no limit to the wait time.
ru: Верните исключение, вызванное вызовом. Если вызов еще не завершен, этот метод будет ждать до *timeout* секунд. Если вызов не завершился в течение *timeout* секунд, то будет выдано :exc:`TimeoutError`. *timeout* может быть целым числом или числом с плавающей запятой. Если *timeout* не указан или ``None``, время ожидания не ограничено.

source: If the call completed without raising, ``None`` is returned.
ru: Если вызов завершен без поднятия, возвращается None.

source: Attaches the callable *fn* to the future. *fn* will be called, with the future as its only argument, when the future is cancelled or finishes running.
ru: Прикрепляет вызываемую *fn* к будущему. *fn* будет вызываться с будущим в качестве единственного аргумента, когда будущее будет отменено или закончится.
