Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/concurrent.futures.po
Languages: ru

source: Added callables are called in the order that they were added and are always called in a thread belonging to the process that added them. If the callable raises an :exc:`Exception` subclass, it will be logged and ignored. If the callable raises a :exc:`BaseException` subclass, the behavior is undefined.
ru: Добавленные вызываемые объекты вызываются в том порядке, в котором они были добавлены, и всегда вызываются в потоке, принадлежащем процессу, который их добавил. Если вызываемый объект вызывает подкласс :exc:`Exception`, он будет зарегистрирован и проигнорирован. Если вызываемый объект вызывает подкласс :exc:`BaseException`, поведение не определено.

source: If the future has already completed or been cancelled, *fn* will be called immediately.
ru: Если будущее уже завершено или отменено, *fn* будет вызвана немедленно.

source: The following :class:`Future` methods are meant for use in unit tests and :class:`Executor` implementations.
ru: Следующие методы :class:`Future` предназначены для использования в модульных тестах и ​​реализациях :class:`Executor`.

source: This method should only be called by :class:`Executor` implementations before executing the work associated with the :class:`Future` and by unit tests.
ru: Этот метод следует вызывать только реализациями :class:`Executor` перед выполнением работы, связанной с :class:`Future`, а также с помощью модульных тестов.

source: If the method returns ``False`` then the :class:`Future` was cancelled, i.e. :meth:`Future.cancel` was called and returned ``True``. Any threads waiting on the :class:`Future` completing (i.e. through :func:`as_completed` or :func:`wait`) will be woken up.
ru: Если метод возвращает ``False``, то :class:`Future` был отменен, т.е. :meth:`Future.cancel` был вызван и вернул ``True``. Любые потоки, ожидающие завершения :class:`Future` (т.е. через :func:`as_completed` или :func:`wait`), будут пробуждаться.

source: If the method returns ``True`` then the :class:`Future` was not cancelled and has been put in the running state, i.e. calls to :meth:`Future.running` will return ``True``.
ru: Если метод возвращает ``True``, то :class:`Future` не был отменен и переведен в рабочее состояние, т.е. вызовы :meth:`Future.running` вернут ``True``.

source: This method can only be called once and cannot be called after :meth:`Future.set_result` or :meth:`Future.set_exception` have been called.
ru: Этот метод можно вызвать только один раз и нельзя вызвать после вызова :meth:`Future.set_result` или :meth:`Future.set_Exception`.

source: Sets the result of the work associated with the :class:`Future` to *result*.
ru: Устанавливает результат работы, связанной с :class:`Future`, в *result*.

source: This method should only be used by :class:`Executor` implementations and unit tests.
ru: Этот метод следует использовать только реализациями :class:`Executor` и модульными тестами.

source: This method raises :exc:`concurrent.futures.InvalidStateError` if the :class:`Future` is already done.
ru: Этот метод вызывает :exc:`concurrent.futures.InvalidStateError`, если :class:`Future` уже выполнен.

source: Sets the result of the work associated with the :class:`Future` to the :class:`Exception` *exception*.
ru: Устанавливает результат работы, связанной с :class:`Future`, в :class:`Exception` *Exception*.

source: Module Functions
ru: Функции модуля

source: Wait for the :class:`Future` instances (possibly created by different :class:`Executor` instances) given by *fs* to complete. Duplicate futures given to *fs* are removed and will be returned only once. Returns a named 2-tuple of sets. The first set, named ``done``, contains the futures that completed (finished or cancelled futures) before the wait completed. The second set, named ``not_done``, contains the futures that did not complete (pending or running futures).
ru: Подождите, пока экземпляры :class:`Future` (возможно, созданные разными экземплярами :class:`Executor`), заданные *fs*, завершатся. Повторяющиеся фьючерсы, переданные *fs*, удаляются и возвращаются только один раз. Возвращает именованный кортеж из двух множеств. Первый набор, названный «done», содержит фьючерсы, которые завершились (завершившиеся или отмененные фьючерсы) до завершения ожидания. Второй набор, названный ``not_done``, содержит незавершенные фьючерсы (ожидающие или текущие фьючерсы).

source: *timeout* can be used to control the maximum number of seconds to wait before returning. *timeout* can be an int or float. If *timeout* is not specified or ``None``, there is no limit to the wait time.
ru: *timeout* можно использовать для управления максимальным количеством секунд ожидания перед возвратом. *timeout* может быть целым числом или числом с плавающей запятой. Если *timeout* не указан или ``None``, время ожидания не ограничено.

source: *return_when* indicates when this function should return. It must be one of the following constants:
ru: *return_when* указывает, когда эта функция должна вернуться. Это должна быть одна из следующих констант:

source: Constant
ru: Константа

source: Description
ru: Описание

source: The function will return when any future finishes or is cancelled.
ru: Функция вернется, когда любое будущее завершится или будет отменено.

source: The function will return when any future finishes by raising an exception. If no future raises an exception then it is equivalent to :const:`ALL_COMPLETED`.
ru: Функция вернется, когда любое будущее завершится вызовом исключения. Если никакое будущее не вызывает исключение, это эквивалентно :const:`ALL_COMPLETED`.

source: The function will return when all futures finish or are cancelled.
ru: Функция вернется, когда все фьючерсы закончатся или будут отменены.

source: Returns an iterator over the :class:`Future` instances (possibly created by different :class:`Executor` instances) given by *fs* that yields futures as they complete (finished or cancelled futures). Any futures given by *fs* that are duplicated will be returned once. Any futures that completed before :func:`as_completed` is called will be yielded first. The returned iterator raises a :exc:`TimeoutError` if :meth:`~iterator.__next__` is called and the result isn't available after *timeout* seconds from the original call to :func:`as_completed`. *timeout* can be an int or float. If *timeout* is not specified or ``None``, there is no limit to the wait time.
ru: Возвращает итератор для экземпляров :class:`Future` (возможно, созданных разными экземплярами :class:`Executor`), заданных *fs*, который возвращает фьючерсы по мере их завершения (завершенные или отмененные фьючерсы). Любые дублированные фьючерсы, заданные *fs*, будут возвращены один раз. Любые фьючерсы, которые завершились до вызова :func:`as_completed`, будут выданы первыми. Возвращенный итератор вызывает :exc:`TimeoutError`, если :meth:`~iterator.__next__` вызывается и результат недоступен по истечении *timeout* секунд с момента исходного вызова :func:`as_completed`. *timeout* может быть целым числом или числом с плавающей запятой. Если *timeout* не указан или ``None``, время ожидания не ограничено.

source: :pep:`3148` -- futures - execute computations asynchronously
ru: :pep:`3148` -- фьючерсы - выполнять вычисления асинхронно

source: The proposal which described this feature for inclusion in the Python standard library.
ru: Предложение, описывающее эту функцию для включения в стандартную библиотеку Python.

source: Exception classes
ru: Классы исключений

source: Raised when a future is cancelled.
ru: Поднимается, когда будущее отменяется.

source: A deprecated alias of :exc:`TimeoutError`, raised when a future operation exceeds the given timeout.
ru: Устаревший псевдоним :exc:`TimeoutError`, вызываемый, когда будущая операция превышает заданное время ожидания.

source: This class was made an alias of :exc:`TimeoutError`.
ru: Этот класс стал псевдонимом :exc:`TimeoutError`.

source: Derived from :exc:`RuntimeError`, this exception class is raised when an executor is broken for some reason, and cannot be used to submit or execute new tasks.
ru: Этот класс исключений, производный от :exc:`RuntimeError`, вызывается, когда исполнитель по какой-либо причине выходит из строя, и его нельзя использовать для отправки или выполнения новых задач.

source: Raised when an operation is performed on a future that is not allowed in the current state.
ru: Возникает, когда операция выполняется в будущем, что не разрешено в текущем состоянии.

source: Derived from :exc:`~concurrent.futures.BrokenExecutor`, this exception class is raised when one of the workers of a :class:`~concurrent.futures.ThreadPoolExecutor` has failed initializing.
ru: Этот класс исключений, производный от :exc:`~concurrent.futures.BrokenExecutor`, вызывается, когда один из рабочих :class:`~concurrent.futures.ThreadPoolExecutor` не смог инициализироваться.

source: Derived from :exc:`~concurrent.futures.BrokenExecutor` (formerly :exc:`RuntimeError`), this exception class is raised when one of the workers of a :class:`~concurrent.futures.ProcessPoolExecutor` has terminated in a non-clean fashion (for example, if it was killed from the outside).
ru: Этот класс исключений, производный от :exc:`~concurrent.futures.BrokenExecutor` (ранее :exc:`RuntimeError`), вызывается, когда один из рабочих процессов :class:`~concurrent.futures.ProcessPoolExecutor` завершается в нечистый мод (например, если его убили снаружи).
