Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/constants.po
Languages: ru

source: Built-in Constants
ru: Встроенные константы

source: A small number of constants live in the built-in namespace. They are:
ru: Небольшое количество констант находится во встроенном пространстве имен. Это:

source: The false value of the :class:`bool` type. Assignments to ``False`` are illegal and raise a :exc:`SyntaxError`.
ru: Ложное значение типа :class:`bool`. Присвоение ``False`` недопустимо и вызывает ошибку :exc:`SyntaxError`.

source: The true value of the :class:`bool` type. Assignments to ``True`` are illegal and raise a :exc:`SyntaxError`.
ru: Истинное значение типа :class:`bool`. Присвоение ``True`` недопустимо и вызывает ошибку :exc:`SyntaxError`.

source: See :ref:`implementing-the-arithmetic-operations` for examples.
ru: Примеры см. в разделе «Реализация арифметических операций».

source: The same as the ellipsis literal "``...``". Special value used mostly in conjunction with extended slicing syntax for user-defined container data types. ``Ellipsis`` is the sole instance of the :data:`types.EllipsisType` type.
ru: То же, что и многоточие "``...``". Специальное значение, используемое в основном в сочетании с расширенным синтаксисом срезов для пользовательских типов данных контейнера. ``Ellipsis`` — единственный экземпляр типа :data:`types.EllipsisType`.

source: This constant is true if Python was not started with an :option:`-O` option. See also the :keyword:`assert` statement.
ru: Эта константа верна, если Python не был запущен с опцией :option:`-O`. См. также оператор :keyword:`assert`.

source: The names :data:`None`, :data:`False`, :data:`True` and :data:`__debug__` cannot be reassigned (assignments to them, even as an attribute name, raise :exc:`SyntaxError`), so they can be considered "true" constants.
ru: Имена :data:`None`, :data:`False`, :data:`True` и :data:`__debug__` не могут быть переназначены (присвоение им, даже в качестве имени атрибута, вызывает :exc:`SyntaxError` ), поэтому их можно считать «истинными» константами.

source: Constants added by the :mod:`site` module
ru: Константы, добавленные модулем :mod:`site`

source: The :mod:`site` module (which is imported automatically during startup, except if the :option:`-S` command-line option is given) adds several constants to the built-in namespace. They are useful for the interactive interpreter shell and should not be used in programs.
ru: Модуль :mod:`site` (который импортируется автоматически во время запуска, за исключением случаев, когда указана опция командной строки :option:`-S`) добавляет несколько констант во встроенное пространство имен. Они полезны для оболочки интерактивного интерпретатора и не должны использоваться в программах.

source: Objects that when printed, print a message like "Use quit() or Ctrl-D (i.e. EOF) to exit", and when called, raise :exc:`SystemExit` with the specified exit code.
ru: Объекты, которые при печати выводят сообщение типа «Используйте quit() или Ctrl-D (т.е. EOF) для выхода», а при вызове вызывают :exc:`SystemExit` с указанным кодом выхода.

source: Objects that when printed or called, print the text of copyright or credits, respectively.
ru: Объекты, которые при печати или вызове печатают текст об авторских правах или авторских правах соответственно.

source: Object that when printed, prints the message "Type license() to see the full license text", and when called, displays the full license text in a pager-like fashion (one screen at a time).
ru: Объект, который при печати печатает сообщение «Введите лицензию(), чтобы увидеть полный текст лицензии», а при вызове отображает полный текст лицензии в виде пейджера (по одному экрану за раз).
