Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/contextlib.po
Languages: ru

source: :mod:`!contextlib` --- Utilities for :keyword:`!with`\ -statement contexts
ru: :mod:`!contextlib` --- Утилиты для контекстов :keyword:`!with`\ -statement

source: **Source code:** :source:`Lib/contextlib.py`
ru: **Исходный код:** :source:`Lib/contextlib.py`

source: This module provides utilities for common tasks involving the :keyword:`with` statement. For more information see also :ref:`typecontextmanager` and :ref:`context-managers`.
ru: Этот модуль предоставляет утилиты для распространенных задач, связанных с оператором :keyword:`with`. Для получения дополнительной информации см. также :ref:`typecontextmanager` и :ref:`context-managers`.

source: Utilities
ru: Утилиты

source: Functions and classes provided:
ru: Предоставляемые функции и классы:

source: An :term:`abstract base class` for classes that implement :meth:`object.__enter__` and :meth:`object.__exit__`. A default implementation for :meth:`object.__enter__` is provided which returns ``self`` while :meth:`object.__exit__` is an abstract method which by default returns ``None``. See also the definition of :ref:`typecontextmanager`.
ru: :term:`абстрактный базовый класс` для классов, реализующих :meth:`object.__enter__` и :meth:`object.__exit__`. Предоставляется реализация по умолчанию для :meth:`object.__enter__`, которая возвращает ``self``, в то время как :meth:`object.__exit__` является абстрактным методом, который по умолчанию возвращает ``None``. См. также определение :ref:`typecontextmanager`.

source: An :term:`abstract base class` for classes that implement :meth:`object.__aenter__` and :meth:`object.__aexit__`. A default implementation for :meth:`object.__aenter__` is provided which returns ``self`` while :meth:`object.__aexit__` is an abstract method which by default returns ``None``. See also the definition of :ref:`async-context-managers`.
ru: :term:`абстрактный базовый класс` для классов, реализующих :meth:`object.__aenter__` и :meth:`object.__aexit__`. Предоставляется реализация по умолчанию для :meth:`object.__aenter__`, которая возвращает ``self``, в то время как :meth:`object.__aexit__` является абстрактным методом, который по умолчанию возвращает ``None``. См. также определение :ref:`async-context-managers`.

source: This function is a :term:`decorator` that can be used to define a factory function for :keyword:`with` statement context managers, without needing to create a class or separate :meth:`~object.__enter__` and :meth:`~object.__exit__` methods.
ru: Эта функция представляет собой :term:`декоратор`, который можно использовать для определения фабричной функции для менеджеров контекста операторов :keyword:`with` без необходимости создания класса или отдельных :meth:`~object.__enter__` и :meth :`~object.__exit__` методы.

source: While many objects natively support use in with statements, sometimes a resource needs to be managed that isn't a context manager in its own right, and doesn't implement a ``close()`` method for use with ``contextlib.closing``
ru: Хотя многие объекты изначально поддерживают использование операторов with, иногда необходимо управлять ресурсом, который сам по себе не является контекстным менеджером и не реализует метод close() для использования с contextlib. закрытие``

source: An abstract example would be the following to ensure correct resource management::
ru: Абстрактным примером обеспечения правильного управления ресурсами может быть следующий:

source: The function can then be used like this::
ru: Затем функцию можно использовать следующим образом:

source: The function being decorated must return a :term:`generator`-iterator when called. This iterator must yield exactly one value, which will be bound to the targets in the :keyword:`with` statement's :keyword:`!as` clause, if any.
ru: Декорируемая функция при вызове должна возвращать итератор :term:`generator`. Этот итератор должен возвращать ровно одно значение, которое будет привязано к целям в предложении :keyword:`!as` оператора :keyword:`with`, если таковое имеется.

source: At the point where the generator yields, the block nested in the :keyword:`with` statement is executed. The generator is then resumed after the block is exited. If an unhandled exception occurs in the block, it is reraised inside the generator at the point where the yield occurred. Thus, you can use a :keyword:`try`...\ :keyword:`except`...\ :keyword:`finally` statement to trap the error (if any), or ensure that some cleanup takes place. If an exception is trapped merely in order to log it or to perform some action (rather than to suppress it entirely), the generator must reraise that exception. Otherwise the generator context manager will indicate to the :keyword:`!with` statement that the exception has been handled, and execution will resume with the statement immediately following the :keyword:`!with` statement.
ru: В тот момент, когда генератор завершает работу, выполняется блок, вложенный в оператор :keyword:`with`. Затем генератор возобновляется после выхода из блока. Если в блоке возникает необработанное исключение, оно повторно возбуждается внутри генератора в той точке, где произошел выход. Таким образом, вы можете использовать оператор :keyword:`try`...\ :keyword:`Exception`...\ :keyword:`finally` для перехвата ошибки (если таковая имеется) или обеспечения некоторой очистки. Если исключение перехватывается просто для того, чтобы зарегистрировать его или выполнить какое-либо действие (вместо того, чтобы полностью его подавить), генератор должен повторно вызвать это исключение. В противном случае менеджер контекста генератора укажет оператору :keyword:`!with`, что исключение было обработано, и выполнение возобновится с оператора, следующего сразу за оператором :keyword:`!with`.

source: :func:`contextmanager` uses :class:`ContextDecorator` so the context managers it creates can be used as decorators as well as in :keyword:`with` statements. When used as a decorator, a new generator instance is implicitly created on each function call (this allows the otherwise "one-shot" context managers created by :func:`contextmanager` to meet the requirement that context managers support multiple invocations in order to be used as decorators).
ru: :func:`contextmanager` использует :class:`ContextDecorator`, поэтому создаваемые им контекстные менеджеры могут использоваться как декораторы, а также в операторах :keyword:`with`. При использовании в качестве декоратора новый экземпляр генератора неявно создается при каждом вызове функции (это позволяет «одноразовым» контекстным менеджерам, созданным :func:`contextmanager`, удовлетворять требованию, чтобы контекстные менеджеры поддерживали множественные вызовы для того, чтобы использоваться в качестве декораторов).

source: Use of :class:`ContextDecorator`.
ru: Использование :class:`ContextDecorator`.

source: Similar to :func:`~contextlib.contextmanager`, but creates an :ref:`asynchronous context manager <async-context-managers>`.
ru: Похож на :func:`~contextlib.contextmanager`, но создаёт :ref:`асинхронный менеджер контекста <async-context-managers>`.

source: This function is a :term:`decorator` that can be used to define a factory function for :keyword:`async with` statement asynchronous context managers, without needing to create a class or separate :meth:`~object.__aenter__` and :meth:`~object.__aexit__` methods. It must be applied to an :term:`asynchronous generator` function.
ru: Эта функция представляет собой :term:`декоратор`, который можно использовать для определения фабричной функции для :keyword:`async with` операторных асинхронных контекстных менеджеров без необходимости создания класса или отдельного :meth:`~object.__aenter__` и :meth:`~object.__aexit__` методы. Его необходимо применить к функции асинхронного генератора.

source: A simple example::
ru: Простой пример::

source: Context managers defined with :func:`asynccontextmanager` can be used either as decorators or with :keyword:`async with` statements::
ru: Менеджеры контекста, определенные с помощью :func:`asynccontextmanager`, могут использоваться либо как декораторы, либо с операторами :keyword:`async with`::

source: When used as a decorator, a new generator instance is implicitly created on each function call. This allows the otherwise "one-shot" context managers created by :func:`asynccontextmanager` to meet the requirement that context managers support multiple invocations in order to be used as decorators.
ru: При использовании в качестве декоратора новый экземпляр генератора неявно создается при каждом вызове функции. Это позволяет «одноразовым» менеджерам контекста, созданным :func:`asynccontextmanager`, удовлетворять требованию, чтобы контекстные менеджеры поддерживали множественные вызовы для использования в качестве декораторов.

source: Async context managers created with :func:`asynccontextmanager` can be used as decorators.
ru: Менеджеры асинхронного контекста, созданные с помощью :func:`asynccontextmanager`, могут использоваться в качестве декораторов.

source: Return a context manager that closes *thing* upon completion of the block. This is basically equivalent to::
ru: Возвращает менеджер контекста, который закрывает *thing* после завершения блока. Это в основном эквивалентно::

source: And lets you write code like this::
ru: И позволяет писать такой код::

source: without needing to explicitly close ``page``. Even if an error occurs, ``page.close()`` will be called when the :keyword:`with` block is exited.
ru: без необходимости явно закрывать страницу. Даже если произойдет ошибка, page.close() будет вызвана при выходе из блока :keyword:`with`.

source: Most types managing resources support the :term:`context manager` protocol, which closes *thing* on leaving the :keyword:`with` statement. As such, :func:`!closing` is most useful for third party types that don't support context managers. This example is purely for illustration purposes, as :func:`~urllib.request.urlopen` would normally be used in a context manager.
ru: Большинство типов управления ресурсами поддерживают протокол :term:`контекстного менеджера`, который закрывает *thing* при выходе из оператора :keyword:`with`. Таким образом, :func:`!closing` наиболее полезен для сторонних типов, которые не поддерживают менеджеры контекста. Этот пример предназначен исключительно для иллюстрации, поскольку :func:`~urllib.request.urlopen` обычно используется в менеджере контекста.

source: Return an async context manager that calls the ``aclose()`` method of *thing* upon completion of the block. This is basically equivalent to::
ru: Возвращает асинхронный контекстный менеджер, который вызывает метод aclose() объекта *thing* после завершения блока. Это в основном эквивалентно::

source: Significantly, ``aclosing()`` supports deterministic cleanup of async generators when they happen to exit early by :keyword:`break` or an exception. For example::
ru: Примечательно, что ``aclosing()`` поддерживает детерминированную очистку асинхронных генераторов, когда они завершают работу раньше по причине :keyword:`break` или исключения. Например::

source: This pattern ensures that the generator's async exit code is executed in the same context as its iterations (so that exceptions and context variables work as expected, and the exit code isn't run after the lifetime of some task it depends on).
ru: Этот шаблон гарантирует, что асинхронный код выхода генератора выполняется в том же контексте, что и его итерации (так что исключения и переменные контекста работают должным образом, а код выхода не запускается по истечении времени существования какой-либо задачи, от которой он зависит).

source: Return a context manager that returns *enter_result* from ``__enter__``, but otherwise does nothing. It is intended to be used as a stand-in for an optional context manager, for example::
ru: Возвращает менеджер контекста, который возвращает *enter_result* из ``__enter__``, но в остальном ничего не делает. Он предназначен для использования в качестве замены дополнительного контекстного менеджера, например::

source: An example using *enter_result*::
ru: Пример использования *enter_result*::

source: It can also be used as a stand-in for :ref:`asynchronous context managers <async-context-managers>`::
ru: Его также можно использовать в качестве замены :ref:`асинхронных контекстных менеджеров <async-context-managers>`::

source: :term:`asynchronous context manager` support was added.
ru: :term:`добавлена ​​поддержка асинхронного контекстного менеджера`.

source: Return a context manager that suppresses any of the specified exceptions if they occur in the body of a :keyword:`!with` statement and then resumes execution with the first statement following the end of the :keyword:`!with` statement.
ru: Возвращает диспетчер контекста, который подавляет любое из указанных исключений, если они возникают в теле оператора :keyword:`!with`, а затем возобновляет выполнение с первого оператора, следующего за концом оператора :keyword:`!with`.

source: As with any other mechanism that completely suppresses exceptions, this context manager should be used only to cover very specific errors where silently continuing with program execution is known to be the right thing to do.
ru: Как и любой другой механизм, который полностью подавляет исключения, этот контекстный менеджер следует использовать только для устранения очень конкретных ошибок, когда известно, что молчаливое продолжение выполнения программы является правильным.

source: For example::
ru: Например::

source: This code is equivalent to::
ru: Этот код эквивалентен::

source: This context manager is :ref:`reentrant <reentrant-cms>`.
ru: Этот контекстный менеджер — :ref:`reentrant <reentrant-cms>`.

source: Context manager for temporarily redirecting :data:`sys.stdout` to another file or file-like object.
ru: Менеджер контекста для временного перенаправления :data:`sys.stdout` в другой файл или файловоподобный объект.

source: This tool adds flexibility to existing functions or classes whose output is hardwired to stdout.
ru: Этот инструмент добавляет гибкость существующим функциям или классам, вывод которых жестко привязан к стандартному выводу.

source: For example, the output of :func:`help` normally is sent to *sys.stdout*. You can capture that output in a string by redirecting the output to an :class:`io.StringIO` object. The replacement stream is returned from the ``__enter__`` method and so is available as the target of the :keyword:`with` statement::
ru: Например, вывод :func:`help` обычно отправляется в *sys.stdout*. Вы можете записать этот вывод в строку, перенаправив вывод на объект :class:`io.StringIO`. Поток замены возвращается из метода ``__enter__`` и поэтому доступен в качестве цели оператора :keyword:`with`::

source: To send the output of :func:`help` to a file on disk, redirect the output to a regular file::
ru: Чтобы отправить вывод :func:`help` в файл на диске, перенаправьте вывод в обычный файл::

source: To send the output of :func:`help` to *sys.stderr*::
ru: Чтобы отправить вывод :func:`help` в *sys.stderr*::

source: Note that the global side effect on :data:`sys.stdout` means that this context manager is not suitable for use in library code and most threaded applications. It also has no effect on the output of subprocesses. However, it is still a useful approach for many utility scripts.
ru: Обратите внимание, что глобальный побочный эффект :data:`sys.stdout` означает, что этот контекстный менеджер не подходит для использования в библиотечном коде и большинстве многопоточных приложений. Это также не влияет на выходные данные подпроцессов. Тем не менее, это по-прежнему полезный подход для многих служебных сценариев.

source: Similar to :func:`~contextlib.redirect_stdout` but redirecting :data:`sys.stderr` to another file or file-like object.
ru: Аналогично :func:`~contextlib.redirect_stdout`, но перенаправляет :data:`sys.stderr` в другой файл или файловоподобный объект.

source: Non parallel-safe context manager to change the current working directory. As this changes a global state, the working directory, it is not suitable for use in most threaded or async contexts. It is also not suitable for most non-linear code execution, like generators, where the program execution is temporarily relinquished -- unless explicitly desired, you should not yield when this context manager is active.
ru: Непараллельный контекстный менеджер для изменения текущего рабочего каталога. Поскольку при этом изменяется глобальное состояние, рабочий каталог, он не подходит для использования в большинстве многопоточных или асинхронных контекстов. Он также не подходит для выполнения большинства нелинейных кодов, таких как генераторы, где выполнение программы временно приостанавливается - если это явно не требуется, вы не должны уступать, когда этот контекстный менеджер активен.

source: This is a simple wrapper around :func:`~os.chdir`, it changes the current working directory upon entering and restores the old one on exit.
ru: Это простая оболочка :func:`~os.chdir`, она меняет текущий рабочий каталог при входе и восстанавливает старый при выходе.

source: A base class that enables a context manager to also be used as a decorator.
ru: Базовый класс, который позволяет использовать менеджер контекста в качестве декоратора.

source: Context managers inheriting from ``ContextDecorator`` have to implement ``__enter__`` and ``__exit__`` as normal. ``__exit__`` retains its optional exception handling even when used as a decorator.
ru: Менеджеры контекста, наследующие от ContextDecorator, должны реализовать __enter__ и __exit__ как обычно. ``__exit__`` сохраняет необязательную обработку исключений даже при использовании в качестве декоратора.

source: ``ContextDecorator`` is used by :func:`contextmanager`, so you get this functionality automatically.
ru: ``ContextDecorator`` используется :func:`contextmanager`, поэтому вы получаете эту функциональность автоматически.

source: Example of ``ContextDecorator``::
ru: Пример ``ContextDecorator``::

source: The class can then be used like this::
ru: Затем класс можно использовать следующим образом:

source: This change is just syntactic sugar for any construct of the following form::
ru: Это изменение является просто синтаксическим сахаром для любой конструкции следующей формы:

source: ``ContextDecorator`` lets you instead write::
ru: ``ContextDecorator`` позволяет вместо этого писать::

source: It makes it clear that the ``cm`` applies to the whole function, rather than just a piece of it (and saving an indentation level is nice, too).
ru: Это ясно дает понять, что ``cm`` применяется ко всей функции, а не только к ее части (и сохранение уровня отступа тоже полезно).

source: Existing context managers that already have a base class can be extended by using ``ContextDecorator`` as a mixin class::
ru: Существующие контекстные менеджеры, у которых уже есть базовый класс, можно расширить, используя ContextDecorator в качестве примеси:

source: As the decorated function must be able to be called multiple times, the underlying context manager must support use in multiple :keyword:`with` statements. If this is not the case, then the original construct with the explicit :keyword:`!with` statement inside the function should be used.
ru: Поскольку декорированную функцию можно вызывать несколько раз, базовый менеджер контекста должен поддерживать использование в нескольких операторах :keyword:`with`. Если это не так, то следует использовать исходную конструкцию с явным оператором :keyword:`!with` внутри функции.

source: Similar to :class:`ContextDecorator` but only for asynchronous functions.
ru: Аналогично :class:`ContextDecorator`, но только для асинхронных функций.

source: Example of ``AsyncContextDecorator``::
ru: Пример ``AsyncContextDecorator``::

source: A context manager that is designed to make it easy to programmatically combine other context managers and cleanup functions, especially those that are optional or otherwise driven by input data.
ru: Менеджер контекста, предназначенный для упрощения программного объединения других менеджеров контекста и функций очистки, особенно тех, которые являются необязательными или иным образом управляются входными данными.

source: For example, a set of files may easily be handled in a single with statement as follows::
ru: Например, набор файлов можно легко обработать в одном операторе with следующим образом:

source: The :meth:`~object.__enter__` method returns the :class:`ExitStack` instance, and performs no additional operations.
ru: Метод :meth:`~object.__enter__` возвращает экземпляр :class:`ExitStack` и не выполняет никаких дополнительных операций.

source: Each instance maintains a stack of registered callbacks that are called in reverse order when the instance is closed (either explicitly or implicitly at the end of a :keyword:`with` statement). Note that callbacks are *not* invoked implicitly when the context stack instance is garbage collected.
ru: Каждый экземпляр поддерживает стек зарегистрированных обратных вызовов, которые вызываются в обратном порядке при закрытии экземпляра (явно или неявно в конце оператора :keyword:`with`). Обратите внимание, что обратные вызовы *не* вызываются неявно, когда экземпляр контекстного стека подвергается сборке мусора.

source: This stack model is used so that context managers that acquire their resources in their ``__init__`` method (such as file objects) can be handled correctly.
ru: Эта модель стека используется для корректной обработки контекстных менеджеров, которые получают свои ресурсы с помощью метода ``__init__`` (например, файловые объекты).

source: Since registered callbacks are invoked in the reverse order of registration, this ends up behaving as if multiple nested :keyword:`with` statements had been used with the registered set of callbacks. This even extends to exception handling - if an inner callback suppresses or replaces an exception, then outer callbacks will be passed arguments based on that updated state.
ru: Поскольку зарегистрированные обратные вызовы вызываются в порядке, обратном регистрации, в конечном итоге это ведет себя так, как если бы с зарегистрированным набором обратных вызовов использовалось несколько вложенных операторов :keyword:`with`. Это распространяется даже на обработку исключений: если внутренний обратный вызов подавляет или заменяет исключение, то внешним обратным вызовам будут переданы аргументы на основе этого обновленного состояния.

source: This is a relatively low level API that takes care of the details of correctly unwinding the stack of exit callbacks. It provides a suitable foundation for higher level context managers that manipulate the exit stack in application specific ways.
ru: Это API относительно низкого уровня, который заботится о деталях правильного развертывания стека обратных вызовов выхода. Он обеспечивает подходящую основу для менеджеров контекста более высокого уровня, которые манипулируют стеком выхода способами, специфичными для приложения.

source: Enters a new context manager and adds its :meth:`~object.__exit__` method to the callback stack. The return value is the result of the context manager's own :meth:`~object.__enter__` method.
ru: Вводит новый менеджер контекста и добавляет его метод :meth:`~object.__exit__` в стек обратного вызова. Возвращаемое значение является результатом работы собственного метода :meth:`~object.__enter__` контекстного менеджера.

source: These context managers may suppress exceptions just as they normally would if used directly as part of a :keyword:`with` statement.
ru: Эти менеджеры контекста могут подавлять исключения так же, как обычно, если они используются непосредственно как часть оператора :keyword:`with`.
