Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/contextlib.po
Languages: ru

source: Raises :exc:`TypeError` instead of :exc:`AttributeError` if *cm* is not a context manager.
ru: Вызывает :exc:`TypeError` вместо :exc:`AttributeError`, если *cm* не является менеджером контекста.

source: Adds a context manager's :meth:`~object.__exit__` method to the callback stack.
ru: Добавляет метод :meth:`~object.__exit__` контекстного менеджера в стек обратного вызова.

source: As ``__enter__`` is *not* invoked, this method can be used to cover part of an :meth:`~object.__enter__` implementation with a context manager's own :meth:`~object.__exit__` method.
ru: Поскольку ``__enter__`` *не* вызывается, этот метод можно использовать для покрытия части реализации :meth:`~object.__enter__` собственным методом :meth:`~object.__exit__` контекстного менеджера.

source: If passed an object that is not a context manager, this method assumes it is a callback with the same signature as a context manager's :meth:`~object.__exit__` method and adds it directly to the callback stack.
ru: Если передан объект, который не является менеджером контекста, этот метод предполагает, что это обратный вызов с той же сигнатурой, что и метод :meth:`~object.__exit__` контекстного менеджера, и добавляет его непосредственно в стек обратного вызова.

source: By returning true values, these callbacks can suppress exceptions the same way context manager :meth:`~object.__exit__` methods can.
ru: Возвращая истинные значения, эти обратные вызовы могут подавлять исключения так же, как это могут делать методы контекстного менеджера :meth:`~object.__exit__`.

source: The passed in object is returned from the function, allowing this method to be used as a function decorator.
ru: Переданный объект возвращается из функции, что позволяет использовать этот метод в качестве декоратора функции.

source: Accepts an arbitrary callback function and arguments and adds it to the callback stack.
ru: Принимает произвольную функцию обратного вызова и аргументы и добавляет ее в стек обратного вызова.

source: Unlike the other methods, callbacks added this way cannot suppress exceptions (as they are never passed the exception details).
ru: В отличие от других методов, обратные вызовы, добавленные таким образом, не могут подавлять исключения (поскольку им никогда не передаются сведения об исключении).

source: The passed in callback is returned from the function, allowing this method to be used as a function decorator.
ru: Переданный обратный вызов возвращается из функции, что позволяет использовать этот метод в качестве декоратора функции.

source: Transfers the callback stack to a fresh :class:`ExitStack` instance and returns it. No callbacks are invoked by this operation - instead, they will now be invoked when the new stack is closed (either explicitly or implicitly at the end of a :keyword:`with` statement).
ru: Переносит стек обратного вызова в новый экземпляр :class:`ExitStack` и возвращает его. Эта операция не вызывает никаких обратных вызовов — вместо этого они теперь будут вызываться при закрытии нового стека (явно или неявно в конце оператора :keyword:`with`).

source: For example, a group of files can be opened as an "all or nothing" operation as follows::
ru: Например, группу файлов можно открыть как операцию «все или ничего» следующим образом:

source: Immediately unwinds the callback stack, invoking callbacks in the reverse order of registration. For any context managers and exit callbacks registered, the arguments passed in will indicate that no exception occurred.
ru: Немедленно разворачивает стек обратных вызовов, вызывая обратные вызовы в порядке, обратном регистрации. Для любых зарегистрированных менеджеров контекста и обратных вызовов выхода переданные аргументы будут указывать на отсутствие исключений.

source: An :ref:`asynchronous context manager <async-context-managers>`, similar to :class:`ExitStack`, that supports combining both synchronous and asynchronous context managers, as well as having coroutines for cleanup logic.
ru: :ref:`асинхронный контекстный менеджер <async-context-managers>`, аналогичный :class:`ExitStack`, который поддерживает сочетание синхронных и асинхронных контекстных менеджеров, а также имеет сопрограммы для логики очистки.

source: The :meth:`~ExitStack.close` method is not implemented; :meth:`aclose` must be used instead.
ru: Метод :meth:`~ExitStack.close` не реализован; Вместо этого следует использовать :meth:`aclose`.

source: Similar to :meth:`ExitStack.enter_context` but expects an asynchronous context manager.
ru: Аналогично :meth:`ExitStack.enter_context`, но требует асинхронного менеджера контекста.

source: Raises :exc:`TypeError` instead of :exc:`AttributeError` if *cm* is not an asynchronous context manager.
ru: Вызывает :exc:`TypeError` вместо :exc:`AttributeError`, если *cm* не является асинхронным менеджером контекста.

source: Similar to :meth:`ExitStack.push` but expects either an asynchronous context manager or a coroutine function.
ru: Похож на :meth:`ExitStack.push`, но ожидает либо асинхронного контекстного менеджера, либо сопрограммной функции.

source: Similar to :meth:`ExitStack.callback` but expects a coroutine function.
ru: Аналогично :meth:`ExitStack.callback`, но ожидает сопрограммную функцию.

source: Similar to :meth:`ExitStack.close` but properly handles awaitables.
ru: Похож на :meth:`ExitStack.close`, но правильно обрабатывает ожидаемые объекты.

source: Continuing the example for :func:`asynccontextmanager`::
ru: Продолжая пример для :func:`asynccontextmanager`::

source: Examples and Recipes
ru: Примеры и рецепты

source: This section describes some examples and recipes for making effective use of the tools provided by :mod:`contextlib`.
ru: В этом разделе описаны некоторые примеры и рецепты эффективного использования инструментов, предоставляемых :mod:`contextlib`.

source: Supporting a variable number of context managers
ru: Поддержка переменного количества контекстных менеджеров

source: The primary use case for :class:`ExitStack` is the one given in the class documentation: supporting a variable number of context managers and other cleanup operations in a single :keyword:`with` statement. The variability may come from the number of context managers needed being driven by user input (such as opening a user specified collection of files), or from some of the context managers being optional::
ru: Основной вариант использования :class:`ExitStack` указан в документации класса: поддержка переменного количества контекстных менеджеров и других операций очистки в одном операторе :keyword:`with`. Вариативность может быть обусловлена ​​количеством необходимых менеджеров контекста, управляемых пользовательским вводом (например, открытием заданной пользователем коллекции файлов), или тем, что некоторые из менеджеров контекста являются необязательными:

source: As shown, :class:`ExitStack` also makes it quite easy to use :keyword:`with` statements to manage arbitrary resources that don't natively support the context management protocol.
ru: Как показано, :class:`ExitStack` также позволяет довольно легко использовать операторы :keyword:`with` для управления произвольными ресурсами, которые изначально не поддерживают протокол управления контекстом.

source: Catching exceptions from ``__enter__`` methods
ru: Перехват исключений из методов ``__enter__``

source: It is occasionally desirable to catch exceptions from an ``__enter__`` method implementation, *without* inadvertently catching exceptions from the :keyword:`with` statement body or the context manager's ``__exit__`` method. By using :class:`ExitStack` the steps in the context management protocol can be separated slightly in order to allow this::
ru: Иногда желательно перехватывать исключения из реализации метода ``__enter__``, *без* случайного перехвата исключений из тела оператора :keyword:`with` или метода ``__exit__`` контекстного менеджера. Используя :class:`ExitStack`, шаги в протоколе управления контекстом можно немного разделить, чтобы это можно было сделать:

source: Actually needing to do this is likely to indicate that the underlying API should be providing a direct resource management interface for use with :keyword:`try`/:keyword:`except`/:keyword:`finally` statements, but not all APIs are well designed in that regard. When a context manager is the only resource management API provided, then :class:`ExitStack` can make it easier to handle various situations that can't be handled directly in a :keyword:`with` statement.
ru: На самом деле необходимость сделать это, скорее всего, означает, что базовый API должен предоставлять интерфейс прямого управления ресурсами для использования с операторами :keyword:`try`/:keyword:`Exception`/:keyword:`finally`, но не со всеми API. хорошо спроектированы в этом отношении. Если контекстный менеджер является единственным предоставляемым API управления ресурсами, то :class:`ExitStack` может упростить обработку различных ситуаций, которые невозможно обработать непосредственно в операторе :keyword:`with`.

source: Cleaning up in an ``__enter__`` implementation
ru: Очистка в реализации ``__enter__``

source: As noted in the documentation of :meth:`ExitStack.push`, this method can be useful in cleaning up an already allocated resource if later steps in the :meth:`~object.__enter__` implementation fail.
ru: Как отмечено в документации :meth:`ExitStack.push`, этот метод может быть полезен при очистке уже выделенного ресурса, если последующие шаги реализации :meth:`~object.__enter__` завершатся неудачно.

source: Here's an example of doing this for a context manager that accepts resource acquisition and release functions, along with an optional validation function, and maps them to the context management protocol::
ru: Вот пример того, как это сделать для контекстного менеджера, который принимает функции получения и освобождения ресурсов, а также дополнительную функцию проверки и сопоставляет их с протоколом управления контекстом:

source: Replacing any use of ``try-finally`` and flag variables
ru: Замена любого использования переменных ``try-finally`` и flag.

source: A pattern you will sometimes see is a ``try-finally`` statement with a flag variable to indicate whether or not the body of the ``finally`` clause should be executed. In its simplest form (that can't already be handled just by using an ``except`` clause instead), it looks something like this::
ru: Шаблон, который вы иногда увидите, представляет собой оператор try-finally с переменной-флагом, указывающей, должно ли выполняться тело предложенияfinally. В своей простейшей форме (которую уже невозможно обработать, просто используя вместо этого предложение «кроме»), это выглядит примерно так:

source: As with any ``try`` statement based code, this can cause problems for development and review, because the setup code and the cleanup code can end up being separated by arbitrarily long sections of code.
ru: Как и в случае с любым кодом, основанным на операторе ``try``, это может вызвать проблемы при разработке и проверке, поскольку код установки и код очистки могут оказаться разделенными фрагментами кода произвольной длины.

source: :class:`ExitStack` makes it possible to instead register a callback for execution at the end of a ``with`` statement, and then later decide to skip executing that callback::
ru: :class:`ExitStack` позволяет вместо этого зарегистрировать обратный вызов для выполнения в конце оператора ``with``, а затем позже решить пропустить выполнение этого обратного вызова::

source: If a particular application uses this pattern a lot, it can be simplified even further by means of a small helper class::
ru: Если конкретное приложение часто использует этот шаблон, его можно еще упростить с помощью небольшого вспомогательного класса:

source: If the resource cleanup isn't already neatly bundled into a standalone function, then it is still possible to use the decorator form of :meth:`ExitStack.callback` to declare the resource cleanup in advance::
ru: Если очистка ресурса еще не объединена в отдельную функцию, все равно можно использовать форму декоратора :meth:`ExitStack.callback`, чтобы заранее объявить очистку ресурса::

source: Due to the way the decorator protocol works, a callback function declared this way cannot take any parameters. Instead, any resources to be released must be accessed as closure variables.
ru: Из-за особенностей работы протокола декоратора объявленная таким образом функция обратного вызова не может принимать никаких параметров. Вместо этого к любым освобождаемым ресурсам необходимо обращаться как к переменным закрытия.

source: Using a context manager as a function decorator
ru: Использование контекстного менеджера в качестве декоратора функции

source: :class:`ContextDecorator` makes it possible to use a context manager in both an ordinary ``with`` statement and also as a function decorator.
ru: :class:`ContextDecorator` позволяет использовать контекстный менеджер как в обычном операторе ``with``, так и в качестве декоратора функции.

source: For example, it is sometimes useful to wrap functions or groups of statements with a logger that can track the time of entry and time of exit. Rather than writing both a function decorator and a context manager for the task, inheriting from :class:`ContextDecorator` provides both capabilities in a single definition::
ru: Например, иногда полезно обернуть функции или группы операторов логгером, который может отслеживать время входа и время выхода. Вместо того, чтобы писать для задачи декоратор функции и менеджер контекста, наследование от :class:`ContextDecorator` предоставляет обе возможности в одном определении::

source: Instances of this class can be used as both a context manager::
ru: Экземпляры этого класса можно использовать как в качестве менеджера контекста::

source: And also as a function decorator::
ru: А также в качестве декоратора функции::

source: Note that there is one additional limitation when using context managers as function decorators: there's no way to access the return value of :meth:`~object.__enter__`. If that value is needed, then it is still necessary to use an explicit ``with`` statement.
ru: Обратите внимание, что при использовании контекстных менеджеров в качестве декораторов функций существует одно дополнительное ограничение: невозможно получить доступ к возвращаемому значению :meth:`~object.__enter__`. Если это значение необходимо, то все равно необходимо использовать явный оператор ``with``.

source: :pep:`343` - The "with" statement
ru: :pep:`343` - Оператор "with"

source: The specification, background, and examples for the Python :keyword:`with` statement.
ru: Спецификация, предыстория и примеры оператора Python :keyword:`with`.

source: Single use, reusable and reentrant context managers
ru: Одноразовые, многоразовые и реентерабельные контекстные менеджеры

source: Most context managers are written in a way that means they can only be used effectively in a :keyword:`with` statement once. These single use context managers must be created afresh each time they're used - attempting to use them a second time will trigger an exception or otherwise not work correctly.
ru: Большинство контекстных менеджеров написаны таким образом, что их можно эффективно использовать в операторе :keyword:`with` только один раз. Эти одноразовые контекстные менеджеры необходимо создавать заново каждый раз, когда они используются. Попытка использовать их во второй раз вызовет исключение или иным образом не будет работать правильно.

source: This common limitation means that it is generally advisable to create context managers directly in the header of the :keyword:`with` statement where they are used (as shown in all of the usage examples above).
ru: Это общее ограничение означает, что обычно рекомендуется создавать менеджеры контекста непосредственно в заголовке оператора :keyword:`with`, где они используются (как показано во всех примерах использования выше).

source: Files are an example of effectively single use context managers, since the first :keyword:`with` statement will close the file, preventing any further IO operations using that file object.
ru: Файлы являются примером эффективных одноразовых контекстных менеджеров, поскольку первый оператор :keyword:`with` закроет файл, предотвращая любые дальнейшие операции ввода-вывода с использованием этого файлового объекта.

source: Context managers created using :func:`contextmanager` are also single use context managers, and will complain about the underlying generator failing to yield if an attempt is made to use them a second time::
ru: Менеджеры контекста, созданные с помощью :func:`contextmanager`, также являются контекстными менеджерами одноразового использования и будут жаловаться на то, что базовый генератор не сработает, если будет предпринята попытка использовать их во второй раз:

source: Reentrant context managers
ru: Реентерабельные контекстные менеджеры

source: More sophisticated context managers may be "reentrant". These context managers can not only be used in multiple :keyword:`with` statements, but may also be used *inside* a :keyword:`!with` statement that is already using the same context manager.
ru: Более сложные менеджеры контекста могут быть «реентерабельными». Эти менеджеры контекста могут использоваться не только в нескольких операторах :keyword:`with`, но также могут использоваться *внутри* оператора :keyword:`!with`, который уже использует тот же менеджер контекста.

source: :class:`threading.RLock` is an example of a reentrant context manager, as are :func:`suppress`, :func:`redirect_stdout`, and :func:`chdir`. Here's a very simple example of reentrant use::
ru: :class:`threading.RLock` является примером реентерабельного менеджера контекста, как и :func:`suppress`, :func:`redirect_stdout` и :func:`chdir`. Вот очень простой пример реентерабельного использования:

source: Real world examples of reentrancy are more likely to involve multiple functions calling each other and hence be far more complicated than this example.
ru: Реальные примеры повторного входа, скорее всего, будут включать несколько функций, вызывающих друг друга, и, следовательно, будут намного сложнее, чем этот пример.

source: Note also that being reentrant is *not* the same thing as being thread safe. :func:`redirect_stdout`, for example, is definitely not thread safe, as it makes a global modification to the system state by binding :data:`sys.stdout` to a different stream.
ru: Также обратите внимание, что реентерабельность — это *не* то же самое, что потокобезопасность. :func:`redirect_stdout`, например, определенно не является потокобезопасным, поскольку он вносит глобальную модификацию состояния системы, привязывая :data:`sys.stdout` к другому потоку.

source: Reusable context managers
ru: Многоразоваые контекстные менеджеры

source: Distinct from both single use and reentrant context managers are "reusable" context managers (or, to be completely explicit, "reusable, but not reentrant" context managers, since reentrant context managers are also reusable). These context managers support being used multiple times, but will fail (or otherwise not work correctly) if the specific context manager instance has already been used in a containing with statement.
ru: В отличие от одноразовых и реентерабельных контекстных менеджеров есть «многоразовые» контекстные менеджеры (или, если быть совершенно ясным, «многоразовые, но не реентерабельные» контекстные менеджеры, поскольку реентерабельные контекстные менеджеры также могут использоваться повторно). Эти менеджеры контекста поддерживают многократное использование, но не сработают (или иным образом не будут работать правильно), если конкретный экземпляр менеджера контекста уже использовался в операторе, содержащем with.

source: :class:`threading.Lock` is an example of a reusable, but not reentrant, context manager (for a reentrant lock, it is necessary to use :class:`threading.RLock` instead).
ru: :class:`threading.Lock` — это пример многоразового, но не реентерабельного контекстного менеджера (для реентерабельной блокировки вместо этого необходимо использовать :class:`threading.RLock`).

source: Another example of a reusable, but not reentrant, context manager is :class:`ExitStack`, as it invokes *all* currently registered callbacks when leaving any with statement, regardless of where those callbacks were added::
ru: Другим примером многоразового, но не реентерабельного контекстного менеджера является :class:`ExitStack`, поскольку он вызывает *все* зарегистрированные в данный момент обратные вызовы при выходе из любого оператора with, независимо от того, где эти обратные вызовы были добавлены::

source: As the output from the example shows, reusing a single stack object across multiple with statements works correctly, but attempting to nest them will cause the stack to be cleared at the end of the innermost with statement, which is unlikely to be desirable behaviour.
ru: Как показывают выходные данные примера, повторное использование одного объекта стека в нескольких операторах with работает правильно, но попытка вложить их приведет к очистке стека в конце самого внутреннего оператора with, что вряд ли будет желательным поведением.

source: Using separate :class:`ExitStack` instances instead of reusing a single instance avoids that problem::
ru: Использование отдельных экземпляров :class:`ExitStack` вместо повторного использования одного экземпляра позволяет избежать этой проблемы:
