Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/copy.po
Languages: id

source: :mod:`copy` --- Shallow and deep copy operations
id: :mod:`copy` --- Operasi shallow copy dan deep copy

source: **Source code:** :source:`Lib/copy.py`
id: **Kode sumber:** :source:`Lib/copy.py`

source: Assignment statements in Python do not copy objects, they create bindings between a target and an object. For collections that are mutable or contain mutable items, a copy is sometimes needed so one can change one copy without changing the other. This module provides generic shallow and deep copy operations (explained below).
id: Pernyataan penetapan dalam Python tidak menyalin objek, mereka membuat ikatan antara target dengan sebuah objek. Untuk collections yang dapat diubah atau memiliki item-item yang dapat diubah, sebuah penyalinan terkadang dibutuhkan sehingga seseorang dapat mengubah salinan tanpa mengubah yang lainnya. Modul ini menyediakan operasi salinan dangkal dan salinan dalam (dijelaskan dibawah ini).

source: Interface summary:
id: Ringkasan antarmuka:

source: Return a shallow copy of *x*.
id: Mengembalikan shallow copy dari *x*.

source: Return a deep copy of *x*.
id: Mengembalikan deep copy dari *x*.

source: Raised for module specific errors.
id: Di angkat untuk error spesifik dari modul.

source: The difference between shallow and deep copying is only relevant for compound objects (objects that contain other objects, like lists or class instances):
id: Perbedaan antara shallow copy dan deep copy hanya relevan untuk objek majemuk (objek yang berisi objek lainnya, seperti list atau kelas):

source: A *shallow copy* constructs a new compound object and then (to the extent possible) inserts *references* into it to the objects found in the original.
id: Sebuah *shallow copy* membangun sebuah objek majemuk baru dan kemudian (sejauh mungkin) menyisipkan *referensi* ke dalamnya ke objek yang ditemukan di aslinya.

source: A *deep copy* constructs a new compound object and then, recursively, inserts *copies* into it of the objects found in the original.
id: Sebuah *deep copy* membangun objek majemuk baruk dan kemudian, secara rekursif, menyisipkan *salinan* ke dalamnya ke objek yang ditemukan di aslinya.

source: Two problems often exist with deep copy operations that don't exist with shallow copy operations:
id: Dua masalah yang sering muncul pada operasi deep copy yang tidak muncul pada operasi shallow copy:

source: Recursive objects (compound objects that, directly or indirectly, contain a reference to themselves) may cause a recursive loop.
id: Objek rekursif (objek majemuk yang secara langsung atau tidak langsung berisi sebuah referensi ke dirinya sendiri) mungkin menyebabkan sebuah perulangan rekursif.

source: Because deep copy copies everything it may copy too much, such as data which is intended to be shared between copies.
id: Karena deep copy menyalin segalanya sehingga mungkin menyalin terlalu banyak, seperti data yang dimaksudkan untuk dibagikan kepada salinan lain.

source: The :func:`deepcopy` function avoids these problems by:
id: Fungsi :func:`deepcopy` menghindari masalah diatas dengan:

source: keeping a ``memo`` dictionary of objects already copied during the current copying pass; and
id: menyimpan sebuah ``memo`` kamus dari objek yang sudah disalin selama penyalinan saat ini; dan

source: letting user-defined classes override the copying operation or the set of components copied.
id: membiarkan kelas-kelas yang didefinisikan oleh user menimpa operasi penyalinan atau kumpulan komponen yang disalin.

source: Shallow copies of dictionaries can be made using :meth:`dict.copy`, and of lists by assigning a slice of the entire list, for example, ``copied_list = original_list[:]``.
id: Salinan dangkal dari kamus dapat di buat menggunakan :meth:`dict.copy`, dan list dengan menetapkan potongan dari keseluruhan list, sebagai contoh, ``copied_list = original_list[:]``.

source: Classes can use the same interfaces to control copying that they use to control pickling. See the description of module :mod:`pickle` for information on these methods. In fact, the :mod:`copy` module uses the registered pickle functions from the :mod:`copyreg` module.
id: Kelas-kelas dapat menggunakan antarmuka yang sama untuk mengontrol penyalinan yang mereka gunakan untuk mengontrol pengawetan. Lihat deskripsi dari modul :mod:`pickle` untuk informasi dari metode ini. Faktanya, modul :mod:`copy` menggunakan fungsi pengawetan yang terdaftar dari modul :mod:`copyreg`.

source: Module :mod:`pickle`
id: Modul :mod:`pickle`

source: Discussion of the special methods used to support object state retrieval and restoration.
id: Diskusi tentang metode khusus yang digunakan untuk mendukung pengambilan dan pemulihan status objek.

source: module
id: modul
