Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/csv.po
Languages: ru

source: To make it easier to specify the format of input and output records, specific formatting parameters are grouped together into dialects. A dialect is a subclass of the :class:`Dialect` class containing various attributes describing the format of the CSV file. When creating :class:`reader` or :class:`writer` objects, the programmer can specify a string or a subclass of the :class:`Dialect` class as the dialect parameter. In addition to, or instead of, the *dialect* parameter, the programmer can also specify individual formatting parameters, which have the same names as the attributes defined below for the :class:`Dialect` class.
ru: Чтобы упростить задание формата входных и выходных записей, определенные параметры форматирования сгруппированы в диалекты. Диалект — это подкласс класса :class:`Dialect`, содержащий различные атрибуты, описывающие формат файла CSV. При создании объектов :class:`reader` или :class:`writer` программист может указать строку или подкласс класса :class:`Dialect` в качестве параметра диалекта. В дополнение к параметру *dialect* или вместо него программист может также указать отдельные параметры форматирования, которые имеют те же имена, что и атрибуты, определенные ниже для класса :class:`Dialect`.

source: Dialects support the following attributes:
ru: Диалекты поддерживают следующие атрибуты:

source: A one-character string used to separate fields. It defaults to ``','``.
ru: Односимвольная строка, используемая для разделения полей. По умолчанию это ``','``.

source: Controls how instances of *quotechar* appearing inside a field should themselves be quoted. When :const:`True`, the character is doubled. When :const:`False`, the *escapechar* is used as a prefix to the *quotechar*. It defaults to :const:`True`.
ru: Управляет тем, как экземпляры *quotechar*, появляющиеся внутри поля, должны заключаться в кавычки. Когда :const:`True`, символ удваивается. Если :const:`False`, *escapechar* используется как префикс к *quotechar*. По умолчанию установлено значение :const:`True`.

source: On output, if *doublequote* is :const:`False` and no *escapechar* is set, :exc:`Error` is raised if a *quotechar* is found in a field.
ru: При выводе, если *двойная кавычка* равна :const:`False` и не задан *escapechar*, выдается :exc:`Error`, если в поле найден *quotechar*.

source: A one-character string used by the writer to escape the *delimiter* if *quoting* is set to :const:`QUOTE_NONE` and the *quotechar* if *doublequote* is :const:`False`. On reading, the *escapechar* removes any special meaning from the following character. It defaults to :const:`None`, which disables escaping.
ru: Односимвольная строка, используемая средством записи для экранирования *разделителя*, если для *quoting* установлено значение :const:`QUOTE_NONE`, а для *quotechar* if *doublequote* установлено значение :const:`False`. При чтении *escapechar* удаляет любое специальное значение из следующего символа. По умолчанию установлено значение :const:`None`, что отключает экранирование.

source: An empty *escapechar* is not allowed.
ru: Пустой *escapechar* не допускается.

source: The string used to terminate lines produced by the :class:`writer`. It defaults to ``'\r\n'``.
ru: Строка, используемая для завершения строк, созданных :class:`writer`. По умолчанию это ``'\r\n'``.

source: The :class:`reader` is hard-coded to recognise either ``'\r'`` or ``'\n'`` as end-of-line, and ignores *lineterminator*. This behavior may change in the future.
ru: :class:`reader` жестко запрограммирован на распознавание ``'\r'`` или ``'\n'`` как конец строки и игнорирует *lineterminator*. Такое поведение может измениться в будущем.

source: A one-character string used to quote fields containing special characters, such as the *delimiter* or *quotechar*, or which contain new-line characters. It defaults to ``'"'``.
ru: Односимвольная строка, используемая для заключения в кавычки полей, содержащих специальные символы, например *разделитель* или *кавычки*, или содержащих символы новой строки. По умолчанию это ``'''``.

source: An empty *quotechar* is not allowed.
ru: Пустые *кавычки* не допускаются.

source: Controls when quotes should be generated by the writer and recognised by the reader. It can take on any of the :ref:`QUOTE_\* constants <csv-constants>` and defaults to :const:`QUOTE_MINIMAL`.
ru: Определяет, когда кавычки должны создаваться автором и распознаваться читателем. Он может принимать любую из констант :ref:`QUOTE_\* <csv-constants>` и по умолчанию имеет значение :const:`QUOTE_MINIMAL`.

source: When :const:`True`, spaces immediately following the *delimiter* are ignored. The default is :const:`False`.
ru: Если :const:`True`, пробелы, следующие сразу за *разделителем*, игнорируются. По умолчанию используется :const:`False`.

source: When ``True``, raise exception :exc:`Error` on bad CSV input. The default is ``False``.
ru: Когда ``True``, вызывает исключение :exc:`Error` при неправильном вводе CSV. По умолчанию установлено значение «Ложь».

source: Reader Objects
ru: Объекты чтения

source: Reader objects (:class:`DictReader` instances and objects returned by the :func:`reader` function) have the following public methods:
ru: Объекты Reader (экземпляры :class:`DictReader` и объекты, возвращаемые функцией :func:`reader`) имеют следующие общедоступные методы:

source: Return the next row of the reader's iterable object as a list (if the object was returned from :func:`reader`) or a dict (if it is a :class:`DictReader` instance), parsed according to the current :class:`Dialect`. Usually you should call this as ``next(reader)``.
ru: Вернуть следующую строку итерируемого объекта читателя в виде списка (если объект был возвращен из :func:`reader`) или словаря (если это экземпляр :class:`DictReader`), проанализированного в соответствии с текущим :class :`Диалект`. Обычно вам следует называть это ``next(reader)``.

source: Reader objects have the following public attributes:
ru: Объекты чтения имеют следующие общедоступные атрибуты:

source: A read-only description of the dialect in use by the parser.
ru: Доступное только для чтения описание диалекта, используемого анализатором.

source: The number of lines read from the source iterator. This is not the same as the number of records returned, as records can span multiple lines.
ru: Количество строк, прочитанных из исходного итератора. Это не то же самое, что количество возвращаемых записей, поскольку записи могут занимать несколько строк.

source: DictReader objects have the following public attribute:
ru: Объекты DictReader имеют следующий общедоступный атрибут:

source: If not passed as a parameter when creating the object, this attribute is initialized upon first access or when the first record is read from the file.
ru: Если этот атрибут не передается в качестве параметра при создании объекта, этот атрибут инициализируется при первом доступе или при чтении первой записи из файла.

source: Writer Objects
ru: Объекты записи

source: :class:`writer` objects (:class:`DictWriter` instances and objects returned by the :func:`writer` function) have the following public methods. A *row* must be an iterable of strings or numbers for :class:`writer` objects and a dictionary mapping fieldnames to strings or numbers (by passing them through :func:`str` first) for :class:`DictWriter` objects. Note that complex numbers are written out surrounded by parens. This may cause some problems for other programs which read CSV files (assuming they support complex numbers at all).
ru: Объекты :class:`writer` (экземпляры :class:`DictWriter` и объекты, возвращаемые функцией :func:`writer`) имеют следующие общедоступные методы. *row* должен быть итерацией строк или чисел для объектов :class:`writer` и словарем, сопоставляющим имена полей со строками или числами (сначала передавая их через :func:`str`) для объектов :class:`DictWriter` . Обратите внимание, что комплексные числа записываются в скобках. Это может вызвать некоторые проблемы для других программ, читающих файлы CSV (при условии, что они вообще поддерживают комплексные числа).

source: Write the *row* parameter to the writer's file object, formatted according to the current :class:`Dialect`. Return the return value of the call to the *write* method of the underlying file object.
ru: Запишите параметр *row* в файловый объект средства записи, отформатированный в соответствии с текущим :class:`Dialect`. Возвращает возвращаемое значение вызова метода *write* базового файлового объекта.

source: Added support of arbitrary iterables.
ru: Добавлена ​​поддержка произвольных итераций.

source: Write all elements in *rows* (an iterable of *row* objects as described above) to the writer's file object, formatted according to the current dialect.
ru: Запишите все элементы в *rows* (итерацию объектов *row*, как описано выше) в файловый объект средства записи, отформатированный в соответствии с текущим диалектом.

source: Writer objects have the following public attribute:
ru: Объекты Writer имеют следующий общедоступный атрибут:

source: A read-only description of the dialect in use by the writer.
ru: Доступное только для чтения описание диалекта, используемого автором.

source: DictWriter objects have the following public method:
ru: Объекты DictWriter имеют следующий общедоступный метод:

source: Write a row with the field names (as specified in the constructor) to the writer's file object, formatted according to the current dialect. Return the return value of the :meth:`csvwriter.writerow` call used internally.
ru: Запишите строку с именами полей (как указано в конструкторе) в файловый объект средства записи, отформатированный в соответствии с текущим диалектом. Возвращает возвращаемое значение вызова :meth:`csvwriter.writerow`, используемого внутри.

source: :meth:`writeheader` now also returns the value returned by the :meth:`csvwriter.writerow` method it uses internally.
ru: :meth:`writeheader` теперь также возвращает значение, возвращаемое методом :meth:`csvwriter.writerow`, который он использует внутри себя.

source: Examples
ru: Примеры

source: The simplest example of reading a CSV file::
ru: Простейший пример чтения файла CSV::

source: Reading a file with an alternate format::
ru: Чтение файла в альтернативном формате::

source: The corresponding simplest possible writing example is::
ru: Соответствующий простейший пример записи:

source: Since :func:`open` is used to open a CSV file for reading, the file will by default be decoded into unicode using the system default encoding (see :func:`locale.getencoding`). To decode a file using a different encoding, use the ``encoding`` argument of open::
ru: Поскольку :func:`open` используется для открытия файла CSV для чтения, файл по умолчанию будет декодирован в Юникод с использованием системной кодировки по умолчанию (см. :func:`locale.getencoding`). Чтобы декодировать файл с использованием другой кодировки, используйте аргумент ``encoding`` команды open::

source: The same applies to writing in something other than the system default encoding: specify the encoding argument when opening the output file.
ru: То же самое относится и к записи в кодировке, отличной от системной по умолчанию: укажите аргумент кодировки при открытии выходного файла.

source: Registering a new dialect::
ru: Регистрация нового диалекта::

source: A slightly more advanced use of the reader --- catching and reporting errors::
ru: Немного более продвинутое использование средства чтения --- выявление ошибок и сообщение об ошибках::

source: And while the module doesn't directly support parsing strings, it can easily be done::
ru: И хотя модуль напрямую не поддерживает синтаксический анализ строк, это можно легко сделать::

source: Footnotes
ru: Сноски

source: If ``newline=''`` is not specified, newlines embedded inside quoted fields will not be interpreted correctly, and on platforms that use ``\r\n`` linendings on write an extra ``\r`` will be added. It should always be safe to specify ``newline=''``, since the csv module does its own (:term:`universal <universal newlines>`) newline handling.
ru: Если ``newline=''`` не указан, символы новой строки, встроенные в поля в кавычках, не будут интерпретироваться правильно, а на платформах, использующих ``\r\n`` при записи, дополнительный ``\r`` будет добавлен. Всегда безопасно указывать ``newline=''``, поскольку модуль csv выполняет собственную (:term:`universal <universal newlines>`) обработку новой строки.

source: data
ru: данные

source: tabular
ru: табличный

source: universal newlines
ru: универсальные переводы строк

source: csv.reader function
ru: функция csv.reader
