Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/csv.po
Languages: ru

source: :mod:`!csv` --- CSV File Reading and Writing
ru: :mod:`!csv` --- Чтение и запись CSV-файла

source: **Source code:** :source:`Lib/csv.py`
ru: **Исходный код:** :source:`Lib/csv.py`

source: The so-called CSV (Comma Separated Values) format is the most common import and export format for spreadsheets and databases. CSV format was used for many years prior to attempts to describe the format in a standardized way in :rfc:`4180`. The lack of a well-defined standard means that subtle differences often exist in the data produced and consumed by different applications. These differences can make it annoying to process CSV files from multiple sources. Still, while the delimiters and quoting characters vary, the overall format is similar enough that it is possible to write a single module which can efficiently manipulate such data, hiding the details of reading and writing the data from the programmer.
ru: Так называемый формат CSV (значения, разделенные запятыми) является наиболее распространенным форматом импорта и экспорта для электронных таблиц и баз данных. Формат CSV использовался в течение многих лет, прежде чем были предприняты попытки стандартизировать его описание в :rfc:`4180`. Отсутствие четко определенного стандарта означает, что в данных, создаваемых и потребляемых различными приложениями, часто существуют небольшие различия. Эти различия могут усложнить обработку файлов CSV из нескольких источников. Тем не менее, хотя разделители и символы кавычек различаются, общий формат достаточно схож, что позволяет написать один модуль, который может эффективно манипулировать такими данными, скрывая детали чтения и записи данных от программиста.

source: The :mod:`csv` module implements classes to read and write tabular data in CSV format. It allows programmers to say, "write this data in the format preferred by Excel," or "read data from this file which was generated by Excel," without knowing the precise details of the CSV format used by Excel. Programmers can also describe the CSV formats understood by other applications or define their own special-purpose CSV formats.
ru: Модуль :mod:`csv` реализует классы для чтения и записи табличных данных в формате CSV. Это позволяет программистам сказать: «запишите эти данные в формате, предпочитаемом Excel» или «прочитайте данные из этого файла, созданного Excel», не зная точных деталей формата CSV, используемого Excel. Программисты также могут описывать форматы CSV, понятные другим приложениям, или определять свои собственные специальные форматы CSV.

source: The :mod:`csv` module's :class:`reader` and :class:`writer` objects read and write sequences. Programmers can also read and write data in dictionary form using the :class:`DictReader` and :class:`DictWriter` classes.
ru: Объекты :class:`reader` и :class:`writer` модуля :mod:`csv` читают и записывают последовательности. Программисты также могут читать и записывать данные в словарной форме, используя классы :class:`DictReader` и :class:`DictWriter`.

source: :pep:`305` - CSV File API
ru: :pep:`305` - API CSV-файлов

source: The Python Enhancement Proposal which proposed this addition to Python.
ru: Python Enhancement Proposal (Предложение по улучшению Python), в котором предлагалось это дополнение к Python.

source: Module Contents
ru: Содержимое модуля

source: The :mod:`csv` module defines the following functions:
ru: Модуль :mod:`csv` содержит следующие функции:

source: Return a :ref:`reader object <reader-objects>` that will process lines from the given *csvfile*. A csvfile must be an iterable of strings, each in the reader's defined csv format. A csvfile is most commonly a file-like object or list. If *csvfile* is a file object, it should be opened with ``newline=''``. [1]_ An optional *dialect* parameter can be given which is used to define a set of parameters specific to a particular CSV dialect. It may be an instance of a subclass of the :class:`Dialect` class or one of the strings returned by the :func:`list_dialects` function. The other optional *fmtparams* keyword arguments can be given to override individual formatting parameters in the current dialect. For full details about the dialect and formatting parameters, see section :ref:`csv-fmt-params`.
ru: Возвращает :ref:`объект чтения <reader-objects>`, который будет обрабатывать строки из данного *csvфайла*. CSV-файл должен представлять собой итерацию строк, каждая из которых имеет формат csv, определенный читателем. CSV-файл чаще всего представляет собой файловый объект или список. Если *csvfile* является файловым объектом, его следует открыть с помощью ``newline=''``. [1]_ Можно указать необязательный параметр *dialect*, который используется для определения набора параметров, специфичных для конкретного диалекта CSV. Это может быть экземпляр подкласса класса :class:`Dialect` или одна из строк, возвращаемых функцией :func:`list_dialects`. Другие необязательные аргументы ключевого слова *fmtparams* могут быть переданы для переопределения отдельных параметров форматирования в текущем диалекте. Полную информацию о диалекте и параметрах форматирования см. в разделе :ref:`csv-fmt-params`.

source: Each row read from the csv file is returned as a list of strings. No automatic data type conversion is performed unless the ``QUOTE_NONNUMERIC`` format option is specified (in which case unquoted fields are transformed into floats).
ru: Каждая строка, прочитанная из файла CSV, возвращается в виде списка строк. Никакое автоматическое преобразование типов данных не выполняется, если не указан параметр формата QUOTE_NONNUMERIC (в этом случае поля без кавычек преобразуются в числа с плавающей запятой).

source: A short usage example::
ru: Краткий пример использования::

source: Return a writer object responsible for converting the user's data into delimited strings on the given file-like object. *csvfile* can be any object with a :meth:`~io.TextIOBase.write` method. If *csvfile* is a file object, it should be opened with ``newline=''`` [1]_. An optional *dialect* parameter can be given which is used to define a set of parameters specific to a particular CSV dialect. It may be an instance of a subclass of the :class:`Dialect` class or one of the strings returned by the :func:`list_dialects` function. The other optional *fmtparams* keyword arguments can be given to override individual formatting parameters in the current dialect. For full details about dialects and formatting parameters, see the :ref:`csv-fmt-params` section. To make it as easy as possible to interface with modules which implement the DB API, the value :const:`None` is written as the empty string. While this isn't a reversible transformation, it makes it easier to dump SQL NULL data values to CSV files without preprocessing the data returned from a ``cursor.fetch*`` call. All other non-string data are stringified with :func:`str` before being written.
ru: Возвращает объект записи, ответственный за преобразование пользовательских данных в строки с разделителями для данного файлового объекта. *csvfile* может быть любым объектом с методом :meth:`~io.TextIOBase.write`. Если *csvfile* является файловым объектом, его следует открыть с помощью ``newline=''`` [1]_ . Можно указать необязательный параметр *dialect*, который используется для определения набора параметров, специфичных для конкретного диалекта CSV. Это может быть экземпляр подкласса класса :class:`Dialect` или одна из строк, возвращаемых функцией :func:`list_dialects`. Другие необязательные аргументы ключевого слова *fmtparams* могут быть переданы для переопределения отдельных параметров форматирования в текущем диалекте. Полную информацию о диалектах и ​​параметрах форматирования см. в разделе :ref:`csv-fmt-params`. Чтобы максимально упростить взаимодействие с модулями, реализующими API БД, значение :const:`None` записывается как пустая строка. Хотя это необратимое преобразование, оно упрощает выгрузку значений данных SQL NULL в файлы CSV без предварительной обработки данных, возвращаемых вызовом ``cursor.fetch*``. Все остальные нестроковые данные перед записью преобразуются в строки с помощью :func:`str`.

source: Associate *dialect* with *name*. *name* must be a string. The dialect can be specified either by passing a sub-class of :class:`Dialect`, or by *fmtparams* keyword arguments, or both, with keyword arguments overriding parameters of the dialect. For full details about dialects and formatting parameters, see section :ref:`csv-fmt-params`.
ru: Свяжите *диалект* с *имя*. *имя* должно быть строкой. Диалект можно указать либо путем передачи подкласса :class:`Dialect`, либо с помощью аргументов ключевого слова *fmtparams*, либо и того, и другого, причем аргументы ключевого слова переопределяют параметры диалекта. Полную информацию о диалектах и ​​параметрах форматирования см. в разделе :ref:`csv-fmt-params`.

source: Delete the dialect associated with *name* from the dialect registry. An :exc:`Error` is raised if *name* is not a registered dialect name.
ru: Удалите диалект, связанный с *name*, из реестра диалектов. Ошибка :exc:`Error` возникает, если *name* не является зарегистрированным именем диалекта.

source: Return the dialect associated with *name*. An :exc:`Error` is raised if *name* is not a registered dialect name. This function returns an immutable :class:`Dialect`.
ru: Вернуть диалект, связанный с *name*. Ошибка :exc:`Error` возникает, если *name* не является зарегистрированным именем диалекта. Эта функция возвращает неизменяемый :class:`Dialect`.

source: Return the names of all registered dialects.
ru: Возвращает имена всех зарегистрированных диалектов.

source: Returns the current maximum field size allowed by the parser. If *new_limit* is given, this becomes the new limit.
ru: Возвращает текущий максимальный размер поля, разрешенный парсером. Если задан *new_limit*, то этот размер становится новым.

source: The :mod:`csv` module defines the following classes:
ru: Модуль :mod:`csv` содержит следующие классы:

source: Create an object that operates like a regular reader but maps the information in each row to a :class:`dict` whose keys are given by the optional *fieldnames* parameter.
ru: Создайте объект, который работает как обычное средство чтения, но отображает информацию в каждой строке в :class:`dict`, ключи которого задаются необязательным параметром *fieldnames*.

source: The *fieldnames* parameter is a :term:`sequence`. If *fieldnames* is omitted, the values in the first row of file *f* will be used as the fieldnames and will be omitted from the results. If *fieldnames* is provided, they will be used and the first row will be included in the results. Regardless of how the fieldnames are determined, the dictionary preserves their original ordering.
ru: Параметр *fieldnames* представляет собой :term:`sequence`. Если *fieldnames* опущено, значения в первой строке файла *f* будут использоваться в качестве имен полей и не будут включены в результаты. Если указаны *fieldnames*, они будут использоваться, и в результаты будет включена первая строка. Независимо от того, как определяются имена полей, словарь сохраняет их первоначальный порядок.

source: If a row has more fields than fieldnames, the remaining data is put in a list and stored with the fieldname specified by *restkey* (which defaults to ``None``). If a non-blank row has fewer fields than fieldnames, the missing values are filled-in with the value of *restval* (which defaults to ``None``).
ru: Если в строке больше полей, чем имен полей, оставшиеся данные помещаются в список и сохраняются с именем поля, указанным *restkey* (которое по умолчанию имеет значение «Нет»). Если в непустой строке меньше полей, чем имен полей, отсутствующие значения заполняются значением *restval* (которое по умолчанию равно ``None``).

source: All other optional or keyword arguments are passed to the underlying :class:`reader` instance.
ru: Все остальные необязательные аргументы или аргументы с ключевыми словами передаются базовому экземпляру :class:`reader`.

source: If the argument passed to *fieldnames* is an iterator, it will be coerced to a :class:`list`.
ru: Если аргумент, переданный в *fieldnames*, является итератором, он будет преобразован в :class:`list`.

source: Returned rows are now of type :class:`OrderedDict`.
ru: Возвращаемые строки теперь имеют тип :class:`OrderedDict`.

source: Returned rows are now of type :class:`dict`.
ru: Возвращаемые строки теперь имеют тип :class:`dict`.

source: Create an object which operates like a regular writer but maps dictionaries onto output rows. The *fieldnames* parameter is a :mod:`sequence <collections.abc>` of keys that identify the order in which values in the dictionary passed to the :meth:`~csvwriter.writerow` method are written to file *f*. The optional *restval* parameter specifies the value to be written if the dictionary is missing a key in *fieldnames*. If the dictionary passed to the :meth:`~csvwriter.writerow` method contains a key not found in *fieldnames*, the optional *extrasaction* parameter indicates what action to take. If it is set to ``'raise'``, the default value, a :exc:`ValueError` is raised. If it is set to ``'ignore'``, extra values in the dictionary are ignored. Any other optional or keyword arguments are passed to the underlying :class:`writer` instance.
ru: Создайте объект, который работает как обычный модуль записи, но сопоставляет словари с выходными строками. Параметр *fieldnames* представляет собой :mod:`последовательность <collections.abc>` ключей, которые определяют порядок, в котором значения из словаря, переданные методу :meth:`~csvwriter.writerow`, записываются в файл *f* . Необязательный параметр *restval* указывает значение, которое будет записано, если в словаре отсутствует ключ в *fieldnames*. Если словарь, переданный методу :meth:`~csvwriter.writerow`, содержит ключ, которого нет в *fieldnames*, необязательный параметр *extrasaction* указывает, какое действие необходимо предпринять. Если для него установлено значение ``'raise'``, поднимается значение по умолчанию, a :exc:`ValueError`. Если установлено значение «игнорировать», дополнительные значения в словаре игнорируются. Любые другие необязательные аргументы или аргументы с ключевыми словами передаются базовому экземпляру :class:`writer`.

source: Note that unlike the :class:`DictReader` class, the *fieldnames* parameter of the :class:`DictWriter` class is not optional.
ru: Обратите внимание, что в отличие от класса :class:`DictReader`, параметр *fieldnames* класса :class:`DictWriter` не является необязательным.

source: The :class:`Dialect` class is a container class whose attributes contain information for how to handle doublequotes, whitespace, delimiters, etc. Due to the lack of a strict CSV specification, different applications produce subtly different CSV data. :class:`Dialect` instances define how :class:`reader` and :class:`writer` instances behave.
ru: Класс :class:`Dialect` — это класс-контейнер, атрибуты которого содержат информацию о том, как обрабатывать двойные кавычки, пробелы, разделители и т. д. Из-за отсутствия строгой спецификации CSV разные приложения создают слегка разные данные CSV. Экземпляры :class:`Dialect` определяют, как ведут себя экземпляры :class:`reader` и :class:`writer`.

source: All available :class:`Dialect` names are returned by :func:`list_dialects`, and they can be registered with specific :class:`reader` and :class:`writer` classes through their initializer (``__init__``) functions like this::
ru: Все доступные имена :class:`Dialect` возвращаются :func:`list_dialects`, и их можно зарегистрировать в определенных классах :class:`reader` и :class:`writer` через их инициализатор (``__init__``) такие функции::

source: The :class:`excel` class defines the usual properties of an Excel-generated CSV file. It is registered with the dialect name ``'excel'``.
ru: Класс :class:`excel` определяет обычные свойства CSV-файла, созданного в Excel. Он зарегистрирован под диалектным названием Excel.

source: The :class:`excel_tab` class defines the usual properties of an Excel-generated TAB-delimited file. It is registered with the dialect name ``'excel-tab'``.
ru: Класс :class:`excel_tab` определяет обычные свойства файла с разделителями TAB, созданного в Excel. Он зарегистрирован под диалектным именем ``'excel-tab'``.

source: The :class:`unix_dialect` class defines the usual properties of a CSV file generated on UNIX systems, i.e. using ``'\n'`` as line terminator and quoting all fields. It is registered with the dialect name ``'unix'``.
ru: Класс :class:`unix_dialect` определяет обычные свойства файла CSV, созданного в системах UNIX, т.е. использование ``'\n'`` в качестве признака конца строки и заключение всех полей в кавычки. Он зарегистрирован под диалектным названием unix.

source: The :class:`Sniffer` class is used to deduce the format of a CSV file.
ru: Класс :class:`Sniffer` используется для определения формата файла CSV.

source: The :class:`Sniffer` class provides two methods:
ru: Класс :class:`Sniffer` предоставляет два метода:

source: Analyze the given *sample* and return a :class:`Dialect` subclass reflecting the parameters found. If the optional *delimiters* parameter is given, it is interpreted as a string containing possible valid delimiter characters.
ru: Проанализируйте данный *образец* и верните подкласс :class:`Dialect`, отражающий найденные параметры. Если задан необязательный параметр *delimiters*, он интерпретируется как строка, содержащая возможные допустимые символы-разделители.

source: Analyze the sample text (presumed to be in CSV format) and return :const:`True` if the first row appears to be a series of column headers. Inspecting each column, one of two key criteria will be considered to estimate if the sample contains a header:
ru: Проанализируйте образец текста (предположительно в формате CSV) и верните :const:`True`, если первая строка представляет собой серию заголовков столбцов. При проверке каждого столбца будет учитываться один из двух ключевых критериев для оценки того, содержит ли образец заголовок:

source: the second through n-th rows contain numeric values
ru: строки со второй по n-ю содержат числовые значения

source: the second through n-th rows contain strings where at least one value's length differs from that of the putative header of that column.
ru: строки со второй по n-ю содержат строки, длина хотя бы одного значения которых отличается от длины предполагаемого заголовка этого столбца.

source: Twenty rows after the first row are sampled; if more than half of columns + rows meet the criteria, :const:`True` is returned.
ru: Выборка производится через двадцать строк после первой; если более половины столбцов и строк соответствуют критериям, возвращается :const:`True`.

source: This method is a rough heuristic and may produce both false positives and negatives.
ru: Этот метод представляет собой грубую эвристику и может давать как ложноположительные, так и отрицательные результаты.

source: An example for :class:`Sniffer` use::
ru: Пример использования :class:`Sniffer`::

source: The :mod:`csv` module defines the following constants:
ru: Модуль :mod:`csv` определяет следующие константы:

source: Instructs :class:`writer` objects to quote all fields.
ru: Указывает объектам :class:`writer` заключать в кавычки все поля.

source: Instructs :class:`writer` objects to only quote those fields which contain special characters such as *delimiter*, *quotechar* or any of the characters in *lineterminator*.
ru: Предписывает объектам :class:`writer` заключать в кавычки только те поля, которые содержат специальные символы, такие как *delimiter*, *quotechar* или любые символы в *lineterminator*.

source: Instructs :class:`writer` objects to quote all non-numeric fields.
ru: Инструктирует объекты :class:`writer` заключать в кавычки все нечисловые поля.

source: Instructs :class:`reader` objects to convert all non-quoted fields to type *float*.
ru: Указывает объектам :class:`reader` преобразовать все поля, не заключенные в кавычки, в тип *float*.

source: Instructs :class:`writer` objects to never quote fields. When the current *delimiter* occurs in output data it is preceded by the current *escapechar* character. If *escapechar* is not set, the writer will raise :exc:`Error` if any characters that require escaping are encountered.
ru: Инструктирует объекты :class:`writer` никогда не заключать поля в кавычки. Когда текущий *разделитель* встречается в выходных данных, ему предшествует текущий символ *escapechar*. Если *escapechar* не установлен, средство записи выдаст :exc:`Error`, если встречаются какие-либо символы, требующие экранирования.

source: Instructs :class:`reader` objects to perform no special processing of quote characters.
ru: Указывает объектам :class:`reader` не выполнять специальную обработку символов кавычек.

source: Instructs :class:`writer` objects to quote all fields which are not ``None``. This is similar to :data:`QUOTE_ALL`, except that if a field value is ``None`` an empty (unquoted) string is written.
ru: Инструктирует объекты :class:`writer` заключать в кавычки все поля, кроме ``None``. Это похоже на :data:`QUOTE_ALL`, за исключением того, что если значение поля равно ``None``, записывается пустая строка (без кавычек).

source: Instructs :class:`reader` objects to interpret an empty (unquoted) field as ``None`` and to otherwise behave as :data:`QUOTE_ALL`.
ru: Указывает объектам :class:`reader` интерпретировать пустое (не заключенное в кавычки) поле как ``None`` и в противном случае вести себя как :data:`QUOTE_ALL`.

source: Instructs :class:`writer` objects to always place quotes around fields which are strings. This is similar to :data:`QUOTE_NONNUMERIC`, except that if a field value is ``None`` an empty (unquoted) string is written.
ru: Указывает объектам :class:`writer` всегда помещать кавычки вокруг полей, которые являются строками. Это похоже на :data:`QUOTE_NONNUMERIC`, за исключением того, что если значение поля равно ``None``, записывается пустая строка (без кавычек).

source: Instructs :class:`reader` objects to interpret an empty (unquoted) string as ``None`` and to otherwise behave as :data:`QUOTE_NONNUMERIC`.
ru: Указывает объектам :class:`reader` интерпретировать пустую (не заключенную в кавычки) строку как ``None`` и в противном случае вести себя как :data:`QUOTE_NONNUMERIC`.

source: The :mod:`csv` module defines the following exception:
ru: Модуль :mod:`csv` определяет следующее исключение:

source: Raised by any of the functions when an error is detected.
ru: Вызывается любой из функций при обнаружении ошибки.

source: Dialects and Formatting Parameters
ru: Диалекты и параметры форматирования
