Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/curses.po
Languages: ru

source: Leave raw mode. Return to normal "cooked" mode with line buffering.
ru: Выйдите из сырого режима. Вернитесь в обычный «приготовленный» режим с буферизацией строк.

source: Return a tuple ``(fg, bg)`` containing the colors for the requested color pair. The value of *pair_number* must be between ``0`` and ``COLOR_PAIRS - 1``.
ru: Возвращает кортеж ``(fg, bg)``, содержащий цвета запрошенной цветовой пары. Значение *pair_number* должно находиться в диапазоне от ``0`` до ``COLOR_PAIRS - 1``.

source: Return the number of the color-pair set by the attribute value *attr*. :func:`color_pair` is the counterpart to this function.
ru: Возвращает номер цветовой пары, заданной значением атрибута *attr*. :func:`color_pair` является аналогом этой функции.

source: Equivalent to ``tputs(str, 1, putchar)``; emit the value of a specified terminfo capability for the current terminal. Note that the output of :func:`putp` always goes to standard output.
ru: Эквивалент ``tputs(str, 1, putchar)``; выдать значение указанной возможности terminfo для текущего терминала. Обратите внимание, что вывод :func:`putp` всегда идет на стандартный вывод.

source: If *flag* is ``False``, the effect is the same as calling :func:`noqiflush`. If *flag* is ``True``, or no argument is provided, the queues will be flushed when these control characters are read.
ru: Если *flag* имеет значение False, эффект такой же, как при вызове :func:`noqiflush`. Если *flag* имеет значение True или аргумент не указан, очереди будут очищены при чтении этих управляющих символов.

source: Enter raw mode. In raw mode, normal line buffering and processing of interrupt, quit, suspend, and flow control keys are turned off; characters are presented to curses input functions one by one.
ru: Войдите в сырой режим. В необработанном режиме обычная буферизация строк и обработка клавиш прерывания, выхода, приостановки и управления потоком отключены; символы передаются функциям ввода проклятий один за другим.

source: Restore the terminal to "program" mode, as previously saved by :func:`def_prog_mode`.
ru: Восстановите терминал в «программный» режим, ранее сохраненный в :func:`def_prog_mode`.

source: Restore the terminal to "shell" mode, as previously saved by :func:`def_shell_mode`.
ru: Восстановите терминал в режим «оболочки», ранее сохраненный с помощью :func:`def_shell_mode`.

source: Restore the state of the terminal modes to what it was at the last call to :func:`savetty`.
ru: Восстановите состояние режимов терминала до того, которое было при последнем вызове :func:`savetty`.

source: Backend function used by :func:`resizeterm`, performing most of the work; when resizing the windows, :func:`resize_term` blank-fills the areas that are extended. The calling application should fill in these areas with appropriate data. The :func:`!resize_term` function attempts to resize all windows. However, due to the calling convention of pads, it is not possible to resize these without additional interaction with the application.
ru: Бэкэнд-функция, используемая :func:`resizeterm`, выполняющая большую часть работы; при изменении размера окон :func:`resize_term` пусто заполняет расширенные области. Вызывающее приложение должно заполнить эти области соответствующими данными. Функция :func:`!resize_term` пытается изменить размер всех окон. Однако из-за соглашения о вызовах контактных площадок невозможно изменить их размер без дополнительного взаимодействия с приложением.

source: Resize the standard and current windows to the specified dimensions, and adjusts other bookkeeping data used by the curses library that record the window dimensions (in particular the SIGWINCH handler).
ru: Изменяет размеры стандартного и текущего окон до указанных размеров и настраивает другие бухгалтерские данные, используемые библиотекой проклятий, которая записывает размеры окна (в частности, обработчик SIGWINCH).

source: Save the current state of the terminal modes in a buffer, usable by :func:`resetty`.
ru: Сохраните текущее состояние режимов терминала в буфере, который можно использовать с помощью :func:`resetty`.

source: Set the virtual screen cursor to *y*, *x*. If *y* and *x* are both ``-1``, then :meth:`leaveok <window.leaveok>` is set ``True``.
ru: Установите курсор виртуального экрана на *y*, *x*. Если *y* и *x* оба равны ``-1``, то :meth:`leaveok <window.leaveok>` устанавливается ``True``.

source: Initialize the terminal. *term* is a string giving the terminal name, or ``None``; if omitted or ``None``, the value of the :envvar:`TERM` environment variable will be used. *fd* is the file descriptor to which any initialization sequences will be sent; if not supplied or ``-1``, the file descriptor for ``sys.stdout`` will be used.
ru: Инициализируйте терминал. *term* — это строка, задающая имя терминала, или ``None``; если оно опущено или ``None``, будет использоваться значение переменной среды :envvar:`TERM`. *fd* — файловый дескриптор, в который будут отправляться любые последовательности инициализации; если он не указан или ``-1``, будет использоваться файловый дескриптор ``sys.stdout``.

source: Must be called if the programmer wants to use colors, and before any other color manipulation routine is called. It is good practice to call this routine right after :func:`initscr`.
ru: Должен быть вызван, если программист хочет использовать цвета, и до вызова любой другой процедуры манипуляции с цветом. Хорошей практикой является вызов этой процедуры сразу после :func:`initscr`.

source: :func:`start_color` initializes eight basic colors (black, red, green, yellow, blue, magenta, cyan, and white), and two global variables in the :mod:`curses` module, :const:`COLORS` and :const:`COLOR_PAIRS`, containing the maximum number of colors and color-pairs the terminal can support. It also restores the colors on the terminal to the values they had when the terminal was just turned on.
ru: :func:`start_color` инициализирует восемь основных цветов (черный, красный, зеленый, желтый, синий, пурпурный, голубой и белый) и две глобальные переменные в модуле :mod:`curses`, :const:`COLORS` и :const:`COLOR_PAIRS`, содержащий максимальное количество цветов и цветовых пар, которые может поддерживать терминал. Он также восстанавливает цвета терминала до значений, которые они имели, когда терминал был только что включен.

source: Return a logical OR of all video attributes supported by the terminal. This information is useful when a curses program needs complete control over the appearance of the screen.
ru: Возвращает логическое ИЛИ всех атрибутов видео, поддерживаемых терминалом. Эта информация полезна, когда программе Curses требуется полный контроль над внешним видом экрана.

source: Return the value of the environment variable :envvar:`TERM`, as a bytes object, truncated to 14 characters.
ru: Верните значение переменной среды :envvar:`TERM` в виде байтового объекта, усеченного до 14 символов.

source: Return the value of the Boolean capability corresponding to the terminfo capability name *capname* as an integer. Return the value ``-1`` if *capname* is not a Boolean capability, or ``0`` if it is canceled or absent from the terminal description.
ru: Возвращает значение логической возможности, соответствующее имени возможности terminfo *capname*, в виде целого числа. Верните значение ``-1``, если *capname* не является логической возможностью, или ``0``, если она отменена или отсутствует в описании терминала.

source: Return the value of the numeric capability corresponding to the terminfo capability name *capname* as an integer. Return the value ``-2`` if *capname* is not a numeric capability, or ``-1`` if it is canceled or absent from the terminal description.
ru: Возвращает значение числовой возможности, соответствующее имени возможности terminfo *capname*, в виде целого числа. Верните значение ``-2``, если *capname* не является числовой возможностью, или ``-1``, если она отменена или отсутствует в описании терминала.

source: Return the value of the string capability corresponding to the terminfo capability name *capname* as a bytes object. Return ``None`` if *capname* is not a terminfo "string capability", or is canceled or absent from the terminal description.
ru: Возвращает значение строковой возможности, соответствующее имени возможности terminfo *capname*, в виде байтового объекта. Возвращайте None, если *capname* не является «строковой возможностью» terminfo, отменено или отсутствует в описании терминала.

source: Instantiate the bytes object *str* with the supplied parameters, where *str* should be a parameterized string obtained from the terminfo database. E.g. ``tparm(tigetstr("cup"), 5, 3)`` could result in ``b'\033[6;4H'``, the exact result depending on terminal type.
ru: Создайте экземпляр объекта байтов *str* с предоставленными параметрами, где *str* должна быть параметризованной строкой, полученной из базы данных terminfo. Например, ``tparm(tigetstr("cup"), 5, 3)`` может привести к ``b'\033[6;4H'``, точный результат зависит от типа терминала.

source: Specify that the file descriptor *fd* be used for typeahead checking. If *fd* is ``-1``, then no typeahead checking is done.
ru: Укажите, что для проверки опережающего ввода будет использоваться файловый дескриптор *fd*. Если *fd* равен ``-1``, то проверка опережающего ввода не выполняется.

source: The curses library does "line-breakout optimization" by looking for typeahead periodically while updating the screen. If input is found, and it is coming from a tty, the current update is postponed until refresh or doupdate is called again, allowing faster response to commands typed in advance. This function allows specifying a different file descriptor for typeahead checking.
ru: Библиотека Curses выполняет «оптимизацию разрыва строк», периодически просматривая ввод текста при обновлении экрана. Если входные данные найдены и поступили от терминала, текущее обновление откладывается до тех пор, пока обновление или обновление не будут вызваны снова, что позволяет быстрее реагировать на команды, введенные заранее. Эта функция позволяет указать другой файловый дескриптор для проверки опережающего ввода.

source: Return a bytes object which is a printable representation of the character *ch*. Control characters are represented as a caret followed by the character, for example as ``b'^C'``. Printing characters are left as they are.
ru: Возвращает объект bytes, который является печатным представлением символа *ch*. Управляющие символы представлены в виде каретки, за которой следует символ, например ``b'^C'``. Печатные символы остаются такими, какие они есть.

source: Push *ch* so the next :meth:`~window.getch` will return it.
ru: Нажмите *ch*, чтобы следующий :meth:`~window.getch` вернул его.

source: Only one *ch* can be pushed before :meth:`!getch` is called.
ru: Перед вызовом :meth:`!getch` можно ввести только один *ch*.

source: Push *ch* so the next :meth:`~window.get_wch` will return it.
ru: Нажмите *ch*, чтобы следующий :meth:`~window.get_wch` вернул его.

source: Only one *ch* can be pushed before :meth:`!get_wch` is called.
ru: Перед вызовом :meth:`!get_wch` можно ввести только один *ch*.

source: Push a :const:`KEY_MOUSE` event onto the input queue, associating the given state data with it.
ru: Поместите событие :const:`KEY_MOUSE` во входную очередь, связав с ним данные о состоянии.

source: If used, this function should be called before :func:`initscr` or newterm are called. When *flag* is ``False``, the values of lines and columns specified in the terminfo database will be used, even if environment variables :envvar:`LINES` and :envvar:`COLUMNS` (used by default) are set, or if curses is running in a window (in which case default behavior would be to use the window size if :envvar:`LINES` and :envvar:`COLUMNS` are not set).
ru: Если эта функция используется, ее следует вызывать до вызова :func:`initscr` или newterm. Когда *flag* имеет значение «False», будут использоваться значения строк и столбцов, указанные в базе данных terminfo, даже если установлены переменные среды :envvar:`LINES` и :envvar:`COLUMNS` (используются по умолчанию). , или если в окне запущено проклятие (в этом случае по умолчанию будет использоваться размер окна, если :envvar:`LINES` и :envvar:`COLUMNS` не установлены).

source: Allow use of default values for colors on terminals supporting this feature. Use this to support transparency in your application. The default color is assigned to the color number ``-1``. After calling this function, ``init_pair(x, curses.COLOR_RED, -1)`` initializes, for instance, color pair *x* to a red foreground color on the default background.
ru: Разрешить использование значений цветов по умолчанию на терминалах, поддерживающих эту функцию. Используйте это для поддержки прозрачности вашего приложения. Цвету по умолчанию присвоен номер цвета ``-1``. После вызова этой функции ``init_pair(x, Curses.COLOR_RED, -1)`` инициализирует, например, цветовую пару *x* красным цветом переднего плана на фоне по умолчанию.

source: Initialize curses and call another callable object, *func*, which should be the rest of your curses-using application. If the application raises an exception, this function will restore the terminal to a sane state before re-raising the exception and generating a traceback. The callable object *func* is then passed the main window 'stdscr' as its first argument, followed by any other arguments passed to :func:`!wrapper`. Before calling *func*, :func:`!wrapper` turns on cbreak mode, turns off echo, enables the terminal keypad, and initializes colors if the terminal has color support. On exit (whether normally or by exception) it restores cooked mode, turns on echo, and disables the terminal keypad.
ru: Инициализируйте проклятия и вызовите другой вызываемый объект, *func*, который должен представлять собой остальную часть вашего приложения, использующего проклятия. Если приложение вызывает исключение, эта функция вернет терминал в нормальное состояние, прежде чем повторно вызвать исключение и сгенерировать обратную трассировку. Вызываемый объект *func* затем передается в главное окно «stdscr» в качестве первого аргумента, за которым следуют любые другие аргументы, передаваемые в :func:`!wrapper`. Перед вызовом *func* :func:`!wrapper` включает режим cbreak, отключает эхо, включает клавиатуру терминала и инициализирует цвета, если терминал поддерживает цвет. При выходе (обычно или в виде исключения) он восстанавливает приготовленный режим, включает эхо и отключает клавиатуру терминала.

source: Window Objects
ru: Оконные объекты

source: Window objects, as returned by :func:`initscr` and :func:`newwin` above, have the following methods and attributes:
ru: Объекты окна, возвращаемые функциями :func:`initscr` и :func:`newwin` выше, имеют следующие методы и атрибуты:

source: Paint character *ch* at ``(y, x)`` with attributes *attr*, overwriting any character previously painted at that location. By default, the character position and attributes are the current settings for the window object.
ru: Нарисовать символ *ch* в позиции ``(y, x)`` с атрибутами *attr*, перезаписав любой символ, ранее нарисованный в этом месте. По умолчанию позиция символа и атрибуты являются текущими настройками объекта окна.

source: Writing outside the window, subwindow, or pad raises a :exc:`curses.error`. Attempting to write to the lower right corner of a window, subwindow, or pad will cause an exception to be raised after the character is printed.
ru: При записи за пределами окна, подокна или панели возникает ошибка :exc:`curses.error`. Попытка записи в нижний правый угол окна, подокна или панели приведет к возникновению исключения после печати символа.

source: Paint at most *n* characters of the character string *str* at ``(y, x)`` with attributes *attr*, overwriting anything previously on the display.
ru: Нарисуйте не более *n* символов символьной строки *str* в позиции ``(y, x)`` с помощью атрибутов *attr*, перезаписывая все, что ранее было на дисплее.

source: Paint the character string *str* at ``(y, x)`` with attributes *attr*, overwriting anything previously on the display.
ru: Нарисуйте строку символов *str* в позиции ``(y, x)`` атрибутами *attr*, перезаписав все, что ранее было на дисплее.

source: Writing outside the window, subwindow, or pad raises :exc:`curses.error`. Attempting to write to the lower right corner of a window, subwindow, or pad will cause an exception to be raised after the string is printed.
ru: При записи за пределами окна, подокна или панели возникает :exc:`curses.error`. Попытка записи в правый нижний угол окна, подокна или панели приведет к возникновению исключения после печати строки.

source: A `bug in ncurses <https://bugs.python.org/issue35924>`_, the backend for this Python module, can cause SegFaults when resizing windows. This is fixed in ncurses-6.1-20190511. If you are stuck with an earlier ncurses, you can avoid triggering this if you do not call :func:`addstr` with a *str* that has embedded newlines. Instead, call :func:`addstr` separately for each line.
ru: `Ошибка в ncurses <https://bugs.python.org/issue35924>`_, серверной части этого модуля Python, может вызывать SegFaults при изменении размера окон. Это исправлено в ncurses-6.1-20190511. Если вы застряли на более ранней версии ncurses, вы можете избежать этого, если не вызываете :func:`addstr` с *str* со встроенными символами новой строки. Вместо этого вызовите :func:`addstr` отдельно для каждой строки.

source: Remove attribute *attr* from the "background" set applied to all writes to the current window.
ru: Удалить атрибут *attr* из набора «фон», применяемый ко всем операциям записи в текущее окно.

source: Add attribute *attr* from the "background" set applied to all writes to the current window.
ru: Добавьте атрибут *attr* из набора «background», применяемый ко всем операциям записи в текущем окне.

source: Set the "background" set of attributes to *attr*. This set is initially ``0`` (no attributes).
ru: Установите для «фонового» набора атрибутов значение *attr*. Изначально этот набор равен «0» (без атрибутов).

source: Set the background property of the window to the character *ch*, with attributes *attr*. The change is then applied to every character position in that window:
ru: Установите для свойства фона окна символ *ch* с атрибутами *attr*. Затем изменение применяется к каждой позиции символа в этом окне:

source: The attribute of every character in the window is changed to the new background attribute.
ru: Атрибут каждого символа в окне изменяется на новый атрибут фона.

source: Wherever the former background character appears, it is changed to the new background character.
ru: Везде, где появляется прежний фоновый символ, он заменяется новым фоновым символом.

source: Set the window's background. A window's background consists of a character and any combination of attributes. The attribute part of the background is combined (OR'ed) with all non-blank characters that are written into the window. Both the character and attribute parts of the background are combined with the blank characters. The background becomes a property of the character and moves with the character through any scrolling and insert/delete line/character operations.
ru: Установите фон окна. Фон окна состоит из символа и любой комбинации атрибутов. Атрибутная часть фона объединяется (соединяется по ИЛИ) со всеми непустыми символами, которые записываются в окно. Как символы, так и атрибуты фона объединяются с пустыми символами. Фон становится свойством персонажа и перемещается вместе с ним при любых операциях прокрутки и вставки/удаления строки/символа.

source: Draw a border around the edges of the window. Each parameter specifies the character to use for a specific part of the border; see the table below for more details.
ru: Нарисуйте границу по краям окна. Каждый параметр определяет символ, который будет использоваться для определенной части границы; более подробную информацию см. в таблице ниже.

source: A ``0`` value for any parameter will cause the default character to be used for that parameter. Keyword parameters can *not* be used. The defaults are listed in this table:
ru: Значение ``0`` для любого параметра приведет к тому, что для этого параметра будет использоваться символ по умолчанию. Параметры ключевых слов *не могут* использоваться. Значения по умолчанию перечислены в этой таблице:

source: Parameter
ru: Параметр

source: Description
ru: Описание

source: Default value
ru: Значение по умолчанию

source: Left side
ru: Левая сторона

source: Right side
ru: Правая сторона

source: Top
ru: Топ

source: Bottom
ru: Подвал

source: Upper-left corner
ru: Верхний левый угол

source: Upper-right corner
ru: Правый верхний угол

source: Bottom-left corner
ru: Левый нижний угол

source: Bottom-right corner
ru: Правый нижний угол

source: Similar to :meth:`border`, but both *ls* and *rs* are *vertch* and both *ts* and *bs* are *horch*. The default corner characters are always used by this function.
ru: Аналогично :meth:`border`, но *ls* и *rs* являются *vertch*, а *ts* и *bs* — *horch*. Эта функция всегда использует угловые символы по умолчанию.

source: Set the attributes of *num* characters at the current cursor position, or at position ``(y, x)`` if supplied. If *num* is not given or is ``-1``, the attribute will be set on all the characters to the end of the line. This function moves cursor to position ``(y, x)`` if supplied. The changed line will be touched using the :meth:`touchline` method so that the contents will be redisplayed by the next window refresh.
ru: Установите атрибуты символов *num* в текущей позиции курсора или в позиции ``(y, x)``, если она указана. Если *num* не задано или равно ``-1``, атрибут будет установлен для всех символов до конца строки. Эта функция перемещает курсор в позицию ``(y, x)``, если она указана. Измененная строка будет затронута с помощью метода :meth:`touchline`, так что содержимое будет повторно отображено при следующем обновлении окна.

source: Like :meth:`erase`, but also cause the whole window to be repainted upon next call to :meth:`refresh`.
ru: Подобно :meth:`erase`, но также вызывает перерисовку всего окна при следующем вызове :meth:`refresh`.

source: If *flag* is ``True``, the next call to :meth:`refresh` will clear the window completely.
ru: Если *flag* равен ``True``, следующий вызов :meth:`refresh` полностью очистит окно.

source: Erase from cursor to the end of the window: all lines below the cursor are deleted, and then the equivalent of :meth:`clrtoeol` is performed.
ru: Стереть от курсора до конца окна: все строки под курсором удаляются, а затем выполняется эквивалент :meth:`clrtoeol`.

source: Erase from cursor to the end of the line.
ru: Стереть от курсора до конца строки.

source: Update the current cursor position of all the ancestors of the window to reflect the current cursor position of the window.
ru: Обновите текущую позицию курсора всех предков окна, чтобы она отражала текущую позицию курсора окна.

source: Delete any character at ``(y, x)``.
ru: Удалите любой символ в позиции ``(y, x)``.

source: Delete the line under the cursor. All following lines are moved up by one line.
ru: Удалите строку под курсором. Все последующие строки сдвигаются на одну строку вверх.

source: An abbreviation for "derive window", :meth:`derwin` is the same as calling :meth:`subwin`, except that *begin_y* and *begin_x* are relative to the origin of the window, rather than relative to the entire screen. Return a window object for the derived window.
ru: Аббревиатура для "извлечь окно" :meth:`derwin` аналогична вызову :meth:`subwin`, за исключением того, что *begin_y* и *begin_x* относятся к началу окна, а не ко всему экран. Верните объект окна для производного окна.
