Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/curses.po
Languages: ru

source: The :mod:`curses` module provides an interface to the curses library, the de-facto standard for portable advanced terminal handling.
ru: Модуль :mod:`curses` предоставляет интерфейс к библиотеке Curses, де-факто стандарту для расширенной портативной обработки терминалов.

source: While curses is most widely used in the Unix environment, versions are available for Windows, DOS, and possibly other systems as well. This extension module is designed to match the API of ncurses, an open-source curses library hosted on Linux and the BSD variants of Unix.
ru: Хотя проклятия наиболее широко используются в среде Unix, доступны версии и для Windows, DOS и, возможно, для других систем. Этот модуль расширения разработан для соответствия API ncurses, библиотеки проклятий с открытым исходным кодом, размещенной в Linux и BSD-вариантах Unix.

source: Whenever the documentation mentions a *character* it can be specified as an integer, a one-character Unicode string or a one-byte byte string.
ru: Всякий раз, когда в документации упоминается *символ*, он может быть указан как целое число, односимвольная строка Юникода или однобайтовая байтовая строка.

source: Whenever the documentation mentions a *character string* it can be specified as a Unicode string or a byte string.
ru: Всякий раз, когда в документации упоминается *строка символов*, ее можно указать как строку Юникода или строку байтов.

source: Module :mod:`curses.ascii`
ru: Модуль :mod:`curses.ascii`

source: Utilities for working with ASCII characters, regardless of your locale settings.
ru: Утилиты для работы с символами ASCII независимо от настроек локали.

source: Module :mod:`curses.panel`
ru: Модуль :mod:`curses.panel`

source: A panel stack extension that adds depth to curses windows.
ru: Расширение стека панелей, которое добавляет глубину окнам проклятий.

source: Module :mod:`curses.textpad`
ru: Модуль :mod:`curses.textpad`

source: Editable text widget for curses supporting :program:`Emacs`\ -like bindings.
ru: Редактируемый текстовый виджет для проклятий, поддерживающий привязки типа Emacs.

source: Tutorial material on using curses with Python, by Andrew Kuchling and Eric Raymond.
ru: Учебный материал по использованию проклятий в Python, написанный Эндрю Кучлингом и Эриком Рэймондом.

source: Functions
ru: Функции

source: The module :mod:`curses` defines the following exception:
ru: Модуль :mod:`curses` определяет следующее исключение:

source: Exception raised when a curses library function returns an error.
ru: Исключение возникает, когда функция библиотеки проклятий возвращает ошибку.

source: Whenever *x* or *y* arguments to a function or a method are optional, they default to the current cursor location. Whenever *attr* is optional, it defaults to :const:`A_NORMAL`.
ru: Если аргументы *x* или *y* функции или метода являются необязательными, по умолчанию они присваивают текущему местоположению курсора. Всякий раз, когда *attr* является необязательным, по умолчанию используется значение :const:`A_NORMAL`.

source: The module :mod:`curses` defines the following functions:
ru: Модуль :mod:`curses` определяет следующие функции:

source: Return the output speed of the terminal in bits per second. On software terminal emulators it will have a fixed high value. Included for historical reasons; in former times, it was used to write output loops for time delays and occasionally to change interfaces depending on the line speed.
ru: Возвращает выходную скорость терминала в битах в секунду. В программных эмуляторах терминала оно будет иметь фиксированное высокое значение. Включено по историческим причинам; в прежние времена он использовался для записи выходных циклов для задержек по времени и иногда для изменения интерфейсов в зависимости от скорости линии.

source: Emit a short attention sound.
ru: Издайте короткий звук внимания.

source: Return ``True`` or ``False``, depending on whether the programmer can change the colors displayed by the terminal.
ru: Возвращайте ``True`` или ``False``, в зависимости от того, может ли программист изменять цвета, отображаемые терминалом.

source: Enter cbreak mode. In cbreak mode (sometimes called "rare" mode) normal tty line buffering is turned off and characters are available to be read one by one. However, unlike raw mode, special characters (interrupt, quit, suspend, and flow control) retain their effects on the tty driver and calling program. Calling first :func:`raw` then :func:`cbreak` leaves the terminal in cbreak mode.
ru: Войдите в режим cbreak. В режиме cbreak (иногда называемом «редким» режимом) обычная буферизация строки tty отключается, и символы доступны для чтения один за другим. Однако, в отличие от необработанного режима, специальные символы (прерывание, выход, приостановка и управление потоком) сохраняют свое влияние на драйвер tty и вызывающую программу. Вызов сначала :func:`raw`, а затем :func:`cbreak` оставляет терминал в режиме cbreak.

source: Return the intensity of the red, green, and blue (RGB) components in the color *color_number*, which must be between ``0`` and ``COLORS - 1``. Return a 3-tuple, containing the R,G,B values for the given color, which will be between ``0`` (no component) and ``1000`` (maximum amount of component).
ru: Возвращает интенсивность красного, зеленого и синего (RGB) компонентов цвета *color_number*, который должен находиться в диапазоне от ``0`` до ``COLORS - 1``. Возвращает кортеж из трех элементов, содержащий значения R,G,B для данного цвета, который будет находиться в диапазоне от «0» (без компонента) до «1000» (максимальное количество компонента).

source: Set the cursor state. *visibility* can be set to ``0``, ``1``, or ``2``, for invisible, normal, or very visible. If the terminal supports the visibility requested, return the previous cursor state; otherwise raise an exception. On many terminals, the "visible" mode is an underline cursor and the "very visible" mode is a block cursor.
ru: Установите состояние курсора. Для *visibility* можно установить значение ``0``, ``1`` или ``2`` для невидимого, нормального или очень видимого. Если терминал поддерживает запрошенную видимость, верните предыдущее состояние курсора; в противном случае вызовите исключение. На многих терминалах «видимый» режим представляет собой подчеркнутый курсор, а «очень видимый» режим — это блочный курсор.

source: Save the current terminal mode as the "program" mode, the mode when the running program is using curses. (Its counterpart is the "shell" mode, for when the program is not in curses.) Subsequent calls to :func:`reset_prog_mode` will restore this mode.
ru: Сохраните текущий режим терминала как режим «программы», режим, когда работающая программа использует ругательства. (Его аналогом является режим «оболочки», когда программа не находится в режиме Curs.) Последующие вызовы :func:`reset_prog_mode` восстановят этот режим.

source: Save the current terminal mode as the "shell" mode, the mode when the running program is not using curses. (Its counterpart is the "program" mode, when the program is using curses capabilities.) Subsequent calls to :func:`reset_shell_mode` will restore this mode.
ru: Сохраните текущий режим терминала как режим «оболочки», режим, когда работающая программа не использует проклятия. (Его аналогом является «программный» режим, когда программа использует возможности проклятий.) Последующие вызовы :func:`reset_shell_mode` восстановят этот режим.

source: Insert an *ms* millisecond pause in output.
ru: Вставьте миллисекундную паузу *ms* в вывод.

source: Update the physical screen. The curses library keeps two data structures, one representing the current physical screen contents and a virtual screen representing the desired next state. The :func:`doupdate` ground updates the physical screen to match the virtual screen.
ru: Обновите физический экран. Библиотека проклятий хранит две структуры данных: одна представляет текущее содержимое физического экрана, а виртуальный экран представляет желаемое следующее состояние. Земля :func:`doupdate` обновляет физический экран, чтобы он соответствовал виртуальному экрану.

source: The virtual screen may be updated by a :meth:`~window.noutrefresh` call after write operations such as :meth:`~window.addstr` have been performed on a window. The normal :meth:`~window.refresh` call is simply :meth:`!noutrefresh` followed by :func:`!doupdate`; if you have to update multiple windows, you can speed performance and perhaps reduce screen flicker by issuing :meth:`!noutrefresh` calls on all windows, followed by a single :func:`!doupdate`.
ru: Виртуальный экран может быть обновлен вызовом :meth:`~window.noutrefresh` после того, как в окне были выполнены операции записи, такие как :meth:`~window.addstr`. Обычный вызов :meth:`~window.refresh` — это просто :meth:`!noutrefresh`, за которым следует :func:`!doupdate`; если вам нужно обновить несколько окон, вы можете повысить производительность и, возможно, уменьшить мерцание экрана, выполнив вызов :meth:`!noutrefresh` для всех окон, за которым следует один вызов :func:`!doupdate`.

source: Enter echo mode. In echo mode, each character input is echoed to the screen as it is entered.
ru: Войдите в режим эха. В режиме эха каждый вводимый символ отображается на экране по мере его ввода.

source: De-initialize the library, and return terminal to normal status.
ru: Деинициализируйте библиотеку и верните терминал в нормальное состояние.

source: Return the user's current erase character as a one-byte bytes object. Under Unix operating systems this is a property of the controlling tty of the curses program, and is not set by the curses library itself.
ru: Возвращает текущий символ стирания пользователя в виде однобайтового объекта. В операционных системах Unix это свойство управляющего терминала программы Curs и не устанавливается самой библиотекой Curs.

source: The :func:`.filter` routine, if used, must be called before :func:`initscr` is called. The effect is that, during those calls, :envvar:`LINES` is set to ``1``; the capabilities ``clear``, ``cup``, ``cud``, ``cud1``, ``cuu1``, ``cuu``, ``vpa`` are disabled; and the ``home`` string is set to the value of ``cr``. The effect is that the cursor is confined to the current line, and so are screen updates. This may be used for enabling character-at-a-time line editing without touching the rest of the screen.
ru: Подпрограмма :func:`.filter`, если она используется, должна быть вызвана до вызова :func:`initscr`. В результате во время этих вызовов :envvar:`LINES` устанавливается в ``1``; возможности ``clear``, ``cup``, ``cud``, ``cud1``, ``cuu1``, ``cuu``, ``vpa`` отключены; а для строки ``home`` установлено значение ``cr``. В результате курсор ограничивается текущей строкой, как и обновления экрана. Это можно использовать для включения посимвольного редактирования строк, не касаясь остальной части экрана.

source: Flash the screen. That is, change it to reverse-video and then change it back in a short interval. Some people prefer such as 'visible bell' to the audible attention signal produced by :func:`beep`.
ru: Прошить экран. То есть изменить его на обратное видео, а затем через небольшой промежуток времени вернуть обратно. Некоторые люди предпочитают такой «видимый звонок» звуковому сигналу внимания, производимому :func:`beep`.

source: Flush all input buffers. This throws away any typeahead that has been typed by the user and has not yet been processed by the program.
ru: Очистить все входные буферы. При этом удаляются любые опережающие вводы, которые были набраны пользователем и еще не были обработаны программой.

source: Return the current coordinates of the virtual screen cursor as a tuple ``(y, x)``. If :meth:`leaveok <window.leaveok>` is currently ``True``, then return ``(-1, -1)``.
ru: Возвращает текущие координаты курсора виртуального экрана в виде кортежа ``(y, x)``. Если :meth:`leaveok <window.leaveok>` в данный момент имеет значение ``True``, то верните ``(-1, -1)``.

source: Return ``True`` if the terminal can display colors; otherwise, return ``False``.
ru: Верните True, если терминал может отображать цвета; в противном случае верните ``False``.

source: Return ``True`` if the terminal has insert- and delete-character capabilities. This function is included for historical reasons only, as all modern software terminal emulators have such capabilities.
ru: Верните True, если терминал имеет возможности вставки и удаления символов. Эта функция включена только по историческим причинам, поскольку все современные программные эмуляторы терминалов имеют такие возможности.

source: Return ``True`` if the terminal has insert- and delete-line capabilities, or can simulate them using scrolling regions. This function is included for historical reasons only, as all modern software terminal emulators have such capabilities.
ru: Возвращайте True, если терминал имеет возможности вставки и удаления строк или может имитировать их с помощью областей прокрутки. Эта функция включена только по историческим причинам, поскольку все современные программные эмуляторы терминалов имеют такие возможности.

source: Take a key value *ch*, and return ``True`` if the current terminal type recognizes a key with that value.
ru: Возьмите значение ключа *ch* и верните ``True``, если текущий тип терминала распознает ключ с этим значением.

source: Used for half-delay mode, which is similar to cbreak mode in that characters typed by the user are immediately available to the program. However, after blocking for *tenths* tenths of seconds, raise an exception if nothing has been typed. The value of *tenths* must be a number between ``1`` and ``255``. Use :func:`nocbreak` to leave half-delay mode.
ru: Используется для режима половинной задержки, который аналогичен режиму cbreak тем, что символы, вводимые пользователем, сразу же доступны программе. Однако после блокировки на *десятые* десятые доли секунды возникает исключение, если ничего не было введено. Значение *десятых* должно быть числом от ``1`` до ``255``. Используйте :func:`nocbreak`, чтобы выйти из режима половинной задержки.

source: Change the definition of a color-pair. It takes three arguments: the number of the color-pair to be changed, the foreground color number, and the background color number. The value of *pair_number* must be between ``1`` and ``COLOR_PAIRS - 1`` (the ``0`` color pair is wired to white on black and cannot be changed). The value of *fg* and *bg* arguments must be between ``0`` and ``COLORS - 1``, or, after calling :func:`use_default_colors`, ``-1``. If the color-pair was previously initialized, the screen is refreshed and all occurrences of that color-pair are changed to the new definition.
ru: Измените определение цветовой пары. Он принимает три аргумента: номер изменяемой пары цветов, номер цвета переднего плана и номер цвета фона. Значение *pair_number* должно находиться в диапазоне от ``1`` до ``COLOR_PAIRS - 1`` (цветовая пара ``0`` подключена к белому на черном и не может быть изменена). Значение аргументов *fg* и *bg* должно находиться в диапазоне от ``0`` до ``COLORS - 1`` или, после вызова :func:`use_default_colors``, ``-1``. Если цветовая пара была инициализирована ранее, экран обновляется, и все вхождения этой цветовой пары заменяются новым определением.

source: Initialize the library. Return a :ref:`window <curses-window-objects>` object which represents the whole screen.
ru: Инициализируйте библиотеку. Возвращает объект :ref:`window <curses-window-objects>`, который представляет весь экран.

source: If there is an error opening the terminal, the underlying curses library may cause the interpreter to exit.
ru: Если при открытии терминала произошла ошибка, базовая библиотека Curses может привести к завершению работы интерпретатора.

source: Return ``True`` if :func:`resize_term` would modify the window structure, ``False`` otherwise.
ru: Возвращайте ``True``, если :func:`resize_term` изменит структуру окна, ``False`` в противном случае.

source: Return ``True`` if :func:`endwin` has been called (that is, the curses library has been deinitialized).
ru: Верните ``True``, если была вызвана :func:`endwin` (то есть библиотека проклятий была деинициализирована).

source: Return the name of the key numbered *k* as a bytes object. The name of a key generating printable ASCII character is the key's character. The name of a control-key combination is a two-byte bytes object consisting of a caret (``b'^'``) followed by the corresponding printable ASCII character. The name of an alt-key combination (128--255) is a bytes object consisting of the prefix ``b'M-'`` followed by the name of the corresponding ASCII character.
ru: Верните имя ключа с номером *k* в виде байтового объекта. Имя ключа, генерирующего печатный символ ASCII, является символом ключа. Имя комбинации клавиш управления представляет собой двухбайтовый объект, состоящий из символа вставки (``b'^'``), за которым следует соответствующий печатаемый символ ASCII. Имя комбинации клавиш alt (128–255) представляет собой байтовый объект, состоящий из префикса ``b'M-'``, за которым следует имя соответствующего символа ASCII.

source: Return the user's current line kill character as a one-byte bytes object. Under Unix operating systems this is a property of the controlling tty of the curses program, and is not set by the curses library itself.
ru: Возвращает текущий символ уничтожения строки пользователя в виде однобайтового объекта. В операционных системах Unix это свойство управляющего терминала программы Curs и не устанавливается самой библиотекой Curs.

source: Return a bytes object containing the terminfo long name field describing the current terminal. The maximum length of a verbose description is 128 characters. It is defined only after the call to :func:`initscr`.
ru: Возвращает объект байтов, содержащий поле длинного имени terminfo, описывающее текущий терминал. Максимальная длина подробного описания — 128 символов. Он определяется только после вызова :func:`initscr`.

source: If *flag* is ``True``, allow 8-bit characters to be input. If *flag* is ``False``, allow only 7-bit chars.
ru: Если *flag* имеет значение True, разрешается ввод 8-битных символов. Если *flag* имеет значение «False», разрешены только 7-битные символы.

source: Set the mouse events to be reported, and return a tuple ``(availmask, oldmask)``. *availmask* indicates which of the specified mouse events can be reported; on complete failure it returns ``0``. *oldmask* is the previous value of the given window's mouse event mask. If this function is never called, no mouse events are ever reported.
ru: Установите события мыши, о которых будет сообщаться, и верните кортеж ``(availmask, oldmask)``. *availmask* указывает, о каких из указанных событий мыши можно сообщить; при полном сбое возвращается ``0``. *oldmask* — предыдущее значение маски событий мыши данного окна. Если эта функция никогда не вызывается, о событиях мыши никогда не сообщается.

source: Sleep for *ms* milliseconds.
ru: Спящий режим на *мс* миллисекунд.

source: Create and return a pointer to a new pad data structure with the given number of lines and columns. Return a pad as a window object.
ru: Создайте и верните указатель на новую структуру данных контактной площадки с заданным количеством строк и столбцов. Верните площадку как объект окна.

source: A pad is like a window, except that it is not restricted by the screen size, and is not necessarily associated with a particular part of the screen. Pads can be used when a large window is needed, and only a part of the window will be on the screen at one time. Automatic refreshes of pads (such as from scrolling or echoing of input) do not occur. The :meth:`~window.refresh` and :meth:`~window.noutrefresh` methods of a pad require 6 arguments to specify the part of the pad to be displayed and the location on the screen to be used for the display. The arguments are *pminrow*, *pmincol*, *sminrow*, *smincol*, *smaxrow*, *smaxcol*; the *p* arguments refer to the upper left corner of the pad region to be displayed and the *s* arguments define a clipping box on the screen within which the pad region is to be displayed.
ru: Панель похожа на окно, за исключением того, что она не ограничена размером экрана и не обязательно связана с определенной частью экрана. Подушечки можно использовать, когда необходимо большое окно, и одновременно на экране будет находиться только часть окна. Автоматического обновления панелей (например, при прокрутке или повторении ввода) не происходит. Методы панели :meth:`~window.refresh` и :meth:`~window.noutrefresh` требуют 6 аргументов, чтобы указать часть панели, которая будет отображаться, и место на экране, которое будет использоваться для отображения. Аргументы: *pminrow*, *pmincol*, *sminrow*, *smincol*, *smaxrow*, *smaxcol*; Аргументы *p* относятся к верхнему левому углу отображаемой области контактной площадки, а аргументы *s* определяют рамку отсечения на экране, внутри которой должна отображаться область контактной площадки.

source: Return a new :ref:`window <curses-window-objects>`, whose left-upper corner is at ``(begin_y, begin_x)``, and whose height/width is *nlines*/*ncols*.
ru: Возвращает новое :ref:`window <curses-window-objects>`, левый верхний угол которого находится на ``(begin_y, Begin_x)``, а высота/ширина равна *nlines*/*ncols*.

source: By default, the window will extend from the specified position to the lower right corner of the screen.
ru: По умолчанию окно расширится от указанного положения до правого нижнего угла экрана.

source: Enter newline mode. This mode translates the return key into newline on input, and translates newline into return and line-feed on output. Newline mode is initially on.
ru: Войдите в режим новой строки. В этом режиме клавиша возврата преобразуется в новую строку при вводе, а новая строка преобразуется в возврат и перевод строки при выводе. Режим новой строки изначально включен.

source: Leave cbreak mode. Return to normal "cooked" mode with line buffering.
ru: Выйдите из режима cbreak. Вернитесь в обычный «приготовленный» режим с буферизацией строк.

source: Leave echo mode. Echoing of input characters is turned off.
ru: Выйдите из режима эха. Эхо вводимых символов отключено.

source: Leave newline mode. Disable translation of return into newline on input, and disable low-level translation of newline into newline/return on output (but this does not change the behavior of ``addch('\n')``, which always does the equivalent of return and line feed on the virtual screen). With translation off, curses can sometimes speed up vertical motion a little; also, it will be able to detect the return key on input.
ru: Выйдите из режима новой строки. Отключите перевод возврата в новую строку при вводе и отключите низкоуровневый перевод перевода строки в перевод строки/возврат на выходе (но это не меняет поведение ``addch('\n')``, который всегда выполняет эквивалент возврат и перевод строки на виртуальном экране). При отключенном переводе проклятия иногда могут немного ускорить вертикальное движение; Кроме того, он сможет обнаружить клавишу возврата при вводе.

source: When the :func:`!noqiflush` routine is used, normal flush of input and output queues associated with the ``INTR``, ``QUIT`` and ``SUSP`` characters will not be done. You may want to call :func:`!noqiflush` in a signal handler if you want output to continue as though the interrupt had not occurred, after the handler exits.
ru: При использовании процедуры :func:`!noqiflush` обычная очистка очередей ввода и вывода, связанных с символами ``INTR``, ``QUIT`` и ``SUSP``, не будет выполнена. Вы можете вызвать :func:`!noqiflush` в обработчике сигнала, если хотите, чтобы вывод продолжался, как будто прерывание не произошло, после выхода из обработчика.
