Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/curses.po
Languages: ru

source: Horizontal highlight
ru: Горизонтальная подсветка

source: Left highlight
ru: Левый подсветка

source: Low highlight
ru: Низкая подсветка

source: Right highlight
ru: Правая подсветка

source: Top highlight
ru: Верхняя подсветка

source: Vertical highlight
ru: Вертикальная подсветка

source: Bit-mask to extract a character
ru: Битовая маска для извлечения символ

source: ``A_ITALIC`` was added.
ru: Был добавлен ``A_ITALIC``.

source: Several constants are available to extract corresponding attributes returned by some methods.
ru: Доступно несколько констант для извлечения соответствующих атрибутов, возвращаемых некоторыми методами.

source: Bit-mask
ru: Битовая маска

source: Bit-mask to extract attributes
ru: Битовая маска для извлечения атрибутов

source: Bit-mask to extract color-pair field information
ru: Битовая маска для извлечения информации о поле цветовой пары

source: Keys are referred to by integer constants with names starting with ``KEY_``. The exact keycaps available are system dependent.
ru: Для ссылок на клавиши используются целочисленные константы с именами, начинающимися с ``KEY_``. Точные доступные сочетания клавиш зависят от системы.

source: Key constant
ru: Ключевая константа

source: Key
ru: Клавиша

source: Minimum key value
ru: Минимальное значение ключа

source: Break key (unreliable)
ru: Сломанный ключ (ненадежный)

source: Down-arrow
ru: Стрелка вниз

source: Up-arrow
ru: Стрелка вверх

source: Left-arrow
ru: Стрелка влево

source: Right-arrow
ru: Стрелка вправо

source: Home key (upward+left arrow)
ru: Клавиша "Домой" (стрелка вверх+влево)

source: Backspace (unreliable)
ru: Backspace (ненадежно)

source: Function keys. Up to 64 function keys are supported.
ru: Функциональные клавиши. Поддерживается до 64 функциональных клавиш.

source: Value of function key *n*
ru: Значение функциональной клавиши *n*

source: Delete line
ru: Удалить строку

source: Insert line
ru: Вставить строку

source: Delete character
ru: Удалить символ

source: Insert char or enter insert mode
ru: Вставить символ или войти в режим вставки

source: Exit insert char mode
ru: Выход из режима вставки символов

source: Clear screen
ru: Очистить экран

source: Clear to end of screen
ru: Очистить до конца экрана

source: Clear to end of line
ru: Очистить до конца строки

source: Scroll 1 line forward
ru: Прокрутите 1 строку вперед

source: Scroll 1 line backward (reverse)
ru: Прокрутка на 1 строку назад (реверс)

source: Next page
ru: Следующая страница

source: Previous page
ru: Предыдущая страница

source: Set tab
ru: Установить вкладку

source: Clear tab
ru: Очистить вкладку

source: Clear all tabs
ru: Очистить все вкладки

source: Enter or send (unreliable)
ru: Ввод или отправка (ненадежно)

source: Soft (partial) reset (unreliable)
ru: Мягкий (частичный) сброс (ненадежный)

source: Reset or hard reset (unreliable)
ru: Сброс или жесткая перезагрузка (ненадежно)

source: Print
ru: печать

source: Home down or bottom (lower left)
ru: Домой вниз или вниз (внизу слева)

source: Upper left of keypad
ru: Верхняя левая часть клавиатуры

source: Upper right of keypad
ru: Верхняя правая часть клавиатуры

source: Center of keypad
ru: Центр клавиатуры

source: Lower left of keypad
ru: Нижняя левая часть клавиатуры

source: Lower right of keypad
ru: Нижняя правая часть клавиатуры

source: Back tab
ru: Задняя вкладка

source: Beg (beginning)
ru: Beg (начало)

source: Cancel
ru: Отмена

source: Close
ru: Закрыть

source: Cmd (command)
ru: Cmd (команда)

source: Copy
ru: Копировать

source: Create
ru: создать

source: End
ru: Конец

source: Exit
ru: Выход

source: Find
ru: Найти

source: Help
ru: Помощь

source: Mark
ru: Метка

source: Message
ru: Сообщение

source: Move
ru: Переместить

source: Next
ru: Следующий

source: Open
ru: Открыть

source: Options
ru: Опции

source: Prev (previous)
ru: Prev (предыдущий)

source: Redo
ru: Повторить

source: Ref (reference)
ru: Ref (ссылка)

source: Refresh
ru: Обновить

source: Replace
ru: Заменить

source: Restart
ru: Перезапустить

source: Resume
ru: Возобновить

source: Save
ru: Сохранить

source: Shifted Beg (beginning)
ru: Измененный Beg (начало)

source: Shifted Cancel
ru: Измененная отмена

source: Shifted Command
ru: Измененная команда

source: Shifted Copy
ru: Измененная копия

source: Shifted Create
ru: Смещенное создание

source: Shifted Delete char
ru: Смещенный символ Delete

source: Shifted Delete line
ru: Смещенная линия удаления

source: Select
ru: Выбор

source: Shifted End
ru: Смещенный конец

source: Shifted Clear line
ru: Смещенная четкая линия

source: Shifted Exit
ru: Смещенный выход

source: Shifted Find
ru: Смещенный поиск

source: Shifted Help
ru: Смещенная помощь

source: Shifted Home
ru: Смещенная дом

source: Shifted Input
ru: Смещенный вход

source: Shifted Left arrow
ru: Смещенная стрелка влево

source: Shifted Message
ru: Смещенное сообщение

source: Shifted Move
ru: Смещенное переместить

source: Shifted Next
ru: Смещенное дальше

source: Shifted Options
ru: Смещенное опции

source: Shifted Prev
ru: Смещенное Prev

source: Shifted Print
ru: Смещенное печать

source: Shifted Redo
ru: Смещенное повторить

source: Shifted Replace
ru: Смещенное переместить

source: Shifted Right arrow
ru: Смещенное стрелка вправо

source: Shifted Resume
ru: Смещенное возобновить

source: Shifted Save
ru: Смещенное сохранить

source: Shifted Suspend
ru: Смещенное приостановить

source: Shifted Undo
ru: Смещенное отменить

source: Suspend
ru: Приостановить

source: Undo
ru: Отменить

source: Mouse event has occurred
ru: Произошло событие мыши

source: Terminal resize event
ru: Событие изменения размера терминала

source: Maximum key value
ru: Максимальное значение ключа

source: On VT100s and their software emulations, such as X terminal emulators, there are normally at least four function keys (:const:`KEY_F1`, :const:`KEY_F2`, :const:`KEY_F3`, :const:`KEY_F4`) available, and the arrow keys mapped to :const:`KEY_UP`, :const:`KEY_DOWN`, :const:`KEY_LEFT` and :const:`KEY_RIGHT` in the obvious way. If your machine has a PC keyboard, it is safe to expect arrow keys and twelve function keys (older PC keyboards may have only ten function keys); also, the following keypad mappings are standard:
ru: В VT100 и их программных эмуляторах, таких как эмуляторы X-терминала, обычно доступны по крайней мере четыре функциональные клавиши (:const:`KEY_F1`, :const:`KEY_F2`, :const:`KEY_F3`, :const:`KEY_F4`), а клавиши со стрелками соответствуют :const:`KEY_UP`, :const:`KEY_DOWN`, :const:`KEY_LEFT` и :const:`KEY_RIGHT` очевидным образом. Если на вашем компьютере установлена клавиатура ПК, то можно с уверенностью ожидать наличия клавиш со стрелками и двенадцати функциональных клавиш (на старых клавиатурах ПК может быть только десять функциональных клавиш); кроме того, стандартными являются следующие сочетания клавиш:

source: Keycap
ru: Кейкап

source: Constant
ru: Константа

source: The following table lists characters from the alternate character set. These are inherited from the VT100 terminal, and will generally be available on software emulations such as X terminals. When there is no graphic available, curses falls back on a crude printable ASCII approximation.
ru: В следующей таблице перечислены символы из альтернативного набора символов. Они унаследованы от терминала VT100 и, как правило, доступны в программных эмуляциях, таких как Х-терминалы. При отсутствии доступной графики curses использует грубое приближение ASCII для печати.

source: These are available only after :func:`initscr` has been called.
ru: Они доступны только после вызова :func:`initscr`.

source: ACS code
ru: Код ACS

source: alternate name for upper right corner
ru: альтернативное название для правого верхнего угла

source: solid square block
ru: сплошной квадрат блокировать

source: board of squares
ru: доска из квадратов

source: alternate name for horizontal line
ru: альтернативное название горизонтальной линии

source: alternate name for upper left corner
ru: альтернативное название для левого верхнего угла

source: alternate name for top tee
ru: Альтернативное название для верхней метки

source: bottom tee
ru: нижняя метка

source: bullet
ru: маркер

source: checker board (stipple)
ru: Контрольная доска (пунктир)

source: arrow pointing down
ru: стрелка, направленная вниз

source: degree symbol
ru: символ степени

source: diamond
ru: ромб

source: greater-than-or-equal-to
ru: больше или равно

source: horizontal line
ru: горизонтальная линия

source: lantern symbol
ru: символ фонаря

source: left arrow
ru: стрелка влево

source: less-than-or-equal-to
ru: меньше, чем или равно

source: lower left-hand corner
ru: левый нижний угол

source: lower right-hand corner
ru: правый нижний угол

source: left tee
ru: левая метка

source: not-equal sign
ru: знак неравенства

source: letter pi
ru: буква пи

source: plus-or-minus sign
ru: знак плюс или минус

source: big plus sign
ru: большой знак плюс

source: right arrow
ru: стрелка вправо

source: right tee
ru: правая метка

source: scan line 1
ru: строка сканирования 1

source: scan line 3
ru: строка сканирования 3

source: scan line 7
ru: строка сканирования 7

source: scan line 9
ru: строка сканирования 9

source: alternate name for lower right corner
ru: альтернативное название для правого нижнего угла

source: alternate name for vertical line
ru: Альтернативное название вертикальной линии

source: alternate name for right tee
ru: Альтернативное название для правой метки

source: alternate name for lower left corner
ru: альтернативное название для левого нижнего угла

source: alternate name for bottom tee
ru: Альтернативное название для нижней метки

source: alternate name for left tee
ru: Альтернативное название для левой метки

source: alternate name for crossover or big plus
ru: Альтернативное название для кроссовера или большого плюса

source: pound sterling
ru: фунт стерлингов

source: top tee
ru: верхняя метка

source: up arrow
ru: стрелка вверх

source: upper left corner
ru: левый верхний угол

source: upper right corner
ru: правый верхний угол

source: vertical line
ru: вертикальная линия

source: The following table lists the predefined colors:
ru: В следующей таблице перечислены предопределенные цвета:

source: Color
ru: Цвет

source: Black
ru: Черный

source: Blue
ru: Голубой

source: Cyan (light greenish blue)
ru: Голубой (светло-зеленовато-голубой)

source: Green
ru: Зеленый

source: Magenta (purplish red)
ru: Пурпурный (пурпурно-красный)

source: Red
ru: Красный

source: White
ru: Белый

source: Yellow
ru: Желтый

source: :mod:`curses.textpad` --- Text input widget for curses programs
ru: :mod:`curses.textpad` --- Виджет ввода текста для программ curses

source: The :mod:`curses.textpad` module provides a :class:`Textbox` class that handles elementary text editing in a curses window, supporting a set of keybindings resembling those of Emacs (thus, also of Netscape Navigator, BBedit 6.x, FrameMaker, and many other programs). The module also provides a rectangle-drawing function useful for framing text boxes or for other purposes.
ru: Модуль :mod:`curses.textpad` предоставляет класс :class:`Textbox`, который обрабатывает элементарное редактирование текста в окне curses, поддерживая набор комбинаций клавиш, аналогичный Emacs (также как Netscape Navigator, BBEdit 6.x, FrameMaker и многих других программ). Модуль также предоставляет функцию рисования прямоугольников, полезную для обрамления текстовых полей или для других целей.

source: The module :mod:`curses.textpad` defines the following function:
ru: Модуль :mod:`curses.textpad` определяет следующую функцию:

source: Draw a rectangle. The first argument must be a window object; the remaining arguments are coordinates relative to that window. The second and third arguments are the y and x coordinates of the upper left hand corner of the rectangle to be drawn; the fourth and fifth arguments are the y and x coordinates of the lower right hand corner. The rectangle will be drawn using VT100/IBM PC forms characters on terminals that make this possible (including xterm and most other software terminal emulators). Otherwise it will be drawn with ASCII dashes, vertical bars, and plus signs.
ru: Рисование прямоугольника. Первым аргументом должен быть объект окна; остальные аргументы - это координаты относительно этого окна. Второй и третий аргументы - это координаты y и x верхнего левого угла прямоугольника, который нужно нарисовать; четвертый и пятый аргументы - это координаты y и x нижнего правого угла. Прямоугольник будет нарисован с использованием символов VT100/IBM PC формирующих их на терминалах, которые делают это возможным (включая xterm и большинство других программных эмуляторов терминалов). В противном случае он будет нарисован с помощью тире ASCII, вертикальных полос и знаков плюс.

source: Textbox objects
ru: Объекты текстового поля

source: You can instantiate a :class:`Textbox` object as follows:
ru: Вы можете создать экземпляр объекта :class:`Textbox` следующим образом:

source: Return a textbox widget object. The *win* argument should be a curses :ref:`window <curses-window-objects>` object in which the textbox is to be contained. The edit cursor of the textbox is initially located at the upper left hand corner of the containing window, with coordinates ``(0, 0)``. The instance's :attr:`stripspaces` flag is initially on.
ru: Возвращает объект виджета текстового поля. Аргументом *win* должен быть объект curses :ref:`window <curses-window-objects>`, в котором должно содержаться текстовое поле. Курсор редактирования текстового поля изначально расположен в верхнем левом углу содержащего его окна с координатами ``(0, 0)``. Флаг экземпляра :attr:`stripspaces` изначально включен.

source: :class:`Textbox` objects have the following methods:
ru: Объекты :class:`Textbox` имеют следующие методы:

source: This is the entry point you will normally use. It accepts editing keystrokes until one of the termination keystrokes is entered. If *validator* is supplied, it must be a function. It will be called for each keystroke entered with the keystroke as a parameter; command dispatch is done on the result. This method returns the window contents as a string; whether blanks in the window are included is affected by the :attr:`stripspaces` attribute.
ru: Это точка входа, которую вы обычно используете. Она принимает нажатия клавиш редактирования до тех пор, пока не будет введено одно из завершающих нажатий. Если указан *validator*, это должна быть функция. Он будет вызываться для каждого нажатия клавиши, введенного с помощью нажатия клавиши в качестве параметра; отправка команды выполняется в зависимости от результата. Этот метод возвращает содержимое окна в виде строки; наличие пробелов в окне зависит от атрибута :attr:`stripspaces`.

source: Process a single command keystroke. Here are the supported special keystrokes:
ru: Обрабатывает одну команду нажатия клавиши. Вот поддерживаемые специальные нажатия клавиш:

source: Keystroke
ru: Клавиша

source: Action
ru: Действие

source: Go to left edge of window.
ru: Перейти к левому краю окна.

source: Cursor left, wrapping to previous line if appropriate.
ru: Курсор перемещается влево, при необходимости возвращаясь к предыдущей строке.

source: Delete character under cursor.
ru: Удалить символ под курсором.

source: Go to right edge (stripspaces off) or end of line (stripspaces on).
ru: Перейти к правому краю (пробелы выключены) или к концу строки (пробелы включены).

source: Cursor right, wrapping to next line when appropriate.
ru: Курсор перемещается вправо, при необходимости переходя к следующей строке.

source: Terminate, returning the window contents.
ru: завершить, вернув содержимое окна.

source: Delete character backward.
ru: Удалить символ в обратном порядке.

source: Terminate if the window is 1 line, otherwise insert newline.
ru: завершить если окно состоит из 1 строки, в противном случае вставить новую строку.

source: If line is blank, delete it, otherwise clear to end of line.
ru: Если строка пустая, удалить ее, иначе очистить до конца строки.

source: Refresh screen.
ru: Обновить экран.

source: Cursor down; move down one line.
ru: Курсор вниз; перейти на одну строку вниз.

source: Insert a blank line at cursor location.
ru: Вставить пустую строку в местоположение курсора.

source: Cursor up; move up one line.
ru: Курсор вверх; перейти на одну строку вверх.

source: Move operations do nothing if the cursor is at an edge where the movement is not possible. The following synonyms are supported where possible:
ru: Операции перемещения ничего не делают, если курсор находится на краю, где перемещение невозможно. По возможности поддерживаются следующие синонимы:

source: All other keystrokes are treated as a command to insert the given character and move right (with line wrapping).
ru: Все остальные нажатия клавиш рассматриваются как команда на вставку данного символа и перемещение вправо (с переносом строк).

source: Return the window contents as a string; whether blanks in the window are included is affected by the :attr:`stripspaces` member.
ru: Вернуть содержимое окна в виде строки; на наличие пробелов в окне влияет член :attr:`stripspaces`.

source: This attribute is a flag which controls the interpretation of blanks in the window. When it is on, trailing blanks on each line are ignored; any cursor motion that would land the cursor on a trailing blank goes to the end of that line instead, and trailing blanks are stripped when the window contents are gathered.
ru: Этот атрибут представляет собой флаг, управляющий интерпретацией пробелов в окне. Когда он включен, конечные пробелы в каждой строке игнорируются; любое движение курсора, которое приводит к попаданию курсора на конечный пробел, вместо этого перемещается в конец этой строки, а конечные пробелы удаляются при сборе содержимого окна.
