Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/curses.po
Languages: ru

source: Add character *ch* with attribute *attr*, and immediately call :meth:`refresh` on the window.
ru: Добавьте символ *ch* с атрибутом *attr* и немедленно вызовите :meth:`refresh` в окне.

source: Test whether the given pair of screen-relative character-cell coordinates are enclosed by the given window, returning ``True`` or ``False``. It is useful for determining what subset of the screen windows enclose the location of a mouse event.
ru: Проверьте, заключена ли данная пара координат символа-ячейки относительно экрана в данное окно, возвращая ``True`` или ``False``. Это полезно для определения того, какое подмножество окон экрана содержит местоположение события мыши.

source: Clear the window.
ru: Очистите окно.

source: Return the given window's current background character/attribute pair.
ru: Возвращает текущую пару фоновых символов/атрибутов данного окна.

source: Get a character. Note that the integer returned does *not* have to be in ASCII range: function keys, keypad keys and so on are represented by numbers higher than 255. In no-delay mode, return ``-1`` if there is no input, otherwise wait until a key is pressed.
ru: Получите персонажа. Обратите внимание, что возвращаемое целое число *не* обязательно должно быть в диапазоне ASCII: функциональные клавиши, клавиши клавиатуры и т. д. представлены числами выше 255. В режиме без задержки верните ``-1``, если нет ввода , в противном случае подождите, пока не будет нажата клавиша.

source: Get a wide character. Return a character for most keys, or an integer for function keys, keypad keys, and other special keys. In no-delay mode, raise an exception if there is no input.
ru: Получите широкий характер. Возвращает символ для большинства клавиш или целое число для функциональных клавиш, клавиш клавиатуры и других специальных клавиш. В режиме без задержки вызывает исключение, если нет ввода.

source: Get a character, returning a string instead of an integer, as :meth:`getch` does. Function keys, keypad keys and other special keys return a multibyte string containing the key name. In no-delay mode, raise an exception if there is no input.
ru: Получите символ, возвращая строку вместо целого числа, как это делает :meth:`getch`. Функциональные клавиши, клавиши клавиатуры и другие специальные клавиши возвращают многобайтовую строку, содержащую имя клавиши. В режиме без задержки вызывает исключение, если нет ввода.

source: Return a tuple ``(y, x)`` of the height and width of the window.
ru: Возвращает кортеж ``(y, x)`` высоты и ширины окна.

source: Return the beginning coordinates of this window relative to its parent window as a tuple ``(y, x)``. Return ``(-1, -1)`` if this window has no parent.
ru: Возвращает начальные координаты этого окна относительно его родительского окна в виде кортежа ``(y, x)``. Верните ``(-1, -1)``, если у этого окна нет родителя.

source: Read a bytes object from the user, with primitive line editing capacity.
ru: Чтение байтового объекта от пользователя с возможностью редактирования примитивных строк.

source: Return a tuple ``(y, x)`` of current cursor position relative to the window's upper-left corner.
ru: Возвращает кортеж ``(y, x)`` текущей позиции курсора относительно верхнего левого угла окна.

source: Display a horizontal line starting at ``(y, x)`` with length *n* consisting of the character *ch*.
ru: Отобразите горизонтальную линию, начинающуюся с ``(y, x)`` и длиной *n*, состоящую из символа *ch*.

source: If *flag* is ``False``, curses no longer considers using the hardware insert/delete character feature of the terminal; if *flag* is ``True``, use of character insertion and deletion is enabled. When curses is first initialized, use of character insert/delete is enabled by default.
ru: Если *flag* имеет значение «False», то Curses больше не рассматривает использование аппаратной функции терминала для вставки/удаления символов; если *flag* имеет значение True, использование вставки и удаления символов включено. При первой инициализации проклятий использование вставки/удаления символов включено по умолчанию.

source: If *flag* is ``True``, :mod:`curses` will try and use hardware line editing facilities. Otherwise, line insertion/deletion are disabled.
ru: Если *flag* равен ``True``, :mod:`curses` попытается использовать аппаратные средства редактирования строк. В противном случае вставка/удаление строк отключено.

source: If *flag* is ``True``, any change in the window image automatically causes the window to be refreshed; you no longer have to call :meth:`refresh` yourself. However, it may degrade performance considerably, due to repeated calls to wrefresh. This option is disabled by default.
ru: Если *flag* имеет значение True, любое изменение изображения окна автоматически приводит к обновлению окна; вам больше не придется самостоятельно вызывать :meth:`refresh`. Однако это может значительно снизить производительность из-за повторных вызовов wrefresh. Эта опция отключена по умолчанию.

source: Return the character at the given position in the window. The bottom 8 bits are the character proper, and upper bits are the attributes.
ru: Возвращает символ в заданную позицию в окне. Нижние 8 бит — это собственно символ, а верхние биты — атрибуты.

source: Paint character *ch* at ``(y, x)`` with attributes *attr*, moving the line from position *x* right by one character.
ru: Нарисуйте символ *ch* в позиции ``(y, x)`` с атрибутами *attr*, переместив строку из позиции *x* вправо на один символ.

source: Insert *nlines* lines into the specified window above the current line. The *nlines* bottom lines are lost. For negative *nlines*, delete *nlines* lines starting with the one under the cursor, and move the remaining lines up. The bottom *nlines* lines are cleared. The current cursor position remains the same.
ru: Вставьте строки *nlines* в указанное окно над текущей строкой. Нижние строки *nlines* теряются. Для отрицательных *nlines* удалите строки *nlines*, начиная с той, что находится под курсором, и переместите оставшиеся строки вверх. Нижние *nlines* строки очищаются. Текущая позиция курсора остается прежней.

source: Insert a blank line under the cursor. All following lines are moved down by one line.
ru: Вставьте пустую строку под курсором. Все последующие строки смещаются на одну строку вниз.

source: Insert a character string (as many characters as will fit on the line) before the character under the cursor, up to *n* characters. If *n* is zero or negative, the entire string is inserted. All characters to the right of the cursor are shifted right, with the rightmost characters on the line being lost. The cursor position does not change (after moving to *y*, *x*, if specified).
ru: Вставьте строку символов (столько символов, сколько поместится в строке) перед символом под курсором, до *n* символов. Если *n* равно нулю или отрицательному значению, вставляется вся строка. Все символы справа от курсора смещаются вправо, при этом самые правые символы в строке теряются. Положение курсора не меняется (после перемещения на *y*, *x*, если указано).

source: Insert a character string (as many characters as will fit on the line) before the character under the cursor. All characters to the right of the cursor are shifted right, with the rightmost characters on the line being lost. The cursor position does not change (after moving to *y*, *x*, if specified).
ru: Вставьте строку символов (столько символов, сколько поместится в строке) перед символом под курсором. Все символы справа от курсора смещаются вправо, при этом самые правые символы в строке теряются. Положение курсора не меняется (после перемещения на *y*, *x*, если указано).

source: Return a bytes object of characters, extracted from the window starting at the current cursor position, or at *y*, *x* if specified. Attributes are stripped from the characters. If *n* is specified, :meth:`instr` returns a string at most *n* characters long (exclusive of the trailing NUL).
ru: Возвращает байтовый объект символов, извлеченный из окна, начиная с текущей позиции курсора или с *y*, *x*, если указано. У персонажей снимаются атрибуты. Если указано *n*, :meth:`instr` возвращает строку длиной не более *n* символов (без учета завершающего NUL).

source: Return ``True`` if the specified line was modified since the last call to :meth:`refresh`; otherwise return ``False``. Raise a :exc:`curses.error` exception if *line* is not valid for the given window.
ru: Верните ``True``, если указанная строка была изменена с момента последнего вызова :meth:`refresh`; в противном случае верните ``False``. Вызовите исключение :exc:`curses.error`, если *line* недопустима для данного окна.

source: Return ``True`` if the specified window was modified since the last call to :meth:`refresh`; otherwise return ``False``.
ru: Возвращает ``True``, если указанное окно было изменено с момента последнего вызова :meth:`refresh`; в противном случае верните ``False``.

source: If *flag* is ``True``, escape sequences generated by some keys (keypad, function keys) will be interpreted by :mod:`curses`. If *flag* is ``False``, escape sequences will be left as is in the input stream.
ru: Если *flag* имеет значение ``True``, escape-последовательности, генерируемые некоторыми клавишами (клавиатура, функциональные клавиши), будут интерпретироваться :mod:`curses`. Если *flag* имеет значение «False», escape-последовательности останутся во входном потоке такими, какие они есть.

source: If *flag* is ``True``, cursor is left where it is on update, instead of being at "cursor position." This reduces cursor movement where possible. If possible the cursor will be made invisible.
ru: Если *flag* имеет значение «True», курсор остается там, где он был при обновлении, а не в «позиции курсора». Это уменьшает перемещение курсора, где это возможно. Если возможно, курсор будет сделан невидимым.

source: If *flag* is ``False``, cursor will always be at "cursor position" after an update.
ru: Если *flag* имеет значение «False», курсор всегда будет находиться в «позиции курсора» после обновления.

source: Move cursor to ``(new_y, new_x)``.
ru: Переместите курсор на ``(new_y, new_x)``.

source: Move the window inside its parent window. The screen-relative parameters of the window are not changed. This routine is used to display different parts of the parent window at the same physical position on the screen.
ru: Переместите окно внутри родительского окна. Относительные к экрану параметры окна не изменяются. Эта процедура используется для отображения различных частей родительского окна в одном и том же физическом положении на экране.

source: Move the window so its upper-left corner is at ``(new_y, new_x)``.
ru: Переместите окно так, чтобы его левый верхний угол находился на позиции ``(new_y, new_x)``.

source: If *flag* is ``True``, :meth:`getch` will be non-blocking.
ru: Если *flag* равен ``True``, :meth:`getch` будет неблокирующим.

source: If *flag* is ``True``, escape sequences will not be timed out.
ru: Если *flag* имеет значение «True», время ожидания escape-последовательностей не будет истекать.

source: If *flag* is ``False``, after a few milliseconds, an escape sequence will not be interpreted, and will be left in the input stream as is.
ru: Если *flag* имеет значение «False», то через несколько миллисекунд escape-последовательность не будет интерпретироваться и останется во входном потоке как есть.

source: Mark for refresh but wait. This function updates the data structure representing the desired state of the window, but does not force an update of the physical screen. To accomplish that, call :func:`doupdate`.
ru: Отметьте для обновления, но подождите. Эта функция обновляет структуру данных, представляющую желаемое состояние окна, но не вызывает принудительное обновление физического экрана. Для этого вызовите :func:`doupdate`.

source: Overlay the window on top of *destwin*. The windows need not be the same size, only the overlapping region is copied. This copy is non-destructive, which means that the current background character does not overwrite the old contents of *destwin*.
ru: Наложите окно поверх *destwin*. Окна не обязательно должны быть одинакового размера, копируется только перекрывающаяся область. Эта копия является неразрушающей, что означает, что текущий фоновый символ не перезаписывает старое содержимое *destwin*.

source: To get fine-grained control over the copied region, the second form of :meth:`overlay` can be used. *sminrow* and *smincol* are the upper-left coordinates of the source window, and the other variables mark a rectangle in the destination window.
ru: Чтобы получить детальный контроль над скопированной областью, можно использовать вторую форму :meth:`overlay`. *sminrow* и *smincol* — это координаты верхнего левого угла исходного окна, а другие переменные отмечают прямоугольник в целевом окне.

source: Overwrite the window on top of *destwin*. The windows need not be the same size, in which case only the overlapping region is copied. This copy is destructive, which means that the current background character overwrites the old contents of *destwin*.
ru: Перезапишите окно поверх *destwin*. Окна не обязательно должны быть одинакового размера, в этом случае копируется только перекрывающаяся область. Эта копия является разрушительной, что означает, что текущий фоновый символ перезаписывает старое содержимое *destwin*.

source: To get fine-grained control over the copied region, the second form of :meth:`overwrite` can be used. *sminrow* and *smincol* are the upper-left coordinates of the source window, the other variables mark a rectangle in the destination window.
ru: Чтобы получить детальный контроль над скопированной областью, можно использовать вторую форму :meth:`overwrite`. *sminrow* и *smincol* — координаты верхнего левого угла исходного окна, остальные переменные отмечают прямоугольник в целевом окне.

source: Write all data associated with the window into the provided file object. This information can be later retrieved using the :func:`getwin` function.
ru: Запишите все данные, связанные с окном, в предоставленный файловый объект. Эту информацию позже можно получить с помощью функции :func:`getwin`.

source: Indicate that the *num* screen lines, starting at line *beg*, are corrupted and should be completely redrawn on the next :meth:`refresh` call.
ru: Указывает, что *num* строки экрана, начиная со строки *beg*, повреждены и должны быть полностью перерисованы при следующем вызове :meth:`refresh`.

source: Touch the entire window, causing it to be completely redrawn on the next :meth:`refresh` call.
ru: Коснитесь всего окна, и оно будет полностью перерисовано при следующем вызове :meth:`refresh`.

source: Update the display immediately (sync actual screen with previous drawing/deleting methods).
ru: Немедленно обновите отображение (синхронизируйте фактический экран с предыдущими методами рисования/удаления).

source: The 6 optional arguments can only be specified when the window is a pad created with :func:`newpad`. The additional parameters are needed to indicate what part of the pad and screen are involved. *pminrow* and *pmincol* specify the upper left-hand corner of the rectangle to be displayed in the pad. *sminrow*, *smincol*, *smaxrow*, and *smaxcol* specify the edges of the rectangle to be displayed on the screen. The lower right-hand corner of the rectangle to be displayed in the pad is calculated from the screen coordinates, since the rectangles must be the same size. Both rectangles must be entirely contained within their respective structures. Negative values of *pminrow*, *pmincol*, *sminrow*, or *smincol* are treated as if they were zero.
ru: Шесть дополнительных аргументов можно указать только в том случае, если окно представляет собой панель, созданную с помощью :func:`newpad`. Дополнительные параметры нужны, чтобы указать, какая часть пэда и экрана задействована. *pminrow* и *pmincol* определяют верхний левый угол прямоугольника, отображаемого на контактной площадке. *sminrow*, *smincol*, *smaxrow* и *smaxcol* определяют края прямоугольника, отображаемого на экране. Правый нижний угол прямоугольника, отображаемого на панели, рассчитывается по координатам экрана, поскольку прямоугольники должны быть одинакового размера. Оба прямоугольника должны полностью содержаться в своих соответствующих структурах. Отрицательные значения *pminrow*, *pmincol*, *sminrow* или *smincol* обрабатываются так, как если бы они были равны нулю.

source: Reallocate storage for a curses window to adjust its dimensions to the specified values. If either dimension is larger than the current values, the window's data is filled with blanks that have the current background rendition (as set by :meth:`bkgdset`) merged into them.
ru: Перераспределите память для окна проклятий, чтобы привести его размеры в соответствие с указанными значениями. Если какое-либо измерение больше текущих значений, данные окна заполняются пробелами, в которые объединено текущее фоновое представление (установленное :meth:`bkgdset`).

source: Scroll the screen or scrolling region upward by *lines* lines.
ru: Прокрутка экрана или прокрутка области вверх на *линии* строки.

source: Control what happens when the cursor of a window is moved off the edge of the window or scrolling region, either as a result of a newline action on the bottom line, or typing the last character of the last line. If *flag* is ``False``, the cursor is left on the bottom line. If *flag* is ``True``, the window is scrolled up one line. Note that in order to get the physical scrolling effect on the terminal, it is also necessary to call :meth:`idlok`.
ru: Управляйте тем, что происходит, когда курсор окна перемещается за край окна или области прокрутки либо в результате действия новой строки в нижней строке, либо в результате ввода последнего символа последней строки. Если *flag* имеет значение «False», курсор остается в нижней строке. Если *flag* имеет значение True, окно прокручивается на одну строку вверх. Обратите внимание: чтобы получить эффект физической прокрутки на терминале, также необходимо вызвать :meth:`idlok`.

source: Set the scrolling region from line *top* to line *bottom*. All scrolling actions will take place in this region.
ru: Установите область прокрутки от линии *верхней* до строки *нижней*. Все действия прокрутки будут происходить в этой области.

source: Turn off the standout attribute. On some terminals this has the side effect of turning off all attributes.
ru: Отключите атрибут «выдающийся». На некоторых терминалах это приводит к отключению всех атрибутов.

source: Turn on attribute *A_STANDOUT*.
ru: Включите атрибут *A_STANDOUT*.

source: Return a sub-window, whose upper-left corner is at ``(begin_y, begin_x)``, and whose width/height is *ncols*/*nlines*.
ru: Возвращает подокно, верхний левый угол которого находится на ``(begin_y, Begin_x)``, а ширина/высота равна *ncols*/*nlines*.

source: By default, the sub-window will extend from the specified position to the lower right corner of the window.
ru: По умолчанию подокно будет простираться от указанной позиции до правого нижнего угла окна.

source: Touch each location in the window that has been touched in any of its ancestor windows. This routine is called by :meth:`refresh`, so it should almost never be necessary to call it manually.
ru: Коснитесь каждого места в окне, к которому прикасались в любом из предшествующих окон. Эта процедура вызывается :meth:`refresh`, поэтому почти никогда не возникает необходимости вызывать ее вручную.

source: If *flag* is ``True``, then :meth:`syncup` is called automatically whenever there is a change in the window.
ru: Если *flag* равен ``True``, то :meth:`syncup` вызывается автоматически при каждом изменении в окне.

source: Touch all locations in ancestors of the window that have been changed in the window.
ru: Коснитесь всех мест в предках окна, которые были изменены в окне.

source: Set blocking or non-blocking read behavior for the window. If *delay* is negative, blocking read is used (which will wait indefinitely for input). If *delay* is zero, then non-blocking read is used, and :meth:`getch` will return ``-1`` if no input is waiting. If *delay* is positive, then :meth:`getch` will block for *delay* milliseconds, and return ``-1`` if there is still no input at the end of that time.
ru: Установите блокирующее или неблокирующее поведение чтения для окна. Если *delay* отрицательное значение, используется блокировка чтения (которая будет ждать ввода неопределенное время). Если *delay* равно нулю, то используется неблокирующее чтение, и :meth:`getch` вернет ``-1``, если никакой ввод не ожидает. Если *delay* положительное значение, то :meth:`getch` будет блокироваться на *delay* миллисекунды и вернет ``-1``, если в конце этого времени все еще нет ввода.

source: Pretend *count* lines have been changed, starting with line *start*. If *changed* is supplied, it specifies whether the affected lines are marked as having been changed (*changed*\ ``=True``) or unchanged (*changed*\ ``=False``).
ru: Притворные строки *count* были изменены, начиная со строки *start*. Если указано *changed*, оно указывает, будут ли затронутые строки помечены как измененные (*changed*\ ``=True``) или неизмененные (*changed*\ ``=False``).

source: Pretend the whole window has been changed, for purposes of drawing optimizations.
ru: Представьте, что все окно было изменено в целях оптимизации рисования.

source: Mark all lines in the window as unchanged since the last call to :meth:`refresh`.
ru: Отметьте все строки в окне как неизмененные с момента последнего вызова :meth:`refresh`.

source: Constants
ru: Константы

source: The :mod:`curses` module defines the following data members:
ru: Модуль :mod:`curses` определяет следующие элементы данных:

source: Some curses routines that return an integer, such as :meth:`~window.getch`, return :const:`ERR` upon failure.
ru: Некоторые процедуры проклятий, которые возвращают целое число, например :meth:`~window.getch`, в случае неудачи возвращают :const:`ERR`.

source: Some curses routines that return an integer, such as :func:`napms`, return :const:`OK` upon success.
ru: Некоторые процедуры проклятий, которые возвращают целое число, например :func:`napms`, в случае успеха возвращают :const:`OK`.

source: A named tuple containing the three components of the ncurses library version: *major*, *minor*, and *patch*. All values are integers. The components can also be accessed by name, so ``curses.ncurses_version[0]`` is equivalent to ``curses.ncurses_version.major`` and so on.
ru: Именованный кортеж, содержащий три компонента версии библиотеки ncurses: *major*, *minor* и *patch*. Все значения являются целыми числами. Доступ к компонентам также возможен по имени, поэтому ``curses.ncurses_version[0]`` эквивалентен ``curses.ncurses_version.major`` и так далее.

source: Availability: if the ncurses library is used.
ru: Доступность: если используется библиотека ncurses.

source: Some constants are available to specify character cell attributes. The exact constants available are system dependent.
ru: Некоторые константы доступны для указания атрибутов символьной ячейки. Точные доступные константы зависят от системы.

source: Attribute
ru: Атрибут

source: Meaning
ru: Значение

source: Alternate character set mode
ru: Альтернативный режим набор символов

source: Blink mode
ru: Режим мигания

source: Bold mode
ru: Режим выделения жирным шрифтом

source: Dim mode
ru: Затемненный режим

source: Invisible or blank mode
ru: Невидимый или пустой режим

source: Italic mode
ru: Режим курсива

source: Normal attribute
ru: Нормальный атрибут

source: Protected mode
ru: Защищенный режим

source: Reverse background and foreground colors
ru: Реверс цветов фона и переднего плана

source: Standout mode
ru: Режим выделения

source: Underline mode
ru: Режим подчеркивания
