Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/dataclasses.po
Languages: uk

source: Be forewarned about how ``init=False`` fields work during a call to :func:`replace`. They are not copied from the source object, but rather are initialized in :meth:`__post_init__`, if they're initialized at all. It is expected that ``init=False`` fields will be rarely and judiciously used. If they are used, it might be wise to have alternate class constructors, or perhaps a custom ``replace()`` (or similarly named) method which handles instance copying.
uk: Будьте попереджені про те, як працюють поля ``init=False`` під час виклику :func:`replace`. Вони не копіюються з вихідного об’єкта, а ініціалізуються в :meth:`__post_init__`, якщо вони взагалі ініціалізовані. Очікується, що поля ``init=False`` будуть використовуватися рідко та розумно. Якщо вони використовуються, було б доцільно мати альтернативні конструктори класів або, можливо, спеціальний метод ``replace()`` (або з подібною назвою), який обробляє копіювання екземплярів.

source: Return ``True`` if its parameter is a dataclass or an instance of one, otherwise return ``False``.
uk: Повертає ``True``, якщо його параметр є класом даних або його екземпляром, інакше повертає ``False``.

source: If you need to know if a class is an instance of a dataclass (and not a dataclass itself), then add a further check for ``not isinstance(obj, type)``::
uk: Якщо вам потрібно знати, чи є клас екземпляром класу даних (а не самим класом даних), тоді додайте додаткову перевірку для ``not isinstance(obj, type)``::

source: Post-init processing
uk: Обробка після ініціалізації

source: The generated :meth:`__init__` code will call a method named :meth:`__post_init__`, if :meth:`__post_init__` is defined on the class. It will normally be called as ``self.__post_init__()``. However, if any ``InitVar`` fields are defined, they will also be passed to :meth:`__post_init__` in the order they were defined in the class. If no :meth:`__init__` method is generated, then :meth:`__post_init__` will not automatically be called.
uk: Згенерований код :meth:`__init__` викличе метод з назвою :meth:`__post_init__`, якщо :meth:`__post_init__` визначено в класі. Зазвичай він буде називатися ``self.__post_init__()``. Однак, якщо визначено будь-які поля ``InitVar``, вони також будуть передані в :meth:`__post_init__` в тому порядку, в якому вони були визначені в класі. Якщо метод :meth:`__init__` не створено, то :meth:`__post_init__` не буде викликатися автоматично.

source: Among other uses, this allows for initializing field values that depend on one or more other fields. For example::
uk: Серед іншого використання це дозволяє ініціалізувати значення полів, які залежать від одного або кількох інших полів. Наприклад::

source: The :meth:`__init__` method generated by :func:`dataclass` does not call base class :meth:`__init__` methods. If the base class has an :meth:`__init__` method that has to be called, it is common to call this method in a :meth:`__post_init__` method::
uk: Метод :meth:`__init__`, створений :func:`dataclass`, не викликає методів базового класу :meth:`__init__`. Якщо базовий клас має метод :meth:`__init__`, який потрібно викликати, зазвичай цей метод викликається в методі :meth:`__post_init__`::

source: Note, however, that in general the dataclass-generated :meth:`__init__` methods don't need to be called, since the derived dataclass will take care of initializing all fields of any base class that is a dataclass itself.
uk: Однак зауважте, що загалом згенеровані класом даних методи :meth:`__init__` не потрібно викликати, оскільки похідний клас даних подбає про ініціалізацію всіх полів будь-якого базового класу, який сам є класом даних.

source: See the section below on init-only variables for ways to pass parameters to :meth:`__post_init__`. Also see the warning about how :func:`replace` handles ``init=False`` fields.
uk: Перегляньте розділ нижче про змінні лише для ініціалізації, щоб дізнатися про способи передачі параметрів у :meth:`__post_init__`. Також перегляньте попередження про те, як :func:`replace` обробляє поля ``init=False``.

source: Class variables
uk: Змінні класу

source: One of two places where :func:`dataclass` actually inspects the type of a field is to determine if a field is a class variable as defined in :pep:`526`. It does this by checking if the type of the field is ``typing.ClassVar``. If a field is a ``ClassVar``, it is excluded from consideration as a field and is ignored by the dataclass mechanisms. Such ``ClassVar`` pseudo-fields are not returned by the module-level :func:`fields` function.
uk: Одним із двох місць, де :func:`dataclass` фактично перевіряє тип поля, є визначення того, чи поле є змінною класу, як визначено в :pep:`526`. Він робить це, перевіряючи, чи є тип поля ``typing.ClassVar``. Якщо поле є ``ClassVar``, воно виключається з розгляду як поле та ігнорується механізмами класу даних. Такі псевдополя ``ClassVar`` не повертаються функцією :func:`fields` рівня модуля.

source: Init-only variables
uk: Змінні лише для ініціалізації

source: The other place where :func:`dataclass` inspects a type annotation is to determine if a field is an init-only variable. It does this by seeing if the type of a field is of type ``dataclasses.InitVar``. If a field is an ``InitVar``, it is considered a pseudo-field called an init-only field. As it is not a true field, it is not returned by the module-level :func:`fields` function. Init-only fields are added as parameters to the generated :meth:`__init__` method, and are passed to the optional :meth:`__post_init__` method. They are not otherwise used by dataclasses.
uk: Інше місце, де :func:`dataclass` перевіряє анотацію типу, — це визначити, чи є поле змінною лише для ініціалізації. Він робить це, переглядаючи, чи тип поля має тип ``dataclasses.InitVar``. Якщо поле є ``InitVar``, воно вважається псевдополем, яке називається полем тільки ініціалізації. Оскільки це не справжнє поле, воно не повертається функцією рівня модуля :func:`fields`. Поля лише для ініціалізації додаються як параметри до створеного методу :meth:`__init__` і передаються до додаткового методу :meth:`__post_init__`. Вони не використовуються класами даних.

source: For example, suppose a field will be initialized from a database, if a value is not provided when creating the class::
uk: Наприклад, припустимо, що поле буде ініціалізовано з бази даних, якщо під час створення класу не вказано значення::

source: In this case, :func:`fields` will return :class:`Field` objects for ``i`` and ``j``, but not for ``database``.
uk: У цьому випадку :func:`fields` повертатиме об’єкти :class:`Field` для ``i`` та ``j``, але не для ``database``.

source: Frozen instances
uk: Заморожені екземпляри

source: It is not possible to create truly immutable Python objects. However, by passing ``frozen=True`` to the :meth:`dataclass` decorator you can emulate immutability. In that case, dataclasses will add :meth:`__setattr__` and :meth:`__delattr__` methods to the class. These methods will raise a :exc:`FrozenInstanceError` when invoked.
uk: Неможливо створити справді незмінні об’єкти Python. Однак, передавши ``frozen=True`` декоратору :meth:`dataclass`, ви можете емулювати незмінність. У цьому випадку класи даних додадуть до класу методи :meth:`__setattr__` і :meth:`__delattr__`. Ці методи викликають помилку :exc:`FrozenInstanceError` під час виклику.

source: There is a tiny performance penalty when using ``frozen=True``: :meth:`__init__` cannot use simple assignment to initialize fields, and must use :meth:`object.__setattr__`.
uk: Під час використання ``frozen=True`` є невелике зниження продуктивності: :meth:`__init__` не може використовувати просте призначення для ініціалізації полів і має використовувати :meth:`object.__setattr__`.

source: Inheritance
uk: Спадщина

source: When the dataclass is being created by the :meth:`dataclass` decorator, it looks through all of the class's base classes in reverse MRO (that is, starting at :class:`object`) and, for each dataclass that it finds, adds the fields from that base class to an ordered mapping of fields. After all of the base class fields are added, it adds its own fields to the ordered mapping. All of the generated methods will use this combined, calculated ordered mapping of fields. Because the fields are in insertion order, derived classes override base classes. An example::
uk: Коли клас даних створюється декоратором :meth:`dataclass`, він переглядає всі базові класи класу в зворотному MRO (тобто починаючи з :class:`object`) і для кожного класу даних, який він знаходить, додає поля з цього базового класу до впорядкованого відображення полів. Після додавання всіх полів базового класу він додає власні поля до впорядкованого відображення. Усі згенеровані методи використовуватимуть це комбіноване обчислене впорядковане відображення полів. Оскільки поля розташовані в порядку вставки, похідні класи замінюють базові класи. Приклад::

source: The final list of fields is, in order, ``x``, ``y``, ``z``. The final type of ``x`` is ``int``, as specified in class ``C``.
uk: Остаточний список полів у такому порядку: ``x``, ``y``, ``z``. Остаточним типом ``x`` є ``int``, як зазначено в класі ``C``.

source: The generated :meth:`__init__` method for ``C`` will look like::
uk: Згенерований метод :meth:`__init__` для ``C`` виглядатиме так:

source: Default factory functions
uk: Стандартні заводські функції

source: If a :func:`field` specifies a ``default_factory``, it is called with zero arguments when a default value for the field is needed. For example, to create a new instance of a list, use::
uk: Якщо :func:`field` визначає ``default_factory``, воно викликається з нульовими аргументами, коли потрібне значення за замовчуванням для поля. Наприклад, щоб створити новий екземпляр списку, використовуйте::

source: If a field is excluded from :meth:`__init__` (using ``init=False``) and the field also specifies ``default_factory``, then the default factory function will always be called from the generated :meth:`__init__` function. This happens because there is no other way to give the field an initial value.
uk: Якщо поле виключено з :meth:`__init__` (за допомогою ``init=False``) і в полі також зазначено ``default_factory``, тоді фабрична функція за замовчуванням завжди буде викликатися зі згенерованого :meth:`__init__` функція. Це відбувається тому, що немає іншого способу надати полю початкове значення.

source: Mutable default values
uk: Змінні значення за замовчуванням

source: Python stores default member variable values in class attributes. Consider this example, not using dataclasses::
uk: Python зберігає значення змінних членів за замовчуванням в атрибутах класу. Розглянемо цей приклад, не використовуючи класи даних::

source: Note that the two instances of class ``C`` share the same class variable ``x``, as expected.
uk: Зауважте, що два екземпляри класу ``C`` спільно використовують ту саму змінну класу ``x``, як і очікувалося.

source: Using dataclasses, *if* this code was valid::
uk: Використання класів даних, *якщо* цей код дійсний::

source: it would generate code similar to::
uk: це створить код, подібний до::

source: Using default factory functions is a way to create new instances of mutable types as default values for fields::
uk: Використання заводських функцій за замовчуванням — це спосіб створення нових екземплярів змінних типів як значень за замовчуванням для полів::

source: Exceptions
uk: Винятки

source: Raised when an implicitly defined :meth:`__setattr__` or :meth:`__delattr__` is called on a dataclass which was defined with ``frozen=True``. It is a subclass of :exc:`AttributeError`.
uk: Викликається, коли неявно визначений :meth:`__setattr__` або :meth:`__delattr__` викликається в класі даних, який був визначений як ``frozen=True``. Це підклас :exc:`AttributeError`.
