Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/dataclasses.po
Languages: uk

source: :mod:`dataclasses` --- Data Classes
uk: :mod:`dataclasses` --- Класи даних

source: **Source code:** :source:`Lib/dataclasses.py`
uk: **Вихідний код:** :source:`Lib/dataclasses.py`

source: This module provides a decorator and functions for automatically adding generated :term:`special method`\s such as :meth:`__init__` and :meth:`__repr__` to user-defined classes. It was originally described in :pep:`557`.
uk: Цей модуль надає декоратор і функції для автоматичного додавання згенерованих :term:`special method`\, таких як :meth:`__init__` і :meth:`__repr__` до визначених користувачем класів. Спочатку це було описано в :pep:`557`.

source: The member variables to use in these generated methods are defined using :pep:`526` type annotations. For example, this code::
uk: Змінні-члени для використання в цих згенерованих методах визначаються за допомогою анотацій типу :pep:`526`. Наприклад, цей код::

source: will add, among other things, a :meth:`__init__` that looks like::
uk: додасть, серед іншого, :meth:`__init__`, який виглядає так::

source: Note that this method is automatically added to the class: it is not directly specified in the ``InventoryItem`` definition shown above.
uk: Зауважте, що цей метод автоматично додається до класу: він не вказано безпосередньо у визначенні ``InventoryItem``, показаному вище.

source: This function is a :term:`decorator` that is used to add generated :term:`special method`\s to classes, as described below.
uk: Ця функція є :term:`decorator`, який використовується для додавання згенерованих :term:`special method`\ до класів, як описано нижче.

source: The :func:`dataclass` decorator examines the class to find ``field``\s. A ``field`` is defined as a class variable that has a :term:`type annotation <variable annotation>`. With two exceptions described below, nothing in :func:`dataclass` examines the type specified in the variable annotation.
uk: Декоратор :func:`dataclass` перевіряє клас, щоб знайти ``поля`` \s. ``Поле`` визначається як змінна класу, яка має :term:`анотацію типу <variable annotation>`. За двома винятками, описаними нижче, нічого в :func:`dataclass` не перевіряє тип, указаний в анотації змінної.

source: The order of the fields in all of the generated methods is the order in which they appear in the class definition.
uk: Порядок полів у всіх згенерованих методах – це порядок, у якому вони з’являються у визначенні класу.

source: The :func:`dataclass` decorator will add various "dunder" methods to the class, described below. If any of the added methods already exist in the class, the behavior depends on the parameter, as documented below. The decorator returns the same class that it is called on; no new class is created.
uk: Декоратор :func:`dataclass` додасть різні методи "dunder" до класу, описані нижче. Якщо будь-який із доданих методів уже існує в класі, поведінка залежить від параметра, як описано нижче. Декоратор повертає той самий клас, до якого він викликаний; новий клас не створюється.

source: If :func:`dataclass` is used just as a simple decorator with no parameters, it acts as if it has the default values documented in this signature. That is, these three uses of :func:`dataclass` are equivalent::
uk: Якщо :func:`dataclass` використовується просто як простий декоратор без параметрів, він діє так, ніби має значення за замовчуванням, задокументовані в цьому підписі. Тобто ці три способи використання :func:`dataclass` еквівалентні:

source: The parameters to :func:`dataclass` are:
uk: Параметри :func:`dataclass`:

source: ``init``: If true (the default), a :meth:`__init__` method will be generated.
uk: ``init``: Якщо true (за замовчуванням), буде згенеровано метод :meth:`__init__`.

source: If the class already defines :meth:`__init__`, this parameter is ignored.
uk: Якщо клас уже визначає :meth:`__init__`, цей параметр ігнорується.

source: ``repr``: If true (the default), a :meth:`__repr__` method will be generated. The generated repr string will have the class name and the name and repr of each field, in the order they are defined in the class. Fields that are marked as being excluded from the repr are not included. For example: ``InventoryItem(name='widget', unit_price=3.0, quantity_on_hand=10)``.
uk: ``repr``: Якщо true (за замовчуванням), буде згенеровано метод :meth:`__repr__`. Згенерований рядок repr матиме назву класу, а також ім’я та repr кожного поля в тому порядку, у якому вони визначені в класі. Поля, які позначені як такі, що виключаються з відображення, не включені. Наприклад: ``InventoryItem(name='widget', unit_price=3.0, quantity_on_hand=10)``.

source: If the class already defines :meth:`__repr__`, this parameter is ignored.
uk: Якщо клас уже визначає :meth:`__repr__`, цей параметр ігнорується.

source: ``eq``: If true (the default), an :meth:`__eq__` method will be generated. This method compares the class as if it were a tuple of its fields, in order. Both instances in the comparison must be of the identical type.
uk: ``eq``: Якщо true (за замовчуванням), буде згенеровано метод :meth:`__eq__`. Цей метод порівнює клас так, ніби це кортеж його полів, по порядку. Обидва екземпляри для порівняння мають бути однакового типу.

source: If the class already defines :meth:`__eq__`, this parameter is ignored.
uk: Якщо клас уже визначає :meth:`__eq__`, цей параметр ігнорується.

source: ``order``: If true (the default is ``False``), :meth:`__lt__`, :meth:`__le__`, :meth:`__gt__`, and :meth:`__ge__` methods will be generated. These compare the class as if it were a tuple of its fields, in order. Both instances in the comparison must be of the identical type. If ``order`` is true and ``eq`` is false, a :exc:`ValueError` is raised.
uk: ``order``: якщо істина (за замовчуванням ``False``), методи :meth:`__lt__`, :meth:`__le__`, :meth:`__gt__` і :meth:`__ge__` будуть створений. Вони порівнюють клас так, ніби це кортеж його полів, по порядку. Обидва екземпляри для порівняння мають бути однакового типу. Якщо ``order`` істинне, а ``eq`` хибне, викликається :exc:`ValueError`.

source: If the class already defines any of :meth:`__lt__`, :meth:`__le__`, :meth:`__gt__`, or :meth:`__ge__`, then :exc:`TypeError` is raised.
uk: Якщо клас уже визначає будь-який із :meth:`__lt__`, :meth:`__le__`, :meth:`__gt__` або :meth:`__ge__`, тоді виникає :exc:`TypeError`.

source: ``unsafe_hash``: If ``False`` (the default), a :meth:`__hash__` method is generated according to how ``eq`` and ``frozen`` are set.
uk: ``unsafe_hash``: якщо ``False`` (за замовчуванням), метод :meth:`__hash__` генерується відповідно до того, як встановлено ``eq`` і ``frozen``.

source: :meth:`__hash__` is used by built-in :meth:`hash()`, and when objects are added to hashed collections such as dictionaries and sets. Having a :meth:`__hash__` implies that instances of the class are immutable. Mutability is a complicated property that depends on the programmer's intent, the existence and behavior of :meth:`__eq__`, and the values of the ``eq`` and ``frozen`` flags in the :func:`dataclass` decorator.
uk: :meth:`__hash__` використовується вбудованим :meth:`hash()`, а також коли об’єкти додаються до хешованих колекцій, таких як словники та набори. Наявність :meth:`__hash__` означає, що екземпляри класу незмінні. Змінність — це складна властивість, яка залежить від наміру програміста, існування та поведінки :meth:`__eq__`, а також значень прапорів ``eq`` і ``frozen`` у декораторі :func:`dataclass` .

source: By default, :func:`dataclass` will not implicitly add a :meth:`__hash__` method unless it is safe to do so. Neither will it add or change an existing explicitly defined :meth:`__hash__` method. Setting the class attribute ``__hash__ = None`` has a specific meaning to Python, as described in the :meth:`__hash__` documentation.
uk: За замовчуванням :func:`dataclass` не буде неявно додавати метод :meth:`__hash__`, якщо це безпечно. Він також не буде додавати або змінювати існуючий явно визначений метод :meth:`__hash__`. Налаштування атрибута класу ``__hash__ = None`` має певне значення для Python, як описано в документації :meth:`__hash__`.

source: If :meth:`__hash__` is not explicitly defined, or if it is set to ``None``, then :func:`dataclass` *may* add an implicit :meth:`__hash__` method. Although not recommended, you can force :func:`dataclass` to create a :meth:`__hash__` method with ``unsafe_hash=True``. This might be the case if your class is logically immutable but can nonetheless be mutated. This is a specialized use case and should be considered carefully.
uk: Якщо :meth:`__hash__` не визначено явно або якщо для нього встановлено значення ``None``, тоді :func:`dataclass` *може* додати неявний метод :meth:`__hash__`. Хоча це не рекомендовано, ви можете змусити :func:`dataclass` створити метод :meth:`__hash__` з ``unsafe_hash=True``. Це може бути у випадку, якщо ваш клас є логічно незмінним, але його можна змінити. Це спеціальний випадок використання, і його слід уважно розглянути.

source: Here are the rules governing implicit creation of a :meth:`__hash__` method. Note that you cannot both have an explicit :meth:`__hash__` method in your dataclass and set ``unsafe_hash=True``; this will result in a :exc:`TypeError`.
uk: Ось правила, що регулюють неявне створення методу :meth:`__hash__`. Зауважте, що ви не можете одночасно мати явний метод :meth:`__hash__` у своєму класі даних і встановити ``unsafe_hash=True``; це призведе до :exc:`TypeError`.

source: If ``eq`` and ``frozen`` are both true, by default :func:`dataclass` will generate a :meth:`__hash__` method for you. If ``eq`` is true and ``frozen`` is false, :meth:`__hash__` will be set to ``None``, marking it unhashable (which it is, since it is mutable). If ``eq`` is false, :meth:`__hash__` will be left untouched meaning the :meth:`__hash__` method of the superclass will be used (if the superclass is :class:`object`, this means it will fall back to id-based hashing).
uk: Якщо ``eq`` і ``frozen`` обидва істинні, за замовчуванням :func:`dataclass` створить для вас метод :meth:`__hash__`. Якщо ``eq`` має значення true, а ``frozen`` — false, :meth:`__hash__` буде встановлено на ``None``, позначаючи його як нехешований (що й є, оскільки він змінний). Якщо ``eq`` має значення false, :meth:`__hash__` залишиться недоторканим, що означає, що буде використано метод :meth:`__hash__` суперкласу (якщо суперкласом є :class:`object`, це означає, що він буде повернутися до хешування на основі ідентифікатора).

source: ``frozen``: If true (the default is ``False``), assigning to fields will generate an exception. This emulates read-only frozen instances. If :meth:`__setattr__` or :meth:`__delattr__` is defined in the class, then :exc:`TypeError` is raised. See the discussion below.
uk: ``frozen``: якщо true (за замовчуванням ``False``), присвоєння полям створить виняток. Це емулює заморожені екземпляри лише для читання. Якщо :meth:`__setattr__` або :meth:`__delattr__` визначено в класі, тоді виникає :exc:`TypeError`. Дивіться обговорення нижче.

source: ``field``\s may optionally specify a default value, using normal Python syntax::
uk: ``field``\s може додатково вказати значення за замовчуванням, використовуючи звичайний синтаксис Python:

source: In this example, both ``a`` and ``b`` will be included in the added :meth:`__init__` method, which will be defined as::
uk: У цьому прикладі як ``a``, так і ``b`` будуть включені в доданий метод :meth:`__init__`, який буде визначено як::

source: :exc:`TypeError` will be raised if a field without a default value follows a field with a default value. This is true whether this occurs in a single class, or as a result of class inheritance.
uk: :exc:`TypeError` буде викликано, якщо поле без значення за замовчуванням слідує за полем зі значенням за замовчуванням. Це вірно незалежно від того, чи відбувається це в одному класі, чи в результаті успадкування класу.

source: For common and simple use cases, no other functionality is required. There are, however, some dataclass features that require additional per-field information. To satisfy this need for additional information, you can replace the default field value with a call to the provided :func:`field` function. For example::
uk: Для звичайних і простих випадків використання інші функції не потрібні. Однак існують деякі функції класу даних, які потребують додаткової інформації для кожного поля. Щоб задовольнити цю потребу в додатковій інформації, ви можете замінити значення поля за замовчуванням викликом наданої функції :func:`field`. Наприклад::

source: The parameters to :func:`field` are:
uk: Параметри :func:`field` такі:

source: ``default``: If provided, this will be the default value for this field. This is needed because the :meth:`field` call itself replaces the normal position of the default value.
uk: ``default``: якщо вказано, це буде значення за замовчуванням для цього поля. Це необхідно, оскільки сам виклик :meth:`field` замінює звичайну позицію значення за замовчуванням.

source: ``default_factory``: If provided, it must be a zero-argument callable that will be called when a default value is needed for this field. Among other purposes, this can be used to specify fields with mutable default values, as discussed below. It is an error to specify both ``default`` and ``default_factory``.
uk: ``default_factory``: якщо вказано, це має бути функція виклику з нульовим аргументом, яка буде викликана, коли для цього поля потрібне значення за замовчуванням. Серед інших цілей це можна використовувати для визначення полів зі змінними значеннями за замовчуванням, як обговорюється нижче. Помилково вказувати як ``default``, так і ``default_factory``.

source: ``init``: If true (the default), this field is included as a parameter to the generated :meth:`__init__` method.
uk: ``init``: Якщо true (за замовчуванням), це поле включено як параметр до створеного методу :meth:`__init__`.

source: ``repr``: If true (the default), this field is included in the string returned by the generated :meth:`__repr__` method.
uk: ``repr``: Якщо true (за замовчуванням), це поле включено в рядок, який повертає згенерований метод :meth:`__repr__`.

source: ``compare``: If true (the default), this field is included in the generated equality and comparison methods (:meth:`__eq__`, :meth:`__gt__`, et al.).
uk: ``compare``: якщо true (за замовчуванням), це поле включено до згенерованих методів рівності та порівняння (:meth:`__eq__`, :meth:`__gt__` та ін.).

source: ``hash``: This can be a bool or ``None``. If true, this field is included in the generated :meth:`__hash__` method. If ``None`` (the default), use the value of ``compare``: this would normally be the expected behavior. A field should be considered in the hash if it's used for comparisons. Setting this value to anything other than ``None`` is discouraged.
uk: ``хеш``: Це може бути логічне значення або ``None``. Якщо значення true, це поле буде включено до згенерованого методу :meth:`__hash__`. Якщо ``None`` (за замовчуванням), використовуйте значення ``compare``: зазвичай це буде очікувана поведінка. Поле слід враховувати в хеші, якщо воно використовується для порівнянь. Не рекомендується встановлювати для цього значення будь-яке значення, окрім ``None``.

source: One possible reason to set ``hash=False`` but ``compare=True`` would be if a field is expensive to compute a hash value for, that field is needed for equality testing, and there are other fields that contribute to the type's hash value. Even if a field is excluded from the hash, it will still be used for comparisons.
uk: Однією з можливих причин встановити ``hash=False``, але ``compare=True`` було б, якщо поле є дорогим для обчислення хеш-значення, це поле потрібне для перевірки рівності, і є інші поля, які сприяють хеш-значення типу. Навіть якщо поле виключено з хешу, воно все одно використовуватиметься для порівнянь.

source: ``metadata``: This can be a mapping or None. None is treated as an empty dict. This value is wrapped in :func:`~types.MappingProxyType` to make it read-only, and exposed on the :class:`Field` object. It is not used at all by Data Classes, and is provided as a third-party extension mechanism. Multiple third-parties can each have their own key, to use as a namespace in the metadata.
uk: ``метадані``: це може бути відображення або немає. None не розглядається як порожній dict. Це значення загорнуте в :func:`~types.MappingProxyType`, щоб зробити його доступним лише для читання, і відображатиметься в об’єкті :class:`Field`. Він взагалі не використовується класами даних і надається як сторонній механізм розширення. Кілька сторонніх розробників можуть мати власний ключ, який можна використовувати як простір імен у метаданих.

source: If the default value of a field is specified by a call to :func:`field()`, then the class attribute for this field will be replaced by the specified ``default`` value. If no ``default`` is provided, then the class attribute will be deleted. The intent is that after the :func:`dataclass` decorator runs, the class attributes will all contain the default values for the fields, just as if the default value itself were specified. For example, after::
uk: Якщо значення поля за замовчуванням вказано викликом :func:`field()`, тоді атрибут класу для цього поля буде замінено вказаним значенням ``default``. Якщо ``default`` не вказано, тоді атрибут класу буде видалено. Намір полягає в тому, що після запуску декоратора :func:`dataclass` всі атрибути класу будуть містити значення за замовчуванням для полів, так само, якби було вказано саме значення за замовчуванням. Наприклад, після::

source: The class attribute ``C.z`` will be ``10``, the class attribute ``C.t`` will be ``20``, and the class attributes ``C.x`` and ``C.y`` will not be set.
uk: Атрибут класу ``C.z`` буде ``10``, атрибут класу ``C.t`` буде ``20``, а атрибути класу ``C.x`` і ``C.y`` не будуть встановити.

source: :class:`Field` objects describe each defined field. These objects are created internally, and are returned by the :func:`fields` module-level method (see below). Users should never instantiate a :class:`Field` object directly. Its documented attributes are:
uk: Об'єкти :class:`Field` описують кожне визначене поле. Ці об’єкти створюються всередині та повертаються методом рівня модуля :func:`fields` (див. нижче). Користувачі ніколи не повинні створювати об’єкт :class:`Field` безпосередньо. Його задокументовані атрибути:

source: ``name``: The name of the field.
uk: ``name``: назва поля.

source: ``type``: The type of the field.
uk: ``type``: тип поля.

source: Other attributes may exist, but they are private and must not be inspected or relied on.
uk: Інші атрибути можуть існувати, але вони є приватними, і їх не можна перевіряти чи покладатися на них.

source: Returns a tuple of :class:`Field` objects that define the fields for this dataclass. Accepts either a dataclass, or an instance of a dataclass. Raises :exc:`TypeError` if not passed a dataclass or instance of one. Does not return pseudo-fields which are ``ClassVar`` or ``InitVar``.
uk: Повертає кортеж об’єктів :class:`Field`, які визначають поля для цього класу даних. Приймає або клас даних, або екземпляр класу даних. Викликає :exc:`TypeError`, якщо не передано клас даних або його екземпляр. Не повертає псевдополя, які є ``ClassVar`` або ``InitVar``.

source: Converts the dataclass ``obj`` to a dict (by using the factory function ``dict_factory``). Each dataclass is converted to a dict of its fields, as ``name: value`` pairs. dataclasses, dicts, lists, and tuples are recursed into. Other objects are copied with :func:`copy.deepcopy`.
uk: Перетворює клас даних ``obj`` на dict (за допомогою фабричної функції ``dict_factory``). Кожен клас даних перетворюється на диктофон своїх полів у вигляді пар "ім’я: значення". класи даних, диктофони, списки та кортежі рекурсують. Інші об’єкти копіюються за допомогою :func:`copy.deepcopy`.

source: Example of using :func:`asdict` on nested dataclasses::
uk: Приклад використання :func:`asdict` у вкладених класах даних::

source: To create a shallow copy, the following workaround may be used::
uk: Щоб створити дрібну копію, можна використати такий обхідний шлях:

source: :func:`asdict` raises :exc:`TypeError` if ``obj`` is not a dataclass instance.
uk: :func:`asdict` викликає :exc:`TypeError`, якщо ``obj`` не є екземпляром класу даних.

source: Converts the dataclass ``obj`` to a tuple (by using the factory function ``tuple_factory``). Each dataclass is converted to a tuple of its field values. dataclasses, dicts, lists, and tuples are recursed into. Other objects are copied with :func:`copy.deepcopy`.
uk: Перетворює клас даних ``obj`` на кортеж (за допомогою фабричної функції ``tuple_factory``). Кожен клас даних перетворюється на кортеж значень свого поля. класи даних, диктофони, списки та кортежі рекурсують. Інші об’єкти копіюються за допомогою :func:`copy.deepcopy`.

source: Continuing from the previous example::
uk: Продовжуючи попередній приклад:

source: :func:`astuple` raises :exc:`TypeError` if ``obj`` is not a dataclass instance.
uk: :func:`astuple` викликає :exc:`TypeError`, якщо ``obj`` не є екземпляром класу даних.

source: This function is not strictly required, because any Python mechanism for creating a new class with ``__annotations__`` can then apply the :func:`dataclass` function to convert that class to a dataclass. This function is provided as a convenience. For example::
uk: Ця функція не є обов’язковою, оскільки будь-який механізм Python для створення нового класу з ``__annotations__`` може потім застосувати функцію :func:`dataclass` для перетворення цього класу на клас даних. Ця функція передбачена для зручності. Наприклад::

source: Is equivalent to::
uk: Еквівалентно::

source: Creates a new object of the same type as ``obj``, replacing fields with values from ``changes``. If ``obj`` is not a Data Class, raises :exc:`TypeError`. If values in ``changes`` do not specify fields, raises :exc:`TypeError`.
uk: Створює новий об’єкт того самого типу, що й ``obj``, замінюючи поля значеннями ``changes``. Якщо ``obj`` не є класом даних, викликає :exc:`TypeError`. Якщо значення в ``changes`` не вказують на поля, викликає :exc:`TypeError`.

source: The newly returned object is created by calling the :meth:`__init__` method of the dataclass. This ensures that :meth:`__post_init__`, if present, is also called.
uk: Щойно повернутий об’єкт створюється шляхом виклику методу :meth:`__init__` класу даних. Це гарантує, що :meth:`__post_init__`, якщо він присутній, також викликається.

source: Init-only variables without default values, if any exist, must be specified on the call to :func:`replace` so that they can be passed to :meth:`__init__` and :meth:`__post_init__`.
uk: Змінні лише для ініціалізації без значень за замовчуванням, якщо такі існують, необхідно вказати під час виклику :func:`replace`, щоб їх можна було передати в :meth:`__init__` і :meth:`__post_init__`.

source: It is an error for ``changes`` to contain any fields that are defined as having ``init=False``. A :exc:`ValueError` will be raised in this case.
uk: Це помилка, якщо ``changes`` містить будь-які поля, які визначені як такі, що мають ``init=False``. У цьому випадку буде викликано помилку :exc:`ValueError`.
