Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/datetime.po
Languages: ru

source: Return a new :class:`.datetime` object whose date components are equal to the given :class:`date` object's, and whose time components are equal to the given :class:`.time` object's. If the *tzinfo* argument is provided, its value is used to set the :attr:`.tzinfo` attribute of the result, otherwise the :attr:`~.time.tzinfo` attribute of the *time* argument is used. If the *date* argument is a :class:`.datetime` object, its time components and :attr:`.tzinfo` attributes are ignored.
ru: Возвращает новый объект :class:`.datetime`, компоненты даты которого равны заданному объекту :class:`date`, а компоненты времени равны заданному объекту :class:`.time`. Если указан аргумент *tzinfo*, его значение используется для установки атрибута :attr:`.tzinfo` результата, в противном случае используется атрибут :attr:`~.time.tzinfo` аргумента *time*. Если аргумент *date* является объектом :class:`.datetime`, его компоненты времени и атрибуты :attr:`.tzinfo` игнорируются.

source: For any :class:`.datetime` object ``d``, ``d == datetime.combine(d.date(), d.time(), d.tzinfo)``.
ru: Для любого объекта :class:`.datetime` ``d``, ``d == datetime.combine(d.date(), d.time(), d.tzinfo)``.

source: Added the *tzinfo* argument.
ru: Добавлен аргумент *tzinfo*.

source: Return a :class:`.datetime` corresponding to a *date_string* in any valid ISO 8601 format, with the following exceptions:
ru: Возвращает :class:`.datetime`, соответствующий *date_string* в любом допустимом формате ISO 8601, за следующими исключениями:

source: Time zone offsets may have fractional seconds.
ru: Смещение часового пояса может составлять доли секунды.

source: The ``T`` separator may be replaced by any single unicode character.
ru: Разделитель ``T`` может быть заменен любым символом Юникода.

source: Fractional hours and minutes are not supported.
ru: Дробные часы и минуты не поддерживаются.

source: Previously, this method only supported formats that could be emitted by :meth:`date.isoformat` or :meth:`datetime.isoformat`.
ru: Ранее этот метод поддерживал только форматы, которые могли быть созданы с помощью :meth:`date.isoformat` или :meth:`datetime.isoformat`.

source: Return a :class:`.datetime` corresponding to the ISO calendar date specified by year, week and day. The non-date components of the datetime are populated with their normal default values. This is the inverse of the function :meth:`datetime.isocalendar`.
ru: Возвращает :class:`.datetime`, соответствующий дате календаря ISO, указанной годом, неделей и днем. Компоненты даты и времени, не относящиеся к дате, заполняются обычными значениями по умолчанию. Это обратная функция :meth:`datetime.isocalendar`.

source: Return a :class:`.datetime` corresponding to *date_string*, parsed according to *format*.
ru: Возвращает :class:`.datetime`, соответствующий *date_string*, анализируемый в соответствии с *format*.

source: If *format* does not contain microseconds or time zone information, this is equivalent to::
ru: Если *format* не содержит микросекунд или информации о часовом поясе, это эквивалентно::

source: :exc:`ValueError` is raised if the date_string and format can't be parsed by :func:`time.strptime` or if it returns a value which isn't a time tuple. See also :ref:`strftime-strptime-behavior` and :meth:`datetime.fromisoformat`.
ru: :exc:`ValueError` возникает, если строка_даты и формат не могут быть проанализированы с помощью :func:`time.strptime` или если она возвращает значение, которое не является кортежем времени. См. также :ref:`strftime-strptime-behavior` и :meth:`datetime.fromisoformat`.

source: The earliest representable :class:`.datetime`, ``datetime(MINYEAR, 1, 1, tzinfo=None)``.
ru: Самый ранний представимый :class:`.datetime`, ``datetime(MINYEAR, 1, 1, tzinfo=None)``.

source: The latest representable :class:`.datetime`, ``datetime(MAXYEAR, 12, 31, 23, 59, 59, 999999, tzinfo=None)``.
ru: Самый последний представимый :class:`.datetime`, ``datetime(MAXYEAR, 12, 31, 23, 59, 59, 999999, tzinfo=None)``.

source: The smallest possible difference between non-equal :class:`.datetime` objects, ``timedelta(microseconds=1)``.
ru: Наименьшая возможная разница между неравными объектами :class:`.datetime`, ``timedelta(microсекунды=1)``.

source: In ``range(24)``.
ru: На сайте ``range(24)``.

source: In ``range(60)``.
ru: На сайте ``range(60)``.

source: In ``range(1000000)``.
ru: На сайте ``range(1000000)``.

source: The object passed as the *tzinfo* argument to the :class:`.datetime` constructor, or ``None`` if none was passed.
ru: Объект передается как аргумент *tzinfo* конструктору :class:`.datetime` или ``None``, если ничего не было передано.

source: In ``[0, 1]``. Used to disambiguate wall times during a repeated interval. (A repeated interval occurs when clocks are rolled back at the end of daylight saving time or when the UTC offset for the current zone is decreased for political reasons.) The values 0 and 1 represent, respectively, the earlier and later of the two moments with the same wall time representation.
ru: В ``[0, 1]``. Используется для устранения неоднозначности времени стены в течение повторяющегося интервала. (Повторяющийся интервал возникает, когда часы откатываются назад в конце летнего времени или когда смещение UTC для текущей зоны уменьшается по политическим причинам.) Значения 0 и 1 представляют соответственно более ранний и поздний из двух моментов. с тем же представлением времени на стене.

source: ``datetime2`` is a duration of ``timedelta`` removed from ``datetime1``, moving forward in time if ``timedelta.days > 0``, or backward if ``timedelta.days < 0``. The result has the same :attr:`~.datetime.tzinfo` attribute as the input datetime, and ``datetime2 - datetime1 == timedelta`` after. :exc:`OverflowError` is raised if ``datetime2.year`` would be smaller than :const:`MINYEAR` or larger than :const:`MAXYEAR`. Note that no time zone adjustments are done even if the input is an aware object.
ru: datetime2 — это длительность timedelta, удаленная из datetime1, перемещающаяся вперед во времени, если timedelta.days > 0, или назад, если timedelta.days < 0. Результат имеет тот же атрибут :attr:`~.datetime.tzinfo`, что и входное datetime, и ``datetime2 - datetime1 == timedelta`` после. :exc:`OverflowError` возникает, если ``datetime2.year`` меньше :const:`MINYEAR` или больше :const:`MAXYEAR`. Обратите внимание, что корректировка часового пояса не выполняется, даже если входные данные являются осведомленным объектом.

source: Computes the ``datetime2`` such that ``datetime2 + timedelta == datetime1``. As for addition, the result has the same :attr:`~.datetime.tzinfo` attribute as the input datetime, and no time zone adjustments are done even if the input is aware.
ru: Вычисляет ``datetime2`` так, что ``datetime2 + timedelta == datetime1``. Что касается сложения, результат имеет тот же атрибут :attr:`~.datetime.tzinfo`, что и входная дата-время, и никакие корректировки часового пояса не выполняются, даже если входные данные известны.

source: Subtraction of a :class:`.datetime` from a :class:`.datetime` is defined only if both operands are naive, or if both are aware. If one is aware and the other is naive, :exc:`TypeError` is raised.
ru: Вычитание :class:`.datetime` из :class:`.datetime` определяется только в том случае, если оба операнда являются наивными или если оба операнда известны. Если один знает, а другой наивен, возникает :exc:`TypeError`.

source: If both are naive, or both are aware and have the same :attr:`~.datetime.tzinfo` attribute, the :attr:`~.datetime.tzinfo` attributes are ignored, and the result is a :class:`timedelta` object ``t`` such that ``datetime2 + t == datetime1``. No time zone adjustments are done in this case.
ru: Если оба неактивны или оба осведомлены и имеют один и тот же атрибут :attr:`~.datetime.tzinfo`, атрибуты :attr:`~.datetime.tzinfo` игнорируются, и результатом является :class:`timedelta `объект ``t`` такой, что ``datetime2 + t == datetime1``. В этом случае корректировка часового пояса не производится.

source: If both are aware and have different :attr:`~.datetime.tzinfo` attributes, ``a-b`` acts as if ``a`` and ``b`` were first converted to naive UTC datetimes. The result is ``(a.replace(tzinfo=None) - a.utcoffset()) - (b.replace(tzinfo=None) - b.utcoffset())`` except that the implementation never overflows.
ru: Если оба знают и имеют разные атрибуты :attr:`~.datetime.tzinfo`, ``ab`` действует так, как если бы ``a`` и ``b`` были сначала преобразованы в наивное время в формате UTC. Результатом будет ``(a.replace(tzinfo=None) - a.utcoffset()) - (b.replace(tzinfo=None) - b.utcoffset())``, за исключением того, что реализация никогда не переполняется.

source: :class:`.datetime` objects are equal if they represent the same date and time, taking into account the time zone.
ru: Объекты :class:`.datetime` равны, если они представляют одну и ту же дату и время с учетом часового пояса.

source: Naive and aware :class:`!datetime` objects are never equal. :class:`!datetime` objects are never equal to :class:`date` objects that are not also :class:`!datetime` instances, even if they represent the same date.
ru: Наивные и осознанные объекты :class:`!datetime` никогда не бывают равными. Объекты :class:`!datetime` никогда не равны объектам :class:`date`, которые не являются также экземплярами :class:`!datetime`, даже если они представляют одну и ту же дату.

source: If both comparands are aware, and have the same :attr:`!tzinfo` attribute, the :attr:`!tzinfo` and :attr:`~.datetime.fold` attributes are ignored and the base datetimes are compared. If both comparands are aware and have different :attr:`~.datetime.tzinfo` attributes, the comparison acts as comparands were first converted to UTC datetimes except that the implementation never overflows. :class:`!datetime` instances in a repeated interval are never equal to :class:`!datetime` instances in other time zone.
ru: Если оба объекта сравнения известны и имеют один и тот же атрибут :attr:`!tzinfo`, атрибуты :attr:`!tzinfo` и :attr:`~.datetime.fold` игнорируются и сравниваются базовые даты и время. Если оба объекта сравнения известны и имеют разные атрибуты :attr:`~.datetime.tzinfo`, сравнение действует так, как если бы сравниваемые значения сначала были преобразованы в дату и время в формате UTC, за исключением того, что реализация никогда не переполняется. Экземпляры :class:`!datetime` в повторяющемся интервале никогда не равны экземплярам :class:`!datetime` в другом часовом поясе.

source: *datetime1* is considered less than *datetime2* when *datetime1* precedes *datetime2* in time, taking into account the time zone.
ru: *datetime1* считается меньшим, чем *datetime2*, если *datetime1* предшествует *datetime2* по времени с учетом часового пояса.

source: Order comparison between naive and aware :class:`.datetime` objects, as well as a :class:`!datetime` object and a :class:`!date` object that is not also a :class:`!datetime` instance, raises :exc:`TypeError`.
ru: Сравнение порядка между наивными и осведомленными объектами :class:`.datetime`, а также объектом :class:`!datetime` и объектом :class:`!date`, который не является также экземпляром :class:`!datetime` , вызывает :exc:`TypeError`.

source: If both comparands are aware, and have the same :attr:`!tzinfo` attribute, the :attr:`!tzinfo` and :attr:`~.datetime.fold` attributes are ignored and the base datetimes are compared. If both comparands are aware and have different :attr:`~.datetime.tzinfo` attributes, the comparison acts as comparands were first converted to UTC datetimes except that the implementation never overflows.
ru: Если оба объекта сравнения известны и имеют один и тот же атрибут :attr:`!tzinfo`, атрибуты :attr:`!tzinfo` и :attr:`~.datetime.fold` игнорируются и сравниваются базовые даты и время. Если оба объекта сравнения известны и имеют разные атрибуты :attr:`~.datetime.tzinfo`, сравнение действует так, как если бы сравниваемые значения сначала были преобразованы в дату и время в формате UTC, за исключением того, что реализация никогда не переполняется.

source: Equality comparisons between aware and naive :class:`.datetime` instances don't raise :exc:`TypeError`.
ru: Сравнения на равенство между осведомленными и наивными экземплярами :class:`.datetime` не вызывают :exc:`TypeError`.

source: Return :class:`date` object with same year, month and day.
ru: Верните объект :class:`date` с тем же годом, месяцем и днем.

source: Return :class:`.time` object with same hour, minute, second, microsecond and fold. :attr:`.tzinfo` is ``None``. See also method :meth:`timetz`.
ru: Возвращает объект :class:`.time` с тем же часом, минутой, секундой, микросекундой и кратностью. :attr:`.tzinfo` имеет значение ``Нет``. См. также метод :meth:`timetz`.

source: The fold value is copied to the returned :class:`.time` object.
ru: Значение сгиба копируется в возвращаемый объект :class:`.time`.

source: Return :class:`.time` object with same hour, minute, second, microsecond, fold, and tzinfo attributes. See also method :meth:`time`.
ru: Возвращает объект :class:`.time` с теми же атрибутами часов, минут, секунд, микросекунд, сгибов и tzinfo. См. также метод :meth:`time`.

source: Return a datetime with the same attributes, except for those attributes given new values by whichever keyword arguments are specified. Note that ``tzinfo=None`` can be specified to create a naive datetime from an aware datetime with no conversion of date and time data.
ru: Возвращает дату и время с теми же атрибутами, за исключением тех атрибутов, которым присвоены новые значения в зависимости от того, какие аргументы ключевого слова указаны. Обратите внимание, что можно указать ``tzinfo=None`` для создания простого значения даты и времени из известного значения даты и времени без преобразования данных даты и времени.

source: Return a :class:`.datetime` object with new :attr:`.tzinfo` attribute *tz*, adjusting the date and time data so the result is the same UTC time as *self*, but in *tz*'s local time.
ru: Возвращает объект :class:`.datetime` с новым атрибутом :attr:`.tzinfo` *tz*, корректируя данные даты и времени так, чтобы результатом было то же время UTC, что и *self*, но в *tz* местное время.

source: If provided, *tz* must be an instance of a :class:`tzinfo` subclass, and its :meth:`utcoffset` and :meth:`dst` methods must not return ``None``. If *self* is naive, it is presumed to represent time in the system time zone.
ru: Если указано, *tz* должен быть экземпляром подкласса :class:`tzinfo`, а его методы :meth:`utcoffset` и :meth:`dst` не должны возвращать ``None``. Если *self* является наивным, предполагается, что оно представляет время в часовом поясе системы.

source: If called without arguments (or with ``tz=None``) the system local time zone is assumed for the target time zone. The ``.tzinfo`` attribute of the converted datetime instance will be set to an instance of :class:`timezone` with the zone name and offset obtained from the OS.
ru: При вызове без аргументов (или с ``tz=None``) в качестве целевого часового пояса предполагается локальный часовой пояс системы. Атрибуту .tzinfo преобразованного экземпляра datetime будет присвоен экземпляр :class:`timezone` с именем зоны и смещением, полученным из ОС.

source: If ``self.tzinfo`` is *tz*, ``self.astimezone(tz)`` is equal to *self*: no adjustment of date or time data is performed. Else the result is local time in the time zone *tz*, representing the same UTC time as *self*: after ``astz = dt.astimezone(tz)``, ``astz - astz.utcoffset()`` will have the same date and time data as ``dt - dt.utcoffset()``.
ru: Если ``self.tzinfo`` имеет значение *tz*, ``self.astimezone(tz)`` равен *self*: корректировка данных даты и времени не выполняется. В противном случае результатом будет местное время в часовом поясе *tz*, представляющее то же время UTC, что и *self*: после ``astz = dt.astimezone(tz)``, ``astz - astz.utcoffset()`` будет имеют те же данные даты и времени, что и ``dt - dt.utcoffset()``.

source: If you merely want to attach a :class:`timezone` object *tz* to a datetime *dt* without adjustment of date and time data, use ``dt.replace(tzinfo=tz)``. If you merely want to remove the :class:`!timezone` object from an aware datetime *dt* without conversion of date and time data, use ``dt.replace(tzinfo=None)``.
ru: Если вы просто хотите прикрепить объект :class:`timezone` *tz* к дате и времени *dt* без корректировки данных даты и времени, используйте ``dt.replace(tzinfo=tz)``. Если вы просто хотите удалить объект :class:`!timezone` из поддерживаемого объекта datetime *dt* без преобразования данных даты и времени, используйте ``dt.replace(tzinfo=None)``.

source: Note that the default :meth:`tzinfo.fromutc` method can be overridden in a :class:`tzinfo` subclass to affect the result returned by :meth:`astimezone`. Ignoring error cases, :meth:`astimezone` acts like::
ru: Обратите внимание, что метод по умолчанию :meth:`tzinfo.fromutc` может быть переопределен в подклассе :class:`tzinfo`, чтобы повлиять на результат, возвращаемый :meth:`astimezone`. Игнорируя случаи ошибок, :meth:`astimezone` действует как::

source: *tz* now can be omitted.
ru: *tz* теперь можно опустить.

source: The :meth:`astimezone` method can now be called on naive instances that are presumed to represent system local time.
ru: Метод :meth:`astimezone` теперь можно вызывать в простых экземплярах, которые предположительно представляют местное время системы.

source: If :attr:`.tzinfo` is ``None``, returns ``None``, else returns ``self.tzinfo.utcoffset(self)``, and raises an exception if the latter doesn't return ``None`` or a :class:`timedelta` object with magnitude less than one day.
ru: Если :attr:`.tzinfo` имеет значение None, возвращает None, else возвращает self.tzinfo.utcoffset(self) и вызывает исключение, если последний не возвращает `` None или объект :class:`timedelta` с магнитудой менее одного дня.

source: The UTC offset is not restricted to a whole number of minutes.
ru: Смещение UTC не ограничивается целым числом минут.

source: If :attr:`.tzinfo` is ``None``, returns ``None``, else returns ``self.tzinfo.dst(self)``, and raises an exception if the latter doesn't return ``None`` or a :class:`timedelta` object with magnitude less than one day.
ru: Если :attr:`.tzinfo` имеет значение None, возвращает None, else возвращает self.tzinfo.dst(self) и вызывает исключение, если последний не возвращает `` None или объект :class:`timedelta` с магнитудой менее одного дня.

source: The DST offset is not restricted to a whole number of minutes.
ru: Смещение летнего времени не ограничивается целым числом минут.

source: If :attr:`.tzinfo` is ``None``, returns ``None``, else returns ``self.tzinfo.tzname(self)``, raises an exception if the latter doesn't return ``None`` or a string object,
ru: Если :attr:`.tzinfo` имеет значение ``None``, возвращает ``None``, else возвращает ``self.tzinfo.tzname(self)``, вызывает исключение, если последний не возвращает ``None `` или строковый объект,

source: where ``yday = d.toordinal() - date(d.year, 1, 1).toordinal() + 1`` is the day number within the current year starting with 1 for January 1st. The :attr:`~time.struct_time.tm_isdst` flag of the result is set according to the :meth:`dst` method: :attr:`.tzinfo` is ``None`` or :meth:`dst` returns ``None``, :attr:`!tm_isdst` is set to ``-1``; else if :meth:`dst` returns a non-zero value, :attr:`!tm_isdst` is set to 1; else :attr:`!tm_isdst` is set to 0.
ru: где ``yday = d.toordinal() - date(d.year, 1, 1).toordinal() + 1`` — это номер дня в текущем году, начиная с 1 для 1 января. Флаг :attr:`~time.struct_time.tm_isdst` результата устанавливается в соответствии с методом :meth:`dst`: :attr:`.tzinfo` имеет значение ``None`` или :meth:`dst` возвращает ``None``, :attr:`!tm_isdst` установлен в ``-1``; иначе, если :meth:`dst` возвращает ненулевое значение, :attr:`!tm_isdst` устанавливается в 1; else :attr:`!tm_isdst` имеет значение 0.

source: If :class:`.datetime` instance ``d`` is naive, this is the same as ``d.timetuple()`` except that :attr:`~.time.struct_time.tm_isdst` is forced to 0 regardless of what ``d.dst()`` returns. DST is never in effect for a UTC time.
ru: Если экземпляр :class:`.datetime` ``d`` является наивным, это то же самое, что ``d.timetuple()``, за исключением того, что :attr:`~.time.struct_time.tm_isdst` независимо от этого принудительно устанавливается в 0. того, что возвращает ``d.dst()``. Летнее время никогда не действует для времени UTC.

source: If ``d`` is aware, ``d`` is normalized to UTC time, by subtracting ``d.utcoffset()``, and a :class:`time.struct_time` for the normalized time is returned. :attr:`!tm_isdst` is forced to 0. Note that an :exc:`OverflowError` may be raised if ``d.year`` was ``MINYEAR`` or ``MAXYEAR`` and UTC adjustment spills over a year boundary.
ru: Если ``d`` знает, ``d`` нормализуется ко времени UTC путем вычитания ``d.utcoffset()`` и возвращается :class:`time.struct_time` для нормализованного времени. :attr:`!tm_isdst` принудительно устанавливается равным 0. Обратите внимание, что :exc:`OverflowError` может возникнуть, если ``d.year`` был ``MINYEAR`` или ``MAXYEAR`` и корректировка UTC распространяется на граница года.

source: Because naive ``datetime`` objects are treated by many ``datetime`` methods as local times, it is preferred to use aware datetimes to represent times in UTC; as a result, using :meth:`datetime.utctimetuple` may give misleading results. If you have a naive ``datetime`` representing UTC, use ``datetime.replace(tzinfo=timezone.utc)`` to make it aware, at which point you can use :meth:`.datetime.timetuple`.
ru: Поскольку наивные объекты datetime обрабатываются многими методами datetime как локальное время, для представления времени в формате UTC предпочтительнее использовать осведомленные объекты datetime; в результате использование :meth:`datetime.utctimetuple` может дать неверные результаты. Если у вас есть наивное ``datetime``, представляющее UTC, используйте ``datetime.replace(tzinfo=timezone.utc)``, чтобы сообщить об этом, и в этот момент вы можете использовать :meth:`.datetime.timetuple`.

source: Return the proleptic Gregorian ordinal of the date. The same as ``self.date().toordinal()``.
ru: Возвращает упреждающий григорианский порядковый номер даты. То же, что и ``self.date().toordinal()``.

source: Return POSIX timestamp corresponding to the :class:`.datetime` instance. The return value is a :class:`float` similar to that returned by :func:`time.time`.
ru: Возвращает временную метку POSIX, соответствующую экземпляру :class:`.datetime`. Возвращаемое значение — это :class:`float`, аналогичное возвращаемому :func:`time.time`.

source: Naive :class:`.datetime` instances are assumed to represent local time and this method relies on the platform C :c:func:`mktime` function to perform the conversion. Since :class:`.datetime` supports wider range of values than :c:func:`mktime` on many platforms, this method may raise :exc:`OverflowError` or :exc:`OSError` for times far in the past or far in the future.
ru: Предполагается, что наивные экземпляры :class:`.datetime` представляют местное время, и этот метод использует функцию платформы C :c:func:`mktime` для выполнения преобразования. Поскольку :class:`.datetime` поддерживает более широкий диапазон значений, чем :c:func:`mktime` на многих платформах, этот метод может вызывать :exc:`OverflowError` или :exc:`OSError` для моментов далекого прошлого или далеко в будущем.

source: For aware :class:`.datetime` instances, the return value is computed as::
ru: Для осведомленных экземпляров :class:`.datetime` возвращаемое значение вычисляется как::
