Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/datetime.po
Languages: ru

source: must return the same result for every :class:`.datetime` *dt* with ``dt.tzinfo == tz``. For sane :class:`tzinfo` subclasses, this expression yields the time zone's "standard offset", which should not depend on the date or the time, but only on geographic location. The implementation of :meth:`datetime.astimezone` relies on this, but cannot detect violations; it's the programmer's responsibility to ensure it. If a :class:`tzinfo` subclass cannot guarantee this, it may be able to override the default implementation of :meth:`tzinfo.fromutc` to work correctly with :meth:`~.datetime.astimezone` regardless.
ru: должен возвращать один и тот же результат для каждого :class:`.datetime` *dt* с ``dt.tzinfo == tz``. Для нормальных подклассов :class:`tzinfo` это выражение дает «стандартное смещение» часового пояса, которое не должно зависеть от даты или времени, а только от географического местоположения. Реализация :meth:`datetime.astimezone` полагается на это, но не может обнаружить нарушения; ответственность за это лежит на программисте. Если подкласс :class:`tzinfo` не может этого гарантировать, он может переопределить реализацию :meth:`tzinfo.fromutc` по умолчанию для корректной работы с :meth:`~.datetime.astimezone` независимо от этого.

source: Most implementations of :meth:`dst` will probably look like one of these two::
ru: Большинство реализаций :meth:`dst`, вероятно, будут выглядеть как одна из этих двух::

source: or::
ru: или::

source: The default implementation of :meth:`dst` raises :exc:`NotImplementedError`.
ru: Реализация :meth:`dst` по умолчанию вызывает :exc:`NotImplementedError`.

source: Return the time zone name corresponding to the :class:`.datetime` object *dt*, as a string. Nothing about string names is defined by the :mod:`!datetime` module, and there's no requirement that it mean anything in particular. For example, ``"GMT"``, ``"UTC"``, ``"-500"``, ``"-5:00"``, ``"EDT"``, ``"US/Eastern"``, ``"America/New York"`` are all valid replies. Return ``None`` if a string name isn't known. Note that this is a method rather than a fixed string primarily because some :class:`tzinfo` subclasses will wish to return different names depending on the specific value of *dt* passed, especially if the :class:`tzinfo` class is accounting for daylight time.
ru: Возвращает имя часового пояса, соответствующее объекту :class:`.datetime` *dt*, в виде строки. Модуль :mod:`!datetime` ничего не определяет в именах строк, и нет никаких требований, чтобы они значили что-то конкретное. Например, ``"GMT"``, ``"UTC"``, ``"-500"``, ``"-5:00"``, ``"EDT"``, ``" «США/Восточная Европа», «Америка/Нью-Йорк» — все это действительные ответы. Верните None, если имя строки неизвестно. Обратите внимание, что это метод, а не фиксированная строка, главным образом потому, что некоторые подклассы :class:`tzinfo` захотят возвращать разные имена в зависимости от конкретного переданного значения *dt*, особенно если класс :class:`tzinfo` является бухгалтерским. для дневного времени.

source: The default implementation of :meth:`tzname` raises :exc:`NotImplementedError`.
ru: Реализация :meth:`tzname` по умолчанию вызывает :exc:`NotImplementedError`.

source: These methods are called by a :class:`.datetime` or :class:`.time` object, in response to their methods of the same names. A :class:`.datetime` object passes itself as the argument, and a :class:`.time` object passes ``None`` as the argument. A :class:`tzinfo` subclass's methods should therefore be prepared to accept a *dt* argument of ``None``, or of class :class:`.datetime`.
ru: Эти методы вызываются объектом :class:`.datetime` или :class:`.time` в ответ на их одноименные методы. Объект :class:`.datetime` передает себя в качестве аргумента, а объект :class:`.time` передает в качестве аргумента ``None``. Поэтому методы подкласса :class:`tzinfo` должны быть готовы принять аргумент *dt* со значением ``None`` или класса :class:`.datetime`.

source: When ``None`` is passed, it's up to the class designer to decide the best response. For example, returning ``None`` is appropriate if the class wishes to say that time objects don't participate in the :class:`tzinfo` protocols. It may be more useful for ``utcoffset(None)`` to return the standard UTC offset, as there is no other convention for discovering the standard offset.
ru: Когда передается None, разработчик класса должен выбрать лучший ответ. Например, возврат None подходит, если класс желает сообщить, что объекты времени не участвуют в протоколах :class:`tzinfo`. Может быть более полезно, чтобы utcoffset(None) возвращал стандартное смещение UTC, поскольку не существует другого соглашения для обнаружения стандартного смещения.

source: When a :class:`.datetime` object is passed in response to a :class:`.datetime` method, ``dt.tzinfo`` is the same object as *self*. :class:`tzinfo` methods can rely on this, unless user code calls :class:`tzinfo` methods directly. The intent is that the :class:`tzinfo` methods interpret *dt* as being in local time, and not need worry about objects in other time zones.
ru: Когда объект :class:`.datetime` передается в ответ на метод :class:`.datetime`, ``dt.tzinfo`` является тем же объектом, что и *self*. На это могут полагаться методы :class:`tzinfo`, если пользовательский код не вызывает методы :class:`tzinfo` напрямую. Цель состоит в том, чтобы методы :class:`tzinfo` интерпретировали *dt* как местное время и не беспокоились об объектах в других часовых поясах.

source: There is one more :class:`tzinfo` method that a subclass may wish to override:
ru: Существует еще один метод :class:`tzinfo`, который подкласс может переопределить:

source: This is called from the default :meth:`datetime.astimezone` implementation. When called from that, ``dt.tzinfo`` is *self*, and *dt*'s date and time data are to be viewed as expressing a UTC time. The purpose of :meth:`fromutc` is to adjust the date and time data, returning an equivalent datetime in *self*'s local time.
ru: Это вызывается из реализации :meth:`datetime.astimezone` по умолчанию. При вызове из него ``dt.tzinfo`` является *self*, а данные даты и времени *dt* следует рассматривать как выражение времени UTC. Целью :meth:`fromutc` является корректировка данных даты и времени, возвращая эквивалентное значение даты и времени в локальном времени *self*.

source: Most :class:`tzinfo` subclasses should be able to inherit the default :meth:`fromutc` implementation without problems. It's strong enough to handle fixed-offset time zones, and time zones accounting for both standard and daylight time, and the latter even if the DST transition times differ in different years. An example of a time zone the default :meth:`fromutc` implementation may not handle correctly in all cases is one where the standard offset (from UTC) depends on the specific date and time passed, which can happen for political reasons. The default implementations of :meth:`~.datetime.astimezone` and :meth:`fromutc` may not produce the result you want if the result is one of the hours straddling the moment the standard offset changes.
ru: Большинство подклассов :class:`tzinfo` должны иметь возможность без проблем наследовать реализацию :meth:`fromutc` по умолчанию. Он достаточно силен, чтобы обрабатывать часовые пояса с фиксированным смещением, а также часовые пояса, учитывающие как стандартное, так и летнее время, причем последнее, даже если время перехода на летнее время различается в разные годы. Примером часового пояса, который реализация :meth:`fromutc` по умолчанию может обрабатывать неправильно во всех случаях, является тот, где стандартное смещение (от UTC) зависит от конкретной переданной даты и времени, что может произойти по политическим причинам. Реализации по умолчанию :meth:`~.datetime.astimezone` и :meth:`fromutc` могут не дать желаемого результата, если результат является одним из часов, находящихся между моментом изменения стандартного смещения.

source: Skipping code for error cases, the default :meth:`fromutc` implementation acts like::
ru: Пропуская код в случае ошибок, реализация :meth:`fromutc` по умолчанию действует следующим образом::

source: In the following :download:`tzinfo_examples.py <../includes/tzinfo_examples.py>` file there are some examples of :class:`tzinfo` classes:
ru: В следующем файле :download:`tzinfo_examples.py <../includes/tzinfo_examples.py>` приведены несколько примеров классов :class:`tzinfo`:

source: Note that there are unavoidable subtleties twice per year in a :class:`tzinfo` subclass accounting for both standard and daylight time, at the DST transition points. For concreteness, consider US Eastern (UTC -0500), where EDT begins the minute after 1:59 (EST) on the second Sunday in March, and ends the minute after 1:59 (EDT) on the first Sunday in November::
ru: Обратите внимание, что дважды в год в подклассе :class:`tzinfo` возникают неизбежные тонкости, учитывающие как стандартное, так и летнее время, в точках перехода на летнее время. Для конкретики рассмотрим восточную часть США (UTC -0500), где EDT начинается на минуте после 1:59 (EST) во второе воскресенье марта и заканчивается на минуте после 1:59 (EDT) в первое воскресенье ноября:

source: When DST starts (the "start" line), the local wall clock leaps from 1:59 to 3:00. A wall time of the form 2:MM doesn't really make sense on that day, so ``astimezone(Eastern)`` won't deliver a result with ``hour == 2`` on the day DST begins. For example, at the Spring forward transition of 2016, we get::
ru: Когда начинается летнее время (линия «старт»), местные настенные часы переходят с 1:59 на 3:00. Настенное время в форме 2:MM на самом деле не имеет смысла в этот день, поэтому astimezone(eastern)`` не выдаст результат с ``hour == 2`` в день начала летнего времени. Например, при переходе Spring вперед 2016 года мы получаем:

source: When DST ends (the "end" line), there's a potentially worse problem: there's an hour that can't be spelled unambiguously in local wall time: the last hour of daylight time. In Eastern, that's times of the form 5:MM UTC on the day daylight time ends. The local wall clock leaps from 1:59 (daylight time) back to 1:00 (standard time) again. Local times of the form 1:MM are ambiguous. :meth:`~.datetime.astimezone` mimics the local clock's behavior by mapping two adjacent UTC hours into the same local hour then. In the Eastern example, UTC times of the form 5:MM and 6:MM both map to 1:MM when converted to Eastern, but earlier times have the :attr:`~.datetime.fold` attribute set to 0 and the later times have it set to 1. For example, at the Fall back transition of 2016, we get::
ru: Когда заканчивается летнее время («конечная» строка), возникает потенциально более серьезная проблема: есть час, который нельзя однозначно записать в местном настенном времени: последний час дневного времени. На восточном языке это время в формате 5:MM UTC в день окончания летнего времени. Местные настенные часы снова переходят с 1:59 (дневное время) на 1:00 (стандартное время). Местное время в форме 1:MM неоднозначно. :meth:`~.datetime.astimezone` имитирует поведение локальных часов, сопоставляя два соседних часа UTC с одним и тем же местным часом. В восточном примере время UTC в форме 5:MM и 6:MM отображается в 1:MM при преобразовании в восточное время, но более раннее время имеет атрибут :attr:`~.datetime.fold`, установленный в 0, а более позднее время. раз оно установлено равным 1. Например, при переходе на возврат в 2016 году мы получаем:

source: Note that the :class:`.datetime` instances that differ only by the value of the :attr:`~.datetime.fold` attribute are considered equal in comparisons.
ru: Обратите внимание, что экземпляры :class:`.datetime`, которые отличаются только значением атрибута :attr:`~.datetime.fold`, считаются равными при сравнении.

source: Applications that can't bear wall-time ambiguities should explicitly check the value of the :attr:`~.datetime.fold` attribute or avoid using hybrid :class:`tzinfo` subclasses; there are no ambiguities when using :class:`timezone`, or any other fixed-offset :class:`tzinfo` subclass (such as a class representing only EST (fixed offset -5 hours), or only EDT (fixed offset -4 hours)).
ru: Приложения, которые не допускают неоднозначности времени стены, должны явно проверять значение атрибута :attr:`~.datetime.fold` или избегать использования гибридных подклассов :class:`tzinfo`; нет никакой двусмысленности при использовании :class:`timezone` или любого другого подкласса :class:`tzinfo` с фиксированным смещением (например, класса, представляющего только EST (фиксированное смещение -5 часов) или только EDT (фиксированное смещение -4) часы)).

source: The :mod:`!datetime` module has a basic :class:`timezone` class (for handling arbitrary fixed offsets from UTC) and its :attr:`timezone.utc` attribute (a UTC :class:`!timezone` instance).
ru: Модуль :mod:`!datetime` имеет базовый класс :class:`timezone` (для обработки произвольных фиксированных смещений от UTC) и его атрибут :attr:`timezone.utc` (экземпляр UTC :class:`!timezone` ).

source: ``zoneinfo`` brings the *IANA time zone database* (also known as the Olson database) to Python, and its usage is recommended.
ru: ``zoneinfo`` переносит *базу данных часовых поясов IANA* (также известную как база данных Олсона) на Python, и ее использование рекомендуется.

source: `IANA time zone database <https://www.iana.org/time-zones>`_
ru: `База данных часовых поясов IANA <https://www.iana.org/time-zones>`_

source: The Time Zone Database (often called tz, tzdata or zoneinfo) contains code and data that represent the history of local time for many representative locations around the globe. It is updated periodically to reflect changes made by political bodies to time zone boundaries, UTC offsets, and daylight-saving rules.
ru: База данных часовых поясов (часто называемая tz, tzdata илиzoneinfo) содержит код и данные, которые представляют историю местного времени для многих репрезентативных мест по всему миру. Он периодически обновляется, чтобы отражать изменения, внесенные политическими органами в границы часовых поясов, смещения UTC и правила перехода на летнее время.

source: :class:`timezone` Objects
ru: Объекты :class:`timezone`

source: The :class:`timezone` class is a subclass of :class:`tzinfo`, each instance of which represents a time zone defined by a fixed offset from UTC.
ru: Класс :class:`timezone` является подклассом :class:`tzinfo`, каждый экземпляр которого представляет часовой пояс, определенный фиксированным смещением от UTC.

source: Objects of this class cannot be used to represent time zone information in the locations where different offsets are used in different days of the year or where historical changes have been made to civil time.
ru: Объекты этого класса нельзя использовать для представления информации о часовом поясе в местах, где в разные дни года используются разные смещения или где в гражданское время были внесены исторические изменения.

source: The *offset* argument must be specified as a :class:`timedelta` object representing the difference between the local time and UTC. It must be strictly between ``-timedelta(hours=24)`` and ``timedelta(hours=24)``, otherwise :exc:`ValueError` is raised.
ru: Аргумент *offset* должен быть указан как объект :class:`timedelta`, представляющий разницу между местным временем и временем UTC. Оно должно находиться строго между ``-timedelta(hours=24)`` и ``timedelta(hours=24)``, в противном случае выдается :exc:`ValueError`.

source: The *name* argument is optional. If specified it must be a string that will be used as the value returned by the :meth:`datetime.tzname` method.
ru: Аргумент *имя* является необязательным. Если указано, это должна быть строка, которая будет использоваться в качестве значения, возвращаемого методом :meth:`datetime.tzname`.

source: Return the fixed value specified when the :class:`timezone` instance is constructed.
ru: Возвращает фиксированное значение, указанное при создании экземпляра :class:`timezone`.

source: The *dt* argument is ignored. The return value is a :class:`timedelta` instance equal to the difference between the local time and UTC.
ru: Аргумент *dt* игнорируется. Возвращаемое значение — это экземпляр :class:`timedelta`, равный разнице между местным временем и временем UTC.

source: If *name* is not provided in the constructor, the name returned by ``tzname(dt)`` is generated from the value of the ``offset`` as follows. If *offset* is ``timedelta(0)``, the name is "UTC", otherwise it is a string in the format ``UTC±HH:MM``, where ± is the sign of ``offset``, HH and MM are two digits of ``offset.hours`` and ``offset.minutes`` respectively.
ru: Если *name* не указано в конструкторе, имя, возвращаемое ``tzname(dt)``, генерируется из значения ``offset`` следующим образом. Если *offset* равно ``timedelta(0)``, то имя — "UTC", в противном случае это строка в формате ``UTC±HH:MM``, где ± — знак ``offset`` , ЧЧ и ММ — это две цифры «смещение.часы» и «смещение.минуты» соответственно.

source: Name generated from ``offset=timedelta(0)`` is now plain ``'UTC'``, not ``'UTC+00:00'``.
ru: Имя, сгенерированное из ``offset=timedelta(0)``, теперь имеет вид ``'UTC'``, а не ``'UTC+00:00'``.

source: Always returns ``None``.
ru: Всегда возвращает ``None``.

source: Return ``dt + offset``. The *dt* argument must be an aware :class:`.datetime` instance, with ``tzinfo`` set to ``self``.
ru: Верните ``dt + смещение``. Аргумент *dt* должен быть осведомленным экземпляром :class:`.datetime` с параметром ``tzinfo``, установленным в ``self``.

source: The UTC time zone, ``timezone(timedelta(0))``.
ru: Часовой пояс UTC, ``timezone(timedelta(0))``.

source: :meth:`~.datetime.strftime` and :meth:`~.datetime.strptime` Behavior
ru: Поведение :meth:`~.datetime.strftime` и :meth:`~.datetime.strptime`

source: :class:`date`, :class:`.datetime`, and :class:`.time` objects all support a ``strftime(format)`` method, to create a string representing the time under the control of an explicit format string.
ru: Объекты :class:`date`, :class:`.datetime` и :class:`.time` поддерживают метод ``strftime(format)`` для создания строки, представляющей время под контролем явного строка формата.

source: Conversely, the :meth:`datetime.strptime` class method creates a :class:`.datetime` object from a string representing a date and time and a corresponding format string.
ru: И наоборот, метод класса :meth:`datetime.strptime` создает объект :class:`.datetime` из строки, представляющей дату и время, и соответствующей строки формата.

source: The table below provides a high-level comparison of :meth:`~.datetime.strftime` versus :meth:`~.datetime.strptime`:
ru: В таблице ниже представлено общее сравнение :meth:`~.datetime.strftime` и :meth:`~.datetime.strptime`:

source: Usage
ru: Использование

source: Convert object to a string according to a given format
ru: Преобразовать объект в строку в соответствии с заданным форматированием

source: Parse a string into a :class:`.datetime` object given a corresponding format
ru: Разобрать строку в объект :class:`.datetime` с учетом соответствующего формата.

source: Type of method
ru: Тип метода

source: Instance method
ru: Метод экземпляра

source: Class method
ru: Метод класса

source: Method of
ru: Метод

source: Signature
ru: Подпись

source: :meth:`~.datetime.strftime` and :meth:`~.datetime.strptime` Format Codes
ru: Коды форматов :meth:`~.datetime.strftime` и :meth:`~.datetime.strptime`

source: These methods accept format codes that can be used to parse and format dates::
ru: Эти методы принимают коды формата, которые можно использовать для анализа и форматирования дат:

source: The following is a list of all the format codes that the 1989 C standard requires, and these work on all platforms with a standard C implementation.
ru: Ниже приведен список всех кодов формата, которые требуются в стандарте C 1989 года, и они работают на всех платформах со стандартной реализацией C.

source: Directive
ru: Директива

source: Meaning
ru: Значение

source: Example
ru: Пример

source: Notes
ru: Примечания

source: Weekday as locale's abbreviated name.
ru: День недели - сокращенное название региона.

source: Weekday as locale's full name.
ru: День недели в виде полного названия в регионе.

source: Weekday as a decimal number, where 0 is Sunday and 6 is Saturday.
ru: День недели как десятичное число, где 0 - воскресенье, а 6 - суббота.

source: Day of the month as a zero-padded decimal number.
ru: День месяца в виде десятичного числа, дополненного нулем.

source: Month as locale's abbreviated name.
ru: Месяц в виде сокращенного названия в регионе.

source: Month as locale's full name.
ru: Месяц в виде полного названия в регионе.

source: Month as a zero-padded decimal number.
ru: Месяц в виде десятичного числа, дополненного нулем.

source: Year without century as a zero-padded decimal number.
ru: Год без столетия в виде десятичного числа, дополненного нулем.

source: Year with century as a decimal number.
ru: Год с добавленным веком в качестве десятичного числа.

source: Hour (24-hour clock) as a zero-padded decimal number.
ru: Час (24 часа) в виде десятичного числа, дополненного нулем.

source: Hour (12-hour clock) as a zero-padded decimal number.
ru: Час (12-часовой вид) в виде десятичного числа, дополненного нулем.

source: Locale's equivalent of either AM or PM.
ru: Региональный эквивалент AM или PM.

source: Minute as a zero-padded decimal number.
ru: Минута в виде десятичного числа, дополненного нулем.

source: Second as a zero-padded decimal number.
ru: Секунда в виде десятичного числа, дополненного нулем.

source: Microsecond as a decimal number, zero-padded to 6 digits.
ru: Микросекунда в виде десятичного числа, дополненного нулем.

source: UTC offset in the form ``±HHMM[SS[.ffffff]]`` (empty string if the object is naive).
ru: Смещение по UTC в виде `±HHMM[SS[.ffffff]]` (пустая строка, если объект без часового пояса).

source: Time zone name (empty string if the object is naive).
ru: Название часового пояса (пустая строка, если объект без часового пояса).

source: Day of the year as a zero-padded decimal number.
ru: День года в виде десятичного числа, дополненного нулем.

source: Week number of the year (Sunday as the first day of the week) as a zero-padded decimal number. All days in a new year preceding the first Sunday are considered to be in week 0.
ru: Номер недели в году (воскресенье - первый день недели) в виде десятичного числа, дополненного нулем. Все дни в новом году, предшествующие первому воскресенью, считаются днями недели 0.

source: Week number of the year (Monday as the first day of the week) as a zero-padded decimal number. All days in a new year preceding the first Monday are considered to be in week 0.
ru: Номер недели в году (понедельник - первый день недели) в виде десятичного числа, дополненного нулем. Все дни в новом году, предшествующие первому понедельнику, считаются днями недели 0.

source: Locale's appropriate date and time representation.
ru: Соответствующее региональному стандарту представление даты и времени.

source: Locale's appropriate date representation.
ru: Соответствующее региональному стандарту представление даты.

source: Locale's appropriate time representation.
ru: Представление времени, соответствующее региону.

source: A literal ``'%'`` character.
ru: Буквальный символ ``%``.

source: Several additional directives not required by the C89 standard are included for convenience. These parameters all correspond to ISO 8601 date values.
ru: Для удобства включены несколько дополнительных указаний, не требуемых стандартом C89. Все эти параметры соответствуют значениям даты по стандарту ISO 8601.
