Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/datetime.po
Languages: ru

source: ISO 8601 year with century representing the year that contains the greater part of the ISO week (``%V``).
ru: Год по стандарту ISO 8601, где столетие соответствует году, который содержит большую часть недели ISO (``%V``).

source: ISO 8601 weekday as a decimal number where 1 is Monday.
ru: День недели в формате ISO 8601 в виде десятичного числа, где 1 — понедельник.

source: ISO 8601 week as a decimal number with Monday as the first day of the week. Week 01 is the week containing Jan 4.
ru: В таблице ниже представлено общее сравнение :meth:`~.datetime.strftime` и :meth:`~.datetime.strptime`:

source: UTC offset in the form ``±HH:MM[:SS[.ffffff]]`` (empty string if the object is naive).
ru: Смещение UTC в форме ``±HH:MM[:SS[.ffffff]]`` (пустая строка, если объект является наивным).

source: These may not be available on all platforms when used with the :meth:`~.datetime.strftime` method. The ISO 8601 year and ISO 8601 week directives are not interchangeable with the year and week number directives above. Calling :meth:`~.datetime.strptime` with incomplete or ambiguous ISO 8601 directives will raise a :exc:`ValueError`.
ru: Они могут быть доступны не на всех платформах при использовании с методом :meth:`~.datetime.strftime`. Директивы ISO 8601 года и ISO 8601 недели не являются взаимозаменяемыми с приведенными выше директивами года и номера недели. Вызов :meth:`~.datetime.strptime` с неполными или неоднозначными директивами ISO 8601 вызовет ошибку :exc:`ValueError`.

source: The full set of format codes supported varies across platforms, because Python calls the platform C library's :c:func:`strftime` function, and platform variations are common. To see the full set of format codes supported on your platform, consult the :manpage:`strftime(3)` documentation. There are also differences between platforms in handling of unsupported format specifiers.
ru: Полный набор поддерживаемых кодов форматов варьируется в зависимости от платформы, поскольку Python вызывает функцию :c:func:`strftime` библиотеки C платформы, и вариации платформ являются общими. Чтобы просмотреть полный набор кодов форматов, поддерживаемых вашей платформой, обратитесь к документации :manpage:`strftime(3)`. Между платформами также существуют различия в обработке спецификаторов неподдерживаемого формата.

source: ``%G``, ``%u`` and ``%V`` were added.
ru: `` %G ``, `` %в `` и ``%V`` были добавлены.

source: ``%:z`` was added.
ru: ``%:z`` был добавлен.

source: Technical Detail
ru: Техническая деталь

source: Broadly speaking, ``d.strftime(fmt)`` acts like the :mod:`time` module's ``time.strftime(fmt, d.timetuple())`` although not all objects support a :meth:`~date.timetuple` method.
ru: В общих чертах, ``d.strftime(fmt)`` действует как ``time.strftime(fmt, d.timetuple())`` модуля :mod:`time`, хотя не все объекты поддерживают :meth:`~ метод date.timetuple`.

source: For the :meth:`.datetime.strptime` class method, the default value is ``1900-01-01T00:00:00.000``: any components not specified in the format string will be pulled from the default value. [#]_
ru: Для метода класса :meth:`.datetime.strptime` значение по умолчанию — ``1900-01-01T00:00:00.000``: любые компоненты, не указанные в строке формата, будут извлечены из значения по умолчанию. [#]_

source: Using ``datetime.strptime(date_string, format)`` is equivalent to::
ru: Использование ``datetime.strptime(date_string, format)`` эквивалентно::

source: except when the format includes sub-second components or time zone offset information, which are supported in ``datetime.strptime`` but are discarded by ``time.strptime``.
ru: за исключением случаев, когда формат включает компоненты с точностью до секунды или информацию о смещении часового пояса, которые поддерживаются в datetime.strptime, но отбрасываются в time.strptime.

source: For :class:`.time` objects, the format codes for year, month, and day should not be used, as :class:`!time` objects have no such values. If they're used anyway, 1900 is substituted for the year, and 1 for the month and day.
ru: Для объектов :class:`.time` не следует использовать коды формата года, месяца и дня, поскольку объекты :class:`!time` не имеют таких значений. Если они все равно используются, 1900 заменяется на год, а 1 на месяц и день.

source: For :class:`date` objects, the format codes for hours, minutes, seconds, and microseconds should not be used, as :class:`date` objects have no such values. If they're used anyway, 0 is substituted for them.
ru: Для объектов :class:`date` не следует использовать коды формата часов, минут, секунд и микросекунд, поскольку объекты :class:`date` не имеют таких значений. Если они все равно используются, вместо них заменяется 0.

source: For the same reason, handling of format strings containing Unicode code points that can't be represented in the charset of the current locale is also platform-dependent. On some platforms such code points are preserved intact in the output, while on others ``strftime`` may raise :exc:`UnicodeError` or return an empty string instead.
ru: По той же причине обработка строк формата, содержащих кодовые точки Unicode, которые не могут быть представлены в кодировке текущей локали, также зависит от платформы. На некоторых платформах такие точки кода сохраняются в выходных данных без изменений, в то время как на других ``strftime`` может вызывать :exc:`UnicodeError` или вместо этого возвращать пустую строку.

source: Because the format depends on the current locale, care should be taken when making assumptions about the output value. Field orderings will vary (for example, "month/day/year" versus "day/month/year"), and the output may contain non-ASCII characters.
ru: Поскольку формат зависит от текущей локали, следует проявлять осторожность при предположениях относительно выходного значения. Порядок полей может различаться (например, «месяц/день/год» и «день/месяц/год»), а выходные данные могут содержать символы, отличные от ASCII.

source: The :meth:`~.datetime.strptime` method can parse years in the full [1, 9999] range, but years < 1000 must be zero-filled to 4-digit width.
ru: Метод :meth:`~.datetime.strptime` может анализировать годы в полном диапазоне [1, 9999], но годы < 1000 должны быть заполнены нулями до 4-значной ширины.

source: In previous versions, :meth:`~.datetime.strftime` method was restricted to years >= 1900.
ru: В предыдущих версиях метод :meth:`~.datetime.strftime` был ограничен годами >= 1900.

source: In version 3.2, :meth:`~.datetime.strftime` method was restricted to years >= 1000.
ru: В версии 3.2 метод :meth:`~.datetime.strftime` был ограничен годами >= 1000.

source: When used with the :meth:`~.datetime.strptime` method, the ``%p`` directive only affects the output hour field if the ``%I`` directive is used to parse the hour.
ru: При использовании с методом :meth:`~.datetime.strptime`, `` %p Директива `` влияет на поле выходного часа только в том случае, если директива ``%I`` используется для анализа часа.

source: Unlike the :mod:`time` module, the :mod:`!datetime` module does not support leap seconds.
ru: В отличие от модуля :mod:`time`, модуль :mod:`!datetime` не поддерживает дополнительные секунды.

source: When used with the :meth:`~.datetime.strptime` method, the ``%f`` directive accepts from one to six digits and zero pads on the right. ``%f`` is an extension to the set of format characters in the C standard (but implemented separately in datetime objects, and therefore always available).
ru: При использовании с методом :meth:`~.datetime.strptime`, `` %f `` Директива принимает от одной до шести цифр и нули справа. `` %f `` является расширением набора символов формата в стандарте C (но реализовано отдельно в объектах datetime и, следовательно, всегда доступно).

source: For a naive object, the ``%z``, ``%:z`` and ``%Z`` format codes are replaced by empty strings.
ru: Для наивного объекта коды формата ``%z``, ``%:z`` и ``%Z`` заменяются пустыми строками.

source: For an aware object:
ru: Для осведомленного объекта:

source: :meth:`~.datetime.utcoffset` is transformed into a string of the form ``±HHMM[SS[.ffffff]]``, where ``HH`` is a 2-digit string giving the number of UTC offset hours, ``MM`` is a 2-digit string giving the number of UTC offset minutes, ``SS`` is a 2-digit string giving the number of UTC offset seconds and ``ffffff`` is a 6-digit string giving the number of UTC offset microseconds. The ``ffffff`` part is omitted when the offset is a whole number of seconds and both the ``ffffff`` and the ``SS`` part is omitted when the offset is a whole number of minutes. For example, if :meth:`~.datetime.utcoffset` returns ``timedelta(hours=-3, minutes=-30)``, ``%z`` is replaced with the string ``'-0330'``.
ru: :meth:`~.datetime.utcoffset` преобразуется в строку вида ``±HHMM[SS[.ffffff]]``, где ``HH`` — это двухзначная строка, указывающая номер смещения UTC. часы, ``MM`` — это двухзначная строка, указывающая количество минут смещения UTC, ``SS`` — это двухзначная строка, указывающая количество секунд смещения UTC, а ``ffffff`` представляет собой шестизначное число. строка, указывающая количество микросекунд смещения UTC. Часть ``ffffff`` опускается, если смещение составляет целое число секунд, а часть ``ffffff`` и ``SS`` опускается, когда смещение составляет целое число минут. Например, если :meth:`~.datetime.utcoffset` возвращает ``timedelta(часы=-3, минуты=-30)``, ``%z`` заменяется строкой ``'-0330'` `.

source: When the ``%z`` directive is provided to the :meth:`~.datetime.strptime` method, the UTC offsets can have a colon as a separator between hours, minutes and seconds. For example, ``'+01:00:00'`` will be parsed as an offset of one hour. In addition, providing ``'Z'`` is identical to ``'+00:00'``.
ru: Когда директива %z предоставляется методу :meth:`~.datetime.strptime`, смещения UTC могут иметь двоеточие в качестве разделителя между часами, минутами и секундами. Например, ``'+01:00:00'`` будет анализироваться как смещение в один час. Кроме того, предоставление ``'Z'`` идентично ``'+00:00'``.

source: Behaves exactly as ``%z``, but has a colon separator added between hours, minutes and seconds.
ru: Ведёт себя точно так же, как %z, но между часами, минутами и секундами добавляется двоеточие.

source: In :meth:`~.datetime.strftime`, ``%Z`` is replaced by an empty string if :meth:`~.datetime.tzname` returns ``None``; otherwise ``%Z`` is replaced by the returned value, which must be a string.
ru: В :meth:`~.datetime.strftime` ``%Z`` заменяется пустой строкой, если :meth:`~.datetime.tzname` возвращает ``None``; в противном случае ``%Z`` заменяется возвращаемым значением, которое должно быть строкой.

source: :meth:`~.datetime.strptime` only accepts certain values for ``%Z``:
ru: :meth:`~.datetime.strptime` принимает только определенные значения для ``%Z``:

source: any value in ``time.tzname`` for your machine's locale
ru: любое значение в ``time.tzname`` для локали вашего компьютера

source: the hard-coded values ``UTC`` and ``GMT``
ru: жестко закодированные значения ``UTC`` и ``GMT``

source: So someone living in Japan may have ``JST``, ``UTC``, and ``GMT`` as valid values, but probably not ``EST``. It will raise ``ValueError`` for invalid values.
ru: Таким образом, кто-то, живущий в Японии, может иметь действительные значения ``JST``, ``UTC`` и ``GMT``, но, вероятно, не ``EST``. Это вызовет ``ValueError`` для недопустимых значений.

source: When the ``%z`` directive is provided to the :meth:`~.datetime.strptime` method, an aware :class:`.datetime` object will be produced. The ``tzinfo`` of the result will be set to a :class:`timezone` instance.
ru: Когда директива %z предоставляется методу :meth:`~.datetime.strptime`, будет создан соответствующий объект :class:`.datetime`. ``tzinfo`` результата будет установлен в экземпляр :class:`timezone`.

source: When used with the :meth:`~.datetime.strptime` method, ``%U`` and ``%W`` are only used in calculations when the day of the week and the calendar year (``%Y``) are specified.
ru: При использовании с методом :meth:`~.datetime.strptime`, ``%U`` и ``%W`` используются в вычислениях только тогда, когда день недели и календарный год (``%Y` `) указаны.

source: Similar to ``%U`` and ``%W``, ``%V`` is only used in calculations when the day of the week and the ISO year (``%G``) are specified in a :meth:`~.datetime.strptime` format string. Also note that ``%G`` and ``%Y`` are not interchangeable.
ru: Подобно ``%U`` и ``%W``, ``%V`` используется в вычислениях только тогда, когда день недели и год ISO (`` %G ``) указаны в строке формата :meth:`~.datetime.strptime`. Также обратите внимание, что `` %G `` и ``%Y`` не являются взаимозаменяемыми.

source: When used with the :meth:`~.datetime.strptime` method, the leading zero is optional for formats ``%d``, ``%m``, ``%H``, ``%I``, ``%M``, ``%S``, ``%j``, ``%U``, ``%W``, and ``%V``. Format ``%y`` does require a leading zero.
ru: При использовании с методом :meth:`~.datetime.strptime` ведущий ноль необязателен для форматов `` %д ``, ``%m``, ``%H``, ``%I``, ``%M``, ``%S``, ``%j``, ``%U` `, ``%W`` и ``%V``. Формат ``%y`` требует ведущего нуля.

source: Footnotes
ru: Сноски

source: If, that is, we ignore the effects of Relativity
ru: Если, то есть, мы игнорируем эффекты теории относительности

source: This matches the definition of the "proleptic Gregorian" calendar in Dershowitz and Reingold's book *Calendrical Calculations*, where it's the base calendar for all computations. See the book for algorithms for converting between proleptic Gregorian ordinals and many other calendar systems.
ru: Это соответствует определению «превентивного григорианского» календаря в книге Дершовица и Рейнгольда *Календарные вычисления*, где он является базовым календарем для всех вычислений. См. книгу об алгоритмах преобразования пролептических григорианских порядковых номеров во многие другие календарные системы.

source: See R. H. van Gent's `guide to the mathematics of the ISO 8601 calendar <https://web.archive.org/web/20220531051136/https://webspace.science.uu.nl/~gent0113/calendar/isocalendar.htm>`_ for a good explanation.
ru: См. «Руководство по математике календаря ISO 8601» Р.Х. ван Гента <https://web.archive.org/web/20220531051136/https://webspace.science.uu.nl/~gent0113/calendar/isocalendar.htm> `_ за хорошее объяснение.

source: Passing ``datetime.strptime('Feb 29', '%b %d')`` will fail since 1900 is not a leap year.
ru: Передача ``datetime.strptime('29 февраля', '%b %д ')`` не удастся, поскольку 1900 год не високосный.

source: % (percent)
ru: % (процент)

source: datetime format
ru: формат даты и времени
