Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/datetime.po
Languages: ru

source: The :meth:`timestamp` method uses the :attr:`.fold` attribute to disambiguate the times during a repeated interval.
ru: Метод :meth:`timestamp` использует атрибут :attr:`.fold` для устранения неоднозначности времени в течение повторяющегося интервала.

source: There is no method to obtain the POSIX timestamp directly from a naive :class:`.datetime` instance representing UTC time. If your application uses this convention and your system time zone is not set to UTC, you can obtain the POSIX timestamp by supplying ``tzinfo=timezone.utc``::
ru: Не существует способа получить временную метку POSIX непосредственно из простого экземпляра :class:`.datetime`, представляющего время UTC. Если ваше приложение использует это соглашение и часовой пояс вашей системы не установлен в формате UTC, вы можете получить временную метку POSIX, указав ``tzinfo=timezone.utc``::

source: or by calculating the timestamp directly::
ru: или путем непосредственного вычисления временной метки::

source: Return the day of the week as an integer, where Monday is 0 and Sunday is 6. The same as ``self.date().weekday()``. See also :meth:`isoweekday`.
ru: Возвращает день недели как целое число, где понедельник — 0, а воскресенье — 6. То же самое, что ``self.date().weekday()``. См. также :meth:`isoweekday`.

source: Return the day of the week as an integer, where Monday is 1 and Sunday is 7. The same as ``self.date().isoweekday()``. See also :meth:`weekday`, :meth:`isocalendar`.
ru: Возвращает день недели как целое число, где понедельник — 1, а воскресенье — 7. То же, что и ``self.date().isoweekday()``. См. также :meth:`weekday`, :meth:`isocalendar`.

source: Return a :term:`named tuple` with three components: ``year``, ``week`` and ``weekday``. The same as ``self.date().isocalendar()``.
ru: Возвращает именованный кортеж с тремя компонентами: «год», «неделя» и «день недели». То же, что ``self.date().isocalendar()``.

source: Return a string representing the date and time in ISO 8601 format:
ru: Верните строку, представляющую дату и время в формате ISO 8601:

source: ``YYYY-MM-DDTHH:MM:SS.ffffff``, if :attr:`microsecond` is not 0
ru: ``ГГГГ-ММ-ДДТЧЧ:ММ:СС.ffffff``, если :attr:`микросекунда` не равно 0

source: ``YYYY-MM-DDTHH:MM:SS``, if :attr:`microsecond` is 0
ru: ``ГГГГ-ММ-ДДТЧЧ:ММ:СС``, если :attr:`микросекунда` равна 0

source: If :meth:`utcoffset` does not return ``None``, a string is appended, giving the UTC offset:
ru: Если :meth:`utcoffset` не возвращает ``None``, добавляется строка, дающая смещение UTC:

source: ``YYYY-MM-DDTHH:MM:SS.ffffff+HH:MM[:SS[.ffffff]]``, if :attr:`microsecond` is not 0
ru: ``ГГГГ-ММ-ДДТЧЧ:ММ:СС.ffffff+ЧЧ:ММ[:СС[.ffffff]]``, если :attr:`микросекунда` не равно 0

source: ``YYYY-MM-DDTHH:MM:SS+HH:MM[:SS[.ffffff]]``, if :attr:`microsecond` is 0
ru: ``ГГГГ-ММ-ДДТЧЧ:ММ:СС+ЧЧ:ММ[:СС[.ffffff]]``, если :attr:`микросекунда` равна 0

source: The optional argument *sep* (default ``'T'``) is a one-character separator, placed between the date and time portions of the result. For example::
ru: Необязательный аргумент *sep* (по умолчанию ``'T'``) представляет собой односимвольный разделитель, помещаемый между частями даты и времени результата. Например::

source: The optional argument *timespec* specifies the number of additional components of the time to include (the default is ``'auto'``). It can be one of the following:
ru: Необязательный аргумент *timespec* указывает количество дополнительных компонентов времени, которые необходимо включить (по умолчанию — ``'auto'``). Это может быть одно из следующих:

source: ``'auto'``: Same as ``'seconds'`` if :attr:`microsecond` is 0, same as ``'microseconds'`` otherwise.
ru: ``'auto'``: То же, что ``'секунды'``, если :attr:`microсекунды` равно 0, то же самое, что и ``'микросекунды'`` в противном случае.

source: ``'hours'``: Include the :attr:`hour` in the two-digit ``HH`` format.
ru: ``'hours'``: включите :attr:`hour` в двузначном формате ``ЧЧ``.

source: ``'minutes'``: Include :attr:`hour` and :attr:`minute` in ``HH:MM`` format.
ru: ``'minutes'``: включите :attr:`hour` и :attr:`hour` в формате ``ЧЧ:ММ``.

source: ``'seconds'``: Include :attr:`hour`, :attr:`minute`, and :attr:`second` in ``HH:MM:SS`` format.
ru: ``'seconds'``: включите :attr:`hour`, :attr:`minute` и :attr:`second` в формате ``ЧЧ:ММ:СС``.

source: ``'milliseconds'``: Include full time, but truncate fractional second part to milliseconds. ``HH:MM:SS.sss`` format.
ru: ``'milliseconds'``: Включить полное время, но усечь дробную часть секунды до миллисекунд. ``HH:MM:SS.sss`` .

source: ``'microseconds'``: Include full time in ``HH:MM:SS.ffffff`` format.
ru: ``'microseconds'``: Включите полный рабочий день в ``HH:MM:SS.ffffff`` форматировать .

source: Excluded time components are truncated, not rounded.
ru: Исключенные компоненты времени усекаются, а не округляются.

source: :exc:`ValueError` will be raised on an invalid *timespec* argument::
ru: :exc:`ValueError` будет вызван недопустимым аргументом *timespec*::

source: Added the *timespec* parameter.
ru: Добавлен параметр *timespec*.

source: For a :class:`.datetime` instance ``d``, ``str(d)`` is equivalent to ``d.isoformat(' ')``.
ru: Для экземпляра :class:`.datetime` ``d`` ``str(d)`` эквивалентен ``d.isoformat(' ')``.

source: Return a string representing the date and time::
ru: Возвращает строку, представляющую дату и время::

source: The output string will *not* include time zone information, regardless of whether the input is aware or naive.
ru: Выходная строка *не* будет включать информацию о часовом поясе, независимо от того, являются ли входные данные осознанными или наивными.

source: on platforms where the native C :c:func:`ctime` function (which :func:`time.ctime` invokes, but which :meth:`datetime.ctime` does not invoke) conforms to the C standard.
ru: на платформах, где встроенная функция C :c:func:`ctime` (которая вызывается :func:`time.ctime`, но не вызывается :meth:`datetime.ctime`) соответствует стандарту C.

source: Return a string representing the date and time, controlled by an explicit format string. See also :ref:`strftime-strptime-behavior` and :meth:`datetime.isoformat`.
ru: Возвращает строку, представляющую дату и время, управляемую строкой явного формата. См. также :ref:`strftime-strptime-behavior` и :meth:`datetime.isoformat`.

source: Same as :meth:`.datetime.strftime`. This makes it possible to specify a format string for a :class:`.datetime` object in :ref:`formatted string literals <f-strings>` and when using :meth:`str.format`. See also :ref:`strftime-strptime-behavior` and :meth:`datetime.isoformat`.
ru: То же, что и :meth:`.datetime.strftime`. Это позволяет указать строку формата для объекта :class:`.datetime` в :ref:`форматированных строковых литералах <f-strings>` и при использовании :meth:`str.format`. См. также :ref:`strftime-strptime-behavior` и :meth:`datetime.isoformat`.

source: Examples of Usage: :class:`.datetime`
ru: Примеры использования: :class:`.datetime`

source: Examples of working with :class:`.datetime` objects:
ru: Примеры работы с объектами :class:`.datetime`:

source: The example below defines a :class:`tzinfo` subclass capturing time zone information for Kabul, Afghanistan, which used +4 UTC until 1945 and then +4:30 UTC thereafter::
ru: В приведенном ниже примере определяется подкласс :class:`tzinfo`, собирающий информацию о часовом поясе для Кабула, Афганистан, который использовал +4 UTC до 1945 года, а затем +4:30 UTC после этого::

source: Usage of ``KabulTz`` from above::
ru: Использование ``KabulTz`` сверху::

source: :class:`.time` Objects
ru: Объекты :class:`.time`

source: A :class:`.time` object represents a (local) time of day, independent of any particular day, and subject to adjustment via a :class:`tzinfo` object.
ru: Объект :class:`.time` представляет (локальное) время суток, независимое от какого-либо конкретного дня и подлежащее настройке с помощью объекта :class:`tzinfo`.

source: All arguments are optional. *tzinfo* may be ``None``, or an instance of a :class:`tzinfo` subclass. The remaining arguments must be integers in the following ranges:
ru: Все аргументы являются необязательными. *tzinfo* может иметь значение None или быть экземпляром подкласса :class:`tzinfo`. Остальные аргументы должны быть целыми числами в следующих диапазонах:

source: If an argument outside those ranges is given, :exc:`ValueError` is raised. All default to 0 except *tzinfo*, which defaults to ``None``.
ru: Если указан аргумент за пределами этих диапазонов, возникает :exc:`ValueError`. Все значения по умолчанию равны 0, кроме *tzinfo*, для которого по умолчанию установлено значение «Нет».

source: The earliest representable :class:`.time`, ``time(0, 0, 0, 0)``.
ru: Самый ранний представимый :class:`.time`, ``time(0, 0, 0, 0)``.

source: The latest representable :class:`.time`, ``time(23, 59, 59, 999999)``.
ru: Последний представимый :class:`.time`, ``time(23, 59, 59, 999999)``.

source: The smallest possible difference between non-equal :class:`.time` objects, ``timedelta(microseconds=1)``, although note that arithmetic on :class:`.time` objects is not supported.
ru: Наименьшая возможная разница между неравными объектами :class:`.time`, ``timedelta(microсекунды=1)``, хотя обратите внимание, что арифметика на объектах :class:`.time` не поддерживается.

source: The object passed as the tzinfo argument to the :class:`.time` constructor, or ``None`` if none was passed.
ru: Объект передается в качестве аргумента tzinfo конструктору :class:`.time` или ``None``, если ничего не было передано.

source: :class:`.time` objects support equality and order comparisons, where ``a`` is considered less than ``b`` when ``a`` precedes ``b`` in time.
ru: Объекты :class:`.time` поддерживают сравнение на равенство и порядок, где ``a`` считается меньшим, чем ``b``, когда ``a`` предшествует ``b`` по времени.

source: Naive and aware :class:`!time` objects are never equal. Order comparison between naive and aware :class:`!time` objects raises :exc:`TypeError`.
ru: Объекты :class:`.time` поддерживают сравнение на равенство и порядок, где *a* считается меньшим, чем *b*, когда *a* предшествует *b* по времени.

source: If both comparands are aware, and have the same :attr:`~.time.tzinfo` attribute, the :attr:`!tzinfo` and :attr:`!fold` attributes are ignored and the base times are compared. If both comparands are aware and have different :attr:`!tzinfo` attributes, the comparands are first adjusted by subtracting their UTC offsets (obtained from ``self.utcoffset()``).
ru: Если оба объекта сравнения известны и имеют одинаковый атрибут :attr:`~.time.tzinfo`, атрибуты :attr:`!tzinfo` и :attr:`!fold` игнорируются и сравниваются базовые времена. Если оба объекта сравнения известны и имеют разные атрибуты :attr:`!tzinfo`, сравниваемые значения сначала корректируются путем вычитания их смещений UTC (полученных из ``self.utcoffset()``).

source: Equality comparisons between aware and naive :class:`.time` instances don't raise :exc:`TypeError`.
ru: Сравнения на равенство между осведомленными и наивными экземплярами :class:`.time` не вызывают :exc:`TypeError`.

source: In Boolean contexts, a :class:`.time` object is always considered to be true.
ru: В логическом контексте объект :class:`.time` всегда считается истинным.

source: Before Python 3.5, a :class:`.time` object was considered to be false if it represented midnight in UTC. This behavior was considered obscure and error-prone and has been removed in Python 3.5. See :issue:`13936` for full details.
ru: До Python 3.5 объект :class:`.time` считался ложным, если он представлял полночь в формате UTC. Такое поведение считалось непонятным и подверженным ошибкам, и оно было удалено в Python 3.5. Подробности смотрите в :issue:`13936`.

source: Other constructor:
ru: Другой конструктор:

source: Return a :class:`.time` corresponding to a *time_string* in any valid ISO 8601 format, with the following exceptions:
ru: Возвращает :class:`.time`, соответствующий *time_string* в любом допустимом формате ISO 8601, за следующими исключениями:

source: The leading ``T``, normally required in cases where there may be ambiguity between a date and a time, is not required.
ru: Ведущий ``T``, обычно требуемый в случаях, когда между датой и временем может возникнуть неоднозначность, не требуется.

source: Fractional seconds may have any number of digits (anything beyond 6 will be truncated).
ru: Дробные секунды могут иметь любое количество цифр (все, что больше 6, будет усечено).

source: Examples:
ru: Примеры:

source: Previously, this method only supported formats that could be emitted by :meth:`time.isoformat`.
ru: Раньше этот метод поддерживал только форматы, которые могли быть созданы с помощью :meth:`time.isoformat`.

source: Return a :class:`.time` with the same value, except for those attributes given new values by whichever keyword arguments are specified. Note that ``tzinfo=None`` can be specified to create a naive :class:`.time` from an aware :class:`.time`, without conversion of the time data.
ru: Возвращает :class:`.time` с тем же значением, за исключением тех атрибутов, которым присвоены новые значения в зависимости от того, какие аргументы ключевого слова указаны. Обратите внимание, что ``tzinfo=None`` может быть указан для создания простого :class:`.time` из известного :class:`.time` без преобразования данных времени.

source: Return a string representing the time in ISO 8601 format, one of:
ru: Возвращает строку, представляющую время в формате ISO 8601, один из:

source: ``HH:MM:SS.ffffff``, if :attr:`microsecond` is not 0
ru: ``HH:MM:SS.ffffff``, если :attr:`microsecond` не равен 0

source: ``HH:MM:SS``, if :attr:`microsecond` is 0
ru: ``HH:MM:SS``, если :attr:`microsecond` равен 0

source: ``HH:MM:SS.ffffff+HH:MM[:SS[.ffffff]]``, if :meth:`utcoffset` does not return ``None``
ru: ``HH:MM:SS.ffffff+HH:MM[:SS[.ffffff]]``, если :meth:`utcoffset` не возвращает ``None``

source: ``HH:MM:SS+HH:MM[:SS[.ffffff]]``, if :attr:`microsecond` is 0 and :meth:`utcoffset` does not return ``None``
ru: ``HH:MM:SS+HH:MM[:SS[.ffffff]]``, если :attr:`microsecond` равно 0, а :meth:`utcoffset` не возвращает ``None``

source: :exc:`ValueError` will be raised on an invalid *timespec* argument.
ru: :exc:`ValueError` будет вызван недопустимым аргументом *timespec*.

source: For a time ``t``, ``str(t)`` is equivalent to ``t.isoformat()``.
ru: В течение некоторого времени ``t`` ``str(t)`` эквивалентен ``t.isoformat()``.

source: Return a string representing the time, controlled by an explicit format string. See also :ref:`strftime-strptime-behavior` and :meth:`time.isoformat`.
ru: Возвращает строку, представляющую время, управляемую строкой явного формата. См. также :ref:`strftime-strptime-behavior` и :meth:`time.isoformat`.

source: Same as :meth:`.time.strftime`. This makes it possible to specify a format string for a :class:`.time` object in :ref:`formatted string literals <f-strings>` and when using :meth:`str.format`. See also :ref:`strftime-strptime-behavior` and :meth:`time.isoformat`.
ru: То же, что и :meth:`.time.strftime`. Это позволяет указать строку формата для объекта :class:`.time` в :ref:`форматированных строковых литералах <f-strings>` и при использовании :meth:`str.format`. См. также :ref:`strftime-strptime-behavior` и :meth:`time.isoformat`.

source: If :attr:`.tzinfo` is ``None``, returns ``None``, else returns ``self.tzinfo.utcoffset(None)``, and raises an exception if the latter doesn't return ``None`` or a :class:`timedelta` object with magnitude less than one day.
ru: Если :attr:`.tzinfo` имеет значение None, возвращает None, else возвращает self.tzinfo.utcoffset(None) и вызывает исключение, если последний не возвращает `` None или объект :class:`timedelta` с магнитудой менее одного дня.

source: If :attr:`.tzinfo` is ``None``, returns ``None``, else returns ``self.tzinfo.dst(None)``, and raises an exception if the latter doesn't return ``None``, or a :class:`timedelta` object with magnitude less than one day.
ru: Если :attr:`.tzinfo` имеет значение None, возвращает None, else возвращает self.tzinfo.dst(None) и вызывает исключение, если последний не возвращает `` None`` или объект :class:`timedelta` с магнитудой менее одного дня.

source: If :attr:`.tzinfo` is ``None``, returns ``None``, else returns ``self.tzinfo.tzname(None)``, or raises an exception if the latter doesn't return ``None`` or a string object.
ru: Если :attr:`.tzinfo` имеет значение None, возвращает None, else возвращает self.tzinfo.tzname(None) или вызывает исключение, если последний не возвращает `` None`` или строковый объект.

source: Examples of Usage: :class:`.time`
ru: Примеры использования: :class:`.time`

source: Examples of working with a :class:`.time` object::
ru: Примеры работы с объектом :class:`.time`::

source: :class:`tzinfo` Objects
ru: Объекты :class:`tzinfo`

source: This is an abstract base class, meaning that this class should not be instantiated directly. Define a subclass of :class:`tzinfo` to capture information about a particular time zone.
ru: Это абстрактный базовый класс, а это означает, что экземпляр этого класса не должен создаваться напрямую. Определите подкласс :class:`tzinfo` для сбора информации об определенном часовом поясе.

source: An instance of (a concrete subclass of) :class:`tzinfo` can be passed to the constructors for :class:`.datetime` and :class:`.time` objects. The latter objects view their attributes as being in local time, and the :class:`tzinfo` object supports methods revealing offset of local time from UTC, the name of the time zone, and DST offset, all relative to a date or time object passed to them.
ru: Экземпляр (конкретного подкласса) :class:`tzinfo` может быть передан конструкторам для объектов :class:`.datetime` и :class:`.time`. Последние объекты рассматривают свои атрибуты как относящиеся к местному времени, а объект :class:`tzinfo` поддерживает методы, показывающие смещение местного времени от UTC, названия часового пояса и смещения летнего времени, все относительно объекта даты или времени. перешел к ним.

source: You need to derive a concrete subclass, and (at least) supply implementations of the standard :class:`tzinfo` methods needed by the :class:`.datetime` methods you use. The :mod:`!datetime` module provides :class:`timezone`, a simple concrete subclass of :class:`tzinfo` which can represent time zones with fixed offset from UTC such as UTC itself or North American EST and EDT.
ru: Вам необходимо создать конкретный подкласс и (по крайней мере) предоставить реализации стандартных методов :class:`tzinfo`, необходимых для используемых вами методов :class:`.datetime`. Модуль :mod:`!datetime` предоставляет :class:`timezone`, простой конкретный подкласс :class:`tzinfo`, который может представлять часовые пояса с фиксированным смещением от UTC, такие как само UTC или североамериканское EST и EDT.

source: Special requirement for pickling: A :class:`tzinfo` subclass must have an :meth:`~object.__init__` method that can be called with no arguments, otherwise it can be pickled but possibly not unpickled again. This is a technical requirement that may be relaxed in the future.
ru: Особое требование для травления: подкласс :class:`tzinfo` должен иметь метод :meth:`~object.__init__`, который можно вызывать без аргументов, в противном случае его можно будет марилировать, но, возможно, не расконсервировать снова. Это техническое требование, которое в будущем может быть смягчено.

source: A concrete subclass of :class:`tzinfo` may need to implement the following methods. Exactly which methods are needed depends on the uses made of aware :mod:`!datetime` objects. If in doubt, simply implement all of them.
ru: Конкретному подклассу :class:`tzinfo` может потребоваться реализация следующих методов. Какие именно методы необходимы, зависит от использования известных объектов :mod:`!datetime`. Если сомневаетесь, просто реализуйте их все.

source: Return offset of local time from UTC, as a :class:`timedelta` object that is positive east of UTC. If local time is west of UTC, this should be negative.
ru: Возвращает смещение местного времени от UTC в виде объекта :class:`timedelta`, положительного к востоку от UTC. Если местное время находится к западу от UTC, оно должно быть отрицательным.

source: This represents the *total* offset from UTC; for example, if a :class:`tzinfo` object represents both time zone and DST adjustments, :meth:`utcoffset` should return their sum. If the UTC offset isn't known, return ``None``. Else the value returned must be a :class:`timedelta` object strictly between ``-timedelta(hours=24)`` and ``timedelta(hours=24)`` (the magnitude of the offset must be less than one day). Most implementations of :meth:`utcoffset` will probably look like one of these two::
ru: Это представляет собой *общее* смещение от UTC; например, если объект :class:`tzinfo` представляет как часовой пояс, так и настройки летнего времени, :meth:`utcoffset` должен вернуть их сумму. Если смещение UTC неизвестно, верните None. В противном случае возвращаемое значение должно быть объектом :class:`timedelta` строго между ``-timedelta(hours=24)`` и ``timedelta(hours=24)`` (величина смещения должна быть меньше одного дня). ). Большинство реализаций :meth:`utcoffset`, вероятно, будут выглядеть как одна из этих двух::

source: return CONSTANT # fixed-offset class return CONSTANT + self.dst(dt) # daylight-aware class
ru: вернуть CONSTANT # класс с фиксированным смещением return CONSTANT + self.dst(dt) # класс, учитывающий дневной свет

source: If :meth:`utcoffset` does not return ``None``, :meth:`dst` should not return ``None`` either.
ru: Если :meth:`utcoffset` не возвращает ``None``, :meth:`dst` также не должен возвращать ``None``.

source: The default implementation of :meth:`utcoffset` raises :exc:`NotImplementedError`.
ru: Реализация :meth:`utcoffset` по умолчанию вызывает :exc:`NotImplementedError`.

source: Return the daylight saving time (DST) adjustment, as a :class:`timedelta` object or ``None`` if DST information isn't known.
ru: Возвращает настройку летнего времени (DST) в виде объекта timedelta или None, если информация о летнем времени неизвестна.

source: Return ``timedelta(0)`` if DST is not in effect. If DST is in effect, return the offset as a :class:`timedelta` object (see :meth:`utcoffset` for details). Note that DST offset, if applicable, has already been added to the UTC offset returned by :meth:`utcoffset`, so there's no need to consult :meth:`dst` unless you're interested in obtaining DST info separately. For example, :meth:`datetime.timetuple` calls its :attr:`~.datetime.tzinfo` attribute's :meth:`dst` method to determine how the :attr:`~time.struct_time.tm_isdst` flag should be set, and :meth:`tzinfo.fromutc` calls :meth:`dst` to account for DST changes when crossing time zones.
ru: Верните ``timedelta(0)``, если летнее время не действует. Если действует летнее время, верните смещение как объект :class:`timedelta` (подробности см. в :meth:`utcoffset`). Обратите внимание, что смещение летнего времени, если оно применимо, уже добавлено к смещению UTC, возвращаемому :meth:`utcoffset`, поэтому нет необходимости обращаться к :meth:`dst`, если вы не заинтересованы в получении информации о летнем времени отдельно. Например, :meth:`datetime.timetuple` вызывает метод :meth:`dst` своего атрибута :attr:`~.datetime.tzinfo`, чтобы определить, как должен быть установлен флаг :attr:`~time.struct_time.tm_isdst`. и :meth:`tzinfo.fromutc` вызывает :meth:`dst` для учета изменений летнего времени при пересечении часовых поясов.

source: An instance *tz* of a :class:`tzinfo` subclass that models both standard and daylight times must be consistent in this sense:
ru: Экземпляр *tz* подкласса :class:`tzinfo`, который моделирует как стандартное, так и летнее время, должен быть согласованным в этом смысле:
