Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/datetime.po
Languages: ru

source: :mod:`!datetime` --- Basic date and time types
ru: :mod:`!datetime` --- Основные типы даты и времени

source: **Source code:** :source:`Lib/datetime.py`
ru: **Исходный код:** :source:`Lib/datetime.py`

source: The :mod:`!datetime` module supplies classes for manipulating dates and times.
ru: Модуль :mod:`!datetime` предоставляет классы для управления датами и временем.

source: While date and time arithmetic is supported, the focus of the implementation is on efficient attribute extraction for output formatting and manipulation.
ru: Хотя арифметика даты и времени поддерживается, основное внимание в реализации уделяется эффективному извлечению атрибутов для форматирования и манипулирования выходными данными.

source: Skip to :ref:`the format codes <format-codes>`.
ru: Перейдите к :ref:`кодам формата <format-codes>`.

source: Module :mod:`calendar`
ru: Модуль :mod:`calendar`

source: General calendar related functions.
ru: Общие функции, связанные с календарем.

source: Module :mod:`time`
ru: Модуль :mod:`time`

source: Time access and conversions.
ru: Доступ ко времени и преобразования.

source: Module :mod:`zoneinfo`
ru: Модуль :mod:`zoneinfo`

source: Concrete time zones representing the IANA time zone database.
ru: Конкретные часовые пояса, представляющие базу данных часовых поясов IANA.

source: Package `dateutil <https://dateutil.readthedocs.io/en/stable/>`_
ru: Пакет `dateutil <https://dateutil.readthedocs.io/en/stable/>`_

source: Third-party library with expanded time zone and parsing support.
ru: Сторонняя библиотека с расширенным часовым поясом и поддержкой парсинга.

source: Package :pypi:`DateType`
ru: Пакет :pypi:`DateType`

source: Third-party library that introduces distinct static types to e.g. allow :term:`static type checkers <static type checker>` to differentiate between naive and aware datetimes.
ru: Сторонняя библиотека, которая вводит отдельные статические типы, например, позволяет :term:`проверкам статического типа <статическая проверка типа>` различать наивные и осведомленные даты и времени.

source: Aware and Naive Objects
ru: Осознанные и наивные объекты

source: Date and time objects may be categorized as "aware" or "naive" depending on whether or not they include time zone information.
ru: Объекты даты и времени могут быть отнесены к категории «осведомленных» или «наивных» в зависимости от того, включают ли они информацию о часовом поясе.

source: With sufficient knowledge of applicable algorithmic and political time adjustments, such as time zone and daylight saving time information, an **aware** object can locate itself relative to other aware objects. An aware object represents a specific moment in time that is not open to interpretation. [#]_
ru: При наличии достаточных знаний о применимых алгоритмических и политических корректировках времени, таких как информация о часовом поясе и летнем времени, **осведомленный** объект может определять свое местоположение относительно других осведомленных объектов. Осознанный объект представляет собой конкретный момент времени, который не подлежит интерпретации. [#]_

source: A **naive** object does not contain enough information to unambiguously locate itself relative to other date/time objects. Whether a naive object represents Coordinated Universal Time (UTC), local time, or time in some other time zone is purely up to the program, just like it is up to the program whether a particular number represents metres, miles, or mass. Naive objects are easy to understand and to work with, at the cost of ignoring some aspects of reality.
ru: **Наивный** объект не содержит достаточно информации, чтобы однозначно определить свое местоположение относительно других объектов даты и времени. Представляет ли наивный объект всемирное координированное время (UTC), местное время или время в каком-то другом часовом поясе, зависит исключительно от программы, точно так же, как от программы зависит, представляет ли конкретное число метры, мили или массу. Наивные объекты легко понять и с ними легко работать, ценой игнорирования некоторых аспектов реальности.

source: For applications requiring aware objects, :class:`.datetime` and :class:`.time` objects have an optional time zone information attribute, :attr:`!tzinfo`, that can be set to an instance of a subclass of the abstract :class:`tzinfo` class. These :class:`tzinfo` objects capture information about the offset from UTC time, the time zone name, and whether daylight saving time is in effect.
ru: Для приложений, требующих наличия объектов, объекты :class:`.datetime` и :class:`.time` имеют дополнительный атрибут информации о часовом поясе, :attr:`!tzinfo`, который может быть установлен для экземпляра подкласса абстрактный :class:`tzinfo` класс. Эти объекты :class:`tzinfo` собирают информацию об отклонении от времени UTC, имени часового пояса и о том, действует ли летнее время.

source: Only one concrete :class:`tzinfo` class, the :class:`timezone` class, is supplied by the :mod:`!datetime` module. The :class:`!timezone` class can represent simple time zones with fixed offsets from UTC, such as UTC itself or North American EST and EDT time zones. Supporting time zones at deeper levels of detail is up to the application. The rules for time adjustment across the world are more political than rational, change frequently, and there is no standard suitable for every application aside from UTC.
ru: Только один конкретный класс :class:`tzinfo`, класс :class:`timezone`, предоставляется модулем :mod:`!datetime`. Класс :class:`!timezone` может представлять простые часовые пояса с фиксированными смещениями от UTC, например, само UTC или часовые пояса Северной Америки EST и EDT. Поддержка часовых поясов на более глубоких уровнях детализации зависит от приложения. Правила корректировки времени во всем мире носят скорее политический, чем рациональный характер, часто меняются, и не существует стандарта, подходящего для каждого применения, кроме UTC.

source: Constants
ru: Константы

source: The :mod:`!datetime` module exports the following constants:
ru: Модуль :mod:`!datetime` экспортирует следующие константы:

source: The smallest year number allowed in a :class:`date` or :class:`.datetime` object. :const:`MINYEAR` is 1.
ru: Наименьшее число года, разрешенное в объекте :class:`date` или :class:`.datetime`. :const:`MINYEAR` равен 1.

source: The largest year number allowed in a :class:`date` or :class:`.datetime` object. :const:`MAXYEAR` is 9999.
ru: Максимальный номер года, разрешенный в объекте :class:`date` или :class:`.datetime`. :const:`MAXYEAR` — 9999.

source: Alias for the UTC time zone singleton :attr:`datetime.timezone.utc`.
ru: Псевдоним для одиночного часового пояса UTC :attr:`datetime.timezone.utc`.

source: Available Types
ru: Доступные типы

source: An idealized naive date, assuming the current Gregorian calendar always was, and always will be, in effect. Attributes: :attr:`year`, :attr:`month`, and :attr:`day`.
ru: Идеализированная наивная дата, предполагающая, что текущий григорианский календарь всегда действовал и всегда будет действовать. Атрибуты: :attr:`year`, :attr:`month` и :attr:`day`.

source: An idealized time, independent of any particular day, assuming that every day has exactly 24\*60\*60 seconds. (There is no notion of "leap seconds" here.) Attributes: :attr:`hour`, :attr:`minute`, :attr:`second`, :attr:`microsecond`, and :attr:`.tzinfo`.
ru: Идеализированное время, независимое от какого-либо конкретного дня, при условии, что в каждом дне ровно 24\*60\*60 секунд. (Здесь нет понятия «високосные секунды».) Атрибуты: :attr:`hour`, :attr:`минута`, :attr:`секунда`, :attr:`микросекунда` и :attr:`.tzinfo `.

source: A combination of a date and a time. Attributes: :attr:`year`, :attr:`month`, :attr:`day`, :attr:`hour`, :attr:`minute`, :attr:`second`, :attr:`microsecond`, and :attr:`.tzinfo`.
ru: Сочетание даты и времени. Атрибуты: :attr:`год`, :attr:`месяц`, :attr:`день`, :attr:`час`, :attr:`минута`, :attr:`секунда`, :attr:`микросекунда` и :attr:`.tzinfo`.

source: A duration expressing the difference between two :class:`.datetime` or :class:`date` instances to microsecond resolution.
ru: Длительность, выражающая разницу между двумя экземплярами :class:`.datetime` или :class:`date` с разрешением в микросекундах.

source: An abstract base class for time zone information objects. These are used by the :class:`.datetime` and :class:`.time` classes to provide a customizable notion of time adjustment (for example, to account for time zone and/or daylight saving time).
ru: Абстрактный базовый класс для объектов информации о часовом поясе. Они используются классами :class:`.datetime` и :class:`.time` для предоставления настраиваемого понятия корректировки времени (например, для учета часового пояса и/или летнего времени).

source: A class that implements the :class:`tzinfo` abstract base class as a fixed offset from the UTC.
ru: Класс, реализующий абстрактный базовый класс :class:`tzinfo` как фиксированное смещение от UTC.

source: Objects of these types are immutable.
ru: Объекты этих типов неизменяемы.

source: Subclass relationships::
ru: Отношения между подклассами::

source: Common Properties
ru: Общие свойства

source: The :class:`date`, :class:`.datetime`, :class:`.time`, and :class:`timezone` types share these common features:
ru: Типы :class:`date`, :class:`.datetime`, :class:`.time` и :class:`timezone` имеют следующие общие особенности:

source: Objects of these types are :term:`hashable`, meaning that they can be used as dictionary keys.
ru: Объекты этих типов являются :term:`hashable`, что означает, что их можно использовать в качестве ключей словаря.

source: Objects of these types support efficient pickling via the :mod:`pickle` module.
ru: Объекты этих типов поддерживают эффективное травление с помощью модуля :mod:`pickle`.

source: Determining if an Object is Aware or Naive
ru: Определение того, является ли объект осознанным или наивным

source: Objects of the :class:`date` type are always naive.
ru: Объекты типа :class:`date` всегда наивны.

source: An object of type :class:`.time` or :class:`.datetime` may be aware or naive.
ru: Объект типа :class:`.time` или :class:`.datetime` может быть осознанным или неактивным.

source: A :class:`.datetime` object ``d`` is aware if both of the following hold:
ru: Объект :class:`.datetime` ``d`` распознает, если выполняются оба следующих условия:

source: ``d.tzinfo.utcoffset(d)`` does not return ``None``
ru: ``d.tzinfo.utcoffset(d)`` не возвращает ``None``

source: Otherwise, ``d`` is naive.
ru: В противном случае ``d`` будет наивным.

source: A :class:`.time` object ``t`` is aware if both of the following hold:
ru: Объект :class:`.time` ``t`` распознает, если выполняются оба следующих условия:

source: ``t.tzinfo`` is not ``None``
ru: ``t.tzinfo`` не ``None``

source: ``t.tzinfo.utcoffset(None)`` does not return ``None``.
ru: ``t.tzinfo.utcoffset(None)`` не возвращает ``None`` .

source: Otherwise, ``t`` is naive.
ru: В противном случае ``t`` будет наивным.

source: The distinction between aware and naive doesn't apply to :class:`timedelta` objects.
ru: Различие между осведомленным и наивным не применимо к объектам :class:`timedelta`.

source: :class:`timedelta` Objects
ru: Объекты :class:`timedelta`

source: A :class:`timedelta` object represents a duration, the difference between two :class:`.datetime` or :class:`date` instances.
ru: Объект :class:`timedelta` представляет продолжительность, разницу между двумя экземплярами :class:`.datetime` или :class:`date`.

source: All arguments are optional and default to 0. Arguments may be integers or floats, and may be positive or negative.
ru: Все аргументы являются необязательными и по умолчанию имеют значение 0. Аргументы могут быть целыми числами или числами с плавающей запятой, а также могут быть положительными или отрицательными.

source: Only *days*, *seconds* and *microseconds* are stored internally. Arguments are converted to those units:
ru: Внутри хранятся только *дни*, *секунды* и *микросекунды*. Аргументы преобразуются в следующие единицы:

source: A millisecond is converted to 1000 microseconds.
ru: Миллисекунда преобразуется в 1000 микросекунд.

source: A minute is converted to 60 seconds.
ru: Минута конвертируется в 60 секунд.

source: An hour is converted to 3600 seconds.
ru: Час преобразуется в 3600 секунд.

source: A week is converted to 7 days.
ru: Неделя преобразуется в 7 дней.

source: and days, seconds and microseconds are then normalized so that the representation is unique, with
ru: а затем дни, секунды и микросекунды нормализуются так, чтобы представление было уникальным, с

source: ``0 <= seconds < 3600*24`` (the number of seconds in one day)
ru: ``0 <= секунд < 3600*24`` (количество секунд в одном дне)

source: The following example illustrates how any arguments besides *days*, *seconds* and *microseconds* are "merged" and normalized into those three resulting attributes::
ru: Следующий пример иллюстрирует, как любые аргументы, кроме *дней*, *секунд* и *микросекунд*, «объединяются» и нормализуются в эти три результирующих атрибута:

source: If any argument is a float and there are fractional microseconds, the fractional microseconds left over from all arguments are combined and their sum is rounded to the nearest microsecond using round-half-to-even tiebreaker. If no argument is a float, the conversion and normalization processes are exact (no information is lost).
ru: Если какой-либо аргумент является числом с плавающей запятой и есть дробные микросекунды, дробные микросекунды, оставшиеся от всех аргументов, объединяются, и их сумма округляется до ближайшей микросекунды с использованием тай-брейкера от половины до четного. Если ни один аргумент не является числом с плавающей запятой, процессы преобразования и нормализации являются точными (информация не теряется).

source: If the normalized value of days lies outside the indicated range, :exc:`OverflowError` is raised.
ru: Если нормализованное значение дней находится за пределами указанного диапазона, возникает ошибка :exc:`OverflowError`.

source: Note that normalization of negative values may be surprising at first. For example::
ru: Обратите внимание, что нормализация отрицательных значений поначалу может показаться неожиданной. Например::

source: Class attributes:
ru: Атрибуты класса:

source: The most negative :class:`timedelta` object, ``timedelta(-999999999)``.
ru: Самый негативный объект :class:`timedelta`, ``timedelta(-999999999)``.

source: The most positive :class:`timedelta` object, ``timedelta(days=999999999, hours=23, minutes=59, seconds=59, microseconds=999999)``.
ru: Самый позитивный объект :class:`timedelta`, ``timedelta(days=999999999, часы=23, минуты=59, секунды=59, микросекунды=999999)``.

source: The smallest possible difference between non-equal :class:`timedelta` objects, ``timedelta(microseconds=1)``.
ru: Наименьшая возможная разница между неравными объектами :class:`timedelta`, ``timedelta(microсекунды=1)``.

source: Note that, because of normalization, ``timedelta.max`` is greater than ``-timedelta.min``. ``-timedelta.max`` is not representable as a :class:`timedelta` object.
ru: Обратите внимание, что из-за нормализации timedelta.max больше, чем -timedelta.min. ``-timedelta.max`` не может быть представлен как объект :class:`timedelta`.

source: Instance attributes (read-only):
ru: Атрибуты экземпляра (доступны только для чтения):

source: Between -999,999,999 and 999,999,999 inclusive.
ru: От -999 999 999 до 999 999 999 включительно.

source: Between 0 and 86,399 inclusive.
ru: От 0 до 86 399 включительно.

source: It is a somewhat common bug for code to unintentionally use this attribute when it is actually intended to get a :meth:`~timedelta.total_seconds` value instead:
ru: Это довольно распространенная ошибка, когда код непреднамеренно использует этот атрибут, хотя на самом деле он предназначен для получения вместо этого значения :meth:`~timedelta.total_секунды`:

source: Between 0 and 999,999 inclusive.
ru: От 0 до 999 999 включительно.

source: Supported operations:
ru: Поддерживаемые операции:

source: Operation
ru: Операция

source: Result
ru: Результат

source: Sum of ``t2`` and ``t3``. Afterwards ``t1 - t2 == t3`` and ``t1 - t3 == t2`` are true. (1)
ru: Сумма ``t2`` и ``t3``. После этого ``t1 - t2 == t3`` и ``t1 - t3 == t2`` являются истинными. (1)

source: Difference of ``t2`` and ``t3``. Afterwards ``t1 == t2 - t3`` and ``t2 == t1 + t3`` are true. (1)(6)
ru: Разница «t2» и «t3». После этого ``t1 == t2 - t3`` и ``t2 == t1 + t3`` являются истинными. (1)(6)

source: Delta multiplied by an integer. Afterwards ``t1 // i == t2`` is true, provided ``i != 0``.
ru: Дельта, умноженная на целое число. После этого ``t1 // i == t2`` будет истинным, если ``i != 0``.

source: In general, ``t1 * i == t1 * (i-1) + t1`` is true. (1)
ru: В общем, ``t1 * i == t1 * (i-1) + t1`` верно. (1)

source: Delta multiplied by a float. The result is rounded to the nearest multiple of timedelta.resolution using round-half-to-even.
ru: Дельта умножается на число с плавающей точкой. Результат округляется до ближайшего значения, кратного timedelta.resolution, с использованием метода округления от половины до четного.

source: Division (3) of overall duration ``t2`` by interval unit ``t3``. Returns a :class:`float` object.
ru: Деление (3) общей продолжительности ``t2`` на единицу интервала ``t3``. Возвращает объект :class:`float`.

source: Delta divided by a float or an int. The result is rounded to the nearest multiple of timedelta.resolution using round-half-to-even.
ru: Дельта делится на число с плавающей точкой или целое число. Результат округляется до ближайшего значения, кратного значению timedelta.resolution, с использованием метода округления от половины до четного.

source: The floor is computed and the remainder (if any) is thrown away. In the second case, an integer is returned. (3)
ru: Вычисляется минимальное значение, а остаток (если таковой имеется) отбрасывается. Во втором случае возвращается целое число. (3)

source: The remainder is computed as a :class:`timedelta` object. (3)
ru: Оставшаяся часть вычисляется как объект :class:`timedelta`. (3)

source: Computes the quotient and the remainder: ``q = t1 // t2`` (3) and ``r = t1 % t2``. ``q`` is an integer and ``r`` is a :class:`timedelta` object.
ru: Вычисляет частное и остаток: ``q = t1 // t2`` (3) и ``r = t1 % t2``. ``q`` является целым числом, а ``r`` представляет собой объект :class:`timedelta`.

source: Returns a :class:`timedelta` object with the same value. (2)
ru: Возвращает объект :class:`timedelta` с тем же значением. (2)

source: Equivalent to ``timedelta(-t1.days, -t1.seconds, -t1.microseconds)``, and to ``t1 * -1``. (1)(4)
ru: Эквивалентно ``timedelta(-t1.days, -t1.секунды, -t1.микросекунды)`` и ``t1 * -1``. (1)(4)

source: Equivalent to ``+t`` when ``t.days >= 0``, and to ``-t`` when ``t.days < 0``. (2)
ru: Эквивалентно ``+t``, когда ``t.days >= 0``, и ``-t``, когда ``t.days < 0``. (2)

source: Returns a string in the form ``[D day[s], ][H]H:MM:SS[.UUUUUU]``, where D is negative for negative ``t``. (5)
ru: Возвращает строку в виде ``[D day[s], ][H]H:MM:SS[.UUUUUU]``, где D - отрицательное значение для отрицательного ``t``. (5)

source: Returns a string representation of the :class:`timedelta` object as a constructor call with canonical attribute values.
ru: Возвращает строковое представление объекта :class:`timedelta` в виде вызова конструктора с каноническими значениями атрибутов.

source: Notes:
ru: Примечания:

source: This is exact but may overflow.
ru: Это точно, но может привести к переполнению.

source: This is exact and cannot overflow.
ru: Это точно и не может привести к переполнению.

source: Division by zero raises :exc:`ZeroDivisionError`.
ru: Деление на ноль вызывает :exc:`ZeroDivisionError`.

source: ``-timedelta.max`` is not representable as a :class:`timedelta` object.
ru: ``-timedelta.max`` не может быть представлен как объект :class:`timedelta`.

source: String representations of :class:`timedelta` objects are normalized similarly to their internal representation. This leads to somewhat unusual results for negative timedeltas. For example::
ru: Строковые представления объектов :class:`timedelta` нормализуются аналогично их внутреннему представлению. Это приводит к несколько необычным результатам для отрицательных временных дельт. Например::

source: The expression ``t2 - t3`` will always be equal to the expression ``t2 + (-t3)`` except when t3 is equal to ``timedelta.max``; in that case the former will produce a result while the latter will overflow.
ru: Выражение ``t2 - t3`` всегда будет равно выражению ``t2 + (-t3)``, за исключением случаев, когда t3 равно ``timedelta.max``; в этом случае первый даст результат, а второй переполнится.

source: In addition to the operations listed above, :class:`timedelta` objects support certain additions and subtractions with :class:`date` and :class:`.datetime` objects (see below).
ru: В дополнение к операциям, перечисленным выше, объекты :class:`timedelta` поддерживают определенные сложения и вычитания с объектами :class:`date` и :class:`.datetime` (см. ниже).

source: Floor division and true division of a :class:`timedelta` object by another :class:`timedelta` object are now supported, as are remainder operations and the :func:`divmod` function. True division and multiplication of a :class:`timedelta` object by a :class:`float` object are now supported.
ru: Теперь поддерживаются деление этажа и истинное деление объекта :class:`timedelta` на другой объект :class:`timedelta`, а также операции с остатками и функция :func:`divmod`. Теперь поддерживается истинное деление и умножение объекта :class:`timedelta` на объект :class:`float`.

source: :class:`timedelta` objects support equality and order comparisons.
ru: Объекты :class:`timedelta` поддерживают сравнение на равенство и порядок.

source: In Boolean contexts, a :class:`timedelta` object is considered to be true if and only if it isn't equal to ``timedelta(0)``.
ru: В логическом контексте объект :class:`timedelta` считается истинным тогда и только тогда, когда он не равен ``timedelta(0)``.

source: Instance methods:
ru: Методы экземпляра:

source: Return the total number of seconds contained in the duration. Equivalent to ``td / timedelta(seconds=1)``. For interval units other than seconds, use the division form directly (e.g. ``td / timedelta(microseconds=1)``).
ru: Возвращает общее количество секунд, содержащихся в продолжительности. Эквивалентно ``td / timedelta(секунды=1)``. Для единиц измерения интервала, отличных от секунд, используйте непосредственно форму деления (например, ``td / timedelta(микросекунды=1)``).

source: Note that for very large time intervals (greater than 270 years on most platforms) this method will lose microsecond accuracy.
ru: Обратите внимание, что для очень больших интервалов времени (более 270 лет на большинстве платформ) этот метод теряет микросекундную точность.

source: Examples of usage: :class:`timedelta`
ru: Примеры использования: :class:`timedelta`

source: An additional example of normalization::
ru: Дополнительный пример нормализации::

source: Examples of :class:`timedelta` arithmetic::
ru: Примеры арифметики :class:`timedelta`::

source: :class:`date` Objects
ru: Объекты :class:`date`

source: A :class:`date` object represents a date (year, month and day) in an idealized calendar, the current Gregorian calendar indefinitely extended in both directions.
ru: Объект :class:`date` представляет дату (год, месяц и день) в идеализированном календаре, текущем григорианском календаре, неограниченно расширенном в обоих направлениях.
