Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/datetime.po
Languages: ru

source: January 1 of year 1 is called day number 1, January 2 of year 1 is called day number 2, and so on. [#]_
ru: 1 января года 1 называется днем ​​номер 1, 2 января года 1 называется днем ​​номер 2 и так далее. [#]_

source: All arguments are required. Arguments must be integers, in the following ranges:
ru: Все аргументы обязательны. Аргументы должны быть целыми числами в следующих диапазонах:

source: If an argument outside those ranges is given, :exc:`ValueError` is raised.
ru: Если указан аргумент за пределами этих диапазонов, возникает :exc:`ValueError`.

source: Other constructors, all class methods:
ru: Другие конструкторы, все методы класса:

source: Return the current local date.
ru: Вернуть текущую местную дату.

source: This is equivalent to ``date.fromtimestamp(time.time())``.
ru: Это эквивалентно ``date.fromtimestamp(time.time())``.

source: Return the local date corresponding to the POSIX timestamp, such as is returned by :func:`time.time`.
ru: Возвращает локальную дату, соответствующую временной метке POSIX, например, возвращаемую :func:`time.time`.

source: This may raise :exc:`OverflowError`, if the timestamp is out of the range of values supported by the platform C :c:func:`localtime` function, and :exc:`OSError` on :c:func:`localtime` failure. It's common for this to be restricted to years from 1970 through 2038. Note that on non-POSIX systems that include leap seconds in their notion of a timestamp, leap seconds are ignored by :meth:`fromtimestamp`.
ru: Это может вызвать :exc:`OverflowError`, если временная метка выходит за пределы диапазона значений, поддерживаемых функцией платформы C :c:func:`localtime`, и :exc:`OSError` в :c:func:`localtime`. ` провал. Обычно это ограничивается годами с 1970 по 2038 год. Обратите внимание, что в системах, отличных от POSIX, которые включают високосные секунды в понятие метки времени, високосные секунды игнорируются :meth:`fromtimestamp`.

source: Raise :exc:`OverflowError` instead of :exc:`ValueError` if the timestamp is out of the range of values supported by the platform C :c:func:`localtime` function. Raise :exc:`OSError` instead of :exc:`ValueError` on :c:func:`localtime` failure.
ru: Поднимите :exc:`OverflowError` вместо :exc:`ValueError`, если временная метка выходит за пределы диапазона значений, поддерживаемых функцией платформы C :c:func:`localtime`. Вызовите :exc:`OSError` вместо :exc:`ValueError` при сбое :c:func:`localtime`.

source: Return the date corresponding to the proleptic Gregorian ordinal, where January 1 of year 1 has ordinal 1.
ru: Возвращает дату, соответствующую пролептическому григорианскому порядковому номеру, где 1 января года 1 имеет порядковый номер 1.

source: :exc:`ValueError` is raised unless ``1 <= ordinal <= date.max.toordinal()``. For any date ``d``, ``date.fromordinal(d.toordinal()) == d``.
ru: :exc:`ValueError` возникает, если ``1 <= ordinal <= date.max.toordinal()``. Для любой даты ``d`` ``date.fromordinal(d.toordinal()) == d``.

source: Return a :class:`date` corresponding to a *date_string* given in any valid ISO 8601 format, with the following exceptions:
ru: Возвращает :class:`date`, соответствующий *date_string*, заданному в любом допустимом формате ISO 8601, за следующими исключениями:

source: Reduced precision dates are not currently supported (``YYYY-MM``, ``YYYY``).
ru: Даты пониженной точности в настоящее время не поддерживаются (``ГГГГ-ММ``, ``ГГГГ``).

source: Extended date representations are not currently supported (``±YYYYYY-MM-DD``).
ru: Расширенное представление даты в настоящее время не поддерживается (``±ГГГГГГ-ММ-ДД``).

source: Ordinal dates are not currently supported (``YYYY-OOO``).
ru: Порядковые даты в настоящее время не поддерживаются (``ГГГГ-ООО``).

source: Examples::
ru: Примеры::

source: Previously, this method only supported the format ``YYYY-MM-DD``.
ru: Ранее этот метод поддерживал только формат «ГГГГ-ММ-ДД».

source: Return a :class:`date` corresponding to the ISO calendar date specified by year, week and day. This is the inverse of the function :meth:`date.isocalendar`.
ru: Возвращает :class:`date`, соответствующий дате календаря ISO, указанной годом, неделей и днем. Это обратная функция :meth:`date.isocalendar`.

source: The earliest representable date, ``date(MINYEAR, 1, 1)``.
ru: Самая ранняя представимая дата, ``date(MINYEAR, 1, 1)``.

source: The latest representable date, ``date(MAXYEAR, 12, 31)``.
ru: Самая последняя представимая дата, ``date(MAXYEAR, 12, 31)``.

source: The smallest possible difference between non-equal date objects, ``timedelta(days=1)``.
ru: Наименьшая возможная разница между неравными объектами даты, ``timedelta(days=1)``.

source: Between :const:`MINYEAR` and :const:`MAXYEAR` inclusive.
ru: Между :const:`MINYEAR` и :const:`MAXYEAR` включительно.

source: Between 1 and 12 inclusive.
ru: От 1 до 12 включительно.

source: Between 1 and the number of days in the given month of the given year.
ru: Между 1 и количеством дней в данном месяце данного года.

source: ``date2`` will be ``timedelta.days`` days after ``date1``. (1)
ru: ``date2`` будет через ``timedelta.days`` дней после ``date1``. (1)

source: Computes ``date2`` such that ``date2 + timedelta == date1``. (2)
ru: Вычисляет ``date2`` так, что ``date2 + timedelta == date1``. (2)

source: Equality comparison. (4)
ru: Сравнение равенства. (4)

source: Order comparison. (5)
ru: Сравнение заказов. (5)

source: *date2* is moved forward in time if ``timedelta.days > 0``, or backward if ``timedelta.days < 0``. Afterward ``date2 - date1 == timedelta.days``. ``timedelta.seconds`` and ``timedelta.microseconds`` are ignored. :exc:`OverflowError` is raised if ``date2.year`` would be smaller than :const:`MINYEAR` or larger than :const:`MAXYEAR`.
ru: *date2* перемещается вперед во времени, если ``timedelta.days > 0``, или назад, если ``timedelta.days < 0``. Далее ``date2 - date1 == timedelta.days``. ``timedelta.секунды`` и ``timedelta.microсекунды`` игнорируются. :exc:`OverflowError` возникает, если ``date2.year`` меньше :const:`MINYEAR` или больше :const:`MAXYEAR`.

source: ``timedelta.seconds`` and ``timedelta.microseconds`` are ignored.
ru: ``timedelta.seconds`` и ``timedelta.microseconds`` игнорируются.

source: This is exact, and cannot overflow. ``timedelta.seconds`` and ``timedelta.microseconds`` are 0, and ``date2 + timedelta == date1`` after.
ru: Это точно и не может переполниться. ``timedelta.seconds`` и ``timedelta.microseconds`` равны 0, а ``date2 + timedelta == date1`` после.

source: :class:`date` objects are equal if they represent the same date.
ru: Объекты :class:`date` равны, если они представляют одну и ту же дату.

source: *date1* is considered less than *date2* when *date1* precedes *date2* in time. In other words, ``date1 < date2`` if and only if ``date1.toordinal() < date2.toordinal()``.
ru: *date1* считается меньше, чем *date2*, если *date1* предшествует *date2* по времени. Другими словами, ``date1 < date2`` тогда и только тогда, когда ``date1.toordinal() < date2.toordinal()``.

source: In Boolean contexts, all :class:`date` objects are considered to be true.
ru: В логическом контексте все объекты :class:`date` считаются истинными.

source: Return a date with the same value, except for those parameters given new values by whichever keyword arguments are specified.
ru: Возвращает дату с тем же значением, за исключением тех параметров, которым присвоены новые значения в зависимости от того, какие аргументы ключевого слова указаны.

source: Example::
ru: Пример::

source: Return a :class:`time.struct_time` such as returned by :func:`time.localtime`.
ru: Возвращает :class:`time.struct_time`, например, возвращаемый :func:`time.localtime`.

source: The hours, minutes and seconds are 0, and the DST flag is -1.
ru: Часы, минуты и секунды равны 0, а флаг летнего времени равен -1.

source: ``d.timetuple()`` is equivalent to::
ru: ``d.timetuple()`` эквивалентен::

source: Return the proleptic Gregorian ordinal of the date, where January 1 of year 1 has ordinal 1. For any :class:`date` object ``d``, ``date.fromordinal(d.toordinal()) == d``.
ru: Возвращает пролептический григорианский порядковый номер даты, где 1 января года 1 имеет порядковый номер 1. Для любого :class:`date` объекта ``d``, ``date.fromordinal(d.toordinal()) == d` `.

source: Return the day of the week as an integer, where Monday is 0 and Sunday is 6. For example, ``date(2002, 12, 4).weekday() == 2``, a Wednesday. See also :meth:`isoweekday`.
ru: Возвращает день недели как целое число, где понедельник — 0, а воскресенье — 6. Например, ``date(2002, 12, 4).weekday() == 2``, среда. См. также :meth:`isoweekday`.

source: Return the day of the week as an integer, where Monday is 1 and Sunday is 7. For example, ``date(2002, 12, 4).isoweekday() == 3``, a Wednesday. See also :meth:`weekday`, :meth:`isocalendar`.
ru: Возвращает день недели как целое число, где понедельник — 1, а воскресенье — 7. Например, ``date(2002, 12, 4).isoweekday() == 3``, среда. См. также :meth:`weekday`, :meth:`isocalendar`.

source: Return a :term:`named tuple` object with three components: ``year``, ``week`` and ``weekday``.
ru: Возвращает объект :term:`named tuple` с тремя компонентами: ``год``, ``неделя`` и ``день недели``.

source: The ISO calendar is a widely used variant of the Gregorian calendar. [#]_
ru: Календарь ISO является широко используемым вариантом григорианского календаря. [#]_

source: The ISO year consists of 52 or 53 full weeks, and where a week starts on a Monday and ends on a Sunday. The first week of an ISO year is the first (Gregorian) calendar week of a year containing a Thursday. This is called week number 1, and the ISO year of that Thursday is the same as its Gregorian year.
ru: Год ISO состоит из 52 или 53 полных недель, причем неделя начинается в понедельник и заканчивается в воскресенье. Первая неделя года по ISO — это первая (григорианская) календарная неделя года, содержащая четверг. Это называется неделя номер 1, и год ISO этого четверга совпадает с годом по григорианскому календарю.

source: For example, 2004 begins on a Thursday, so the first week of ISO year 2004 begins on Monday, 29 Dec 2003 and ends on Sunday, 4 Jan 2004::
ru: Например, 2004 год начинается в четверг, поэтому первая неделя 2004 года ISO начинается в понедельник, 29 декабря 2003 года, и заканчивается в воскресенье, 4 января 2004 года:

source: Result changed from a tuple to a :term:`named tuple`.
ru: Результат изменился с кортежа на кортеж с именем :term:`named`.

source: Return a string representing the date in ISO 8601 format, ``YYYY-MM-DD``::
ru: Возвращает строку, представляющую дату в формате ISO 8601, ``ГГГГ-ММ-ДД``::

source: For a date ``d``, ``str(d)`` is equivalent to ``d.isoformat()``.
ru: Для даты ``d`` ``str(d)`` эквивалентен ``d.isoformat()``.

source: Return a string representing the date::
ru: Возвращает строку, представляющую дату::

source: ``d.ctime()`` is equivalent to::
ru: ``d.ctime()`` эквивалентно::

source: on platforms where the native C :c:func:`ctime` function (which :func:`time.ctime` invokes, but which :meth:`date.ctime` does not invoke) conforms to the C standard.
ru: на платформах, где встроенная функция C :c:func:`ctime` (которая вызывается :func:`time.ctime`, но не вызывается :meth:`date.ctime`) соответствует стандарту C.

source: Return a string representing the date, controlled by an explicit format string. Format codes referring to hours, minutes or seconds will see 0 values. See also :ref:`strftime-strptime-behavior` and :meth:`date.isoformat`.
ru: Возвращает строку, представляющую дату, управляемую строкой явного формата. Коды формата, относящиеся к часам, минутам или секундам, будут иметь 0 значений. См. также :ref:`strftime-strptime-behavior` и :meth:`date.isoformat`.

source: Same as :meth:`.date.strftime`. This makes it possible to specify a format string for a :class:`.date` object in :ref:`formatted string literals <f-strings>` and when using :meth:`str.format`. See also :ref:`strftime-strptime-behavior` and :meth:`date.isoformat`.
ru: То же, что и :meth:`.date.strftime`. Это позволяет указать строку формата для объекта :class:`.date` в :ref:`форматированных строковых литералах <f-strings>` и при использовании :meth:`str.format`. См. также :ref:`strftime-strptime-behavior` и :meth:`date.isoformat`.

source: Examples of Usage: :class:`date`
ru: Примеры использования: :class:`date`

source: Example of counting days to an event::
ru: Пример подсчета дней до события:

source: More examples of working with :class:`date`:
ru: Еще примеры работы с :class:`date`:

source: :class:`.datetime` Objects
ru: Объекты :class:`.datetime`

source: A :class:`.datetime` object is a single object containing all the information from a :class:`date` object and a :class:`.time` object.
ru: Объект :class:`.datetime` — это отдельный объект, содержащий всю информацию из объекта :class:`date` и объекта :class:`.time`.

source: Like a :class:`date` object, :class:`.datetime` assumes the current Gregorian calendar extended in both directions; like a :class:`.time` object, :class:`.datetime` assumes there are exactly 3600\*24 seconds in every day.
ru: Подобно объекту :class:`date`, :class:`.datetime` предполагает, что текущий григорианский календарь расширен в обоих направлениях; как и объект :class:`.time`, :class:`.datetime` предполагает, что в каждом дне ровно 3600\*24 секунды.

source: Constructor:
ru: Конструктор:

source: The *year*, *month* and *day* arguments are required. *tzinfo* may be ``None``, or an instance of a :class:`tzinfo` subclass. The remaining arguments must be integers in the following ranges:
ru: Аргументы *год*, *месяц* и *день* являются обязательными. *tzinfo* может иметь значение None или быть экземпляром подкласса :class:`tzinfo`. Остальные аргументы должны быть целыми числами в следующих диапазонах:

source: Added the *fold* parameter.
ru: Добавлен параметр *fold*.

source: Return the current local date and time, with :attr:`.tzinfo` ``None``.
ru: Возвращает текущую местную дату и время с помощью :attr:`.tzinfo` ``None``.

source: Equivalent to::
ru: Эквивалентно::

source: See also :meth:`now`, :meth:`fromtimestamp`.
ru: См. также :meth:`now`, :meth:`fromtimestamp`.

source: This method is functionally equivalent to :meth:`now`, but without a ``tz`` parameter.
ru: Этот метод функционально эквивалентен :meth:`now`, но без параметра tz``.

source: Return the current local date and time.
ru: Возвращает текущую местную дату и время.

source: If optional argument *tz* is ``None`` or not specified, this is like :meth:`today`, but, if possible, supplies more precision than can be gotten from going through a :func:`time.time` timestamp (for example, this may be possible on platforms supplying the C :c:func:`gettimeofday` function).
ru: Если необязательный аргумент *tz* имеет значение ``None`` или не указан, это похоже на :meth:`today`, но, если возможно, обеспечивает большую точность, чем можно получить при использовании :func:`time.time` временная метка (например, это может быть возможно на платформах, поддерживающих функцию C :c:func:`gettimeofday`).

source: If *tz* is not ``None``, it must be an instance of a :class:`tzinfo` subclass, and the current date and time are converted to *tz*’s time zone.
ru: Если *tz* не ``None``, он должен быть экземпляром подкласса :class:`tzinfo`, а текущая дата и время преобразуются в часовой пояс *tz*.

source: This function is preferred over :meth:`today` and :meth:`utcnow`.
ru: Эта функция предпочтительнее :meth:`today` и :meth:`utcnow`.

source: Subsequent calls to :meth:`!datetime.now` may return the same instant depending on the precision of the underlying clock.
ru: Последующие вызовы :meth:`!datetime.now` могут возвращать тот же момент времени в зависимости от точности базовых часов.

source: Return the current UTC date and time, with :attr:`.tzinfo` ``None``.
ru: Возвращает текущую дату и время в формате UTC с помощью :attr:`.tzinfo` ``None``.

source: This is like :meth:`now`, but returns the current UTC date and time, as a naive :class:`.datetime` object. An aware current UTC datetime can be obtained by calling ``datetime.now(timezone.utc)``. See also :meth:`now`.
ru: Это похоже на :meth:`now`, но возвращает текущую дату и время в формате UTC как простой объект :class:`.datetime`. Текущую дату и время в формате UTC можно получить, вызвав ``datetime.now(timezone.utc)``. См. также :meth:`сейчас`.

source: Because naive ``datetime`` objects are treated by many ``datetime`` methods as local times, it is preferred to use aware datetimes to represent times in UTC. As such, the recommended way to create an object representing the current time in UTC is by calling ``datetime.now(timezone.utc)``.
ru: Поскольку наивные объекты datetime обрабатываются многими методами datetime как локальное время, для представления времени в формате UTC предпочтительнее использовать осведомленные объекты datetime. Таким образом, рекомендуемый способ создания объекта, представляющего текущее время в формате UTC, — это вызов ``datetime.now(timezone.utc)``.

source: Use :meth:`datetime.now` with :attr:`UTC` instead.
ru: Вместо этого используйте :meth:`datetime.now` с :attr:`UTC`.

source: Return the local date and time corresponding to the POSIX timestamp, such as is returned by :func:`time.time`. If optional argument *tz* is ``None`` or not specified, the timestamp is converted to the platform's local date and time, and the returned :class:`.datetime` object is naive.
ru: Возвращает локальную дату и время, соответствующие временной метке POSIX, например, возвращаемые :func:`time.time`. Если необязательный аргумент *tz* имеет значение ``None`` или не указан, временная метка преобразуется в локальную дату и время платформы, а возвращаемый объект :class:`.datetime` является наивным.

source: If *tz* is not ``None``, it must be an instance of a :class:`tzinfo` subclass, and the timestamp is converted to *tz*’s time zone.
ru: Если *tz* не ``None``, он должен быть экземпляром подкласса :class:`tzinfo`, а временная метка преобразуется в часовой пояс *tz*.

source: :meth:`fromtimestamp` may raise :exc:`OverflowError`, if the timestamp is out of the range of values supported by the platform C :c:func:`localtime` or :c:func:`gmtime` functions, and :exc:`OSError` on :c:func:`localtime` or :c:func:`gmtime` failure. It's common for this to be restricted to years in 1970 through 2038. Note that on non-POSIX systems that include leap seconds in their notion of a timestamp, leap seconds are ignored by :meth:`fromtimestamp`, and then it's possible to have two timestamps differing by a second that yield identical :class:`.datetime` objects. This method is preferred over :meth:`utcfromtimestamp`.
ru: :meth:`fromtimestamp` может вызвать :exc:`OverflowError`, если метка времени выходит за пределы диапазона значений, поддерживаемых функциями платформы C :c:func:`localtime` или :c:func:`gmtime`, и :exc:`OSError` при сбое :c:func:`localtime` или :c:func:`gmtime`. Обычно это ограничивается годами с 1970 по 2038 год. Обратите внимание, что в системах, отличных от POSIX, которые включают дополнительные секунды в понятие метки времени, дополнительные секунды игнорируются :meth:`fromtimestamp`, и тогда можно иметь две временные метки, отличающиеся на секунду, которые дают идентичные объекты :class:`.datetime`. Этот метод предпочтительнее :meth:`utcfromtimestamp`.

source: Raise :exc:`OverflowError` instead of :exc:`ValueError` if the timestamp is out of the range of values supported by the platform C :c:func:`localtime` or :c:func:`gmtime` functions. Raise :exc:`OSError` instead of :exc:`ValueError` on :c:func:`localtime` or :c:func:`gmtime` failure.
ru: Вызовите :exc:`OverflowError` вместо :exc:`ValueError`, если временная метка выходит за пределы диапазона значений, поддерживаемых функциями платформы C :c:func:`localtime` или :c:func:`gmtime`. Вызовите :exc:`OSError` вместо :exc:`ValueError` при сбое :c:func:`localtime` или :c:func:`gmtime`.

source: :meth:`fromtimestamp` may return instances with :attr:`.fold` set to 1.
ru: :meth:`fromtimestamp` может возвращать экземпляры с :attr:`.fold`, установленным в 1.

source: Return the UTC :class:`.datetime` corresponding to the POSIX timestamp, with :attr:`.tzinfo` ``None``. (The resulting object is naive.)
ru: Возвращает UTC :class:`.datetime`, соответствующий временной метке POSIX, с :attr:`.tzinfo` ``None``. (Полученный объект является наивным.)

source: This may raise :exc:`OverflowError`, if the timestamp is out of the range of values supported by the platform C :c:func:`gmtime` function, and :exc:`OSError` on :c:func:`gmtime` failure. It's common for this to be restricted to years in 1970 through 2038.
ru: Это может вызвать :exc:`OverflowError`, если временная метка выходит за пределы диапазона значений, поддерживаемых функцией платформы C :c:func:`gmtime`, и :exc:`OSError` в :c:func:`gmtime`. ` провал. Обычно это ограничивается годами с 1970 по 2038 год.

source: To get an aware :class:`.datetime` object, call :meth:`fromtimestamp`::
ru: Чтобы получить осведомленный объект :class:`.datetime`, вызовите :meth:`fromtimestamp`::

source: On the POSIX compliant platforms, it is equivalent to the following expression::
ru: На платформах, совместимых с POSIX, это эквивалентно следующему выражению:

source: except the latter formula always supports the full years range: between :const:`MINYEAR` and :const:`MAXYEAR` inclusive.
ru: за исключением того, что последняя формула всегда поддерживает полный диапазон лет: от :const:`MINYEAR` до :const:`MAXYEAR` включительно.

source: Because naive ``datetime`` objects are treated by many ``datetime`` methods as local times, it is preferred to use aware datetimes to represent times in UTC. As such, the recommended way to create an object representing a specific timestamp in UTC is by calling ``datetime.fromtimestamp(timestamp, tz=timezone.utc)``.
ru: Поскольку наивные объекты datetime обрабатываются многими методами datetime как локальное время, для представления времени в формате UTC предпочтительнее использовать осведомленные объекты datetime. Таким образом, рекомендуемый способ создания объекта, представляющего определенную временную метку в формате UTC, — это вызов ``datetime.fromtimestamp(timestamp, tz=timezone.utc)``.

source: Raise :exc:`OverflowError` instead of :exc:`ValueError` if the timestamp is out of the range of values supported by the platform C :c:func:`gmtime` function. Raise :exc:`OSError` instead of :exc:`ValueError` on :c:func:`gmtime` failure.
ru: Поднимите :exc:`OverflowError` вместо :exc:`ValueError`, если временная метка выходит за пределы диапазона значений, поддерживаемых функцией платформы C :c:func:`gmtime`. Вызовите :exc:`OSError` вместо :exc:`ValueError` при сбое :c:func:`gmtime`.

source: Use :meth:`datetime.fromtimestamp` with :attr:`UTC` instead.
ru: Вместо этого используйте :meth:`datetime.fromtimestamp` с :attr:`UTC`.

source: Return the :class:`.datetime` corresponding to the proleptic Gregorian ordinal, where January 1 of year 1 has ordinal 1. :exc:`ValueError` is raised unless ``1 <= ordinal <= datetime.max.toordinal()``. The hour, minute, second and microsecond of the result are all 0, and :attr:`.tzinfo` is ``None``.
ru: Возвращает :class:`.datetime`, соответствующий пролептическому григорианскому порядковому номеру, где 1 января года 1 имеет порядковый номер 1. :exc:`ValueError` возникает, если ``1 <= ordinal <= datetime.max.toordinal() ``. Час, минута, секунда и микросекунда результата равны 0, а :attr:`.tzinfo` имеет значение ``None``.
