Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/decimal.po
Languages: uk

source: Return the canonical encoding of the argument. Currently, the encoding of a :class:`Decimal` instance is always canonical, so this operation returns its argument unchanged.
uk: Повертає канонічне кодування аргументу. Наразі кодування екземпляра :class:`Decimal` завжди канонічне, тому ця операція повертає його аргумент без змін.

source: Compare the values of two Decimal instances. :meth:`compare` returns a Decimal instance, and if either operand is a NaN then the result is a NaN::
uk: Порівняйте значення двох екземплярів Decimal. :meth:`compare` повертає екземпляр Decimal, і якщо один із операндів є NaN, то результатом є NaN::

source: This operation is identical to the :meth:`compare` method, except that all NaNs signal. That is, if neither operand is a signaling NaN then any quiet NaN operand is treated as though it were a signaling NaN.
uk: Ця операція ідентична методу :meth:`compare`, за винятком того, що сигналізують усі NaN. Тобто, якщо жоден операнд не є сигнальним NaN, тоді будь-який тихий NaN операнд розглядається як сигнальний NaN.

source: Compare two operands using their abstract representation rather than their numerical value. Similar to the :meth:`compare` method, but the result gives a total ordering on :class:`Decimal` instances. Two :class:`Decimal` instances with the same numeric value but different representations compare unequal in this ordering:
uk: Порівняйте два операнди, використовуючи їх абстрактне представлення, а не числове значення. Подібно до методу :meth:`compare`, але результат дає загальне впорядкування екземплярів :class:`Decimal`. Два екземпляри :class:`Decimal` з однаковим числовим значенням, але різними представленнями порівнюються нерівномірно в такому порядку:

source: Quiet and signaling NaNs are also included in the total ordering. The result of this function is ``Decimal('0')`` if both operands have the same representation, ``Decimal('-1')`` if the first operand is lower in the total order than the second, and ``Decimal('1')`` if the first operand is higher in the total order than the second operand. See the specification for details of the total order.
uk: Безшумні та сигнальні NaN також включені в загальне замовлення. Результатом цієї функції є ``Decimal('0')``, якщо обидва операнди мають однакове представлення, ``Decimal('-1')``, якщо перший операнд є нижчим у загальному порядку, ніж другий, і ``Decimal('1')``, якщо перший операнд вищий у загальному порядку, ніж другий операнд. Дивіться специфікацію для детальної інформації про загальне замовлення.

source: This operation is unaffected by context and is quiet: no flags are changed and no rounding is performed. As an exception, the C version may raise InvalidOperation if the second operand cannot be converted exactly.
uk: Ця операція не залежить від контексту та є тихою: прапорці не змінюються та округлення не виконується. Як виняток, версія C може викликати InvalidOperation, якщо другий операнд не може бути точно перетворений.

source: Compare two operands using their abstract representation rather than their value as in :meth:`compare_total`, but ignoring the sign of each operand. ``x.compare_total_mag(y)`` is equivalent to ``x.copy_abs().compare_total(y.copy_abs())``.
uk: Порівняйте два операнди, використовуючи їх абстрактне представлення, а не значення, як у :meth:`compare_total`, але ігноруючи знак кожного операнда. ``x.compare_total_mag(y)`` еквівалентно ``x.copy_abs().compare_total(y.copy_abs())``.

source: Just returns self, this method is only to comply with the Decimal Specification.
uk: Просто повертає self, цей метод призначений лише для відповідності десятковій специфікації.

source: Return the absolute value of the argument. This operation is unaffected by the context and is quiet: no flags are changed and no rounding is performed.
uk: Повертає абсолютне значення аргументу. Ця операція не залежить від контексту та є тихою: прапорці не змінюються та округлення не виконується.

source: Return the negation of the argument. This operation is unaffected by the context and is quiet: no flags are changed and no rounding is performed.
uk: Повернути заперечення аргументу. Ця операція не залежить від контексту та є тихою: прапорці не змінюються та округлення не виконується.

source: Return a copy of the first operand with the sign set to be the same as the sign of the second operand. For example:
uk: Повертає копію першого операнда зі знаком, який збігається зі знаком другого операнда. Наприклад:

source: Return the value of the (natural) exponential function ``e**x`` at the given number. The result is correctly rounded using the :const:`ROUND_HALF_EVEN` rounding mode.
uk: Повертає значення (натуральної) експоненціальної функції ``e**x`` за заданим числом. Результат правильно округлюється за допомогою режиму округлення :const:`ROUND_HALF_EVEN`.

source: Note `Decimal.from_float(0.1)` is not the same as `Decimal('0.1')`. Since 0.1 is not exactly representable in binary floating point, the value is stored as the nearest representable value which is `0x1.999999999999ap-4`. That equivalent value in decimal is `0.1000000000000000055511151231257827021181583404541015625`.
uk: Примітка. `Decimal.from_float(0.1)` не те саме, що `Decimal('0.1')`. Оскільки 0,1 не можна точно представити у двійковій формі з плаваючою комою, значення зберігається як найближче значення, яке можна представити, яке є `0x1.999999999999ap-4`. Це еквівалентне значення в десятковій системі дорівнює `0,1000000000000000055511151231257827021181583404541015625`.

source: From Python 3.2 onwards, a :class:`Decimal` instance can also be constructed directly from a :class:`float`.
uk: Починаючи з Python 3.2 і далі, екземпляр :class:`Decimal` також можна створити безпосередньо з :class:`float`.

source: Fused multiply-add. Return self*other+third with no rounding of the intermediate product self*other.
uk: Злитий множення-додавання. Повертає self*other+third без округлення проміжного продукту self*other.

source: Return :const:`True` if the argument is canonical and :const:`False` otherwise. Currently, a :class:`Decimal` instance is always canonical, so this operation always returns :const:`True`.
uk: Повертає :const:`True`, якщо аргумент є канонічним, і :const:`False` в іншому випадку. Наразі екземпляр :class:`Decimal` завжди є канонічним, тому ця операція завжди повертає :const:`True`.

source: Return :const:`True` if the argument is a finite number, and :const:`False` if the argument is an infinity or a NaN.
uk: Повертає :const:`True`, якщо аргумент є скінченним числом, і :const:`False`, якщо аргументом є нескінченність або NaN.

source: Return :const:`True` if the argument is either positive or negative infinity and :const:`False` otherwise.
uk: Повертає :const:`True`, якщо аргумент є додатною або від’ємною нескінченністю, і :const:`False` в іншому випадку.

source: Return :const:`True` if the argument is a (quiet or signaling) NaN and :const:`False` otherwise.
uk: Повертає :const:`True`, якщо аргумент є (тихим або сигнальним) NaN, і :const:`False` в іншому випадку.

source: Return :const:`True` if the argument is a *normal* finite number. Return :const:`False` if the argument is zero, subnormal, infinite or a NaN.
uk: Повертає :const:`True`, якщо аргумент є *звичайним* кінцевим числом. Повертає :const:`False`, якщо аргумент нульовий, субнормальний, нескінченний або NaN.

source: Return :const:`True` if the argument is a quiet NaN, and :const:`False` otherwise.
uk: Повертає :const:`True`, якщо аргумент є тихим NaN, і :const:`False` в іншому випадку.

source: Return :const:`True` if the argument has a negative sign and :const:`False` otherwise. Note that zeros and NaNs can both carry signs.
uk: Повертає :const:`True`, якщо аргумент має негативний знак, і :const:`False` в іншому випадку. Зауважте, що і нулі, і NaN можуть мати знаки.

source: Return :const:`True` if the argument is a signaling NaN and :const:`False` otherwise.
uk: Повертає :const:`True`, якщо аргумент є сигнальним NaN, і :const:`False` в іншому випадку.

source: Return :const:`True` if the argument is subnormal, and :const:`False` otherwise.
uk: Повертає :const:`True`, якщо аргумент ненормальний, і :const:`False` в іншому випадку.

source: Return :const:`True` if the argument is a (positive or negative) zero and :const:`False` otherwise.
uk: Повертає :const:`True`, якщо аргумент є (позитивним або від’ємним) нулем, і :const:`False` в іншому випадку.

source: Return the natural (base e) logarithm of the operand. The result is correctly rounded using the :const:`ROUND_HALF_EVEN` rounding mode.
uk: Повертає натуральний (за основою e) логарифм операнда. Результат правильно округлюється за допомогою режиму округлення :const:`ROUND_HALF_EVEN`.

source: Return the base ten logarithm of the operand. The result is correctly rounded using the :const:`ROUND_HALF_EVEN` rounding mode.
uk: Повертає десятий логарифм операнда. Результат правильно округлюється за допомогою режиму округлення :const:`ROUND_HALF_EVEN`.

source: For a nonzero number, return the adjusted exponent of its operand as a :class:`Decimal` instance. If the operand is a zero then ``Decimal('-Infinity')`` is returned and the :const:`DivisionByZero` flag is raised. If the operand is an infinity then ``Decimal('Infinity')`` is returned.
uk: Для відмінного від нуля числа поверніть скоригований експонент його операнда як екземпляр :class:`Decimal`. Якщо операнд дорівнює нулю, повертається ``Decimal('-Infinity')`` і піднімається прапор :const:`DivisionByZero`. Якщо операнд є нескінченністю, тоді повертається ``Decimal('Infinity')``.

source: :meth:`logical_and` is a logical operation which takes two *logical operands* (see :ref:`logical_operands_label`). The result is the digit-wise ``and`` of the two operands.
uk: :meth:`logical_and` — це логічна операція, яка приймає два *логічних операнда* (див. :ref:`logical_operands_label`). Результатом є порозрядне ``і`` двох операндів.

source: :meth:`logical_invert` is a logical operation. The result is the digit-wise inversion of the operand.
uk: :meth:`logical_invert` є логічною операцією. Результатом є порозрядна інверсія операнда.

source: :meth:`logical_or` is a logical operation which takes two *logical operands* (see :ref:`logical_operands_label`). The result is the digit-wise ``or`` of the two operands.
uk: :meth:`logical_or` — це логічна операція, яка приймає два *логічних операнда* (див. :ref:`logical_operands_label`). Результатом є порозрядне "або" двох операндів.

source: :meth:`logical_xor` is a logical operation which takes two *logical operands* (see :ref:`logical_operands_label`). The result is the digit-wise exclusive or of the two operands.
uk: :meth:`logical_xor` — це логічна операція, яка приймає два *логічних операнда* (див. :ref:`logical_operands_label`). Результатом є розрядний виключний або двох операндів.

source: Like ``max(self, other)`` except that the context rounding rule is applied before returning and that :const:`NaN` values are either signaled or ignored (depending on the context and whether they are signaling or quiet).
uk: Подібно до ``max(self, other)``, за винятком того, що правило округлення контексту застосовується перед поверненням і що значення :const:`NaN` або сигналізуються, або ігноруються (залежно від контексту та того, чи є вони сигнальними чи тихими).

source: Similar to the :meth:`.max` method, but the comparison is done using the absolute values of the operands.
uk: Подібно до методу :meth:`.max`, але порівняння виконується з використанням абсолютних значень операндів.

source: Like ``min(self, other)`` except that the context rounding rule is applied before returning and that :const:`NaN` values are either signaled or ignored (depending on the context and whether they are signaling or quiet).
uk: Подібно до ``min(self, other)``, за винятком того, що правило округлення контексту застосовується перед поверненням і що значення :const:`NaN` або сигналізуються, або ігноруються (залежно від контексту та того, чи є вони сигнальними чи тихими).

source: Similar to the :meth:`.min` method, but the comparison is done using the absolute values of the operands.
uk: Подібно до методу :meth:`.min`, але порівняння виконується з використанням абсолютних значень операндів.

source: Return the largest number representable in the given context (or in the current thread's context if no context is given) that is smaller than the given operand.
uk: Повертає найбільше число, яке можна представити в заданому контексті (або в контексті поточного потоку, якщо контекст не задано), яке є меншим за заданий операнд.

source: Return the smallest number representable in the given context (or in the current thread's context if no context is given) that is larger than the given operand.
uk: Повертає найменше число, яке можна представити в заданому контексті (або в контексті поточного потоку, якщо контекст не задано), яке більше заданого операнда.

source: If the two operands are unequal, return the number closest to the first operand in the direction of the second operand. If both operands are numerically equal, return a copy of the first operand with the sign set to be the same as the sign of the second operand.
uk: Якщо два операнди нерівні, поверніть число, найближче до першого операнду в напрямку другого операнда. Якщо обидва операнди чисельно рівні, поверніть копію першого операнда зі знаком, встановленим таким самим, як знак другого операнда.

source: Normalize the number by stripping the rightmost trailing zeros and converting any result equal to :const:`Decimal('0')` to :const:`Decimal('0e0')`. Used for producing canonical values for attributes of an equivalence class. For example, ``Decimal('32.100')`` and ``Decimal('0.321000e+2')`` both normalize to the equivalent value ``Decimal('32.1')``.
uk: Нормалізуйте число, видаливши крайні праві кінцеві нулі та перетворивши будь-який результат, рівний :const:`Decimal('0')` на :const:`Decimal('0e0')`. Використовується для отримання канонічних значень для атрибутів класу еквівалентності. Наприклад, ``Decimal('32.100')`` і ``Decimal('0.321000e+2')`` нормалізуються до еквівалентного значення ``Decimal('32.1')``.

source: Return a string describing the *class* of the operand. The returned value is one of the following ten strings.
uk: Повертає рядок, що описує *клас* операнда. Повернене значення є одним із наступних десяти рядків.

source: ``"-Infinity"``, indicating that the operand is negative infinity.
uk: ``"-Infinity"``, що вказує, що операнд є негативною нескінченністю.

source: ``"-Normal"``, indicating that the operand is a negative normal number.
uk: ``"-Normal"``, вказуючи, що операнд є від’ємним нормальним числом.

source: ``"-Subnormal"``, indicating that the operand is negative and subnormal.
uk: ``"-Subnormal"``, що вказує на те, що операнд від'ємний і ненормальний.

source: ``"-Zero"``, indicating that the operand is a negative zero.
uk: ``"-Zero"``, вказуючи, що операнд є від’ємним нулем.

source: ``"+Zero"``, indicating that the operand is a positive zero.
uk: ``"+Zero"``, вказуючи, що операнд є позитивним нулем.

source: ``"+Subnormal"``, indicating that the operand is positive and subnormal.
uk: ``"+Subnormal"``, що вказує, що операнд є додатним і субнормальним.

source: ``"+Normal"``, indicating that the operand is a positive normal number.
uk: ``"+Normal"``, вказуючи, що операнд є додатним нормальним числом.

source: ``"+Infinity"``, indicating that the operand is positive infinity.
uk: ``"+Infinity"``, що вказує, що операнд є позитивною нескінченністю.

source: ``"NaN"``, indicating that the operand is a quiet NaN (Not a Number).
uk: ``"NaN"``, вказуючи, що операнд є тихим NaN (не числом).

source: ``"sNaN"``, indicating that the operand is a signaling NaN.
uk: ``"sNaN"``, вказуючи, що операнд є сигнальним NaN.

source: Return a value equal to the first operand after rounding and having the exponent of the second operand.
uk: Повертає значення, що дорівнює першому операнду після округлення та має експоненту другого операнда.

source: Unlike other operations, if the length of the coefficient after the quantize operation would be greater than precision, then an :const:`InvalidOperation` is signaled. This guarantees that, unless there is an error condition, the quantized exponent is always equal to that of the right-hand operand.
uk: На відміну від інших операцій, якщо довжина коефіцієнта після операції квантування буде більшою за точність, тоді сигналізується :const:`InvalidOperation`. Це гарантує, що, якщо немає умови помилки, квантований показник степеня завжди дорівнює показнику правого операнда.

source: Also unlike other operations, quantize never signals Underflow, even if the result is subnormal and inexact.
uk: Крім того, на відміну від інших операцій, квантування ніколи не сигналізує про переповнення, навіть якщо результат ненормальний і неточний.

source: If the exponent of the second operand is larger than that of the first then rounding may be necessary. In this case, the rounding mode is determined by the ``rounding`` argument if given, else by the given ``context`` argument; if neither argument is given the rounding mode of the current thread's context is used.
uk: Якщо експонента другого операнда більша, ніж експонента першого, може знадобитися округлення. У цьому випадку режим округлення визначається аргументом ``округлення``, якщо задано, інакше заданим аргументом ``контексту``; якщо жоден аргумент не задано, використовується режим округлення контексту поточного потоку.

source: An error is returned whenever the resulting exponent is greater than :attr:`Emax` or less than :attr:`Etiny`.
uk: Помилка повертається щоразу, коли кінцевий показник степеня більший за :attr:`Emax` або менший за :attr:`Etiny`.

source: Return ``Decimal(10)``, the radix (base) in which the :class:`Decimal` class does all its arithmetic. Included for compatibility with the specification.
uk: Повертає ``Decimal(10)``, основу (базу), у якій клас :class:`Decimal` виконує всю свою арифметику. Включено для сумісності зі специфікацією.

source: Return the remainder from dividing *self* by *other*. This differs from ``self % other`` in that the sign of the remainder is chosen so as to minimize its absolute value. More precisely, the return value is ``self - n * other`` where ``n`` is the integer nearest to the exact value of ``self / other``, and if two integers are equally near then the even one is chosen.
uk: Повертає залишок від ділення *self* на *other*. Це відрізняється від ``self % other`` тим, що знак залишку вибрано таким чином, щоб мінімізувати його абсолютне значення. Точніше, повертається значення ``self - n * other``, де ``n`` є цілим числом, найближчим до точного значення ``self / other``, і якщо два цілі числа однаково близькі, то парне вибрано.

source: If the result is zero then its sign will be the sign of *self*.
uk: Якщо результат дорівнює нулю, то його знак буде знаком *self*.

source: Return the result of rotating the digits of the first operand by an amount specified by the second operand. The second operand must be an integer in the range -precision through precision. The absolute value of the second operand gives the number of places to rotate. If the second operand is positive then rotation is to the left; otherwise rotation is to the right. The coefficient of the first operand is padded on the left with zeros to length precision if necessary. The sign and exponent of the first operand are unchanged.
uk: Повертає результат повороту цифр першого операнда на величину, визначену другим операндом. Другий операнд має бути цілим числом у діапазоні від точності до точності. Абсолютне значення другого операнда дає кількість місць для обертання. Якщо другий операнд додатний, то обертання відбувається вліво; інакше обертання праворуч. Коефіцієнт першого операнда доповнюється зліва нулями з точністю до довжини, якщо необхідно. Знак і експонента першого операнда не змінюються.

source: Test whether self and other have the same exponent or whether both are :const:`NaN`.
uk: Перевірте, чи self та other мають однаковий показник чи обидва є :const:`NaN`.

source: Return the first operand with exponent adjusted by the second. Equivalently, return the first operand multiplied by ``10**other``. The second operand must be an integer.
uk: Повертає перший операнд з експонентою, скоригованою другим. Аналогічно повертає перший операнд, помножений на ``10**other``. Другий операнд має бути цілим числом.

source: Return the result of shifting the digits of the first operand by an amount specified by the second operand. The second operand must be an integer in the range -precision through precision. The absolute value of the second operand gives the number of places to shift. If the second operand is positive then the shift is to the left; otherwise the shift is to the right. Digits shifted into the coefficient are zeros. The sign and exponent of the first operand are unchanged.
uk: Повертає результат зсуву цифр першого операнда на величину, визначену другим операндом. Другий операнд має бути цілим числом у діапазоні від точності до точності. Абсолютне значення другого операнда дає кількість місць для зсуву. Якщо другий операнд позитивний, то зсув виконується вліво; інакше зсув відбувається вправо. Цифри, зсунуті в коефіцієнт, є нулями. Знак і експонента першого операнда не змінюються.

source: Return the square root of the argument to full precision.
uk: Повертає квадратний корінь аргументу з повною точністю.

source: Convert to a string, using engineering notation if an exponent is needed.
uk: Перетворіть на рядок, використовуючи технічну нотацію, якщо потрібен експонент.

source: Engineering notation has an exponent which is a multiple of 3. This can leave up to 3 digits to the left of the decimal place and may require the addition of either one or two trailing zeros.
uk: Інженерна нотація має експоненту, кратну 3. Це може залишати до 3 цифр ліворуч від десяткового знака та може потребувати додавання одного або двох нулів у кінці.

source: For example, this converts ``Decimal('123E+1')`` to ``Decimal('1.23E+3')``.
uk: Наприклад, це перетворює ``Decimal('123E+1')`` на ``Decimal('1.23E+3')``.

source: Identical to the :meth:`to_integral_value` method. The ``to_integral`` name has been kept for compatibility with older versions.
uk: Ідентичний методу :meth:`to_integral_value`. Ім'я ``to_integral`` було збережено для сумісності зі старими версіями.

source: Round to the nearest integer, signaling :const:`Inexact` or :const:`Rounded` as appropriate if rounding occurs. The rounding mode is determined by the ``rounding`` parameter if given, else by the given ``context``. If neither parameter is given then the rounding mode of the current context is used.
uk: Округлити до найближчого цілого числа, сигналізуючи :const:`Inexact` або :const:`Rounded` відповідно, якщо відбувається округлення. Режим округлення визначається параметром ``rounding``, якщо він заданий, інакше заданим ``context``. Якщо жоден параметр не вказано, використовується режим округлення поточного контексту.

source: Round to the nearest integer without signaling :const:`Inexact` or :const:`Rounded`. If given, applies *rounding*; otherwise, uses the rounding method in either the supplied *context* or the current context.
uk: Округлення до найближчого цілого без сигналізації :const:`Inexact` або :const:`Rounded`. Якщо вказано, застосовує *округлення*; інакше використовує метод округлення або в наданому *контексті*, або в поточному контексті.

source: Logical operands
uk: Логічні операнди
