Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/decimal.po
Languages: uk

source: The :meth:`logical_and`, :meth:`logical_invert`, :meth:`logical_or`, and :meth:`logical_xor` methods expect their arguments to be *logical operands*. A *logical operand* is a :class:`Decimal` instance whose exponent and sign are both zero, and whose digits are all either :const:`0` or :const:`1`.
uk: Методи :meth:`logical_and`, :meth:`logical_invert`, :meth:`logical_or` і :meth:`logical_xor` очікують, що їхні аргументи будуть *логічними операндами*. *Логічний операнд* — це екземпляр :class:`Decimal`, експонента та знак якого дорівнюють нулю, а всі цифри — :const:`0` або :const:`1`.

source: Context objects
uk: Об'єкти контексту

source: Contexts are environments for arithmetic operations. They govern precision, set rules for rounding, determine which signals are treated as exceptions, and limit the range for exponents.
uk: Контексти - це середовища для арифметичних операцій. Вони керують точністю, встановлюють правила округлення, визначають, які сигнали розглядаються як винятки, і обмежують діапазон для експонент.

source: Each thread has its own current context which is accessed or changed using the :func:`getcontext` and :func:`setcontext` functions:
uk: Кожен потік має власний поточний контекст, до якого можна отримати доступ або змінити його за допомогою функцій :func:`getcontext` і :func:`setcontext`:

source: Return the current context for the active thread.
uk: Повертає поточний контекст для активного потоку.

source: Set the current context for the active thread to *c*.
uk: Установіть поточний контекст для активного потоку на *c*.

source: You can also use the :keyword:`with` statement and the :func:`localcontext` function to temporarily change the active context.
uk: Ви також можете використовувати оператор :keyword:`with` і функцію :func:`localcontext`, щоб тимчасово змінити активний контекст.

source: Return a context manager that will set the current context for the active thread to a copy of *ctx* on entry to the with-statement and restore the previous context when exiting the with-statement. If no context is specified, a copy of the current context is used.
uk: Повернути менеджер контексту, який встановить поточний контекст для активного потоку на копію *ctx* під час входу в оператор with і відновить попередній контекст під час виходу з оператора with. Якщо контекст не вказано, використовується копія поточного контексту.

source: For example, the following code sets the current decimal precision to 42 places, performs a calculation, and then automatically restores the previous context::
uk: Наприклад, наступний код встановлює поточну десяткову точність на 42 знаки, виконує обчислення, а потім автоматично відновлює попередній контекст::

source: New contexts can also be created using the :class:`Context` constructor described below. In addition, the module provides three pre-made contexts:
uk: Нові контексти також можна створити за допомогою конструктора :class:`Context`, описаного нижче. Крім того, модуль надає три готові контексти:

source: This is a standard context defined by the General Decimal Arithmetic Specification. Precision is set to nine. Rounding is set to :const:`ROUND_HALF_UP`. All flags are cleared. All traps are enabled (treated as exceptions) except :const:`Inexact`, :const:`Rounded`, and :const:`Subnormal`.
uk: Це стандартний контекст, визначений Загальною специфікацією десяткової арифметики. Точність встановлена на дев'ять. Округлення встановлено на :const:`ROUND_HALF_UP`. Усі прапори видалено. Усі перехоплення ввімкнено (розглядаються як винятки), крім :const:`Inexact`, :const:`Rounded` і :const:`Subnormal`.

source: Because many of the traps are enabled, this context is useful for debugging.
uk: Оскільки багато пасток увімкнено, цей контекст корисний для налагодження.

source: This is a standard context defined by the General Decimal Arithmetic Specification. Precision is set to nine. Rounding is set to :const:`ROUND_HALF_EVEN`. All flags are cleared. No traps are enabled (so that exceptions are not raised during computations).
uk: Це стандартний контекст, визначений Загальною специфікацією десяткової арифметики. Точність встановлена на дев'ять. Округлення встановлено на :const:`ROUND_HALF_EVEN`. Усі прапори видалено. Перехоплення не ввімкнено (щоб винятки не виникали під час обчислень).

source: Because the traps are disabled, this context is useful for applications that prefer to have result value of :const:`NaN` or :const:`Infinity` instead of raising exceptions. This allows an application to complete a run in the presence of conditions that would otherwise halt the program.
uk: Оскільки перехоплення вимкнено, цей контекст корисний для програм, які віддають перевагу отриманню значення результату :const:`NaN` або :const:`Infinity` замість виклику винятків. Це дозволяє програмі завершити виконання за наявності умов, які в іншому випадку зупинили б програму.

source: This context is used by the :class:`Context` constructor as a prototype for new contexts. Changing a field (such a precision) has the effect of changing the default for new contexts created by the :class:`Context` constructor.
uk: Цей контекст використовується конструктором :class:`Context` як прототип для нових контекстів. Зміна поля (така точність) призводить до зміни типового значення для нових контекстів, створених конструктором :class:`Context`.

source: This context is most useful in multi-threaded environments. Changing one of the fields before threads are started has the effect of setting system-wide defaults. Changing the fields after threads have started is not recommended as it would require thread synchronization to prevent race conditions.
uk: Цей контекст найбільш корисний у багатопоточних середовищах. Зміна одного з полів перед запуском потоків призводить до встановлення загальносистемних значень за замовчуванням. Змінювати поля після початку потоків не рекомендується, оскільки це потребуватиме синхронізації потоків, щоб запобігти конкуренції.

source: In single threaded environments, it is preferable to not use this context at all. Instead, simply create contexts explicitly as described below.
uk: В однопотокових середовищах краще взагалі не використовувати цей контекст. Натомість просто створіть контексти явно, як описано нижче.

source: The default values are :attr:`prec`\ =\ :const:`28`, :attr:`rounding`\ =\ :const:`ROUND_HALF_EVEN`, and enabled traps for :class:`Overflow`, :class:`InvalidOperation`, and :class:`DivisionByZero`.
uk: Значення за замовчуванням: :attr:`prec`\ =\ :const:`28`, :attr:`rounding`\ =\ :const:`ROUND_HALF_EVEN`, і ввімкнені пастки для :class:`Overflow`, :class:`InvalidOperation` і :class:`DivisionByZero`.

source: In addition to the three supplied contexts, new contexts can be created with the :class:`Context` constructor.
uk: На додаток до трьох наданих контекстів, нові контексти можна створювати за допомогою конструктора :class:`Context`.

source: Creates a new context. If a field is not specified or is :const:`None`, the default values are copied from the :const:`DefaultContext`. If the *flags* field is not specified or is :const:`None`, all flags are cleared.
uk: Створює новий контекст. Якщо поле не вказано або має значення :const:`None`, значення за замовчуванням копіюються з :const:`DefaultContext`. Якщо поле *flags* не вказано або має значення :const:`None`, усі прапорці скидаються.

source: *prec* is an integer in the range [:const:`1`, :const:`MAX_PREC`] that sets the precision for arithmetic operations in the context.
uk: *prec* — це ціле число в діапазоні [:const:`1`, :const:`MAX_PREC`], яке встановлює точність для арифметичних операцій у контексті.

source: The *rounding* option is one of the constants listed in the section `Rounding Modes`_.
uk: Опція *округлення* є однією з констант, перелічених у розділі `Режими округлення`_.

source: The *traps* and *flags* fields list any signals to be set. Generally, new contexts should only set traps and leave the flags clear.
uk: У полях *traps* і *flags* перелічено всі сигнали, які потрібно встановити. Загалом, нові контексти мають лише встановлювати пастки та залишати прапорці вільними.

source: The *Emin* and *Emax* fields are integers specifying the outer limits allowable for exponents. *Emin* must be in the range [:const:`MIN_EMIN`, :const:`0`], *Emax* in the range [:const:`0`, :const:`MAX_EMAX`].
uk: Поля *Emin* і *Emax* є цілими числами, що вказують зовнішні межі, допустимі для експонент. *Emin* має бути в діапазоні [:const:`MIN_EMIN`, :const:`0`], *Emax* в діапазоні [:const:`0`, :const:`MAX_EMAX`].

source: The *capitals* field is either :const:`0` or :const:`1` (the default). If set to :const:`1`, exponents are printed with a capital :const:`E`; otherwise, a lowercase :const:`e` is used: :const:`Decimal('6.02e+23')`.
uk: Поле *capitals* має значення :const:`0` або :const:`1` (за замовчуванням). Якщо встановлено значення :const:`1`, показники степеня друкуються з великої літери :const:`E`; інакше :const:`e` використовується в нижньому регістрі: :const:`Decimal('6.02e+23')`.

source: The *clamp* field is either :const:`0` (the default) or :const:`1`. If set to :const:`1`, the exponent ``e`` of a :class:`Decimal` instance representable in this context is strictly limited to the range ``Emin - prec + 1 <= e <= Emax - prec + 1``. If *clamp* is :const:`0` then a weaker condition holds: the adjusted exponent of the :class:`Decimal` instance is at most ``Emax``. When *clamp* is :const:`1`, a large normal number will, where possible, have its exponent reduced and a corresponding number of zeros added to its coefficient, in order to fit the exponent constraints; this preserves the value of the number but loses information about significant trailing zeros. For example::
uk: Поле *clamp* має значення :const:`0` (за замовчуванням) або :const:`1`. Якщо встановлено значення :const:`1`, експонента ``e`` екземпляра :class:`Decimal`, який можна представити в цьому контексті, суворо обмежена діапазоном ``Emin - prec + 1 <= e <= Emax - prec + 1``. Якщо *clamp* дорівнює :const:`0`, тоді виконується слабша умова: скоригований експонент екземпляра :class:`Decimal` не перевищує ``Emax``. Коли *clamp* дорівнює :const:`1`, експонента великого нормального числа буде, де це можливо, зменшена, а до його коефіцієнта додано відповідну кількість нулів, щоб відповідати обмеженням експоненти; це зберігає значення числа, але втрачає інформацію про значні кінцеві нулі. Наприклад::

source: A *clamp* value of :const:`1` allows compatibility with the fixed-width decimal interchange formats specified in IEEE 754.
uk: Значення *clamp* :const:`1` забезпечує сумісність із десятковими форматами обміну фіксованою шириною, визначеними в IEEE 754.

source: The :class:`Context` class defines several general purpose methods as well as a large number of methods for doing arithmetic directly in a given context. In addition, for each of the :class:`Decimal` methods described above (with the exception of the :meth:`adjusted` and :meth:`as_tuple` methods) there is a corresponding :class:`Context` method. For example, for a :class:`Context` instance ``C`` and :class:`Decimal` instance ``x``, ``C.exp(x)`` is equivalent to ``x.exp(context=C)``. Each :class:`Context` method accepts a Python integer (an instance of :class:`int`) anywhere that a Decimal instance is accepted.
uk: Клас :class:`Context` визначає кілька методів загального призначення, а також велику кількість методів для виконання арифметики безпосередньо в заданому контексті. Крім того, для кожного з описаних вище методів :class:`Decimal` (за винятком методів :meth:`adjusted` і :meth:`as_tuple`) існує відповідний метод :class:`Context`. Наприклад, для екземпляра :class:`Context` ``C`` і :class:`Decimal` примірника ``x``, ``C.exp(x)`` еквівалентний ``x.exp( context=C)``. Кожен метод :class:`Context` приймає ціле число Python (екземпляр :class:`int`) будь-де, де приймається примірник Decimal.

source: Resets all of the flags to :const:`0`.
uk: Скидає всі прапорці на :const:`0`.

source: Resets all of the traps to :const:`0`.
uk: Скидає всі пастки до :const:`0`.

source: Return a duplicate of the context.
uk: Повернути дублікат контексту.

source: Return a copy of the Decimal instance num.
uk: Повернути копію екземпляра Decimal num.

source: Creates a new Decimal instance from *num* but using *self* as context. Unlike the :class:`Decimal` constructor, the context precision, rounding method, flags, and traps are applied to the conversion.
uk: Створює новий екземпляр Decimal з *num*, але використовуючи *self* як контекст. На відміну від конструктора :class:`Decimal`, до перетворення застосовуються точність контексту, метод округлення, прапорці та перехоплення.

source: This is useful because constants are often given to a greater precision than is needed by the application. Another benefit is that rounding immediately eliminates unintended effects from digits beyond the current precision. In the following example, using unrounded inputs means that adding zero to a sum can change the result:
uk: Це корисно, оскільки константи часто надаються з більшою точністю, ніж це потрібно програмі. Ще одна перевага полягає в тому, що округлення негайно усуває ненавмисні ефекти від цифр, що перевищують поточну точність. У наступному прикладі використання неокруглених вхідних даних означає, що додавання нуля до суми може змінити результат:

source: This method implements the to-number operation of the IBM specification. If the argument is a string, no leading or trailing whitespace or underscores are permitted.
uk: Цей метод реалізує операцію до числа специфікації IBM. Якщо аргумент є рядком, пробіли чи підкреслення на початку або в кінці не допускаються.

source: Creates a new Decimal instance from a float *f* but rounding using *self* as the context. Unlike the :meth:`Decimal.from_float` class method, the context precision, rounding method, flags, and traps are applied to the conversion.
uk: Створює новий екземпляр Decimal із числа з плаваючою точкою *f*, але округляючи, використовуючи *self* як контекст. На відміну від методу класу :meth:`Decimal.from_float`, до перетворення застосовуються точність контексту, метод округлення, прапорці та перехоплення.

source: Returns a value equal to ``Emin - prec + 1`` which is the minimum exponent value for subnormal results. When underflow occurs, the exponent is set to :const:`Etiny`.
uk: Повертає значення, що дорівнює ``Emin - prec + 1``, що є мінімальним значенням експоненти для субнормальних результатів. Коли відбувається переповнення, експонента встановлюється на :const:`Etiny`.

source: Returns a value equal to ``Emax - prec + 1``.
uk: Повертає значення, рівне ``Emax - prec + 1``.

source: The usual approach to working with decimals is to create :class:`Decimal` instances and then apply arithmetic operations which take place within the current context for the active thread. An alternative approach is to use context methods for calculating within a specific context. The methods are similar to those for the :class:`Decimal` class and are only briefly recounted here.
uk: Звичайним підходом до роботи з десятковими числами є створення :class:`Decimal` екземплярів, а потім застосування арифметичних операцій, які виконуються в поточному контексті для активного потоку. Альтернативним підходом є використання контекстних методів для обчислення в конкретному контексті. Методи подібні до методів класу :class:`Decimal` і тут лише коротко перераховані.

source: Returns the absolute value of *x*.
uk: Повертає абсолютне значення *x*.

source: Return the sum of *x* and *y*.
uk: Повертає суму *x* і *y*.

source: Returns the same Decimal object *x*.
uk: Повертає той самий об’єкт Decimal *x*.

source: Compares *x* and *y* numerically.
uk: Чисельно порівнює *x* і *y*.

source: Compares the values of the two operands numerically.
uk: Чисельно порівнює значення двох операндів.

source: Compares two operands using their abstract representation.
uk: Порівнює два операнди, використовуючи їх абстрактне представлення.

source: Compares two operands using their abstract representation, ignoring sign.
uk: Порівнює два операнди, використовуючи їх абстрактне представлення, ігноруючи знак.

source: Returns a copy of *x* with the sign set to 0.
uk: Повертає копію *x* зі знаком 0.

source: Returns a copy of *x* with the sign inverted.
uk: Повертає копію *x* з перевернутим знаком.

source: Copies the sign from *y* to *x*.
uk: Копіює знак з *y* на *x*.

source: Return *x* divided by *y*.
uk: Повертає *x*, поділене на *y*.

source: Return *x* divided by *y*, truncated to an integer.
uk: Повертає *x*, поділене на *y*, усічене до цілого числа.

source: Divides two numbers and returns the integer part of the result.
uk: Ділить два числа та повертає цілу частину результату.

source: Returns `e ** x`.
uk: Повертає `e ** x`.

source: Returns *x* multiplied by *y*, plus *z*.
uk: Повертає *x*, помножене на *y*, плюс *z*.

source: Returns ``True`` if *x* is canonical; otherwise returns ``False``.
uk: Повертає ``True``, якщо *x* канонічний; інакше повертає ``False``.

source: Returns ``True`` if *x* is finite; otherwise returns ``False``.
uk: Повертає ``True``, якщо *x* є кінцевим; інакше повертає ``False``.

source: Returns ``True`` if *x* is infinite; otherwise returns ``False``.
uk: Повертає ``True``, якщо *x* є нескінченним; інакше повертає ``False``.

source: Returns ``True`` if *x* is a qNaN or sNaN; otherwise returns ``False``.
uk: Повертає ``True``, якщо *x* є qNaN або sNaN; інакше повертає ``False``.

source: Returns ``True`` if *x* is a normal number; otherwise returns ``False``.
uk: Повертає ``True``, якщо *x* є нормальним числом; інакше повертає ``False``.

source: Returns ``True`` if *x* is a quiet NaN; otherwise returns ``False``.
uk: Повертає ``True``, якщо *x* є тихим NaN; інакше повертає ``False``.

source: Returns ``True`` if *x* is negative; otherwise returns ``False``.
uk: Повертає ``True``, якщо *x* від'ємне; інакше повертає ``False``.

source: Returns ``True`` if *x* is a signaling NaN; otherwise returns ``False``.
uk: Повертає ``True``, якщо *x* є сигнальним NaN; інакше повертає ``False``.

source: Returns ``True`` if *x* is subnormal; otherwise returns ``False``.
uk: Повертає ``True``, якщо *x* є субнормальним; інакше повертає ``False``.

source: Returns ``True`` if *x* is a zero; otherwise returns ``False``.
uk: Повертає ``True``, якщо *x* дорівнює нулю; інакше повертає ``False``.

source: Returns the natural (base e) logarithm of *x*.
uk: Повертає натуральний (за основою e) логарифм *x*.

source: Returns the base 10 logarithm of *x*.
uk: Повертає логарифм *x* за основою 10.

source: Returns the exponent of the magnitude of the operand's MSD.
uk: Повертає експоненту величини MSD операнда.

source: Applies the logical operation *and* between each operand's digits.
uk: Застосовує логічну операцію *і* між цифрами кожного операнда.

source: Invert all the digits in *x*.
uk: Інвертуйте всі цифри в *x*.

source: Applies the logical operation *or* between each operand's digits.
uk: Застосовує логічну операцію *або* між цифрами кожного операнда.

source: Applies the logical operation *xor* between each operand's digits.
uk: Застосовує логічну операцію *xor* між цифрами кожного операнда.

source: Compares two values numerically and returns the maximum.
uk: Чисельно порівнює два значення та повертає максимальне значення.

source: Compares the values numerically with their sign ignored.
uk: Числово порівнює значення без урахування знака.

source: Compares two values numerically and returns the minimum.
uk: Чисельно порівнює два значення та повертає мінімум.

source: Minus corresponds to the unary prefix minus operator in Python.
uk: Мінус відповідає унарному префіксному оператору мінус у Python.

source: Return the product of *x* and *y*.
uk: Поверніть добуток *x* і *y*.

source: Returns the largest representable number smaller than *x*.
uk: Повертає найбільше представлене число, менше за *x*.

source: Returns the smallest representable number larger than *x*.
uk: Повертає найменше число, яке можна представити, більше за *x*.

source: Returns the number closest to *x*, in direction towards *y*.
uk: Повертає число, найближче до *x*, у напрямку до *y*.

source: Reduces *x* to its simplest form.
uk: Зводить *x* до найпростішої форми.

source: Returns an indication of the class of *x*.
uk: Повертає вказівник класу *x*.

source: Plus corresponds to the unary prefix plus operator in Python. This operation applies the context precision and rounding, so it is *not* an identity operation.
uk: Плюс відповідає унарному префіксу плюс-оператор у Python. Ця операція застосовує точність контексту та округлення, тому це *не* операція ідентифікації.

source: Return ``x`` to the power of ``y``, reduced modulo ``modulo`` if given.
uk: Повертає ``x`` до степеня ``y``, зменшеного за модулем ``modulo``, якщо задано.

source: With two arguments, compute ``x**y``. If ``x`` is negative then ``y`` must be integral. The result will be inexact unless ``y`` is integral and the result is finite and can be expressed exactly in 'precision' digits. The rounding mode of the context is used. Results are always correctly-rounded in the Python version.
uk: З двома аргументами обчисліть ``x**y``. Якщо ``x`` від'ємне, ``y`` має бути цілим. Результат буде неточним, якщо ``y`` не є цілим, а результат скінченним і може бути точно виражений цифрами 'точності'. Використовується режим округлення контексту. У версії Python результати завжди правильно округлюються.

source: ``Decimal(0) ** Decimal(0)`` results in ``InvalidOperation``, and if ``InvalidOperation`` is not trapped, then results in ``Decimal('NaN')``.
uk: ``Decimal(0) ** Decimal(0)`` призводить до ``InvalidOperation``, і якщо ``InvalidOperation`` не перехоплюється, то призводить до ``Decimal('NaN')``.

source: The C module computes :meth:`power` in terms of the correctly-rounded :meth:`exp` and :meth:`ln` functions. The result is well-defined but only "almost always correctly-rounded".
uk: Модуль C обчислює :meth:`power` в термінах правильно округлених функцій :meth:`exp` і :meth:`ln`. Результат чітко визначений, але лише "майже завжди правильно округлений".

source: With three arguments, compute ``(x**y) % modulo``. For the three argument form, the following restrictions on the arguments hold:
uk: З трьома аргументами обчисліть ``(x**y) % по модулю``. Для форми з трьома аргументами діють такі обмеження на аргументи:

source: all three arguments must be integral
uk: всі три аргументи повинні бути цілими

source: ``y`` must be nonnegative
uk: "y" має бути невід'ємним

source: at least one of ``x`` or ``y`` must be nonzero
uk: принаймні один із ``x`` або ``y`` має бути ненульовим

source: ``modulo`` must be nonzero and have at most 'precision' digits
uk: ``modulo`` має бути ненульовим і мати щонайбільше цифр "точності".

source: The value resulting from ``Context.power(x, y, modulo)`` is equal to the value that would be obtained by computing ``(x**y) % modulo`` with unbounded precision, but is computed more efficiently. The exponent of the result is zero, regardless of the exponents of ``x``, ``y`` and ``modulo``. The result is always exact.
uk: Значення, отримане за допомогою ``Context.power(x, y, modulo)``, дорівнює значенню, яке було б отримано шляхом обчислення ``(x**y) % по модулю`` з необмеженою точністю, але обчислюється ефективніше . Показник ступеня результату дорівнює нулю, незалежно від показників ``x``, ``y`` і ``modulo``. Результат завжди точний.

source: Returns a value equal to *x* (rounded), having the exponent of *y*.
uk: Повертає значення, яке дорівнює *x* (округлене), має експоненту *y*.

source: Just returns 10, as this is Decimal, :)
uk: Просто повертає 10, оскільки це десяткове значення :)
