Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/decimal.po
Languages: uk

source: If an application does not care about tracking significance, it is easy to remove the exponent and trailing zeroes, losing significance, but keeping the value unchanged:
uk: Якщо програма не піклується про відстеження значущості, можна легко видалити експоненту та кінцеві нулі, втрачаючи значущість, але зберігаючи значення незмінним:

source: Q. Is there a way to convert a regular float to a :class:`Decimal`?
uk: Q. Чи є спосіб перетворити звичайний float на :class:`Decimal`?

source: A. Yes, any binary floating point number can be exactly expressed as a Decimal though an exact conversion may take more precision than intuition would suggest:
uk: A. Так, будь-яке двійкове число з плаваючою комою можна точно виразити як десяткове число, хоча точне перетворення може вимагати більшої точності, ніж передбачає інтуїція:

source: Q. Within a complex calculation, how can I make sure that I haven't gotten a spurious result because of insufficient precision or rounding anomalies.
uk: Q. Як я можу переконатися, що в рамках складного обчислення я не отримав фальшивий результат через недостатню точність або аномалії округлення.

source: A. The decimal module makes it easy to test results. A best practice is to re-run calculations using greater precision and with various rounding modes. Widely differing results indicate insufficient precision, rounding mode issues, ill-conditioned inputs, or a numerically unstable algorithm.
uk: A. Десятковий модуль дозволяє легко перевірити результати. Найкраща практика — повторити обчислення з більшою точністю та різними режимами округлення. Різні результати вказують на недостатню точність, проблеми з режимом округлення, погано обумовлені вхідні дані або чисельно нестабільний алгоритм.

source: Q. I noticed that context precision is applied to the results of operations but not to the inputs. Is there anything to watch out for when mixing values of different precisions?
uk: З. Я помітив, що точність контексту застосовується до результатів операцій, але не до вхідних даних. Чи є на що слід звернути увагу під час змішування значень різної точності?

source: A. Yes. The principle is that all values are considered to be exact and so is the arithmetic on those values. Only the results are rounded. The advantage for inputs is that "what you type is what you get". A disadvantage is that the results can look odd if you forget that the inputs haven't been rounded:
uk: А. Так. Принцип полягає в тому, що всі значення вважаються точними, як і арифметика цих значень. Округлюються лише результати. Перевага введення даних полягає в тому, що "те, що ви вводите, те й отримуєте". Недоліком є те, що результати можуть виглядати дивно, якщо ви забудете, що вхідні дані не були округлені:

source: The solution is either to increase precision or to force rounding of inputs using the unary plus operation:
uk: Рішення полягає в тому, щоб підвищити точність або примусово округлити вхідні дані за допомогою унарної операції плюс:

source: Alternatively, inputs can be rounded upon creation using the :meth:`Context.create_decimal` method:
uk: Крім того, вхідні дані можна округлити під час створення за допомогою методу :meth:`Context.create_decimal`:

source: Q. Is the CPython implementation fast for large numbers?
uk: Q. Чи швидка реалізація CPython для великих чисел?

source: A. Yes. In the CPython and PyPy3 implementations, the C/CFFI versions of the decimal module integrate the high speed `libmpdec <https://www.bytereef.org/mpdecimal/doc/libmpdec/index.html>`_ library for arbitrary precision correctly-rounded decimal floating point arithmetic [#]_. ``libmpdec`` uses `Karatsuba multiplication <https://en.wikipedia.org/wiki/Karatsuba_algorithm>`_ for medium-sized numbers and the `Number Theoretic Transform <https://en.wikipedia.org/wiki/Discrete_Fourier_transform_(general)#Number-theoretic_transform>`_ for very large numbers.
uk: А. Так. У реалізаціях CPython і PyPy3 версії десяткового модуля C/CFFI інтегрують високошвидкісну бібліотеку `libmpdec <https://www.bytereef.org/mpdecimal/doc/libmpdec/index.html>`_ для правильно округленої десяткової арифметики з плаваючою комою довільної точності [#]_. ``libmpdec`` використовує `Множення Карацуби <https://en.wikipedia.org/wiki/Karatsuba_algorithm>`_ для чисел середнього розміру та `Теоретичне перетворення чисел <https://en.wikipedia.org/wiki/Discrete_Fourier_transform_(general)#Number-theoretic_transform>`_ для дуже великих чисел.

source: The context must be adapted for exact arbitrary precision arithmetic. :attr:`Emin` and :attr:`Emax` should always be set to the maximum values, :attr:`clamp` should always be 0 (the default). Setting :attr:`prec` requires some care.
uk: Контекст має бути адаптований для точної арифметики довільної точності. :attr:`Emin` і :attr:`Emax` завжди повинні бути встановлені на максимальні значення, :attr:`clamp` завжди має бути 0 (за замовчуванням). Налаштування :attr:`prec` вимагає певної обережності.

source: The easiest approach for trying out bignum arithmetic is to use the maximum value for :attr:`prec` as well [#]_::
uk: Найпростіший підхід для випробування арифметики bignum — використовувати максимальне значення для :attr:`prec`, а також [#]_::

source: For inexact results, :attr:`MAX_PREC` is far too large on 64-bit platforms and the available memory will be insufficient::
uk: Для отримання неточних результатів :attr:`MAX_PREC` є занадто великим на 64-розрядних платформах, тому доступної пам’яті буде недостатньо:

source: On systems with overallocation (e.g. Linux), a more sophisticated approach is to adjust :attr:`prec` to the amount of available RAM. Suppose that you have 8GB of RAM and expect 10 simultaneous operands using a maximum of 500MB each::
uk: У системах із загальним розподілом (наприклад, Linux) більш складним підходом є налаштування :attr:`prec` на обсяг доступної оперативної пам’яті. Припустімо, що у вас є 8 ГБ оперативної пам’яті та ви очікуєте 10 одночасних операндів, використовуючи максимум 500 МБ кожен:

source: In general (and especially on systems without overallocation), it is recommended to estimate even tighter bounds and set the :attr:`Inexact` trap if all calculations are expected to be exact.
uk: Загалом (і особливо в системах без загального розподілу) рекомендується оцінювати ще більш жорсткі межі та встановлювати пастку :attr:`Inexact`, якщо очікується, що всі обчислення будуть точними.

source: This approach now works for all exact results except for non-integer powers.
uk: Цей підхід тепер працює для всіх точних результатів, за винятком нецілих степенів.
