Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/decimal.po
Languages: uk

source: Returns the remainder from integer division.
uk: Повертає залишок від цілочисельного ділення.

source: The sign of the result, if non-zero, is the same as that of the original dividend.
uk: Знак результату, якщо він відмінний від нуля, такий самий, як у вихідного дивіденда.

source: Returns ``x - y * n``, where *n* is the integer nearest the exact value of ``x / y`` (if the result is 0 then its sign will be the sign of *x*).
uk: Повертає ``x - y * n``, де *n* — це ціле число, найближче до точного значення ``x / y`` (якщо результат дорівнює 0, то його знаком буде знак *x*).

source: Returns a rotated copy of *x*, *y* times.
uk: Повертає повернуту копію *x*, *y* разів.

source: Returns ``True`` if the two operands have the same exponent.
uk: Повертає ``True``, якщо два операнди мають однаковий експонент.

source: Returns the first operand after adding the second value its exp.
uk: Повертає перший операнд після додавання другого значення його виразу.

source: Returns a shifted copy of *x*, *y* times.
uk: Повертає зміщену копію *x*, *y* разів.

source: Square root of a non-negative number to context precision.
uk: Квадратний корінь із невід’ємного числа до точності контексту.

source: Return the difference between *x* and *y*.
uk: Повертає різницю між *x* і *y*.

source: Rounds to an integer.
uk: Округлює до цілого числа.

source: Converts a number to a string using scientific notation.
uk: Перетворює число на рядок, використовуючи наукову нотацію.

source: Constants
uk: Константи

source: The constants in this section are only relevant for the C module. They are also included in the pure Python version for compatibility.
uk: Константи в цьому розділі актуальні лише для модуля C. Вони також включені в чисту версію Python для сумісності.

source: 32-bit
uk: 32-розрядний

source: 64-bit
uk: 64-розрядний

source: The value is ``True``. Deprecated, because Python now always has threads.
uk: Значенням є ``True``. Застаріло, оскільки Python тепер завжди має потоки.

source: backported to 3.7 and 3.8.
uk: перенесено на версії 3.7 і 3.8.

source: Rounding modes
uk: Режими округлення

source: Round towards :const:`Infinity`.
uk: Округлення в напрямку :const:`Infinity`.

source: Round towards zero.
uk: Округлити в бік нуля.

source: Round towards :const:`-Infinity`.
uk: Округлення в напрямку :const:`-Infinity`.

source: Round to nearest with ties going towards zero.
uk: Округліть до найближчого із рівністю до нуля.

source: Round to nearest with ties going to nearest even integer.
uk: Округліть до найближчого зі зв’язками до найближчого парного цілого числа.

source: Round to nearest with ties going away from zero.
uk: Округліть до найближчого із рівнем від нуля.

source: Round away from zero.
uk: Округлити від нуля.

source: Round away from zero if last digit after rounding towards zero would have been 0 or 5; otherwise round towards zero.
uk: Округлити від нуля, якщо остання цифра після округлення до нуля була б 0 або 5; інакше округліть до нуля.

source: Signals
uk: Сигнали

source: Signals represent conditions that arise during computation. Each corresponds to one context flag and one context trap enabler.
uk: Сигнали представляють умови, які виникають під час обчислення. Кожен відповідає одному прапорцю контексту та одному активатору перехоплення контексту.

source: The context flag is set whenever the condition is encountered. After the computation, flags may be checked for informational purposes (for instance, to determine whether a computation was exact). After checking the flags, be sure to clear all flags before starting the next computation.
uk: Прапор контексту встановлюється щоразу, коли зустрічається умова. Після обчислення прапорці можуть бути перевірені в інформаційних цілях (наприклад, щоб визначити, чи було обчислення точним). Після перевірки прапорів обов’язково видаліть усі прапорці перед початком наступного обчислення.

source: If the context's trap enabler is set for the signal, then the condition causes a Python exception to be raised. For example, if the :class:`DivisionByZero` trap is set, then a :exc:`DivisionByZero` exception is raised upon encountering the condition.
uk: Якщо для сигналу встановлено активатор перехоплення контексту, тоді умова викликає виняток Python. Наприклад, якщо встановлено перехоплення :class:`DivisionByZero`, тоді виникає виняткова ситуація :exc:`DivisionByZero`, коли зустрічається умова.

source: Altered an exponent to fit representation constraints.
uk: Змінено експоненту, щоб відповідати обмеженням представлення.

source: Typically, clamping occurs when an exponent falls outside the context's :attr:`Emin` and :attr:`Emax` limits. If possible, the exponent is reduced to fit by adding zeros to the coefficient.
uk: Як правило, обмеження відбувається, коли експонента виходить за межі контексту :attr:`Emin` і :attr:`Emax`. Якщо можливо, експонента скорочується до відповідності шляхом додавання нулів до коефіцієнта.

source: Base class for other signals and a subclass of :exc:`ArithmeticError`.
uk: Базовий клас для інших сигналів і підклас :exc:`ArithmeticError`.

source: Signals the division of a non-infinite number by zero.
uk: Сигналізує про ділення нескінченного числа на нуль.

source: Can occur with division, modulo division, or when raising a number to a negative power. If this signal is not trapped, returns :const:`Infinity` or :const:`-Infinity` with the sign determined by the inputs to the calculation.
uk: Може виникнути при діленні, діленні за модулем або під час піднесення числа до від’ємного степеня. Якщо цей сигнал не перехоплюється, повертає :const:`Infinity` або :const:`-Infinity` зі знаком, визначеним вхідними даними обчислення.

source: Indicates that rounding occurred and the result is not exact.
uk: Вказує на те, що відбулося округлення і результат неточний.

source: Signals when non-zero digits were discarded during rounding. The rounded result is returned. The signal flag or trap is used to detect when results are inexact.
uk: Сигнали, коли під час округлення були відкинуті ненульові цифри. Повертається округлений результат. Сигнальний прапор або пастка використовується для виявлення неточних результатів.

source: An invalid operation was performed.
uk: Виконано недійсну операцію.

source: Indicates that an operation was requested that does not make sense. If not trapped, returns :const:`NaN`. Possible causes include::
uk: Вказує на те, що запитувалась операція, яка не має сенсу. Якщо не перехоплено, повертає :const:`NaN`. Можливі причини:

source: Numerical overflow.
uk: Числове переповнення.

source: Indicates the exponent is larger than :attr:`Emax` after rounding has occurred. If not trapped, the result depends on the rounding mode, either pulling inward to the largest representable finite number or rounding outward to :const:`Infinity`. In either case, :class:`Inexact` and :class:`Rounded` are also signaled.
uk: Указує, що експонента більша за :attr:`Emax` після округлення. Якщо не зафіксовано, результат залежить від режиму округлення, або тягнучи всередину до найбільшого кінцевого числа, яке можна представити, або округляючи назовні до :const:`Infinity`. У будь-якому випадку також сигналізується :class:`Inexact` і :class:`Rounded`.

source: Rounding occurred though possibly no information was lost.
uk: Відбулося округлення, хоча, можливо, жодної інформації не було втрачено.

source: Signaled whenever rounding discards digits; even if those digits are zero (such as rounding :const:`5.00` to :const:`5.0`). If not trapped, returns the result unchanged. This signal is used to detect loss of significant digits.
uk: Сигналізується щоразу, коли округлення відкидає цифри; навіть якщо ці цифри дорівнюють нулю (наприклад, округлення :const:`5.00` до :const:`5.0`). Якщо не перехоплено, повертає результат без змін. Цей сигнал використовується для виявлення втрати значущих цифр.

source: Exponent was lower than :attr:`Emin` prior to rounding.
uk: Експонента була нижчою за :attr:`Emin` до округлення.

source: Occurs when an operation result is subnormal (the exponent is too small). If not trapped, returns the result unchanged.
uk: Виникає, коли результат операції є ненормальним (експонента занадто мала). Якщо не перехоплено, повертає результат без змін.

source: Numerical underflow with result rounded to zero.
uk: Числове недоповнення з результатом, округленим до нуля.

source: Occurs when a subnormal result is pushed to zero by rounding. :class:`Inexact` and :class:`Subnormal` are also signaled.
uk: Виникає, коли субнормальний результат обнулюється шляхом округлення. :class:`Inexact` і :class:`Subnormal` також сигналізуються.

source: Enable stricter semantics for mixing floats and Decimals.
uk: Увімкніть суворішу семантику для змішування чисел із плаваючою точкою та десяткових знаків.

source: If the signal is not trapped (default), mixing floats and Decimals is permitted in the :class:`~decimal.Decimal` constructor, :meth:`~decimal.Context.create_decimal` and all comparison operators. Both conversion and comparisons are exact. Any occurrence of a mixed operation is silently recorded by setting :exc:`FloatOperation` in the context flags. Explicit conversions with :meth:`~decimal.Decimal.from_float` or :meth:`~decimal.Context.create_decimal_from_float` do not set the flag.
uk: Якщо сигнал не перехоплюється (за замовчуванням), змішування чисел із плаваючою точкою та десяткових знаків дозволено в конструкторі :class:`~decimal.Decimal`, :meth:`~decimal.Context.create_decimal` та в усіх операторах порівняння. І перетворення, і порівняння точні. Будь-який випадок змішаної операції автоматично записується шляхом встановлення :exc:`FloatOperation` у прапорцях контексту. Явні перетворення за допомогою :meth:`~decimal.Decimal.from_float` або :meth:`~decimal.Context.create_decimal_from_float` не встановлюють прапор.

source: Otherwise (the signal is trapped), only equality comparisons and explicit conversions are silent. All other mixed operations raise :exc:`FloatOperation`.
uk: В іншому випадку (сигнал перехоплюється), лише порівняння рівності та явні перетворення мовчать. Усі інші змішані операції викликають :exc:`FloatOperation`.

source: The following table summarizes the hierarchy of signals::
uk: У наступній таблиці підсумовано ієрархію сигналів:

source: Floating Point Notes
uk: Примітки з плаваючою комою

source: Mitigating round-off error with increased precision
uk: Зменшення помилки округлення з підвищеною точністю

source: The use of decimal floating point eliminates decimal representation error (making it possible to represent :const:`0.1` exactly); however, some operations can still incur round-off error when non-zero digits exceed the fixed precision.
uk: Використання десяткової коми з плаваючою комою усуває помилку десяткового представлення (дозволяє точно представити :const:`0.1`); проте, деякі операції все ще можуть викликати помилку округлення, коли ненульові цифри перевищують фіксовану точність.

source: The effects of round-off error can be amplified by the addition or subtraction of nearly offsetting quantities resulting in loss of significance. Knuth provides two instructive examples where rounded floating point arithmetic with insufficient precision causes the breakdown of the associative and distributive properties of addition:
uk: Вплив помилки округлення може посилюватися шляхом додавання або віднімання величин, які майже зміщуються, що призводить до втрати значущості. Кнут наводить два повчальних приклади, коли округлена арифметика з плаваючою комою з недостатньою точністю спричиняє порушення асоціативних і розподільних властивостей додавання:

source: The :mod:`decimal` module makes it possible to restore the identities by expanding the precision sufficiently to avoid loss of significance:
uk: Модуль :mod:`decimal` дає змогу відновити ідентифікаційні дані, збільшивши точність настільки, щоб уникнути втрати значущості:

source: Special values
uk: Особливі цінності

source: The number system for the :mod:`decimal` module provides special values including :const:`NaN`, :const:`sNaN`, :const:`-Infinity`, :const:`Infinity`, and two zeros, :const:`+0` and :const:`-0`.
uk: Система числення для модуля :mod:`decimal` надає спеціальні значення, включаючи :const:`NaN`, :const:`sNaN`, :const:`-Infinity`, :const:`Infinity` та два нулі, :const:`+0` і :const:`-0`.

source: Infinities can be constructed directly with: ``Decimal('Infinity')``. Also, they can arise from dividing by zero when the :exc:`DivisionByZero` signal is not trapped. Likewise, when the :exc:`Overflow` signal is not trapped, infinity can result from rounding beyond the limits of the largest representable number.
uk: Нескінченності можна побудувати безпосередньо за допомогою: ``Decimal('Infinity')``. Крім того, вони можуть виникнути через ділення на нуль, коли сигнал :exc:`DivisionByZero` не перехоплюється. Подібним чином, коли сигнал :exc:`Overflow` не перехоплюється, нескінченність може бути результатом округлення за межі найбільшого представленого числа.

source: The infinities are signed (affine) and can be used in arithmetic operations where they get treated as very large, indeterminate numbers. For instance, adding a constant to infinity gives another infinite result.
uk: Нескінченності мають знак (афінні) і можуть використовуватися в арифметичних операціях, де вони розглядаються як дуже великі невизначені числа. Наприклад, додавання константи до нескінченності дає інший нескінченний результат.

source: Some operations are indeterminate and return :const:`NaN`, or if the :exc:`InvalidOperation` signal is trapped, raise an exception. For example, ``0/0`` returns :const:`NaN` which means "not a number". This variety of :const:`NaN` is quiet and, once created, will flow through other computations always resulting in another :const:`NaN`. This behavior can be useful for a series of computations that occasionally have missing inputs --- it allows the calculation to proceed while flagging specific results as invalid.
uk: Деякі операції є невизначеними та повертають :const:`NaN` або, якщо сигнал :exc:`InvalidOperation` перехоплюється, викликають виняток. Наприклад, ``0/0`` повертає :const:`NaN`, що означає "не число". Цей різновид :const:`NaN` є тихим і, створений, проходитиме через інші обчислення, що завжди призводить до іншого :const:`NaN`. Така поведінка може бути корисною для серії обчислень, у яких час від часу відсутні вхідні дані --- вона дозволяє продовжувати обчислення, позначаючи певні результати як недійсні.

source: A variant is :const:`sNaN` which signals rather than remaining quiet after every operation. This is a useful return value when an invalid result needs to interrupt a calculation for special handling.
uk: Варіантом є :const:`sNaN`, який сигналізує, а не мовчить після кожної операції. Це корисне повертане значення, коли недійсний результат потребує переривання обчислення для спеціальної обробки.

source: The behavior of Python's comparison operators can be a little surprising where a :const:`NaN` is involved. A test for equality where one of the operands is a quiet or signaling :const:`NaN` always returns :const:`False` (even when doing ``Decimal('NaN')==Decimal('NaN')``), while a test for inequality always returns :const:`True`. An attempt to compare two Decimals using any of the ``<``, ``<=``, ``>`` or ``>=`` operators will raise the :exc:`InvalidOperation` signal if either operand is a :const:`NaN`, and return :const:`False` if this signal is not trapped. Note that the General Decimal Arithmetic specification does not specify the behavior of direct comparisons; these rules for comparisons involving a :const:`NaN` were taken from the IEEE 854 standard (see Table 3 in section 5.7). To ensure strict standards-compliance, use the :meth:`compare` and :meth:`compare-signal` methods instead.
uk: Поведінка операторів порівняння Python може бути трохи несподіваною, якщо залучено :const:`NaN`. Тест на рівність, коли один із операндів є тихим або сигнальним :const:`NaN` завжди повертає :const:`False` (навіть якщо виконується ``Decimal('NaN')==Decimal('NaN')`` ), а перевірка нерівності завжди повертає :const:`True`. Спроба порівняти два десяткові знаки за допомогою будь-якого з операторів ``<``, ``<=``, ``>`` або ``>=`` викличе сигнал :exc:`InvalidOperation`, якщо будь-який з операндів є :const:`NaN`, і поверне :const:`False`, якщо цей сигнал не перехоплюється. Зауважте, що специфікація General Decimal Arithmetic не визначає поведінку прямих порівнянь; ці правила для порівнянь за участю :const:`NaN` були взяті зі стандарту IEEE 854 (див. Таблицю 3 у розділі 5.7). Щоб забезпечити сувору відповідність стандартам, замість цього використовуйте методи :meth:`compare` і :meth:`compare-signal`.

source: The signed zeros can result from calculations that underflow. They keep the sign that would have resulted if the calculation had been carried out to greater precision. Since their magnitude is zero, both positive and negative zeros are treated as equal and their sign is informational.
uk: Нулі зі знаком можуть виникати в результаті обчислень, які занижуються. Вони зберігають знак, який був би отриманий, якби розрахунок проводився з більшою точністю. Оскільки їх величина дорівнює нулю, додатні та від’ємні нулі вважаються рівними, а їх знак є інформаційним.

source: In addition to the two signed zeros which are distinct yet equal, there are various representations of zero with differing precisions yet equivalent in value. This takes a bit of getting used to. For an eye accustomed to normalized floating point representations, it is not immediately obvious that the following calculation returns a value equal to zero:
uk: На додаток до двох нулів зі знаком, які є різними, але однаковими, існують різні представлення нуля з різною точністю, але еквівалентні за значенням. До цього потрібно трохи звикнути. Для ока, яке звикло до нормалізованих представлень із плаваючою комою, не відразу стане очевидним, що наступне обчислення повертає значення, що дорівнює нулю:

source: Working with threads
uk: Робота з нитками

source: The :func:`getcontext` function accesses a different :class:`Context` object for each thread. Having separate thread contexts means that threads may make changes (such as ``getcontext().prec=10``) without interfering with other threads.
uk: Функція :func:`getcontext` отримує доступ до іншого об’єкта :class:`Context` для кожного потоку. Наявність окремих контекстів потоків означає, що потоки можуть вносити зміни (наприклад, ``getcontext().prec=10``), не заважаючи іншим потокам.

source: Likewise, the :func:`setcontext` function automatically assigns its target to the current thread.
uk: Подібним чином функція :func:`setcontext` автоматично призначає свою ціль поточному потоку.

source: If :func:`setcontext` has not been called before :func:`getcontext`, then :func:`getcontext` will automatically create a new context for use in the current thread.
uk: Якщо :func:`setcontext` не викликався раніше :func:`getcontext`, тоді :func:`getcontext` автоматично створить новий контекст для використання в поточному потоці.

source: The new context is copied from a prototype context called *DefaultContext*. To control the defaults so that each thread will use the same values throughout the application, directly modify the *DefaultContext* object. This should be done *before* any threads are started so that there won't be a race condition between threads calling :func:`getcontext`. For example::
uk: Новий контекст скопійовано з контексту прототипу під назвою *DefaultContext*. Щоб керувати параметрами за замовчуванням, щоб кожен потік використовував однакові значення в усій програмі, безпосередньо змініть об’єкт *DefaultContext*. Це слід зробити *перед* запуском будь-яких потоків, щоб не виникало змагання між потоками, що викликають :func:`getcontext`. Наприклад::

source: Recipes
uk: рецепти

source: Here are a few recipes that serve as utility functions and that demonstrate ways to work with the :class:`Decimal` class::
uk: Ось кілька рецептів, які служать допоміжними функціями та демонструють способи роботи з класом :class:`Decimal`::

source: Decimal FAQ
uk: Десятковий FAQ

source: Q. It is cumbersome to type ``decimal.Decimal('1234.5')``. Is there a way to minimize typing when using the interactive interpreter?
uk: З. Громіздко вводити ``decimal.Decimal('1234.5')``. Чи є спосіб мінімізувати введення під час використання інтерактивного перекладача?

source: A. Some users abbreviate the constructor to just a single letter:
uk: A. Деякі користувачі скорочують конструктор лише до однієї літери:

source: Q. In a fixed-point application with two decimal places, some inputs have many places and need to be rounded. Others are not supposed to have excess digits and need to be validated. What methods should be used?
uk: Q. У програмі з фіксованою комою з двома знаками після коми деякі вхідні дані мають багато знаків і їх потрібно округлити. Інші не повинні мати зайвих цифр і потребують перевірки. Які методи слід використовувати?

source: A. The :meth:`quantize` method rounds to a fixed number of decimal places. If the :const:`Inexact` trap is set, it is also useful for validation:
uk: A. Метод :meth:`quantize` округлює до фіксованої кількості знаків після коми. Якщо встановлено перехоплення :const:`Inexact`, це також корисно для перевірки:

source: Q. Once I have valid two place inputs, how do I maintain that invariant throughout an application?
uk: З. Якщо я маю дійсні двомісні введення, як мені підтримувати цей інваріант у всій програмі?

source: A. Some operations like addition, subtraction, and multiplication by an integer will automatically preserve fixed point. Others operations, like division and non-integer multiplication, will change the number of decimal places and need to be followed-up with a :meth:`quantize` step:
uk: A. Деякі операції, такі як додавання, віднімання та множення на ціле число, автоматично зберігають фіксовану кому. Інші операції, як-от ділення та неціле множення, змінюватимуть кількість десяткових знаків і потребуватимуть подальших кроків :meth:`quantize`:

source: In developing fixed-point applications, it is convenient to define functions to handle the :meth:`quantize` step:
uk: У розробці додатків із фіксованою крапкою зручно визначати функції для обробки кроку :meth:`quantize`:

source: Q. There are many ways to express the same value. The numbers :const:`200`, :const:`200.000`, :const:`2E2`, and :const:`.02E+4` all have the same value at various precisions. Is there a way to transform them to a single recognizable canonical value?
uk: Q. Є багато способів вираження того самого значення. Числа :const:`200`, :const:`200.000`, :const:`2E2` і :const:`.02E+4` мають однакові значення з різною точністю. Чи є спосіб перетворити їх до єдиного розпізнаваного канонічного значення?

source: A. The :meth:`normalize` method maps all equivalent values to a single representative:
uk: A. Метод :meth:`normalize` відображає всі еквівалентні значення в одному представнику:

source: Q. Some decimal values always print with exponential notation. Is there a way to get a non-exponential representation?
uk: З. Деякі десяткові значення завжди друкуються в експоненціальному вигляді. Чи є спосіб отримати неекспоненціальне представлення?

source: A. For some values, exponential notation is the only way to express the number of significant places in the coefficient. For example, expressing :const:`5.0E+3` as :const:`5000` keeps the value constant but cannot show the original's two-place significance.
uk: A. Для деяких значень експоненціальний запис є єдиним способом вираження кількості значущих місць у коефіцієнті. Наприклад, вираження :const:`5.0E+3` як :const:`5000` зберігає значення постійним, але не може показати двозначне значення оригіналу.
