Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/decimal.po
Languages: uk

source: :mod:`decimal` --- Decimal fixed point and floating point arithmetic
uk: :mod:`decimal` --- десяткова арифметика з фіксованою та плаваючою комою

source: **Source code:** :source:`Lib/decimal.py`
uk: **Вихідний код:** :source:`Lib/decimal.py`

source: The :mod:`decimal` module provides support for fast correctly-rounded decimal floating point arithmetic. It offers several advantages over the :class:`float` datatype:
uk: Модуль :mod:`decimal` забезпечує підтримку швидкої правильно округленої десяткової арифметики з плаваючою комою. Він пропонує кілька переваг перед типом даних :class:`float`:

source: Decimal "is based on a floating-point model which was designed with people in mind, and necessarily has a paramount guiding principle -- computers must provide an arithmetic that works in the same way as the arithmetic that people learn at school." -- excerpt from the decimal arithmetic specification.
uk: Decimal "базується на моделі з плаваючою комою, яка була розроблена з урахуванням людей, і обов'язково має головний керівний принцип - комп'ютери повинні забезпечувати арифметику, яка працює так само, як арифметика, яку люди вивчають у школі". -- витяг із специфікації десяткової арифметики.

source: Decimal numbers can be represented exactly. In contrast, numbers like :const:`1.1` and :const:`2.2` do not have exact representations in binary floating point. End users typically would not expect ``1.1 + 2.2`` to display as :const:`3.3000000000000003` as it does with binary floating point.
uk: Десяткові числа можуть бути представлені точно. Навпаки, такі числа, як :const:`1.1` і :const:`2.2`, не мають точного представлення у двійковій формі з плаваючою комою. Кінцеві користувачі зазвичай не очікують, що ``1.1 + 2.2`` відображатиметься як :const:`3.3000000000000003`, як це відбувається з двійковими числами з плаваючою комою.

source: The exactness carries over into arithmetic. In decimal floating point, ``0.1 + 0.1 + 0.1 - 0.3`` is exactly equal to zero. In binary floating point, the result is :const:`5.5511151231257827e-017`. While near to zero, the differences prevent reliable equality testing and differences can accumulate. For this reason, decimal is preferred in accounting applications which have strict equality invariants.
uk: Точність переходить в арифметику. У десятковій комі з плаваючою комою "0,1 + 0,1 + 0,1 - 0,3" точно дорівнює нулю. У двійковій формі з плаваючою комою результатом є :const:`5.5511151231257827e-017`. Хоча відмінності близькі до нуля, вони перешкоджають надійному тестуванню на рівність, і відмінності можуть накопичуватися. З цієї причини десяткове число є кращим у програмах бухгалтерського обліку, які мають суворі інваріанти рівності.

source: The decimal module incorporates a notion of significant places so that ``1.30 + 1.20`` is :const:`2.50`. The trailing zero is kept to indicate significance. This is the customary presentation for monetary applications. For multiplication, the "schoolbook" approach uses all the figures in the multiplicands. For instance, ``1.3 * 1.2`` gives :const:`1.56` while ``1.30 * 1.20`` gives :const:`1.5600`.
uk: Десятковий модуль містить поняття значущих розрядів, тому ``1,30 + 1,20`` дорівнює :const:`2,50`. Кінцевий нуль зберігається, щоб вказати значимість. Це звичайна презентація для грошових заявок. Для множення підхід "шкільного підручника" використовує всі цифри в множених. Наприклад, ``1.3 * 1.2`` дає :const:`1.56`, а ``1.30 * 1.20`` дає :const:`1.5600`.

source: Unlike hardware based binary floating point, the decimal module has a user alterable precision (defaulting to 28 places) which can be as large as needed for a given problem:
uk: На відміну від двійкового числа з плаваючою комою на апаратній основі, десятковий модуль має змінну користувачем точність (за замовчуванням 28 знаків), яка може бути настільки великою, наскільки це потрібно для даної проблеми:

source: Both binary and decimal floating point are implemented in terms of published standards. While the built-in float type exposes only a modest portion of its capabilities, the decimal module exposes all required parts of the standard. When needed, the programmer has full control over rounding and signal handling. This includes an option to enforce exact arithmetic by using exceptions to block any inexact operations.
uk: І двійкові, і десяткові числа з плаваючою комою реалізовані відповідно до опублікованих стандартів. У той час як вбудований тип float відкриває лише скромну частину своїх можливостей, десятковий модуль відкриває всі необхідні частини стандарту. За потреби програміст має повний контроль над округленням і обробкою сигналу. Це включає в себе опцію для застосування точної арифметики за допомогою винятків для блокування будь-яких неточних операцій.

source: The decimal module was designed to support "without prejudice, both exact unrounded decimal arithmetic (sometimes called fixed-point arithmetic) and rounded floating-point arithmetic." -- excerpt from the decimal arithmetic specification.
uk: Десятковий модуль був розроблений для підтримки "без шкоди як точної неокругленої десяткової арифметики (іноді її називають арифметикою з фіксованою комою), так і округленої арифметики з плаваючою комою". -- витяг із специфікації десяткової арифметики.

source: The module design is centered around three concepts: the decimal number, the context for arithmetic, and signals.
uk: Конструкція модуля зосереджена навколо трьох понять: десяткове число, контекст для арифметики та сигнали.

source: A decimal number is immutable. It has a sign, coefficient digits, and an exponent. To preserve significance, the coefficient digits do not truncate trailing zeros. Decimals also include special values such as :const:`Infinity`, :const:`-Infinity`, and :const:`NaN`. The standard also differentiates :const:`-0` from :const:`+0`.
uk: Десяткове число є незмінним. Він має знак, цифри коефіцієнта та експоненту. Щоб зберегти значущість, цифри коефіцієнта не скорочують кінцеві нулі. Десяткові числа також включають спеціальні значення, такі як :const:`Infinity`, :const:`-Infinity` і :const:`NaN`. Стандарт також відрізняє :const:`-0` від :const:`+0`.

source: The context for arithmetic is an environment specifying precision, rounding rules, limits on exponents, flags indicating the results of operations, and trap enablers which determine whether signals are treated as exceptions. Rounding options include :const:`ROUND_CEILING`, :const:`ROUND_DOWN`, :const:`ROUND_FLOOR`, :const:`ROUND_HALF_DOWN`, :const:`ROUND_HALF_EVEN`, :const:`ROUND_HALF_UP`, :const:`ROUND_UP`, and :const:`ROUND_05UP`.
uk: Контекст для арифметики — це середовище, що визначає точність, правила округлення, обмеження на експоненти, прапори, що вказують результати операцій, і засоби перехоплення, які визначають, чи розглядаються сигнали як винятки. Параметри округлення включають :const:`ROUND_CEILING`, :const:`ROUND_DOWN`, :const:`ROUND_FLOOR`, :const:`ROUND_HALF_DOWN`, :const:`ROUND_HALF_EVEN`, :const:`ROUND_HALF_UP`, :const:`ROUND_UP` і :const:`ROUND_05UP`.

source: Signals are groups of exceptional conditions arising during the course of computation. Depending on the needs of the application, signals may be ignored, considered as informational, or treated as exceptions. The signals in the decimal module are: :const:`Clamped`, :const:`InvalidOperation`, :const:`DivisionByZero`, :const:`Inexact`, :const:`Rounded`, :const:`Subnormal`, :const:`Overflow`, :const:`Underflow` and :const:`FloatOperation`.
uk: Сигнали - це групи виняткових умов, що виникають під час обчислень. Залежно від потреб програми, сигнали можуть ігноруватися, розглядатися як інформаційні або розглядатися як винятки. Сигнали в десятковому модулі: :const:`Clamped`, :const:`InvalidOperation`, :const:`DivisionByZero`, :const:`Inexact`, :const:`Rounded`, :const:`Subnormal`, :const:`Overflow`, :const:`Underflow` і :const:`FloatOperation`.

source: For each signal there is a flag and a trap enabler. When a signal is encountered, its flag is set to one, then, if the trap enabler is set to one, an exception is raised. Flags are sticky, so the user needs to reset them before monitoring a calculation.
uk: Для кожного сигналу є прапорець і активатор пастки. Коли зустрічається сигнал, його прапорець встановлюється на одиницю, тоді, якщо активатор перехоплення встановлений на одиницю, виникає виняток. Прапори є липкими, тому користувачеві потрібно скинути їх, перш ніж контролювати обчислення.

source: IBM's General Decimal Arithmetic Specification, `The General Decimal Arithmetic Specification <http://speleotrove.com/decimal/decarith.html>`_.
uk: Загальна десяткова арифметична специфікація IBM, `Загальна десяткова арифметична специфікація <http://speleotrove.com/decimal/decarith.html>`_.

source: Quick-start Tutorial
uk: Короткий підручник

source: The usual start to using decimals is importing the module, viewing the current context with :func:`getcontext` and, if necessary, setting new values for precision, rounding, or enabled traps::
uk: Звичайним початком використання десяткових дробів є імпортування модуля, перегляд поточного контексту за допомогою :func:`getcontext` і, якщо необхідно, встановлення нових значень для точності, округлення або ввімкнення перехоплень::

source: Decimal instances can be constructed from integers, strings, floats, or tuples. Construction from an integer or a float performs an exact conversion of the value of that integer or float. Decimal numbers include special values such as :const:`NaN` which stands for "Not a number", positive and negative :const:`Infinity`, and :const:`-0`::
uk: Десяткові екземпляри можуть бути створені з цілих чисел, рядків, чисел з плаваючою точкою або кортежів. Конструкція з цілого числа або числа з плаваючою точкою виконує точне перетворення значення цього цілого числа або числа з плаваючою точкою. Десяткові числа включають спеціальні значення, такі як :const:`NaN`, що означає "Не число", додатні та від’ємні :const:`Infinity` та :const:`-0`::

source: If the :exc:`FloatOperation` signal is trapped, accidental mixing of decimals and floats in constructors or ordering comparisons raises an exception::
uk: Якщо сигнал :exc:`FloatOperation` перехоплюється, випадкове змішування десяткових дробів і чисел з плаваючою точкою в конструкторах або впорядкованих порівняннях викликає виняток:

source: The significance of a new Decimal is determined solely by the number of digits input. Context precision and rounding only come into play during arithmetic operations.
uk: Значення нового десяткового дробу визначається виключно кількістю введених цифр. Точність контексту та округлення застосовуються лише під час арифметичних операцій.

source: If the internal limits of the C version are exceeded, constructing a decimal raises :class:`InvalidOperation`::
uk: Якщо внутрішні обмеження версії C перевищено, побудова десяткового числа призводить до :class:`InvalidOperation`::

source: Decimals interact well with much of the rest of Python. Here is a small decimal floating point flying circus:
uk: Десяткові числа добре взаємодіють із більшою частиною решти Python. Ось невеликий літаючий цирк з десятковою комою:

source: And some mathematical functions are also available to Decimal:
uk: І деякі математичні функції також доступні для Decimal:

source: The :meth:`quantize` method rounds a number to a fixed exponent. This method is useful for monetary applications that often round results to a fixed number of places:
uk: Метод :meth:`quantize` округлює число до фіксованого показника. Цей метод корисний для грошових програм, які часто округлюють результати до фіксованої кількості місць:

source: As shown above, the :func:`getcontext` function accesses the current context and allows the settings to be changed. This approach meets the needs of most applications.
uk: Як показано вище, функція :func:`getcontext` отримує доступ до поточного контексту та дозволяє змінювати налаштування. Такий підхід відповідає потребам більшості програм.

source: For more advanced work, it may be useful to create alternate contexts using the Context() constructor. To make an alternate active, use the :func:`setcontext` function.
uk: Для більш складної роботи може бути корисним створити альтернативні контексти за допомогою конструктора Context(). Щоб зробити альтернативу активною, використовуйте функцію :func:`setcontext`.

source: In accordance with the standard, the :mod:`decimal` module provides two ready to use standard contexts, :const:`BasicContext` and :const:`ExtendedContext`. The former is especially useful for debugging because many of the traps are enabled:
uk: Відповідно до стандарту, модуль :mod:`decimal` надає два готові до використання стандартні контексти, :const:`BasicContext` і :const:`ExtendedContext`. Перший особливо корисний для налагодження, оскільки багато пасток увімкнено:

source: Contexts also have signal flags for monitoring exceptional conditions encountered during computations. The flags remain set until explicitly cleared, so it is best to clear the flags before each set of monitored computations by using the :meth:`clear_flags` method. ::
uk: Контексти також мають сигнальні прапорці для моніторингу виняткових умов, що виникають під час обчислень. Прапори залишаються встановленими, доки вони не будуть очищені явно, тому найкраще знімати прапори перед кожним набором контрольованих обчислень за допомогою методу :meth:`clear_flags`. ::

source: The *flags* entry shows that the rational approximation to :const:`Pi` was rounded (digits beyond the context precision were thrown away) and that the result is inexact (some of the discarded digits were non-zero).
uk: Запис *flags* показує, що раціональне наближення до :const:`Pi` було округлено (цифри, що виходять за межі точності контексту, були викинуті) і що результат є неточним (деякі з відкинутих цифр були ненульовими).

source: Individual traps are set using the dictionary in the :attr:`traps` field of a context:
uk: Індивідуальні пастки встановлюються за допомогою словника в полі :attr:`traps` контексту:

source: Most programs adjust the current context only once, at the beginning of the program. And, in many applications, data is converted to :class:`Decimal` with a single cast inside a loop. With context set and decimals created, the bulk of the program manipulates the data no differently than with other Python numeric types.
uk: Більшість програм коригують поточний контекст лише один раз, на початку програми. І в багатьох програмах дані перетворюються на :class:`Decimal` за допомогою одного приведення всередині циклу. З набором контексту та створеними десятковими знаками основна частина програми маніпулює даними не інакше, як з іншими числовими типами Python.

source: Decimal objects
uk: Десяткові об'єкти

source: Construct a new :class:`Decimal` object based from *value*.
uk: Створіть новий об’єкт :class:`Decimal` на основі *value*.

source: *value* can be an integer, string, tuple, :class:`float`, or another :class:`Decimal` object. If no *value* is given, returns ``Decimal('0')``. If *value* is a string, it should conform to the decimal numeric string syntax after leading and trailing whitespace characters, as well as underscores throughout, are removed::
uk: *значення* може бути цілим числом, рядком, кортежем, :class:`float` або іншим об’єктом :class:`Decimal`. Якщо *значення* не вказано, повертає ``Decimal('0')``. Якщо *значення* є рядком, воно має відповідати синтаксису десяткового числового рядка після видалення початкових і кінцевих пробілів, а також символів підкреслення::

source: Other Unicode decimal digits are also permitted where ``digit`` appears above. These include decimal digits from various other alphabets (for example, Arabic-Indic and Devanāgarī digits) along with the fullwidth digits ``'\uff10'`` through ``'\uff19'``.
uk: Інші десяткові цифри Юнікоду також дозволені там, де вказано "цифра" вище. До них входять десяткові цифри з різних інших алфавітів (наприклад, цифри арабо-індійської мови та цифри Деванагарі), а також цифри повної ширини від ``'\uff10'`` до ``'\uff19'``.

source: If *value* is a :class:`tuple`, it should have three components, a sign (:const:`0` for positive or :const:`1` for negative), a :class:`tuple` of digits, and an integer exponent. For example, ``Decimal((0, (1, 4, 1, 4), -3))`` returns ``Decimal('1.414')``.
uk: Якщо *value* є :class:`tuple`, воно має містити три компоненти, знак (:const:`0` для позитивного або :const:`1` для негативного), :class:`tuple` цифр , і цілий показник степеня. Наприклад, ``Decimal((0, (1, 4, 1, 4), -3))`` повертає ``Decimal('1,414')``.

source: If *value* is a :class:`float`, the binary floating point value is losslessly converted to its exact decimal equivalent. This conversion can often require 53 or more digits of precision. For example, ``Decimal(float('1.1'))`` converts to ``Decimal('1.100000000000000088817841970012523233890533447265625')``.
uk: Якщо *value* є :class:`float`, двійкове значення з плаваючою комою без втрат перетворюється на його точний десятковий еквівалент. Для цього перетворення часто може знадобитися 53 або більше цифр точності. Наприклад, ``Decimal(float('1.1'))`` перетворюється на ``Decimal('1.100000000000000088817841970012523233890533447265625')``.

source: The *context* precision does not affect how many digits are stored. That is determined exclusively by the number of digits in *value*. For example, ``Decimal('3.00000')`` records all five zeros even if the context precision is only three.
uk: Точність *контексту* не впливає на кількість збережених цифр. Це визначається виключно кількістю цифр у *значенні*. Наприклад, ``Decimal('3.00000')`` записує всі п'ять нулів, навіть якщо точність контексту становить лише три.

source: The purpose of the *context* argument is determining what to do if *value* is a malformed string. If the context traps :const:`InvalidOperation`, an exception is raised; otherwise, the constructor returns a new Decimal with the value of :const:`NaN`.
uk: Метою аргументу *context* є визначення того, що робити, якщо *value* є неправильним рядком. Якщо контекст перехоплює :const:`InvalidOperation`, виникає виняток; інакше конструктор повертає новий Decimal зі значенням :const:`NaN`.

source: Once constructed, :class:`Decimal` objects are immutable.
uk: Після створення об’єкти :class:`Decimal` є незмінними.

source: The argument to the constructor is now permitted to be a :class:`float` instance.
uk: Аргументом конструктора тепер дозволено бути екземпляром :class:`float`.

source: :class:`float` arguments raise an exception if the :exc:`FloatOperation` trap is set. By default the trap is off.
uk: Аргументи :class:`float` викликають виняток, якщо встановлено перехоплення :exc:`FloatOperation`. За замовчуванням перехоплення вимкнено.

source: Underscores are allowed for grouping, as with integral and floating-point literals in code.
uk: Підкреслення дозволено для групування, як і з інтегральними літералами та літералами з плаваючою комою в коді.

source: Decimal floating point objects share many properties with the other built-in numeric types such as :class:`float` and :class:`int`. All of the usual math operations and special methods apply. Likewise, decimal objects can be copied, pickled, printed, used as dictionary keys, used as set elements, compared, sorted, and coerced to another type (such as :class:`float` or :class:`int`).
uk: Десяткові об’єкти з плаваючою комою мають багато спільних властивостей з іншими вбудованими числовими типами, такими як :class:`float` і :class:`int`. Застосовуються всі звичайні математичні операції та спеціальні методи. Так само десяткові об’єкти можна копіювати, маринувати, друкувати, використовувати як ключі до словника, використовувати як елементи набору, порівнювати, сортувати та переводити до іншого типу (наприклад, :class:`float` або :class:`int`).

source: There are some small differences between arithmetic on Decimal objects and arithmetic on integers and floats. When the remainder operator ``%`` is applied to Decimal objects, the sign of the result is the sign of the *dividend* rather than the sign of the divisor::
uk: Існують деякі невеликі відмінності між арифметикою на десяткових об’єктах і арифметикою на цілих числах і числах з плаваючою точкою. Коли оператор залишку ``%`` застосовується до десяткових об’єктів, знаком результату є знак *діленого*, а не знак дільника::

source: The integer division operator ``//`` behaves analogously, returning the integer part of the true quotient (truncating towards zero) rather than its floor, so as to preserve the usual identity ``x == (x // y) * y + x % y``::
uk: Оператор цілочисельного ділення ``//`` поводиться аналогічно, повертаючи цілу частину справжньої частки (урізану до нуля), а не її нижню частину, щоб зберегти звичайну тотожність ``x == (x // y) * y + x % y``::

source: The ``%`` and ``//`` operators implement the ``remainder`` and ``divide-integer`` operations (respectively) as described in the specification.
uk: Оператори ``%`` і ``//`` реалізують операції ``remainder`` і ``divide-integer`` (відповідно), як описано в специфікації.

source: Decimal objects cannot generally be combined with floats or instances of :class:`fractions.Fraction` in arithmetic operations: an attempt to add a :class:`Decimal` to a :class:`float`, for example, will raise a :exc:`TypeError`. However, it is possible to use Python's comparison operators to compare a :class:`Decimal` instance ``x`` with another number ``y``. This avoids confusing results when doing equality comparisons between numbers of different types.
uk: Десяткові об’єкти зазвичай не можна поєднувати з числами з плаваючою точкою або екземплярами :class:`fractions.Fraction` в арифметичних операціях: спроба додати :class:`Decimal` до :class:`float`, наприклад, призведе до :exc:`TypeError`. Однак можна використовувати оператори порівняння Python для порівняння :class:`Decimal` екземпляра ``x`` з іншим числом ``y``. Це дозволяє уникнути плутанини в результатах під час порівняння рівності між числами різних типів.

source: Mixed-type comparisons between :class:`Decimal` instances and other numeric types are now fully supported.
uk: Порівняння змішаного типу між екземплярами :class:`Decimal` та іншими числовими типами тепер повністю підтримуються.

source: In addition to the standard numeric properties, decimal floating point objects also have a number of specialized methods:
uk: Окрім стандартних числових властивостей, десяткові об’єкти з плаваючою комою також мають ряд спеціалізованих методів:

source: Return the adjusted exponent after shifting out the coefficient's rightmost digits until only the lead digit remains: ``Decimal('321e+5').adjusted()`` returns seven. Used for determining the position of the most significant digit with respect to the decimal point.
uk: Повертає скоригований експонент після зміщення крайніх правих цифр коефіцієнта, доки не залишиться лише головна цифра: ``Decimal('321e+5').adjusted()`` повертає сім. Використовується для визначення позиції старшого розряду відносно коми.

source: Return a pair ``(n, d)`` of integers that represent the given :class:`Decimal` instance as a fraction, in lowest terms and with a positive denominator::
uk: Повертає пару ``(n, d)`` цілих чисел, які представляють даний екземпляр :class:`Decimal` у вигляді дробу в найменших членах і з позитивним знаменником::

source: The conversion is exact. Raise OverflowError on infinities and ValueError on NaNs.
uk: Перетворення точне. Викликайте OverflowError на нескінченності та ValueError на NaN.

source: Return a :term:`named tuple` representation of the number: ``DecimalTuple(sign, digits, exponent)``.
uk: Повертає представлення числа :term:`named tuple`: ``DecimalTuple(знак, цифри, експонента)``.
