Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/devmode.po
Languages: ru

source: Python Development Mode
ru: Режим разработки Python

source: The Python Development Mode introduces additional runtime checks that are too expensive to be enabled by default. It should not be more verbose than the default if the code is correct; new warnings are only emitted when an issue is detected.
ru: Режим разработки Python вводит дополнительные проверки во время выполнения, которые слишком дороги, чтобы их можно было включить по умолчанию. Оно не должно быть более подробным, чем значение по умолчанию, если код правильный; новые предупреждения выдаются только при обнаружении проблемы.

source: It can be enabled using the :option:`-X dev <-X>` command line option or by setting the :envvar:`PYTHONDEVMODE` environment variable to ``1``.
ru: Его можно включить с помощью параметра командной строки :option:`-X dev <-X>` или установив для переменной среды :envvar:`PYTHONDEVMODE` значение ``1``.

source: See also :ref:`Python debug build <debug-build>`.
ru: См. также :ref:`Отладочная сборка Python <debug-build>`.

source: Effects of the Python Development Mode
ru: Эффекты режима разработки Python

source: Enabling the Python Development Mode is similar to the following command, but with additional effects described below::
ru: Включение режима разработки Python аналогично следующей команде, но с дополнительными эффектами, описанными ниже:

source: Effects of the Python Development Mode:
ru: Эффекты режима разработки Python:

source: Add ``default`` :ref:`warning filter <describing-warning-filters>`. The following warnings are shown:
ru: Добавьте ``default`` :ref:`фильтр предупреждений <description-warning-filters>`. Отображаются следующие предупреждения:

source: Normally, the above warnings are filtered by the default :ref:`warning filters <describing-warning-filters>`.
ru: Обычно приведенные выше предупреждения фильтруются стандартными :ref:`фильтрами предупреждений <description-warning-filters>`.

source: It behaves as if the :option:`-W default <-W>` command line option is used.
ru: Он ведет себя так, как если бы использовался параметр командной строки :option:`-W default <-W>`.

source: Use the :option:`-W error <-W>` command line option or set the :envvar:`PYTHONWARNINGS` environment variable to ``error`` to treat warnings as errors.
ru: Используйте параметр командной строки :option:`-W error <-W>` или установите для переменной среды :envvar:`PYTHONWARNINGS` значение ``error``, чтобы рассматривать предупреждения как ошибки.

source: Install debug hooks on memory allocators to check for:
ru: Установите перехватчики отладки на распределителях памяти, чтобы проверить:

source: Buffer underflow
ru: Опустошение буфера

source: Buffer overflow
ru: Переполнение буфера

source: Memory allocator API violation
ru: Нарушение API распределителя памяти

source: Unsafe usage of the GIL
ru: Небезопасное использование GIL

source: See the :c:func:`PyMem_SetupDebugHooks` C function.
ru: См. функцию C :c:func:`PyMem_SetupDebugHooks`.

source: It behaves as if the :envvar:`PYTHONMALLOC` environment variable is set to ``debug``.
ru: Он ведет себя так, как будто для переменной среды :envvar:`PYTHONMALLOC` установлено значение ``debug``.

source: To enable the Python Development Mode without installing debug hooks on memory allocators, set the :envvar:`PYTHONMALLOC` environment variable to ``default``.
ru: Чтобы включить режим разработки Python без установки перехватчиков отладки на распределителях памяти, установите для переменной среды :envvar:`PYTHONMALLOC` значение ``default``.

source: Call :func:`faulthandler.enable` at Python startup to install handlers for the :const:`~signal.SIGSEGV`, :const:`~signal.SIGFPE`, :const:`~signal.SIGABRT`, :const:`~signal.SIGBUS` and :const:`~signal.SIGILL` signals to dump the Python traceback on a crash.
ru: Вызовите :func:`faulthandler.enable` при запуске Python, чтобы установить обработчики для :const:`~signal.SIGSEGV`, :const:`~signal.SIGFPE`, :const:`~signal.SIGABRT`, :const: `~signal.SIGBUS` и :const:`~signal.SIGILL` сигнализируют о сбросе трассировки Python при сбое.

source: It behaves as if the :option:`-X faulthandler <-X>` command line option is used or if the :envvar:`PYTHONFAULTHANDLER` environment variable is set to ``1``.
ru: Он ведет себя так, как если бы использовался параметр командной строки :option:`-X errorhandler <-X>` или если для переменной среды :envvar:`PYTHONFAULTHANDLER` установлено значение ``1``.

source: Enable :ref:`asyncio debug mode <asyncio-debug-mode>`. For example, :mod:`asyncio` checks for coroutines that were not awaited and logs them.
ru: Включите :ref:`режим отладки asyncio <asyncio-debug-mode>`. Например, :mod:`asyncio` проверяет наличие неожиданных сопрограмм и записывает их.

source: It behaves as if the :envvar:`PYTHONASYNCIODEBUG` environment variable is set to ``1``.
ru: Он ведет себя так, как будто для переменной среды :envvar:`PYTHONASYNCIODEBUG` установлено значение ``1``.

source: Check the *encoding* and *errors* arguments for string encoding and decoding operations. Examples: :func:`open`, :meth:`str.encode` and :meth:`bytes.decode`.
ru: Проверьте аргументы *encoding* и *errors* для операций кодирования и декодирования строк. Примеры: :func:`open`, :meth:`str.encode` и :meth:`bytes.decode`.

source: By default, for best performance, the *errors* argument is only checked at the first encoding/decoding error and the *encoding* argument is sometimes ignored for empty strings.
ru: По умолчанию для лучшей производительности аргумент *errors* проверяется только при первой ошибке кодирования/декодирования, а аргумент *encoding* иногда игнорируется для пустых строк.

source: The :class:`io.IOBase` destructor logs ``close()`` exceptions.
ru: Деструктор :class:`io.IOBase` регистрирует исключения ``close()``.

source: Set the :attr:`~sys.flags.dev_mode` attribute of :data:`sys.flags` to ``True``.
ru: Установите для атрибута :attr:`~sys.flags.dev_mode` :data:`sys.flags` значение ``True``.

source: The Python Development Mode does not enable the :mod:`tracemalloc` module by default, because the overhead cost (to performance and memory) would be too large. Enabling the :mod:`tracemalloc` module provides additional information on the origin of some errors. For example, :exc:`ResourceWarning` logs the traceback where the resource was allocated, and a buffer overflow error logs the traceback where the memory block was allocated.
ru: Режим разработки Python не включает модуль :mod:`tracemalloc` по умолчанию, поскольку накладные расходы (производительность и память) будут слишком велики. Включение модуля :mod:`tracemalloc` предоставляет дополнительную информацию о происхождении некоторых ошибок. Например, :exc:`ResourceWarning` регистрирует обратную трассировку места выделения ресурса, а ошибка переполнения буфера регистрирует обратную трассировку места выделения блока памяти.

source: The Python Development Mode does not prevent the :option:`-O` command line option from removing :keyword:`assert` statements nor from setting :const:`__debug__` to ``False``.
ru: Режим разработки Python не запрещает параметру командной строки :option:`-O` удалять операторы :keyword:`assert` и устанавливать для :const:`__debug__` значение ``False``.

source: The Python Development Mode can only be enabled at the Python startup. Its value can be read from :data:`sys.flags.dev_mode <sys.flags>`.
ru: Режим разработки Python можно включить только при запуске Python. Его значение можно прочитать из :data:`sys.flags.dev_mode <sys.flags>`.

source: The :class:`io.IOBase` destructor now logs ``close()`` exceptions.
ru: Деструктор :class:`io.IOBase` теперь регистрирует исключения ``close()``.

source: The *encoding* and *errors* arguments are now checked for string encoding and decoding operations.
ru: Аргументы *encoding* и *errors* теперь проверяются на предмет операций кодирования и декодирования строк.

source: ResourceWarning Example
ru: Пример ResourceWarning

source: Example of a script counting the number of lines of the text file specified in the command line::
ru: Пример скрипта, подсчитывающего количество строк текстового файла, указанного в командной строке:

source: The script does not close the file explicitly. By default, Python does not emit any warning. Example using README.txt, which has 269 lines:
ru: Скрипт не закрывает файл явно. По умолчанию Python не выдает никаких предупреждений. Пример использования README.txt, который имеет 269 строк:

source: Enabling the Python Development Mode displays a :exc:`ResourceWarning` warning:
ru: Включение режима разработки Python отображает предупреждение :exc:`ResourceWarning`:

source: In addition, enabling :mod:`tracemalloc` shows the line where the file was opened:
ru: Кроме того, включение :mod:`tracemalloc` показывает строку, где файл был открыт:

source: The fix is to close explicitly the file. Example using a context manager::
ru: Исправление заключается в явном закрытии файла. Пример использования контекстного менеджера::

source: Not closing a resource explicitly can leave a resource open for way longer than expected; it can cause severe issues upon exiting Python. It is bad in CPython, but it is even worse in PyPy. Closing resources explicitly makes an application more deterministic and more reliable.
ru: Если не закрыть ресурс явно, он может остаться открытым намного дольше, чем ожидалось; это может вызвать серьезные проблемы при выходе из Python. В CPython всё плохо, но в PyPy ещё хуже. Явное закрытие ресурсов делает приложение более детерминированным и надежным.

source: Bad file descriptor error example
ru: Пример ошибки неверного дескриптора файла

source: Script displaying the first line of itself::
ru: Скрипт, отображающий первую строку самого себя::

source: By default, Python does not emit any warning:
ru: По умолчанию Python не выдает никаких предупреждений:

source: The Python Development Mode shows a :exc:`ResourceWarning` and logs a "Bad file descriptor" error when finalizing the file object:
ru: В режиме разработки Python отображается :exc:`ResourceWarning` и регистрируется ошибка «Неверный файловый дескриптор» при финализации файлового объекта:

source: ``os.close(fp.fileno())`` closes the file descriptor. When the file object finalizer tries to close the file descriptor again, it fails with the ``Bad file descriptor`` error. A file descriptor must be closed only once. In the worst case scenario, closing it twice can lead to a crash (see :issue:`18748` for an example).
ru: ``os.close(fp.fileno())`` закрывает дескриптор файла. Когда финализатор файлового объекта снова пытается закрыть дескриптор файла, он терпит неудачу с ошибкой ``Bad file descriptor``. Дескриптор файла должен быть закрыт только один раз. В худшем случае двойное закрытие может привести к сбою (пример см. в :issue:`18748`).

source: The fix is to remove the ``os.close(fp.fileno())`` line, or open the file with ``closefd=False``.
ru: Исправление состоит в том, чтобы удалить строку ``os.close(fp.fileno())`` или открыть файл с ``closefd=False``.
