Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/dialog.po
Languages: ru

source: Tkinter Dialogs
ru: Диалоги Tkinter

source: :mod:`tkinter.simpledialog` --- Standard Tkinter input dialogs
ru: :mod:`tkinter.simpledialog` --- Стандартные диалоговые окна ввода Tkinter

source: **Source code:** :source:`Lib/tkinter/simpledialog.py`
ru: **Исходный код:** :source:`Lib/tkinter/simpledialog.py`

source: The :mod:`tkinter.simpledialog` module contains convenience classes and functions for creating simple modal dialogs to get a value from the user.
ru: Модуль :mod:`tkinter.simpledialog` содержит удобные классы и функции для создания простых модальных диалогов для получения значения от пользователя.

source: The above three functions provide dialogs that prompt the user to enter a value of the desired type.
ru: Вышеупомянутые три функции предоставляют диалоговые окна, предлагающие пользователю ввести значение желаемого типа.

source: The base class for custom dialogs.
ru: Базовый класс для пользовательских диалогов.

source: Override to construct the dialog's interface and return the widget that should have initial focus.
ru: Переопределить, чтобы создать интерфейс диалогового окна и вернуть виджет, который должен иметь первоначальный фокус.

source: Default behaviour adds OK and Cancel buttons. Override for custom button layouts.
ru: Поведение по умолчанию добавляет кнопки «ОК» и «Отмена». Переопределить пользовательские макеты кнопок.

source: :mod:`tkinter.filedialog` --- File selection dialogs
ru: :mod:`tkinter.filedialog` --- Диалоговые окна выбора файла

source: **Source code:** :source:`Lib/tkinter/filedialog.py`
ru: **Исходный код:** :source:`Lib/tkinter/filedialog.py`

source: The :mod:`tkinter.filedialog` module provides classes and factory functions for creating file/directory selection windows.
ru: Модуль :mod:`tkinter.filedialog` предоставляет классы и фабричные функции для создания окон выбора файлов/каталогов.

source: Native Load/Save Dialogs
ru: Собственные диалоги загрузки/сохранения

source: The following classes and functions provide file dialog windows that combine a native look-and-feel with configuration options to customize behaviour. The following keyword arguments are applicable to the classes and functions listed below:
ru: Следующие классы и функции предоставляют диалоговые окна файлов, которые сочетают в себе собственный внешний вид с параметрами конфигурации для настройки поведения. Следующие аргументы ключевых слов применимы к классам и функциям, перечисленным ниже:

source: *parent* - the window to place the dialog on top of
ru: *parent* - окно, поверх которого будет размещено диалоговое окно.

source: *title* - the title of the window
ru: *title* - заголовок окна

source: *initialdir* - the directory that the dialog starts in
ru: *initialdir* - каталог, в котором начинается диалог.

source: *initialfile* - the file selected upon opening of the dialog
ru: *initialfile* - файл, выбранный при открытии диалога

source: *filetypes* - a sequence of (label, pattern) tuples, '*' wildcard is allowed
ru: *filetypes* — последовательность кортежей (меток, шаблонов), допускается подстановочный знак '*'.

source: *defaultextension* - default extension to append to file (save dialogs)
ru: *defaultextension* - расширение по умолчанию для добавления в файл (диалоги сохранения)

source: *multiple* - when true, selection of multiple items is allowed
ru: *multiple* — если true, разрешен выбор нескольких элементов.

source: **Static factory functions**
ru: **Статические заводские функции**

source: The below functions when called create a modal, native look-and-feel dialog, wait for the user's selection, then return the selected value(s) or ``None`` to the caller.
ru: Приведенные ниже функции при вызове создают модальное диалоговое окно с собственным внешним видом, ждут выбора пользователя, а затем возвращают выбранные значения или ``None`` вызывающей стороне.

source: The above two functions create an :class:`Open` dialog and return the opened file object(s) in read-only mode.
ru: Две вышеупомянутые функции создают диалог :class:`Open` и возвращают открытые файловые объекты в режиме только для чтения.

source: Create a :class:`SaveAs` dialog and return a file object opened in write-only mode.
ru: Создайте диалог :class:`SaveAs` и верните файловый объект, открытый в режиме только для записи.

source: The above two functions create an :class:`Open` dialog and return the selected filename(s) that correspond to existing file(s).
ru: Две вышеуказанные функции создают диалог :class:`Open` и возвращают выбранные имена файлов, соответствующие существующим файлам.

source: Create a :class:`SaveAs` dialog and return the selected filename.
ru: Создайте диалоговое окно :class:`SaveAs` и верните выбранное имя файла.

source: Prompt user to select a directory.
ru: Предложить пользователю выбрать каталог.

source: Additional keyword option:
ru: Дополнительный вариант ключевого слова:

source: *mustexist* - determines if selection must be an existing directory.
ru: *mustexist* — определяет, должен ли быть выбран существующий каталог.

source: The above two classes provide native dialog windows for saving and loading files.
ru: Два вышеупомянутых класса предоставляют собственные диалоговые окна для сохранения и загрузки файлов.

source: **Convenience classes**
ru: **Классы удобства**.

source: The below classes are used for creating file/directory windows from scratch. These do not emulate the native look-and-feel of the platform.
ru: Приведенные ниже классы используются для создания окон файлов/каталогов с нуля. Они не имитируют внешний вид платформы.

source: Create a dialog prompting the user to select a directory.
ru: Создайте диалоговое окно, предлагающее пользователю выбрать каталог.

source: The *FileDialog* class should be subclassed for custom event handling and behaviour.
ru: Класс *FileDialog* должен быть подклассом для настраиваемой обработки событий и поведения.

source: Create a basic file selection dialog.
ru: Создайте базовый диалог выбора файла.

source: Trigger the termination of the dialog window.
ru: Запустить завершение диалогового окна.

source: Event handler for double-click event on directory.
ru: Обработчик событий двойного щелчка по каталогу.

source: Event handler for click event on directory.
ru: Обработчик событий клика по каталогу.

source: Event handler for double-click event on file.
ru: Обработчик событий двойного щелчка по файлу.

source: Event handler for single-click event on file.
ru: Обработчик событий для события одиночного щелчка по файлу.

source: Filter the files by directory.
ru: Фильтруйте файлы по каталогу.

source: Retrieve the file filter currently in use.
ru: Получите фильтр файлов, который используется в данный момент.

source: Retrieve the currently selected item.
ru: Получить текущий выбранный элемент.

source: Render dialog and start event loop.
ru: Отрисуйте диалог и запустите цикл обработки событий.

source: Exit dialog returning current selection.
ru: Диалог выхода с возвратом текущего выбора.

source: Exit dialog returning filename, if any.
ru: Диалоговое окно выхода возвращает имя файла, если таковое имеется.

source: Set the file filter.
ru: Установите фильтр файлов.

source: Update the current file selection to *file*.
ru: Обновите текущий выбранный файл на *file*.

source: A subclass of FileDialog that creates a dialog window for selecting an existing file.
ru: Подкласс FileDialog, создающий диалоговое окно для выбора существующего файла.

source: Test that a file is provided and that the selection indicates an already existing file.
ru: Проверьте, что файл предоставлен и что выбор указывает на уже существующий файл.

source: A subclass of FileDialog that creates a dialog window for selecting a destination file.
ru: Подкласс FileDialog, который создает диалоговое окно для выбора файла назначения.

source: Test whether or not the selection points to a valid file that is not a directory. Confirmation is required if an already existing file is selected.
ru: Проверьте, указывает ли выбор на действительный файл, который не является каталогом. Подтверждение требуется, если выбран уже существующий файл.

source: :mod:`tkinter.commondialog` --- Dialog window templates
ru: :mod:`tkinter.commondialog` --- Шаблоны диалоговых окон

source: **Source code:** :source:`Lib/tkinter/commondialog.py`
ru: **Исходный код:** :source:`Lib/tkinter/commondialog.py`

source: The :mod:`tkinter.commondialog` module provides the :class:`Dialog` class that is the base class for dialogs defined in other supporting modules.
ru: Модуль :mod:`tkinter.commondialog` предоставляет класс :class:`Dialog`, который является базовым классом для диалогов, определенных в других вспомогательных модулях.

source: Render the Dialog window.
ru: Отобразите диалоговое окно.

source: Modules :mod:`tkinter.messagebox`, :ref:`tut-files`
ru: Модули :mod:`tkinter.messagebox`, :ref:`tut-files`
