Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/difflib.po
Languages: ru

source: Optional argument *isjunk* must be ``None`` (the default) or a one-argument function that takes a sequence element and returns true if and only if the element is "junk" and should be ignored. Passing ``None`` for *isjunk* is equivalent to passing ``lambda x: False``; in other words, no elements are ignored. For example, pass::
ru: Необязательный аргумент *isjunk* должен иметь значение None (по умолчанию) или функцию с одним аргументом, которая принимает элемент последовательности и возвращает true тогда и только тогда, когда элемент является «мусорным» и его следует игнорировать. Передача ``None`` для *isjunk* эквивалентна передаче ``lambda x: False``; другими словами, ни один элемент не игнорируется. Например, передайте::

source: if you're comparing lines as sequences of characters, and don't want to synch up on blanks or hard tabs.
ru: если вы сравниваете строки как последовательности символов и не хотите синхронизироваться по пробелам или жестким табуляциям.

source: The optional arguments *a* and *b* are sequences to be compared; both default to empty strings. The elements of both sequences must be :term:`hashable`.
ru: Необязательные аргументы *a* и *b* представляют собой сравниваемые последовательности; оба по умолчанию имеют пустые строки. Элементы обеих последовательностей должны быть :term:`hashable`.

source: The optional argument *autojunk* can be used to disable the automatic junk heuristic.
ru: Необязательный аргумент *autojunk* можно использовать для отключения автоматической эвристики нежелательной почты.

source: SequenceMatcher objects get three data attributes: *bjunk* is the set of elements of *b* for which *isjunk* is ``True``; *bpopular* is the set of non-junk elements considered popular by the heuristic (if it is not disabled); *b2j* is a dict mapping the remaining elements of *b* to a list of positions where they occur. All three are reset whenever *b* is reset with :meth:`set_seqs` or :meth:`set_seq2`.
ru: Объекты SequenceMatcher получают три атрибута данных: *bjunk* — это набор элементов *b*, для которых *isjunk* имеет значение ``True``; *bpopular* — набор ненужных элементов, которые эвристика считает популярными (если она не отключена); *b2j* — это словарь, отображающий оставшиеся элементы *b* в список позиций, где они встречаются. Все три сбрасываются каждый раз, когда *b* сбрасывается с помощью :meth:`set_seqs` или :meth:`set_seq2`.

source: The *bjunk* and *bpopular* attributes.
ru: Атрибуты *bjunk* и *bpopular*.

source: :class:`SequenceMatcher` objects have the following methods:
ru: Объекты :class:`SequenceMatcher` имеют следующие методы:

source: Set the two sequences to be compared.
ru: Установите две последовательности для сравнения.

source: :class:`SequenceMatcher` computes and caches detailed information about the second sequence, so if you want to compare one sequence against many sequences, use :meth:`set_seq2` to set the commonly used sequence once and call :meth:`set_seq1` repeatedly, once for each of the other sequences.
ru: :class:`SequenceMatcher` вычисляет и кэширует подробную информацию о второй последовательности, поэтому, если вы хотите сравнить одну последовательность со многими последовательностями, используйте :meth:`set_seq2`, чтобы один раз установить часто используемую последовательность, и вызовите :meth:`set_seq1` неоднократно, по одному разу для каждой из остальных последовательностей.

source: Set the first sequence to be compared. The second sequence to be compared is not changed.
ru: Установите первую последовательность для сравнения. Вторая сравниваемая последовательность не изменяется.

source: Set the second sequence to be compared. The first sequence to be compared is not changed.
ru: Установите вторую последовательность для сравнения. Первая сравниваемая последовательность не изменяется.

source: Find longest matching block in ``a[alo:ahi]`` and ``b[blo:bhi]``.
ru: Найдите самый длинный соответствующий блок в ``a[alo:ahi]`` и ``b[blo:bhi]``.

source: If *isjunk* was omitted or ``None``, :meth:`find_longest_match` returns ``(i, j, k)`` such that ``a[i:i+k]`` is equal to ``b[j:j+k]``, where ``alo <= i <= i+k <= ahi`` and ``blo <= j <= j+k <= bhi``. For all ``(i', j', k')`` meeting those conditions, the additional conditions ``k >= k'``, ``i <= i'``, and if ``i == i'``, ``j <= j'`` are also met. In other words, of all maximal matching blocks, return one that starts earliest in *a*, and of all those maximal matching blocks that start earliest in *a*, return the one that starts earliest in *b*.
ru: Если *isjunk* опущен или ``Нет``, :meth:`find_longest_match` возвращает ``(i, j, k)``, такой что ``a[i:i+k]`` равен `` b[j:j+k]``, где ``alo <= i <= i+k <= ahi`` и ``blo <= j <= j+k <= bhi``. Для всех ``(i', j', k')``, удовлетворяющих этим условиям, дополнительные условия ``k >= k'``, ``i <= i'``, и если ``i == i'``, ``j <= j'`` также встречаются. Другими словами, из всех блоков максимального соответствия верните тот, который начинается раньше всего в *a*, а из всех блоков максимального соответствия, которые начинаются раньше всего в *a*, верните тот, который начинается раньше в *b*.

source: If *isjunk* was provided, first the longest matching block is determined as above, but with the additional restriction that no junk element appears in the block. Then that block is extended as far as possible by matching (only) junk elements on both sides. So the resulting block never matches on junk except as identical junk happens to be adjacent to an interesting match.
ru: Если было указано *isjunk*, сначала определяется самый длинный соответствующий блок, как указано выше, но с дополнительным ограничением, заключающимся в том, что в блоке не появляется ненужный элемент. Затем этот блок расширяется, насколько это возможно, путем сопоставления (только) ненужных элементов с обеих сторон. Таким образом, полученный блок никогда не соответствует мусору, за исключением тех случаев, когда идентичный мусор оказывается рядом с интересным совпадением.

source: Here's the same example as before, but considering blanks to be junk. That prevents ``' abcd'`` from matching the ``' abcd'`` at the tail end of the second sequence directly. Instead only the ``'abcd'`` can match, and matches the leftmost ``'abcd'`` in the second sequence:
ru: Вот тот же пример, что и раньше, но пробелы считаются мусором. Это предотвращает прямое сопоставление ``' abcd'`` с ``' abcd'`` в конце второй последовательности. Вместо этого может совпадать только ``'abcd'``, и он соответствует самому левому ``'abcd'`` во второй последовательности:

source: If no blocks match, this returns ``(alo, blo, 0)``.
ru: Если ни один блок не совпадает, возвращается ``(alo, blo, 0)``.

source: This method returns a :term:`named tuple` ``Match(a, b, size)``.
ru: Этот метод возвращает кортеж с именем ``Match(a, b, size)``.

source: Added default arguments.
ru: Добавлены аргументы по умолчанию.

source: Return list of triples describing non-overlapping matching subsequences. Each triple is of the form ``(i, j, n)``, and means that ``a[i:i+n] == b[j:j+n]``. The triples are monotonically increasing in *i* and *j*.
ru: Возвращаемый список троек, описывающих непересекающиеся совпадающие подпоследовательности. Каждая тройка имеет форму ``(i, j, n)`` и означает, что ``a[i:i+n] == b[j:j+n]``. Тройки монотонно возрастают в *i* и *j*.

source: The last triple is a dummy, and has the value ``(len(a), len(b), 0)``. It is the only triple with ``n == 0``. If ``(i, j, n)`` and ``(i', j', n')`` are adjacent triples in the list, and the second is not the last triple in the list, then ``i+n < i'`` or ``j+n < j'``; in other words, adjacent triples always describe non-adjacent equal blocks.
ru: Последняя тройка является фиктивной и имеет значение ``(len(a), len(b), 0)``. Это единственная тройка с ``n == 0``. Если ``(i, j, n)`` и ``(i', j', n')`` являются соседними тройками в списке, а вторая не последняя тройка в списке, то ``i +n < i'`` или ``j+n < j'``; другими словами, соседние тройки всегда описывают несмежные равные блоки.

source: Return list of 5-tuples describing how to turn *a* into *b*. Each tuple is of the form ``(tag, i1, i2, j1, j2)``. The first tuple has ``i1 == j1 == 0``, and remaining tuples have *i1* equal to the *i2* from the preceding tuple, and, likewise, *j1* equal to the previous *j2*.
ru: Возвращаемый список из 5 кортежей, описывающий, как превратить *a* в *b*. Каждый кортеж имеет вид ``(tag, i1, i2, j1, j2)``. Первый кортеж имеет ``i1 == j1 == 0``, а остальные кортежи имеют *i1*, равный *i2* из предыдущего кортежа, и, аналогично, *j1* равен предыдущему *j2*.

source: The *tag* values are strings, with these meanings:
ru: Значения *tag* представляют собой строки со следующими значениями:

source: Value
ru: Значение

source: ``a[i1:i2]`` should be replaced by ``b[j1:j2]``.
ru: ``a[i1:i2]`` следует заменить на ``b[j1:j2]``.

source: ``a[i1:i2]`` should be deleted. Note that ``j1 == j2`` in this case.
ru: ``a[i1:i2]`` следует удалить. Обратите внимание, что в этом случае ``j1 == j2``.

source: ``b[j1:j2]`` should be inserted at ``a[i1:i1]``. Note that ``i1 == i2`` in this case.
ru: `b[j1:j2]` следует вставить в `a[i1:i11]`. Обратите внимание, что в этом случае `i1 == i2`.

source: ``a[i1:i2] == b[j1:j2]`` (the sub-sequences are equal).
ru: ``a[i1:i2] == b[j1:j2]`` (подпоследовательности равны).

source: For example::
ru: Например::

source: Return a :term:`generator` of groups with up to *n* lines of context.
ru: Возвращает :term:`генератор` групп, содержащих до *n* строк контекста.

source: Starting with the groups returned by :meth:`get_opcodes`, this method splits out smaller change clusters and eliminates intervening ranges which have no changes.
ru: Начиная с групп, возвращаемых :meth:`get_opcodes`, этот метод разделяет более мелкие кластеры изменений и исключает промежуточные диапазоны, в которых нет изменений.

source: The groups are returned in the same format as :meth:`get_opcodes`.
ru: Группы возвращаются в том же формате, что и :meth:`get_opcodes`.

source: Return a measure of the sequences' similarity as a float in the range [0, 1].
ru: Возвращает меру сходства последовательностей в виде числа с плавающей запятой в диапазоне [0, 1].

source: Where T is the total number of elements in both sequences, and M is the number of matches, this is 2.0\*M / T. Note that this is ``1.0`` if the sequences are identical, and ``0.0`` if they have nothing in common.
ru: Где T — общее количество элементов в обеих последовательностях, а M — количество совпадений, это 2,0\*M / T. Обратите внимание, что это «1,0», если последовательности идентичны, и «0,0». если у них нет ничего общего.

source: This is expensive to compute if :meth:`get_matching_blocks` or :meth:`get_opcodes` hasn't already been called, in which case you may want to try :meth:`quick_ratio` or :meth:`real_quick_ratio` first to get an upper bound.
ru: Вычислить это будет дорого, если :meth:`get_matching_blocks` или :meth:`get_opcodes` еще не был вызван, и в этом случае вы можете сначала попробовать :meth:`quick_ratio` или :meth:`real_quick_ratio`, чтобы получить верхняя граница.

source: Caution: The result of a :meth:`ratio` call may depend on the order of the arguments. For instance::
ru: Внимание: результат вызова :meth:`ratio` может зависеть от порядка аргументов. Например::

source: Return an upper bound on :meth:`ratio` relatively quickly.
ru: Возвращает верхнюю границу :meth:`ratio` относительно быстро.

source: Return an upper bound on :meth:`ratio` very quickly.
ru: Возвращает верхнюю границу :meth:`ratio` очень быстро.

source: The three methods that return the ratio of matching to total characters can give different results due to differing levels of approximation, although :meth:`~SequenceMatcher.quick_ratio` and :meth:`~SequenceMatcher.real_quick_ratio` are always at least as large as :meth:`~SequenceMatcher.ratio`:
ru: Три метода, которые возвращают соотношение совпадений к общему количеству символов, могут давать разные результаты из-за разных уровней аппроксимации, хотя :meth:`~SequenceMatcher.quick_ratio` и :meth:`~SequenceMatcher.real_quick_ratio` всегда имеют размер не меньше, чем :meth:`~SequenceMatcher.ratio`:

source: SequenceMatcher Examples
ru: Примеры SequenceMatcher

source: This example compares two strings, considering blanks to be "junk":
ru: В этом примере сравниваются две строки, считая пробелы «мусором»:

source: :meth:`~SequenceMatcher.ratio` returns a float in [0, 1], measuring the similarity of the sequences. As a rule of thumb, a :meth:`~SequenceMatcher.ratio` value over 0.6 means the sequences are close matches:
ru: :meth:`~SequenceMatcher.ratio` возвращает число с плавающей запятой в [0, 1], измеряя сходство последовательностей. Как правило, значение :meth:`~SequenceMatcher.ratio` больше 0,6 означает, что последовательности имеют близкое совпадение:

source: If you're only interested in where the sequences match, :meth:`~SequenceMatcher.get_matching_blocks` is handy:
ru: Если вас интересует только совпадение последовательностей, вам пригодится :meth:`~SequenceMatcher.get_matching_blocks`:

source: Note that the last tuple returned by :meth:`~SequenceMatcher.get_matching_blocks` is always a dummy, ``(len(a), len(b), 0)``, and this is the only case in which the last tuple element (number of elements matched) is ``0``.
ru: Обратите внимание, что последний кортеж, возвращаемый :meth:`~SequenceMatcher.get_matching_blocks`, всегда является фиктивным, ``(len(a), len(b), 0)``, и это единственный случай, в котором последний кортеж элемент (количество совпадающих элементов) равен ``0``.

source: If you want to know how to change the first sequence into the second, use :meth:`~SequenceMatcher.get_opcodes`:
ru: Если вы хотите узнать, как изменить первую последовательность на вторую, используйте :meth:`~SequenceMatcher.get_opcodes`:

source: The :func:`get_close_matches` function in this module which shows how simple code building on :class:`SequenceMatcher` can be used to do useful work.
ru: Функция :func:`get_close_matches` в этом модуле показывает, как простое построение кода на :class:`SequenceMatcher` можно использовать для выполнения полезной работы.

source: `Simple version control recipe <https://code.activestate.com/recipes/576729-simple-version-control/>`_ for a small application built with :class:`SequenceMatcher`.
ru: `Простой рецепт контроля версий <https://code.activestate.com/recipes/576729-simple-version-control/>`_ для небольшого приложения, созданного с помощью :class:`SequenceMatcher`.

source: Differ Objects
ru: Разные объекты

source: Note that :class:`Differ`\ -generated deltas make no claim to be **minimal** diffs. To the contrary, minimal diffs are often counter-intuitive, because they synch up anywhere possible, sometimes accidental matches 100 pages apart. Restricting synch points to contiguous matches preserves some notion of locality, at the occasional cost of producing a longer diff.
ru: Обратите внимание, что :class:`Differ`\ дельты, сгенерированные :class:`Differ`\, не претендуют на звание **минимальных** различий. Напротив, минимальные различия часто нелогичны, потому что они синхронизируются везде, где это возможно, иногда случайные совпадения с интервалом в 100 страниц. Ограничение точек синхронизации смежными совпадениями сохраняет некоторое представление о локальности, хотя иногда приходится платить за создание более длинных различий.

source: The :class:`Differ` class has this constructor:
ru: Класс :class:`Differ` имеет такой конструктор:

source: Optional keyword parameters *linejunk* and *charjunk* are for filter functions (or ``None``):
ru: Необязательные параметры ключевых слов *linejunk* и *charjunk* предназначены для функций фильтра (или ``None``):

source: *linejunk*: A function that accepts a single string argument, and returns true if the string is junk. The default is ``None``, meaning that no line is considered junk.
ru: *linejunk*: функция, которая принимает один строковый аргумент и возвращает true, если строка является мусорной. По умолчанию установлено значение «Нет», что означает, что ни одна строка не считается ненужной.

source: *charjunk*: A function that accepts a single character argument (a string of length 1), and returns true if the character is junk. The default is ``None``, meaning that no character is considered junk.
ru: *charjunk*: функция, которая принимает в качестве аргумента один символ (строку длиной 1) и возвращает true, если символ является мусорным. По умолчанию установлено значение «Нет», что означает, что ни один символ не считается мусором.

source: These junk-filtering functions speed up matching to find differences and do not cause any differing lines or characters to be ignored. Read the description of the :meth:`~SequenceMatcher.find_longest_match` method's *isjunk* parameter for an explanation.
ru: Эти функции фильтрации нежелательной почты ускоряют сопоставление при поиске различий и не приводят к игнорированию отличающихся строк или символов. Прочтите описание параметра *isjunk* метода :meth:`~SequenceMatcher.find_longest_match` для получения пояснения.

source: :class:`Differ` objects are used (deltas generated) via a single method:
ru: Объекты :class:`Differ` используются (генерируются дельты) с помощью одного метода:

source: Compare two sequences of lines, and generate the delta (a sequence of lines).
ru: Сравните две последовательности строк и сгенерируйте дельту (последовательность строк).

source: Each sequence must contain individual single-line strings ending with newlines. Such sequences can be obtained from the :meth:`~io.IOBase.readlines` method of file-like objects. The delta generated also consists of newline-terminated strings, ready to be printed as-is via the :meth:`~io.IOBase.writelines` method of a file-like object.
ru: Каждая последовательность должна содержать отдельные однострочные строки, заканчивающиеся символами новой строки. Такие последовательности можно получить из метода файловоподобных объектов :meth:`~io.IOBase.readlines`. Сгенерированная дельта также состоит из строк, заканчивающихся символом новой строки, готовых к печати как есть с помощью метода :meth:`~io.IOBase.writelines` файлового объекта.

source: Differ Example
ru: Другой пример

source: This example compares two texts. First we set up the texts, sequences of individual single-line strings ending with newlines (such sequences can also be obtained from the :meth:`~io.IOBase.readlines` method of file-like objects):
ru: В этом примере сравниваются два текста. Сначала мы настраиваем тексты, последовательности отдельных однострочных строк, заканчивающихся символами новой строки (такие последовательности также можно получить из метода файловоподобных объектов :meth:`~io.IOBase.readlines`):

source: Next we instantiate a Differ object:
ru: Далее мы создаем экземпляр объекта Differ:

source: Note that when instantiating a :class:`Differ` object we may pass functions to filter out line and character "junk." See the :meth:`Differ` constructor for details.
ru: Обратите внимание, что при создании экземпляра объекта :class:`Differ` мы можем передавать функции для фильтрации строкового и символьного «мусора». Подробности смотрите в конструкторе :meth:`Differ`.

source: Finally, we compare the two:
ru: Наконец, мы сравним их:

source: ``result`` is a list of strings, so let's pretty-print it:
ru: ``result`` — это список строк, поэтому давайте его распечатаем:

source: As a single multi-line string it looks like this:
ru: В виде одной многострочной строки это выглядит так:

source: A command-line interface to difflib
ru: Интерфейс командной строки для difflib

source: This example shows how to use difflib to create a ``diff``-like utility.
ru: В этом примере показано, как использовать difflib для создания утилиты, похожей на diff.

source: ndiff example
ru: пример ndiff

source: This example shows how to use :func:`difflib.ndiff`.
ru: В этом примере показано, как использовать :func:`difflib.ndiff`.
