Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/difflib.po
Languages: ru

source: :mod:`!difflib` --- Helpers for computing deltas
ru: :mod:`!difflib` --- Помощники для вычисления дельт

source: **Source code:** :source:`Lib/difflib.py`
ru: **Исходный код:** :source:`Lib/difflib.py`

source: This module provides classes and functions for comparing sequences. It can be used for example, for comparing files, and can produce information about file differences in various formats, including HTML and context and unified diffs. For comparing directories and files, see also, the :mod:`filecmp` module.
ru: Этот модуль предоставляет классы и функции для сравнения последовательностей. Его можно использовать, например, для сравнения файлов и предоставлять информацию о различиях файлов в различных форматах, включая HTML, контекст и унифицированные различия. Для сравнения каталогов и файлов см. также модуль :mod:`filecmp`.

source: This is a flexible class for comparing pairs of sequences of any type, so long as the sequence elements are :term:`hashable`. The basic algorithm predates, and is a little fancier than, an algorithm published in the late 1980's by Ratcliff and Obershelp under the hyperbolic name "gestalt pattern matching." The idea is to find the longest contiguous matching subsequence that contains no "junk" elements; these "junk" elements are ones that are uninteresting in some sense, such as blank lines or whitespace. (Handling junk is an extension to the Ratcliff and Obershelp algorithm.) The same idea is then applied recursively to the pieces of the sequences to the left and to the right of the matching subsequence. This does not yield minimal edit sequences, but does tend to yield matches that "look right" to people.
ru: Это гибкий класс для сравнения пар последовательностей любого типа, при условии, что элементы последовательности являются :term:`hashable`. Базовый алгоритм предшествует алгоритму, опубликованному в конце 1980-х годов Рэтклиффом и Оберсхелпом под гиперболическим названием «сопоставление гештальт-образцов» и является немного более сложным, чем алгоритм. Идея состоит в том, чтобы найти самую длинную непрерывную совпадающую подпоследовательность, которая не содержит «мусорных» элементов; эти «мусорные» элементы в некотором смысле неинтересны, например, пустые строки или пробелы. (Обработка мусора является расширением алгоритма Рэтклиффа и Оберсхелпа.) Затем та же идея рекурсивно применяется к частям последовательностей слева и справа от совпадающей подпоследовательности. Это не дает минимальных последовательностей редактирования, но имеет тенденцию давать совпадения, которые «выглядят правильно» для людей.

source: **Timing:** The basic Ratcliff-Obershelp algorithm is cubic time in the worst case and quadratic time in the expected case. :class:`SequenceMatcher` is quadratic time for the worst case and has expected-case behavior dependent in a complicated way on how many elements the sequences have in common; best case time is linear.
ru: **Время.** Основной алгоритм Рэтклиффа-Оберсхелпа использует кубическое время в худшем случае и квадратичное время в ожидаемом случае. :class:`SequenceMatcher` представляет собой квадратичное время для наихудшего случая и имеет ожидаемое поведение, сложным образом зависящее от того, сколько общих элементов имеют последовательности; в лучшем случае время линейно.

source: **Automatic junk heuristic:** :class:`SequenceMatcher` supports a heuristic that automatically treats certain sequence items as junk. The heuristic counts how many times each individual item appears in the sequence. If an item's duplicates (after the first one) account for more than 1% of the sequence and the sequence is at least 200 items long, this item is marked as "popular" and is treated as junk for the purpose of sequence matching. This heuristic can be turned off by setting the ``autojunk`` argument to ``False`` when creating the :class:`SequenceMatcher`.
ru: **Автоматическая эвристика нежелательной почты:** :class:`SequenceMatcher` поддерживает эвристику, которая автоматически рассматривает определенные элементы последовательности как ненужную. Эвристика подсчитывает, сколько раз каждый отдельный элемент появляется в последовательности. Если дубликаты элемента (после первого) составляют более 1% последовательности и длина последовательности составляет не менее 200 элементов, этот элемент помечается как «популярный» и рассматривается как мусор для целей сопоставления последовательностей. Эту эвристику можно отключить, установив для аргумента autojunk значение False при создании :class:`SequenceMatcher`.

source: Added the *autojunk* parameter.
ru: Добавлен параметр *autojunk*.

source: This is a class for comparing sequences of lines of text, and producing human-readable differences or deltas. Differ uses :class:`SequenceMatcher` both to compare sequences of lines, and to compare sequences of characters within similar (near-matching) lines.
ru: Это класс для сравнения последовательностей строк текста и создания удобочитаемых различий или дельт. Differ использует :class:`SequenceMatcher` как для сравнения последовательностей строк, так и для сравнения последовательностей символов в похожих (почти совпадающих) строках.

source: Each line of a :class:`Differ` delta begins with a two-letter code:
ru: Каждая строка дельты :class:`Different` начинается с двухбуквенного кода:

source: Code
ru: Код

source: Meaning
ru: Значение

source: line unique to sequence 1
ru: строка, уникальная для последовательности 1

source: line unique to sequence 2
ru: строка, уникальная для последовательности 2

source: line common to both sequences
ru: линия, общая для обеих последовательностей

source: line not present in either input sequence
ru: строка не представлена ни в одной входной последовательности

source: Lines beginning with '``?``' attempt to guide the eye to intraline differences, and were not present in either input sequence. These lines can be confusing if the sequences contain whitespace characters, such as spaces, tabs or line breaks.
ru: Строки, начинающиеся с '``?``', пытаются привлечь внимание к внутристрочным различиям и не присутствуют ни в одной входной последовательности. Эти строки могут сбивать с толку, если последовательности содержат пробельные символы, такие как пробелы, табуляции или разрывы строк.

source: This class can be used to create an HTML table (or a complete HTML file containing the table) showing a side by side, line by line comparison of text with inter-line and intra-line change highlights. The table can be generated in either full or contextual difference mode.
ru: Этот класс можно использовать для создания HTML-таблицы (или полного HTML-файла, содержащего таблицу), показывающего параллельное, построчное сравнение текста с выделением межстрочных и внутристрочных изменений. Таблица может быть создана как в режиме полной, так и в режиме контекстной разницы.

source: The constructor for this class is:
ru: Конструктор этого класса:

source: Initializes instance of :class:`HtmlDiff`.
ru: Инициализирует экземпляр :class:`HtmlDiff`.

source: *tabsize* is an optional keyword argument to specify tab stop spacing and defaults to ``8``.
ru: *tabsize* — это необязательный аргумент ключевого слова, определяющий расстояние между позициями табуляции. По умолчанию он равен ``8``.

source: *wrapcolumn* is an optional keyword to specify column number where lines are broken and wrapped, defaults to ``None`` where lines are not wrapped.
ru: *wrapcolumn* — необязательное ключевое слово, позволяющее указать номер столбца, в котором строки разрываются и переносятся. По умолчанию используется значение «Нет», если строки не переносятся.

source: *linejunk* and *charjunk* are optional keyword arguments passed into :func:`ndiff` (used by :class:`HtmlDiff` to generate the side by side HTML differences). See :func:`ndiff` documentation for argument default values and descriptions.
ru: *linejunk* и *charjunk* — это необязательные аргументы ключевых слов, передаваемые в :func:`ndiff` (используемые :class:`HtmlDiff` для генерации параллельных различий HTML). См. документацию :func:`ndiff` для получения значений и описаний аргументов по умолчанию.

source: The following methods are public:
ru: Следующие методы являются общедоступными:

source: Compares *fromlines* and *tolines* (lists of strings) and returns a string which is a complete HTML file containing a table showing line by line differences with inter-line and intra-line changes highlighted.
ru: Сравнивает *fromlines* и *tolines* (списки строк) и возвращает строку, которая представляет собой полный HTML-файл, содержащий таблицу, показывающую построчные различия с выделенными межстрочными и внутристрочными изменениями.

source: *fromdesc* and *todesc* are optional keyword arguments to specify from/to file column header strings (both default to an empty string).
ru: *fromdesc* и *todesc* — необязательные аргументы ключевых слов для указания строк заголовков столбцов из/в файл (оба по умолчанию представляют собой пустую строку).

source: *context* and *numlines* are both optional keyword arguments. Set *context* to ``True`` when contextual differences are to be shown, else the default is ``False`` to show the full files. *numlines* defaults to ``5``. When *context* is ``True`` *numlines* controls the number of context lines which surround the difference highlights. When *context* is ``False`` *numlines* controls the number of lines which are shown before a difference highlight when using the "next" hyperlinks (setting to zero would cause the "next" hyperlinks to place the next difference highlight at the top of the browser without any leading context).
ru: *context* и *numlines* являются необязательными аргументами ключевых слов. Установите для параметра *context* значение «True», если необходимо показать контекстные различия, иначе по умолчанию установлено значение «False», чтобы отображались полные файлы. *numlines* по умолчанию равно ``5``. Когда *context* имеет значение ``True``, *numlines* управляет количеством контекстных строк, окружающих выделение различий. Когда *context* имеет значение ``False``, *numlines* управляет количеством строк, которые отображаются перед выделением различия при использовании гиперссылок «следующие» (установка в ноль приведет к тому, что гиперссылки «следующие» поместят следующее выделение различия в верхнюю часть браузера без какого-либо ведущего контекста).

source: *fromdesc* and *todesc* are interpreted as unescaped HTML and should be properly escaped while receiving input from untrusted sources.
ru: *fromdesc* и *todesc* интерпретируются как неэкранированный HTML и должны быть правильно экранированы при получении входных данных из ненадежных источников.

source: *charset* keyword-only argument was added. The default charset of HTML document changed from ``'ISO-8859-1'`` to ``'utf-8'``.
ru: Добавлен аргумент *charset*, содержащий только ключевые слова. Кодировка HTML-документа по умолчанию изменена с ``'ISO-8859-1'`` на ``'utf-8'``.

source: Compares *fromlines* and *tolines* (lists of strings) and returns a string which is a complete HTML table showing line by line differences with inter-line and intra-line changes highlighted.
ru: Сравнивает *fromlines* и *tolines* (списки строк) и возвращает строку, которая представляет собой полную таблицу HTML, показывающую построчные различия с выделенными межстрочными и внутристрочными изменениями.

source: The arguments for this method are the same as those for the :meth:`make_file` method.
ru: Аргументы этого метода такие же, как и у метода :meth:`make_file`.

source: Compare *a* and *b* (lists of strings); return a delta (a :term:`generator` generating the delta lines) in context diff format.
ru: Сравнить *a* и *b* (списки строк); вернуть дельту (генератор, генерирующий дельта-линии) в формате контекстного различия.

source: Context diffs are a compact way of showing just the lines that have changed plus a few lines of context. The changes are shown in a before/after style. The number of context lines is set by *n* which defaults to three.
ru: Контекстные различия — это компактный способ показать только измененные строки плюс несколько строк контекста. Изменения показаны в стиле «до/после». Количество контекстных строк задается параметром *n*, который по умолчанию равен трем.

source: By default, the diff control lines (those with ``***`` or ``---``) are created with a trailing newline. This is helpful so that inputs created from :func:`io.IOBase.readlines` result in diffs that are suitable for use with :func:`io.IOBase.writelines` since both the inputs and outputs have trailing newlines.
ru: По умолчанию строки управления различиями (с ``***`` или ``---``) создаются с завершающим символом новой строки. Это полезно, поскольку входные данные, созданные из :func:`io.IOBase.readlines`, приводят к результатам различий, которые подходят для использования с :func:`io.IOBase.writelines`, поскольку и входные, и выходные данные имеют завершающие символы новой строки.

source: For inputs that do not have trailing newlines, set the *lineterm* argument to ``""`` so that the output will be uniformly newline free.
ru: Для входных данных, которые не имеют завершающих символов новой строки, установите для аргумента *lineterm* значение ``""``, чтобы выходные данные были равномерно свободны от новой строки.

source: The context diff format normally has a header for filenames and modification times. Any or all of these may be specified using strings for *fromfile*, *tofile*, *fromfiledate*, and *tofiledate*. The modification times are normally expressed in the ISO 8601 format. If not specified, the strings default to blanks.
ru: Формат контекстного различия обычно имеет заголовок для имен файлов и времени модификации. Любое или все из них можно указать с помощью строк *fromfile*, *tofile*, *fromfiledate* и *tofiledate*. Время модификации обычно выражается в формате ISO 8601. Если не указано, строки по умолчанию пустые.

source: See :ref:`difflib-interface` for a more detailed example.
ru: См. более подробный пример в :ref:`difflib-interface`.

source: Return a list of the best "good enough" matches. *word* is a sequence for which close matches are desired (typically a string), and *possibilities* is a list of sequences against which to match *word* (typically a list of strings).
ru: Вернуть список лучших «достаточно хороших» совпадений. *слово* — это последовательность, для которой желательны близкие совпадения (обычно строка), а *возможности* — это список последовательностей, с которыми можно сопоставить *слово* (обычно список строк).

source: Optional argument *n* (default ``3``) is the maximum number of close matches to return; *n* must be greater than ``0``.
ru: Необязательный аргумент *n* (по умолчанию ``3``) — это максимальное количество возвращаемых близких совпадений; *n* должно быть больше ``0``.

source: Optional argument *cutoff* (default ``0.6``) is a float in the range [0, 1]. Possibilities that don't score at least that similar to *word* are ignored.
ru: Необязательный аргумент *cutoff* (по умолчанию ``0,6``) представляет собой число с плавающей запятой в диапазоне [0, 1]. Возможности, которые не имеют хотя бы такого же значения, как *word*, игнорируются.

source: The best (no more than *n*) matches among the possibilities are returned in a list, sorted by similarity score, most similar first.
ru: Лучшие (не более *n*) совпадения среди возможных возвращаются в списке, отсортированном по показателю сходства, начиная с наиболее похожего.

source: Compare *a* and *b* (lists of strings); return a :class:`Differ`\ -style delta (a :term:`generator` generating the delta lines).
ru: Сравнить *a* и *b* (списки строк); вернуть :class:`Differ`\ дельту в стиле (:term:`generator`, генерирующий дельта-линии).

source: Optional keyword parameters *linejunk* and *charjunk* are filtering functions (or ``None``):
ru: Необязательные параметры ключевых слов *linejunk* и *charjunk* являются функциями фильтрации (или «Нет»):

source: *linejunk*: A function that accepts a single string argument, and returns true if the string is junk, or false if not. The default is ``None``. There is also a module-level function :func:`IS_LINE_JUNK`, which filters out lines without visible characters, except for at most one pound character (``'#'``) -- however the underlying :class:`SequenceMatcher` class does a dynamic analysis of which lines are so frequent as to constitute noise, and this usually works better than using this function.
ru: *linejunk*: функция, которая принимает один строковый аргумент и возвращает true, если строка является мусорной, или false в противном случае. По умолчанию установлено значение «Нет». Существует также функция уровня модуля :func:`IS_LINE_JUNK`, которая отфильтровывает строки без видимых символов, за исключением не более одного символа решетки (``'#'``), однако базовый :class:`SequenceMatcher` class выполняет динамический анализ того, какие строки встречаются настолько часто, что представляют собой шум, и это обычно работает лучше, чем использование этой функции.

source: *charjunk*: A function that accepts a character (a string of length 1), and returns if the character is junk, or false if not. The default is module-level function :func:`IS_CHARACTER_JUNK`, which filters out whitespace characters (a blank or tab; it's a bad idea to include newline in this!).
ru: *charjunk*: функция, которая принимает символ (строку длиной 1) и возвращает значение, если символ является мусорным, или возвращает значение false в противном случае. По умолчанию используется функция уровня модуля :func:`IS_CHARACTER_JUNK`, которая отфильтровывает пробельные символы (пробел или табуляцию; включать в это новую строку - плохая идея!).

source: Return one of the two sequences that generated a delta.
ru: Верните одну из двух последовательностей, создавших дельту.

source: Given a *sequence* produced by :meth:`Differ.compare` or :func:`ndiff`, extract lines originating from file 1 or 2 (parameter *which*), stripping off line prefixes.
ru: Учитывая *последовательность*, созданную :meth:`Differ.compare` или :func:`ndiff`, извлеките строки, происходящие из файла 1 или 2 (параметр *который*), удалив префиксы строк.

source: Example:
ru: Пример:

source: Compare *a* and *b* (lists of strings); return a delta (a :term:`generator` generating the delta lines) in unified diff format.
ru: Сравнить *a* и *b* (списки строк); вернуть дельту (:term:`генератор`, генерирующий дельта-линии) в унифицированном формате различий.

source: Unified diffs are a compact way of showing just the lines that have changed plus a few lines of context. The changes are shown in an inline style (instead of separate before/after blocks). The number of context lines is set by *n* which defaults to three.
ru: Унифицированные различия — это компактный способ показать только измененные строки плюс несколько строк контекста. Изменения отображаются в виде строки (вместо отдельных блоков «до» и «после»). Количество контекстных строк задается параметром *n*, который по умолчанию равен трем.

source: By default, the diff control lines (those with ``---``, ``+++``, or ``@@``) are created with a trailing newline. This is helpful so that inputs created from :func:`io.IOBase.readlines` result in diffs that are suitable for use with :func:`io.IOBase.writelines` since both the inputs and outputs have trailing newlines.
ru: По умолчанию строки управления различиями (с ``---``, ``+++`` или ``@@``) создаются с завершающим символом новой строки. Это полезно, поскольку входные данные, созданные из :func:`io.IOBase.readlines`, приводят к результатам различий, которые подходят для использования с :func:`io.IOBase.writelines`, поскольку и входные, и выходные данные имеют завершающие символы новой строки.

source: The unified diff format normally has a header for filenames and modification times. Any or all of these may be specified using strings for *fromfile*, *tofile*, *fromfiledate*, and *tofiledate*. The modification times are normally expressed in the ISO 8601 format. If not specified, the strings default to blanks.
ru: Унифицированный формат различий обычно имеет заголовок для имен файлов и времени модификации. Любое или все из них можно указать с помощью строк *fromfile*, *tofile*, *fromfiledate* и *tofiledate*. Время модификации обычно выражается в формате ISO 8601. Если не указано, строки по умолчанию пустые.

source: Compare *a* and *b* (lists of bytes objects) using *dfunc*; yield a sequence of delta lines (also bytes) in the format returned by *dfunc*. *dfunc* must be a callable, typically either :func:`unified_diff` or :func:`context_diff`.
ru: Сравните *a* и *b* (списки байтовых объектов) с помощью *dfunc*; выдать последовательность дельта-строк (также байтов) в формате, возвращаемом *dfunc*. *dfunc* должен быть вызываемым объектом, обычно либо :func:`unified_diff`, либо :func:`context_diff`.

source: Allows you to compare data with unknown or inconsistent encoding. All inputs except *n* must be bytes objects, not str. Works by losslessly converting all inputs (except *n*) to str, and calling ``dfunc(a, b, fromfile, tofile, fromfiledate, tofiledate, n, lineterm)``. The output of *dfunc* is then converted back to bytes, so the delta lines that you receive have the same unknown/inconsistent encodings as *a* and *b*.
ru: Позволяет сравнивать данные с неизвестной или противоречивой кодировкой. Все входные данные, кроме *n*, должны быть байтовыми объектами, а не строковыми. Работает путем преобразования всех входных данных (кроме *n*) в str без потерь и вызова ``dfunc(a, b, fromfile, tofile, fromfiledate, tofiledate, n, lineterm)``. Вывод *dfunc* затем преобразуется обратно в байты, поэтому получаемые вами дельта-строки имеют те же неизвестные/несовместимые кодировки, что и *a* и *b*.

source: Return ``True`` for ignorable lines. The line *line* is ignorable if *line* is blank or contains a single ``'#'``, otherwise it is not ignorable. Used as a default for parameter *linejunk* in :func:`ndiff` in older versions.
ru: Верните True для игнорируемых строк. Строка *line* игнорируется, если *line* пуста или содержит одиночный ``'#'``, в противном случае она не игнорируется. Используется по умолчанию для параметра *linejunk* в :func:`ndiff` в старых версиях.

source: Return ``True`` for ignorable characters. The character *ch* is ignorable if *ch* is a space or tab, otherwise it is not ignorable. Used as a default for parameter *charjunk* in :func:`ndiff`.
ru: Верните True для игнорируемых символов. Символ *ch* игнорируется, если *ch* является пробелом или табуляцией, в противном случае он не игнорируется. Используется по умолчанию для параметра *charjunk* в :func:`ndiff`.

source: `Pattern Matching: The Gestalt Approach <https://www.drdobbs.com/database/pattern-matching-the-gestalt-approach/184407970>`_
ru: `Сопоставление с образцом: гештальт-подход <https://www.drdobbs.com/database/pattern-matching-the-gestalt-approach/184407970>`_

source: Discussion of a similar algorithm by John W. Ratcliff and D. E. Metzener. This was published in `Dr. Dobb's Journal <https://www.drdobbs.com/>`_ in July, 1988.
ru: Обсуждение аналогичного алгоритма Джоном В. Рэтклиффом и Д. Е. Метценером. Это было опубликовано в журнале «Dr. Журнал Добба <https://www.drdobbs.com/>`_ в июле 1988 г.

source: SequenceMatcher Objects
ru: Объекты SequenceMatcher

source: The :class:`SequenceMatcher` class has this constructor:
ru: Класс :class:`SequenceMatcher` имеет этот конструктор:
