Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/email.compat32-message.po
Languages: ru

source: Return the ``charset`` parameter of the :mailheader:`Content-Type` header, coerced to lower case. If there is no :mailheader:`Content-Type` header, or if that header has no ``charset`` parameter, *failobj* is returned.
ru: Возвращает параметр ``charset`` заголовка :mailheader:`Content-Type`, переведенный в нижний регистр. Если заголовок :mailheader:`Content-Type` отсутствует или этот заголовок не имеет параметра ``charset``, возвращается *failobj*.

source: Note that this method differs from :meth:`get_charset` which returns the :class:`~email.charset.Charset` instance for the default encoding of the message body.
ru: Обратите внимание, что этот метод отличается от :meth:`get_charset`, который возвращает экземпляр :class:`~email.charset.Charset` для кодировки тела сообщения по умолчанию.

source: Return a list containing the character set names in the message. If the message is a :mimetype:`multipart`, then the list will contain one element for each subpart in the payload, otherwise, it will be a list of length 1.
ru: Возвращает список, содержащий имена наборов символов в сообщении. Если сообщение имеет тип :mimetype:`multipart`, то список будет содержать по одному элементу для каждой части полезных данных, в противном случае это будет список длиной 1.

source: Each item in the list will be a string which is the value of the ``charset`` parameter in the :mailheader:`Content-Type` header for the represented subpart. However, if the subpart has no :mailheader:`Content-Type` header, no ``charset`` parameter, or is not of the :mimetype:`text` main MIME type, then that item in the returned list will be *failobj*.
ru: Каждый элемент в списке будет строкой, которая является значением параметра charset в заголовке :mailheader:`Content-Type` для представленной части. Однако, если в подразделе нет заголовка :mailheader:`Content-Type`, нет параметра ``charset`` или он не относится к основному MIME-типу :mimetype:`text`, тогда этот элемент в возвращаемом списке будет * фаилобдж*.

source: Return the lowercased value (without parameters) of the message's :mailheader:`Content-Disposition` header if it has one, or ``None``. The possible values for this method are *inline*, *attachment* or ``None`` if the message follows :rfc:`2183`.
ru: Возвращает значение в нижнем регистре (без параметров) заголовка сообщения :mailheader:`Content-Disposition`, если он есть, или ``None``. Возможные значения для этого метода: *inline*, *attachment* или ``None``, если за сообщением следует :rfc:`2183`.

source: The :meth:`walk` method is an all-purpose generator which can be used to iterate over all the parts and subparts of a message object tree, in depth-first traversal order. You will typically use :meth:`walk` as the iterator in a ``for`` loop; each iteration returns the next subpart.
ru: Метод :meth:`walk` — это универсальный генератор, который можно использовать для перебора всех частей и подчастей дерева объектов сообщений в порядке обхода в глубину. Обычно вы будете использовать :meth:`walk` в качестве итератора в цикле ``for``; каждая итерация возвращает следующую подчасть.

source: Here's an example that prints the MIME type of every part of a multipart message structure:
ru: Вот пример, который печатает MIME-тип каждой части составной структуры сообщения:

source: ``walk`` iterates over the subparts of any part where :meth:`is_multipart` returns ``True``, even though ``msg.get_content_maintype() == 'multipart'`` may return ``False``. We can see this in our example by making use of the ``_structure`` debug helper function:
ru: ``walk`` перебирает подчасти любой части, где :meth:`is_multipart` возвращает ``True``, хотя ``msg.get_content_maintype() == 'multipart'`` может возвращать ``False``. Мы можем увидеть это в нашем примере, воспользовавшись вспомогательной функцией отладки ``_structure``:

source: Here the ``message`` parts are not ``multiparts``, but they do contain subparts. ``is_multipart()`` returns ``True`` and ``walk`` descends into the subparts.
ru: Здесь части «сообщения» не являются «составными частями», но они содержат подчасти. ``is_multipart()`` возвращает ``True`` и ``walk`` спускается в подчасти.

source: :class:`Message` objects can also optionally contain two instance attributes, which can be used when generating the plain text of a MIME message.
ru: Объекты :class:`Message` также могут содержать два атрибута экземпляра, которые можно использовать при создании обычного текста сообщения MIME.

source: The format of a MIME document allows for some text between the blank line following the headers, and the first multipart boundary string. Normally, this text is never visible in a MIME-aware mail reader because it falls outside the standard MIME armor. However, when viewing the raw text of the message, or when viewing the message in a non-MIME aware reader, this text can become visible.
ru: Формат документа MIME допускает наличие некоторого текста между пустой строкой, следующей за заголовками, и первой составной граничной строкой. Обычно этот текст никогда не отображается в программе чтения почты с поддержкой MIME, поскольку он выходит за рамки стандартной защиты MIME. Однако при просмотре необработанного текста сообщения или при просмотре сообщения в программе чтения, не поддерживающей MIME, этот текст может стать видимым.

source: The *preamble* attribute contains this leading extra-armor text for MIME documents. When the :class:`~email.parser.Parser` discovers some text after the headers but before the first boundary string, it assigns this text to the message's *preamble* attribute. When the :class:`~email.generator.Generator` is writing out the plain text representation of a MIME message, and it finds the message has a *preamble* attribute, it will write this text in the area between the headers and the first boundary. See :mod:`email.parser` and :mod:`email.generator` for details.
ru: Атрибут *preamble* содержит начальный дополнительный текст для документов MIME. Когда :class:`~email.parser.Parser` обнаруживает некоторый текст после заголовков, но перед первой граничной строкой, он присваивает этот текст атрибуту *preamble* сообщения. Когда :class:`~email.generator.Generator` записывает простое текстовое представление сообщения MIME и обнаруживает, что сообщение имеет атрибут *preamble*, он записывает этот текст в область между заголовками и первая граница. Подробности смотрите в :mod:`email.parser` и :mod:`email.generator`.

source: Note that if the message object has no preamble, the *preamble* attribute will be ``None``.
ru: Обратите внимание: если объект сообщения не имеет преамбулы, атрибут *preamble* будет иметь значение «Нет».

source: The *epilogue* attribute acts the same way as the *preamble* attribute, except that it contains text that appears between the last boundary and the end of the message.
ru: Атрибут *epilogue* действует так же, как атрибут *preamble*, за исключением того, что он содержит текст, который появляется между последней границей и концом сообщения.

source: You do not need to set the epilogue to the empty string in order for the :class:`~email.generator.Generator` to print a newline at the end of the file.
ru: Вам не нужно устанавливать эпилог в пустую строку, чтобы :class:`~email.generator.Generator` печатал новую строку в конце файла.

source: The *defects* attribute contains a list of all the problems found when parsing this message. See :mod:`email.errors` for a detailed description of the possible parsing defects.
ru: Атрибут *defects* содержит список всех проблем, обнаруженных при разборе этого сообщения. См. :mod:`email.errors` для подробного описания возможных дефектов синтаксического анализа.
