Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/email.message.po
Languages: ru

source: :mod:`!email.message`: Representing an email message
ru: :mod:`!email.message`: Представление сообщения электронной почты.

source: **Source code:** :source:`Lib/email/message.py`
ru: **Исходный код:** :source:`Lib/email/message.py`

source: The central class in the :mod:`email` package is the :class:`EmailMessage` class, imported from the :mod:`email.message` module. It is the base class for the :mod:`email` object model. :class:`EmailMessage` provides the core functionality for setting and querying header fields, for accessing message bodies, and for creating or modifying structured messages.
ru: Центральным классом пакета :mod:`email` является класс :class:`EmailMessage`, импортированный из модуля :mod:`email.message`. Это базовый класс объектной модели :mod:`email`. :class:`EmailMessage` предоставляет основные функции для настройки и запроса полей заголовков, для доступа к телу сообщения, а также для создания или изменения структурированных сообщений.

source: An email message consists of *headers* and a *payload* (which is also referred to as the *content*). Headers are :rfc:`5322` or :rfc:`6532` style field names and values, where the field name and value are separated by a colon. The colon is not part of either the field name or the field value. The payload may be a simple text message, or a binary object, or a structured sequence of sub-messages each with their own set of headers and their own payload. The latter type of payload is indicated by the message having a MIME type such as :mimetype:`multipart/\*` or :mimetype:`message/rfc822`.
ru: Сообщение электронной почты состоит из *заголовков* и *полезной нагрузки* (которая также называется *контентом*). Заголовки представляют собой имена и значения полей в стиле :rfc:`5322` или :rfc:`6532`, где имя и значение поля разделяются двоеточием. Двоеточие не является частью ни имени поля, ни значения поля. Полезная нагрузка может представлять собой простое текстовое сообщение, двоичный объект или структурированную последовательность подсообщений, каждое из которых имеет собственный набор заголовков и собственную полезную нагрузку. Последний тип полезных данных обозначается сообщением, имеющим тип MIME, например :mimetype:`multipart/\*` или :mimetype:`message/rfc822`.

source: The conceptual model provided by an :class:`EmailMessage` object is that of an ordered dictionary of headers coupled with a *payload* that represents the :rfc:`5322` body of the message, which might be a list of sub-``EmailMessage`` objects. In addition to the normal dictionary methods for accessing the header names and values, there are methods for accessing specialized information from the headers (for example the MIME content type), for operating on the payload, for generating a serialized version of the message, and for recursively walking over the object tree.
ru: Концептуальная модель, предоставляемая объектом :class:`EmailMessage`, представляет собой упорядоченный словарь заголовков, соединенный с *полезной нагрузкой*, которая представляет тело :rfc:`5322` сообщения, которое может быть списком вложенных элементов. Объекты `EmailMessage``. В дополнение к обычным словарным методам доступа к именам и значениям заголовков существуют методы для доступа к специализированной информации из заголовков (например, к типу контента MIME), для работы с полезными данными, для создания сериализованной версии сообщения и для рекурсивного обхода дерева объектов.

source: The :class:`EmailMessage` dictionary-like interface is indexed by the header names, which must be ASCII values. The values of the dictionary are strings with some extra methods. Headers are stored and returned in case-preserving form, but field names are matched case-insensitively. The keys are ordered, but unlike a real dict, there can be duplicates. Additional methods are provided for working with headers that have duplicate keys.
ru: Интерфейс, подобный словарю :class:`EmailMessage`, индексируется по именам заголовков, которые должны быть значениями ASCII. Значения словаря представляют собой строки с некоторыми дополнительными методами. Заголовки сохраняются и возвращаются в форме с сохранением регистра, но имена полей сопоставляются без учета регистра. Ключи упорядочены, но в отличие от настоящего дикта могут быть дубликаты. Предусмотрены дополнительные методы для работы с заголовками, имеющими повторяющиеся ключи.

source: The *payload* is either a string or bytes object, in the case of simple message objects, or a list of :class:`EmailMessage` objects, for MIME container documents such as :mimetype:`multipart/\*` and :mimetype:`message/rfc822` message objects.
ru: *Полезная нагрузка* представляет собой либо строку, либо байтовый объект в случае простых объектов сообщения или список объектов :class:`EmailMessage` для документов-контейнеров MIME, таких как :mimetype:`multipart/\*` и :mimetype. :`message/rfc822` объекты сообщений.

source: If *policy* is specified use the rules it specifies to update and serialize the representation of the message. If *policy* is not set, use the :class:`~email.policy.default` policy, which follows the rules of the email RFCs except for line endings (instead of the RFC mandated ``\r\n``, it uses the Python standard ``\n`` line endings). For more information see the :mod:`~email.policy` documentation.
ru: Если указана *policy*, используйте указанные ею правила для обновления и сериализации представления сообщения. Если *policy* не установлена, используйте политику :class:`~email.policy.default`, которая соответствует правилам RFC электронной почты, за исключением окончания строк (вместо предписанного RFC ``\r\n``, он использует стандартные окончания строк ``\n`` Python). Для получения дополнительной информации см. документацию :mod:`~email.policy`.

source: Return the entire message flattened as a string. When optional *unixfrom* is true, the envelope header is included in the returned string. *unixfrom* defaults to ``False``. For backward compatibility with the base :class:`~email.message.Message` class *maxheaderlen* is accepted, but defaults to ``None``, which means that by default the line length is controlled by the :attr:`~email.policy.Policy.max_line_length` of the policy. The *policy* argument may be used to override the default policy obtained from the message instance. This can be used to control some of the formatting produced by the method, since the specified *policy* will be passed to the :class:`~email.generator.Generator`.
ru: Вернуть все сообщение в виде строки. Если необязательный параметр *unixfrom* имеет значение true, заголовок конверта включается в возвращаемую строку. *unixfrom* по умолчанию имеет значение «False». Для обратной совместимости с базовым :class:`~email.message.Message` класс *maxheaderlen* принимается, но по умолчанию установлено значение ``None``, что означает, что по умолчанию длина строки контролируется :attr:`~ email.policy.Policy.max_line_length` политики. Аргумент *policy* можно использовать для переопределения политики по умолчанию, полученной из экземпляра сообщения. Это можно использовать для управления некоторыми элементами форматирования, создаваемыми методом, поскольку указанная *policy* будет передана в :class:`~email.generator.Generator`.

source: Flattening the message may trigger changes to the :class:`EmailMessage` if defaults need to be filled in to complete the transformation to a string (for example, MIME boundaries may be generated or modified).
ru: Сглаживание сообщения может вызвать изменения в :class:`EmailMessage`, если для завершения преобразования в строку необходимо заполнить значения по умолчанию (например, могут быть созданы или изменены границы MIME).

source: Note that this method is provided as a convenience and may not be the most useful way to serialize messages in your application, especially if you are dealing with multiple messages. See :class:`email.generator.Generator` for a more flexible API for serializing messages. Note also that this method is restricted to producing messages serialized as "7 bit clean" when :attr:`~email.policy.EmailPolicy.utf8` is ``False``, which is the default.
ru: Обратите внимание, что этот метод предоставляется для удобства и может быть не самым полезным способом сериализации сообщений в вашем приложении, особенно если вы имеете дело с несколькими сообщениями. См. :class:`email.generator.Generator` для получения более гибкого API для сериализации сообщений. Также обратите внимание, что этот метод ограничен созданием сообщений, сериализованных как «7-битные чистые», когда :attr:`~email.policy.EmailPolicy.utf8` имеет значение ``False``, что является значением по умолчанию.

source: the default behavior when *maxheaderlen* is not specified was changed from defaulting to 0 to defaulting to the value of *max_line_length* from the policy.
ru: поведение по умолчанию, когда *maxheaderlen* не указано, было изменено со значения по умолчанию на 0 на значение по умолчанию *max_line_length* из политики.

source: Equivalent to ``as_string(policy=self.policy.clone(utf8=True))``. Allows ``str(msg)`` to produce a string containing the serialized message in a readable format.
ru: Эквивалентно ``as_string(policy=self.policy.clone(utf8=True))``. Позволяет ``str(msg)`` создавать строку, содержащую сериализованное сообщение в читаемом формате.

source: the method was changed to use ``utf8=True``, thus producing an :rfc:`6531`-like message representation, instead of being a direct alias for :meth:`as_string`.
ru: метод был изменен на использование ``utf8=True``, создавая таким образом представление сообщения, подобное :rfc:`6531`, вместо прямого псевдонима для :meth:`as_string`.

source: Return the entire message flattened as a bytes object. When optional *unixfrom* is true, the envelope header is included in the returned string. *unixfrom* defaults to ``False``. The *policy* argument may be used to override the default policy obtained from the message instance. This can be used to control some of the formatting produced by the method, since the specified *policy* will be passed to the :class:`~email.generator.BytesGenerator`.
ru: Верните все сообщение в виде байтового объекта. Если необязательный параметр *unixfrom* имеет значение true, заголовок конверта включается в возвращаемую строку. *unixfrom* по умолчанию имеет значение «False». Аргумент *policy* можно использовать для переопределения политики по умолчанию, полученной из экземпляра сообщения. Это можно использовать для управления некоторыми элементами форматирования, производимыми методом, поскольку указанная *policy* будет передана в :class:`~email.generator.BytesGenerator`.

source: Note that this method is provided as a convenience and may not be the most useful way to serialize messages in your application, especially if you are dealing with multiple messages. See :class:`email.generator.BytesGenerator` for a more flexible API for serializing messages.
ru: Обратите внимание, что этот метод предоставляется для удобства и может быть не самым полезным способом сериализации сообщений в вашем приложении, особенно если вы имеете дело с несколькими сообщениями. См. :class:`email.generator.BytesGenerator` для получения более гибкого API для сериализации сообщений.

source: Equivalent to :meth:`.as_bytes`. Allows ``bytes(msg)`` to produce a bytes object containing the serialized message.
ru: Эквивалент :meth:`.as_bytes`. Позволяет ``bytes(msg)`` создавать объект bytes, содержащий сериализованное сообщение.

source: Return ``True`` if the message's payload is a list of sub-\ :class:`EmailMessage` objects, otherwise return ``False``. When :meth:`is_multipart` returns ``False``, the payload should be a string object (which might be a CTE encoded binary payload). Note that :meth:`is_multipart` returning ``True`` does not necessarily mean that "msg.get_content_maintype() == 'multipart'" will return the ``True``. For example, ``is_multipart`` will return ``True`` when the :class:`EmailMessage` is of type ``message/rfc822``.
ru: Возвращайте ``True``, если полезная нагрузка сообщения представляет собой список объектов подкласса \ :class:`EmailMessage`, в противном случае возвращайте ``False``. Когда :meth:`is_multipart` возвращает ``False``, полезная нагрузка должна быть строковым объектом (который может быть двоичной полезной нагрузкой в ​​кодировке CTE). Обратите внимание, что :meth:`is_multipart`, возвращающий ``True``, не обязательно означает, что "msg.get_content_maintype() == 'multipart'" вернет ``True``. Например, ``is_multipart`` вернет ``True``, если :class:`EmailMessage` имеет тип ``message/rfc822``.

source: Set the message's envelope header to *unixfrom*, which should be a string. (See :class:`~mailbox.mboxMessage` for a brief description of this header.)
ru: Установите для заголовка конверта сообщения значение *unixfrom*, которое должно быть строкой. (Краткое описание этого заголовка см. в :class:`~mailbox.mboxMessage`.)

source: Return the message's envelope header. Defaults to ``None`` if the envelope header was never set.
ru: Верните заголовок конверта сообщения. По умолчанию установлено значение «Нет», если заголовок конверта никогда не устанавливался.

source: The following methods implement the mapping-like interface for accessing the message's headers. Note that there are some semantic differences between these methods and a normal mapping (i.e. dictionary) interface. For example, in a dictionary there are no duplicate keys, but here there may be duplicate message headers. Also, in dictionaries there is no guaranteed order to the keys returned by :meth:`keys`, but in an :class:`EmailMessage` object, headers are always returned in the order they appeared in the original message, or in which they were added to the message later. Any header deleted and then re-added is always appended to the end of the header list.
ru: Следующие методы реализуют интерфейс, похожий на сопоставление, для доступа к заголовкам сообщений. Обратите внимание, что между этими методами и интерфейсом обычного сопоставления (то есть словаря) существуют некоторые семантические различия. Например, в словаре нет повторяющихся ключей, а здесь могут быть повторяющиеся заголовки сообщений. Кроме того, в словарях нет гарантированного порядка ключей, возвращаемых :meth:`keys`, но в объекте :class:`EmailMessage` заголовки всегда возвращаются в том порядке, в котором они появились в исходном сообщении, или в том порядке, в котором они появились в исходном сообщении. были добавлены в сообщение позже. Любой заголовок, удаленный, а затем повторно добавленный, всегда добавляется в конец списка заголовков.

source: These semantic differences are intentional and are biased toward convenience in the most common use cases.
ru: Эти семантические различия являются преднамеренными и ориентированы на удобство в наиболее распространенных случаях использования.

source: Note that in all cases, any envelope header present in the message is not included in the mapping interface.
ru: Обратите внимание, что во всех случаях любой заголовок конверта, присутствующий в сообщении, не включается в интерфейс сопоставления.

source: Return the total number of headers, including duplicates.
ru: Возвращает общее количество заголовков, включая дубликаты.

source: Return ``True`` if the message object has a field named *name*. Matching is done without regard to case and *name* does not include the trailing colon. Used for the ``in`` operator. For example::
ru: Верните ``True``, если объект сообщения имеет поле с именем *name*. Сопоставление выполняется без учета регистра, а *имя* не содержит завершающего двоеточия. Используется для оператора ``in``. Например::

source: Return the value of the named header field. *name* does not include the colon field separator. If the header is missing, ``None`` is returned; a :exc:`KeyError` is never raised.
ru: Верните значение именованного поля заголовка. *имя* не включает разделитель полей двоеточие. Если заголовок отсутствует, возвращается None; :exc:`KeyError` никогда не возникает.

source: Note that if the named field appears more than once in the message's headers, exactly which of those field values will be returned is undefined. Use the :meth:`get_all` method to get the values of all the extant headers named *name*.
ru: Обратите внимание: если именованное поле появляется в заголовках сообщения более одного раза, то, какое именно из значений этого поля будет возвращено, не определено. Используйте метод :meth:`get_all`, чтобы получить значения всех существующих заголовков с именем *name*.

source: Using the standard (non-``compat32``) policies, the returned value is an instance of a subclass of :class:`email.headerregistry.BaseHeader`.
ru: При использовании стандартных политик (не-``compat32``) возвращаемое значение является экземпляром подкласса :class:`email.headerregistry.BaseHeader`.

source: Add a header to the message with field name *name* and value *val*. The field is appended to the end of the message's existing headers.
ru: Добавьте заголовок к сообщению с именем поля *name* и значением *val*. Поле добавляется в конец существующих заголовков сообщения.

source: Note that this does *not* overwrite or delete any existing header with the same name. If you want to ensure that the new header is the only one present in the message with field name *name*, delete the field first, e.g.::
ru: Обратите внимание, что это *не* перезаписывает и не удаляет любой существующий заголовок с тем же именем. Если вы хотите, чтобы новый заголовок был единственным в сообщении с именем поля *имя*, сначала удалите это поле, например::

source: If the :mod:`policy <email.policy>` defines certain headers to be unique (as the standard policies do), this method may raise a :exc:`ValueError` when an attempt is made to assign a value to such a header when one already exists. This behavior is intentional for consistency's sake, but do not depend on it as we may choose to make such assignments do an automatic deletion of the existing header in the future.
ru: Если :mod:`policy <email.policy>` определяет определенные заголовки как уникальные (как это делают стандартные политики), этот метод может вызвать :exc:`ValueError` при попытке присвоить значение такому заголовок, если он уже существует. Такое поведение сделано намеренно ради согласованности, но не зависит от него, поскольку мы можем заставить такие назначения автоматически удалять существующий заголовок в будущем.

source: Delete all occurrences of the field with name *name* from the message's headers. No exception is raised if the named field isn't present in the headers.
ru: Удалите все вхождения поля с именем *name* из заголовков сообщений. Исключение не возникает, если именованное поле отсутствует в заголовках.

source: Return a list of all the message's header field names.
ru: Возвращает список всех имен полей заголовка сообщения.

source: Return a list of all the message's field values.
ru: Возвращает список всех значений полей сообщения.

source: Return a list of 2-tuples containing all the message's field headers and values.
ru: Возвращает список из двух кортежей, содержащий все заголовки и значения полей сообщения.

source: Return the value of the named header field. This is identical to :meth:`~object.__getitem__` except that optional *failobj* is returned if the named header is missing (*failobj* defaults to ``None``).
ru: Верните значение именованного поля заголовка. Это идентично :meth:`~object.__getitem__`, за исключением того, что необязательный *failobj* возвращается, если именованный заголовок отсутствует (*failobj* по умолчанию имеет значение ``None``).

source: Here are some additional useful header related methods:
ru: Вот несколько дополнительных полезных методов, связанных с заголовками:

source: Return a list of all the values for the field named *name*. If there are no such named headers in the message, *failobj* is returned (defaults to ``None``).
ru: Возвращает список всех значений поля с именем *name*. Если в сообщении нет таких именованных заголовков, возвращается *failobj* (по умолчанию — None).

source: Extended header setting. This method is similar to :meth:`__setitem__` except that additional header parameters can be provided as keyword arguments. *_name* is the header field to add and *_value* is the *primary* value for the header.
ru: Расширенная настройка заголовка. Этот метод похож на :meth:`__setitem__`, за исключением того, что дополнительные параметры заголовка могут быть предоставлены в качестве аргументов ключевого слова. *_name* — это добавляемое поле заголовка, а *_value* — это *основное* значение заголовка.

source: For each item in the keyword argument dictionary *_params*, the key is taken as the parameter name, with underscores converted to dashes (since dashes are illegal in Python identifiers). Normally, the parameter will be added as ``key="value"`` unless the value is ``None``, in which case only the key will be added.
ru: Для каждого элемента в словаре аргументов ключевых слов *_params* ключ принимается в качестве имени параметра, а символы подчеркивания преобразуются в тире (поскольку тире недопустимы в идентификаторах Python). Обычно параметр добавляется как ``key="value"``, если только значение не равно ``None``, в этом случае будет добавлен только ключ.

source: If the value contains non-ASCII characters, the charset and language may be explicitly controlled by specifying the value as a three tuple in the format ``(CHARSET, LANGUAGE, VALUE)``, where ``CHARSET`` is a string naming the charset to be used to encode the value, ``LANGUAGE`` can usually be set to ``None`` or the empty string (see :rfc:`2231` for other possibilities), and ``VALUE`` is the string value containing non-ASCII code points. If a three tuple is not passed and the value contains non-ASCII characters, it is automatically encoded in :rfc:`2231` format using a ``CHARSET`` of ``utf-8`` and a ``LANGUAGE`` of ``None``.
ru: Если значение содержит символы, отличные от ASCII, кодировкой и языком можно явно управлять, указав значение в виде трехкортежа в формате ``(CHARSET, LANGUAGE, VALUE)``, где ``CHARSET`` — это строковое имя. кодировку, которая будет использоваться для кодирования значения, для ``LANGUAGE`` обычно можно установить значение ``None`` или пустую строку (другие возможности см. в :rfc:`2231`), а ``VALUE`` — это строковое значение, содержащее кодовые точки, отличные от ASCII. Если трехкортеж не передается и значение содержит символы, отличные от ASCII, оно автоматически кодируется в формате :rfc:`2231` с использованием ``CHARSET`` из ``utf-8`` и ``LANGUAGE``. из ``Нет``.

source: Here is an example::
ru: Вот пример::

source: This will add a header that looks like ::
ru: Это добавит заголовок, который будет выглядеть так::

source: An example of the extended interface with non-ASCII characters::
ru: Пример расширенного интерфейса с символами, отличными от ASCII:

source: Replace a header. Replace the first header found in the message that matches *_name*, retaining header order and field name case of the original header. If no matching header is found, raise a :exc:`KeyError`.
ru: Замените заголовок. Замените первый заголовок, найденный в сообщении, который соответствует *_name*, сохранив порядок заголовка и регистр имени поля исходного заголовка. Если соответствующий заголовок не найден, вызовите :exc:`KeyError`.
