Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/email.message.po
Languages: ru

source: If the message is a ``multipart/related``, create a new message object, pass all of the arguments to its :meth:`set_content` method, and :meth:`~email.message.Message.attach` it to the ``multipart``. If the message is a non-``multipart``, call :meth:`make_related` and then proceed as above. If the message is any other type of ``multipart``, raise a :exc:`TypeError`. If *content_manager* is not specified, use the ``content_manager`` specified by the current :mod:`~email.policy`. If the added part has no :mailheader:`Content-Disposition` header, add one with the value ``inline``.
ru: Если сообщение является ``многочастным/связанным``, создайте новый объект сообщения, передайте все аргументы его методу :meth:`set_content` и :meth:`~email.message.Message.attach` в ``многочастный``. Если сообщение не является составным, вызовите :meth:`make_related` и затем действуйте, как указано выше. Если сообщение представляет собой любой другой тип ``multipart``, вызовите :exc:`TypeError`. Если *content_manager* не указан, используйте ``content_manager``, указанный в текущем :mod:`~email.policy`. Если добавленная часть не имеет заголовка :mailheader:`Content-Disposition`, добавьте его со значением ``inline``.

source: If the message is a ``multipart/alternative``, create a new message object, pass all of the arguments to its :meth:`set_content` method, and :meth:`~email.message.Message.attach` it to the ``multipart``. If the message is a non-``multipart`` or ``multipart/related``, call :meth:`make_alternative` and then proceed as above. If the message is any other type of ``multipart``, raise a :exc:`TypeError`. If *content_manager* is not specified, use the ``content_manager`` specified by the current :mod:`~email.policy`.
ru: Если сообщение является ``многочастным/альтернативным``, создайте новый объект сообщения, передайте все аргументы его методу :meth:`set_content` и :meth:`~email.message.Message.attach` в него. ``многочастный``. Если сообщение не является «многочастным» или «многочастным/связанным», вызовите :meth:`make_alternative` и затем действуйте, как указано выше. Если сообщение представляет собой любой другой тип ``multipart``, вызовите :exc:`TypeError`. Если *content_manager* не указан, используйте ``content_manager``, указанный в текущем :mod:`~email.policy`.

source: If the message is a ``multipart/mixed``, create a new message object, pass all of the arguments to its :meth:`set_content` method, and :meth:`~email.message.Message.attach` it to the ``multipart``. If the message is a non-``multipart``, ``multipart/related``, or ``multipart/alternative``, call :meth:`make_mixed` and then proceed as above. If *content_manager* is not specified, use the ``content_manager`` specified by the current :mod:`~email.policy`. If the added part has no :mailheader:`Content-Disposition` header, add one with the value ``attachment``. This method can be used both for explicit attachments (:mailheader:`Content-Disposition: attachment`) and ``inline`` attachments (:mailheader:`Content-Disposition: inline`), by passing appropriate options to the ``content_manager``.
ru: Если сообщение является ``многочастным/смешанным``, создайте новый объект сообщения, передайте все аргументы его методу :meth:`set_content` и :meth:`~email.message.Message.attach` в него. ``многочастный``. Если сообщение не является «многочастным», «многочастным/связанным» или «многочастным/альтернативным», вызовите :meth:`make_mixed` и затем действуйте, как указано выше. Если *content_manager* не указан, используйте ``content_manager``, указанный в текущем :mod:`~email.policy`. Если добавленная часть не имеет заголовка :mailheader:`Content-Disposition`, добавьте его со значением ``attachment``. Этот метод можно использовать как для явных вложений (:mailheader:`Content-Disposition: Attachment`), так и для ``inline`` вложений (:mailheader:`Content-Disposition: inline`), передав соответствующие параметры в ``content_manager' ``.

source: Remove the payload and all of the headers.
ru: Удалите полезную нагрузку и все заголовки.

source: Remove the payload and all of the :mailheader:`!Content-` headers, leaving all other headers intact and in their original order.
ru: Удалите полезную нагрузку и все заголовки :mailheader:`!Content-`, оставив все остальные заголовки нетронутыми и в исходном порядке.

source: :class:`EmailMessage` objects have the following instance attributes:
ru: Объекты :class:`EmailMessage` имеют следующие атрибуты экземпляра:

source: The format of a MIME document allows for some text between the blank line following the headers, and the first multipart boundary string. Normally, this text is never visible in a MIME-aware mail reader because it falls outside the standard MIME armor. However, when viewing the raw text of the message, or when viewing the message in a non-MIME aware reader, this text can become visible.
ru: Формат документа MIME допускает наличие некоторого текста между пустой строкой, следующей за заголовками, и первой составной граничной строкой. Обычно этот текст никогда не отображается в программе чтения почты с поддержкой MIME, поскольку он выходит за рамки стандартной защиты MIME. Однако при просмотре необработанного текста сообщения или при просмотре сообщения в программе чтения, не поддерживающей MIME, этот текст может стать видимым.

source: The *preamble* attribute contains this leading extra-armor text for MIME documents. When the :class:`~email.parser.Parser` discovers some text after the headers but before the first boundary string, it assigns this text to the message's *preamble* attribute. When the :class:`~email.generator.Generator` is writing out the plain text representation of a MIME message, and it finds the message has a *preamble* attribute, it will write this text in the area between the headers and the first boundary. See :mod:`email.parser` and :mod:`email.generator` for details.
ru: Атрибут *preamble* содержит начальный дополнительный текст для документов MIME. Когда :class:`~email.parser.Parser` обнаруживает некоторый текст после заголовков, но перед первой граничной строкой, он присваивает этот текст атрибуту *preamble* сообщения. Когда :class:`~email.generator.Generator` записывает простое текстовое представление сообщения MIME и обнаруживает, что сообщение имеет атрибут *preamble*, он записывает этот текст в область между заголовками и первая граница. Подробности смотрите в :mod:`email.parser` и :mod:`email.generator`.

source: Note that if the message object has no preamble, the *preamble* attribute will be ``None``.
ru: Обратите внимание: если объект сообщения не имеет преамбулы, атрибут *preamble* будет иметь значение «Нет».

source: The *epilogue* attribute acts the same way as the *preamble* attribute, except that it contains text that appears between the last boundary and the end of the message. As with the :attr:`~EmailMessage.preamble`, if there is no epilog text this attribute will be ``None``.
ru: Атрибут *epilogue* действует так же, как атрибут *preamble*, за исключением того, что он содержит текст, который появляется между последней границей и концом сообщения. Как и в случае с :attr:`~EmailMessage.preamble`, если текст эпилога отсутствует, этот атрибут будет ``None``.

source: The *defects* attribute contains a list of all the problems found when parsing this message. See :mod:`email.errors` for a detailed description of the possible parsing defects.
ru: Атрибут *defects* содержит список всех проблем, обнаруженных при разборе этого сообщения. См. :mod:`email.errors` для подробного описания возможных дефектов синтаксического анализа.

source: This class represents a subpart of a MIME message. It is identical to :class:`EmailMessage`, except that no :mailheader:`MIME-Version` headers are added when :meth:`~EmailMessage.set_content` is called, since sub-parts do not need their own :mailheader:`MIME-Version` headers.
ru: Этот класс представляет собой часть сообщения MIME. Он идентичен :class:`EmailMessage`, за исключением того, что при вызове :meth:`~EmailMessage.set_content` не добавляются заголовки :mailheader:`MIME-Version`, поскольку подчастям не нужны собственные :mailheader: Заголовки `MIME-версия`.

source: Footnotes
ru: Сноски

source: Originally added in 3.4 as a :term:`provisional module <provisional package>`. Docs for legacy message class moved to :ref:`compat32_message`.
ru: Первоначально добавлен в версии 3.4 как :term:`предварительный модуль <предварительный пакет>`. Документация по устаревшему классу сообщений перемещена в :ref:`compat32_message`.
