Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/email.compat32-message.po
Languages: ru

source: The following methods implement a mapping-like interface for accessing the message's :rfc:`2822` headers. Note that there are some semantic differences between these methods and a normal mapping (i.e. dictionary) interface. For example, in a dictionary there are no duplicate keys, but here there may be duplicate message headers. Also, in dictionaries there is no guaranteed order to the keys returned by :meth:`keys`, but in a :class:`Message` object, headers are always returned in the order they appeared in the original message, or were added to the message later. Any header deleted and then re-added are always appended to the end of the header list.
ru: Следующие методы реализуют интерфейс, похожий на сопоставление, для доступа к заголовкам :rfc:`2822` сообщения. Обратите внимание, что между этими методами и интерфейсом обычного сопоставления (то есть словаря) существуют некоторые семантические различия. Например, в словаре нет повторяющихся ключей, а здесь могут быть повторяющиеся заголовки сообщений. Кроме того, в словарях нет гарантированного порядка ключей, возвращаемых :meth:`keys`, но в объекте :class:`Message` заголовки всегда возвращаются в том порядке, в котором они появились в исходном сообщении или были добавлены в него. сообщение позже. Любой удаленный, а затем повторно добавленный заголовок всегда добавляется в конец списка заголовков.

source: These semantic differences are intentional and are biased toward maximal convenience.
ru: Эти семантические различия являются преднамеренными и направлены на максимальное удобство.

source: Note that in all cases, any envelope header present in the message is not included in the mapping interface.
ru: Обратите внимание, что во всех случаях любой заголовок конверта, присутствующий в сообщении, не включается в интерфейс сопоставления.

source: In a model generated from bytes, any header values that (in contravention of the RFCs) contain non-ASCII bytes will, when retrieved through this interface, be represented as :class:`~email.header.Header` objects with a charset of ``unknown-8bit``.
ru: В модели, сгенерированной из байтов, любые значения заголовков, которые (в нарушение RFC) содержат байты, отличные от ASCII, при получении через этот интерфейс будут представлены как объекты :class:`~email.header.Header` с кодировкой ``неизвестный-8бит``.

source: Return the total number of headers, including duplicates.
ru: Возвращает общее количество заголовков, включая дубликаты.

source: Return ``True`` if the message object has a field named *name*. Matching is done case-insensitively and *name* should not include the trailing colon. Used for the ``in`` operator, e.g.::
ru: Верните ``True``, если объект сообщения имеет поле с именем *name*. Сопоставление выполняется без учета регистра, и *имя* не должно включать в себя завершающее двоеточие. Используется для оператора ``in``, например::

source: Return the value of the named header field. *name* should not include the colon field separator. If the header is missing, ``None`` is returned; a :exc:`KeyError` is never raised.
ru: Верните значение именованного поля заголовка. *имя* не должно включать разделитель полей двоеточие. Если заголовок отсутствует, возвращается None; :exc:`KeyError` никогда не возникает.

source: Note that if the named field appears more than once in the message's headers, exactly which of those field values will be returned is undefined. Use the :meth:`get_all` method to get the values of all the extant named headers.
ru: Обратите внимание: если именованное поле появляется в заголовках сообщения более одного раза, то, какое именно из значений этого поля будет возвращено, не определено. Используйте метод :meth:`get_all`, чтобы получить значения всех существующих именованных заголовков.

source: Add a header to the message with field name *name* and value *val*. The field is appended to the end of the message's existing fields.
ru: Добавьте заголовок к сообщению с именем поля *name* и значением *val*. Поле добавляется в конец существующих полей сообщения.

source: Note that this does *not* overwrite or delete any existing header with the same name. If you want to ensure that the new header is the only one present in the message with field name *name*, delete the field first, e.g.::
ru: Обратите внимание, что это *не* перезаписывает и не удаляет любой существующий заголовок с тем же именем. Если вы хотите, чтобы новый заголовок был единственным в сообщении с именем поля *имя*, сначала удалите это поле, например::

source: Delete all occurrences of the field with name *name* from the message's headers. No exception is raised if the named field isn't present in the headers.
ru: Удалите все вхождения поля с именем *name* из заголовков сообщений. Исключение не возникает, если именованное поле отсутствует в заголовках.

source: Return a list of all the message's header field names.
ru: Возвращает список всех имен полей заголовка сообщения.

source: Return a list of all the message's field values.
ru: Возвращает список всех значений полей сообщения.

source: Return a list of 2-tuples containing all the message's field headers and values.
ru: Возвращает список из двух кортежей, содержащий все заголовки и значения полей сообщения.

source: Return the value of the named header field. This is identical to :meth:`~object.__getitem__` except that optional *failobj* is returned if the named header is missing (defaults to ``None``).
ru: Верните значение именованного поля заголовка. Это идентично :meth:`~object.__getitem__`, за исключением того, что необязательный *failobj* возвращается, если именованный заголовок отсутствует (по умолчанию ``None``).

source: Here are some additional useful methods:
ru: Вот еще несколько полезных методов:

source: Return a list of all the values for the field named *name*. If there are no such named headers in the message, *failobj* is returned (defaults to ``None``).
ru: Возвращает список всех значений поля с именем *name*. Если в сообщении нет таких именованных заголовков, возвращается *failobj* (по умолчанию — None).

source: Extended header setting. This method is similar to :meth:`__setitem__` except that additional header parameters can be provided as keyword arguments. *_name* is the header field to add and *_value* is the *primary* value for the header.
ru: Расширенная настройка заголовка. Этот метод похож на :meth:`__setitem__`, за исключением того, что дополнительные параметры заголовка могут быть предоставлены в качестве аргументов ключевого слова. *_name* — это добавляемое поле заголовка, а *_value* — это *основное* значение заголовка.

source: For each item in the keyword argument dictionary *_params*, the key is taken as the parameter name, with underscores converted to dashes (since dashes are illegal in Python identifiers). Normally, the parameter will be added as ``key="value"`` unless the value is ``None``, in which case only the key will be added. If the value contains non-ASCII characters, it can be specified as a three tuple in the format ``(CHARSET, LANGUAGE, VALUE)``, where ``CHARSET`` is a string naming the charset to be used to encode the value, ``LANGUAGE`` can usually be set to ``None`` or the empty string (see :rfc:`2231` for other possibilities), and ``VALUE`` is the string value containing non-ASCII code points. If a three tuple is not passed and the value contains non-ASCII characters, it is automatically encoded in :rfc:`2231` format using a ``CHARSET`` of ``utf-8`` and a ``LANGUAGE`` of ``None``.
ru: Для каждого элемента в словаре аргументов ключевого слова *_params* ключ принимается в качестве имени параметра, а символы подчеркивания преобразуются в тире (поскольку тире недопустимы в идентификаторах Python). Обычно параметр добавляется как ``key="value"``, если только значение не равно ``None``, в этом случае будет добавлен только ключ. Если значение содержит символы, отличные от ASCII, его можно указать в виде трехкортежа в формате ``(CHARSET, LANGUAGE, VALUE)``, где ``CHARSET`` — это строка, определяющая кодировку, которая будет использоваться для кодирования. значение, ``LANGUAGE`` обычно может быть установлено в ``None`` или пустую строку (см. :rfc:`2231` для других возможностей), а ``VALUE`` — это строковое значение, содержащее кодовые точки, отличные от ASCII. . Если трехкортеж не передается и значение содержит символы, отличные от ASCII, оно автоматически кодируется в формате :rfc:`2231` с использованием ``CHARSET`` из ``utf-8`` и ``LANGUAGE``. из ``Нет``.

source: Here's an example::
ru: Вот пример::

source: This will add a header that looks like ::
ru: Это добавит заголовок, который будет выглядеть так::

source: An example with non-ASCII characters::
ru: Пример с символами, отличными от ASCII::

source: Which produces ::
ru: Который производит ::

source: Replace a header. Replace the first header found in the message that matches *_name*, retaining header order and field name case. If no matching header was found, a :exc:`KeyError` is raised.
ru: Замените заголовок. Замените первый заголовок, найденный в сообщении, который соответствует *_name*, сохраняя порядок заголовков и регистр имени поля. Если соответствующий заголовок не найден, возникает ошибка :exc:`KeyError`.

source: Return the message's content type. The returned string is coerced to lower case of the form :mimetype:`maintype/subtype`. If there was no :mailheader:`Content-Type` header in the message the default type as given by :meth:`get_default_type` will be returned. Since according to :rfc:`2045`, messages always have a default type, :meth:`get_content_type` will always return a value.
ru: Возвращает тип содержимого сообщения. Возвращаемая строка преобразуется в нижний регистр и имеет вид :mimetype:`maintype/subtype`. Если в сообщении не было заголовка :mailheader:`Content-Type`, будет возвращен тип по умолчанию, заданный :meth:`get_default_type`. Поскольку согласно :rfc:`2045`, сообщения всегда имеют тип по умолчанию, :meth:`get_content_type` всегда будет возвращать значение.

source: :rfc:`2045` defines a message's default type to be :mimetype:`text/plain` unless it appears inside a :mimetype:`multipart/digest` container, in which case it would be :mimetype:`message/rfc822`. If the :mailheader:`Content-Type` header has an invalid type specification, :rfc:`2045` mandates that the default type be :mimetype:`text/plain`.
ru: :rfc:`2045` определяет тип сообщения по умолчанию как :mimetype:`text/plain`, если только оно не появляется внутри контейнера :mimetype:`multipart/digest`, и в этом случае это будет :mimetype:`message/rfc822` . Если заголовок :mailheader:`Content-Type` имеет недопустимую спецификацию типа, :rfc:`2045` требует, чтобы типом по умолчанию был :mimetype:`text/plain`.

source: Return the message's main content type. This is the :mimetype:`maintype` part of the string returned by :meth:`get_content_type`.
ru: Возвращает основной тип контента сообщения. Это часть :mimetype:`maintype` строки, возвращаемой :meth:`get_content_type`.

source: Return the message's sub-content type. This is the :mimetype:`subtype` part of the string returned by :meth:`get_content_type`.
ru: Возвращает тип подконтента сообщения. Это часть :mimetype:`subtype` строки, возвращаемой :meth:`get_content_type`.

source: Return the default content type. Most messages have a default content type of :mimetype:`text/plain`, except for messages that are subparts of :mimetype:`multipart/digest` containers. Such subparts have a default content type of :mimetype:`message/rfc822`.
ru: Верните тип контента по умолчанию. Большинство сообщений имеют тип содержимого по умолчанию :mimetype:`text/plain`, за исключением сообщений, которые являются подчастями контейнеров :mimetype:`multipart/digest`. Такие подразделы имеют тип контента по умолчанию :mimetype:`message/rfc822`.

source: Set the default content type. *ctype* should either be :mimetype:`text/plain` or :mimetype:`message/rfc822`, although this is not enforced. The default content type is not stored in the :mailheader:`Content-Type` header.
ru: Установите тип контента по умолчанию. *ctype* должен быть либо :mimetype:`text/plain`, либо :mimetype:`message/rfc822`, хотя это не является обязательным. Тип контента по умолчанию не хранится в заголовке :mailheader:`Content-Type`.

source: Return the message's :mailheader:`Content-Type` parameters, as a list. The elements of the returned list are 2-tuples of key/value pairs, as split on the ``'='`` sign. The left hand side of the ``'='`` is the key, while the right hand side is the value. If there is no ``'='`` sign in the parameter the value is the empty string, otherwise the value is as described in :meth:`get_param` and is unquoted if optional *unquote* is ``True`` (the default).
ru: Верните параметры :mailheader:`Content-Type` сообщения в виде списка. Элементы возвращаемого списка представляют собой два кортежа пар ключ/значение, разделенные знаком ``'='``. Левая часть ``'='`` — это ключ, а правая часть — значение. Если в параметре нет знака ``'='``, значением является пустая строка, в противном случае значение соответствует описанию в :meth:`get_param` и не помещается в кавычки, если необязательный *unquote* равен ``True`` ( значение по умолчанию).

source: Optional *failobj* is the object to return if there is no :mailheader:`Content-Type` header. Optional *header* is the header to search instead of :mailheader:`Content-Type`.
ru: Необязательный *failobj* — это объект, возвращаемый в случае отсутствия заголовка :mailheader:`Content-Type`. Необязательный *header* — это заголовок для поиска вместо :mailheader:`Content-Type`.

source: This is a legacy method. On the :class:`~email.emailmessage.EmailMessage` class its functionality is replaced by the *params* property of the individual header objects returned by the header access methods.
ru: Это устаревший метод. В классе :class:`~email.emailmessage.EmailMessage` его функциональность заменяется свойством *params* отдельных объектов заголовка, возвращаемых методами доступа к заголовку.

source: Return the value of the :mailheader:`Content-Type` header's parameter *param* as a string. If the message has no :mailheader:`Content-Type` header or if there is no such parameter, then *failobj* is returned (defaults to ``None``).
ru: Возвращает значение параметра *param* заголовка :mailheader:`Content-Type` в виде строки. Если сообщение не имеет заголовка :mailheader:`Content-Type` или такой параметр отсутствует, то возвращается *failobj* (по умолчанию значение ``None``).

source: Optional *header* if given, specifies the message header to use instead of :mailheader:`Content-Type`.
ru: Необязательный *header*, если задан, указывает заголовок сообщения, который будет использоваться вместо :mailheader:`Content-Type`.

source: Parameter keys are always compared case insensitively. The return value can either be a string, or a 3-tuple if the parameter was :rfc:`2231` encoded. When it's a 3-tuple, the elements of the value are of the form ``(CHARSET, LANGUAGE, VALUE)``. Note that both ``CHARSET`` and ``LANGUAGE`` can be ``None``, in which case you should consider ``VALUE`` to be encoded in the ``us-ascii`` charset. You can usually ignore ``LANGUAGE``.
ru: Ключи параметров всегда сравниваются без учета регистра. Возвращаемое значение может быть либо строкой, либо кортежем из трех элементов, если параметр был закодирован в формате :rfc:`2231`. Когда это кортеж из трех элементов, элементы значения имеют форму ``(CHARSET, LANGUAGE, VALUE)``. Обратите внимание, что и CHARSET, и LANGUAGE могут иметь значение None, и в этом случае вам следует учитывать, что VALUE закодировано в кодировке us-ascii. Обычно вы можете игнорировать ``LANGUAGE``.

source: If your application doesn't care whether the parameter was encoded as in :rfc:`2231`, you can collapse the parameter value by calling :func:`email.utils.collapse_rfc2231_value`, passing in the return value from :meth:`get_param`. This will return a suitably decoded Unicode string when the value is a tuple, or the original string unquoted if it isn't. For example::
ru: Если вашему приложению не важно, был ли параметр закодирован как :rfc:`2231`, вы можете свернуть значение параметра, вызвав :func:`email.utils.collapse_rfc2231_value`, передав возвращаемое значение из :meth:` get_param`. Это вернет правильно декодированную строку Unicode, если значение является кортежем, или исходную строку без кавычек, если это не так. Например::

source: In any case, the parameter value (either the returned string, or the ``VALUE`` item in the 3-tuple) is always unquoted, unless *unquote* is set to ``False``.
ru: В любом случае значение параметра (либо возвращаемая строка, либо элемент ``VALUE`` в тройке) всегда не заключено в кавычки, если только для параметра *unquote* не установлено значение ``False``.

source: Set a parameter in the :mailheader:`Content-Type` header. If the parameter already exists in the header, its value will be replaced with *value*. If the :mailheader:`Content-Type` header as not yet been defined for this message, it will be set to :mimetype:`text/plain` and the new parameter value will be appended as per :rfc:`2045`.
ru: Установите параметр в заголовке :mailheader:`Content-Type`. Если параметр уже существует в заголовке, его значение будет заменено на *значение*. Если заголовок :mailheader:`Content-Type` еще не определен для этого сообщения, ему будет присвоено значение :mimetype:`text/plain`, а новое значение параметра будет добавлено в соответствии с :rfc:`2045`.

source: Optional *header* specifies an alternative header to :mailheader:`Content-Type`, and all parameters will be quoted as necessary unless optional *requote* is ``False`` (the default is ``True``).
ru: Необязательный *header* указывает альтернативный заголовок :mailheader:`Content-Type`, и все параметры будут заключены в кавычки по мере необходимости, если необязательный *requote* не имеет значения ``False`` (по умолчанию установлено ``True``).

source: If optional *charset* is specified, the parameter will be encoded according to :rfc:`2231`. Optional *language* specifies the RFC 2231 language, defaulting to the empty string. Both *charset* and *language* should be strings.
ru: Если указан необязательный *charset*, параметр будет закодирован в соответствии с :rfc:`2231`. Необязательный *language* указывает язык RFC 2231, по умолчанию используется пустая строка. И *charset*, и *language* должны быть строками.

source: If *replace* is ``False`` (the default) the header is moved to the end of the list of headers. If *replace* is ``True``, the header will be updated in place.
ru: Если *replace* имеет значение «False» (по умолчанию), заголовок перемещается в конец списка заголовков. Если *replace* имеет значение True, заголовок будет обновлен на месте.

source: ``replace`` keyword was added.
ru: Добавлено ключевое слово replace.

source: Remove the given parameter completely from the :mailheader:`Content-Type` header. The header will be re-written in place without the parameter or its value. All values will be quoted as necessary unless *requote* is ``False`` (the default is ``True``). Optional *header* specifies an alternative to :mailheader:`Content-Type`.
ru: Полностью удалите данный параметр из заголовка :mailheader:`Content-Type`. Заголовок будет перезаписан без параметра или его значения. Все значения будут заключены в кавычки по мере необходимости, если *requote* не равно ``False`` (по умолчанию установлено ``True``). Необязательный *header* указывает альтернативу :mailheader:`Content-Type`.

source: Set the main type and subtype for the :mailheader:`Content-Type` header. *type* must be a string in the form :mimetype:`maintype/subtype`, otherwise a :exc:`ValueError` is raised.
ru: Установите основной тип и подтип для заголовка :mailheader:`Content-Type`. *type* должен быть строкой в ​​форме :mimetype:`maintype/subtype`, в противном случае выдается :exc:`ValueError`.

source: This method replaces the :mailheader:`Content-Type` header, keeping all the parameters in place. If *requote* is ``False``, this leaves the existing header's quoting as is, otherwise the parameters will be quoted (the default).
ru: Этот метод заменяет заголовок :mailheader:`Content-Type`, сохраняя все параметры на месте. Если *requote* имеет значение «False», это оставляет кавычки существующего заголовка как есть, в противном случае параметры будут заключены в кавычки (по умолчанию).

source: An alternative header can be specified in the *header* argument. When the :mailheader:`Content-Type` header is set a :mailheader:`MIME-Version` header is also added.
ru: Альтернативный заголовок можно указать в аргументе *header*. Когда установлен заголовок :mailheader:`Content-Type`, также добавляется заголовок :mailheader:`MIME-Version`.

source: This is a legacy method. On the :class:`~email.emailmessage.EmailMessage` class its functionality is replaced by the ``make_`` and ``add_`` methods.
ru: Это устаревший метод. В классе :class:`~email.emailmessage.EmailMessage` его функциональность заменяется методами ``make_`` и ``add_``.

source: Return the value of the ``filename`` parameter of the :mailheader:`Content-Disposition` header of the message. If the header does not have a ``filename`` parameter, this method falls back to looking for the ``name`` parameter on the :mailheader:`Content-Type` header. If neither is found, or the header is missing, then *failobj* is returned. The returned string will always be unquoted as per :func:`email.utils.unquote`.
ru: Возвращает значение параметра ``filename`` заголовка :mailheader:`Content-Disposition` сообщения. Если в заголовке нет параметра ``filename``, этот метод возвращается к поиску параметра ``name`` в заголовке :mailheader:`Content-Type`. Если ни один из них не найден или заголовок отсутствует, возвращается *failobj*. Возвращенная строка всегда будет без кавычек согласно :func:`email.utils.unquote`.

source: Return the value of the ``boundary`` parameter of the :mailheader:`Content-Type` header of the message, or *failobj* if either the header is missing, or has no ``boundary`` parameter. The returned string will always be unquoted as per :func:`email.utils.unquote`.
ru: Возвращает значение параметра ``boundary`` заголовка :mailheader:`Content-Type` сообщения или *failobj*, если заголовок отсутствует или не имеет параметра ``boundary``. Возвращенная строка всегда будет без кавычек согласно :func:`email.utils.unquote`.

source: Set the ``boundary`` parameter of the :mailheader:`Content-Type` header to *boundary*. :meth:`set_boundary` will always quote *boundary* if necessary. A :exc:`~email.errors.HeaderParseError` is raised if the message object has no :mailheader:`Content-Type` header.
ru: Установите для параметра border заголовка :mailheader:`Content-Type` значение *boundary*. :meth:`set_boundary` всегда будет заключать в кавычки *boundary*, если это необходимо. Ошибка :exc:`~email.errors.HeaderParseError` возникает, если объект сообщения не имеет заголовка :mailheader:`Content-Type`.

source: Note that using this method is subtly different than deleting the old :mailheader:`Content-Type` header and adding a new one with the new boundary via :meth:`add_header`, because :meth:`set_boundary` preserves the order of the :mailheader:`Content-Type` header in the list of headers. However, it does *not* preserve any continuation lines which may have been present in the original :mailheader:`Content-Type` header.
ru: Обратите внимание, что использование этого метода немного отличается от удаления старого заголовка :mailheader:`Content-Type` и добавления нового с новой границей через :meth:`add_header`, поскольку :meth:`set_boundary` сохраняет порядок :mailheader:`Content-Type` заголовок в списке заголовков. Однако он *не* сохраняет какие-либо строки продолжения, которые могли присутствовать в исходном заголовке :mailheader:`Content-Type`.
