Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/email.charset.po
Languages: ru

source: :mod:`!email.charset`: Representing character sets
ru: :mod:`!email.charset`: Представление наборов символов.

source: **Source code:** :source:`Lib/email/charset.py`
ru: **Исходный код:** :source:`Lib/email/charset.py`

source: This module is part of the legacy (``Compat32``) email API. In the new API only the aliases table is used.
ru: Этот модуль является частью устаревшего API электронной почты (Compat32). В новом API используется только таблица псевдонимов.

source: The remaining text in this section is the original documentation of the module.
ru: Оставшийся текст в этом разделе представляет собой исходную документацию модуля.

source: This module provides a class :class:`Charset` for representing character sets and character set conversions in email messages, as well as a character set registry and several convenience methods for manipulating this registry. Instances of :class:`Charset` are used in several other modules within the :mod:`email` package.
ru: Этот модуль предоставляет класс :class:`Charset` для представления наборов символов и преобразований наборов символов в сообщениях электронной почты, а также реестр наборов символов и несколько удобных методов для управления этим реестром. Экземпляры :class:`Charset` используются в нескольких других модулях пакета :mod:`email`.

source: Import this class from the :mod:`email.charset` module.
ru: Импортируйте этот класс из модуля :mod:`email.charset`.

source: Map character sets to their email properties.
ru: Сопоставьте наборы символов с их свойствами электронной почты.

source: This class provides information about the requirements imposed on email for a specific character set. It also provides convenience routines for converting between character sets, given the availability of the applicable codecs. Given a character set, it will do its best to provide information on how to use that character set in an email message in an RFC-compliant way.
ru: Этот класс предоставляет информацию о требованиях, предъявляемых к электронной почте для определенного набора символов. Он также предоставляет удобные процедуры для преобразования наборов символов при наличии соответствующих кодеков. Учитывая набор символов, он сделает все возможное, чтобы предоставить информацию о том, как использовать этот набор символов в сообщении электронной почты в соответствии с RFC.

source: Certain character sets must be encoded with quoted-printable or base64 when used in email headers or bodies. Certain character sets must be converted outright, and are not allowed in email.
ru: Определенные наборы символов должны быть закодированы с помощью Quote-printable или Base64 при использовании в заголовках или телах электронных писем. Некоторые наборы символов необходимо конвертировать напрямую, и их использование в электронной почте запрещено.

source: Optional *input_charset* is as described below; it is always coerced to lower case. After being alias normalized it is also used as a lookup into the registry of character sets to find out the header encoding, body encoding, and output conversion codec to be used for the character set. For example, if *input_charset* is ``iso-8859-1``, then headers and bodies will be encoded using quoted-printable and no output conversion codec is necessary. If *input_charset* is ``euc-jp``, then headers will be encoded with base64, bodies will not be encoded, but output text will be converted from the ``euc-jp`` character set to the ``iso-2022-jp`` character set.
ru: Необязательный *input_charset* описан ниже; он всегда приводится к нижнему регистру. После нормализации псевдонимов он также используется для поиска в реестре наборов символов, чтобы определить кодировку заголовка, кодировку тела и кодек преобразования вывода, которые будут использоваться для набора символов. Например, если *input_charset* равен ``iso-8859-1``, то заголовки и тела будут закодированы с использованием Quote-printable, и кодек преобразования вывода не требуется. Если *input_charset* равен ``euc-jp``, то заголовки будут закодированы с помощью base64, тела не будут кодироваться, но выходной текст будет преобразован из набора символов ``euc-jp`` в ``iso- Набор символов 2022-jp``.

source: :class:`Charset` instances have the following data attributes:
ru: Экземпляры :class:`Charset` имеют следующие атрибуты данных:

source: The initial character set specified. Common aliases are converted to their *official* email names (e.g. ``latin_1`` is converted to ``iso-8859-1``). Defaults to 7-bit ``us-ascii``.
ru: Указан исходный набор символов. Общие псевдонимы преобразуются в *официальные* имена электронной почты (например, ``latin_1`` преобразуется в ``iso-8859-1``). По умолчанию используется 7-битный us-ascii.

source: If the character set must be encoded before it can be used in an email header, this attribute will be set to ``charset.QP`` (for quoted-printable), ``charset.BASE64`` (for base64 encoding), or ``charset.SHORTEST`` for the shortest of QP or BASE64 encoding. Otherwise, it will be ``None``.
ru: Если набор символов должен быть закодирован, прежде чем его можно будет использовать в заголовке электронного письма, для этого атрибута будет установлено значение ``charset.QP`` (для цитируемой печати), ``charset.BASE64`` (для кодировки base64), или ``charset.SHORTEST`` для самой короткой кодировки QP или BASE64. В противном случае это будет ``None``.

source: Same as *header_encoding*, but describes the encoding for the mail message's body, which indeed may be different than the header encoding. ``charset.SHORTEST`` is not allowed for *body_encoding*.
ru: То же, что *header_encoding*, но описывает кодировку тела почтового сообщения, которая действительно может отличаться от кодировки заголовка. ``charset.SHORTEST`` не разрешен для *body_encoding*.

source: Some character sets must be converted before they can be used in email headers or bodies. If the *input_charset* is one of them, this attribute will contain the name of the character set output will be converted to. Otherwise, it will be ``None``.
ru: Некоторые наборы символов необходимо преобразовать, прежде чем их можно будет использовать в заголовках или тексте электронных писем. Если *input_charset* является одним из них, этот атрибут будет содержать имя набора символов, в который будут преобразованы выходные данные. В противном случае это будет ``None``.

source: The name of the Python codec used to convert the *input_charset* to Unicode. If no conversion codec is necessary, this attribute will be ``None``.
ru: Имя кодека Python, используемого для преобразования *input_charset* в Unicode. Если кодек преобразования не требуется, этот атрибут будет «Нет».

source: The name of the Python codec used to convert Unicode to the *output_charset*. If no conversion codec is necessary, this attribute will have the same value as the *input_codec*.
ru: Имя кодека Python, используемого для преобразования Unicode в *output_charset*. Если кодек преобразования не требуется, этот атрибут будет иметь то же значение, что и *input_codec*.

source: :class:`Charset` instances also have the following methods:
ru: Экземпляры :class:`Charset` также имеют следующие методы:

source: Return the content transfer encoding used for body encoding.
ru: Возвращает кодировку передачи контента, используемую для кодирования тела.

source: This is either the string ``quoted-printable`` or ``base64`` depending on the encoding used, or it is a function, in which case you should call the function with a single argument, the Message object being encoded. The function should then set the :mailheader:`Content-Transfer-Encoding` header itself to whatever is appropriate.
ru: Это либо строка ``quoted-printable``, либо ``base64`` в зависимости от используемой кодировки, либо это функция, и в этом случае вы должны вызвать функцию с одним аргументом - кодируемым объектом Message. Затем функция должна установить заголовок :mailheader:`Content-Transfer-Encoding` в любое подходящее значение.

source: Returns the string ``quoted-printable`` if *body_encoding* is ``QP``, returns the string ``base64`` if *body_encoding* is ``BASE64``, and returns the string ``7bit`` otherwise.
ru: Возвращает строку ``quoted-printable``, если *body_encoding* имеет значение ``QP``, возвращает строку ``base64``, если *body_encoding* имеет значение ``BASE64``, и возвращает строку ``7bit`` в противном случае. .

source: Return the output character set.
ru: Возвращает выходной набор символов.

source: This is the *output_charset* attribute if that is not ``None``, otherwise it is *input_charset*.
ru: Это атрибут *output_charset*, если он не ``None``, в противном случае это *input_charset*.

source: Header-encode the string *string*.
ru: Закодируйте в заголовке строку *string*.

source: The type of encoding (base64 or quoted-printable) will be based on the *header_encoding* attribute.
ru: Тип кодировки (base64 или quote-printable) будет основан на атрибуте *header_encoding*.

source: Header-encode a *string* by converting it first to bytes.
ru: Закодируйте *строку* в заголовке, сначала преобразуя ее в байты.

source: This is similar to :meth:`header_encode` except that the string is fit into maximum line lengths as given by the argument *maxlengths*, which must be an iterator: each element returned from this iterator will provide the next maximum line length.
ru: Это похоже на :meth:`header_encode`, за исключением того, что строка умещается в максимальную длину строки, заданную аргументом *maxlengths*, который должен быть итератором: каждый элемент, возвращаемый из этого итератора, будет обеспечивать следующую максимальную длину строки.

source: Body-encode the string *string*.
ru: В теле закодируйте строку *string*.

source: The type of encoding (base64 or quoted-printable) will be based on the *body_encoding* attribute.
ru: Тип кодировки (base64 или Quote-printable) будет основан на атрибуте *body_encoding*.

source: The :class:`Charset` class also provides a number of methods to support standard operations and built-in functions.
ru: Класс :class:`Charset` также предоставляет ряд методов для поддержки стандартных операций и встроенных функций.

source: Returns *input_charset* as a string coerced to lower case. :meth:`!__repr__` is an alias for :meth:`!__str__`.
ru: Возвращает *input_charset* как строку, переведенную в нижний регистр. :meth:`!__repr__` — это псевдоним для :meth:`!__str__`.

source: This method allows you to compare two :class:`Charset` instances for equality.
ru: Этот метод позволяет вам сравнить два экземпляра :class:`Charset` на предмет равенства.

source: This method allows you to compare two :class:`Charset` instances for inequality.
ru: Этот метод позволяет вам сравнить два экземпляра :class:`Charset` на предмет неравенства.

source: The :mod:`email.charset` module also provides the following functions for adding new entries to the global character set, alias, and codec registries:
ru: Модуль :mod:`email.charset` также предоставляет следующие функции для добавления новых записей в реестры глобального набора символов, псевдонимов и кодеков:

source: Add character properties to the global registry.
ru: Добавьте свойства персонажа в глобальный реестр.

source: *charset* is the input character set, and must be the canonical name of a character set.
ru: *charset* — это входной набор символов, который должен быть каноническим именем набора символов.

source: Optional *header_enc* and *body_enc* is either ``charset.QP`` for quoted-printable, ``charset.BASE64`` for base64 encoding, ``charset.SHORTEST`` for the shortest of quoted-printable or base64 encoding, or ``None`` for no encoding. ``SHORTEST`` is only valid for *header_enc*. The default is ``None`` for no encoding.
ru: Необязательные *header_enc* и *body_enc* — это либо charset.QP для печати в кавычках, charset.BASE64 для кодировки base64, charset.SHORTEST для самой короткой кодировки для печати или base64. или ``None`` для отсутствия кодирования. ``SHORTEST`` действителен только для *header_enc*. По умолчанию установлено значение «Нет» для отсутствия кодирования.

source: Optional *output_charset* is the character set that the output should be in. Conversions will proceed from input charset, to Unicode, to the output charset when the method :meth:`Charset.convert` is called. The default is to output in the same character set as the input.
ru: Необязательный *output_charset* — это набор символов, в котором должен быть вывод. Преобразования будут продолжаться из входной кодировки в Unicode в выходную кодировку при вызове метода :meth:`Charset.convert`. По умолчанию выводится тот же набор символов, что и на входе.

source: Both *input_charset* and *output_charset* must have Unicode codec entries in the module's character set-to-codec mapping; use :func:`add_codec` to add codecs the module does not know about. See the :mod:`codecs` module's documentation for more information.
ru: И *input_charset*, и *output_charset* должны иметь записи кодека Unicode в сопоставлении набора символов с кодеком модуля; используйте :func:`add_codec` для добавления кодеков, о которых модуль не знает. Дополнительную информацию смотрите в документации модуля :mod:`codecs`.

source: The global character set registry is kept in the module global dictionary ``CHARSETS``.
ru: Реестр глобального набора символов хранится в глобальном словаре модуля CHARSETS.

source: Add a character set alias. *alias* is the alias name, e.g. ``latin-1``. *canonical* is the character set's canonical name, e.g. ``iso-8859-1``.
ru: Добавьте псевдоним набора символов. *alias* — это имя псевдонима, например ``latin-1``. *canonical* — это каноническое имя набора символов, например ``iso-8859-1``.

source: The global charset alias registry is kept in the module global dictionary ``ALIASES``.
ru: Глобальный реестр псевдонимов кодировок хранится в глобальном словаре модуля ``ALIASES``.

source: Add a codec that map characters in the given character set to and from Unicode.
ru: Добавьте кодек, который отображает символы заданного набора символов в Юникод и обратно.

source: *charset* is the canonical name of a character set. *codecname* is the name of a Python codec, as appropriate for the second argument to the :class:`str`'s :meth:`~str.encode` method.
ru: *charset* — каноническое имя набора символов. *codecname* — это имя кодека Python, соответствующее второму аргументу метода :class:`str` :meth:`~str.encode`.
