Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/email.compat32-message.po
Languages: ru

source: :mod:`email.message.Message`: Representing an email message using the :data:`~email.policy.compat32` API
ru: :mod:`email.message.Message`: Представление сообщения электронной почты с помощью API :data:`~email.policy.compat32`

source: The :class:`Message` class is very similar to the :class:`~email.message.EmailMessage` class, without the methods added by that class, and with the default behavior of certain other methods being slightly different. We also document here some methods that, while supported by the :class:`~email.message.EmailMessage` class, are not recommended unless you are dealing with legacy code.
ru: Класс :class:`Message` очень похож на класс :class:`~email.message.EmailMessage`, за исключением методов, добавленных этим классом, а поведение некоторых других методов по умолчанию немного отличается. Мы также документируем здесь некоторые методы, которые, хотя и поддерживаются классом :class:`~email.message.EmailMessage`, не рекомендуются к использованию, если вы не имеете дело с устаревшим кодом.

source: The philosophy and structure of the two classes is otherwise the same.
ru: В остальном философия и структура этих двух классов одинаковы.

source: This document describes the behavior under the default (for :class:`Message`) policy :attr:`~email.policy.Compat32`. If you are going to use another policy, you should be using the :class:`~email.message.EmailMessage` class instead.
ru: В этом документе описывается поведение политики по умолчанию (для :class:`Message`) :attr:`~email.policy.Compat32`. Если вы собираетесь использовать другую политику, вам следует использовать вместо нее класс :class:`~email.message.EmailMessage`.

source: An email message consists of *headers* and a *payload*. Headers must be :rfc:`5322` style names and values, where the field name and value are separated by a colon. The colon is not part of either the field name or the field value. The payload may be a simple text message, or a binary object, or a structured sequence of sub-messages each with their own set of headers and their own payload. The latter type of payload is indicated by the message having a MIME type such as :mimetype:`multipart/\*` or :mimetype:`message/rfc822`.
ru: Сообщение электронной почты состоит из *заголовков* и *полезной нагрузки*. Заголовки должны иметь имена и значения в стиле :rfc:`5322`, где имя и значение поля разделяются двоеточием. Двоеточие не является частью ни имени поля, ни значения поля. Полезная нагрузка может представлять собой простое текстовое сообщение, двоичный объект или структурированную последовательность подсообщений, каждое из которых имеет собственный набор заголовков и собственную полезную нагрузку. Последний тип полезных данных обозначается сообщением, имеющим тип MIME, например :mimetype:`multipart/\*` или :mimetype:`message/rfc822`.

source: The conceptual model provided by a :class:`Message` object is that of an ordered dictionary of headers with additional methods for accessing both specialized information from the headers, for accessing the payload, for generating a serialized version of the message, and for recursively walking over the object tree. Note that duplicate headers are supported but special methods must be used to access them.
ru: Концептуальная модель, предоставляемая объектом :class:`Message`, представляет собой упорядоченный словарь заголовков с дополнительными методами для доступа как к специализированной информации из заголовков, так и для доступа к полезной нагрузке, для генерации сериализованной версии сообщения и для рекурсивного проходя по дереву объектов. Обратите внимание, что дублирующиеся заголовки поддерживаются, но для доступа к ним необходимо использовать специальные методы.

source: The :class:`Message` pseudo-dictionary is indexed by the header names, which must be ASCII values. The values of the dictionary are strings that are supposed to contain only ASCII characters; there is some special handling for non-ASCII input, but it doesn't always produce the correct results. Headers are stored and returned in case-preserving form, but field names are matched case-insensitively. There may also be a single envelope header, also known as the *Unix-From* header or the ``From_`` header. The *payload* is either a string or bytes, in the case of simple message objects, or a list of :class:`Message` objects, for MIME container documents (e.g. :mimetype:`multipart/\*` and :mimetype:`message/rfc822`).
ru: Псевдословарь :class:`Message` индексируется по именам заголовков, которые должны быть значениями ASCII. Значения словаря — это строки, которые должны содержать только символы ASCII; существует специальная обработка ввода, отличного от ASCII, но она не всегда дает правильные результаты. Заголовки сохраняются и возвращаются в форме с сохранением регистра, но имена полей сопоставляются без учета регистра. Также может быть один заголовок конверта, также известный как заголовок *Unix-From* или заголовок «From_». *Полезная нагрузка* — это строка или байты в случае простых объектов сообщений или список объектов :class:`Message` для документов-контейнеров MIME (например, :mimetype:`multipart/\*` и :mimetype: `сообщение/rfc822`).

source: Here are the methods of the :class:`Message` class:
ru: Вот методы класса :class:`Message`:

source: If *policy* is specified (it must be an instance of a :mod:`~email.policy` class) use the rules it specifies to update and serialize the representation of the message. If *policy* is not set, use the :class:`compat32 <email.policy.Compat32>` policy, which maintains backward compatibility with the Python 3.2 version of the email package. For more information see the :mod:`~email.policy` documentation.
ru: Если указана *policy* (она должна быть экземпляром класса :mod:`~email.policy`), используйте указанные ею правила для обновления и сериализации представления сообщения. Если *policy* не задано, используйте политику :class:`compat32 <email.policy.Compat32>`, которая обеспечивает обратную совместимость с версией пакета электронной почты Python 3.2. Для получения дополнительной информации см. документацию :mod:`~email.policy`.

source: The *policy* keyword argument was added.
ru: Был добавлен аргумент ключевого слова *policy*.

source: Return the entire message flattened as a string. When optional *unixfrom* is true, the envelope header is included in the returned string. *unixfrom* defaults to ``False``. For backward compatibility reasons, *maxheaderlen* defaults to ``0``, so if you want a different value you must override it explicitly (the value specified for *max_line_length* in the policy will be ignored by this method). The *policy* argument may be used to override the default policy obtained from the message instance. This can be used to control some of the formatting produced by the method, since the specified *policy* will be passed to the ``Generator``.
ru: Вернуть все сообщение в виде строки. Если необязательный параметр *unixfrom* имеет значение true, заголовок конверта включается в возвращаемую строку. *unixfrom* по умолчанию имеет значение «False». По соображениям обратной совместимости *maxheaderlen* по умолчанию имеет значение ``0``, поэтому, если вам нужно другое значение, вы должны явно переопределить его (значение, указанное для *max_line_length* в политике, будет игнорироваться этим методом). Аргумент *policy* можно использовать для переопределения политики по умолчанию, полученной из экземпляра сообщения. Это можно использовать для управления некоторым форматированием, создаваемым методом, поскольку указанная *политика* будет передана в ``Генератор``.

source: Flattening the message may trigger changes to the :class:`Message` if defaults need to be filled in to complete the transformation to a string (for example, MIME boundaries may be generated or modified).
ru: Сглаживание сообщения может вызвать изменения в :class:`Message`, если для завершения преобразования в строку необходимо заполнить значения по умолчанию (например, могут быть созданы или изменены границы MIME).

source: Note that this method is provided as a convenience and may not always format the message the way you want. For example, by default it does not do the mangling of lines that begin with ``From`` that is required by the Unix mbox format. For more flexibility, instantiate a :class:`~email.generator.Generator` instance and use its :meth:`~email.generator.Generator.flatten` method directly. For example::
ru: Обратите внимание, что этот метод предоставляется для удобства и не всегда может форматировать сообщение так, как вы хотите. Например, по умолчанию он не выполняет искажение строк, начинающихся с ``From``, как того требует формат Unix mbox. Для большей гибкости создайте экземпляр :class:`~email.generator.Generator` и используйте его метод :meth:`~email.generator.Generator.flatten` напрямую. Например::

source: If the message object contains binary data that is not encoded according to RFC standards, the non-compliant data will be replaced by unicode "unknown character" code points. (See also :meth:`.as_bytes` and :class:`~email.generator.BytesGenerator`.)
ru: Если объект сообщения содержит двоичные данные, которые не закодированы в соответствии со стандартами RFC, несовместимые данные будут заменены кодовыми точками Юникода «неизвестный символ». (См. также :meth:`.as_bytes` и :class:`~email.generator.BytesGenerator`.)

source: the *policy* keyword argument was added.
ru: был добавлен аргумент ключевого слова *policy*.

source: Equivalent to :meth:`.as_string`. Allows ``str(msg)`` to produce a string containing the formatted message.
ru: Эквивалент :meth:`.as_string`. Позволяет ``str(msg)`` создавать строку, содержащую форматированное сообщение.

source: Return the entire message flattened as a bytes object. When optional *unixfrom* is true, the envelope header is included in the returned string. *unixfrom* defaults to ``False``. The *policy* argument may be used to override the default policy obtained from the message instance. This can be used to control some of the formatting produced by the method, since the specified *policy* will be passed to the ``BytesGenerator``.
ru: Верните все сообщение в виде байтового объекта. Если необязательный параметр *unixfrom* имеет значение true, заголовок конверта включается в возвращаемую строку. *unixfrom* по умолчанию имеет значение «False». Аргумент *policy* можно использовать для переопределения политики по умолчанию, полученной из экземпляра сообщения. Это можно использовать для управления некоторыми аспектами форматирования, производимыми методом, поскольку указанная *политика* будет передана в ``BytesGenerator``.

source: Note that this method is provided as a convenience and may not always format the message the way you want. For example, by default it does not do the mangling of lines that begin with ``From`` that is required by the Unix mbox format. For more flexibility, instantiate a :class:`~email.generator.BytesGenerator` instance and use its :meth:`~email.generator.BytesGenerator.flatten` method directly. For example::
ru: Обратите внимание, что этот метод предоставляется для удобства и не всегда может форматировать сообщение так, как вы хотите. Например, по умолчанию он не выполняет искажение строк, начинающихся с ``From``, как того требует формат Unix mbox. Для большей гибкости создайте экземпляр :class:`~email.generator.BytesGenerator` и используйте его метод :meth:`~email.generator.BytesGenerator.flatten` напрямую. Например::

source: Equivalent to :meth:`.as_bytes`. Allows ``bytes(msg)`` to produce a bytes object containing the formatted message.
ru: Эквивалент :meth:`.as_bytes`. Позволяет ``bytes(msg)`` создавать объект bytes, содержащий форматированное сообщение.

source: Return ``True`` if the message's payload is a list of sub-\ :class:`Message` objects, otherwise return ``False``. When :meth:`is_multipart` returns ``False``, the payload should be a string object (which might be a CTE encoded binary payload). (Note that :meth:`is_multipart` returning ``True`` does not necessarily mean that "msg.get_content_maintype() == 'multipart'" will return the ``True``. For example, ``is_multipart`` will return ``True`` when the :class:`Message` is of type ``message/rfc822``.)
ru: Возвращайте ``True``, если полезные данные сообщения представляют собой список объектов подкласса \ :class:`Message`, в противном случае возвращайте ``False``. Когда :meth:`is_multipart` возвращает ``False``, полезная нагрузка должна быть строковым объектом (который может быть двоичной полезной нагрузкой в ​​кодировке CTE). (Обратите внимание, что :meth:`is_multipart`, возвращающий ``True``, не обязательно означает, что "msg.get_content_maintype() == 'multipart'" вернет ``True``. Например, ``is_multipart`` будет возвращайте ``True``, когда :class:`Message` имеет тип ``message/rfc822``.)

source: Set the message's envelope header to *unixfrom*, which should be a string.
ru: Установите для заголовка конверта сообщения значение *unixfrom*, которое должно быть строкой.

source: Return the message's envelope header. Defaults to ``None`` if the envelope header was never set.
ru: Верните заголовок конверта сообщения. По умолчанию установлено значение «Нет», если заголовок конверта никогда не устанавливался.

source: Add the given *payload* to the current payload, which must be ``None`` or a list of :class:`Message` objects before the call. After the call, the payload will always be a list of :class:`Message` objects. If you want to set the payload to a scalar object (e.g. a string), use :meth:`set_payload` instead.
ru: Добавьте заданную *полезную нагрузку* к текущей полезной нагрузке, которая должна быть ``None`` или списком объектов :class:`Message` перед вызовом. После вызова полезная нагрузка всегда будет списком объектов :class:`Message`. Если вы хотите установить полезную нагрузку в скалярный объект (например, строку), используйте вместо этого :meth:`set_payload`.

source: This is a legacy method. On the :class:`~email.emailmessage.EmailMessage` class its functionality is replaced by :meth:`~email.message.EmailMessage.set_content` and the related ``make`` and ``add`` methods.
ru: Это устаревший метод. В классе :class:`~email.emailmessage.EmailMessage` его функциональность заменяется :meth:`~email.message.EmailMessage.set_content` и соответствующими методами ``make`` и ``add``.

source: Return the current payload, which will be a list of :class:`Message` objects when :meth:`is_multipart` is ``True``, or a string when :meth:`is_multipart` is ``False``. If the payload is a list and you mutate the list object, you modify the message's payload in place.
ru: Возвращает текущую полезную нагрузку, которая будет списком объектов :class:`Message`, если :meth:`is_multipart` имеет значение ``True``, или строкой, если :meth:`is_multipart` имеет значение ``False``. Если полезные данные представляют собой список и вы изменяете объект списка, вы изменяете полезные данные сообщения на месте.

source: With optional argument *i*, :meth:`get_payload` will return the *i*-th element of the payload, counting from zero, if :meth:`is_multipart` is ``True``. An :exc:`IndexError` will be raised if *i* is less than 0 or greater than or equal to the number of items in the payload. If the payload is a string (i.e. :meth:`is_multipart` is ``False``) and *i* is given, a :exc:`TypeError` is raised.
ru: С необязательным аргументом *i*, :meth:`get_payload` вернет *i*-й элемент полезных данных, считая с нуля, если :meth:`is_multipart` имеет значение ``True``. :exc:`IndexError` будет возникать, если *i* меньше 0 или больше или равно количеству элементов в полезных данных. Если полезная нагрузка представляет собой строку (т. е. :meth:`is_multipart` имеет значение ``False``) и задано *i*, возникает ошибка :exc:`TypeError`.

source: Optional *decode* is a flag indicating whether the payload should be decoded or not, according to the :mailheader:`Content-Transfer-Encoding` header. When ``True`` and the message is not a multipart, the payload will be decoded if this header's value is ``quoted-printable`` or ``base64``. If some other encoding is used, or :mailheader:`Content-Transfer-Encoding` header is missing, the payload is returned as-is (undecoded). In all cases the returned value is binary data. If the message is a multipart and the *decode* flag is ``True``, then ``None`` is returned. If the payload is base64 and it was not perfectly formed (missing padding, characters outside the base64 alphabet), then an appropriate defect will be added to the message's defect property (:class:`~email.errors.InvalidBase64PaddingDefect` or :class:`~email.errors.InvalidBase64CharactersDefect`, respectively).
ru: Необязательный *decode* — это флаг, указывающий, следует ли декодировать полезную нагрузку или нет, в соответствии с заголовком :mailheader:`Content-Transfer-Encoding`. Когда ``True`` и сообщение не является составным, полезные данные будут декодированы, если значение этого заголовка равно ``quoted-printable`` или ``base64``. Если используется другая кодировка или заголовок :mailheader:`Content-Transfer-Encoding` отсутствует, полезные данные возвращаются как есть (некодированные). Во всех случаях возвращаемое значение представляет собой двоичные данные. Если сообщение состоит из нескольких частей и флаг *decode* имеет значение True, то возвращается None. Если полезная нагрузка имеет формат Base64 и сформирована неправильно (отсутствуют отступы, символы вне алфавита Base64), то соответствующий дефект будет добавлен к свойству дефекта сообщения (:class:`~email.errors.InvalidBase64PaddingDefect` или :class: `~email.errors.InvalidBase64CharactersDefect` соответственно).

source: When *decode* is ``False`` (the default) the body is returned as a string without decoding the :mailheader:`Content-Transfer-Encoding`. However, for a :mailheader:`Content-Transfer-Encoding` of 8bit, an attempt is made to decode the original bytes using the ``charset`` specified by the :mailheader:`Content-Type` header, using the ``replace`` error handler. If no ``charset`` is specified, or if the ``charset`` given is not recognized by the email package, the body is decoded using the default ASCII charset.
ru: Когда *decode* имеет значение «False» (по умолчанию), тело возвращается в виде строки без декодирования :mailheader:`Content-Transfer-Encoding`. Однако для :mailheader:`Content-Transfer-Encoding` размером 8 бит делается попытка декодировать исходные байты с использованием ``кодировки``, указанной в заголовке :mailheader:`Content-Type`, с использованием `` replace`` обработчик ошибок. Если кодировка не указана или указанная кодировка не распознается пакетом электронной почты, тело декодируется с использованием кодировки ASCII по умолчанию.

source: This is a legacy method. On the :class:`~email.emailmessage.EmailMessage` class its functionality is replaced by :meth:`~email.message.EmailMessage.get_content` and :meth:`~email.message.EmailMessage.iter_parts`.
ru: Это устаревший метод. В классе :class:`~email.emailmessage.EmailMessage` его функциональность заменяется :meth:`~email.message.EmailMessage.get_content` и :meth:`~email.message.EmailMessage.iter_parts`.

source: Set the entire message object's payload to *payload*. It is the client's responsibility to ensure the payload invariants. Optional *charset* sets the message's default character set; see :meth:`set_charset` for details.
ru: Установите для всей полезной нагрузки объекта сообщения значение *payload*. Ответственность за обеспечение инвариантов полезной нагрузки лежит на клиенте. Необязательный *charset* устанавливает набор символов сообщения по умолчанию; подробности см. в :meth:`set_charset`.

source: This is a legacy method. On the :class:`~email.emailmessage.EmailMessage` class its functionality is replaced by :meth:`~email.message.EmailMessage.set_content`.
ru: Это устаревший метод. В классе :class:`~email.emailmessage.EmailMessage` его функциональность заменяется на :meth:`~email.message.EmailMessage.set_content`.

source: Set the character set of the payload to *charset*, which can either be a :class:`~email.charset.Charset` instance (see :mod:`email.charset`), a string naming a character set, or ``None``. If it is a string, it will be converted to a :class:`~email.charset.Charset` instance. If *charset* is ``None``, the ``charset`` parameter will be removed from the :mailheader:`Content-Type` header (the message will not be otherwise modified). Anything else will generate a :exc:`TypeError`.
ru: Установите для набора символов полезной нагрузки значение *charset*, которое может быть экземпляром :class:`~email.charset.Charset` (см. :mod:`email.charset`), строкой, определяющей набор символов, или ` ``Нет``. Если это строка, она будет преобразована в экземпляр :class:`~email.charset.Charset`. Если *charset* имеет значение None, параметр charset будет удален из заголовка :mailheader:Content-Type (сообщение не будет изменено иначе). Все остальное вызовет ошибку :exc:`TypeError`.

source: If there is no existing :mailheader:`MIME-Version` header one will be added. If there is no existing :mailheader:`Content-Type` header, one will be added with a value of :mimetype:`text/plain`. Whether the :mailheader:`Content-Type` header already exists or not, its ``charset`` parameter will be set to *charset.output_charset*. If *charset.input_charset* and *charset.output_charset* differ, the payload will be re-encoded to the *output_charset*. If there is no existing :mailheader:`Content-Transfer-Encoding` header, then the payload will be transfer-encoded, if needed, using the specified :class:`~email.charset.Charset`, and a header with the appropriate value will be added. If a :mailheader:`Content-Transfer-Encoding` header already exists, the payload is assumed to already be correctly encoded using that :mailheader:`Content-Transfer-Encoding` and is not modified.
ru: Если существующего заголовка :mailheader:`MIME-Version` нет, он будет добавлен. Если существующего заголовка :mailheader:`Content-Type` нет, он будет добавлен со значением :mimetype:`text/plain`. Независимо от того, существует ли заголовок :mailheader:`Content-Type` или нет, его параметр ``charset`` будет установлен в *charset.output_charset*. Если *charset.input_charset* и *charset.output_charset* различаются, полезные данные будут перекодированы в *output_charset*. Если существующего заголовка :mailheader:`Content-Transfer-Encoding` нет, то полезные данные будут при необходимости закодированы при передаче с использованием указанного :class:`~email.charset.Charset` и заголовка с соответствующим стоимость будет добавлена. Если заголовок :mailheader:`Content-Transfer-Encoding` уже существует, предполагается, что полезные данные уже правильно закодированы с использованием этого :mailheader:`Content-Transfer-Encoding` и не изменяются.

source: This is a legacy method. On the :class:`~email.emailmessage.EmailMessage` class its functionality is replaced by the *charset* parameter of the :meth:`email.emailmessage.EmailMessage.set_content` method.
ru: Это устаревший метод. В классе :class:`~email.emailmessage.EmailMessage` его функциональность заменяется параметром *charset* метода :meth:`email.emailmessage.EmailMessage.set_content`.

source: Return the :class:`~email.charset.Charset` instance associated with the message's payload.
ru: Верните экземпляр :class:`~email.charset.Charset`, связанный с полезной нагрузкой сообщения.

source: This is a legacy method. On the :class:`~email.emailmessage.EmailMessage` class it always returns ``None``.
ru: Это устаревший метод. В классе :class:`~email.emailmessage.EmailMessage` он всегда возвращает ``None``.
