Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/email.message.po
Languages: ru

source: Return the message's content type, coerced to lower case of the form :mimetype:`maintype/subtype`. If there is no :mailheader:`Content-Type` header in the message return the value returned by :meth:`get_default_type`. If the :mailheader:`Content-Type` header is invalid, return ``text/plain``.
ru: Возвращает тип содержимого сообщения, приведенный к нижнему регистру, в форме :mimetype:`maintype/subtype`. Если в сообщении нет заголовка :mailheader:`Content-Type`, верните значение, возвращаемое :meth:`get_default_type`. Если заголовок :mailheader:`Content-Type` недействителен, верните ``text/plain``.

source: (According to :rfc:`2045`, messages always have a default type, :meth:`get_content_type` will always return a value. :rfc:`2045` defines a message's default type to be :mimetype:`text/plain` unless it appears inside a :mimetype:`multipart/digest` container, in which case it would be :mimetype:`message/rfc822`. If the :mailheader:`Content-Type` header has an invalid type specification, :rfc:`2045` mandates that the default type be :mimetype:`text/plain`.)
ru: (Согласно :rfc:`2045`, сообщения всегда имеют тип по умолчанию, :meth:`get_content_type` всегда будет возвращать значение. :rfc:`2045` определяет тип сообщения по умолчанию: :mimetype:`text/plain` если только он не появляется внутри контейнера :mimetype:`multipart/digest`, и в этом случае это будет :mimetype:`message/rfc822`. Если заголовок :mailheader:`Content-Type` имеет недопустимую спецификацию типа, :rfc: `2045` требует, чтобы тип по умолчанию был :mimetype:`text/plain`.)

source: Return the message's main content type. This is the :mimetype:`maintype` part of the string returned by :meth:`get_content_type`.
ru: Возвращает основной тип контента сообщения. Это часть :mimetype:`maintype` строки, возвращаемой :meth:`get_content_type`.

source: Return the message's sub-content type. This is the :mimetype:`subtype` part of the string returned by :meth:`get_content_type`.
ru: Возвращает тип подконтента сообщения. Это часть :mimetype:`subtype` строки, возвращаемой :meth:`get_content_type`.

source: Return the default content type. Most messages have a default content type of :mimetype:`text/plain`, except for messages that are subparts of :mimetype:`multipart/digest` containers. Such subparts have a default content type of :mimetype:`message/rfc822`.
ru: Верните тип контента по умолчанию. Большинство сообщений имеют тип содержимого по умолчанию :mimetype:`text/plain`, за исключением сообщений, которые являются подчастями контейнеров :mimetype:`multipart/digest`. Такие подразделы имеют тип контента по умолчанию :mimetype:`message/rfc822`.

source: Set the default content type. *ctype* should either be :mimetype:`text/plain` or :mimetype:`message/rfc822`, although this is not enforced. The default content type is not stored in the :mailheader:`Content-Type` header, so it only affects the return value of the ``get_content_type`` methods when no :mailheader:`Content-Type` header is present in the message.
ru: Установите тип контента по умолчанию. *ctype* должен быть либо :mimetype:`text/plain`, либо :mimetype:`message/rfc822`, хотя это не является обязательным. Тип контента по умолчанию не хранится в заголовке :mailheader:`Content-Type`, поэтому он влияет на возвращаемое значение методов ``get_content_type`` только тогда, когда в сообщении отсутствует заголовок :mailheader:`Content-Type`. .

source: Set a parameter in the :mailheader:`Content-Type` header. If the parameter already exists in the header, replace its value with *value*. When *header* is ``Content-Type`` (the default) and the header does not yet exist in the message, add it, set its value to :mimetype:`text/plain`, and append the new parameter value. Optional *header* specifies an alternative header to :mailheader:`Content-Type`.
ru: Установите параметр в заголовке :mailheader:`Content-Type`. Если параметр уже существует в заголовке, замените его значение на *value*. Если *header* имеет значение ``Content-Type`` (по умолчанию), а заголовок еще не существует в сообщении, добавьте его, установите для него значение :mimetype:`text/plain` и добавьте новое значение параметра. Необязательный *header* указывает альтернативный заголовок :mailheader:`Content-Type`.

source: If the value contains non-ASCII characters, the charset and language may be explicitly specified using the optional *charset* and *language* parameters. Optional *language* specifies the :rfc:`2231` language, defaulting to the empty string. Both *charset* and *language* should be strings. The default is to use the ``utf8`` *charset* and ``None`` for the *language*.
ru: Если значение содержит символы, отличные от ASCII, кодировку и язык можно явно указать с помощью необязательных параметров *charset* и *language*. Необязательный *language* указывает язык :rfc:`2231`, по умолчанию используется пустая строка. И *charset*, и *language* должны быть строками. По умолчанию для *языка* используется кодировка ``utf8`` *charset* и ``None``.

source: If *replace* is ``False`` (the default) the header is moved to the end of the list of headers. If *replace* is ``True``, the header will be updated in place.
ru: Если *replace* имеет значение «False» (по умолчанию), заголовок перемещается в конец списка заголовков. Если *replace* имеет значение True, заголовок будет обновлен на месте.

source: Use of the *requote* parameter with :class:`EmailMessage` objects is deprecated.
ru: Использование параметра *requote* с объектами :class:`EmailMessage` устарело.

source: Note that existing parameter values of headers may be accessed through the :attr:`~email.headerregistry.ParameterizedMIMEHeader.params` attribute of the header value (for example, ``msg['Content-Type'].params['charset']``).
ru: Обратите внимание, что к существующим значениям параметров заголовков можно получить доступ через атрибут :attr:`~email.headerregistry.ParameterizedMIMEHeader.params` значения заголовка (например, ``msg['Content-Type'].params['charset' ]``).

source: ``replace`` keyword was added.
ru: Добавлено ключевое слово replace.

source: Remove the given parameter completely from the :mailheader:`Content-Type` header. The header will be re-written in place without the parameter or its value. Optional *header* specifies an alternative to :mailheader:`Content-Type`.
ru: Полностью удалите данный параметр из заголовка :mailheader:`Content-Type`. Заголовок будет перезаписан без параметра или его значения. Необязательный *header* указывает альтернативу :mailheader:`Content-Type`.

source: Return the value of the ``filename`` parameter of the :mailheader:`Content-Disposition` header of the message. If the header does not have a ``filename`` parameter, this method falls back to looking for the ``name`` parameter on the :mailheader:`Content-Type` header. If neither is found, or the header is missing, then *failobj* is returned. The returned string will always be unquoted as per :func:`email.utils.unquote`.
ru: Возвращает значение параметра ``filename`` заголовка :mailheader:`Content-Disposition` сообщения. Если в заголовке нет параметра ``filename``, этот метод возвращается к поиску параметра ``name`` в заголовке :mailheader:`Content-Type`. Если ни один из них не найден или заголовок отсутствует, возвращается *failobj*. Возвращенная строка всегда будет без кавычек согласно :func:`email.utils.unquote`.

source: Return the value of the ``boundary`` parameter of the :mailheader:`Content-Type` header of the message, or *failobj* if either the header is missing, or has no ``boundary`` parameter. The returned string will always be unquoted as per :func:`email.utils.unquote`.
ru: Возвращает значение параметра ``boundary`` заголовка :mailheader:`Content-Type` сообщения или *failobj*, если заголовок отсутствует или не имеет параметра ``boundary``. Возвращенная строка всегда будет без кавычек согласно :func:`email.utils.unquote`.

source: Set the ``boundary`` parameter of the :mailheader:`Content-Type` header to *boundary*. :meth:`set_boundary` will always quote *boundary* if necessary. A :exc:`~email.errors.HeaderParseError` is raised if the message object has no :mailheader:`Content-Type` header.
ru: Установите для параметра border заголовка :mailheader:`Content-Type` значение *boundary*. :meth:`set_boundary` всегда будет заключать в кавычки *boundary*, если это необходимо. Ошибка :exc:`~email.errors.HeaderParseError` возникает, если объект сообщения не имеет заголовка :mailheader:`Content-Type`.

source: Note that using this method is subtly different from deleting the old :mailheader:`Content-Type` header and adding a new one with the new boundary via :meth:`add_header`, because :meth:`set_boundary` preserves the order of the :mailheader:`Content-Type` header in the list of headers.
ru: Обратите внимание, что использование этого метода немного отличается от удаления старого заголовка :mailheader:`Content-Type` и добавления нового с новой границей через :meth:`add_header`, поскольку :meth:`set_boundary` сохраняет порядок :mailheader:`Content-Type` заголовок в списке заголовков.

source: Return the ``charset`` parameter of the :mailheader:`Content-Type` header, coerced to lower case. If there is no :mailheader:`Content-Type` header, or if that header has no ``charset`` parameter, *failobj* is returned.
ru: Возвращает параметр ``charset`` заголовка :mailheader:`Content-Type`, переведенный в нижний регистр. Если заголовок :mailheader:`Content-Type` отсутствует или этот заголовок не имеет параметра ``charset``, возвращается *failobj*.

source: Return a list containing the character set names in the message. If the message is a :mimetype:`multipart`, then the list will contain one element for each subpart in the payload, otherwise, it will be a list of length 1.
ru: Возвращает список, содержащий имена наборов символов в сообщении. Если сообщение имеет тип :mimetype:`multipart`, то список будет содержать по одному элементу для каждой части полезных данных, в противном случае это будет список длиной 1.

source: Each item in the list will be a string which is the value of the ``charset`` parameter in the :mailheader:`Content-Type` header for the represented subpart. If the subpart has no :mailheader:`Content-Type` header, no ``charset`` parameter, or is not of the :mimetype:`text` main MIME type, then that item in the returned list will be *failobj*.
ru: Каждый элемент в списке будет строкой, которая является значением параметра charset в заголовке :mailheader:`Content-Type` для представленной части. Если подраздел не имеет заголовка :mailheader:`Content-Type`, параметра ``charset`` или не относится к основному типу MIME :mimetype:`text`, то этот элемент в возвращаемом списке будет *failobj* .

source: Return ``True`` if there is a :mailheader:`Content-Disposition` header and its (case insensitive) value is ``attachment``, ``False`` otherwise.
ru: Возвращает ``True``, если существует заголовок :mailheader:`Content-Disposition` и его (регистронезависимое) значение равно ``attachment``, ``False`` в противном случае.

source: is_attachment is now a method instead of a property, for consistency with :meth:`~email.message.Message.is_multipart`.
ru: is_attachment теперь является методом, а не свойством, для согласованности с :meth:`~email.message.Message.is_multipart`.

source: Return the lowercased value (without parameters) of the message's :mailheader:`Content-Disposition` header if it has one, or ``None``. The possible values for this method are *inline*, *attachment* or ``None`` if the message follows :rfc:`2183`.
ru: Возвращает значение в нижнем регистре (без параметров) заголовка сообщения :mailheader:`Content-Disposition`, если он есть, или ``None``. Возможные значения для этого метода: *inline*, *attachment* или ``None``, если за сообщением следует :rfc:`2183`.

source: The following methods relate to interrogating and manipulating the content (payload) of the message.
ru: Следующие методы относятся к опросу и манипулированию содержимым (полезной нагрузкой) сообщения.

source: The :meth:`walk` method is an all-purpose generator which can be used to iterate over all the parts and subparts of a message object tree, in depth-first traversal order. You will typically use :meth:`walk` as the iterator in a ``for`` loop; each iteration returns the next subpart.
ru: Метод :meth:`walk` — это универсальный генератор, который можно использовать для перебора всех частей и подчастей дерева объектов сообщений в порядке обхода в глубину. Обычно вы будете использовать :meth:`walk` в качестве итератора в цикле ``for``; каждая итерация возвращает следующую подчасть.

source: Here's an example that prints the MIME type of every part of a multipart message structure:
ru: Вот пример, который печатает MIME-тип каждой части составной структуры сообщения:

source: ``walk`` iterates over the subparts of any part where :meth:`is_multipart` returns ``True``, even though ``msg.get_content_maintype() == 'multipart'`` may return ``False``. We can see this in our example by making use of the ``_structure`` debug helper function:
ru: ``walk`` перебирает подчасти любой части, где :meth:`is_multipart` возвращает ``True``, хотя ``msg.get_content_maintype() == 'multipart'`` может возвращать ``False``. Мы можем увидеть это в нашем примере, воспользовавшись вспомогательной функцией отладки ``_structure``:

source: Here the ``message`` parts are not ``multiparts``, but they do contain subparts. ``is_multipart()`` returns ``True`` and ``walk`` descends into the subparts.
ru: Здесь части «сообщения» не являются «составными частями», но они содержат подчасти. ``is_multipart()`` возвращает ``True`` и ``walk`` спускается в подчасти.

source: Return the MIME part that is the best candidate to be the "body" of the message.
ru: Возвращает часть MIME, которая является лучшим кандидатом на роль «тела» сообщения.

source: *preferencelist* must be a sequence of strings from the set ``related``, ``html``, and ``plain``, and indicates the order of preference for the content type of the part returned.
ru: *preferencelist* должен быть последовательностью строк из набора `` linked``, ``html`` и ``plain`` и указывает порядок предпочтения типа контента возвращаемой части.

source: Start looking for candidate matches with the object on which the ``get_body`` method is called.
ru: Начните поиск совпадений кандидатов с объекта, для которого вызывается метод get_body.

source: If ``related`` is not included in *preferencelist*, consider the root part (or subpart of the root part) of any related encountered as a candidate if the (sub-)part matches a preference.
ru: Если ``связанный`` не включен в *список предпочтений*, рассматривайте корневую часть (или подчасть корневой части) любого встреченного связанного объекта как кандидата, если (под)часть соответствует предпочтению.

source: When encountering a ``multipart/related``, check the ``start`` parameter and if a part with a matching :mailheader:`Content-ID` is found, consider only it when looking for candidate matches. Otherwise consider only the first (default root) part of the ``multipart/related``.
ru: При обнаружении ``multipart/related`` проверьте параметр ``start`` и, если найдена часть с совпадающим :mailheader:`Content-ID`, учитывайте только ее при поиске совпадений-кандидатов. В противном случае учитывайте только первую (корневую) часть ``multipart/related``.

source: If a part has a :mailheader:`Content-Disposition` header, only consider the part a candidate match if the value of the header is ``inline``.
ru: Если часть имеет заголовок :mailheader:`Content-Disposition`, считайте часть кандидатом на соответствие только в том случае, если значение заголовка является ``inline``.

source: If none of the candidates matches any of the preferences in *preferencelist*, return ``None``.
ru: Если ни один из кандидатов не соответствует ни одному из предпочтений в *preferencelist*, верните ``None``.

source: Notes: (1) For most applications the only *preferencelist* combinations that really make sense are ``('plain',)``, ``('html', 'plain')``, and the default ``('related', 'html', 'plain')``. (2) Because matching starts with the object on which ``get_body`` is called, calling ``get_body`` on a ``multipart/related`` will return the object itself unless *preferencelist* has a non-default value. (3) Messages (or message parts) that do not specify a :mailheader:`Content-Type` or whose :mailheader:`Content-Type` header is invalid will be treated as if they are of type ``text/plain``, which may occasionally cause ``get_body`` to return unexpected results.
ru: Примечания: (1) Для большинства приложений единственными комбинациями *списков предпочтений*, которые действительно имеют смысл, являются ``('plain',)``, ``('html', 'plain')`` и значение по умолчанию ``( 'связанный', 'html', 'обычный')``. (2) Поскольку сопоставление начинается с объекта, для которого вызывается ``get_body``, вызов ``get_body`` для ``multipart/related`` вернет сам объект, если только *preferencelist* не имеет значения, отличного от значения по умолчанию. (3) Сообщения (или части сообщения), в которых не указан :mailheader:`Content-Type` или чей :mailheader:`Content-Type` заголовок недействителен, будут обрабатываться так, как если бы они имели тип ``text/plain` `, что иногда может привести к тому, что ``get_body`` будет возвращать неожиданные результаты.

source: Return an iterator over all of the immediate sub-parts of the message that are not candidate "body" parts. That is, skip the first occurrence of each of ``text/plain``, ``text/html``, ``multipart/related``, or ``multipart/alternative`` (unless they are explicitly marked as attachments via :mailheader:`Content-Disposition: attachment`), and return all remaining parts. When applied directly to a ``multipart/related``, return an iterator over the all the related parts except the root part (ie: the part pointed to by the ``start`` parameter, or the first part if there is no ``start`` parameter or the ``start`` parameter doesn't match the :mailheader:`Content-ID` of any of the parts). When applied directly to a ``multipart/alternative`` or a non-``multipart``, return an empty iterator.
ru: Возвращает итератор для всех непосредственных подчастей сообщения, которые не являются кандидатами на части тела. То есть пропустить первое вхождение каждого из ``text/plain``, ``text/html``, ``multipart/related`` или ``multipart/alternative`` (если они явно не помечены как вложения). через :mailheader:`Content-Disposition: Attachment`) и верните все оставшиеся части. При применении непосредственно к ``multipart/related`` возвращает итератор для всех связанных частей, кроме корневой части (т. е. части, на которую указывает параметр ``start``, или первой части, если нет Параметр ``start`` или параметр ``start`` не соответствует :mailheader:`Content-ID` ни одной из частей). При прямом применении к ``multipart/alternative`` или не``multipart`` возвращается пустой итератор.

source: Return an iterator over all of the immediate sub-parts of the message, which will be empty for a non-``multipart``. (See also :meth:`~email.message.EmailMessage.walk`.)
ru: Возвращает итератор для всех непосредственных подчастей сообщения, который будет пустым для не-``multipart``. (См. также :meth:`~email.message.EmailMessage.walk`.)

source: Call the :meth:`~email.contentmanager.ContentManager.get_content` method of the *content_manager*, passing self as the message object, and passing along any other arguments or keywords as additional arguments. If *content_manager* is not specified, use the ``content_manager`` specified by the current :mod:`~email.policy`.
ru: Вызовите метод :meth:`~email.contentmanager.ContentManager.get_content` *content_manager*, передав self в качестве объекта сообщения и передав любые другие аргументы или ключевые слова в качестве дополнительных аргументов. Если *content_manager* не указан, используйте ``content_manager``, указанный в текущем :mod:`~email.policy`.

source: Call the :meth:`~email.contentmanager.ContentManager.set_content` method of the *content_manager*, passing self as the message object, and passing along any other arguments or keywords as additional arguments. If *content_manager* is not specified, use the ``content_manager`` specified by the current :mod:`~email.policy`.
ru: Вызовите метод :meth:`~email.contentmanager.ContentManager.set_content` *content_manager*, передав self в качестве объекта сообщения и передав любые другие аргументы или ключевые слова в качестве дополнительных аргументов. Если *content_manager* не указан, используйте ``content_manager``, указанный в текущем :mod:`~email.policy`.

source: Convert a non-``multipart`` message into a ``multipart/related`` message, moving any existing :mailheader:`Content-` headers and payload into a (new) first part of the ``multipart``. If *boundary* is specified, use it as the boundary string in the multipart, otherwise leave the boundary to be automatically created when it is needed (for example, when the message is serialized).
ru: Преобразуйте не-``multipart`` сообщение в ``multipart/related``, переместив все существующие заголовки :mailheader:`Content-` и полезную нагрузку в (новую) первую часть ``multipart``. Если указано *boundary*, используйте его в качестве граничной строки в составной части, в противном случае оставьте границу автоматически создаваться при необходимости (например, при сериализации сообщения).

source: Convert a non-``multipart`` or a ``multipart/related`` into a ``multipart/alternative``, moving any existing :mailheader:`Content-` headers and payload into a (new) first part of the ``multipart``. If *boundary* is specified, use it as the boundary string in the multipart, otherwise leave the boundary to be automatically created when it is needed (for example, when the message is serialized).
ru: Преобразуйте не-``multipart`` или ``multipart/relative`` в ``multipart/alternative``, переместив любые существующие заголовки :mailheader:`Content-` и полезную нагрузку в (новую) первую часть ``многочастный``. Если указано *boundary*, используйте его в качестве граничной строки в составной части, в противном случае оставьте границу автоматически создаваться при необходимости (например, при сериализации сообщения).

source: Convert a non-``multipart``, a ``multipart/related``, or a ``multipart-alternative`` into a ``multipart/mixed``, moving any existing :mailheader:`Content-` headers and payload into a (new) first part of the ``multipart``. If *boundary* is specified, use it as the boundary string in the multipart, otherwise leave the boundary to be automatically created when it is needed (for example, when the message is serialized).
ru: Преобразуйте не-``multipart``, ``multipart/related`` или ``multipart-alternative`` в ``multipart/mixed``, переместив все существующие заголовки :mailheader:`Content-` и полезная нагрузка в (новую) первую часть ``multipart``. Если указано *boundary*, используйте его в качестве граничной строки в составной части, в противном случае оставьте границу автоматически создаваться при необходимости (например, при сериализации сообщения).
