Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/ensurepip.po
Languages: ru

source: :mod:`!ensurepip` --- Bootstrapping the ``pip`` installer
ru: :mod:`!ensurepip` --- Загрузка установщика ``pip``

source: **Source code:** :source:`Lib/ensurepip`
ru: **Исходный код:** :source:`Lib/ensurepip`

source: The :mod:`ensurepip` package provides support for bootstrapping the ``pip`` installer into an existing Python installation or virtual environment. This bootstrapping approach reflects the fact that ``pip`` is an independent project with its own release cycle, and the latest available stable version is bundled with maintenance and feature releases of the CPython reference interpreter.
ru: Пакет :mod:`ensurepip` обеспечивает поддержку загрузки установщика ``pip`` в существующую установку Python или виртуальную среду. Этот подход к начальной загрузке отражает тот факт, что pip — это независимый проект со своим собственным циклом выпуска, а последняя доступная стабильная версия поставляется в комплекте с техническими и функциональными выпусками эталонного интерпретатора CPython.

source: In most cases, end users of Python shouldn't need to invoke this module directly (as ``pip`` should be bootstrapped by default), but it may be needed if installing ``pip`` was skipped when installing Python (or when creating a virtual environment) or after explicitly uninstalling ``pip``.
ru: В большинстве случаев конечным пользователям Python не нужно вызывать этот модуль напрямую (поскольку pip должен быть загружен по умолчанию), но он может потребоваться, если установка pip была пропущена при установке Python (или при создании виртуальной среды) или после явного удаления pip.

source: This module *does not* access the internet. All of the components needed to bootstrap ``pip`` are included as internal parts of the package.
ru: Этот модуль *не* имеет доступ к Интернету. Все компоненты, необходимые для загрузки pip, включены как внутренние части пакета.

source: The end user guide for installing Python packages
ru: Руководство для конечного пользователя по установке пакетов Python

source: :pep:`453`: Explicit bootstrapping of pip in Python installations
ru: :pep:`453`: Явная загрузка pip в установках Python

source: The original rationale and specification for this module.
ru: Исходное обоснование и спецификация этого модуля.

source: Availability
ru: Доступность

source: This module does not work or is not available on WebAssembly platforms ``wasm32-emscripten`` and ``wasm32-wasi``. See :ref:`wasm-availability` for more information.
ru: Этот модуль не работает или недоступен на платформах WebAssembly «wasm32-emscripten» и «wasm32-wasi». См. :ref:`wasm-availability` для получения дополнительной информации.

source: Command line interface
ru: Интерфейс командной строки

source: The command line interface is invoked using the interpreter's ``-m`` switch.
ru: Интерфейс командной строки вызывается с помощью переключателя интерпретатора ``-m``.

source: The simplest possible invocation is::
ru: Самый простой возможный вызов:

source: This invocation will install ``pip`` if it is not already installed, but otherwise does nothing. To ensure the installed version of ``pip`` is at least as recent as the one available in ``ensurepip``, pass the ``--upgrade`` option::
ru: Этот вызов установит ``pip``, если он еще не установлен, но в остальном ничего не делает. Чтобы убедиться, что установленная версия ``pip`` не ниже той, которая доступна в ``ensurepip``, передайте опцию ``--upgrade``:

source: By default, ``pip`` is installed into the current virtual environment (if one is active) or into the system site packages (if there is no active virtual environment). The installation location can be controlled through two additional command line options:
ru: По умолчанию pip устанавливается в текущую виртуальную среду (если она активна) или в пакеты системного сайта (если активной виртуальной среды нет). Местоположением установки можно управлять с помощью двух дополнительных параметров командной строки:

source: By default, the scripts ``pipX`` and ``pipX.Y`` will be installed (where X.Y stands for the version of Python used to invoke ``ensurepip``). The scripts installed can be controlled through two additional command line options:
ru: По умолчанию будут установлены сценарии ``pipX`` и ``pipX.Y`` (где XY означает версию Python, используемую для вызова ``ensurepip``). Установленными скриптами можно управлять с помощью двух дополнительных параметров командной строки:

source: Providing both of the script selection options will trigger an exception.
ru: Предоставление обоих вариантов выбора сценария вызовет исключение.

source: Module API
ru: API модуля

source: :mod:`ensurepip` exposes two functions for programmatic use:
ru: :mod:`ensurepip` предоставляет две функции для программного использования:

source: Returns a string specifying the available version of pip that will be installed when bootstrapping an environment.
ru: Возвращает строку, указывающую доступную версию pip, которая будет установлена ​​при загрузке среды.

source: Bootstraps ``pip`` into the current or designated environment.
ru: Загружает ``pip`` в текущую или назначенную среду.

source: *root* specifies an alternative root directory to install relative to. If *root* is ``None``, then installation uses the default install location for the current environment.
ru: *root* указывает альтернативный корневой каталог для установки. Если *root* имеет значение «Нет», то при установке используется местоположение установки по умолчанию для текущей среды.

source: *upgrade* indicates whether or not to upgrade an existing installation of an earlier version of ``pip`` to the available version.
ru: *upgrade* указывает, следует ли обновлять существующую установку более ранней версии ``pip`` до доступной версии.

source: *user* indicates whether to use the user scheme rather than installing globally.
ru: *user* указывает, следует ли использовать пользовательскую схему вместо глобальной установки.

source: By default, the scripts ``pipX`` and ``pipX.Y`` will be installed (where X.Y stands for the current version of Python).
ru: По умолчанию будут установлены скрипты pipX и pipX.Y (где XY означает текущую версию Python).

source: If *altinstall* is set, then ``pipX`` will *not* be installed.
ru: Документы реорганизованы и переписаны для продвижения нового API :class:`~email.message.EmailMessage`/:class:`~email.policy.EmailPolicy`.

source: If *default_pip* is set, then ``pip`` will be installed in addition to the two regular scripts.
ru: Если установлен *default_pip*, то в дополнение к двум обычным скриптам будет установлен ``pip``.

source: Setting both *altinstall* and *default_pip* will trigger :exc:`ValueError`.
ru: Установка обоих *altinstall* и *default_pip* вызовет :exc:`ValueError`.

source: *verbosity* controls the level of output to :data:`sys.stdout` from the bootstrapping operation.
ru: *verbosity* контролирует уровень вывода в :data:`sys.stdout` из операции начальной загрузки.

source: Raises an :ref:`auditing event <auditing>` ``ensurepip.bootstrap`` with argument ``root``.
ru: Вызывает :ref:`событие аудита <auditing>`ensurepip.bootstrap`` с аргументом ``root``.

source: The bootstrapping process has side effects on both ``sys.path`` and ``os.environ``. Invoking the command line interface in a subprocess instead allows these side effects to be avoided.
ru: Процесс начальной загрузки имеет побочные эффекты как для ``sys.path``, так и для ``os.environ``. Вместо этого вызов интерфейса командной строки в подпроцессе позволяет избежать этих побочных эффектов.

source: The bootstrapping process may install additional modules required by ``pip``, but other software should not assume those dependencies will always be present by default (as the dependencies may be removed in a future version of ``pip``).
ru: В процессе начальной загрузки могут быть установлены дополнительные модули, необходимые для pip, но другое программное обеспечение не должно предполагать, что эти зависимости всегда будут присутствовать по умолчанию (поскольку зависимости могут быть удалены в будущей версии pip).
