Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/filecmp.po
Languages: ru

source: **Source code:** :source:`Lib/filecmp.py`
ru: **Исходный код:** :source:`Lib/filecmp.py`

source: The :mod:`filecmp` module defines functions to compare files and directories, with various optional time/correctness trade-offs. For comparing files, see also the :mod:`difflib` module.
ru: Модуль :mod:`filecmp` определяет функции для сравнения файлов и каталогов с различными дополнительными компромиссами между временем и правильностью. Для сравнения файлов см. также модуль :mod:`difflib`.

source: The :mod:`filecmp` module defines the following functions:
ru: Модуль :mod:`filecmp` определяет следующие функции:

source: Compare the files named *f1* and *f2*, returning ``True`` if they seem equal, ``False`` otherwise.
ru: Сравните файлы с именами *f1* и *f2*, возвращая ``True``, если они кажутся равными, и ``False`` в противном случае.

source: If *shallow* is true and the :func:`os.stat` signatures (file type, size, and modification time) of both files are identical, the files are taken to be equal.
ru: Если *shallow* имеет значение true и подписи :func:`os.stat` (тип файла, размер и время изменения) обоих файлов идентичны, файлы считаются равными.

source: Otherwise, the files are treated as different if their sizes or contents differ.
ru: В противном случае файлы считаются разными, если их размеры или содержимое различаются.

source: Note that no external programs are called from this function, giving it portability and efficiency.
ru: Обратите внимание, что из этой функции не вызываются никакие внешние программы, что обеспечивает ее переносимость и эффективность.

source: This function uses a cache for past comparisons and the results, with cache entries invalidated if the :func:`os.stat` information for the file changes. The entire cache may be cleared using :func:`clear_cache`.
ru: Эта функция использует кэш для прошлых сравнений и результатов, причем записи кэша становятся недействительными, если информация :func:`os.stat` для файла изменяется. Весь кэш можно очистить с помощью :func:`clear_cache`.

source: Compare the files in the two directories *dir1* and *dir2* whose names are given by *common*.
ru: Сравните файлы в двух каталогах *dir1* и *dir2*, имена которых заданы *common*.

source: Returns three lists of file names: *match*, *mismatch*, *errors*. *match* contains the list of files that match, *mismatch* contains the names of those that don't, and *errors* lists the names of files which could not be compared. Files are listed in *errors* if they don't exist in one of the directories, the user lacks permission to read them or if the comparison could not be done for some other reason.
ru: Возвращает три списка имен файлов: *совпадение*, *несоответствие*, *ошибки*. *match* содержит список совпадающих файлов, *mismatch* содержит имена тех, которые не совпадают, а *errors* перечисляет имена файлов, которые не удалось сравнить. Файлы заносятся в *ошибки*, если они не существуют в одном из каталогов, у пользователя нет разрешения на их чтение или если сравнение невозможно выполнить по какой-либо другой причине.

source: The *shallow* parameter has the same meaning and default value as for :func:`filecmp.cmp`.
ru: Параметр *shallow* имеет то же значение и значение по умолчанию, что и :func:`filecmp.cmp`.

source: For example, ``cmpfiles('a', 'b', ['c', 'd/e'])`` will compare ``a/c`` with ``b/c`` and ``a/d/e`` with ``b/d/e``. ``'c'`` and ``'d/e'`` will each be in one of the three returned lists.
ru: Например, ``cmpfiles('a', 'b', ['c', 'd/e'])`` будет сравнивать ``a/c`` с ``b/c`` и ``a /d/e`` с ``b/d/e``. ``'c'`` и ``'d/e'`` будут находиться в одном из трех возвращаемых списков.

source: Clear the filecmp cache. This may be useful if a file is compared so quickly after it is modified that it is within the mtime resolution of the underlying filesystem.
ru: Очистите кеш filecmp. Это может быть полезно, если файл после изменения сравнивается так быстро, что его разрешение находится в пределах разрешения mtime базовой файловой системы.

source: The :class:`dircmp` class
ru: Класс :class:`dircmp`

source: Construct a new directory comparison object, to compare the directories *a* and *b*. *ignore* is a list of names to ignore, and defaults to :const:`filecmp.DEFAULT_IGNORES`. *hide* is a list of names to hide, and defaults to ``[os.curdir, os.pardir]``.
ru: Создайте новый объект сравнения каталогов для сравнения каталогов *a* и *b*. *ignore* — это список имен, которые следует игнорировать. По умолчанию он имеет значение :const:`filecmp.DEFAULT_IGNORES`. *hide* — это список имен, которые нужно скрыть. По умолчанию используется ``[os.curdir, os.pardir]``.

source: The :class:`dircmp` class compares files by doing *shallow* comparisons as described for :func:`filecmp.cmp`.
ru: Класс :class:`dircmp` сравнивает файлы, выполняя *поверхностные* сравнения, как описано для :func:`filecmp.cmp`.

source: The :class:`dircmp` class provides the following methods:
ru: Класс :class:`dircmp` предоставляет следующие методы:

source: Print (to :data:`sys.stdout`) a comparison between *a* and *b*.
ru: Выведите (в :data:`sys.stdout`) сравнение между *a* и *b*.

source: Print a comparison between *a* and *b* and common immediate subdirectories.
ru: Выведите сравнение между *a* и *b* и общими непосредственными подкаталогами.

source: Print a comparison between *a* and *b* and common subdirectories (recursively).
ru: Выведите сравнение между *a* и *b* и общими подкаталогами (рекурсивно).

source: The :class:`dircmp` class offers a number of interesting attributes that may be used to get various bits of information about the directory trees being compared.
ru: Класс :class:`dircmp` предлагает ряд интересных атрибутов, которые можно использовать для получения различной информации о сравниваемых деревьях каталогов.

source: Note that via :meth:`~object.__getattr__` hooks, all attributes are computed lazily, so there is no speed penalty if only those attributes which are lightweight to compute are used.
ru: Обратите внимание, что с помощью перехватчиков :meth:`~object.__getattr__` все атрибуты вычисляются лениво, поэтому потери скорости не будет, если используются только те атрибуты, которые легко вычислить.

source: The directory *a*.
ru: Каталог *a*.

source: The directory *b*.
ru: Каталог *b*.

source: Files and subdirectories in *a*, filtered by *hide* and *ignore*.
ru: Файлы и подкаталоги в *a*, отфильтрованные по параметрам *скрыть* и *игнорировать*.

source: Files and subdirectories in *b*, filtered by *hide* and *ignore*.
ru: Файлы и подкаталоги в *b*, отфильтрованные по параметрам *скрыть* и *игнорировать*.

source: Files and subdirectories in both *a* and *b*.
ru: Файлы и подкаталоги в *a* и *b*.

source: Files and subdirectories only in *a*.
ru: Файлы и подкаталоги только в *a*.

source: Files and subdirectories only in *b*.
ru: Файлы и подкаталоги только в *b*.

source: Subdirectories in both *a* and *b*.
ru: Подкаталоги в *a* и *b*.

source: Files in both *a* and *b*.
ru: Файлы в форматах *a* и *b*.

source: Names in both *a* and *b*, such that the type differs between the directories, or names for which :func:`os.stat` reports an error.
ru: Имена в *a* и *b*, так что тип различается в разных каталогах, или имена, для которых :func:`os.stat` сообщает об ошибке.

source: Files which are identical in both *a* and *b*, using the class's file comparison operator.
ru: Файлы, идентичные по *a* и *b*, с использованием оператора сравнения файлов класса.

source: Files which are in both *a* and *b*, whose contents differ according to the class's file comparison operator.
ru: Файлы, которые имеют форматы *a* и *b*, содержимое которых различается в зависимости от оператора сравнения файлов класса.

source: Files which are in both *a* and *b*, but could not be compared.
ru: Файлы, которые находятся как в *a*, так и в *b*, но их невозможно сравнить.

source: A dictionary mapping names in :attr:`common_dirs` to :class:`dircmp` instances (or MyDirCmp instances if this instance is of type MyDirCmp, a subclass of :class:`dircmp`).
ru: Словарь сопоставляет имена в :attr:`common_dirs` с экземплярами :class:`dircmp` (или экземплярами MyDirCmp, если этот экземпляр имеет тип MyDirCmp, подкласс :class:`dircmp`).

source: Previously entries were always :class:`dircmp` instances. Now entries are the same type as *self*, if *self* is a subclass of :class:`dircmp`.
ru: Раньше записи всегда были экземплярами :class:`dircmp`. Теперь записи имеют тот же тип, что и *self*, если *self* является подклассом :class:`dircmp`.

source: List of directories ignored by :class:`dircmp` by default.
ru: Список каталогов, игнорируемых :class:`dircmp` по умолчанию.

source: Here is a simplified example of using the ``subdirs`` attribute to search recursively through two directories to show common different files::
ru: Вот упрощенный пример использования атрибута subdirs для рекурсивного поиска в двух каталогах для отображения общих файлов:
