Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/fileinput.po
Languages: ru

source: :mod:`!fileinput` --- Iterate over lines from multiple input streams
ru: :mod:`!fileinput` --- Перебирать строки из нескольких входных потоков.

source: **Source code:** :source:`Lib/fileinput.py`
ru: **Исходный код:** :source:`Lib/fileinput.py`

source: This module implements a helper class and functions to quickly write a loop over standard input or a list of files. If you just want to read or write one file see :func:`open`.
ru: Этот модуль реализует вспомогательный класс и функции для быстрого написания цикла над стандартным вводом или списком файлов. Если вы просто хотите прочитать или записать один файл, используйте :func:`open`.

source: The typical use is::
ru: Типичное использование:

source: This iterates over the lines of all files listed in ``sys.argv[1:]``, defaulting to ``sys.stdin`` if the list is empty. If a filename is ``'-'``, it is also replaced by ``sys.stdin`` and the optional arguments *mode* and *openhook* are ignored. To specify an alternative list of filenames, pass it as the first argument to :func:`.input`. A single file name is also allowed.
ru: Это перебирает строки всех файлов, перечисленных в ``sys.argv[1:]``, по умолчанию используется ``sys.stdin``, если список пуст. Если имя файла ``'-'``, оно также заменяется на ``sys.stdin``, а необязательные аргументы *mode* и *openhook* игнорируются. Чтобы указать альтернативный список имен файлов, передайте его в качестве первого аргумента в :func:`.input`. Также допускается одно имя файла.

source: All files are opened in text mode by default, but you can override this by specifying the *mode* parameter in the call to :func:`.input` or :class:`FileInput`. If an I/O error occurs during opening or reading a file, :exc:`OSError` is raised.
ru: По умолчанию все файлы открываются в текстовом режиме, но вы можете переопределить это, указав параметр *mode* при вызове :func:`.input` или :class:`FileInput`. Если во время открытия или чтения файла возникает ошибка ввода-вывода, возникает :exc:`OSError`.

source: :exc:`IOError` used to be raised; it is now an alias of :exc:`OSError`.
ru: :exc:`IOError` раньше вызывался; теперь это псевдоним :exc:`OSError`.

source: If ``sys.stdin`` is used more than once, the second and further use will return no lines, except perhaps for interactive use, or if it has been explicitly reset (e.g. using ``sys.stdin.seek(0)``).
ru: Если ``sys.stdin`` используется более одного раза, второе и последующее использование не вернут никаких строк, за исключением, возможно, интерактивного использования или если он был явно сброшен (например, с помощью ``sys.stdin.seek(0) ``).

source: Empty files are opened and immediately closed; the only time their presence in the list of filenames is noticeable at all is when the last file opened is empty.
ru: Пустые файлы открываются и сразу закрываются; единственный раз, когда их присутствие в списке имен файлов вообще заметно, это когда последний открытый файл пуст.

source: Lines are returned with any newlines intact, which means that the last line in a file may not have one.
ru: Строки возвращаются с неизмененными символами новой строки, а это означает, что в последней строке файла ее может не быть.

source: You can control how files are opened by providing an opening hook via the *openhook* parameter to :func:`fileinput.input` or :func:`FileInput`. The hook must be a function that takes two arguments, *filename* and *mode*, and returns an accordingly opened file-like object. If *encoding* and/or *errors* are specified, they will be passed to the hook as additional keyword arguments. This module provides a :func:`hook_compressed` to support compressed files.
ru: Вы можете контролировать открытие файлов, предоставив перехватчик открытия через параметр *openhook* для :func:`fileinput.input` или :func:`FileInput`. Перехватчик должен быть функцией, которая принимает два аргумента: *имя_файла* и *режим* и возвращает соответственно открытый объект, подобный файлу. Если указаны *кодировка* и/или *ошибки*, они будут переданы в перехватчик в качестве дополнительных аргументов ключевого слова. Этот модуль предоставляет :func:`hook_compressed` для поддержки сжатых файлов.

source: The following function is the primary interface of this module:
ru: Следующая функция является основным интерфейсом этого модуля:

source: Create an instance of the :class:`FileInput` class. The instance will be used as global state for the functions of this module, and is also returned to use during iteration. The parameters to this function will be passed along to the constructor of the :class:`FileInput` class.
ru: Создайте экземпляр класса :class:`FileInput`. Экземпляр будет использоваться как глобальное состояние для функций этого модуля, а также будет возвращен для использования во время итерации. Параметры этой функции будут переданы конструктору класса :class:`FileInput`.

source: The :class:`FileInput` instance can be used as a context manager in the :keyword:`with` statement. In this example, *input* is closed after the :keyword:`!with` statement is exited, even if an exception occurs::
ru: Экземпляр :class:`FileInput` можно использовать в качестве менеджера контекста в операторе :keyword:`with`. В этом примере *input* закрывается после выхода из оператора :keyword:`!with`, даже если возникает исключение::

source: Can be used as a context manager.
ru: Может использоваться как менеджер контекста.

source: The keyword parameters *mode* and *openhook* are now keyword-only.
ru: Параметры ключевых слов *mode* и *openhook* теперь доступны только для ключевых слов.

source: The keyword-only parameter *encoding* and *errors* are added.
ru: Добавлены параметры только для ключевых слов *encoding* и *errors*.

source: The following functions use the global state created by :func:`fileinput.input`; if there is no active state, :exc:`RuntimeError` is raised.
ru: Следующие функции используют глобальное состояние, созданное :func:`fileinput.input`; если активного состояния нет, возникает :exc:`RuntimeError`.

source: Return the name of the file currently being read. Before the first line has been read, returns ``None``.
ru: Возвращает имя файла, который читается в данный момент. Прежде чем первая строка будет прочитана, возвращает None.

source: Return the integer "file descriptor" for the current file. When no file is opened (before the first line and between files), returns ``-1``.
ru: Возвращает целочисленный «дескриптор файла» для текущего файла. Если ни один файл не открыт (до первой строки и между файлами), возвращается ``-1``.

source: Return the cumulative line number of the line that has just been read. Before the first line has been read, returns ``0``. After the last line of the last file has been read, returns the line number of that line.
ru: Возвращает совокупный номер только что прочитанной строки. Прежде чем первая строка будет прочитана, возвращается ``0``. После прочтения последней строки последнего файла возвращает номер этой строки.

source: Return the line number in the current file. Before the first line has been read, returns ``0``. After the last line of the last file has been read, returns the line number of that line within the file.
ru: Возвращает номер строки в текущем файле. Прежде чем первая строка будет прочитана, возвращается ``0``. После прочтения последней строки последнего файла возвращает номер этой строки в файле.

source: Return ``True`` if the line just read is the first line of its file, otherwise return ``False``.
ru: Верните «True», если только что прочитанная строка является первой строкой файла, в противном случае верните «False».

source: Return ``True`` if the last line was read from ``sys.stdin``, otherwise return ``False``.
ru: Верните True, если последняя строка была прочитана из sys.stdin, в противном случае верните False.

source: Close the current file so that the next iteration will read the first line from the next file (if any); lines not read from the file will not count towards the cumulative line count. The filename is not changed until after the first line of the next file has been read. Before the first line has been read, this function has no effect; it cannot be used to skip the first file. After the last line of the last file has been read, this function has no effect.
ru: Закройте текущий файл, чтобы следующая итерация прочитала первую строку из следующего файла (если есть); строки, не прочитанные из файла, не будут учитываться при подсчете совокупного количества строк. Имя файла не изменяется до тех пор, пока не будет прочитана первая строка следующего файла. До того, как первая строка будет прочитана, эта функция не действует; его нельзя использовать для пропуска первого файла. После прочтения последней строки последнего файла эта функция не действует.

source: Close the sequence.
ru: Закройте последовательность.

source: The class which implements the sequence behavior provided by the module is available for subclassing as well:
ru: Класс, который реализует поведение последовательности, предоставляемое модулем, также доступен для создания подклассов:

source: Class :class:`FileInput` is the implementation; its methods :meth:`filename`, :meth:`fileno`, :meth:`lineno`, :meth:`filelineno`, :meth:`isfirstline`, :meth:`isstdin`, :meth:`nextfile` and :meth:`close` correspond to the functions of the same name in the module. In addition it is :term:`iterable` and has a :meth:`~io.TextIOBase.readline` method which returns the next input line. The sequence must be accessed in strictly sequential order; random access and :meth:`~io.TextIOBase.readline` cannot be mixed.
ru: Класс :class:`FileInput` — это реализация; его методы :meth:`filename`, :meth:`fileno`, :meth:`lineno`, :meth:`filelineno`, :meth:`isfirstline`, :meth:`isstdin`, :meth:`nextfile` и :meth:`close` соответствуют одноименным функциям в модуле. Кроме того, он :term:`iterable` и имеет :meth:`~io.TextIOBase.readline` метод, который возвращает следующую строку ввода. Доступ к последовательности должен осуществляться строго последовательно; произвольный доступ и :meth:`~io.TextIOBase.readline` нельзя смешивать.

source: With *mode* you can specify which file mode will be passed to :func:`open`. It must be one of ``'r'`` and ``'rb'``.
ru: С помощью *mode* вы можете указать, какой режим файла будет передан в :func:`open`. Это должен быть один из ``'r'`` и ``'rb'``.

source: The *openhook*, when given, must be a function that takes two arguments, *filename* and *mode*, and returns an accordingly opened file-like object. You cannot use *inplace* and *openhook* together.
ru: *openhook*, если он задан, должен быть функцией, которая принимает два аргумента, *filename* и *mode*, и возвращает соответствующий открытый файловоподобный объект. Вы не можете использовать *inplace* и *openhook* вместе.

source: You can specify *encoding* and *errors* that is passed to :func:`open` or *openhook*.
ru: Вы можете указать *кодировку* и *ошибки*, которые передаются в :func:`open` или *openhook*.

source: A :class:`FileInput` instance can be used as a context manager in the :keyword:`with` statement. In this example, *input* is closed after the :keyword:`!with` statement is exited, even if an exception occurs::
ru: Экземпляр :class:`FileInput` можно использовать в качестве менеджера контекста в операторе :keyword:`with`. В этом примере *input* закрывается после выхода из оператора :keyword:`!with`, даже если возникает исключение::

source: The keyword parameter *mode* and *openhook* are now keyword-only.
ru: Параметры ключевого слова *mode* и *openhook* теперь доступны только для ключевых слов.

source: The ``'rU'`` and ``'U'`` modes and the :meth:`!__getitem__` method have been removed.
ru: Режимы ``'rU'`` и ``'U'`` и метод :meth:`!__getitem__` были удалены.

source: **Optional in-place filtering:** if the keyword argument ``inplace=True`` is passed to :func:`fileinput.input` or to the :class:`FileInput` constructor, the file is moved to a backup file and standard output is directed to the input file (if a file of the same name as the backup file already exists, it will be replaced silently). This makes it possible to write a filter that rewrites its input file in place. If the *backup* parameter is given (typically as ``backup='.<some extension>'``), it specifies the extension for the backup file, and the backup file remains around; by default, the extension is ``'.bak'`` and it is deleted when the output file is closed. In-place filtering is disabled when standard input is read.
ru: **Дополнительная фильтрация на месте:** если аргумент ключевого слова ``inplace=True`` передается в :func:`fileinput.input` или в конструктор :class:`FileInput`, файл перемещается в резервную копию. файл и стандартный вывод направляются во входной файл (если файл с тем же именем, что и файл резервной копии, уже существует, он будет заменен автоматически). Это позволяет написать фильтр, который перезаписывает входной файл на месте. Если задан параметр *backup* (обычно как ``backup='.<некоторое расширение>'``), он определяет расширение файла резервной копии, и файл резервной копии остается; по умолчанию расширением является ``'.bak'`` и оно удаляется при закрытии выходного файла. Фильтрация на месте отключается при чтении стандартного ввода.

source: The two following opening hooks are provided by this module:
ru: Этот модуль предоставляет два следующих открывающих крючка:

source: Transparently opens files compressed with gzip and bzip2 (recognized by the extensions ``'.gz'`` and ``'.bz2'``) using the :mod:`gzip` and :mod:`bz2` modules. If the filename extension is not ``'.gz'`` or ``'.bz2'``, the file is opened normally (ie, using :func:`open` without any decompression).
ru: Прозрачно открывает файлы, сжатые с помощью gzip и bzip2 (распознаваемые по расширениям ``'.gz'`` и ``'.bz2'``, используя модули :mod:`gzip` и :mod:`bz2`. Если расширение имени файла не ``'.gz'`` или ``'.bz2'``, файл открывается обычным образом (т.е. с использованием :func:`open` без какой-либо распаковки).

source: The *encoding* and *errors* values are passed to :class:`io.TextIOWrapper` for compressed files and open for normal files.
ru: Значения *encoding* и *errors* передаются в :class:`io.TextIOWrapper` для сжатых файлов и открываются для обычных файлов.

source: Usage example: ``fi = fileinput.FileInput(openhook=fileinput.hook_compressed, encoding="utf-8")``
ru: Пример использования: ``fi = fileinput.FileInput(openhook=fileinput.hook_compressed,coding="utf-8")``

source: Returns a hook which opens each file with :func:`open`, using the given *encoding* and *errors* to read the file.
ru: Возвращает перехватчик, который открывает каждый файл с помощью :func:`open`, используя заданную *кодировку* и *ошибки* для чтения файла.

source: Usage example: ``fi = fileinput.FileInput(openhook=fileinput.hook_encoded("utf-8", "surrogateescape"))``
ru: Пример использования: ``fi = fileinput.FileInput(openhook=fileinput.hook_encoded("utf-8", "surrogateescape"))``

source: Added the optional *errors* parameter.
ru: Добавлен необязательный параметр *errors*.

source: This function is deprecated since :func:`fileinput.input` and :class:`FileInput` now have *encoding* and *errors* parameters.
ru: Эта функция устарела, поскольку :func:`fileinput.input` и :class:`FileInput` теперь имеют параметры *encoding* и *errors*.
