Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/fnmatch.po
Languages: ru, uk

source: **Source code:** :source:`Lib/fnmatch.py`
ru: **Исходный код:** :source:`Lib/fnmatch.py`
uk: **Вихідний код:** :source:`Lib/fnmatch.py`

source: This module provides support for Unix shell-style wildcards, which are *not* the same as regular expressions (which are documented in the :mod:`re` module). The special characters used in shell-style wildcards are:
ru: Этот модуль обеспечивает поддержку подстановочных знаков в стиле оболочки Unix, которые отличаются от регулярных выражений (описаны в модуле :mod:`re`). Специальные символы, используемые в подстановочных знаках в стиле оболочки, следующие:
uk: Цей модуль підтримує символи підстановки у стилі оболонки Unix, які *не* відрізняються від регулярних виразів (які задокументовані в модулі :mod:`re`). Спеціальні символи, які використовуються в символах підстановки у стилі оболонки:

source: Pattern
ru: Шаблон
uk: Візерунок

source: Meaning
ru: Значение
uk: Значення

source: matches everything
ru: соответствует всему
uk: відповідає всьому

source: matches any single character
ru: соответствует любому отдельному символу
uk: відповідає будь-якому окремому символу

source: matches any character in *seq*
ru: соответствует любому символу в *seq*
uk: відповідає будь-якому символу в *seq*

source: matches any character not in *seq*
ru: соответствует любому символу, отсутствующему в *seq*
uk: відповідає будь-якому символу не в *seq*

source: For a literal match, wrap the meta-characters in brackets. For example, ``'[?]'`` matches the character ``'?'``.
ru: Для буквального совпадения заключите метасимволы в скобки. Например, ``'[?]'`` соответствует символу ``'?'``.
uk: Для буквального збігу заберіть метасимволи в дужки. Наприклад, ``''[?]'`` відповідає символу ``''?'``.

source: Note that the filename separator (``'/'`` on Unix) is *not* special to this module. See module :mod:`glob` for pathname expansion (:mod:`glob` uses :func:`.filter` to match pathname segments). Similarly, filenames starting with a period are not special for this module, and are matched by the ``*`` and ``?`` patterns.
ru: Обратите внимание, что разделитель имен файлов (``'/'`` в Unix) *не* является особенным для этого модуля. См. модуль :mod:`glob` для расширения пути (:mod:`glob` использует :func:`.filter` для сопоставления сегментов пути). Аналогично, имена файлов, начинающиеся с точки, не являются особенными для этого модуля и сопоставляются с шаблонами ``*`` и ``?``.
uk: Зауважте, що роздільник імен файлів (``'/'`` в Unix) *не* є особливим для цього модуля. Дивіться модуль :mod:`glob` для розширення імені шляху (:mod:`glob` використовує :func:`.filter` для відповідності сегментам імені шляху). Подібним чином назви файлів, що починаються з крапки, не є спеціальними для цього модуля та відповідають шаблонам ``*`` і ``?``.

source: Also note that :func:`functools.lru_cache` with the *maxsize* of 32768 is used to cache the compiled regex patterns in the following functions: :func:`fnmatch`, :func:`fnmatchcase`, :func:`.filter`.
ru: Также обратите внимание, что :func:`functools.lru_cache` с *maxsize*, равным 32768, используется для кэширования скомпилированных шаблонов регулярных выражений в следующих функциях: :func:`fnmatch`, :func:`fnmatchcase`, :func:`. фильтр`.

source: Test whether the filename string *name* matches the pattern string *pat*, returning ``True`` or ``False``. Both parameters are case-normalized using :func:`os.path.normcase`. :func:`fnmatchcase` can be used to perform a case-sensitive comparison, regardless of whether that's standard for the operating system.
ru: Проверьте, соответствует ли строка имени файла *name* строке шаблона *pat*, возвращая ``True`` или ``False``. Оба параметра нормализованы по регистру с помощью :func:`os.path.normcase`. :func:`fnmatchcase` можно использовать для сравнения с учетом регистра, независимо от того, является ли это стандартом для операционной системы.

source: This example will print all file names in the current directory with the extension ``.txt``::
ru: В этом примере будут напечатаны все имена файлов в текущем каталоге с расширением ``.txt``::
uk: У цьому прикладі буде надруковано всі імена файлів у поточному каталозі з розширенням ``.txt``::

source: Test whether the filename string *name* matches the pattern string *pat*, returning ``True`` or ``False``; the comparison is case-sensitive and does not apply :func:`os.path.normcase`.
ru: Проверьте, соответствует ли строка имени файла *name* строке шаблона *pat*, возвращая ``True`` или ``False``; сравнение чувствительно к регистру и не применяется :func:`os.path.normcase`.

source: Construct a list from those elements of the :term:`iterable` *names* that match pattern *pat*. It is the same as ``[n for n in names if fnmatch(n, pat)]``, but implemented more efficiently.
ru: Создайте список из тех элементов :term:`iterable` *names*, которые соответствуют шаблону *pat*. Это то же самое, что ``[n for n в именах, если fnmatch(n, pat)]``, но реализовано более эффективно.

source: Return the shell-style pattern *pat* converted to a regular expression for using with :func:`re.match`.
ru: Возвращает шаблон в стиле оболочки *pat*, преобразованный в регулярное выражение для использования с :func:`re.match`.

source: Example:
ru: Пример:
uk: приклад:

source: Module :mod:`glob`
ru: Модуль :mod:`glob`
uk: Модуль :mod:`glob`

source: Unix shell-style path expansion.
ru: Расширение пути в стиле оболочки Unix.
uk: Розширення шляху у стилі оболонки Unix.

source: filenames
ru: имена файлов

source: wildcard expansion
ru: расширение подстановочных знаков

source: module
ru: модуль
uk: модуль

source: * (asterisk)
ru: * (звёздочка)

source: in glob-style wildcards
ru: в подстановочных знаках в стиле glob

source: ? (question mark)
ru: ? (знак вопроса)

source: [] (square brackets)
ru: [] (квадратные скобки)

source: ! (exclamation)
ru: ! (восклицание)

source: - (minus)
ru: - (минус)

source: :mod:`fnmatch` --- Unix filename pattern matching
uk: :mod:`fnmatch` --- Зіставлення шаблону назви файлів Unix

source: Test whether the *filename* string matches the *pattern* string, returning :const:`True` or :const:`False`. Both parameters are case-normalized using :func:`os.path.normcase`. :func:`fnmatchcase` can be used to perform a case-sensitive comparison, regardless of whether that's standard for the operating system.
uk: Перевірте, чи відповідає рядок *назва* файлу рядку *шаблону*, повертаючи :const:`True` або :const:`False`. Обидва параметри нормалізуються за регістром за допомогою :func:`os.path.normcase`. :func:`fnmatchcase` можна використовувати для порівняння з урахуванням регістру, незалежно від того, чи є це стандартом для операційної системи.

source: Test whether *filename* matches *pattern*, returning :const:`True` or :const:`False`; the comparison is case-sensitive and does not apply :func:`os.path.normcase`.
uk: Перевірте, чи *ім’я файлу* відповідає *шаблону*, повертаючи :const:`True` або :const:`False`; порівняння чутливе до регістру і не застосовується :func:`os.path.normcase`.

source: Construct a list from those elements of the iterable *names* that match *pattern*. It is the same as ``[n for n in names if fnmatch(n, pattern)]``, but implemented more efficiently.
uk: Створіть список із тих елементів ітерованих *імен*, які відповідають *шаблону*. Це те саме, що ``[n для n в іменах, якщо fnmatch(n, шаблон)]``, але реалізовано більш ефективно.

source: Return the shell-style *pattern* converted to a regular expression for using with :func:`re.match`.
uk: Повертає *шаблон* у стилі оболонки, перетворений на регулярний вираз для використання з :func:`re.match`.

source: re
uk: повторно

source: glob
uk: глоб
