Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/functools.po
Languages: ru

source: Apply *function* of two arguments cumulatively to the items of *iterable*, from left to right, so as to reduce the iterable to a single value. For example, ``reduce(lambda x, y: x+y, [1, 2, 3, 4, 5])`` calculates ``((((1+2)+3)+4)+5)``. The left argument, *x*, is the accumulated value and the right argument, *y*, is the update value from the *iterable*. If the optional *initial* is present, it is placed before the items of the iterable in the calculation, and serves as a default when the iterable is empty. If *initial* is not given and *iterable* contains only one item, the first item is returned.
ru: Примените *функцию* двух аргументов кумулятивно к элементам *iterable* слева направо, чтобы свести итерируемый объект к одному значению. Например, ``reduce(lambda x, y: x+y, [1, 2, 3, 4, 5])`` вычисляет ``((((1+2)+3)+4)+5) ``. Левый аргумент *x* — это накопленное значение, а правый аргумент *y* — это значение обновления из *iterable*. Если присутствует необязательный *initial*, он помещается перед элементами итерируемого объекта в вычислении и служит значением по умолчанию, когда итерируемый объект пуст. Если *initial* не задан и *iterable* содержит только один элемент, возвращается первый элемент.

source: Roughly equivalent to::
ru: Примерно эквивалентно::

source: See :func:`itertools.accumulate` for an iterator that yields all intermediate values.
ru: См. :func:`itertools.accumulate` для получения информации об итераторе, который возвращает все промежуточные значения.

source: Transform a function into a :term:`single-dispatch <single dispatch>` :term:`generic function`.
ru: Преобразуйте функцию в :term:`single-dispatch <single dispatch>` :term:`generic function`.

source: To define a generic function, decorate it with the ``@singledispatch`` decorator. When defining a function using ``@singledispatch``, note that the dispatch happens on the type of the first argument::
ru: Чтобы определить общую функцию, украсьте ее декоратором @singledispatch. При определении функции с использованием @singledispatch обратите внимание, что отправка происходит по типу первого аргумента:

source: To add overloaded implementations to the function, use the :func:`register` attribute of the generic function, which can be used as a decorator. For functions annotated with types, the decorator will infer the type of the first argument automatically::
ru: Чтобы добавить к функции перегруженные реализации, используйте атрибут :func:`register` универсальной функции, который можно использовать в качестве декоратора. Для функций, аннотированных типами, декоратор автоматически определяет тип первого аргумента:

source: :data:`types.UnionType` and :data:`typing.Union` can also be used::
ru: Также можно использовать :data:`types.UnionType` и :data:`typing.Union`::

source: For code which doesn't use type annotations, the appropriate type argument can be passed explicitly to the decorator itself::
ru: Для кода, который не использует аннотации типов, соответствующий аргумент типа может быть явно передан самому декоратору:

source: For code that dispatches on a collections type (e.g., ``list``), but wants to typehint the items of the collection (e.g., ``list[int]``), the dispatch type should be passed explicitly to the decorator itself with the typehint going into the function definition::
ru: Для кода, который отправляет тип коллекции (например, «список»), но хочет указать элементы коллекции (например, «список[int]»), тип отправки должен быть явно передан декоратору. сам с подсказкой, входящей в определение функции::

source: At runtime the function will dispatch on an instance of a list regardless of the type contained within the list i.e. ``[1,2,3]`` will be dispatched the same as ``["foo", "bar", "baz"]``. The annotation provided in this example is for static type checkers only and has no runtime impact.
ru: Во время выполнения функция будет отправлять экземпляр списка независимо от типа, содержащегося в списке, т.е. ``[1,2,3]`` будет отправляться так же, как ``["foo", "bar", " баз"]``. Аннотация, представленная в этом примере, предназначена только для средств проверки статических типов и не оказывает влияния на время выполнения.

source: To enable registering :term:`lambdas<lambda>` and pre-existing functions, the :func:`register` attribute can also be used in a functional form::
ru: Чтобы включить регистрацию :term:`lambdas<lambda>` и ранее существовавших функций, атрибут :func:`register` также можно использовать в функциональной форме::

source: The :func:`register` attribute returns the undecorated function. This enables decorator stacking, :mod:`pickling<pickle>`, and the creation of unit tests for each variant independently::
ru: Атрибут :func:`register` возвращает недекорированную функцию. Это позволяет использовать стек декораторов, :mod:`pickling<pickle>` и создавать модульные тесты для каждого варианта независимо:

source: When called, the generic function dispatches on the type of the first argument::
ru: При вызове универсальная функция отправляет информацию о типе первого аргумента:

source: Where there is no registered implementation for a specific type, its method resolution order is used to find a more generic implementation. The original function decorated with ``@singledispatch`` is registered for the base :class:`object` type, which means it is used if no better implementation is found.
ru: Если для определенного типа нет зарегистрированной реализации, порядок разрешения его методов используется для поиска более общей реализации. Исходная функция, украшенная @singledispatch, зарегистрирована для базового типа :class:`object`, что означает, что она используется, если не найдена лучшая реализация.

source: If an implementation is registered to an :term:`abstract base class`, virtual subclasses of the base class will be dispatched to that implementation::
ru: Если реализация зарегистрирована в :term:`абстрактном базовом классе`, виртуальные подклассы базового класса будут отправлены в эту реализацию:

source: To check which implementation the generic function will choose for a given type, use the ``dispatch()`` attribute::
ru: Чтобы проверить, какую реализацию выберет универсальная функция для данного типа, используйте атрибут dispatch():

source: To access all registered implementations, use the read-only ``registry`` attribute::
ru: Чтобы получить доступ ко всем зарегистрированным реализациям, используйте атрибут ``registry``, доступный только для чтения::

source: The :func:`register` attribute now supports using type annotations.
ru: Атрибут :func:`register` теперь поддерживает использование аннотаций типов.

source: The :func:`register` attribute now supports :data:`types.UnionType` and :data:`typing.Union` as type annotations.
ru: Атрибут :func:`register` теперь поддерживает :data:`types.UnionType` и :data:`typing.Union` в качестве аннотаций типа.

source: Transform a method into a :term:`single-dispatch <single dispatch>` :term:`generic function`.
ru: Преобразуйте метод в :term:`single-dispatch <single dispatch>` :term:`generic function`.

source: To define a generic method, decorate it with the ``@singledispatchmethod`` decorator. When defining a function using ``@singledispatchmethod``, note that the dispatch happens on the type of the first non-*self* or non-*cls* argument::
ru: Чтобы определить общий метод, украсьте его декоратором @singledispatchmethod. При определении функции с использованием ``@singledispatchmethod`` обратите внимание, что отправка происходит по типу первого аргумента, отличного от *self* или отличного от *cls*:

source: ``@singledispatchmethod`` supports nesting with other decorators such as :func:`@classmethod<classmethod>`. Note that to allow for ``dispatcher.register``, ``singledispatchmethod`` must be the *outer most* decorator. Here is the ``Negator`` class with the ``neg`` methods bound to the class, rather than an instance of the class::
ru: ``@singledispatchmethod`` поддерживает вложение с другими декораторами, такими как :func:`@classmethod<classmethod>`. Обратите внимание: чтобы разрешить использование ``dispatcher.register``, ``singledispatchmethod`` должен быть *самым внешним* декоратором. Вот класс Negator с методами neg, привязанными к классу, а не к экземпляру класса:

source: The same pattern can be used for other similar decorators: :func:`@staticmethod<staticmethod>`, :func:`@abstractmethod<abc.abstractmethod>`, and others.
ru: Тот же шаблон можно использовать и для других подобных декораторов: :func:`@staticmethod<staticmethod>`, :func:`@abstractmethod<abc.abstractmethod>` и других.

source: Update a *wrapper* function to look like the *wrapped* function. The optional arguments are tuples to specify which attributes of the original function are assigned directly to the matching attributes on the wrapper function and which attributes of the wrapper function are updated with the corresponding attributes from the original function. The default values for these arguments are the module level constants ``WRAPPER_ASSIGNMENTS`` (which assigns to the wrapper function's :attr:`~function.__module__`, :attr:`~function.__name__`, :attr:`~function.__qualname__`, :attr:`~function.__annotations__`, :attr:`~function.__type_params__`, and :attr:`~function.__doc__`, the documentation string) and ``WRAPPER_UPDATES`` (which updates the wrapper function's :attr:`~function.__dict__`, i.e. the instance dictionary).
ru: Обновите функцию *wrapper*, чтобы она выглядела как *wrapped* функция. Необязательные аргументы представляют собой кортежи, указывающие, какие атрибуты исходной функции присваиваются непосредственно совпадающим атрибутам функции-оболочки и какие атрибуты функции-оболочки обновляются соответствующими атрибутами из исходной функции. Значениями по умолчанию для этих аргументов являются константы уровня модуля ``WRAPPER_ASSIGNMENTS`` (которые присваиваются функциям-оболочкам :attr:`~function.__module__`, :attr:`~function.__name__`, :attr:`~function. __qualname__`, :attr:`~function.__annotations__`, :attr:`~function.__type_params__` и :attr:`~function.__doc__`, строка документации) и ``WRAPPER_UPDATES`` (который обновляет функцию-оболочку :attr:`~function.__dict__`, то есть словарь экземпляра).

source: To allow access to the original function for introspection and other purposes (e.g. bypassing a caching decorator such as :func:`lru_cache`), this function automatically adds a ``__wrapped__`` attribute to the wrapper that refers to the function being wrapped.
ru: Чтобы разрешить доступ к исходной функции для самоанализа и других целей (например, в обход декоратора кэширования, такого как :func:`lru_cache`), эта функция автоматически добавляет к оболочке атрибут ``__wrapped__``, который ссылается на обертываемую функцию.

source: The main intended use for this function is in :term:`decorator` functions which wrap the decorated function and return the wrapper. If the wrapper function is not updated, the metadata of the returned function will reflect the wrapper definition rather than the original function definition, which is typically less than helpful.
ru: Основное назначение этой функции — функции :term:`decorator`, которые оборачивают декорированную функцию и возвращают оболочку. Если функция-оболочка не обновляется, метаданные возвращаемой функции будут отражать определение оболочки, а не исходное определение функции, что обычно не очень полезно.

source: :func:`update_wrapper` may be used with callables other than functions. Any attributes named in *assigned* or *updated* that are missing from the object being wrapped are ignored (i.e. this function will not attempt to set them on the wrapper function). :exc:`AttributeError` is still raised if the wrapper function itself is missing any attributes named in *updated*.
ru: :func:`update_wrapper` может использоваться с вызываемыми объектами, отличными от функций. Любые атрибуты, указанные в *assigned* или *updated*, которые отсутствуют в обертываемом объекте, игнорируются (т. е. эта функция не будет пытаться установить их в функции-оболочке). :exc:`AttributeError` по-прежнему вызывается, если в самой функции-оболочке отсутствуют какие-либо атрибуты, указанные в *updated*.

source: The ``__wrapped__`` attribute is now automatically added. The :attr:`~function.__annotations__` attribute is now copied by default. Missing attributes no longer trigger an :exc:`AttributeError`.
ru: Атрибут ``__wrapped__`` теперь добавляется автоматически. Атрибут :attr:`~function.__annotations__` теперь копируется по умолчанию. Отсутствующие атрибуты больше не вызывают ошибку :exc:`AttributeError`.

source: The ``__wrapped__`` attribute now always refers to the wrapped function, even if that function defined a ``__wrapped__`` attribute. (see :issue:`17482`)
ru: Атрибут ``__wrapped__`` теперь всегда ссылается на обернутую функцию, даже если эта функция определила атрибут ``__wrapped__``. (см. :issue:`17482`)

source: The :attr:`~function.__type_params__` attribute is now copied by default.
ru: Атрибут :attr:`~function.__type_params__` теперь копируется по умолчанию.

source: This is a convenience function for invoking :func:`update_wrapper` as a function decorator when defining a wrapper function. It is equivalent to ``partial(update_wrapper, wrapped=wrapped, assigned=assigned, updated=updated)``. For example::
ru: Это удобная функция для вызова :func:`update_wrapper` в качестве декоратора функции при определении функции-обертки. Это эквивалентно ``partial(update_wrapper, обернутый=обернутый, назначенный=назначенный, обновленный=обновленный)``. Например::

source: Without the use of this decorator factory, the name of the example function would have been ``'wrapper'``, and the docstring of the original :func:`example` would have been lost.
ru: Без использования этой фабрики декораторов имя функции-примера было бы ``'обертка'``, а строка документации исходного :func:`example` была бы потеряна.

source: :class:`partial` Objects
ru: Объекты :class:`partial`

source: :class:`partial` objects are callable objects created by :func:`partial`. They have three read-only attributes:
ru: Объекты :class:`partial` — это вызываемые объекты, созданные :func:`partial`. У них есть три атрибута, доступных только для чтения:

source: A callable object or function. Calls to the :class:`partial` object will be forwarded to :attr:`func` with new arguments and keywords.
ru: Вызываемый объект или функция. Вызовы объекта :class:`partial` будут перенаправлены в :attr:`func` с новыми аргументами и ключевыми словами.

source: The leftmost positional arguments that will be prepended to the positional arguments provided to a :class:`partial` object call.
ru: Крайние левые позиционные аргументы, которые будут добавлены к позиционным аргументам, предоставленным при вызове объекта :class:`partial`.

source: The keyword arguments that will be supplied when the :class:`partial` object is called.
ru: Аргументы ключевого слова, которые будут предоставлены при вызове объекта :class:`partial`.

source: :class:`partial` objects are like :ref:`function objects <user-defined-funcs>` in that they are callable, weak referenceable, and can have attributes. There are some important differences. For instance, the :attr:`~function.__name__` and :attr:`function.__doc__` attributes are not created automatically. Also, :class:`partial` objects defined in classes behave like static methods and do not transform into bound methods during instance attribute look-up.
ru: Объекты :class:`partial` подобны :ref:`объектам функций <user-defined-funcs>` тем, что они являются вызываемыми, на них можно слабо ссылаться и они могут иметь атрибуты. Есть некоторые важные различия. Например, атрибуты :attr:`~function.__name__` и :attr:`function.__doc__` не создаются автоматически. Кроме того, объекты :class:`partial`, определенные в классах, ведут себя как статические методы и не преобразуются в связанные методы во время поиска атрибутов экземпляра.
