Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/functions.po
Languages: fa, pl

source: The *mode* argument specifies what kind of code must be compiled; it can be ``'exec'`` if *source* consists of a sequence of statements, ``'eval'`` if it consists of a single expression, or ``'single'`` if it consists of a single interactive statement (in the latter case, expression statements that evaluate to something other than ``None`` will be printed).
fa: آرگومان *mode* مشخص می کند که چه نوع کدی باید کامپایل شود. اگر *source* از دنباله ای از دستورات تشکیل شده باشد، می تواند ``'exec'`` باشد، اگر از یک عبارت واحد تشکیل شده باشد ``'eval'``، یا اگر از یک عبارت تعاملی تشکیل شده باشد، ``'single'`` باشد (در مورد دوم, عبارات عبارتی که به چیزی غیر از ``None`` ارزیابی می شوند چاپ می شوند).
pl: Argument *mode* określa, jaki rodzaj kodu ma zostać skompilowany; może mieć wartość ``'exec'`` jeśli *source* składa się z sekwencji instrukcji, ``'eval'`` jeśli składa się z jednego wyrażenia lub ``'single'`` jeśli składa się z jednej interaktywnej instrukcji (w ostatnim przypadku, instrukcje wyrażeń, które ewaluują się do czegoś innego niż ``None``, zostaną wydrukowane na standardowe wyjście).

source: The optional arguments *flags* and *dont_inherit* control which :ref:`compiler options <ast-compiler-flags>` should be activated and which :ref:`future features <future>` should be allowed. If neither is present (or both are zero) the code is compiled with the same flags that affect the code that is calling :func:`compile`. If the *flags* argument is given and *dont_inherit* is not (or is zero) then the compiler options and the future statements specified by the *flags* argument are used in addition to those that would be used anyway. If *dont_inherit* is a non-zero integer then the *flags* argument is it -- the flags (future features and compiler options) in the surrounding code are ignored.
fa: آرگومان های اختیاری *flags* و *dont_inherit* کنترل می کنند که کدام :ref:`compiler options <ast-compiler-flags>` باید فعال شود و کدام :ref:`future features <future>` باید مجاز باشد. اگر هیچ کدام وجود نداشته باشد (یا هر دو صفر باشند), کد با همان پرچم هایی که روی کدی که :func:`compile` را فراخوانی می کند تأثیر می گذارد، کامپایل می شود. اگر آرگومان *flags* داده شود و *dont_inherit* نباشد (یا صفر باشد), گزینه های کامپایلر و عبارات آینده مشخص شده توسط آرگومان *flags* علاوه بر مواردی که به هر حال مورد استفاده قرار می گیرند استفاده می شود. اگر *dont_inherit* یک عدد صحیح غیر صفر است، آرگومان *flags* همان است -- پرچم ها (ویژگی های آینده و گزینه های کامپایلر) در کد اطراف نادیده گرفته می شوند.
pl: Opcjonalne argumenty *flags* i *dont_inherit* kontrolują, które :ref:`opcje kompilatora <ast-compiler-flags>` powinny być aktywowane i które :ref:`przyszłe funkcje <future>` powinne być dozwolone. Jeśli żaden z nich nie jest obecny (lub oba są zerowe), kod jest kompilowany z tymi samymi flagami, które wpływają na kod wywołujący :func:`compile`. Jeśli argument *flags* jest podany, a *dont_inherit* nie jest (lub wynosi zero), to opcje kompilatora i przyszłe instrukcje określone przez argument *flags* są używane w dodatku do tych, które i tak byłyby użyte. Jeśli *dont_inherit* jest niezerową liczbą całkowitą, to argument *flags* jest nim – flagi (przyszłe funkcje i opcje kompilatora) w otaczającym kodzie są ignorowane.

source: Compiler options and future statements are specified by bits which can be bitwise ORed together to specify multiple options. The bitfield required to specify a given future feature can be found as the :attr:`~__future__._Feature.compiler_flag` attribute on the :class:`~__future__._Feature` instance in the :mod:`__future__` module. :ref:`Compiler flags <ast-compiler-flags>` can be found in :mod:`ast` module, with ``PyCF_`` prefix.
fa: گزینه‌های کامپایلر و عبارات آینده توسط بیت‌هایی مشخص می‌شوند که می‌توانند به صورت بیتی با هم OR شوند تا چندین گزینه را مشخص کنند. فیلد بیتی مورد نیاز برای تعیین یک ویژگی آینده داده شده را می توان به عنوان ویژگی :attr:`~__future__._Feature.compiler_flag` در نمونه :class:`~__future__._Feature` در ماژول :mod:`__future__` یافت. :ref:`Compiler flags <ast-compiler-flags>` را می توان در ماژول :mod:`ast` با پیشوند ``PyCF_`` یافت.
pl: Opcje kompilatora i przyszłe instrukcja są określone przez bity, które mogą być łączone bitowo w celu określenia wielu opcji. Pole bitowe wymagane do określenia danej przyszłej funkcji można znaleźć jako :attr:`~__future__._Feature.compiler_flag` atrybut na instancji :class:`~__future__._Feature` w module :mod:`__future__` . :ref:`Flagi kompilatora <ast-compiler-flags>` można znaleźć w module :mod:`ast` , z prefiksem ``PyCF_``.

source: The argument *optimize* specifies the optimization level of the compiler; the default value of ``-1`` selects the optimization level of the interpreter as given by :option:`-O` options. Explicit levels are ``0`` (no optimization; ``__debug__`` is true), ``1`` (asserts are removed, ``__debug__`` is false) or ``2`` (docstrings are removed too).
fa: آرگومان *optimize* سطح بهینه سازی کامپایلر را مشخص می کند. مقدار پیش‌فرض ``-1`` سطح بهینه‌سازی مفسر را مطابق با گزینه‌های :option:`-O` انتخاب می‌کند. سطوح صریح ``0`` (بدون بهینه سازی؛ ``__debug__`` درست است)، ``1`` (ادعاها حذف می شوند, ``__debug__`` نادرست است) یا ``2`` (رشته های اسناد نیز حذف می شوند).
pl: Wartość argumentu *optimize* określa poziom optymalizacji kompilatora; wartość domyślna ``-1`` wybiera poziom optymalizacji interpretera podany przez opcje :option:`-O`. Wyraźne poziomy to ``0`` (brak optymalizacji; ``__debug__`` to prawda), ``1`` (asercje są usuwane, ``__debug__`` to fałsz) lub ``2`` (docstrings są również usuwane).

source: This function raises :exc:`SyntaxError` if the compiled source is invalid, and :exc:`ValueError` if the source contains null bytes.
fa: اگر منبع کامپایل شده نامعتبر باشد، این تابع :exc:`SyntaxError` را افزایش می دهد و اگر منبع حاوی بایت های تهی باشد، :exc:`ValueError` را افزایش می دهد.
pl: To funkcja rzuci :exc:`SyntaxError` jeśli skompilowane źródło jest nieprawidłowe, a :exc:`ValueError` jeśli źródło zawiera bajty null.

source: If you want to parse Python code into its AST representation, see :func:`ast.parse`.
fa: اگر می خواهید کد پایتون را در نمایش AST آن تجزیه کنید، به :func:`ast.parse` مراجعه کنید.
pl: Jeśli chcesz przeanalizować kod Python do jego reprezentacji AST, zobacz :func:`ast.parse`.

source: Raises an :ref:`auditing event <auditing>` ``compile`` with arguments ``source`` and ``filename``. This event may also be raised by implicit compilation.
fa: یک :ref:`auditing event <auditing>` ``compile`` را با آرگومان های ``source`` و ``filename`` افزایش می دهد. این رویداد ممکن است با گردآوری ضمنی نیز مطرح شود.
pl: Rzuci zdarzenie :ref:`auditing <auditing>` ``compile`` z argumentem ``source`` i ``filename``. To zdarzenie może być również rzucone przez niejawną kompilację.

source: When compiling a string with multi-line code in ``'single'`` or ``'eval'`` mode, input must be terminated by at least one newline character. This is to facilitate detection of incomplete and complete statements in the :mod:`code` module.
fa: هنگام کامپایل یک رشته با کد چند خطی در حالت ``'single'`` یا ``'eval'``، ورودی باید حداقل با یک کاراکتر خط جدید خاتمه یابد. این برای تسهیل تشخیص عبارات ناقص و کامل در ماژول :mod:`code` است.
pl: Podczas kompilacji napisem z kodem wielowierszowym w trybie ``'single'`` lub ``'eval'``, dane wejściowe muszą być zakończone co najmniej jedną znak nowej lini. Ma to na celu ułatwienie wykrywania niekompletnych i kompletnych instrukcja w module :mod:`code` .

source: It is possible to crash the Python interpreter with a sufficiently large/complex string when compiling to an AST object due to stack depth limitations in Python's AST compiler.
fa: به دلیل محدودیت‌های عمق پشته در کامپایلر AST پایتون، ممکن است هنگام کامپایل کردن به یک شی AST، مفسر پایتون با یک رشته به اندازه کافی بزرگ/پیچیده خراب شود.
pl: Możliwe jest zawieszenie interpretera Python z wystarczająco dużym/złożonym napisem podczas kompilacji do obiektu AST z powodu ograniczeń głębokości stosu w kompilatorze AST Python.

source: Allowed use of Windows and Mac newlines. Also, input in ``'exec'`` mode does not have to end in a newline anymore. Added the *optimize* parameter.
fa: استفاده از خطوط جدید ویندوز و مک مجاز است. همچنین، ورودی در حالت ``'exec'`` دیگر لازم نیست به خط جدید ختم شود. پارامتر *optimize* اضافه شد.
pl: Zezwolono na używanie nowej linii w systemach Windows i Mac. Ponadto wprowadzanie danych w trybie ``'exec'`` nie musi już kończyć się nową linią. Dodano funkcję *optimize* parametr.

source: Previously, :exc:`TypeError` was raised when null bytes were encountered in *source*.
fa: پیش از این، :exc:`TypeError` زمانی که بایت های تهی در *source* مواجه می شدند، افزایش می یافت.
pl: Poprzednio, :exc:`TypeError` został rzucony gdy napotkano bajty null w *source*.

source: ``ast.PyCF_ALLOW_TOP_LEVEL_AWAIT`` can now be passed in flags to enable support for top-level ``await``, ``async for``, and ``async with``.
fa: اکنون می‌توان ``ast.PyCF_ALLOW_TOP_LEVEL_AWAIT`` را در پرچم‌ها برای فعال کردن پشتیبانی از ``await``، ``async for`` و ``async with`` سطح بالا منتقل کرد.
pl: ``ast.PyCF_ALLOW_TOP_LEVEL_AWAIT`` można teraz przekazywać we flagach, aby włączyć obsługę najwyższego poziomu ``await``, ``async for`` i ``async with``.

source: Convert a single string or number to a complex number, or create a complex number from real and imaginary parts.
fa: یک رشته یا عدد را به یک عدد مختلط تبدیل کنید یا یک عدد مختلط از قسمت های واقعی و خیالی ایجاد کنید.
pl: Konwertowanie pojedynczego napisu lub liczby na liczba zespolona lub tworzenie liczba zespolona z części rzeczywistej i urojonej.

source: Examples:
fa: مثال ها:
pl: Przykłady:

source: If the argument is a string, it must contain either a real part (in the same format as for :func:`float`) or an imaginary part (in the same format but with a ``'j'`` or ``'J'`` suffix), or both real and imaginary parts (the sign of the imaginary part is mandatory in this case). The string can optionally be surrounded by whitespaces and the round parentheses ``'('`` and ``')'``, which are ignored. The string must not contain whitespace between ``'+'``, ``'-'``, the ``'j'`` or ``'J'`` suffix, and the decimal number. For example, ``complex('1+2j')`` is fine, but ``complex('1 + 2j')`` raises :exc:`ValueError`. More precisely, the input must conform to the :token:`~float:complexvalue` production rule in the following grammar, after parentheses and leading and trailing whitespace characters are removed:
fa: اگر آرگومان یک رشته باشد، باید شامل یک قسمت واقعی (با همان قالب :func:`float`) یا یک قسمت خیالی (در همان قالب اما با پسوند ``'j'`` یا ``'J'``) یا هر دو قسمت واقعی و خیالی باشد (علامت قسمت خیالی در این مورد اجباری است). رشته را می توان به صورت اختیاری با فضاهای خالی و پرانتزهای گرد ``'('`` و ``')'`` احاطه کرد که نادیده گرفته می شوند. رشته نباید دارای فضای خالی بین ``'+'``، ``'-'``، پسوند ``'j'`` یا ``'J'`` و عدد اعشاری باشد. به عنوان مثال، ``complex('1+2j')`` خوب است، اما ``complex('1 + 2j')`` :exc:`ValueError` را افزایش می دهد. به‌طور دقیق‌تر، ورودی باید با قانون تولید :token:`~float:complexvalue` در گرامر زیر مطابقت داشته باشد، پس از حذف پرانتزها و کاراکترهای فضای خالی اصلی و انتهایی:
pl: Jeśli argument jest napisem, musi zawierać albo część rzeczywistą (w tym samym formacie co :func:`float`), albo część urojoną (w tym samym formacie, ale z przyrostkiem ``'j'`` lub ``'J'`` ), albo zarówno część rzeczywistą, jak i urojoną (znak części urojonej jest w tym przypadku obowiązkowy). Wartość napis może być opcjonalnie otoczona białymi znakami i okrągłymi nawiasami ``'('`` i ``')'``, które są ignorowane. napis nie może zawierać białych znaków między ``'+'``, ``'-'``, przyrostkiem ``'j'`` lub ``'J'`` a liczbą dziesiętną. Na przykład, ``complex('1+2j')`` jest w porządku, ale ``complex('1 + 2j')`` rzuci :exc:`ValueError` . Dokładniej, dane wejściowe muszą być zgodne z regułą produkcji :token:`~float:complexvalue` w poniższej gramatyce, po usunięciu nawiasów oraz początkowych i końcowych znaków:

source: If the argument is a number, the constructor serves as a numeric conversion like :class:`int` and :class:`float`. For a general Python object ``x``, ``complex(x)`` delegates to ``x.__complex__()``. If :meth:`~object.__complex__` is not defined then it falls back to :meth:`~object.__float__`. If :meth:`!__float__` is not defined then it falls back to :meth:`~object.__index__`.
fa: اگر آرگومان یک عدد باشد، سازنده به عنوان یک تبدیل عددی مانند :class:`int` و :class:`float` عمل می کند. برای یک شیء عمومی پایتون ``x``، ``complex(x)`` به ``x.__complex__()`` واگذار می شود. اگر :meth:`~object.__complex__` تعریف نشده باشد، به :meth:`~object.__float__` برمی گردد. اگر :meth:`!__float__` تعریف نشده باشد، به :meth:`~object.__index__` برمی گردد.
pl: Jeśli argument jest liczbą, konstruktor służy jako konwersja numeryczna, podobnie jak :class:`int` i :class:`float`. Dla ogólnego obiektu Python ``x`` , ``complex(x)`` deleguje do ``x.__complex__()``. Jeśli :meth:`~object.__complex__` nie jest zdefiniowane, to spada z powrotem do :meth:`~object.__float__`. Jeśli :meth:`!__float__` nie jest zdefiniowane, to spada z powrotem do :meth:`~object.__index__`.

source: If two arguments are provided or keyword arguments are used, each argument may be any numeric type (including complex). If both arguments are real numbers, return a complex number with the real component *real* and the imaginary component *imag*. If both arguments are complex numbers, return a complex number with the real component ``real.real-imag.imag`` and the imaginary component ``real.imag+imag.real``. If one of arguments is a real number, only its real component is used in the above expressions.
fa: اگر دو آرگومان ارائه شود یا از آرگومان های کلمه کلیدی استفاده شود، هر آرگومان ممکن است از هر نوع عددی (از جمله مختلط) باشد. اگر هر دو آرگومان اعداد واقعی هستند، یک عدد مختلط با جزء واقعی *real* و جزء خیالی *imag* برگردانید. اگر هر دو آرگومان اعداد مختلط هستند، یک عدد مختلط با مؤلفه واقعی ``real.real-imag.imag`` و مؤلفه خیالی ``real.imag+imag.real`` برگردانید. اگر یکی از آرگومان ها یک عدد واقعی باشد، فقط جزء واقعی آن در عبارات بالا استفاده می شود.
pl: Jeśli podano dwa argumenty lub argument nazwany, każdy argument może być dowolnego typu liczbowego (w tym złożonego). Jeśli oba argumenty są liczbami rzeczywistymi, zwraca liczba zespolona ze składnikiem rzeczywistym *real* i składnikiem urojonym *imag*. Jeśli oba argumenty są liczba zespolona, zwraca liczba zespolona ze składnikiem rzeczywistym ``real.real-imag.imag`` i składnikiem urojonym ``real.imag+imag.real``. Jeśli jedna z argumentow jest liczbą rzeczywistą, w powyższych wyrażeniach używany jest tylko jej składnik rzeczywisty.

source: If all arguments are omitted, returns ``0j``.
fa: اگر همه آرگومان ها حذف شوند، ``0j`` را برمی گرداند.
pl: Jeśli wszystkie argumenty zostaną pominięte, zwraca ``0j`` .

source: The complex type is described in :ref:`typesnumeric`.
fa: نوع پیچیده در :ref:`typesnumeric` توضیح داده شده است.
pl: Typ Complex został opisany na stronie :ref:`typesnumeric`.

source: Grouping digits with underscores as in code literals is allowed.
fa: گروه بندی ارقام با زیرخط مانند حروف کد مجاز است.
pl: Dozwolone jest grupowanie cyfr za pomocą podkreślników, tak jak w literałach kodu.

source: Falls back to :meth:`~object.__index__` if :meth:`~object.__complex__` and :meth:`~object.__float__` are not defined.
fa: اگر :meth:`~object.__complex__` و :meth:`~object.__float__` تعریف نشده باشند به :meth:`~object.__index__` برمی گردد.
pl: Powraca do :meth:`~object.__index__`, jeśli :meth:`~object.__complex__` i :meth:`~object.__float__` nie są zdefiniowane.

source: This is a relative of :func:`setattr`. The arguments are an object and a string. The string must be the name of one of the object's attributes. The function deletes the named attribute, provided the object allows it. For example, ``delattr(x, 'foobar')`` is equivalent to ``del x.foobar``. *name* need not be a Python identifier (see :func:`setattr`).
fa: این یکی از بستگان :func:`setattr` است. آرگومان ها یک شی و یک رشته هستند. رشته باید نام یکی از ویژگی های شی باشد. تابع ویژگی نامگذاری شده را حذف می کند، مشروط بر اینکه شیء اجازه دهد. به عنوان مثال، ``delattr(x, 'foobar')`` معادل ``del x.foobar`` است. *name* نباید یک شناسه پایتون باشد (به :func:`setattr` مراجعه کنید).
pl: Jest to krewny :func:`setattr`. Argumenty są obiektem i napisem. Napis musi być nazwą jednego z atrybut obiektu. Funkcja usuwa nazwany atrybut, pod warunkiem, że obiekt na to pozwala. Na przykład, ``delattr(x, 'foobar')`` jest równoważne ``del x.foobar``. *name* nie musi być identyfikatorem Python (zobacz :func:`setattr`).

source: Create a new dictionary. The :class:`dict` object is the dictionary class. See :class:`dict` and :ref:`typesmapping` for documentation about this class.
fa: یک فرهنگ لغت جدید ایجاد کنید. شی :class:`dict` کلاس دیکشنری است. برای مستندات مربوط به این کلاس به :class:`dict` و :ref:`typesmapping` مراجعه کنید.
pl: Utwórz nowy słownik. Obiekt :class:`dict` jest klasą słownik. Dokumentacja dotycząca tej klasy znajduje się na stronach :class:`dict` i :ref:`typesmapping`.

source: For other containers see the built-in :class:`list`, :class:`set`, and :class:`tuple` classes, as well as the :mod:`collections` module.
fa: برای سایر کانتینرها به کلاس های داخلی :class:`list`، :class:`set` و :class:`tuple` و همچنین ماژول :mod:`collections` مراجعه کنید.
pl: Inne kontenery można znaleźć w klasach wbudowanych :class:`list` , :class:`set` i :class:`tuple`, a także moduł :mod:`collections` .

source: Without arguments, return the list of names in the current local scope. With an argument, attempt to return a list of valid attributes for that object.
fa: بدون آرگومان، فهرست اسامی را در محدوده محلی فعلی برگردانید. با یک آرگومان، سعی کنید لیستی از ویژگی های معتبر برای آن شی را برگردانید.
pl: Bez argumentow, zwraca listę nazw w bieżącym zakresie lokalnym. Z argumentów, próba zwraca listy prawidłowych atrybut dla tego obiektu.

source: If the object has a method named :meth:`~object.__dir__`, this method will be called and must return the list of attributes. This allows objects that implement a custom :func:`~object.__getattr__` or :func:`~object.__getattribute__` function to customize the way :func:`dir` reports their attributes.
fa: اگر شی دارای متدی به نام :meth:`~object.__dir__` باشد، این متد فراخوانی می شود و باید لیست ویژگی ها را برگرداند. این به اشیایی که یک تابع سفارشی :func:`~object.__getattr__` یا :func:`~object.__getattribute__` را پیاده سازی می کنند اجازه می دهد تا نحوه گزارش :func:`dir` ویژگی های خود را سفارشی کنند.
pl: Jeśli obiekt posiada metodę o nazwie :meth:`~object.__dir__`, metoda ta zostanie wywołana i musi zwracać listę atrybut. Pozwala to obiektom, które implementują niestandardowe :func:`~object.__getattr__` lub :func:`~object.__getattribute__` funkcje na dostosowanie sposobu, w jaki :func:`dir` zgłasza ich atrybuty.

source: If the object does not provide :meth:`~object.__dir__`, the function tries its best to gather information from the object's :attr:`~object.__dict__` attribute, if defined, and from its type object. The resulting list is not necessarily complete and may be inaccurate when the object has a custom :func:`~object.__getattr__`.
fa: اگر شیء :meth:`~object.__dir__` را ارائه نکند، تابع تمام تلاش خود را می کند تا اطلاعات را از ویژگی :attr:`~object.__dict__` شیء، در صورت تعریف، و از شی نوع آن جمع آوری کند. لیست حاصل لزوماً کامل نیست و ممکن است زمانی که شیء دارای :func:`~object.__getattr__` سفارشی باشد، نادرست باشد.
pl: Jeśli obiekt nie udostępnia :meth:`~object.__dir__`, funkcja stara się zebrać informacje z :attr:`~object.__dict__` atrybut obiektu, jeśli jest zdefiniowany, oraz z jego obiektu typu. Wynikowa lista niekoniecznie jest kompletna i może być niedokładna, jeśli obiekt ma niestandardowy :func:`~object.__getattr__`.

source: The default :func:`dir` mechanism behaves differently with different types of objects, as it attempts to produce the most relevant, rather than complete, information:
fa: مکانیسم پیش‌فرض :func:`dir` با انواع مختلف اشیا رفتار متفاوتی دارد، زیرا تلاش می‌کند مرتبط‌ترین و نه کامل‌ترین اطلاعات را تولید کند:
pl: Mechanizm domyślny :func:`dir` zachowuje się inaczej w przypadku różnych typów obiektów, ponieważ stara się uzyskać najbardziej istotne, a nie kompletne informacje:

source: If the object is a module object, the list contains the names of the module's attributes.
fa: اگر شی یک شی ماژول است، لیست شامل نام ویژگی های ماژول است.
pl: Jeśli obiekt jest obiektem moduł, lista zawiera nazwy obiektów moduł atrybutow.

source: If the object is a type or class object, the list contains the names of its attributes, and recursively of the attributes of its bases.
fa: اگر شی یک شی نوع یا کلاس باشد، لیست شامل نام ویژگی های آن و به صورت بازگشتی از ویژگی های پایه های آن است.
pl: Jeśli obiekt jest obiektem typu lub klasy, lista zawiera nazwy jego atrybut i rekurencyjnie atrybut jego baz.

source: Otherwise, the list contains the object's attributes' names, the names of its class's attributes, and recursively of the attributes of its class's base classes.
fa: در غیر این صورت، لیست شامل نام ویژگی های شی، نام ویژگی های کلاس آن، و به صورت بازگشتی از ویژگی های کلاس های پایه کلاس خود است.
pl: W przeciwnym razie lista zawiera nazwy atrybut' obiektow, nazwy atrybut jego klasy i rekurencyjnie atrybut klas bazowych jego klasy.

source: The resulting list is sorted alphabetically. For example:
fa: لیست به دست آمده بر اساس حروف الفبا مرتب شده است. به عنوان مثال:
pl: Wynikowa lista jest posortowana alfabetycznie. Na przykład:

source: Because :func:`dir` is supplied primarily as a convenience for use at an interactive prompt, it tries to supply an interesting set of names more than it tries to supply a rigorously or consistently defined set of names, and its detailed behavior may change across releases. For example, metaclass attributes are not in the result list when the argument is a class.
fa: از آنجایی که :func:`dir` عمدتاً به عنوان یک راحتی برای استفاده در یک اعلان تعاملی ارائه می‌شود، سعی می‌کند مجموعه‌ای جالب از نام‌ها را بیش از تلاش برای ارائه مجموعه‌ای از نام‌ها به‌طور دقیق یا به‌طور پیوسته ارائه کند، و رفتار جزئیات آن ممکن است در نسخه‌ها تغییر کند. به عنوان مثال، هنگامی که آرگومان یک کلاس است، ویژگی های متاکلاس در لیست نتیجه وجود ندارد.
pl: Ponieważ :func:`dir` jest dostarczany głównie jako udogodnienie do użycia w interaktywnym wierszu polecenia, stara się dostarczyć interesujący zestaw nazw bardziej niż rygorystycznie lub konsekwentnie zdefiniowany zestaw nazw, a jego szczegółowy zachowanie może się zmieniać w różnych wydaniach. Na przykład, atrybut metaklasy nie znajduje się na liście wyników, gdy argument jest klasą.
