Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/functions.po
Languages: fa, pl

source: The following example uses the :ref:`dir_fd <dir_fd>` parameter of the :func:`os.open` function to open a file relative to a given directory::
fa: مثال زیر از پارامتر :ref:`dir_fd <dir_fd>` تابع :func:`os.open` برای باز کردن یک فایل نسبت به دایرکتوری معین استفاده می کند:
pl: Poniższy przykład używa :ref:`dir_fd <dir_fd>` parametr z :func:`os.open` funkcji do otwarcia pliku względem danego katalogu::

source: >>> import os >>> dir_fd = os.open('somedir', os.O_RDONLY) >>> def opener(path, flags): ... return os.open(path, flags, dir_fd=dir_fd) ... >>> with open('spamspam.txt', 'w', opener=opener) as f: ... print('This will be written to somedir/spamspam.txt', file=f) ... >>> os.close(dir_fd) # don't leak a file descriptor
pl: >>> import os >>> dir_fd = os.open('somedir', os.O_RDONLY) >>> def opener(path, flags): ... return os.open(path, flags, dir_fd=dir_fd) ... >>> with open('spamspam.txt', 'w', opener=opener) as f: ... print('To zostanie zapisane w somedir/spamspam.txt', file=f) ... >>> os.close(dir_fd) # nie ujawniaj deskryptora pliku

source: The type of :term:`file object` returned by the :func:`open` function depends on the mode. When :func:`open` is used to open a file in a text mode (``'w'``, ``'r'``, ``'wt'``, ``'rt'``, etc.), it returns a subclass of :class:`io.TextIOBase` (specifically :class:`io.TextIOWrapper`). When used to open a file in a binary mode with buffering, the returned class is a subclass of :class:`io.BufferedIOBase`. The exact class varies: in read binary mode, it returns an :class:`io.BufferedReader`; in write binary and append binary modes, it returns an :class:`io.BufferedWriter`, and in read/write mode, it returns an :class:`io.BufferedRandom`. When buffering is disabled, the raw stream, a subclass of :class:`io.RawIOBase`, :class:`io.FileIO`, is returned.
fa: نوع :term:`file object` برگردانده شده توسط تابع :func:`open` به حالت بستگی دارد. هنگامی که از :func:`open` برای باز کردن یک فایل در حالت متنی (``'w'``, ``'r'``, ``'wt'``, ``'rt'``, و غیره) استفاده می شود، زیر کلاس :class:`io.TextIOBase` (مخصوصا :class:`io.TextIOWrapper`) را برمی گرداند. وقتی برای باز کردن یک فایل در حالت باینری با بافر استفاده می شود، کلاس برگشتی زیر کلاس :class:`io.BufferedIOBase` است. کلاس دقیق متفاوت است: در حالت خواندن باینری، یک :class:`io.BufferedReader` برمی گرداند. در حالت نوشتن باینری و اضافه کردن، یک :class:`io.BufferedWriter` و در حالت خواندن/نوشتن، یک :class:`io.BufferedRandom` برمی‌گرداند. هنگامی که بافر غیرفعال است، جریان خام، یک زیر کلاس از :class:`io.RawIOBase`، :class:`io.FileIO`، برگردانده می شود.
pl: Typ :term:`file object` zwracany przez :func:`open` zależy od trybu. Gdy :func:`open` jest używany do otwarcia pliku w trybie tekstowym (``'w'``, ``'r'``, ``'wt'``, ``'rt'``, itd.), to zwracana jest podklasa klasy :class:`io.TextIOBase` (w szczególności :class:`io.TextIOWrapper`). W przypadku użycia do otwarcia pliku w trybie binarnym z buforowaniem, zwracana klasą jest podklasa z :class:`io.BufferedIOBase`. Dokładna klasa różni się: w trybie odczytu binarnego, jest to zwracane z :class:`io.BufferedReader`; w trybach zapisu binarnego i dołączania binarnego, jest to zwracane z :class:`io.BufferedWriter`, a w trybie odczytu/zapisu, jest to zwracane z :class:`io.BufferedRandom`. Gdy buforowanie jest wyłączone, zwracany jest nieprzetworzony strumień, podklasa z :class:`io.RawIOBase`, :class:`io.FileIO`.

source: See also the file handling modules, such as :mod:`fileinput`, :mod:`io` (where :func:`open` is declared), :mod:`os`, :mod:`os.path`, :mod:`tempfile`, and :mod:`shutil`.
fa: همچنین به ماژول های مدیریت فایل مانند :mod:`fileinput`، :mod:`io` (جایی که :func:`open` اعلام شده است)، :mod:`os`، :mod:`os.path`، :mod:`tempfile` و :mod:`shutil` مراجعه کنید.
pl: Zobacz także moduły obsługę plików, takich jak :mod:`fileinput`, :mod:`io` (gdzie zadeklarowano :func:`open` ), :mod:`os`, :mod:`os.path`, :mod:`tempfile` i :mod:`shutil`.

source: Raises an :ref:`auditing event <auditing>` ``open`` with arguments ``path``, ``mode``, ``flags``.
fa: یک :ref:`auditing event <auditing>` ``open`` را با آرگومان های ``path``، ``mode``، ``flags`` افزایش می دهد.
pl: Rzuca :ref:`auditing event <auditing>` ``open`` z argumentami ``path`` , ``mode``, ``flags``.

source: The ``mode`` and ``flags`` arguments may have been modified or inferred from the original call.
fa: آرگومان‌های ``mode`` و ``flags`` ممکن است از فراخوان اصلی تغییر یافته یا استنتاج شده باشند.
pl: Adresy ``mode`` i ``flags`` argumenty mogły zostać zmodyfikowane lub wywnioskowane z oryginalnego połączenia.

source: The *opener* parameter was added.
fa: پارامتر *opener* اضافه شد.
pl: Dodano *opener* parametr.

source: The ``'x'`` mode was added.
fa: حالت ``'x'`` اضافه شد.
pl: Dodano tryb ``'x'``.

source: :exc:`IOError` used to be raised, it is now an alias of :exc:`OSError`.
fa: :exc:`IOError` قبلاً مطرح می شد، اکنون نام مستعار :exc:`OSError` است.
pl: :exc:`IOError` kiedyś był rzucony, teraz jest alias z :exc:`OSError`.

source: :exc:`FileExistsError` is now raised if the file opened in exclusive creation mode (``'x'``) already exists.
fa: اگر فایل باز شده در حالت ایجاد انحصاری (``'x'``) از قبل وجود داشته باشد، اکنون :exc:`FileExistsError` افزایش می یابد.
pl: :exc:`FileExistsError` jest teraz rzucane, jeśli plik otwarty w trybie wyłącznego tworzenia (``'x'``) już istnieje.

source: The file is now non-inheritable.
fa: فایل در حال حاضر غیر قابل ارث است.
pl: Plik nie jest teraz dziedziczony.

source: If the system call is interrupted and the signal handler does not raise an exception, the function now retries the system call instead of raising an :exc:`InterruptedError` exception (see :pep:`475` for the rationale).
fa: اگر تماس سیستم قطع شود و کنترل کننده سیگنال استثنایی را مطرح نکند، تابع اکنون به جای افزایش استثنای :exc:`InterruptedError`، فراخوانی سیستم را مجدداً انجام می دهد (برای دلیل منطقی به :pep:`475` مراجعه کنید).
pl: Jeśli wywołanie systemowe zostanie przerwane, a program obsługi sygnału nie rzuci wyjątku, funkcji ponawia teraz wywołanie systemowe zamiast rzucenja wyjątku :exc:`InterruptedError` (zobacz :pep:`475` dla uzasadnienia).

source: The ``'namereplace'`` error handler was added.
fa: کنترل کننده خطای ``'namereplace'`` اضافه شد.
pl: Dodano obsługę błędów ``'namereplace'``.

source: Support added to accept objects implementing :class:`os.PathLike`.
fa: پشتیبانی برای پذیرش اشیاء در حال اجرای :class:`os.PathLike` اضافه شده است.
pl: Dodano obsługę akceptowania obiektów implementujących :class:`os.PathLike`.

source: On Windows, opening a console buffer may return a subclass of :class:`io.RawIOBase` other than :class:`io.FileIO`.
fa: در ویندوز، باز کردن بافر کنسول ممکن است زیر کلاس :class:`io.RawIOBase` غیر از :class:`io.FileIO` را بازگرداند.
pl: W systemie Windows, otwarcie bufora konsoli może zwracać podklasa z :class:`io.RawIOBase` innego niż :class:`io.FileIO`.

source: The ``'U'`` mode has been removed.
fa: حالت ``'U'`` حذف شده است.
pl: Tryb ``'U'`` został usunięty.

source: Given a string representing one Unicode character, return an integer representing the Unicode code point of that character. For example, ``ord('a')`` returns the integer ``97`` and ``ord('€')`` (Euro sign) returns ``8364``. This is the inverse of :func:`chr`.
fa: با توجه به رشته ای که یک کاراکتر یونیکد را نشان می دهد، یک عدد صحیح نشان دهنده نقطه کد یونیکد آن کاراکتر را برگردانید. برای مثال، ``ord('a')`` عدد صحیح ``97`` و ``ord('€')`` (نشانه یورو) ``8364`` را برمی گرداند. این برعکس :func:`chr` است.
pl: Biorąc pod uwagę napis reprezentujący jeden punkt kodowy Unicode znak, zwracać i liczba całkowita reprezentujący punkt kodowy Unicode tego znaka. Na przykład, ``ord('a')`` zwraca liczbe całkowita ``97`` i ``ord('€')`` (znak euro) zwraca ``8364`` . Jest to odwrotność :func:`chr`.

source: Return *base* to the power *exp*; if *mod* is present, return *base* to the power *exp*, modulo *mod* (computed more efficiently than ``pow(base, exp) % mod``). The two-argument form ``pow(base, exp)`` is equivalent to using the power operator: ``base**exp``.
fa: *base* را به قدرت *exp* برگردانید. اگر *mod* وجود دارد، *base* را به توان *exp*، مدول *mod* برگردانید (محاسبه شده کارآمدتر از ``pow(base, exp) % mod``). فرم دو استدلالی ``pow(base, exp)`` معادل استفاده از عملگر قدرت است: ``base**exp``.
pl: Zwraca *base* do potęgi *exp*; jeśli *mod* jest obecny, zwraca *base* do potęgi *exp*, modulo *mod* (obliczane bardziej efektywnie niż ``pow(base, exp) % mod``). Forma dwóchargumentow ``pow(base, exp)`` jest równoważna użyciu operatora potęgi: ``base**exp``.

source: The arguments must have numeric types. With mixed operand types, the coercion rules for binary arithmetic operators apply. For :class:`int` operands, the result has the same type as the operands (after coercion) unless the second argument is negative; in that case, all arguments are converted to float and a float result is delivered. For example, ``pow(10, 2)`` returns ``100``, but ``pow(10, -2)`` returns ``0.01``. For a negative base of type :class:`int` or :class:`float` and a non-integral exponent, a complex result is delivered. For example, ``pow(-9, 0.5)`` returns a value close to ``3j``. Whereas, for a negative base of type :class:`int` or :class:`float` with an integral exponent, a float result is delivered. For example, ``pow(-9, 2.0)`` returns ``81.0``.
fa: آرگومان ها باید دارای انواع عددی باشند. با انواع عملوند مختلط، قوانین اجباری برای عملگرهای حسابی باینری اعمال می شود. برای عملوندهای :class:`int`، نتیجه همان نوع عملوندها است (بعد از اجبار) مگر اینکه آرگومان دوم منفی باشد. در آن صورت، همه آرگومان ها به float تبدیل می شوند و یک نتیجه float تحویل داده می شود. برای مثال، ``pow(10, 2)`` ``100`` را برمی گرداند، اما ``pow(10, -2)`` ``0.01`` را برمی گرداند. برای یک پایه منفی از نوع :class:`int` یا :class:`float` و یک توان غیرانتگرال، یک نتیجه پیچیده ارائه می شود. برای مثال، ``pow(-9, 0.5)`` مقداری نزدیک به ``3j`` برمی‌گرداند. در حالی که، برای یک پایه منفی از نوع :class:`int` یا :class:`float` با یک توان انتگرال، یک نتیجه شناور ارائه می شود. به عنوان مثال، ``pow(-9, 2.0)`` ``81.0`` را برمی گرداند.
pl: Operatory argumentów muszą mieć typy numeryczne. W przypadku mieszanych typów operandów obowiązują zasady koercji dla binarnych operatorów arytmetycznych. Dla operandów :class:`int` wynik ma ten sam typ co operandy (po koercji), chyba że drugi argument jest ujemny; w takim przypadku wszystkie argument są konwertowane na float i dostarczany jest wynik float. Na przykład, ``pow(10, 2)`` zwracać ``100`` , ale ``pow(10, -2)`` zwracać ``0.01`` . W przypadku ujemnej podstawy typu :class:`int` lub :class:`float` i wykładnika niecałkowitego dostarczany jest wynik złożony. Na przykład, ``pow(-9, 0.5)`` zwraca wartość zbliżona do ``3j``. Natomiast dla ujemnej podstawy typu :class:`int` lub :class:`float` z wykładnikiem całkowitym, dostarczany jest wynik zmiennoprzecinkowy. Na przykład ``pow(-9, 2.0)`` zwraca ``81.0`` .

source: For :class:`int` operands *base* and *exp*, if *mod* is present, *mod* must also be of integer type and *mod* must be nonzero. If *mod* is present and *exp* is negative, *base* must be relatively prime to *mod*. In that case, ``pow(inv_base, -exp, mod)`` is returned, where *inv_base* is an inverse to *base* modulo *mod*.
fa: برای عملوندهای :class:`int` *base* و *exp*، اگر *mod* وجود داشته باشد، *mod* نیز باید از نوع صحیح باشد و *mod* باید غیر صفر باشد. اگر *mod* وجود داشته باشد و *exp* منفی باشد، *base* باید نسبتاً اول به *mod* باشد. در آن صورت، ``pow(inv_base, -exp, mod)`` برگردانده می شود، که در آن *inv_base* معکوس مدول *base* *mod* است.
pl: Dla operandów :class:`int` *base* i *exp*, jeśli *mod* jest obecny, *mod* musi być również typu liczba całkowita i *mod* musi być niezerowy. Jeśli *mod* jest obecny, a *exp* jest ujemny, *base* musi być względnie pierwsze do *mod*. W takim przypadku zwracana jest wartość ``pow(inv_base, -exp, mod)``, gdzie *inv_base* jest odwrotnością *base* modulo *mod*.

source: Here's an example of computing an inverse for ``38`` modulo ``97``::
fa: در اینجا مثالی از محاسبه معکوس برای مدول ``38`` ``97`` آورده شده است:
pl: Oto przykład obliczania odwrotności dla ``38`` modulo ``97``::

source: For :class:`int` operands, the three-argument form of ``pow`` now allows the second argument to be negative, permitting computation of modular inverses.
fa: برای عملوندهای :class:`int`، فرم سه آرگومان ``pow`` اکنون اجازه می‌دهد آرگومان دوم منفی باشد و امکان محاسبه معکوس‌های مدولار را فراهم می‌کند.
pl: W przypadku operandów :class:`int`, trzy-argumenty formy ``pow`` pozwala teraz, aby drugi argument był ujemny, umożliwiając obliczanie odwrotności modularnych.

source: Allow keyword arguments. Formerly, only positional arguments were supported.
fa: آرگومان های کلمه کلیدی را مجاز کنید. قبلاً فقط استدلال های موضعی پشتیبانی می شد.
pl: Zezwalaj na argument nazwany. Wcześniej obsługiwane były tylko pozycyjne argument.

source: Print *objects* to the text stream *file*, separated by *sep* and followed by *end*. *sep*, *end*, *file*, and *flush*, if present, must be given as keyword arguments.
fa: *objects* را در جریان متنی *file* چاپ کنید که با *sep* جدا شده و به دنبال آن *end* است. *sep*، *end*، *file*، و *flush*، در صورت وجود، باید به عنوان آرگومان های کلمه کلیدی ارائه شوند.
pl: Wypisuje *obiekty* do strumienia tekstowego *file*, oddzielone *sep* i zakończone *end*. *sep*, *end*, *file* i *flush*, jeśli występują, muszą być podane jako argument nazwany.

source: All non-keyword arguments are converted to strings like :func:`str` does and written to the stream, separated by *sep* and followed by *end*. Both *sep* and *end* must be strings; they can also be ``None``, which means to use the default values. If no *objects* are given, :func:`print` will just write *end*.
fa: همه آرگومان‌های غیرکلیدی به رشته‌هایی مانند :func:`str` تبدیل می‌شوند و در جریان نوشته می‌شوند، با *sep* از هم جدا می‌شوند و به دنبال آن *end* می‌شوند. هر دو *sep* و *end* باید رشته باشند. آنها همچنین می توانند ``None`` باشند که به معنای استفاده از مقادیر پیش فرض است. اگر *objects* داده نشود، :func:`print` فقط *end* را می نویسد.
pl: Wszystkie non-argumenty nazwane są konwertowane na napis tak jak :func:`str` i zapisywane do strumienia, oddzielone *sep* i *end*. Zarówno *sep* jak i *end* muszą być napisem; mogą być również ``None``, co oznacza użycie wartości domyślne. Jeśli nie podano *objects*, :func:`print` po prostu zapisze *end*.

source: The *file* argument must be an object with a ``write(string)`` method; if it is not present or ``None``, :data:`sys.stdout` will be used. Since printed arguments are converted to text strings, :func:`print` cannot be used with binary mode file objects. For these, use ``file.write(...)`` instead.
fa: آرگومان *file* باید یک شی با متد ``write(string)`` باشد. اگر ``None`` وجود نداشته باشد، از :data:`sys.stdout` استفاده خواهد شد. از آنجایی که آرگومان های چاپ شده به رشته های متنی تبدیل می شوند، :func:`print` را نمی توان با اشیاء فایل حالت باینری استفاده کرد. برای این موارد، به جای آن از ``file.write(...)`` استفاده کنید.
pl: *Plik* argument musi być obiektem z metodą ``write(string)``; jeśli nie jest obecny lub ``None``, zostanie użyty :data:`sys.stdout`. Ponieważ drukowane argument są konwertowane na tekst napis, :func:`print` nie może być używany z obiektami plików w trybie binarnym. Zamiast tego należy uży ``file.write(...)``.

source: Output buffering is usually determined by *file*. However, if *flush* is true, the stream is forcibly flushed.
fa: بافر خروجی معمولاً توسط *file* تعیین می شود. با این حال، اگر *flush* درست باشد، جریان به اجبار فلاش می شود.
pl: Buforowanie wyjścia jest zwykle określane przez *file*. Jednakże, jeśli *flush* jest prawdą, strumień jest przymusowo opróżniany.

source: Added the *flush* keyword argument.
fa: آرگومان کلمه کلیدی *flush* اضافه شد.
pl: Dodano *flush* argument nazwany.

source: Return a property attribute.
fa: یک ویژگی ویژگی را برگردانید.
pl: Zwraca atrybut właściwośći.

source: *fget* is a function for getting an attribute value. *fset* is a function for setting an attribute value. *fdel* is a function for deleting an attribute value. And *doc* creates a docstring for the attribute.
fa: *fget* تابعی برای دریافت مقدار مشخصه است. *fset* تابعی برای تنظیم مقدار مشخصه است. *fdel* تابعی برای حذف یک مقدار مشخصه است. و *doc* یک Docstring برای ویژگی ایجاد می کند.
pl: *fget* to funkcja do pobierania wartości atrybut. *fset* to funkcja do ustawiania wartości atrybut. *fdel* to funkcja do usuwania wartości atrybut. Z kolei *doc* tworzy docstring dla atrybut.

source: A typical use is to define a managed attribute ``x``::
fa: یک استفاده معمولی برای تعریف یک ویژگی مدیریت شده ``x`` است::
pl: Typowym zastosowaniem jest zdefiniowanie zarządzanego atrybutu ``x`` ::

source: If *c* is an instance of *C*, ``c.x`` will invoke the getter, ``c.x = value`` will invoke the setter, and ``del c.x`` the deleter.
fa: اگر *c* نمونه ای از *C* باشد، ``c.x`` گیرنده، ``c.x = value`` تنظیم کننده و ``del c.x`` حذف کننده را فراخوانی می کند.
pl: Jeśli *c* jest instancją *C*, ``c.x`` wywoła getter, ``c.x = value`` wywoła setter, a ``del c.x`` deleter.

source: If given, *doc* will be the docstring of the property attribute. Otherwise, the property will copy *fget*'s docstring (if it exists). This makes it possible to create read-only properties easily using :func:`property` as a :term:`decorator`::
fa: اگر داده شود، *doc* مدارک ویژگی ویژگی خواهد بود. در غیر این صورت، این ویژگی رشته مستند *fget* را کپی می کند (در صورت وجود). این امکان ایجاد ویژگی های فقط خواندنی را با استفاده از :func:`property` به عنوان :term:`decorator` به راحتی امکان پذیر می کند:
pl: Jeśli zostanie podana, *doc* będzie docstringiem właściwości atrybut. W przeciwnym razie właściwość skopiuje docstring *fget* (jeśli istnieje). Umożliwia to łatwe tworzenie właściwości tylko do odczytu przy użyciu :func:`property` jako :term:`dekorator`::

source: class Parrot: def __init__(self): self._voltage = 100000 @property def voltage(self): """Get the current voltage.""" return self._voltage
pl: class Parrot: def __init__(self): self._voltage = 100000 @property def voltage(self): """Uzyska aktualne napięcie."" return self._voltage

source: The ``@property`` decorator turns the :meth:`!voltage` method into a "getter" for a read-only attribute with the same name, and it sets the docstring for *voltage* to "Get the current voltage."
fa: دکوراتور ``@property`` روش :meth:`!voltage` را به یک "گیرنده" برای یک ویژگی فقط خواندنی با همین نام تبدیل می کند و رشته docstring را برای *voltage* روی "Get the current voltage" تنظیم می کند.
pl: ``@property`` dekorator zamienia metodę :meth:`!voltage` w "getter" dla tylko do odczytu atrybut o tej samej nazwie i ustawia docstring dla *voltage* na "Get the current voltage".

source: A property object has ``getter``, ``setter``, and ``deleter`` methods usable as decorators that create a copy of the property with the corresponding accessor function set to the decorated function. This is best explained with an example:
fa: یک شیء دارای متدهای ``getter``، ``setter``، و ``deleter`` است که می‌توانند به‌عنوان دکوراتور استفاده شوند که یک کپی از ویژگی را با تابع دسترسی مربوطه به تابع تزئین شده ایجاد می‌کنند. این به بهترین شکل با یک مثال توضیح داده می شود:
pl: Obiekt właściwości ma metody ``getter``, ``setter`` i ``deleter`` używane jako dekorator, które tworzą kopię właściwości z odpowiednim akcesorem funkcji ustawionym na dekorowany funkcja. Najlepiej wyjaśnić to na przykładzie:

source: This code is exactly equivalent to the first example. Be sure to give the additional functions the same name as the original property (``x`` in this case.)
fa: این کد دقیقاً معادل مثال اول است. مطمئن شوید که نام توابع اضافی را با ویژگی اصلی (در این مورد ``x``) قرار دهید.
pl: Ten kod jest dokładnie taki sam jak w pierwszym przykładzie. Pamiętaj, aby nadać dodatkowym funkcjom takie same nazwy jak oryginalnej właściwości (w tym przypadku ``x``).

source: The returned property object also has the attributes ``fget``, ``fset``, and ``fdel`` corresponding to the constructor arguments.
fa: شیء ویژگی برگردانده شده نیز دارای ویژگی های ``fget``، ``fset`` و ``fdel`` مربوط به آرگومان های سازنده است.
pl: Zwrócony obiekt właściwości ma również atrybutow ``fget`` , ``fset`` i ``fdel`` odpowiadające konstruktor argumentu.

source: The docstrings of property objects are now writeable.
fa: رشته های اسناد اشیاء ویژگی اکنون قابل نوشتن هستند.
pl: Dokumentacja obiektów właściwości sa teraz zapisywalne.

source: Attribute holding the name of the property. The name of the property can be changed at runtime.
fa: صفت نگهدارنده نام ملک. نام ملک را می توان در زمان اجرا تغییر داد.
pl: Atrybut przechowująca nazwę właściwości. Nazwa właściwości może zostać zmieniona w czasie wykonywania.

source: Rather than being a function, :class:`range` is actually an immutable sequence type, as documented in :ref:`typesseq-range` and :ref:`typesseq`.
fa: :class:`range` به جای اینکه یک تابع باشد، در واقع یک نوع دنباله تغییر ناپذیر است، همانطور که در :ref:`typesseq-range` و :ref:`typesseq` مستند شده است.
pl: Zamiast być funkcja, :class:`range` jest w rzeczywistości niezmiennym typem sekwencji, jak udokumentowano w :ref:`typesseq-range` i :ref:`typesseq`.

source: Return a string containing a printable representation of an object. For many types, this function makes an attempt to return a string that would yield an object with the same value when passed to :func:`eval`; otherwise, the representation is a string enclosed in angle brackets that contains the name of the type of the object together with additional information often including the name and address of the object. A class can control what this function returns for its instances by defining a :meth:`~object.__repr__` method. If :func:`sys.displayhook` is not accessible, this function will raise :exc:`RuntimeError`.
fa: یک رشته حاوی نمایش قابل چاپ یک شی را برگردانید. برای بسیاری از انواع، این تابع تلاش می‌کند تا رشته‌ای را برگرداند که وقتی به :func:`eval` ارسال می‌شود، یک شی با همان مقدار را به دست می‌دهد. در غیر این صورت، نمایش رشته ای است محصور در پرانتزهای زاویه ای که حاوی نام نوع شیء همراه با اطلاعات اضافی اغلب شامل نام و آدرس شیء است. یک کلاس می تواند آنچه را که این تابع برای نمونه هایش برمی گرداند، با تعریف یک متد :meth:`~object.__repr__` کنترل کند. اگر :func:`sys.displayhook` در دسترس نباشد، این تابع :exc:`RuntimeError` را افزایش می دهد.
pl: Zwraca napis zawierający nadającą się do druku reprezentację obiektu. W przypadku wielu typów, ta funkcja podejmuje próbę zwracanja napisu, która dałaby obiekt o tej samej wartości po przekazaniu do :func:`eval`; w przeciwnym razie reprezentacja jest napisem ujęta w nawiasy kątowe, które zawierają nazwę typu obiektu wraz z dodatkowymi informacjami, często zawierającymi nazwę i adres obiektu. Klasa może kontrolować co funkcja zwraca dla swoich instancji, definiując metodę :meth:`~object.__repr__`. Jeśli :func:`sys.displayhook` nie jest dostępna, ta funkcja będzie rzucona :exc:`RuntimeError` .

source: This class has a custom representation that can be evaluated::
fa: این کلاس یک نمایش سفارشی دارد که می توان آن را ارزیابی کرد:
pl: Ta klasa ma niestandardową reprezentację, którą można ocenić::

source: class Person: def __init__(self, name, age): self.name = name self.age = age def __repr__(self): return f"Person('{self.name}', {self.age})"
pl: class Osoba: def __init__(self, imie, wiek): self.imie = imie self.wiek = wiek def __repr__(self): zwracać f "Person('{self.imie}', {self.wiek})".
