Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/functions.po
Languages: fa, pl

source: Return a reverse :term:`iterator`. *seq* must be an object which has a :meth:`~object.__reversed__` method or supports the sequence protocol (the :meth:`~object.__len__` method and the :meth:`~object.__getitem__` method with integer arguments starting at ``0``).
fa: یک :term:`iterator` معکوس را برگردانید. *seq* باید شیئی باشد که دارای متد :meth:`~object.__reversed__` باشد یا از پروتکل توالی پشتیبانی کند (روش :meth:`~object.__len__` و روش :meth:`~object.__getitem__` با آرگومانهای عدد صحیح که از ``0`` شروع می شوند).
pl: Zwraca a reverse :term:`iterator`. *seq* musi być obiektem, który ma metodę :meth:`~object.__reversed__` lub obsługuje protokół sekwencji (metoda :meth:`~object.__len__` i metoda :meth:`~object.__getitem__` z liczba całkowita argument począwszy od ``0``).

source: Return *number* rounded to *ndigits* precision after the decimal point. If *ndigits* is omitted or is ``None``, it returns the nearest integer to its input.
fa: پس از نقطه اعشار، *number* را به دقت *ndigits* گرد کنید. اگر *ndigits* حذف شود یا ``None`` باشد، نزدیکترین عدد صحیح را به ورودی خود برمی گرداند.
pl: Zwraca *liczba* zaokrąglona do *cyfr* po przecinku dziesiętnym. Jeśli *ndigits* zostanie pominięte lub będzie ``None``, to zwraca najbliższa liczbe całkowita wartości wejściowej.

source: For the built-in types supporting :func:`round`, values are rounded to the closest multiple of 10 to the power minus *ndigits*; if two multiples are equally close, rounding is done toward the even choice (so, for example, both ``round(0.5)`` and ``round(-0.5)`` are ``0``, and ``round(1.5)`` is ``2``). Any integer value is valid for *ndigits* (positive, zero, or negative). The return value is an integer if *ndigits* is omitted or ``None``. Otherwise, the return value has the same type as *number*.
fa: برای انواع داخلی که از :func:`round` پشتیبانی می کنند، مقادیر به نزدیکترین مضرب 10 به توان منهای *ndigits* گرد می شوند. اگر دو مضرب به یک اندازه نزدیک باشند، گرد کردن به سمت گزینه زوج انجام می شود (به عنوان مثال, هر دو ``round(0.5)`` و ``round(-0.5)`` ``0`` هستند و ``round(1.5)`` ``2`` هستند). هر مقدار صحیح برای *ndigits* معتبر است (مثبت, صفر یا منفی). مقدار برگشتی یک عدد صحیح است اگر *ndigits* حذف شود یا ``None``. در غیر این صورت، مقدار بازگشتی همان نوع *number* است.
pl: Dla typów wbudowanych wspierających :func:`round`, wartości są zaokrąglane do najbliższej wielokrotności 10 do potęgi minus *ndigits*; jeśli dwie wielokrotności są równie bliskie, zaokrąglanie jest wykonywane w kierunku parzystego wyboru (więc, na przykład, zarówno ``round(0.5)`` jak i ``round(-0.5)`` są ``0``, a ``round(1.5)`` jest ``2``). Każda wartość liczby całkowitej jest ważna dla *cyfr* (dodatnich, zerowych lub ujemnych). zwracana wartość jest liczba całkowita jeśli *ndigits* jest pominięte lub ``None``. W przeciwnym razie zwracana wartość ma ten sam typ co *number*.

source: For a general Python object ``number``, ``round`` delegates to ``number.__round__``.
fa: برای یک شیء عمومی پایتون ``number``، ``round`` به ``number.__round__`` واگذار می شود.
pl: Dla ogólnego obiektu Python ``number`` , ``round`` deleguje do ``number.__round__``.

source: The behavior of :func:`round` for floats can be surprising: for example, ``round(2.675, 2)`` gives ``2.67`` instead of the expected ``2.68``. This is not a bug: it's a result of the fact that most decimal fractions can't be represented exactly as a float. See :ref:`tut-fp-issues` for more information.
fa: رفتار :func:`round` برای شناورها می تواند تعجب آور باشد: به عنوان مثال، ``round(2.675, 2)`` به جای ``2.68`` مورد انتظار، ``2.67`` را می دهد. این یک اشکال نیست: نتیجه این واقعیت است که اکثر کسرهای اعشاری نمی توانند دقیقاً به عنوان یک شناور نمایش داده شوند. برای اطلاعات بیشتر به :ref:`tut-fp-issues` مراجعه کنید.
pl: Zachowanie :func:`round` dla zmiennoprzecinkowych może być zaskakujący: na przykład, ``round(2.675, 2)`` daje ``2.67`` zamiast oczekiwanego ``2.68``. Nie jest to błąd: wynika to z faktu, że większość ułamków dziesiętnych nie może być reprezentowana dokładnie jako liczba zmiennoprzecinkowa. Więcej informacji można znaleźć na stronie :ref:`tut-fp-issues`.

source: Return a new :class:`set` object, optionally with elements taken from *iterable*. ``set`` is a built-in class. See :class:`set` and :ref:`types-set` for documentation about this class.
fa: یک شی :class:`set` جدید، به صورت اختیاری با عناصر گرفته شده از *iterable* برگردانید. ``set`` یک کلاس داخلی است. برای مستندات مربوط به این کلاس به :class:`set` و :ref:`types-set` مراجعه کنید.
pl: Zwraca nowy obiekt :class:`set`, opcjonalnie z elementami pobranymi z *iterable*. ``set`` jest klasą wbudowana. Dokumentacja dotycząca tej klasy znajduje się na stronach :class:`set` i :ref:`types-set`.

source: For other containers see the built-in :class:`frozenset`, :class:`list`, :class:`tuple`, and :class:`dict` classes, as well as the :mod:`collections` module.
fa: برای سایر کانتینرها به کلاس های داخلی :class:`frozenset`، :class:`list`، :class:`tuple` و :class:`dict` و همچنین ماژول :mod:`collections` مراجعه کنید.
pl: Dla innych kontenerów zobacz klasy wbudowane :class:`frozenset` , :class:`list`, :class:`tuple` i :class:`dict`, jak również :mod:`collections` moduł .

source: This is the counterpart of :func:`getattr`. The arguments are an object, a string, and an arbitrary value. The string may name an existing attribute or a new attribute. The function assigns the value to the attribute, provided the object allows it. For example, ``setattr(x, 'foobar', 123)`` is equivalent to ``x.foobar = 123``.
fa: این همتای :func:`getattr` است. آرگومان ها یک شی، یک رشته و یک مقدار دلخواه هستند. رشته ممکن است یک ویژگی موجود یا یک ویژگی جدید را نامگذاری کند. تابع مقدار را به ویژگی اختصاص می دهد، مشروط بر اینکه شی اجازه دهد. به عنوان مثال، ``setattr(x, 'foobar', 123)`` معادل ``x.foobar = 123`` است.
pl: Jest to odpowiednik :func:`getattr`. Argumenty to obiekt, napis i dowolna wartość. Napis może nazywać istniejący atrybut lub nowy atrybut. Funkcja przypisuje wartość do atrybut, pod warunkiem, że obiekt na to pozwala. Na przykład, ``setattr(x, 'foobar', 123)`` jest równoważne ``x.foobar = 123``.

source: *name* need not be a Python identifier as defined in :ref:`identifiers` unless the object chooses to enforce that, for example in a custom :meth:`~object.__getattribute__` or via :attr:`~object.__slots__`. An attribute whose name is not an identifier will not be accessible using the dot notation, but is accessible through :func:`getattr` etc..
fa: *name* لازم نیست یک شناسه پایتون همانطور که در :ref:`identifiers` تعریف شده است باشد، مگر اینکه شیء بخواهد آن را اعمال کند، برای مثال در یک :meth:`~object.__getattribute__` سفارشی یا از طریق :attr:`~object.__slots__`. مشخصه ای که نام آن شناسه نیست با استفاده از علامت نقطه قابل دسترسی نخواهد بود، اما از طریق :func:`getattr` و غیره قابل دسترسی است.
pl: *name* nie musi być identyfikatorem Pythona zdefiniowanym w :ref:`identifiers`, chyba że obiekt zdecyduje się to wymusić, na przykład w niestandardowym :meth:`~object.__getattribute__` lub poprzez :attr:`~object.__slots__`. Obiekt atrybut, którego nazwa nie jest identyfikatorem, nie będzie dostępny przy użyciu notacji kropkowej, ale będzie dostępny za pośrednictwem :func:`getattr` itd.

source: Since :ref:`private name mangling <private-name-mangling>` happens at compilation time, one must manually mangle a private attribute's (attributes with two leading underscores) name in order to set it with :func:`setattr`.
fa: از آنجایی که :ref:`private name mangling <private-name-mangling>` در زمان کامپایل اتفاق می افتد، باید به صورت دستی نام یک ویژگی خصوصی (ویژگی ها با دو خط زیر خط اصلی) را به منظور تنظیم آن با :func:`setattr` تغییر دهید.
pl: Ponieważ :ref:`mangling nazwy prywatnej <private-name-mangling>` ma miejsce w czasie kompilacji, należy ręcznie zmienić nazwę prywatnego atrybutu (atrybut z dwoma wiodącymi podkreśleniami), aby ustawić ją z :func:`setattr`.

source: Return a :term:`slice` object representing the set of indices specified by ``range(start, stop, step)``. The *start* and *step* arguments default to ``None``.
fa: یک شی :term:`slice` که مجموعه ای از شاخص های مشخص شده توسط ``range(start, stop, step)`` را نشان می دهد، برگردانید. آرگومان های *start* و *step* به طور پیش فرض ``None`` هستند.
pl: Zwraca obiekt :term:`slice` reprezentujący zbiór indeksów określonych przez ``range(start, stop, step)``. *start* i *step* argumenty domyślne do ``None``.

source: Slice objects have read-only data attributes :attr:`!start`, :attr:`!stop`, and :attr:`!step` which merely return the argument values (or their default). They have no other explicit functionality; however, they are used by NumPy and other third-party packages.
fa: اشیاء Slice دارای ویژگی های داده فقط خواندنی :attr:`!start`، :attr:`!stop` و :attr:`!step` هستند که صرفاً مقادیر آرگومان (یا پیش فرض آنها) را برمی گرداند. آنها هیچ عملکرد صریح دیگری ندارند. با این حال، آنها توسط NumPy و سایر بسته های شخص ثالث استفاده می شوند.
pl: Obiekty slice mają dane tylko do odczytu atrybut :attr:`!start` , :attr:`!stop` i :attr:`!step`, które jedynie zwracać wartości argument (lub ich domyślny). Nie mają one żadnej innej wyraźnej funkcjonalności; są jednak używane przez NumPy i inne pakiety innych firm.

source: Slice objects are also generated when extended indexing syntax is used. For example: ``a[start:stop:step]`` or ``a[start:stop, i]``. See :func:`itertools.islice` for an alternate version that returns an :term:`iterator`.
fa: هنگامی که از نحو نمایه سازی توسعه یافته استفاده می شود، اشیاء برش نیز تولید می شوند. به عنوان مثال: ``a[start:stop:step]`` یا ``a[start:stop, i]``. برای نسخه جایگزینی که :term:`iterator` را برمی گرداند به :func:`itertools.islice` مراجعه کنید.
pl: Obiekty Slice są również generowane, gdy używana jest rozszerzona składnia indeksowania. Na przykład: ``a[start:stop:step]`` lub ``a[start:stop, i]``. Zobacz :func:`itertools.islice` dla alternatywy, która zwraca :term:`iterator`.

source: Slice objects are now :term:`hashable` (provided :attr:`~slice.start`, :attr:`~slice.stop`, and :attr:`~slice.step` are hashable).
fa: اشیاء Slice اکنون :term:`hashable` هستند (به شرطی که :attr:`~slice.start`, :attr:`~slice.stop` و :attr:`~slice.step` قابل هش باشند).
pl: Obiekty Slice są teraz :term:`hashable` (pod warunkiem, że :attr:`~slice.start`, :attr:`~slice.stop` i :attr:`~slice.step` są hashable).

source: Return a new sorted list from the items in *iterable*.
fa: یک لیست مرتب شده جدید از موارد موجود در *iterable* برگردانید.
pl: Zwraca nową posortowaną listę z elementów w *iterable*.

source: Has two optional arguments which must be specified as keyword arguments.
fa: دارای دو آرگومان اختیاری است که باید به عنوان آرگومان کلمه کلیدی مشخص شوند.
pl: Posiada dwa opcjonalne argumenty, które muszą być określone jako argument nazwany.

source: *key* specifies a function of one argument that is used to extract a comparison key from each element in *iterable* (for example, ``key=str.lower``). The default value is ``None`` (compare the elements directly).
fa: *key* تابعی از یک آرگومان را مشخص می کند که برای استخراج یک کلید مقایسه از هر عنصر در *iterable* (مثلا ``key=str.lower``) استفاده می شود. مقدار پیش فرض ``None`` است (عناصر را مستقیماً مقایسه کنید).
pl: *key* określa funkcje jednego argumentu, który jest używany do wyodrębnienia klucza porównania z każdego elementu w *iterable* (na przykład ``key=str.lower``). Wartość domyślna to ``None`` (bezpośrednie porównanie elementów).

source: *reverse* is a boolean value. If set to ``True``, then the list elements are sorted as if each comparison were reversed.
fa: *reverse* یک مقدار بولی است. اگر روی ``True`` تنظیم شود، عناصر لیست طوری مرتب می شوند که گویی هر مقایسه معکوس شده است.
pl: *reverse* jest wartością logiczną. Jeśli jest ustawiona na ``True``, elementy listy są sortowane tak, jakby każde porównanie było odwrócone.

source: Use :func:`functools.cmp_to_key` to convert an old-style *cmp* function to a *key* function.
fa: از :func:`functools.cmp_to_key` برای تبدیل تابع قدیمی *cmp* به تابع *key* استفاده کنید.
pl: Użyj :func:`functools.cmp_to_key` do konwersji starego stylu *cmp* funkcja na *key* funkcja.

source: The built-in :func:`sorted` function is guaranteed to be stable. A sort is stable if it guarantees not to change the relative order of elements that compare equal --- this is helpful for sorting in multiple passes (for example, sort by department, then by salary grade).
fa: عملکرد داخلی :func:`sorted` تضمین شده است که پایدار است. مرتب‌سازی پایدار است اگر تضمین کند که ترتیب نسبی عناصری که با هم مقایسه می‌شوند تغییر نمی‌کند --- این برای مرتب‌سازی در چند پاس مفید است (مثلاً مرتب‌سازی بر اساس بخش, سپس بر اساس درجه حقوق).
pl: Wbudowana :func:`sorted` funkcja ma gwarancję stabilności. Sortowanie jest stabilne, jeśli gwarantuje, że nie zmieni względnej kolejności elementów, które porównują równe --- jest to pomocne przy sortowaniu w wielu przejściach (na przykład sortowanie według działu, a następnie według kategorii wynagrodzenia).

source: The sort algorithm uses only ``<`` comparisons between items. While defining an :meth:`~object.__lt__` method will suffice for sorting, :PEP:`8` recommends that all six :ref:`rich comparisons <comparisons>` be implemented. This will help avoid bugs when using the same data with other ordering tools such as :func:`max` that rely on a different underlying method. Implementing all six comparisons also helps avoid confusion for mixed type comparisons which can call reflected the :meth:`~object.__gt__` method.
fa: الگوریتم مرتب سازی فقط از مقایسه ``<`` بین موارد استفاده می کند. در حالی که تعریف یک روش :meth:`~object.__lt__` برای مرتب سازی کافی است، :PEP:`8` توصیه می کند که هر شش :ref:`rich comparisons <comparisons>` پیاده سازی شود. این به جلوگیری از اشکالات هنگام استفاده از داده های مشابه با سایر ابزارهای سفارش مانند :func:`max` کمک می کند که به روش اساسی متفاوتی متکی هستند. اجرای هر شش مقایسه همچنین به جلوگیری از سردرگمی برای مقایسه‌های نوع مختلط کمک می‌کند که می‌تواند روش :meth:`~object.__gt__` را منعکس کند.
pl: Algorytm sortowania używa tylko porównań ``<`` między elementami. Podczas gdy zdefiniowanie metoda :meth:`~object.__lt__` wystarczy do sortowania, :PEP:`8` zaleca zaimplementowanie wszystkich sześciu :ref:`bogatych porównań <comparisons>`. Pomoże to uniknąć błędów podczas korzystania z tych samych danych z innymi narzędziami porządkującymi, takimi jak :func:`max`, które opierają się na innej metodzie bazowej. Zaimplementowanie wszystkich sześciu porównań pomaga również uniknąć nieporozumień w przypadku porównań typów mieszanych, które mogą wywoływać metodę :meth:`~object.__gt__`.

source: For sorting examples and a brief sorting tutorial, see :ref:`sortinghowto`.
fa: برای نمونه‌های مرتب‌سازی و یک آموزش مختصر مرتب‌سازی، به :ref:`sortinghowto` مراجعه کنید.
pl: Przykłady sortowania i krótki samouczek sortowania można znaleźć na stronie :ref:`sortinghowto`.

source: Transform a method into a static method.
fa: تبدیل یک روش به روش ایستا
pl: Przekształcenie metody w metodę statyczną.

source: A static method does not receive an implicit first argument. To declare a static method, use this idiom::
fa: یک روش استاتیک یک آرگومان اولیه ضمنی را دریافت نمی کند. برای اعلام یک متد استاتیک، از این اصطلاح استفاده کنید:
pl: Metoda statyczna nie otrzymuje niejawnego pierwszego argumentu. Aby zadeklarować metodę statyczną, użyj tego idiomu::

source: The ``@staticmethod`` form is a function :term:`decorator` -- see :ref:`function` for details.
fa: فرم ``@staticmethod`` یک تابع :term:`decorator` است -- برای جزئیات به :ref:`function` مراجعه کنید.
pl: Forma ``@staticmethod`` to :term:`dekorator` funkcji -- zobacz :ref:`function` po szczegóły.

source: A static method can be called either on the class (such as ``C.f()``) or on an instance (such as ``C().f()``). Moreover, the static method :term:`descriptor` is also callable, so it can be used in the class definition (such as ``f()``).
fa: یک متد استاتیک را می توان بر روی کلاس (مانند ``C.f()``) یا بر روی یک نمونه (مانند ``C().f()``) فراخوانی کرد. علاوه بر این، روش استاتیک :term:`descriptor` نیز قابل فراخوانی است، بنابراین می توان از آن در تعریف کلاس (مانند ``f()``) استفاده کرد.
pl: Metoda statyczna może być wywołana na klasie (np. ``C.f()``) lub na instancji (np. ``C().f()``). Co więcej, metoda statyczna :term:`descriptor` jest również wywoływalna, więc może być użyta w definicja klasy (np. ``f()``).

source: Static methods in Python are similar to those found in Java or C++. Also, see :func:`classmethod` for a variant that is useful for creating alternate class constructors.
fa: روش‌های استاتیک در پایتون شبیه به روش‌های موجود در جاوا یا سی پلاس پلاس است. همچنین، :func:`classmethod` را برای گونه‌ای که برای ایجاد سازنده‌های کلاس جایگزین مفید است، ببینید.
pl: Metody statyczne w Python są podobne do tych, które można znaleźć w Java lub C++. Zobacz także :func:`classmethod`, aby zapoznać się z wariantem, który jest przydatny do tworzenia alternatywnych konstruktorów klas.

source: Like all decorators, it is also possible to call ``staticmethod`` as a regular function and do something with its result. This is needed in some cases where you need a reference to a function from a class body and you want to avoid the automatic transformation to instance method. For these cases, use this idiom::
fa: مانند تمام دکوراتورها، می توان ``staticmethod`` را به عنوان یک عملکرد معمولی فراخوانی کرد و با نتیجه آن کاری انجام داد. این در برخی موارد مورد نیاز است که در آن به یک تابع از بدنه کلاس نیاز دارید و می خواهید از تبدیل خودکار به روش نمونه اجتناب کنید. برای این موارد از این اصطلاح استفاده کنید::
pl: Podobnie jak wszystkie dekoratory, możliwe jest również wywołanie ``staticmethod`` jako zwykłoł funkcje i zrobienie czegoś z jego wynikiem. Jest to potrzebne w niektórych przypadkach, gdy potrzebujesz odniesienia do funkcji z ciałej klasy i chcesz uniknąć automatycznej transformacji do metody instancji. W takich przypadkach należy użyć tego idiomu::

source: def regular_function(): ... class C: method = staticmethod(regular_function)
pl: def standardowa_funkcja(): ... class C: methoda = staticmethod(standardowa_funkcja)

source: For more information on static methods, see :ref:`types`.
fa: برای اطلاعات بیشتر در مورد روش های استاتیک، به :ref:`types` مراجعه کنید.
pl: Więcej informacji na temat metod statycznych można znaleźć na stronie :ref:`types`.

source: Static methods now inherit the method attributes (:attr:`~function.__module__`, :attr:`~function.__name__`, :attr:`~function.__qualname__`, :attr:`~function.__doc__` and :attr:`~function.__annotations__`), have a new ``__wrapped__`` attribute, and are now callable as regular functions.
fa: روش‌های استاتیک اکنون ویژگی‌های متد (:attr:`~function.__module__`, :attr:`~function.__name__`, :attr:`~function.__qualname__`, :attr:`~function.__doc__` و :attr:`~function.__annotations__`) را به ارث می‌برند، یک ویژگی ``__wrapped__`` جدید دارند و اکنون به عنوان توابع معمولی قابل فراخوانی هستند.
pl: Metody statyczne dziedziczą teraz metodę atrybut (:attr:`~function.__module__`, :attr:`~function.__name__`, :attr:`~function.__qualname__`, :attr:`~function.__doc__` i :attr:`~function.__annotations__`), mają nową ``__wrapped__`` atrybut i są teraz wywoływane jako zwykła funkcja.

source: Return a :class:`str` version of *object*. See :func:`str` for details.
fa: یک نسخه :class:`str` از *object* را برگردانید. برای جزئیات بیشتر به :func:`str` مراجعه کنید.
pl: Zwraca :class:`str` wersja of *object*. Szczegółowe informacje można znaleźć na stronie :func:`str`.

source: ``str`` is the built-in string :term:`class`. For general information about strings, see :ref:`textseq`.
fa: ``str`` رشته داخلی :term:`class` است. برای اطلاعات کلی در مورد رشته ها، به :ref:`textseq` مراجعه کنید.
pl: ``str`` jest wbudowanem napisem :term:`class`. Aby uzyskać ogólne informacje na temat napisow, zobacz :ref:`textseq`.

source: Sums *start* and the items of an *iterable* from left to right and returns the total. The *iterable*'s items are normally numbers, and the start value is not allowed to be a string.
fa: *start* و موارد یک *iterable* را از چپ به راست جمع می کند و کل را برمی گرداند. موارد *iterable* معمولاً اعداد هستند و مقدار شروع مجاز نیست که یک رشته باشد.
pl: Sumuje *start* i elementy *iterable* od lewej do prawej i zwraca sumę. Elementy *iterable* są zwykle liczbami, a wartością początkową nie może być napisem.

source: For some use cases, there are good alternatives to :func:`sum`. The preferred, fast way to concatenate a sequence of strings is by calling ``''.join(sequence)``. To add floating-point values with extended precision, see :func:`math.fsum`\. To concatenate a series of iterables, consider using :func:`itertools.chain`.
fa: برای برخی موارد استفاده، جایگزین های خوبی برای :func:`sum` وجود دارد. راه سریع و ترجیحی برای الحاق یک دنباله از رشته ها، فراخوانی ``''.join(sequence)`` است. برای افزودن مقادیر ممیز شناور با دقت بیشتر، به :func:`math.fsum`\ مراجعه کنید. برای الحاق یک سری تکرارپذیر، از :func:`itertools.chain` استفاده کنید.
pl: W niektórych przypadkach istnieją dobra alternatywa dla :func:`sum`. Preferowanym, szybkim sposobem na łączyć sekwencji napisów jest wywołanie ``''.join(sequence)``. Aby dodać wartości zmiennoprzecinkowe z rozszerzoną precyzją, zobacz :func:`math.fsum`\. Aby łączyć serię iterable, należy rozważyć użycie :func:`itertools.chain`.

source: The *start* parameter can be specified as a keyword argument.
fa: پارامتر *start* را می توان به عنوان آرگومان کلمه کلیدی تعیین کرد.
pl: Parametr *start* można określić jako argument nazwany.

source: Summation of floats switched to an algorithm that gives higher accuracy and better commutativity on most builds.
fa: مجموع شناورها به الگوریتمی تبدیل شده است که دقت بالاتر و جابجایی بهتری را در اکثر ساخت‌ها ارائه می‌دهد.
pl: Sumowanie zmiennoprzecinkowe zostało przełączone na algorytm, który zapewnia większą dokładność i lepszą przemienność w większości kompilacji.

source: Return a proxy object that delegates method calls to a parent or sibling class of *type*. This is useful for accessing inherited methods that have been overridden in a class.
fa: یک شیء پراکسی را که فراخوانی های متد را به کلاس والد یا خواهر و برادر *type* واگذار می کند، برگردانید. این برای دسترسی به متدهای ارثی که در یک کلاس رد شده اند مفید است.
pl: Zwraca obiekt proxy, który deleguje wywołania metod do klasy nadrzędnej lub rodzeństwa *type*. Jest to przydatne do uzyskiwania dostępu do odziedziczonych metod, które zostały przesłonięte w klasie.

source: The *object_or_type* determines the :term:`method resolution order` to be searched. The search starts from the class right after the *type*.
fa: *object_or_type* :term:`method resolution order` مورد جستجو را تعیین می کند. جستجو از کلاس درست بعد از *type* شروع می شود.
pl: *object_or_type* określa :term:`method resolution order` do przeszukania. Wyszukiwanie rozpoczyna się od klasy zaraz po *type*.

source: For example, if :attr:`~type.__mro__` of *object_or_type* is ``D -> B -> C -> A -> object`` and the value of *type* is ``B``, then :func:`super` searches ``C -> A -> object``.
fa: به عنوان مثال، اگر :attr:`~type.__mro__` از *object_or_type* ``D -> B -> C -> A -> object`` و مقدار *type* ``B`` باشد، :func:`super` ``C -> A -> object`` را جستجو می کند.
pl: Na przykład, jeśli :attr:`~type.__mro__` z *object_or_type* jest ``D -> B -> C -> A -> object`` i wartość *type* jest ``B``, to :func:`super` wyszukuje ``C -> A -> object``.
