Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/functions.po
Languages: fa, pl

source: The left-to-right evaluation order of the iterables is guaranteed. This makes possible an idiom for clustering a data series into n-length groups using ``zip(*[iter(s)]*n, strict=True)``. This repeats the *same* iterator ``n`` times so that each output tuple has the result of ``n`` calls to the iterator. This has the effect of dividing the input into n-length chunks.
fa: ترتیب ارزیابی از چپ به راست تکرارپذیرها تضمین شده است. این یک اصطلاح را برای خوشه‌بندی یک سری داده در گروه‌های طول n با استفاده از ``zip(*[iter(s)]*n, strict=True)`` ممکن می‌سازد. این کار تکرار *same* ``n`` را بارها تکرار می کند تا هر تاپل خروجی نتیجه فراخوانی ``n`` را به تکرار کننده داشته باشد. این اثر تقسیم ورودی به تکه های n طول دارد.
pl: Kolejność oceny od lewej do prawej strony iterable jest gwarantowana. Umożliwia to idiom grupowania serii danych w grupy o długości n przy użyciu ``zip(*[iter(s)]*n, strict=True)``. Powtarza to *tę samą* iterator ``n`` razy, tak że każde wyjście krotka ma wynik wywołań ``n`` do iteratora. Powoduje to podzielenie danych wejściowych na fragmenty o długości n.

source: :func:`zip` in conjunction with the ``*`` operator can be used to unzip a list::
fa: :func:`zip` در ارتباط با اپراتور ``*`` می تواند برای باز کردن یک لیست استفاده شود::
pl: :func:`zip` w połączeniu z operatorem ``*`` może być użyty do rozpakowania listy::

source: Added the ``strict`` argument.
fa: آرگومان ``strict`` اضافه شد.
pl: Dodano argument ``strict`` .

source: This is an advanced function that is not needed in everyday Python programming, unlike :func:`importlib.import_module`.
fa: این یک تابع پیشرفته است که برخلاف :func:`importlib.import_module` در برنامه نویسی روزمره پایتون مورد نیاز نیست.
pl: Jest to zaawansowana funkcja, która nie jest potrzebna w codziennym programowaniu Pythona, w przeciwieństwie do :func:`importlib.import_module`.

source: This function is invoked by the :keyword:`import` statement. It can be replaced (by importing the :mod:`builtins` module and assigning to ``builtins.__import__``) in order to change semantics of the :keyword:`!import` statement, but doing so is **strongly** discouraged as it is usually simpler to use import hooks (see :pep:`302`) to attain the same goals and does not cause issues with code which assumes the default import implementation is in use. Direct use of :func:`__import__` is also discouraged in favor of :func:`importlib.import_module`.
fa: این تابع توسط دستور :keyword:`import` فراخوانی می شود. می توان آن را جایگزین کرد (با وارد کردن ماژول :mod:`builtins` و تخصیص به ``builtins.__import__``) به منظور تغییر معنایی دستور :keyword:`!import`، اما انجام این کار **strongly** منع می شود زیرا معمولاً استفاده از قلاب های واردات ساده تر است (به :pep:`302` مراجعه کنید) برای دستیابی به اهداف مشابه و باعث ایجاد مشکلاتی در پیاده سازی پیش فرض نمی شود. استفاده مستقیم از :func:`__import__` نیز به نفع :func:`importlib.import_module` منع شده است.
pl: Ten funkcja jest wywoływany przez :keyword:`import` instrukcja . Można go zastąpić (importując :mod:`builtins` moduł i przypisując do ``builtins.__import__``) w celu zmiany semantyki :keyword:`!import` instrukcja , ale jest to **bardżo** odradzane, ponieważ zwykle prostsze jest użycie haków importu (zobacz :pep:`302`), aby osiągnąć te same cele i nie powoduje problemów z kodem, który zakłada, że implementacja importu domyślny jest w użyciu. Bezpośrednie użycie :func:`__import__` jest również odradzane na korzyść :func:`importlib.import_module`.

source: The function imports the module *name*, potentially using the given *globals* and *locals* to determine how to interpret the name in a package context. The *fromlist* gives the names of objects or submodules that should be imported from the module given by *name*. The standard implementation does not use its *locals* argument at all and uses its *globals* only to determine the package context of the :keyword:`import` statement.
fa: این تابع، ماژول *name* را وارد می کند، به طور بالقوه از *globals* و *locals* داده شده برای تعیین نحوه تفسیر نام در زمینه بسته استفاده می کند. *fromlist* نام اشیا یا زیر ماژول هایی را می دهد که باید از ماژول ارائه شده توسط *name* وارد شوند. پیاده سازی استاندارد به هیچ وجه از آرگومان *locals* خود استفاده نمی کند و از *globals* خود فقط برای تعیین بافت بسته دستور :keyword:`import` استفاده می کند.
pl: Funkcja importuje moduł *name*, potencjalnie używając podanych *globals* i *locals* do określenia, jak interpretować nazwę w kontekście pakietu. *fromlist* podaje nazwy obiektów lub submodułów, które powinny zostać zaimportowane z moduł podanego przez *name*. Standardowa implementacja nie używa *locals* argumentu w ogóle i używa *globals* tylko do określenia kontekstu pakietu :keyword:`import` instrukcja .

source: *level* specifies whether to use absolute or relative imports. ``0`` (the default) means only perform absolute imports. Positive values for *level* indicate the number of parent directories to search relative to the directory of the module calling :func:`__import__` (see :pep:`328` for the details).
fa: *level* مشخص می کند که آیا از واردات مطلق یا نسبی استفاده شود. ``0`` (پیش‌فرض) به این معنی است که فقط واردات مطلق را انجام دهید. مقادیر مثبت *level* تعداد دایرکتوری‌های والد را نشان می‌دهد که نسبت به دایرکتوری ماژول فراخوانی :func:`__import__` هستند (برای جزئیات به :pep:`328` مراجعه کنید).
pl: *level* określa, czy ma być używany import bezwzględny czy względny. ``0`` (domyślnie) oznacza tylko import bezwzględny. Dodatnie wartości dla *level* wskazują liczbę katalogów nadrzędnych do przeszukania względem katalogu moduł wywołującego :func:`__import__` (zobacz :pep:`328` dla szczegółów).

source: When the *name* variable is of the form ``package.module``, normally, the top-level package (the name up till the first dot) is returned, *not* the module named by *name*. However, when a non-empty *fromlist* argument is given, the module named by *name* is returned.
fa: هنگامی که متغیر *name* به شکل ``package.module`` باشد، معمولاً بسته سطح بالا (نام تا اولین نقطه) برگردانده می شود، ماژول *not* که توسط *name* نامگذاری شده است. با این حال، هنگامی که یک آرگومان غیر خالی *fromlist* داده می شود، ماژول نام گذاری شده توسط *name* برگردانده می شود.
pl: Gdy zmienna *name* ma postać ``package.module``, zwykle zwracany jest pakiet najwyższego poziomu (nazwa do pierwszej kropki), *nie* moduł nazwany przez *name*. Jednakże, gdy podana jest niepusta *fromlist* argument, zwracany jest moduł nazwany przez *name*.

source: For example, the statement ``import spam`` results in bytecode resembling the following code::
fa: به عنوان مثال، عبارت ``import spam`` منجر به بایت کد مشابه کد زیر می شود:
pl: Na przykład, instrukcja ``import spam`` skutkuje kodem bajtowym przypominającym następujący kod::

source: The statement ``import spam.ham`` results in this call::
fa: عبارت ``import spam.ham`` در این فراخوانی نتیجه می گیرد:
pl: Instrukcja ``import spam.ham`` skutkuje następującym połączeniem::

source: Note how :func:`__import__` returns the toplevel module here because this is the object that is bound to a name by the :keyword:`import` statement.
fa: توجه داشته باشید که چگونه :func:`__import__` ماژول سطح بالا را در اینجا برمی گرداند زیرا این شیئی است که توسط دستور :keyword:`import` به یک نام محدود می شود.
pl: Zauważ, że :func:`__import__` zwraca toplevel moduł tutaj, ponieważ jest to obiekt, który jest powiązany z nazwą przez :keyword:`import` instrukcje .

source: On the other hand, the statement ``from spam.ham import eggs, sausage as saus`` results in ::
fa: از سوی دیگر، عبارت ``from spam.ham import eggs, sausage as saus`` به صورت زیر است:
pl: Z drugiej strony, instrukcja ``from spam.ham import eggs, sausage as saus`` skutkuje ::

source: Here, the ``spam.ham`` module is returned from :func:`__import__`. From this object, the names to import are retrieved and assigned to their respective names.
fa: در اینجا، ماژول ``spam.ham`` از :func:`__import__` برگردانده می شود. از این شی، نام‌هایی که وارد می‌شوند بازیابی می‌شوند و به نام‌های مربوطه تخصیص می‌یابند.
pl: Tutaj obiekt ``spam.ham`` jest zwracany z :func:`__import__`. Z tego obiektu pobierane są nazwy do zaimportowania i przypisywane do odpowiednich nazw.

source: If you simply want to import a module (potentially within a package) by name, use :func:`importlib.import_module`.
fa: اگر به سادگی می خواهید یک ماژول (به طور بالقوه در یک بسته) را با نام وارد کنید، از :func:`importlib.import_module` استفاده کنید.
pl: Jeśli chcesz po prostu zaimportować moduł (potencjalnie w ramach pakietu) według nazwy, użyj :func:`importlib.import_module`.

source: Negative values for *level* are no longer supported (which also changes the default value to 0).
fa: مقادیر منفی برای *level* دیگر پشتیبانی نمی شود (که همچنین مقدار پیش فرض را به 0 تغییر می دهد).
pl: Ujemne wartości dla *level* nie są już obsługiwane (co również zmienia wartość domyślny na 0).

source: When the command line options :option:`-E` or :option:`-I` are being used, the environment variable :envvar:`PYTHONCASEOK` is now ignored.
fa: هنگامی که از گزینه های خط فرمان :option:`-E` یا :option:`-I` استفاده می شود، متغیر محیطی :envvar:`PYTHONCASEOK` اکنون نادیده گرفته می شود.
pl: Gdy używane są opcje wiersza poleceń :option:`-E` lub :option:`-I`, opcja zmienna środowiskowa :envvar:`PYTHONCASEOK` jest teraz ignorowana.

source: Footnotes
fa: پاورقی ها
pl: Przypisy

source: Note that the parser only accepts the Unix-style end of line convention. If you are reading the code from a file, make sure to use newline conversion mode to convert Windows or Mac-style newlines.
fa: توجه داشته باشید که تجزیه کننده فقط قرارداد پایان خط به سبک یونیکس را می پذیرد. اگر در حال خواندن کد از یک فایل هستید، مطمئن شوید که از حالت تبدیل خط جدید برای تبدیل خطوط جدید به سبک ویندوز یا مک استفاده کنید.
pl: Zwróć uwagę, że parser akceptuje tylko Unixowy styl końca linii. Jeśli wczytujesz kod z pliku, wykorzystaj konwersję linii aby przekonwertować style końca linii Winows albo Mac.

source: Boolean
fa: بولی
pl: Wartość logiczna

source: type
fa: نوع
pl: typ

source: built-in function
fa: عملکرد داخلی
pl: funkcja wbudowana

source: Infinity
fa: بی نهایت
pl: Nieskończoność

source: string
fa: رشته
pl: ciąg znaków

source: format() (built-in function)
fa: format() (تابع داخلی)
pl: format() (wbudowana funkcja)

source: file object
fa: شی فایل
pl: obiekt plik

source: open() built-in function
fa: تابع داخلی open().
pl: open() wbudowana funkcja

source: file
fa: فایل
pl: plik

source: modes
fa: حالت ها
pl: tryby

source: universal newlines
fa: خطوط جدید جهانی
pl: uniwersalne nowe linie

source: line-buffered I/O
fa: ورودی/خروجی بافر خطی
pl: Buforowane liniowo I/O

source: unbuffered I/O
fa: ورودی/خروجی بافر نشده
pl: niebuforowane I/O

source: buffer size, I/O
fa: اندازه بافر، ورودی/خروجی
pl: rozmiar bufora, I/O

source: I/O control
fa: کنترل I/O
pl: Kontrola I/O

source: buffering
fa: بافر کردن
pl: buforowanie

source: text mode
fa: حالت متنی
pl: tryb tekstowy

source: module
fa: ماژول
pl: moduł

source: str() (built-in function)
fa: str() (تابع داخلی)
pl: str() (wbudowana funkcja)

source: object
fa: شی
pl: obiekt

source: statement
fa: بیانیه
pl: instrukcja

source: exec
fa: اجرایی

source: sys
fa: سیستم

source: import
fa: واردات

source: builtins
fa: سازه ها
