Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/functions.po
Languages: fa, pl

source: Take two (non-complex) numbers as arguments and return a pair of numbers consisting of their quotient and remainder when using integer division. With mixed operand types, the rules for binary arithmetic operators apply. For integers, the result is the same as ``(a // b, a % b)``. For floating-point numbers the result is ``(q, a % b)``, where *q* is usually ``math.floor(a / b)`` but may be 1 less than that. In any case ``q * b + a % b`` is very close to *a*, if ``a % b`` is non-zero it has the same sign as *b*, and ``0 <= abs(a % b) < abs(b)``.
fa: دو عدد (غیر مختلط) را به عنوان آرگومان در نظر بگیرید و هنگام استفاده از تقسیم اعداد صحیح، یک جفت اعداد متشکل از ضریب و باقیمانده آنها را برگردانید. با انواع عملوند مختلط، قوانین عملگرهای حسابی باینری اعمال می شود. برای اعداد صحیح، نتیجه مشابه ``(a // b, a % b)`` است. برای اعداد ممیز شناور، نتیجه ``(q, a % b)`` است، که در آن *q* معمولاً ``math.floor(a / b)`` است اما ممکن است 1 کمتر از آن باشد. در هر صورت ``q * b + a % b`` بسیار نزدیک به *a* است، اگر ``a % b`` غیر صفر باشد همان علامت *b* و ``0 <= abs(a % b) < abs(b)`` را دارد.
pl: Weź dwie (niezłożone) liczby jako argumenty i zwraca parę liczb składającą się z ich ilorazu i reszty, gdy używasz liczba całkowita dzielenia. W przypadku mieszanych typów operandów obowiązują reguły dla binarnych operatorów arytmetycznych. Dla liczb całkowitych wynik jest taki sam jak ``(a // b, a % b)``. Dla liczb zmiennoprzecinkowych wynikiem jest ``(q, a % b)``, gdzie *q* jest zwykle ``math.floor(a / b)``, ale może być o 1 mniejsze. W każdym przypadku ``q * b + a % b`` jest bardzo zbliżone do *a*, jeśli ``a % b`` jest niezerowe, to ma taki sam znak jak *b* i ``0 <= abs(a % b) < abs(b)``.

source: Return an enumerate object. *iterable* must be a sequence, an :term:`iterator`, or some other object which supports iteration. The :meth:`~iterator.__next__` method of the iterator returned by :func:`enumerate` returns a tuple containing a count (from *start* which defaults to 0) and the values obtained from iterating over *iterable*.
fa: یک شئ enumerate را برگردانید. *iterable* باید یک دنباله، یک :term:`iterator` یا شیء دیگری باشد که از تکرار پشتیبانی می کند. متد :meth:`~iterator.__next__` تکرارکننده که توسط :func:`enumerate` برگردانده شده است یک تاپل حاوی یک شمارش (از *start* که به طور پیش فرض روی 0 است) و مقادیر به دست آمده از تکرار بر روی *iterable* را برمی گرداند.
pl: Zwraca obiekt wyliczeniowy. *iterable* musi być sekwencją, :term:`iteratorem <iterator>` lub innym obiektem obsługującym iterację. Metoda :meth:`~iterator.__next__` iteratora zwróconego przez :func:`enumerate` zwraca dwukrotkę zawierającą licznik (od *start*, który domyślnie wynosi 0) i wartości uzyskane z iteracji na argumencie *iterable*.

source: Equivalent to::
fa: معادل::
pl: Odpowiednik::

source: Parameters
fa: پارامترها
pl: parametry

source: A Python expression.
fa: یک عبارت پایتون
pl: Expresja Python.

source: The global namespace (default: ``None``).
fa: فضای نام جهانی (پیش‌فرض: ``None``).
pl: Globalna przestrzeń nazw (domyślny: ``None``).

source: The local namespace (default: ``None``).
fa: فضای نام محلی (پیش‌فرض: ``None``).
pl: Lokalna przestrzeń nazw (domyślny: ``None``).

source: Returns
fa: برمی گرداند
pl: Zwraca

source: The result of the evaluated expression.
fa: نتیجه عبارت ارزیابی شده
pl: Wynik obliczonej ekspresji.

source: raises
fa: را افزایش می دهد
pl: rzuca

source: Syntax errors are reported as exceptions.
fa: خطاهای نحوی به عنوان استثنا گزارش می شوند.
pl: Błędy składni są zgłaszane jako wyjątki.

source: This function executes arbitrary code. Calling it with user-supplied input may lead to security vulnerabilities.
fa: این تابع کد دلخواه را اجرا می کند. فراخوانی آن با ورودی ارائه شده توسط کاربر ممکن است منجر به آسیب‌پذیری‌های امنیتی شود.
pl: Ta funkcja wykonuje dowolny kod. Wywołanie go z danymi wejściowymi dostarczonymi przez użytkownika może prowadzić do luk w zabezpieczeniach.

source: The *expression* argument is parsed and evaluated as a Python expression (technically speaking, a condition list) using the *globals* and *locals* mappings as global and local namespace. If the *globals* dictionary is present and does not contain a value for the key ``__builtins__``, a reference to the dictionary of the built-in module :mod:`builtins` is inserted under that key before *expression* is parsed. That way you can control what builtins are available to the executed code by inserting your own ``__builtins__`` dictionary into *globals* before passing it to :func:`eval`. If the *locals* mapping is omitted it defaults to the *globals* dictionary. If both mappings are omitted, the expression is executed with the *globals* and *locals* in the environment where :func:`eval` is called. Note, *eval()* will only have access to the :term:`nested scopes <nested scope>` (non-locals) in the enclosing environment if they are already referenced in the scope that is calling :func:`eval` (e.g. via a :keyword:`nonlocal` statement).
fa: آرگومان *expression* با استفاده از نگاشت *globals* و *locals* به عنوان فضای نام سراسری و محلی به عنوان یک عبارت پایتون (از نظر فنی, لیست شرایط) تجزیه و ارزیابی می شود. اگر فرهنگ لغت *globals* وجود داشته باشد و حاوی مقداری برای کلید ``__builtins__`` نباشد، قبل از تجزیه *expression*، مرجعی به فرهنگ لغت ماژول داخلی :mod:`builtins` در زیر آن کلید درج می شود. به این ترتیب می توانید با وارد کردن فرهنگ لغت ``__builtins__`` خود در *globals* قبل از ارسال آن به :func:`eval`، کنترل کنید که چه داخلی هایی برای کد اجرا شده در دسترس هستند. اگر نگاشت *locals* حذف شود، به طور پیش فرض به فرهنگ لغت *globals* تبدیل می شود. اگر هر دو نقشه برداری حذف شوند، عبارت با *globals* و *locals* در محیطی که :func:`eval` فراخوانی می شود اجرا می شود. توجه داشته باشید، *eval()* تنها در صورتی به :term:`nested scopes <nested scope>` (غیر محلی) در محیط محصور دسترسی خواهد داشت که قبلاً در محدوده ای که :func:`eval` را فراخوانی می کند ارجاع داده شده باشد (مثلاً از طریق یک عبارت :keyword:`nonlocal`).
pl: Argument *expression* jest analizowany i ewaluowany jako wyrażenie Python (technicznie rzecz biorąc, lista warunków) przy użyciu mapowań *globals* i *locals* jako globalnej i lokalnej przestrzeni nazw. Jeśli *globals* słownik jest obecny i nie zawiera wartości dla klucza ``__builtins__``, odwołanie do słownika z wbudowanej moduły :mod:`builtins` jest wstawiane pod tym kluczem, zanim *expression* zostanie przeanalizowane. W ten sposób można kontrolować, jakie wbudowany są dostępne dla wykonywanego kodu, wstawiając własne ``__builtins__`` słownik do *globals* przed przekazaniem go do :func:`eval`. Jeśli mapowanie *locals* zostanie pominięte, domyślnie będzie to *globals* słownik. Jeśli oba mapowania są pominięte, wyrażenie jest wykonywane z *globals* i *locals* w środowisku, w którym wywoływane jest :func:`eval`. Uwaga, *eval()* będzie miał dostęp do :term:`zagnieżdżonych zakresów <nested scope>` (non-locals) w otaczającym środowisku tylko wtedy, gdy są one już przywoływane w zakresie, który wywołuje :func:`eval` (np. poprzez instrukcję :keyword:`nonlocal` ).

source: Example:
fa: مثال:
pl: Przykład:

source: This function can also be used to execute arbitrary code objects (such as those created by :func:`compile`). In this case, pass a code object instead of a string. If the code object has been compiled with ``'exec'`` as the *mode* argument, :func:`eval`\'s return value will be ``None``.
fa: این تابع همچنین می تواند برای اجرای اشیاء کد دلخواه (مانند موارد ایجاد شده توسط :func:`compile`) استفاده شود. در این حالت به جای رشته، یک شی کد ارسال کنید. اگر شی کد با ``'exec'`` به عنوان آرگومان *mode* کامپایل شده باشد، مقدار بازگشتی :func:`eval` ``None`` خواهد بود.
pl: Ta funkcja może być również używana do wykonywania dowolnych obiektów kodu (takich jak te utworzone przez :func:`compile`). W tym przypadku należy przekazać obiekt kodu zamiast napisu. Jeśli obiekt kodu został skompilowany z ``'exec'`` jako *mode* argument, :func:`eval` wartością zwracana będzie ``None``.

source: Hints: dynamic execution of statements is supported by the :func:`exec` function. The :func:`globals` and :func:`locals` functions return the current global and local dictionary, respectively, which may be useful to pass around for use by :func:`eval` or :func:`exec`.
fa: نکات: اجرای پویا عبارات توسط تابع :func:`exec` پشتیبانی می شود. توابع :func:`globals` و :func:`locals` به ترتیب فرهنگ لغت جهانی و محلی فعلی را برمی گرداند که ممکن است برای استفاده توسط :func:`eval` یا :func:`exec` مفید باشد.
pl: Wskazówki: dynamiczne wykonywanie instrukcji jest obsługiwane przez :func:`exec` funkcja . Adresy :func:`globals` i :func:`locals` funkcje zwracaja określaaą odpowiednio bieżący globalny i lokalny adres słownika, który może być przydatny do przekazania do użycia przez adresy :func:`eval` lub :func:`exec`.

source: If the given source is a string, then leading and trailing spaces and tabs are stripped.
fa: اگر منبع داده شده یک رشته باشد، فضاها و زبانه های پیشرو و انتهایی حذف می شوند.
pl: Jeśli podane źródło to napis, początkowe i końcowe spacje i tabulatory są usuwane.

source: See :func:`ast.literal_eval` for a function that can safely evaluate strings with expressions containing only literals.
fa: :func:`ast.literal_eval` را برای تابعی که می تواند به طور ایمن رشته ها را با عباراتی که فقط حاوی لفظ هستند، ارزیابی کند، ببینید.
pl: Zobacz :func:`ast.literal_eval` dla funkcj, którya może bezpiecznie ocenić napis z wyrażeniami zawierającymi tylko literały.

source: Raises an :ref:`auditing event <auditing>` ``exec`` with the code object as the argument. Code compilation events may also be raised.
fa: یک :ref:`auditing event <auditing>` ``exec`` را با شی کد به عنوان آرگومان افزایش می دهد. رویدادهای تدوین کد نیز ممکن است مطرح شود.
pl: Rzuci zdarzenie :ref:`auditing event <auditing>` ``exec`` z obiektem kodu jako argument. Zdarzenia kompilacji kodu mogą być również rzucone.

source: The *globals* and *locals* arguments can now be passed as keywords.
fa: آرگومان های *globals* و *locals* اکنون می توانند به عنوان کلمات کلیدی ارسال شوند.
pl: Funkcje *globals* i *locals* argumenty mogą być teraz przekazywane jako słowa kluczowe.

source: The semantics of the default *locals* namespace have been adjusted as described for the :func:`locals` builtin.
fa: معنای فضای نام پیش‌فرض *locals* همانطور که برای داخلی :func:`locals` توضیح داده شد تنظیم شده است.
pl: Semantyka przestrzeni nazw domyślnych *locals* została dostosowana zgodnie z opisem dla wbudowanej :func:`locals` .

source: This function supports dynamic execution of Python code. *source* must be either a string or a code object. If it is a string, the string is parsed as a suite of Python statements which is then executed (unless a syntax error occurs). [#]_ If it is a code object, it is simply executed. In all cases, the code that's executed is expected to be valid as file input (see the section :ref:`file-input` in the Reference Manual). Be aware that the :keyword:`nonlocal`, :keyword:`yield`, and :keyword:`return` statements may not be used outside of function definitions even within the context of code passed to the :func:`exec` function. The return value is ``None``.
fa: این تابع از اجرای پویا کد پایتون پشتیبانی می کند. *source* باید یک رشته یا یک شی کد باشد. اگر یک رشته باشد، رشته به عنوان مجموعه ای از عبارات پایتون تجزیه می شود که سپس اجرا می شود (مگر اینکه یک خطای نحوی رخ دهد). [#]_ اگر یک شی کد باشد، به سادگی اجرا می شود. در همه موارد، انتظار می رود کدی که اجرا می شود به عنوان ورودی فایل معتبر باشد (به بخش :ref:`file-input` در کتابچه راهنمای مرجع مراجعه کنید). توجه داشته باشید که دستورات :keyword:`nonlocal`، :keyword:`yield` و :keyword:`return` ممکن است خارج از تعاریف تابع حتی در زمینه کد ارسال شده به تابع :func:`exec` مورد استفاده قرار نگیرند. مقدار بازگشتی ``None`` است.
pl: Ta funkcja obsługuje dynamiczne wykonywanie kodu Python. *source* musi być albo napis albo obiektem kodu. Jeśli jest to napis, napis jest analizowany jako zestaw instrukcji Pythona, które sa następnie wykonywany (chyba że wystąpi błąd składni). [#]_ Jeśli jest to obiekt kodu, jest on po prostu wykonywany. We wszystkich przypadkach wykonywany kod powinien być prawidłowy jako plik wejściowy (patrz sekcja :ref:`file-input` w Podręczniku referencyjnym). Należy pamiętać, że wartości :keyword:`nonlocal`, :keyword:`yield` i :keyword:`return` instrukcije nie mogą być używane poza definicjami funkcji, nawet w kontekście kodu przekazywanego do :func:`exec` . Wartość zwracana to ``None``.

source: In all cases, if the optional parts are omitted, the code is executed in the current scope. If only *globals* is provided, it must be a dictionary (and not a subclass of dictionary), which will be used for both the global and the local variables. If *globals* and *locals* are given, they are used for the global and local variables, respectively. If provided, *locals* can be any mapping object. Remember that at the module level, globals and locals are the same dictionary.
fa: در تمام موارد، اگر قسمت های اختیاری حذف شوند، کد در محدوده فعلی اجرا می شود. اگر فقط *globals* ارائه شده باشد، باید یک فرهنگ لغت باشد (و نه زیر کلاس فرهنگ لغت), که هم برای متغیرهای سراسری و هم برای متغیرهای محلی استفاده می شود. اگر *globals* و *locals* داده شوند، به ترتیب برای متغیرهای سراسری و محلی استفاده می شوند. در صورت ارائه، *locals* می تواند هر شی نگاشت باشد. به یاد داشته باشید که در سطح ماژول، جهانی ها و محلی ها یک فرهنگ لغت هستند.
pl: We wszystkich przypadkach, jeśli części opcjonalne są pominięte, kod jest wykonywany w bieżącym zakresie. Jeśli podano tylko *globals*, musi to być słownik (a nie podklasa z słownikem), który będzie używany zarówno dla zmiennych globalnych, jak i lokalnych. Jeśli podano *globals* i *locals*, są one używane odpowiednio dla zmiennych globalnych i lokalnych. Jeśli podano *locals*, może to być dowolny obiekt mapowania. Należy pamiętać, że na poziomie moduł, globals i locals są tym samym słownikem.

source: When ``exec`` gets two separate objects as *globals* and *locals*, the code will be executed as if it were embedded in a class definition. This means functions and classes defined in the executed code will not be able to access variables assigned at the top level (as the "top level" variables are treated as class variables in a class definition).
fa: هنگامی که ``exec`` دو شی جداگانه به عنوان *globals* و *locals* دریافت می کند، کد به گونه ای اجرا می شود که گویی در یک تعریف کلاس تعبیه شده است. این بدان معناست که توابع و کلاس های تعریف شده در کد اجرا شده قادر به دسترسی به متغیرهای اختصاص داده شده در سطح بالا نخواهند بود (زیرا متغیرهای "سطح بالا" به عنوان متغیرهای کلاس در تعریف کلاس در نظر گرفته می شوند).
pl: Gdy ``exec`` pobiera dwa oddzielne obiekty jako *globals* i *locals*, kod zostanie wykonany tak, jakby był osadzony w definicja klasy. Oznacza to, że funkcja i klasy zdefiniowane w wykonywanym kodzie nie będą mogły uzyskać dostępu do zmiennych przypisanych na najwyższym poziomie (ponieważ zmienne "najwyższego poziomu" są traktowane jako zmienne klasowe w definicja klasy).

source: If the *globals* dictionary does not contain a value for the key ``__builtins__``, a reference to the dictionary of the built-in module :mod:`builtins` is inserted under that key. That way you can control what builtins are available to the executed code by inserting your own ``__builtins__`` dictionary into *globals* before passing it to :func:`exec`.
fa: اگر فرهنگ لغت *globals* حاوی مقداری برای کلید ``__builtins__`` نباشد، مرجعی به فرهنگ لغت ماژول داخلی :mod:`builtins` در زیر آن کلید درج می شود. به این ترتیب می توانید با وارد کردن فرهنگ لغت ``__builtins__`` خود در *globals* قبل از ارسال آن به :func:`exec`، کنترل کنید که چه داخلی هایی برای کد اجرا شده در دسترس هستند.
pl: Jeśli *globals* słownik nie zawiera wartości dla klucza ``__builtins__``, odwołanie do słownika z wbudowanego modułu :mod:`builtins` jest wstawiane pod tym kluczem. W ten sposób można kontrolować, które wbudowane są dostępne dla wykonywanego kodu, wstawiając własny ``__builtins__`` słownik do *globals* przed przekazaniem go do :func:`exec`.

source: The *closure* argument specifies a closure--a tuple of cellvars. It's only valid when the *object* is a code object containing :term:`free (closure) variables <closure variable>`. The length of the tuple must exactly match the length of the code object's :attr:`~codeobject.co_freevars` attribute.
fa: آرگومان *closure* یک بسته شدن را مشخص می‌کند - چند cellvar. فقط زمانی معتبر است که *object* یک شی کد حاوی :term:`free (closure) variables <closure variable>` باشد. طول تاپل باید دقیقاً با طول ویژگی :attr:`~codeobject.co_freevars` شی کد مطابقت داشته باشد.
pl: Wyrażenie *closure* określa zamknięcie - krotka zmiennych komórkowych. Jest ważne tylko wtedy, gdy *obiekt* jest obiektem kodu zawierającym :term:`wolne (zamknięcie) zmienne <closure variable>`. Długość krotka musi dokładnie odpowiadać długości :attr:`~codeobject.co_freevars` atrybutem obiektu kodu.

source: The built-in functions :func:`globals` and :func:`locals` return the current global and local namespace, respectively, which may be useful to pass around for use as the second and third argument to :func:`exec`.
fa: توابع داخلی :func:`globals` و :func:`locals` به ترتیب فضای نام جهانی و محلی فعلی را برمی‌گردانند که ممکن است برای استفاده به عنوان آرگومان دوم و سوم به :func:`exec` مفید باشد.
pl: Adresy wbudowane funkcji :func:`globals` i :func:`locals` zwraca to odpowiednio bieżąca globalna i lokalna przestrzeń nazw, które mogą być przydatne do przekazania jako drugi i trzeci argument do :func:`exec`.

source: The default *locals* act as described for function :func:`locals` below. Pass an explicit *locals* dictionary if you need to see effects of the code on *locals* after function :func:`exec` returns.
fa: پیش فرض *locals* همانطور که برای عملکرد :func:`locals` در زیر توضیح داده شده است عمل می کند. اگر نیاز به دیدن اثرات کد بر روی *locals* پس از بازگشت تابع :func:`exec` دارید، یک فرهنگ لغت صریح *locals* را ارسال کنید.
pl: Elementy domyślne *locals* działają w sposób opisany dla funkcji :func:`locals` poniżej. Przekaż jawne *locals* słownik jeśli chcesz zobaczyć efekty kodu na *locals* po funkcji :func:`exec` .

source: Added the *closure* parameter.
fa: پارامتر *closure* اضافه شد.
pl: Dodano parametr *zamknięcie*.

source: Construct an iterator from those elements of *iterable* for which *function* is true. *iterable* may be either a sequence, a container which supports iteration, or an iterator. If *function* is ``None``, the identity function is assumed, that is, all elements of *iterable* that are false are removed.
fa: یک تکرار کننده از آن عناصر *iterable* بسازید که *function* برای آنها درست است. *iterable* ممکن است یک دنباله باشد، یک ظرف که از تکرار پشتیبانی می کند، یا یک تکرار. اگر *function* ``None`` باشد، تابع هویت فرض می شود، یعنی تمام عناصر *iterable* که false هستند حذف می شوند.
pl: Konstruuje iterator z tych elementów *iterable*, dla których *funkcja* jest prawdą. *iterable* może być sekwencją, kontenerem obsługującym iterację lub iterator. Jeśli *funkcja* jest ``None``, zakłada się tożsamość funkcji, to znaczy wszystkie elementy *iterable*, które są fałszywe, są usuwane.

source: Note that ``filter(function, iterable)`` is equivalent to the generator expression ``(item for item in iterable if function(item))`` if function is not ``None`` and ``(item for item in iterable if item)`` if function is ``None``.
fa: توجه داشته باشید که ``filter(function, iterable)`` معادل عبارت ژنراتور ``(item for item in iterable if function(item))`` است اگر تابع ``None`` نباشد و ``(item for item in iterable if item)`` اگر تابع ``None`` باشد.
pl: Należy zauważyć, że ``filter(function, iterable)`` jest równoważne wyrażeniu generator ``(item for item in iterable if function(item))`` jeśli funkcja nie jest ``None`` i ``(item for item in iterable if item)`` jeśli funkcja jest ``None``.

source: See :func:`itertools.filterfalse` for the complementary function that returns elements of *iterable* for which *function* is false.
fa: برای تابع مکملی که عناصر *iterable* را که *function* نادرست است، به :func:`itertools.filterfalse` برمی گرداند.
pl: Zobacz :func:`itertools.filterfalse` dla komplementarnych funkci ktore zwracaja elementy *iterable* dla których *funkcja* jest fałszywe.

source: Return a floating-point number constructed from a number or a string.
fa: یک عدد ممیز شناور ساخته شده از یک عدد یا یک رشته را برگردانید.
pl: Zwraca liczba zmiennoprzecinkowa zbudowana z liczby lub napisu.

source: If the argument is a string, it should contain a decimal number, optionally preceded by a sign, and optionally embedded in whitespace. The optional sign may be ``'+'`` or ``'-'``; a ``'+'`` sign has no effect on the value produced. The argument may also be a string representing a NaN (not-a-number), or positive or negative infinity. More precisely, the input must conform to the :token:`~float:floatvalue` production rule in the following grammar, after leading and trailing whitespace characters are removed:
fa: اگر آرگومان یک رشته باشد، باید دارای یک عدد اعشاری باشد که به صورت اختیاری قبل از یک علامت، و به صورت اختیاری در فضای خالی تعبیه شده است. علامت اختیاری ممکن است ``'+'`` یا ``'-'`` باشد. علامت ``'+'`` هیچ تاثیری بر مقدار تولید شده ندارد. آرگومان ممکن است رشته ای باشد که یک NaN (عدد نیست) یا بی نهایت مثبت یا منفی را نشان می دهد. به‌طور دقیق‌تر، ورودی باید با قانون تولید :token:`~float:floatvalue` در گرامر زیر مطابقت داشته باشد، پس از حذف کاراکترهای فضای خالی اصلی و انتهایی:
pl: Jeśli argument jest napisem, powinien zawierać liczbę dziesiętną, opcjonalnie poprzedzoną znakiem i opcjonalnie osadzoną w białych znakach. Znak opcjonalny może być ``'+'`` lub ``'-'``; znak ``'+'`` nie ma wpływu na otrzymaną wartość. argument może być również napisem reprezentującym NaN (not-a-number) lub dodatnią lub ujemną nieskończoność. Dokładniej, dane wejściowe muszą być zgodne z regułą produkcji :token:`~float:floatvalue` w poniższej gramatyce, po usunięciu początkowych i końcowych białych znaków znak:

source: Case is not significant, so, for example, "inf", "Inf", "INFINITY", and "iNfINity" are all acceptable spellings for positive infinity.
fa: حروف بزرگ و کوچک معنادار نیست، بنابراین، برای مثال، «inf»، «Inf»، «INFINITY» و «iNfINity» همه املای قابل قبولی برای بی‌نهایت مثبت هستند.
pl: Wielkość liter nie ma znaczenia, więc na przykład "inf", "Inf", "INFINITY" i "iNfINity" są akceptowalnymi pisowniami dla dodatniej nieskończoności.

source: Otherwise, if the argument is an integer or a floating-point number, a floating-point number with the same value (within Python's floating-point precision) is returned. If the argument is outside the range of a Python float, an :exc:`OverflowError` will be raised.
fa: در غیر این صورت، اگر آرگومان یک عدد صحیح یا یک عدد ممیز شناور باشد، یک عدد ممیز شناور با همان مقدار (در محدوده دقت ممیز شناور پایتون) برگردانده می‌شود. اگر آرگومان خارج از محدوده یک شناور پایتون باشد، یک :exc:`OverflowError` بالا می رود.
pl: W przeciwnym razie, jeśli argument jest liczba całkowita lub liczbą zmiennoprzecinkową, zwracana jest liczba zmiennoprzecinkowa o tej samej wartości (w zakresie precyzji zmiennoprzecinkowej Python). Rzuci jeśli argument jest poza zakresem liczby zmiennoprzecinkowej Python, zwrócona zostanie :exc:`OverflowError`.

source: For a general Python object ``x``, ``float(x)`` delegates to ``x.__float__()``. If :meth:`~object.__float__` is not defined then it falls back to :meth:`~object.__index__`.
fa: برای یک شیء عمومی پایتون ``x``، ``float(x)`` به ``x.__float__()`` واگذار می شود. اگر :meth:`~object.__float__` تعریف نشده باشد، به :meth:`~object.__index__` برمی گردد.
pl: W przypadku ogólnego obiektu Python ``x`` , ``float(x)`` deleguje do ``x.__float__()``. Jeśli :meth:`~object.__float__` nie jest zdefiniowana, to spada z powrotem do :meth:`~object.__index__`.
