Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/functions.po
Languages: fa, pl

source: This is the ultimate base class of all other classes. It has methods that are common to all instances of Python classes. When the constructor is called, it returns a new featureless object. The constructor does not accept any arguments.
fa: این کلاس پایه نهایی تمام کلاس‌های دیگر است. متدهایی دارد که در تمام نمونه‌های کلاس‌های پایتون مشترک است. هنگامی که سازنده فراخوانی می شود، یک شیء بدون ویژگی جدید را برمی گرداند. سازنده هیچ استدلالی را نمی پذیرد.
pl: Jest to ostateczna klasa bazowa wszystkich innych klas. Posiada metody, które są wspólne dla wszystkich instancji klas Pythona. Kiedy konstruktor jest wywoływany, zwraca nowy obiekt bez funkcji. Klasa konstruktor nie akceptuje żadnych argumentow.

source: :class:`object` instances do *not* have :attr:`~object.__dict__` attributes, so you can't assign arbitrary attributes to an instance of :class:`object`.
fa: نمونه های :class:`object` *not* دارای ویژگی های :attr:`~object.__dict__` هستند، بنابراین نمی توانید ویژگی های دلخواه را به نمونه ای از :class:`object` اختصاص دهید.
pl: :class:`object` instancje *nie* mają :attr:`~object.__dict__` atrybut , więc nie można przypisać dowolnego atrybuta do instancji :class:`object`.

source: Convert an integer number to an octal string prefixed with "0o". The result is a valid Python expression. If *x* is not a Python :class:`int` object, it has to define an :meth:`~object.__index__` method that returns an integer. For example:
fa: یک عدد صحیح را به یک رشته هشتی با پیشوند "0o" تبدیل کنید. نتیجه یک عبارت پایتون معتبر است. اگر *x* یک شی پایتون :class:`int` نیست، باید یک متد :meth:`~object.__index__` تعریف کند که یک عدد صحیح برمی گرداند. به عنوان مثال:
pl: Konwertuje liczbę liczba całkowita na ósemkowy napis z prefiksem "0o". Wynikiem jest poprawne wyrażenie Python. Jeśli *x* nie jest obiektem Pythona :class:`int` , musi definiować metodę :meth:`~object.__index__`, która zwraca liczbe całkowita. Na przykład:

source: If you want to convert an integer number to an octal string either with the prefix "0o" or not, you can use either of the following ways.
fa: اگر می خواهید یک عدد صحیح را با پیشوند "0o" یا نه به رشته هشتی تبدیل کنید، می توانید از یکی از راه های زیر استفاده کنید.
pl: Jeśli chcesz przekonwertować liczbę całkowita na ósemkowy napis z przedrostkiem "0o" lub bez, możesz użyć jednego z poniższych sposobów.

source: Open *file* and return a corresponding :term:`file object`. If the file cannot be opened, an :exc:`OSError` is raised. See :ref:`tut-files` for more examples of how to use this function.
fa: *file* را باز کنید و :term:`file object` مربوطه را برگردانید. اگر فایل باز نمی شود، یک :exc:`OSError` بالا می رود. برای مثال های بیشتر در مورد نحوه استفاده از این تابع، به :ref:`tut-files` مراجعه کنید.
pl: Otwiera *file* i zwraca odpowiedni :term:`obiekt pliku <file object>`. Jeśli pliku nie da się otworzyć, rzucany jest :exc:`OSError`. Więcej przykładów użycia tej funkcji można znaleźć w :ref:`tut-files`.

source: *file* is a :term:`path-like object` giving the pathname (absolute or relative to the current working directory) of the file to be opened or an integer file descriptor of the file to be wrapped. (If a file descriptor is given, it is closed when the returned I/O object is closed unless *closefd* is set to ``False``.)
fa: *file* یک :term:`path-like object` است که نام مسیر (مطلق یا نسبت به دایرکتوری کاری فعلی) فایلی که باید باز شود یا یک توصیفگر فایل صحیح فایلی که قرار است پیچیده شود را می دهد. (اگر یک توصیفگر فایل داده شود, زمانی که شی I/O برگشتی بسته شود بسته می شود, مگر اینکه *closefd* روی ``False`` تنظیم شود.)
pl: *file* jest :term:`obiektem path-like <path-like object>` podającym nazwę ścieżki (bezwzględną lub względną do bieżącego katalogu roboczego) pliku, który ma zostać otwarty, lub liczbą całkowitą deskryptora pliku, który ma zostać opakowany. (Jeśli podano deskryptor pliku, jest on zamykany, gdy zwrócony obiekt I/O jest zamykany, chyba że *closefd* jest ustawione na ``False``.)

source: *mode* is an optional string that specifies the mode in which the file is opened. It defaults to ``'r'`` which means open for reading in text mode. Other common values are ``'w'`` for writing (truncating the file if it already exists), ``'x'`` for exclusive creation, and ``'a'`` for appending (which on *some* Unix systems, means that *all* writes append to the end of the file regardless of the current seek position). In text mode, if *encoding* is not specified the encoding used is platform-dependent: :func:`locale.getencoding` is called to get the current locale encoding. (For reading and writing raw bytes use binary mode and leave *encoding* unspecified.) The available modes are:
fa: *mode* یک رشته اختیاری است که حالت باز شدن فایل را مشخص می کند. پیش‌فرض آن ``'r'`` است که به معنای باز برای خواندن در حالت متن است. مقادیر رایج دیگر عبارتند از ``'w'`` برای نوشتن (قطع کردن فایل در صورت وجود)، ``'x'`` برای ایجاد انحصاری، و ``'a'`` برای الحاق (که در سیستم‌های یونیکس *all* به این معنی است که *all* بدون توجه به موقعیت جستجوی فعلی, پیوست به انتهای فایل می‌نویسد). در حالت متنی، اگر *encoding* مشخص نشده باشد، رمزگذاری مورد استفاده وابسته به پلتفرم است: :func:`locale.getencoding` برای دریافت کدگذاری محلی فعلی فراخوانی می شود. (برای خواندن و نوشتن بایت های خام از حالت باینری استفاده کنید و *encoding* را نامشخص بگذارید.) حالت های موجود عبارتند از:
pl: *mode* to opcjonalny napis , który określa tryb, w którym plik jest otwierany. Domyślnie jest to ``'r'``, co oznacza otwarcie do odczytu w trybie tekstowym. Inne popularne wartości to ``'w'`` dla zapisu (obcinanie pliku, jeśli już istnieje), ``'x'`` dla wyłącznego tworzenia i ``'a'`` dla dołączania (co w *niektórych* systemach Unix oznacza, że *wszystkie* zapisy są dołączane do końca pliku niezależnie od bieżącej pozycji wyszukiwania). W trybie tekstowym, jeśli nie podano *encoding*, używane kodowanie jest zależne od platformy: :func:`locale.getencoding` jest wywoływane w celu uzyskania bieżącego kodowania locale. (Do odczytu i zapisu nieprzetworzonych bajtów należy użyć trybu binarnego i pozostawić *encoding* nieokreślone). Dostępne tryby to:

source: Character
fa: شخصیت
pl: Znak

source: Meaning
fa: معنی
pl: Znaczenie

source: open for reading (default)
fa: باز برای خواندن (پیش فرض)
pl: otwarte do czytania (domyślny)

source: open for writing, truncating the file first
fa: برای نوشتن باز کنید، ابتدا فایل را کوتاه کنید
pl: otworzyć do zapisu, najpierw obcinając plik

source: open for exclusive creation, failing if the file already exists
fa: برای ایجاد انحصاری باز است، اگر فایل از قبل وجود داشته باشد، ناموفق است
pl: otwarcie do wyłącznego utworzenia, niepowodzenie, jeśli plik już istnieje

source: open for writing, appending to the end of file if it exists
fa: برای نوشتن باز است و در صورت وجود به انتهای فایل اضافه می شود
pl: otwarte do zapisu, dołączenie do końca pliku, jeśli istnieje

source: binary mode
fa: حالت باینری
pl: tryb binarny

source: text mode (default)
fa: حالت متن (پیش‌فرض)
pl: tryb tekstowy (domyślny)

source: open for updating (reading and writing)
fa: باز برای به روز رسانی (خواندن و نوشتن)
pl: otwarte na aktualizację (odczyt i zapis)

source: The default mode is ``'r'`` (open for reading text, a synonym of ``'rt'``). Modes ``'w+'`` and ``'w+b'`` open and truncate the file. Modes ``'r+'`` and ``'r+b'`` open the file with no truncation.
fa: حالت پیش فرض ``'r'`` (باز برای خواندن متن, مترادف ``'rt'``) است. حالت های ``'w+'`` و ``'w+b'`` فایل را باز و کوتاه می کنند. حالت های ``'r+'`` و ``'r+b'`` فایل را بدون برش باز می کنند.
pl: Tryb domyślny to ``'r'`` (otwarty do odczytu tekstu, synonim ``'rt'``). Tryby ``'w+'`` i ``'w+b'`` otwierają i obcinają plik. Tryby ``'r+'`` i ``'r+b'`` otwierają plik bez obcinania.

source: As mentioned in the :ref:`io-overview`, Python distinguishes between binary and text I/O. Files opened in binary mode (including ``'b'`` in the *mode* argument) return contents as :class:`bytes` objects without any decoding. In text mode (the default, or when ``'t'`` is included in the *mode* argument), the contents of the file are returned as :class:`str`, the bytes having been first decoded using a platform-dependent encoding or using the specified *encoding* if given.
fa: همانطور که در :ref:`io-overview` ذکر شد، پایتون بین I/O باینری و متنی تمایز قائل می شود. فایل هایی که در حالت باینری باز می شوند (از جمله ``'b'`` در آرگومان *mode*) بدون هیچ گونه رمزگشایی، محتویات را به عنوان اشیاء :class:`bytes` برمی گرداند. در حالت متنی (پیش‌فرض, یا زمانی که ``'t'`` در آرگومان *mode* گنجانده می‌شود), محتویات فایل به‌عنوان :class:`str` برگردانده می‌شود، بایت‌ها ابتدا با استفاده از یک رمزگذاری وابسته به پلتفرم رمزگشایی شده‌اند یا در صورت ارائه، با استفاده از *encoding* مشخص‌شده رمزگشایی شده‌اند.
pl: Jak wspomniano w :ref:`io-overview`, Python rozróżnia binarne i tekstowe I/O. Pliki otwierane w trybie binarnym (w tym ``'b'`` w *mode* argument) zwracają zawartość jako obiekty :class:`bytes` bez żadnego dekodowania. W trybie tekstowym ( domyślny, lub gdy ``'t'`` jest zawarte w *mode* argument), zawartość pliku jest zwracana jako :class:`str`, bajty zostały najpierw zdekodowane przy użyciu kodowania zależnego od platformy lub przy użyciu określonego *kodowania*, jeśli zostało podane.

source: Python doesn't depend on the underlying operating system's notion of text files; all the processing is done by Python itself, and is therefore platform-independent.
fa: پایتون به مفهوم فایل های متنی سیستم عامل اساسی وابسته نیست. تمام پردازش ها توسط خود پایتون انجام می شود و بنابراین مستقل از پلتفرم است.
pl: Python nie zależy od pojęcia plików tekstowych w systemie operacyjnym; całe przetwarzanie jest wykonywane przez Pythoan i dlatego jest niezależne od platformy.

source: *buffering* is an optional integer used to set the buffering policy. Pass 0 to switch buffering off (only allowed in binary mode), 1 to select line buffering (only usable when writing in text mode), and an integer > 1 to indicate the size in bytes of a fixed-size chunk buffer. Note that specifying a buffer size this way applies for binary buffered I/O, but ``TextIOWrapper`` (i.e., files opened with ``mode='r+'``) would have another buffering. To disable buffering in ``TextIOWrapper``, consider using the ``write_through`` flag for :func:`io.TextIOWrapper.reconfigure`. When no *buffering* argument is given, the default buffering policy works as follows:
fa: *buffering* یک عدد صحیح اختیاری است که برای تنظیم خط مشی بافر استفاده می شود. 0 را برای خاموش کردن بافر (فقط در حالت باینری مجاز است), 1 برای انتخاب بافر خط (فقط هنگام نوشتن در حالت متنی قابل استفاده است) و یک عدد صحیح > 1 برای نشان دادن اندازه یک بافر تکه با اندازه ثابت بر حسب بایت. توجه داشته باشید که تعیین اندازه بافر از این طریق برای I/O بافر باینری اعمال می‌شود، اما ``TextIOWrapper`` (یعنی فایل‌هایی که با ``mode='r+'`` باز می‌شوند) بافر دیگری دارند. برای غیرفعال کردن بافر در ``TextIOWrapper``، از پرچم ``write_through`` برای :func:`io.TextIOWrapper.reconfigure` استفاده کنید. هنگامی که هیچ آرگومان *buffering* داده نمی شود، سیاست بافر پیش فرض به صورت زیر عمل می کند:
pl: *buffering* to opcjonalna liczba całkowita używana do ustawiania polityki buforowania. Przekaż 0, aby wyłączyć buforowanie (dozwolone tylko w trybie binarnym), 1, aby wybrać buforowanie liniowe (używane tylko podczas pisania w trybie tekstowym) i liczba całkowita > 1, aby wskazać rozmiar w bajtach bufora o stałym rozmiarze. Należy zauważyć, że określenie rozmiaru bufora w ten sposób dotyczy binarnie buforowanego wejścia/wyjścia, ale ``TextIOWrapper`` (tj. pliki otwierane za pomocą ``mode='r+'``) będą miały inne buforowanie. Aby wyłączyć buforowanie w ``TextIOWrapper``, należy rozważyć użycie flagi ``write_through`` dla :func:`io.TextIOWrapper.reconfigure`. Gdy nie podano *buforowania* argument, polityka buforowania domyślny działa w następujący sposób:

source: Binary files are buffered in fixed-size chunks; the size of the buffer is chosen using a heuristic trying to determine the underlying device's "block size" and falling back on :const:`io.DEFAULT_BUFFER_SIZE`. On many systems, the buffer will typically be 4096 or 8192 bytes long.
fa: فایل های باینری در تکه هایی با اندازه ثابت بافر می شوند. اندازه بافر با استفاده از یک روش اکتشافی برای تعیین "اندازه بلوک" دستگاه زیربنایی و بازگشت به :const:`io.DEFAULT_BUFFER_SIZE` انتخاب می شود. در بسیاری از سیستم ها، بافر معمولاً 4096 یا 8192 بایت طول خواهد داشت.
pl: Pliki binarne są buforowane w kawałkach o stałym rozmiarze; rozmiar bufora jest wybierany przy użyciu heurystyki próbującej określić "rozmiar urządzenia bazowego" i powracając do :const:`io.DEFAULT_BUFFER_SIZE`. W wielu systemach bufor ma długość 4096 lub 8192 bajtów.

source: "Interactive" text files (files for which :meth:`~io.IOBase.isatty` returns ``True``) use line buffering. Other text files use the policy described above for binary files.
fa: فایل های متنی "تعاملی" (فایل هایی که :meth:`~io.IOBase.isatty` برای آنها ``True`` برمی گرداند) از بافر خط استفاده می کنند. سایر فایل های متنی از خط مشی توضیح داده شده در بالا برای فایل های باینری استفاده می کنند.
pl: "Interaktywne" pliki tekstowe (pliki, dla których :meth:`~io.IOBase.isatty` zwraca ``True`` ) używają buforowania linii. Inne pliki tekstowe używają zasad opisanych powyżej dla plików binarnych.

source: *encoding* is the name of the encoding used to decode or encode the file. This should only be used in text mode. The default encoding is platform dependent (whatever :func:`locale.getencoding` returns), but any :term:`text encoding` supported by Python can be used. See the :mod:`codecs` module for the list of supported encodings.
fa: *encoding* نام رمزگذاری مورد استفاده برای رمزگشایی یا رمزگذاری فایل است. این فقط باید در حالت متن استفاده شود. کدگذاری پیش‌فرض وابسته به پلتفرم است (هر چیزی که :func:`locale.getencoding` برمی‌گرداند), اما هر :term:`text encoding` پشتیبانی شده توسط پایتون قابل استفاده است. ماژول :mod:`codecs` را برای لیست کدگذاری های پشتیبانی شده ببینید.
pl: *encoding* to nazwa kodowania używanego do dekodowania lub kodowania pliku. Powinno być używane tylko w trybie tekstowym. Kodowanie domyślne jest zależne od platformy (cokolwiek :func:`locale.getencoding` zwraca ), ale można użyć dowolnego :term:`kodowanie tekstu` obsługiwanego przez Python. Lista obsługiwanych kodowań znajduje się na stronie :mod:`codecs` modułu .

source: *errors* is an optional string that specifies how encoding and decoding errors are to be handled—this cannot be used in binary mode. A variety of standard error handlers are available (listed under :ref:`error-handlers`), though any error handling name that has been registered with :func:`codecs.register_error` is also valid. The standard names include:
fa: *errors* یک رشته اختیاری است که نحوه رسیدگی به خطاهای رمزگذاری و رمزگشایی را مشخص می کند - این در حالت باینری قابل استفاده نیست. انواع کنترل کننده خطای استاندارد موجود است (در زیر :ref:`error-handlers` ذکر شده است), اگرچه هر نام رسیدگی به خطا که با :func:`codecs.register_error` ثبت شده باشد نیز معتبر است. نام های استاندارد عبارتند از:
pl: *errors* to opcjonalny napis, który określa sposób obsługi błędów kodowania i dekodowania - nie może być używany w trybie binarnym. Dostępnych jest wiele standardowych programów obsługi błędów (wymienionych w :ref:`error-handlers`), choć każda nazwa obsługi błędów zarejestrowana w :func:`codecs.register_error` jest również ważna. Standardowe nazwy obejmują:

source: ``'strict'`` to raise a :exc:`ValueError` exception if there is an encoding error. The default value of ``None`` has the same effect.
fa: ``'strict'`` برای ایجاد یک استثنا :exc:`ValueError` در صورت وجود خطا در کدگذاری. مقدار پیش فرض ``None`` نیز همین اثر را دارد.
pl: ``'strict'`` do rzucenja wyjątek :exc:`ValueError`, jeśli wystąpi błąd kodowania. Wartość domyślna z ``None`` ma ten sam efekt.

source: ``'ignore'`` ignores errors. Note that ignoring encoding errors can lead to data loss.
fa: ``'ignore'`` خطاها را نادیده می گیرد. توجه داشته باشید که نادیده گرفتن خطاهای رمزگذاری می تواند منجر به از دست رفتن اطلاعات شود.
pl: ``'ignore'`` ignoruje błędy. Należy pamiętać, że ignorowanie błędów kodowania może prowadzić do utraty danych.

source: ``'replace'`` causes a replacement marker (such as ``'?'``) to be inserted where there is malformed data.
fa: ``'replace'`` باعث می شود که یک نشانگر جایگزین (مانند ``'?'``) در جایی که داده های نادرست وجود دارد درج شود.
pl: ``'replace'`` powoduje wstawienie znacznika zastępczego (takiego jak ``'?'``) tam, gdzie występują zniekształcone dane.

source: ``'surrogateescape'`` will represent any incorrect bytes as low surrogate code units ranging from U+DC80 to U+DCFF. These surrogate code units will then be turned back into the same bytes when the ``surrogateescape`` error handler is used when writing data. This is useful for processing files in an unknown encoding.
fa: ``'surrogateescape'`` هر بایت نادرستی را به عنوان واحدهای کد جانشین کم از U+DC80 تا U+DCFF نشان خواهد داد. هنگامی که از کنترل کننده خطای ``surrogateescape`` هنگام نوشتن داده استفاده می شود، این واحدهای کد جایگزین دوباره به همان بایت ها تبدیل می شوند. این برای پردازش فایل ها در یک رمزگذاری ناشناخته مفید است.
pl: ``'surrogateescape'`` będzie reprezentować wszelkie nieprawidłowe bajty jako niskie jednostki kodu zastępczego w zakresie od U+DC80 do U+DCFF. Te jednostki kodu zastępczego zostaną następnie przekształcone z powrotem w te same bajty, gdy podczas zapisu danych zostanie użyta obsługa błędów ``surrogateescape``. Jest to przydatne do przetwarzania plików w nieznanym kodowaniu.

source: ``'xmlcharrefreplace'`` is only supported when writing to a file. Characters not supported by the encoding are replaced with the appropriate XML character reference :samp:`&#{nnn};`.
fa: ``'xmlcharrefreplace'`` فقط هنگام نوشتن روی یک فایل پشتیبانی می شود. نویسه‌هایی که توسط رمزگذاری پشتیبانی نمی‌شوند، با مرجع کاراکتر XML مناسب جایگزین می‌شوند:samp:`&#{nnn};`.
pl: ``'xmlcharrefreplace'`` jest obsługiwany tylko podczas zapisu do pliku. Znak nieobsługiwany przez kodowanie jest zastępowany odpowiednim odniesieniem XML znak :samp:`&#{nnn};` .

source: ``'backslashreplace'`` replaces malformed data by Python's backslashed escape sequences.
fa: ``'backslashreplace'`` داده‌های بدشکل را با توالی‌های فرار بک اسلش شده پایتون جایگزین می‌کند.
pl: ``'backslashreplace'`` zastępuje zniekształcone dane przez sekwencje specjalne Python'z ukośnikiem wstecznym.

source: ``'namereplace'`` (also only supported when writing) replaces unsupported characters with ``\N{...}`` escape sequences.
fa: ``'namereplace'`` (همچنین فقط هنگام نوشتن پشتیبانی می شود) نویسه های پشتیبانی نشده را با دنباله های فرار ``\N{...}`` جایگزین می کند.
pl: ``'namereplace'`` (również obsługiwane tylko podczas zapisu) zastępuje nieobsługiwane znak sekwencjami ucieczki ``\N{...}``.

source: *newline* determines how to parse newline characters from the stream. It can be ``None``, ``''``, ``'\n'``, ``'\r'``, and ``'\r\n'``. It works as follows:
fa: *newline* نحوه تجزیه کاراکترهای خط جدید از جریان را تعیین می کند. این می تواند ``None``، ``''``، ``'\n'``، ``'\r'`` و ``'\r\n'`` باشد. به صورت زیر عمل می کند:
pl: *newline* określa sposób analizowania nowej linii znak ze strumienia. Może to być ``None``, ``''``, ``'\n'``, ``'\r'`` i ``'\r\n'``. Działa to w następujący sposób:

source: When reading input from the stream, if *newline* is ``None``, universal newlines mode is enabled. Lines in the input can end in ``'\n'``, ``'\r'``, or ``'\r\n'``, and these are translated into ``'\n'`` before being returned to the caller. If it is ``''``, universal newlines mode is enabled, but line endings are returned to the caller untranslated. If it has any of the other legal values, input lines are only terminated by the given string, and the line ending is returned to the caller untranslated.
fa: هنگام خواندن ورودی از جریان، اگر *newline* ``None`` باشد، حالت خطوط جدید جهانی فعال است. خطوط در ورودی می توانند به ``'\n'``، ``'\r'`` یا ``'\r\n'`` ختم شوند و این خطوط قبل از بازگرداندن به تماس گیرنده به ``'\n'`` ترجمه می شوند. اگر ``''`` باشد، حالت خطوط جدید جهانی فعال است، اما انتهای خط بدون ترجمه به تماس‌گیرنده برگردانده می‌شود. اگر هر یک از مقادیر قانونی دیگر را داشته باشد، خطوط ورودی فقط با رشته داده شده خاتمه می‌یابند و پایان خط بدون ترجمه به تماس‌گیرنده بازگردانده می‌شود.
pl: Podczas odczytu danych wejściowych ze strumienia, jeśli *newline* to ``None``, włączony jest uniwersalny tryb nowych linii. Linie na wejściu mogą kończyć się na ``'\n'``, ``'\r'``, lub ``'\r\n'``, które są tłumaczone na ``'\n'`` przed zwróceniem do wywołującego. Jeśli jest to ``''``, włączony jest uniwersalny tryb nowych linii, ale zakończenia linii są zwracane do wywołującego bez tłumaczenia. Jeśli ma dowolną z pozostałych legalnych wartości, linie wejściowe są kończone tylko przez podany napis, a zakończenie linii jest zwracane bez tłumaczenia.

source: When writing output to the stream, if *newline* is ``None``, any ``'\n'`` characters written are translated to the system default line separator, :data:`os.linesep`. If *newline* is ``''`` or ``'\n'``, no translation takes place. If *newline* is any of the other legal values, any ``'\n'`` characters written are translated to the given string.
fa: هنگام نوشتن خروجی در جریان، اگر *newline* ``None`` باشد، هر کاراکتر ``'\n'`` نوشته شده به جداکننده خط پیش‌فرض سیستم، :data:`os.linesep` ترجمه می‌شود. اگر *newline* ``''`` یا ``'\n'`` باشد، هیچ ترجمه ای انجام نمی شود. اگر *newline* هر یک از مقادیر قانونی دیگر باشد، هر کاراکتر ``'\n'`` نوشته شده به رشته داده شده ترجمه می شود.
pl: Podczas zapisywania danych wyjściowych do strumienia, jeśli *newline* ma wartość ``None``, wszelkie zapisane ``'\n'`` znaki są tłumaczone na systemowy domyślny separator linii, :data:`os.linesep`. Jeśli *newline* ma wartość ``''`` lub ``'\n'``, tłumaczenie nie jest wykonywane. Jeśli *newline* jest dowolną z pozostałych legalnych wartości, wszelkie zapisane ``'\n'`` znaki są tłumaczone na podany napis.

source: If *closefd* is ``False`` and a file descriptor rather than a filename was given, the underlying file descriptor will be kept open when the file is closed. If a filename is given *closefd* must be ``True`` (the default); otherwise, an error will be raised.
fa: اگر *closefd* ``False`` باشد و به جای نام فایل، توصیف‌گر فایل داده شده باشد، وقتی فایل بسته شود، توصیف‌گر فایل زیرین باز نگه داشته می‌شود. اگر نام فایلی داده شود *closefd* باید ``True`` (پیش فرض) باشد. در غیر این صورت یک خطا مطرح می شود.
pl: Jeśli *closefd* ma wartość ``False`` i podano deskryptor pliku, a nie nazwę pliku, to bazowy deskryptor pliku pozostanie otwarty po zamknięciu pliku. Jeśli podano nazwę pliku, *closefd* musi mieć wartość ``True`` ( domyślny); w przeciwnym razie wystąpi błąd.

source: A custom opener can be used by passing a callable as *opener*. The underlying file descriptor for the file object is then obtained by calling *opener* with (*file*, *flags*). *opener* must return an open file descriptor (passing :mod:`os.open` as *opener* results in functionality similar to passing ``None``).
fa: یک بازکننده سفارشی را می توان با عبور از یک قابل فراخوانی به عنوان *opener* استفاده کرد. سپس با فراخوانی *opener* با (*file*, *flags*) توصیفگر فایل زیربنایی برای شی فایل به دست می آید. *opener* باید یک توصیفگر فایل باز برگرداند (گذراندن :mod:`os.open` به عنوان *opener* عملکردی شبیه به پاس کردن ``None`` دارد).
pl: Niestandardowy otwieracz może być użyty poprzez przekazanie wywołania jako *opener*. Podstawowy deskryptor pliku dla obiektu pliku jest następnie uzyskiwany przez wywołanie *opener* z (*file*, *flags*). *opener* musi zwracać otwarty deskryptor pliku (przekazanie :mod:`os.open` jako *opener* skutkuje funkcjonalnością podobną do przekazania ``None``).

source: The newly created file is :ref:`non-inheritable <fd_inheritance>`.
fa: فایل جدید ایجاد شده :ref:`non-inheritable <fd_inheritance>` است.
pl: Nowo utworzony plik jest :ref:`non-inheritable <fd_inheritance>`.
