Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/functions.po
Languages: fa, pl

source: :class:`int` string inputs and string representations can be limited to help avoid denial of service attacks. A :exc:`ValueError` is raised when the limit is exceeded while converting a string to an :class:`int` or when converting an :class:`int` into a string would exceed the limit. See the :ref:`integer string conversion length limitation <int_max_str_digits>` documentation.
fa: ورودی های رشته :class:`int` و نمایش رشته ها می توانند برای جلوگیری از حملات انکار سرویس محدود شوند. یک :exc:`ValueError` زمانی افزایش می‌یابد که در حین تبدیل رشته به :class:`int` از حد مجاز فراتر رود یا زمانی که تبدیل :class:`int` به رشته از حد مجاز فراتر رود. به مستندات :ref:`integer string conversion length limitation <int_max_str_digits>` مراجعه کنید.
pl: :class:`int` napis wejścia i reprezentacje napisa mogą być ograniczone, aby pomóc uniknąć ataków typu "odmowa usługi". :exc:`ValueError` jest rzucone, gdy limit zostanie przekroczony podczas konwersji napisa na :class:`int` lub gdy konwersja :class:`int` na napis przekroczy limit. Zobacz dokumentację :ref:`liczba całkowita napis ograniczenia długości konwersji <int_max_str_digits>`.

source: Return ``True`` if the *object* argument is an instance of the *classinfo* argument, or of a (direct, indirect, or :term:`virtual <abstract base class>`) subclass thereof. If *object* is not an object of the given type, the function always returns ``False``. If *classinfo* is a tuple of type objects (or recursively, other such tuples) or a :ref:`types-union` of multiple types, return ``True`` if *object* is an instance of any of the types. If *classinfo* is not a type or tuple of types and such tuples, a :exc:`TypeError` exception is raised. :exc:`TypeError` may not be raised for an invalid type if an earlier check succeeds.
fa: اگر آرگومان *object* نمونه ای از آرگومان *classinfo* یا زیر کلاس (مستقیم, غیر مستقیم یا :term:`virtual <abstract base class>`) آن باشد، ``True`` را برگردانید. اگر *object* یک شی از نوع داده شده نباشد، تابع همیشه ``False`` را برمی گرداند. اگر *classinfo* چند شیء از نوع (یا به صورت بازگشتی, تاپل های دیگر) یا یک :ref:`types-union` از چندین نوع است، اگر *object* نمونه ای از هر یک از انواع است، ``True`` را برگردانید. اگر *classinfo* یک نوع یا چند تایی از انواع و چند تاپل نیست، یک استثنا :exc:`TypeError` مطرح می شود. در صورت موفقیت آمیز بودن بررسی قبلی، :exc:`TypeError` ممکن است برای نوع نامعتبر افزایش یابد.
pl: Zwraca ``True`` jeśli argument *object* jest instancją argumentu *classinfo*, lub jego (bezpośrednią, pośrednią lub :term:`wirtualną <abstrakcyjna klasa bazowa>`) podklasą. Jeśli *object* nie jest obiektem danego typu, funkcja zawsze zwraca ``False``. Jeśli *classinfo* jest krotką obiektów typu (lub rekurencyjnie, innych takich krotek) lub :ref:`types-union` wielu typów, zwraca ``True`` jeśli *obiekt* jest instancją któregokolwiek z typów. Jeśli *classinfo* nie jest typem lub krotką typów i takich krotek, rzucany jest wyjątek :exc:`TypeError`. :exc:`TypeError` może nie być rzucony dla nieprawidłowego typu, jeśli wcześniejsze sprawdzenie powiedzie się.

source: *classinfo* can be a :ref:`types-union`.
fa: *classinfo* می تواند :ref:`types-union` باشد.
pl: *classinfo* może być :ref:`types-union`.

source: Return ``True`` if *class* is a subclass (direct, indirect, or :term:`virtual <abstract base class>`) of *classinfo*. A class is considered a subclass of itself. *classinfo* may be a tuple of class objects (or recursively, other such tuples) or a :ref:`types-union`, in which case return ``True`` if *class* is a subclass of any entry in *classinfo*. In any other case, a :exc:`TypeError` exception is raised.
fa: اگر *class* یک زیر کلاس (مستقیم, غیر مستقیم یا :term:`virtual <abstract base class>`) از *classinfo* است، ``True`` را برگردانید. یک کلاس یک زیر کلاس از خودش در نظر گرفته می شود. *classinfo* ممکن است مجموعه ای از اشیاء کلاس (یا به صورت بازگشتی, تاپل های دیگر) یا یک :ref:`types-union` باشد، در این صورت اگر *class* زیر کلاس هر ورودی در *classinfo* باشد، ``True`` را برگردانید. در هر مورد دیگر، یک استثناء :exc:`TypeError` مطرح می شود.
pl: Zwraca ``True`` jeśli *class* jest podklasą (bezpośrednią, pośrednią lub :term:`wirtualną <abstrakcyjna klasa bazowa>`) *classinfo*. Klasa jest uważana za podklasę samej siebie. *classinfo* może być krotką obiektów klasy (lub rekurencyjnie, innych takich krotek) lub :ref:`types-union`, w którym to przypadku zwraca ``True`` jeśli *class* jest podklasą dowolnego wpisu w *classinfo*. W każdym innym przypadku rzucany jest wyjątek :exc:`TypeError`.

source: Return an :term:`iterator` object. The first argument is interpreted very differently depending on the presence of the second argument. Without a second argument, *object* must be a collection object which supports the :term:`iterable` protocol (the :meth:`~object.__iter__` method), or it must support the sequence protocol (the :meth:`~object.__getitem__` method with integer arguments starting at ``0``). If it does not support either of those protocols, :exc:`TypeError` is raised. If the second argument, *sentinel*, is given, then *object* must be a callable object. The iterator created in this case will call *object* with no arguments for each call to its :meth:`~iterator.__next__` method; if the value returned is equal to *sentinel*, :exc:`StopIteration` will be raised, otherwise the value will be returned.
fa: یک شی :term:`iterator` را برگردانید. استدلال اول بسته به وجود استدلال دوم بسیار متفاوت تفسیر می شود. بدون آرگومان دوم، *object* باید یک شی مجموعه ای باشد که از پروتکل :term:`iterable` (روش :meth:`~object.__iter__`) پشتیبانی می کند، یا باید از پروتکل توالی پشتیبانی کند (روش :meth:`~object.__getitem__` با آرگومان های عدد صحیح که از ``0`` شروع می شود). اگر هیچ یک از این پروتکل ها را پشتیبانی نکند، :exc:`TypeError` بالا می رود. اگر آرگومان دوم، *sentinel* داده شود، *object* باید یک شی قابل فراخوان باشد. تکرار کننده ایجاد شده در این مورد، *object* را بدون هیچ آرگومانی برای هر فراخوانی متد :meth:`~iterator.__next__` فراخوانی می کند. اگر مقدار بازگشتی برابر با *sentinel* باشد، :exc:`StopIteration` افزایش می یابد، در غیر این صورت مقدار برگردانده می شود.
pl: Zwraca obiekt :term:`iteratora <iterator>`. Pierwszy argument jest interpretowany bardzo różnie w zależności od obecności drugiego argumentu. Bez drugiego argumentu, *object* musi być obiektem kolekcji, która obsługuje protokół :term:`iterable` (metoda :meth:`~object.__iter__` ), lub musi obsługiwać protokół sekwencji (metoda :meth:`~object.__getitem__` z argumentami liczb całkowitych zaczynających się od ``0``). Jeśli nie obsługuje żadnego z tych protokołów, zostanie rzucony :exc:`TypeError`. Jeśli podano drugi argument, *sentinel*, to *object* musi być obiektem wywoływalnym. Utworzony w tym przypadku iterator będzie wywoływał *object* bez argumentu dla każdego wywołania jego metody :meth:`~iterator.__next__`; jeśli zwrócona wartość jest równa *sentinel*, zostanie rzucone :exc:`StopIteration`, w przeciwnym razie zostanie zwrócona wartość.

source: See also :ref:`typeiter`.
fa: همچنین به :ref:`typeiter` مراجعه کنید.
pl: Zobacz także :ref:`typeiter`.

source: One useful application of the second form of :func:`iter` is to build a block-reader. For example, reading fixed-width blocks from a binary database file until the end of file is reached::
fa: یکی از کاربردهای مفید فرم دوم :func:`iter` ساخت یک بلوک خوان است. به عنوان مثال، خواندن بلوک های با عرض ثابت از یک فایل پایگاه داده باینری تا پایان فایل:
pl: Jednym z przydatnych aplikacji drugiej formy :func:`iter` jest zbudowanie blok czytnika. Na przykład, odczytywanie stałej szerokości bloku z binarnego pliku bazy danych aż do osiągnięcia końca pliku::

source: from functools import partial with open('mydata.db', 'rb') as f: for block in iter(partial(f.read, 64), b''): process_block(block)
pl: from functools import partial with open('mojedane.db', 'rb') as f: for block in iter(partial(f.read, 64), b''): process_block(block)

source: Return the length (the number of items) of an object. The argument may be a sequence (such as a string, bytes, tuple, list, or range) or a collection (such as a dictionary, set, or frozen set).
fa: طول (تعداد موارد) یک شی را برگردانید. آرگومان ممکن است یک دنباله (مانند یک رشته, بایت, تاپل, لیست یا محدوده) یا یک مجموعه (مانند یک فرهنگ لغت, مجموعه, یا مجموعه ثابت) باشد.
pl: Zwraca długość (liczba elementów) obiektu. Obiekt argument może być sekwencją (taką jak napis, bajty, krotka, lista lub zakres) lub kolekcją (taką jak słownik, zbiór lub zbiór zamrożony).

source: ``len`` raises :exc:`OverflowError` on lengths larger than :data:`sys.maxsize`, such as :class:`range(2 ** 100) <range>`.
fa: ``len`` :exc:`OverflowError` را در طول های بزرگتر از :data:`sys.maxsize` مانند :class:`range(2 ** 100) <range>` افزایش می دهد.
pl: ``len`` rzuca :exc:`OverflowError` dla długości większych niż :data:`sys.maxsize`, takich jak :class:`range(2 ** 100) <range>`.

source: Rather than being a function, :class:`list` is actually a mutable sequence type, as documented in :ref:`typesseq-list` and :ref:`typesseq`.
fa: :class:`list` به جای اینکه یک تابع باشد، در واقع یک نوع توالی قابل تغییر است، همانطور که در :ref:`typesseq-list` و :ref:`typesseq` مستند شده است.
pl: Zamiast być funkcją, :class:`list` jest w rzeczywistości typem mutowalnej (zmiennej) sekwencji, jak udokumentowano w :ref:`typesseq-list` i :ref:`typesseq`.

source: Return a mapping object representing the current local symbol table, with variable names as the keys, and their currently bound references as the values.
fa: یک شی نگاشت نشان دهنده جدول نماد محلی فعلی، با نام متغیرها به عنوان کلید، و ارجاعات محدود فعلی آنها به عنوان مقادیر، برگردانید.
pl: Zwraca obiekt mapowania reprezentujący bieżącą lokalną tablicę symboli, z nazwami zmiennych jako kluczami i ich aktualnie powiązanymi referencjami jako wartościami.

source: At module scope, as well as when using :func:`exec` or :func:`eval` with a single namespace, this function returns the same namespace as :func:`globals`.
fa: در محدوده ماژول، و همچنین هنگام استفاده از :func:`exec` یا :func:`eval` با یک فضای نام واحد، این تابع همان فضای نام :func:`globals` را برمی گرداند.
pl: W zakresie moduł, a także podczas korzystania z :func:`exec` lub :func:`eval` z pojedynczą przestrzenią nazw, ta funkcja zwraca ta sama przestrzeń nazw co :func:`globals`.

source: At class scope, it returns the namespace that will be passed to the metaclass constructor.
fa: در محدوده کلاس، فضای نامی را که به سازنده متاکلاس ارسال می شود، برمی گرداند.
pl: W zakresie klasy, zwraca przestrzeń nazw, która zostanie przekazana do konstruktora metaklasy.

source: When using ``exec()`` or ``eval()`` with separate local and global arguments, it returns the local namespace passed in to the function call.
fa: هنگام استفاده از ``exec()`` یا ``eval()`` با آرگومان های محلی و سراسری جداگانه، فضای نام محلی ارسال شده به فراخوانی تابع را برمی گرداند.
pl: W przypadku korzystania z ``exec()`` lub ``eval()`` z oddzielnymi lokalnymi i globalnymi argumentami, zwraca lokalną przestrzeń nazw przekazaną do wywołania funkcji.

source: In all of the above cases, each call to ``locals()`` in a given frame of execution will return the *same* mapping object. Changes made through the mapping object returned from ``locals()`` will be visible as assigned, reassigned, or deleted local variables, and assigning, reassigning, or deleting local variables will immediately affect the contents of the returned mapping object.
fa: در تمام موارد فوق، هر فراخوانی به ``locals()`` در یک فریم اجرای معین، شی نگاشت *same* را برمی گرداند. تغییرات ایجاد شده از طریق شی نگاشت بازگشتی از ``locals()`` به عنوان متغیرهای محلی اختصاص داده شده، تخصیص مجدد یا حذف شده قابل مشاهده خواهد بود و اختصاص، تخصیص مجدد یا حذف متغیرهای محلی بلافاصله بر محتوای شی نگاشت برگشتی تأثیر می گذارد.
pl: We wszystkich powyższych przypadkach każde wywołanie ``locals()`` w danej ramce wykonania spowoduje zwracanie *tego samego* obiektu mapowania. Zmiany dokonane za pośrednictwem obiektu mapowania zwróconego z ``locals()`` będą widoczne jako przypisane, ponownie przypisane lub usunięte zmienne lokalne, a przypisanie, ponowne przypisanie lub usunięcie zmiennych lokalnych natychmiast wpłynie na zawartość zwróconego obiektu mapowania.

source: In an :term:`optimized scope` (including functions, generators, and coroutines), each call to ``locals()`` instead returns a fresh dictionary containing the current bindings of the function's local variables and any nonlocal cell references. In this case, name binding changes made via the returned dict are *not* written back to the corresponding local variables or nonlocal cell references, and assigning, reassigning, or deleting local variables and nonlocal cell references does *not* affect the contents of previously returned dictionaries.
fa: در یک :term:`optimized scope` (شامل توابع, ژنراتورها و برنامه‌های مشترک), هر فراخوانی به ``locals()`` یک فرهنگ لغت جدید حاوی پیوندهای فعلی متغیرهای محلی تابع و هر مرجع سلول غیرمحلی را برمی‌گرداند. در این مورد، تغییرات پیوند نام که از طریق دیکت برگشتی انجام می‌شود به صورت *not* به متغیرهای محلی متناظر یا مراجع سلول غیرمحلی نوشته می‌شود و تخصیص، تخصیص مجدد یا حذف متغیرهای محلی و مراجع سلول غیرمحلی، *not* بر محتویات دیکشنری‌های قبلی برگردانده شده تأثیر می‌گذارد.
pl: W :term:`optimized scope` (włączając w to funkcja, generatory i coroutines), każde wywołanie ``locals()`` zamiast zwracania świeżego słownika zawierający aktualne wiązania zmiennych lokalnych funkcji i wszelkie nielokalne odwołania do komórek. W tym przypadku zmiany powiązań nazw dokonane za pośrednictwem zwróconego dict *nie* są zapisywane z powrotem do odpowiednich zmiennych lokalnych lub nielokalnych odwołań do komórek, a przypisywanie, ponowne przypisywanie lub usuwanie zmiennych lokalnych i nielokalnych odwołań do komórek *nie* wpływa na zawartość wcześniej zwróconego słownika.

source: Calling ``locals()`` as part of a comprehension in a function, generator, or coroutine is equivalent to calling it in the containing scope, except that the comprehension's initialised iteration variables will be included. In other scopes, it behaves as if the comprehension were running as a nested function.
fa: فراخوانی ``locals()`` به عنوان بخشی از درک مطلب در یک تابع، مولد، یا کوروتین معادل فراخوانی آن در محدوده حاوی است، با این تفاوت که متغیرهای تکرار اولیه درک مطلب شامل خواهند شد. در حوزه های دیگر، به گونه ای رفتار می کند که گویی درک مطلب به عنوان یک تابع تودرتو اجرا می شود.
pl: Wywołanie ``locals()`` jako części rozumienia w funkcji, generator lub coroutine jest równoważne wywołaniu go w zakresie zawierającym, z wyjątkiem tego, że zainicjowane zmienne iteracyjne rozumienia zostaną uwzględnione. W innych zakresach zachowuje się tak, jakby rozumienie działało jako zagnieżdżone funkcja.

source: Calling ``locals()`` as part of a generator expression is equivalent to calling it in a nested generator function.
fa: فراخوانی ``locals()`` به عنوان بخشی از عبارت مولد معادل فراخوانی آن در یک تابع ژنراتور تو در تو است.
pl: Wywołanie ``locals()`` jako części wyrażenia generator jest równoważne wywołaniu go w zagnieżdżonym generatorze funkcji .

source: The behaviour of ``locals()`` in a comprehension has been updated as described in :pep:`709`.
fa: رفتار ``locals()`` در درک مطلب همانطور که در :pep:`709` توضیح داده شده است به روز شده است.
pl: Zachowanie ``locals()`` w zrozumieniu została zaktualizowana zgodnie z opisem w :pep:`709`.

source: As part of :pep:`667`, the semantics of mutating the mapping objects returned from this function are now defined. The behavior in :term:`optimized scopes <optimized scope>` is now as described above. Aside from being defined, the behaviour in other scopes remains unchanged from previous versions.
fa: به عنوان بخشی از :pep:`667`، معنای جهش اشیاء نگاشت بازگشتی از این تابع اکنون تعریف شده است. رفتار در :term:`optimized scopes <optimized scope>` اکنون همانطور که در بالا توضیح داده شد است. جدا از تعریف، رفتار در سایر حوزه ها نسبت به نسخه های قبلی بدون تغییر باقی می ماند.
pl: Jako część :pep:`667`, semantyka mutowania obiektów mapowania zwróconych z tej funkcji jest teraz zdefiniowana. Zachowanie w :term:`zoptymalizowanych zakresach <optimized scope>` jest teraz opisane powyżej. Poza zdefiniowaniem, zachowanie w innych zakresach pozostaje niezmienione w stosunku do poprzednich wersji.

source: Return an iterator that applies *function* to every item of *iterable*, yielding the results. If additional *iterables* arguments are passed, *function* must take that many arguments and is applied to the items from all iterables in parallel. With multiple iterables, the iterator stops when the shortest iterable is exhausted. For cases where the function inputs are already arranged into argument tuples, see :func:`itertools.starmap`\.
fa: یک تکرار کننده که *function* را برای هر مورد از *iterable* اعمال می کند، برگردانید و نتایج را به دست می دهد. اگر آرگومان های اضافی *iterables* ارسال شوند، *function* باید این تعداد آرگومان را بگیرد و به صورت موازی روی آیتم های همه تکرارپذیرها اعمال شود. با تکرارهای متعدد، زمانی که کوتاه ترین تکرار تمام شود، تکرار کننده متوقف می شود. برای مواردی که ورودی‌های تابع قبلاً در چند آرگومان مرتب شده‌اند، به :func:`itertools.starmap`\ مراجعه کنید.
pl: Zwraca iterator , który stosuje *funkcje* do każdego elementu *iterable*, dając wyniki. Jeśli przekazane zostaną dodatkowe *iterable* argumenty, *funkcja* musi przyjąć taką liczbę argumentow i jest stosowana do elementów ze wszystkich iterable równolegle. W przypadku wielu iterables, iterator zatrzymuje się, gdy najkrótszy iterable zostanie wyczerpany. Dla przypadków, w których wejścia funkcji są już ułożone w argumentach krotka , zobacz :func:`itertools.starmap` .

source: Return the largest item in an iterable or the largest of two or more arguments.
fa: بزرگترین مورد در یک تکرارپذیر یا بزرگترین مورد از دو یا چند آرگومان را برگردانید.
pl: Zwraca największy element w iterable lub największy z dwóch lub więcej argumentow.

source: If one positional argument is provided, it should be an :term:`iterable`. The largest item in the iterable is returned. If two or more positional arguments are provided, the largest of the positional arguments is returned.
fa: اگر یک آرگومان موقعیتی ارائه شود، باید یک :term:`iterable` باشد. بزرگترین مورد در تکرار پذیر برگردانده می شود. اگر دو یا چند آرگومان موقعیتی ارائه شود، بزرگترین آرگومان موقعیتی برگردانده می شود.
pl: Jeśli podano jeden pozycjny argument, powinien to być :term:`iterable`. Zwracany jest największy element w iterable. Jeśli podano dwa lub więcej pozycyjne argumenty, zwracany jest największy z pozycyjnych argumentow.

source: There are two optional keyword-only arguments. The *key* argument specifies a one-argument ordering function like that used for :meth:`list.sort`. The *default* argument specifies an object to return if the provided iterable is empty. If the iterable is empty and *default* is not provided, a :exc:`ValueError` is raised.
fa: دو آرگومان اختیاری فقط برای کلمه کلیدی وجود دارد. آرگومان *key* یک تابع ترتیب یک آرگومان مانند آنچه برای :meth:`list.sort` استفاده می شود را مشخص می کند. آرگومان *default* یک شی را مشخص می کند که در صورت خالی بودن تکرارپذیر ارائه شده، باید برگردد. اگر تکرارپذیر خالی باشد و *default* ارائه نشده باشد، یک :exc:`ValueError` بلند می شود.
pl: Istnieją dwa opcjonalne tylko ze słowem kluczowym argument. *Kluczowy* argument określa jedno-argumentowy uporządkowanie funkcji jak to używane dla :meth:`list.sort`. *Domyślny* argument określa obiekt do zwracania, jeśli podany iterable jest pusty. Jeśli iterable jest pusty i *domyślny* nie jest podany, :exc:`ValueError` jest rzucony.

source: If multiple items are maximal, the function returns the first one encountered. This is consistent with other sort-stability preserving tools such as ``sorted(iterable, key=keyfunc, reverse=True)[0]`` and ``heapq.nlargest(1, iterable, key=keyfunc)``.
fa: اگر چندین آیتم ماکزیمم باشند، تابع اولین موردی را که با آن مواجه شده است برمی گرداند. این با سایر ابزارهای حفظ ثبات مرتب سازی مانند ``sorted(iterable, key=keyfunc, reverse=True)[0]`` و ``heapq.nlargest(1, iterable, key=keyfunc)`` سازگار است.
pl: Jeśli wiele elementów jest maksymalnych, funkcja zwraca pierwszy napotkany element. Jest to zgodne z innymi narzędziami zachowującymi stabilność sortowania, takimi jak ``sorted(iterable, key=keyfunc, reverse=True)[0]`` i ``heapq.nlargest(1, iterable, key=keyfunc)``.

source: Added the *default* keyword-only parameter.
fa: پارامتر فقط کلمه کلیدی *default* اضافه شد.
pl: Dodano *default* tylko słowo kluczowe parametr.

source: The *key* can be ``None``.
fa: *key* می تواند ``None`` باشد.
pl: *Kluczem* może być ``None``.

source: Return a "memory view" object created from the given argument. See :ref:`typememoryview` for more information.
fa: یک شی "نمای حافظه" ایجاد شده از آرگومان داده شده را برگردانید. برای اطلاعات بیشتر به :ref:`typememoryview` مراجعه کنید.
pl: Zwraca obiekt "memory view" utworzony z podanego argumentu. Więcej informacji można znaleźć na stronie :ref:`typememoryview`.

source: Return the smallest item in an iterable or the smallest of two or more arguments.
fa: کوچکترین مورد در یک تکرارپذیر یا کوچکترین یک از دو یا چند آرگومان را برگردانید.
pl: Zwraca najmniejszy element w iterable lub najmniejszy z dwóch lub więcej argumentow.

source: If one positional argument is provided, it should be an :term:`iterable`. The smallest item in the iterable is returned. If two or more positional arguments are provided, the smallest of the positional arguments is returned.
fa: اگر یک آرگومان موقعیتی ارائه شود، باید یک :term:`iterable` باشد. کوچکترین مورد در تکرار پذیر برگردانده می شود. اگر دو یا چند آرگومان موقعیتی ارائه شود، کوچکترین آرگومان های موقعیتی برگردانده می شود.
pl: Jeśli podano jeden pozycjny argument, powinien to być :term:`iterable`. Zwracany jest najmniejszy element w iterable. Jeśli podano dwa lub więcej pozycyjne argumenty, zwracany jest najmniejszy z pozycyjnych argumentow.

source: If multiple items are minimal, the function returns the first one encountered. This is consistent with other sort-stability preserving tools such as ``sorted(iterable, key=keyfunc)[0]`` and ``heapq.nsmallest(1, iterable, key=keyfunc)``.
fa: اگر چندین آیتم حداقل باشند، تابع اولین موردی را که با آن مواجه شده است برمی گرداند. این با سایر ابزارهای حفظ ثبات مرتب سازی مانند ``sorted(iterable, key=keyfunc)[0]`` و ``heapq.nsmallest(1, iterable, key=keyfunc)`` سازگار است.
pl: Jeśli wiele elementów jest minimalnych, funkcja zwraca pierwszy napotkany. Jest to zgodne z innymi narzędziami zachowującymi stabilność sortowania, takimi jak ``sorted(iterable, key=keyfunc)[0]`` i ``heapq.nsmallest(1, iterable, key=keyfunc)``.

source: Retrieve the next item from the :term:`iterator` by calling its :meth:`~iterator.__next__` method. If *default* is given, it is returned if the iterator is exhausted, otherwise :exc:`StopIteration` is raised.
fa: با فراخوانی روش :meth:`~iterator.__next__` مورد بعدی را از :term:`iterator` بازیابی کنید. اگر *default* داده شود، اگر تکرار کننده تمام شده باشد، برگردانده می شود، در غیر این صورت :exc:`StopIteration` افزایش می یابد.
pl: Pobiera następny element z :term:`iterator` poprzez wywołanie jego metody :meth:`~iterator.__next__`. Jeśli *domyślny* jest podany, jest zwracany, jeśli iterator jest wyczerpany, w przeciwnym razie :exc:`StopIteration` jest rzucony.
