Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/functools.po
Languages: ru

source: :mod:`!functools` --- Higher-order functions and operations on callable objects
ru: :mod:`!functools` --- Функции высшего порядка и операции над вызываемыми объектами

source: **Source code:** :source:`Lib/functools.py`
ru: **Исходный код:** :source:`Lib/functools.py`

source: The :mod:`functools` module is for higher-order functions: functions that act on or return other functions. In general, any callable object can be treated as a function for the purposes of this module.
ru: Модуль :mod:`functools` предназначен для функций высшего порядка: функций, которые воздействуют на другие функции или возвращают их. В общем, любой вызываемый объект можно рассматривать как функцию для целей этого модуля.

source: The :mod:`functools` module defines the following functions:
ru: Модуль :mod:`functools` определяет следующие функции:

source: Simple lightweight unbounded function cache. Sometimes called `"memoize" <https://en.wikipedia.org/wiki/Memoization>`_.
ru: Простой, легкий, неограниченный кеш функций. Иногда называется `"memoize" <https://en.wikipedia.org/wiki/Memoization>`_.

source: Returns the same as ``lru_cache(maxsize=None)``, creating a thin wrapper around a dictionary lookup for the function arguments. Because it never needs to evict old values, this is smaller and faster than :func:`lru_cache` with a size limit.
ru: Возвращает то же, что и ``lru_cache(maxsize=None)``, создавая тонкую оболочку вокруг поиска в словаре аргументов функции. Поскольку ему никогда не требуется удалять старые значения, он меньше и быстрее, чем :func:`lru_cache` с ограничением размера.

source: For example::
ru: Например::

source: The cache is threadsafe so that the wrapped function can be used in multiple threads. This means that the underlying data structure will remain coherent during concurrent updates.
ru: Кэш является потокобезопасным, поэтому обернутую функцию можно использовать в нескольких потоках. Это означает, что базовая структура данных останется согласованной во время одновременных обновлений.

source: It is possible for the wrapped function to be called more than once if another thread makes an additional call before the initial call has been completed and cached.
ru: Обернутую функцию можно вызвать более одного раза, если другой поток выполнит дополнительный вызов до того, как первоначальный вызов будет завершен и кэширован.

source: Transform a method of a class into a property whose value is computed once and then cached as a normal attribute for the life of the instance. Similar to :func:`property`, with the addition of caching. Useful for expensive computed properties of instances that are otherwise effectively immutable.
ru: Преобразуйте метод класса в свойство, значение которого вычисляется один раз, а затем кэшируется как обычный атрибут на весь срок существования экземпляра. Аналогично :func:`property`, но с добавлением кэширования. Полезно для дорогостоящих вычисляемых свойств экземпляров, которые в противном случае фактически являются неизменяемыми.

source: Example::
ru: Пример::

source: The mechanics of :func:`cached_property` are somewhat different from :func:`property`. A regular property blocks attribute writes unless a setter is defined. In contrast, a *cached_property* allows writes.
ru: Механизм :func:`cached_property` несколько отличается от :func:`property`. Атрибут обычного свойства блокирует запись, если не определен установщик. Напротив, *cached_property* разрешает запись.

source: The *cached_property* decorator only runs on lookups and only when an attribute of the same name doesn't exist. When it does run, the *cached_property* writes to the attribute with the same name. Subsequent attribute reads and writes take precedence over the *cached_property* method and it works like a normal attribute.
ru: Декоратор *cached_property* работает только при поиске и только тогда, когда атрибут с таким же именем не существует. Когда он запускается, *cached_property* записывает в атрибут с тем же именем. Последующие операции чтения и записи атрибута имеют приоритет над методом *cached_property* и работают как обычный атрибут.

source: The cached value can be cleared by deleting the attribute. This allows the *cached_property* method to run again.
ru: Кэшированное значение можно очистить, удалив атрибут. Это позволит методу *cached_property* запуститься снова.

source: The *cached_property* does not prevent a possible race condition in multi-threaded usage. The getter function could run more than once on the same instance, with the latest run setting the cached value. If the cached property is idempotent or otherwise not harmful to run more than once on an instance, this is fine. If synchronization is needed, implement the necessary locking inside the decorated getter function or around the cached property access.
ru: *cached_property* не предотвращает возможное состояние гонки при многопоточном использовании. Функция получения может выполняться более одного раза в одном и том же экземпляре, при этом последний запуск устанавливает кэшированное значение. Если кэшированное свойство идемпотентно или иным образом не представляет опасности для многократного запуска на экземпляре, это нормально. Если необходима синхронизация, реализуйте необходимую блокировку внутри декорированной функции получения или доступа к кэшированному свойству.

source: Note, this decorator interferes with the operation of :pep:`412` key-sharing dictionaries. This means that instance dictionaries can take more space than usual.
ru: Обратите внимание, что этот декоратор мешает работе словарей совместного использования ключей :pep:`412`. Это означает, что словари экземпляров могут занимать больше места, чем обычно.

source: Also, this decorator requires that the ``__dict__`` attribute on each instance be a mutable mapping. This means it will not work with some types, such as metaclasses (since the ``__dict__`` attributes on type instances are read-only proxies for the class namespace), and those that specify ``__slots__`` without including ``__dict__`` as one of the defined slots (as such classes don't provide a ``__dict__`` attribute at all).
ru: Кроме того, этот декоратор требует, чтобы атрибут ``__dict__`` в каждом экземпляре был изменяемым сопоставлением. Это означает, что он не будет работать с некоторыми типами, такими как метаклассы (поскольку атрибуты ``__dict__`` в экземплярах типа являются прокси-серверами только для чтения для пространства имен класса) и теми, которые указывают ``__slots__`` без включения ``__dict__ `` как один из определенных слотов (поскольку такие классы вообще не предоставляют атрибут ``__dict__``).

source: If a mutable mapping is not available or if space-efficient key sharing is desired, an effect similar to :func:`cached_property` can also be achieved by stacking :func:`property` on top of :func:`lru_cache`. See :ref:`faq-cache-method-calls` for more details on how this differs from :func:`cached_property`.
ru: Если изменяемое сопоставление недоступно или требуется совместное использование ключей с эффективным использованием пространства, эффект, аналогичный :func:`cached_property`, также может быть достигнут путем наложения :func:`property` поверх :func:`lru_cache`. См. :ref:`faq-cache-method-calls` для получения более подробной информации о том, чем это отличается от :func:`cached_property`.

source: Prior to Python 3.12, ``cached_property`` included an undocumented lock to ensure that in multi-threaded usage the getter function was guaranteed to run only once per instance. However, the lock was per-property, not per-instance, which could result in unacceptably high lock contention. In Python 3.12+ this locking is removed.
ru: До Python 3.12 ``cached_property`` включал недокументированную блокировку, гарантирующую, что при многопоточном использовании функция получения гарантированно запускается только один раз для каждого экземпляра. Однако блокировка осуществлялась для каждого свойства, а не для каждого экземпляра, что могло привести к неприемлемо высокой конкуренции за блокировки. В Python 3.12+ эта блокировка удалена.

source: Transform an old-style comparison function to a :term:`key function`. Used with tools that accept key functions (such as :func:`sorted`, :func:`min`, :func:`max`, :func:`heapq.nlargest`, :func:`heapq.nsmallest`, :func:`itertools.groupby`). This function is primarily used as a transition tool for programs being converted from Python 2 which supported the use of comparison functions.
ru: Преобразуйте функцию сравнения старого стиля в :term:`ключевую функцию`. Используется с инструментами, которые принимают ключевые функции (такие как :func:`sorted`, :func:`min`, :func:`max`, :func:`heapq.nlargest`, :func:`heapq.nsmallest`, : func:`itertools.groupby`). Эта функция в основном используется как инструмент перехода для программ, конвертируемых из Python 2, которые поддерживают использование функций сравнения.

source: A comparison function is any callable that accepts two arguments, compares them, and returns a negative number for less-than, zero for equality, or a positive number for greater-than. A key function is a callable that accepts one argument and returns another value to be used as the sort key.
ru: Функция сравнения — это любой вызываемый объект, который принимает два аргумента, сравнивает их и возвращает отрицательное число для меньшего, ноль для равенства или положительное число для большего. Ключевая функция — это вызываемый объект, который принимает один аргумент и возвращает другое значение, которое будет использоваться в качестве ключа сортировки.

source: sorted(iterable, key=cmp_to_key(locale.strcoll)) # locale-aware sort order
ru: sorted(iterable, key=cmp_to_key(locale.strcoll)) # порядок сортировки с учетом локали

source: For sorting examples and a brief sorting tutorial, see :ref:`sortinghowto`.
ru: Для примеров сортировки и краткого руководства по сортировке см. :ref:`sortinghowto`.

source: Decorator to wrap a function with a memoizing callable that saves up to the *maxsize* most recent calls. It can save time when an expensive or I/O bound function is periodically called with the same arguments.
ru: Декоратор для обертывания функции вызываемым объектом с запоминанием, сохраняющим до *maxsize* последних вызовов. Это может сэкономить время, когда дорогостоящая функция или функция, связанная с вводом-выводом, периодически вызывается с одними и теми же аргументами.

source: Since a dictionary is used to cache results, the positional and keyword arguments to the function must be :term:`hashable`.
ru: Поскольку для кэширования результатов используется словарь, позиционные и ключевые аргументы функции должны быть :term:`hashable`.

source: Distinct argument patterns may be considered to be distinct calls with separate cache entries. For example, ``f(a=1, b=2)`` and ``f(b=2, a=1)`` differ in their keyword argument order and may have two separate cache entries.
ru: Различные шаблоны аргументов можно рассматривать как отдельные вызовы с отдельными записями в кэше. Например, ``f(a=1, b=2)`` и ``f(b=2, a=1)`` различаются порядком аргументов ключевого слова и могут иметь две отдельные записи в кэше.

source: If *user_function* is specified, it must be a callable. This allows the *lru_cache* decorator to be applied directly to a user function, leaving the *maxsize* at its default value of 128::
ru: Если указана *user_function*, она должна быть вызываемой. Это позволяет применять декоратор *lru_cache* непосредственно к пользовательской функции, оставляя для *maxsize* значение по умолчанию 128::

source: @lru_cache def count_vowels(sentence): return sum(sentence.count(vowel) for vowel in 'AEIOUaeiou')
ru: @lru_cache защита count_vowels (предложение): return sum(sentence.count(гласная) для гласной в «AEIOUaeiou»)

source: If *maxsize* is set to ``None``, the LRU feature is disabled and the cache can grow without bound.
ru: Если для *maxsize* установлено значение «Нет», функция LRU отключена, и кэш может расти без ограничений.

source: If *typed* is set to true, function arguments of different types will be cached separately. If *typed* is false, the implementation will usually regard them as equivalent calls and only cache a single result. (Some types such as *str* and *int* may be cached separately even when *typed* is false.)
ru: Если для параметра *typed* установлено значение true, аргументы функции разных типов будут кэшироваться отдельно. Если *typed* имеет значение false, реализация обычно будет рассматривать их как эквивалентные вызовы и кэшировать только один результат. (Некоторые типы, такие как *str* и *int*, могут кэшироваться отдельно, даже если *typed* имеет значение false.)

source: Note, type specificity applies only to the function's immediate arguments rather than their contents. The scalar arguments, ``Decimal(42)`` and ``Fraction(42)`` are be treated as distinct calls with distinct results. In contrast, the tuple arguments ``('answer', Decimal(42))`` and ``('answer', Fraction(42))`` are treated as equivalent.
ru: Обратите внимание: специфичность типа применяется только к непосредственным аргументам функции, а не к их содержимому. Скалярные аргументы Decimal(42) и Fraction(42) рассматриваются как отдельные вызовы с разными результатами. Напротив, аргументы кортежа ``('ответ', Decimal(42))`` и ``('ответ', Fraction(42))`` рассматриваются как эквивалентные.

source: The wrapped function is instrumented with a :func:`!cache_parameters` function that returns a new :class:`dict` showing the values for *maxsize* and *typed*. This is for information purposes only. Mutating the values has no effect.
ru: Обернутая функция оснащена функцией :func:`!cache_parameters`, которая возвращает новый :class:`dict`, показывающий значения для *maxsize* и *typed*. Это только в информационных целях. Изменение значений не имеет никакого эффекта.

source: To help measure the effectiveness of the cache and tune the *maxsize* parameter, the wrapped function is instrumented with a :func:`cache_info` function that returns a :term:`named tuple` showing *hits*, *misses*, *maxsize* and *currsize*.
ru: Чтобы измерить эффективность кэша и настроить параметр *maxsize*, обернутая функция оснащена функцией :func:`cache_info`, которая возвращает :term:`именованный кортеж`, показывающий *попадания*, *промахи*, * maxsize* и *currsize*.

source: The decorator also provides a :func:`cache_clear` function for clearing or invalidating the cache.
ru: Декоратор также предоставляет функцию :func:`cache_clear` для очистки или аннулирования кеша.

source: The original underlying function is accessible through the :attr:`__wrapped__` attribute. This is useful for introspection, for bypassing the cache, or for rewrapping the function with a different cache.
ru: Исходная базовая функция доступна через атрибут :attr:`__wrapped__`. Это полезно для самоанализа, обхода кеша или переобертывания функции с использованием другого кеша.

source: The cache keeps references to the arguments and return values until they age out of the cache or until the cache is cleared.
ru: В кеше хранятся ссылки на аргументы и возвращаемые значения до тех пор, пока они не устареют или пока кеш не будет очищен.

source: If a method is cached, the ``self`` instance argument is included in the cache. See :ref:`faq-cache-method-calls`
ru: Если метод кэшируется, аргумент экземпляра self включается в кеш. См. :ref:`faq-cache-method-calls`

source: An `LRU (least recently used) cache <https://en.wikipedia.org/wiki/Cache_replacement_policies#Least_Recently_Used_(LRU)>`_ works best when the most recent calls are the best predictors of upcoming calls (for example, the most popular articles on a news server tend to change each day). The cache's size limit assures that the cache does not grow without bound on long-running processes such as web servers.
ru: `Кэш LRU (наименее недавно использовавшийся) <https://en.wikipedia.org/wiki/Cache_replacement_policies#Least_Recently_Used_(LRU)>`_ работает лучше всего, когда самые последние вызовы являются лучшим предиктором предстоящих вызовов (например, самые популярные статьи на сервере новостей, как правило, меняются каждый день). Ограничение размера кэша гарантирует, что кэш не будет расти без привязки к долговыполняющимся процессам, таким как веб-серверы.

source: In general, the LRU cache should only be used when you want to reuse previously computed values. Accordingly, it doesn't make sense to cache functions with side-effects, functions that need to create distinct mutable objects on each call (such as generators and async functions), or impure functions such as time() or random().
ru: В общем, кэш LRU следует использовать только в том случае, если вы хотите повторно использовать ранее вычисленные значения. Соответственно, не имеет смысла кэшировать функции с побочными эффектами, функции, которым необходимо создавать отдельные изменяемые объекты при каждом вызове (например, генераторы и асинхронные функции), или нечистые функции, такие как time() или random().

source: Example of an LRU cache for static web content::
ru: Пример кэша LRU для статического веб-контента:

source: Example of efficiently computing `Fibonacci numbers <https://en.wikipedia.org/wiki/Fibonacci_number>`_ using a cache to implement a `dynamic programming <https://en.wikipedia.org/wiki/Dynamic_programming>`_ technique::
ru: Пример эффективного вычисления `числа Фибоначчи <https://en.wikipedia.org/wiki/Fibonacci_number>`_ с использованием кэша для реализации `динамического программирования <https://en.wikipedia.org/wiki/Dynamic_programming>`_ техника::

source: Added the *typed* option.
ru: Добавлена ​​опция *напечатано*.

source: Added the *user_function* option.
ru: Добавлен параметр *user_function*.

source: Added the function :func:`!cache_parameters`
ru: Добавлена ​​функция :func:`!cache_parameters`

source: Given a class defining one or more rich comparison ordering methods, this class decorator supplies the rest. This simplifies the effort involved in specifying all of the possible rich comparison operations:
ru: Учитывая класс, определяющий один или несколько методов упорядочивания расширенного сравнения, этот декоратор класса предоставляет все остальное. Это упрощает работу по определению всех возможных операций расширенного сравнения:

source: The class must define one of :meth:`__lt__`, :meth:`__le__`, :meth:`__gt__`, or :meth:`__ge__`. In addition, the class should supply an :meth:`__eq__` method.
ru: Класс должен определить один из :meth:`__lt__`, :meth:`__le__`, :meth:`__gt__` или :meth:`__ge__`. Кроме того, класс должен предоставить метод :meth:`__eq__`.

source: While this decorator makes it easy to create well behaved totally ordered types, it *does* come at the cost of slower execution and more complex stack traces for the derived comparison methods. If performance benchmarking indicates this is a bottleneck for a given application, implementing all six rich comparison methods instead is likely to provide an easy speed boost.
ru: Хотя этот декоратор позволяет легко создавать полностью упорядоченные типы с хорошим поведением, за это *действительно* приходится платить более медленным выполнением и более сложными трассировками стека для производных методов сравнения. Если тесты производительности показывают, что это узкое место для данного приложения, вместо этого реализация всех шести расширенных методов сравнения, вероятно, обеспечит легкий прирост скорости.

source: This decorator makes no attempt to override methods that have been declared in the class *or its superclasses*. Meaning that if a superclass defines a comparison operator, *total_ordering* will not implement it again, even if the original method is abstract.
ru: Этот декоратор не пытается переопределить методы, объявленные в классе *или его суперклассах*. Это означает, что если суперкласс определяет оператор сравнения, *total_ordering* не будет реализовывать его снова, даже если исходный метод является абстрактным.

source: Returning ``NotImplemented`` from the underlying comparison function for unrecognised types is now supported.
ru: Теперь поддерживается возврат NotImplemented из базовой функции сравнения для нераспознанных типов.

source: Return a new :ref:`partial object<partial-objects>` which when called will behave like *func* called with the positional arguments *args* and keyword arguments *keywords*. If more arguments are supplied to the call, they are appended to *args*. If additional keyword arguments are supplied, they extend and override *keywords*. Roughly equivalent to::
ru: Возвращает новый :ref:`partial object<partial-objects>`, который при вызове будет вести себя как *func*, вызванный с позиционными аргументами *args* и ключевыми словами *keywords*. Если при вызове передаются дополнительные аргументы, они добавляются к *args*. Если указаны дополнительные аргументы ключевого слова, они расширяют и переопределяют *keywords*. Примерно эквивалентно::

source: The :func:`partial` is used for partial function application which "freezes" some portion of a function's arguments and/or keywords resulting in a new object with a simplified signature. For example, :func:`partial` can be used to create a callable that behaves like the :func:`int` function where the *base* argument defaults to two:
ru: :func:`partial` используется для применения частичной функции, которая "замораживает" некоторую часть аргументов и/или ключевых слов функции, в результате чего создается новый объект с упрощенной сигнатурой. Например, :func:`partial` можно использовать для создания вызываемого объекта, который ведет себя как функция :func:`int`, где аргумент *base* по умолчанию равен двум:

source: Return a new :class:`partialmethod` descriptor which behaves like :class:`partial` except that it is designed to be used as a method definition rather than being directly callable.
ru: Возвращает новый дескриптор :class:`partialmethod`, который ведет себя как :class:`partial`, за исключением того, что он предназначен для использования в качестве определения метода, а не для прямого вызова.

source: *func* must be a :term:`descriptor` or a callable (objects which are both, like normal functions, are handled as descriptors).
ru: *func* должен быть :term:`дескриптором` или вызываемым объектом (объекты, которые оба, как и обычные функции, обрабатываются как дескрипторы).

source: When *func* is a descriptor (such as a normal Python function, :func:`classmethod`, :func:`staticmethod`, :func:`abstractmethod` or another instance of :class:`partialmethod`), calls to ``__get__`` are delegated to the underlying descriptor, and an appropriate :ref:`partial object<partial-objects>` returned as the result.
ru: Когда *func* является дескриптором (например, обычной функцией Python, :func:`classmethod`, :func:`staticmethod`, :func:`abstractmethod` или другим экземпляром :class:`partialmethod`), вызывается ` `__get__`` делегируются базовому дескриптору, и в качестве результата возвращается соответствующий :ref:`partial object<partial-objects>`.

source: When *func* is a non-descriptor callable, an appropriate bound method is created dynamically. This behaves like a normal Python function when used as a method: the *self* argument will be inserted as the first positional argument, even before the *args* and *keywords* supplied to the :class:`partialmethod` constructor.
ru: Если *func* является вызываемым объектом, не являющимся дескриптором, соответствующий связанный метод создается динамически. При использовании в качестве метода это ведет себя как обычная функция Python: аргумент *self* будет вставлен в качестве первого позиционного аргумента, даже до того, как *args* и *keywords* будут переданы в конструктор :class:`partialmethod`.
