Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/functions.po
Languages: fa, pl

source: Built-in Functions
fa: توابع داخلی
pl: Wbudowane funkcje

source: The Python interpreter has a number of functions and types built into it that are always available. They are listed here in alphabetical order.
fa: مفسر پایتون تعدادی توابع و انواع دارد که همیشه در دسترس هستند. آنها در اینجا به ترتیب حروف الفبا فهرست شده اند.
pl: Interpreter Pythona ma wbudowane wiele funkcji i typów, które zawsze są dostępne. Spisane są tutaj w kolejności alfabetycznej.

source: Return the absolute value of a number. The argument may be an integer, a floating-point number, or an object implementing :meth:`~object.__abs__`. If the argument is a complex number, its magnitude is returned.
fa: قدر مطلق یک عدد را برگردانید. آرگومان ممکن است یک عدد صحیح، یک عدد ممیز شناور یا یک شی در حال پیاده سازی :meth:`~object.__abs__` باشد. اگر آرگومان یک عدد مختلط باشد، مقدار آن برگردانده می شود.
pl: Zwraca wartość bezwzględną liczby. Argument może być liczbą całkowitą, zmiennoprzecinkową lub obiektem implementującym :meth:`~object.__abs__`. Jeśli argument jest liczbą zespoloną, zwracany jest jej moduł.

source: Return an :term:`asynchronous iterator` for an :term:`asynchronous iterable`. Equivalent to calling ``x.__aiter__()``.
fa: یک :term:`asynchronous iterator` برای :term:`asynchronous iterable` برگردانید. معادل فراخوانی ``x.__aiter__()``.
pl: Zwraca :term:`asynchroniczny iterator <asynchronous iterator>` dla :term:`asynchronicznego iterable'a <asynchronous iterable>`. Ekwiwalent wywołania ``x.__aiter__()``.

source: Note: Unlike :func:`iter`, :func:`aiter` has no 2-argument variant.
fa: نکته: برخلاف :func:`iter`، :func:`aiter` هیچ گونه آرگومان 2 ندارد.
pl: Uwaga: W przeciwieństwie do :func:`iter`, :func:`aiter` nie ma dwuargumentowego wariantu.

source: Return ``True`` if all elements of the *iterable* are true (or if the iterable is empty). Equivalent to::
fa: اگر همه عناصر *iterable* درست هستند (یا اگر تکرارپذیر خالی است) ``True`` را برگردانید. معادل::
pl: Zwraca ``True`` jeśli wszystkie elementy *iterable*'a są prawdziwe (lub jeśli iterable jest pusty). Ekwiwalent kodu::

source: When awaited, return the next item from the given :term:`asynchronous iterator`, or *default* if given and the iterator is exhausted.
fa: در صورت انتظار، آیتم بعدی را از :term:`asynchronous iterator` داده شده برگردانید، یا اگر تکرار کننده تمام شده است، *default* را برگردانید.
pl: W przypadku oczekiwania zwraca następny element z podanego :term:`asynchronicznego iteratora <asynchronous iterator>` lub wartość *default*, jeżeli jest ona podana, a iterator został wyczerpany.

source: This is the async variant of the :func:`next` builtin, and behaves similarly.
fa: این نوع async داخلی :func:`next` است و رفتار مشابهی دارد.
pl: Jest to asynchroniczny wariant wbudowanej funkcji :func:`next` i zachowuje się podobnie.

source: This calls the :meth:`~object.__anext__` method of *async_iterator*, returning an :term:`awaitable`. Awaiting this returns the next value of the iterator. If *default* is given, it is returned if the iterator is exhausted, otherwise :exc:`StopAsyncIteration` is raised.
fa: این روش :meth:`~object.__anext__` از *async_iterator* را فراخوانی می کند و یک :term:`awaitable` را برمی گرداند. در انتظار این مقدار بعدی تکرار کننده را برمی گرداند. اگر *default* داده شود، اگر تکرار کننده تمام شده باشد، برگردانده می شود، در غیر این صورت :exc:`StopAsyncIteration` افزایش می یابد.
pl: Wywołuje on metodę :meth:`~object.__anext__` *async_iteratora*, zwracając :term:`awaitable`. Oczekiwanie zwraca następną wartość iteratora. Jeśli podano wartość *default*, jest ona zwracana, jeśli iterator zostanie wyczerpany, w przeciwnym razie zostanie podniesiony wyjątek :exc:`StopAsyncIteration`.

source: Return ``True`` if any element of the *iterable* is true. If the iterable is empty, return ``False``. Equivalent to::
fa: اگر هر عنصری از *iterable* درست است، ``True`` را برگردانید. اگر تکرارپذیر خالی است، ``False`` را برگردانید. معادل::
pl: Zwraca ``True`` jeśli jakikolwiek element *iterable*'a jest prawdziwy. Jeśli iterable jest pusty, zwraca ``False``. Ekwiwalent kodu::

source: As :func:`repr`, return a string containing a printable representation of an object, but escape the non-ASCII characters in the string returned by :func:`repr` using ``\x``, ``\u``, or ``\U`` escapes. This generates a string similar to that returned by :func:`repr` in Python 2.
fa: به عنوان :func:`repr`، یک رشته حاوی نمایش قابل چاپ یک شی را برگردانید، اما از کاراکترهای غیرASCII در رشته ای که توسط :func:`repr` با استفاده از ``\x``، ``\u`` یا ``\U`` برگردانده شده است، فرار کنید. این رشته ای شبیه به رشته ای که توسط :func:`repr` در پایتون 2 برگردانده شده است ایجاد می کند.
pl: Tak jak :func:`repr`, zwraca ciąg znaków zawierający reprezentację obiektu, ale wypisuje znaki nie-ASCII w zwracanym przez :func:`repr` ciągu przy użyciu escape'ów ``\x``, ``\u`` lub ``\U``. Generuje ciąg znaków podobny do tego zwracanego przez :func:`repr` w Pythonie 2.

source: Convert an integer number to a binary string prefixed with "0b". The result is a valid Python expression. If *x* is not a Python :class:`int` object, it has to define an :meth:`~object.__index__` method that returns an integer. Some examples:
fa: یک عدد صحیح را به یک رشته باینری با پیشوند "0b" تبدیل کنید. نتیجه یک عبارت پایتون معتبر است. اگر *x* یک شی پایتون :class:`int` نیست، باید یک متد :meth:`~object.__index__` تعریف کند که یک عدد صحیح برمی گرداند. چند نمونه:
pl: Konwertuje liczbę całkowitą do binarnego ciągu znaków z prefiksem „0b”. Wynik jest poprawnym wyrażeniem Pythona. Jeśli *x* nie jest pythonowym obiektem :class:`int`, musi definiować metodę :meth:`~object.__index__`, która zwraca liczbę całkowitą. Kilka przykładów:

source: If the prefix "0b" is desired or not, you can use either of the following ways.
fa: اگر پیشوند "0b" مورد نظر است یا خیر، می توانید از یکی از راه های زیر استفاده کنید.
pl: Jeśli prefiks „0b” nie jest pożądany, możesz użyć któregoś z poniższych sposobów.

source: See also :func:`format` for more information.
fa: همچنین برای اطلاعات بیشتر به :func:`format` مراجعه کنید.
pl: Zobacz też :func:`format` by uzyskać więcej informacji.

source: Return a Boolean value, i.e. one of ``True`` or ``False``. The argument is converted using the standard :ref:`truth testing procedure <truth>`. If the argument is false or omitted, this returns ``False``; otherwise, it returns ``True``. The :class:`bool` class is a subclass of :class:`int` (see :ref:`typesnumeric`). It cannot be subclassed further. Its only instances are ``False`` and ``True`` (see :ref:`typebool`).
fa: یک مقدار بولی، یعنی یکی از ``True`` یا ``False`` را برگردانید. آرگومان با استفاده از استاندارد :ref:`truth testing procedure <truth>` تبدیل می شود. اگر آرگومان نادرست یا حذف شده باشد، ``False`` را برمی گرداند. در غیر این صورت، ``True`` را برمی گرداند. کلاس :class:`bool` زیر کلاس :class:`int` است (به :ref:`typesnumeric` مراجعه کنید). نمی توان آن را بیشتر طبقه بندی کرد. تنها نمونه های آن ``False`` و ``True`` هستند (به :ref:`typebool` مراجعه کنید).
pl: Zwraca wartość logiczną, tj. jedno z ``True`` lub ``False``. Wartość argumentu jest konwertowana przy użyciu standardowej procedury testowania :ref:`truth testing procedure<truth>`. Jeśli argument jest fałszywy lub pominięty, zwraca ``False``; w przeciwnym razie, zwraca ``True``. Klasa :class:`bool` jest podklasą klasy :class:`int` (zobacz :ref:`typesnumeric`). Nie może być dalej podklasowana. Jej jedynymi instancjami są ``False`` i ``True`` (zobacz :ref:`typebool`).

source: The parameter is now positional-only.
fa: پارامتر اکنون فقط موقعیتی است.
pl: Parametr jest teraz tylko-pozycyjny.

source: This function drops you into the debugger at the call site. Specifically, it calls :func:`sys.breakpointhook`, passing ``args`` and ``kws`` straight through. By default, ``sys.breakpointhook()`` calls :func:`pdb.set_trace` expecting no arguments. In this case, it is purely a convenience function so you don't have to explicitly import :mod:`pdb` or type as much code to enter the debugger. However, :func:`sys.breakpointhook` can be set to some other function and :func:`breakpoint` will automatically call that, allowing you to drop into the debugger of choice. If :func:`sys.breakpointhook` is not accessible, this function will raise :exc:`RuntimeError`.
fa: این تابع شما را وارد دیباگر در سایت تماس می کند. به طور خاص، :func:`sys.breakpointhook` را فراخوانی می کند و ``args`` و ``kws`` را مستقیماً عبور می دهد. به‌طور پیش‌فرض، ``sys.breakpointhook()`` :func:`pdb.set_trace` را فراخوانی می‌کند و انتظار هیچ آرگومانی را ندارد. در این مورد، این صرفاً یک تابع راحت است، بنابراین نیازی به وارد کردن صریح :mod:`pdb` یا تایپ کد زیادی برای ورود به دیباگر نیست. با این حال، :func:`sys.breakpointhook` را می توان روی عملکرد دیگری تنظیم کرد و :func:`breakpoint` به طور خودکار آن را فراخوانی می کند و به شما امکان می دهد وارد دیباگر انتخابی شوید. اگر :func:`sys.breakpointhook` قابل دسترسی نباشد، این تابع :exc:`RuntimeError` را افزایش می دهد.
pl: Ta funkcja powoduje przejście do debuggera w miejscu wywołania. W szczególności wywołuje :func:`sys.breakpointhook`, przekazując do niego bezpośrednio ``args`` i ``kws``. Domyślnie ``sys.breakpointhook()`` wywołuje funkcję :func:`pdb.set_trace` nie oczekującą argumentu. W tym przypadku jest to wyłącznie funkcja dla wygody, aby nie trzeba było jawnie importować :mod:`pdb` ani wpisywać tak dużo kodu, aby wejść do debuggera. Jednakże :func:`sys.breakpointhook` może być ustawiony na inną funkcję i :func:`breakpoint` automatycznie wywoła ją, pozwalając na przejście do wybranego debuggera. Jeśli :func:`sys.breakpointhook` nie jest dostępny, funkcja rzuci :exc:`RuntimeError`.

source: By default, the behavior of :func:`breakpoint` can be changed with the :envvar:`PYTHONBREAKPOINT` environment variable. See :func:`sys.breakpointhook` for usage details.
fa: به طور پیش فرض، رفتار :func:`breakpoint` را می توان با متغیر محیطی :envvar:`PYTHONBREAKPOINT` تغییر داد. برای جزئیات استفاده به :func:`sys.breakpointhook` مراجعه کنید.
pl: Domyślnie zachowanie funkcji :func:`breakpoint` można zmienić za pomocą zmiennej środowiskowej :envvar:`PYTHONBREAKPOINT`. Szczegółowe informacje można znaleźć w :func:`sys.breakpointhook`.

source: Note that this is not guaranteed if :func:`sys.breakpointhook` has been replaced.
fa: توجه داشته باشید که اگر :func:`sys.breakpointhook` جایگزین شده باشد، این تضمین نمی شود.
pl: Należy pamiętać, że nie jest to gwarantowane, jeśli :func:`sys.breakpointhook` został wymieniony.

source: Raises an :ref:`auditing event <auditing>` ``builtins.breakpoint`` with argument ``breakpointhook``.
fa: یک :ref:`auditing event <auditing>` ``builtins.breakpoint`` را با آرگومان ``breakpointhook`` افزایش می دهد.
pl: Rzuca :ref:`auditing event <auditing>` ``builtins.breakpoint`` z argumentem ``breakpointhook``.

source: Return a new array of bytes. The :class:`bytearray` class is a mutable sequence of integers in the range 0 <= x < 256. It has most of the usual methods of mutable sequences, described in :ref:`typesseq-mutable`, as well as most methods that the :class:`bytes` type has, see :ref:`bytes-methods`.
fa: یک آرایه جدید از بایت ها را برگردانید. کلاس :class:`bytearray` یک دنباله قابل تغییر از اعداد صحیح در محدوده 0 <= x < 256 است. این کلاس دارای اکثر روش های معمول توالی های قابل تغییر است که در :ref:`typesseq-mutable` توضیح داده شده است، و همچنین اکثر روش هایی که نوع :class:`bytes` دارد، به :ref:`bytes-methods` مراجعه کنید.
pl: Zwraca nową tablicę bajtów. Klasa :class:`bytearray` jest mutowalną sekwencją liczb całkowitych w zakresie 0 <= x < 256. Ma większość metod mutowalnych sekwencji, opisanych w :ref:`typesseq-mutable`, jak również większość metod, które ma typ :class:`bytes`, patrz :ref:`bytes-methods`.

source: The optional *source* parameter can be used to initialize the array in a few different ways:
fa: پارامتر اختیاری *source* می تواند برای مقداردهی اولیه آرایه به چند روش مختلف استفاده شود:
pl: Opcjonalny parametr *source* może być użyty do inicjalizacji tablicy na kilka różnych sposobów:

source: If it is a *string*, you must also give the *encoding* (and optionally, *errors*) parameters; :func:`bytearray` then converts the string to bytes using :meth:`str.encode`.
fa: اگر *string* است، باید پارامترهای *encoding* (و در صورت تمایل, *errors*) را نیز بدهید. سپس :func:`bytearray` با استفاده از :meth:`str.encode` رشته را به بایت تبدیل می کند.
pl: Jeśli jest *stringiem*, musisz podać również parametr *encoding* (i opcjonalnie *errors*); :func:`bytearray` konwertuje string na bajty używając :meth:`str.encode`.

source: If it is an *integer*, the array will have that size and will be initialized with null bytes.
fa: اگر *integer* باشد، آرایه آن اندازه را خواهد داشت و با بایت های تهی مقداردهی اولیه می شود.
pl: Jeśli jest *liczbą całkowitą*, tablica będzie miała taki rozmiar i będzie zainicjowana bajtami zerowymi.

source: If it is an object conforming to the :ref:`buffer interface <bufferobjects>`, a read-only buffer of the object will be used to initialize the bytes array.
fa: اگر یک شی مطابق با :ref:`buffer interface <bufferobjects>` باشد، یک بافر فقط خواندنی از شی برای مقداردهی اولیه آرایه بایت استفاده خواهد شد.
pl: Jeśli jest to obiekt spełniający :ref:`interfejs bufora <bufferobjects>`, bufor tylko-do-odczytu obiektu zostanie użyty do zainicjowania tablicy bajtów.

source: If it is an *iterable*, it must be an iterable of integers in the range ``0 <= x < 256``, which are used as the initial contents of the array.
fa: اگر *iterable* باشد، باید تکرارپذیری از اعداد صحیح در محدوده ``0 <= x < 256`` باشد که به عنوان محتویات اولیه آرایه استفاده می شود.
pl: Jeśli jest *iterablem*, musi być iterablem składającym się z liczb całkowitych w zakresie ``0 <= x < 256``, które są użyte do zainicjowania tablicy.

source: Without an argument, an array of size 0 is created.
fa: بدون آرگومان، آرایه ای به اندازه 0 ایجاد می شود.
pl: Bez argumentu tworzona jest tablica o rozmiarze 0.

source: See also :ref:`binaryseq` and :ref:`typebytearray`.
fa: همچنین به :ref:`binaryseq` و :ref:`typebytearray` مراجعه کنید.
pl: Zobacz też :ref:`binaryseq` i :ref:`typebytearray`.

source: Return a new "bytes" object which is an immutable sequence of integers in the range ``0 <= x < 256``. :class:`bytes` is an immutable version of :class:`bytearray` -- it has the same non-mutating methods and the same indexing and slicing behavior.
fa: یک شی "بایت" جدید که دنباله ای غیرقابل تغییر از اعداد صحیح در محدوده ``0 <= x < 256`` است را برگردانید. :class:`bytes` یک نسخه تغییرناپذیر از :class:`bytearray` است -- روشهای غیر جهشی یکسان و رفتار نمایه سازی و برش یکسانی دارد.
pl: Zwraca nowy obiekt „bajtów”, który jest niemutowalną sekwencją liczb całkowitych z zakresu ``0 <= x < 256``. :class:`bytes` jest niemutowalną wersją :class:`bytearray` -- ma te same niemutujące metody i to samo zachowanie indeksowania i slice'owania.

source: Accordingly, constructor arguments are interpreted as for :func:`bytearray`.
fa: بر این اساس، آرگومان های سازنده برای :func:`bytearray` تفسیر می شوند.
pl: Argumenty konstruktora są interpretowane tak jak dla :func:`bytearray`.

source: Bytes objects can also be created with literals, see :ref:`strings`.
fa: اشیاء بایتی را نیز می توان با لفظ ایجاد کرد، به :ref:`strings` مراجعه کنید.
pl: Obiekty bytes mogą być również tworzone z literałami, patrz :ref:`strings`.

source: See also :ref:`binaryseq`, :ref:`typebytes`, and :ref:`bytes-methods`.
fa: همچنین به :ref:`binaryseq`، :ref:`typebytes` و :ref:`bytes-methods` مراجعه کنید.
pl: Zobacz też :ref:`binaryseq`, :ref:`typebytes` i :ref:`bytes-methods`.

source: Return :const:`True` if the *object* argument appears callable, :const:`False` if not. If this returns ``True``, it is still possible that a call fails, but if it is ``False``, calling *object* will never succeed. Note that classes are callable (calling a class returns a new instance); instances are callable if their class has a :meth:`~object.__call__` method.
fa: اگر آرگومان *object* قابل فراخوانی ظاهر شد، :const:`True` را برگردانید، در غیر این صورت، :const:`False` را برگردانید. اگر ``True`` را برگرداند، باز هم ممکن است یک تماس با شکست مواجه شود، اما اگر ``False`` باشد، فراخوانی *object* هرگز موفق نخواهد شد. توجه داشته باشید که کلاس ها قابل فراخوانی هستند (با فراخوانی یک کلاس یک نمونه جدید برمی گردد). اگر کلاس آنها دارای متد :meth:`~object.__call__` باشد، نمونه ها قابل فراخوانی هستند.
pl: Zwraca :const:`True` jeśli argument *object* jest wywoływalny, :const:`False` jeśli nie. Jeśli zwraca ``True``, nadal możliwe jest, że wywołanie nie powiedzie się, ale jeśli zwraca ``False``, wywołanie *object* nigdy się nie powiedzie. Należy pamiętać, że klasy są wywoływalne (wywołanie klasy zwraca nową instancję); instancje są wywoływalne, jeśli ich klasa ma metodę :meth:`~object.__call__`.

source: This function was first removed in Python 3.0 and then brought back in Python 3.2.
fa: این تابع ابتدا در پایتون 3.0 حذف شد و سپس در پایتون 3.2 بازگردانده شد.
pl: Ta funkcja była wpierw usunięta w Pythonie 3.0 a następnie przywrócona w Pythonie 3.2.

source: Return the string representing a character whose Unicode code point is the integer *i*. For example, ``chr(97)`` returns the string ``'a'``, while ``chr(8364)`` returns the string ``'€'``. This is the inverse of :func:`ord`.
fa: رشته ای که نشان دهنده یک کاراکتر است که نقطه کد یونیکد آن عدد صحیح *i* است را برگردانید. برای مثال، ``chr(97)`` رشته ``'a'`` را برمی‌گرداند، در حالی که ``chr(8364)`` رشته ``'€'`` را برمی‌گرداند. این برعکس :func:`ord` است.
pl: Zwraca ciąg znaków reprezentujący znak, którego punktem kodowym Unicode jest liczba całkowita *i*. Na przykład ``chr(97)`` zwraca ciąg znaków ``'a'``, a ``chr(8364)`` zwraca ciąg ``'€'``. Jest odwrotnością :func:`ord`.

source: The valid range for the argument is from 0 through 1,114,111 (0x10FFFF in base 16). :exc:`ValueError` will be raised if *i* is outside that range.
fa: محدوده معتبر برای آرگومان از 0 تا 1,114,111 (0x10FFFF در پایه 16) است. اگر *i* خارج از این محدوده باشد، :exc:`ValueError` افزایش می یابد.
pl: Poprawnym zakresem argumentu są wartości od 0 do 1 114 111 (0x10FFFF w systemie szesnastkowym). Dla *i* poza tym zakresem zostanie rzucony :exc:`ValueError`.

source: Transform a method into a class method.
fa: یک متد را به متد کلاسی تبدیل کنید.
pl: Przekształca metodę w metodę klasową.

source: A class method receives the class as an implicit first argument, just like an instance method receives the instance. To declare a class method, use this idiom::
fa: یک متد کلاس، کلاس را به عنوان اولین آرگومان ضمنی دریافت می کند، درست مانند متد نمونه، نمونه را دریافت می کند. برای اعلام متد کلاس، از این اصطلاح استفاده کنید::
pl: Metoda klasowa otrzymuje klasę jako niejawny pierwszy argument, podobnie jak metoda instancji otrzymuje instancję. Aby zadeklarować metodę klasową, użyj tego idiomu::

source: The ``@classmethod`` form is a function :term:`decorator` -- see :ref:`function` for details.
fa: فرم ``@classmethod`` یک تابع :term:`decorator` است -- برای جزئیات به :ref:`function` مراجعه کنید.
pl: Forma ``@classmethod`` jest :term:`dekoratorem <decorator>` funkcji – szczegóły znajdziesz w :ref:`function`.

source: A class method can be called either on the class (such as ``C.f()``) or on an instance (such as ``C().f()``). The instance is ignored except for its class. If a class method is called for a derived class, the derived class object is passed as the implied first argument.
fa: یک متد کلاس را می توان بر روی کلاس (مانند ``C.f()``) یا در یک نمونه (مانند ``C().f()``) فراخوانی کرد. نمونه به جز کلاس آن نادیده گرفته می شود. اگر یک متد کلاس برای یک کلاس مشتق شده فراخوانی شود، شی کلاس مشتق شده به عنوان اولین آرگومان ضمنی ارسال می شود.
pl: Metoda klasowa może być wywoływana albo na klasie (na przykład ``C.f()``) albo na instancji (na przykład ``C().f()``). Instancja jest ignorowana, brana jest pod uwagę tylko jej klasa. Jeśli metoda klasowa jest wywołana dla klasy dziedziczącej, obiekt klasy dziedziczącej jest przekazywany jako pierwszy argument.

source: Class methods are different than C++ or Java static methods. If you want those, see :func:`staticmethod` in this section. For more information on class methods, see :ref:`types`.
fa: متدهای کلاس با روش‌های استاتیک C++ یا جاوا متفاوت هستند. اگر آنها را می خواهید، :func:`staticmethod` را در این بخش ببینید. برای اطلاعات بیشتر در مورد روش های کلاس، به :ref:`types` مراجعه کنید.
pl: Metody klasowe różnią się od statycznych metod C++ lub Javy. Jeśli chcesz takie, sprawdź :func:`staticmethod` w tej sekcji. Więcej informacji o metodach klasowych znajdziesz w :ref:`types`.

source: Class methods can now wrap other :term:`descriptors <descriptor>` such as :func:`property`.
fa: متدهای کلاس اکنون می توانند :term:`descriptors <descriptor>` دیگر مانند :func:`property` را بپیچند.
pl: Metody klasowe mogą teraz opakowywać inne :term:`deskryptory <descriptor>`, takie jak :func:`property`.

source: Class methods now inherit the method attributes (:attr:`~function.__module__`, :attr:`~function.__name__`, :attr:`~function.__qualname__`, :attr:`~function.__doc__` and :attr:`~function.__annotations__`) and have a new ``__wrapped__`` attribute.
fa: متدهای کلاس اکنون ویژگی های متد (:attr:`~function.__module__`, :attr:`~function.__name__`, :attr:`~function.__qualname__`, :attr:`~function.__doc__` و :attr:`~function.__annotations__`) را به ارث می برند و یک ویژگی ``__wrapped__`` جدید دارند.
pl: Metody klasowe dziedziczą teraz atrybuty metod (:attr:`~function.__module__`, :attr:`~function.__name__`, :attr:`~function.__qualname__`, :attr:`~function.__doc__` i :attr:`~function.__annotations__`) i mają nowy atrybut ``__wrapped__``.

source: Class methods can no longer wrap other :term:`descriptors <descriptor>` such as :func:`property`.
fa: متدهای کلاس دیگر نمی توانند :term:`descriptors <descriptor>` دیگر مانند :func:`property` را بپیچند.
pl: Metody klas nie mogą już opakowywać innych :term:`deskryptorów <descriptor>` takich jak :func:`property`.

source: Compile the *source* into a code or AST object. Code objects can be executed by :func:`exec` or :func:`eval`. *source* can either be a normal string, a byte string, or an AST object. Refer to the :mod:`ast` module documentation for information on how to work with AST objects.
fa: *source* را در یک کد یا شی AST کامپایل کنید. اشیاء کد را می توان توسط :func:`exec` یا :func:`eval` اجرا کرد. *source* می تواند یک رشته معمولی، یک رشته بایت یا یک شی AST باشد. برای اطلاعات در مورد نحوه کار با اشیاء AST به مستندات ماژول :mod:`ast` مراجعه کنید.
pl: Kompiluje *source* do obiektu kodu lub obiektu AST. Obiekty kodu mogą wyć wykonywane przy użyciu :func:`exec` lub :func:`eval`. *source* może być zwykłym ciągiem znaków, ciągiem bajtów lub obiektem AST. W dokumentacji modułu :mod:`ast` znajdziesz informacje o tym jak pracować z obiektami AST.

source: The *filename* argument should give the file from which the code was read; pass some recognizable value if it wasn't read from a file (``'<string>'`` is commonly used).
fa: آرگومان *filename* باید فایلی را ارائه کند که کد از آن خوانده شده است. اگر از یک فایل خوانده نشده باشد مقداری قابل تشخیص را ارسال کنید (معمولاً از ``'<string>'`` استفاده می شود).
pl: Argument *filename* powinien dawać plik, z którego kod został przeczytany; przekaż jakąś rozpoznawalną wartość, jeśli nie został przeczytany z pliku (często używa się ``'<string>'``).
