Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/functions.po
Languages: fa, pl

source: The :attr:`~type.__mro__` attribute of the class corresponding to *object_or_type* lists the method resolution search order used by both :func:`getattr` and :func:`super`. The attribute is dynamic and can change whenever the inheritance hierarchy is updated.
fa: ویژگی :attr:`~type.__mro__` کلاس مربوط به *object_or_type* ترتیب جستجوی وضوح روش مورد استفاده توسط :func:`getattr` و :func:`super` را فهرست می کند. ویژگی پویا است و هر زمان که سلسله مراتب وراثت به روز شود می تواند تغییر کند.
pl: :attr:`~type.__mro__` atrybut klasy odpowiadającej *object_or_type* wymienia kolejność wyszukiwania metod używaną zarówno przez :func:`getattr` jak i :func:`super`. Adres atrybut jest dynamiczny i może ulec zmianie przy każdej aktualizacji hierarchii dziedziczenia.

source: If the second argument is omitted, the super object returned is unbound. If the second argument is an object, ``isinstance(obj, type)`` must be true. If the second argument is a type, ``issubclass(type2, type)`` must be true (this is useful for classmethods).
fa: اگر آرگومان دوم حذف شود، شی فوق العاده بازگردانده شده بدون محدودیت است. اگر آرگومان دوم یک شی باشد، ``isinstance(obj, type)`` باید درست باشد. اگر آرگومان دوم یک نوع باشد، ``issubclass(type2, type)`` باید درست باشد (این برای متدهای کلاس مفید است).
pl: Jeśli drugi argument zostanie pominięty, zwrócony superobiekt jest niezwiązany. Jeśli drugi argument jest obiektem, ``isinstance(obj, type)`` musi być prawda. Jeśli drugi argument jest typem, ``issubclass(type2, type)`` musi być prawda (jest to przydatne dla metod klasowych).

source: When called directly within an ordinary method of a class, both arguments may be omitted ("zero-argument :func:`!super`"). In this case, *type* will be the enclosing class, and *obj* will be the first argument of the immediately enclosing function (typically ``self``). (This means that zero-argument :func:`!super` will not work as expected within nested functions, including generator expressions, which implicitly create nested functions.)
fa: هنگامی که مستقیماً در یک متد معمولی یک کلاس فراخوانی می شود، هر دو آرگومان ممکن است حذف شوند ("Argument Zero-Argument :func:`!super`"). در این حالت، *type* کلاس احاطه کننده و *obj* اولین آرگومان تابع محصور کننده فوری (معمولاً ``self``) خواهد بود. (این بدان معناست که :func:`!super` با آرگومان صفر در توابع تو در تو, از جمله عبارات مولد, که به طور ضمنی توابع تودرتو ایجاد می کنند, مطابق انتظار عمل نمی کند.)
pl: W przypadku wywołania bezpośrednio w zwykłej metodzie klasy, obie argument mogą zostać pominięte ("zero-argument :func:`!super` "). W takim przypadku *type* będzie klasą otaczającą, a *obj* będzie pierwszym argumentem bezpośrednio otaczającego funkcje (zazwyczaj ``self``). (Oznacza to, że zero-argument :func:`!super` nie będzie działać zgodnie z oczekiwaniami wewnątrz zagnieżdżonych funkci, w tym wyrażeń generator, które domyślnie tworzą zagnieżdżone funkcje).

source: There are two typical use cases for *super*. In a class hierarchy with single inheritance, *super* can be used to refer to parent classes without naming them explicitly, thus making the code more maintainable. This use closely parallels the use of *super* in other programming languages.
fa: دو مورد استفاده معمولی برای *super* وجود دارد. در یک سلسله مراتب کلاس با وراثت تک، *super* می تواند برای ارجاع به کلاس های والد بدون نامگذاری صریح استفاده شود، بنابراین کد قابل نگهداری تر می شود. این استفاده با استفاده از *super* در سایر زبان های برنامه نویسی مشابه است.
pl: Istnieją dwa typowe przypadki użycia *super*. W hierarchii klas z pojedynczym dziedziczeniem, *super* może być używany do odwoływania się do klas nadrzędnych bez ich jawnego nazywania, dzięki czemu kod jest łatwiejszy w utrzymaniu. To zastosowanie jest bardzo podobne do użycia *super* w innych językach programowania.

source: The second use case is to support cooperative multiple inheritance in a dynamic execution environment. This use case is unique to Python and is not found in statically compiled languages or languages that only support single inheritance. This makes it possible to implement "diamond diagrams" where multiple base classes implement the same method. Good design dictates that such implementations have the same calling signature in every case (because the order of calls is determined at runtime, because that order adapts to changes in the class hierarchy, and because that order can include sibling classes that are unknown prior to runtime).
fa: دومین مورد استفاده، پشتیبانی از وراثت چندگانه تعاونی در یک محیط اجرای پویا است. این مورد استفاده مختص پایتون است و در زبان‌های کامپایل‌شده یا زبان‌هایی که فقط از وراثت تک پشتیبانی می‌کنند، یافت نمی‌شود. این امکان پیاده سازی "نمودارهای الماس" را فراهم می کند که در آن چندین کلاس پایه یک روش را اجرا می کنند. طراحی خوب حکم می‌کند که چنین پیاده‌سازی‌هایی دارای امضای فراخوانی یکسانی در هر مورد باشند (زیرا ترتیب تماس‌ها در زمان اجرا تعیین می‌شود, زیرا این ترتیب با تغییرات سلسله مراتب کلاس سازگار می‌شود, و چون این ترتیب می‌تواند شامل کلاس‌های خواهر و برادری باشد که قبل از اجرا ناشناخته هستند).
pl: Drugim przypadkiem użycia jest obsługa kooperatywnego dziedziczenia wielokrotnego w dynamicznym środowisku wykonawczym. Ten przypadek użycia jest unikalny dla Python i nie występuje w statycznie kompilowanych językach lub językach, które obsługują tylko pojedyncze dziedziczenie. Umożliwia to implementację "diagramów diamentowych", w których wiele klas bazowych implementuje tę samą metodę. Dobry projekt nakazuje, aby takie implementacje miały tę samą sygnaturę wywołania w każdym przypadku (ponieważ kolejność wywołań jest określana w czasie wykonywania, ponieważ kolejność ta dostosowuje się do zmian w hierarchii klas i ponieważ kolejność ta może obejmować klasy rodzeństwa, które są nieznane przed uruchomieniem).

source: For both use cases, a typical superclass call looks like this::
fa: برای هر دو مورد استفاده، یک فراخوانی معمولی سوپرکلاس به صورت زیر است:
pl: W obu przypadkach typowe wywołanie superklasy wygląda następująco::

source: class C(B): def method(self, arg): super().method(arg) # This does the same thing as: # super(C, self).method(arg)
pl: class C(B): def methoda(self, arg): super().methoda(arg) # To robi to samo co: # super(C, self).methoda(arg)

source: In addition to method lookups, :func:`super` also works for attribute lookups. One possible use case for this is calling :term:`descriptors <descriptor>` in a parent or sibling class.
fa: علاوه بر جستجوی روش، :func:`super` برای جستجوی ویژگی ها نیز کار می کند. یکی از موارد استفاده ممکن برای این، فراخوانی :term:`descriptors <descriptor>` در کلاس والدین یا خواهر و برادر است.
pl: Oprócz wyszukiwania metod, :func:`super` działa również dla wyszukiwania atrybut. Jednym z możliwych przypadków użycia jest wywołanie :term:`descriptors <descriptor>` w klasie nadrzędnej lub podrzędnej.

source: Note that :func:`super` is implemented as part of the binding process for explicit dotted attribute lookups such as ``super().__getitem__(name)``. It does so by implementing its own :meth:`~object.__getattribute__` method for searching classes in a predictable order that supports cooperative multiple inheritance. Accordingly, :func:`super` is undefined for implicit lookups using statements or operators such as ``super()[name]``.
fa: توجه داشته باشید که :func:`super` به عنوان بخشی از فرآیند binding برای جستجوی مشخصه های نقطه گذاری صریح مانند ``super().__getitem__(name)`` پیاده سازی می شود. این کار را با پیاده‌سازی روش :meth:`~object.__getattribute__` خود برای جستجوی کلاس‌ها با ترتیبی قابل پیش‌بینی انجام می‌دهد که از وراثت چندگانه تعاونی پشتیبانی می‌کند. بر این اساس، :func:`super` برای جستجوهای ضمنی با استفاده از عبارات یا عملگرهایی مانند ``super()[name]`` تعریف نشده است.
pl: Należy zauważyć, że :func:`super` jest zaimplementowany jako część wiązania przetwarzanie/proces dla jawnego wyszukiwania kropkowego atrybut, takiego jak ``super().__getitem__(name)``. Czyni to poprzez implementację własnej metody :meth:`~object.__getattribute__` do wyszukiwania klas w przewidywalnej kolejności, która obsługuje wielokrotne dziedziczenie oparte na współpracy. Odpowiednio, :func:`super` jest niezdefiniowany dla niejawnych wyszukiwań przy użyciu instrukcja lub operatorów takich jak ``super()[name]``.

source: Also note that, aside from the zero argument form, :func:`super` is not limited to use inside methods. The two argument form specifies the arguments exactly and makes the appropriate references. The zero argument form only works inside a class definition, as the compiler fills in the necessary details to correctly retrieve the class being defined, as well as accessing the current instance for ordinary methods.
fa: همچنین توجه داشته باشید که به غیر از فرم آرگومان صفر، :func:`super` محدود به استفاده از متدهای داخلی نیست. فرم دو آرگومان آرگومان ها را دقیقا مشخص می کند و ارجاعات مناسب را ایجاد می کند. فرم آرگومان صفر فقط در داخل تعریف کلاس کار می کند، زیرا کامپایلر جزئیات لازم را برای بازیابی صحیح کلاس تعریف شده و همچنین دسترسی به نمونه فعلی برای متدهای معمولی پر می کند.
pl: Należy również pamiętać, że poza formą zero argument, :func:`super` nie jest ograniczona do użycia wewnątrz metod. Dwie formy argumentów dokładnie określają argumenty i tworzą odpowiednie odniesienia. Forma zero argumentów działa tylko wewnątrz definicja klasy, ponieważ kompilator wypełnia niezbędne szczegóły, aby poprawnie pobrać definiowaną klasę, a także uzyskać dostęp do bieżącej instancji dla zwykłych metod.

source: For practical suggestions on how to design cooperative classes using :func:`super`, see `guide to using super() <https://rhettinger.wordpress.com/2011/05/26/super-considered-super/>`_.
fa: برای پیشنهادات عملی در مورد نحوه طراحی کلاس های تعاونی با استفاده از :func:`super`، به `guide to using super() <https://rhettinger.wordpress.com/2011/05/26/super-considered-super/>`_ مراجعه کنید.
pl: Praktyczne sugestie dotyczące projektowania klas współpracujących przy użyciu :func:`super` można znaleźć w `poradniku korzystania z super() <https://rhettinger.wordpress.com/2011/05/26/super-considered-super/>`_.

source: Rather than being a function, :class:`tuple` is actually an immutable sequence type, as documented in :ref:`typesseq-tuple` and :ref:`typesseq`.
fa: :class:`tuple` به جای اینکه یک تابع باشد، در واقع یک نوع دنباله تغییر ناپذیر است، همانطور که در :ref:`typesseq-tuple` و :ref:`typesseq` مستند شده است.
pl: Zamiast być funkcja, :class:`tuple` jest w rzeczywistości niezmiennym typem sekwencji, jak udokumentowano w :ref:`typesseq-tuple` i :ref:`typesseq`.

source: With one argument, return the type of an *object*. The return value is a type object and generally the same object as returned by :attr:`object.__class__`.
fa: با یک آرگومان، نوع *object* را برگردانید. مقدار بازگشتی یک شی نوع و عموماً همان شیء است که توسط :attr:`object.__class__` برگردانده شده است.
pl: Z jednym argumentem, zwraca typ *obiektu*. Typ zwracanej wartość jest obiektem typu i generalnie jest to ten sam obiekt, który został zwrócony przez :attr:`object.__class__`.

source: The :func:`isinstance` built-in function is recommended for testing the type of an object, because it takes subclasses into account.
fa: تابع داخلی :func:`isinstance` برای آزمایش نوع یک شی توصیه می شود، زیرا زیر کلاس ها را در نظر می گیرد.
pl: Funckja wbudowana :func:`isinstance` jest zalecana do testowania typu obiektu, ponieważ uwzględnia podklasa.

source: With three arguments, return a new type object. This is essentially a dynamic form of the :keyword:`class` statement. The *name* string is the class name and becomes the :attr:`~type.__name__` attribute. The *bases* tuple contains the base classes and becomes the :attr:`~type.__bases__` attribute; if empty, :class:`object`, the ultimate base of all classes, is added. The *dict* dictionary contains attribute and method definitions for the class body; it may be copied or wrapped before becoming the :attr:`~type.__dict__` attribute. The following two statements create identical :class:`!type` objects:
fa: با سه آرگومان، یک شی از نوع جدید برگردانید. این در اصل یک شکل پویا از دستور :keyword:`class` است. رشته *name* نام کلاس است و به ویژگی :attr:`~type.__name__` تبدیل می شود. تاپل *bases* شامل کلاس های پایه است و به ویژگی :attr:`~type.__bases__` تبدیل می شود. اگر خالی باشد، :class:`object`، پایه نهایی همه کلاس ها، اضافه می شود. فرهنگ لغت *dict* شامل تعاریف ویژگی و متد برای بدنه کلاس است. ممکن است قبل از تبدیل شدن به ویژگی :attr:`~type.__dict__` کپی یا بسته بندی شود. دو عبارت زیر اشیاء :class:`!type` یکسان ایجاد می کنند:
pl: Z trzema argumentamy, zwracać nowy typ obiektu. Jest to zasadniczo dynamiczna forma :keyword:`class` instrukcja . *name* napis jest nazwą klasy i staje się :attr:`~type.__name__` atrybut . *bases* krotka zawiera klasy bazowe i staje się :attr:`~type.__bases__` atrybut ; jeśli jest pusta, dodawana jest :class:`object`, ostateczna baza wszystkich klas. The *dict* słownik zawiera atrybut i definicje metod dla ciało klasy; może być kopiowany lub zawijany zanim stanie się :attr:`~type.__dict__` atrybut . Następujące dwa instrukcja tworzą identyczne :class:`!type` obiekty:

source: See also:
fa: همچنین ببینید:
pl: Zobacz także:

source: :ref:`Documentation on attributes and methods on classes <class-attrs-and-methods>`.
pl: :ref:`Dokumentacja atrybutow i metod na klasach <class-attrs-and-methods>`.

source: Keyword arguments provided to the three argument form are passed to the appropriate metaclass machinery (usually :meth:`~object.__init_subclass__`) in the same way that keywords in a class definition (besides *metaclass*) would.
fa: آرگومان های کلیدواژه ارائه شده به فرم سه آرگومان به ماشین های متاکلاس مناسب (معمولاً :meth:`~object.__init_subclass__`) به همان روشی که کلمات کلیدی در تعریف کلاس (علاوه بر *metaclass*) ارائه می شوند، ارسال می شود.
pl: Argument nazwane dostarczone do trzech formularzy argumenty są przekazywane do odpowiedniego mechanizmu metaklas (zwykle :meth:`~object.__init_subclass__`) w taki sam sposób, jak słowa kluczowe w definicja klasy (poza *metaclass*).

source: See also :ref:`class-customization`.
fa: همچنین به :ref:`class-customization` مراجعه کنید.
pl: Zobacz także :ref:`class-customization`.

source: Subclasses of :class:`!type` which don't override ``type.__new__`` may no longer use the one-argument form to get the type of an object.
fa: زیر کلاس‌های :class:`!type` که ``type.__new__`` را لغو نمی‌کنند، دیگر نمی‌توانند از فرم تک آرگومان برای دریافت نوع یک شی استفاده کنند.
pl: Podklasy z :class:`!type`, które nie nadpisują ``type.__new__`` nie mogą już używać formy jednego-argumentu do uzyskania typu obiektu.

source: Return the :attr:`~object.__dict__` attribute for a module, class, instance, or any other object with a :attr:`!__dict__` attribute.
fa: ویژگی :attr:`~object.__dict__` را برای یک ماژول، کلاس، نمونه یا هر شی دیگری با ویژگی :attr:`!__dict__` برگردانید.
pl: Zwraca atrybut :attr:`~object.__dict__` dla moduł, klas, instancji lub dowolnego innego obiektu z :attr:`!__dict__` atrybut .

source: Objects such as modules and instances have an updateable :attr:`~object.__dict__` attribute; however, other objects may have write restrictions on their :attr:`!__dict__` attributes (for example, classes use a :class:`types.MappingProxyType` to prevent direct dictionary updates).
fa: اشیایی مانند ماژول ها و نمونه ها دارای ویژگی :attr:`~object.__dict__` قابل به روز رسانی هستند. با این حال، اشیاء دیگر ممکن است محدودیت های نوشتن در ویژگی های :attr:`!__dict__` خود داشته باشند (به عنوان مثال, کلاس ها از :class:`types.MappingProxyType` برای جلوگیری از به روز رسانی مستقیم فرهنگ لغت استفاده می کنند).
pl: Obiekty takie jak moduł i instancje mają możliwość aktualizacji :attr:`~object.__dict__` atrybut; jednak inne obiekty mogą mieć ograniczenia zapisu na ich :attr:`!__dict__` atrybut (na przykład klasy używają :class:`types.MappingProxyType`, aby zapobiec bezpośrednim aktualizacjom słownika).

source: Without an argument, :func:`vars` acts like :func:`locals`.
fa: بدون استدلال، :func:`vars` مانند :func:`locals` عمل می کند.
pl: Bez argumenta, :func:`vars` działa jak :func:`locals`.

source: A :exc:`TypeError` exception is raised if an object is specified but it doesn't have a :attr:`~object.__dict__` attribute (for example, if its class defines the :attr:`~object.__slots__` attribute).
fa: یک استثنا :exc:`TypeError` در صورتی مطرح می شود که یک شی مشخص شده باشد اما ویژگی :attr:`~object.__dict__` نداشته باشد (به عنوان مثال, اگر کلاس آن ویژگی :attr:`~object.__slots__` را تعریف کند).
pl: Wyjątek :exc:`TypeError` jest rzucony, jeśli obiekt jest określony, ale nie ma :attr:`~object.__dict__` atrybut (na przykład, jeśli jego klasa definiuje :attr:`~object.__slots__` atrybut ).

source: The result of calling this function without an argument has been updated as described for the :func:`locals` builtin.
fa: نتیجه فراخوانی این تابع بدون آرگومان همانطور که برای داخلی :func:`locals` توضیح داده شد به روز شده است.
pl: Wynik wywołania tej funkcji bez argumentow został zaktualizowany zgodnie z opisem dla wbudowanej :func:`locals` .

source: Iterate over several iterables in parallel, producing tuples with an item from each one.
fa: بر روی چندین تکرار به صورت موازی تکرار کنید، تاپل هایی با یک آیتم از هر یک تولید کنید.
pl: Iteruje równolegle po kilku iterables, tworząc krotke z elementem z każdej z nich.

source: Example::
fa: مثال::
pl: Przykład::

source: >>> for item in zip([1, 2, 3], ['sugar', 'spice', 'everything nice']): ... print(item) ... (1, 'sugar') (2, 'spice') (3, 'everything nice')
pl: >>> for item in zip([1, 2, 3], ['cukier', 'przyprawa', 'wszystko fajnie']): ... print(item) ... (1, 'cukier') (2, "przyprawa") (3, "wszystko fajnie")

source: More formally: :func:`zip` returns an iterator of tuples, where the *i*-th tuple contains the *i*-th element from each of the argument iterables.
fa: به طور رسمی تر: :func:`zip` یک تکرار از تاپل ها را برمی گرداند، که در آن تاپل *i*-امین عنصر *i*-امین هر یک از تکرارپذیرهای آرگومان است.
pl: Bardziej formalnie: :func:`zip` zwraca i iterator z krotka, gdzie *i*-ty krotka zawiera *i*-ty element z każdego z argument iterable .

source: Another way to think of :func:`zip` is that it turns rows into columns, and columns into rows. This is similar to `transposing a matrix <https://en.wikipedia.org/wiki/Transpose>`_.
fa: راه دیگری برای فکر کردن به :func:`zip` این است که ردیف ها را به ستون و ستون ها را به ردیف تبدیل می کند. این شبیه به `transposing a matrix <https://en.wikipedia.org/wiki/Transpose>`_ است.
pl: Innym sposobem myślenia o :func:`zip` jest to, że zamienia wiersze w kolumny, a kolumny w wiersze. Jest to podobne do `przekształcania macierzy <https://en.wikipedia.org/wiki/Transpose>`_.

source: :func:`zip` is lazy: The elements won't be processed until the iterable is iterated on, e.g. by a :keyword:`!for` loop or by wrapping in a :class:`list`.
fa: :func:`zip` تنبل است: عناصر پردازش نمی شوند تا زمانی که تکرار شونده روی آن تکرار شود، به عنوان مثال. توسط یک حلقه :keyword:`!for` یا با پیچیدن در یک :class:`list`.
pl: :func:`zip` jest leniwy: Elementy nie będą przetwarzane, dopóki iterable nie zostanie poddany iteracji, np. przez pętlę :keyword:`!for` lub przez zawinięcie w :class:`list`.

source: One thing to consider is that the iterables passed to :func:`zip` could have different lengths; sometimes by design, and sometimes because of a bug in the code that prepared these iterables. Python offers three different approaches to dealing with this issue:
fa: نکته ای که باید در نظر گرفت این است که تکرارهای ارسال شده به :func:`zip` می توانند طول های متفاوتی داشته باشند. گاهی بر اساس طراحی، و گاهی به دلیل وجود اشکال در کدی که این تکرارپذیرها را آماده کرده است. پایتون سه رویکرد مختلف برای مقابله با این موضوع ارائه می دهد:
pl: Jedną rzeczą, którą należy wziąć pod uwagę, jest to, że iterable przekazywane do :func:`zip` mogą mieć różne długości; czasami z założenia, a czasami z powodu błędu w kodzie, który przygotował te iterable. Python oferuje trzy różne podejścia do radzenia sobie z tym problemem:

source: By default, :func:`zip` stops when the shortest iterable is exhausted. It will ignore the remaining items in the longer iterables, cutting off the result to the length of the shortest iterable::
fa: به‌طور پیش‌فرض، :func:`zip` زمانی متوقف می‌شود که کوتاه‌ترین قابل تکرار تمام شود. موارد باقیمانده در تکرارپذیرهای طولانی‌تر را نادیده می‌گیرد و نتیجه را به طول کوتاه‌ترین تکرارپذیر کاهش می‌دهد::
pl: Przez domyślny, :func:`zip` zatrzymuje się, gdy najkrótszy iterable jest wyczerpany. Zignoruje pozostałe elementy w dłuższym iterable, obcinając wynik do długości najkrótszego iterable::

source: :func:`zip` is often used in cases where the iterables are assumed to be of equal length. In such cases, it's recommended to use the ``strict=True`` option. Its output is the same as regular :func:`zip`::
fa: :func:`zip` اغلب در مواردی استفاده می شود که طول تکرارپذیرها برابر فرض می شود. در چنین مواردی، توصیه می شود از گزینه ``strict=True`` استفاده کنید. خروجی آن مانند :func:`zip` معمولی است::
pl: :func:`zip` jest często używana w przypadkach, gdy zakłada się, że iterable są równej długości. W takich przypadkach zaleca się użycie opcji ``strict=True``. Jej wynik jest taki sam jak zwykłego :func:`zip`::

source: Unlike the default behavior, it raises a :exc:`ValueError` if one iterable is exhausted before the others:
fa: برخلاف رفتار پیش‌فرض، اگر یک تکرار قبل از بقیه تمام شود، یک :exc:`ValueError` را افزایش می‌دهد:
pl: W przeciwieństwie do domyślnego zachowania , rzuci :exc:`ValueError`, jeśli jeden iterable zostanie wyczerpany przed innymi:

source: Without the ``strict=True`` argument, any bug that results in iterables of different lengths will be silenced, possibly manifesting as a hard-to-find bug in another part of the program.
fa: بدون آرگومان ``strict=True``، هر اشکالی که منجر به تکرارپذیری با طول های مختلف شود، خاموش می شود و احتمالاً به عنوان یک اشکال به سختی یافتن در قسمت دیگری از برنامه ظاهر می شود.
pl: Bez ``strict=True`` argumentu, każdy błąd, który skutkuje iterable o różnych długościach zostanie wyciszony, prawdopodobnie objawiając się jako trudny do znalezienia błąd w innej części programu.

source: Shorter iterables can be padded with a constant value to make all the iterables have the same length. This is done by :func:`itertools.zip_longest`.
fa: تکرارهای کوتاه‌تر را می‌توان با یک مقدار ثابت اضافه کرد تا طول همه تکرار شونده‌ها یکسان باشد. این کار توسط :func:`itertools.zip_longest` انجام می شود.
pl: Krótsze iterable mogą być uzupełnione stałą wartością, aby wszystkie iterable miały taką samą długość. Odbywa się to poprzez :func:`itertools.zip_longest`.

source: Edge cases: With a single iterable argument, :func:`zip` returns an iterator of 1-tuples. With no arguments, it returns an empty iterator.
fa: موارد لبه: با یک آرگومان تکرارپذیر، :func:`zip` تکرار کننده 1-tuples را برمی گرداند. بدون هیچ آرگومان، یک تکرار کننده خالی برمی گرداند.
pl: Przypadki brzegowe: Z pojedynczym iterable argument, :func:`zip` zwraca iterator z 1-krotka. Bez argumentu, to zwraca pusty iterator.

source: Tips and tricks:
fa: نکات و ترفندها:
pl: Wskazówki i porady:
