Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/functions.po
Languages: fa, pl

source: If no argument is given, ``0.0`` is returned.
fa: اگر آرگومان داده نشود، ``0.0`` برگردانده می شود.
pl: Jeśli nie podano argumentu, zwracane jest ``0.0``.

source: The float type is described in :ref:`typesnumeric`.
fa: نوع شناور در :ref:`typesnumeric` توضیح داده شده است.
pl: Typ float został opisany na stronie :ref:`typesnumeric`.

source: Falls back to :meth:`~object.__index__` if :meth:`~object.__float__` is not defined.
fa: اگر :meth:`~object.__float__` تعریف نشده باشد به :meth:`~object.__index__` برمی گردد.
pl: Powraca do :meth:`~object.__index__`, jeśli :meth:`~object.__float__` nie jest zdefiniowane.

source: Convert a *value* to a "formatted" representation, as controlled by *format_spec*. The interpretation of *format_spec* will depend on the type of the *value* argument; however, there is a standard formatting syntax that is used by most built-in types: :ref:`formatspec`.
fa: یک *value* را به یک نمایش "قالب‌بندی شده" که توسط *format_spec* کنترل می‌شود، تبدیل کنید. تفسیر *format_spec* به نوع آرگومان *value* بستگی دارد. با این حال، یک نحو قالب بندی استاندارد وجود دارد که توسط اکثر انواع داخلی استفاده می شود: :ref:`formatspec`.
pl: Konwertuje *value* na "formatted" reprezentację, kontrolowaną przez *format_spec*. Interpretacja *format_spec* będzie zależeć od typu *value* argument; jednak istnieje standardowa składnia formatowania, która jest używana przez większość typów wbudowanych: :ref:`formatspec`.

source: The default *format_spec* is an empty string which usually gives the same effect as calling :func:`str(value) <str>`.
fa: *format_spec* پیش‌فرض یک رشته خالی است که معمولاً همان جلوه فراخوانی :func:`str(value) <str>` را می‌دهد.
pl: Parametr domyślny *format_spec* jest pustym napisem, co zwykle daje taki sam efekt jak wywołanie :func:`str(value) <str>`.

source: A call to ``format(value, format_spec)`` is translated to ``type(value).__format__(value, format_spec)`` which bypasses the instance dictionary when searching for the value's :meth:`~object.__format__` method. A :exc:`TypeError` exception is raised if the method search reaches :mod:`object` and the *format_spec* is non-empty, or if either the *format_spec* or the return value are not strings.
fa: تماس با ``format(value, format_spec)`` به ``type(value).__format__(value, format_spec)`` ترجمه می شود که هنگام جستجوی روش :meth:`~object.__format__` مقدار، فرهنگ لغت نمونه را دور می زند. اگر جستجوی روش به :mod:`object` برسد و *format_spec* خالی نباشد، یا اگر *format_spec* یا مقدار بازگشتی رشته ای نباشند، یک استثنا :exc:`TypeError` ایجاد می شود.
pl: Wywołanie ``format(value, format_spec)`` jest tłumaczone na ``type(value).__format__(value, format_spec)``, które omija instancję słownika podczas wyszukiwania metody :meth:`~object.__format__` wartości . Wyjątek :exc:`TypeError` jest rzucony, jeśli wyszukiwanie metody osiągnie :mod:`object` i *format_spec* jest niepusty, lub jeśli *format_spec* lub wartość zwracana nie są napisem.

source: ``object().__format__(format_spec)`` raises :exc:`TypeError` if *format_spec* is not an empty string.
fa: اگر *format_spec* یک رشته خالی نباشد، ``object().__format__(format_spec)`` :exc:`TypeError` را افزایش می دهد.
pl: ``object().__format__(format_spec)`` rzuci :exc:`TypeError` jeśli *format_spec* nie jest pustym napisem.

source: Return a new :class:`frozenset` object, optionally with elements taken from *iterable*. ``frozenset`` is a built-in class. See :class:`frozenset` and :ref:`types-set` for documentation about this class.
fa: یک شی :class:`frozenset` جدید، به صورت اختیاری با عناصر گرفته شده از *iterable* برگردانید. ``frozenset`` یک کلاس داخلی است. برای مستندات مربوط به این کلاس به :class:`frozenset` و :ref:`types-set` مراجعه کنید.
pl: Zwraca nowy obiekt :class:`frozenset`, opcjonalnie z elementami pobranymi z *iterable*. ``frozenset`` jest klasą wbudowaną. Dokumentacja dotycząca tej klasy znajduje się na stronach :class:`frozenset` i :ref:`types-set`.

source: For other containers see the built-in :class:`set`, :class:`list`, :class:`tuple`, and :class:`dict` classes, as well as the :mod:`collections` module.
fa: برای سایر کانتینرها به کلاس های داخلی :class:`set`، :class:`list`، :class:`tuple` و :class:`dict` و همچنین ماژول :mod:`collections` مراجعه کنید.
pl: Dla innych kontenerów zobacz klasy wbudowane :class:`set` , :class:`list`, :class:`tuple` i :class:`dict`, jak również moduł :mod:`collections` .

source: Return the value of the named attribute of *object*. *name* must be a string. If the string is the name of one of the object's attributes, the result is the value of that attribute. For example, ``getattr(x, 'foobar')`` is equivalent to ``x.foobar``. If the named attribute does not exist, *default* is returned if provided, otherwise :exc:`AttributeError` is raised. *name* need not be a Python identifier (see :func:`setattr`).
fa: مقدار مشخصه نامگذاری شده *object* را برگردانید. *name* باید یک رشته باشد. اگر رشته نام یکی از ویژگی های شی باشد، نتیجه مقدار آن ویژگی است. به عنوان مثال، ``getattr(x, 'foobar')`` معادل ``x.foobar`` است. اگر ویژگی نامگذاری شده وجود نداشته باشد، در صورت ارائه *default* برگردانده می شود، در غیر این صورت :exc:`AttributeError` افزایش می یابد. *name* نباید یک شناسه پایتون باشد (به :func:`setattr` مراجعه کنید).
pl: Zwraca wartość nazwanego atrybut obiektu *object*. *name* musi być napisem. Jeśli napis jest nazwą jednego z atrybut obiektu, wynikiem jest wartość tego atrybutu. Na przykład, ``getattr(x, 'foobar')`` jest równoważne ``x.foobar``. Jeśli nazwany atrybut nie istnieje, *default* jest zwracany, jeśli został podany, w przeciwnym razie :exc:`AttributeError` jest rzucony. *name* nie musi być identyfikatorem Pythona (Zobacz :func:`setattr`).

source: Since :ref:`private name mangling <private-name-mangling>` happens at compilation time, one must manually mangle a private attribute's (attributes with two leading underscores) name in order to retrieve it with :func:`getattr`.
fa: از آنجایی که :ref:`private name mangling <private-name-mangling>` در زمان کامپایل اتفاق می افتد، برای بازیابی آن با :func:`getattr`، باید نام یک ویژگی خصوصی (ویژگی ها با دو زیرخط اصلی) را به صورت دستی مخدوش کرد.
pl: Ponieważ :ref:`manipulowanie nazwami prywatnymi <private-name-mangling>` odbywa się w czasie kompilacji, należy ręcznie zmanipulować nazwę prywatną atrybutu (atrybuty z dwoma wiodącymi podkreśleniami), aby pobrać ją za pomocą :func:`getattr`.

source: Return the dictionary implementing the current module namespace. For code within functions, this is set when the function is defined and remains the same regardless of where the function is called.
fa: فرهنگ لغت اجرای فضای نام ماژول فعلی را برگردانید. برای کد درون توابع، زمانی که تابع تعریف می‌شود، تنظیم می‌شود و بدون توجه به اینکه تابع کجا فراخوانی می‌شود، ثابت می‌ماند.
pl: Zwraca słownik implementującą bieżącą przestrzeń nazw moduł. W przypadku kodu w funkcja, jest on ustawiany, gdy funkcja jest zdefiniowana i pozostaje taki sam niezależnie od tego, gdzie wywoływana jest funkcja.

source: The arguments are an object and a string. The result is ``True`` if the string is the name of one of the object's attributes, ``False`` if not. (This is implemented by calling ``getattr(object, name)`` and seeing whether it raises an :exc:`AttributeError` or not.)
fa: آرگومان ها یک شی و یک رشته هستند. نتیجه ``True`` اگر رشته نام یکی از ویژگی های شی باشد، ``False`` اگر نه. (این کار با فراخوانی ``getattr(object, name)`` و دیدن اینکه آیا :exc:`AttributeError` را افزایش می دهد یا خیر اجرا می شود.)
pl: Argumenty to obiekt i napis. Wynikiem jest ``True`` jeśli napis jest nazwą jednego z obiektów atrybut, ``False`` jeśli nie. (Jest to zaimplementowane poprzez wywołanie ``getattr(object, name)`` i sprawdzenie, czy rzucone jest :exc:`AttributeError` ).

source: Return the hash value of the object (if it has one). Hash values are integers. They are used to quickly compare dictionary keys during a dictionary lookup. Numeric values that compare equal have the same hash value (even if they are of different types, as is the case for 1 and 1.0).
fa: مقدار هش شیء را برگردانید (اگر دارای یکی باشد). مقادیر هش اعداد صحیح هستند. آنها برای مقایسه سریع کلیدهای فرهنگ لغت در طول جستجوی فرهنگ لغت استفاده می شوند. مقادیر عددی که با هم مقایسه می‌کنند، مقدار هش یکسانی دارند (حتی اگر از انواع مختلف باشند, همانطور که در مورد 1 و 1.0 وجود دارد).
pl: Zwraca wartość skrótu obiektu (jeśli taki posiada). Wartości skrótu są liczbami całkowitymi. Są one używane do szybkiego porównywania kluczy słownika podczas wyszukiwania słownika. Wartości numeryczne, które są równe, mają tę samą wartość skrótu (nawet jeśli są różnych typów, jak w przypadku 1 i 1.0).

source: For objects with custom :meth:`~object.__hash__` methods, note that :func:`hash` truncates the return value based on the bit width of the host machine.
fa: برای اشیا با متدهای سفارشی :meth:`~object.__hash__`، توجه داشته باشید که :func:`hash` مقدار بازگشتی را بر اساس عرض بیت دستگاه میزبان کوتاه می‌کند.
pl: W przypadku obiektów z niestandardowymi metodami :meth:`~object.__hash__` należy pamiętać, że :func:`hash` obcina wartość zwracaną w oparciu o szerokość bitową maszyny hosta.

source: Invoke the built-in help system. (This function is intended for interactive use.) If no argument is given, the interactive help system starts on the interpreter console. If the argument is a string, then the string is looked up as the name of a module, function, class, method, keyword, or documentation topic, and a help page is printed on the console. If the argument is any other kind of object, a help page on the object is generated.
fa: سیستم کمک داخلی را فراخوانی کنید. (این تابع برای استفاده تعاملی در نظر گرفته شده است.) اگر هیچ آرگومانی داده نشود، سیستم کمک تعاملی در کنسول مفسر شروع می شود. اگر آرگومان یک رشته باشد، رشته به عنوان نام ماژول، تابع، کلاس، متد، کلمه کلیدی یا موضوع مستندسازی جستجو می‌شود و یک صفحه راهنما روی کنسول چاپ می‌شود. اگر آرگومان هر نوع شی دیگری باشد، یک صفحه راهنما روی شی ایجاد می شود.
pl: Wywołuje system pomocy wbudowany. (Ta funkcja jest przeznaczona do użytku interaktywnego.) Jeśli nie podano argumentu, interaktywny system pomocy uruchamia się na konsoli interpretera. Jeśli argument jest napisem, to napis jest wyszukiwany jako nazwa modułu, funkcja, klasa, metoda, słowo kluczowe lub temat dokumentacji, a strona pomocy jest drukowana na konsoli. Jeśli argument jest jakimkolwiek innym rodzajem obiektu, generowana jest strona pomocy dotycząca tego obiektu.

source: Note that if a slash(/) appears in the parameter list of a function when invoking :func:`help`, it means that the parameters prior to the slash are positional-only. For more info, see :ref:`the FAQ entry on positional-only parameters <faq-positional-only-arguments>`.
fa: توجه داشته باشید که اگر هنگام فراخوانی :func:`help` یک اسلش(/) در لیست پارامترهای یک تابع ظاهر شود، به این معنی است که پارامترهای قبل از اسلش فقط موقعیتی هستند. برای اطلاعات بیشتر به :ref:`the FAQ entry on positional-only parameters <faq-positional-only-arguments>` مراجعه کنید.
pl: Zauważ, że jeśli ukośnik (/) pojawia się na liście parametrów w funkcji podczas wywoływania :func:`help`, oznacza to, że parametry przed ukośnikiem są tylko-pozycyjne. Aby uzyskać więcej informacji, zobacz :ref:`wpis FAQ na temat parametrów tylko-pozycyjnych <faq-positional-only-arguments>` .

source: This function is added to the built-in namespace by the :mod:`site` module.
fa: این تابع توسط ماژول :mod:`site` به فضای نام داخلی اضافه شده است.
pl: Ta funkcja jest dodawana do przestrzeni nazw wbudowanych przez moduł :mod:`site` .

source: Changes to :mod:`pydoc` and :mod:`inspect` mean that the reported signatures for callables are now more comprehensive and consistent.
fa: تغییرات :mod:`pydoc` و :mod:`inspect` به این معنی است که امضاهای گزارش‌شده برای تماس‌پذیرها اکنون جامع‌تر و سازگارتر هستند.
pl: Zmiany do :mod:`pydoc` i :mod:`inspect` oznaczają, że zgłoszone sygnatury dla callables są teraz bardziej kompleksowe i spójne.

source: Convert an integer number to a lowercase hexadecimal string prefixed with "0x". If *x* is not a Python :class:`int` object, it has to define an :meth:`~object.__index__` method that returns an integer. Some examples:
fa: یک عدد صحیح را به یک رشته هگزادسیمال با حروف کوچک با پیشوند "0x" تبدیل کنید. اگر *x* یک شی پایتون :class:`int` نیست، باید یک متد :meth:`~object.__index__` تعریف کند که یک عدد صحیح برمی گرداند. چند نمونه:
pl: Konwertuje liczbę liczba całkowita na zapis szesnastkowy z małymi literami napis poprzedzony "0x". Jeśli *x* nie jest obiektem Python :class:`int` , musi zdefiniować metodę :meth:`~object.__index__`, która zwraca liczbe całkowita. Kilka przykładów:

source: If you want to convert an integer number to an uppercase or lower hexadecimal string with prefix or not, you can use either of the following ways:
fa: اگر می خواهید یک عدد صحیح را با پیشوند یا نه به یک رشته هگزادسیمال بزرگ یا کوچک تبدیل کنید، می توانید از یکی از راه های زیر استفاده کنید:
pl: Jeśli chcesz przekonwertować liczbe całkowita na wielką lub małą liczbę szesnastkową napis z prefiksem lub bez, możesz użyć jednego z poniższych sposobów:

source: See also :func:`int` for converting a hexadecimal string to an integer using a base of 16.
fa: همچنین :func:`int` را برای تبدیل رشته هگزا دسیمال به عدد صحیح با استفاده از پایه 16 ببینید.
pl: Zobacz także :func:`int`, aby przekonwertować szesnastkowy napis na liczba całkowita przy użyciu podstawy 16.

source: To obtain a hexadecimal string representation for a float, use the :meth:`float.hex` method.
fa: برای به دست آوردن نمایش رشته هگزادسیمال برای یک شناور، از روش :meth:`float.hex` استفاده کنید.
pl: Aby uzyskać napis szesnastkowej reprezentacj dla zmiennoprzecinkowej, należy użyć metody :meth:`float.hex`.

source: Return the "identity" of an object. This is an integer which is guaranteed to be unique and constant for this object during its lifetime. Two objects with non-overlapping lifetimes may have the same :func:`id` value.
fa: "هویت" یک شی را برگردانید. این یک عدد صحیح است که تضمین می شود برای این شی در طول عمر خود منحصر به فرد و ثابت باشد. دو شی با طول عمر غیر همپوشانی ممکن است مقدار :func:`id` یکسانی داشته باشند.
pl: Zwraca "tożsamość" obiektu. Jest to liczba całkowita, która jest gwarantowana jako unikalny i stały dla tego obiektu przez cały okres jego życia. Dwa obiekty o nienakładających się okresach życia mogą mieć tę samą wartość :func:`id`.

source: This is the address of the object in memory.
fa: این آدرس شی در حافظه است.
pl: Jest to adres obiektu w pamięci.

source: Raises an :ref:`auditing event <auditing>` ``builtins.id`` with argument ``id``.
fa: یک :ref:`auditing event <auditing>` ``builtins.id`` را با آرگومان ``id`` افزایش می دهد.
pl: Rzuci :ref:`auditing event <auditing>` ``builtins.id`` bez argumentu ``id`` .

source: If the *prompt* argument is present, it is written to standard output without a trailing newline. The function then reads a line from input, converts it to a string (stripping a trailing newline), and returns that. When EOF is read, :exc:`EOFError` is raised. Example::
fa: اگر آرگومان *prompt* وجود داشته باشد، بدون خط جدید در خروجی استاندارد نوشته می شود. سپس این تابع یک خط را از ورودی می‌خواند، آن را به یک رشته تبدیل می‌کند (یک خط جدید دنباله‌دار را حذف می‌کند), و آن را برمی‌گرداند. وقتی EOF خوانده می شود، :exc:`EOFError` بالا می رود. مثال::
pl: Jeśli *prompt* argument jest obecny, jest on zapisywany na standardowe wyjście bez końcowej nowej linii. Następnie funkcja odczytuje linię z wejścia, konwertuje ją na napis (usuwając końcową nową linię) i zwraca. Po odczytaniu EOF, :exc:`EOFError` jest rzucone. Przykład::

source: If the :mod:`readline` module was loaded, then :func:`input` will use it to provide elaborate line editing and history features.
fa: اگر ماژول :mod:`readline` بارگذاری شده باشد، :func:`input` از آن برای ارائه ویژگی‌های ویرایش خط و تاریخچه دقیق استفاده می‌کند.
pl: Jeśli załadowano moduł :mod:`readline` , to :func:`input` użyje go do zapewnienia rozbudowanych funkcji edycji wierszy i historii.

source: Raises an :ref:`auditing event <auditing>` ``builtins.input`` with argument ``prompt`` before reading input
fa: قبل از خواندن ورودی، یک :ref:`auditing event <auditing>` ``builtins.input`` را با آرگومان ``prompt`` افزایش می دهد.
pl: Rzuca :ref:`auditing event <auditing>` ``builtins.input`` z argumentem ``prompt`` przed odczytaniem wpisu

source: Raises an :ref:`auditing event <auditing>` ``builtins.input/result`` with the result after successfully reading input.
fa: پس از خواندن موفقیت آمیز ورودی، یک :ref:`auditing event <auditing>` ``builtins.input/result`` را با نتیجه بالا می برد.
pl: Rzuca zdarzenie :ref:`auditing <auditing>` ``builtins.input/result`` z wynikiem po pomyślnym odczytaniu danych wejściowych.

source: Return an integer object constructed from a number or a string, or return ``0`` if no arguments are given.
fa: یک شی عدد صحیح ساخته شده از یک عدد یا یک رشته را برگردانید، یا اگر آرگومان داده نشد، ``0`` را برگردانید.
pl: Zwraca obiekt liczba całkowita zbudowana z liczby lub napisu, lub zwraca ``0`` jeśli nie podano argumentu.

source: If the argument defines :meth:`~object.__int__`, ``int(x)`` returns ``x.__int__()``. If the argument defines :meth:`~object.__index__`, it returns ``x.__index__()``. If the argument defines :meth:`~object.__trunc__`, it returns ``x.__trunc__()``. For floating-point numbers, this truncates towards zero.
fa: اگر آرگومان :meth:`~object.__int__` را تعریف کند، ``int(x)`` ``x.__int__()`` را برمی گرداند. اگر آرگومان :meth:`~object.__index__` را تعریف کند، ``x.__index__()`` را برمی گرداند. اگر آرگومان :meth:`~object.__trunc__` را تعریف کند، ``x.__trunc__()`` را برمی گرداند. برای اعداد ممیز شناور، این به سمت صفر کوتاه می شود.
pl: Jeśli argument definiuje :meth:`~object.__int__`, ``int(x)`` zwraca ``x.__int__()`` . Jeśli argument definiuje :meth:`~object.__index__`, to zwraca ``x.__index__()`` . Jeśli argument definiuje :meth:`~object.__trunc__`, to zwraca ``x.__trunc__()`` . W przypadku liczb zmiennoprzecinkowych jest ona obcinana w kierunku zera.

source: If the argument is not a number or if *base* is given, then it must be a string, :class:`bytes`, or :class:`bytearray` instance representing an integer in radix *base*. Optionally, the string can be preceded by ``+`` or ``-`` (with no space in between), have leading zeros, be surrounded by whitespace, and have single underscores interspersed between digits.
fa: اگر آرگومان یک عدد نیست یا اگر *base* داده شده باشد، باید یک رشته، :class:`bytes` یا نمونه :class:`bytearray` باشد که یک عدد صحیح در ریشه *base* را نشان می دهد. به صورت اختیاری، رشته می تواند با ``+`` یا ``-`` (بدون فاصله در میان), دارای صفرهای ابتدایی باشد، با فضای خالی احاطه شده باشد، و دارای زیرخط های منفرد در میان ارقام باشد.
pl: Jeśli argument nie jest liczbą lub jeśli podano *base*, musi to być instancja napisu, :class:`bytes` lub :class:`bytearray` reprezentująca liczba całkowita w radix *base*. Opcjonalnie, napis może być poprzedzony przez ``+`` lub ``-`` (bez spacji pomiędzy nimi), mieć początkowe zera, być otoczone białymi znakami i mieć pojedyncze podkreślenia pomiędzy cyframi.

source: A base-n integer string contains digits, each representing a value from 0 to n-1. The values 0--9 can be represented by any Unicode decimal digit. The values 10--35 can be represented by ``a`` to ``z`` (or ``A`` to ``Z``). The default *base* is 10. The allowed bases are 0 and 2--36. Base-2, -8, and -16 strings can be optionally prefixed with ``0b``/``0B``, ``0o``/``0O``, or ``0x``/``0X``, as with integer literals in code. For base 0, the string is interpreted in a similar way to an :ref:`integer literal in code <integers>`, in that the actual base is 2, 8, 10, or 16 as determined by the prefix. Base 0 also disallows leading zeros: ``int('010', 0)`` is not legal, while ``int('010')`` and ``int('010', 8)`` are.
fa: یک رشته اعداد صحیح مبنا-n حاوی ارقامی است که هر یک مقداری از 0 تا n-1 را نشان می دهد. مقادیر 0--9 را می توان با هر رقم اعشاری یونیکد نشان داد. مقادیر 10--35 را می توان با ``a`` تا ``z`` (یا ``A`` تا ``Z``) نشان داد. پیش فرض *base* 10 است. پایه های مجاز 0 و 2--36 هستند. رشته های Base-2، -8، و -16 را می توان به صورت اختیاری با ``0b``/``0B``، ``0o``/``0O``، یا ``0x``/``0X`` پیشوند، مانند حروف صحیح در کد. برای پایه 0، رشته به روشی مشابه با :ref:`integer literal in code <integers>` تفسیر می شود، به این صورت که پایه واقعی 2، 8، 10 یا 16 است که توسط پیشوند تعیین می شود. پایه 0 صفرهای ابتدایی را نیز مجاز نمی داند: ``int('010', 0)`` قانونی نیست، در حالی که ``int('010')`` و ``int('010', 8)`` قانونی هستند.
pl: Baza-n liczba całkowita napis zawiera cyfry, z których każda reprezentuje wartość od 0 do n-1. Wartości 0--9 mogą być reprezentowane przez dowolną cyfrę dziesiętną Unicode. Wartości 10-35 mogą być reprezentowane przez ``a`` do ``z`` (lub ``A`` do ``Z``). Domyślna baza jest 10. Dozwolone wartości bazowe to 0 i 2--36. Podstawy 2, -8 i -16 napis mogą być opcjonalnie poprzedzone przedrostkiem ``0b``/``0B``, ``0o``/``0O``, lub ``0x``/``0X``, tak jak w przypadku literałów liczba całkowita w kodzie. Dla podstawy 0, napis jest interpretowane w podobny sposób jak :ref:`liczba całkowita w kodzie <integers>`, w którym rzeczywista podstawa wynosi 2, 8, 10 lub 16, zgodnie z przedrostkiem. Podstawa 0 również nie zezwala na zera wiodące: ``int('010', 0)`` nie jest legalne, podczas gdy ``int('010')`` i ``int('010', 8)`` są.

source: The integer type is described in :ref:`typesnumeric`.
fa: نوع عدد صحیح در :ref:`typesnumeric` توضیح داده شده است.
pl: Typ liczba całkowita (integer) został opisany w :ref:`typesnumeric`.

source: If *base* is not an instance of :class:`int` and the *base* object has a :meth:`base.__index__ <object.__index__>` method, that method is called to obtain an integer for the base. Previous versions used :meth:`base.__int__ <object.__int__>` instead of :meth:`base.__index__ <object.__index__>`.
fa: اگر *base* نمونه ای از :class:`int` نباشد و شی *base* دارای متد :meth:`base.__index__ <object.__index__>` باشد، آن متد برای بدست آوردن یک عدد صحیح برای پایه فراخوانی می شود. نسخه های قبلی به جای :meth:`base.__index__ <object.__index__>` از :meth:`base.__int__ <object.__int__>` استفاده می کردند.
pl: Jeśli *base* nie jest instancją :class:`int` i obiekt *base* posiada metodę :meth:`base.__index__ <object.__index__>`, metoda ta jest wywoływana w celu uzyskania liczba całkowitych dla bazy. Poprzednie wersje używały :meth:`base.__int__ <object.__int__>` zamiast :meth:`base.__index__ <object.__index__>`.

source: The first parameter is now positional-only.
fa: پارامتر اول اکنون فقط موقعیتی است.
pl: Pierwszy parametr jest teraz tylko pozycyjny.

source: Falls back to :meth:`~object.__index__` if :meth:`~object.__int__` is not defined.
fa: اگر :meth:`~object.__int__` تعریف نشده باشد به :meth:`~object.__index__` برمی گردد.
pl: Powraca do :meth:`~object.__index__`, jeśli :meth:`~object.__int__` nie jest zdefiniowane.

source: The delegation to :meth:`~object.__trunc__` is deprecated.
fa: تفویض اختیار به :meth:`~object.__trunc__` منسوخ شده است.
pl: Delegacja do :meth:`~object.__trunc__` jest zdezaprobowana.
