Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/gc.po
Languages: ru

source: :mod:`!gc` --- Garbage Collector interface
ru: :mod:`!gc` --- Интерфейс сборщика мусора

source: This module provides an interface to the optional garbage collector. It provides the ability to disable the collector, tune the collection frequency, and set debugging options. It also provides access to unreachable objects that the collector found but cannot free. Since the collector supplements the reference counting already used in Python, you can disable the collector if you are sure your program does not create reference cycles. Automatic collection can be disabled by calling ``gc.disable()``. To debug a leaking program call ``gc.set_debug(gc.DEBUG_LEAK)``. Notice that this includes ``gc.DEBUG_SAVEALL``, causing garbage-collected objects to be saved in gc.garbage for inspection.
ru: Этот модуль предоставляет интерфейс для дополнительного сборщика мусора. Он предоставляет возможность отключить сборщик, настроить частоту сбора и установить параметры отладки. Он также обеспечивает доступ к недоступным объектам, которые сборщик нашел, но не может освободить. Поскольку сборщик дополняет подсчет ссылок, уже используемый в Python, вы можете отключить сборщик, если уверены, что ваша программа не создает циклы ссылок. Автоматический сбор можно отключить, вызвав gc.disable(). Для отладки программы, вызывающей утечку, вызовите ``gc.set_debug(gc.DEBUG_LEAK)``. Обратите внимание, что сюда входит ``gc.DEBUG_SAVEALL``, в результате чего объекты, собранные мусором, сохраняются в gc.garbage для проверки.

source: The :mod:`gc` module provides the following functions:
ru: Модуль :mod:`gc` предоставляет следующие функции:

source: Enable automatic garbage collection.
ru: Включите автоматическую сборку мусора.

source: Disable automatic garbage collection.
ru: Отключите автоматическую сборку мусора.

source: Return ``True`` if automatic collection is enabled.
ru: Возвращайте True, если включен автоматический сбор.

source: Perform a collection. The optional argument *generation* may be an integer specifying which generation to collect (from 0 to 2). A :exc:`ValueError` is raised if the generation number is invalid. The sum of collected objects and uncollectable objects is returned.
ru: Выполните сбор. Необязательный аргумент *генерация* может быть целым числом, указывающим, какое поколение собирать (от 0 до 2). Ошибка :exc:`ValueError` возникает, если номер поколения недействителен. Возвращается сумма собранных и несобираемых объектов.

source: Calling ``gc.collect(0)`` will perform a GC collection on the young generation.
ru: Вызов gc.collect(0) выполнит сбор GC для молодого поколения.

source: Calling ``gc.collect(1)`` will perform a GC collection on the young generation and an increment of the old generation.
ru: Вызов gc.collect(1) выполнит сбор GC для молодого поколения и приращение старого поколения.

source: Calling ``gc.collect(2)`` or ``gc.collect()`` performs a full collection
ru: Вызов gc.collect(2) или gc.collect() выполняет полный сбор.

source: The free lists maintained for a number of built-in types are cleared whenever a full collection or collection of the highest generation (2) is run. Not all items in some free lists may be freed due to the particular implementation, in particular :class:`float`.
ru: Списки свободных, поддерживаемые для ряда встроенных типов, очищаются при каждом запуске полной коллекции или коллекции самого высокого поколения (2). Не все элементы в некоторых свободных списках могут быть освобождены из-за конкретной реализации, в частности :class:`float`.

source: The effect of calling ``gc.collect()`` while the interpreter is already performing a collection is undefined.
ru: Эффект от вызова gc.collect(), когда интерпретатор уже выполняет сбор, не определен.

source: ``generation=1`` performs an increment of collection.
ru: ``Generation=1`` выполняет приращение коллекции.

source: Set the garbage collection debugging flags. Debugging information will be written to ``sys.stderr``. See below for a list of debugging flags which can be combined using bit operations to control debugging.
ru: Установите флаги отладки сборки мусора. Отладочная информация будет записана в ``sys.stderr``. Ниже приведен список флагов отладки, которые можно комбинировать с помощью битовых операций для управления отладкой.

source: Return the debugging flags currently set.
ru: Возвращает текущие установленные флаги отладки.

source: Returns a list of all objects tracked by the collector, excluding the list returned. If *generation* is not ``None``, return only the objects as follows:
ru: Возвращает список всех объектов, отслеживаемых сборщиком, за исключением возвращаемого списка. Если *генерация* не равна ``Нет``, возвращайте только объекты следующим образом:

source: 0: All objects in the young generation
ru: 0: Все объекты молодого поколения.

source: 1: No objects, as there is no generation 1 (as of Python 3.13)
ru: 1: нет объектов, так как нет поколения 1 (начиная с Python 3.13).

source: 2: All objects in the old generation
ru: 2: Все объекты старого поколения

source: New *generation* parameter.
ru: Новый параметр *поколения*.

source: Generation 1 is removed
ru: Первое поколение удалено.

source: Raises an :ref:`auditing event <auditing>` ``gc.get_objects`` with argument ``generation``.
ru: Вызывает :ref:`событие аудита <auditing>``gc.get_objects`` с аргументом ``генерация``.

source: Return a list of three per-generation dictionaries containing collection statistics since interpreter start. The number of keys may change in the future, but currently each dictionary will contain the following items:
ru: Возвращает список из трех словарей каждого поколения, содержащих статистику сбора с момента запуска интерпретатора. Количество ключей может измениться в будущем, но в настоящее время каждый словарь будет содержать следующие элементы:

source: ``collections`` is the number of times this generation was collected;
ru: ``коллекции`` – это количество сборов данных этого поколения;

source: ``collected`` is the total number of objects collected inside this generation;
ru: ``collected`` — общее количество объектов, собранных в этом поколении;

source: ``uncollectable`` is the total number of objects which were found to be uncollectable (and were therefore moved to the :data:`garbage` list) inside this generation.
ru: ``uncollectable`` — это общее количество объектов, которые оказались невозможными для сбора (и поэтому были перемещены в список :data:`garbage`) внутри этого поколения.

source: The GC classifies objects into two generations depending on whether they have survived a collection. New objects are placed in the young generation. If an object survives a collection it is moved into the old generation.
ru: GC классифицирует объекты на два поколения в зависимости от того, сохранились ли они в коллекции. Новые объекты помещаются в молодое поколение. Если объект сохраняется в коллекции, он перемещается в старое поколение.

source: In order to decide when to run, the collector keeps track of the number of object allocations and deallocations since the last collection. When the number of allocations minus the number of deallocations exceeds *threshold0*, collection starts. For each collection, all the objects in the young generation and some fraction of the old generation is collected.
ru: Чтобы решить, когда запускать, сборщик отслеживает количество выделений и освобождений объектов с момента последней коллекции. Когда количество выделений минус количество освобождений превышает *threshold0*, начинается сбор. Для каждой коллекции собираются все объекты молодого поколения и некоторая часть объектов старого поколения.

source: The fraction of the old generation that is collected is **inversely** proportional to *threshold1*. The larger *threshold1* is, the slower objects in the old generation are collected. For the default value of 10, 1% of the old generation is scanned during each collection.
ru: Собираемая доля старого поколения **обратно** пропорциональна *threshold1*. Чем больше *threshold1*, тем медленнее собираются объекты старого поколения. При значении по умолчанию 10 во время каждой коллекции сканируется 1% старого поколения.

source: *threshold2* is ignored.
ru: *threshold2* игнорируется.

source: See `Garbage collector design <https://devguide.python.org/garbage_collector>`_ for more information.
ru: Дополнительную информацию см. в разделе «Проектирование сборщика мусора <https://devguide.python.org/garbage_collector>».

source: *threshold2* is ignored
ru: *threshold2* игнорируется

source: Return the current collection counts as a tuple of ``(count0, count1, count2)``.
ru: Возвращает счетчики текущей коллекции в виде кортежа ``(count0, count1, count2)``.

source: Return the current collection thresholds as a tuple of ``(threshold0, threshold1, threshold2)``.
ru: Возвращает текущие пороговые значения коллекции в виде кортежа ``(threshold0, Threshold1, Threshold2)``.

source: Return the list of objects that directly refer to any of objs. This function will only locate those containers which support garbage collection; extension types which do refer to other objects but do not support garbage collection will not be found.
ru: Верните список объектов, которые напрямую ссылаются на любой из объектов. Эта функция найдет только те контейнеры, которые поддерживают сбор мусора; типы расширений, которые ссылаются на другие объекты, но не поддерживают сборку мусора, не будут найдены.

source: Note that objects which have already been dereferenced, but which live in cycles and have not yet been collected by the garbage collector can be listed among the resulting referrers. To get only currently live objects, call :func:`collect` before calling :func:`get_referrers`.
ru: Обратите внимание, что среди результирующих рефереров могут быть указаны объекты, которые уже были разыменованы, но живут в циклах и еще не были собраны сборщиком мусора. Чтобы получить только текущие активные объекты, вызовите :func:`collect` перед вызовом :func:`get_referrers`.

source: Care must be taken when using objects returned by :func:`get_referrers` because some of them could still be under construction and hence in a temporarily invalid state. Avoid using :func:`get_referrers` for any purpose other than debugging.
ru: Необходимо соблюдать осторожность при использовании объектов, возвращаемых :func:`get_referrers`, поскольку некоторые из них все еще могут находиться в стадии разработки и, следовательно, находиться во временно недопустимом состоянии. Избегайте использования :func:`get_referrers` для каких-либо целей, кроме отладки.

source: Raises an :ref:`auditing event <auditing>` ``gc.get_referrers`` with argument ``objs``.
ru: Вызывает событие аудита <auditing>`gc.get_referrers`` с аргументом ``objs``.

source: Return a list of objects directly referred to by any of the arguments. The referents returned are those objects visited by the arguments' C-level :c:member:`~PyTypeObject.tp_traverse` methods (if any), and may not be all objects actually directly reachable. :c:member:`~PyTypeObject.tp_traverse` methods are supported only by objects that support garbage collection, and are only required to visit objects that may be involved in a cycle. So, for example, if an integer is directly reachable from an argument, that integer object may or may not appear in the result list.
ru: Возвращает список объектов, на которые напрямую ссылается любой из аргументов. Возвращаемые референты — это те объекты, которые посещаются методами аргументов C-уровня :c:member:`~PyTypeObject.tp_traverse` (если таковые имеются), и могут не быть всеми объектами, которые на самом деле доступны напрямую. Методы :c:member:`~PyTypeObject.tp_traverse` поддерживаются только объектами, поддерживающими сборку мусора, и необходимы только для посещения объектов, которые могут участвовать в цикле. Так, например, если целое число напрямую доступно из аргумента, этот целочисленный объект может появиться или не появиться в списке результатов.

source: Raises an :ref:`auditing event <auditing>` ``gc.get_referents`` with argument ``objs``.
ru: Вызывает событие аудита <auditing>`gc.get_referents`` с аргументом ``objs``.

source: Returns ``True`` if the object is currently tracked by the garbage collector, ``False`` otherwise. As a general rule, instances of atomic types aren't tracked and instances of non-atomic types (containers, user-defined objects...) are. However, some type-specific optimizations can be present in order to suppress the garbage collector footprint of simple instances (e.g. dicts containing only atomic keys and values)::
ru: Возвращает True, если объект в данный момент отслеживается сборщиком мусора, в противном случае — False. Как правило, экземпляры атомарных типов не отслеживаются, а экземпляры неатомарных типов (контейнеры, определяемые пользователем объекты...). Однако могут быть предусмотрены некоторые оптимизации для конкретного типа, чтобы подавить влияние сборщика мусора на простые экземпляры (например, словари, содержащие только атомарные ключи и значения)::

source: Returns ``True`` if the given object has been finalized by the garbage collector, ``False`` otherwise. ::
ru: Возвращает True, если данный объект был финализирован сборщиком мусора, в противном случае — False. ::

source: Freeze all the objects tracked by the garbage collector; move them to a permanent generation and ignore them in all the future collections.
ru: Заморозить все объекты, отслеживаемые сборщиком мусора; переместите их в постоянное поколение и игнорируйте во всех будущих коллекциях.

source: If a process will ``fork()`` without ``exec()``, avoiding unnecessary copy-on-write in child processes will maximize memory sharing and reduce overall memory usage. This requires both avoiding creation of freed "holes" in memory pages in the parent process and ensuring that GC collections in child processes won't touch the ``gc_refs`` counter of long-lived objects originating in the parent process. To accomplish both, call ``gc.disable()`` early in the parent process, ``gc.freeze()`` right before ``fork()``, and ``gc.enable()`` early in child processes.
ru: Если процесс будет разветвляться() без exec(), избежание ненужного копирования при записи в дочерних процессах позволит максимизировать совместное использование памяти и снизить общее использование памяти. Для этого необходимо как избегать создания освобожденных «дыр» в страницах памяти родительского процесса, так и гарантировать, что коллекции GC в дочерних процессах не будут касаться счетчика gc_refs долгоживущих объектов, происходящих из родительского процесса. Чтобы выполнить и то, и другое, вызовите gc.disable() в начале родительского процесса, gc.freeze() прямо перед fork() и gc.enable() раньше. в дочерних процессах.

source: Unfreeze the objects in the permanent generation, put them back into the oldest generation.
ru: Разморозьте объекты в постоянном поколении и поместите их обратно в самое старое поколение.

source: Return the number of objects in the permanent generation.
ru: Возвращает количество объектов в постоянном поколении.

source: The following variables are provided for read-only access (you can mutate the values but should not rebind them):
ru: Следующие переменные доступны только для чтения (вы можете изменять значения, но не должны их повторно привязывать):

source: A list of objects which the collector found to be unreachable but could not be freed (uncollectable objects). Starting with Python 3.4, this list should be empty most of the time, except when using instances of C extension types with a non-``NULL`` ``tp_del`` slot.
ru: Список объектов, которые сборщик посчитал недоступными, но которые не удалось освободить (невозможность сбора). Начиная с Python 3.4, этот список должен быть пустым большую часть времени, за исключением случаев использования экземпляров типов расширения C со слотом ``tp_del``, отличным от ``NULL``.

source: If :const:`DEBUG_SAVEALL` is set, then all unreachable objects will be added to this list rather than freed.
ru: Если установлен :const:`DEBUG_SAVEALL`, то все недоступные объекты будут добавлены в этот список, а не освобождены.

source: If this list is non-empty at :term:`interpreter shutdown`, a :exc:`ResourceWarning` is emitted, which is silent by default. If :const:`DEBUG_UNCOLLECTABLE` is set, in addition all uncollectable objects are printed.
ru: Если этот список непустой в момент :term:`interpreter Shutdown`, выдается :exc:`ResourceWarning`, который по умолчанию неактивен. Если установлен :const:`DEBUG_UNCOLLECTABLE`, дополнительно печатаются все несобираемые объекты.

source: Following :pep:`442`, objects with a :meth:`~object.__del__` method don't end up in :data:`gc.garbage` anymore.
ru: После :pep:`442` объекты с методом :meth:`~object.__del__` больше не попадают в :data:`gc.garbage`.

source: A list of callbacks that will be invoked by the garbage collector before and after collection. The callbacks will be called with two arguments, *phase* and *info*.
ru: Список обратных вызовов, которые будут вызываться сборщиком мусора до и после сбора. Обратные вызовы будут вызываться с двумя аргументами: *phase* и *info*.

source: *phase* can be one of two values:
ru: *фаза* может иметь одно из двух значений:

source: "start": The garbage collection is about to start.
ru: «start»: скоро начнется сбор мусора.

source: "stop": The garbage collection has finished.
ru: «стоп»: сбор мусора завершен.

source: *info* is a dict providing more information for the callback. The following keys are currently defined:
ru: *info* — это текст, предоставляющий дополнительную информацию для обратного вызова. В настоящее время определены следующие ключи:

source: "generation": The oldest generation being collected.
ru: «поколение»: самое старое собираемое поколение.

source: "collected": When *phase* is "stop", the number of objects successfully collected.
ru: «собрано»: когда *фаза* «стоп», количество успешно собранных объектов.

source: "uncollectable": When *phase* is "stop", the number of objects that could not be collected and were put in :data:`garbage`.
ru: «uncollectable»: Когда *фаза* установлена ​​на «стоп», количество объектов, которые не удалось собрать и которые были помещены в :data:`garbage`.

source: Applications can add their own callbacks to this list. The primary use cases are:
ru: Приложения могут добавлять в этот список свои собственные обратные вызовы. Основные варианты использования:

source: Gathering statistics about garbage collection, such as how often various generations are collected, and how long the collection takes.
ru: Сбор статистики о сборе мусора, например, о том, как часто собираются различные поколения и сколько времени занимает сбор.

source: Allowing applications to identify and clear their own uncollectable types when they appear in :data:`garbage`.
ru: Разрешение приложениям идентифицировать и очищать свои собственные типы, которые невозможно собрать, когда они появляются в :data:`мусоре`.

source: The following constants are provided for use with :func:`set_debug`:
ru: Следующие константы предусмотрены для использования с :func:`set_debug`:

source: Print statistics during collection. This information can be useful when tuning the collection frequency.
ru: Печать статистики во время сбора. Эта информация может быть полезна при настройке частоты сбора данных.

source: Print information on collectable objects found.
ru: Распечатайте информацию о найденных коллекционных предметах.

source: Print information of uncollectable objects found (objects which are not reachable but cannot be freed by the collector). These objects will be added to the ``garbage`` list.
ru: Вывести информацию о найденных объектах, которые невозможно собрать (объекты, которые недоступны, но не могут быть освобождены сборщиком). Эти объекты будут добавлены в список «мусор».

source: Also print the contents of the :data:`garbage` list at :term:`interpreter shutdown`, if it isn't empty.
ru: Также распечатайте содержимое списка :data:`мусора` в :term:`interpreter Shutdown`, если он не пуст.

source: When set, all unreachable objects found will be appended to *garbage* rather than being freed. This can be useful for debugging a leaking program.
ru: Если установлено, все найденные недоступные объекты будут добавлены в *мусор*, а не освобождены. Это может быть полезно для отладки программы с утечкой.

source: The debugging flags necessary for the collector to print information about a leaking program (equal to ``DEBUG_COLLECTABLE | DEBUG_UNCOLLECTABLE | DEBUG_SAVEALL``).
ru: Флаги отладки, необходимые сборщику для печати информации об утечке программы (равны ``DEBUG_COLLECTABLE | DEBUG_UNCOLLECTABLE | DEBUG_SAVEALL``).
