Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/gettext.po
Languages: ru

source: Do a plural-forms lookup of a message id. *singular* is used as the message id for purposes of lookup in the catalog, while *n* is used to determine which plural form to use. The returned message string is a Unicode string.
ru: Выполните поиск идентификатора сообщения во множественном числе. *единственное* используется в качестве идентификатора сообщения для целей поиска в каталоге, а *n* используется для определения того, какую форму множественного числа использовать. Возвращаемая строка сообщения представляет собой строку Юникода.

source: If the message id is not found in the catalog, and a fallback is specified, the request is forwarded to the fallback's :meth:`~NullTranslations.ngettext` method. Otherwise, when *n* is 1 *singular* is returned, and *plural* is returned in all other cases.
ru: Если идентификатор сообщения не найден в каталоге и указан резервный вариант, запрос перенаправляется резервному методу :meth:`~NullTranslations.ngettext`. В противном случае, когда *n* равно 1, возвращается *единственное* число, а во всех остальных случаях возвращается *множественное число*.

source: Here is an example::
ru: Вот пример::

source: Look up the *context* and *message* id in the catalog and return the corresponding message string, as a Unicode string. If there is no entry in the catalog for the *message* id and *context*, and a fallback has been set, the look up is forwarded to the fallback's :meth:`pgettext` method. Otherwise, the *message* id is returned.
ru: Найдите идентификаторы *context* и *message* в каталоге и верните соответствующую строку сообщения в виде строки Unicode. Если в каталоге нет записи для идентификатора *message* и *context* и установлен резервный вариант, поиск перенаправляется в резервный метод :meth:`pgettext`. В противном случае возвращается идентификатор *message*.

source: Do a plural-forms lookup of a message id. *singular* is used as the message id for purposes of lookup in the catalog, while *n* is used to determine which plural form to use.
ru: Выполните поиск идентификатора сообщения во множественном числе. *единственное* используется в качестве идентификатора сообщения для целей поиска в каталоге, а *n* используется для определения того, какую форму множественного числа использовать.

source: If the message id for *context* is not found in the catalog, and a fallback is specified, the request is forwarded to the fallback's :meth:`npgettext` method. Otherwise, when *n* is 1 *singular* is returned, and *plural* is returned in all other cases.
ru: Если идентификатор сообщения для *context* не найден в каталоге и указан резервный вариант, запрос перенаправляется резервному методу :meth:`npgettext`. В противном случае, когда *n* равно 1, возвращается *единственное* число, а во всех остальных случаях возвращается *множественное число*.

source: Solaris message catalog support
ru: Поддержка каталога сообщений Solaris

source: The Solaris operating system defines its own binary :file:`.mo` file format, but since no documentation can be found on this format, it is not supported at this time.
ru: Операционная система Solaris определяет свой собственный двоичный формат файла :file:`.mo`, но, поскольку по этому формату не найдено никакой документации, в настоящее время он не поддерживается.

source: The Catalog constructor
ru: Конструктор каталога

source: GNOME uses a version of the :mod:`gettext` module by James Henstridge, but this version has a slightly different API. Its documented usage was::
ru: GNOME использует версию модуля :mod:`gettext` Джеймса Хенстриджа, но у этой версии немного другой API. Его документированное использование было:

source: For compatibility with this older module, the function :func:`!Catalog` is an alias for the :func:`translation` function described above.
ru: Для совместимости с этим старым модулем функция :func:`!Catalog` является псевдонимом функции :func:`translation`, описанной выше.

source: One difference between this module and Henstridge's: his catalog objects supported access through a mapping API, but this appears to be unused and so is not currently supported.
ru: Одно отличие между этим модулем и модулем Хенстриджа: его объекты каталога поддерживают доступ через API сопоставления, но он, похоже, не используется и поэтому в настоящее время не поддерживается.

source: Internationalizing your programs and modules
ru: Интернационализация ваших программ и модулей

source: Internationalization (I18N) refers to the operation by which a program is made aware of multiple languages. Localization (L10N) refers to the adaptation of your program, once internationalized, to the local language and cultural habits. In order to provide multilingual messages for your Python programs, you need to take the following steps:
ru: Интернационализация (I18N) относится к операции, посредством которой программа распознает несколько языков. Локализация (L10N) означает адаптацию вашей программы после интернационализации к местному языку и культурным традициям. Чтобы обеспечить многоязычные сообщения для ваших программ Python, вам необходимо предпринять следующие шаги:

source: prepare your program or module by specially marking translatable strings
ru: подготовьте свою программу или модуль, специально отметив переводимые строки

source: run a suite of tools over your marked files to generate raw messages catalogs
ru: запустите набор инструментов над отмеченными файлами для создания каталогов необработанных сообщений

source: create language-specific translations of the message catalogs
ru: создавать языковые переводы каталогов сообщений

source: use the :mod:`gettext` module so that message strings are properly translated
ru: используйте модуль :mod:`gettext`, чтобы строки сообщений были правильно переведены

source: In order to prepare your code for I18N, you need to look at all the strings in your files. Any string that needs to be translated should be marked by wrapping it in ``_('...')`` --- that is, a call to the function :func:`_ <gettext>`. For example::
ru: Чтобы подготовить код для I18N, вам необходимо просмотреть все строки в ваших файлах. Любая строка, которую необходимо перевести, должна быть помечена путем заключения ее в ``_('...')`` --- то есть вызов функции :func:`_ <gettext>`. Например::

source: In this example, the string ``'writing a log message'`` is marked as a candidate for translation, while the strings ``'mylog.txt'`` and ``'w'`` are not.
ru: В этом примере строка ``'запись сообщения журнала'`` помечается как кандидат на перевод, а строки ``'mylog.txt'`` и ``'w'`` — нет.

source: There are a few tools to extract the strings meant for translation. The original GNU :program:`gettext` only supported C or C++ source code but its extended version :program:`xgettext` scans code written in a number of languages, including Python, to find strings marked as translatable. `Babel <https://babel.pocoo.org/>`__ is a Python internationalization library that includes a :file:`pybabel` script to extract and compile message catalogs. François Pinard's program called :program:`xpot` does a similar job and is available as part of his `po-utils package <https://github.com/pinard/po-utils>`__.
ru: Существует несколько инструментов для извлечения строк, предназначенных для перевода. Исходная версия GNU :program:`gettext` поддерживала только исходный код C или C++, но ее расширенная версия :program:`xgettext` сканирует код, написанный на нескольких языках, включая Python, чтобы найти строки, помеченные как переводимые. `Babel <https://babel.pocoo.org/>`__ — это библиотека интернационализации Python, которая включает в себя скрипт :file:`pybabel` для извлечения и компиляции каталогов сообщений. Программа Франсуа Пинара под названием :program:`xpot` выполняет аналогичную работу и доступна как часть его `po-utils пакета <https://github.com/pinard/po-utils>`__.

source: (Python also includes pure-Python versions of these programs, called :program:`pygettext.py` and :program:`msgfmt.py`; some Python distributions will install them for you. :program:`pygettext.py` is similar to :program:`xgettext`, but only understands Python source code and cannot handle other programming languages such as C or C++. :program:`pygettext.py` supports a command-line interface similar to :program:`xgettext`; for details on its use, run ``pygettext.py --help``. :program:`msgfmt.py` is binary compatible with GNU :program:`msgfmt`. With these two programs, you may not need the GNU :program:`gettext` package to internationalize your Python applications.)
ru: (Python также включает версии этих программ на чистом Python, называемые :program:`pygettext.py` и :program:`msgfmt.py`; некоторые дистрибутивы Python установят их автоматически. :program:`pygettext.py` аналогичен в :program:`xgettext`, но понимает только исходный код Python и не может работать с другими языками программирования, такими как C или C++. :program:`pygettext.py` поддерживает интерфейс командной строки, аналогичный :program:`xgettext` для; Подробности о его использовании запустите ``pygettext.py --help``. :program:`msgfmt.py` двоично совместим с GNU :program:`msgfmt`. С этими двумя программами вам может не понадобиться GNU :program. :`gettext` для интернационализации ваших приложений Python.)

source: :program:`xgettext`, :program:`pygettext`, and similar tools generate :file:`.po` files that are message catalogs. They are structured human-readable files that contain every marked string in the source code, along with a placeholder for the translated versions of these strings.
ru: :program:`xgettext`, :program:`pygettext` и подобные инструменты генерируют файлы :file:`.po`, которые являются каталогами сообщений. Это структурированные, удобочитаемые файлы, содержащие каждую помеченную строку в исходном коде, а также заполнитель для переведенных версий этих строк.

source: Copies of these :file:`.po` files are then handed over to the individual human translators who write translations for every supported natural language. They send back the completed language-specific versions as a :file:`<language-name>.po` file that's compiled into a machine-readable :file:`.mo` binary catalog file using the :program:`msgfmt` program. The :file:`.mo` files are used by the :mod:`gettext` module for the actual translation processing at run-time.
ru: Копии этих файлов :file:`.po` затем передаются отдельным переводчикам-людям, которые пишут переводы для каждого поддерживаемого естественного языка. Они отправляют обратно готовые версии для конкретного языка в виде файла :file:`<имя-языка>.po`, который компилируется в машиночитаемый двоичный файл каталога :file:`.mo` с помощью программы :program:`msgfmt`. . Файлы :file:`.mo` используются модулем :mod:`gettext` для фактической обработки перевода во время выполнения.

source: How you use the :mod:`gettext` module in your code depends on whether you are internationalizing a single module or your entire application. The next two sections will discuss each case.
ru: То, как вы используете модуль :mod:`gettext` в своем коде, зависит от того, интернационализируете ли вы отдельный модуль или все приложение. В следующих двух разделах будет рассмотрен каждый случай.

source: Localizing your module
ru: Локализация вашего модуля

source: If you are localizing your module, you must take care not to make global changes, e.g. to the built-in namespace. You should not use the GNU :program:`gettext` API but instead the class-based API.
ru: Если вы локализуете свой модуль, вы должны позаботиться о том, чтобы не вносить глобальные изменения, например, во встроенное пространство имен. Вам не следует использовать API GNU :program:`gettext`, а вместо этого использовать API на основе классов.

source: Let's say your module is called "spam" and the module's various natural language translation :file:`.mo` files reside in :file:`/usr/share/locale` in GNU :program:`gettext` format. Here's what you would put at the top of your module::
ru: Допустим, ваш модуль называется «спам», а различные файлы перевода модуля на естественный язык :file:`.mo` находятся в :file:`/usr/share/locale` в формате GNU :program:`gettext`. Вот что вы бы поместили в начало вашего модуля:

source: Localizing your application
ru: Локализация вашего приложения

source: If you are localizing your application, you can install the :func:`!_` function globally into the built-in namespace, usually in the main driver file of your application. This will let all your application-specific files just use ``_('...')`` without having to explicitly install it in each file.
ru: Если вы локализуете свое приложение, вы можете установить функцию :func:`!_` глобально во встроенное пространство имен, обычно в основной файл драйвера вашего приложения. Это позволит всем файлам вашего приложения просто использовать ``_('...')`` без необходимости явно устанавливать его в каждый файл.

source: In the simple case then, you need only add the following bit of code to the main driver file of your application::
ru: В простом случае вам нужно всего лишь добавить следующий фрагмент кода в основной файл драйвера вашего приложения:

source: If you need to set the locale directory, you can pass it into the :func:`install` function::
ru: Если вам нужно установить каталог локали, вы можете передать его в функцию :func:`install`::

source: Changing languages on the fly
ru: Изменение языка на лету

source: If your program needs to support many languages at the same time, you may want to create multiple translation instances and then switch between them explicitly, like so::
ru: Если ваша программа должна поддерживать множество языков одновременно, вы можете создать несколько экземпляров перевода, а затем явно переключаться между ними, например:

source: Deferred translations
ru: Отложенные переводы

source: In most coding situations, strings are translated where they are coded. Occasionally however, you need to mark strings for translation, but defer actual translation until later. A classic example is::
ru: В большинстве случаев кодирования строки переводятся там, где они закодированы. Однако иногда вам нужно пометить строки для перевода, но отложить фактический перевод на более позднее время. Классический пример:

source: Here, you want to mark the strings in the ``animals`` list as being translatable, but you don't actually want to translate them until they are printed.
ru: Здесь вы хотите пометить строки в списке «животные» как переводимые, но на самом деле вы не хотите переводить их, пока они не будут напечатаны.

source: Here is one way you can handle this situation::
ru: Вот один из способов справиться с этой ситуацией:

source: This works because the dummy definition of :func:`!_` simply returns the string unchanged. And this dummy definition will temporarily override any definition of :func:`!_` in the built-in namespace (until the :keyword:`del` command). Take care, though if you have a previous definition of :func:`!_` in the local namespace.
ru: Это работает, потому что фиктивное определение :func:`!_` просто возвращает строку без изменений. И это фиктивное определение будет временно переопределять любое определение :func:`!_` во встроенном пространстве имен (до команды :keyword:`del`). Однако будьте осторожны, если у вас есть предыдущее определение :func:`!_` в локальном пространстве имен.

source: Note that the second use of :func:`!_` will not identify "a" as being translatable to the :program:`gettext` program, because the parameter is not a string literal.
ru: Обратите внимание, что второе использование :func:`!_` не будет идентифицировать "a" как преобразуемое в программу :program:`gettext`, поскольку параметр не является строковым литералом.

source: Another way to handle this is with the following example::
ru: Другой способ справиться с этим — следующий пример:

source: In this case, you are marking translatable strings with the function :func:`!N_`, which won't conflict with any definition of :func:`!_`. However, you will need to teach your message extraction program to look for translatable strings marked with :func:`!N_`. :program:`xgettext`, :program:`pygettext`, ``pybabel extract``, and :program:`xpot` all support this through the use of the :option:`!-k` command-line switch. The choice of :func:`!N_` here is totally arbitrary; it could have just as easily been :func:`!MarkThisStringForTranslation`.
ru: В этом случае вы помечаете переводимые строки функцией :func:`!N_`, которая не будет конфликтовать с каким-либо определением :func:`!_`. Однако вам нужно будет научить вашу программу извлечения сообщений искать переводимые строки, отмеченные :func:`!N_`. :program:`xgettext`, :program:`pygettext`, ``pybabel extract`` и :program:`xpot` поддерживают это посредством использования переключателя командной строки :option:`!-k`. Выбор :func:`!N_` здесь совершенно произволен; с тем же успехом это могло быть и :func:`!MarkThisStringForTranslation`.

source: Acknowledgements
ru: Подтверждение

source: The following people contributed code, feedback, design suggestions, previous implementations, and valuable experience to the creation of this module:
ru: Следующие люди предоставили код, отзывы, предложения по дизайну, предыдущие реализации и ценный опыт для создания этого модуля:

source: Footnotes
ru: Сноски

source: The default locale directory is system dependent; for example, on Red Hat Linux it is :file:`/usr/share/locale`, but on Solaris it is :file:`/usr/lib/locale`. The :mod:`!gettext` module does not try to support these system dependent defaults; instead its default is :file:`{sys.base_prefix}/share/locale` (see :data:`sys.base_prefix`). For this reason, it is always best to call :func:`bindtextdomain` with an explicit absolute path at the start of your application.
ru: Каталог локали по умолчанию зависит от системы; например, в Red Hat Linux это :file:`/usr/share/locale`, а в Solaris это :file:`/usr/lib/locale`. Модуль :mod:`!gettext` не пытается поддерживать эти системно-зависимые значения по умолчанию; вместо этого по умолчанию используется :file:`{sys.base_prefix}/share/locale` (см. :data:`sys.base_prefix`). По этой причине всегда лучше вызывать :func:`bindtextdomain` с явным абсолютным путем в начале вашего приложения.

source: See the footnote for :func:`bindtextdomain` above.
ru: См. сноску к :func:`bindtextdomain` выше.

source: _ (underscore)
ru: _ (подчеркивание)
