Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/gettext.po
Languages: ru

source: :mod:`!gettext` --- Multilingual internationalization services
ru: :mod:`!gettext` --- Службы многоязычной интернационализации

source: **Source code:** :source:`Lib/gettext.py`
ru: **Исходный код:** :source:`Lib/gettext.py`

source: The :mod:`gettext` module provides internationalization (I18N) and localization (L10N) services for your Python modules and applications. It supports both the GNU :program:`gettext` message catalog API and a higher level, class-based API that may be more appropriate for Python files. The interface described below allows you to write your module and application messages in one natural language, and provide a catalog of translated messages for running under different natural languages.
ru: Модуль :mod:`gettext` предоставляет услуги интернационализации (I18N) и локализации (L10N) для ваших модулей и приложений Python. Он поддерживает как API каталога сообщений GNU :program:`gettext`, так и API более высокого уровня на основе классов, который может быть более подходящим для файлов Python. Описанный ниже интерфейс позволяет вам писать сообщения вашего модуля и приложения на одном естественном языке и предоставлять каталог переведенных сообщений для работы на разных естественных языках.

source: Some hints on localizing your Python modules and applications are also given.
ru: Также даются некоторые советы по локализации модулей и приложений Python.

source: The :mod:`gettext` module defines the following API, which is very similar to the GNU :program:`gettext` API. If you use this API you will affect the translation of your entire application globally. Often this is what you want if your application is monolingual, with the choice of language dependent on the locale of your user. If you are localizing a Python module, or if your application needs to switch languages on the fly, you probably want to use the class-based API instead.
ru: Модуль :mod:`gettext` определяет следующий API, который очень похож на API :program:`gettext` GNU. Если вы используете этот API, вы повлияете на перевод всего вашего приложения во всем мире. Часто это то, что вам нужно, если ваше приложение является одноязычным, а выбор языка зависит от языкового стандарта вашего пользователя. Если вы локализуете модуль Python или вашему приложению необходимо переключать языки на лету, вы, вероятно, захотите вместо этого использовать API на основе классов.

source: Bind the *domain* to the locale directory *localedir*. More concretely, :mod:`gettext` will look for binary :file:`.mo` files for the given domain using the path (on Unix): :file:`{localedir}/{language}/LC_MESSAGES/{domain}.mo`, where *language* is searched for in the environment variables :envvar:`LANGUAGE`, :envvar:`LC_ALL`, :envvar:`LC_MESSAGES`, and :envvar:`LANG` respectively.
ru: Привяжите *домен* к каталогу локали *localedir*. Более конкретно, :mod:`gettext` будет искать двоичные файлы :file:`.mo` для данного домена, используя путь (в Unix): :file:`{localedir}/{language}/LC_MESSAGES/{domain} .mo`, где *language* ищется в переменных среды :envvar:`LANGUAGE`, :envvar:`LC_ALL`, :envvar:`LC_MESSAGES` и :envvar:`LANG` соответственно.

source: If *localedir* is omitted or ``None``, then the current binding for *domain* is returned. [#]_
ru: Если *localedir* опущен или ``None``, то возвращается текущая привязка для *domain*. [#]_

source: Change or query the current global domain. If *domain* is ``None``, then the current global domain is returned, otherwise the global domain is set to *domain*, which is returned.
ru: Измените или запросите текущий глобальный домен. Если *domain* имеет значение «None», то возвращается текущий глобальный домен, в противном случае для глобального домена устанавливается значение *domain*, которое и возвращается.

source: Return the localized translation of *message*, based on the current global domain, language, and locale directory. This function is usually aliased as :func:`!_` in the local namespace (see examples below).
ru: Возвращает локализованный перевод *message* на основе текущего глобального домена, языка и каталога локали. Эта функция обычно имеет псевдоним :func:`!_` в локальном пространстве имен (см. примеры ниже).

source: Like :func:`.gettext`, but look the message up in the specified *domain*.
ru: Как :func:`.gettext`, но ищите сообщение в указанном *домене*.

source: Like :func:`.gettext`, but consider plural forms. If a translation is found, apply the plural formula to *n*, and return the resulting message (some languages have more than two plural forms). If no translation is found, return *singular* if *n* is 1; return *plural* otherwise.
ru: Как :func:`.gettext`, но учитывайте формы множественного числа. Если перевод найден, примените формулу множественного числа к *n* и верните полученное сообщение (в некоторых языках имеется более двух форм множественного числа). Если перевод не найден, верните *единственное*, если *n* равно 1; в противном случае верните *множественное число*.

source: The Plural formula is taken from the catalog header. It is a C or Python expression that has a free variable *n*; the expression evaluates to the index of the plural in the catalog. See `the GNU gettext documentation <https://www.gnu.org/software/gettext/manual/gettext.html>`__ for the precise syntax to be used in :file:`.po` files and the formulas for a variety of languages.
ru: Формула множественного числа взята из шапки каталога. Это выражение C или Python, имеющее свободную переменную *n*; выражение оценивается как индекс множественного числа в каталоге. См. `документацию GNU gettext <https://www.gnu.org/software/gettext/manual/gettext.html>`__ для получения точного синтаксиса, который будет использоваться в файлах :file:`.po` и формул для разнообразие языков.

source: Like :func:`ngettext`, but look the message up in the specified *domain*.
ru: Как :func:`ngettext`, но ищите сообщение в указанном *домене*.

source: Similar to the corresponding functions without the ``p`` in the prefix (that is, :func:`gettext`, :func:`dgettext`, :func:`ngettext`, :func:`dngettext`), but the translation is restricted to the given message *context*.
ru: Аналогично соответствующим функциям без ``p`` в префиксе (то есть :func:`gettext`, :func:`dgettext`, :func:`ngettext`, :func:`dngettext`), но перевод ограничен данным сообщением *контекст*.

source: Note that GNU :program:`gettext` also defines a :func:`!dcgettext` method, but this was deemed not useful and so it is currently unimplemented.
ru: Обратите внимание, что GNU :program:`gettext` также определяет метод :func:`!dcgettext`, но он был сочтен бесполезным и поэтому в настоящее время не реализован.

source: Here's an example of typical usage for this API::
ru: Вот пример типичного использования этого API:

source: Class-based API
ru: API, основанный на классах

source: The class-based API of the :mod:`gettext` module gives you more flexibility and greater convenience than the GNU :program:`gettext` API. It is the recommended way of localizing your Python applications and modules. :mod:`!gettext` defines a :class:`GNUTranslations` class which implements the parsing of GNU :file:`.mo` format files, and has methods for returning strings. Instances of this class can also install themselves in the built-in namespace as the function :func:`!_`.
ru: API-интерфейс на основе классов модуля :mod:`gettext` обеспечивает большую гибкость и удобство, чем API :program:`gettext` GNU. Это рекомендуемый способ локализации приложений и модулей Python. :mod:`!gettext` определяет класс :class:`GNUTranslations`, который реализует синтаксический анализ файлов формата GNU :file:`.mo` и имеет методы для возврата строк. Экземпляры этого класса также могут устанавливаться во встроенном пространстве имен как функция :func:`!_`.

source: This function implements the standard :file:`.mo` file search algorithm. It takes a *domain*, identical to what :func:`textdomain` takes. Optional *localedir* is as in :func:`bindtextdomain`. Optional *languages* is a list of strings, where each string is a language code.
ru: Эта функция реализует стандартный алгоритм поиска файлов :file:`.mo`. Для этого требуется *домен*, идентичный тому, что принимает :func:`textdomain`. Необязательный *localedir* аналогичен :func:`bindtextdomain`. Необязательный *languages* — это список строк, где каждая строка представляет собой код языка.

source: If *localedir* is not given, then the default system locale directory is used. [#]_ If *languages* is not given, then the following environment variables are searched: :envvar:`LANGUAGE`, :envvar:`LC_ALL`, :envvar:`LC_MESSAGES`, and :envvar:`LANG`. The first one returning a non-empty value is used for the *languages* variable. The environment variables should contain a colon separated list of languages, which will be split on the colon to produce the expected list of language code strings.
ru: Если *localedir* не указан, то используется системный каталог локали по умолчанию. [#]_ Если *languages* не указан, то выполняется поиск по следующим переменным среды: :envvar:`LANGUAGE`, :envvar:`LC_ALL`, :envvar:`LC_MESSAGES` и :envvar:`LANG`. Первый из них, возвращающий непустое значение, используется для переменной *languages*. Переменные среды должны содержать список языков, разделенных двоеточием, который будет разделен на двоеточие для получения ожидаемого списка строк кода языка.

source: :func:`find` then expands and normalizes the languages, and then iterates through them, searching for an existing file built of these components:
ru: :func:`find` затем расширяет и нормализует языки, а затем перебирает их в поисках существующего файла, состоящего из этих компонентов:

source: The first such file name that exists is returned by :func:`find`. If no such file is found, then ``None`` is returned. If *all* is given, it returns a list of all file names, in the order in which they appear in the languages list or the environment variables.
ru: Первое существующее такое имя файла возвращается функцией :func:`find`. Если такой файл не найден, возвращается None. Если указано *all*, возвращается список всех имен файлов в том порядке, в котором они появляются в списке языков или переменных среды.

source: Return a ``*Translations`` instance based on the *domain*, *localedir*, and *languages*, which are first passed to :func:`find` to get a list of the associated :file:`.mo` file paths. Instances with identical :file:`.mo` file names are cached. The actual class instantiated is *class_* if provided, otherwise :class:`GNUTranslations`. The class's constructor must take a single :term:`file object` argument.
ru: Возвращает экземпляр ``*Translations`` на основе *domain*, *localedir* и *languages*, которые сначала передаются в :func:`find` для получения списка связанных :file:`.mo` пути к файлам. Экземпляры с идентичными именами файлов :file:`.mo` кэшируются. Фактический экземпляр класса — *class_*, если он указан, в противном случае — :class:`GNUTranslations`. Конструктор класса должен принимать один аргумент :term:`file object`.

source: If multiple files are found, later files are used as fallbacks for earlier ones. To allow setting the fallback, :func:`copy.copy` is used to clone each translation object from the cache; the actual instance data is still shared with the cache.
ru: Если обнаружено несколько файлов, более поздние файлы используются как резервные копии более ранних. Чтобы разрешить установку резервного варианта, :func:`copy.copy` используется для клонирования каждого объекта перевода из кэша; фактические данные экземпляра по-прежнему используются совместно с кешем.

source: If no :file:`.mo` file is found, this function raises :exc:`OSError` if *fallback* is false (which is the default), and returns a :class:`NullTranslations` instance if *fallback* is true.
ru: Если файл :file:`.mo` не найден, эта функция вызывает :exc:`OSError`, если *fallback* имеет значение false (что является значением по умолчанию), и возвращает экземпляр :class:`NullTranslations`, если *fallback* имеет значение истинный.

source: :exc:`IOError` used to be raised, it is now an alias of :exc:`OSError`.
ru: :exc:`IOError` раньше использовался для возбуждения, теперь это псевдоним :exc:`OSError`.

source: *codeset* parameter is removed.
ru: Параметр *codeset* удален.

source: This installs the function :func:`!_` in Python's builtins namespace, based on *domain* and *localedir* which are passed to the function :func:`translation`.
ru: Это устанавливает функцию :func:`!_` во встроенном пространстве имен Python на основе *domain* и *localedir*, которые передаются в функцию :func:`translation`.

source: For the *names* parameter, please see the description of the translation object's :meth:`~NullTranslations.install` method.
ru: Для параметра *names* см. описание метода :meth:`~NullTranslations.install` объекта перевода.

source: As seen below, you usually mark the strings in your application that are candidates for translation, by wrapping them in a call to the :func:`!_` function, like this::
ru: Как показано ниже, вы обычно отмечаете в приложении строки, являющиеся кандидатами на перевод, заключая их в вызов функции :func:`!_`, например:

source: For convenience, you want the :func:`!_` function to be installed in Python's builtins namespace, so it is easily accessible in all modules of your application.
ru: Для удобства вы хотите, чтобы функция :func:`!_` была установлена ​​во встроенном пространстве имен Python, чтобы она была легко доступна во всех модулях вашего приложения.

source: *names* is now a keyword-only parameter.
ru: *names* теперь является параметром только для ключевых слов.

source: The :class:`NullTranslations` class
ru: Класс :class:`NullTranslations`

source: Translation classes are what actually implement the translation of original source file message strings to translated message strings. The base class used by all translation classes is :class:`NullTranslations`; this provides the basic interface you can use to write your own specialized translation classes. Here are the methods of :class:`!NullTranslations`:
ru: Классы перевода — это то, что фактически реализует перевод строк сообщений исходного файла в переведенные строки сообщений. Базовый класс, используемый всеми классами перевода, — :class:`NullTranslations`; это обеспечивает базовый интерфейс, который вы можете использовать для написания собственных специализированных классов перевода. Вот методы :class:`!NullTranslations`:

source: Takes an optional :term:`file object` *fp*, which is ignored by the base class. Initializes "protected" instance variables *_info* and *_charset* which are set by derived classes, as well as *_fallback*, which is set through :meth:`add_fallback`. It then calls ``self._parse(fp)`` if *fp* is not ``None``.
ru: Принимает необязательный файловый объект *fp*, который игнорируется базовым классом. Инициализирует «защищенные» переменные экземпляра *_info* и *_charset*, которые устанавливаются производными классами, а также *_fallback*, который устанавливается через :meth:`add_fallback`. Затем он вызывает ``self._parse(fp)``, если *fp* не ``None``.

source: No-op in the base class, this method takes file object *fp*, and reads the data from the file, initializing its message catalog. If you have an unsupported message catalog file format, you should override this method to parse your format.
ru: Неактивный в базовом классе, этот метод принимает файловый объект *fp* и считывает данные из файла, инициализируя его каталог сообщений. Если у вас неподдерживаемый формат файла каталога сообщений, вам следует переопределить этот метод для анализа вашего формата.

source: Add *fallback* as the fallback object for the current translation object. A translation object should consult the fallback if it cannot provide a translation for a given message.
ru: Добавьте *fallback* в качестве резервного объекта для текущего объекта перевода. Объект перевода должен обратиться к резервному варианту, если он не может обеспечить перевод для данного сообщения.

source: If a fallback has been set, forward :meth:`!gettext` to the fallback. Otherwise, return *message*. Overridden in derived classes.
ru: Если был установлен резервный вариант, перешлите :meth:`!gettext` к резервному варианту. В противном случае верните *сообщение*. Переопределено в производных классах.

source: If a fallback has been set, forward :meth:`!ngettext` to the fallback. Otherwise, return *singular* if *n* is 1; return *plural* otherwise. Overridden in derived classes.
ru: Если был установлен резервный вариант, перешлите :meth:`!ngettext` к резервному варианту. В противном случае верните *singular*, если *n* равно 1; в противном случае верните *множественное число*. Переопределено в производных классах.

source: If a fallback has been set, forward :meth:`pgettext` to the fallback. Otherwise, return the translated message. Overridden in derived classes.
ru: Если был установлен резервный вариант, переправьте :meth:`pgettext` на резервный вариант. В противном случае верните переведенное сообщение. Переопределено в производных классах.

source: If a fallback has been set, forward :meth:`npgettext` to the fallback. Otherwise, return the translated message. Overridden in derived classes.
ru: Если был установлен резервный вариант, переправьте :meth:`npgettext` на резервный вариант. В противном случае верните переведенное сообщение. Переопределено в производных классах.

source: Return a dictionary containing the metadata found in the message catalog file.
ru: Верните словарь, содержащий метаданные, найденные в файле каталога сообщений.

source: Return the encoding of the message catalog file.
ru: Возвращает кодировку файла каталога сообщений.

source: This method installs :meth:`.gettext` into the built-in namespace, binding it to ``_``.
ru: Этот метод устанавливает :meth:`.gettext` во встроенное пространство имен, привязывая его к ``_``.

source: If the *names* parameter is given, it must be a sequence containing the names of functions you want to install in the builtins namespace in addition to :func:`!_`. Supported names are ``'gettext'``, ``'ngettext'``, ``'pgettext'``, and ``'npgettext'``.
ru: Если указан параметр *names*, это должна быть последовательность, содержащая имена функций, которые вы хотите установить во встроенном пространстве имен, в дополнение к :func:`!_`. Поддерживаемые имена: gettext, ngettext, pgettext и npgettext.

source: Note that this is only one way, albeit the most convenient way, to make the :func:`!_` function available to your application. Because it affects the entire application globally, and specifically the built-in namespace, localized modules should never install :func:`!_`. Instead, they should use this code to make :func:`!_` available to their module::
ru: Обратите внимание, что это только один, хотя и самый удобный способ сделать функцию :func:`!_` доступной для вашего приложения. Поскольку это влияет на все приложение глобально и, в частности, на встроенное пространство имен, локализованные модули никогда не должны устанавливать :func:`!_`. Вместо этого им следует использовать этот код, чтобы сделать :func:`!_` доступным для своего модуля::

source: This puts :func:`!_` only in the module's global namespace and so only affects calls within this module.
ru: Это помещает :func:`!_` только в глобальное пространство имен модуля и поэтому влияет только на вызовы внутри этого модуля.

source: Added ``'pgettext'`` and ``'npgettext'``.
ru: Добавлены ``'pgettext'`` и ``'npgettext'``.

source: The :class:`GNUTranslations` class
ru: Класс :class:`GNUTranslations`

source: The :mod:`!gettext` module provides one additional class derived from :class:`NullTranslations`: :class:`GNUTranslations`. This class overrides :meth:`!_parse` to enable reading GNU :program:`gettext` format :file:`.mo` files in both big-endian and little-endian format.
ru: Модуль :mod:`!gettext` предоставляет один дополнительный класс, производный от :class:`NullTranslations`: :class:`GNUTranslations`. Этот класс переопределяет :meth:`!_parse`, чтобы разрешить чтение файлов GNU :program:`gettext` формата :file:`.mo` как в формате с прямым порядком байтов, так и с прямым порядком байтов.

source: :class:`GNUTranslations` parses optional metadata out of the translation catalog. It is convention with GNU :program:`gettext` to include metadata as the translation for the empty string. This metadata is in :rfc:`822`\ -style ``key: value`` pairs, and should contain the ``Project-Id-Version`` key. If the key ``Content-Type`` is found, then the ``charset`` property is used to initialize the "protected" :attr:`!_charset` instance variable, defaulting to ``None`` if not found. If the charset encoding is specified, then all message ids and message strings read from the catalog are converted to Unicode using this encoding, else ASCII is assumed.
ru: :class:`GNUTranslations` анализирует дополнительные метаданные из каталога переводов. В GNU :program:`gettext` принято включать метаданные в качестве перевода пустой строки. Эти метаданные представлены в виде пар ``ключ: значение`` в стиле :rfc:`822`\ и должны содержать ключ ``Project-Id-Version``. Если ключ ``Content-Type`` найден, то свойство ``charset`` используется для инициализации "защищенной" переменной экземпляра :attr:`!_charset`, по умолчанию используется значение ``None``, если она не найдена. Если указана кодировка набора символов, то все идентификаторы сообщений и строки сообщений, считанные из каталога, преобразуются в Unicode с использованием этой кодировки, в противном случае предполагается ASCII.

source: Since message ids are read as Unicode strings too, all ``*gettext()`` methods will assume message ids as Unicode strings, not byte strings.
ru: Поскольку идентификаторы сообщений также считываются как строки Unicode, все методы ``*gettext()`` будут считать идентификаторы сообщений строками Unicode, а не байтовыми строками.

source: The entire set of key/value pairs are placed into a dictionary and set as the "protected" :attr:`!_info` instance variable.
ru: Весь набор пар ключ/значение помещается в словарь и устанавливается как «защищенная» переменная экземпляра :attr:`!_info`.

source: If the :file:`.mo` file's magic number is invalid, the major version number is unexpected, or if other problems occur while reading the file, instantiating a :class:`GNUTranslations` class can raise :exc:`OSError`.
ru: Если магический номер файла :file:`.mo` недействителен, основной номер версии неожиданный или если при чтении файла возникают другие проблемы, создание экземпляра класса :class:`GNUTranslations` может привести к возникновению :exc:`OSError`.

source: The following methods are overridden from the base class implementation:
ru: Следующие методы переопределяются из реализации базового класса:

source: Look up the *message* id in the catalog and return the corresponding message string, as a Unicode string. If there is no entry in the catalog for the *message* id, and a fallback has been set, the look up is forwarded to the fallback's :meth:`~NullTranslations.gettext` method. Otherwise, the *message* id is returned.
ru: Найдите идентификатор *message* в каталоге и верните соответствующую строку сообщения в виде строки Юникода. Если в каталоге нет записи для идентификатора *message* и установлен резервный вариант, поиск перенаправляется в резервный метод :meth:`~NullTranslations.gettext`. В противном случае возвращается идентификатор *message*.
