Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/glob.po
Languages: ru, uk

source: :mod:`!glob` --- Unix style pathname pattern expansion
ru: :mod:`!glob` --- Расширение шаблона пути в стиле Unix

source: **Source code:** :source:`Lib/glob.py`
ru: **Исходный код:** :source:`Lib/glob.py`
uk: **Вихідний код:** :source:`Lib/glob.py`

source: The :mod:`glob` module finds all the pathnames matching a specified pattern according to the rules used by the Unix shell, although results are returned in arbitrary order. No tilde expansion is done, but ``*``, ``?``, and character ranges expressed with ``[]`` will be correctly matched. This is done by using the :func:`os.scandir` and :func:`fnmatch.fnmatch` functions in concert, and not by actually invoking a subshell.
ru: Модуль :mod:`glob` находит все пути, соответствующие указанному шаблону, в соответствии с правилами, используемыми оболочкой Unix, хотя результаты возвращаются в произвольном порядке. Расширение тильды не выполняется, но ``*``, ``?`` и диапазоны символов, выраженные с помощью ``[]``, будут правильно сопоставлены. Это делается путем совместного использования функций :func:`os.scandir` и :func:`fnmatch.fnmatch`, а не путем фактического вызова подоболочки.
uk: Модуль :mod:`glob` знаходить усі імена шляхів, що відповідають заданому шаблону, згідно з правилами, що використовуються оболонкою Unix, хоча результати повертаються в довільному порядку. Розгортання тильди не виконується, але ``*``, ``?`` і діапазони символів, виражені ``[]``, будуть правильно зіставлені. Це робиться за допомогою спільного використання функцій :func:`os.scandir` і :func:`fnmatch.fnmatch`, а не шляхом фактичного виклику підоболонки.

source: Note that files beginning with a dot (``.``) can only be matched by patterns that also start with a dot, unlike :func:`fnmatch.fnmatch` or :func:`pathlib.Path.glob`. (For tilde and shell variable expansion, use :func:`os.path.expanduser` and :func:`os.path.expandvars`.)
ru: Обратите внимание, что файлы, начинающиеся с точки (``.``), могут сопоставляться только с шаблонами, которые также начинаются с точки, в отличие от :func:`fnmatch.fnmatch` или :func:`pathlib.Path.glob`. (Для расширения переменных оболочки и тильды используйте :func:`os.path.expanduser` и :func:`os.path.expandvars`.)
uk: Зауважте, що файли, які починаються з крапки (``.``), можуть бути зіставлені лише шаблонами, які також починаються з крапки, на відміну від :func:`fnmatch.fnmatch` або :func:`pathlib.Path.glob`. (Для розширення змінної тильди та оболонки використовуйте :func:`os.path.expanduser` і :func:`os.path.expandvars`.)

source: For a literal match, wrap the meta-characters in brackets. For example, ``'[?]'`` matches the character ``'?'``.
ru: Для буквального совпадения заключите метасимволы в скобки. Например, ``'[?]'`` соответствует символу ``'?'``.
uk: Для буквального збігу заберіть метасимволи в дужки. Наприклад, ``''[?]'`` відповідає символу ``''?'``.

source: The :mod:`glob` module defines the following functions:
ru: Модуль :mod:`glob` определяет следующие функции:

source: Return a possibly empty list of path names that match *pathname*, which must be a string containing a path specification. *pathname* can be either absolute (like :file:`/usr/src/Python-1.5/Makefile`) or relative (like :file:`../../Tools/\*/\*.gif`), and can contain shell-style wildcards. Broken symlinks are included in the results (as in the shell). Whether or not the results are sorted depends on the file system. If a file that satisfies conditions is removed or added during the call of this function, whether a path name for that file will be included is unspecified.
ru: Возвращает возможно пустой список имен путей, соответствующих *pathname*, который должен быть строкой, содержащей спецификацию пути. *pathname* может быть абсолютным (например, :file:`/usr/src/Python-1.5/Makefile`) или относительным (например, :file:`../../Tools/\*/\*.gif`) и может содержать подстановочные знаки в стиле оболочки. Неработающие символические ссылки включаются в результаты (как и в оболочке). Сортировка результатов зависит от файловой системы. Если файл, удовлетворяющий условиям, удаляется или добавляется во время вызова этой функции, будет ли включен путь для этого файла, не указано.

source: If *root_dir* is not ``None``, it should be a :term:`path-like object` specifying the root directory for searching. It has the same effect on :func:`glob` as changing the current directory before calling it. If *pathname* is relative, the result will contain paths relative to *root_dir*.
ru: Если *root_dir* не ``None``, это должен быть :term:`path-подобный объект`, определяющий корневой каталог для поиска. Это имеет тот же эффект на :func:`glob`, что и изменение текущего каталога перед его вызовом. Если *pathname* является относительным, результат будет содержать пути относительно *root_dir*.
uk: Якщо *root_dir* не ``None``, це має бути :term:`path-like object`, що вказує кореневий каталог для пошуку. Це має такий самий вплив на :func:`glob`, як і зміна поточного каталогу перед його викликом. Якщо *pathname* є відносним, результат міститиме шляхи відносно *root_dir*.

source: This function can support :ref:`paths relative to directory descriptors <dir_fd>` with the *dir_fd* parameter.
ru: Эта функция может поддерживать пути относительно дескрипторов каталогов. ` с параметром *dir_fd*.
uk: Ця функція може підтримувати :ref:`шляхи відносно дескрипторів каталогу <dir_fd>` з параметром *dir_fd*.

source: If *recursive* is true, the pattern "``**``" will match any files and zero or more directories, subdirectories and symbolic links to directories. If the pattern is followed by an :data:`os.sep` or :data:`os.altsep` then files will not match.
ru: Если значение *recursive* истинно, шаблон «``**``» будет соответствовать любым файлам и нулю или более каталогам, подкаталогам и символическим ссылкам на каталоги. Если за шаблоном следует :data:`os.sep` или :data:`os.altsep`, файлы не будут совпадать.
uk: Якщо *recursive* має значення true, шаблон "``**``" відповідатиме будь-яким файлам і нулю або більше каталогів, підкаталогів і символічних посилань на каталоги. Якщо за шаблоном йде :data:`os.sep` або :data:`os.altsep`, файли не збігатимуться.

source: If *include_hidden* is true, "``**``" pattern will match hidden directories.
ru: Если *include_hidden* имеет значение true, шаблон «``**``» будет соответствовать скрытым каталогам.

source: Raises an :ref:`auditing event <auditing>` ``glob.glob`` with arguments ``pathname``, ``recursive``.
ru: Вызывает :ref:`событие аудита <auditing>``glob.glob`` с аргументами ``pathname``, ``recursive``.
uk: Викликає :ref:`подію аудиту <auditing>` ``glob.glob`` з аргументами ``pathname``, ``recursive``.

source: Raises an :ref:`auditing event <auditing>` ``glob.glob/2`` with arguments ``pathname``, ``recursive``, ``root_dir``, ``dir_fd``.
ru: Вызывает событие аудита <auditing>` ``glob.glob/2`` с аргументами ``pathname``, ``recursive``, ``root_dir``, ``dir_fd``.
uk: Викликає :ref:`подію аудиту <auditing>` ``glob.glob/2`` з аргументами ``pathname``, ``recursive``, ``root_dir``, ``dir_fd``.

source: Using the "``**``" pattern in large directory trees may consume an inordinate amount of time.
ru: Использование шаблона «``**``» в больших деревьях каталогов может занять слишком много времени.
uk: Використання шаблону "``**``" у великих деревах каталогів може зайняти надто багато часу.

source: This function may return duplicate path names if *pathname* contains multiple "``**``" patterns and *recursive* is true.
ru: Эта функция может возвращать повторяющиеся имена путей, если *pathname* содержит несколько шаблонов «``**``» и *recursive* имеет значение true.

source: Support for recursive globs using "``**``".
ru: Поддержка рекурсивных glob с использованием «``**``».
uk: Підтримка рекурсивних глобусів з використанням "``**``".

source: Added the *root_dir* and *dir_fd* parameters.
ru: Добавлены параметры *root_dir* и *dir_fd*.
uk: Додано параметри *root_dir* і *dir_fd*.

source: Added the *include_hidden* parameter.
ru: Добавлен параметр *include_hidden*.

source: Return an :term:`iterator` which yields the same values as :func:`glob` without actually storing them all simultaneously.
ru: Возвращает :term:`iterator`, который возвращает те же значения, что и :func:`glob`, но не сохраняет их все одновременно.
uk: Повертає :term:`iterator`, який дає ті самі значення, що й :func:`glob`, фактично не зберігаючи їх усі одночасно.

source: Escape all special characters (``'?'``, ``'*'`` and ``'['``). This is useful if you want to match an arbitrary literal string that may have special characters in it. Special characters in drive/UNC sharepoints are not escaped, e.g. on Windows ``escape('//?/c:/Quo vadis?.txt')`` returns ``'//?/c:/Quo vadis[?].txt'``.
ru: Экранируйте все специальные символы (``'?'``, ``'*'`` и ``'['``). Это полезно, если вы хотите сопоставить произвольную литеральную строку, которая может содержать специальные символы. Специальные символы в общих точках диска/UNC не экранируются, например, в Windows ``escape('//?/c:/Quo vadis?.txt')`` возвращает ``'//?/c:/Quo vadis[? ].txt'``.
uk: Екранування всіх спеціальних символів (``'?'``, ``'*'`` і ``'['``). Це корисно, якщо ви хочете зіставити довільний літеральний рядок, який може містити спеціальні символи. Спеціальні символи в точках доступу/UNC не екрануються, напр. у Windows ``escape('//?/c:/Quo vadis?.txt')`` повертає ``'//?/c:/Quo vadis[?].txt''``.

source: Convert the given path specification to a regular expression for use with :func:`re.match`. The path specification can contain shell-style wildcards.
ru: Преобразуйте указанную спецификацию пути в регулярное выражение для использования с :func:`re.match`. Спецификация пути может содержать подстановочные знаки в стиле оболочки.

source: For example:
ru: Например:

source: Path separators and segments are meaningful to this function, unlike :func:`fnmatch.translate`. By default wildcards do not match path separators, and ``*`` pattern segments match precisely one path segment.
ru: Разделители путей и сегменты имеют значение для этой функции, в отличие от :func:`fnmatch.translate`. По умолчанию подстановочные знаки не соответствуют разделителям путей, а сегменты шаблона ``*`` соответствуют ровно одному сегменту пути.

source: If *recursive* is true, the pattern segment "``**``" will match any number of path segments.
ru: Если *recursive* имеет значение true, сегмент шаблона «``**``» будет соответствовать любому количеству сегментов пути.

source: If *include_hidden* is true, wildcards can match path segments that start with a dot (``.``).
ru: Если *include_hidden* имеет значение true, подстановочные знаки могут соответствовать сегментам пути, начинающимся с точки (``.``).

source: A sequence of path separators may be supplied to the *seps* argument. If not given, :data:`os.sep` and :data:`~os.altsep` (if available) are used.
ru: В аргумент *seps* может быть передана последовательность разделителей пути. Если не указано, используются :data:`os.sep` и :data:`~os.altsep` (если доступны).

source: :meth:`pathlib.PurePath.full_match` and :meth:`pathlib.Path.glob` methods, which call this function to implement pattern matching and globbing.
ru: Методы :meth:`pathlib.PurePath.full_match` и :meth:`pathlib.Path.glob`, которые вызывают эту функцию для реализации сопоставления с образцом и подстановки под шаблон.

source: Examples
ru: Примеры

source: Consider a directory containing the following files: :file:`1.gif`, :file:`2.txt`, :file:`card.gif` and a subdirectory :file:`sub` which contains only the file :file:`3.txt`. :func:`glob` will produce the following results. Notice how any leading components of the path are preserved. ::
ru: Рассмотрим каталог, содержащий следующие файлы: :file:`1.gif`, :file:`2.txt`, :file:`card.gif` и подкаталог :file:`sub`, который содержит только файл :file. :`3.txt`. :func:`glob` даст следующие результаты. Обратите внимание, как сохраняются все ведущие компоненты пути. ::

source: The :mod:`fnmatch` module offers shell-style filename (not path) expansion.
ru: Модуль :mod:`fnmatch` предлагает расширение имени файла (а не пути) в стиле оболочки.

source: The :mod:`pathlib` module offers high-level path objects.
ru: Модуль :mod:`pathlib` предлагает объекты путей высокого уровня.
uk: Модуль :mod:`pathlib` пропонує об’єкти шляху високого рівня.

source: filenames
ru: имена файлов

source: pathname expansion
ru: расширение пути

source: * (asterisk)
ru: * (звёздочка)

source: in glob-style wildcards
ru: в подстановочных знаках в стиле glob

source: ? (question mark)
ru: ? (знак вопроса)

source: [] (square brackets)
ru: [] (квадратные скобки)

source: ! (exclamation)
ru: ! (восклицание)

source: - (minus)
ru: - (минус)

source: . (dot)
ru: . (точка)

source: :mod:`glob` --- Unix style pathname pattern expansion
uk: :mod:`glob` --- Розширення шаблону шляху імені Unix

source: For example, consider a directory containing the following files: :file:`1.gif`, :file:`2.txt`, :file:`card.gif` and a subdirectory :file:`sub` which contains only the file :file:`3.txt`. :func:`glob` will produce the following results. Notice how any leading components of the path are preserved. ::
uk: Наприклад, розглянемо каталог, що містить такі файли: :file:`1.gif`, :file:`2.txt`, :file:`card.gif` і підкаталог :file:`sub`, який містить лише файл :file:`3.txt`. :func:`glob` дасть такі результати. Зверніть увагу на те, як зберігаються будь-які провідні компоненти шляху. ::

source: If the directory contains files starting with ``.`` they won't be matched by default. For example, consider a directory containing :file:`card.gif` and :file:`.card.gif`::
uk: Якщо каталог містить файли, які починаються з ``.``, вони не будуть зіставлені за умовчанням. Наприклад, розглянемо каталог, що містить :file:`card.gif` і :file:`.card.gif`::

source: Module :mod:`fnmatch`
uk: Модуль :mod:`fnmatch`

source: Shell-style filename (not path) expansion
uk: Розширення імені файлу (не шляху) у стилі оболонки
