Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/http.client.po
Languages: ru

source: :mod:`!http.client` --- HTTP protocol client
ru: :mod:`!http.client` --- Клиент протокола HTTP

source: **Source code:** :source:`Lib/http/client.py`
ru: **Исходный код:** :source:`Lib/http/client.py`

source: This module defines classes that implement the client side of the HTTP and HTTPS protocols. It is normally not used directly --- the module :mod:`urllib.request` uses it to handle URLs that use HTTP and HTTPS.
ru: Этот модуль определяет классы, реализующие клиентскую часть протоколов HTTP и HTTPS. Обычно он не используется напрямую — модуль :mod:`urllib.request` использует его для обработки URL-адресов, использующих HTTP и HTTPS.

source: The `Requests package <https://requests.readthedocs.io/en/latest/>`_ is recommended for a higher-level HTTP client interface.
ru: `Пакет Requests <https://requests.readthedocs.io/en/latest/>`_ рекомендуется для клиентского интерфейса HTTP более высокого уровня.

source: HTTPS support is only available if Python was compiled with SSL support (through the :mod:`ssl` module).
ru: Поддержка HTTPS доступна только в том случае, если Python был скомпилирован с поддержкой SSL (через модуль :mod:`ssl`).

source: Availability
ru: Доступность

source: This module does not work or is not available on WebAssembly. See :ref:`wasm-availability` for more information.
ru: Этот модуль не работает или недоступен в WebAssembly. См. :ref:`wasm-availability` для получения дополнительной информации.

source: The module provides the following classes:
ru: Модуль предоставляет следующие классы:

source: An :class:`HTTPConnection` instance represents one transaction with an HTTP server. It should be instantiated by passing it a host and optional port number. If no port number is passed, the port is extracted from the host string if it has the form ``host:port``, else the default HTTP port (80) is used. If the optional *timeout* parameter is given, blocking operations (like connection attempts) will timeout after that many seconds (if it is not given, the global default timeout setting is used). The optional *source_address* parameter may be a tuple of a (host, port) to use as the source address the HTTP connection is made from. The optional *blocksize* parameter sets the buffer size in bytes for sending a file-like message body.
ru: Экземпляр :class:`HTTPConnection` представляет одну транзакцию с HTTP-сервером. Его следует создать, передав ему хост и необязательный номер порта. Если номер порта не передается, порт извлекается из строки хоста, если он имеет форму «хост:порт», в противном случае используется порт HTTP по умолчанию (80). Если указан необязательный параметр *timeout*, операции блокировки (например, попытки подключения) истечет по истечении этого количества секунд (если он не указан, используется глобальная настройка таймаута по умолчанию). Необязательный параметр *source_address* может представлять собой кортеж (хост, порт), который будет использоваться в качестве исходного адреса, с которого осуществляется HTTP-соединение. Необязательный параметр *blocksize* устанавливает размер буфера в байтах для отправки тела сообщения в виде файла.

source: For example, the following calls all create instances that connect to the server at the same host and port::
ru: Например, следующий вызов вызывает все экземпляры create, подключающиеся к серверу через один и тот же хост и порт:

source: *source_address* was added.
ru: Был добавлен *адрес_источника*.

source: The *strict* parameter was removed. HTTP 0.9-style "Simple Responses" are no longer supported.
ru: Параметр *strict* был удален. «Простые ответы» в стиле HTTP 0.9 больше не поддерживаются.

source: *blocksize* parameter was added.
ru: Добавлен параметр *blocksize*.

source: A subclass of :class:`HTTPConnection` that uses SSL for communication with secure servers. Default port is ``443``. If *context* is specified, it must be a :class:`ssl.SSLContext` instance describing the various SSL options.
ru: Подкласс :class:`HTTPConnection`, который использует SSL для связи с защищенными серверами. Порт по умолчанию — ``443``. Если указан *context*, это должен быть экземпляр :class:`ssl.SSLContext`, описывающий различные параметры SSL.

source: Please read :ref:`ssl-security` for more information on best practices.
ru: Пожалуйста, прочтите :ref:`ssl-security` для получения дополнительной информации о лучших практиках.

source: *source_address*, *context* and *check_hostname* were added.
ru: Были добавлены *source_address*, *context* и *check_hostname*.

source: This class now supports HTTPS virtual hosts if possible (that is, if :const:`ssl.HAS_SNI` is true).
ru: Этот класс теперь поддерживает виртуальные хосты HTTPS, если это возможно (то есть, если :const:`ssl.HAS_SNI` истинно).

source: The *strict* parameter was removed. HTTP 0.9-style "Simple Responses" are no longer supported.
ru: Параметр *strict* был удален. «Простые ответы» в стиле HTTP 0.9 больше не поддерживаются.

source: This class now performs all the necessary certificate and hostname checks by default. To revert to the previous, unverified, behavior :func:`!ssl._create_unverified_context` can be passed to the *context* parameter.
ru: Этот класс теперь по умолчанию выполняет все необходимые проверки сертификатов и имен хостов. Чтобы вернуться к предыдущему, непроверенному поведению, параметру *context* можно передать :func:`!ssl._create_unverified_context`.

source: This class now enables TLS 1.3 :attr:`ssl.SSLContext.post_handshake_auth` for the default *context* or when *cert_file* is passed with a custom *context*.
ru: Этот класс теперь включает TLS 1.3 :attr:`ssl.SSLContext.post_handshake_auth` для *контекста* по умолчанию или когда *cert_file* передается с пользовательским *контекстом*.

source: This class now sends an ALPN extension with protocol indicator ``http/1.1`` when no *context* is given. Custom *context* should set ALPN protocols with :meth:`~ssl.SSLContext.set_alpn_protocols`.
ru: Этот класс теперь отправляет расширение ALPN с индикатором протокола ``http/1.1``, когда *context* не указан. Пользовательский *context* должен устанавливать протоколы ALPN с помощью :meth:`~ssl.SSLContext.set_alpn_protocols`.

source: The deprecated *key_file*, *cert_file* and *check_hostname* parameters have been removed.
ru: Устаревшие параметры *key_file*, *cert_file* и *check_hostname* были удалены.

source: Class whose instances are returned upon successful connection. Not instantiated directly by user.
ru: Класс, экземпляры которого возвращаются при успешном подключении. Не создается экземпляром напрямую пользователем.

source: The *strict* parameter was removed. HTTP 0.9 style "Simple Responses" are no longer supported.
ru: Параметр *strict* был удален. HTTP 0.9 style "Simple Responses" больше не поддерживается.

source: This module provides the following function:
ru: Этот модуль обеспечивает следующую функцию:

source: Parse the headers from a file pointer *fp* representing a HTTP request/response. The file has to be a :class:`~io.BufferedIOBase` reader (i.e. not text) and must provide a valid :rfc:`2822` style header.
ru: Анализируйте заголовки по указателю файла *fp*, представляющему HTTP-запрос/ответ. Файл должен быть :class:`~io.BufferedIOBase` считывателем (т.е. не текстовым) и должен иметь действительный заголовок в стиле :rfc:`2822`.

source: This function returns an instance of :class:`http.client.HTTPMessage` that holds the header fields, but no payload (the same as :attr:`HTTPResponse.msg` and :attr:`http.server.BaseHTTPRequestHandler.headers`). After returning, the file pointer *fp* is ready to read the HTTP body.
ru: Эта функция возвращает экземпляр :class:`http.client.HTTPMessage`, который содержит поля заголовка, но не содержит полезных данных (так же, как :attr:`HTTPResponse.msg` и :attr:`http.server.BaseHTTPRequestHandler.headers` ). После возврата указатель файла *fp* готов прочитать тело HTTP.

source: :meth:`parse_headers` does not parse the start-line of a HTTP message; it only parses the ``Name: value`` lines. The file has to be ready to read these field lines, so the first line should already be consumed before calling the function.
ru: :meth:`parse_headers` не анализирует начальную строку HTTP-сообщения; он анализирует только строки ``Name: value``. Файл должен быть готов прочитать эти строки полей, поэтому первая строка должна быть использована еще до вызова функции.

source: The following exceptions are raised as appropriate:
ru: При необходимости возникают следующие исключения:

source: The base class of the other exceptions in this module. It is a subclass of :exc:`Exception`.
ru: Базовый класс других исключений в этом модуле. Это подкласс :exc:`Exception`.

source: A subclass of :exc:`HTTPException`.
ru: Подкласс :exc:`HTTPException`.

source: A subclass of :exc:`HTTPException`, raised if a port is given and is either non-numeric or empty.
ru: Подкласс :exc:`HTTPException`, вызываемый, если порт указан и является нечисловым или пустым.

source: A subclass of :exc:`ImproperConnectionState`.
ru: Подкласс :exc:`ImproperConnectionState`.

source: A subclass of :exc:`HTTPException`. Raised if a server responds with a HTTP status code that we don't understand.
ru: Подкласс :exc:`HTTPException`. Поднимается, если сервер отвечает кодом состояния HTTP, который мы не понимаем.

source: A subclass of :exc:`HTTPException`. Raised if an excessively long line is received in the HTTP protocol from the server.
ru: Подкласс :exc:`HTTPException`. Поднимается, если по протоколу HTTP от сервера получена слишком длинная строка.

source: A subclass of :exc:`ConnectionResetError` and :exc:`BadStatusLine`. Raised by :meth:`HTTPConnection.getresponse` when the attempt to read the response results in no data read from the connection, indicating that the remote end has closed the connection.
ru: Подкласс :exc:`ConnectionResetError` и :exc:`BadStatusLine`. Вызывается :meth:`HTTPConnection.getresponse`, когда попытка прочитать ответ не приводит к чтению данных из соединения, что указывает на то, что удаленный конец закрыл соединение.

source: Previously, :exc:`BadStatusLine`\ ``('')`` was raised.
ru: Ранее было поднято исключение :exc:`BadStatusLine`\ ``('')``.

source: The constants defined in this module are:
ru: В этом модуле определены следующие константы:

source: The default port for the HTTP protocol (always ``80``).
ru: Порт по умолчанию для протокола HTTP (всегда ``80``).

source: The default port for the HTTPS protocol (always ``443``).
ru: Порт по умолчанию для протокола HTTPS (всегда «443»).

source: This dictionary maps the HTTP 1.1 status codes to the W3C names.
ru: Этот словарь сопоставляет коды состояния HTTP 1.1 с именами W3C.

source: Example: ``http.client.responses[http.client.NOT_FOUND]`` is ``'Not Found'``.
ru: Пример: ``http.client.responses[http.client.NOT_FOUND]`` — ``'Не найден'``.

source: See :ref:`http-status-codes` for a list of HTTP status codes that are available in this module as constants.
ru: См. :ref:`http-status-codes` для получения списка кодов состояния HTTP, которые доступны в этом модуле как константы.

source: HTTPConnection Objects
ru: Объекты HTTPConnection

source: :class:`HTTPConnection` instances have the following methods:
ru: Экземпляры :class:`HTTPConnection` имеют следующие методы:

source: This will send a request to the server using the HTTP request method *method* and the request URI *url*. The provided *url* must be an absolute path to conform with :rfc:`RFC 2616 §5.1.2 <2616#section-5.1.2>` (unless connecting to an HTTP proxy server or using the ``OPTIONS`` or ``CONNECT`` methods).
ru: При этом на сервер будет отправлен запрос с использованием метода HTTP-запроса *method* и URI запроса *url*. Предоставленный *url* должен быть абсолютным путем, соответствующим :rfc:`RFC 2616 §5.1.2 <2616#section-5.1.2>` (кроме случаев подключения к прокси-серверу HTTP или использования ``OPTIONS`` или Методы ``CONNECT``).

source: If *body* is specified, the specified data is sent after the headers are finished. It may be a :class:`str`, a :term:`bytes-like object`, an open :term:`file object`, or an iterable of :class:`bytes`. If *body* is a string, it is encoded as ISO-8859-1, the default for HTTP. If it is a bytes-like object, the bytes are sent as is. If it is a :term:`file object`, the contents of the file is sent; this file object should support at least the ``read()`` method. If the file object is an instance of :class:`io.TextIOBase`, the data returned by the ``read()`` method will be encoded as ISO-8859-1, otherwise the data returned by ``read()`` is sent as is. If *body* is an iterable, the elements of the iterable are sent as is until the iterable is exhausted.
ru: Если указано *body*, указанные данные отправляются после завершения обработки заголовков. Это может быть :class:`str`, :term:`bytes-подобный объект`, открытый :term:`файловый объект` или итерируемый :class:`bytes`. Если *body* — это строка, она кодируется как ISO-8859-1, значение по умолчанию для HTTP. Если это байтовый объект, байты отправляются как есть. Если это :term:`файловый объект`, отправляется содержимое файла; этот файловый объект должен поддерживать как минимум метод read(). Если объект файла является экземпляром :class:`io.TextIOBase`, данные, возвращаемые методом ``read()``, будут закодированы как ISO-8859-1, в противном случае данные, возвращаемые ``read()`` `` отправляется как есть. Если *body* является итерируемым, элементы итерируемого объекта отправляются как есть до тех пор, пока итерируемый объект не будет исчерпан.

source: The *headers* argument should be a mapping of extra HTTP headers to send with the request. A :rfc:`Host header <2616#section-14.23>` must be provided to conform with :rfc:`RFC 2616 §5.1.2 <2616#section-5.1.2>` (unless connecting to an HTTP proxy server or using the ``OPTIONS`` or ``CONNECT`` methods).
ru: Аргумент *headers* должен представлять собой сопоставление дополнительных HTTP-заголовков для отправки с запросом. :rfc:`Заголовок хоста <2616#section-14.23>` должен быть предоставлен в соответствии с :rfc:`RFC 2616 §5.1.2 <2616#section-5.1.2>` (кроме случаев подключения к прокси-серверу HTTP или используя методы ``OPTIONS`` или ``CONNECT``).

source: If *headers* contains neither Content-Length nor Transfer-Encoding, but there is a request body, one of those header fields will be added automatically. If *body* is ``None``, the Content-Length header is set to ``0`` for methods that expect a body (``PUT``, ``POST``, and ``PATCH``). If *body* is a string or a bytes-like object that is not also a :term:`file <file object>`, the Content-Length header is set to its length. Any other type of *body* (files and iterables in general) will be chunk-encoded, and the Transfer-Encoding header will automatically be set instead of Content-Length.
ru: Если *headers* не содержит ни Content-Length, ни Transfer-Encoding, но есть тело запроса, одно из этих полей заголовка будет добавлено автоматически. Если *body* имеет значение None, заголовок Content-Length устанавливается в 0 для методов, ожидающих тело (PUT, POST и PATCH). . Если *body* представляет собой строку или байтовый объект, который не является также :term:`file <file object>`, заголовку Content-Length присваивается его длина. Любой другой тип *body* (файлы и итерации в целом) будет закодирован по частям, а заголовок Transfer-Encoding будет автоматически установлен вместо Content-Length.

source: The *encode_chunked* argument is only relevant if Transfer-Encoding is specified in *headers*. If *encode_chunked* is ``False``, the HTTPConnection object assumes that all encoding is handled by the calling code. If it is ``True``, the body will be chunk-encoded.
ru: Аргумент *encode_chunked* имеет значение только в том случае, если в *headers* указано Transfer-Encoding. Если *encode_chunked* имеет значение False, объект HTTPConnection предполагает, что все кодирование обрабатывается вызывающим кодом. Если это ``True``, тело будет закодировано чанками.

source: For example, to perform a ``GET`` request to ``https://docs.python.org/3/``::
ru: Например, чтобы выполнить запрос GET к https://docs.python.org/3/`:

source: Chunked transfer encoding has been added to the HTTP protocol version 1.1. Unless the HTTP server is known to handle HTTP 1.1, the caller must either specify the Content-Length, or must pass a :class:`str` or bytes-like object that is not also a file as the body representation.
ru: Кодирование передачи фрагментов было добавлено в протокол HTTP версии 1.1. Если не известно, что HTTP-сервер обрабатывает HTTP 1.1, вызывающая сторона должна либо указать Content-Length, либо передать :class:`str` или объект, подобный байтам, который не является также файлом в качестве представления тела.

source: *body* can now be an iterable.
ru: *body* теперь может быть итерируемым.

source: If neither Content-Length nor Transfer-Encoding are set in *headers*, file and iterable *body* objects are now chunk-encoded. The *encode_chunked* argument was added. No attempt is made to determine the Content-Length for file objects.
ru: Если ни Content-Length, ни Transfer-Encoding не заданы в *headers*, файлы и итерируемые объекты *body* теперь кодируются по частям. Был добавлен аргумент *encode_chunked*. Никаких попыток определить Content-Length для файловых объектов не предпринимается.

source: Should be called after a request is sent to get the response from the server. Returns an :class:`HTTPResponse` instance.
ru: Должен вызываться после отправки запроса для получения ответа от сервера. Возвращает экземпляр :class:`HTTPResponse`.

source: Note that you must have read the whole response before you can send a new request to the server.
ru: Обратите внимание: вы должны прочитать весь ответ, прежде чем сможете отправить новый запрос на сервер.

source: If a :exc:`ConnectionError` or subclass is raised, the :class:`HTTPConnection` object will be ready to reconnect when a new request is sent.
ru: Если возникает :exc:`ConnectionError` или подкласс, объект :class:`HTTPConnection` будет готов к повторному подключению при отправке нового запроса.

source: Set the debugging level. The default debug level is ``0``, meaning no debugging output is printed. Any value greater than ``0`` will cause all currently defined debug output to be printed to stdout. The ``debuglevel`` is passed to any new :class:`HTTPResponse` objects that are created.
ru: Установите уровень отладки. Уровень отладки по умолчанию — «0», что означает, что выходные данные отладки не выводятся. Любое значение больше ``0`` приведет к тому, что все определенные в данный момент выходные данные отладки будут выведены на стандартный вывод. Уровень отладки передается всем новым создаваемым объектам :class:`HTTPResponse`.

source: Set the host and the port for HTTP Connect Tunnelling. This allows running the connection through a proxy server.
ru: Установите хост и порт для туннелирования HTTP Connect. Это позволяет запустить соединение через прокси-сервер.

source: The *host* and *port* arguments specify the endpoint of the tunneled connection (i.e. the address included in the CONNECT request, *not* the address of the proxy server).
ru: Аргументы *host* и *port* указывают конечную точку туннелированного соединения (т.е. адрес, включенный в запрос CONNECT, *а не* адрес прокси-сервера).

source: The *headers* argument should be a mapping of extra HTTP headers to send with the CONNECT request.
ru: Аргумент *headers* должен представлять собой сопоставление дополнительных HTTP-заголовков для отправки с запросом CONNECT.

source: As HTTP/1.1 is used for HTTP CONNECT tunnelling request, `as per the RFC <https://datatracker.ietf.org/doc/html/rfc7231#section-4.3.6>`_, a HTTP ``Host:`` header must be provided, matching the authority-form of the request target provided as the destination for the CONNECT request. If a HTTP ``Host:`` header is not provided via the headers argument, one is generated and transmitted automatically.
ru: Поскольку HTTP/1.1 используется для запроса туннелирования HTTP CONNECT, ``согласно RFC <https://datatracker.ietf.org/doc/html/rfc7231#section-4.3.6>`_, HTTP ``Host:` ` Должен быть указан заголовок, соответствующий форме полномочий цели запроса, указанной в качестве места назначения для запроса CONNECT. Если заголовок HTTP ``Host:`` не указан через аргумент headers, он генерируется и передается автоматически.

source: For example, to tunnel through a HTTPS proxy server running locally on port 8080, we would pass the address of the proxy to the :class:`HTTPSConnection` constructor, and the address of the host that we eventually want to reach to the :meth:`~HTTPConnection.set_tunnel` method::
ru: Например, чтобы туннелировать через прокси-сервер HTTPS, работающий локально на порту 8080, мы должны передать адрес прокси-сервера конструктору :class:`HTTPSConnection`, а адрес хоста, к которому мы в конечном итоге хотим достичь :meth. :`~HTTPConnection.set_tunnel` метод::

source: HTTP CONNECT tunnelling requests use protocol HTTP/1.1, upgraded from protocol HTTP/1.0. ``Host:`` HTTP headers are mandatory for HTTP/1.1, so one will be automatically generated and transmitted if not provided in the headers argument.
ru: Запросы туннелирования HTTP CONNECT используют протокол HTTP/1.1, обновленный с протокола HTTP/1.0. ``Host:`` HTTP-заголовки являются обязательными для HTTP/1.1, поэтому они будут автоматически сгенерированы и переданы, если они не указаны в аргументе заголовков.

source: Returns a dictionary with the headers of the response received from the proxy server to the CONNECT request.
ru: Возвращает словарь с заголовками ответа, полученного от прокси-сервера на запрос CONNECT.

source: If the CONNECT request was not sent, the method returns ``None``.
ru: Если запрос CONNECT не был отправлен, метод возвращает None.

source: Connect to the server specified when the object was created. By default, this is called automatically when making a request if the client does not already have a connection.
ru: Подключиться к серверу, указанному при создании объекта. По умолчанию это вызывается автоматически при выполнении запроса, если у клиента еще нет подключения.

source: Raises an :ref:`auditing event <auditing>` ``http.client.connect`` with arguments ``self``, ``host``, ``port``.
ru: Вызывает :ref:`событие аудита <auditing>` ``http.client.connect`` с аргументами ``self``, ``host``, ``port``.

source: Close the connection to the server.
ru: Закройте соединение с сервером.

source: Buffer size in bytes for sending a file-like message body.
ru: Размер буфера в байтах для отправки тела сообщения в виде файла.

source: As an alternative to using the :meth:`~HTTPConnection.request` method described above, you can also send your request step by step, by using the four functions below.
ru: В качестве альтернативы использованию метода :meth:`~HTTPConnection.request`, описанного выше, вы также можете отправить свой запрос шаг за шагом, используя четыре функции ниже.

source: This should be the first call after the connection to the server has been made. It sends a line to the server consisting of the *method* string, the *url* string, and the HTTP version (``HTTP/1.1``). To disable automatic sending of ``Host:`` or ``Accept-Encoding:`` headers (for example to accept additional content encodings), specify *skip_host* or *skip_accept_encoding* with non-False values.
ru: Это должен быть первый вызов после установления соединения с сервером. Он отправляет на сервер строку, состоящую из строки *method*, строки *url* и ​​версии HTTP (``HTTP/1.1``). Чтобы отключить автоматическую отправку заголовков ``Host:`` или ``Accept-Encoding:`` (например, чтобы принять дополнительные кодировки контента), укажите *skip_host* или *skip_accept_encoding* со значениями, отличными от False.
