Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/http.client.po
Languages: ru

source: Send an :rfc:`822`\ -style header to the server. It sends a line to the server consisting of the header, a colon and a space, and the first argument. If more arguments are given, continuation lines are sent, each consisting of a tab and an argument.
ru: Отправьте на сервер заголовок в стиле :rfc:`822`\. Он отправляет на сервер строку, состоящую из заголовка, двоеточия, пробела и первого аргумента. Если задано больше аргументов, отправляются строки продолжения, каждая из которых состоит из табуляции и аргумента.

source: Send a blank line to the server, signalling the end of the headers. The optional *message_body* argument can be used to pass a message body associated with the request.
ru: Отправьте пустую строку на сервер, сигнализируя об окончании заголовков. Необязательный аргумент *message_body* может использоваться для передачи тела сообщения, связанного с запросом.

source: If *encode_chunked* is ``True``, the result of each iteration of *message_body* will be chunk-encoded as specified in :rfc:`7230`, Section 3.3.1. How the data is encoded is dependent on the type of *message_body*. If *message_body* implements the :ref:`buffer interface <bufferobjects>` the encoding will result in a single chunk. If *message_body* is a :class:`collections.abc.Iterable`, each iteration of *message_body* will result in a chunk. If *message_body* is a :term:`file object`, each call to ``.read()`` will result in a chunk. The method automatically signals the end of the chunk-encoded data immediately after *message_body*.
ru: Если *encode_chunked* имеет значение True, результат каждой итерации *message_body* будет закодирован по частям, как указано в :rfc:`7230`, раздел 3.3.1. Способ кодирования данных зависит от типа *message_body*. Если *message_body* реализует :ref:`buffer интерфейс <bufferobjects>`, кодирование приведет к созданию одного фрагмента. Если *message_body* представляет собой :class:`collections.abc.Iterable`, каждая итерация *message_body* приведет к созданию фрагмента. Если *message_body* является файловым объектом, каждый вызов ``.read()`` приведет к созданию фрагмента. Этот метод автоматически сигнализирует об окончании данных, закодированных чанками, сразу после *message_body*.

source: Due to the chunked encoding specification, empty chunks yielded by an iterator body will be ignored by the chunk-encoder. This is to avoid premature termination of the read of the request by the target server due to malformed encoding.
ru: Из-за спецификации кодирования chunked пустые куски, выдаваемые телом итератора, будут игнорироваться chunk-encoder. Это делается для того, чтобы избежать преждевременного завершения чтения запроса целевым сервером из-за неправильно сформированного кодирования.

source: Added chunked encoding support and the *encode_chunked* parameter.
ru: Добавлена ​​поддержка фрагментированного кодирования и параметр *encode_chunked*.

source: Send data to the server. This should be used directly only after the :meth:`endheaders` method has been called and before :meth:`getresponse` is called.
ru: Отправьте данные на сервер. Его следует использовать непосредственно только после вызова метода :meth:`endheaders` и до вызова :meth:`getresponse`.

source: Raises an :ref:`auditing event <auditing>` ``http.client.send`` with arguments ``self``, ``data``.
ru: Вызывает :ref:`событие аудита <auditing>` ``http.client.send`` с аргументами ``self``, ``data``.

source: HTTPResponse Objects
ru: Объекты HTTPResponse

source: An :class:`HTTPResponse` instance wraps the HTTP response from the server. It provides access to the request headers and the entity body. The response is an iterable object and can be used in a with statement.
ru: Экземпляр :class:`HTTPResponse` оборачивает HTTP-ответ от сервера. Он обеспечивает доступ к заголовкам запроса и телу объекта. Ответ представляет собой итерируемый объект и может использоваться в операторе with.

source: The :class:`io.BufferedIOBase` interface is now implemented and all of its reader operations are supported.
ru: Интерфейс :class:`io.BufferedIOBase` теперь реализован и поддерживаются все его операции чтения.

source: Reads and returns the response body, or up to the next *amt* bytes.
ru: Считывает и возвращает тело ответа или до следующих *amt* байтов.

source: Reads up to the next len(b) bytes of the response body into the buffer *b*. Returns the number of bytes read.
ru: Считывает до следующих len(b) байт тела ответа в буфер *b*. Возвращает количество прочитанных байт.

source: Return the value of the header *name*, or *default* if there is no header matching *name*. If there is more than one header with the name *name*, return all of the values joined by ', '. If *default* is any iterable other than a single string, its elements are similarly returned joined by commas.
ru: Возвращает значение заголовка *name* или *default*, если заголовок, соответствующий *name*, отсутствует. Если существует более одного заголовка с именем *name*, верните все значения, соединенные символами ', '. Если *default* — это любая итерация, отличная от одной строки, ее элементы возвращаются аналогичным образом, соединенные запятыми.

source: Return a list of (header, value) tuples.
ru: Возвращает список кортежей (заголовок, значение).

source: Return the ``fileno`` of the underlying socket.
ru: Вернуть ``fileno`` базового сокета.

source: A :class:`http.client.HTTPMessage` instance containing the response headers. :class:`http.client.HTTPMessage` is a subclass of :class:`email.message.Message`.
ru: Экземпляр :class:`http.client.HTTPMessage`, содержащий заголовки ответов. :class:`http.client.HTTPMessage` является подклассом :class:`email.message.Message`.

source: HTTP protocol version used by server. 10 for HTTP/1.0, 11 for HTTP/1.1.
ru: Версия протокола HTTP, используемая сервером. 10 для HTTP/1.0, 11 для HTTP/1.1.

source: URL of the resource retrieved, commonly used to determine if a redirect was followed.
ru: URL-адрес полученного ресурса, обычно используемый для определения того, было ли выполнено перенаправление.

source: Headers of the response in the form of an :class:`email.message.EmailMessage` instance.
ru: Заголовки ответа в виде экземпляра :class:`email.message.EmailMessage`.

source: Status code returned by server.
ru: Код состояния, возвращенный сервером.

source: Reason phrase returned by server.
ru: Причинная фраза, возвращенная сервером.

source: A debugging hook. If :attr:`debuglevel` is greater than zero, messages will be printed to stdout as the response is read and parsed.
ru: Отладочный крючок. Если :attr:`debuglevel` больше нуля, сообщения будут выводиться на стандартный вывод по мере чтения и анализа ответа.

source: Is ``True`` if the stream is closed.
ru: Имеет значение True, если поток закрыт.

source: Deprecated in favor of :attr:`~HTTPResponse.url`.
ru: Отклонено в пользу :attr:`~HttpResponse.url`.

source: Deprecated in favor of :attr:`~HTTPResponse.headers`.
ru: Устарело в пользу :attr:`~HTTPResponse.headers`

source: Deprecated in favor of :attr:`~HTTPResponse.status`.
ru: Устарело в пользу :attr:`~HTTPResponse.status`.

source: Examples
ru: Примеры

source: Here is an example session that uses the ``GET`` method::
ru: Вот пример сеанса, в котором используется метод GET::

source: Here is an example session that uses the ``HEAD`` method. Note that the ``HEAD`` method never returns any data. ::
ru: Вот пример сеанса, в котором используется метод HEAD. Обратите внимание, что метод HEAD никогда не возвращает никаких данных. ::

source: Here is an example session that uses the ``POST`` method::
ru: Вот пример сеанса, в котором используется метод POST:

source: Client side HTTP ``PUT`` requests are very similar to ``POST`` requests. The difference lies only on the server side where HTTP servers will allow resources to be created via ``PUT`` requests. It should be noted that custom HTTP methods are also handled in :class:`urllib.request.Request` by setting the appropriate method attribute. Here is an example session that uses the ``PUT`` method::
ru: Клиентские HTTP-запросы PUT очень похожи на запросы POST. Разница заключается только на стороне сервера, где HTTP-серверы позволяют создавать ресурсы с помощью запросов PUT. Следует отметить, что пользовательские методы HTTP также обрабатываются в :class:`urllib.request.Request` путем установки соответствующего атрибута метода. Вот пример сеанса, в котором используется метод PUT::

source: HTTPMessage Objects
ru: Объекты HTTPMessage

source: An :class:`http.client.HTTPMessage` instance holds the headers from an HTTP response. It is implemented using the :class:`email.message.Message` class.
ru: Экземпляр :class:`http.client.HTTPMessage` содержит заголовки HTTP-ответа. Это реализовано с помощью класса :class:`email.message.Message`.

source: protocol
ru: протокол

source: http.client (standard module)
ru: http.client (стандартный модуль)

source: module
ru: модуль
