Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/http.cookiejar.po
Languages: ru

source: See the documentation for :meth:`domain_return_ok`.
ru: См. документацию по :meth:`domain_return_ok`.

source: In addition to implementing the methods above, implementations of the :class:`CookiePolicy` interface must also supply the following attributes, indicating which protocols should be used, and how. All of these attributes may be assigned to.
ru: В дополнение к реализации вышеперечисленных методов реализации интерфейса :class:`CookiePolicy` также должны предоставлять следующие атрибуты, указывающие, какие протоколы следует использовать и как. Все эти атрибуты могут быть назначены.

source: Implement Netscape protocol.
ru: Реализует протокол Netscape.

source: Implement :rfc:`2965` protocol.
ru: Внедрите протокол :rfc:`2965`.

source: Don't add :mailheader:`Cookie2` header to requests (the presence of this header indicates to the server that we understand :rfc:`2965` cookies).
ru: Не добавляйте заголовок :mailheader:`Cookie2` к запросам (наличие этого заголовка указывает серверу, что мы понимаем :rfc:`2965` файлы cookie).

source: The most useful way to define a :class:`CookiePolicy` class is by subclassing from :class:`DefaultCookiePolicy` and overriding some or all of the methods above. :class:`CookiePolicy` itself may be used as a 'null policy' to allow setting and receiving any and all cookies (this is unlikely to be useful).
ru: Самый полезный способ определить класс :class:`CookiePolicy` — это создать подкласс от :class:`DefaultCookiePolicy` и переопределить некоторые или все вышеперечисленные методы. :class:`CookiePolicy` сама по себе может использоваться как «нулевая политика», позволяющая устанавливать и получать любые файлы cookie (это вряд ли будет полезно).

source: DefaultCookiePolicy Objects
ru: Объекты DefaultCookiePolicy

source: Implements the standard rules for accepting and returning cookies.
ru: Реализует стандартные правила приема и возврата файлов cookie.

source: Both :rfc:`2965` and Netscape cookies are covered. RFC 2965 handling is switched off by default.
ru: Охватываются как файлы cookie :rfc:`2965`, так и файлы cookie Netscape. По умолчанию обработка RFC 2965 отключена.

source: The easiest way to provide your own policy is to override this class and call its methods in your overridden implementations before adding your own additional checks::
ru: Самый простой способ предоставить собственную политику — переопределить этот класс и вызывать его методы в переопределенных реализациях перед добавлением собственных дополнительных проверок:

source: In addition to the features required to implement the :class:`CookiePolicy` interface, this class allows you to block and allow domains from setting and receiving cookies. There are also some strictness switches that allow you to tighten up the rather loose Netscape protocol rules a little bit (at the cost of blocking some benign cookies).
ru: В дополнение к функциям, необходимым для реализации интерфейса :class:`CookiePolicy`, этот класс позволяет блокировать и разрешать доменам устанавливать и получать файлы cookie. Есть также некоторые переключатели строгости, которые позволяют вам немного ужесточить довольно мягкие правила протокола Netscape (за счет блокировки некоторых неопасных файлов cookie).

source: :class:`DefaultCookiePolicy` implements the following additional methods:
ru: :class:`DefaultCookiePolicy` реализует следующие дополнительные методы:

source: Return the sequence of blocked domains (as a tuple).
ru: Вернуть последовательность заблокированных доменов (в виде кортежа).

source: Set the sequence of blocked domains.
ru: Установите последовательность заблокированных доменов.

source: Return :const:`None`, or the sequence of allowed domains (as a tuple).
ru: Верните :const:`None` или последовательность разрешенных доменов (в виде кортежа).

source: Set the sequence of allowed domains, or :const:`None`.
ru: Установите последовательность разрешенных доменов или :const:`None`.

source: :class:`DefaultCookiePolicy` instances have the following attributes, which are all initialised from the constructor arguments of the same name, and which may all be assigned to.
ru: Экземпляры :class:`DefaultCookiePolicy` имеют следующие атрибуты, которые инициализируются из одноименных аргументов конструктора и которым все могут быть присвоены.

source: If true, request that the :class:`CookieJar` instance downgrade :rfc:`2109` cookies (ie. cookies received in a :mailheader:`Set-Cookie` header with a version cookie-attribute of 1) to Netscape cookies by setting the version attribute of the :class:`Cookie` instance to 0. The default value is :const:`None`, in which case RFC 2109 cookies are downgraded if and only if :rfc:`2965` handling is turned off. Therefore, RFC 2109 cookies are downgraded by default.
ru: Если это правда, запросите, чтобы экземпляр :class:`CookieJar` понизил версию файлов cookie :rfc:`2109` (т. е. файлов cookie, полученных в заголовке :mailheader:`Set-Cookie` с атрибутом версии cookie-файла, равным 1) до файлов cookie Netscape. установка атрибута версии экземпляра :class:`Cookie` равным 0. Значением по умолчанию является :const:`None`, и в этом случае файлы cookie RFC 2109 понижаются тогда и только тогда, когда обработка :rfc:`2965` отключена. Поэтому файлы cookie RFC 2109 по умолчанию понижаются.

source: General strictness switches:
ru: Переключатели общей строгости:

source: Don't allow sites to set two-component domains with country-code top-level domains like ``.co.uk``, ``.gov.uk``, ``.co.nz``.etc. This is far from perfect and isn't guaranteed to work!
ru: Не разрешайте сайтам устанавливать двухкомпонентные домены с доменами верхнего уровня с кодом страны, такими как ``.co.uk``, ``.gov.uk``, ``.co.nz``.и т. д. Это далеко от совершенства и не гарантируется, что будет работать!

source: :rfc:`2965` protocol strictness switches:
ru: :rfc:`2965` переключатели строгости протокола:

source: Follow :rfc:`2965` rules on unverifiable transactions (usually, an unverifiable transaction is one resulting from a redirect or a request for an image hosted on another site). If this is false, cookies are *never* blocked on the basis of verifiability
ru: Следуйте правилам :rfc:`2965` для непроверяемых транзакций (обычно непроверяемая транзакция является результатом перенаправления или запроса изображения, размещенного на другом сайте). Если это неверно, файлы cookie *никогда* не блокируются на основании возможности проверки.

source: Netscape protocol strictness switches:
ru: Переключатели строгости протокола Netscape:

source: Apply :rfc:`2965` rules on unverifiable transactions even to Netscape cookies.
ru: Применяйте правила :rfc:`2965` для непроверяемых транзакций даже к файлам cookie Netscape.

source: Flags indicating how strict to be with domain-matching rules for Netscape cookies. See below for acceptable values.
ru: Флаги, указывающие, насколько строгими должны быть правила сопоставления доменов для файлов cookie Netscape. Ниже приведены приемлемые значения.

source: Ignore cookies in Set-Cookie: headers that have names starting with ``'$'``.
ru: Игнорируйте файлы cookie в Set-Cookie: заголовки, имена которых начинаются с ``'$'``.

source: Don't allow setting cookies whose path doesn't path-match request URI.
ru: Запретить установку файлов cookie, путь которых не соответствует URI запроса.

source: :attr:`strict_ns_domain` is a collection of flags. Its value is constructed by or-ing together (for example, ``DomainStrictNoDots|DomainStrictNonDomain`` means both flags are set).
ru: :attr:`strict_ns_domain` — это набор флагов. Его значение создается путем объединения или (например, ``DomainStrictNoDots|DomainStrictNonDomain`` означает, что установлены оба флага).

source: When setting cookies, the 'host prefix' must not contain a dot (eg. ``www.foo.bar.com`` can't set a cookie for ``.bar.com``, because ``www.foo`` contains a dot).
ru: При настройке файлов cookie «префикс хоста» не должен содержать точку (например, www.foo.bar.com не может установить файл cookie для .bar.com, поскольку www.foo `` содержит точку).

source: Cookies that did not explicitly specify a ``domain`` cookie-attribute can only be returned to a domain equal to the domain that set the cookie (eg. ``spam.example.com`` won't be returned cookies from ``example.com`` that had no ``domain`` cookie-attribute).
ru: Файлы cookie, в которых явно не указан атрибут cookie «domain», могут быть возвращены только в домен, равный домену, который установил файл cookie (например, «spam.example.com» не будет возвращать файлы cookie из ``spam.example.com``. `example.com``, у которого не было атрибута cookie ``domain``).

source: When setting cookies, require a full :rfc:`2965` domain-match.
ru: При настройке файлов cookie требуется полное соответствие домена :rfc:`2965`.

source: The following attributes are provided for convenience, and are the most useful combinations of the above flags:
ru: Следующие атрибуты предоставлены для удобства и представляют собой наиболее полезные комбинации вышеуказанных флагов:

source: Equivalent to 0 (ie. all of the above Netscape domain strictness flags switched off).
ru: Эквивалентно 0 (т.е. все указанные выше флаги строгости домена Netscape отключены).

source: Equivalent to ``DomainStrictNoDots|DomainStrictNonDomain``.
ru: Эквивалент ``DomainStrictNoDots|DomainStrictNonDomain``.

source: Cookie Objects
ru: Объекты cookie-файлов

source: :class:`Cookie` instances have Python attributes roughly corresponding to the standard cookie-attributes specified in the various cookie standards. The correspondence is not one-to-one, because there are complicated rules for assigning default values, because the ``max-age`` and ``expires`` cookie-attributes contain equivalent information, and because :rfc:`2109` cookies may be 'downgraded' by :mod:`http.cookiejar` from version 1 to version 0 (Netscape) cookies.
ru: Экземпляры :class:`Cookie` имеют атрибуты Python, примерно соответствующие стандартным атрибутам cookie, указанным в различных стандартах cookie. Соответствие не является однозначно однозначным, поскольку существуют сложные правила назначения значений по умолчанию, поскольку атрибуты cookie ``max-age`` и ``expires`` содержат эквивалентную информацию, а также потому, что :rfc:`2109` файлы cookie могут быть понижены с помощью :mod:`http.cookiejar` с версии 1 до версии 0 (Netscape).

source: Assignment to these attributes should not be necessary other than in rare circumstances in a :class:`CookiePolicy` method. The class does not enforce internal consistency, so you should know what you're doing if you do that.
ru: Присвоение этим атрибутам не требуется, за исключением редких случаев, в методе :class:`CookiePolicy`. Класс не обеспечивает внутреннюю согласованность, поэтому вы должны знать, что делаете, если делаете это.

source: Integer or :const:`None`. Netscape cookies have :attr:`version` 0. :rfc:`2965` and :rfc:`2109` cookies have a ``version`` cookie-attribute of 1. However, note that :mod:`http.cookiejar` may 'downgrade' RFC 2109 cookies to Netscape cookies, in which case :attr:`version` is 0.
ru: Целое число или :const:`Нет`. Файлы cookie Netscape имеют :attr:`version` 0. Файлы cookie :rfc:`2965` и :rfc:`2109` имеют атрибут cookie ``version``, равный 1. Однако обратите внимание, что :mod:`http.cookiejar` может «понижать» файлы cookie RFC 2109 до файлов cookie Netscape, и в этом случае :attr:`version` равен 0.

source: Cookie name (a string).
ru: Имя cookie (строка).

source: Cookie value (a string), or :const:`None`.
ru: Значение cookie (строка) или :const:`None`.

source: String representing a port or a set of ports (eg. '80', or '80,8080'), or :const:`None`.
ru: Строка, представляющая порт или набор портов (например, «80» или «80,8080») или :const:`None`.

source: Cookie path (a string, eg. ``'/acme/rocket_launchers'``).
ru: Путь к файлу cookie (строка, например ``'/acme/rocket_launchers'``).

source: ``True`` if cookie should only be returned over a secure connection.
ru: ``True``, если файлы cookie должны возвращаться только через безопасное соединение.

source: Integer expiry date in seconds since epoch, or :const:`None`. See also the :meth:`is_expired` method.
ru: Целочисленная дата истечения срока действия в секундах с начала эпохи или :const:`None`. См. также метод :meth:`is_expired`.

source: ``True`` if this is a session cookie.
ru: ``True``, если это файл cookie сеанса.

source: String comment from the server explaining the function of this cookie, or :const:`None`.
ru: Строковый комментарий с сервера, объясняющий функцию этого файла cookie, или :const:`None`.

source: URL linking to a comment from the server explaining the function of this cookie, or :const:`None`.
ru: URL-адрес, ссылающийся на комментарий с сервера, объясняющий функцию этого файла cookie, или :const:`None`.

source: ``True`` if this cookie was received as an :rfc:`2109` cookie (ie. the cookie arrived in a :mailheader:`Set-Cookie` header, and the value of the Version cookie-attribute in that header was 1). This attribute is provided because :mod:`http.cookiejar` may 'downgrade' RFC 2109 cookies to Netscape cookies, in which case :attr:`version` is 0.
ru: ``True``, если этот файл cookie был получен как файл cookie :rfc:`2109` (т. е. файл cookie прибыл в заголовок :mailheader:`Set-Cookie`, и значение атрибута cookie версии в этом заголовке было 1). Этот атрибут предусмотрен потому, что :mod:`http.cookiejar` может «понижать» файлы cookie RFC 2109 до файлов cookie Netscape, и в этом случае :attr:`version` равен 0.

source: ``True`` if a port or set of ports was explicitly specified by the server (in the :mailheader:`Set-Cookie` / :mailheader:`Set-Cookie2` header).
ru: ``True``, если порт или набор портов были явно указаны сервером (в заголовке :mailheader:`Set-Cookie` / :mailheader:`Set-Cookie2`).

source: ``True`` if a domain was explicitly specified by the server.
ru: ``True``, если домен был явно указан сервером.

source: ``True`` if the domain explicitly specified by the server began with a dot (``'.'``).
ru: ``True``, если домен, явно указанный сервером, начинается с точки (``'.'``).

source: Cookies may have additional non-standard cookie-attributes. These may be accessed using the following methods:
ru: Файлы cookie могут иметь дополнительные нестандартные атрибуты cookie. Доступ к ним можно получить с помощью следующих методов:

source: Return ``True`` if cookie has the named cookie-attribute.
ru: Верните True, если файл cookie имеет указанный атрибут cookie.

source: If cookie has the named cookie-attribute, return its value. Otherwise, return *default*.
ru: Если cookie имеет именованный cookie-атрибут, вернуть его значение. В противном случае вернуть *default*.

source: Set the value of the named cookie-attribute.
ru: Установите значение именованного атрибута cookie.

source: The :class:`Cookie` class also defines the following method:
ru: Класс :class:`Cookie` также определяет следующий метод:

source: ``True`` if cookie has passed the time at which the server requested it should expire. If *now* is given (in seconds since the epoch), return whether the cookie has expired at the specified time.
ru: ``True``, если срок действия файла cookie истек, когда его запросил сервер. Если задано *now* (в секундах с начала эпохи), возвращает информацию о том, истек ли срок действия файла cookie в указанное время.

source: Examples
ru: Примеры

source: The first example shows the most common usage of :mod:`http.cookiejar`::
ru: В первом примере показано наиболее распространенное использование :mod:`http.cookiejar`::

source: This example illustrates how to open a URL using your Netscape, Mozilla, or Lynx cookies (assumes Unix/Netscape convention for location of the cookies file)::
ru: В этом примере показано, как открыть URL-адрес с помощью файлов cookie Netscape, Mozilla или Lynx (предполагается, что для расположения файла cookie используются соглашения Unix/Netscape):

source: The next example illustrates the use of :class:`DefaultCookiePolicy`. Turn on :rfc:`2965` cookies, be more strict about domains when setting and returning Netscape cookies, and block some domains from setting cookies or having them returned::
ru: Следующий пример иллюстрирует использование :class:`DefaultCookiePolicy`. Включите файлы cookie :rfc:`2965`, будьте более строгими в отношении доменов при установке и возврате файлов cookie Netscape и заблокируйте для некоторых доменов установку файлов cookie или их возврат:
