Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/http.cookiejar.po
Languages: ru

source: **Source code:** :source:`Lib/http/cookiejar.py`
ru: **Исходный код:** :source:`Lib/http/cookiejar.py`

source: The :mod:`http.cookiejar` module defines classes for automatic handling of HTTP cookies. It is useful for accessing web sites that require small pieces of data -- :dfn:`cookies` -- to be set on the client machine by an HTTP response from a web server, and then returned to the server in later HTTP requests.
ru: Модуль :mod:`http.cookiejar` определяет классы для автоматической обработки файлов cookie HTTP. Это полезно для доступа к веб-сайтам, для которых требуются небольшие фрагменты данных — :dfn:`cookies` — которые должны быть установлены на клиентском компьютере посредством ответа HTTP от веб-сервера, а затем возвращены на сервер в последующих HTTP-запросах.

source: The various named parameters found in :mailheader:`Set-Cookie` and :mailheader:`Set-Cookie2` headers (eg. ``domain`` and ``expires``) are conventionally referred to as :dfn:`attributes`. To distinguish them from Python attributes, the documentation for this module uses the term :dfn:`cookie-attribute` instead.
ru: Различные именованные параметры, находящиеся в заголовках :mailheader:`Set-Cookie` и :mailheader:`Set-Cookie2` (например, ``domain`` и ``expires``), обычно называются :dfn:`attributes` . Чтобы отличить их от атрибутов Python, в документации к этому модулю вместо этого используется термин :dfn:`cookie-attribute`.

source: The module defines the following exception:
ru: Модуль определяет следующее исключение:

source: Instances of :class:`FileCookieJar` raise this exception on failure to load cookies from a file. :exc:`LoadError` is a subclass of :exc:`OSError`.
ru: Экземпляры :class:`FileCookieJar` вызывают это исключение при невозможности загрузки файлов cookie из файла. :exc:`LoadError` является подклассом :exc:`OSError`.

source: The following classes are provided:
ru: Предусмотрены следующие занятия:

source: *policy* is an object implementing the :class:`CookiePolicy` interface.
ru: *policy* — это объект, реализующий интерфейс :class:`CookiePolicy`.

source: The :class:`CookieJar` class stores HTTP cookies. It extracts cookies from HTTP requests, and returns them in HTTP responses. :class:`CookieJar` instances automatically expire contained cookies when necessary. Subclasses are also responsible for storing and retrieving cookies from a file or database.
ru: Класс :class:`CookieJar` хранит файлы cookie HTTP. Он извлекает файлы cookie из HTTP-запросов и возвращает их в HTTP-ответах. При необходимости экземпляры :class:`CookieJar` автоматически удаляют файлы cookie, содержащиеся в них. Подклассы также отвечают за хранение и получение файлов cookie из файла или базы данных.

source: *policy* is an object implementing the :class:`CookiePolicy` interface. For the other arguments, see the documentation for the corresponding attributes.
ru: *policy* — это объект, реализующий интерфейс :class:`CookiePolicy`. Другие аргументы см. в документации по соответствующим атрибутам.

source: A :class:`CookieJar` which can load cookies from, and perhaps save cookies to, a file on disk. Cookies are **NOT** loaded from the named file until either the :meth:`load` or :meth:`revert` method is called. Subclasses of this class are documented in section :ref:`file-cookie-jar-classes`.
ru: :class:`CookieJar`, который может загружать файлы cookie из файла на диске и, возможно, сохранять файлы cookie в нем. Файлы cookie **НЕ** загружаются из именованного файла до тех пор, пока не будет вызван метод :meth:`load` или :meth:`revert`. Подклассы этого класса описаны в разделе :ref:`file-cookie-jar-classes`.

source: The filename parameter supports a :term:`path-like object`.
ru: Параметр имени файла поддерживает объект, подобный пути.

source: This class is responsible for deciding whether each cookie should be accepted from / returned to the server.
ru: Этот класс отвечает за принятие решения о том, следует ли принимать или возвращать каждый файл cookie с сервера.

source: Constructor arguments should be passed as keyword arguments only. *blocked_domains* is a sequence of domain names that we never accept cookies from, nor return cookies to. *allowed_domains* if not :const:`None`, this is a sequence of the only domains for which we accept and return cookies. *secure_protocols* is a sequence of protocols for which secure cookies can be added to. By default *https* and *wss* (secure websocket) are considered secure protocols. For all other arguments, see the documentation for :class:`CookiePolicy` and :class:`DefaultCookiePolicy` objects.
ru: Аргументы конструктора следует передавать только как аргументы ключевого слова. *blocked_domains* — это последовательность доменных имен, от которых мы никогда не принимаем файлы cookie и не возвращаем их. *allowed_domains*, если не :const:`None`, это последовательность единственных доменов, для которых мы принимаем и возвращаем файлы cookie. *secure_protocols* — это последовательность протоколов, к которым можно добавить безопасные файлы cookie. По умолчанию *https* и *wss* (безопасный веб-сокет) считаются безопасными протоколами. Все остальные аргументы см. в документации для объектов :class:`CookiePolicy` и :class:`DefaultCookiePolicy`.

source: :class:`DefaultCookiePolicy` implements the standard accept / reject rules for Netscape and :rfc:`2965` cookies. By default, :rfc:`2109` cookies (ie. cookies received in a :mailheader:`Set-Cookie` header with a version cookie-attribute of 1) are treated according to the RFC 2965 rules. However, if RFC 2965 handling is turned off or :attr:`rfc2109_as_netscape` is ``True``, RFC 2109 cookies are 'downgraded' by the :class:`CookieJar` instance to Netscape cookies, by setting the :attr:`version` attribute of the :class:`Cookie` instance to 0. :class:`DefaultCookiePolicy` also provides some parameters to allow some fine-tuning of policy.
ru: :class:`DefaultCookiePolicy` реализует стандартные правила принятия/отклонения для файлов cookie Netscape и :rfc:`2965`. По умолчанию файлы cookie :rfc:`2109` (т. е. файлы cookie, полученные в заголовке :mailheader:`Set-Cookie` с атрибутом версии cookie, равным 1), обрабатываются в соответствии с правилами RFC 2965. Однако, если обработка RFC 2965 отключена или :attr:`rfc2109_as_netscape` имеет значение ``True``, файлы cookie RFC 2109 «понижаются» экземпляром :class:`CookieJar` до файлов cookie Netscape, путем установки :attr:` version` экземпляра :class:`Cookie` равным 0. :class:`DefaultCookiePolicy` также предоставляет некоторые параметры, позволяющие выполнить тонкую настройку политики.

source: This class represents Netscape, :rfc:`2109` and :rfc:`2965` cookies. It is not expected that users of :mod:`http.cookiejar` construct their own :class:`Cookie` instances. Instead, if necessary, call :meth:`make_cookies` on a :class:`CookieJar` instance.
ru: Этот класс представляет файлы cookie Netscape, :rfc:`2109` и :rfc:`2965`. Не ожидается, что пользователи :mod:`http.cookiejar` создадут свои собственные экземпляры :class:`Cookie`. Вместо этого, если необходимо, вызовите :meth:`make_cookies` в экземпляре :class:`CookieJar`.

source: Module :mod:`urllib.request`
ru: Модуль :mod:`urllib.request`

source: URL opening with automatic cookie handling.
ru: Открытие URL-адреса с автоматической обработкой файлов cookie.

source: Module :mod:`http.cookies`
ru: Модуль :mod:`http.cookies`

source: HTTP cookie classes, principally useful for server-side code. The :mod:`http.cookiejar` and :mod:`http.cookies` modules do not depend on each other.
ru: Классы файлов cookie HTTP, в основном полезные для серверного кода. Модули :mod:`http.cookiejar` и :mod:`http.cookies` не зависят друг от друга.

source: The specification of the original Netscape cookie protocol. Though this is still the dominant protocol, the 'Netscape cookie protocol' implemented by all the major browsers (and :mod:`http.cookiejar`) only bears a passing resemblance to the one sketched out in ``cookie_spec.html``.
ru: Спецификация исходного протокола cookie Netscape. Хотя это по-прежнему доминирующий протокол, «Протокол cookie Netscape», реализованный всеми основными браузерами (и :mod:`http.cookiejar`), имеет лишь мимолетное сходство с протоколом, изображенным в ``cookie_spec.html``.

source: :rfc:`2109` - HTTP State Management Mechanism
ru: :rfc:`2109` - Механизм управления состоянием HTTP

source: Obsoleted by :rfc:`2965`. Uses :mailheader:`Set-Cookie` with version=1.
ru: Устарело:rfc:`2965`. Использует :mailheader:`Set-Cookie` с версией=1.

source: :rfc:`2965` - HTTP State Management Mechanism
ru: :rfc:`2965` - Механизм управления состоянием HTTP

source: The Netscape protocol with the bugs fixed. Uses :mailheader:`Set-Cookie2` in place of :mailheader:`Set-Cookie`. Not widely used.
ru: Протокол Netscape с исправленными ошибками. Использует :mailheader:`Set-Cookie2` вместо :mailheader:`Set-Cookie`. Не широко используется.

source: Unfinished errata to :rfc:`2965`.
ru: Недоделанные исправления в :rfc:`2965`.

source: :rfc:`2964` - Use of HTTP State Management
ru: :rfc:`2964` - Использование управления состоянием HTTP

source: CookieJar and FileCookieJar Objects
ru: Объекты CookieJar и FileCookieJar

source: :class:`CookieJar` objects support the :term:`iterator` protocol for iterating over contained :class:`Cookie` objects.
ru: Объекты :class:`CookieJar` поддерживают протокол :term:`iterator` для перебора содержащихся объектов :class:`Cookie`.

source: :class:`CookieJar` has the following methods:
ru: :class:`CookieJar` имеет следующие методы:

source: Add correct :mailheader:`Cookie` header to *request*.
ru: Добавьте правильный заголовок :mailheader:`Cookie` в *request*.

source: If policy allows (ie. the :attr:`rfc2965` and :attr:`hide_cookie2` attributes of the :class:`CookieJar`'s :class:`CookiePolicy` instance are true and false respectively), the :mailheader:`Cookie2` header is also added when appropriate.
ru: Если политика позволяет (т. е. атрибуты :attr:`rfc2965` и :attr:`hide_cookie2` экземпляра :class:`CookieJar` :class:`CookiePolicy` имеют значения true и false соответственно), :mailheader:` Заголовок Cookie2` также добавляется, когда это необходимо.

source: *request* object needs :attr:`origin_req_host` attribute. Dependency on a deprecated method :meth:`get_origin_req_host` has been removed.
ru: Для объекта *request* требуется атрибут :attr:`origin_req_host`. Зависимость от устаревшего метода :meth:`get_origin_req_host` была удалена.

source: Extract cookies from HTTP *response* and store them in the :class:`CookieJar`, where allowed by policy.
ru: Извлеките файлы cookie из *ответа* HTTP и сохраните их в :class:`CookieJar`, если это разрешено политикой.

source: The :class:`CookieJar` will look for allowable :mailheader:`Set-Cookie` and :mailheader:`Set-Cookie2` headers in the *response* argument, and store cookies as appropriate (subject to the :meth:`CookiePolicy.set_ok` method's approval).
ru: :class:`CookieJar` будет искать допустимые заголовки :mailheader:`Set-Cookie` и :mailheader:`Set-Cookie2` в аргументе *response* и сохранять файлы cookie соответствующим образом (с учетом :meth:`CookiePolicy). одобрение метода .set_ok`).

source: The *response* object (usually the result of a call to :meth:`urllib.request.urlopen`, or similar) should support an :meth:`info` method, which returns an :class:`email.message.Message` instance.
ru: Объект *response* (обычно результат вызова :meth:`urllib.request.urlopen` или аналогичного) должен поддерживать метод :meth:`info`, который возвращает :class:`email.message.Message ` экземпляр.

source: Set the :class:`CookiePolicy` instance to be used.
ru: Установите экземпляр :class:`CookiePolicy` для использования.

source: Return sequence of :class:`Cookie` objects extracted from *response* object.
ru: Возвращаемая последовательность объектов :class:`Cookie`, извлеченных из объекта *response*.

source: See the documentation for :meth:`extract_cookies` for the interfaces required of the *response* and *request* arguments.
ru: См. документацию по :meth:`extract_cookies` для интерфейсов, необходимых для аргументов *response* и *request*.

source: Set a :class:`Cookie` if policy says it's OK to do so.
ru: Установите :class:`Cookie`, если политика разрешает это делать.

source: Set a :class:`Cookie`, without checking with policy to see whether or not it should be set.
ru: Установите :class:`Cookie`, не проверяя с помощью политики, следует ли его устанавливать.

source: Clear some cookies.
ru: Очистите некоторые cookie.

source: If invoked without arguments, clear all cookies. If given a single argument, only cookies belonging to that *domain* will be removed. If given two arguments, cookies belonging to the specified *domain* and URL *path* are removed. If given three arguments, then the cookie with the specified *domain*, *path* and *name* is removed.
ru: Если вызывается без аргументов, очистите все файлы cookie. Если задан один аргумент, будут удалены только файлы cookie, принадлежащие этому *домену*. Если заданы два аргумента, файлы cookie, принадлежащие указанному *домену* и URL-адресу *путь*, удаляются. Если задано три аргумента, файл cookie с указанными *домен*, *путь* и *имя* удаляется.

source: Raises :exc:`KeyError` if no matching cookie exists.
ru: Вызывает :exc:`KeyError`, если соответствующего файла cookie не существует.

source: Discard all session cookies.
ru: Отбросьте все сессии cookie.

source: Discards all contained cookies that have a true :attr:`discard` attribute (usually because they had either no ``max-age`` or ``expires`` cookie-attribute, or an explicit ``discard`` cookie-attribute). For interactive browsers, the end of a session usually corresponds to closing the browser window.
ru: Отбрасывает все содержащиеся файлы cookie, имеющие истинный атрибут :attr:`discard` (обычно потому, что у них либо нет атрибута cookie ``max-age`` или ``expires``, либо явный атрибут cookie ``discard`` ). Для интерактивных браузеров окончание сеанса обычно соответствует закрытию окна браузера.

source: Note that the :meth:`save` method won't save session cookies anyway, unless you ask otherwise by passing a true *ignore_discard* argument.
ru: Обратите внимание, что метод :meth:`save` в любом случае не будет сохранять файлы cookie сеанса, если вы не попросите иное, передав истинный аргумент *ignore_discard*.

source: :class:`FileCookieJar` implements the following additional methods:
ru: :class:`FileCookieJar` реализует следующие дополнительные методы:

source: Save cookies to a file.
ru: Сохраните cookie в файл.

source: This base class raises :exc:`NotImplementedError`. Subclasses may leave this method unimplemented.
ru: Этот базовый класс вызывает :exc:`NotImplementedError`. Подклассы могут оставить этот метод нереализованным.

source: *filename* is the name of file in which to save cookies. If *filename* is not specified, :attr:`self.filename` is used (whose default is the value passed to the constructor, if any); if :attr:`self.filename` is :const:`None`, :exc:`ValueError` is raised.
ru: *имя_файла* — имя файла, в котором сохраняются файлы cookie. Если *filename* не указано, используется :attr:`self.filename` (по умолчанию используется значение, переданное конструктору, если таковой имеется); если :attr:`self.filename` равен :const:`None`, возникает :exc:`ValueError`.

source: *ignore_discard*: save even cookies set to be discarded. *ignore_expires*: save even cookies that have expired
ru: *ignore_discard*: сохранить даже файлы cookie, которые нужно удалить. *ignore_expires*: сохранить даже файлы cookie, срок действия которых истек.

source: The file is overwritten if it already exists, thus wiping all the cookies it contains. Saved cookies can be restored later using the :meth:`load` or :meth:`revert` methods.
ru: Файл перезаписывается, если он уже существует, при этом удаляются все содержащиеся в нем файлы cookie. Сохраненные файлы cookie можно позже восстановить с помощью методов :meth:`load` или :meth:`revert`.

source: Load cookies from a file.
ru: Загрузить куки из файла.

source: Old cookies are kept unless overwritten by newly loaded ones.
ru: Старые файлы cookie сохраняются, если они не перезаписываются вновь загруженными.

source: Arguments are as for :meth:`save`.
ru: Аргументы такие же, как для :meth:`save`.

source: The named file must be in the format understood by the class, or :exc:`LoadError` will be raised. Also, :exc:`OSError` may be raised, for example if the file does not exist.
ru: Именованный файл должен быть в формате, понятном классу, иначе будет выдано сообщение :exc:`LoadError`. Кроме того, может возникнуть :exc:`OSError`, например, если файл не существует.

source: :exc:`IOError` used to be raised, it is now an alias of :exc:`OSError`.
ru: :exc:`IOError` раньше использовался для возбуждения, теперь это псевдоним :exc:`OSError`.

source: Clear all cookies and reload cookies from a saved file.
ru: Удалите все файлы cookie и перезагрузите файлы cookie из сохраненного файла.

source: :meth:`revert` can raise the same exceptions as :meth:`load`. If there is a failure, the object's state will not be altered.
ru: :meth:`revert` может вызывать те же исключения, что и :meth:`load`. В случае сбоя состояние объекта не изменится.

source: :class:`FileCookieJar` instances have the following public attributes:
ru: Экземпляры :class:`FileCookieJar` имеют следующие общедоступные атрибуты:

source: Filename of default file in which to keep cookies. This attribute may be assigned to.
ru: Имя файла по умолчанию, в котором будут храниться записи cookie. Этот атрибут может быть назначен.

source: If true, load cookies lazily from disk. This attribute should not be assigned to. This is only a hint, since this only affects performance, not behaviour (unless the cookies on disk are changing). A :class:`CookieJar` object may ignore it. None of the :class:`FileCookieJar` classes included in the standard library lazily loads cookies.
ru: Если это правда, лениво загружать файлы cookie с диска. Этот атрибут не следует назначать. Это всего лишь подсказка, поскольку это влияет только на производительность, а не на поведение (если только файлы cookie на диске не меняются). Объект :class:`CookieJar` может игнорировать его. Ни один из классов :class:`FileCookieJar`, включенных в стандартную библиотеку, не загружает файлы cookie лениво.

source: FileCookieJar subclasses and co-operation with web browsers
ru: Подклассы FileCookieJar и взаимодействие с веб-браузерами

source: The following :class:`CookieJar` subclasses are provided for reading and writing.
ru: Следующие подклассы :class:`CookieJar` предназначены для чтения и записи.

source: This loses information about :rfc:`2965` cookies, and also about newer or non-standard cookie-attributes such as ``port``.
ru: При этом теряется информация о файлах cookie :rfc:`2965`, а также о новых или нестандартных атрибутах файлов cookie, таких как ``port``.

source: Back up your cookies before saving if you have cookies whose loss / corruption would be inconvenient (there are some subtleties which may lead to slight changes in the file over a load / save round-trip).
ru: Создайте резервную копию файлов cookie перед сохранением, если у вас есть файлы cookie, потеря/повреждение которых может быть неудобной (есть некоторые тонкости, которые могут привести к небольшим изменениям в файле при загрузке/сохранении туда и обратно).

source: Also note that cookies saved while Mozilla is running will get clobbered by Mozilla.
ru: Также обратите внимание, что файлы cookie, сохраненные во время работы Mozilla, будут удалены Mozilla.

source: A :class:`FileCookieJar` that can load from and save cookies to disk in format compatible with the libwww-perl library's ``Set-Cookie3`` file format. This is convenient if you want to store cookies in a human-readable file.
ru: :class:`FileCookieJar`, который может загружать и сохранять файлы cookie на диск в формате, совместимом с форматом файлов ``Set-Cookie3`` библиотеки libwww-perl. Это удобно, если вы хотите хранить файлы cookie в удобочитаемом файле.

source: CookiePolicy Objects
ru: Объекты политики cookiePolicy

source: Objects implementing the :class:`CookiePolicy` interface have the following methods:
ru: Объекты, реализующие интерфейс :class:`CookiePolicy`, имеют следующие методы:

source: Return boolean value indicating whether cookie should be accepted from server.
ru: Возвращает логическое значение, указывающее, следует ли принимать файлы cookie с сервера.

source: *cookie* is a :class:`Cookie` instance. *request* is an object implementing the interface defined by the documentation for :meth:`CookieJar.extract_cookies`.
ru: *cookie* — это экземпляр :class:`Cookie`. *request* — это объект, реализующий интерфейс, определенный в документации для :meth:`CookieJar.extract_cookies`.

source: Return boolean value indicating whether cookie should be returned to server.
ru: Возвращаемое логическое значение, указывающее, следует ли возвращать файлы cookie на сервер.

source: *cookie* is a :class:`Cookie` instance. *request* is an object implementing the interface defined by the documentation for :meth:`CookieJar.add_cookie_header`.
ru: *cookie* — это экземпляр :class:`Cookie`. *request* — это объект, реализующий интерфейс, определенный в документации для :meth:`CookieJar.add_cookie_header`.

source: Return ``False`` if cookies should not be returned, given cookie domain.
ru: Верните «False», если файлы cookie не должны возвращаться, учитывая домен файлов cookie.

source: This method is an optimization. It removes the need for checking every cookie with a particular domain (which might involve reading many files). Returning true from :meth:`domain_return_ok` and :meth:`path_return_ok` leaves all the work to :meth:`return_ok`.
ru: Этот метод является оптимизацией. Это устраняет необходимость проверки каждого файла cookie с определенным доменом (что может потребовать чтения большого количества файлов). Возвращение true из :meth:`domain_return_ok` и :meth:`path_return_ok` оставляет всю работу :meth:`return_ok`.

source: If :meth:`domain_return_ok` returns true for the cookie domain, :meth:`path_return_ok` is called for the cookie path. Otherwise, :meth:`path_return_ok` and :meth:`return_ok` are never called for that cookie domain. If :meth:`path_return_ok` returns true, :meth:`return_ok` is called with the :class:`Cookie` object itself for a full check. Otherwise, :meth:`return_ok` is never called for that cookie path.
ru: Если :meth:`domain_return_ok` возвращает true для домена cookie, :meth:`path_return_ok` вызывается для пути cookie. В противном случае :meth:`path_return_ok` и :meth:`return_ok` никогда не вызываются для этого домена cookie. Если :meth:`path_return_ok` возвращает true, :meth:`return_ok` вызывается вместе с самим объектом :class:`Cookie` для полной проверки. В противном случае :meth:`return_ok` никогда не вызывается для этого пути cookie.

source: Note that :meth:`domain_return_ok` is called for every *cookie* domain, not just for the *request* domain. For example, the function might be called with both ``".example.com"`` and ``"www.example.com"`` if the request domain is ``"www.example.com"``. The same goes for :meth:`path_return_ok`.
ru: Обратите внимание, что :meth:`domain_return_ok` вызывается для каждого домена *cookie*, а не только для домена *request*. Например, функция может быть вызвана как с ``".example.com"``, так и с ``"www.example.com"``, если доменом запроса является ``"www.example.com"``. То же самое касается :meth:`path_return_ok`.

source: The *request* argument is as documented for :meth:`return_ok`.
ru: Аргумент *request* описан в документации для :meth:`return_ok`.

source: Return ``False`` if cookies should not be returned, given cookie path.
ru: Верните «False», если файлы cookie не должны возвращаться по заданному пути к файлам cookie.
