Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/http.server.po
Languages: ru

source: If the request was mapped to a directory, the directory is checked for a file named ``index.html`` or ``index.htm`` (in that order). If found, the file's contents are returned; otherwise a directory listing is generated by calling the :meth:`list_directory` method. This method uses :func:`os.listdir` to scan the directory, and returns a ``404`` error response if the :func:`~os.listdir` fails.
ru: Если запрос был сопоставлен с каталогом, каталог проверяется на наличие файла с именем index.html или index.htm (в указанном порядке). Если найдено, возвращается содержимое файла; в противном случае список каталогов генерируется путем вызова метода :meth:`list_directory`. Этот метод использует :func:`os.listdir` для сканирования каталога и возвращает ответ об ошибке ``404``, если :func:`~os.listdir` завершается неудачно.

source: A ``'Content-type:'`` header with the guessed content type is output, followed by a ``'Content-Length:'`` header with the file's size and a ``'Last-Modified:'`` header with the file's modification time.
ru: Выводится заголовок ``'Content-type:'`` с предполагаемым типом контента, за которым следует заголовок ``'Content-Length:'`` с размером файла и ``'Last-Modified:'`` заголовок со временем модификации файла.

source: Then follows a blank line signifying the end of the headers, and then the contents of the file are output. If the file's MIME type starts with ``text/`` the file is opened in text mode; otherwise binary mode is used.
ru: Затем следует пустая строка, обозначающая конец заголовков, а затем выводится содержимое файла. Если MIME-тип файла начинается с ``text/``, файл открывается в текстовом режиме; в противном случае используется двоичный режим.

source: For example usage, see the implementation of the ``test`` function in :source:`Lib/http/server.py`.
ru: Пример использования см. в реализации функции test в :source:`Lib/http/server.py`.

source: Support of the ``'If-Modified-Since'`` header.
ru: Поддержка заголовка If-Modified-Since.

source: The :class:`SimpleHTTPRequestHandler` class can be used in the following manner in order to create a very basic webserver serving files relative to the current directory::
ru: Класс :class:`SimpleHTTPRequestHandler` можно использовать следующим образом для создания очень простого веб-сервера, обслуживающего файлы относительно текущего каталога:

source: :mod:`http.server` can also be invoked directly using the :option:`-m` switch of the interpreter. Similar to the previous example, this serves files relative to the current directory::
ru: :mod:`http.server` также можно вызвать напрямую с помощью переключателя :option:`-m` интерпретатора. Как и в предыдущем примере, здесь обслуживаются файлы относительно текущего каталога:

source: The server listens to port 8000 by default. The default can be overridden by passing the desired port number as an argument::
ru: По умолчанию сервер прослушивает порт 8000. Значение по умолчанию можно переопределить, передав желаемый номер порта в качестве аргумента::

source: By default, the server binds itself to all interfaces. The option ``-b/--bind`` specifies a specific address to which it should bind. Both IPv4 and IPv6 addresses are supported. For example, the following command causes the server to bind to localhost only::
ru: По умолчанию сервер привязывается ко всем интерфейсам. Опция ``-b/--bind`` указывает конкретный адрес, к которому она должна привязываться. Поддерживаются адреса IPv4 и IPv6. Например, следующая команда заставляет сервер привязываться только к локальному хосту::

source: Added the ``--bind`` option.
ru: Добавлена ​​опция ``--bind``.

source: Support IPv6 in the ``--bind`` option.
ru: Поддержка IPv6 в опции ``--bind``.

source: By default, the server uses the current directory. The option ``-d/--directory`` specifies a directory to which it should serve the files. For example, the following command uses a specific directory::
ru: По умолчанию сервер использует текущий каталог. Опция ``-d/--directory`` указывает каталог, в который следует обслуживать файлы. Например, следующая команда использует определенный каталог::

source: Added the ``--directory`` option.
ru: Добавлена ​​опция ``--directory``.

source: By default, the server is conformant to HTTP/1.0. The option ``-p/--protocol`` specifies the HTTP version to which the server is conformant. For example, the following command runs an HTTP/1.1 conformant server::
ru: По умолчанию сервер соответствует HTTP/1.0. Опция ``-p/--protocol`` указывает версию HTTP, которой соответствует сервер. Например, следующая команда запускает сервер, соответствующий HTTP/1.1:

source: Added the ``--protocol`` option.
ru: Добавлена ​​опция ``--protocol``.

source: This class is used to serve either files or output of CGI scripts from the current directory and below. Note that mapping HTTP hierarchic structure to local directory structure is exactly as in :class:`SimpleHTTPRequestHandler`.
ru: Этот класс используется для обслуживания файлов или вывода сценариев CGI из текущего каталога и ниже. Обратите внимание, что сопоставление иерархической структуры HTTP со структурой локальных каталогов происходит точно так же, как в :class:`SimpleHTTPRequestHandler`.

source: CGI scripts run by the :class:`CGIHTTPRequestHandler` class cannot execute redirects (HTTP code 302), because code 200 (script output follows) is sent prior to execution of the CGI script. This pre-empts the status code.
ru: Сценарии CGI, запускаемые классом :class:`CGIHTTPRequestHandler`, не могут выполнять перенаправления (HTTP-код 302), поскольку код 200 (следующий вывод сценария) отправляется до выполнения сценария CGI. Это предшествует коду состояния.

source: The class will however, run the CGI script, instead of serving it as a file, if it guesses it to be a CGI script. Only directory-based CGI are used --- the other common server configuration is to treat special extensions as denoting CGI scripts.
ru: Однако класс запустит скрипт CGI, а не будет обслуживать его как файл, если он угадает, что это скрипт CGI. Используются только CGI на основе каталогов --- другая распространенная конфигурация сервера заключается в том, чтобы рассматривать специальные расширения как обозначение скриптов CGI.

source: The :func:`do_GET` and :func:`do_HEAD` functions are modified to run CGI scripts and serve the output, instead of serving files, if the request leads to somewhere below the ``cgi_directories`` path.
ru: Функции :func:`do_GET` и :func:`do_HEAD` изменены для запуска CGI-скриптов и обработки вывода вместо обслуживания файлов, если запрос ведет куда-то ниже пути ``cgi_directories``.

source: The :class:`CGIHTTPRequestHandler` defines the following data member:
ru: :class:`CGIHTTPRequestHandler` определяет следующий элемент данных:

source: This defaults to ``['/cgi-bin', '/htbin']`` and describes directories to treat as containing CGI scripts.
ru: По умолчанию это ``['/cgi-bin', '/htbin']`` и описывает каталоги, которые следует рассматривать как содержащие CGI-скрипты.

source: The :class:`CGIHTTPRequestHandler` defines the following method:
ru: :class:`CGIHTTPRequestHandler` определяет следующий метод:

source: This method serves the ``'POST'`` request type, only allowed for CGI scripts. Error 501, "Can only POST to CGI scripts", is output when trying to POST to a non-CGI url.
ru: Этот метод обслуживает тип запроса POST, разрешенный только для сценариев CGI. Ошибка 501 «Может только POST для сценариев CGI» выводится при попытке отправить POST на URL-адрес, отличный от CGI.

source: Note that CGI scripts will be run with UID of user nobody, for security reasons. Problems with the CGI script will be translated to error 403.
ru: Обратите внимание, что сценарии CGI будут запускаться с UID пользователя none по соображениям безопасности. Проблемы с CGI-скриптом будут транслироваться в ошибку 403.

source: :class:`CGIHTTPRequestHandler` can be enabled in the command line by passing the ``--cgi`` option::
ru: :class:`CGIHTTPRequestHandler` можно включить в командной строке, передав опцию ``--cgi``::

source: :class:`CGIHTTPRequestHandler` and the ``--cgi`` command line option are not intended for use by untrusted clients and may be vulnerable to exploitation. Always use within a secure environment.
ru: :class:`CGIHTTPRequestHandler` и опция командной строки ``--cgi`` не предназначены для использования ненадежными клиентами и могут быть уязвимы для взлома. Всегда используйте в безопасной среде.

source: Security Considerations
ru: Вопросы безопасности

source: :class:`SimpleHTTPRequestHandler` will follow symbolic links when handling requests, this makes it possible for files outside of the specified directory to be served.
ru: :class:`SimpleHTTPRequestHandler` будет следовать символическим ссылкам при обработке запросов, это позволяет обслуживать файлы за пределами указанного каталога.

source: Earlier versions of Python did not scrub control characters from the log messages emitted to stderr from ``python -m http.server`` or the default :class:`BaseHTTPRequestHandler` ``.log_message`` implementation. This could allow remote clients connecting to your server to send nefarious control codes to your terminal.
ru: Более ранние версии Python не удаляли управляющие символы из сообщений журнала, отправляемых в stderr из ``python -m http.server`` или реализации :class:`BaseHTTPRequestHandler``.log_message`` по умолчанию. Это может позволить удаленным клиентам, подключающимся к вашему серверу, отправлять на ваш терминал гнусные управляющие коды.

source: Control characters are scrubbed in stderr logs.
ru: Управляющие символы очищаются в журналах stderr.

source: server
ru: сервер

source: protocol
ru: протокол

source: security
ru: безопасность
