Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/http.server.po
Languages: ru

source: **Source code:** :source:`Lib/http/server.py`
ru: **Исходный код:** :source:`Lib/http/server.py`

source: This module defines classes for implementing HTTP servers.
ru: Этот модуль определяет классы для реализации HTTP-серверов.

source: :mod:`http.server` is not recommended for production. It only implements :ref:`basic security checks <http.server-security>`.
ru: :mod:`http.server` не рекомендуется для производства. Он реализует только :ref:`базовые проверки безопасности <http.server-security>`.

source: This module does not work or is not available on WebAssembly platforms ``wasm32-emscripten`` and ``wasm32-wasi``. See :ref:`wasm-availability` for more information.
ru: Этот модуль не работает или недоступен на платформах WebAssembly «wasm32-emscripten» и «wasm32-wasi». См. :ref:`wasm-availability` для получения дополнительной информации.

source: One class, :class:`HTTPServer`, is a :class:`socketserver.TCPServer` subclass. It creates and listens at the HTTP socket, dispatching the requests to a handler. Code to create and run the server looks like this::
ru: Один класс, :class:`HTTPServer`, является подклассом :class:`socketserver.TCPServer`. Он создает и прослушивает HTTP-сокет, отправляя запросы обработчику. Код для создания и запуска сервера выглядит следующим образом:

source: This class builds on the :class:`~socketserver.TCPServer` class by storing the server address as instance variables named :attr:`server_name` and :attr:`server_port`. The server is accessible by the handler, typically through the handler's :attr:`server` instance variable.
ru: Этот класс основан на классе :class:`~socketserver.TCPServer`, сохраняя адрес сервера в виде переменных экземпляра с именами :attr:`server_name` и :attr:`server_port`. Сервер доступен обработчику, обычно через переменную экземпляра :attr:`server` обработчика.

source: This class is identical to HTTPServer but uses threads to handle requests by using the :class:`~socketserver.ThreadingMixIn`. This is useful to handle web browsers pre-opening sockets, on which :class:`HTTPServer` would wait indefinitely.
ru: Этот класс идентичен HTTPServer, но использует потоки для обработки запросов с помощью :class:`~socketserver.ThreadingMixIn`. Это полезно для обработки веб-браузерами предварительного открытия сокетов, на которых :class:`HTTPServer` будет ждать бесконечно.

source: The :class:`HTTPServer` and :class:`ThreadingHTTPServer` must be given a *RequestHandlerClass* on instantiation, of which this module provides three different variants:
ru: :class:`HTTPServer` и :class:`ThreadingHTTPServer` должны иметь *RequestHandlerClass* при создании экземпляра, из которых этот модуль предоставляет три различных варианта:

source: This class is used to handle the HTTP requests that arrive at the server. By itself, it cannot respond to any actual HTTP requests; it must be subclassed to handle each request method (e.g. GET or POST). :class:`BaseHTTPRequestHandler` provides a number of class and instance variables, and methods for use by subclasses.
ru: Этот класс используется для обработки HTTP-запросов, поступающих на сервер. Сам по себе он не может отвечать ни на какие реальные HTTP-запросы; он должен быть подклассом для обработки каждого метода запроса (например, GET или POST). :class:`BaseHTTPRequestHandler` предоставляет ряд переменных класса и экземпляра, а также методов для использования подклассами.

source: The handler will parse the request and the headers, then call a method specific to the request type. The method name is constructed from the request. For example, for the request method ``SPAM``, the :meth:`!do_SPAM` method will be called with no arguments. All of the relevant information is stored in instance variables of the handler. Subclasses should not need to override or extend the :meth:`!__init__` method.
ru: Обработчик проанализирует запрос и заголовки, а затем вызовет метод, специфичный для типа запроса. Имя метода создается на основе запроса. Например, для метода запроса ``SPAM`` метод :meth:`!do_SPAM` будет вызываться без аргументов. Вся соответствующая информация хранится в переменных экземпляра обработчика. Подклассам не нужно переопределять или расширять метод :meth:`!__init__`.

source: :class:`BaseHTTPRequestHandler` has the following instance variables:
ru: :class:`BaseHTTPRequestHandler` имеет следующие переменные экземпляра:

source: Contains a tuple of the form ``(host, port)`` referring to the client's address.
ru: Содержит кортеж вида ``(хост, порт)``, ссылающийся на адрес клиента.

source: Contains the server instance.
ru: Содержит экземпляр сервера.

source: Boolean that should be set before :meth:`handle_one_request` returns, indicating if another request may be expected, or if the connection should be shut down.
ru: Логическое значение, которое должно быть установлено до возврата :meth:`handle_one_request`, указывая, можно ли ожидать еще одного запроса или следует закрыть соединение.

source: Contains the string representation of the HTTP request line. The terminating CRLF is stripped. This attribute should be set by :meth:`handle_one_request`. If no valid request line was processed, it should be set to the empty string.
ru: Содержит строковое представление строки HTTP-запроса. Завершающий CRLF удаляется. Этот атрибут должен быть установлен :meth:`handle_one_request`. Если ни одна допустимая строка запроса не была обработана, она должна быть установлена ​​в пустую строку.

source: Contains the command (request type). For example, ``'GET'``.
ru: Содержит команду (тип запроса). Например, ``'GET'``.

source: Contains the request path. If query component of the URL is present, then ``path`` includes the query. Using the terminology of :rfc:`3986`, ``path`` here includes ``hier-part`` and the ``query``.
ru: Содержит путь запроса. Если компонент запроса URL-адреса присутствует, то ``path`` включает запрос. Используя терминологию :rfc:`3986`, ``path`` здесь включает ``hier-part`` и ``query``.

source: Contains the version string from the request. For example, ``'HTTP/1.0'``.
ru: Содержит строку версии из запроса. Например, ``'HTTP/1.0'``.

source: Holds an instance of the class specified by the :attr:`MessageClass` class variable. This instance parses and manages the headers in the HTTP request. The :func:`~http.client.parse_headers` function from :mod:`http.client` is used to parse the headers and it requires that the HTTP request provide a valid :rfc:`2822` style header.
ru: Содержит экземпляр класса, указанного переменной класса :attr:`MessageClass`. Этот экземпляр анализирует и управляет заголовками HTTP-запроса. Функция :func:`~http.client.parse_headers` из :mod:`http.client` используется для анализа заголовков и требует, чтобы HTTP-запрос предоставлял действительный заголовок стиля :rfc:`2822`.

source: An :class:`io.BufferedIOBase` input stream, ready to read from the start of the optional input data.
ru: Входной поток :class:`io.BufferedIOBase`, готовый к чтению с начала необязательных входных данных.

source: Contains the output stream for writing a response back to the client. Proper adherence to the HTTP protocol must be used when writing to this stream in order to achieve successful interoperation with HTTP clients.
ru: Содержит выходной поток для записи ответа обратно клиенту. При записи в этот поток необходимо использовать надлежащее соблюдение протокола HTTP для достижения успешного взаимодействия с клиентами HTTP.

source: This is an :class:`io.BufferedIOBase` stream.
ru: Это поток :class:`io.BufferedIOBase`.

source: :class:`BaseHTTPRequestHandler` has the following attributes:
ru: :class:`BaseHTTPRequestHandler` имеет следующие атрибуты:

source: Specifies the server software version. You may want to override this. The format is multiple whitespace-separated strings, where each string is of the form name[/version]. For example, ``'BaseHTTP/0.2'``.
ru: Указывает версию программного обеспечения сервера. Возможно, вы захотите переопределить это. Формат представляет собой несколько строк, разделенных пробелами, где каждая строка имеет форму имя[/версия]. Например, ``'BaseHTTP/0.2'``.

source: Contains the Python system version, in a form usable by the :attr:`version_string` method and the :attr:`server_version` class variable. For example, ``'Python/1.4'``.
ru: Содержит версию системы Python в форме, используемой методом :attr:`version_string` и переменной класса :attr:`server_version`. Например, ``'Python/1.4'``.

source: Specifies a format string that should be used by :meth:`send_error` method for building an error response to the client. The string is filled by default with variables from :attr:`responses` based on the status code that passed to :meth:`send_error`.
ru: Указывает строку формата, которая должна использоваться методом :meth:`send_error` для формирования ответа об ошибке клиенту. По умолчанию строка заполняется переменными из :attr:`responses` на основе кода состояния, переданного в :meth:`send_error`.

source: Specifies the Content-Type HTTP header of error responses sent to the client. The default value is ``'text/html'``.
ru: Указывает HTTP-заголовок Content-Type ответов об ошибках, отправляемых клиенту. Значением по умолчанию является ``'text/html'``.

source: Specifies the HTTP version to which the server is conformant. It is sent in responses to let the client know the server's communication capabilities for future requests. If set to ``'HTTP/1.1'``, the server will permit HTTP persistent connections; however, your server *must* then include an accurate ``Content-Length`` header (using :meth:`send_header`) in all of its responses to clients. For backwards compatibility, the setting defaults to ``'HTTP/1.0'``.
ru: Указывает версию HTTP, которой соответствует сервер. Он отправляется в ответах, чтобы сообщить клиенту о возможностях связи сервера для будущих запросов. Если установлено значение ``'HTTP/1.1'``, сервер будет разрешать постоянные соединения HTTP; однако ваш сервер *должен* затем включать точный заголовок Content-Length (используя :meth:`send_header`) во все свои ответы клиентам. Для обратной совместимости по умолчанию установлено значение «HTTP/1.0».

source: Specifies an :class:`email.message.Message`\ -like class to parse HTTP headers. Typically, this is not overridden, and it defaults to :class:`http.client.HTTPMessage`.
ru: Указывает класс, подобный :class:`email.message.Message`\, для анализа заголовков HTTP. Обычно это значение не переопределяется и по умолчанию используется :class:`http.client.HTTPMessage`.

source: This attribute contains a mapping of error code integers to two-element tuples containing a short and long message. For example, ``{code: (shortmessage, longmessage)}``. The *shortmessage* is usually used as the *message* key in an error response, and *longmessage* as the *explain* key. It is used by :meth:`send_response_only` and :meth:`send_error` methods.
ru: Этот атрибут содержит сопоставление целых чисел кода ошибки с двухэлементными кортежами, содержащими короткое и длинное сообщение. Например, ``{code: (shortmessage, longmessage)}``. *shortmessage* обычно используется в качестве ключа *message* в ответе об ошибке, а *longmessage* — в качестве ключа *explain*. Он используется методами :meth:`send_response_only` и :meth:`send_error`.

source: A :class:`BaseHTTPRequestHandler` instance has the following methods:
ru: Экземпляр :class:`BaseHTTPRequestHandler` имеет следующие методы:

source: Calls :meth:`handle_one_request` once (or, if persistent connections are enabled, multiple times) to handle incoming HTTP requests. You should never need to override it; instead, implement appropriate :meth:`!do_\*` methods.
ru: Вызывает :meth:`handle_one_request` один раз (или, если постоянные соединения включены, несколько раз) для обработки входящих HTTP-запросов. Вам никогда не придется переопределять его; вместо этого реализуйте соответствующие методы :meth:`!do_\*`.

source: This method will parse and dispatch the request to the appropriate :meth:`!do_\*` method. You should never need to override it.
ru: Этот метод будет анализировать и отправлять запрос соответствующему методу :meth:`!do_\*`. Вам никогда не придется переопределять его.

source: When an HTTP/1.1 conformant server receives an ``Expect: 100-continue`` request header it responds back with a ``100 Continue`` followed by ``200 OK`` headers. This method can be overridden to raise an error if the server does not want the client to continue. For e.g. server can choose to send ``417 Expectation Failed`` as a response header and ``return False``.
ru: Когда сервер, соответствующий HTTP/1.1, получает заголовок запроса «Expect: 100-continue», он отвечает ответом «100 Continue», за которым следуют заголовки «200 OK». Этот метод можно переопределить, чтобы вызвать ошибку, если сервер не хочет, чтобы клиент продолжал работу. Например, сервер может выбрать отправку «417 Expectation Failed» в качестве заголовка ответа и «вернуть False».

source: Sends and logs a complete error reply to the client. The numeric *code* specifies the HTTP error code, with *message* as an optional, short, human readable description of the error. The *explain* argument can be used to provide more detailed information about the error; it will be formatted using the :attr:`error_message_format` attribute and emitted, after a complete set of headers, as the response body. The :attr:`responses` attribute holds the default values for *message* and *explain* that will be used if no value is provided; for unknown codes the default value for both is the string ``???``. The body will be empty if the method is HEAD or the response code is one of the following: :samp:`1{xx}`, ``204 No Content``, ``205 Reset Content``, ``304 Not Modified``.
ru: Отправляет и регистрирует полный ответ об ошибке клиенту. Числовой *код* указывает код ошибки HTTP, а *сообщение* — необязательное, краткое, удобочитаемое описание ошибки. Аргумент *explain* можно использовать для предоставления более подробной информации об ошибке; он будет отформатирован с использованием атрибута :attr:`error_message_format` и отправлен после полного набора заголовков в качестве тела ответа. Атрибут :attr:`responses` содержит значения по умолчанию для *message* и *explain*, которые будут использоваться, если значение не указано; для неизвестных кодов значением по умолчанию для обоих является строка ``???``. Тело будет пустым, если метод HEAD или код ответа один из следующих: :samp:`1{xx}`, ``204 No Content``, ``205 Reset Content``, ``304 Not Модифицированный``.

source: The error response includes a Content-Length header. Added the *explain* argument.
ru: Ответ об ошибке включает заголовок Content-Length. Добавлен аргумент *объясните*.

source: Adds a response header to the headers buffer and logs the accepted request. The HTTP response line is written to the internal buffer, followed by *Server* and *Date* headers. The values for these two headers are picked up from the :meth:`version_string` and :meth:`date_time_string` methods, respectively. If the server does not intend to send any other headers using the :meth:`send_header` method, then :meth:`send_response` should be followed by an :meth:`end_headers` call.
ru: Добавляет заголовок ответа в буфер заголовков и регистрирует принятый запрос. Строка ответа HTTP записывается во внутренний буфер, за ней следуют заголовки *Server* и *Date*. Значения для этих двух заголовков берутся из методов :meth:`version_string` и :meth:`date_time_string` соответственно. Если сервер не намерен отправлять какие-либо другие заголовки с помощью метода :meth:`send_header`, то за :meth:`send_response` должен следовать вызов :meth:`end_headers`.

source: Headers are stored to an internal buffer and :meth:`end_headers` needs to be called explicitly.
ru: Заголовки сохраняются во внутреннем буфере, и :meth:`end_headers` необходимо вызывать явно.

source: Adds the HTTP header to an internal buffer which will be written to the output stream when either :meth:`end_headers` or :meth:`flush_headers` is invoked. *keyword* should specify the header keyword, with *value* specifying its value. Note that, after the send_header calls are done, :meth:`end_headers` MUST BE called in order to complete the operation.
ru: Добавляет заголовок HTTP во внутренний буфер, который будет записан в выходной поток при вызове :meth:`end_headers` или :meth:`flush_headers`. *keyword* должно указывать ключевое слово заголовка, а *value* — его значение. Обратите внимание, что после выполнения вызовов send_header ДОЛЖЕН БЫТЬ вызван :meth:`end_headers` для завершения операции.

source: Headers are stored in an internal buffer.
ru: Заголовки хранятся во внутреннем буфере.

source: Sends the response header only, used for the purposes when ``100 Continue`` response is sent by the server to the client. The headers not buffered and sent directly the output stream.If the *message* is not specified, the HTTP message corresponding the response *code* is sent.
ru: Отправляет только заголовок ответа, используемый для целей, когда ответ «100 Продолжить» отправляется сервером клиенту. Заголовки не буферизуются и отправляются непосредственно в выходной поток. Если *сообщение* не указано, отправляется HTTP-сообщение, соответствующее *коду* ответа.

source: The buffered headers are written to the output stream.
ru: Буферизованные заголовки записываются в выходной поток.

source: Finally send the headers to the output stream and flush the internal headers buffer.
ru: Наконец, отправьте заголовки в выходной поток и очистите внутренний буфер заголовков.

source: Logs an accepted (successful) request. *code* should specify the numeric HTTP code associated with the response. If a size of the response is available, then it should be passed as the *size* parameter.
ru: Регистрирует принятый (успешный) запрос. *code* должен указывать числовой HTTP-код, связанный с ответом. Если доступен размер ответа, то его следует передать как параметр *size*.

source: Logs an error when a request cannot be fulfilled. By default, it passes the message to :meth:`log_message`, so it takes the same arguments (*format* and additional values).
ru: Регистрирует ошибку, когда запрос не может быть выполнен. По умолчанию он передает сообщение в :meth:`log_message`, поэтому он принимает те же аргументы (*формат* и дополнительные значения).

source: Logs an arbitrary message to ``sys.stderr``. This is typically overridden to create custom error logging mechanisms. The *format* argument is a standard printf-style format string, where the additional arguments to :meth:`log_message` are applied as inputs to the formatting. The client ip address and current date and time are prefixed to every message logged.
ru: Записывает произвольное сообщение в ``sys.stderr``. Обычно это переопределяется для создания пользовательских механизмов регистрации ошибок. Аргумент *format* представляет собой стандартную строку формата в стиле printf, где дополнительные аргументы :meth:`log_message` применяются в качестве входных данных для форматирования. IP-адрес клиента, а также текущая дата и время добавляются к каждому зарегистрированному сообщению.

source: Returns the server software's version string. This is a combination of the :attr:`server_version` and :attr:`sys_version` attributes.
ru: Возвращает строку версии серверного программного обеспечения. Это комбинация атрибутов :attr:`server_version` и :attr:`sys_version`.

source: Returns the date and time given by *timestamp* (which must be ``None`` or in the format returned by :func:`time.time`), formatted for a message header. If *timestamp* is omitted, it uses the current date and time.
ru: Возвращает дату и время, заданные *timestamp* (которое должно быть ``None`` или в формате, возвращаемом :func:`time.time`), отформатированные для заголовка сообщения. Если *timestamp* опущено, используются текущие дата и время.

source: The result looks like ``'Sun, 06 Nov 1994 08:49:37 GMT'``.
ru: Результат выглядит так: «Sun, 06 Nov 1994 08:49:37 GMT».

source: Returns the current date and time, formatted for logging.
ru: Возвращает текущую дату и время, отформатированные для ведения журнала.

source: Returns the client address.
ru: Возвращает адрес клиента.

source: Previously, a name lookup was performed. To avoid name resolution delays, it now always returns the IP address.
ru: Раньше выполнялся поиск имени. Чтобы избежать задержек разрешения имени, теперь всегда возвращается IP-адрес.

source: This class serves files from the directory *directory* and below, or the current directory if *directory* is not provided, directly mapping the directory structure to HTTP requests.
ru: Этот класс обслуживает файлы из каталога *directory* и ниже или из текущего каталога, если *directory* не указан, напрямую сопоставляя структуру каталогов с HTTP-запросами.

source: Added the *directory* parameter.
ru: Добавлен параметр *directory*.

source: The *directory* parameter accepts a :term:`path-like object`.
ru: Параметр *directory* принимает :term:`объект, похожий на путь`.

source: A lot of the work, such as parsing the request, is done by the base class :class:`BaseHTTPRequestHandler`. This class implements the :func:`do_GET` and :func:`do_HEAD` functions.
ru: Большую часть работы, например анализ запроса, выполняет базовый класс :class:`BaseHTTPRequestHandler`. Этот класс реализует функции :func:`do_GET` и :func:`do_HEAD`.

source: The following are defined as class-level attributes of :class:`SimpleHTTPRequestHandler`:
ru: Следующие атрибуты определены как атрибуты уровня класса :class:`SimpleHTTPRequestHandler`:

source: This will be ``"SimpleHTTP/" + __version__``, where ``__version__`` is defined at the module level.
ru: Это будет ``"SimpleHTTP/" + __version__``, где ``__version__`` определяется на уровне модуля.

source: A dictionary mapping suffixes into MIME types, contains custom overrides for the default system mappings. The mapping is used case-insensitively, and so should contain only lower-cased keys.
ru: Словарь, отображающий суффиксы в типы MIME, содержит пользовательские переопределения для системных отображений по умолчанию. Отображение используется без учета регистра, поэтому должно содержать только ключи в нижнем регистре.

source: This dictionary is no longer filled with the default system mappings, but only contains overrides.
ru: Этот словарь больше не заполнен системными сопоставлениями по умолчанию, а содержит только переопределения.

source: The :class:`SimpleHTTPRequestHandler` class defines the following methods:
ru: Класс :class:`SimpleHTTPRequestHandler` определяет следующие методы:

source: This method serves the ``'HEAD'`` request type: it sends the headers it would send for the equivalent ``GET`` request. See the :meth:`do_GET` method for a more complete explanation of the possible headers.
ru: Этот метод обслуживает тип запроса HEAD: он отправляет заголовки, которые он отправил бы для эквивалентного запроса GET. См. метод :meth:`do_GET` для более полного объяснения возможных заголовков.

source: The request is mapped to a local file by interpreting the request as a path relative to the current working directory.
ru: Запрос сопоставляется с локальным файлом путем интерпретации запроса как пути относительно текущего рабочего каталога.
