Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/idle.po
Languages: ru

source: **Source code:** :source:`Lib/idlelib/`
ru: **Исходный код:** :source:`Lib/idlelib/`

source: IDLE has the following features:
ru: IDLE имеет следующие фичи:

source: cross-platform: works mostly the same on Windows, Unix, and macOS
ru: кроссплатформенность: работает практически одинаково на Windows, Unix и macOS

source: Python shell window (interactive interpreter) with colorizing of code input, output, and error messages
ru: Окно оболочки Python (интерактивный интерпретатор) с раскрашиванием ввода кода, вывода и сообщений об ошибках

source: multi-window text editor with multiple undo, Python colorizing, smart indent, call tips, auto completion, and other features
ru: многооконный текстовый редактор с возможностью многократной отмены, раскрашивания Python, интеллектуального отступа, подсказок по вызовам, автодополнения и других функций

source: search within any window, replace within editor windows, and search through multiple files (grep)
ru: поиск в любом окне, замена в окнах редактора и поиск по нескольким файлам (grep)

source: debugger with persistent breakpoints, stepping, and viewing of global and local namespaces
ru: отладчик с постоянными точками останова, пошаговым выполнением и просмотром глобальных и локальных пространств имен

source: configuration, browsers, and other dialogs
ru: конфигурация, браузеры и другие диалоги

source: Menus
ru: Меню

source: IDLE has two main window types, the Shell window and the Editor window. It is possible to have multiple editor windows simultaneously. On Windows and Linux, each has its own top menu. Each menu documented below indicates which window type it is associated with.
ru: IDLE имеет два основных типа окон: окно Shell и окно Editor. Возможно иметь несколько окон редактора одновременно. В Windows и Linux каждое из них имеет свое собственное верхнее меню. Каждое меню, описанное ниже, указывает, с каким типом окна оно связано.

source: Output windows, such as used for Edit => Find in Files, are a subtype of editor window. They currently have the same top menu but a different default title and context menu.
ru: Окна вывода, такие как используемые для Edit => Find in Files, являются подтипом окна редактора. В настоящее время они имеют одинаковое верхнее меню, но другой заголовок по умолчанию и контекстное меню.

source: On macOS, there is one application menu. It dynamically changes according to the window currently selected. It has an IDLE menu, and some entries described below are moved around to conform to Apple guidelines.
ru: В macOS есть одно меню приложений. Оно динамически меняется в зависимости от текущего выбранного окна. Оно имеет меню IDLE, а некоторые пункты, описанные ниже, перемещены для соответствия рекомендациям Apple.

source: File menu (Shell and Editor)
ru: Меню "Файл" (командная оболочка и "Редактор")

source: New File
ru: Новый файл

source: Create a new file editing window.
ru: Создать новое окно редактирования файла.

source: Open...
ru: Открыть...

source: Open an existing file with an Open dialog.
ru: Откройте существующий файл с помощью диалогового окна «Открыть».

source: Recent Files
ru: Последние файлы

source: Open a list of recent files. Click one to open it.
ru: Откройте список последних файлов. Щелкните один, чтобы открыть его.

source: Open Module...
ru: Открыть модуль...

source: Open an existing module (searches sys.path).
ru: Открыть существующий модуль (поиск в sys.path).

source: Class Browser
ru: Браузер классов

source: Show functions, classes, and methods in the current Editor file in a tree structure. In the shell, open a module first.
ru: Показать функции, классы и методы в текущем файле редактора в древовидной структуре. В оболочке сначала откройте модуль.

source: Path Browser
ru: Браузер путей

source: Show sys.path directories, modules, functions, classes and methods in a tree structure.
ru: Отображение каталогов, модулей, функций, классов и методов sys.path в древовидной структуре.

source: Save
ru: Сохранить

source: Save the current window to the associated file, if there is one. Windows that have been changed since being opened or last saved have a \* before and after the window title. If there is no associated file, do Save As instead.
ru: Сохраните текущее окно в связанный файл, если он есть. Окна, которые были изменены с момента открытия или последнего сохранения, имеют \* перед и после заголовка окна. Если связанного файла нет, используйте Save As вместо этого.

source: Save As...
ru: Сохранить как...

source: Save Copy As...
ru: Сохранить копию как...

source: Print Window
ru: Окно печати

source: Print the current window to the default printer.
ru: Распечатать текущее окно на принтере по умолчанию.

source: Close Window
ru: Закрыть окно

source: Exit IDLE
ru: Выход из IDLE

source: Close all windows and quit IDLE (ask to save unsaved edit windows).
ru: Закройте все окна и выйдите из IDLE (предложите сохранить несохраненные окна редактирования).

source: Undo
ru: Отменить

source: Undo the last change to the current window. A maximum of 1000 changes may be undone.
ru: Отменить последнее изменение в текущем окне. Можно отменить максимум 1000 изменений.

source: Redo
ru: Повторить

source: Redo the last undone change to the current window.
ru: Повторное выполнение последнего отмененного изменения в текущем окне.

source: Cut
ru: Вырезать

source: Copy selection into the system-wide clipboard; then delete the selection.
ru: Скопируйте выделение в общесистемный буфер обмена; затем удалите выделение.

source: Copy
ru: Копировать

source: Copy selection into the system-wide clipboard.
ru: Копирование выделения в общесистемный буфер обмена.

source: Paste
ru: Вставить

source: Insert contents of the system-wide clipboard into the current window.
ru: Вставка содержимого общесистемного буфера обмена в текущее окно.

source: The clipboard functions are also available in context menus.
ru: Буфер обмена функция также доступен в меню контекст.

source: Select All
ru: Выбрать все

source: Select the entire contents of the current window.
ru: Выберите все содержимое текущего окна.

source: Find...
ru: Найти...

source: Open a search dialog with many options
ru: Откройте диалоговое окно поиска с множеством опции

source: Find Again
ru: Найти снова

source: Repeat the last search, if there is one.
ru: Повторите последний поиск, если он был.

source: Find Selection
ru: Найти выделение

source: Search for the currently selected string, if there is one.
ru: Поиск выбранного в данный момент строка, если таковой имеется.

source: Find in Files...
ru: Найти в файлах...

source: Open a file search dialog. Put results in a new output window.
ru: Откройте диалог поиска файлов. Поместите результаты в новое окно вывода.

source: Replace...
ru: Заменить...

source: Open a search-and-replace dialog.
ru: Откройте диалог поиска и замены.

source: Go to Line
ru: Перейти на линию

source: Move the cursor to the beginning of the line requested and make that line visible. A request past the end of the file goes to the end. Clear any selection and update the line and column status.
ru: Переместите курсор в начало запрошенной строки и сделайте эту строку видимой. Запрос за пределами конца файла переходит в конец. Очистите любой выбор и обновите статус строки и столбца.

source: Show Completions
ru: Показать завершения

source: Open a scrollable list allowing selection of existing names. See :ref:`Completions <completions>` in the Editing and navigation section below.
ru: Откройте прокручиваемый список, позволяющий выбирать существующие имена. См. :ref:`Completions ` в разделе Редактирование и навигация ниже.

source: Expand Word
ru: Развернуть Слово

source: Expand a prefix you have typed to match a full word in the same window; repeat to get a different expansion.
ru: Расширьте введенный вами префикс, чтобы он соответствовал полному слову в том же окне; повторите, чтобы получить другое расширение.

source: Show call tip
ru: Показать подсказку по вызову

source: Highlight the surrounding parenthesis.
ru: Выделите окружающие скобки.

source: Format menu (Editor window only)
ru: форматировать меню (только в окне редактора)

source: Indent Region
ru: Отступ области

source: Shift selected lines right by the indent width (default 4 spaces).
ru: Сместить выбранные строки вправо на ширину отступа (по умолчанию 4 пробела).

source: Dedent Region
ru: Убрать Отступы области

source: Shift selected lines left by the indent width (default 4 spaces).
ru: Сместить выбранные строки влево на ширину отступа (по умолчанию 4 пробела).

source: Comment Out Region
ru: Закомментировать

source: Insert ## in front of selected lines.
ru: Вставьте ## перед выделенными строками.

source: Uncomment Region
ru: Некомментируемый регион

source: Remove leading # or ## from selected lines.
ru: Удалить начальные символы # или ## в выбранных строках.

source: Tabify Region
ru: Поставить табуляцию

source: Turn *leading* stretches of spaces into tabs. (Note: We recommend using 4 space blocks to indent Python code.)
ru: Превратите *начальные* пробелы в табуляции. (Примечание: мы рекомендуем использовать 4 пробельных блока для отступа в коде Python.)

source: Untabify Region
ru: Убрать табуляцию

source: Turn *all* tabs into the correct number of spaces.
ru: Превратите *все* символы табуляции в правильное количество пробелов.

source: Toggle Tabs
ru: Переключение вкладок

source: Open a dialog to switch between indenting with spaces and tabs.
ru: Откройте диалоговое окно для переключения между отступами с помощью пробелов и табуляций.

source: New Indent Width
ru: Новая ширина отступа

source: Open a dialog to change indent width. The accepted default by the Python community is 4 spaces.
ru: Откройте диалоговое окно для изменения ширины отступа. Принятое сообществом Python значение по умолчанию — 4 пробела.

source: Format Paragraph
ru: форматировать Параграф

source: Reformat the current blank-line-delimited paragraph in comment block or multiline string or selected line in a string. All lines in the paragraph will be formatted to less than N columns, where N defaults to 72.
ru: Переформатировать текущий абзац, разделенный пустой строкой, в блоке комментариев или многострочной строке или выбранной строке в строке. Все строки в абзаце будут отформатированы в менее чем N столбцов, где N по умолчанию равно 72.

source: Remove trailing space and other whitespace characters after the last non-whitespace character of a line by applying str.rstrip to each line, including lines within multiline strings. Except for Shell windows, remove extra newlines at the end of the file.
ru: Удалите конечный пробел и другие пробельные символы после последнего непробельного символа строки, применив str.rstrip к каждой строке, включая строки внутри многострочных строк. За исключением окон Shell, удалите лишние новые строки в конце файла.

source: Run menu (Editor window only)
ru: Меню "Выполнить" (только в окне редактора)

source: Run Module
ru: Запустить модуль

source: Run... Customized
ru: Запустить... Настроенное

source: Check Module
ru: Проверочный модуль

source: Check the syntax of the module currently open in the Editor window. If the module has not been saved IDLE will either prompt the user to save or autosave, as selected in the General tab of the Idle Settings dialog. If there is a syntax error, the approximate location is indicated in the Editor window.
ru: Проверьте синтаксис модуля, открытого в данный момент в окне редактора. Если модуль не был сохранен, IDLE предложит пользователю сохранить его или сохранить автоматически, как выбрано на вкладке «Общие» диалогового окна «Параметры бездействия». Если есть синтаксическая ошибка, приблизительное местоположение будет указано в окне редактора.

source: Python Shell
ru: Оболочка Python

source: Open or wake up the Python Shell window.
ru: Откройте или выведите на экран окно Python Shell.

source: Shell menu (Shell window only)
ru: командная оболочка меню (только для окнакомандная оболочка )

source: View Last Restart
ru: Просмотр последнего перезапуска

source: Restart Shell
ru: Перезапустить оболочку

source: Previous History
ru: Предыдущая история

source: Next History
ru: Следующая история

source: Cycle through later commands in history which match the current entry.
ru: Просматривать более поздние команды в истории, соответствующие текущей записи.

source: Interrupt Execution
ru: Прерывание выполнения

source: Stop a running program.
ru: Остановите запущенную программу.

source: Debug menu (Shell window only)
ru: Меню отладки (только в окнекомандная оболочка )

source: Go to File/Line
ru: Перейти к файлу/строке

source: Look on the current line. with the cursor, and the line above for a filename and line number. If found, open the file if not already open, and show the line. Use this to view source lines referenced in an exception traceback and lines found by Find in Files. Also available in the context menu of the Shell window and Output windows.
ru: Посмотрите на текущую строку. с курсором, и строку выше для имени файла и номера строки. Если найдено, откройте файл, если он еще не открыт, и покажите строку. Используйте это для просмотра исходных строк, на которые ссылаются в трассировке исключения, и строк, найденных с помощью Find in Files. Также доступно в контекстном меню окна Shell и окон Output.

source: Debugger (toggle)
ru: Отладчик (переключатель)

source: When activated, code entered in the Shell or run from an Editor will run under the debugger. In the Editor, breakpoints can be set with the context menu. This feature is still incomplete and somewhat experimental.
ru: При активации код, введенный в Shell или запущенный из редактора, будет запущен под отладчиком. В редакторе точки останова можно устанавливать с помощью контекстного меню. Эта функция пока неполная и несколько экспериментальная.

source: Stack Viewer
ru: Средство просмотра стеков

source: Show the stack traceback of the last exception in a tree widget, with access to locals and globals.
ru: Показывать трассировку стека последнего исключения в древовидном виджете с доступом к локальным и глобальным переменным.

source: Auto-open Stack Viewer
ru: Автоматическое открытие программы просмотра стека

source: Toggle automatically opening the stack viewer on an unhandled exception.
ru: Включить автоматическое открытие средства просмотра стека при необработанном исключении.

source: Options menu (Shell and Editor)
ru: Опции меню (командная оболочка и Редактор)

source: Configure IDLE
ru: Настройка IDLE

source: Open a configuration dialog and change preferences for the following: fonts, indentation, keybindings, text color themes, startup windows and size, additional help sources, and extensions. On macOS, open the configuration dialog by selecting Preferences in the application menu. For more details, see :ref:`Setting preferences <preferences>` under Help and preferences.
ru: Откройте диалоговое окно конфигурации и измените настройки для следующих параметров: шрифты, отступы, сочетания клавиш, темы цветов текста, окна запуска и их размер, дополнительные источники справки и расширения. В macOS откройте диалоговое окно конфигурации, выбрав «Настройки» в меню приложения. Для получения более подробной информации см. :ref:`Настройка настроек `<preferences> в разделе «Справка и настройки».

source: Most configuration options apply to all windows or all future windows. The option items below only apply to the active window.
ru: Большинство параметров конфигурации применяются ко всем окнам или всем будущим окнам. Элементы параметров ниже применяются только к активному окну.

source: Show/Hide Code Context (Editor Window only)
ru: Показать/скрыть контекст кода (только в окне редактора)

source: Show/Hide Line Numbers (Editor Window only)
ru: Показать/скрыть номера строк (только в окне редактора)

source: Open a column to the left of the edit window which shows the number of each line of text. The default is off, which may be changed in the preferences (see :ref:`Setting preferences <preferences>`).
ru: Открыть столбец слева от окна редактирования, который показывает номер каждой строки текста. По умолчанию отключено, что можно изменить в настройках (см. :ref:`Настройка настроек <preferences>`).

source: Zoom/Restore Height
ru: Увеличение/восстановление высоты

source: Toggles the window between normal size and maximum height. The initial size defaults to 40 lines by 80 chars unless changed on the General tab of the Configure IDLE dialog. The maximum height for a screen is determined by momentarily maximizing a window the first time one is zoomed on the screen. Changing screen settings may invalidate the saved height. This toggle has no effect when a window is maximized.
ru: Переключает окно между нормальным размером и максимальной высотой. Начальный размер по умолчанию составляет 40 строк на 80 символов, если не изменен на вкладке «Общие» диалогового окна «Настройка IDLE». Максимальная высота экрана определяется путем мгновенного развертывания окна при первом масштабировании на экране. Изменение настроек экрана может сделать сохраненную высоту недействительной. Это переключение не действует, когда окно развернуто.

source: Window menu (Shell and Editor)
ru: Меню окна (командная оболочка и Редактор)

source: Lists the names of all open windows; select one to bring it to the foreground (deiconifying it if necessary).
ru: Выводит список названий всех открытых окон; выберите одно из них, чтобы вывести его на передний план (при необходимости деиконизировав).

source: Help menu (Shell and Editor)
ru: Меню справки (командная оболочка и редактор)

source: About IDLE
ru: Об IDLE

source: IDLE Help
ru: Справка по IDLE

source: Display this IDLE document, detailing the menu options, basic editing and navigation, and other tips.
ru: Покажите этот документ IDLE, в котором подробно описаны параметры меню, основы редактирования и навигации, а также другие советы.

source: Access local Python documentation, if installed, or start a web browser and open docs.python.org showing the latest Python documentation.
ru: Откройте локальную документацию Python, если она установлена, или запустите веб-браузер и откройте docs.python.org, на котором отображается последняя версия документации Python.

source: Turtle Demo
ru: Демо Turtle

source: Run the turtledemo module with example Python code and turtle drawings.
ru: Запустите модуль turtledemo с примером кода Python и рисунками черепахи.

source: Additional help sources may be added here with the Configure IDLE dialog under the General tab. See the :ref:`Help sources <help-sources>` subsection below for more on Help menu choices.
ru: Дополнительные источники справки можно добавить здесь с помощью диалога Configure IDLE на вкладке General. Подробнее о вариантах меню Help см. в подразделе :ref:`Help sources` <help-sources>ниже.

source: Context Menus
ru: Контекстные меню

source: Open a context menu by right-clicking in a window (Control-click on macOS). Context menus have the standard clipboard functions also on the Edit menu.
ru: Откройте контекстное меню, щелкнув правой кнопкой мыши в окне (Control-клик в macOS). Контекстные меню имеют стандартные функции буфера обмена также в меню «Правка».

source: Set Breakpoint
ru: Установить точку останова

source: Set a breakpoint on the current line.
ru: Установите точку останова на текущей строке.

source: Clear Breakpoint
ru: Очистить точку останова

source: Clear the breakpoint on that line.
ru: Снимите точку останова на этой строке.

source: Shell and Output windows also have the following.
ru: В окнах Shell и Output также есть следующее.

source: Go to file/line
ru: Перейдите к файлу/строке

source: Same as in Debug menu.
ru: То же, что и в меню Отладка.

source: The Shell window also has an output squeezing facility explained in the *Python Shell window* subsection below.
ru: Окно оболочки также имеет функцию сжатия выходных данных, описанную в подразделе *Окно оболочки Python* ниже.

source: Squeeze
ru: Сжать

source: If the cursor is over an output line, squeeze all the output between the code above and the prompt below down to a 'Squeezed text' label.
ru: Если курсор находится над строкой вывода, сожмите весь вывод между кодом выше и подсказкой ниже до метки «Сжатый текст».

source: Editing and navigation
ru: Редактирование и навигация

source: Editor windows
ru: Окна редактора

source: IDLE may open editor windows when it starts, depending on settings and how you start IDLE. Thereafter, use the File menu. There can be only one open editor window for a given file.
ru: IDLE может открывать окна редактора при запуске, в зависимости от настроек и способа запуска IDLE. После этого используйте меню Файл. Для данного файла может быть открыто только одно окно редактора.

source: The title bar contains the name of the file, the full path, and the version of Python and IDLE running the window. The status bar contains the line number ('Ln') and column number ('Col'). Line numbers start with 1; column numbers with 0.
ru: Строка заголовка содержит имя файла, полный путь и версию Python и IDLE, на которых запущено окно. Строка состояния содержит номер строки ('Ln') и номер столбца ('Col'). Номера строк начинаются с 1; номера столбцов с 0.

source: IDLE assumes that files with a known .py* extension contain Python code and that other files do not. Run Python code with the Run menu.
ru: IDLE предполагает, что файлы с известным расширением .py* содержат код Python, а другие файлы — нет. Запустите код Python с помощью меню «Выполнить».

source: Key bindings
ru: Привязка клавиш

source: See also the indent/dedent region commands on the :ref:`Format menu <format-menu>`.
ru: См. также команды отступа/уменьшения отступа в меню :ref:`Формат`.

source: Completions
ru: Завершения

source: When editing code in an editor (as oppose to Shell), increase the available module-level names by running your code and not restarting the Shell thereafter. This is especially useful after adding imports at the top of a file. This also increases possible attribute completions.
ru: При редактировании кода в редакторе (в отличие от Shell) увеличьте доступные имена на уровне модуля, запустив свой код и не перезапуская Shell после этого. Это особенно полезно после добавления импортов в начало файла. Это также увеличивает возможные завершения атрибутов.

source: Calltips
ru: Подсказки по вызову

source: The calltip consists of the function's signature and docstring up to the latter's first blank line or the fifth non-blank line. (Some builtin functions lack an accessible signature.) A '/' or '*' in the signature indicates that the preceding or following arguments are passed by position or name (keyword) only. Details are subject to change.
ru: Подсказка вызова состоит из сигнатуры функции и строки документации до первой пустой строки последней или пятой непустой строки. (Некоторые встроенные функции не имеют доступной сигнатуры.) Символы '/' или '*' в сигнатуре указывают, что предшествующие или последующие аргументы передаются только по позиции или имени (ключевое слово). Подробности могут быть изменены.

source: In Shell, the accessible functions depends on what modules have been imported into the user process, including those imported by Idle itself, and which definitions have been run, all since the last restart.
ru: В Shell доступные функции зависят от того, какие модули были импортированы в пользовательский процесс, включая импортированные самим Idle, и какие определения были запущены с момента последнего перезапуска.

source: Code Context
ru: Контекст кода

source: Python Shell window
ru: Окно оболочки Python

source: Command history
ru: История команд

source: Text colors
ru: Цвета текста

source: Command line usage
ru: Использование командной строки

source: Startup failure
ru: Сбой при запуске
