Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/idle.po
Languages: ru

source: A common cause of failure is a user-written file with the same name as a standard library module, such as *random.py* and *tkinter.py*. When such a file is located in the same directory as a file that is about to be run, IDLE cannot import the stdlib file. The current fix is to rename the user file.
ru: Распространенной причиной сбоя является пользовательский файл с тем же именем, что и у стандартного библиотечного модуля, например *random.py* и *tkinter.py*. Когда такой файл находится в том же каталоге, что и файл, который должен быть запущен, IDLE не может импортировать файл stdlib. Текущее исправление — переименовать пользовательский файл.

source: Though less common than in the past, an antivirus or firewall program may stop the connection. If the program cannot be taught to allow the connection, then it must be turned off for IDLE to work. It is safe to allow this internal connection because no data is visible on external ports. A similar problem is a network mis-configuration that blocks connections.
ru: Хотя это встречается реже, чем раньше, антивирус или брандмауэр могут остановить соединение. Если программу нельзя научить разрешать соединение, то ее необходимо отключить, чтобы IDLE работал. Безопасно разрешить это внутреннее соединение, поскольку на внешних портах не видны никакие данные. Похожая проблема — неправильная конфигурация сети, которая блокирует соединения.

source: Python installation issues occasionally stop IDLE: multiple versions can clash, or a single installation might need admin access. If one undo the clash, or cannot or does not want to run as admin, it might be easiest to completely remove Python and start over.
ru: Проблемы с установкой Python иногда останавливают IDLE: несколько версий могут конфликтовать, или для одной установки может потребоваться доступ администратора. Если кто-то отменяет конфликт или не может или не хочет работать как администратор, может быть проще полностью удалить Python и начать заново.

source: A zombie pythonw.exe process could be a problem. On Windows, use Task Manager to check for one and stop it if there is. Sometimes a restart initiated by a program crash or Keyboard Interrupt (control-C) may fail to connect. Dismissing the error box or using Restart Shell on the Shell menu may fix a temporary problem.
ru: Процесс zombie pythonw.exe может быть проблемой. В Windows используйте диспетчер задач, чтобы проверить его и остановить, если он есть. Иногда перезагрузка, инициированная сбоем программы или прерыванием клавиатуры (control-C), может не подключиться. Закрытие окна с ошибкой или использование Restart Shell в меню Shell может устранить временную проблему.

source: Running user code
ru: Запуск пользовательского кода

source: Developing tkinter applications
ru: Разработка приложений для tkinter

source: Help sources
ru: Источники справки

source: Setting preferences
ru: Настройка предпочтений

source: IDLE on macOS
ru: IDLE на macOS

source: Under System Preferences: Dock, one can set "Prefer tabs when opening documents" to "Always". This setting is not compatible with the tk/tkinter GUI framework used by IDLE, and it breaks a few IDLE features.
ru: В разделе Системные настройки: Dock можно установить для параметра "Предпочитать вкладки при открытии документов" значение "Всегда". Этот параметр несовместим с графическим интерфейсом tk/tkinter, используемым IDLE, и нарушает некоторые функции IDLE.

source: Extensions
ru: Расширение

source: IDLE contains an extension facility. Preferences for extensions can be changed with the Extensions tab of the preferences dialog. See the beginning of config-extensions.def in the idlelib directory for further information. The only current default extension is zzdummy, an example also used for testing.
ru: IDLE содержит функцию расширения. Настройки для расширений можно изменить на вкладке "Расширения" диалогового окна "Настройки". Смотрите начало раздела "Конфигурация-расширения".дополнительную информацию можно найти в каталоге idlelib. Единственным текущим расширением по умолчанию является zzdummy, пример которого также используется для тестирования.
