Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/importlib.resources.po
Languages: ru

source: :mod:`!importlib.resources` -- Package resource reading, opening and access
ru: :mod:`!importlib.resources` -- Чтение, открытие и доступ к ресурсам пакета

source: **Source code:** :source:`Lib/importlib/resources/__init__.py`
ru: **исходный код:** :source:`Lib/importlib/resources/__init__.py`

source: This module leverages Python's import system to provide access to *resources* within *packages*.
ru: Этот модуль использует систему импорта Python для предоставления доступа к *ресурсам* внутри *пакетов*.

source: "Resources" are file-like resources associated with a module or package in Python. The resources may be contained directly in a package, within a subdirectory contained in that package, or adjacent to modules outside a package. Resources may be text or binary. As a result, Python module sources (.py) of a package and compilation artifacts (pycache) are technically de-facto resources of that package. In practice, however, resources are primarily those non-Python artifacts exposed specifically by the package author.
ru: «Ресурсы» — это файловые ресурсы, связанные с модулем или пакетом в Python. Ресурсы могут содержаться непосредственно в пакете, в подкаталоге, содержащемся в этом пакете, или рядом с модулями вне пакета. Ресурсы могут быть текстовыми или двоичными. В результате исходные коды модулей Python (.py) пакета и артефакты компиляции (pycache) технически де-факто являются ресурсами этого пакета. Однако на практике ресурсы — это в первую очередь артефакты, не относящиеся к Python, специально предоставленные автором пакета.

source: Resources can be opened or read in either binary or text mode.
ru: Ресурсы можно открывать или читать как в двоичном, так и в текстовом режиме.

source: Resources are roughly akin to files inside directories, though it's important to keep in mind that this is just a metaphor. Resources and packages **do not** have to exist as physical files and directories on the file system: for example, a package and its resources can be imported from a zip file using :py:mod:`zipimport`.
ru: Ресурсы примерно аналогичны файлам внутри каталогов, хотя важно помнить, что это всего лишь метафора. Ресурсы и пакеты **не** должны существовать в виде физических файлов и каталогов в файловой системе: например, пакет и его ресурсы можно импортировать из zip-файла с помощью :py:mod:`zipimport`.

source: This module provides functionality similar to `pkg_resources <https://setuptools.readthedocs.io/en/latest/pkg_resources.html>`_ `Basic Resource Access <https://setuptools.readthedocs.io/en/latest/pkg_resources.html#basic-resource-access>`_ without the performance overhead of that package. This makes reading resources included in packages easier, with more stable and consistent semantics.
ru: Этот модуль предоставляет функциональность, аналогичную `pkg_resources <https://setuptools.readthedocs.io/en/latest/pkg_resources.html>`_ `Basic Resource Access <https://setuptools.readthedocs.io/en/latest/pkg_resources. html#basic-resource-access>`_ без снижения производительности этого пакета. Это упрощает чтение ресурсов, включенных в пакеты, с более стабильной и последовательной семантикой.

source: The standalone backport of this module provides more information on `using importlib.resources <https://importlib-resources.readthedocs.io/en/latest/using.html>`_ and `migrating from pkg_resources to importlib.resources <https://importlib-resources.readthedocs.io/en/latest/migration.html>`_.
ru: Автономный резервный порт этого модуля предоставляет дополнительную информацию об использовании importlib.resources <https://importlib-resources.readthedocs.io/en/latest/using.html>`_ и `_ переходе с pkg_resources на importlib.resources <https: //importlib-resources.readthedocs.io/en/latest/migration.html>`_.

source: :class:`Loaders <importlib.abc.Loader>` that wish to support resource reading should implement a ``get_resource_reader(fullname)`` method as specified by :class:`importlib.resources.abc.ResourceReader`.
ru: :class:`Загрузчики <importlib.abc.Loader>`, которые хотят поддерживать чтение ресурсов, должны реализовать метод ``get_resource_reader(fullname)``, как указано в :class:`importlib.resources.abc.ResourceReader`.

source: Represents an anchor for resources, either a :class:`module object <types.ModuleType>` or a module name as a string. Defined as ``Union[str, ModuleType]``.
ru: Представляет привязку для ресурсов: объект модуля <types.ModuleType> или имя модуля в виде строки. Определяется как ``Union[str, ModuleType]``.

source: Returns a :class:`~importlib.resources.abc.Traversable` object representing the resource container (think directory) and its resources (think files). A Traversable may contain other containers (think subdirectories).
ru: Возвращает объект :class:`~importlib.resources.abc.Traversable`, представляющий контейнер ресурсов (каталог think) и его ресурсы (файлы think). Traversable может содержать другие контейнеры (например, подкаталоги).

source: *anchor* is an optional :class:`Anchor`. If the anchor is a package, resources are resolved from that package. If a module, resources are resolved adjacent to that module (in the same package or the package root). If the anchor is omitted, the caller's module is used.
ru: *anchor* — необязательный :class:`Anchor`. Если привязкой является пакет, ресурсы разрешаются из этого пакета. Если это модуль, ресурсы разрешаются рядом с этим модулем (в том же пакете или в корне пакета). Если привязка опущена, используется модуль вызывающего объекта.

source: *package* parameter was renamed to *anchor*. *anchor* can now be a non-package module and if omitted will default to the caller's module. *package* is still accepted for compatibility but will raise a :exc:`DeprecationWarning`. Consider passing the anchor positionally or using ``importlib_resources >= 5.10`` for a compatible interface on older Pythons.
ru: Параметр *package* переименован в *anchor*. *anchor* теперь может быть модулем, не относящимся к пакету, и, если он опущен, по умолчанию будет использоваться модуль вызывающего объекта. *package* по-прежнему принимается для совместимости, но вызывает предупреждение :exc:`DeprecationWarning`. Рассмотрите возможность передачи привязки позиционно или использования importlib_resources >= 5.10 для совместимого интерфейса на старых Python.

source: Given a :class:`~importlib.resources.abc.Traversable` object representing a file or directory, typically from :func:`importlib.resources.files`, return a context manager for use in a :keyword:`with` statement. The context manager provides a :class:`pathlib.Path` object.
ru: Учитывая объект :class:`~importlib.resources.abc.Traversable`, представляющий файл или каталог, обычно из :func:`importlib.resources.files`, возвращает менеджер контекста для использования в операторе :keyword:`with` . Менеджер контекста предоставляет объект :class:`pathlib.Path`.

source: Exiting the context manager cleans up any temporary file or directory created when the resource was extracted from e.g. a zip file.
ru: Выход из контекстного менеджера очищает любой временный файл или каталог, созданный при извлечении ресурса, например, из zip-файла.

source: Use ``as_file`` when the Traversable methods (``read_text``, etc) are insufficient and an actual file or directory on the file system is required.
ru: Используйте as_file, когда методы Traversable («read_text» и т. д.) недостаточны и требуется реальный файл или каталог в файловой системе.

source: Added support for *traversable* representing a directory.
ru: Добавлена ​​поддержка *traversable*, представляющего каталог.

source: Deprecated functions
ru: Устаревшие функции

source: An older, deprecated set of functions is still available, but is scheduled for removal in a future version of Python. The main drawback of these functions is that they do not support directories: they assume all resources are located directly within a *package*.
ru: Старый устаревший набор функций по-прежнему доступен, но его планируется удалить в будущей версии Python. Основным недостатком этих функций является то, что они не поддерживают каталоги: они предполагают, что все ресурсы расположены непосредственно внутри *пакета*.

source: Whenever a function accepts a ``Package`` argument, you can pass in either a :class:`module object <types.ModuleType>` or a module name as a string. You can only pass module objects whose ``__spec__.submodule_search_locations`` is not ``None``.
ru: Всякий раз, когда функция принимает аргумент «Пакет», вы можете передать либо объект модуля <types.ModuleType>, либо имя модуля в виде строки. Вы можете передавать только объекты модулей, для которых ``__spec__.submodule_search_locations`` не имеет значения ``None``.

source: The ``Package`` type is defined as ``Union[str, ModuleType]``.
ru: Тип Package определяется как Union[str, ModuleType]``.

source: For *resource* arguments of the functions below, you can pass in the name of a resource as a string or a :class:`path-like object <os.PathLike>`.
ru: В качестве аргументов *resource* функций, указанных ниже, вы можете передать имя ресурса в виде строки или :class:`path-подобного объекта <os.PathLike>`.

source: The ``Resource`` type is defined as ``Union[str, os.PathLike]``.
ru: Тип Resource определяется как Union[str, os.PathLike]``.

source: Open for binary reading the *resource* within *package*.
ru: Открыть для двоичного чтения *ресурса* внутри *пакета*.

source: *package* is either a name or a module object which conforms to the ``Package`` requirements. *resource* is the name of the resource to open within *package*; it may not contain path separators and it may not have sub-resources (i.e. it cannot be a directory). This function returns a ``typing.BinaryIO`` instance, a binary I/O stream open for reading.
ru: *package* — это либо имя, либо объект модуля, который соответствует требованиям ``Package``. *resource* — имя ресурса, который нужно открыть в *package*; он не может содержать разделителей путей и не может иметь подресурсов (т. е. он не может быть каталогом). Эта функция возвращает экземпляр typing.BinaryIO, двоичный поток ввода-вывода, открытый для чтения.

source: Calls to this function can be replaced by::
ru: Вызовы этой функции можно заменить на::

source: Open for text reading the *resource* within *package*. By default, the resource is opened for reading as UTF-8.
ru: Открыть для чтения текста *ресурса* внутри *пакета*. По умолчанию ресурс открыт для чтения в формате UTF-8.

source: *package* is either a name or a module object which conforms to the ``Package`` requirements. *resource* is the name of the resource to open within *package*; it may not contain path separators and it may not have sub-resources (i.e. it cannot be a directory). *encoding* and *errors* have the same meaning as with built-in :func:`open`.
ru: *package* — это либо имя, либо объект модуля, который соответствует требованиям ``Package``. *resource* — имя ресурса, который нужно открыть в *package*; он не может содержать разделителей путей и не может иметь подресурсов (т. е. он не может быть каталогом). *кодирование* и *ошибки* имеют то же значение, что и встроенная функция :func:`open`.

source: This function returns a ``typing.TextIO`` instance, a text I/O stream open for reading.
ru: Эта функция возвращает экземпляр typing.TextIO, текстовый поток ввода-вывода, открытый для чтения.

source: files(package).joinpath(resource).open('r', encoding=encoding)
ru: файлы (пакет).joinpath(ресурс).open('r',coding=encoding)

source: Read and return the contents of the *resource* within *package* as ``bytes``.
ru: Прочитайте и верните содержимое *ресурса* внутри *пакета* в виде ``байтов``.

source: *package* is either a name or a module object which conforms to the ``Package`` requirements. *resource* is the name of the resource to open within *package*; it may not contain path separators and it may not have sub-resources (i.e. it cannot be a directory). This function returns the contents of the resource as :class:`bytes`.
ru: *package* — это либо имя, либо объект модуля, который соответствует требованиям ``Package``. *resource* — имя ресурса, который нужно открыть в *package*; он не может содержать разделителей путей и не может иметь подресурсов (т. е. он не может быть каталогом). Эта функция возвращает содержимое ресурса в виде :class:`bytes`.

source: Read and return the contents of *resource* within *package* as a ``str``. By default, the contents are read as strict UTF-8.
ru: Прочитайте и верните содержимое *resource* внутри *package* как ``str``. По умолчанию содержимое читается как строгий UTF-8.

source: *package* is either a name or a module object which conforms to the ``Package`` requirements. *resource* is the name of the resource to open within *package*; it may not contain path separators and it may not have sub-resources (i.e. it cannot be a directory). *encoding* and *errors* have the same meaning as with built-in :func:`open`. This function returns the contents of the resource as :class:`str`.
ru: *package* — это либо имя, либо объект модуля, который соответствует требованиям ``Package``. *resource* — имя ресурса, который нужно открыть в *package*; он не может содержать разделителей путей и не может иметь подресурсов (т. е. он не может быть каталогом). *кодирование* и *ошибки* имеют то же значение, что и встроенная функция :func:`open`. Эта функция возвращает содержимое ресурса в виде :class:`str`.

source: Return the path to the *resource* as an actual file system path. This function returns a context manager for use in a :keyword:`with` statement. The context manager provides a :class:`pathlib.Path` object.
ru: Верните путь к *ресурсу* как фактический путь к файловой системе. Эта функция возвращает менеджер контекста для использования в операторе :keyword:`with`. Менеджер контекста предоставляет объект :class:`pathlib.Path`.

source: Exiting the context manager cleans up any temporary file created when the resource needs to be extracted from e.g. a zip file.
ru: Выход из контекстного менеджера очищает любой временный файл, созданный, когда ресурс необходимо извлечь, например, из zip-файла.

source: *package* is either a name or a module object which conforms to the ``Package`` requirements. *resource* is the name of the resource to open within *package*; it may not contain path separators and it may not have sub-resources (i.e. it cannot be a directory).
ru: *package* — это либо имя, либо объект модуля, который соответствует требованиям ``Package``. *resource* — имя ресурса, который нужно открыть в *package*; он не может содержать разделителей путей и не может иметь подресурсов (т. е. он не может быть каталогом).

source: Calls to this function can be replaced using :func:`as_file`::
ru: Вызовы этой функции можно заменить с помощью :func:`as_file`::

source: Return ``True`` if there is a resource named *name* in the package, otherwise ``False``. This function does not consider directories to be resources. *package* is either a name or a module object which conforms to the ``Package`` requirements.
ru: Возвращайте ``True``, если в пакете есть ресурс с именем *name*, в противном случае ``False``. Эта функция не считает каталоги ресурсами. *package* — это либо имя, либо объект модуля, который соответствует требованиям ``Package``.

source: Return an iterable over the named items within the package. The iterable returns :class:`str` resources (e.g. files) and non-resources (e.g. directories). The iterable does not recurse into subdirectories.
ru: Возвращает итерацию по именованным элементам внутри пакета. Итерируемый объект возвращает ресурсы :class:`str` (например, файлы) и нересурсы (например, каталоги). Итерация не рекурсивно переходит в подкаталоги.

source: *package* is either a name or a module object which conforms to the ``Package`` requirements.
ru: *package* — это либо имя, либо объект модуля, который соответствует требованиям ``Package``.
