Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/importlib.metadata.po
Languages: ru, uk

source: :mod:`!importlib.metadata` -- Accessing package metadata
ru: :mod:`!importlib.metadata` -- Доступ к метаданным пакета

source: ``importlib.metadata`` is no longer provisional.
ru: ``importlib.metadata`` больше не является временным.

source: **Source code:** :source:`Lib/importlib/metadata/__init__.py`
ru: **Исходный код:** :source:`Lib/importlib/metadata/__init__.py`

source: ``importlib.metadata`` is a library that provides access to the metadata of an installed `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_, such as its entry points or its top-level names (`Import Package <https://packaging.python.org/en/latest/glossary/#term-Import-Package>`_\s, modules, if any). Built in part on Python's import system, this library intends to replace similar functionality in the `entry point API`_ and `metadata API`_ of ``pkg_resources``. Along with :mod:`importlib.resources`, this package can eliminate the need to use the older and less efficient ``pkg_resources`` package.
ru: ``importlib.metadata`` — это библиотека, которая обеспечивает доступ к метаданным установленного ``Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_, например в качестве точек входа или имен верхнего уровня (`Import Package <https://packaging.python.org/en/latest/glossary/#term-Import-Package>`_\s, модули, если таковые имеются). Эта библиотека, частично созданная на основе системы импорта Python, призвана заменить аналогичную функциональность в `` API точки входа`_ и `API метаданных`_ ``pkg_resources``. Вместе с :mod:`importlib.resources` этот пакет может устранить необходимость использования более старого и менее эффективного пакета ``pkg_resources``.

source: ``importlib.metadata`` operates on third-party *distribution packages* installed into Python's ``site-packages`` directory via tools such as :pypi:`pip`. Specifically, it works with distributions with discoverable ``dist-info`` or ``egg-info`` directories, and metadata defined by the `Core metadata specifications <https://packaging.python.org/en/latest/specifications/core-metadata/#core-metadata>`_.
ru: ``importlib.metadata`` работает со сторонними *дистрибутивами*, установленными в каталог ``site-packages`` Python с помощью таких инструментов, как :pypi:`pip`. В частности, он работает с дистрибутивами с обнаруживаемыми каталогами ``dist-info`` или ``egg-info``, а также метаданными, определенными ``Основными спецификациями метаданных'' <https://packaging.python.org/en/latest/specifications. /core-metadata/#core-metadata>`_.

source: These are *not* necessarily equivalent to or correspond 1:1 with the top-level *import package* names that can be imported inside Python code. One *distribution package* can contain multiple *import packages* (and single modules), and one top-level *import package* may map to multiple *distribution packages* if it is a namespace package. You can use :ref:`package_distributions() <package-distributions>` to get a mapping between them.
ru: Они *не* обязательно эквивалентны или соответствуют 1:1 именам *импортных пакетов* верхнего уровня, которые можно импортировать внутри кода Python. Один *дистрибутивный пакет* может содержать несколько *импортных пакетов* (и отдельных модулей), а один *импортный пакет* верхнего уровня может сопоставляться с несколькими *дистрибутивными пакетами*, если это пакет пространства имен. Вы можете использовать :ref:`package_distributions() <package-distributions>`, чтобы получить сопоставление между ними.

source: By default, distribution metadata can live on the file system or in zip archives on :data:`sys.path`. Through an extension mechanism, the metadata can live almost anywhere.
ru: По умолчанию метаданные дистрибутива могут находиться в файловой системе или в zip-архивах по адресу :data:`sys.path`. Благодаря механизму расширения метаданные могут находиться практически где угодно.

source: The documentation for ``importlib_metadata``, which supplies a backport of ``importlib.metadata``. This includes an `API reference <https://importlib-metadata.readthedocs.io/en/latest/api.html>`__ for this module's classes and functions, as well as a `migration guide <https://importlib-metadata.readthedocs.io/en/latest/migration.html>`__ for existing users of ``pkg_resources``.
ru: Документация для importlib_metadata, которая предоставляет резервную копию importlib.metadata. Сюда входит `ссылка на API <https://importlib-metadata.readthedocs.io/en/latest/api.html>`__ для классов и функций этого модуля, а также `руководство по миграции <https://importlib- Metadata.readthedocs.io/en/latest/migration.html>`__ для существующих пользователей ``pkg_resources``.

source: Overview
ru: Обзор
uk: Огляд

source: Let's say you wanted to get the version string for a `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_ you've installed using ``pip``. We start by creating a virtual environment and installing something into it:
ru: Допустим, вы хотите получить строку версии для `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_, который вы установили с помощью ``pip`` . Начнем с создания виртуальной среды и установки в нее чего-нибудь:

source: You can get the version string for ``wheel`` by running the following:
ru: Вы можете получить строку версии для ``wheel``, выполнив следующую команду:
uk: Ви можете отримати рядок версії для ``wheel``, виконавши наступне:

source: You can also get a collection of entry points selectable by properties of the EntryPoint (typically 'group' or 'name'), such as ``console_scripts``, ``distutils.commands`` and others. Each group contains a collection of :ref:`EntryPoint <entry-points>` objects.
ru: Вы также можете получить коллекцию точек входа, выбираемых по свойствам EntryPoint (обычно «группа» или «имя»), таким как «console_scripts», «distutils.commands» и другие. Каждая группа содержит коллекцию объектов :ref:`EntryPoint <entry-points>`.

source: You can get the :ref:`metadata for a distribution <metadata>`::
ru: Вы можете получить :ref:`метаданные для дистрибутива <metadata>`::
uk: Ви можете отримати :ref:`метадані для дистрибутива <metadata>`::

source: You can also get a :ref:`distribution's version number <version>`, list its :ref:`constituent files <files>`, and get a list of the distribution's :ref:`requirements`.
ru: Вы также можете получить :ref:`номер версии дистрибутива <version>`, перечислить его :ref:`составляющие файлы <files>` и получить список :ref:`требований` дистрибутива.
uk: Ви також можете отримати :ref:`номер версії дистрибутива <version>`, перелічити його :ref:`складові файли <files>` та отримати список :ref:`requirements` дистрибутива.

source: Subclass of :class:`ModuleNotFoundError` raised by several functions in this module when queried for a distribution package which is not installed in the current Python environment.
ru: Подкласс :class:`ModuleNotFoundError`, вызываемый несколькими функциями в этом модуле при запросе дистрибутивного пакета, который не установлен в текущей среде Python.

source: Functional API
ru: функциональный API
uk: Функціональний API

source: This package provides the following functionality via its public API.
ru: Этот пакет предоставляет следующие функции через свой общедоступный API.
uk: Цей пакет забезпечує такі функції через свій загальнодоступний API.

source: Entry points
ru: Точки входа
uk: Точки входу

source: Returns a :class:`EntryPoints` instance describing entry points for the current environment. Any given keyword parameters are passed to the :meth:`!select` method for comparison to the attributes of the individual entry point definitions.
ru: Возвращает экземпляр :class:`EntryPoints`, описывающий точки входа для текущей среды. Любые заданные параметры ключевого слова передаются методу :meth:`!select` для сравнения с атрибутами определений отдельных точек входа.

source: Note: it is not currently possible to query for entry points based on their :attr:`!EntryPoint.dist` attribute (as different :class:`!Distribution` instances do not currently compare equal, even if they have the same attributes)
ru: Примечание. В настоящее время невозможно выполнить запрос точек входа на основе их атрибута :attr:`!EntryPoint.dist` (поскольку разные экземпляры :class:`!Distribution` в настоящее время не сравниваются равными, даже если они имеют одинаковые атрибуты).

source: Details of a collection of installed entry points.
ru: Подробная информация о коллекции установленных точек входа.

source: Also provides a ``.groups`` attribute that reports all identifed entry point groups, and a ``.names`` attribute that reports all identified entry point names.
ru: Также предоставляет атрибут .groups, который сообщает обо всех идентифицированных группах точек входа, и атрибут .names, который сообщает обо всех идентифицированных именах точек входа.

source: Details of an installed entry point.
ru: Подробная информация об установленной точке входа.

source: Each :class:`!EntryPoint` instance has ``.name``, ``.group``, and ``.value`` attributes and a ``.load()`` method to resolve the value. There are also ``.module``, ``.attr``, and ``.extras`` attributes for getting the components of the ``.value`` attribute, and ``.dist`` for obtaining information regarding the distribution package that provides the entry point.
ru: Каждый экземпляр :class:`!EntryPoint` имеет атрибуты .name, .group и .value, а также метод .load() для разрешения значения. Существуют также атрибуты .module, .attr и .extras для получения компонентов атрибута .value и .dist для получения информации о пакет распространения, предоставляющий точку входа.

source: Query all entry points::
ru: Запросить все точки входа::

source: The :func:`!entry_points` function returns a :class:`!EntryPoints` object, a collection of all :class:`!EntryPoint` objects with ``names`` and ``groups`` attributes for convenience::
ru: Функция :func:`!entry_points` возвращает объект :class:`!EntryPoints`, коллекцию всех объектов :class:`!EntryPoint` с атрибутами ``names`` и ``groups`` для удобства::

source: :class:`!EntryPoints` has a :meth:`!select` method to select entry points matching specific properties. Select entry points in the ``console_scripts`` group::
ru: :class:`!EntryPoints` имеет метод :meth:`!select` для выбора точек входа, соответствующих определенным свойствам. Выберите точки входа в группе console_scripts::

source: Equivalently, since :func:`!entry_points` passes keyword arguments through to select::
ru: Аналогично, поскольку :func:`!entry_points` передает аргументы ключевого слова в select::

source: Pick out a specific script named "wheel" (found in the wheel project)::
ru: Выберите конкретный скрипт с именем «колесо» (находится в проекте колеса)::

source: Equivalently, query for that entry point during selection::
ru: Аналогично, запросите эту точку входа во время выбора::

source: Inspect the resolved entry point::
ru: Проверьте решенную точку входа::

source: The ``group`` and ``name`` are arbitrary values defined by the package author and usually a client will wish to resolve all entry points for a particular group. Read `the setuptools docs <https://setuptools.pypa.io/en/latest/userguide/entry_point.html>`_ for more information on entry points, their definition, and usage.
ru: «Группа» и «имя» — это произвольные значения, определенные автором пакета, и обычно клиент желает разрешить все точки входа для определенной группы. Прочтите документацию по setuptools <https://setuptools.pypa.io/en/latest/userguide/entry_point.html>`_ для получения дополнительной информации о точках входа, их определении и использовании.

source: *Compatibility Note*
ru: *Примечание о совместимости*

source: The "selectable" entry points were introduced in ``importlib_metadata`` 3.6 and Python 3.10. Prior to those changes, ``entry_points`` accepted no parameters and always returned a dictionary of entry points, keyed by group. With ``importlib_metadata`` 5.0 and Python 3.12, ``entry_points`` always returns an ``EntryPoints`` object. See :pypi:`backports.entry_points_selectable` for compatibility options.
ru: «Выбираемые» точки входа были представлены в importlib_metadata 3.6 и Python 3.10. До этих изменений ``entry_points`` не принимал никаких параметров и всегда возвращал словарь точек входа, объединенных по группам. В ``importlib_metadata`` 5.0 и Python 3.12 ``entry_points`` всегда возвращает объект ``EntryPoints``. См. :pypi:`backports.entry_points_selectable` для опций совместимости.

source: Distribution metadata
ru: Метаданные распространения
uk: Метадані розповсюдження

source: Return the distribution metadata corresponding to the named distribution package as a :class:`PackageMetadata` instance.
ru: Верните метаданные распространения, соответствующие указанному дистрибутивному пакету, в виде экземпляра :class:`PackageMetadata`.

source: Raises :exc:`PackageNotFoundError` if the named distribution package is not installed in the current Python environment.
ru: Вызывает :exc:`PackageNotFoundError`, если указанный дистрибутив не установлен в текущей среде Python.

source: In addition to providing the defined protocol methods and attributes, subscripting the instance is equivalent to calling the :meth:`!get` method.
ru: Помимо предоставления определенных методов и атрибутов протокола, подписка на экземпляр эквивалентна вызову метода :meth:`!get`.

source: Every `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_ includes some metadata, which you can extract using the :func:`!metadata` function::
ru: Каждый `Дистрибутивный пакет <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_ ​​включает в себя некоторые метаданные, которые вы можете извлечь с помощью функции :func:`!metadata`::

source: The keys of the returned data structure name the metadata keywords, and the values are returned unparsed from the distribution metadata::
ru: Ключи возвращаемой структуры данных называют ключевые слова метаданных, а значения возвращаются без анализа из метаданных распределения:

source: :class:`PackageMetadata` also presents a :attr:`!json` attribute that returns all the metadata in a JSON-compatible form per :PEP:`566`::
ru: :class:`PackageMetadata` также представляет атрибут :attr:`!json`, который возвращает все метаданные в JSON-совместимой форме согласно :PEP:`566`::

source: The full set of available metadata is not described here. See the PyPA `Core metadata specification <https://packaging.python.org/en/latest/specifications/core-metadata/#core-metadata>`_ for additional details.
ru: Полный набор доступных метаданных здесь не описан. Дополнительные сведения см. в спецификации основных метаданных PyPA <https://packaging.python.org/en/latest/specifications/core-metadata/#core-metadata>`_.

source: The ``Description`` is now included in the metadata when presented through the payload. Line continuation characters have been removed.
ru: «Описание» теперь включается в метаданные при представлении через полезную нагрузку. Символы продолжения строки были удалены.

source: The ``json`` attribute was added.
ru: Был добавлен атрибут ``json``.

source: Distribution versions
ru: Версии распространения
uk: Версії розповсюдження

source: Return the installed distribution package version for the named distribution package.
ru: Возвращает установленную версию дистрибутива для именованного дистрибутива.

source: The :func:`!version` function is the quickest way to get a `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_'s version number, as a string::
ru: Функция :func:`!version` — это самый быстрый способ получить номер версии `_ пакета дистрибутива <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_, как нить::

source: Distribution files
ru: Файлы дистрибутива
uk: Файли розповсюдження

source: Return the full set of files contained within the named distribution package.
ru: Вернуть полный набор файлов, содержащихся в указанном дистрибутиве.

source: Returns :const:`None` if the distribution is found but the installation database records reporting the files associated with the distribuion package are missing.
ru: Возвращает :const:`None`, если дистрибутив найден, но записи базы данных установки, сообщающие об отсутствии файлов, связанных с пакетом дистрибутива.

source: A :class:`pathlib.PurePath` derived object with additional ``dist``, ``size``, and ``hash`` properties corresponding to the distribution package's installation metadata for that file.
ru: Производный объект :class:`pathlib.PurePath` с дополнительными свойствами ``dist``, ``size`` и ``hash``, соответствующими метаданным установки дистрибутива для этого файла.

source: The :func:`!files` function takes a `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_ name and returns all of the files installed by this distribution. Each file is reported as a :class:`PackagePath` instance. For example::
ru: Функция :func:`!files` принимает имя `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_ ​​и возвращает все файлы, установленные этим распределение. Каждый файл сообщается как экземпляр :class:`PackagePath`. Например::

source: Once you have the file, you can also read its contents::
ru: Получив файл, вы также можете прочитать его содержимое:
uk: Отримавши файл, ви також можете прочитати його вміст:

source: You can also use the :meth:`!locate` method to get the absolute path to the file::
ru: Вы также можете использовать метод :meth:`!locate`, чтобы получить абсолютный путь к файлу::

source: In the case where the metadata file listing files (``RECORD`` or ``SOURCES.txt``) is missing, :func:`!files` will return :const:`None`. The caller may wish to wrap calls to :func:`!files` in `always_iterable <https://more-itertools.readthedocs.io/en/stable/api.html#more_itertools.always_iterable>`_ or otherwise guard against this condition if the target distribution is not known to have the metadata present.
ru: В случае, если файлы со списком файлов метаданных (``RECORD`` или ``SOURCES.txt``) отсутствуют, :func:`!files` вернет :const:`None`. Вызывающий может пожелать обернуть вызовы :func:`!files` в `always_iterable <https://more-itertools.readthedocs.io/en/stable/api.html#more_itertools.always_iterable>`_ или иным образом защититься от этого. условие, если неизвестно, что в целевом дистрибутиве присутствуют метаданные.

source: Distribution requirements
ru: Требования к распространению
uk: Вимоги до розповсюдження

source: Return the declared dependency specifiers for the named distribution package.
ru: Верните объявленные спецификаторы зависимостей для именованного дистрибутива.

source: To get the full set of requirements for a `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_, use the :func:`!requires` function::
ru: Чтобы получить полный набор требований для `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_, используйте функцию :func:`!requires`: :

source: Mapping import to distribution packages
ru: Сопоставление импорта с дистрибутивными пакетами

source: Return a mapping from the top level module and import package names found via :attr:`sys.meta_path` to the names of the distribution packages (if any) that provide the corresponding files.
ru: Верните сопоставление из модуля верхнего уровня и импортируйте имена пакетов, найденные через :attr:`sys.meta_path`, в имена дистрибутивных пакетов (если таковые имеются), которые предоставляют соответствующие файлы.

source: To allow for namespace packages (which may have members provided by multiple distribution packages), each top level import name maps to a list of distribution names rather than mapping directly to a single name.
ru: Чтобы разрешить использование пакетов пространства имен (члены которых могут быть предоставлены несколькими пакетами распространения), каждое имя импорта верхнего уровня сопоставляется со списком имен распространения, а не сопоставляется непосредственно с одним именем.

source: A convenience method to resolve the `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_ name (or names, in the case of a namespace package) that provide each importable top-level Python module or `Import Package <https://packaging.python.org/en/latest/glossary/#term-Import-Package>`_::
ru: Удобный метод разрешения имени `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_ ​​(или имен, в случае пакета пространства имен), которые предоставляют каждый импортируемый модуль Python верхнего уровня или `Import Package <https://packaging.python.org/en/latest/glossary/#term-Import-Package>`_::

source: Some editable installs, `do not supply top-level names <https://github.com/pypa/packaging-problems/issues/609>`_, and thus this function is not reliable with such installs.
ru: Некоторые редактируемые установки `_ не предоставляют имена верхнего уровня <https://github.com/pypa/packaging-problems/issues/609>`_, поэтому эта функция ненадежна при таких установках.

source: Distributions
ru: Распределения
uk: Розподіл

source: Return a :class:`Distribution` instance describing the named distribution package.
ru: Возвращает экземпляр :class:`Distribution`, описывающий названный дистрибутив.

source: Details of an installed distribution package.
ru: Подробная информация об установленном дистрибутиве.

source: Note: different :class:`!Distribution` instances do not currently compare equal, even if they relate to the same installed distribution and accordingly have the same attributes.
ru: Примечание. Различные экземпляры :class:`!Distribution` в настоящее время не сравниваются равными, даже если они относятся к одному и тому же установленному дистрибутиву и, соответственно, имеют одинаковые атрибуты.

source: While the module level API described above is the most common and convenient usage, you can get all of that information from the :class:`!Distribution` class. :class:`!Distribution` is an abstract object that represents the metadata for a Python `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_. You can get the concreate :class:`!Distribution` subclass instance for an installed distribution package by calling the :func:`distribution` function::
ru: Хотя описанный выше API уровня модуля является наиболее распространенным и удобным, вы можете получить всю эту информацию из класса :class:`!Distribution`. :class:`!Distribution` — это абстрактный объект, который представляет метаданные для `Distribution Package Python <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_. Вы можете получить экземпляр подкласса concreate :class:`!Distribution` для установленного дистрибутива, вызвав функцию :func:`distribution`::

source: Thus, an alternative way to get the version number is through the :class:`!Distribution` instance::
ru: Таким образом, альтернативный способ получить номер версии — через экземпляр :class:`!Distribution`::

source: There are all kinds of additional metadata available on :class:`!Distribution` instances::
ru: В экземплярах :class:`!Distribution` доступны все виды дополнительных метаданных::

source: Distribution Discovery
ru: Открытие распространения
