Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/importlib.metadata.po
Languages: ru, uk

source: By default, this package provides built-in support for discovery of metadata for file system and zip file `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_\s. This metadata finder search defaults to ``sys.path``, but varies slightly in how it interprets those values from how other import machinery does. In particular:
ru: По умолчанию этот пакет предоставляет встроенную поддержку обнаружения метаданных для файловой системы и zip-файла `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_\ с. Этот поиск метаданных по умолчанию использует ``sys.path``, но интерпретация этих значений немного отличается от того, как это делают другие механизмы импорта. В частности:

source: ``importlib.metadata`` does not honor :class:`bytes` objects on ``sys.path``.
ru: ``importlib.metadata`` не учитывает объекты :class:`bytes` в ``sys.path``.

source: ``importlib.metadata`` will incidentally honor :py:class:`pathlib.Path` objects on ``sys.path`` even though such values will be ignored for imports.
ru: ``importlib.metadata`` будет случайно учитывать объекты :py:class:`pathlib.Path` в ``sys.path``, хотя такие значения будут игнорироваться при импорте.

source: Extending the search algorithm
ru: Расширение алгоритма поиска
uk: Розширення алгоритму пошуку

source: Because `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_ metadata is not available through :data:`sys.path` searches, or package loaders directly, the metadata for a distribution is found through import system :ref:`finders <finders-and-loaders>`. To find a distribution package's metadata, ``importlib.metadata`` queries the list of :term:`meta path finders <meta path finder>` on :data:`sys.meta_path`.
ru: Поскольку метаданные `Distribution Package <https://packaging.python.org/en/latest/glossary/#term-Distribution-Package>`_ ​​недоступны через поиск :data:`sys.path` или напрямую через загрузчики пакетов, метаданные для дистрибутива можно найти через систему импорта :ref:`finders <finders-and-loaders>`. Чтобы найти метаданные пакета распространения, ``importlib.metadata`` запрашивает список :term:`мета-поисковиков <мета-пути искателя>` на :data:`sys.meta_path`.

source: By default ``importlib.metadata`` installs a finder for distribution packages found on the file system. This finder doesn't actually find any *distributions*, but it can find their metadata.
ru: По умолчанию importlib.metadata устанавливает средство поиска дистрибутивных пакетов, найденных в файловой системе. Этот поисковик на самом деле не находит никаких *дистрибутивов*, ​​но может найти их метаданные.

source: The abstract class :py:class:`importlib.abc.MetaPathFinder` defines the interface expected of finders by Python's import system. ``importlib.metadata`` extends this protocol by looking for an optional ``find_distributions`` callable on the finders from :data:`sys.meta_path` and presents this extended interface as the ``DistributionFinder`` abstract base class, which defines this abstract method::
ru: Абстрактный класс :py:class:`importlib.abc.MetaPathFinder` определяет интерфейс, ожидаемый от средств поиска системой импорта Python. ``importlib.metadata`` расширяет этот протокол, ища дополнительный ``find_distributions``, вызываемый в средствах поиска из :data:`sys.meta_path`, и представляет этот расширенный интерфейс как абстрактный базовый класс ``DistributionFinder``, который определяет этот абстрактный метод::
uk: Абстрактний клас :py:class:`importlib.abc.MetaPathFinder` визначає інтерфейс, очікуваний від шукачів системою імпорту Python. ``importlib.metadata`` розширює цей протокол, шукаючи необов’язковий ``find_distributions``, викликаний у шукачах з :data:`sys.meta_path`, і представляє цей розширений інтерфейс як ``DistributionFinder`` абстрактний базовий клас, який визначає цей абстрактний метод::

source: The ``DistributionFinder.Context`` object provides ``.path`` and ``.name`` properties indicating the path to search and name to match and may supply other relevant context.
ru: Объект DistributionFinder.Context предоставляет свойства .path и .name, указывающие путь для поиска и имя для сопоставления, а также может предоставлять другой соответствующий контекст.
uk: Об’єкт ``DistributionFinder.Context`` надає властивості ``.path`` і ``.name``, що вказують шлях для пошуку та ім’я, яке відповідає, і може надати інший відповідний контекст.

source: What this means in practice is that to support finding distribution package metadata in locations other than the file system, subclass ``Distribution`` and implement the abstract methods. Then from a custom finder, return instances of this derived ``Distribution`` in the ``find_distributions()`` method.
ru: На практике это означает, что для поддержки поиска метаданных пакета распространения в местах, отличных от файловой системы, необходимо создать подкласс Distribution и реализовать абстрактные методы. Затем из пользовательского средства поиска верните экземпляры этого производного ``Distribution`` в методе ``find_distributions()``.
uk: На практиці це означає, що для підтримки пошуку метаданих пакетів дистрибутива в місцях, відмінних від файлової системи, створіть підклас ``Distribution`` і реалізуйте абстрактні методи. Потім із спеціального засобу пошуку поверніть екземпляри цього похідного ``Distribution`` у методі ``find_distributions()``.

source: Using :mod:`!importlib.metadata`
uk: Використання :mod:`!importlib.metadata`

source: By "installed package" we generally mean a third-party package installed into Python's ``site-packages`` directory via tools such as `pip <https://pypi.org/project/pip/>`_. Specifically, it means a package with either a discoverable ``dist-info`` or ``egg-info`` directory, and metadata defined by :pep:`566` or its older specifications. By default, package metadata can live on the file system or in zip archives on :data:`sys.path`. Through an extension mechanism, the metadata can live almost anywhere.
uk: Під "встановленим пакетом" ми зазвичай маємо на увазі пакет третьої сторони, встановлений у каталозі ``site-packages`` Python за допомогою таких інструментів, як `pip <https://pypi.org/project/pip/>`_. Зокрема, це означає пакунок із відкритим каталогом ``dist-info`` або ``egg-info`` і метаданими, визначеними :pep:`566` або його старішими специфікаціями. За замовчуванням метадані пакета можуть зберігатися у файловій системі або в zip-архівах на :data:`sys.path`. Завдяки механізму розширення метадані можуть зберігатися майже будь-де.

source: Let's say you wanted to get the version string for a package you've installed using ``pip``. We start by creating a virtual environment and installing something into it:
uk: Припустімо, ви хочете отримати рядок версії для пакета, який ви встановили за допомогою ``pip``. Ми починаємо зі створення віртуального середовища та інсталяції в нього чогось:

source: You can also get the set of entry points keyed by group, such as ``console_scripts``, ``distutils.commands`` and others. Each group contains a sequence of :ref:`EntryPoint <entry-points>` objects.
uk: Ви також можете отримати набір точок входу з ключем групи, наприклад ``console_scripts``, ``distutils.commands`` та інші. Кожна група містить послідовність об’єктів :ref:`EntryPoint <entry-points>`.

source: Every distribution includes some metadata, which you can extract using the ``metadata()`` function::
uk: Кожен дистрибутив містить деякі метадані, які ви можете отримати за допомогою функції ``metadata()``:

source: The ``version()`` function is the quickest way to get a distribution's version number, as a string::
uk: Функція ``version()`` — це найшвидший спосіб отримати номер версії дистрибутива у вигляді рядка::

source: You can also get the full set of files contained within a distribution. The ``files()`` function takes a distribution package name and returns all of the files installed by this distribution. Each file object returned is a ``PackagePath``, a :class:`pathlib.PurePath` derived object with additional ``dist``, ``size``, and ``hash`` properties as indicated by the metadata. For example::
uk: Ви також можете отримати повний набір файлів, які містяться в дистрибутиві. Функція ``files()`` приймає назву пакета дистрибутива та повертає всі файли, встановлені цим дистрибутивом. Кожен повернутий файловий об’єкт є ``PackagePath``, похідним об’єктом :class:`pathlib.PurePath` з додатковими властивостями ``dist``, ``size`` і ``hash``, як зазначено в метаданих. Наприклад::

source: You can also use the ``locate`` method to get a the absolute path to the file::
uk: Ви також можете використовувати метод ``locate``, щоб отримати абсолютний шлях до файлу::

source: In the case where the metadata file listing files (RECORD or SOURCES.txt) is missing, ``files()`` will return ``None``. The caller may wish to wrap calls to ``files()`` in `always_iterable <https://more-itertools.readthedocs.io/en/stable/api.html#more_itertools.always_iterable>`_ or otherwise guard against this condition if the target distribution is not known to have the metadata present.
uk: У випадку, якщо файл метаданих зі списком файлів (RECORD або SOURCES.txt) відсутній, ``files()`` поверне ``None``. Виклик може забажати обернути виклики ``files()`` в `always_iterable <https://more-itertools.readthedocs.io/en/stable/api.html#more_itertools.always_iterable>`_ або іншим чином захиститися від цієї умови, якщо відомо, що цільовий розподіл не містить метаданих.

source: To get the full set of requirements for a distribution, use the ``requires()`` function::
uk: Щоб отримати повний набір вимог до дистрибутива, скористайтеся функцією ``requires()``::

source: While the above API is the most common and convenient usage, you can get all of that information from the ``Distribution`` class. A ``Distribution`` is an abstract object that represents the metadata for a Python package. You can get the ``Distribution`` instance::
uk: Хоча наведений вище API є найбільш поширеним і зручним використанням, ви можете отримати всю цю інформацію з класу ``Distribution``. ``Distribution`` — це абстрактний об’єкт, який представляє метадані для пакета Python. Ви можете отримати екземпляр ``Distribution``::

source: Thus, an alternative way to get the version number is through the ``Distribution`` instance::
uk: Таким чином, альтернативним способом отримання номера версії є екземпляр ``Distribution``::

source: There are all kinds of additional metadata available on the ``Distribution`` instance::
uk: У екземплярі ``Distribution`` є всі види додаткових метаданих:

source: The full set of available metadata is not described here. See :pep:`566` for additional details.
uk: Повний набір доступних метаданих тут не описаний. Перегляньте :pep:`566` для отримання додаткової інформації.

source: Because package metadata is not available through :data:`sys.path` searches, or package loaders directly, the metadata for a package is found through import system :ref:`finders <finders-and-loaders>`. To find a distribution package's metadata, ``importlib.metadata`` queries the list of :term:`meta path finders <meta path finder>` on :data:`sys.meta_path`.
uk: Оскільки метадані пакета недоступні за допомогою пошуку :data:`sys.path` або напряму завантажувачів пакетів, метадані для пакета можна знайти через систему імпорту :ref:`finders <finders-and-loaders>`. Щоб знайти метадані дистрибутивного пакета, ``importlib.metadata`` запитує список :term:`мета-шляхів пошуку <meta path finder>` на :data:`sys.meta_path`.

source: The default ``PathFinder`` for Python includes a hook that calls into ``importlib.metadata.MetadataPathFinder`` for finding distributions loaded from typical file-system-based paths.
uk: Типовий ``PathFinder`` для Python включає хук, який викликає ``importlib.metadata.MetadataPathFinder`` для пошуку дистрибутивів, завантажених із типових шляхів на основі файлової системи.

source: Footnotes
uk: Виноски
