Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/importlib.resources.abc.po
Languages: ru

source: :mod:`!importlib.resources.abc` -- Abstract base classes for resources
ru: :mod:`!importlib.resources.abc` -- Абстрактные базовые классы для ресурсов

source: **Source code:** :source:`Lib/importlib/resources/abc.py`
ru: **Исходный код:** :source:`Lib/importlib/resources/abc.py`

source: *Superseded by TraversableResources*
ru: *Заменено TraversableResources*

source: An :term:`abstract base class` to provide the ability to read *resources*.
ru: :term:`абстрактный базовый класс`, обеспечивающий возможность чтения *ресурсов*.

source: From the perspective of this ABC, a *resource* is a binary artifact that is shipped within a package. Typically this is something like a data file that lives next to the ``__init__.py`` file of the package. The purpose of this class is to help abstract out the accessing of such data files so that it does not matter if the package and its data file(s) are stored e.g. in a zip file versus on the file system.
ru: :term:`абстрактный базовый класс`, обеспечивающий возможность чтения *ресурсов*.

source: For any of methods of this class, a *resource* argument is expected to be a :term:`path-like object` which represents conceptually just a file name. This means that no subdirectory paths should be included in the *resource* argument. This is because the location of the package the reader is for, acts as the "directory". Hence the metaphor for directories and file names is packages and resources, respectively. This is also why instances of this class are expected to directly correlate to a specific package (instead of potentially representing multiple packages or a module).
ru: Для любого метода этого класса ожидается, что аргумент *resource* будет объектом, похожим на путь, который концептуально представляет собой просто имя файла. Это означает, что в аргумент *resource* не следует включать пути к подкаталогам. Это связано с тем, что местоположение пакета, для которого предназначено устройство чтения, действует как «каталог». Следовательно, метафорой имен каталогов и файлов являются пакеты и ресурсы соответственно. Именно поэтому ожидается, что экземпляры этого класса будут напрямую соотноситься с конкретным пакетом (вместо того, чтобы потенциально представлять несколько пакетов или модуля).

source: Loaders that wish to support resource reading are expected to provide a method called ``get_resource_reader(fullname)`` which returns an object implementing this ABC's interface. If the module specified by fullname is not a package, this method should return :const:`None`. An object compatible with this ABC should only be returned when the specified module is a package.
ru: Ожидается, что загрузчики, желающие поддерживать чтение ресурсов, предоставят метод get_resource_reader(fullname), который возвращает объект, реализующий этот интерфейс ABC. Если модуль, указанный полным именем, не является пакетом, этот метод должен вернуть :const:`None`. Объект, совместимый с этим ABC, должен быть возвращен только в том случае, если указанный модуль является пакетом.

source: Use :class:`importlib.resources.abc.TraversableResources` instead.
ru: Вместо этого используйте :class:`importlib.resources.abc.TraversableResources`.

source: Returns an opened, :term:`file-like object` for binary reading of the *resource*.
ru: Возвращает открытый :term:`файлоподобный объект` для двоичного чтения *ресурса*.

source: If the resource cannot be found, :exc:`FileNotFoundError` is raised.
ru: Если ресурс не может быть найден, возникает :exc:`FileNotFoundError`.

source: Returns the file system path to the *resource*.
ru: Возвращает путь файловой системы к *ресурсу*.

source: If the resource does not concretely exist on the file system, raise :exc:`FileNotFoundError`.
ru: Если ресурс конкретно не существует в файловой системе, поднимите :exc:`FileNotFoundError`.

source: Returns ``True`` if the named *name* is considered a resource. :exc:`FileNotFoundError` is raised if *name* does not exist.
ru: Возвращает ``True``, если именованное *имя* считается ресурсом. :exc:`FileNotFoundError` возникает, если *name* не существует.

source: Returns an :term:`iterable` of strings over the contents of the package. Do note that it is not required that all names returned by the iterator be actual resources, e.g. it is acceptable to return names for which :meth:`is_resource` would be false.
ru: Возвращает :term:`iterable` строк по содержимому пакета. Обратите внимание, что не обязательно, чтобы все имена, возвращаемые итератором, были реальными ресурсами, например, допустимо возвращать имена, для которых :meth:`is_resource` будет ложным.

source: Allowing non-resource names to be returned is to allow for situations where how a package and its resources are stored are known a priori and the non-resource names would be useful. For instance, returning subdirectory names is allowed so that when it is known that the package and resources are stored on the file system then those subdirectory names can be used directly.
ru: Разрешить возврат имен, не являющихся ресурсами, необходимо для ситуаций, когда способ хранения пакета и его ресурсов известен априори и имена, не относящиеся к ресурсам, могут оказаться полезными. Например, разрешен возврат имен подкаталогов, чтобы, когда известно, что пакет и ресурсы хранятся в файловой системе, эти имена подкаталогов можно было использовать напрямую.

source: The abstract method returns an iterable of no items.
ru: Абстрактный метод возвращает итерацию без элементов.

source: An object with a subset of :class:`pathlib.Path` methods suitable for traversing directories and opening files.
ru: Объект с подмножеством методов :class:`pathlib.Path`, подходящих для перемещения по каталогам и открытия файлов.

source: For a representation of the object on the file-system, use :meth:`importlib.resources.as_file`.
ru: Для представления объекта в файловой системе используйте :meth:`importlib.resources.as_file`.

source: Abstract. The base name of this object without any parent references.
ru: Абстрактный. Базовое имя этого объекта без каких-либо родительских ссылок.

source: Yield Traversable objects in self.
ru: Выдавать проходимые объекты внутри себя.

source: Return ``True`` if self is a directory.
ru: Верните True, если self является каталогом.

source: Return ``True`` if self is a file.
ru: Верните ``True``, если self является файлом.

source: Traverse directories according to *pathsegments* and return the result as :class:`!Traversable`.
ru: Обход каталогов в соответствии с *pathsegments* и возврат результата в виде :class:`!Traversable`.

source: Each *pathsegments* argument may contain multiple names separated by forward slashes (``/``, ``posixpath.sep`` ). For example, the following are equivalent::
ru: Каждый аргумент *pathsegments* может содержать несколько имен, разделенных косой чертой (``/``, ``posixpath.sep`` ). Например, следующие эквивалентны:

source: Note that some :class:`!Traversable` implementations might not be updated to the latest version of the protocol. For compatibility with such implementations, provide a single argument without path separators to each call to ``joinpath``. For example::
ru: Обратите внимание, что некоторые реализации :class:`!Traversable` могут не быть обновлены до последней версии протокола. Для совместимости с такими реализациями предоставьте один аргумент без разделителей пути для каждого вызова joinpath. Например::

source: ``joinpath`` accepts multiple *pathsegments*, and these segments may contain forward slashes as path separators. Previously, only a single *child* argument was accepted.
ru: ``joinpath`` принимает несколько *pathsegments*, и эти сегменты могут содержать косую черту в качестве разделителей пути. Раньше принимался только один аргумент *child*.

source: Return Traversable child in self. Equivalent to ``joinpath(child)``.
ru: Возвращение ребенка в себя. Эквивалентно ``joinpath(child)``.

source: *mode* may be 'r' or 'rb' to open as text or binary. Return a handle suitable for reading (same as :attr:`pathlib.Path.open`).
ru: *mode* может иметь значение «r» или «rb», чтобы открыть его в текстовом или двоичном виде. Возвращает дескриптор, подходящий для чтения (аналогично :attr:`pathlib.Path.open`).

source: When opening as text, accepts encoding parameters such as those accepted by :class:`io.TextIOWrapper`.
ru: При открытии в виде текста принимает параметры кодирования, подобные тем, которые принимаются :class:`io.TextIOWrapper`.

source: Read contents of self as bytes.
ru: Прочитайте содержимое себя в виде байтов.

source: Read contents of self as text.
ru: Прочитайте содержимое себя в виде текста.

source: An abstract base class for resource readers capable of serving the :meth:`importlib.resources.files` interface. Subclasses :class:`ResourceReader` and provides concrete implementations of the :class:`!ResourceReader`'s abstract methods. Therefore, any loader supplying :class:`!TraversableResources` also supplies :class:`!ResourceReader`.
ru: Абстрактный базовый класс для чтения ресурсов, способный обслуживать интерфейс :meth:`importlib.resources.files`. Подклассы :class:`ResourceReader` и предоставляют конкретные реализации абстрактных методов :class:`!ResourceReader`. Следовательно, любой загрузчик, предоставляющий :class:`!TraversableResources`, также предоставляет :class:`!ResourceReader`.

source: Loaders that wish to support resource reading are expected to implement this interface.
ru: Ожидается, что загрузчики, желающие поддерживать чтение ресурсов, реализуют этот интерфейс.

source: Returns a :class:`importlib.resources.abc.Traversable` object for the loaded package.
ru: Возвращает объект :class:`importlib.resources.abc.Traversable` для загруженного пакета.
