Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/inspect.po
Languages: ru

source: Get a list of :class:`FrameInfo` objects for a traceback's frame and all inner frames. These frames represent calls made as a consequence of *frame*. The first entry in the list represents *traceback*; the last entry represents where the exception was raised.
ru: Получите список объектов :class:`FrameInfo` для фрейма трассировки и всех внутренних фреймов. Эти кадры представляют собой вызовы, сделанные вследствие *frame*. Первая запись в списке представляет *traceback*; последняя запись указывает место возникновения исключения.

source: Return the frame object for the caller's stack frame.
ru: Возвращает объект кадра для кадра стека вызывающего объекта.

source: This function relies on Python stack frame support in the interpreter, which isn't guaranteed to exist in all implementations of Python. If running in an implementation without Python stack frame support this function returns ``None``.
ru: Эта функция опирается на поддержку фреймов стека Python в интерпретаторе, наличие которой не гарантируется во всех реализациях Python. При запуске в реализации без поддержки фреймов стека Python эта функция возвращает None.

source: Return a list of :class:`FrameInfo` objects for the caller's stack. The first entry in the returned list represents the caller; the last entry represents the outermost call on the stack.
ru: Возвращает список объектов :class:`FrameInfo` для стека вызывающего объекта. Первая запись в возвращаемом списке представляет вызывающего абонента; последняя запись представляет собой самый внешний вызов в стеке.

source: Return a list of :class:`FrameInfo` objects for the stack between the current frame and the frame in which an exception currently being handled was raised in. The first entry in the list represents the caller; the last entry represents where the exception was raised.
ru: Возвращает список объектов :class:`FrameInfo` для стека между текущим кадром и кадром, в котором возникло обрабатываемое в данный момент исключение. Первая запись в списке представляет вызывающую сторону; последняя запись указывает место возникновения исключения.

source: Fetching attributes statically
ru: Статическая выборка атрибутов

source: Both :func:`getattr` and :func:`hasattr` can trigger code execution when fetching or checking for the existence of attributes. Descriptors, like properties, will be invoked and :meth:`~object.__getattr__` and :meth:`~object.__getattribute__` may be called.
ru: И :func:`getattr`, и :func:`hasattr` могут инициировать выполнение кода при получении или проверке существования атрибутов. Дескрипторы, как и свойства, будут вызываться и могут вызываться :meth:`~object.__getattr__` и :meth:`~object.__getattribute__`.

source: For cases where you want passive introspection, like documentation tools, this can be inconvenient. :func:`getattr_static` has the same signature as :func:`getattr` but avoids executing code when it fetches attributes.
ru: В случаях, когда вам нужен пассивный самоанализ, например, в инструментах документирования, это может быть неудобно. :func:`getattr_static` имеет ту же сигнатуру, что и :func:`getattr`, но избегает выполнения кода при получении атрибутов.

source: Retrieve attributes without triggering dynamic lookup via the descriptor protocol, :meth:`~object.__getattr__` or :meth:`~object.__getattribute__`.
ru: Получайте атрибуты без запуска динамического поиска через протокол дескриптора :meth:`~object.__getattr__` или :meth:`~object.__getattribute__`.

source: Note: this function may not be able to retrieve all attributes that getattr can fetch (like dynamically created attributes) and may find attributes that getattr can't (like descriptors that raise AttributeError). It can also return descriptors objects instead of instance members.
ru: Примечание. Эта функция может быть не в состоянии получить все атрибуты, которые может получить getattr (например, динамически созданные атрибуты), и может найти атрибуты, которые getattr не может получить (например, дескрипторы, которые вызывают AttributeError). Он также может возвращать объекты дескрипторов вместо членов экземпляра.

source: If the instance :attr:`~object.__dict__` is shadowed by another member (for example a property) then this function will be unable to find instance members.
ru: Если экземпляр :attr:`~object.__dict__` затенен другим элементом (например, свойством), то эта функция не сможет найти члены экземпляра.

source: :func:`getattr_static` does not resolve descriptors, for example slot descriptors or getset descriptors on objects implemented in C. The descriptor object is returned instead of the underlying attribute.
ru: :func:`getattr_static` не разрешает дескрипторы, например дескрипторы слотов или дескрипторы getset для объектов, реализованных в C. Вместо базового атрибута возвращается объект дескриптора.

source: You can handle these with code like the following. Note that for arbitrary getset descriptors invoking these may trigger code execution::
ru: Вы можете справиться с этим с помощью кода, подобного следующему. Обратите внимание, что вызов произвольных дескрипторов getset может вызвать выполнение кода:

source: Current State of Generators, Coroutines, and Asynchronous Generators
ru: Текущее состояние генераторов, сопрограмм и асинхронных генераторов

source: When implementing coroutine schedulers and for other advanced uses of generators, it is useful to determine whether a generator is currently executing, is waiting to start or resume or execution, or has already terminated. :func:`getgeneratorstate` allows the current state of a generator to be determined easily.
ru: При реализации планировщиков сопрограмм и других расширенных применениях генераторов полезно определить, выполняется ли генератор в данный момент, ожидает запуска, возобновления или выполнения или уже завершился. :func:`getgeneratorstate` позволяет легко определить текущее состояние генератора.

source: Get current state of a generator-iterator.
ru: Получить текущее состояние генератора-итератора.

source: Possible states are:
ru: Возможны следующие состояния:

source: GEN_CREATED: Waiting to start execution.
ru: GEN_CREATED: Ожидание начала выполнения.

source: GEN_RUNNING: Currently being executed by the interpreter.
ru: GEN_RUNNING: В настоящее время выполняется интерпретатором.

source: GEN_SUSPENDED: Currently suspended at a yield expression.
ru: GEN_SUSPENDED: в настоящее время приостановлено по выражению доходности.

source: GEN_CLOSED: Execution has completed.
ru: GEN_CLOSED: выполнение завершено.

source: Get current state of a coroutine object. The function is intended to be used with coroutine objects created by :keyword:`async def` functions, but will accept any coroutine-like object that has ``cr_running`` and ``cr_frame`` attributes.
ru: Получить текущее состояние объекта сопрограммы. Функция предназначена для использования с объектами сопрограмм, созданными функциями async def, но она принимает любой объект, подобный сопрограмме, который имеет атрибуты cr_running и cr_frame.

source: CORO_CREATED: Waiting to start execution.
ru: CORO_CREATED: Ожидание начала выполнения.

source: CORO_RUNNING: Currently being executed by the interpreter.
ru: CORO_RUNNING: В настоящее время выполняется интерпретатором.

source: CORO_SUSPENDED: Currently suspended at an await expression.
ru: CORO_SUSPENDED: в настоящее время приостановлено по выражению ожидания.

source: CORO_CLOSED: Execution has completed.
ru: CORO_CLOSED: выполнение завершено.

source: Get current state of an asynchronous generator object. The function is intended to be used with asynchronous iterator objects created by :keyword:`async def` functions which use the :keyword:`yield` statement, but will accept any asynchronous generator-like object that has ``ag_running`` and ``ag_frame`` attributes.
ru: Получите текущее состояние объекта асинхронного генератора. Функция предназначена для использования с асинхронными объектами-итераторами, созданными функциями :keyword:`async def`, которые используют оператор :keyword:`yield`, но принимают любой асинхронный объект, подобный генератору, который имеет ``ag_running`` и `` Атрибуты `ag_frame``.

source: AGEN_CREATED: Waiting to start execution.
ru: AGEN_CREATED: Ожидание начала выполнения.

source: AGEN_RUNNING: Currently being executed by the interpreter.
ru: AGEN_RUNNING: В настоящее время выполняется интерпретатором.

source: AGEN_SUSPENDED: Currently suspended at a yield expression.
ru: AGEN_SUSPENDED: в настоящее время приостановлено по выражению доходности.

source: AGEN_CLOSED: Execution has completed.
ru: AGEN_CLOSED: выполнение завершено.

source: The current internal state of the generator can also be queried. This is mostly useful for testing purposes, to ensure that internal state is being updated as expected:
ru: Также можно запросить текущее внутреннее состояние генератора. Это в основном полезно в целях тестирования, чтобы гарантировать, что внутреннее состояние обновляется должным образом:

source: Get the mapping of live local variables in *generator* to their current values. A dictionary is returned that maps from variable names to values. This is the equivalent of calling :func:`locals` in the body of the generator, and all the same caveats apply.
ru: Получите сопоставление действующих локальных переменных в *генераторе* с их текущими значениями. Возвращается словарь, который отображает имена переменных в значения. Это эквивалент вызова :func:`locals` в теле генератора, и здесь применяются все те же предостережения.

source: If *generator* is a :term:`generator` with no currently associated frame, then an empty dictionary is returned. :exc:`TypeError` is raised if *generator* is not a Python generator object.
ru: Если *generator* является :term:`generator` без связанного в данный момент фрейма, то возвращается пустой словарь. :exc:`TypeError` возникает, если *generator* не является объектом генератора Python.

source: This function relies on the generator exposing a Python stack frame for introspection, which isn't guaranteed to be the case in all implementations of Python. In such cases, this function will always return an empty dictionary.
ru: Эта функция использует генератор, предоставляющий кадр стека Python для самоанализа, что не гарантируется во всех реализациях Python. В таких случаях эта функция всегда будет возвращать пустой словарь.

source: This function is analogous to :func:`~inspect.getgeneratorlocals`, but works for coroutine objects created by :keyword:`async def` functions.
ru: Эта функция аналогична :func:`~inspect.getgeneratorlocals`, но работает для объектов сопрограмм, созданных с помощью :keyword:`async def` функций.

source: This function is analogous to :func:`~inspect.getgeneratorlocals`, but works for asynchronous generator objects created by :keyword:`async def` functions which use the :keyword:`yield` statement.
ru: Эта функция аналогична :func:`~inspect.getgeneratorlocals`, но работает для объектов асинхронного генератора, созданных функциями :keyword:`async def`, которые используют оператор :keyword:`yield`.

source: Code Objects Bit Flags
ru: Битовые флаги объектов кода

source: Python code objects have a :attr:`~codeobject.co_flags` attribute, which is a bitmap of the following flags:
ru: Объекты кода Python имеют атрибут :attr:`~codeobject.co_flags`, который представляет собой растровое изображение следующих флагов:

source: The code object is optimized, using fast locals.
ru: Объект кода оптимизирован с использованием быстрых локальных переменных.

source: If set, a new dict will be created for the frame's :attr:`~frame.f_locals` when the code object is executed.
ru: Если установлено, новый словарь будет создан для :attr:`~frame.f_locals` фрейма при выполнении объекта кода.

source: The code object has a variable positional parameter (``*args``-like).
ru: Объект кода имеет переменный позиционный параметр (подобный ``*args``).

source: The code object has a variable keyword parameter (``**kwargs``-like).
ru: Объект кода имеет переменный параметр ключевого слова (подобный ``**kwargs``).

source: The flag is set when the code object is a nested function.
ru: Флаг устанавливается, когда объект кода является вложенной функцией.

source: The flag is set when the code object is a generator function, i.e. a generator object is returned when the code object is executed.
ru: Флаг устанавливается, когда объект кода является функцией-генератором, т. е. объект-генератор возвращается при выполнении объекта кода.

source: The flag is set when the code object is a coroutine function. When the code object is executed it returns a coroutine object. See :pep:`492` for more details.
ru: Флаг устанавливается, когда объект кода является функцией сопрограммы. Когда объект кода выполняется, он возвращает объект сопрограммы. См. :pep:`492` для более подробной информации.

source: The flag is used to transform generators into generator-based coroutines. Generator objects with this flag can be used in ``await`` expression, and can ``yield from`` coroutine objects. See :pep:`492` for more details.
ru: Флаг используется для преобразования генераторов в сопрограммы на основе генераторов. Объекты-генераторы с этим флагом могут использоваться в выражении await и могут создаваться из объектов сопрограммы. См. :pep:`492` для более подробной информации.

source: The flag is set when the code object is an asynchronous generator function. When the code object is executed it returns an asynchronous generator object. See :pep:`525` for more details.
ru: Флаг устанавливается, когда объект кода является функцией асинхронного генератора. Когда объект кода выполняется, он возвращает объект асинхронного генератора. См. :pep:`525` для более подробной информации.

source: The flags are specific to CPython, and may not be defined in other Python implementations. Furthermore, the flags are an implementation detail, and can be removed or deprecated in future Python releases. It's recommended to use public APIs from the :mod:`inspect` module for any introspection needs.
ru: Флаги специфичны для CPython и не могут быть определены в других реализациях Python. Более того, флаги являются деталью реализации и могут быть удалены или признаны устаревшими в будущих выпусках Python. Рекомендуется использовать общедоступные API из модуля :mod:`inspect` для любых нужд самоанализа.

source: Buffer flags
ru: Флаги буфера

source: This is an :class:`enum.IntFlag` that represents the flags that can be passed to the :meth:`~object.__buffer__` method of objects implementing the :ref:`buffer protocol <bufferobjects>`.
ru: Это :class:`enum.IntFlag`, который представляет флаги, которые могут быть переданы в :meth:`~object.__buffer__` метод объектов, реализующих :ref:`буферный протокол <bufferobjects>`.

source: The meaning of the flags is explained at :ref:`buffer-request-types`.
ru: Значение флагов объясняется в :ref:`buffer-request-types`.

source: Command Line Interface
ru: Интерфейс командной строки

source: The :mod:`inspect` module also provides a basic introspection capability from the command line.
ru: Модуль :mod:`inspect` также предоставляет базовые возможности самоанализа из командной строки.

source: By default, accepts the name of a module and prints the source of that module. A class or function within the module can be printed instead by appended a colon and the qualified name of the target object.
ru: По умолчанию принимает имя модуля и печатает исходный код этого модуля. Вместо этого можно вывести класс или функцию внутри модуля, добавив двоеточие и уточненное имя целевого объекта.

source: Print information about the specified object rather than the source code
ru: Выводить информацию об указанном объекте, а не исходный код
