Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/inspect.po
Languages: ru

source: Arrange the given list of classes into a hierarchy of nested lists. Where a nested list appears, it contains classes derived from the class whose entry immediately precedes the list. Each entry is a 2-tuple containing a class and a tuple of its base classes. If the *unique* argument is true, exactly one entry appears in the returned structure for each class in the given list. Otherwise, classes using multiple inheritance and their descendants will appear multiple times.
ru: Организуйте данный список классов в иерархию вложенных списков. Там, где появляется вложенный список, он содержит классы, производные от класса, запись которого непосредственно предшествует списку. Каждая запись представляет собой кортеж из двух классов, содержащий класс и кортеж его базовых классов. Если аргумент *unique* имеет значение true, в возвращаемой структуре для каждого класса в данном списке появляется ровно одна запись. В противном случае классы, использующие множественное наследование, и их потомки будут появляться несколько раз.

source: Get the names and default values of a Python function's parameters. A :term:`named tuple` is returned:
ru: Получите имена и значения по умолчанию параметров функции Python. Возвращается :term:`named tuple`:

source: ``FullArgSpec(args, varargs, varkw, defaults, kwonlyargs, kwonlydefaults, annotations)``
ru: ``FullArgSpec(args, varargs, varkw, defaults, kwonlyargs, kwonlydefaults, аннотации)``

source: *args* is a list of the positional parameter names. *varargs* is the name of the ``*`` parameter or ``None`` if arbitrary positional arguments are not accepted. *varkw* is the name of the ``**`` parameter or ``None`` if arbitrary keyword arguments are not accepted. *defaults* is an *n*-tuple of default argument values corresponding to the last *n* positional parameters, or ``None`` if there are no such defaults defined. *kwonlyargs* is a list of keyword-only parameter names in declaration order. *kwonlydefaults* is a dictionary mapping parameter names from *kwonlyargs* to the default values used if no argument is supplied. *annotations* is a dictionary mapping parameter names to annotations. The special key ``"return"`` is used to report the function return value annotation (if any).
ru: *args* — список имен позиционных параметров. *varargs* — это имя параметра ``*`` или ``None``, если произвольные позиционные аргументы не принимаются. *varkw* — это имя параметра ``**`` или ``None``, если произвольные аргументы ключевого слова не принимаются. *defaults* — это *n*-кортеж значений аргументов по умолчанию, соответствующих последним *n* позиционным параметрам, или ``None``, если такие значения по умолчанию не определены. *kwonlyargs* — это список имен параметров, содержащих только ключевые слова, в порядке объявления. *kwonlydefaults* — это словарь, сопоставляющий имена параметров из *kwonlyargs* со значениями по умолчанию, используемыми, если аргумент не указан. *annotations* — словарь, сопоставляющий имена параметров с аннотациями. Специальный ключ ``"return"`` используется для сообщения аннотации возвращаемого значения функции (если таковая имеется).

source: Note that :func:`signature` and :ref:`Signature Object <inspect-signature-object>` provide the recommended API for callable introspection, and support additional behaviours (like positional-only arguments) that are sometimes encountered in extension module APIs. This function is retained primarily for use in code that needs to maintain compatibility with the Python 2 ``inspect`` module API.
ru: Обратите внимание, что :func:`signature` и :ref:`Signature Object <inspect-signature-object>` предоставляют рекомендуемый API для вызываемой интроспекции и поддерживают дополнительное поведение (например, позиционные аргументы), которые иногда встречаются в API модуля расширения. . Эта функция сохранена в первую очередь для использования в коде, который должен поддерживать совместимость с API модуля ``inspect`` Python 2.

source: This function is now based on :func:`signature`, but still ignores ``__wrapped__`` attributes and includes the already bound first parameter in the signature output for bound methods.
ru: Эта функция теперь основана на :func:`signature`, но по-прежнему игнорирует атрибуты __wrapped__`` и включает уже связанный первый параметр в выходные данные сигнатуры для связанных методов.

source: This method was previously documented as deprecated in favour of :func:`signature` in Python 3.5, but that decision has been reversed in order to restore a clearly supported standard interface for single-source Python 2/3 code migrating away from the legacy :func:`getargspec` API.
ru: Ранее этот метод был задокументирован как устаревший в пользу :func:`signature` в Python 3.5, но это решение было отменено, чтобы восстановить четко поддерживаемый стандартный интерфейс для кода Python 2/3 с одним исходным кодом, мигрирующий от устаревшего: func:`getargspec` API.

source: Get information about arguments passed into a particular frame. A :term:`named tuple` ``ArgInfo(args, varargs, keywords, locals)`` is returned. *args* is a list of the argument names. *varargs* and *keywords* are the names of the ``*`` and ``**`` arguments or ``None``. *locals* is the locals dictionary of the given frame.
ru: Получите информацию об аргументах, переданных в конкретный кадр. Возвращается :term:`именованный кортеж` ``ArgInfo(args, varargs, ключевые слова, локальные значения)``. *args* — список имен аргументов. *varargs* и *keywords* — это имена аргументов ``*`` и ``**`` или ``None``. *locals* — словарь локальных значений данного фрейма.

source: This function was inadvertently marked as deprecated in Python 3.5.
ru: Эта функция была случайно помечена как устаревшая в Python 3.5.

source: Format a pretty argument spec from the four values returned by :func:`getargvalues`. The format\* arguments are the corresponding optional formatting functions that are called to turn names and values into strings.
ru: Отформатируйте красивую спецификацию аргумента из четырех значений, возвращаемых :func:`getargvalues`. Аргументы format\* — это соответствующие дополнительные функции форматирования, которые вызываются для преобразования имен и значений в строки.

source: Return a tuple of class cls's base classes, including cls, in method resolution order. No class appears more than once in this tuple. Note that the method resolution order depends on cls's type. Unless a very peculiar user-defined metatype is in use, cls will be the first element of the tuple.
ru: Возвращает кортеж базовых классов класса cls, включая cls, в порядке разрешения методов. Ни один класс не встречается в этом кортеже более одного раза. Обратите внимание, что порядок разрешения метода зависит от типа cls. Если не используется очень специфический пользовательский метатип, cls будет первым элементом кортежа.

source: Bind the *args* and *kwds* to the argument names of the Python function or method *func*, as if it was called with them. For bound methods, bind also the first argument (typically named ``self``) to the associated instance. A dict is returned, mapping the argument names (including the names of the ``*`` and ``**`` arguments, if any) to their values from *args* and *kwds*. In case of invoking *func* incorrectly, i.e. whenever ``func(*args, **kwds)`` would raise an exception because of incompatible signature, an exception of the same type and the same or similar message is raised. For example:
ru: Привяжите *args* и *kwds* к именам аргументов функции или метода Python *func*, как если бы они были вызваны вместе с ними. Для связанных методов привяжите также первый аргумент (обычно называемый «self») к связанному экземпляру. Возвращается словарь, сопоставляющий имена аргументов (включая имена аргументов ``*`` и ``**``, если таковые имеются) с их значениями из *args* и *kwds*. В случае неправильного вызова *func*, т.е. всякий раз, когда ``func(*args, **kwds)`` вызывает исключение из-за несовместимой сигнатуры, возникает исключение того же типа и того же или похожего сообщения. Например:

source: Use :meth:`Signature.bind` and :meth:`Signature.bind_partial` instead.
ru: Вместо этого используйте :meth:`Signature.bind` и :meth:`Signature.bind_partial`.

source: Get the mapping of external name references in a Python function or method *func* to their current values. A :term:`named tuple` ``ClosureVars(nonlocals, globals, builtins, unbound)`` is returned. *nonlocals* maps referenced names to lexical closure variables, *globals* to the function's module globals and *builtins* to the builtins visible from the function body. *unbound* is the set of names referenced in the function that could not be resolved at all given the current module globals and builtins.
ru: Получите сопоставление ссылок на внешние имена в функции или методе Python *func* с их текущими значениями. Возвращается :term:`named tuple` ``ClosureVars(nonlocals, globals, встроенные, несвязанные)``. *nonlocals* сопоставляет ссылочные имена с переменными лексического замыкания, *globals* — с глобальными переменными модуля функции, а *builtins* — со встроенными функциями, видимыми из тела функции. *unbound* — это набор имен, на которые ссылается функция, которые вообще невозможно разрешить, учитывая текущие глобальные и встроенные функции модуля.

source: :exc:`TypeError` is raised if *func* is not a Python function or method.
ru: :exc:`TypeError` возникает, если *func* не является функцией или методом Python.

source: Get the object wrapped by *func*. It follows the chain of :attr:`__wrapped__` attributes returning the last object in the chain.
ru: Получите объект, завернутый в *func*. Он следует за цепочкой атрибутов :attr:`__wrapped__`, возвращая последний объект в цепочке.

source: *stop* is an optional callback accepting an object in the wrapper chain as its sole argument that allows the unwrapping to be terminated early if the callback returns a true value. If the callback never returns a true value, the last object in the chain is returned as usual. For example, :func:`signature` uses this to stop unwrapping if any object in the chain has a ``__signature__`` attribute defined.
ru: *stop* — это необязательный обратный вызов, принимающий объект в цепочке оболочки в качестве единственного аргумента, который позволяет досрочно завершить развертывание, если обратный вызов возвращает истинное значение. Если обратный вызов никогда не возвращает истинное значение, последний объект в цепочке возвращается как обычно. Например, :func:`signature` использует это, чтобы остановить развертывание, если для какого-либо объекта в цепочке определен атрибут __signature__``.

source: :exc:`ValueError` is raised if a cycle is encountered.
ru: :exc:`ValueError` возникает, если встречается цикл.

source: Compute the annotations dict for an object.
ru: Вычислите аннотации dict для объекта.

source: ``obj`` may be a callable, class, or module. Passing in an object of any other type raises :exc:`TypeError`.
ru: ``obj`` может быть вызываемым объектом, классом или модулем. Передача объекта любого другого типа вызывает :exc:`TypeError`.

source: Returns a dict. ``get_annotations()`` returns a new dict every time it's called; calling it twice on the same object will return two different but equivalent dicts.
ru: Возвращает диктат. ``get_annotations()`` возвращает новый словарь каждый раз, когда он вызывается; вызов его дважды для одного и того же объекта вернет два разных, но эквивалентных слова.

source: This function handles several details for you:
ru: Эта функция обрабатывает для вас несколько деталей:

source: If ``eval_str`` is true, values of type ``str`` will be un-stringized using :func:`eval`. This is intended for use with stringized annotations (``from __future__ import annotations``).
ru: Если ``eval_str`` имеет значение true, значения типа ``str`` будут преобразованы в строки с использованием :func:`eval`. Это предназначено для использования со строковыми аннотациями («из __future__ import annotations»).

source: If ``obj`` doesn't have an annotations dict, returns an empty dict. (Functions and methods always have an annotations dict; classes, modules, and other types of callables may not.)
ru: Если ``obj`` не имеет словаря аннотаций, возвращается пустой словарь. (Функции и методы всегда имеют аннотации; классы, модули и другие типы вызываемых объектов могут отсутствовать.)

source: Ignores inherited annotations on classes. If a class doesn't have its own annotations dict, returns an empty dict.
ru: Игнорирует унаследованные аннотации к классам. Если у класса нет собственного словаря аннотаций, возвращается пустой словарь.

source: All accesses to object members and dict values are done using ``getattr()`` and ``dict.get()`` for safety.
ru: Весь доступ к членам объекта и значениям dict осуществляется с использованием ``getattr()`` и ``dict.get()`` в целях безопасности.

source: Always, always, always returns a freshly created dict.
ru: Всегда, всегда, всегда возвращает только что созданный словарь.

source: ``eval_str`` controls whether or not values of type ``str`` are replaced with the result of calling :func:`eval` on those values:
ru: ``eval_str`` контролирует, заменяются ли значения типа ``str`` результатом вызова :func:`eval` для этих значений:

source: If eval_str is true, :func:`eval` is called on values of type ``str``. (Note that ``get_annotations`` doesn't catch exceptions; if :func:`eval` raises an exception, it will unwind the stack past the ``get_annotations`` call.)
ru: Если eval_str имеет значение true, :func:`eval` вызывается для значений типа ``str``. (Обратите внимание, что ``get_annotations`` не перехватывает исключения; если :func:`eval` вызывает исключение, он раскручивает стек после вызова ``get_annotations``.)

source: If eval_str is false (the default), values of type ``str`` are unchanged.
ru: Если eval_str имеет значение false (по умолчанию), значения типа ``str`` не изменяются.

source: ``globals`` and ``locals`` are passed in to :func:`eval`; see the documentation for :func:`eval` for more information. If ``globals`` or ``locals`` is ``None``, this function may replace that value with a context-specific default, contingent on ``type(obj)``:
ru: ``globals`` и ``locals`` передаются в :func:`eval`; дополнительную информацию смотрите в документации по :func:`eval`. Если ``globals`` или ``locals`` имеют значение ``None``, эта функция может заменить это значение контекстно-зависимым значением по умолчанию, зависящим от ``type(obj)``:

source: If ``obj`` is a module, ``globals`` defaults to ``obj.__dict__``.
ru: Если ``obj`` является модулем, ``globals`` по умолчанию имеет значение ``obj.__dict__``.

source: If ``obj`` is a class, ``globals`` defaults to ``sys.modules[obj.__module__].__dict__`` and ``locals`` defaults to the ``obj`` class namespace.
ru: Если obj`` является классом, ``globals`` по умолчанию имеет значение ``sys.modules[obj.__module__].__dict__``, а ``locals`` по умолчанию использует пространство имен класса ``obj``.

source: If ``obj`` is a callable, ``globals`` defaults to :attr:`obj.__globals__ <function.__globals__>`, although if ``obj`` is a wrapped function (using :func:`functools.update_wrapper`) it is first unwrapped.
ru: Если obj`` является вызываемой функцией, ``globals`` по умолчанию имеет значение :attr:`obj.__globals__ <function.__globals__>`, хотя если ``obj`` является обернутой функцией (с использованием :func:`functools. update_wrapper`) сначала разворачивается.

source: Calling ``get_annotations`` is best practice for accessing the annotations dict of any object. See :ref:`annotations-howto` for more information on annotations best practices.
ru: Вызов get_annotations — лучший способ получить доступ к аннотациям любого объекта. См. :ref:`annotations-howto` для получения дополнительной информации о лучших практиках аннотаций.

source: The interpreter stack
ru: Стек интерпретатора

source: Some of the following functions return :class:`FrameInfo` objects. For backwards compatibility these objects allow tuple-like operations on all attributes except ``positions``. This behavior is considered deprecated and may be removed in the future.
ru: Некоторые из следующих функций возвращают объекты :class:`FrameInfo`. В целях обратной совместимости эти объекты допускают операции, подобные кортежам, со всеми атрибутами, кроме позиций. Такое поведение считается устаревшим и может быть удалено в будущем.

source: The :ref:`frame object <frame-objects>` that the record corresponds to.
ru: Объект :ref:`frame <frame-objects>`, которому соответствует запись.

source: The file name associated with the code being executed by the frame this record corresponds to.
ru: Имя файла, связанное с кодом, выполняемым кадром, которому соответствует эта запись.

source: The line number of the current line associated with the code being executed by the frame this record corresponds to.
ru: Номер текущей строки, связанной с кодом, исполняемым кадром, которому соответствует эта запись.

source: The function name that is being executed by the frame this record corresponds to.
ru: Имя функции, которая выполняется кадром, которому соответствует эта запись.

source: A list of lines of context from the source code that's being executed by the frame this record corresponds to.
ru: Список строк контекста из исходного кода, который выполняется кадром, которому соответствует эта запись.

source: The index of the current line being executed in the :attr:`code_context` list.
ru: Индекс текущей исполняемой строки в списке :attr:`code_context`.

source: A :class:`dis.Positions` object containing the start line number, end line number, start column offset, and end column offset associated with the instruction being executed by the frame this record corresponds to.
ru: Объект :class:`dis.Positions`, содержащий номер начальной строки, номер конечной строки, смещение начального столбца и смещение конечного столбца, связанное с инструкцией, выполняемой кадром, которому соответствует эта запись.

source: Return a :term:`named tuple` instead of a :class:`tuple`.
ru: Верните :term:`named tuple` вместо :class:`tuple`.

source: :class:`!FrameInfo` is now a class instance (that is backwards compatible with the previous :term:`named tuple`).
ru: :class:`!FrameInfo` теперь является экземпляром класса (который обратно совместим с предыдущим :term:`named tuple`).

source: The file name associated with the code being executed by the frame this traceback corresponds to.
ru: Имя файла, связанное с кодом, выполняемым кадром, которому соответствует эта обратная трассировка.

source: The line number of the current line associated with the code being executed by the frame this traceback corresponds to.
ru: Номер текущей строки, связанной с кодом, выполняемым кадром, которому соответствует эта обратная трассировка.

source: The function name that is being executed by the frame this traceback corresponds to.
ru: Имя функции, которая выполняется кадром, которому соответствует эта обратная трассировка.

source: A list of lines of context from the source code that's being executed by the frame this traceback corresponds to.
ru: Список строк контекста из исходного кода, который выполняется кадром, которому соответствует эта обратная трассировка.

source: A :class:`dis.Positions` object containing the start line number, end line number, start column offset, and end column offset associated with the instruction being executed by the frame this traceback corresponds to.
ru: Объект :class:`dis.Positions`, содержащий номер начальной строки, номер конечной строки, смещение начального столбца и смещение конечного столбца, связанное с инструкцией, выполняемой кадром, которому соответствует эта обратная трассировка.

source: :class:`!Traceback` is now a class instance (that is backwards compatible with the previous :term:`named tuple`).
ru: :class:`!Traceback` теперь является экземпляром класса (который обратно совместим с предыдущим :term:`named tuple`).

source: Keeping references to frame objects, as found in the first element of the frame records these functions return, can cause your program to create reference cycles. Once a reference cycle has been created, the lifespan of all objects which can be accessed from the objects which form the cycle can become much longer even if Python's optional cycle detector is enabled. If such cycles must be created, it is important to ensure they are explicitly broken to avoid the delayed destruction of objects and increased memory consumption which occurs.
ru: Сохранение ссылок на объекты фрейма, обнаруженные в первом элементе записей фрейма, возвращаемых этими функциями, может привести к тому, что ваша программа создаст ссылочные циклы. После создания эталонного цикла продолжительность жизни всех объектов, к которым можно получить доступ из объектов, образующих цикл, может стать намного дольше, даже если включен дополнительный детектор цикла Python. Если такие циклы необходимо создавать, важно убедиться, что они явно нарушены, чтобы избежать отложенного разрушения объектов и увеличения потребления памяти.

source: Though the cycle detector will catch these, destruction of the frames (and local variables) can be made deterministic by removing the cycle in a :keyword:`finally` clause. This is also important if the cycle detector was disabled when Python was compiled or using :func:`gc.disable`. For example::
ru: Хотя детектор циклов их улавливает, уничтожение кадров (и локальных переменных) можно сделать детерминированным, удалив цикл в предложении :keyword:`finally`. Это также важно, если детектор циклов был отключен при компиляции Python или при использовании :func:`gc.disable`. Например::

source: If you want to keep the frame around (for example to print a traceback later), you can also break reference cycles by using the :meth:`frame.clear` method.
ru: Если вы хотите сохранить фрейм (например, чтобы позже распечатать обратную трассировку), вы также можете разорвать ссылочные циклы, используя метод :meth:`frame.clear`.

source: The optional *context* argument supported by most of these functions specifies the number of lines of context to return, which are centered around the current line.
ru: Необязательный аргумент *context*, поддерживаемый большинством этих функций, указывает количество возвращаемых строк контекста, которые сосредоточены вокруг текущей строки.

source: Get information about a frame or traceback object. A :class:`Traceback` object is returned.
ru: Получите информацию о кадре или объекте трассировки. Возвращается объект :class:`Traceback`.

source: A :class:`Traceback` object is returned instead of a named tuple.
ru: Вместо именованного кортежа возвращается объект :class:`Traceback`.

source: Get a list of :class:`FrameInfo` objects for a frame and all outer frames. These frames represent the calls that lead to the creation of *frame*. The first entry in the returned list represents *frame*; the last entry represents the outermost call on *frame*'s stack.
ru: Получите список объектов :class:`FrameInfo` для фрейма и всех внешних фреймов. Эти кадры представляют собой вызовы, которые приводят к созданию *frame*. Первая запись в возвращаемом списке представляет *frame*; последняя запись представляет собой самый внешний вызов в стеке *frame*.

source: A list of :term:`named tuples <named tuple>` ``FrameInfo(frame, filename, lineno, function, code_context, index)`` is returned.
ru: Возвращается список :term:`именованных кортежей <named tuple>` ``FrameInfo(frame, filename, lineno, function, code_context, index)``.

source: A list of :class:`FrameInfo` objects is returned.
ru: Возвращается список объектов :class:`FrameInfo`.
