Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/json.po
Languages: ru

source: The JSON format is specified by :rfc:`7159` and by `ECMA-404 <https://ecma-international.org/publications-and-standards/standards/ecma-404/>`_. This section details this module's level of compliance with the RFC. For simplicity, :class:`JSONEncoder` and :class:`JSONDecoder` subclasses, and parameters other than those explicitly mentioned, are not considered.
ru: Формат JSON определяется :rfc:`7159` и `ECMA-404 <https://ecma-international.org/publications-and-standards/standards/ecma-404/>`_. В этом разделе подробно описан уровень соответствия этого модуля RFC. Для простоты подклассы :class:`JSONEncoder` и :class:`JSONDecoder`, а также параметры, отличные от явно упомянутых, не учитываются.

source: This module does not comply with the RFC in a strict fashion, implementing some extensions that are valid JavaScript but not valid JSON. In particular:
ru: Этот модуль не строго соответствует RFC, реализуя некоторые расширения, которые являются действительным JavaScript, но не действительным JSON. В частности:

source: Infinite and NaN number values are accepted and output;
ru: Принимаются и выводятся бесконечные числовые значения и значения NaN;

source: Repeated names within an object are accepted, and only the value of the last name-value pair is used.
ru: Допускаются повторяющиеся имена внутри объекта, и используется только значение последней пары имя-значение.

source: Since the RFC permits RFC-compliant parsers to accept input texts that are not RFC-compliant, this module's deserializer is technically RFC-compliant under default settings.
ru: Поскольку RFC позволяет RFC-совместимым анализаторам принимать входные тексты, которые не соответствуют RFC, десериализатор этого модуля технически совместим с RFC при настройках по умолчанию.

source: Character Encodings
ru: Кодировки символов

source: The RFC requires that JSON be represented using either UTF-8, UTF-16, or UTF-32, with UTF-8 being the recommended default for maximum interoperability.
ru: RFC требует, чтобы JSON был представлен с использованием UTF-8, UTF-16 или UTF-32, при этом UTF-8 является рекомендуемым значением по умолчанию для максимальной совместимости.

source: As permitted, though not required, by the RFC, this module's serializer sets *ensure_ascii=True* by default, thus escaping the output so that the resulting strings only contain ASCII characters.
ru: Как разрешено, хотя и не требуется RFC, сериализатор этого модуля устанавливает *ensure_ascii=True* по умолчанию, таким образом экранируя выходные данные, чтобы результирующие строки содержали только символы ASCII.

source: Other than the *ensure_ascii* parameter, this module is defined strictly in terms of conversion between Python objects and :class:`Unicode strings <str>`, and thus does not otherwise directly address the issue of character encodings.
ru: За исключением параметра *ensure_ascii*, этот модуль определяется строго с точки зрения преобразования между объектами Python и :class:`строками Unicode <str>` и, таким образом, напрямую не решает проблему кодировок символов.

source: The RFC prohibits adding a byte order mark (BOM) to the start of a JSON text, and this module's serializer does not add a BOM to its output. The RFC permits, but does not require, JSON deserializers to ignore an initial BOM in their input. This module's deserializer raises a :exc:`ValueError` when an initial BOM is present.
ru: RFC запрещает добавление метки порядка байтов (BOM) в начало текста JSON, а сериализатор этого модуля не добавляет спецификацию к своим выводам. RFC разрешает, но не требует, чтобы десериализаторы JSON игнорировали исходную спецификацию во входных данных. Десериализатор этого модуля выдает ошибку :exc:`ValueError` при наличии исходной спецификации.

source: The RFC does not explicitly forbid JSON strings which contain byte sequences that don't correspond to valid Unicode characters (e.g. unpaired UTF-16 surrogates), but it does note that they may cause interoperability problems. By default, this module accepts and outputs (when present in the original :class:`str`) code points for such sequences.
ru: RFC явно не запрещает строки JSON, содержащие последовательности байтов, которые не соответствуют допустимым символам Юникода (например, непарные суррогаты UTF-16), но отмечает, что они могут вызвать проблемы совместимости. По умолчанию этот модуль принимает и выводит (если они присутствуют в исходном :class:`str`) кодовые точки для таких последовательностей.

source: Infinite and NaN Number Values
ru: Бесконечные и числовые значения NaN

source: The RFC does not permit the representation of infinite or NaN number values. Despite that, by default, this module accepts and outputs ``Infinity``, ``-Infinity``, and ``NaN`` as if they were valid JSON number literal values::
ru: RFC не разрешает представление бесконечных числовых значений или значений NaN. Несмотря на это, по умолчанию этот модуль принимает и выводит ``Infinity``, ``-Infinity`` и ``NaN``, как если бы они были действительными литеральными значениями числа JSON::

source: In the serializer, the *allow_nan* parameter can be used to alter this behavior. In the deserializer, the *parse_constant* parameter can be used to alter this behavior.
ru: В сериализаторе для изменения этого поведения можно использовать параметр *allow_nan*. В десериализаторе для изменения этого поведения можно использовать параметр *parse_constant*.

source: Repeated Names Within an Object
ru: Повторяющиеся имена внутри объекта

source: The RFC specifies that the names within a JSON object should be unique, but does not mandate how repeated names in JSON objects should be handled. By default, this module does not raise an exception; instead, it ignores all but the last name-value pair for a given name::
ru: RFC указывает, что имена внутри объекта JSON должны быть уникальными, но не определяет, как следует обрабатывать повторяющиеся имена в объектах JSON. По умолчанию этот модуль не вызывает исключения; вместо этого он игнорирует все, кроме последней пары имя-значение для данного имени::

source: The *object_pairs_hook* parameter can be used to alter this behavior.
ru: Параметр *object_pairs_hook* можно использовать для изменения этого поведения.

source: Top-level Non-Object, Non-Array Values
ru: Значения верхнего уровня, не являющиеся объектами и не массивами

source: The old version of JSON specified by the obsolete :rfc:`4627` required that the top-level value of a JSON text must be either a JSON object or array (Python :class:`dict` or :class:`list`), and could not be a JSON null, boolean, number, or string value. :rfc:`7159` removed that restriction, and this module does not and has never implemented that restriction in either its serializer or its deserializer.
ru: Старая версия JSON, указанная устаревшим :rfc:`4627`, требовала, чтобы значение верхнего уровня текста JSON было либо объектом JSON, либо массивом (Python :class:`dict` или :class:`list`) и не может быть нулевым, логическим, числовым или строковым значением JSON. :rfc:`7159` удалил это ограничение, и этот модуль не реализовал и никогда не реализовал это ограничение ни в своем сериализаторе, ни в своем десериализаторе.

source: Regardless, for maximum interoperability, you may wish to voluntarily adhere to the restriction yourself.
ru: В любом случае, для максимальной совместимости вы можете добровольно соблюдать это ограничение самостоятельно.

source: Implementation Limitations
ru: Ограничения в реализации

source: Some JSON deserializer implementations may set limits on:
ru: Некоторые реализации десериализатора JSON могут устанавливать ограничения на:

source: the size of accepted JSON texts
ru: Некоторые реализации десериализатора JSON могут устанавливать ограничения на:

source: the maximum level of nesting of JSON objects and arrays
ru: максимальный уровень вложенности объектов и массивов JSON

source: the range and precision of JSON numbers
ru: диапазон и точность чисел JSON

source: the content and maximum length of JSON strings
ru: содержимое и максимальная длина строк JSON

source: This module does not impose any such limits beyond those of the relevant Python datatypes themselves or the Python interpreter itself.
ru: Этот модуль не накладывает никаких подобных ограничений, кроме ограничений самих соответствующих типов данных Python или самого интерпретатора Python.

source: When serializing to JSON, beware any such limitations in applications that may consume your JSON. In particular, it is common for JSON numbers to be deserialized into IEEE 754 double precision numbers and thus subject to that representation's range and precision limitations. This is especially relevant when serializing Python :class:`int` values of extremely large magnitude, or when serializing instances of "exotic" numerical types such as :class:`decimal.Decimal`.
ru: При сериализации в JSON остерегайтесь любых подобных ограничений в приложениях, которые могут использовать ваш JSON. В частности, числа JSON обычно десериализуются в числа двойной точности IEEE 754 и, таким образом, подвергаются ограничениям диапазона и точности этого представления. Это особенно актуально при сериализации значений Python :class:`int` чрезвычайно большой величины или при сериализации экземпляров «экзотических» числовых типов, таких как :class:`decimal.Decimal`.

source: Command Line Interface
ru: Интерфейс командной строки

source: **Source code:** :source:`Lib/json/tool.py`
ru: **Исходный код:** :source:`Lib/json/tool.py`

source: The :mod:`json.tool` module provides a simple command line interface to validate and pretty-print JSON objects.
ru: Модуль :mod:`json.tool` предоставляет простой интерфейс командной строки для проверки и удобной печати объектов JSON.

source: If the optional ``infile`` and ``outfile`` arguments are not specified, :data:`sys.stdin` and :data:`sys.stdout` will be used respectively:
ru: Если необязательные аргументы infile и outfile не указаны, будут использоваться :data:`sys.stdin` и :data:`sys.stdout` соответственно:

source: The output is now in the same order as the input. Use the :option:`--sort-keys` option to sort the output of dictionaries alphabetically by key.
ru: Вывод теперь находится в том же порядке, что и ввод. Используйте опцию :option:`--sort-keys` для сортировки вывода словарей в алфавитном порядке по ключу.

source: Command line options
ru: Параметры командной строки

source: The JSON file to be validated or pretty-printed:
ru: Файл JSON, который необходимо проверить или распечатать:

source: If *infile* is not specified, read from :data:`sys.stdin`.
ru: Если *infile* не указан, читайте из :data:`sys.stdin`.

source: Write the output of the *infile* to the given *outfile*. Otherwise, write it to :data:`sys.stdout`.
ru: Запишите вывод *infile* в данный *outfile*. В противном случае запишите его в :data:`sys.stdout`.

source: Sort the output of dictionaries alphabetically by key.
ru: Отсортируйте вывод словарей в алфавитном порядке по ключу.

source: Disable escaping of non-ascii characters, see :func:`json.dumps` for more information.
ru: Отключите экранирование символов, отличных от ascii, для получения дополнительной информации см. :func:`json.dumps`.

source: Parse every input line as separate JSON object.
ru: Анализируйте каждую строку ввода как отдельный объект JSON.

source: Mutually exclusive options for whitespace control.
ru: Взаимоисключающие параметры управления пробелами.

source: Show the help message.
ru: Показать справочное сообщение.

source: Footnotes
ru: Сноски

source: As noted in `the errata for RFC 7159 <https://www.rfc-editor.org/errata_search.php?rfc=7159>`_, JSON permits literal U+2028 (LINE SEPARATOR) and U+2029 (PARAGRAPH SEPARATOR) characters in strings, whereas JavaScript (as of ECMAScript Edition 5.1) does not.
ru: Как отмечено в `ошибках для RFC 7159 <https://www.rfc-editor.org/errata_search.php?rfc=7159>`_, JSON допускает буквальные U+2028 (СТРОИТЕЛЬНЫЙ РАЗДЕЛИТЕЛЬ) и U+2029 (ПАРАГРАФНЫЙ РАЗДЕЛИТЕЛЬ). ) символов в строках, тогда как JavaScript (начиная с ECMAScript Edition 5.1) этого не делает.
