Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/json.po
Languages: ru

source: :mod:`!json` --- JSON encoder and decoder
ru: :mod:`!json` --- Кодер и декодер JSON

source: **Source code:** :source:`Lib/json/__init__.py`
ru: **Исходный код:** :source:`Lib/json/__init__.py`

source: `JSON (JavaScript Object Notation) <https://json.org>`_, specified by :rfc:`7159` (which obsoletes :rfc:`4627`) and by `ECMA-404 <https://ecma-international.org/publications-and-standards/standards/ecma-404/>`_, is a lightweight data interchange format inspired by `JavaScript <https://en.wikipedia.org/wiki/JavaScript>`_ object literal syntax (although it is not a strict subset of JavaScript [#rfc-errata]_ ).
ru: `JSON (нотация объектов JavaScript) <https://json.org>`_, указанный :rfc:`7159` (который устарел :rfc:`4627`) и `ECMA-404 <https://ecma- International.org/publications-and-standards/standards/ecma-404/>`_ — это облегченный формат обмена данными, созданный на основе `JavaScript <https://en.wikipedia.org/wiki/JavaScript>`_ синтаксиса объектных литералов. (хотя это не строгое подмножество JavaScript [#rfc-ошибка]_ ).

source: Be cautious when parsing JSON data from untrusted sources. A malicious JSON string may cause the decoder to consume considerable CPU and memory resources. Limiting the size of data to be parsed is recommended.
ru: Будьте осторожны при анализе данных JSON из ненадежных источников. Вредоносная строка JSON может привести к тому, что декодер будет потреблять значительные ресурсы ЦП и памяти. Рекомендуется ограничить размер анализируемых данных.

source: :mod:`json` exposes an API familiar to users of the standard library :mod:`marshal` and :mod:`pickle` modules.
ru: :mod:`json` предоставляет API, знакомый пользователям модулей стандартной библиотеки :mod:`marshal` и :mod:`pickle`.

source: Encoding basic Python object hierarchies::
ru: Кодирование основных иерархий объектов Python:

source: Compact encoding::
ru: Компактное кодирование::

source: Pretty printing::
ru: Красивая печать::

source: Decoding JSON::
ru: Декодирование JSON::

source: Specializing JSON object decoding::
ru: Специализируемое декодирование объектов JSON::

source: Extending :class:`JSONEncoder`::
ru: Расширение :class:`JSONEncoder`::

source: Using :mod:`json.tool` from the shell to validate and pretty-print:
ru: Использование :mod:`json.tool` из оболочки для проверки и красивой печати:

source: See :ref:`json-commandline` for detailed documentation.
ru: Подробную документацию смотрите в :ref:`json-commandline`.

source: JSON is a subset of `YAML <https://yaml.org/>`_ 1.2. The JSON produced by this module's default settings (in particular, the default *separators* value) is also a subset of YAML 1.0 and 1.1. This module can thus also be used as a YAML serializer.
ru: JSON — это подмножество `YAML <https://yaml.org/>`_ 1.2. JSON, создаваемый настройками по умолчанию этого модуля (в частности, значением *разделителей* по умолчанию), также является подмножеством YAML 1.0 и 1.1. Таким образом, этот модуль также можно использовать в качестве сериализатора YAML.

source: This module's encoders and decoders preserve input and output order by default. Order is only lost if the underlying containers are unordered.
ru: Кодеры и декодеры этого модуля по умолчанию сохраняют порядок ввода и вывода. Порядок теряется только в том случае, если базовые контейнеры неупорядочены.

source: Basic Usage
ru: Основное использование

source: Unlike :mod:`pickle` and :mod:`marshal`, JSON is not a framed protocol, so trying to serialize multiple objects with repeated calls to :func:`dump` using the same *fp* will result in an invalid JSON file.
ru: В отличие от :mod:`pickle` и :mod:`marshal`, JSON не является фреймовым протоколом, поэтому попытка сериализации нескольких объектов с повторными вызовами :func:`dump` с использованием одного и того же *fp* приведет к недопустимому JSON. файл.

source: Parameters
ru: Параметры

source: If a positive integer or string, JSON array elements and object members will be pretty-printed with that indent level. A positive integer indents that many spaces per level; a string (such as ``"\t"``) is used to indent each level. If zero, negative, or ``""`` (the empty string), only newlines are inserted. If ``None`` (the default), the most compact representation is used.
ru: Если положительное целое число или строка, элементы массива JSON и члены объекта будут довольно напечатаны с этим уровнем отступления. Положительное целое число отступает, что много пробелов на уровень; Строка (такая как `` \ t "` `) используется для отступления на каждом уровне. Если ноль, негативное или `` "" `` (пустая строка), вставлены только новички. Если `` none`` (по умолчанию), используется наиболее компактное представление.

source: Allow strings for *indent* in addition to integers.
ru: Разрешить строки для *отступа* в дополнение к целым числам.

source: Use ``(',', ': ')`` as default if *indent* is not ``None``.
ru: Используйте ``(',', ': ')`` по умолчанию, если *indent* не равен ``None``.

source: All optional parameters are now :ref:`keyword-only <keyword-only_parameter>`.
ru: Все необязательные параметры теперь :ref:`keyword-only <keyword-only_parameter>`.

source: Serialize *obj* to a JSON formatted :class:`str` using this :ref:`conversion table <py-to-json-table>`. The arguments have the same meaning as in :func:`dump`.
ru: Сериализуйте *obj* в формат JSON :class:`str`, используя эту :ref:`таблицу преобразования <py-to-json-table>`. Аргументы имеют то же значение, что и в :func:`dump`.

source: Keys in key/value pairs of JSON are always of the type :class:`str`. When a dictionary is converted into JSON, all the keys of the dictionary are coerced to strings. As a result of this, if a dictionary is converted into JSON and then back into a dictionary, the dictionary may not equal the original one. That is, ``loads(dumps(x)) != x`` if x has non-string keys.
ru: Ключи в парах ключ/значение JSON всегда имеют тип :class:`str`. Когда словарь преобразуется в JSON, все ключи словаря преобразуются в строки. В результате, если словарь преобразуется в JSON, а затем обратно в словарь, словарь может не совпадать с исходным. То есть ``loads(dumps(x)) != x``, если x имеет нестроковые ключи.

source: If set, a function that is called with the result of any object literal decoded (a :class:`dict`). The return value of this function will be used instead of the :class:`dict`. This feature can be used to implement custom decoders, for example `JSON-RPC <https://www.jsonrpc.org>`_ class hinting. Default ``None``.
ru: Если установлена, функция, которая вызывается с результатом любого объекта буквального декодированного (A: Class: `dict`). Возвратное значение этой функции будет использоваться вместо: класс: `dict`. Эта функция может использоваться для реализации пользовательских декодеров, например, `json-rpc <https://www.jsonrpc.org>` _ Class Conting. По умолчанию `` none``.

source: If set, a function that is called with the result of any object literal decoded with an ordered list of pairs. The return value of this function will be used instead of the :class:`dict`. This feature can be used to implement custom decoders. If *object_hook* is also set, *object_pairs_hook* takes priority. Default ``None``.
ru: Если установлена, функция, которая вызывается с результатом любого объекта буквального декодированного с помощью упорядоченного списка пар. Возвратное значение этой функции будет использоваться вместо: класс: `dict`. Эту функцию можно использовать для реализации пользовательских декодеров. Если * object_hook * также установлен, * object_pairs_hook * принимает приоритет. По умолчанию `` none``.

source: If set, a function that is called with the string of every JSON float to be decoded. If ``None`` (the default), it is equivalent to ``float(num_str)``. This can be used to parse JSON floats into custom datatypes, for example :class:`decimal.Decimal`.
ru: Если установлена, функция, которая вызывается со строкой каждого поплавка JSON для декодирования. Если `` none`` (по умолчанию), это эквивалентно `` float (num_str) ``. Это может быть использовано для анализа JSON Floating в пользовательские данные дата, например: класс: `decimal.decimal`.

source: If set, a function that is called with the string of every JSON int to be decoded. If ``None`` (the default), it is equivalent to ``int(num_str)``. This can be used to parse JSON integers into custom datatypes, for example :class:`float`.
ru: Если установлена, функция, которая вызывается со строкой каждого JSON Int, будет декодирована. Если `` none`` (по умолчанию), это эквивалентно `` int (num_str) ``. Это может быть использовано для анализа целых чисел JSON в пользовательские данные дата, например: класс: `float`.

source: Raises
ru: Поднимает

source: *parse_constant* doesn't get called on 'null', 'true', 'false' anymore.
ru: *parse_constant* больше не вызывается для значений «null», «true», «false».

source: *fp* can now be a :term:`binary file`. The input encoding should be UTF-8, UTF-16 or UTF-32.
ru: *fp* теперь может быть :term:`двоичным файлом`. Входная кодировка должна быть UTF-8, UTF-16 или UTF-32.

source: The default *parse_int* of :func:`int` now limits the maximum length of the integer string via the interpreter's :ref:`integer string conversion length limitation <int_max_str_digits>` to help avoid denial of service attacks.
ru: Значение *parse_int* по умолчанию для :func:`int` теперь ограничивает максимальную длину целочисленной строки посредством :ref:`ограничения длины преобразования целочисленной строки интерпретатора <int_max_str_digits>`, чтобы помочь избежать атак типа «отказ в обслуживании».

source: *s* can now be of type :class:`bytes` or :class:`bytearray`. The input encoding should be UTF-8, UTF-16 or UTF-32.
ru: *s* теперь может иметь тип :class:`bytes` или :class:`bytearray`. Входная кодировка должна быть UTF-8, UTF-16 или UTF-32.

source: The keyword argument *encoding* has been removed.
ru: Ключевое слово *encoding* было удалено.

source: Encoders and Decoders
ru: Кодеры и декодеры

source: Simple JSON decoder.
ru: Простой декодер JSON.

source: Performs the following translations in decoding by default:
ru: По умолчанию выполняет следующие преобразования при декодировании:

source: object
ru: объект

source: dict
ru: словарь

source: list
ru: список

source: string
ru: строка

source: number (int)
ru: число (int)

source: number (real)
ru: число (вещественное)

source: true
ru: истина

source: True
ru: Истина

source: false
ru: ложь

source: False
ru: Ложь

source: It also understands ``NaN``, ``Infinity``, and ``-Infinity`` as their corresponding ``float`` values, which is outside the JSON spec.
ru: Он также понимает ``NaN``, ``Infinity`` и ``-Infinity`` как соответствующие им значения ``float``, которые находятся за пределами спецификации JSON.

source: *object_hook* is an optional function that will be called with the result of every JSON object decoded and its return value will be used in place of the given :class:`dict`. This can be used to provide custom deserializations (e.g. to support `JSON-RPC <https://www.jsonrpc.org>`_ class hinting).
ru: *object_hook* — это необязательная функция, которая будет вызываться с результатом каждого декодированного объекта JSON, и ее возвращаемое значение будет использоваться вместо заданного :class:`dict`. Это можно использовать для предоставления пользовательских десериализаций (например, для поддержки подсказок классов `JSON-RPC <https://www.jsonrpc.org>`_).

source: *object_pairs_hook* is an optional function that will be called with the result of every JSON object decoded with an ordered list of pairs. The return value of *object_pairs_hook* will be used instead of the :class:`dict`. This feature can be used to implement custom decoders. If *object_hook* is also defined, the *object_pairs_hook* takes priority.
ru: *object_pairs_hook* — это необязательная функция, которая будет вызываться с результатом каждого объекта JSON, декодированного с помощью упорядоченного списка пар. Возвращаемое значение *object_pairs_hook* будет использоваться вместо :class:`dict`. Эту функцию можно использовать для реализации пользовательских декодеров. Если также определен *object_hook*, *object_pairs_hook* имеет приоритет.

source: Added support for *object_pairs_hook*.
ru: Добавлена ​​поддержка *object_pairs_hook*.

source: *parse_float* is an optional function that will be called with the string of every JSON float to be decoded. By default, this is equivalent to ``float(num_str)``. This can be used to use another datatype or parser for JSON floats (e.g. :class:`decimal.Decimal`).
ru: *parse_float* — это необязательная функция, которая будет вызываться со строкой каждого числа с плавающей запятой JSON, подлежащего декодированию. По умолчанию это эквивалентно ``float(num_str)``. Это можно использовать для использования другого типа данных или синтаксического анализатора для чисел с плавающей запятой JSON (например, :class:`decimal.Decimal`).

source: *parse_int* is an optional function that will be called with the string of every JSON int to be decoded. By default, this is equivalent to ``int(num_str)``. This can be used to use another datatype or parser for JSON integers (e.g. :class:`float`).
ru: *parse_int* — это необязательная функция, которая будет вызываться со строкой каждого целого числа JSON, подлежащего декодированию. По умолчанию это эквивалентно ``int(num_str)``. Это можно использовать для использования другого типа данных или синтаксического анализатора целых чисел JSON (например, :class:`float`).

source: *parse_constant* is an optional function that will be called with one of the following strings: ``'-Infinity'``, ``'Infinity'``, ``'NaN'``. This can be used to raise an exception if invalid JSON numbers are encountered.
ru: *parse_constant* — это необязательная функция, которая будет вызываться с одной из следующих строк: ``'-Infinity'``, ``'Infinity'``, ``'NaN'``. Это можно использовать для создания исключения при обнаружении недопустимых номеров JSON.

source: If *strict* is false (``True`` is the default), then control characters will be allowed inside strings. Control characters in this context are those with character codes in the 0--31 range, including ``'\t'`` (tab), ``'\n'``, ``'\r'`` and ``'\0'``.
ru: Если *strict* имеет значение false (по умолчанию — True), то внутри строк будут разрешены управляющие символы. Управляющие символы в этом контексте — это символы с кодами символов в диапазоне 0–31, включая ``'\t'`` (табуляция), ``'\n'``, ``'\r'`` и ``'\r'`` `'\0'``.

source: If the data being deserialized is not a valid JSON document, a :exc:`JSONDecodeError` will be raised.
ru: Если десериализуемые данные не являются допустимым документом JSON, будет выдано сообщение :exc:`JSONDecodeError`.

source: All parameters are now :ref:`keyword-only <keyword-only_parameter>`.
ru: Все параметры теперь :ref:`keyword-only <keyword-only_parameter>`.

source: Return the Python representation of *s* (a :class:`str` instance containing a JSON document).
ru: Верните представление Python *s* (экземпляр :class:`str`, содержащий документ JSON).

source: :exc:`JSONDecodeError` will be raised if the given JSON document is not valid.
ru: :exc:`JSONDecodeError` будет вызвано, если данный документ JSON недействителен.

source: Decode a JSON document from *s* (a :class:`str` beginning with a JSON document) and return a 2-tuple of the Python representation and the index in *s* where the document ended.
ru: Декодируйте документ JSON из *s* (:class:`str`, начинающийся с документа JSON) и верните 2-кортеж представления Python и индекс в *s*, где закончился документ.

source: This can be used to decode a JSON document from a string that may have extraneous data at the end.
ru: Это можно использовать для декодирования документа JSON из строки, которая может содержать посторонние данные в конце.

source: Extensible JSON encoder for Python data structures.
ru: Расширяемый кодер JSON для структур данных Python.

source: Supports the following objects and types by default:
ru: По умолчанию поддерживает следующие объекты и типы:

source: list, tuple
ru: список, кортеж

source: int, float, int- & float-derived Enums
ru: int, float, перечисления, производные от int и float

source: number
ru: число

source: Added support for int- and float-derived Enum classes.
ru: Добавлена ​​поддержка классов Enum, производных от int и float.

source: To extend this to recognize other objects, subclass and implement a :meth:`~JSONEncoder.default` method with another method that returns a serializable object for ``o`` if possible, otherwise it should call the superclass implementation (to raise :exc:`TypeError`).
ru: Чтобы расширить это для распознавания других объектов, создайте подкласс и реализуйте метод :meth:`~JSONEncoder.default` с другим методом, который возвращает сериализуемый объект для ``o``, если это возможно, в противном случае он должен вызвать реализацию суперкласса (чтобы поднять: exc:`TypeError`).

source: If *skipkeys* is false (the default), a :exc:`TypeError` will be raised when trying to encode keys that are not :class:`str`, :class:`int`, :class:`float` or ``None``. If *skipkeys* is true, such items are simply skipped.
ru: Если *skipkeys* имеет значение false (по умолчанию), при попытке закодировать ключи, которые не являются :class:`str`, :class:`int`, :class:`float` или ``Нет``. Если *skipkeys* имеет значение true, такие элементы просто пропускаются.

source: If *ensure_ascii* is true (the default), the output is guaranteed to have all incoming non-ASCII characters escaped. If *ensure_ascii* is false, these characters will be output as-is.
ru: Если *ensure_ascii* имеет значение true (по умолчанию), в выводе гарантированно будут экранированы все входящие символы, отличные от ASCII. Если *ensure_ascii* имеет значение false, эти символы будут выводиться как есть.

source: If *check_circular* is true (the default), then lists, dicts, and custom encoded objects will be checked for circular references during encoding to prevent an infinite recursion (which would cause a :exc:`RecursionError`). Otherwise, no such check takes place.
ru: Если *check_circular* имеет значение true (по умолчанию), то списки, словари и пользовательские закодированные объекты будут проверяться на наличие циклических ссылок во время кодирования, чтобы предотвратить бесконечную рекурсию (которая может вызвать ошибку :exc:`RecursionError`). В противном случае такой проверки не происходит.

source: If *allow_nan* is true (the default), then ``NaN``, ``Infinity``, and ``-Infinity`` will be encoded as such. This behavior is not JSON specification compliant, but is consistent with most JavaScript based encoders and decoders. Otherwise, it will be a :exc:`ValueError` to encode such floats.
ru: Если *allow_nan* имеет значение true (по умолчанию), то ``NaN``, ``Infinity`` и ``-Infinity`` будут закодированы как таковые. Такое поведение не соответствует спецификации JSON, но совместимо с большинством кодировщиков и декодеров на основе JavaScript. В противном случае это будет :exc:`ValueError` для кодирования таких чисел с плавающей запятой.

source: If *sort_keys* is true (default: ``False``), then the output of dictionaries will be sorted by key; this is useful for regression tests to ensure that JSON serializations can be compared on a day-to-day basis.
ru: Если *sort_keys* имеет значение true (по умолчанию: ``False``), то вывод словарей будет отсортирован по ключу; это полезно для регрессионных тестов, чтобы гарантировать возможность ежедневного сравнения сериализаций JSON.

source: If *indent* is a non-negative integer or string, then JSON array elements and object members will be pretty-printed with that indent level. An indent level of 0, negative, or ``""`` will only insert newlines. ``None`` (the default) selects the most compact representation. Using a positive integer indent indents that many spaces per level. If *indent* is a string (such as ``"\t"``), that string is used to indent each level.
ru: Если *indent* является неотрицательным целым числом или строкой, то элементы массива JSON и члены объекта будут красиво напечатаны с этим уровнем отступа. Уровень отступа 0, отрицательный или ``""`` будет вставлять только новые строки. ``Нет`` (по умолчанию) выбирает наиболее компактное представление. Использование положительного целочисленного отступа приводит к отступу на такое количество пробелов на уровень. Если *indent* — это строка (например, ``"\t"``), эта строка используется для отступа каждого уровня.

source: If specified, *separators* should be an ``(item_separator, key_separator)`` tuple. The default is ``(', ', ': ')`` if *indent* is ``None`` and ``(',', ': ')`` otherwise. To get the most compact JSON representation, you should specify ``(',', ':')`` to eliminate whitespace.
ru: Если указано, *разделители* должны быть кортежем ``(item_separator, key_separator)``. По умолчанию используется ``(', ', ': ')``, если *indent* равен ``None``, и ``(',', ': ')`` в противном случае. Чтобы получить наиболее компактное представление JSON, вам следует указать ``(',', ':')`` для устранения пробелов.

source: If specified, *default* should be a function that gets called for objects that can't otherwise be serialized. It should return a JSON encodable version of the object or raise a :exc:`TypeError`. If not specified, :exc:`TypeError` is raised.
ru: Если указано, *default* должна быть функцией, которая вызывается для объектов, которые иначе не могут быть сериализованы. Он должен возвращать версию объекта, кодируемую JSON, или выдавать ошибку :exc:`TypeError`. Если не указано, возникает :exc:`TypeError`.

source: Implement this method in a subclass such that it returns a serializable object for *o*, or calls the base implementation (to raise a :exc:`TypeError`).
ru: Реализуйте этот метод в подклассе так, чтобы он возвращал сериализуемый объект для *o*, или вызывал базовую реализацию (чтобы вызвать :exc:`TypeError`).

source: For example, to support arbitrary iterators, you could implement :meth:`~JSONEncoder.default` like this::
ru: Например, для поддержки произвольных итераторов вы можете реализовать :meth:`~JSONEncoder.default` следующим образом:

source: Return a JSON string representation of a Python data structure, *o*. For example::
ru: Возвращает строковое представление JSON структуры данных Python, *o*. Например::

source: Encode the given object, *o*, and yield each string representation as available. For example::
ru: Закодируйте данный объект *o* и выдайте каждое доступное строковое представление. Например::

source: Exceptions
ru: Исключения

source: Subclass of :exc:`ValueError` with the following additional attributes:
ru: Подкласс :exc:`ValueError` со следующими дополнительными атрибутами:

source: The unformatted error message.
ru: Неформатированное сообщение об ошибке.

source: The JSON document being parsed.
ru: Анализируемый документ JSON.

source: The start index of *doc* where parsing failed.
ru: Начальный индекс *doc*, синтаксический анализ которого не удался.

source: The line corresponding to *pos*.
ru: Строка, соответствующая *pos*.

source: The column corresponding to *pos*.
ru: Столбец, соответствующий *pos*.

source: Standard Compliance and Interoperability
ru: Соответствие стандартам и совместимость
