Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/lzma.po
Languages: ru

source: A filter chain specifier is a sequence of dictionaries, where each dictionary contains the ID and options for a single filter. Each dictionary must contain the key ``"id"``, and may contain additional keys to specify filter-dependent options. Valid filter IDs are as follows:
ru: Спецификатор цепочки фильтров — это последовательность словарей, каждый из которых содержит идентификатор и параметры для одного фильтра. Каждый словарь должен содержать ключ «id» и может содержать дополнительные ключи для указания опций, зависящих от фильтра. Допустимые идентификаторы фильтров:

source: Compression filters:
ru: Компрессионные фильтры:

source: :const:`FILTER_LZMA1` (for use with :const:`FORMAT_ALONE`)
ru: :const:`FILTER_LZMA1` (для использования с :const:`FORMAT_ALONE`)

source: :const:`FILTER_LZMA2` (for use with :const:`FORMAT_XZ` and :const:`FORMAT_RAW`)
ru: :const:`FILTER_LZMA2` (для использования с :const:`FORMAT_XZ` и :const:`FORMAT_RAW`)

source: Delta filter:
ru: Дельта-фильтр:

source: Branch-Call-Jump (BCJ) filters:
ru: Фильтры Branch-Call-Jump (BCJ):

source: A filter chain can consist of up to 4 filters, and cannot be empty. The last filter in the chain must be a compression filter, and any other filters must be delta or BCJ filters.
ru: Цепочка фильтров может состоять из четырех фильтров и не может быть пустой. Последний фильтр в цепочке должен быть фильтром сжатия, а все остальные фильтры должны быть дельта- или BCJ-фильтрами.

source: Compression filters support the following options (specified as additional entries in the dictionary representing the filter):
ru: Фильтры сжатия поддерживают следующие параметры (указанные как дополнительные записи в словаре, представляющем фильтр):

source: ``preset``: A compression preset to use as a source of default values for options that are not specified explicitly.
ru: ``preset``: предустановка сжатия, используемая в качестве источника значений по умолчанию для параметров, которые не указаны явно.

source: ``dict_size``: Dictionary size in bytes. This should be between 4 KiB and 1.5 GiB (inclusive).
ru: ``dict_size``: Размер словаря в байтах. Он должен составлять от 4 КиБ до 1,5 ГиБ (включительно).

source: ``lc``: Number of literal context bits.
ru: ``lc``: количество битов буквального контекста.

source: ``lp``: Number of literal position bits. The sum ``lc + lp`` must be at most 4.
ru: ``lp``: количество битов буквальной позиции. Сумма ``lc + lp`` должна быть не более 4.

source: ``pb``: Number of position bits; must be at most 4.
ru: ``pb``: количество бит позиции; должно быть не более 4.

source: ``mode``: :const:`MODE_FAST` or :const:`MODE_NORMAL`.
ru: ``mode``: :const:`MODE_FAST` или :const:`MODE_NORMAL`.

source: ``nice_len``: What should be considered a "nice length" for a match. This should be 273 or less.
ru: ``nice_len``: Что следует считать «хорошей длиной» для совпадения. Это должно быть 273 или меньше.

source: ``mf``: What match finder to use -- :const:`MF_HC3`, :const:`MF_HC4`, :const:`MF_BT2`, :const:`MF_BT3`, or :const:`MF_BT4`.
ru: ``mf``: какой поисковик совпадений использовать -- :const:`MF_HC3`, :const:`MF_HC4`, :const:`MF_BT2`, :const:`MF_BT3` или :const:`MF_BT4`.

source: ``depth``: Maximum search depth used by match finder. 0 (default) means to select automatically based on other filter options.
ru: ``глубина``: максимальная глубина поиска, используемая средством поиска совпадений. 0 (по умолчанию) означает автоматический выбор на основе других параметров фильтра.

source: The delta filter stores the differences between bytes, producing more repetitive input for the compressor in certain circumstances. It supports one option, ``dist``. This indicates the distance between bytes to be subtracted. The default is 1, i.e. take the differences between adjacent bytes.
ru: Дельта-фильтр сохраняет различия между байтами, создавая при определенных обстоятельствах более повторяющиеся входные данные для компрессора. Он поддерживает одну опцию, ``dist``. Это указывает расстояние между байтами, которые необходимо вычесть. По умолчанию — 1, т.е. учитывается разница между соседними байтами.

source: The BCJ filters are intended to be applied to machine code. They convert relative branches, calls and jumps in the code to use absolute addressing, with the aim of increasing the redundancy that can be exploited by the compressor. These filters support one option, ``start_offset``. This specifies the address that should be mapped to the beginning of the input data. The default is 0.
ru: Фильтры BCJ предназначены для применения к машинному коду. Они преобразуют относительные переходы, вызовы и переходы в коде для использования абсолютной адресации с целью увеличения избыточности, которую может использовать компрессор. Эти фильтры поддерживают одну опцию — start_offset. Это указывает адрес, который должен быть сопоставлен с началом входных данных. Значение по умолчанию — 0.

source: Examples
ru: Примеры

source: Reading in a compressed file::
ru: Чтение в сжатом файле::

source: Creating a compressed file::
ru: Создание сжатого файла::

source: Compressing data in memory::
ru: Сжатие данных в памяти::

source: Incremental compression::
ru: Инкрементное сжатие::

source: Writing compressed data to an already-open file::
ru: Запись сжатых данных в уже открытый файл::

source: Creating a compressed file using a custom filter chain::
ru: Создание сжатого файла с использованием пользовательской цепочки фильтров:
