Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/lzma.po
Languages: ru

source: :mod:`!lzma` --- Compression using the LZMA algorithm
ru: :mod:`!lzma` --- Сжатие с использованием алгоритма LZMA.

source: **Source code:** :source:`Lib/lzma.py`
ru: **Исходный код:** :source:`Lib/lzma.py`

source: This module provides classes and convenience functions for compressing and decompressing data using the LZMA compression algorithm. Also included is a file interface supporting the ``.xz`` and legacy ``.lzma`` file formats used by the :program:`xz` utility, as well as raw compressed streams.
ru: Этот модуль предоставляет классы и удобные функции для сжатия и распаковки данных с использованием алгоритма сжатия LZMA. Также включен файловый интерфейс, поддерживающий файловые форматы ``.xz`` и устаревшие ``.lzma``, используемые утилитой :program:`xz`, а также необработанные сжатые потоки.

source: The interface provided by this module is very similar to that of the :mod:`bz2` module. Note that :class:`LZMAFile` and :class:`bz2.BZ2File` are *not* thread-safe, so if you need to use a single :class:`LZMAFile` instance from multiple threads, it is necessary to protect it with a lock.
ru: Интерфейс, предоставляемый этим модулем, очень похож на интерфейс модуля :mod:`bz2`. Обратите внимание, что :class:`LZMAFile` и :class:`bz2.BZ2File` *не* потокобезопасны, поэтому, если вам нужно использовать один экземпляр :class:`LZMAFile` из нескольких потоков, необходимо защитить его. с замком.

source: This exception is raised when an error occurs during compression or decompression, or while initializing the compressor/decompressor state.
ru: Это исключение возникает, когда возникает ошибка во время сжатия или распаковки или при инициализации состояния компрессора/декомпрессора.

source: Reading and writing compressed files
ru: Чтение и запись сжатых файлов

source: Open an LZMA-compressed file in binary or text mode, returning a :term:`file object`.
ru: Откройте файл, сжатый LZMA, в двоичном или текстовом режиме, вернув :term:`файловый объект`.

source: The *filename* argument can be either an actual file name (given as a :class:`str`, :class:`bytes` or :term:`path-like <path-like object>` object), in which case the named file is opened, or it can be an existing file object to read from or write to.
ru: Аргумент *filename* может быть либо фактическим именем файла (представленным в виде объекта :class:`str`, :class:`bytes` или :term:`path-like <path-like object>`), и в этом случае указанный файл открывается или это может быть существующий файловый объект для чтения или записи.

source: The *mode* argument can be any of ``"r"``, ``"rb"``, ``"w"``, ``"wb"``, ``"x"``, ``"xb"``, ``"a"`` or ``"ab"`` for binary mode, or ``"rt"``, ``"wt"``, ``"xt"``, or ``"at"`` for text mode. The default is ``"rb"``.
ru: Аргумент *mode* может быть любым из ``"r"``, ``"rb"``, ``"w"``, ``"wb"``, ``"x"``, `` `"xb"``, ``"a"`` или ``"ab"`` для двоичного режима или ``"rt"``, ``"wt"``, ``"xt"`` или ``"at"`` для текстового режима. По умолчанию используется ``"rb"``.

source: When opening a file for reading, the *format* and *filters* arguments have the same meanings as for :class:`LZMADecompressor`. In this case, the *check* and *preset* arguments should not be used.
ru: При открытии файла для чтения аргументы *format* и *filters* имеют то же значение, что и для :class:`LZMADecompressor`. В этом случае аргументы *check* и *preset* использовать не следует.

source: When opening a file for writing, the *format*, *check*, *preset* and *filters* arguments have the same meanings as for :class:`LZMACompressor`.
ru: При открытии файла для записи аргументы *format*, *check*, *preset* и *filters* имеют те же значения, что и для :class:`LZMACompressor`.

source: For binary mode, this function is equivalent to the :class:`LZMAFile` constructor: ``LZMAFile(filename, mode, ...)``. In this case, the *encoding*, *errors* and *newline* arguments must not be provided.
ru: Для двоичного режима эта функция эквивалентна конструктору :class:`LZMAFile`: ``LZMAFile(filename, mode, ...)``. В этом случае аргументы *encoding*, *errors* и *newline* указываться не должны.

source: For text mode, a :class:`LZMAFile` object is created, and wrapped in an :class:`io.TextIOWrapper` instance with the specified encoding, error handling behavior, and line ending(s).
ru: Для текстового режима создается объект :class:`LZMAFile` и обертывается в экземпляр :class:`io.TextIOWrapper` с указанной кодировкой, поведением обработки ошибок и окончанием(ями) строки.

source: Added support for the ``"x"``, ``"xb"`` and ``"xt"`` modes.
ru: Добавлена ​​поддержка режимов ``"x"``, ``"xb"`` и ``"xt"``.

source: Accepts a :term:`path-like object`.
ru: Принимает :term:`объект, похожий на путь`.

source: Open an LZMA-compressed file in binary mode.
ru: Откройте файл, сжатый LZMA, в двоичном режиме.

source: An :class:`LZMAFile` can wrap an already-open :term:`file object`, or operate directly on a named file. The *filename* argument specifies either the file object to wrap, or the name of the file to open (as a :class:`str`, :class:`bytes` or :term:`path-like <path-like object>` object). When wrapping an existing file object, the wrapped file will not be closed when the :class:`LZMAFile` is closed.
ru: :class:`LZMAFile` может оборачивать уже открытый :term:`файловый объект` или работать непосредственно с именованным файлом. Аргумент *filename* указывает либо объект файла, который нужно обернуть, либо имя файла, который нужно открыть (в виде :class:`str`, :class:`bytes` или :term:`path-like <path-like object >`объект). При упаковке существующего файлового объекта обернутый файл не будет закрыт при закрытии :class:`LZMAFile`.

source: The *mode* argument can be either ``"r"`` for reading (default), ``"w"`` for overwriting, ``"x"`` for exclusive creation, or ``"a"`` for appending. These can equivalently be given as ``"rb"``, ``"wb"``, ``"xb"`` and ``"ab"`` respectively.
ru: Аргументом *mode* может быть либо ``"r"`` для чтения (по умолчанию), ``"w"`` для перезаписи, ``"x"`` для эксклюзивного создания или ``"a"`` для добавления. Они могут быть эквивалентно заданы как ``"rb"``, ``"wb"``, ``"xb"`` и ``"ab"`` соответственно.

source: If *filename* is a file object (rather than an actual file name), a mode of ``"w"`` does not truncate the file, and is instead equivalent to ``"a"``.
ru: Если *filename* является файловым объектом (а не фактическим именем файла), режим ``"w"`` не усекает файл, а вместо этого эквивалентен ``"a"``.

source: When opening a file for reading, the input file may be the concatenation of multiple separate compressed streams. These are transparently decoded as a single logical stream.
ru: При открытии файла для чтения входной файл может представлять собой объединение нескольких отдельных сжатых потоков. Они прозрачно декодируются как один логический поток.

source: :class:`LZMAFile` supports all the members specified by :class:`io.BufferedIOBase`, except for :meth:`~io.BufferedIOBase.detach` and :meth:`~io.IOBase.truncate`. Iteration and the :keyword:`with` statement are supported.
ru: :class:`LZMAFile` поддерживает все члены, указанные в :class:`io.BufferedIOBase`, за исключением :meth:`~io.BufferedIOBase.detach` и :meth:`~io.IOBase.truncate`. Поддерживаются итерация и оператор :keyword:`with`.

source: The following method and attributes are also provided:
ru: Также предоставляются следующий метод и атрибуты:

source: Return buffered data without advancing the file position. At least one byte of data will be returned, unless EOF has been reached. The exact number of bytes returned is unspecified (the *size* argument is ignored).
ru: Возвращает буферизованные данные без изменения позиции файла. Будет возвращен как минимум один байт данных, если не достигнут EOF. Точное количество возвращаемых байтов не указано (аргумент *size* игнорируется).

source: While calling :meth:`peek` does not change the file position of the :class:`LZMAFile`, it may change the position of the underlying file object (e.g. if the :class:`LZMAFile` was constructed by passing a file object for *filename*).
ru: При вызове :meth:`peek` не изменяется положение файла :class:`LZMAFile`, он может изменить положение базового файлового объекта (например, если :class:`LZMAFile` был создан путем передачи файлового объекта для *имя файла*).

source: ``'rb'`` for reading and ``'wb'`` for writing.
ru: ``'rb'`` для чтения и ``'wb'`` для записи.

source: The lzma file name. Equivalent to the :attr:`~io.FileIO.name` attribute of the underlying :term:`file object`.
ru: Имя файла lzma. Эквивалент атрибута :attr:`~io.FileIO.name` базового :term:`файлового объекта`.

source: Added support for the ``"x"`` and ``"xb"`` modes.
ru: Добавлена ​​поддержка режимов ``"x"`` и ``"xb"``.

source: The :meth:`~io.BufferedIOBase.read` method now accepts an argument of ``None``.
ru: Метод :meth:`~io.BufferedIOBase.read` теперь принимает аргумент ``None``.

source: Compressing and decompressing data in memory
ru: Сжатие и распаковка данных в памяти

source: Create a compressor object, which can be used to compress data incrementally.
ru: Создайте объект компрессора, который можно использовать для постепенного сжатия данных.

source: For a more convenient way of compressing a single chunk of data, see :func:`compress`.
ru: Чтобы узнать о более удобном способе сжатия одного фрагмента данных, см. :func:`compress`.

source: The *format* argument specifies what container format should be used. Possible values are:
ru: Аргумент *format* указывает, какой формат контейнера следует использовать. Возможные значения:

source: :const:`FORMAT_XZ`: The ``.xz`` container format.
ru: :const:`FORMAT_XZ`: Формат контейнера ``.xz``.

source: This is the default format.
ru: Это формат по умолчанию.

source: :const:`FORMAT_ALONE`: The legacy ``.lzma`` container format.
ru: :const:`FORMAT_ALONE`: устаревший формат контейнера ``.lzma``.

source: This format is more limited than ``.xz`` -- it does not support integrity checks or multiple filters.
ru: Этот формат более ограничен, чем «.xz» — он не поддерживает проверки целостности или несколько фильтров.

source: :const:`FORMAT_RAW`: A raw data stream, not using any container format.
ru: :const:`FORMAT_RAW`: поток необработанных данных, не использующий какой-либо формат контейнера.

source: This format specifier does not support integrity checks, and requires that you always specify a custom filter chain (for both compression and decompression). Additionally, data compressed in this manner cannot be decompressed using :const:`FORMAT_AUTO` (see :class:`LZMADecompressor`).
ru: Этот спецификатор формата не поддерживает проверки целостности и требует, чтобы вы всегда указывали собственную цепочку фильтров (как для сжатия, так и для распаковки). Кроме того, данные, сжатые таким способом, невозможно распаковать с помощью :const:`FORMAT_AUTO` (см. :class:`LZMADecompressor`).

source: The *check* argument specifies the type of integrity check to include in the compressed data. This check is used when decompressing, to ensure that the data has not been corrupted. Possible values are:
ru: Аргумент *check* указывает тип проверки целостности, включаемой в сжатые данные. Эта проверка используется при распаковке, чтобы убедиться, что данные не повреждены. Возможные значения:

source: :const:`CHECK_NONE`: No integrity check. This is the default (and the only acceptable value) for :const:`FORMAT_ALONE` and :const:`FORMAT_RAW`.
ru: :const:`CHECK_NONE`: Нет проверки целостности. Это значение по умолчанию (и единственное приемлемое значение) для :const:`FORMAT_ALONE` и :const:`FORMAT_RAW`.

source: :const:`CHECK_CRC32`: 32-bit Cyclic Redundancy Check.
ru: :const:`CHECK_CRC32`: 32-битная проверка циклическим избыточным кодом.

source: :const:`CHECK_CRC64`: 64-bit Cyclic Redundancy Check. This is the default for :const:`FORMAT_XZ`.
ru: :const:`CHECK_CRC64`: 64-битная проверка циклическим избыточным кодом. Это значение по умолчанию для :const:`FORMAT_XZ`.

source: :const:`CHECK_SHA256`: 256-bit Secure Hash Algorithm.
ru: :const:`CHECK_SHA256`: 256-битный алгоритм безопасного хеширования.

source: If the specified check is not supported, an :class:`LZMAError` is raised.
ru: Если указанная проверка не поддерживается, возникает ошибка :class:`LZMAError`.

source: The compression settings can be specified either as a preset compression level (with the *preset* argument), or in detail as a custom filter chain (with the *filters* argument).
ru: Настройки сжатия можно указать либо в виде предустановленного уровня сжатия (с аргументом *preset*), либо в виде подробной цепочки настраиваемых фильтров (с аргументом *filters*).

source: The *preset* argument (if provided) should be an integer between ``0`` and ``9`` (inclusive), optionally OR-ed with the constant :const:`PRESET_EXTREME`. If neither *preset* nor *filters* are given, the default behavior is to use :const:`PRESET_DEFAULT` (preset level ``6``). Higher presets produce smaller output, but make the compression process slower.
ru: Аргумент *preset* (если он предусмотрен) должен быть целым числом от ``0`` до ``9`` (включительно), опционально с операцией ИЛИ с константой :const:`PRESET_EXTREME`. Если не указаны ни *preset*, ни *filters*, по умолчанию используется :const:`PRESET_DEFAULT` (предустановленный уровень ``6``). Более высокие настройки дают меньший результат, но замедляют процесс сжатия.

source: In addition to being more CPU-intensive, compression with higher presets also requires much more memory (and produces output that needs more memory to decompress). With preset ``9`` for example, the overhead for an :class:`LZMACompressor` object can be as high as 800 MiB. For this reason, it is generally best to stick with the default preset.
ru: Помимо более интенсивного использования ЦП, сжатие с более высокими предустановками также требует гораздо больше памяти (и создает выходные данные, для распаковки которых требуется больше памяти). Например, при использовании предустановки ``9`` накладные расходы для объекта :class:`LZMACompressor` могут достигать 800 МБ. По этой причине, как правило, лучше придерживаться настроек по умолчанию.

source: The *filters* argument (if provided) should be a filter chain specifier. See :ref:`filter-chain-specs` for details.
ru: Аргумент *filters* (если он указан) должен быть спецификатором цепочки фильтров. Подробности смотрите в :ref:`filter-chain-specs`.

source: Compress *data* (a :class:`bytes` object), returning a :class:`bytes` object containing compressed data for at least part of the input. Some of *data* may be buffered internally, for use in later calls to :meth:`compress` and :meth:`flush`. The returned data should be concatenated with the output of any previous calls to :meth:`compress`.
ru: Сжать *data* (объект :class:`bytes`), вернув объект :class:`bytes`, содержащий сжатые данные, по крайней мере, для части входных данных. Некоторые *данные* могут быть буферизованы внутри для использования в последующих вызовах :meth:`compress` и :meth:`flush`. Возвращенные данные должны быть объединены с выводом любых предыдущих вызовов :meth:`compress`.

source: Finish the compression process, returning a :class:`bytes` object containing any data stored in the compressor's internal buffers.
ru: Завершите процесс сжатия, вернув объект :class:`bytes`, содержащий любые данные, хранящиеся во внутренних буферах компрессора.

source: The compressor cannot be used after this method has been called.
ru: Компрессор нельзя использовать после вызова этого метода.

source: Create a decompressor object, which can be used to decompress data incrementally.
ru: Создайте объект распаковщика, который можно использовать для постепенной распаковки данных.

source: For a more convenient way of decompressing an entire compressed stream at once, see :func:`decompress`.
ru: Более удобный способ одновременной распаковки всего сжатого потока см. в разделе :func:`decompress`.

source: The *format* argument specifies the container format that should be used. The default is :const:`FORMAT_AUTO`, which can decompress both ``.xz`` and ``.lzma`` files. Other possible values are :const:`FORMAT_XZ`, :const:`FORMAT_ALONE`, and :const:`FORMAT_RAW`.
ru: Аргумент *format* указывает формат контейнера, который следует использовать. По умолчанию используется :const:`FORMAT_AUTO`, который может распаковывать файлы ``.xz`` и ``.lzma``. Другие возможные значения: :const:`FORMAT_XZ`, :const:`FORMAT_ALONE` и :const:`FORMAT_RAW`.

source: The *memlimit* argument specifies a limit (in bytes) on the amount of memory that the decompressor can use. When this argument is used, decompression will fail with an :class:`LZMAError` if it is not possible to decompress the input within the given memory limit.
ru: Аргумент *memlimit* определяет ограничение (в байтах) объема памяти, которую может использовать декомпрессор. Когда используется этот аргумент, распаковка завершится с ошибкой :class:`LZMAError`, если невозможно распаковать входные данные в пределах заданного предела памяти.

source: The *filters* argument specifies the filter chain that was used to create the stream being decompressed. This argument is required if *format* is :const:`FORMAT_RAW`, but should not be used for other formats. See :ref:`filter-chain-specs` for more information about filter chains.
ru: Аргумент *filters* указывает цепочку фильтров, которая использовалась для создания распаковываемого потока. Этот аргумент необходим, если *format* имеет значение :const:`FORMAT_RAW`, но не должен использоваться для других форматов. См. :ref:`filter-chain-specs` для получения дополнительной информации о цепочках фильтров.

source: This class does not transparently handle inputs containing multiple compressed streams, unlike :func:`decompress` and :class:`LZMAFile`. To decompress a multi-stream input with :class:`LZMADecompressor`, you must create a new decompressor for each stream.
ru: Этот класс не обрабатывает прозрачным образом входные данные, содержащие несколько сжатых потоков, в отличие от :func:`decompress` и :class:`LZMAFile`. Чтобы распаковать многопоточный ввод с помощью :class:`LZMADecompressor`, вы должны создать новый декомпрессор для каждого потока.

source: Decompress *data* (a :term:`bytes-like object`), returning uncompressed data as bytes. Some of *data* may be buffered internally, for use in later calls to :meth:`decompress`. The returned data should be concatenated with the output of any previous calls to :meth:`decompress`.
ru: Распакуйте *data* (объект, похожий на :term:`bytes`), вернув несжатые данные в виде байтов. Некоторые *данные* могут быть помещены в буфер для использования в последующих вызовах :meth:`decompress`. Возвращенные данные должны быть объединены с выводом любых предыдущих вызовов :meth:`decompress`.

source: If *max_length* is nonnegative, returns at most *max_length* bytes of decompressed data. If this limit is reached and further output can be produced, the :attr:`~.needs_input` attribute will be set to ``False``. In this case, the next call to :meth:`~.decompress` may provide *data* as ``b''`` to obtain more of the output.
ru: Если *max_length* неотрицательно, возвращает не более *max_length* байт распакованных данных. Если этот предел достигнут и возможен дальнейший вывод, атрибуту :attr:`~.needs_input` будет присвоено значение ``False``. В этом случае следующий вызов :meth:`~.decompress` может предоставить *data* как ``b''``, чтобы получить больше выходных данных.

source: If all of the input data was decompressed and returned (either because this was less than *max_length* bytes, or because *max_length* was negative), the :attr:`~.needs_input` attribute will be set to ``True``.
ru: Если все входные данные были распакованы и возвращены (либо потому, что оно было меньше *max_length* байт, либо потому, что *max_length* было отрицательным), атрибуту :attr:`~.needs_input` будет присвоено значение ``True`` .

source: Attempting to decompress data after the end of stream is reached raises an :exc:`EOFError`. Any data found after the end of the stream is ignored and saved in the :attr:`~.unused_data` attribute.
ru: Попытка распаковать данные после достижения конца потока вызывает ошибку :exc:`EOFError`. Любые данные, найденные после окончания потока, игнорируются и сохраняются в атрибуте :attr:`~.unused_data`.

source: Added the *max_length* parameter.
ru: Добавлен параметр *max_length*.

source: The ID of the integrity check used by the input stream. This may be :const:`CHECK_UNKNOWN` until enough of the input has been decoded to determine what integrity check it uses.
ru: Идентификатор проверки целостности, используемый входным потоком. Это может быть :const:`CHECK_UNKNOWN` до тех пор, пока не будет декодировано достаточное количество входных данных, чтобы определить, какую проверку целостности он использует.

source: ``True`` if the end-of-stream marker has been reached.
ru: ``True``, если достигнут маркер конца потока.

source: Data found after the end of the compressed stream.
ru: Данные найдены после окончания сжатого потока.

source: Before the end of the stream is reached, this will be ``b""``.
ru: До достижения конца потока это будет ``b""``.

source: ``False`` if the :meth:`.decompress` method can provide more decompressed data before requiring new uncompressed input.
ru: ``False``, если метод :meth:`.decompress` может предоставить больше распакованных данных, прежде чем потребуется новый несжатый ввод.

source: Compress *data* (a :class:`bytes` object), returning the compressed data as a :class:`bytes` object.
ru: Сжать *data* (объект :class:`bytes`), вернув сжатые данные как объект :class:`bytes`.

source: See :class:`LZMACompressor` above for a description of the *format*, *check*, *preset* and *filters* arguments.
ru: См. выше :class:`LZMACompressor` для описания аргументов *format*, *check*, *preset* и *filters*.

source: Decompress *data* (a :class:`bytes` object), returning the uncompressed data as a :class:`bytes` object.
ru: Распакуйте *data* (объект :class:`bytes`), вернув несжатые данные как объект :class:`bytes`.

source: If *data* is the concatenation of multiple distinct compressed streams, decompress all of these streams, and return the concatenation of the results.
ru: Если *данные* представляют собой объединение нескольких различных сжатых потоков, распакуйте все эти потоки и верните объединение результатов.

source: See :class:`LZMADecompressor` above for a description of the *format*, *memlimit* and *filters* arguments.
ru: См. выше :class:`LZMADecompressor` для описания аргументов *format*, *memlimit* и *filters*.

source: Miscellaneous
ru: Разное

source: Return ``True`` if the given integrity check is supported on this system.
ru: Верните True, если данная проверка целостности поддерживается в этой системе.

source: :const:`CHECK_NONE` and :const:`CHECK_CRC32` are always supported. :const:`CHECK_CRC64` and :const:`CHECK_SHA256` may be unavailable if you are using a version of :program:`liblzma` that was compiled with a limited feature set.
ru: :const:`CHECK_NONE` и :const:`CHECK_CRC32` всегда поддерживаются. :const:`CHECK_CRC64` и :const:`CHECK_SHA256` могут быть недоступны, если вы используете версию :program:`liblzma`, скомпилированную с ограниченным набором функций.

source: Specifying custom filter chains
ru: Указание пользовательских цепочек фильтров
