Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/marshal.po
Languages: ru

source: :mod:`!marshal` --- Internal Python object serialization
ru: :mod:`!marshal` --- Внутренняя сериализация объектов Python

source: This module contains functions that can read and write Python values in a binary format. The format is specific to Python, but independent of machine architecture issues (e.g., you can write a Python value to a file on a PC, transport the file to a Mac, and read it back there). Details of the format are undocumented on purpose; it may change between Python versions (although it rarely does). [#]_
ru: Этот модуль содержит функции, которые могут читать и записывать значения Python в двоичном формате. Формат специфичен для Python, но не зависит от проблем машинной архитектуры (например, вы можете записать значение Python в файл на ПК, перенести файл на Mac и прочитать его там). Детали формата намеренно недокументированы; оно может меняться в разных версиях Python (хотя это случается редко). [#]_

source: This is not a general "persistence" module. For general persistence and transfer of Python objects through RPC calls, see the modules :mod:`pickle` and :mod:`shelve`. The :mod:`marshal` module exists mainly to support reading and writing the "pseudo-compiled" code for Python modules of :file:`.pyc` files. Therefore, the Python maintainers reserve the right to modify the marshal format in backward incompatible ways should the need arise. The format of code objects is not compatible between Python versions, even if the version of the format is the same. De-serializing a code object in the incorrect Python version has undefined behavior. If you're serializing and de-serializing Python objects, use the :mod:`pickle` module instead -- the performance is comparable, version independence is guaranteed, and pickle supports a substantially wider range of objects than marshal.
ru: Это не общий модуль «постоянства». Общие сведения о сохранении и передаче объектов Python посредством вызовов RPC см. в модулях :mod:`pickle` и :mod:`shelve`. Модуль :mod:`marshal` существует главным образом для поддержки чтения и записи «псевдоскомпилированного» кода для модулей Python файлов :file:`.pyc`. Поэтому сопровождающие Python оставляют за собой право изменять формат маршала обратно несовместимыми способами, если возникнет такая необходимость. Формат объектов кода несовместим между версиями Python, даже если версия формата одинакова. Десериализация объекта кода в неправильной версии Python имеет неопределенное поведение. Если вы сериализуете и десериализуете объекты Python, используйте вместо этого модуль :mod:`pickle` — производительность сопоставима, независимость версий гарантирована, а Pickle поддерживает значительно более широкий диапазон объектов, чем Marshal.

source: The :mod:`marshal` module is not intended to be secure against erroneous or maliciously constructed data. Never unmarshal data received from an untrusted or unauthenticated source.
ru: Модуль :mod:`marshal` не предназначен для защиты от ошибочных или злонамеренно созданных данных. Никогда не демаршализуйте данные, полученные из ненадежного или неаутентифицированного источника.

source: Not all Python object types are supported; in general, only objects whose value is independent from a particular invocation of Python can be written and read by this module. The following types are supported: booleans, integers, floating-point numbers, complex numbers, strings, bytes, bytearrays, tuples, lists, sets, frozensets, dictionaries, and code objects (if *allow_code* is true), where it should be understood that tuples, lists, sets, frozensets and dictionaries are only supported as long as the values contained therein are themselves supported. The singletons :const:`None`, :const:`Ellipsis` and :exc:`StopIteration` can also be marshalled and unmarshalled. For format *version* lower than 3, recursive lists, sets and dictionaries cannot be written (see below).
ru: Поддерживаются не все типы объектов Python; в общем, этим модулем могут быть записаны и прочитаны только объекты, значение которых не зависит от конкретного вызова Python. Поддерживаются следующие типы: логические значения, целые числа, числа с плавающей запятой, комплексные числа, строки, байты, байтовые массивы, кортежи, списки, наборы, замороженные наборы, словари и объекты кода (если *allow_code* имеет значение true), где это должно быть. понял, что кортежи, списки, наборы, замороженные наборы и словари поддерживаются только до тех пор, пока поддерживаются содержащиеся в них значения. Синглтоны :const:`None`, :const:`Ellipsis` и :exc:`StopIteration` также могут быть маршалированы и демаршаллированы. Для формата *версия* ниже 3 невозможно создавать рекурсивные списки, множества и словари (см. ниже).

source: There are functions that read/write files as well as functions operating on bytes-like objects.
ru: Существуют функции, которые читают/записывают файлы, а также функции, работающие с байтоподобными объектами.

source: The module defines these functions:
ru: Модуль определяет следующие функции:

source: Write the value on the open file. The value must be a supported type. The file must be a writeable :term:`binary file`.
ru: Запишите значение в открытый файл. Значение должно быть поддерживаемого типа. Файл должен быть доступным для записи бинарным файлом.

source: If the value has (or contains an object that has) an unsupported type, a :exc:`ValueError` exception is raised --- but garbage data will also be written to the file. The object will not be properly read back by :func:`load`. :ref:`Code objects <code-objects>` are only supported if *allow_code* is true.
ru: Если значение имеет (или содержит объект, который имеет) неподдерживаемый тип, возникает исключение :exc:`ValueError` --- но в файл также будут записаны мусорные данные. Объект не будет правильно прочитан функцией :func:`load`. :ref:`Объекты кода <code-objects>` поддерживаются только в том случае, если *allow_code* имеет значение true.

source: The *version* argument indicates the data format that ``dump`` should use (see below).
ru: Аргумент *version* указывает формат данных, который должен использовать ``dump`` (см. ниже).

source: Raises an :ref:`auditing event <auditing>` ``marshal.dumps`` with arguments ``value``, ``version``.
ru: Вызывает :ref:`событие аудита <auditing>``marshal.dumps`` с аргументами ``value``, ``version``.

source: Added the *allow_code* parameter.
ru: Добавлен параметр *allow_code*.

source: Read one value from the open file and return it. If no valid value is read (e.g. because the data has a different Python version's incompatible marshal format), raise :exc:`EOFError`, :exc:`ValueError` or :exc:`TypeError`. :ref:`Code objects <code-objects>` are only supported if *allow_code* is true. The file must be a readable :term:`binary file`.
ru: Прочитайте одно значение из открытого файла и верните его. Если допустимое значение не считывается (например, потому что данные имеют формат маршала, несовместимый с другой версией Python), вызовите :exc:`EOFError`, :exc:`ValueError` или :exc:`TypeError`. :ref:`Объекты кода <code-objects>` поддерживаются только в том случае, если *allow_code* имеет значение true. Файл должен быть читаемым:term:`двоичным файлом`.

source: Raises an :ref:`auditing event <auditing>` ``marshal.load`` with no arguments.
ru: Вызывает :ref:`событие аудита <auditing>``marshal.load`` без аргументов.

source: If an object containing an unsupported type was marshalled with :func:`dump`, :func:`load` will substitute ``None`` for the unmarshallable type.
ru: Если объект, содержащий неподдерживаемый тип, был маршалирован с помощью :func:`dump`, :func:`load` заменит ``None`` на немаршализуемый тип.

source: This call used to raise a ``code.__new__`` audit event for each code object. Now it raises a single ``marshal.load`` event for the entire load operation.
ru: Этот вызов используется для создания события аудита ``code.__new__`` для каждого объекта кода. Теперь он вызывает одно событие marshal.load для всей операции загрузки.

source: Return the bytes object that would be written to a file by ``dump(value, file)``. The value must be a supported type. Raise a :exc:`ValueError` exception if value has (or contains an object that has) an unsupported type. :ref:`Code objects <code-objects>` are only supported if *allow_code* is true.
ru: Возвращает объект байтов, который будет записан в файл с помощью ``dump(value, file)``. Значение должно быть поддерживаемого типа. Вызовите исключение :exc:`ValueError`, если значение имеет (или содержит объект, который имеет) неподдерживаемый тип. :ref:`Объекты кода <code-objects>` поддерживаются только в том случае, если *allow_code* имеет значение true.

source: The *version* argument indicates the data format that ``dumps`` should use (see below).
ru: Аргумент *version* указывает формат данных, который должен использовать ``dumps`` (см. ниже).

source: Convert the :term:`bytes-like object` to a value. If no valid value is found, raise :exc:`EOFError`, :exc:`ValueError` or :exc:`TypeError`. :ref:`Code objects <code-objects>` are only supported if *allow_code* is true. Extra bytes in the input are ignored.
ru: Преобразуйте :term:`байтовый объект` в значение. Если допустимое значение не найдено, вызовите :exc:`EOFError`, :exc:`ValueError` или :exc:`TypeError`. :ref:`Объекты кода <code-objects>` поддерживаются только в том случае, если *allow_code* имеет значение true. Дополнительные байты во входных данных игнорируются.

source: Raises an :ref:`auditing event <auditing>` ``marshal.loads`` with argument ``bytes``.
ru: Вызывает :ref:`событие аудита <auditing>``marshal.loads`` с аргументом ``bytes``.

source: This call used to raise a ``code.__new__`` audit event for each code object. Now it raises a single ``marshal.loads`` event for the entire load operation.
ru: Этот вызов используется для создания события аудита ``code.__new__`` для каждого объекта кода. Теперь он вызывает одно событие marshal.loads для всей операции загрузки.

source: In addition, the following constants are defined:
ru: Кроме того, определены следующие константы:

source: Indicates the format that the module uses. Version 0 is the historical format, version 1 shares interned strings and version 2 uses a binary format for floating-point numbers. Version 3 adds support for object instancing and recursion. The current version is 4.
ru: Указывает формат, который использует модуль. Версия 0 — это исторический формат, версия 1 использует встроенные строки, а версия 2 использует двоичный формат для чисел с плавающей запятой. Версия 3 добавляет поддержку создания экземпляров объектов и рекурсии. Текущая версия — 4.

source: Footnotes
ru: Сноски

source: The name of this module stems from a bit of terminology used by the designers of Modula-3 (amongst others), who use the term "marshalling" for shipping of data around in a self-contained form. Strictly speaking, "to marshal" means to convert some data from internal to external form (in an RPC buffer for instance) and "unmarshalling" for the reverse process.
ru: Название этого модуля происходит от терминологии, используемой разработчиками Модулы-3 (среди прочих), которые используют термин «маршалинг» для передачи данных в автономной форме. Строго говоря, «маршалинг» означает преобразование некоторых данных из внутренней во внешнюю форму (например, в буфере RPC) и «демаршалинг» для обратного процесса.

source: module
ru: модуль

source: shelve
ru: полка

source: object
ru: объект

source: code
ru: код

source: code object
ru: объект кода
