Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/math.po
Languages: ru

source: Return ``True`` if *x* is a NaN (not a number), and ``False`` otherwise.
ru: Возвращайте ``True``, если *x* — это NaN (не число), и ``False`` в противном случае.

source: Return ``x * (2**i)``. This is essentially the inverse of function :func:`frexp`.
ru: Верните ``x * (2**i)``. По сути, это обратная функция :func:`frexp`.

source: Return the floating-point value *steps* steps after *x* towards *y*.
ru: Возвращает значение с плавающей запятой *шаги* шаги после *x* в сторону *y*.

source: If *x* is equal to *y*, return *y*, unless *steps* is zero.
ru: Если *x* равно *y*, верните *y*, если только *steps* не равно нулю.

source: Examples:
ru: Примеры:

source: ``math.nextafter(x, math.inf)`` goes up: towards positive infinity.
ru: ``math.nextafter(x, math.inf)`` идет вверх: в сторону положительной бесконечности.

source: ``math.nextafter(x, -math.inf)`` goes down: towards minus infinity.
ru: ``math.nextafter(x, -math.inf)`` снижается: в сторону минус бесконечности.

source: ``math.nextafter(x, 0.0)`` goes towards zero.
ru: ``math.nextafter(x, 0.0)`` стремится к нулю.

source: ``math.nextafter(x, math.copysign(math.inf, x))`` goes away from zero.
ru: ``math.nextafter(x, math.copysign(math.inf, x))`` уходит от нуля.

source: See also :func:`math.ulp`.
ru: См. также :func:`math.ulp`.

source: Added the *steps* argument.
ru: Добавлен аргумент *steps*.

source: Return the value of the least significant bit of the float *x*:
ru: Вернуть значение младшего бита числа с плавающей запятой *x*:

source: If *x* is a NaN (not a number), return *x*.
ru: Если *x* — это NaN (не число), верните *x*.

source: If *x* is negative, return ``ulp(-x)``.
ru: Если *x* отрицательное значение, верните ``ulp(-x)``.

source: If *x* is a positive infinity, return *x*.
ru: Если *x* — положительная бесконечность, верните *x*.

source: If *x* is equal to zero, return the smallest positive *denormalized* representable float (smaller than the minimum positive *normalized* float, :data:`sys.float_info.min <sys.float_info>`).
ru: Если *x* равно нулю, верните наименьшее положительное *денормализованное* представимое число с плавающей запятой (меньше, чем минимальное положительное *нормализованное* число с плавающей запятой, :data:`sys.float_info.min <sys.float_info>`).

source: If *x* is equal to the largest positive representable float, return the value of the least significant bit of *x*, such that the first float smaller than *x* is ``x - ulp(x)``.
ru: Если *x* равно наибольшему положительному представимому числу с плавающей запятой, верните значение младшего бита *x*, так, чтобы первое число с плавающей запятой меньше *x* было ``x - ulp(x)``.

source: Otherwise (*x* is a positive finite number), return the value of the least significant bit of *x*, such that the first float bigger than *x* is ``x + ulp(x)``.
ru: В противном случае (*x* — положительное конечное число) верните значение младшего бита *x*, чтобы первое число с плавающей запятой, большее *x*, было ``x + ulp(x)``.

source: ULP stands for "Unit in the Last Place".
ru: ULP означает «Единица на последнем месте».

source: See also :func:`math.nextafter` and :data:`sys.float_info.epsilon <sys.float_info>`.
ru: См. также :func:`math.nextafter` и :data:`sys.float_info.epsilon <sys.float_info>`.

source: Power, exponential and logarithmic functions
ru: Степенные, показательные и логарифмические функции

source: Return the cube root of *x*.
ru: Возвращает кубический корень *x*.

source: Return *e* raised to the power *x*, where *e* = 2.718281... is the base of natural logarithms. This is usually more accurate than ``math.e ** x`` or ``pow(math.e, x)``.
ru: Верните *e*, возведенное в степень *x*, где *e* = 2,718281... — это основание натуральных логарифмов. Обычно это более точно, чем ``math.e ** x`` или ``pow(math.e, x)``.

source: Return *2* raised to the power *x*.
ru: Верните *2*, возведенную в степень *x*.

source: Return *e* raised to the power *x*, minus 1. Here *e* is the base of natural logarithms. For small floats *x*, the subtraction in ``exp(x) - 1`` can result in a `significant loss of precision <https://en.wikipedia.org/wiki/Loss_of_significance>`_\; the :func:`expm1` function provides a way to compute this quantity to full precision:
ru: Верните *e*, возведенное в степень *x*, минус 1. Здесь *e* — это основание натуральных логарифмов. Для небольших чисел с плавающей запятой *x* вычитание в ``exp(x) - 1`` может привести к ``значительной потере точности <https://en.wikipedia.org/wiki/Loss_of_significance>`_\; функция :func:`expm1` позволяет вычислить эту величину с полной точностью:

source: With one argument, return the natural logarithm of *x* (to base *e*).
ru: С одним аргументом верните натуральный логарифм *x* (по основанию *e*).

source: With two arguments, return the logarithm of *x* to the given *base*, calculated as ``log(x)/log(base)``.
ru: С двумя аргументами верните логарифм *x* по заданному *base*, рассчитанному как ``log(x)/log(base)``.

source: Return the natural logarithm of *1+x* (base *e*). The result is calculated in a way which is accurate for *x* near zero.
ru: Вернуть натуральный логарифм *1+x* (по основанию *e*). Результат рассчитывается способом, который является точным для *x*, близкого к нулю.

source: Return the base-2 logarithm of *x*. This is usually more accurate than ``log(x, 2)``.
ru: Возвращает логарифм по основанию 2 числа *x*. Обычно это более точно, чем ``log(x, 2)``.

source: :meth:`int.bit_length` returns the number of bits necessary to represent an integer in binary, excluding the sign and leading zeros.
ru: :meth:`int.bit_length` возвращает количество битов, необходимых для представления целого числа в двоичном виде, исключая знак и ведущие нули.

source: Return the base-10 logarithm of *x*. This is usually more accurate than ``log(x, 10)``.
ru: Возвращает десятичный логарифм числа *x*. Обычно это более точно, чем ``log(x, 10)``.

source: Return *x* raised to the power *y*. Exceptional cases follow the IEEE 754 standard as far as possible. In particular, ``pow(1.0, x)`` and ``pow(x, 0.0)`` always return ``1.0``, even when *x* is a zero or a NaN. If both *x* and *y* are finite, *x* is negative, and *y* is not an integer then ``pow(x, y)`` is undefined, and raises :exc:`ValueError`.
ru: Верните *x*, возведенное в степень *y*. В исключительных случаях, насколько это возможно, следуйте стандарту IEEE 754. В частности, ``pow(1.0, x)`` и ``pow(x, 0.0)`` всегда возвращают ``1.0``, даже если *x* равно нулю или NaN. Если оба *x* и *y* конечны, *x* отрицательное значение и *y* не является целым числом, тогда ``pow(x, y)`` не определен и вызывает :exc:`ValueError`.

source: Unlike the built-in ``**`` operator, :func:`math.pow` converts both its arguments to type :class:`float`. Use ``**`` or the built-in :func:`pow` function for computing exact integer powers.
ru: В отличие от встроенного оператора ``**``, :func:`math.pow` преобразует оба своих аргумента в тип :class:`float`. Используйте ``**`` или встроенную функцию :func:`pow` для вычисления точных целочисленных степеней.

source: The special cases ``pow(0.0, -inf)`` and ``pow(-0.0, -inf)`` were changed to return ``inf`` instead of raising :exc:`ValueError`, for consistency with IEEE 754.
ru: Особые случаи ``pow(0.0, -inf)`` и ``pow(-0.0, -inf)`` были изменены, чтобы возвращать ``inf`` вместо вызова :exc:`ValueError`, для согласованности с IEEE. 754.

source: Return the square root of *x*.
ru: Вернуть квадратный корень из *x*.

source: Summation and product functions
ru: Суммирование и функции произведения

source: Return the Euclidean distance between two points *p* and *q*, each given as a sequence (or iterable) of coordinates. The two points must have the same dimension.
ru: Возвращает евклидово расстояние между двумя точками *p* и *q*, каждая из которых задана как последовательность (или итерация) координат. Обе точки должны иметь одинаковый размер.

source: Roughly equivalent to::
ru: Примерно эквивалентно::

source: Return an accurate floating-point sum of values in the iterable. Avoids loss of precision by tracking multiple intermediate partial sums.
ru: Возвращает точную сумму значений с плавающей запятой в итерируемом объекте. Избегает потери точности за счет отслеживания нескольких промежуточных частичных сумм.

source: The algorithm's accuracy depends on IEEE-754 arithmetic guarantees and the typical case where the rounding mode is half-even. On some non-Windows builds, the underlying C library uses extended precision addition and may occasionally double-round an intermediate sum causing it to be off in its least significant bit.
ru: Точность алгоритма зависит от арифметических гарантий IEEE-754 и типичного случая, когда режим округления является получетным. В некоторых сборках, отличных от Windows, базовая библиотека C использует сложение с повышенной точностью и иногда может дважды округлять промежуточную сумму, что приводит к ее отключению в наименее значимом бите.

source: For further discussion and two alternative approaches, see the `ASPN cookbook recipes for accurate floating-point summation <https://code.activestate.com/recipes/393090-binary-floating-point-summation-accurate-to-full-p/>`_\.
ru: Для дальнейшего обсуждения и двух альтернативных подходов см. «Рецепты ASPN для точного суммирования с плавающей запятой <https://code.activestate.com/recipes/393090-binary-floating-point-summation-accurate-to-full-p». />`_\.

source: Return the Euclidean norm, ``sqrt(sum(x**2 for x in coordinates))``. This is the length of the vector from the origin to the point given by the coordinates.
ru: Возвращает евклидову норму ``sqrt(sum(x**2 for x в координатах))``. Это длина вектора от начала координат до точки, заданной координатами.

source: For a two dimensional point ``(x, y)``, this is equivalent to computing the hypotenuse of a right triangle using the Pythagorean theorem, ``sqrt(x*x + y*y)``.
ru: Для двумерной точки ``(x, y)`` это эквивалентно вычислению гипотенузы прямоугольного треугольника с использованием теоремы Пифагора ``sqrt(x*x + y*y)``.

source: Added support for n-dimensional points. Formerly, only the two dimensional case was supported.
ru: Добавлена ​​поддержка n-мерных точек. Раньше поддерживался только двумерный случай.

source: Improved the algorithm's accuracy so that the maximum error is under 1 ulp (unit in the last place). More typically, the result is almost always correctly rounded to within 1/2 ulp.
ru: Повышена точность алгоритма, теперь максимальная ошибка составляет менее 1 ulp (единица на последнем месте). Чаще всего результат почти всегда правильно округляется с точностью до 1/2 ulp.

source: Calculate the product of all the elements in the input *iterable*. The default *start* value for the product is ``1``.
ru: Вычислите произведение всех элементов входных данных *iterable*. Значение *start* по умолчанию для продукта — ``1``.

source: When the iterable is empty, return the start value. This function is intended specifically for use with numeric values and may reject non-numeric types.
ru: Когда итерируемый объект пуст, верните начальное значение. Эта функция предназначена специально для использования с числовыми значениями и может отклонять нечисловые типы.

source: Return the sum of products of values from two iterables *p* and *q*.
ru: Возвращает сумму произведений значений двух итераций *p* и *q*.

source: Raises :exc:`ValueError` if the inputs do not have the same length.
ru: Вызывает :exc:`ValueError`, если входные данные имеют разную длину.

source: For float and mixed int/float inputs, the intermediate products and sums are computed with extended precision.
ru: Для входных данных с плавающей запятой и смешанных значений типа int/float промежуточные продукты и суммы вычисляются с повышенной точностью.

source: Angular conversion
ru: Ангулярное преобразование

source: Convert angle *x* from radians to degrees.
ru: Преобразуйте угол *x* из радиан в градусы.

source: Convert angle *x* from degrees to radians.
ru: Преобразуйте угол *x* из градусов в радианы.

source: Trigonometric functions
ru: Тригонометрические функции

source: Return the arc cosine of *x*, in radians. The result is between ``0`` and ``pi``.
ru: Возвращает арккосинус *x* в радианах. Результат находится между ``0`` и ``pi``.

source: Return the arc sine of *x*, in radians. The result is between ``-pi/2`` and ``pi/2``.
ru: Возвращает арксинус *x* в радианах. Результат находится между ``-pi/2`` и ``pi/2``.

source: Return the arc tangent of *x*, in radians. The result is between ``-pi/2`` and ``pi/2``.
ru: Возвращает арктангенс *x* в радианах. Результат находится между ``-pi/2`` и ``pi/2``.

source: Return ``atan(y / x)``, in radians. The result is between ``-pi`` and ``pi``. The vector in the plane from the origin to point ``(x, y)`` makes this angle with the positive X axis. The point of :func:`atan2` is that the signs of both inputs are known to it, so it can compute the correct quadrant for the angle. For example, ``atan(1)`` and ``atan2(1, 1)`` are both ``pi/4``, but ``atan2(-1, -1)`` is ``-3*pi/4``.
ru: Верните ``atan(y / x)`` в радианах. Результат находится между ``-pi`` и ``pi``. Вектор в плоскости от начала координат до точки ``(x, y)`` составляет этот угол с положительной осью X. Суть :func:`atan2` в том, что ему известны знаки обоих входов, поэтому он может вычислить правильный квадрант для угла. Например, ``atan(1)`` и ``atan2(1, 1)`` оба являются ``pi/4``, но ``atan2(-1, -1)`` — это ``-3. *pi/4``.

source: Return the cosine of *x* radians.
ru: Возвращает косинус *x* радиан.

source: Return the sine of *x* radians.
ru: Возвращает синус *x* радиан.

source: Return the tangent of *x* radians.
ru: Возвращает тангенс *x* радиан.

source: Hyperbolic functions
ru: Гиперболические функции

source: `Hyperbolic functions <https://en.wikipedia.org/wiki/Hyperbolic_functions>`_ are analogs of trigonometric functions that are based on hyperbolas instead of circles.
ru: `Гиперболические функции <https://en.wikipedia.org/wiki/Hyperbolic_functions>`_ — это аналоги тригонометрических функций, основанные на гиперболах вместо окружностей.

source: Return the inverse hyperbolic cosine of *x*.
ru: Возвращает обратный гиперболический косинус *x*.

source: Return the inverse hyperbolic sine of *x*.
ru: Возвращает обратный гиперболический синус *x*.

source: Return the inverse hyperbolic tangent of *x*.
ru: Возвращает обратный гиперболический тангенс *x*.

source: Return the hyperbolic cosine of *x*.
ru: Верните гиперболический косинус *x*.

source: Return the hyperbolic sine of *x*.
ru: Верните гиперболический синус *x*.

source: Return the hyperbolic tangent of *x*.
ru: Возвращает гиперболический тангенс *x*.

source: Special functions
ru: Специальные функции

source: Return the `error function <https://en.wikipedia.org/wiki/Error_function>`_ at *x*.
ru: Верните функцию ошибки <https://en.wikipedia.org/wiki/Error_function>`_ в *x*.

source: The :func:`erf` function can be used to compute traditional statistical functions such as the `cumulative standard normal distribution <https://en.wikipedia.org/wiki/Cumulative_distribution_function>`_::
ru: Функцию :func:`erf` можно использовать для вычисления традиционных статистических функций, таких как `кумулятивное стандартное нормальное распределение <https://en.wikipedia.org/wiki/Cumulative_distribution_function>`_::

source: Return the complementary error function at *x*. The `complementary error function <https://en.wikipedia.org/wiki/Error_function>`_ is defined as ``1.0 - erf(x)``. It is used for large values of *x* where a subtraction from one would cause a `loss of significance <https://en.wikipedia.org/wiki/Loss_of_significance>`_\.
ru: Верните дополнительную функцию ошибки в *x*. `Дополнительная функция ошибок <https://en.wikipedia.org/wiki/Error_function>`_ определяется как ``1.0 - erf(x)``. Он используется для больших значений *x*, когда вычитание из единицы может привести к `потере значимости <https://en.wikipedia.org/wiki/Loss_of_significance>`_\.

source: Return the `Gamma function <https://en.wikipedia.org/wiki/Gamma_function>`_ at *x*.
ru: Верните `гамма-функцию <https://en.wikipedia.org/wiki/Gamma_function>`_ в *x*.

source: Return the natural logarithm of the absolute value of the Gamma function at *x*.
ru: Возвращает натуральный логарифм абсолютного значения гамма-функции в точке *x*.

source: Constants
ru: Константы

source: The mathematical constant *π* = 3.141592..., to available precision.
ru: Математическая константа *π* = 3,141592... с доступной точностью.

source: The mathematical constant *e* = 2.718281..., to available precision.
ru: Математическая константа *e* = 2,718281... с доступной точностью.

source: The mathematical constant *τ* = 6.283185..., to available precision. Tau is a circle constant equal to 2\ *π*, the ratio of a circle's circumference to its radius. To learn more about Tau, check out Vi Hart's video `Pi is (still) Wrong <https://www.youtube.com/watch?v=jG7vhMMXagQ>`_, and start celebrating `Tau day <https://tauday.com/>`_ by eating twice as much pie!
ru: Математическая константа *τ* = 6,283185..., с доступной точностью. Тау — постоянная окружности, равная 2\ *π*, отношению длины окружности к ее радиусу. Чтобы узнать больше о Тау, посмотрите видео Ви Харта «Пи (все еще) неправильно» <https://www.youtube.com/watch?v=jG7vhMMXagQ>`_ и начните праздновать `День Тау <https://tauday .com/>`_ съедая в два раза больше пирогов!

source: A floating-point positive infinity. (For negative infinity, use ``-math.inf``.) Equivalent to the output of ``float('inf')``.
ru: Положительная бесконечность с плавающей запятой. (Для отрицательной бесконечности используйте ``-math.inf``.) Эквивалент вывода ``float('inf')``.

source: A floating-point "not a number" (NaN) value. Equivalent to the output of ``float('nan')``. Due to the requirements of the `IEEE-754 standard <https://en.wikipedia.org/wiki/IEEE_754>`_, ``math.nan`` and ``float('nan')`` are not considered to equal to any other numeric value, including themselves. To check whether a number is a NaN, use the :func:`isnan` function to test for NaNs instead of ``is`` or ``==``. Example:
ru: Значение с плавающей запятой, не являющееся числом (NaN). Эквивалент вывода ``float('nan')``. В связи с требованиями стандарта IEEE-754 <https://en.wikipedia.org/wiki/IEEE_754>`_, ``math.nan`` и ``float('nan')`` не учитываются. быть равным любому другому числовому значению, включая себя. Чтобы проверить, является ли число NaN, используйте функцию :func:`isnan` для проверки NaN вместо ``is`` или ``==``. Пример:

source: It is now always available.
ru: Теперь он всегда доступен.

source: The :mod:`math` module consists mostly of thin wrappers around the platform C math library functions. Behavior in exceptional cases follows Annex F of the C99 standard where appropriate. The current implementation will raise :exc:`ValueError` for invalid operations like ``sqrt(-1.0)`` or ``log(0.0)`` (where C99 Annex F recommends signaling invalid operation or divide-by-zero), and :exc:`OverflowError` for results that overflow (for example, ``exp(1000.0)``). A NaN will not be returned from any of the functions above unless one or more of the input arguments was a NaN; in that case, most functions will return a NaN, but (again following C99 Annex F) there are some exceptions to this rule, for example ``pow(float('nan'), 0.0)`` or ``hypot(float('nan'), float('inf'))``.
ru: Модуль :mod:`math` состоит в основном из тонких оболочек вокруг функций математической библиотеки платформы C. Поведение в исключительных случаях соответствует приложению F стандарта C99, где это необходимо. Текущая реализация вызовет :exc:`ValueError` для недопустимых операций, таких как ``sqrt(-1.0)`` или ``log(0.0)`` (где C99 Приложение F рекомендует сигнализировать о недопустимой операции или делении на ноль), и :exc:`OverflowError` для результатов, которые переполняются (например, ``exp(1000.0)``). NaN не будет возвращено ни одной из вышеперечисленных функций, если один или несколько входных аргументов не будут NaN; в этом случае большинство функций вернут NaN, но (опять же согласно Приложению F C99) из этого правила есть некоторые исключения, например, ``pow(float('nan'), 0.0)`` или ``hypot(float ('nan'), float('inf'))``.

source: Note that Python makes no effort to distinguish signaling NaNs from quiet NaNs, and behavior for signaling NaNs remains unspecified. Typical behavior is to treat all NaNs as though they were quiet.
ru: Обратите внимание, что Python не пытается отличить сигнальные NaN от тихих NaN, и поведение сигнальных NaN остается неопределенным. Типичным поведением является обращение со всеми NaN, как если бы они были тихими.

source: Module :mod:`cmath`
ru: Модуль :mod:`cmath`

source: Complex number versions of many of these functions.
ru: Комплексные числовые версии многих из этих функций.
