Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/math.po
Languages: ru

source: :mod:`!math` --- Mathematical functions
ru: Сообщайте о событиях, которые происходят во время нормальной работы программы (например, для мониторинга состояния или расследования ошибок).

source: This module provides access to the mathematical functions defined by the C standard.
ru: Этот модуль обеспечивает доступ к математическим функциям, определенным стандартом C.

source: These functions cannot be used with complex numbers; use the functions of the same name from the :mod:`cmath` module if you require support for complex numbers. The distinction between functions which support complex numbers and those which don't is made since most users do not want to learn quite as much mathematics as required to understand complex numbers. Receiving an exception instead of a complex result allows earlier detection of the unexpected complex number used as a parameter, so that the programmer can determine how and why it was generated in the first place.
ru: Эти функции нельзя использовать с комплексными числами; используйте одноименные функции из модуля :mod:`cmath`, если вам требуется поддержка комплексных чисел. Различие между функциями, поддерживающими комплексные числа, и функциями, которые этого не поддерживают, проводится потому, что большинство пользователей не хотят изучать столько математики, сколько необходимо для понимания комплексных чисел. Получение исключения вместо комплексного результата позволяет раньше обнаружить неожиданное комплексное число, используемое в качестве параметра, чтобы программист мог определить, как и почему оно было сгенерировано.

source: The following functions are provided by this module. Except when explicitly noted otherwise, all return values are floats.
ru: Этот модуль предоставляет следующие функции. Если явно не указано иное, все возвращаемые значения являются числами с плавающей запятой.

source: **Number-theoretic functions**
ru: **Теоретико-числовые функции**

source: Number of ways to choose *k* items from *n* items without repetition and without order
ru: Количество способов выбрать *k* предметов из *n* предметов без повторения и без порядка

source: *n* factorial
ru: *n* факториал

source: Greatest common divisor of the integer arguments
ru: Наибольший общий делитель целочисленных аргументов

source: Integer square root of a nonnegative integer *n*
ru: Целый квадратный корень из неотрицательного целого числа *n*

source: Least common multiple of the integer arguments
ru: Наименьшее общее кратное целочисленных аргументов

source: Number of ways to choose *k* items from *n* items without repetition and with order
ru: Количество способов выбрать *k* предметов из *n* предметов без повторения и в порядке

source: **Floating point arithmetic**
ru: **Арифметика с плавающей запятой**

source: Ceiling of *x*, the smallest integer greater than or equal to *x*
ru: Потолок *x*, наименьшее целое число, большее или равное *x*

source: Absolute value of *x*
ru: Абсолютное значение *x*

source: Floor of *x*, the largest integer less than or equal to *x*
ru: Этаж *x*, наибольшее целое число, меньшее или равное *x*

source: Fused multiply-add operation: ``(x * y) + z``
ru: Объединенная операция умножения-сложения: ``(x * y) + z``

source: Remainder of division ``x / y``
ru: *n* факториал

source: Fractional and integer parts of *x*
ru: Дробная и целая части *x*

source: Remainder of *x* with respect to *y*
ru: Остаток *x* относительно *y*

source: Integer part of *x*
ru: Целая часть *x*

source: **Floating point manipulation functions**
ru: **Функции манипуляции с плавающей запятой**

source: Magnitude (absolute value) of *x* with the sign of *y*
ru: Величина (абсолютное значение) *x* со знаком *y*

source: Mantissa and exponent of *x*
ru: Мантисса и показатель *x*

source: Check if the values *a* and *b* are close to each other
ru: Проверьте, близки ли значения *a* и *b* друг к другу.

source: Check if *x* is neither an infinity nor a NaN
ru: Проверьте, не является ли *x* ни бесконечностью, ни NaN.

source: Check if *x* is a positive or negative infinity
ru: Проверьте, является ли *x* положительной или отрицательной бесконечностью.

source: Check if *x* is a NaN (not a number)
ru: Проверьте, является ли *x* NaN (а не числом)

source: ``x * (2**i)``, inverse of function :func:`frexp`
ru: ``x * (2**i)``, обратная функции :func:`frexp`

source: Floating-point value *steps* steps after *x* towards *y*
ru: Значение с плавающей запятой *шаги* шаги после *x* в сторону *y*

source: Value of the least significant bit of *x*
ru: Значение младшего бита *x*

source: **Power, exponential and logarithmic functions**
ru: **Степеньевые, показательные и логарифмические функции**

source: Cube root of *x*
ru: Кубический корень из *x*

source: *e* raised to the power *x*
ru: *e* возведено в степень *x*

source: *2* raised to the power *x*
ru: *2* возведен в степень *x*

source: *e* raised to the power *x*, minus 1
ru: *e* возведено в степень *x*, минус 1

source: Logarithm of *x* to the given base (*e* by default)
ru: Логарифм *x* по заданному основанию (по умолчанию *e*)

source: Natural logarithm of *1+x* (base *e*)
ru: Натуральный логарифм *1+x* (по основанию *e*)

source: Base-2 logarithm of *x*
ru: Логарифм по основанию 2 от *x*

source: Base-10 logarithm of *x*
ru: Логарифм по основанию 10 от *x*

source: *x* raised to the power *y*
ru: *x* возведен в степень *y*

source: Square root of *x*
ru: Квадратный корень из *x*

source: **Summation and product functions**
ru: **Функции суммирования и произведения**

source: Euclidean distance between two points *p* and *q* given as an iterable of coordinates
ru: Евклидово расстояние между двумя точками *p* и *q*, заданными как итерация координат

source: Sum of values in the input *iterable*
ru: Сумма значений во входных данных *итерируемая*

source: Euclidean norm of an iterable of coordinates
ru: Евклидова норма итерации координат

source: Product of elements in the input *iterable* with a *start* value
ru: Произведение элементов входных данных *iterable* со значением *start*

source: Sum of products from two iterables *p* and *q*
ru: Сумма произведений двух итераций *p* и *q*

source: **Angular conversion**
ru: **Угловое преобразование**

source: :func:`degrees(x) <degrees>`
ru: :func:`grades(x) <градусы>`

source: Convert angle *x* from radians to degrees
ru: Перевести угол *x* из радиан в градусы

source: Convert angle *x* from degrees to radians
ru: Перевести угол *x* из градусов в радианы

source: **Trigonometric functions**
ru: **Тригонометрические функции**

source: Arc cosine of *x*
ru: Арккосинус *x*

source: Arc sine of *x*
ru: Арксинус *x*

source: Arc tangent of *x*
ru: Арктангенс *x*

source: Cosine of *x*
ru: Косинус *x*

source: Sine of *x*
ru: Синус *x*

source: Tangent of *x*
ru: Тангенс *x*

source: **Hyperbolic functions**
ru: **Гиперболические функции**

source: Inverse hyperbolic cosine of *x*
ru: Обратный гиперболический косинус *x*

source: Inverse hyperbolic sine of *x*
ru: Обратный гиперболический синус *x*

source: Inverse hyperbolic tangent of *x*
ru: Обратный гиперболический тангенс *x*

source: Hyperbolic cosine of *x*
ru: Гиперболический косинус *x*

source: Hyperbolic sine of *x*
ru: Гиперболический синус *x*

source: Hyperbolic tangent of *x*
ru: Гиперболический тангенс *x*

source: **Special functions**
ru: **Специальные функции**

source: `Error function <https://en.wikipedia.org/wiki/Error_function>`_ at *x*
ru: `Функция ошибки <https://en.wikipedia.org/wiki/Error_function>`_ в *x*

source: `Complementary error function <https://en.wikipedia.org/wiki/Error_function>`_ at *x*
ru: `Дополнительная функция ошибки <https://en.wikipedia.org/wiki/Error_function>`_ в *x*

source: `Gamma function <https://en.wikipedia.org/wiki/Gamma_function>`_ at *x*
ru: `Гамма-функция <https://en.wikipedia.org/wiki/Gamma_function>`_ в *x*

source: Natural logarithm of the absolute value of the `Gamma function <https://en.wikipedia.org/wiki/Gamma_function>`_ at *x*
ru: Натуральный логарифм абсолютного значения `гамма-функции <https://en.wikipedia.org/wiki/Gamma_function>`_ в *x*

source: **Constants**
ru: **Константы**

source: Positive infinity
ru: Положительная бесконечность

source: "Not a number" (NaN)
ru: «Не число» (NaN)

source: Number-theoretic functions
ru: Теоретико-числовые функции

source: Return the number of ways to choose *k* items from *n* items without repetition and without order.
ru: Возвращает количество способов выбрать *k* элементов из *n* элементов без повторения и без порядка.

source: Evaluates to ``n! / (k! * (n - k)!)`` when ``k <= n`` and evaluates to zero when ``k > n``.
ru: Оценивается как ``n! / (k! * (n - k)!)``, когда ``k <= n``, и равен нулю, когда ``k > n``.

source: Also called the binomial coefficient because it is equivalent to the coefficient of k-th term in polynomial expansion of ``(1 + x)ⁿ``.
ru: Также называется биномиальным коэффициентом, потому что он эквивалентен коэффициенту k-го члена в полиномиальном разложении ``(1 + x)ⁿ``.

source: Raises :exc:`TypeError` if either of the arguments are not integers. Raises :exc:`ValueError` if either of the arguments are negative.
ru: Вызывает :exc:`TypeError`, если какой-либо из аргументов не является целым числом. Вызывает :exc:`ValueError`, если любой из аргументов отрицательный.

source: Return *n* factorial as an integer. Raises :exc:`ValueError` if *n* is not integral or is negative.
ru: Верните факториал *n* как целое число. Вызывает :exc:`ValueError`, если *n* не целое или отрицательное.

source: Floats with integral values (like ``5.0``) are no longer accepted.
ru: Плавающие числа с целыми значениями (например, ``5.0``) больше не принимаются.

source: Return the greatest common divisor of the specified integer arguments. If any of the arguments is nonzero, then the returned value is the largest positive integer that is a divisor of all arguments. If all arguments are zero, then the returned value is ``0``. ``gcd()`` without arguments returns ``0``.
ru: Возвращает наибольший общий делитель указанных целочисленных аргументов. Если какой-либо из аргументов не равен нулю, возвращаемое значение представляет собой наибольшее положительное целое число, которое является делителем всех аргументов. Если все аргументы равны нулю, то возвращаемое значение равно «0». ``gcd()`` без аргументов возвращает ``0``.

source: Added support for an arbitrary number of arguments. Formerly, only two arguments were supported.
ru: Добавлена ​​поддержка произвольного количества аргументов. Раньше поддерживались только два аргумента.

source: Return the integer square root of the nonnegative integer *n*. This is the floor of the exact square root of *n*, or equivalently the greatest integer *a* such that *a*\ ² |nbsp| ≤ |nbsp| *n*.
ru: Возвращает целочисленный квадратный корень из неотрицательного целого числа *n*. Это нижний предел точного квадратного корня из *n* или, что то же самое, наибольшего целого числа *a* такого, что *a*\ ² |nbsp| ≤ |nbsp| *н*.

source: For some applications, it may be more convenient to have the least integer *a* such that *n* |nbsp| ≤ |nbsp| *a*\ ², or in other words the ceiling of the exact square root of *n*. For positive *n*, this can be computed using ``a = 1 + isqrt(n - 1)``.
ru: Для некоторых приложений может быть удобнее иметь наименьшее целое число *a* такое, что *n* |nbsp| ≤ |nbsp| *a*\², или, другими словами, потолок точного квадратного корня из *n*. Для положительного *n* это можно вычислить, используя ``a = 1 + isqrt(n - 1)``.

source: Return the least common multiple of the specified integer arguments. If all arguments are nonzero, then the returned value is the smallest positive integer that is a multiple of all arguments. If any of the arguments is zero, then the returned value is ``0``. ``lcm()`` without arguments returns ``1``.
ru: Возвращает наименьшее общее кратное указанных целочисленных аргументов. Если все аргументы не равны нулю, то возвращаемое значение представляет собой наименьшее положительное целое число, кратное всем аргументам. Если какой-либо из аргументов равен нулю, то возвращаемое значение равно ``0``. ``lcm()`` без аргументов возвращает ``1``.

source: Return the number of ways to choose *k* items from *n* items without repetition and with order.
ru: Возвращает количество способов выбрать *k* элементов из *n* элементов без повторения и в определенном порядке.

source: Evaluates to ``n! / (n - k)!`` when ``k <= n`` and evaluates to zero when ``k > n``.
ru: Оценивается как ``n! / (n - k)!``, когда ``k <= n``, и равен нулю, когда ``k > n``.

source: If *k* is not specified or is ``None``, then *k* defaults to *n* and the function returns ``n!``.
ru: Если *k* не указано или равно ``None``, тогда *k* по умолчанию равно *n*, и функция возвращает ``n!``.

source: Floating point arithmetic
ru: Арифметика с плавающей запятой

source: Return the ceiling of *x*, the smallest integer greater than or equal to *x*. If *x* is not a float, delegates to :meth:`x.__ceil__ <object.__ceil__>`, which should return an :class:`~numbers.Integral` value.
ru: Возвращает потолок *x*, наименьшее целое число, большее или равное *x*. Если *x* не является числом с плавающей запятой, делегируется :meth:`x.__ceil__ <object.__ceil__>`, который должен возвращать значение :class:`~numbers.Integral`.

source: Return the absolute value of *x*.
ru: Верните абсолютное значение *x*.

source: Return the floor of *x*, the largest integer less than or equal to *x*. If *x* is not a float, delegates to :meth:`x.__floor__ <object.__floor__>`, which should return an :class:`~numbers.Integral` value.
ru: Возвращает нижний предел *x*, наибольшее целое число, меньшее или равное *x*. Если *x* не является числом с плавающей запятой, делегируется :meth:`x.__floor__ <object.__floor__>`, который должен возвращать значение :class:`~numbers.Integral`.

source: Fused multiply-add operation. Return ``(x * y) + z``, computed as though with infinite precision and range followed by a single round to the ``float`` format. This operation often provides better accuracy than the direct expression ``(x * y) + z``.
ru: Объединенная операция умножения-сложения. Возвращает ``(x * y) + z``, вычисляемое как будто с бесконечной точностью и диапазоном, за которым следует один раунд в формате ``float``. Эта операция часто обеспечивает лучшую точность, чем прямое выражение ``(x * y) + z``.

source: This function follows the specification of the fusedMultiplyAdd operation described in the IEEE 754 standard. The standard leaves one case implementation-defined, namely the result of ``fma(0, inf, nan)`` and ``fma(inf, 0, nan)``. In these cases, ``math.fma`` returns a NaN, and does not raise any exception.
ru: Эта функция соответствует спецификации операции FusedMultiplyAdd, описанной в стандарте IEEE 754. Стандарт оставляет один случай определяемым реализацией, а именно результат ``fma(0, inf, nan)`` и ``fma(inf, 0, nan)``. В этих случаях math.fma возвращает NaN и не вызывает никаких исключений.

source: Return the fractional and integer parts of *x*. Both results carry the sign of *x* and are floats.
ru: Возвращает дробную и целую части *x*. Оба результата имеют знак *x* и являются числами с плавающей запятой.

source: Note that :func:`modf` has a different call/return pattern than its C equivalents: it takes a single argument and return a pair of values, rather than returning its second return value through an 'output parameter' (there is no such thing in Python).
ru: Обратите внимание, что :func:`modf` имеет другой шаблон вызова/возврата, чем его эквиваленты на C: он принимает один аргумент и возвращает пару значений, а не возвращает второе возвращаемое значение через «выходной параметр» (такого не существует). вещь в Python).

source: Return the IEEE 754-style remainder of *x* with respect to *y*. For finite *x* and finite nonzero *y*, this is the difference ``x - n*y``, where ``n`` is the closest integer to the exact value of the quotient ``x / y``. If ``x / y`` is exactly halfway between two consecutive integers, the nearest *even* integer is used for ``n``. The remainder ``r = remainder(x, y)`` thus always satisfies ``abs(r) <= 0.5 * abs(y)``.
ru: Возвращает остаток *x* в стиле IEEE 754 относительно *y*. Для конечного *x* и конечного ненулевого *y* это разница ``x - n*y``, где ``n`` — ближайшее целое число к точному значению частного ``x / y`` . Если ``x / y`` находится ровно посередине между двумя последовательными целыми числами, ближайшее *чётное* целое число используется для ``n``. Таким образом, остаток ``r = остаток(x, y)`` всегда удовлетворяет ``abs(r) <= 0,5 * abs(y)``.

source: Special cases follow IEEE 754: in particular, ``remainder(x, math.inf)`` is *x* for any finite *x*, and ``remainder(x, 0)`` and ``remainder(math.inf, x)`` raise :exc:`ValueError` for any non-NaN *x*. If the result of the remainder operation is zero, that zero will have the same sign as *x*.
ru: Особые случаи соответствуют IEEE 754: в частности, ``remainder(x, math.inf)`` равен *x* для любого конечного *x*, а ``remainder(x, 0)`` и ``remainder(math.inf. inf, x)`` поднять :exc:`ValueError` для любого значения, отличного от NaN *x*. Если результат операции остатка равен нулю, этот ноль будет иметь тот же знак, что и *x*.

source: On platforms using IEEE 754 binary floating point, the result of this operation is always exactly representable: no rounding error is introduced.
ru: На платформах, использующих двоичную плавающую запятую IEEE 754, результат этой операции всегда точно представим: ошибка округления не возникает.

source: Return *x* with the fractional part removed, leaving the integer part. This rounds toward 0: ``trunc()`` is equivalent to :func:`floor` for positive *x*, and equivalent to :func:`ceil` for negative *x*. If *x* is not a float, delegates to :meth:`x.__trunc__ <object.__trunc__>`, which should return an :class:`~numbers.Integral` value.
ru: Верните *x* с удаленной дробной частью, оставив целую часть. Округление в сторону 0: ``trunc()`` эквивалентно :func:`floor` для положительного *x* и эквивалентно :func:`ceil` для отрицательного *x*. Если *x* не является числом с плавающей запятой, делегируется :meth:`x.__trunc__ <object.__trunc__>`, который должен возвращать значение :class:`~numbers.Integral`.

source: For the :func:`ceil`, :func:`floor`, and :func:`modf` functions, note that *all* floating-point numbers of sufficiently large magnitude are exact integers. Python floats typically carry no more than 53 bits of precision (the same as the platform C double type), in which case any float *x* with ``abs(x) >= 2**52`` necessarily has no fractional bits.
ru: Обратите внимание, что для функций :func:`ceil`, :func:`floor` и :func:`modf` *все* числа с плавающей запятой достаточно большой величины являются точными целыми числами. Числа с плавающей запятой в Python обычно содержат не более 53 бит точности (так же, как двойной тип платформы C), и в этом случае любое число с плавающей запятой *x* с ``abs(x) >= 2**52`` обязательно не имеет дробных битов. .

source: Floating point manipulation functions
ru: Функции манипуляции с плавающей запятой

source: Return a float with the magnitude (absolute value) of *x* but the sign of *y*. On platforms that support signed zeros, ``copysign(1.0, -0.0)`` returns *-1.0*.
ru: Возвращает число с плавающей запятой с величиной (абсолютным значением) *x*, но со знаком *y*. На платформах, поддерживающих нули со знаком, ``copysign(1.0, -0.0)`` возвращает *-1.0*.

source: Return the mantissa and exponent of *x* as the pair ``(m, e)``. *m* is a float and *e* is an integer such that ``x == m * 2**e`` exactly. If *x* is zero, returns ``(0.0, 0)``, otherwise ``0.5 <= abs(m) < 1``. This is used to "pick apart" the internal representation of a float in a portable way.
ru: Верните мантиссу и показатель степени *x* как пару ``(m, e)``. *m* — это число с плавающей запятой, а *e* — целое число такое, что точно ``x == m * 2**e``. Если *x* равно нулю, возвращается ``(0.0, 0)``, в противном случае ``0.5 <= abs(m) < 1``. Это используется для «разбора» внутреннего представления float переносимым способом.

source: Note that :func:`frexp` has a different call/return pattern than its C equivalents: it takes a single argument and return a pair of values, rather than returning its second return value through an 'output parameter' (there is no such thing in Python).
ru: Обратите внимание, что :func:`frexp` имеет другой шаблон вызова/возврата, чем его эквиваленты на C: он принимает один аргумент и возвращает пару значений, а не возвращает второе возвращаемое значение через «выходной параметр» (такого не существует). вещь в Python).

source: Return ``True`` if the values *a* and *b* are close to each other and ``False`` otherwise.
ru: Возвращайте ``True``, если значения *a* и *b* близки друг к другу, и ``False`` в противном случае.

source: Whether or not two values are considered close is determined according to given absolute and relative tolerances. If no errors occur, the result will be: ``abs(a-b) <= max(rel_tol * max(abs(a), abs(b)), abs_tol)``.
ru: Считаются ли два значения близкими или нет, определяется в соответствии с заданными абсолютными и относительными допусками. Если ошибок не возникнет, результатом будет: ``abs(ab) <= max(rel_tol * max(abs(a), abs(b)), abs_tol)``.

source: *rel_tol* is the relative tolerance -- it is the maximum allowed difference between *a* and *b*, relative to the larger absolute value of *a* or *b*. For example, to set a tolerance of 5%, pass ``rel_tol=0.05``. The default tolerance is ``1e-09``, which assures that the two values are the same within about 9 decimal digits. *rel_tol* must be nonnegative and less than ``1.0``.
ru: *rel_tol* — это относительный допуск — это максимально допустимая разница между *a* и *b* относительно большего абсолютного значения *a* или *b*. Например, чтобы установить допуск 5 %, укажите rel_tol=0,05. Допуск по умолчанию — «1e-09», который гарантирует, что два значения одинаковы в пределах примерно 9 десятичных цифр. *rel_tol* должен быть неотрицательным и меньше ``1.0``.

source: *abs_tol* is the absolute tolerance; it defaults to ``0.0`` and it must be nonnegative. When comparing ``x`` to ``0.0``, ``isclose(x, 0)`` is computed as ``abs(x) <= rel_tol * abs(x)``, which is ``False`` for any ``x`` and rel_tol less than ``1.0``. So add an appropriate positive abs_tol argument to the call.
ru: *abs_tol* — абсолютный допуск; по умолчанию оно равно ``0.0`` и должно быть неотрицательным. При сравнении ``x`` с ``0.0`` ``isclose(x, 0)`` вычисляется как ``abs(x) <= rel_tol * abs(x)``, что является ``False` ` для любого ``x`` и rel_tol меньше ``1.0``. Поэтому добавьте к вызову соответствующий положительный аргумент abs_tol.

source: The IEEE 754 special values of ``NaN``, ``inf``, and ``-inf`` will be handled according to IEEE rules. Specifically, ``NaN`` is not considered close to any other value, including ``NaN``. ``inf`` and ``-inf`` are only considered close to themselves.
ru: Специальные значения IEEE 754 NaN, inf и -inf будут обрабатываться в соответствии с правилами IEEE. В частности, NaN не считается близким к какому-либо другому значению, включая NaN. ``inf`` и ``-inf`` считаются только близкими к себе.

source: :pep:`485` -- A function for testing approximate equality
ru: :pep:`485` -- Функция для проверки приблизительного равенства

source: Return ``True`` if *x* is neither an infinity nor a NaN, and ``False`` otherwise. (Note that ``0.0`` *is* considered finite.)
ru: Возвращайте ``True``, если *x* не является ни бесконечностью, ни NaN, и ``False`` в противном случае. (Обратите внимание, что ``0.0`` *считается* конечным.)

source: Return ``True`` if *x* is a positive or negative infinity, and ``False`` otherwise.
ru: Возвращайте ``True``, если *x* является положительной или отрицательной бесконечностью, и ``False`` в противном случае.
