Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/msvcrt.po
Languages: ru

source: :mod:`!msvcrt` --- Useful routines from the MS VC++ runtime
ru: :mod:`!msvcrt` --- Полезные процедуры из среды выполнения MS VС++

source: These functions provide access to some useful capabilities on Windows platforms. Some higher-level modules use these functions to build the Windows implementations of their services. For example, the :mod:`getpass` module uses this in the implementation of the :func:`getpass` function.
ru: Эти функции обеспечивают доступ к некоторым полезным возможностям на платформах Windows. Некоторые модули более высокого уровня используют эти функции для создания реализаций своих сервисов в Windows. Например, модуль :mod:`getpass` использует это в реализации функции :func:`getpass`.

source: Further documentation on these functions can be found in the Platform API documentation.
ru: Дополнительную документацию по этим функциям можно найти в документации API платформы.

source: The module implements both the normal and wide char variants of the console I/O api. The normal API deals only with ASCII characters and is of limited use for internationalized applications. The wide char API should be used where ever possible.
ru: Модуль реализует как обычный, так и расширенный вариант API консольного ввода-вывода. Обычный API работает только с символами ASCII и имеет ограниченное применение для интернационализированных приложений. API широкого символа следует использовать везде, где это возможно.

source: Operations in this module now raise :exc:`OSError` where :exc:`IOError` was raised.
ru: Операции в этом модуле теперь вызывают :exc:`OSError` там, где было вызвано :exc:`IOError`.

source: File Operations
ru: Файловые операции

source: Lock part of a file based on file descriptor *fd* from the C runtime. Raises :exc:`OSError` on failure. The locked region of the file extends from the current file position for *nbytes* bytes, and may continue beyond the end of the file. *mode* must be one of the :const:`!LK_\*` constants listed below. Multiple regions in a file may be locked at the same time, but may not overlap. Adjacent regions are not merged; they must be unlocked individually.
ru: Заблокируйте часть файла на основе файлового дескриптора *fd* из среды выполнения C. Вызывает :exc:`OSError` в случае сбоя. Заблокированная область файла простирается от текущей позиции файла на *nbytes* байт и может продолжаться за пределами файла. *mode* должен быть одной из констант :const:`!LK_\*`, перечисленных ниже. Несколько областей в файле могут быть заблокированы одновременно, но не могут перекрываться. Соседние регионы не объединяются; они должны быть разблокированы индивидуально.

source: Raises an :ref:`auditing event <auditing>` ``msvcrt.locking`` with arguments ``fd``, ``mode``, ``nbytes``.
ru: Вызывает событие аудита <auditing>``msvcrt.locking`` с аргументами ``fd``, ``mode``, ``nbytes``.

source: Locks the specified bytes. If the bytes cannot be locked, the program immediately tries again after 1 second. If, after 10 attempts, the bytes cannot be locked, :exc:`OSError` is raised.
ru: Блокирует указанные байты. Если байты не могут быть заблокированы, программа немедленно пытается повторить попытку через 1 секунду. Если после 10 попыток байты не могут быть заблокированы, выдается :exc:`OSError`.

source: Locks the specified bytes. If the bytes cannot be locked, :exc:`OSError` is raised.
ru: Блокирует указанные байты. Если байты не могут быть заблокированы, возникает :exc:`OSError`.

source: Unlocks the specified bytes, which must have been previously locked.
ru: Разблокирует указанные байты, которые должны быть ранее заблокированы.

source: Set the line-end translation mode for the file descriptor *fd*. To set it to text mode, *flags* should be :const:`os.O_TEXT`; for binary, it should be :const:`os.O_BINARY`.
ru: Установите режим перевода конца строки для файлового дескриптора *fd*. Чтобы установить текстовый режим, *flags* должно быть :const:`os.O_TEXT`; для двоичного файла это должно быть :const:`os.O_BINARY`.

source: Create a C runtime file descriptor from the file handle *handle*. The *flags* parameter should be a bitwise OR of :const:`os.O_APPEND`, :const:`os.O_RDONLY`, :const:`os.O_TEXT` and :const:`os.O_NOINHERIT`. The returned file descriptor may be used as a parameter to :func:`os.fdopen` to create a file object.
ru: Создайте дескриптор файла среды выполнения C из дескриптора файла *handle*. Параметр *flags* должен представлять собой поразрядное ИЛИ из :const:`os.O_APPEND`, :const:`os.O_RDONLY`, :const:`os.O_TEXT` и :const:`os.O_NOINHERIT`. Возвращенный файловый дескриптор можно использовать в качестве параметра :func:`os.fdopen` для создания файлового объекта.

source: The file descriptor is inheritable by default. Pass :const:`os.O_NOINHERIT` flag to make it non inheritable.
ru: Дескриптор файла по умолчанию наследуется. Передайте флаг :const:`os.O_NOINHERIT`, чтобы сделать его ненаследуемым.

source: Raises an :ref:`auditing event <auditing>` ``msvcrt.open_osfhandle`` with arguments ``handle``, ``flags``.
ru: Вызывает :ref:`событие аудита <auditing>``msvcrt.open_osfhandle`` с аргументами ``handle``, ``flags``.

source: Return the file handle for the file descriptor *fd*. Raises :exc:`OSError` if *fd* is not recognized.
ru: Возвращает дескриптор файла для файлового дескриптора *fd*. Вызывает :exc:`OSError`, если *fd* не распознан.

source: Raises an :ref:`auditing event <auditing>` ``msvcrt.get_osfhandle`` with argument ``fd``.
ru: Вызывает :ref:`событие аудита <auditing>``msvcrt.get_osfhandle`` с аргументом ``fd``.

source: Console I/O
ru: Консоль ввода/вывода

source: Returns a nonzero value if a keypress is waiting to be read. Otherwise, return 0.
ru: Возвращает ненулевое значение, если нажатие клавиши ожидает чтения. В противном случае верните 0.

source: Read a keypress and return the resulting character as a byte string. Nothing is echoed to the console. This call will block if a keypress is not already available, but will not wait for :kbd:`Enter` to be pressed. If the pressed key was a special function key, this will return ``'\000'`` or ``'\xe0'``; the next call will return the keycode. The :kbd:`Control-C` keypress cannot be read with this function.
ru: Прочитайте нажатие клавиши и верните полученный символ в виде байтовой строки. На консоль ничего не отображается. Этот вызов будет заблокирован, если нажатие клавиши еще не доступно, но не будет ждать нажатия :kbd:`Enter`. Если нажатая клавиша была специальной функциональной клавишей, она вернет ``'\000'`` или ``'\xe0'``; следующий вызов вернет код ключа. Нажатие клавиши :kbd:`Control-C` не может быть прочитано с помощью этой функции.

source: Wide char variant of :func:`getch`, returning a Unicode value.
ru: Расширенный символьный вариант :func:`getch`, возвращающий значение Unicode.

source: Similar to :func:`getch`, but the keypress will be echoed if it represents a printable character.
ru: Аналогично :func:`getch`, но нажатие клавиши будет отображаться, если оно представляет собой печатный символ.

source: Wide char variant of :func:`getche`, returning a Unicode value.
ru: Расширенный символьный вариант :func:`getche`, возвращающий значение Unicode.

source: Print the byte string *char* to the console without buffering.
ru: Выведите строку байтов *char* на консоль без буферизации.

source: Wide char variant of :func:`putch`, accepting a Unicode value.
ru: Широкий символьный вариант :func:`patch`, принимающий значение Unicode.

source: Cause the byte string *char* to be "pushed back" into the console buffer; it will be the next character read by :func:`getch` or :func:`getche`.
ru: Заставить строку байтов *char* «вернуться обратно» в буфер консоли; это будет следующий символ, прочитанный :func:`getch` или :func:`getche`.

source: Wide char variant of :func:`ungetch`, accepting a Unicode value.
ru: Широкий символьный вариант :func:`ungetch`, принимающий значение Unicode.

source: Other Functions
ru: Другие функции

source: Force the :c:func:`malloc` heap to clean itself up and return unused blocks to the operating system. On failure, this raises :exc:`OSError`.
ru: Заставьте кучу :c:func:`malloc` очиститься и вернуть неиспользуемые блоки в операционную систему. В случае сбоя возникает :exc:`OSError`.

source: Changes the location where the C runtime writes an error message for an error that might end the program. *mode* must be one of the :const:`!OUT_\*` constants listed below or :const:`REPORT_ERRMODE`. Returns the old setting or -1 if an error occurs. Only available in :ref:`debug build of Python <debug-build>`.
ru: Изменяет место, куда среда выполнения C записывает сообщение об ошибке, которая может привести к завершению программы. *mode* должен быть одной из констант :const:`!OUT_\*`, перечисленных ниже, или :const:`REPORT_ERRMODE`. Возвращает старую настройку или -1 в случае возникновения ошибки. Доступно только в :ref:`отладочной сборке Python <debug-build>`.

source: Error sink is determined by the app's type. Only available in :ref:`debug build of Python <debug-build>`.
ru: Приемник ошибок определяется типом приложения. Доступно только в :ref:`отладочной сборке Python <debug-build>`.

source: Error sink is a standard error. Only available in :ref:`debug build of Python <debug-build>`.
ru: Приемник ошибок — это стандартная ошибка. Доступно только в :ref:`отладочной сборке Python <debug-build>`.

source: Error sink is a message box. Only available in :ref:`debug build of Python <debug-build>`.
ru: Приемник ошибок — это окно сообщений. Доступно только в :ref:`отладочной сборке Python <debug-build>`.

source: Report the current error mode value. Only available in :ref:`debug build of Python <debug-build>`.
ru: Сообщите текущее значение режима ошибки. Доступно только в :ref:`отладочной сборке Python <debug-build>`.

source: Specifies the destination or destinations for a specific report type generated by :c:func:`!_CrtDbgReport` in the MS VC++ runtime. *type* must be one of the :const:`!CRT_\*` constants listed below. *mode* must be one of the :const:`!CRTDBG_\*` constants listed below. Only available in :ref:`debug build of Python <debug-build>`.
ru: Указывает место назначения или места назначения для определенного типа отчета, созданного :c:func:`!_CrtDbgReport` в среде выполнения MS VС++. *type* должен быть одной из констант :const:`!CRT_\*`, перечисленных ниже. *mode* должен быть одной из констант :const:`!CRTDBG_\*`, перечисленных ниже. Доступно только в :ref:`отладочной сборке Python <debug-build>`.

source: After you use :func:`CrtSetReportMode` to specify :const:`CRTDBG_MODE_FILE`, you can specify the file handle to receive the message text. *type* must be one of the :const:`!CRT_\*` constants listed below. *file* should be the file handle your want specified. Only available in :ref:`debug build of Python <debug-build>`.
ru: После того, как вы используете :func:`CrtSetReportMode` для указания :const:`CRTDBG_MODE_FILE`, вы можете указать дескриптор файла для получения текста сообщения. *type* должен быть одной из констант :const:`!CRT_\*`, перечисленных ниже. *file* должен быть указанным вами дескриптором файла. Доступно только в :ref:`отладочной сборке Python <debug-build>`.

source: Warnings, messages, and information that doesn't need immediate attention.
ru: Предупреждения, сообщения и информация, не требующая немедленного внимания.

source: Errors, unrecoverable problems, and issues that require immediate attention.
ru: Ошибки, неисправимые проблемы и проблемы, требующие немедленного внимания.

source: Assertion failures.
ru: Неудачи в утверждениях.

source: Writes the message to the debugger's output window.
ru: Записывает сообщение в окно вывода отладчика.

source: Writes the message to a user-supplied file handle. :func:`CrtSetReportFile` should be called to define the specific file or stream to use as the destination.
ru: Записывает сообщение в предоставленный пользователем дескриптор файла. :func:`CrtSetReportFile` следует вызывать, чтобы определить конкретный файл или поток, который будет использоваться в качестве места назначения.

source: Creates a message box to display the message along with the ``Abort``, ``Retry``, and ``Ignore`` buttons.
ru: Создает окно сообщения для отображения сообщения вместе с кнопками «Прервать», «Повторить» и «Игнорировать».

source: Returns current *mode* for the specified *type*.
ru: Возвращает текущий *режим* для указанного *типа*.

source: The CRT Assembly version, from the :file:`crtassem.h` header file.
ru: Версия сборки CRT из заголовочного файла :file:`crtassem.h`.

source: The VC Assembly public key token, from the :file:`crtassem.h` header file.
ru: Токен открытого ключа сборки VC из заголовочного файла :file:`crtassem.h`.

source: The Libraries Assembly name prefix, from the :file:`crtassem.h` header file.
ru: Префикс имени сборки библиотек из заголовочного файла :file:`crtassem.h`.
