Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/nis.po
Languages: fr

source: :mod:`nis` --- Interface to Sun's NIS (Yellow Pages)
fr: :mod:`nis` — Interface à Sun's NIS (pages jaunes)

source: The :mod:`nis` module gives a thin wrapper around the NIS library, useful for central administration of several hosts.
fr: Le module :mod:`nis` est une simple abstraction de la librairie NIS, utile pour l'administration centralisée de plusieurs hôtes.

source: Because NIS exists only on Unix systems, this module is only available for Unix.
fr: Du fait que NIS existe seulement sur les systèmes Unix, ce module est seulement disponible pour Unix.

source: The :mod:`nis` module defines the following functions:
fr: Le module :mod:`nis` définit les instructions suivantes :

source: Return the match for *key* in map *mapname*, or raise an error (:exc:`nis.error`) if there is none. Both should be strings, *key* is 8-bit clean. Return value is an arbitrary array of bytes (may contain ``NULL`` and other joys).
fr: Renvoie la valeur correspondante à *key* dans carte *mapname*, ou lève une erreur (:exc:`nis.error`) s'il n'y en a pas. Toutes les deux doivent être des chaînes, *key* doit être une chaîne ASCII. La valeur renvoyée est un dictionnaire arbitraire d'octets (pourrait contenir ``NULL`` et autres joyeusetés).

source: Note that *mapname* is first checked if it is an alias to another name.
fr: Notez que *mapname* est vérifié la première fois si c'est un alias d'un autre nom.

source: The *domain* argument allows overriding the NIS domain used for the lookup. If unspecified, lookup is in the default NIS domain.
fr: L'argument *domain* permet de passer outre le domaine NIS utilisé pour les recherches. Lorsqu'il n'est pas spécifié, recherche est dans le domaine NIS défaut.

source: Return a dictionary mapping *key* to *value* such that ``match(key, mapname)==value``. Note that both keys and values of the dictionary are arbitrary arrays of bytes.
fr: Renvoie un dictionnaire qui associe *key* à *value* tel que ``match(key, mapname)==value``. Notez que les clés comme les valeurs peuvent contenir des séquences arbitraires d'octets.

source: Return a list of all valid maps.
fr: Renvoie la liste de toutes les correspondances valides.

source: Return the system default NIS domain.
fr: Renvoie le domaine NIS par défaut du système.

source: The :mod:`nis` module defines the following exception:
fr: Le module :mod:`nis` définit les exceptions suivantes :

source: An error raised when a NIS function returns an error code.
fr: Une erreur apparaît quand une fonction NIS renvoie un code d'erreur.
