Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/os.po
Languages: ru, uk

source: The variants which include a second "p" near the end (:func:`spawnlp`, :func:`spawnlpe`, :func:`spawnvp`, and :func:`spawnvpe`) will use the :envvar:`PATH` environment variable to locate the program *file*. When the environment is being replaced (using one of the :func:`spawn\*e <spawnl>` variants, discussed in the next paragraph), the new environment is used as the source of the :envvar:`PATH` variable. The other variants, :func:`spawnl`, :func:`spawnle`, :func:`spawnv`, and :func:`spawnve`, will not use the :envvar:`PATH` variable to locate the executable; *path* must contain an appropriate absolute or relative path.
ru: Варианты, в которых есть вторая буква «p» в конце ( :func:`spawnlp` , :func:`spawnlpe` , :func:`spawnvp` , и :func:`spawnvpe` ) будет использовать :envvar:`ПУТЬ` переменная среды, чтобы найти *файл* программы. При замене среды (с использованием одного из :func:`spawn\*e `варианты, обсуждаемые в следующем параграфе), новая среда используется в качестве источника :envvar:`ПУТЬ` переменная. Остальные варианты, :func:`spawnl` , :func:`spawnle` , :func:`spawnv` , и :func:`spawnve` , не буду использовать :envvar:`ПУТЬ` переменная для поиска исполняемого файла; *path* должен содержать соответствующий абсолютный или относительный путь.
uk: Варіанти, які включають друге "p" у кінці (:func:`spawnlp`, :func:`spawnlpe`, :func:`spawnvp` і :func:`spawnvpe`), використовуватимуть :envvar:`PATH` змінна середовища для пошуку *файлу* програми. Під час заміни середовища (з використанням одного з варіантів :func:`spawn\*e <spawnl>`, розглянутих у наступному параграфі), нове середовище використовується як джерело змінної :envvar:`PATH`. Інші варіанти, :func:`spawnl`, :func:`spawnle`, :func:`spawnv` і :func:`spawnve`, не використовуватимуть змінну :envvar:`PATH` для пошуку виконуваного файлу; *path* повинен містити відповідний абсолютний або відносний шлях.

source: For :func:`spawnle`, :func:`spawnlpe`, :func:`spawnve`, and :func:`spawnvpe` (note that these all end in "e"), the *env* parameter must be a mapping which is used to define the environment variables for the new process (they are used instead of the current process' environment); the functions :func:`spawnl`, :func:`spawnlp`, :func:`spawnv`, and :func:`spawnvp` all cause the new process to inherit the environment of the current process. Note that keys and values in the *env* dictionary must be strings; invalid keys or values will cause the function to fail, with a return value of ``127``.
ru: Для :func:`spawnle` , :func:`spawnlpe` , :func:`spawnve` , и :func:`spawnvpe` (обратите внимание, что все они заканчиваются на «e»), параметр *env* должен быть сопоставлением, которое используется для определения переменных среды для нового процесса (они используются вместо среды текущего процесса); функции :func:`spawnl` , :func:`spawnlp` , :func:`spawnv` , и :func:`spawnvp` все это приводит к тому, что новый процесс наследует среду текущего процесса. Обратите внимание, что ключи и значения в словаре *env* должны быть строками; недопустимые ключи или значения приведут к сбою функции с возвращаемым значением ``127`` .
uk: Для :func:`spawnle`, :func:`spawnlpe`, :func:`spawnve` і :func:`spawnvpe` (зауважте, що всі вони закінчуються на "e"), параметр *env* має бути відображенням який використовується для визначення змінних середовища для нового процесу (вони використовуються замість середовища поточного процесу); функції :func:`spawnl`, :func:`spawnlp`, :func:`spawnv` і :func:`spawnvp` змушують новий процес успадковувати середовище поточного процесу. Зауважте, що ключі та значення у словнику *env* мають бути рядками; недійсні ключі або значення призведуть до помилки функції з поверненням значення ``127``.

source: As an example, the following calls to :func:`spawnlp` and :func:`spawnvpe` are equivalent::
ru: В качестве примера можно привести следующие вызовы :func:`spawnlp` и :func:`spawnvpe` эквивалентны::
uk: Як приклад, наступні виклики :func:`spawnlp` і :func:`spawnvpe` є еквівалентними:

source: Raises an :ref:`auditing event <auditing>` ``os.spawn`` with arguments ``mode``, ``path``, ``args``, ``env``.
ru: Вызывает :ref:`событие аудита ` ``os.spawn`` с аргументами ``режим`` , ``путь`` , ``args`` , ``окр`` .
uk: Викликає :ref:`подію аудиту <auditing>` ``os.spawn`` з аргументами ``mode``, ``path``, ``args``, ``env``.

source: :ref:`Availability <availability>`: Unix, Windows. :func:`spawnlp`, :func:`spawnlpe`, :func:`spawnvp` and :func:`spawnvpe` are not available on Windows. :func:`spawnle` and :func:`spawnve` are not thread-safe on Windows; we advise you to use the :mod:`subprocess` module instead.
uk: :ref:`Наявність <availability>`: Unix, Windows. :func:`spawnlp`, :func:`spawnlpe`, :func:`spawnvp` і :func:`spawnvpe` недоступні в Windows. :func:`spawnle` і :func:`spawnve` не є потокобезпечними у Windows; радимо замість цього використовувати модуль :mod:`subprocess`.

source: Possible values for the *mode* parameter to the :func:`spawn\* <spawnl>` family of functions. If either of these values is given, the :func:`spawn\*` functions will return as soon as the new process has been created, with the process id as the return value.
uk: Можливі значення для параметра *mode* для сімейства функцій :func:`spawn\* <spawnl>`. Якщо задано будь-яке з цих значень, функції :func:`spawn\*` повернуться, щойно буде створено новий процес, з ідентифікатором процесу як значенням, що повертається.

source: Possible value for the *mode* parameter to the :func:`spawn\* <spawnl>` family of functions. If this is given as *mode*, the :func:`spawn\*` functions will not return until the new process has run to completion and will return the exit code of the process the run is successful, or ``-signal`` if a signal kills the process.
uk: Можливе значення для параметра *mode* для сімейства функцій :func:`spawn\* <spawnl>`. Якщо це вказано як *mode*, функції :func:`spawn\*` не повернуться, доки новий процес не буде виконано до завершення, і повернеться код виходу процесу, запущений успішно, або ``-signal`` якщо сигнал вбиває процес.

source: Possible values for the *mode* parameter to the :func:`spawn\* <spawnl>` family of functions. These are less portable than those listed above. :const:`P_DETACH` is similar to :const:`P_NOWAIT`, but the new process is detached from the console of the calling process. If :const:`P_OVERLAY` is used, the current process will be replaced; the :func:`spawn\* <spawnl>` function will not return.
ru: Возможные значения параметра *mode* для :func:`spawn\* `семейство функций. Они менее портативны, чем перечисленные выше. :const:`P_DETACH` похоже на :const:`P_NOWAIT` , но новый процесс отсоединяется от консоли вызывающего процесса. Если :const:`P_OVERLAY` используется, текущий процесс будет заменен; :func:`икра\*`функция не вернется.
uk: Можливі значення для параметра *mode* для сімейства функцій :func:`spawn\* <spawnl>`. Вони менш портативні, ніж перелічені вище. :const:`P_DETACH` подібний до :const:`P_NOWAIT`, але новий процес від’єднується від консолі процесу, що викликає. Якщо :const:`P_OVERLAY` використовується, поточний процес буде замінено; функція :func:`spawn\* <spawnl>` не повернеться.

source: Start a file with its associated application.
ru: Запустите файл со связанным с ним приложением.
uk: Запустіть файл із пов’язаною програмою.

source: When *operation* is not specified or ``'open'``, this acts like double-clicking the file in Windows Explorer, or giving the file name as an argument to the :program:`start` command from the interactive command shell: the file is opened with whatever application (if any) its extension is associated.
uk: Якщо *operation* не вказано або ``'open'``, це діє як подвійне клацання файлу в Провіднику Windows або надання імені файлу як аргументу команді :program:`start` з інтерактивної командної оболонки : файл відкривається будь-якою програмою (якщо є), з якою пов’язано його розширення.

source: When another *operation* is given, it must be a "command verb" that specifies what should be done with the file. Common verbs documented by Microsoft are ``'print'`` and ``'edit'`` (to be used on files) as well as ``'explore'`` and ``'find'`` (to be used on directories).
uk: Коли надана інша *операція*, це має бути "командне дієслово", яке вказує, що слід робити з файлом. Поширеними дієсловами, задокументованими Microsoft, є ``'print'`` і ``'edit'`` (для використання у файлах), а також ``'explore'`` і ``'find'`` (для використання в довідниках).

source: To reduce interpreter startup overhead, the Win32 :c:func:`ShellExecute` function is not resolved until this function is first called. If the function cannot be resolved, :exc:`NotImplementedError` will be raised.
uk: Щоб зменшити навантаження на запуск інтерпретатора, функція Win32 :c:func:`ShellExecute` не вирішується, доки ця функція не буде викликана вперше. Якщо функцію не вдається розв’язати, виникне :exc:`NotImplementedError`.

source: Raises an :ref:`auditing event <auditing>` ``os.startfile`` with arguments ``path``, ``operation``.
ru: Вызывает :ref:`событие аудита ` ``os.startfile`` с аргументами ``путь`` , ``операция`` .
uk: Викликає :ref:`подію аудиту <auditing>` ``os.startfile`` з аргументами ``path``, ``operation``.

source: Execute the command (a string) in a subshell. This is implemented by calling the Standard C function :c:func:`system`, and has the same limitations. Changes to :data:`sys.stdin`, etc. are not reflected in the environment of the executed command. If *command* generates any output, it will be sent to the interpreter standard output stream. The C standard does not specify the meaning of the return value of the C function, so the return value of the Python function is system-dependent.
ru: Выполните команду (строку) в подоболочке. Это реализуется путем вызова стандартной функции C. :c:func:`система` и имеет те же ограничения. Изменения в :data:`sys.stdin` и т. д. не отражаются в окружении исполняемой команды. Если *команда* генерирует какой-либо вывод, он будет отправлен в стандартный поток вывода интерпретатора. Стандарт C не определяет значение возвращаемого значения функции C, поэтому возвращаемое значение функции Python зависит от системы.
uk: Виконайте команду (рядок) у підоболонці. Це реалізується шляхом виклику стандартної функції C :c:func:`system` і має ті самі обмеження. Зміни в :data:`sys.stdin` тощо не відображаються в середовищі виконуваної команди. Якщо *команда* генерує будь-який вихід, він буде надісланий до стандартного потоку виводу інтерпретатора. Стандарт C не визначає значення значення, що повертається функцією C, тому значення, що повертається функцією Python, залежить від системи.

source: On Unix, the return value is the exit status of the process encoded in the format specified for :func:`wait`.
ru: В Unix возвращаемое значение — это статус завершения процесса, закодированный в формате, указанном для :func:`подожди` .
uk: В Unix значення, що повертається, є статусом завершення процесу, закодованим у форматі, указаному для :func:`wait`.

source: On Windows, the return value is that returned by the system shell after running *command*. The shell is given by the Windows environment variable :envvar:`COMSPEC`: it is usually :program:`cmd.exe`, which returns the exit status of the command run; on systems using a non-native shell, consult your shell documentation.
ru: В Windows возвращаемое значение — это значение, возвращаемое системной оболочкой после выполнения *команды*. Оболочка задается переменной среды Windows. :envvar:`COMSPEC` : обычно это :program:`cmd.exe` , который возвращает статус завершения выполнения команды; в системах, использующих неродную оболочку, обратитесь к документации вашей оболочки.
uk: У Windows повертається значення, яке повертає системна оболонка після виконання *команди*. Оболонка визначається змінною середовища Windows :envvar:`COMSPEC`: зазвичай це :program:`cmd.exe`, яка повертає статус завершення виконання команди; у системах, які використовують нерідну оболонку, зверніться до документації вашої оболонки.

source: The :mod:`subprocess` module provides more powerful facilities for spawning new processes and retrieving their results; using that module is preferable to using this function. See the :ref:`subprocess-replacements` section in the :mod:`subprocess` documentation for some helpful recipes.
ru: The :mod:`подпроцесс` модуль предоставляет более мощные возможности для создания новых процессов и получения их результатов; использование этого модуля предпочтительнее использования этой функции. См. :ref:`замены подпроцессов` раздел в :mod:`подпроцесс` документация с некоторыми полезными рецептами.
uk: Модуль :mod:`subprocess` надає потужніші можливості для створення нових процесів і отримання їх результатів; використовувати цей модуль краще, ніж використовувати цю функцію. Перегляньте розділ :ref:`subprocess-replacements` в документації :mod:`subprocess`, щоб знайти кілька корисних рецептів.

source: On Unix, :func:`waitstatus_to_exitcode` can be used to convert the result (exit status) into an exit code. On Windows, the result is directly the exit code.
ru: В Unix, :func:`waitstatus_to_exitcode` может использоваться для преобразования результата (статуса выхода) в код выхода. В Windows результатом является непосредственно код выхода.
uk: В Unix :func:`waitstatus_to_exitcode` можна використовувати для перетворення результату (статус виходу) у код виходу. У Windows результатом є безпосередньо код виходу.

source: Raises an :ref:`auditing event <auditing>` ``os.system`` with argument ``command``.
ru: Вызывает :ref:`событие аудита ` ``os.system`` с аргументом ``команда`` .
uk: Викликає :ref:`подію аудиту <auditing>` ``os.system`` з аргументом ``command``.

source: Returns the current global process times. The return value is an object with five attributes:
ru: Возвращает текущее время глобального процесса. Возвращаемое значение — это объект с пятью атрибутами:
uk: Повертає поточний глобальний час процесу. Повернене значення є об’єктом із п’ятьма атрибутами:

source: :attr:`!user` - user time
ru: :attr:`!user` - время пользователя
uk: :attr:`!user` - час користувача

source: :attr:`!system` - system time
ru: :attr:`!система` - системное время
uk: :attr:`!system` - системний час

source: :attr:`!children_user` - user time of all child processes
ru: :attr:`!children_user` - пользовательское время всех дочерних процессов
uk: :attr:`!children_user` - час користувача всіх дочірніх процесів

source: :attr:`!children_system` - system time of all child processes
ru: :attr:`!children_system` - системное время всех дочерних процессов
uk: :attr:`!children_system` - системний час усіх дочірніх процесів

source: :attr:`!elapsed` - elapsed real time since a fixed point in the past
ru: :attr:`!истекло` - прошедшее в реальном времени с момента фиксированной точки в прошлом
uk: :attr:`!elapsed` - реальний час, що минув від фіксованої точки в минулому

source: For backwards compatibility, this object also behaves like a five-tuple containing :attr:`!user`, :attr:`!system`, :attr:`!children_user`, :attr:`!children_system`, and :attr:`!elapsed` in that order.
ru: В целях обратной совместимости этот объект также ведет себя как кортеж из пяти элементов, содержащий :attr:`!user` , :attr:`!система` , :attr:`!children_user` , :attr:`!children_system` , и :attr:`!истекло` в таком порядке.
uk: Для зворотної сумісності цей об’єкт також поводиться як п’ять кортежів, що містять :attr:`!user`, :attr:`!system`, :attr:`!children_user`, :attr:`!children_system` і :attr:`!минало` в такому порядку.

source: Wait for completion of a child process, and return a tuple containing its pid and exit status indication: a 16-bit number, whose low byte is the signal number that killed the process, and whose high byte is the exit status (if the signal number is zero); the high bit of the low byte is set if a core file was produced.
ru: Дождитесь завершения дочернего процесса и верните кортеж, содержащий его pid и указание статуса выхода: 16-битное число, младший байт которого — это номер сигнала, который завершил процесс, а старший байт — статус выхода (если сигнал число равно нулю); старший бит младшего байта устанавливается, если был создан основной файл.
uk: Зачекайте на завершення дочірнього процесу та поверніть кортеж, що містить його pid та індикацію статусу виходу: 16-розрядне число, чий молодший байт є номером сигналу, що вбив процес, а старший байт є статусом виходу (якщо сигнал число дорівнює нулю); старший біт молодшого байта встановлюється, якщо було створено основний файл.

source: :func:`waitstatus_to_exitcode` can be used to convert the exit status into an exit code.
ru: :func:`waitstatus_to_exitcode` может использоваться для преобразования статуса выхода в код выхода.
uk: :func:`waitstatus_to_exitcode` можна використовувати для перетворення статусу виходу в код виходу.

source: :func:`waitpid` can be used to wait for the completion of a specific child process and has more options.
uk: :func:`waitpid` можна використовувати для очікування завершення певного дочірнього процесу та має більше параметрів.

source: Wait for the completion of one or more child processes. *idtype* can be :data:`P_PID`, :data:`P_PGID`, :data:`P_ALL`, or :data:`P_PIDFD` on Linux. *id* specifies the pid to wait on. *options* is constructed from the ORing of one or more of :data:`WEXITED`, :data:`WSTOPPED` or :data:`WCONTINUED` and additionally may be ORed with :data:`WNOHANG` or :data:`WNOWAIT`. The return value is an object representing the data contained in the :c:type:`siginfo_t` structure, namely: :attr:`si_pid`, :attr:`si_uid`, :attr:`si_signo`, :attr:`si_status`, :attr:`si_code` or ``None`` if :data:`WNOHANG` is specified and there are no children in a waitable state.
uk: Дочекайтеся завершення одного або кількох дочірніх процесів. *idtype* може бути :data:`P_PID`, :data:`P_PGID`, :data:`P_ALL` або :data:`P_PIDFD` в Linux. *id* вказує pid, на який потрібно чекати. *параметри* складаються з операції АБО одного чи кількох :data:`WEXITED`, :data:`WSTOPPED` або :data:`WCONTINUED` і додатково можуть бути об’єднані АБО за допомогою :data:`WNOHANG` або :data:`WNOWAIT`. Повернене значення — це об’єкт, що представляє дані, що містяться в структурі :c:type:`siginfo_t`, а саме: :attr:`si_pid`, :attr:`si_uid`, :attr:`si_signo`, :attr:`si_status`, :attr:`si_code` або ``None``, якщо вказано :data:`WNOHANG` і немає дітей у стані очікування.

source: These are the possible values for *idtype* in :func:`waitid`. They affect how *id* is interpreted.
uk: Це можливі значення для *idtype* у :func:`waitid`. Вони впливають на інтерпретацію *id*.

source: This is a Linux-specific *idtype* that indicates that *id* is a file descriptor that refers to a process.
uk: Це специфічний *idtype* для Linux, який вказує, що *id* є дескриптором файлу, який посилається на процес.

source: :ref:`Availability <availability>`: Linux 5.4+
uk: :ref:`Наявність <availability>`: Linux 5.4+

source: Flags that can be used in *options* in :func:`waitid` that specify what child signal to wait for.
uk: Прапорці, які можна використовувати в *параметрах* у :func:`waitid`, які вказують, який дочірній сигнал чекати.

source: These are the possible values for :attr:`si_code` in the result returned by :func:`waitid`.
uk: Це можливі значення для :attr:`si_code` у результаті, який повертає :func:`waitid`.

source: Added :data:`CLD_KILLED` and :data:`CLD_STOPPED` values.
ru: Добавлен :data:`CLD_KILLED` и :data:`CLD_STOPPED` ценности.
uk: Додано значення :data:`CLD_KILLED` і :data:`CLD_STOPPED`.

source: The details of this function differ on Unix and Windows.
ru: Детали этой функции различаются в Unix и Windows.
uk: Деталі цієї функції відрізняються в Unix і Windows.

source: On Unix: Wait for completion of a child process given by process id *pid*, and return a tuple containing its process id and exit status indication (encoded as for :func:`wait`). The semantics of the call are affected by the value of the integer *options*, which should be ``0`` for normal operation.
ru: В Unix: дождитесь завершения дочернего процесса, заданного идентификатором процесса *pid*, и верните кортеж, содержащий его идентификатор процесса и индикатор статуса завершения (закодированный как для :func:`подожди` ). На семантику вызова влияет значение целого числа *options*, которое должно быть ``0`` для нормальной работы.
uk: В Unix: зачекайте на завершення дочірнього процесу, заданого ідентифікатором процесу *pid*, і поверніть кортеж, що містить ідентифікатор його процесу та вказівку статусу виходу (закодовано як для :func:`wait`). На семантику виклику впливає значення цілого числа *options*, яке має бути ``0`` для нормальної роботи.

source: If *pid* is greater than ``0``, :func:`waitpid` requests status information for that specific process. If *pid* is ``0``, the request is for the status of any child in the process group of the current process. If *pid* is ``-1``, the request pertains to any child of the current process. If *pid* is less than ``-1``, status is requested for any process in the process group ``-pid`` (the absolute value of *pid*).
ru: Если *pid* больше, чем ``0`` , :func:`waitpid` запрашивает информацию о состоянии для этого конкретного процесса. Если *pid* ``0`` , запрос предназначен для статуса любого дочернего процесса в группе процессов текущего процесса. Если *pid* ``-1`` , запрос относится к любому дочернему процессу текущего процесса. Если *pid* меньше чем ``-1`` , статус запрашивается для любого процесса в группе процессов ``-пид`` (абсолютное значение *pid*).
uk: Якщо *pid* більший за ``0``, :func:`waitpid` запитує інформацію про статус для цього конкретного процесу. Якщо *pid* дорівнює ``0``, запит стосується статусу будь-якого дочірнього елемента в групі поточного процесу. Якщо *pid* має значення ``-1``, запит стосується будь-якого дочірнього процесу поточного процесу. Якщо *pid* менший за ``-1``, статус запитується для будь-якого процесу в групі процесів ``-pid`` (абсолютне значення *pid*).

source: An :exc:`OSError` is raised with the value of errno when the syscall returns -1.
uk: Коли системний виклик повертає -1, виникає :exc:`OSError` зі значенням errno.
