Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/os.path.po
Languages: ru

source: :mod:`!os.path` --- Common pathname manipulations
ru: :mod:`!os.path` --- Общие манипуляции с путями

source: **Source code:** :source:`Lib/genericpath.py`, :source:`Lib/posixpath.py` (for POSIX) and :source:`Lib/ntpath.py` (for Windows).
ru: **Исходный код:** :source:`Lib/genericpath.py`, :source:`Lib/posixpath.py` (для POSIX) и :source:`Lib/ntpath.py` (для Windows).

source: This module implements some useful functions on pathnames. To read or write files see :func:`open`, and for accessing the filesystem see the :mod:`os` module. The path parameters can be passed as strings, or bytes, or any object implementing the :class:`os.PathLike` protocol.
ru: Этот модуль реализует некоторые полезные функции для имен путей. Для чтения или записи файлов используйте :func:`open`, а для доступа к файловой системе используйте модуль :mod:`os`. Параметры пути могут передаваться в виде строк, байтов или любого объекта, реализующего протокол :class:`os.PathLike`.

source: Unlike a Unix shell, Python does not do any *automatic* path expansions. Functions such as :func:`expanduser` and :func:`expandvars` can be invoked explicitly when an application desires shell-like path expansion. (See also the :mod:`glob` module.)
ru: В отличие от оболочки Unix, Python не выполняет никаких *автоматических* расширений путей. Такие функции, как :func:`expanduser` и :func:`expandvars`, можно вызывать явно, когда приложению требуется расширение пути в стиле оболочки. (См. также модуль :mod:`glob`.)

source: The :mod:`pathlib` module offers high-level path objects.
ru: Модуль :mod:`pathlib` предлагает объекты путей высокого уровня.

source: All of these functions accept either only bytes or only string objects as their parameters. The result is an object of the same type, if a path or file name is returned.
ru: Все эти функции принимают в качестве параметров либо только байты, либо только строковые объекты. Результатом является объект того же типа, если возвращается путь или имя файла.

source: Since different operating systems have different path name conventions, there are several versions of this module in the standard library. The :mod:`os.path` module is always the path module suitable for the operating system Python is running on, and therefore usable for local paths. However, you can also import and use the individual modules if you want to manipulate a path that is *always* in one of the different formats. They all have the same interface:
ru: Поскольку в разных операционных системах действуют разные соглашения об именах путей, в стандартной библиотеке имеется несколько версий этого модуля. Модуль :mod:`os.path` всегда является модулем пути, подходящим для операционной системы, в которой работает Python, и, следовательно, может использоваться для локальных путей. Однако вы также можете импортировать и использовать отдельные модули, если хотите манипулировать путем, который *всегда* находится в одном из различных форматов. Все они имеют одинаковый интерфейс:

source: :mod:`posixpath` for UNIX-style paths
ru: :mod:`posixpath` для путей в стиле UNIX

source: :mod:`ntpath` for Windows paths
ru: :mod:`ntpath` для путей Windows

source: :func:`exists`, :func:`lexists`, :func:`isdir`, :func:`isfile`, :func:`islink`, and :func:`ismount` now return ``False`` instead of raising an exception for paths that contain characters or bytes unrepresentable at the OS level.
ru: :func:`exists`, :func:`lexists`, :func:`isdir`, :func:`isfile`, :func:`islink` и :func:`ismount` теперь вместо этого возвращают ``False`` создания исключения для путей, содержащих символы или байты, непредставимые на уровне ОС.

source: Return a normalized absolutized version of the pathname *path*. On most platforms, this is equivalent to calling the function :func:`normpath` as follows: ``normpath(join(os.getcwd(), path))``.
ru: Возвращает нормализованную абсолютную версию пути *path*. На большинстве платформ это эквивалентно вызову функции :func:`normpath` следующим образом: ``normpath(join(os.getcwd(), path))``.

source: Accepts a :term:`path-like object`.
ru: Принимает :term:`объект, похожий на путь`.

source: Return the base name of pathname *path*. This is the second element of the pair returned by passing *path* to the function :func:`split`. Note that the result of this function is different from the Unix :program:`basename` program; where :program:`basename` for ``'/foo/bar/'`` returns ``'bar'``, the :func:`basename` function returns an empty string (``''``).
ru: Возвращает базовое имя пути *path*. Это второй элемент пары, возвращаемой путем передачи *path* функции :func:`split`. Обратите внимание, что результат этой функции отличается от результата программы Unix :program:`basename`; где :program:`basename` для ``'/foo/bar/'`` возвращает ``'bar'``, функция :func:`basename` возвращает пустую строку (``''``).

source: Return the longest common sub-path of each pathname in the iterable *paths*. Raise :exc:`ValueError` if *paths* contain both absolute and relative pathnames, if *paths* are on different drives, or if *paths* is empty. Unlike :func:`commonprefix`, this returns a valid path.
ru: Возвращает самый длинный общий подпуть каждого пути в итерируемых *paths*. Поднимите :exc:`ValueError`, если *paths* содержит как абсолютные, так и относительные имена путей, если *paths* находятся на разных дисках или если *paths* пусто. В отличие от :func:`commonprefix`, он возвращает действительный путь.

source: Accepts a sequence of :term:`path-like objects <path-like object>`.
ru: Принимает последовательность :term:`path-like object <path-like object>`.

source: Any iterable can now be passed, rather than just sequences.
ru: Теперь можно передавать любые итерации, а не только последовательности.

source: Return the longest path prefix (taken character-by-character) that is a prefix of all paths in *list*. If *list* is empty, return the empty string (``''``).
ru: Возвращает префикс самого длинного пути (посимвольный), который является префиксом всех путей в *списке*. Если *list* пуст, верните пустую строку (``''``).

source: This function may return invalid paths because it works a character at a time. To obtain a valid path, see :func:`commonpath`.
ru: Эта функция может возвращать недопустимые пути, поскольку она обрабатывает посимвольно. Чтобы получить действительный путь, см. :func:`commonpath`.

source: >>> os.path.commonprefix(['/usr/lib', '/usr/local/lib']) '/usr/l' >>> os.path.commonpath(['/usr/lib', '/usr/local/lib']) '/usr'
ru: >>> os.path.commonprefix(['/usr/lib', '/usr/local/lib']) '/usr/л' >>> os.path.commonpath(['/usr/lib', '/usr/local/lib']) '/usr'

source: Return the directory name of pathname *path*. This is the first element of the pair returned by passing *path* to the function :func:`split`.
ru: Возвращает имя каталога с именем пути *path*. Это первый элемент пары, возвращаемой путем передачи *path* функции :func:`split`.

source: Return ``True`` if *path* refers to an existing path or an open file descriptor. Returns ``False`` for broken symbolic links. On some platforms, this function may return ``False`` if permission is not granted to execute :func:`os.stat` on the requested file, even if the *path* physically exists.
ru: Возвращайте ``True``, если *path* относится к существующему пути или дескриптору открытого файла. Возвращает False для неработающих символических ссылок. На некоторых платформах эта функция может возвращать «False», если не предоставлено разрешение на выполнение :func:`os.stat` для запрошенного файла, даже если *path* физически существует.

source: *path* can now be an integer: ``True`` is returned if it is an open file descriptor, ``False`` otherwise.
ru: *path* теперь может быть целым числом: ``True`` возвращается, если это дескриптор открытого файла, ``False`` в противном случае.

source: Return ``True`` if *path* refers to an existing path, including broken symbolic links. Equivalent to :func:`exists` on platforms lacking :func:`os.lstat`.
ru: Возвращайте ``True``, если *path* относится к существующему пути, включая неработающие символические ссылки. Эквивалент :func:`exists` на платформах, где отсутствует :func:`os.lstat`.

source: On Unix and Windows, return the argument with an initial component of ``~`` or ``~user`` replaced by that *user*'s home directory.
ru: В Unix и Windows верните аргумент, заменяя начальный компонент ``~`` или ``~user`` домашним каталогом этого *user*.

source: On Unix, an initial ``~`` is replaced by the environment variable :envvar:`HOME` if it is set; otherwise the current user's home directory is looked up in the password directory through the built-in module :mod:`pwd`. An initial ``~user`` is looked up directly in the password directory.
ru: В Unix начальная переменная ``~`` заменяется переменной среды :envvar:`HOME`, если она установлена; в противном случае домашний каталог текущего пользователя ищется в каталоге паролей с помощью встроенного модуля :mod:`pwd`. Исходный ``~user`` ищется непосредственно в каталоге паролей.

source: On Windows, :envvar:`USERPROFILE` will be used if set, otherwise a combination of :envvar:`HOMEPATH` and :envvar:`HOMEDRIVE` will be used. An initial ``~user`` is handled by checking that the last directory component of the current user's home directory matches :envvar:`USERNAME`, and replacing it if so.
ru: В Windows будет использоваться :envvar:`USERPROFILE`, если он установлен, в противном случае будет использоваться комбинация :envvar:`HOMEPATH` и :envvar:`HOMEDRIVE`. Начальный ``~user`` обрабатывается путем проверки соответствия последнего компонента домашнего каталога текущего пользователя :envvar:`USERNAME` и его замены, если это так.

source: If the expansion fails or if the path does not begin with a tilde, the path is returned unchanged.
ru: Если раскрытие завершается неудачей или путь не начинается с тильды, путь возвращается без изменений.

source: No longer uses :envvar:`HOME` on Windows.
ru: Больше не использует :envvar:`HOME` в Windows.

source: Return the argument with environment variables expanded. Substrings of the form ``$name`` or ``${name}`` are replaced by the value of environment variable *name*. Malformed variable names and references to non-existing variables are left unchanged.
ru: Верните аргумент с расширенными переменными среды. Подстроки вида ``$name`` или ``${name}`` заменяются значением переменной среды *name*. Неверные имена переменных и ссылки на несуществующие переменные остаются неизменными.

source: On Windows, ``%name%`` expansions are supported in addition to ``$name`` and ``${name}``.
ru: В Windows `` %n Расширения ame%`` поддерживаются в дополнение к ``$name`` и ``${name}``.

source: Return the time of last access of *path*. The return value is a floating-point number giving the number of seconds since the epoch (see the :mod:`time` module). Raise :exc:`OSError` if the file does not exist or is inaccessible.
ru: Возвращает время последнего доступа к *path*. Возвращаемое значение представляет собой число с плавающей запятой, указывающее количество секунд, прошедших с начала эпохи (см. модуль :mod:`time`). Поднимите :exc:`OSError`, если файл не существует или недоступен.

source: Return the time of last modification of *path*. The return value is a floating-point number giving the number of seconds since the epoch (see the :mod:`time` module). Raise :exc:`OSError` if the file does not exist or is inaccessible.
ru: Возвращает время последней модификации *path*. Возвращаемое значение представляет собой число с плавающей запятой, указывающее количество секунд, прошедших с начала эпохи (см. модуль :mod:`time`). Поднимите :exc:`OSError`, если файл не существует или недоступен.

source: Return the system's ctime which, on some systems (like Unix) is the time of the last metadata change, and, on others (like Windows), is the creation time for *path*. The return value is a number giving the number of seconds since the epoch (see the :mod:`time` module). Raise :exc:`OSError` if the file does not exist or is inaccessible.
ru: Возвращает системное время, которое в некоторых системах (например, Unix) является временем последнего изменения метаданных, а в других (например, Windows) — временем создания *path*. Возвращаемое значение — это число, обозначающее количество секунд, прошедших с эпохи (см. модуль :mod:`time`). Поднимите :exc:`OSError`, если файл не существует или недоступен.

source: Return the size, in bytes, of *path*. Raise :exc:`OSError` if the file does not exist or is inaccessible.
ru: Возвращает размер *path* в байтах. Поднимите :exc:`OSError`, если файл не существует или недоступен.

source: Return ``True`` if *path* is an absolute pathname. On Unix, that means it begins with a slash, on Windows that it begins with two (back)slashes, or a drive letter, colon, and (back)slash together.
ru: Верните ``True``, если *path* является абсолютным путем. В Unix это означает, что он начинается с косой черты, в Windows — с двух (обратных) косых черт или буквы диска, двоеточия и (обратной) косой черты вместе.

source: On Windows, returns ``False`` if the given path starts with exactly one (back)slash.
ru: В Windows возвращает «False», если заданный путь начинается ровно с одной (обратной) косой черты.

source: Return ``True`` if *path* is an :func:`existing <exists>` regular file. This follows symbolic links, so both :func:`islink` and :func:`isfile` can be true for the same path.
ru: Возвращает ``True``, если *path* является :func:`existing <exists>` обычным файлом. Это следует за символическими ссылками, поэтому оба :func:`islink` и :func:`isfile` могут быть истинными для одного и того же пути.

source: Return ``True`` if *path* is an :func:`existing <exists>` directory. This follows symbolic links, so both :func:`islink` and :func:`isdir` can be true for the same path.
ru: Возвращает ``True``, если *path* является существующим каталогом <exists>`. Это следует за символическими ссылками, поэтому оба :func:`islink` и :func:`isdir` могут быть истинными для одного и того же пути.

source: Return ``True`` if *path* refers to an :func:`existing <lexists>` directory entry that is a junction. Always return ``False`` if junctions are not supported on the current platform.
ru: Возвращайте ``True``, если *path* относится к существующей записи каталога <lexists>`, которая является соединением. Всегда возвращайте False, если соединения не поддерживаются на текущей платформе.

source: Return ``True`` if *path* refers to an :func:`existing <exists>` directory entry that is a symbolic link. Always ``False`` if symbolic links are not supported by the Python runtime.
ru: Возвращает ``True``, если *path* относится к существующей записи каталога <exists>`, которая является символической ссылкой. Всегда ``False``, если символические ссылки не поддерживаются средой выполнения Python.

source: Return ``True`` if pathname *path* is a :dfn:`mount point`: a point in a file system where a different file system has been mounted. On POSIX, the function checks whether *path*'s parent, :file:`{path}/..`, is on a different device than *path*, or whether :file:`{path}/..` and *path* point to the same i-node on the same device --- this should detect mount points for all Unix and POSIX variants. It is not able to reliably detect bind mounts on the same filesystem. On Windows, a drive letter root and a share UNC are always mount points, and for any other path ``GetVolumePathName`` is called to see if it is different from the input path.
ru: Возвращает ``True``, если путь *path* представляет собой :dfn:`точку монтирования`: точку в файловой системе, где была смонтирована другая файловая система. В POSIX функция проверяет, находится ли родительский элемент *path*, :file:`{path}/..`, на другом устройстве, чем *path*, или :file:`{path}/..` и *path* указывает на один и тот же i-узел на том же устройстве --- это должно определять точки монтирования для всех вариантов Unix и POSIX. Он не может надежно обнаружить монтирование привязки в одной и той же файловой системе. В Windows корневая буква диска и общий UNC всегда являются точками монтирования, а для любого другого пути вызывается GetVolumePathName, чтобы проверить, отличается ли он от входного пути.

source: Added support for detecting non-root mount points on Windows.
ru: Добавлена ​​поддержка обнаружения точек монтирования без полномочий root в Windows.

source: Return ``True`` if pathname *path* is located on a Windows Dev Drive. A Dev Drive is optimized for developer scenarios, and offers faster performance for reading and writing files. It is recommended for use for source code, temporary build directories, package caches, and other IO-intensive operations.
ru: Верните ``True``, если путь *path* находится на диске разработчика Windows. Dev Drive оптимизирован для сценариев разработки и обеспечивает более высокую производительность при чтении и записи файлов. Рекомендуется использовать для исходного кода, временных каталогов сборки, кэшей пакетов и других операций с интенсивным вводом-выводом.

source: May raise an error for an invalid path, for example, one without a recognizable drive, but returns ``False`` on platforms that do not support Dev Drives. See `the Windows documentation <https://learn.microsoft.com/windows/dev-drive/>`_ for information on enabling and creating Dev Drives.
ru: Может вызвать ошибку из-за недопустимого пути, например, без распознаваемого диска, но возвращает «False» на платформах, которые не поддерживают Dev Drives. См. `документацию Windows <https://learn.microsoft.com/windows/dev-drive/>`_ для получения информации о включении и создании Dev Drives.

source: The function is now available on all platforms, and will always return ``False`` on those that have no support for Dev Drives
ru: Функция теперь доступна на всех платформах и всегда будет возвращать значение «False» на тех, которые не поддерживают Dev Drives.

source: Return ``True`` if *path* is a reserved pathname on the current system.
ru: Верните ``True``, если *path* — зарезервированный путь в текущей системе.

source: On Windows, reserved filenames include those that end with a space or dot; those that contain colons (i.e. file streams such as "name:stream"), wildcard characters (i.e. ``'*?"<>'``), pipe, or ASCII control characters; as well as DOS device names such as "NUL", "CON", "CONIN$", "CONOUT$", "AUX", "PRN", "COM1", and "LPT1".
ru: В Windows зарезервированные имена файлов включают те, которые заканчиваются пробелом или точкой; те, которые содержат двоеточия (т. е. файловые потоки, такие как «имя:поток»), подстановочные знаки (т. е. ``'*?"<>'``), вертикальные или управляющие символы ASCII; а также имена устройств DOS, такие как " NUL", "CON", "CONIN$", "CONOUT$", "AUX", "PRN", "COM1" и "LPT1".

source: This function approximates rules for reserved paths on most Windows systems. These rules change over time in various Windows releases. This function may be updated in future Python releases as changes to the rules become broadly available.
ru: Эта функция аппроксимирует правила для зарезервированных путей в большинстве систем Windows. Эти правила со временем меняются в различных выпусках Windows. Эта функция может быть обновлена ​​в будущих выпусках Python, когда изменения в правилах станут широко доступны.

source: Availability
ru: Доступность

source: Join one or more path segments intelligently. The return value is the concatenation of *path* and all members of *\*paths*, with exactly one directory separator following each non-empty part, except the last. That is, the result will only end in a separator if the last part is either empty or ends in a separator. If a segment is an absolute path (which on Windows requires both a drive and a root), then all previous segments are ignored and joining continues from the absolute path segment.
ru: Разумно присоединяйтесь к одному или нескольким сегментам пути. Возвращаемое значение представляет собой объединение *path* и всех членов *\*paths*, с ровно одним разделителем каталогов после каждой непустой части, кроме последней. То есть результат будет заканчиваться разделителем только в том случае, если последняя часть либо пуста, либо заканчивается разделителем. Если сегмент представляет собой абсолютный путь (для которого в Windows требуется как диск, так и корень), то все предыдущие сегменты игнорируются, и присоединение продолжается с сегмента абсолютного пути.

source: On Windows, the drive is not reset when a rooted path segment (e.g., ``r'\foo'``) is encountered. If a segment is on a different drive or is an absolute path, all previous segments are ignored and the drive is reset. Note that since there is a current directory for each drive, ``os.path.join("c:", "foo")`` represents a path relative to the current directory on drive :file:`C:` (:file:`c:foo`), not :file:`c:\\foo`.
ru: В Windows диск не сбрасывается при обнаружении корневого сегмента пути (например, ``r'\foo'``). Если сегмент находится на другом диске или имеет абсолютный путь, все предыдущие сегменты игнорируются и диск сбрасывается. Обратите внимание: поскольку для каждого диска существует текущий каталог, ``os.path.join("c:", "foo")`` представляет путь относительно текущего каталога на диске :file:`C:` (: file:`c:foo`), а не :file:`c:\\foo`.

source: Accepts a :term:`path-like object` for *path* and *paths*.
ru: Принимает объект, похожий на путь, для *path* и *paths*.

source: Normalize the case of a pathname. On Windows, convert all characters in the pathname to lowercase, and also convert forward slashes to backward slashes. On other operating systems, return the path unchanged.
ru: Нормализуйте регистр пути. В Windows преобразуйте все символы в имени пути в нижний регистр, а также преобразуйте прямые косые черты в обратные. В других операционных системах верните путь без изменений.

source: Normalize a pathname by collapsing redundant separators and up-level references so that ``A//B``, ``A/B/``, ``A/./B`` and ``A/foo/../B`` all become ``A/B``. This string manipulation may change the meaning of a path that contains symbolic links. On Windows, it converts forward slashes to backward slashes. To normalize case, use :func:`normcase`.
ru: Нормализуйте путь, свернув избыточные разделители и ссылки верхнего уровня, чтобы ``A//B``, ``A/B/``, ``A/./B`` и ``A/foo/.. /B`` все становятся ``A/B``. Эта манипуляция со строками может изменить значение пути, содержащего символические ссылки. В Windows он преобразует косую черту в обратную. Чтобы нормализовать регистр, используйте :func:`normcase`.

source: On POSIX systems, in accordance with `IEEE Std 1003.1 2013 Edition; 4.13 Pathname Resolution <https://pubs.opengroup.org/onlinepubs/9699919799/basedefs/V1_chap04.html#tag_04_13>`_, if a pathname begins with exactly two slashes, the first component following the leading characters may be interpreted in an implementation-defined manner, although more than two leading characters shall be treated as a single character.
ru: В системах POSIX в соответствии со стандартом IEEE Std 1003.1, издание 2013 г.; 4.13 Разрешение пути <https://pubs.opengroup.org/onlinepubs/9699919799/basedefs/V1_chap04.html#tag_04_13>`_, если имя пути начинается ровно с двух косых черт, первый компонент, следующий за ведущими символами, может интерпретироваться как способом, определяемым реализацией, хотя более двух начальных символов должны рассматриваться как один символ.
