Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/os.po
Languages: ru, uk

source: This is a possible value for the flags argument in :func:`setxattr`. It indicates the operation must create an attribute.
ru: Это возможное значение аргумента flags в :func:`setxattr` . Это указывает на то, что операция должна создать атрибут.
uk: Це можливе значення для аргументу flags у :func:`setxattr`. Це вказує, що операція повинна створити атрибут.

source: This is a possible value for the flags argument in :func:`setxattr`. It indicates the operation must replace an existing attribute.
ru: Это возможное значение аргумента flags в :func:`setxattr` . Это указывает на то, что операция должна заменить существующий атрибут.
uk: Це можливе значення для аргументу flags у :func:`setxattr`. Це означає, що операція повинна замінити існуючий атрибут.

source: Process Management
ru: Управление процессом
uk: Управління процесами

source: These functions may be used to create and manage processes.
ru: Эти функции могут использоваться для создания процессов и управления ими.
uk: Ці функції можна використовувати для створення процесів і керування ними.

source: The various :func:`exec\* <execl>` functions take a list of arguments for the new program loaded into the process. In each case, the first of these arguments is passed to the new program as its own name rather than as an argument a user may have typed on a command line. For the C programmer, this is the ``argv[0]`` passed to a program's :c:func:`main`. For example, ``os.execv('/bin/echo', ['foo', 'bar'])`` will only print ``bar`` on standard output; ``foo`` will seem to be ignored.
ru: Различные :func:`exec\* ` функции принимают список аргументов новой программы, загруженной в процесс. В каждом случае первый из этих аргументов передается новой программе как ее собственное имя, а не как аргумент, который пользователь мог ввести в командной строке. Для программиста C это ``argv[0]`` перешел в программу :c:func:`main` . Например, ``os.execv('/bin/echo', ['foo', 'bar'])`` будет только печатать ``бар`` на стандартном выходе; ``фу`` будет выглядеть проигнорированным.
uk: Різні функції :func:`exec\* <execl>` приймають список аргументів для нової програми, завантаженої в процес. У кожному випадку перший із цих аргументів передається новій програмі як її власне ім’я, а не як аргумент, який користувач міг ввести в командному рядку. Для програміста на C це ``argv[0]``, що передається до :c:func:`main` програми. Наприклад, ``os.execv('/bin/echo', ['foo', 'bar'])`` виведе лише ``bar`` на стандартному виводі; ``foo`` буде проігноровано.

source: Generate a :const:`SIGABRT` signal to the current process. On Unix, the default behavior is to produce a core dump; on Windows, the process immediately returns an exit code of ``3``. Be aware that calling this function will not call the Python signal handler registered for :const:`SIGABRT` with :func:`signal.signal`.
ru: Создать :const:`СИГАБРТ` сигнал текущего процесса. В Unix по умолчанию создается дамп ядра; в Windows процесс немедленно возвращает код завершения ``3`` . Имейте в виду, что вызов этой функции не вызовет обработчик сигналов Python, зарегистрированный для :const:`СИГАБРТ` с :func:`сигнал.сигнал` .
uk: Згенерувати сигнал :const:`SIGABRT` для поточного процесу. В Unix типовою поведінкою є створення дампа ядра; у Windows процес негайно повертає код виходу ``3``. Майте на увазі, що виклик цієї функції не викличе обробник сигналів Python, зареєстрований для :const:`SIGABRT` з :func:`signal.signal`.

source: Add a path to the DLL search path.
ru: Добавьте путь к пути поиска DLL.
uk: Додайте шлях до шляху пошуку DLL.

source: This search path is used when resolving dependencies for imported extension modules (the module itself is resolved through :data:`sys.path`), and also by :mod:`ctypes`.
ru: Этот путь поиска используется при разрешении зависимостей для импортированных модулей расширения (сам модуль разрешается через :data:`sys.path` ), а также :mod:`ctypes` .
uk: Цей шлях пошуку використовується під час вирішення залежностей для імпортованих модулів розширення (сам модуль вирішується за допомогою :data:`sys.path`), а також за допомогою :mod:`ctypes`.

source: Remove the directory by calling **close()** on the returned object or using it in a :keyword:`with` statement.
ru: Удалите каталог, вызвав **close()** для возвращаемого объекта или используя его в :keyword:`с` заявление.
uk: Видаліть каталог, викликавши **close()** для повернутого об’єкта або використовуючи його в операторі :keyword:`with`.

source: See the `Microsoft documentation <https://msdn.microsoft.com/44228cf2-6306-466c-8f16-f513cd3ba8b5>`_ for more information about how DLLs are loaded.
ru: См. документацию Microsoft <https://msdn.microsoft.com/44228cf2-6306-466c-8f16-f513cd3ba8b5>`_ для получения дополнительной информации о загрузке DLL.
uk: Перегляньте `документацію Microsoft <https://msdn.microsoft.com/44228cf2-6306-466c-8f16-f513cd3ba8b5>`_, щоб дізнатися більше про те, як завантажуються DLL.

source: Raises an :ref:`auditing event <auditing>` ``os.add_dll_directory`` with argument ``path``.
ru: Вызывает :ref:`событие аудита ` ``os.add_dll_directory`` с аргументом ``путь`` .
uk: Викликає :ref:`подію аудиту <auditing>` ``os.add_dll_directory`` з аргументом ``path``.

source: Previous versions of CPython would resolve DLLs using the default behavior for the current process. This led to inconsistencies, such as only sometimes searching :envvar:`PATH` or the current working directory, and OS functions such as ``AddDllDirectory`` having no effect.
ru: Предыдущие версии CPython разрешали библиотеки DLL, используя поведение по умолчанию для текущего процесса. Это приводило к несоответствиям, например, поиск проводился лишь иногда. :envvar:`ПУТЬ` или текущий рабочий каталог, а также функции ОС, такие как ``Адддллдиректори`` не имея никакого эффекта.
uk: Попередні версії CPython вирішували DLL, використовуючи типову поведінку для поточного процесу. Це призвело до неузгодженості, наприклад лише іноді пошук :envvar:`PATH` або поточного робочого каталогу, а функції ОС, такі як ``AddDllDirectory``, не мали ефекту.

source: In 3.8, the two primary ways DLLs are loaded now explicitly override the process-wide behavior to ensure consistency. See the :ref:`porting notes <bpo-36085-whatsnew>` for information on updating libraries.
ru: В версии 3.8 два основных способа загрузки DLL теперь явно переопределяют поведение всего процесса для обеспечения согласованности. См. :ref:`примечания по портированию ` для получения информации об обновлении библиотек.
uk: У версії 3.8 два основні способи завантаження бібліотек DLL тепер явно замінюють поведінку всього процесу, щоб забезпечити узгодженість. Перегляньте :ref:`нотатки щодо портування <bpo-36085-whatsnew>`, щоб отримати інформацію щодо оновлення бібліотек.

source: These functions all execute a new program, replacing the current process; they do not return. On Unix, the new executable is loaded into the current process, and will have the same process id as the caller. Errors will be reported as :exc:`OSError` exceptions.
ru: Все эти функции выполняют новую программу, заменяя текущий процесс; они не возвращаются. В Unix новый исполняемый файл загружается в текущий процесс и будет иметь тот же идентификатор процесса, что и вызывающий. Об ошибках будет сообщено как :exc:`OSError` исключения.
uk: Усі ці функції виконують нову програму, замінюючи поточний процес; вони не повертаються. В Unix новий виконуваний файл завантажується в поточний процес і матиме той самий ідентифікатор процесу, що й виклик. Помилки повідомлятимуться як винятки :exc:`OSError`.

source: The current process is replaced immediately. Open file objects and descriptors are not flushed, so if there may be data buffered on these open files, you should flush them using :func:`sys.stdout.flush` or :func:`os.fsync` before calling an :func:`exec\* <execl>` function.
ru: Текущий процесс заменяется немедленно. Объекты и дескрипторы открытых файлов не сбрасываются, поэтому, если в этих открытых файлах могут быть данные, буферизованные в эти открытые файлы, вам следует сбросить их с помощью :func:`sys.stdout.flush` или :func:`os.fsync` перед вызовом :func:`exec\* `функция.
uk: Поточний процес негайно замінюється. Відкриті файлові об’єкти та дескриптори не скидаються, тому, якщо у цих відкритих файлах можуть бути буферизовані дані, вам слід очистити їх за допомогою :func:`sys.stdout.flush` або :func:`os.fsync` перед викликом :func:`exec\* <execl>` функція.

source: The "l" and "v" variants of the :func:`exec\* <execl>` functions differ in how command-line arguments are passed. The "l" variants are perhaps the easiest to work with if the number of parameters is fixed when the code is written; the individual parameters simply become additional parameters to the :func:`execl\*` functions. The "v" variants are good when the number of parameters is variable, with the arguments being passed in a list or tuple as the *args* parameter. In either case, the arguments to the child process should start with the name of the command being run, but this is not enforced.
uk: Варіанти "l" і "v" функцій :func:`exec\* <execl>` відрізняються способом передачі аргументів командного рядка. Варіанти "l", мабуть, найлегші для роботи, якщо кількість параметрів фіксована під час написання коду; окремі параметри просто стають додатковими параметрами до функцій :func:`execl\*`. Варіанти "v" хороші, коли кількість параметрів є змінною, а аргументи передаються у списку або кортежі як параметр *args*. У будь-якому випадку аргументи дочірнього процесу мають починатися з назви команди, що виконується, але це не виконується.

source: The variants which include a "p" near the end (:func:`execlp`, :func:`execlpe`, :func:`execvp`, and :func:`execvpe`) will use the :envvar:`PATH` environment variable to locate the program *file*. When the environment is being replaced (using one of the :func:`exec\*e <execl>` variants, discussed in the next paragraph), the new environment is used as the source of the :envvar:`PATH` variable. The other variants, :func:`execl`, :func:`execle`, :func:`execv`, and :func:`execve`, will not use the :envvar:`PATH` variable to locate the executable; *path* must contain an appropriate absolute or relative path.
uk: Варіанти, які включають "p" у кінці (:func:`execlp`, :func:`execlpe`, :func:`execvp` і :func:`execvpe`) використовуватимуть :envvar:`PATH` змінна середовища, щоб знайти *файл* програми. Коли середовище замінюється (з використанням одного з варіантів :func:`exec\*e <execl>`, розглянутих у наступному абзаці), нове середовище використовується як джерело змінної :envvar:`PATH`. Інші варіанти, :func:`execl`, :func:`execle`, :func:`execv` і :func:`execve`, не використовуватимуть змінну :envvar:`PATH` для пошуку виконуваного файлу; *path* повинен містити відповідний абсолютний або відносний шлях.

source: For :func:`execle`, :func:`execlpe`, :func:`execve`, and :func:`execvpe` (note that these all end in "e"), the *env* parameter must be a mapping which is used to define the environment variables for the new process (these are used instead of the current process' environment); the functions :func:`execl`, :func:`execlp`, :func:`execv`, and :func:`execvp` all cause the new process to inherit the environment of the current process.
ru: Для :func:`execle` , :func:`execlpe` , :func:`execve` , и :func:`execvpe` (обратите внимание, что все они заканчиваются на «e»), параметр *env* должен быть сопоставлением, которое используется для определения переменных среды для нового процесса (они используются вместо среды текущего процесса); функции :func:`execl` , :func:`execlp` , :func:`execv` , и :func:`execvp` все это приводит к тому, что новый процесс наследует среду текущего процесса.
uk: Для :func:`execle`, :func:`execlpe`, :func:`execve` і :func:`execvpe` (зауважте, що всі вони закінчуються на "e"), параметр *env* має бути зіставленням який використовується для визначення змінних середовища для нового процесу (вони використовуються замість середовища поточного процесу); функції :func:`execl`, :func:`execlp`, :func:`execv` і :func:`execvp` змушують новий процес успадковувати середовище поточного процесу.

source: For :func:`execve` on some platforms, *path* may also be specified as an open file descriptor. This functionality may not be supported on your platform; you can check whether or not it is available using :data:`os.supports_fd`. If it is unavailable, using it will raise a :exc:`NotImplementedError`.
ru: Для :func:`execve` на некоторых платформах *path* также может быть указан как дескриптор открытого файла. Эта функция может не поддерживаться на вашей платформе; вы можете проверить, доступен ли он, используя :data:`os.supports_fd` . Если он недоступен, его использование вызовет :exc:`NotImplementedError` .
uk: Для :func:`execve` на деяких платформах *шлях* також може бути вказаний як дескриптор відкритого файлу. Ця функція може не підтримуватися на вашій платформі; ви можете перевірити, чи він доступний, за допомогою :data:`os.supports_fd`. Якщо він недоступний, його використання призведе до помилки :exc:`NotImplementedError`.

source: Raises an :ref:`auditing event <auditing>` ``os.exec`` with arguments ``path``, ``args``, ``env``.
ru: Вызывает :ref:`событие аудита ` ``os.exec`` с аргументами ``путь`` , ``args`` , ``окр`` .
uk: Викликає :ref:`подію аудиту <auditing>` ``os.exec`` з аргументами ``path``, ``args``, ``env``.

source: Added support for specifying *path* as an open file descriptor for :func:`execve`.
ru: Добавлена ​​поддержка указания *path* в качестве дескриптора открытого файла для :func:`execve` .
uk: Додано підтримку вказівки *шляху* як дескриптора відкритого файлу для :func:`execve`.

source: Exit the process with status *n*, without calling cleanup handlers, flushing stdio buffers, etc.
ru: Выйдите из процесса со статусом *n*, без вызова обработчиков очистки, очистки буферов stdio и т. д.
uk: Вийдіть із процесу зі статусом *n*, без виклику обробників очищення, очищення буферів stdio тощо.

source: The standard way to exit is ``sys.exit(n)``. :func:`_exit` should normally only be used in the child process after a :func:`fork`.
uk: Стандартним способом виходу є ``sys.exit(n)``. :func:`_exit` зазвичай слід використовувати лише в дочірньому процесі після :func:`fork`.

source: The following exit codes are defined and can be used with :func:`_exit`, although they are not required. These are typically used for system programs written in Python, such as a mail server's external command delivery program.
ru: Следующие коды выхода определены и могут использоваться с :func:`_exit` , хотя они и не обязательны. Обычно они используются для системных программ, написанных на Python, таких как программа доставки внешних команд почтового сервера.
uk: Наступні коди виходу визначені та можуть використовуватися з :func:`_exit`, хоча вони не є обов’язковими. Зазвичай вони використовуються для системних програм, написаних мовою Python, таких як зовнішня програма доставки команд поштового сервера.

source: Some of these may not be available on all Unix platforms, since there is some variation. These constants are defined where they are defined by the underlying platform.
ru: Некоторые из них могут быть доступны не на всех платформах Unix, поскольку существуют некоторые различия. Эти константы определяются там, где они определены базовой платформой.
uk: Деякі з них можуть бути недоступні на всіх платформах Unix, оскільки існують певні відмінності. Ці константи визначені там, де вони визначені базовою платформою.

source: Exit code that means the command was used incorrectly, such as when the wrong number of arguments are given.
ru: Код выхода, который означает, что команда была использована неправильно, например, когда задано неправильное количество аргументов.
uk: Код виходу, який означає, що команда була використана неправильно, наприклад, коли вказано неправильну кількість аргументів.

source: Exit code that means the input data was incorrect.
ru: Код выхода, означающий, что входные данные неверны.
uk: Код виходу, який означає, що введені дані були неправильними.

source: Exit code that means an input file did not exist or was not readable.
ru: Код выхода, который означает, что входной файл не существовал или не был доступен для чтения.
uk: Код виходу, який означає, що вхідний файл не існував або не читався.

source: Exit code that means a specified user did not exist.
ru: Код выхода, который означает, что указанный пользователь не существует.
uk: Код виходу, який означає, що вказаний користувач не існував.

source: Exit code that means a specified host did not exist.
ru: Код выхода, который означает, что указанный хост не существует.
uk: Код виходу, який означає, що вказаний хост не існував.

source: Exit code that means that a required service is unavailable.
ru: Код выхода, который означает, что необходимая услуга недоступна.
uk: Код виходу, який означає, що потрібна послуга недоступна.

source: Exit code that means an internal software error was detected.
ru: Код выхода, который означает, что обнаружена внутренняя ошибка программного обеспечения.
uk: Код виходу, який означає, що виявлено внутрішню помилку програмного забезпечення.

source: Exit code that means an operating system error was detected, such as the inability to fork or create a pipe.
ru: Код выхода, который означает, что обнаружена ошибка операционной системы, например невозможность разветвления или создания канала.
uk: Код виходу, який означає, що виявлено помилку операційної системи, наприклад неможливість розгалуження або створення каналу.

source: Exit code that means some system file did not exist, could not be opened, or had some other kind of error.
ru: Код выхода, который означает, что какой-то системный файл не существует, не может быть открыт или возникла другая ошибка.
uk: Код виходу, який означає, що якийсь системний файл не існував, його неможливо відкрити або якийсь інший тип помилки.

source: Exit code that means a user specified output file could not be created.
ru: Код выхода, который означает, что указанный пользователем выходной файл не может быть создан.
uk: Код виходу означає, що вказаний користувачем вихідний файл неможливо створити.

source: Exit code that means that an error occurred while doing I/O on some file.
ru: Код выхода, который означает, что произошла ошибка при выполнении ввода-вывода в каком-то файле.
uk: Код виходу, який означає, що сталася помилка під час виконання вводу-виводу для деякого файлу.

source: Exit code that means a temporary failure occurred. This indicates something that may not really be an error, such as a network connection that couldn't be made during a retryable operation.
ru: Код выхода, который означает, что произошел временный сбой. Это указывает на то, что на самом деле не является ошибкой, например сетевое соединение, которое не удалось установить во время повторной операции.
uk: Код виходу, який означає, що стався тимчасовий збій. Це вказує на те, що насправді не може бути помилкою, наприклад мережеве підключення, яке не вдалося встановити під час повторної операції.

source: Exit code that means that a protocol exchange was illegal, invalid, or not understood.
ru: Код выхода, который означает, что обмен протоколами был незаконным, недействительным или непонятым.
uk: Код виходу, який означає, що обмін протоколом був незаконним, недійсним або незрозумілим.

source: Exit code that means that there were insufficient permissions to perform the operation (but not intended for file system problems).
ru: Код выхода, который означает, что для выполнения операции недостаточно прав (но не предназначен для проблем с файловой системой).
uk: Код виходу, який означає, що було недостатньо дозволів для виконання операції (але не призначений для проблем файлової системи).

source: Exit code that means that some kind of configuration error occurred.
ru: Код выхода, который означает, что произошла какая-то ошибка конфигурации.
uk: Код виходу, який означає, що сталася якась помилка конфігурації.

source: Exit code that means something like "an entry was not found".
ru: Код выхода, который означает что-то вроде «запись не найдена».
uk: Код виходу, який означає щось на зразок "запис не знайдено".

source: Fork a child process. Return ``0`` in the child and the child's process id in the parent. If an error occurs :exc:`OSError` is raised.
ru: Форкните дочерний процесс. Возвращаться ``0`` в дочернем процессе и идентификатор дочернего процесса в родительском. Если возникает ошибка :exc:`OSError` поднят.
uk: Розгалужуйте дочірній процес. Повертає ``0`` у дочірньому процесі та ідентифікатор дочірнього процесу в батьківському. У разі виникнення помилки виникає :exc:`OSError`.

source: Note that some platforms including FreeBSD <= 6.3 and Cygwin have known issues when using ``fork()`` from a thread.
ru: Обратите внимание, что на некоторых платформах, включая FreeBSD <= 6.3 и Cygwin, возникают известные проблемы при использовании ``вилка()`` из нитки.
uk: Зауважте, що деякі платформи, включаючи FreeBSD <= 6.3 і Cygwin, мають відомі проблеми під час використання ``fork()`` із потоку.

source: Raises an :ref:`auditing event <auditing>` ``os.fork`` with no arguments.
ru: Вызывает :ref:`событие аудита ` ``os.fork`` без каких-либо аргументов.
uk: Викликає :ref:`подію аудиту <auditing>` ``os.fork`` без аргументів.

source: Calling ``fork()`` in a subinterpreter is no longer supported (:exc:`RuntimeError` is raised).
ru: Вызов ``вилка()`` в субинтерпретаторе больше не поддерживается ( :exc:`RuntimeError` поднят).
uk: Виклик ``fork()`` у підінтерпретаторі більше не підтримується (виникає :exc:`RuntimeError`).

source: See :mod:`ssl` for applications that use the SSL module with fork().
uk: Перегляньте :mod:`ssl` для програм, які використовують модуль SSL із fork().

source: Fork a child process, using a new pseudo-terminal as the child's controlling terminal. Return a pair of ``(pid, fd)``, where *pid* is ``0`` in the child, the new child's process id in the parent, and *fd* is the file descriptor of the master end of the pseudo-terminal. For a more portable approach, use the :mod:`pty` module. If an error occurs :exc:`OSError` is raised.
ru: Создайте дочерний процесс, используя новый псевдотерминал в качестве управляющего терминала дочернего процесса. Верните пару ``(pid, fd)`` , где *pid* — это ``0`` в дочернем процессе — идентификатор нового дочернего процесса в родительском, а *fd* — файловый дескриптор главного конца псевдотерминала. Для более портативного подхода используйте :mod:`pty` модуль. Если возникает ошибка :exc:`OSError` поднят.
uk: Розгалужуйте дочірній процес, використовуючи новий псевдотермінал як керуючий термінал дочірнього процесу. Повертає пару ``(pid, fd)``, де *pid* є ``0`` у дочірньому, ідентифікатор нового дочірнього процесу в батьківському, а *fd* є дескриптором файлу головного кінця псевдотермінал. Для більш портативного підходу використовуйте модуль :mod:`pty`. У разі виникнення помилки виникає :exc:`OSError`.

source: Raises an :ref:`auditing event <auditing>` ``os.forkpty`` with no arguments.
ru: Вызывает :ref:`событие аудита ` ``os.forkpty`` без каких-либо аргументов.
uk: Викликає :ref:`подію аудиту <auditing>` ``os.forkpty`` без аргументів.

source: Calling ``forkpty()`` in a subinterpreter is no longer supported (:exc:`RuntimeError` is raised).
ru: Вызов ``forkpty()`` в субинтерпретаторе больше не поддерживается ( :exc:`RuntimeError` поднят).
uk: Виклик ``forkpty()`` у підінтерпретаторі більше не підтримується (виникає :exc:`RuntimeError`).
