Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/os.po
Languages: ru, uk

source: :mod:`os` --- Miscellaneous operating system interfaces
ru: :против:`нас` --- Различные интерфейсы операционной системы
uk: :mod:`os` --- Різні інтерфейси операційної системи

source: **Source code:** :source:`Lib/os.py`
ru: **Исходный код:** :source:`Lib/os.py`
uk: **Вихідний код:** :source:`Lib/os.py`

source: This module provides a portable way of using operating system dependent functionality. If you just want to read or write a file see :func:`open`, if you want to manipulate paths, see the :mod:`os.path` module, and if you want to read all the lines in all the files on the command line see the :mod:`fileinput` module. For creating temporary files and directories see the :mod:`tempfile` module, and for high-level file and directory handling see the :mod:`shutil` module.
uk: Цей модуль забезпечує портативний спосіб використання залежних від операційної системи функцій. Якщо ви хочете просто прочитати або записати файл, дивіться :func:`open`, якщо ви хочете маніпулювати шляхами, перегляньте модуль :mod:`os.path`, а якщо ви хочете прочитати всі рядки в усіх файлах у командному рядку перегляньте модуль :mod:`fileinput`. Для створення тимчасових файлів і каталогів перегляньте модуль :mod:`tempfile`, а для високорівневої обробки файлів і каталогів дивіться модуль :mod:`shutil`.

source: Notes on the availability of these functions:
ru: Примечания о доступности этих функций:
uk: Примітки щодо доступності цих функцій:

source: The design of all built-in operating system dependent modules of Python is such that as long as the same functionality is available, it uses the same interface; for example, the function ``os.stat(path)`` returns stat information about *path* in the same format (which happens to have originated with the POSIX interface).
ru: Конструкция всех встроенных модулей Python, зависящих от операционной системы, такова, что, пока доступна одна и та же функциональность, они используют один и тот же интерфейс; например, функция ``os.stat(путь)`` возвращает статистическую информацию о *path* в том же формате (который, как оказалось, возник в интерфейсе POSIX).
uk: Конструкція всіх вбудованих залежних від операційної системи модулів Python така, що, поки доступна та сама функціональність, він використовує той самий інтерфейс; наприклад, функція ``os.stat(path)`` повертає статистичну інформацію про *path* у тому самому форматі (який, як виявилося, походить з інтерфейсу POSIX).

source: Extensions peculiar to a particular operating system are also available through the :mod:`os` module, but using them is of course a threat to portability.
ru: Расширения, специфичные для конкретной операционной системы, также доступны через :против:`нас` модуль, но их использование, конечно, представляет угрозу переносимости.
uk: Розширення, властиві певній операційній системі, також доступні через модуль :mod:`os`, але їх використання, звичайно, є загрозою для переносимості.

source: All functions accepting path or file names accept both bytes and string objects, and result in an object of the same type, if a path or file name is returned.
ru: Все функции, принимающие имена путей или файлов, принимают как байтовые, так и строковые объекты и в результате возвращают объект того же типа, если возвращается путь или имя файла.
uk: Усі функції, які приймають імена шляхів або файлів, приймають як байти, так і рядкові об’єкти, і в результаті повертають об’єкт того самого типу, якщо повертається шлях або ім’я файлу.

source: All functions in this module raise :exc:`OSError` (or subclasses thereof) in the case of invalid or inaccessible file names and paths, or other arguments that have the correct type, but are not accepted by the operating system.
ru: Все функции в этом модуле повышают :exc:`OSError` (или их подклассы) в случае недопустимых или недоступных имен и путей файлов или других аргументов, имеющих правильный тип, но не принимаемых операционной системой.
uk: Усі функції в цьому модулі викликають :exc:`OSError` (або його підкласи) у разі недійсних або недоступних імен файлів і шляхів або інших аргументів, які мають правильний тип, але не приймаються операційною системою.

source: An alias for the built-in :exc:`OSError` exception.
ru: Псевдоним для встроенного :exc:`OSError` исключение.
uk: Псевдонім для вбудованого винятку :exc:`OSError`.

source: The name of the operating system dependent module imported. The following names have currently been registered: ``'posix'``, ``'nt'``, ``'java'``.
ru: Имя импортированного модуля, зависящего от операционной системы. На данный момент зарегистрированы следующие имена: ``'позикс'`` , ``'нет'`` , ``'Ява'`` .
uk: Назва імпортованого модуля, залежного від операційної системи. Наразі зареєстровано такі назви: ``'posix'``, ``'nt'``, ``'java'``.

source: :attr:`sys.platform` has a finer granularity. :func:`os.uname` gives system-dependent version information.
uk: :attr:`sys.platform` має дрібнішу деталізацію. :func:`os.uname` надає інформацію про версію, що залежить від системи.

source: The :mod:`platform` module provides detailed checks for the system's identity.
ru: The :mod:`платформа` модуль обеспечивает детальную проверку идентичности системы.
uk: Модуль :mod:`platform` забезпечує детальну перевірку ідентичності системи.

source: File Names, Command Line Arguments, and Environment Variables
ru: Имена файлов, аргументы командной строки и переменные среды
uk: Імена файлів, аргументи командного рядка та змінні середовища

source: On some systems, conversion using the file system encoding may fail. In this case, Python uses the :ref:`surrogateescape encoding error handler <surrogateescape>`, which means that undecodable bytes are replaced by a Unicode character U+DCxx on decoding, and these are again translated to the original byte on encoding.
uk: У деяких системах перетворення за допомогою кодування файлової системи може завершитися помилкою. У цьому випадку Python використовує :ref:`обробник помилок кодування surrogateescape <surrogateescape>`, що означає, що некодовані байти замінюються символом Unicode U+DCxx під час декодування, і вони знову перетворюються на вихідний байт під час кодування.

source: Process Parameters
ru: Параметры процесса
uk: Параметри процесу

source: These functions and data items provide information and operate on the current process and user.
ru: Эти функции и элементы данных предоставляют информацию и работают с текущим процессом и пользователем.
uk: Ці функції та елементи даних надають інформацію та діють щодо поточного процесу та користувача.

source: Return the filename corresponding to the controlling terminal of the process.
ru: Верните имя файла, соответствующее управляющему терминалу процесса.
uk: Повертає ім'я файлу, що відповідає керуючому терміналу процесу.

source: :ref:`Availability <availability>`: Unix.
uk: :ref:`Наявність <availability>`: Unix.

source: A :term:`mapping` object where keys and values are strings that represent the process environment. For example, ``environ['HOME']`` is the pathname of your home directory (on some platforms), and is equivalent to ``getenv("HOME")`` in C.
ru: Объект :term:`mapping`, где ключи и значения представляют собой строки, представляющие среду процесса. Например, ``окружающая среда['ДОМ']`` — это путь к вашему домашнему каталогу (на некоторых платформах) и эквивалентен ``getenv("HOME")`` в С.
uk: Об’єкт :term:`mapping`, де ключі та значення є рядками, які представляють середовище процесу. Наприклад, ``environ['HOME']`` є шляхом до вашого домашнього каталогу (на деяких платформах) і еквівалентний ``getenv("HOME")`` в C.

source: This mapping is captured the first time the :mod:`os` module is imported, typically during Python startup as part of processing :file:`site.py`. Changes to the environment made after this time are not reflected in :data:`os.environ`, except for changes made by modifying :data:`os.environ` directly.
ru: Это сопоставление фиксируется в первый раз, когда :против:`нас` модуль импортируется, обычно во время запуска Python как часть обработки. :file:`site.py` . Изменения в среде, сделанные после этого времени, не отражаются в :data:`os.environ` , за исключением изменений, внесенных путем модификации :data:`os.environ` напрямую.
uk: Це зіставлення фіксується під час першого імпорту модуля :mod:`os`, зазвичай під час запуску Python як частина обробки :file:`site.py`. Зміни в середовищі, внесені після цього часу, не відображаються в :data:`os.environ`, за винятком змін, внесених безпосередньо шляхом модифікації :data:`os.environ`.

source: This mapping may be used to modify the environment as well as query the environment. :func:`putenv` will be called automatically when the mapping is modified.
ru: Это сопоставление можно использовать для изменения среды, а также для запроса среды. :func:`putenv` будет вызываться автоматически при изменении сопоставления.
uk: Це відображення можна використовувати для зміни середовища, а також запиту середовища. :func:`putenv` буде викликано автоматично, коли відображення буде змінено.

source: On Unix, keys and values use :func:`sys.getfilesystemencoding` and ``'surrogateescape'`` error handler. Use :data:`environb` if you would like to use a different encoding.
ru: В Unix ключи и значения используют :func:`sys.getfilesystemencoding` и ``'суррогатный побег'`` обработчик ошибок. Использовать :data:`окружающая среда` если вы хотите использовать другую кодировку.
uk: В Unix ключі та значення використовують :func:`sys.getfilesystemencoding` і ``'surrogateescape'`` обробник помилок. Використовуйте :data:`environb`, якщо ви хочете використати інше кодування.

source: Calling :func:`putenv` directly does not change :data:`os.environ`, so it's better to modify :data:`os.environ`.
ru: Вызов :func:`putenv` напрямую не меняется :data:`os.environ` , поэтому лучше изменить :data:`os.environ` .
uk: Безпосередній виклик :func:`putenv` не змінює :data:`os.environ`, тому краще змінити :data:`os.environ`.

source: On some platforms, including FreeBSD and macOS, setting ``environ`` may cause memory leaks. Refer to the system documentation for :c:func:`putenv`.
uk: На деяких платформах, включаючи FreeBSD і macOS, налаштування ``environ`` може спричинити витік пам’яті. Зверніться до системної документації для :c:func:`putenv`.

source: You can delete items in this mapping to unset environment variables. :func:`unsetenv` will be called automatically when an item is deleted from :data:`os.environ`, and when one of the :meth:`pop` or :meth:`clear` methods is called.
ru: Вы можете удалить элементы в этом сопоставлении, чтобы сбросить переменные среды. :func:`unsetenv` будет вызываться автоматически при удалении элемента из :data:`os.environ` , и когда один из :meth:`поп` или :meth:`чисто` методы называются.
uk: Ви можете видалити елементи в цьому відображенні, щоб скасувати налаштування змінних середовища. :func:`unsetenv` буде викликано автоматично, коли елемент буде видалено з :data:`os.environ`, а також під час виклику одного з методів :meth:`pop` або :meth:`clear`.

source: Updated to support :pep:`584`'s merge (``|``) and update (``|=``) operators.
ru: Обновлено для поддержки :pep:`584` слияние( ``|`` ) и обновить ( ``|=`` ) операторы.
uk: Оновлено для підтримки операторів злиття (``|``) і оновлення (``|=``) :pep:`584`.

source: Bytes version of :data:`environ`: a :term:`mapping` object where both keys and values are :class:`bytes` objects representing the process environment. :data:`environ` and :data:`environb` are synchronized (modifying :data:`environb` updates :data:`environ`, and vice versa).
ru: Байтовая версия :data:`окружающая среда` : объект :term:`mapping`, в котором указаны как ключи, так и значения. :class:`байты` объекты, представляющие среду процесса. :data:`окружающая среда` и :data:`окружающая среда` синхронизированы (изменение :data:`окружающая среда` обновления :data:`окружающая среда` , и наоборот).
uk: Байтова версія :data:`environ`: об’єкт :term:`mapping`, де і ключі, і значення є об’єктами :class:`bytes`, що представляють середовище процесу. :data:`environ` і :data:`environb` синхронізуються (модифікація :data:`environb` оновлює :data:`environ`, і навпаки).

source: :data:`environb` is only available if :data:`supports_bytes_environ` is ``True``.
uk: :data:`environb` доступний лише якщо :data:`supports_bytes_environ` має значення ``True``.

source: These functions are described in :ref:`os-file-dir`.
ru: Эти функции описаны в :ref:`os-file-dir` .
uk: Ці функції описані в :ref:`os-file-dir`.

source: :func:`fsdecode` is the reverse function.
ru: :func:`fsdecode` это обратная функция.
uk: :func:`fsdecode` є зворотною функцією.

source: Support added to accept objects implementing the :class:`os.PathLike` interface.
ru: Добавлена ​​поддержка приема объектов, реализующих :class:`os.PathLike` интерфейс.
uk: Додано підтримку прийому об’єктів, що реалізують інтерфейс :class:`os.PathLike`.

source: :func:`fsencode` is the reverse function.
ru: :func:`fsencode` это обратная функция.
uk: :func:`fsencode` є зворотною функцією.

source: Return the file system representation of the path.
ru: Возвращает представление пути в файловой системе.
uk: Повертає представлення файлової системи шляху.

source: If :class:`str` or :class:`bytes` is passed in, it is returned unchanged. Otherwise :meth:`~os.PathLike.__fspath__` is called and its value is returned as long as it is a :class:`str` or :class:`bytes` object. In all other cases, :exc:`TypeError` is raised.
ru: Если :class:`str` или :class:`байты` передается, он возвращается без изменений. В противном случае :meth:`~os.PathLike.__fspath__` вызывается и возвращается его значение, если оно является :class:`str` или :class:`байты` объект. Во всех остальных случаях :exc:`TypeError` поднят.
uk: Якщо передано :class:`str` або :class:`bytes`, воно повертається без змін. В іншому випадку викликається :meth:`~os.PathLike.__fspath__` і повертається його значення, якщо це об’єкт :class:`str` або :class:`bytes`. У всіх інших випадках виникає :exc:`TypeError`.

source: An :term:`abstract base class` for objects representing a file system path, e.g. :class:`pathlib.PurePath`.
ru: :term:`абстрактный базовый класс` для объектов, представляющих путь к файловой системе, например :class:`pathlib.PurePath` .
uk: :term:`abstract base class` для об’єктів, що представляють шлях файлової системи, напр. :class:`pathlib.PurePath`.

source: Return the file system path representation of the object.
ru: Возвращает представление пути к объекту в файловой системе.
uk: Повертає представлення шляху файлової системи до об’єкта.

source: The method should only return a :class:`str` or :class:`bytes` object, with the preference being for :class:`str`.
ru: Метод должен возвращать только :class:`str` или :class:`байты` объект, причем предпочтение отдается :class:`str` .
uk: Метод має повертати лише об’єкт :class:`str` або :class:`bytes`, з перевагою для :class:`str`.

source: Return the value of the environment variable *key* if it exists, or *default* if it doesn't. *key*, *default* and the result are str. Note that since :func:`getenv` uses :data:`os.environ`, the mapping of :func:`getenv` is similarly also captured on import, and the function may not reflect future environment changes.
uk: Повертає значення змінної середовища *key*, якщо вона існує, або *default*, якщо її немає. *key*, *default* і результат – str. Зауважте, що, оскільки :func:`getenv` використовує :data:`os.environ`, відображення :func:`getenv` також фіксується під час імпорту, і функція може не відображати майбутні зміни середовища.

source: On Unix, keys and values are decoded with :func:`sys.getfilesystemencoding` and ``'surrogateescape'`` error handler. Use :func:`os.getenvb` if you would like to use a different encoding.
ru: В Unix ключи и значения декодируются с помощью :func:`sys.getfilesystemencoding` и ``'суррогатный побег'`` обработчик ошибок. Использовать :func:`os.getenvb` если вы хотите использовать другую кодировку.
uk: В Unix ключі та значення декодуються за допомогою :func:`sys.getfilesystemencoding` і ``'surrogateescape'`` обробника помилок. Використовуйте :func:`os.getenvb`, якщо ви хочете використати інше кодування.

source: :ref:`Availability <availability>`: most flavors of Unix, Windows.
uk: :ref:`Доступність <availability>`: більшість варіантів Unix, Windows.

source: Return the value of the environment variable *key* if it exists, or *default* if it doesn't. *key*, *default* and the result are bytes. Note that since :func:`getenvb` uses :data:`os.environb`, the mapping of :func:`getenvb` is similarly also captured on import, and the function may not reflect future environment changes.
uk: Повертає значення змінної середовища *key*, якщо вона існує, або *default*, якщо її немає. *ключ*, *за замовчуванням* і результатом є байти. Зауважте, що оскільки :func:`getenvb` використовує :data:`os.environb`, відображення :func:`getenvb` також фіксується під час імпорту, і функція може не відображати майбутні зміни середовища.

source: :func:`getenvb` is only available if :data:`supports_bytes_environ` is ``True``.
uk: :func:`getenvb` доступний лише якщо :data:`supports_bytes_environ` має значення ``True``.

source: :ref:`Availability <availability>`: most flavors of Unix.
uk: :ref:`Доступність <availability>`: більшість різновидів Unix.

source: Returns the list of directories that will be searched for a named executable, similar to a shell, when launching a process. *env*, when specified, should be an environment variable dictionary to lookup the PATH in. By default, when *env* is ``None``, :data:`environ` is used.
ru: Возвращает список каталогов, в которых будет выполняться поиск именованного исполняемого файла, аналогичного оболочке, при запуске процесса. *env*, если он указан, должен быть словарем переменных среды для поиска PATH. По умолчанию, когда *env* имеет значение ``Нет`` , :data:`окружающая среда` используется.
uk: Повертає список каталогів, у яких здійснюватиметься пошук іменованого виконуваного файлу, схожого на оболонку, під час запуску процесу. *env*, якщо вказано, має бути словником змінної середовища для пошуку ШЛЯХУ. За умовчанням, коли *env* має значення ``None``, використовується :data:`environ`.

source: Return the effective group id of the current process. This corresponds to the "set id" bit on the file being executed in the current process.
ru: Верните эффективный идентификатор группы текущего процесса. Это соответствует биту «set id» файла, исполняемого в текущем процессе.
uk: Повертає ефективний ідентифікатор групи поточного процесу. Це відповідає біту "set id" у файлі, який виконується в поточному процесі.

source: Return the current process's effective user id.
ru: Возвращает эффективный идентификатор пользователя текущего процесса.
uk: Повернути ефективний ідентифікатор користувача поточного процесу.

source: Return the real group id of the current process.
ru: Верните реальный идентификатор группы текущего процесса.
uk: Повертає справжній ідентифікатор групи поточного процесу.

source: Return list of supplemental group ids associated with the current process.
ru: Возвращает список идентификаторов дополнительных групп, связанных с текущим процессом.
uk: Повернути список ідентифікаторів додаткових груп, пов’язаних із поточним процесом.

source: On macOS, :func:`getgroups` behavior differs somewhat from other Unix platforms. If the Python interpreter was built with a deployment target of :const:`10.5` or earlier, :func:`getgroups` returns the list of effective group ids associated with the current user process; this list is limited to a system-defined number of entries, typically 16, and may be modified by calls to :func:`setgroups` if suitably privileged. If built with a deployment target greater than :const:`10.5`, :func:`getgroups` returns the current group access list for the user associated with the effective user id of the process; the group access list may change over the lifetime of the process, it is not affected by calls to :func:`setgroups`, and its length is not limited to 16. The deployment target value, :const:`MACOSX_DEPLOYMENT_TARGET`, can be obtained with :func:`sysconfig.get_config_var`.
uk: У macOS поведінка :func:`getgroups` дещо відрізняється від інших платформ Unix. Якщо інтерпретатор Python було створено з метою розгортання :const:`10.5` або раніше, :func:`getgroups` повертає список ефективних ідентифікаторів груп, пов’язаних із поточним процесом користувача; цей список обмежується визначеною системою кількістю записів, як правило, 16, і може бути змінений викликами :func:`setgroups`, якщо відповідні привілеї. Якщо створено з метою розгортання, більшою за :const:`10.5`, :func:`getgroups` повертає поточний список доступу групи для користувача, пов’язаного з ефективним ідентифікатором користувача процесу; список доступу групи може змінюватися протягом життя процесу, на нього не впливають виклики :func:`setgroups`, і його довжина не обмежена 16. Цільове значення розгортання, :const:`MACOSX_DEPLOYMENT_TARGET`, може бути отримано за допомогою :func:`sysconfig.get_config_var`.

source: Return the name of the user logged in on the controlling terminal of the process. For most purposes, it is more useful to use :func:`getpass.getuser` since the latter checks the environment variables :envvar:`LOGNAME` or :envvar:`USERNAME` to find out who the user is, and falls back to ``pwd.getpwuid(os.getuid())[0]`` to get the login name of the current real user id.
ru: Возвращает имя пользователя, вошедшего в систему на управляющем терминале процесса. Для большинства целей более полезно использовать :func:`getpass.getuser` поскольку последний проверяет переменные среды :envvar:`LOGNAME` или :envvar:`ИМЯ ПОЛЬЗОВАТЕЛЯ` чтобы узнать, кто пользователь, и возвращается к ``pwd.getpwuid(os.getuid())[0]`` чтобы получить имя входа текущего реального идентификатора пользователя.
uk: Повертає ім’я користувача, який увійшов у систему на керуючому терміналі процесу. Для більшості цілей корисніше використовувати :func:`getpass.getuser`, оскільки останній перевіряє змінні середовища :envvar:`LOGNAME` або :envvar:`USERNAME`, щоб дізнатися, хто є користувачем, і повертається до ``pwd.getpwuid(os.getuid())[0]``, щоб отримати ім’я для входу поточного реального ідентифікатора користувача.

source: :ref:`Availability <availability>`: Unix, Windows.
ru: :ref:`Наличие `: Юникс, Windows.
uk: :ref:`Наявність <availability>`: Unix, Windows.

source: Return the process group id of the process with process id *pid*. If *pid* is 0, the process group id of the current process is returned.
ru: Возвращает идентификатор группы процессов процесса с идентификатором процесса *pid*. Если *pid* равен 0, возвращается идентификатор группы процессов текущего процесса.
uk: Повертає ідентифікатор групи процесу з ідентифікатором процесу *pid*. Якщо *pid* дорівнює 0, повертається ідентифікатор групи поточного процесу.

source: Return the id of the current process group.
ru: Возвращает идентификатор текущей группы процессов.
uk: Повертає ідентифікатор поточної групи процесів.

source: Return the current process id.
ru: Вернуть текущий идентификатор процесса.
uk: Повернути ідентифікатор поточного процесу.
