Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/os.po
Languages: ru, uk

source: On Windows: Wait for completion of a process given by process handle *pid*, and return a tuple containing *pid*, and its exit status shifted left by 8 bits (shifting makes cross-platform use of the function easier). A *pid* less than or equal to ``0`` has no special meaning on Windows, and raises an exception. The value of integer *options* has no effect. *pid* can refer to any process whose id is known, not necessarily a child process. The :func:`spawn\* <spawnl>` functions called with :const:`P_NOWAIT` return suitable process handles.
ru: В Windows: дождитесь завершения процесса, заданного дескриптором процесса *pid*, и верните кортеж, содержащий *pid*, а его статус завершения сдвинут влево на 8 бит (сдвиг упрощает кросс-платформенное использование функции). *pid* меньше или равен ``0`` не имеет особого значения в Windows и вызывает исключение. Значение целого числа *options* не имеет никакого эффекта. *pid* может относиться к любому процессу, идентификатор которого известен, не обязательно к дочернему процессу. :func:`икра\* ` функции, вызываемые с помощью :const:`P_NOWAIT` вернуть подходящие дескрипторы процесса.
uk: У Windows: дочекайтеся завершення процесу, заданого дескриптором процесу *pid*, і поверніть кортеж, що містить *pid*, а його статус виходу зміщений вліво на 8 біт (зміщення полегшує використання функції на різних платформах). *pid* менше або дорівнює ``0`` не має особливого значення в Windows і викликає виключення. Значення цілого *параметра* не впливає. *pid* може посилатися на будь-який процес, ідентифікатор якого відомий, не обов’язково дочірній процес. Функції :func:`spawn\* <spawnl>`, викликані за допомогою :const:`P_NOWAIT`, повертають відповідні дескриптори процесу.

source: Similar to :func:`waitpid`, except no process id argument is given and a 3-element tuple containing the child's process id, exit status indication, and resource usage information is returned. Refer to :mod:`resource`.\ :func:`~resource.getrusage` for details on resource usage information. The option argument is the same as that provided to :func:`waitpid` and :func:`wait4`.
uk: Подібно до :func:`waitpid`, за винятком того, що аргумент ідентифікатора процесу не надається, а повертається 3-елементний кортеж, що містить ідентифікатор дочірнього процесу, індикацію статусу виходу та інформацію про використання ресурсів. Зверніться до :mod:`resource`.\ :func:`~resource.getrusage` для отримання детальної інформації про використання ресурсу. Аргумент параметра такий самий, як і той, що надається для :func:`waitpid` і :func:`wait4`.

source: :func:`waitstatus_to_exitcode` can be used to convert the exit status into an exitcode.
ru: :func:`waitstatus_to_exitcode` может использоваться для преобразования статуса выхода в код выхода.
uk: :func:`waitstatus_to_exitcode` можна використовувати для перетворення статусу виходу в код виходу.

source: Similar to :func:`waitpid`, except a 3-element tuple, containing the child's process id, exit status indication, and resource usage information is returned. Refer to :mod:`resource`.\ :func:`~resource.getrusage` for details on resource usage information. The arguments to :func:`wait4` are the same as those provided to :func:`waitpid`.
uk: Подібно до :func:`waitpid`, за винятком того, що повертається 3-елементний кортеж, який містить ідентифікатор дочірнього процесу, індикацію статусу виходу та інформацію про використання ресурсів. Зверніться до :mod:`resource`.\ :func:`~resource.getrusage` для отримання детальної інформації про використання ресурсу. Аргументи для :func:`wait4` такі самі, як і для :func:`waitpid`.

source: Convert a wait status to an exit code.
ru: Преобразуйте статус ожидания в код выхода.
uk: Перетворення статусу очікування на код виходу.

source: On Unix:
ru: В Unix:
uk: В Unix:

source: If the process exited normally (if ``WIFEXITED(status)`` is true), return the process exit status (return ``WEXITSTATUS(status)``): result greater than or equal to 0.
ru: Если процесс завершился нормально (если ``WIFEXITED(статус)`` истинно), вернуть статус завершения процесса (return ``WEXITSTATUS(статус)`` ): результат больше или равен 0.
uk: Якщо процес закінчився нормально (якщо ``WIFEXITED(статус)`` має значення true), повертає статус виходу процесу (повертає ``WEXITSTATUS(статус)``): результат більше або дорівнює 0.

source: If the process was terminated by a signal (if ``WIFSIGNALED(status)`` is true), return ``-signum`` where *signum* is the number of the signal that caused the process to terminate (return ``-WTERMSIG(status)``): result less than 0.
ru: Если процесс был завершен по сигналу (если ``WIFSIGNALED(статус)`` это правда), верните ``-знак'' где *signum* — номер сигнала, вызвавшего завершение процесса (возврат ``-WTERMSIG(статус)`` ): результат меньше 0.
uk: Якщо процес було припинено через сигнал (якщо ``WIFSIGNALED(status)`` має значення true), повертає ``-signum``, де *signum* — це номер сигналу, який спричинив завершення процесу (повертає ``- WTERMSIG(статус)``): результат менше 0.

source: Otherwise, raise a :exc:`ValueError`.
ru: В противном случае поднимите :exc:`ValueError` .
uk: Інакше викличте :exc:`ValueError`.

source: On Windows, return *status* shifted right by 8 bits.
ru: В Windows возврат *status* сдвинут вправо на 8 бит.
uk: У Windows повертає *статус*, зміщений праворуч на 8 біт.

source: On Unix, if the process is being traced or if :func:`waitpid` was called with :data:`WUNTRACED` option, the caller must first check if ``WIFSTOPPED(status)`` is true. This function must not be called if ``WIFSTOPPED(status)`` is true.
ru: В Unix, если процесс отслеживается или если :func:`waitpid` был вызван с :data:`WUNTRACED` вариант, вызывающий абонент должен сначала проверить, ``WIFSTOPPED(статус)`` это правда. Эту функцию нельзя вызывать, если ``WIFSTOPPED(статус)`` это правда.
uk: В Unix, якщо процес відстежується або якщо :func:`waitpid` було викликано з опцією :data:`WUNTRACED`, абонент повинен спочатку перевірити, чи ``WIFSTOPPED(status)`` є істинним. Цю функцію не можна викликати, якщо ``WIFSTOPPED(статус)`` має значення true.

source: :func:`WIFEXITED`, :func:`WEXITSTATUS`, :func:`WIFSIGNALED`, :func:`WTERMSIG`, :func:`WIFSTOPPED`, :func:`WSTOPSIG` functions.
ru: :func:`ЖЕНА` , :func:`WEXITSTATUS` , :func:`WIFSIGNALED` , :func:`WTERMSIG` , :func:`WIFSTOPPED` , :func:`WSTOPSIG` функции.
uk: Функції :func:`WIFEXITED`, :func:`WEXITSTATUS`, :func:`WIFSIGNALED`, :func:`WTERMSIG`, :func:`WIFSTOPPED`, :func:`WSTOPSIG`.

source: The option for :func:`waitpid` to return immediately if no child process status is available immediately. The function returns ``(0, 0)`` in this case.
uk: Опція для :func:`waitpid` негайного повернення, якщо статус дочірнього процесу не доступний негайно. У цьому випадку функція повертає ``(0, 0)``.

source: This option causes child processes to be reported if they have been continued from a job control stop since their status was last reported.
uk: Цей параметр спричиняє надсилання звітів про дочірні процеси, якщо вони були продовжені після зупинки керування завданнями після останнього повідомлення про їхній статус.

source: :ref:`Availability <availability>`: some Unix systems.
uk: :ref:`Доступність <availability>`: деякі системи Unix.

source: This option causes child processes to be reported if they have been stopped but their current state has not been reported since they were stopped.
uk: Ця опція спричиняє надсилання звітів про дочірні процеси, якщо їх було зупинено, але їхній поточний стан не повідомлявся після їх зупинки.

source: The following functions take a process status code as returned by :func:`system`, :func:`wait`, or :func:`waitpid` as a parameter. They may be used to determine the disposition of a process.
ru: Следующие функции принимают код состояния процесса, возвращаемый функцией :func:`система` , :func:`подожди` , или :func:`waitpid` в качестве параметра. Их можно использовать для определения диспозиции процесса.
uk: Наступні функції приймають код стану процесу, який повертає :func:`system`, :func:`wait` або :func:`waitpid` як параметр. Вони можуть бути використані для визначення розташування процесу.

source: Return ``True`` if a core dump was generated for the process, otherwise return ``False``.
ru: Возвращаться ``Правда`` если для процесса был сгенерирован дамп ядра, в противном случае верните ``Ложь`` .
uk: Повертає ``True``, якщо для процесу було створено дамп ядра, інакше повертає ``False``.

source: This function should be employed only if :func:`WIFSIGNALED` is true.
ru: Эту функцию следует использовать только в том случае, если :func:`WIFSIGNALED` это правда.
uk: Цю функцію слід використовувати, лише якщо :func:`WIFSIGNALED` має значення true.

source: Return ``True`` if a stopped child has been resumed by delivery of :data:`~signal.SIGCONT` (if the process has been continued from a job control stop), otherwise return ``False``.
uk: Повертає ``True``, якщо зупинений дочірній елемент було відновлено доставкою :data:`~signal.SIGCONT` (якщо процес було продовжено після зупинки керування завданням), інакше повертає ``False``.

source: See :data:`WCONTINUED` option.
ru: См. опцию :data:`WCONTINUED`.
uk: Перегляньте параметр :data:`WCONTINUED`.

source: Return ``True`` if the process was stopped by delivery of a signal, otherwise return ``False``.
ru: Вернет ``Правда`` если процесс был остановлен доставкой сигнала, в противном случае возврат ``Ложь`` .
uk: Повертає ``True``, якщо процес було зупинено доставкою сигналу, інакше повертає ``False``.

source: :func:`WIFSTOPPED` only returns ``True`` if the :func:`waitpid` call was done using :data:`WUNTRACED` option or when the process is being traced (see :manpage:`ptrace(2)`).
ru: :func:`WIFSTOPPED` только возвращает ``Правда`` если :func:`waitpid` звонок был сделан с помощью :data:`WUNTRACED` или когда процесс отслеживается (см. :manpage:`ptrace(2)` ).
uk: :func:`WIFSTOPPED` повертає ``True``, лише якщо виклик :func:`waitpid` було виконано за допомогою параметра :data:`WUNTRACED` або коли процес відстежується (див. :manpage:`ptrace(2)` ).

source: Return ``True`` if the process was terminated by a signal, otherwise return ``False``.
ru: Возвращаться ``Правда`` если процесс был завершен по сигналу, в противном случае возврат ``Ложь`` .
uk: Повертає ``True``, якщо процес було припинено сигналом, інакше повертає ``False``.

source: Return ``True`` if the process exited terminated normally, that is, by calling ``exit()`` or ``_exit()``, or by returning from ``main()``; otherwise return ``False``.
ru: Возвращаться ``Правда`` если процесс завершился нормально, то есть путем вызова ``выход()`` или ``_exit()`` или вернувшись из ``main()`` ; в противном случае возврат ``Ложь`` .
uk: Повертає ``True``, якщо процес завершився нормально, тобто викликом ``exit()`` чи ``_exit()``, або шляхом повернення з ``main()``; інакше повертає ``False``.

source: Return the process exit status.
ru: Вернуть статус завершения процесса.
uk: Повернути статус виходу процесу.

source: This function should be employed only if :func:`WIFEXITED` is true.
ru: Эту функцию следует использовать только в том случае, если :func:`ЖЕНА` это правда.
uk: Цю функцію слід використовувати, лише якщо :func:`WIFEXITED` має значення true.

source: Return the signal which caused the process to stop.
ru: Верните сигнал, вызвавший остановку процесса.
uk: Повернути сигнал, який спричинив зупинку процесу.

source: This function should be employed only if :func:`WIFSTOPPED` is true.
ru: Эту функцию следует использовать только в том случае, если :func:`WIFSTOPPED` это правда.
uk: Цю функцію слід використовувати, лише якщо :func:`WIFSTOPPED` має значення true.

source: Return the number of the signal that caused the process to terminate.
ru: Возвращает номер сигнала, вызвавшего завершение процесса.
uk: Повертає номер сигналу, який викликав завершення процесу.

source: Interface to the scheduler
ru: Интерфейс к планировщику
uk: Інтерфейс до планувальника

source: These functions control how a process is allocated CPU time by the operating system. They are only available on some Unix platforms. For more detailed information, consult your Unix manpages.
ru: Эти функции управляют тем, как операционная система распределяет процессорное время процессу. Они доступны только на некоторых платформах Unix. Для получения более подробной информации обратитесь к справочным страницам Unix.
uk: Ці функції контролюють, як процес розподіляє процесорний час операційною системою. Вони доступні лише на деяких платформах Unix. Щоб отримати детальнішу інформацію, зверніться до сторінок довідки Unix.

source: The following scheduling policies are exposed if they are supported by the operating system.
ru: Следующие политики планирования доступны, если они поддерживаются операционной системой.
uk: Наведені нижче політики планування доступні, якщо вони підтримуються операційною системою.

source: The default scheduling policy.
ru: Политика планирования по умолчанию.
uk: Політика планування за умовчанням.

source: Scheduling policy for CPU-intensive processes that tries to preserve interactivity on the rest of the computer.
ru: Политика планирования для процессов, интенсивно использующих ЦП, которая пытается сохранить интерактивность на остальной части компьютера.
uk: Політика планування процесів із інтенсивним використанням ЦП, яка намагається зберегти інтерактивність решти комп’ютера.

source: Scheduling policy for extremely low priority background tasks.
ru: Политика планирования для фоновых задач с чрезвычайно низким приоритетом.
uk: Політика планування для фонових завдань із надзвичайно низьким пріоритетом.

source: Scheduling policy for sporadic server programs.
ru: Политика планирования для спорадических серверных программ.
uk: Політика планування для спорадичних серверних програм.

source: A First In First Out scheduling policy.
ru: Политика планирования «первым пришел – первым ушел».
uk: Політика планування за принципом "перший прийшов - перший вийшов".

source: A round-robin scheduling policy.
ru: Политика циклического планирования.
uk: Політика циклічного планування.

source: This flag can be OR'ed with any other scheduling policy. When a process with this flag set forks, its child's scheduling policy and priority are reset to the default.
ru: Этот флаг можно объединить по ИЛИ с любой другой политикой планирования. Когда процесс с установленным этим флагом разветвляется, политика планирования и приоритет его дочернего процесса сбрасываются до значений по умолчанию.
uk: Цей прапорець можна об’єднати з будь-якою іншою політикою планування. Коли процес із цим прапорцем розгалужується, його політика планування та пріоритет скидаються до стандартних.

source: This class represents tunable scheduling parameters used in :func:`sched_setparam`, :func:`sched_setscheduler`, and :func:`sched_getparam`. It is immutable.
ru: Этот класс представляет настраиваемые параметры планирования, используемые в :func:`sched_setparam` , :func:`sched_setscheduler` , и :func:`sched_getparam` . Это неизменно.
uk: Цей клас представляє настроювані параметри планування, які використовуються в :func:`sched_setparam`, :func:`sched_setscheduler` і :func:`sched_getparam`. Це незмінно.

source: At the moment, there is only one possible parameter:
ru: На данный момент возможен только один параметр:
uk: На даний момент можливий лише один параметр:

source: The scheduling priority for a scheduling policy.
ru: Приоритет планирования для политики планирования.
uk: Пріоритет планування для політики планування.

source: Get the minimum priority value for *policy*. *policy* is one of the scheduling policy constants above.
ru: Получите минимальное значение приоритета для *policy*. *policy* — одна из констант политики планирования, описанных выше.
uk: Отримайте мінімальне значення пріоритету для *політики*. *policy* є однією з наведених вище констант політики планування.

source: Get the maximum priority value for *policy*. *policy* is one of the scheduling policy constants above.
ru: Получите максимальное значение приоритета для *policy*. *policy* — одна из констант политики планирования, описанных выше.
uk: Отримайте максимальне значення пріоритету для *політики*. *policy* є однією з наведених вище констант політики планування.

source: Set the scheduling policy for the process with PID *pid*. A *pid* of 0 means the calling process. *policy* is one of the scheduling policy constants above. *param* is a :class:`sched_param` instance.
ru: Установите политику планирования для процесса с PID *pid*. *pid*, равный 0, означает вызывающий процесс. *policy* — одна из констант политики планирования, описанных выше. *парам* это :class:`sched_param` пример.
uk: Встановіть політику планування для процесу за допомогою PID *pid*. *pid*, рівний 0, означає процес виклику. *policy* — це одна з наведених вище констант політики планування. *param* є екземпляром :class:`sched_param`.

source: Return the scheduling policy for the process with PID *pid*. A *pid* of 0 means the calling process. The result is one of the scheduling policy constants above.
ru: Верните политику планирования для процесса с PID *pid*. *pid*, равный 0, означает вызывающий процесс. Результатом является одна из констант политики планирования, приведенных выше.
uk: Повернути політику планування для процесу з PID *pid*. *pid*, рівний 0, означає процес виклику. Результатом є одна з наведених вище констант політики планування.

source: Set the scheduling parameters for the process with PID *pid*. A *pid* of 0 means the calling process. *param* is a :class:`sched_param` instance.
ru: Установите параметры планирования для процесса с PID *pid*. *pid*, равный 0, означает вызывающий процесс. *парам* это :class:`sched_param` пример.
uk: Встановіть параметри планування для процесу за допомогою PID *pid*. *pid*, рівний 0, означає процес виклику. *param* є екземпляром :class:`sched_param`.

source: Return the scheduling parameters as a :class:`sched_param` instance for the process with PID *pid*. A *pid* of 0 means the calling process.
ru: Верните параметры планирования в виде :class:`sched_param` экземпляр процесса с PID *pid*. *pid*, равный 0, означает вызывающий процесс.
uk: Поверніть параметри планування як екземпляр :class:`sched_param` для процесу з PID *pid*. *pid*, рівний 0, означає процес виклику.

source: Return the round-robin quantum in seconds for the process with PID *pid*. A *pid* of 0 means the calling process.
ru: Возвращает такт циклического перебора в секундах для процесса с PID *pid*. *pid*, равный 0, означает вызывающий процесс.
uk: Повертайте циклічний квант за секунди для процесу з PID *pid*. *pid*, рівний 0, означає процес виклику.

source: Voluntarily relinquish the CPU.
ru: Добровольно отказаться от процессора.
uk: Добровільно відмовитися від ЦП.

source: Restrict the process with PID *pid* (or the current process if zero) to a set of CPUs. *mask* is an iterable of integers representing the set of CPUs to which the process should be restricted.
ru: Ограничьте процесс с PID *pid* (или текущим процессом, если он равен нулю) набором процессоров. *маска* — это итерация целых чисел, представляющая набор процессоров, которыми должен быть ограничен процесс.
uk: Обмежте процес за допомогою PID *pid* (або поточного процесу, якщо дорівнює нулю) набору ЦП. *mask* — це ітерація цілих чисел, що представляють набір процесорів, якими має бути обмежений процес.

source: Return the set of CPUs the process with PID *pid* (or the current process if zero) is restricted to.
uk: Повертає набір процесорів, до яких обмежено процес із PID *pid* (або поточний процес, якщо він нульовий).

source: Miscellaneous System Information
ru: Разная информация о системе
uk: Різна системна інформація

source: Return string-valued system configuration values. *name* specifies the configuration value to retrieve; it may be a string which is the name of a defined system value; these names are specified in a number of standards (POSIX, Unix 95, Unix 98, and others). Some platforms define additional names as well. The names known to the host operating system are given as the keys of the ``confstr_names`` dictionary. For configuration variables not included in that mapping, passing an integer for *name* is also accepted.
ru: Возвращает значения конфигурации системы со строковым значением. *имя* указывает значение конфигурации, которое требуется получить; это может быть строка, которая является именем определенного системного значения; эти имена указаны в ряде стандартов (POSIX, Unix 95, Unix 98 и других). Некоторые платформы также определяют дополнительные имена. Имена, известные операционной системе хоста, задаются как ключи ``confstr_names`` словарь. Для переменных конфигурации, не включенных в это сопоставление, также допускается передача целого числа для *name*.
uk: Повертає рядкові значення конфігурації системи. *name* вказує значення конфігурації для отримання; це може бути рядок, який є назвою визначеного системного значення; ці імена вказані в ряді стандартів (POSIX, Unix 95, Unix 98 та ін.). Деякі платформи також визначають додаткові імена. Імена, відомі головній операційній системі, надаються як ключі словника ``confstr_names``. Для змінних конфігурації, не включених до цього відображення, також допускається передача цілого числа для *name*.

source: If the configuration value specified by *name* isn't defined, ``None`` is returned.
ru: Если значение конфигурации, указанное *имя*, не определено, ``Нет`` возвращается.
uk: Якщо значення конфігурації, указане *name*, не визначено, повертається ``None``.

source: If *name* is a string and is not known, :exc:`ValueError` is raised. If a specific value for *name* is not supported by the host system, even if it is included in ``confstr_names``, an :exc:`OSError` is raised with :const:`errno.EINVAL` for the error number.
ru: Если *имя* является строкой и неизвестно, :exc:`ValueError` поднят. Если конкретное значение *имя* не поддерживается хост-системой, даже если оно включено в ``confstr_names`` , :exc:`OSError` воспитывается с :const:`errno.EINVAL` для номера ошибки.
uk: Якщо *name* є рядком і невідоме, виникає :exc:`ValueError`. Якщо певне значення для *name* не підтримується хост-системою, навіть якщо воно включене в ``confstr_names``, виникає :exc:`OSError` з :const:`errno.EINVAL` для номера помилки .

source: Dictionary mapping names accepted by :func:`confstr` to the integer values defined for those names by the host operating system. This can be used to determine the set of names known to the system.
ru: Имена сопоставлений словаря, принятые :func:`confstr` к целочисленным значениям, определенным для этих имен операционной системой хоста. Это можно использовать для определения набора имен, известных системе.
uk: Словник зіставляє імена, прийняті :func:`confstr`, до цілих значень, визначених для цих імен головною операційною системою. Це можна використовувати для визначення набору імен, відомих системі.

source: Return the number of CPUs in the system. Returns ``None`` if undetermined.
uk: Повертає кількість процесорів у системі. Повертає ``None``, якщо не визначено.

source: This number is not equivalent to the number of CPUs the current process can use. The number of usable CPUs can be obtained with ``len(os.sched_getaffinity(0))``
ru: Это число не эквивалентно количеству процессоров, которые может использовать текущий процесс. Количество доступных процессоров можно получить с помощью ``len(os.sched_getaffinity(0))``
uk: Це число не еквівалентно кількості ЦП, які може використовувати поточний процес. Кількість доступних ЦП можна отримати за допомогою ``len(os.sched_getaffinity(0))``
