Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/os.po
Languages: ru, uk

source: Copy *count* bytes from file descriptor *src*, starting from offset *offset_src*, to file descriptor *dst*, starting from offset *offset_dst*. If *offset_src* is None, then *src* is read from the current position; respectively for *offset_dst*. The files pointed by *src* and *dst* must reside in the same filesystem, otherwise an :exc:`OSError` is raised with :attr:`~OSError.errno` set to :data:`errno.EXDEV`.
uk: Скопіюйте *count* байтів із файлового дескриптора *src*, починаючи зі зсуву *offset_src*, до файлового дескриптора *dst*, починаючи зі зсуву *offset_dst*. Якщо *offset_src* має значення None, тоді *src* читається з поточної позиції; відповідно для *offset_dst*. Файли, на які вказують *src* і *dst*, повинні знаходитися в одній файловій системі, інакше виникає :exc:`OSError` з :attr:`~OSError.errno`, встановленим на :data:`errno.EXDEV`.

source: This copy is done without the additional cost of transferring data from the kernel to user space and then back into the kernel. Additionally, some filesystems could implement extra optimizations. The copy is done as if both files are opened as binary.
ru: Это копирование выполняется без дополнительных затрат на передачу данных из ядра в пространство пользователя и затем обратно в ядро. Кроме того, некоторые файловые системы могут реализовывать дополнительные оптимизации. Копирование выполняется так, как если бы оба файла открывались как двоичные.
uk: Ця копія виконується без додаткових витрат на передачу даних із ядра в простір користувача, а потім назад у ядро. Крім того, деякі файлові системи можуть реалізувати додаткові оптимізації. Копіювання виконується так, ніби обидва файли відкриваються як двійкові.

source: The return value is the amount of bytes copied. This could be less than the amount requested.
ru: Возвращаемое значение — это количество скопированных байтов. Это может быть меньше запрошенной суммы.
uk: Поверненим значенням є кількість скопійованих байтів. Це може бути менше запитаної суми.

source: :ref:`Availability <availability>`: Linux kernel >= 4.5 or glibc >= 2.27.
uk: :ref:`Доступність <availability>`: ядро Linux >= 4.5 або glibc >= 2.27.

source: Return a string describing the encoding of the device associated with *fd* if it is connected to a terminal; else return :const:`None`.
ru: Возвращает строку, описывающую кодировку устройства, связанного с *fd*, если оно подключено к терминалу; иначе возврат :const:`Нет` .
uk: Повертає рядок, що описує кодування пристрою, пов’язаного з *fd*, якщо він підключений до терміналу; інакше повертає :const:`None`.

source: Return a duplicate of file descriptor *fd*. The new file descriptor is :ref:`non-inheritable <fd_inheritance>`.
ru: Вернуть копию файлового дескриптора *fd*. Новый файловый дескриптор :ref:`не наследуется. `.
uk: Повертає дублікат файлового дескриптора *fd*. Новий файловий дескриптор :ref:`не успадковується <fd_inheritance>`.

source: On Windows, when duplicating a standard stream (0: stdin, 1: stdout, 2: stderr), the new file descriptor is :ref:`inheritable <fd_inheritance>`.
ru: В Windows при дублировании стандартного потока (0: stdin, 1: stdout, 2: stderr) новый дескриптор файла является :ref:`inheritable. `.
uk: У Windows під час дублювання стандартного потоку (0: stdin, 1: stdout, 2: stderr) новий дескриптор файлу є :ref:`inheritable <fd_inheritance>`.

source: The new file descriptor is now non-inheritable.
ru: Новый дескриптор файла теперь не наследуется.
uk: Новий файловий дескриптор тепер не успадковується.

source: Duplicate file descriptor *fd* to *fd2*, closing the latter first if necessary. Return *fd2*. The new file descriptor is :ref:`inheritable <fd_inheritance>` by default or non-inheritable if *inheritable* is ``False``.
ru: Дублируйте файловый дескриптор *fd* в *fd2*, при необходимости сначала закрыв последний. Верните *fd2*. Новый файловый дескриптор :ref:`inheritable ` по умолчанию или ненаследуемый, если *inheritable* ``Ложь`` .
uk: Дублюйте файловий дескриптор *fd* до *fd2*, закриваючи останній, якщо необхідно. Повернути *fd2*. Новий файловий дескриптор :ref:`inheritable <fd_inheritance>` за замовчуванням або не успадковується, якщо *inheritable* має значення ``False``.

source: Add the optional *inheritable* parameter.
ru: Добавьте необязательный параметр *inheritable*.
uk: Додайте необов’язковий параметр *inheritable*.

source: Return *fd2* on success. Previously, ``None`` was always returned.
ru: Верните *fd2* в случае успеха. Ранее, ``Нет`` всегда возвращался.
uk: Повернути *fd2* у разі успіху. Раніше завжди повертався ``None``.

source: Change the mode of the file given by *fd* to the numeric *mode*. See the docs for :func:`chmod` for possible values of *mode*. As of Python 3.3, this is equivalent to ``os.chmod(fd, mode)``.
ru: Измените режим файла, заданный *fd*, на числовой *mode*. См. документацию для :func:`chmod` для возможных значений *mode*. Начиная с Python 3.3, это эквивалентно ``os.chmod(fd, mode)`` .
uk: Змініть режим файлу, заданий *fd*, на числовий *режим*. Перегляньте документацію для :func:`chmod`, щоб дізнатися про можливі значення *mode*. Починаючи з Python 3.3, це еквівалентно ``os.chmod(fd, mode)``.

source: Raises an :ref:`auditing event <auditing>` ``os.chmod`` with arguments ``path``, ``mode``, ``dir_fd``.
ru: Вызывает :ref:`событие аудита ` ``os.chmod`` с аргументами ``путь`` , ``режим`` , ``dir_fd`` .
uk: Викликає :ref:`подію аудиту <auditing>` ``os.chmod`` з аргументами ``path``, ``mode``, ``dir_fd``.

source: Change the owner and group id of the file given by *fd* to the numeric *uid* and *gid*. To leave one of the ids unchanged, set it to -1. See :func:`chown`. As of Python 3.3, this is equivalent to ``os.chown(fd, uid, gid)``.
ru: Измените владельца и идентификатор группы файла, заданные *fd*, на числовые *uid* и *gid*. Чтобы оставить один из идентификаторов неизменным, установите для него значение -1. Видеть :func:`chown` . Начиная с Python 3.3, это эквивалентно ``os.chown(fd, uid, gid)`` .
uk: Змініть ідентифікатор власника та групи файлу, наданий *fd*, на числові *uid* і *gid*. Щоб залишити один із ідентифікаторів без змін, встановіть для нього значення -1. Дивіться :func:`chown`. Починаючи з Python 3.3, це еквівалентно ``os.chown(fd, uid, gid)``.

source: Raises an :ref:`auditing event <auditing>` ``os.chown`` with arguments ``path``, ``uid``, ``gid``, ``dir_fd``.
ru: Вызывает :ref:`событие аудита ` ``os.chown`` с аргументами ``путь`` , ``uid`` , ``гид`` , ``dir_fd`` .
uk: Викликає :ref:`подію аудиту <auditing>` ``os.chown`` з аргументами ``path``, ``uid``, ``gid``, ``dir_fd``.

source: Force write of file with filedescriptor *fd* to disk. Does not force update of metadata.
ru: Принудительная запись файла с файловым дескриптором *fd* на диск. Не принудительно обновляет метаданные.
uk: Примусовий запис файлу з файловим дескриптором *fd* на диск. Не примусово оновлювати метадані.

source: This function is not available on MacOS.
ru: Эта функция недоступна в MacOS.
uk: Ця функція недоступна в MacOS.

source: Return system configuration information relevant to an open file. *name* specifies the configuration value to retrieve; it may be a string which is the name of a defined system value; these names are specified in a number of standards (POSIX.1, Unix 95, Unix 98, and others). Some platforms define additional names as well. The names known to the host operating system are given in the ``pathconf_names`` dictionary. For configuration variables not included in that mapping, passing an integer for *name* is also accepted.
ru: Возвращает информацию о конфигурации системы, относящуюся к открытому файлу. *имя* указывает значение конфигурации, которое требуется получить; это может быть строка, которая является именем определенного системного значения; эти имена указаны в ряде стандартов (POSIX.1, Unix 95, Unix 98 и других). Некоторые платформы также определяют дополнительные имена. Имена, известные операционной системе хоста, приведены в ``pathconf_names`` словарь. Для переменных конфигурации, не включенных в это сопоставление, также допускается передача целого числа для *name*.
uk: Повертає інформацію про конфігурацію системи, що стосується відкритого файлу. *name* вказує значення конфігурації для отримання; це може бути рядок, який є назвою визначеного системного значення; ці назви вказані в ряді стандартів (POSIX.1, Unix 95, Unix 98 та інші). Деякі платформи також визначають додаткові імена. Імена, відомі головній операційній системі, наведено у словнику ``pathconf_names``. Для змінних конфігурації, не включених до цього відображення, також допускається передача цілого числа для *name*.

source: If *name* is a string and is not known, :exc:`ValueError` is raised. If a specific value for *name* is not supported by the host system, even if it is included in ``pathconf_names``, an :exc:`OSError` is raised with :const:`errno.EINVAL` for the error number.
ru: Если *имя* является строкой и неизвестно, :exc:`ValueError` поднят. Если конкретное значение *имя* не поддерживается хост-системой, даже если оно включено в ``pathconf_names`` , :exc:`OSError` воспитывается с :const:`errno.EINVAL` для номера ошибки.
uk: Якщо *name* є рядком і невідоме, виникає :exc:`ValueError`. Якщо певне значення для *name* не підтримується хост-системою, навіть якщо воно включено в ``pathconf_names``, виникає :exc:`OSError` з :const:`errno.EINVAL` для номера помилки .

source: As of Python 3.3, this is equivalent to ``os.pathconf(fd, name)``.
ru: Начиная с Python 3.3, это эквивалентно ``os.pathconf(fd, name)`` .
uk: Починаючи з Python 3.3, це еквівалентно ``os.pathconf(fd, name)``.

source: Get the status of the file descriptor *fd*. Return a :class:`stat_result` object.
ru: Получите статус файлового дескриптора *fd*. Вернуть :class:`stat_result` объект.
uk: Отримати статус дескриптора файлу *fd*. Повертає об’єкт :class:`stat_result`.

source: As of Python 3.3, this is equivalent to ``os.stat(fd)``.
ru: Начиная с Python 3.3, это эквивалентно ``os.stat(fd)`` .
uk: Починаючи з Python 3.3, це еквівалентно ``os.stat(fd)``.

source: The :func:`.stat` function.
ru: Функция :func:`.stat`.
uk: Функція :func:`.stat`.

source: Return information about the filesystem containing the file associated with file descriptor *fd*, like :func:`statvfs`. As of Python 3.3, this is equivalent to ``os.statvfs(fd)``.
ru: Возвращает информацию о файловой системе, содержащей файл, связанный с файловым дескриптором *fd*, например :func:`statvfs` . Начиная с Python 3.3, это эквивалентно ``os.statvfs(fd)`` .
uk: Повертає інформацію про файлову систему, яка містить файл, пов’язаний із файловим дескриптором *fd*, наприклад :func:`statvfs`. Починаючи з Python 3.3, це еквівалентно ``os.statvfs(fd)``.

source: Force write of file with filedescriptor *fd* to disk. On Unix, this calls the native :c:func:`fsync` function; on Windows, the MS :c:func:`_commit` function.
uk: Примусовий запис файлу з файловим дескриптором *fd* на диск. В Unix це викликає власну функцію :c:func:`fsync`; у Windows — функція MS :c:func:`_commit`.

source: If you're starting with a buffered Python :term:`file object` *f*, first do ``f.flush()``, and then do ``os.fsync(f.fileno())``, to ensure that all internal buffers associated with *f* are written to disk.
ru: Если вы начинаете с буферизованного Python :term:`file object` *f*, сначала выполните ``f.flush()`` , а затем сделать ``os.fsync(f.fileno())`` , чтобы гарантировать, что все внутренние буферы, связанные с *f*, записываются на диск.
uk: Якщо ви починаєте з буферизованого :term:`file object` Python *f*, спочатку виконайте ``f.flush()``, а потім виконайте ``os.fsync(f.fileno())``, щоб переконатися, що всі внутрішні буфери, пов’язані з *f*, записуються на диск.

source: Truncate the file corresponding to file descriptor *fd*, so that it is at most *length* bytes in size. As of Python 3.3, this is equivalent to ``os.truncate(fd, length)``.
ru: Усеките файл, соответствующий файловому дескриптору *fd*, чтобы его размер не превышал *length* байт. Начиная с Python 3.3, это эквивалентно ``os.truncate(fd, length)`` .
uk: Обріжте файл, що відповідає файловому дескриптору *fd*, щоб він мав розмір не більше *length* байтів. Починаючи з Python 3.3, це еквівалентно ``os.truncate(fd, length)``.

source: Raises an :ref:`auditing event <auditing>` ``os.truncate`` with arguments ``fd``, ``length``.
ru: Вызывает :ref:`событие аудита ` ``os.truncate`` с аргументами ``фд`` , ``длина`` .
uk: Викликає :ref:`подію аудиту <auditing>` ``os.truncate`` з аргументами ``fd``, ``length``.

source: Added support for Windows
ru: Добавлена ​​поддержка Windows
uk: Додана підтримка Windows

source: Get the blocking mode of the file descriptor: ``False`` if the :data:`O_NONBLOCK` flag is set, ``True`` if the flag is cleared.
ru: Получите режим блокировки файлового дескриптора: ``Ложь`` если :data:`O_NONBLOCK` флаг установлен, ``Правда`` если флаг снят.
uk: Отримати режим блокування дескриптора файлу: ``False``, якщо встановлено прапорець :data:`O_NONBLOCK`, ``True``, якщо прапорець знято.

source: See also :func:`set_blocking` and :meth:`socket.socket.setblocking`.
ru: См. также :func:`set_blocking` и :meth:`socket.socket.setblocking` .
uk: Дивіться також :func:`set_blocking` і :meth:`socket.socket.setblocking`.

source: Return ``True`` if the file descriptor *fd* is open and connected to a tty(-like) device, else ``False``.
ru: Возвращаться ``Правда`` если файловый дескриптор *fd* открыт и подключен к tty-подобному устройству, иначе ``Ложь`` .
uk: Повертає ``True``, якщо файловий дескриптор *fd* відкрито та підключено до tty(-like) пристрою, інакше ``False``.

source: Apply, test or remove a POSIX lock on an open file descriptor. *fd* is an open file descriptor. *cmd* specifies the command to use - one of :data:`F_LOCK`, :data:`F_TLOCK`, :data:`F_ULOCK` or :data:`F_TEST`. *len* specifies the section of the file to lock.
ru: Примените, протестируйте или удалите блокировку POSIX для дескриптора открытого файла. *fd* — дескриптор открытого файла. *cmd* указывает используемую команду — одну из :data:`F_LOCK` , :data:`F_TLOCK` , :data:`F_ULOCK` или :data:`F_TEST` . *len* указывает раздел файла, который необходимо заблокировать.
uk: Застосуйте, перевірте або видаліть блокування POSIX для відкритого файлового дескриптора. *fd* — дескриптор відкритого файлу. *cmd* визначає команду для використання - одну з :data:`F_LOCK`, :data:`F_TLOCK`, :data:`F_ULOCK` або :data:`F_TEST`. *len* вказує розділ файлу, який потрібно заблокувати.

source: Raises an :ref:`auditing event <auditing>` ``os.lockf`` with arguments ``fd``, ``cmd``, ``len``.
ru: Вызывает :ref:`событие аудита ` ``os.lockf`` с аргументами ``фд`` , ``cmd`` , ``только'' .
uk: Викликає :ref:`подію аудиту <auditing>` ``os.lockf`` з аргументами ``fd``, ``cmd``, ``len``.

source: Flags that specify what action :func:`lockf` will take.
ru: Флаги, указывающие, какое действие :func:`lockf` возьму.
uk: Прапорці, які вказують, яку дію виконуватиме :func:`lockf`.

source: Set the current position of file descriptor *fd* to position *pos*, modified by *how*: :const:`SEEK_SET` or ``0`` to set the position relative to the beginning of the file; :const:`SEEK_CUR` or ``1`` to set it relative to the current position; :const:`SEEK_END` or ``2`` to set it relative to the end of the file. Return the new cursor position in bytes, starting from the beginning.
uk: Установіть поточну позицію дескриптора файлу *fd* у позицію *pos*, змінену *how*: :const:`SEEK_SET` або ``0``, щоб встановити позицію відносно початку файлу; :const:`SEEK_CUR` або ``1``, щоб встановити його відносно поточної позиції; :const:`SEEK_END` або ``2``, щоб встановити його відносно кінця файлу. Повертає нову позицію курсору в байтах, починаючи з початку.

source: Parameters to the :func:`lseek` function. Their values are 0, 1, and 2, respectively.
uk: Параметри функції :func:`lseek`. Їх значення дорівнюють 0, 1 і 2 відповідно.

source: Some operating systems could support additional values, like :data:`os.SEEK_HOLE` or :data:`os.SEEK_DATA`.
uk: Деякі операційні системи можуть підтримувати додаткові значення, наприклад :data:`os.SEEK_HOLE` або :data:`os.SEEK_DATA`.

source: Open the file *path* and set various flags according to *flags* and possibly its mode according to *mode*. When computing *mode*, the current umask value is first masked out. Return the file descriptor for the newly opened file. The new file descriptor is :ref:`non-inheritable <fd_inheritance>`.
ru: Откройте файл *path* и установите различные флаги в соответствии с *flags* и, возможно, его режим в соответствии с *mode*. При вычислении *mode* текущее значение umask сначала маскируется. Возвращает файловый дескриптор вновь открытого файла. Новый файловый дескриптор :ref:`не наследуется. `.
uk: Відкрийте *шлях* до файлу та встановіть різні позначки відповідно до *flags* і, можливо, його режим відповідно до *mode*. Під час обчислення *режиму* поточне значення umask спочатку маскується. Повертає файловий дескриптор для щойно відкритого файлу. Новий файловий дескриптор :ref:`не успадковується <fd_inheritance>`.

source: For a description of the flag and mode values, see the C run-time documentation; flag constants (like :const:`O_RDONLY` and :const:`O_WRONLY`) are defined in the :mod:`os` module. In particular, on Windows adding :const:`O_BINARY` is needed to open files in binary mode.
ru: Описание значений флагов и режимов см. в документации времени выполнения C; константы флагов (например, :const:`O_RDONLY` и :const:`O_WRONLY` ) определены в :против:`нас` модуль. В частности, в Windows добавление :const:`O_BINARY` необходим для открытия файлов в двоичном режиме.
uk: Для опису значень прапора та режиму дивіться документацію про час виконання C; константи прапорів (наприклад, :const:`O_RDONLY` і :const:`O_WRONLY`) визначені в модулі :mod:`os`. Зокрема, у Windows додавання :const:`O_BINARY` потрібне для відкриття файлів у бінарному режимі.

source: This function can support :ref:`paths relative to directory descriptors <dir_fd>` with the *dir_fd* parameter.
ru: Эта функция может поддерживать пути относительно дескрипторов каталогов. ` с параметром *dir_fd*.
uk: Ця функція може підтримувати :ref:`шляхи відносно дескрипторів каталогу <dir_fd>` з параметром *dir_fd*.

source: Raises an :ref:`auditing event <auditing>` ``open`` with arguments ``path``, ``mode``, ``flags``.
ru: Raises an :ref:`auditing event ` ``open`` with arguments ``path``, ``mode``, ``flags``.
uk: Викликає :ref:`подію аудиту <auditing>` ``open`` з аргументами ``path``, ``mode``, ``flags``.

source: This function is intended for low-level I/O. For normal usage, use the built-in function :func:`open`, which returns a :term:`file object` with :meth:`~file.read` and :meth:`~file.write` methods (and many more). To wrap a file descriptor in a file object, use :func:`fdopen`.
ru: Эта функция предназначена для низкоуровневого ввода-вывода. Для обычного использования используйте встроенную функцию :func:`открыть` , который возвращает :term:`файловый объект` с :meth:`~file.read` и :meth:`~file.write` методы (и многие другие). Чтобы обернуть дескриптор файла в файловый объект, используйте :func:`fdopen` .
uk: Ця функція призначена для низькорівневого введення-виведення. Для звичайного використання використовуйте вбудовану функцію :func:`open`, яка повертає об’єкт :term:`file object` з методами :meth:`~file.read` і :meth:`~file.write` (і набагато більше). Щоб обернути файловий дескриптор у файловий об’єкт, використовуйте :func:`fdopen`.

source: The *dir_fd* argument.
ru: Аргумент *dir_fd*.
uk: Аргумент *dir_fd*.

source: If the system call is interrupted and the signal handler does not raise an exception, the function now retries the system call instead of raising an :exc:`InterruptedError` exception (see :pep:`475` for the rationale).
ru: Если системный вызов прерывается и обработчик сигнала не возбуждает исключение, функция теперь повторяет системный вызов вместо возбуждения исключения :exc:`InterruptedError` (см. :pep:`475` для объяснения).
uk: Якщо системний виклик перервано, а обробник сигналу не викликає виключення, функція тепер повторює системний виклик замість того, щоб викликати виняток :exc:`InterruptedError` (перегляньте :pep:`475` для обґрунтування).

source: Accepts a :term:`path-like object`.
ru: Принимает :term:`объект, похожий на путь`.
uk: Приймає :term:`path-like object`.

source: The following constants are options for the *flags* parameter to the :func:`~os.open` function. They can be combined using the bitwise OR operator ``|``. Some of them are not available on all platforms. For descriptions of their availability and use, consult the :manpage:`open(2)` manual page on Unix or `the MSDN <https://msdn.microsoft.com/en-us/library/z0kc8e3z.aspx>`_ on Windows.
ru: Следующие константы являются опциями параметра *flags* для :func:`~os.open` функция. Их можно объединить с помощью побитового оператора ИЛИ. ``|`` . Некоторые из них доступны не на всех платформах. Описания их доступности и использования см. :manpage:`open(2)` справочную страницу по Unix или `MSDN <https://msdn.microsoft.com/en-us/library/z0kc8e3z.aspx>`_ в Windows.
uk: Наступні константи є опціями для параметра *flags* функції :func:`~os.open`. Їх можна комбінувати за допомогою порозрядного оператора АБО ``|``. Деякі з них доступні не на всіх платформах. Для опису їх доступності та використання зверніться до :manpage:`open(2)` сторінки посібника для Unix або `MSDN <https://msdn.microsoft.com/en-us/library/z0kc8e3z.aspx>`_ для Windows.

source: The above constants are available on Unix and Windows.
ru: Вышеуказанные константы доступны в Unix и Windows.
uk: Наведені вище константи доступні в Unix і Windows.

source: The above constants are only available on Unix.
ru: Вышеуказанные константы доступны только в Unix.
uk: Наведені вище константи доступні лише в Unix.

source: Add :data:`O_CLOEXEC` constant.
ru: Добавлять :data:`O_CLOEXEC` постоянный.
uk: Додайте константу :data:`O_CLOEXEC`.

source: The above constants are only available on Windows.
ru: Вышеуказанные константы доступны только в Windows.
uk: Наведені вище константи доступні лише у Windows.

source: The above constants are extensions and not present if they are not defined by the C library.
ru: Вышеупомянутые константы являются расширениями и не присутствуют, если они не определены библиотекой C.
uk: Наведені вище константи є розширеннями і не присутні, якщо вони не визначені бібліотекою C.

source: Add :data:`O_PATH` on systems that support it. Add :data:`O_TMPFILE`, only available on Linux Kernel 3.11 or newer.
ru: Добавлять :data:`O_PATH` в системах, которые его поддерживают. Добавлять :data:`O_TMPFILE` , доступно только в Linux Kernel 3.11 или новее.
uk: Додайте :data:`O_PATH` до систем, які його підтримують. Додайте :data:`O_TMPFILE`, доступний лише на ядрі Linux 3.11 або новіших.

source: Open a new pseudo-terminal pair. Return a pair of file descriptors ``(master, slave)`` for the pty and the tty, respectively. The new file descriptors are :ref:`non-inheritable <fd_inheritance>`. For a (slightly) more portable approach, use the :mod:`pty` module.
ru: Откройте новую пару псевдотерминалов. Вернуть пару файловых дескрипторов ``(главный, подчиненный)`` для pty и tty соответственно. Новые файловые дескрипторы :ref:`не наследуются. `. Для (немного) более портативного подхода используйте :mod:`pty` модуль.
uk: Відкрийте нову пару псевдотерміналів. Повертає пару файлових дескрипторів ``(master, slave)`` для pty і tty відповідно. Нові дескриптори файлів :ref:`не успадковуються <fd_inheritance>`. Для (трохи) більш портативного підходу використовуйте модуль :mod:`pty`.

source: :ref:`Availability <availability>`: some flavors of Unix.
uk: :ref:`Наявність <availability>`: деякі різновиди Unix.
