Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/os.po
Languages: ru, uk

source: A file descriptor has an "inheritable" flag which indicates if the file descriptor can be inherited by child processes. Since Python 3.4, file descriptors created by Python are non-inheritable by default.
ru: Дескриптор файла имеет флаг «наследуемый», который указывает, может ли дескриптор файла быть унаследован дочерними процессами. Начиная с Python 3.4, файловые дескрипторы, созданные Python, по умолчанию не наследуются.
uk: Файловий дескриптор має позначку "успадковуваний", яка вказує, чи може файловий дескриптор успадковуватися дочірніми процесами. Починаючи з Python 3.4, дескриптори файлів, створені Python, за замовчуванням не успадковуються.

source: On UNIX, non-inheritable file descriptors are closed in child processes at the execution of a new program, other file descriptors are inherited.
ru: В UNIX ненаследуемые файловые дескрипторы закрываются в дочерних процессах при выполнении новой программы, остальные файловые дескрипторы наследуются.
uk: В UNIX неуспадковані файлові дескриптори закриваються в дочірніх процесах під час виконання нової програми, інші файлові дескриптори успадковуються.

source: On Windows, non-inheritable handles and file descriptors are closed in child processes, except for standard streams (file descriptors 0, 1 and 2: stdin, stdout and stderr), which are always inherited. Using :func:`spawn\* <spawnl>` functions, all inheritable handles and all inheritable file descriptors are inherited. Using the :mod:`subprocess` module, all file descriptors except standard streams are closed, and inheritable handles are only inherited if the *close_fds* parameter is ``False``.
ru: В Windows ненаследуемые дескрипторы и файловые дескрипторы закрыты в дочерних процессах, за исключением стандартных потоков (файловые дескрипторы 0, 1 и 2: stdin, stdout и stderr), которые всегда наследуются. Использование :func:`spawn\* `функции наследуются все наследуемые дескрипторы и все наследуемые дескрипторы файлов. Используя :mod:`подпроцесс` модуль, все файловые дескрипторы, кроме стандартных потоков, закрываются, а наследуемые дескрипторы наследуются только в том случае, если параметр *close_fds* равен ``Ложь`` .
uk: У Windows неуспадковані дескриптори та дескриптори файлів закриті в дочірніх процесах, за винятком стандартних потоків (дескриптори файлів 0, 1 і 2: stdin, stdout і stderr), які завжди успадковуються. За допомогою функцій :func:`spawn\* <spawnl>` успадковуються всі успадковані маркери та всі успадковані дескриптори файлів. За допомогою модуля :mod:`subprocess` усі файлові дескриптори, крім стандартних потоків, закриваються, а успадковані дескриптори успадковуються, лише якщо параметр *close_fds* має значення ``False``.

source: Get the "inheritable" flag of the specified file descriptor (a boolean).
ru: Получите флаг «наследуемый» указанного дескриптора файла (логическое значение).
uk: Отримайте позначку "успадкований" зазначеного файлового дескриптора (логічне значення).

source: Set the "inheritable" flag of the specified file descriptor.
ru: Установите флаг «наследуемый» для указанного дескриптора файла.
uk: Встановіть прапорець "успадкований" для зазначеного файлового дескриптора.

source: Get the "inheritable" flag of the specified handle (a boolean).
ru: Получите «наследуемый» флаг указанного дескриптора (логическое значение).
uk: Отримайте прапор "успадкований" зазначеного маркера (логічне значення).

source: :ref:`Availability <availability>`: Windows.
uk: :ref:`Наявність <availability>`: Windows.

source: Set the "inheritable" flag of the specified handle.
ru: Установите флаг «наследуемый» для указанного дескриптора.
uk: Встановіть прапорець "успадкований" для вказаного маркера.

source: Files and Directories
ru: Файлы и каталоги
uk: Файли та каталоги

source: On some Unix platforms, many of these functions support one or more of these features:
ru: На некоторых платформах Unix многие из этих функций поддерживают одну или несколько из следующих функций:
uk: На деяких платформах Unix багато з цих функцій підтримують одну або кілька таких функцій:

source: **specifying a file descriptor:** Normally the *path* argument provided to functions in the :mod:`os` module must be a string specifying a file path. However, some functions now alternatively accept an open file descriptor for their *path* argument. The function will then operate on the file referred to by the descriptor. (For POSIX systems, Python will call the variant of the function prefixed with ``f`` (e.g. call ``fchdir`` instead of ``chdir``).)
ru: **указание дескриптора файла:** Обычно аргумент *path* предоставляется функциям в :против:`нас` модуль должен быть строкой, определяющей путь к файлу. Однако некоторые функции теперь альтернативно принимают дескриптор открытого файла в качестве аргумента *path*. Затем функция будет работать с файлом, на который ссылается дескриптор. (Для систем POSIX Python вызовет вариант функции с префиксом ``ф`` (например, позвонить ``fchdir'' вместо ``до свидания'' ).)
uk: **зазначення дескриптора файлу:** Зазвичай аргумент *path*, який надається функціям у модулі :mod:`os`, має бути рядком, що вказує шлях до файлу. Однак деякі функції тепер альтернативно приймають дескриптор відкритого файлу для свого аргументу *path*. Потім функція працюватиме з файлом, на який посилається дескриптор. (Для систем POSIX Python викличе варіант функції з префіксом ``f`` (наприклад, виклик ``fchdir`` замість ``chdir``).)

source: You can check whether or not *path* can be specified as a file descriptor for a particular function on your platform using :data:`os.supports_fd`. If this functionality is unavailable, using it will raise a :exc:`NotImplementedError`.
ru: Вы можете проверить, можно ли указать *path* в качестве дескриптора файла для определенной функции на вашей платформе, используя :data:`os.supports_fd` . Если эта функция недоступна, ее использование приведет к :exc:`NotImplementedError` .
uk: Ви можете перевірити, чи можна вказати *шлях* як дескриптор файлу для певної функції на вашій платформі за допомогою :data:`os.supports_fd`. Якщо ця функція недоступна, її використання призведе до помилки :exc:`NotImplementedError`.

source: If the function also supports *dir_fd* or *follow_symlinks* arguments, it's an error to specify one of those when supplying *path* as a file descriptor.
ru: Если функция также поддерживает аргументы *dir_fd* или *follow_symlinks*, указание одного из них при указании *path* в качестве файлового дескриптора является ошибкой.
uk: Якщо функція також підтримує аргументи *dir_fd* або *follow_symlinks*, буде помилкою вказати один із них під час надання *шляху* як дескриптора файлу.

source: **paths relative to directory descriptors:** If *dir_fd* is not ``None``, it should be a file descriptor referring to a directory, and the path to operate on should be relative; path will then be relative to that directory. If the path is absolute, *dir_fd* is ignored. (For POSIX systems, Python will call the variant of the function with an ``at`` suffix and possibly prefixed with ``f`` (e.g. call ``faccessat`` instead of ``access``).
ru: **пути относительно дескрипторов каталогов:** если *dir_fd* не указан ``Нет`` , это должен быть файловый дескриптор, ссылающийся на каталог, а путь для работы должен быть относительным; путь тогда будет относительным к этому каталогу. Если путь абсолютный, *dir_fd* игнорируется. (Для систем POSIX Python вызовет вариант функции с ``в`` суффикс и, возможно, с префиксом ``ф`` (например, позвонить ``faccessat`` вместо ``доступ`` ).
uk: **шляхи відносно дескрипторів каталогу:** Якщо *dir_fd* не є ``None``, це має бути дескриптор файлу, який посилається на каталог, а шлях для роботи має бути відносним; тоді шлях буде відносним до цього каталогу. Якщо шлях абсолютний, *dir_fd* ігнорується. (Для систем POSIX Python викличе варіант функції з суфіксом ``at`` і, можливо, з префіксом ``f`` (наприклад, виклик ``faccessat`` замість ``access``).

source: You can check whether or not *dir_fd* is supported for a particular function on your platform using :data:`os.supports_dir_fd`. If it's unavailable, using it will raise a :exc:`NotImplementedError`.
ru: Вы можете проверить, поддерживается ли *dir_fd* для конкретной функции на вашей платформе, используя :data:`os.supports_dir_fd` . Если он недоступен, его использование вызовет :exc:`NotImplementedError` .
uk: Ви можете перевірити, чи підтримується *dir_fd* для певної функції на вашій платформі за допомогою :data:`os.supports_dir_fd`. Якщо він недоступний, його використання призведе до помилки :exc:`NotImplementedError`.

source: **not following symlinks:** If *follow_symlinks* is ``False``, and the last element of the path to operate on is a symbolic link, the function will operate on the symbolic link itself rather than the file pointed to by the link. (For POSIX systems, Python will call the ``l...`` variant of the function.)
ru: **не следует по символическим ссылкам:** Если *follow_symlinks* ``Ложь`` , а последним элементом пути, с которым нужно работать, является символическая ссылка, функция будет работать с самой символической ссылкой, а не с файлом, на который указывает ссылка. (Для систем POSIX Python вызовет ``л...`` вариант функции.)
uk: **не слідувати за символічними посиланнями:** Якщо *follow_symlinks* має значення ``False``, а останнім елементом шляху, з яким потрібно працювати, є символьне посилання, функція працюватиме з самим символічним посиланням, а не з файлом, на який вказує посилання. (Для систем POSIX Python викличе варіант функції ``l...``.)

source: You can check whether or not *follow_symlinks* is supported for a particular function on your platform using :data:`os.supports_follow_symlinks`. If it's unavailable, using it will raise a :exc:`NotImplementedError`.
ru: Вы можете проверить, поддерживается ли *follow_symlinks* для конкретной функции на вашей платформе, используя :data:`os.supports_follow_symlinks` . Если он недоступен, его использование вызовет :exc:`NotImplementedError` .
uk: Ви можете перевірити, чи підтримується *follow_symlinks* для певної функції на вашій платформі, використовуючи :data:`os.supports_follow_symlinks`. Якщо він недоступний, його використання викличе :exc:`NotImplementedError`.

source: Use the real uid/gid to test for access to *path*. Note that most operations will use the effective uid/gid, therefore this routine can be used in a suid/sgid environment to test if the invoking user has the specified access to *path*. *mode* should be :const:`F_OK` to test the existence of *path*, or it can be the inclusive OR of one or more of :const:`R_OK`, :const:`W_OK`, and :const:`X_OK` to test permissions. Return :const:`True` if access is allowed, :const:`False` if not. See the Unix man page :manpage:`access(2)` for more information.
ru: Используйте настоящий uid/gid для проверки доступа к *path*. Обратите внимание, что большинство операций будут использовать действующий uid/gid, поэтому эту процедуру можно использовать в среде suid/sgid, чтобы проверить, имеет ли вызывающий пользователь указанный доступ к *path*. *режим* должен быть :const:`F_OK` чтобы проверить существование *path*, или это может быть включающее ИЛИ одного или нескольких из :const:`R_OK` , :const:`W_OK` , и :const:`X_OK` для проверки разрешений. Возвращаться :const:`Верно` если доступ разрешен, :const:`Ложь` если не. См. справочную страницу Unix. :manpage:`доступ(2)` для получения дополнительной информации.
uk: Використовуйте справжній uid/gid, щоб перевірити доступ до *шляху*. Зауважте, що більшість операцій використовуватиме ефективний uid/gid, тому цю підпрограму можна використовувати в середовищі suid/sgid, щоб перевірити, чи має користувач, який викликає, вказаний доступ до *path*. *режим* має бути :const:`F_OK`, щоб перевірити існування *шляху*, або він може бути включним АБО одного чи кількох :const:`R_OK`, :const:`W_OK` і :const:`X_OK`, щоб перевірити дозволи. Повертає :const:`True`, якщо доступ дозволено, :const:`False`, якщо ні. Додаткову інформацію див. на сторінці довідки Unix :manpage:`access(2)`.

source: This function can support specifying :ref:`paths relative to directory descriptors <dir_fd>` and :ref:`not following symlinks <follow_symlinks>`.
ru: Эта функция может поддерживать указание путей относительно дескрипторов каталогов. ` и :ref:`не переходить по символическим ссылкам`.
uk: Ця функція може підтримувати вказівку :ref:`шляхів відносно дескрипторів каталогу <dir_fd>` і :ref:`не слідувати символічним посиланням <follow_symlinks>`.

source: If *effective_ids* is ``True``, :func:`access` will perform its access checks using the effective uid/gid instead of the real uid/gid. *effective_ids* may not be supported on your platform; you can check whether or not it is available using :data:`os.supports_effective_ids`. If it is unavailable, using it will raise a :exc:`NotImplementedError`.
ru: Если *efficient_ids* ``Правда`` , :func:`доступ` будет выполнять проверки доступа, используя эффективный uid/gid вместо реального uid/gid. *efficient_ids* может не поддерживаться на вашей платформе; вы можете проверить, доступен ли он, используя :data:`os.supports_efficient_ids` . Если он недоступен, его использование вызовет :exc:`NotImplementedError` .
uk: Якщо *effective_ids* має значення ``True``, :func:`access` виконуватиме перевірку доступу, використовуючи ефективний uid/gid замість справжнього uid/gid. *effective_ids* може не підтримуватися на вашій платформі; ви можете перевірити, чи він доступний, за допомогою :data:`os.supports_effective_ids`. Якщо він недоступний, його використання призведе до помилки :exc:`NotImplementedError`.

source: Using :func:`access` to check if a user is authorized to e.g. open a file before actually doing so using :func:`open` creates a security hole, because the user might exploit the short time interval between checking and opening the file to manipulate it. It's preferable to use :term:`EAFP` techniques. For example::
ru: С использованием :func:`доступ` чтобы проверить, имеет ли пользователь право, например, открыть файл, прежде чем фактически сделать это, используя :func:`открыть` создает дыру в безопасности, поскольку пользователь может использовать короткий интервал времени между проверкой и открытием файла для манипулирования им. Предпочтительно использовать методы :term:`EAFP`. Например::
uk: Використовуючи :func:`access`, щоб перевірити, чи має користувач право, наприклад, відкрити файл перед тим, як це зробити за допомогою :func:`open` створює діру в безпеці, тому що користувач може використати короткий проміжок часу між перевіркою та відкриттям файлу, щоб маніпулювати ним. Бажано використовувати техніку :term:`EAFP`. Наприклад::

source: is better written as::
ru: лучше написать так::
uk: краще записати як::

source: I/O operations may fail even when :func:`access` indicates that they would succeed, particularly for operations on network filesystems which may have permissions semantics beyond the usual POSIX permission-bit model.
ru: Операции ввода-вывода могут завершиться неудачей, даже если :func:`доступ` указывает на то, что они будут успешными, особенно для операций в сетевых файловых системах, которые могут иметь семантику разрешений, выходящую за рамки обычной модели битов разрешений POSIX.
uk: Операції вводу/виводу можуть завершуватися невдачею, навіть якщо :func:`access` вказує, що вони будуть успішними, особливо для операцій у мережевих файлових системах, які можуть мати семантику дозволів за межами звичайної бітової моделі дозволів POSIX.

source: Added the *dir_fd*, *effective_ids*, and *follow_symlinks* parameters.
ru: Добавлены параметры *dir_fd*, *efficient_ids* и *follow_symlinks*.
uk: Додано параметри *dir_fd*, *effective_ids* і *follow_symlinks*.

source: Values to pass as the *mode* parameter of :func:`access` to test the existence, readability, writability and executability of *path*, respectively.
ru: Значения для передачи в качестве параметра *mode* :func:`доступ` чтобы проверить существование, читаемость, возможность записи и исполняемость *path* соответственно.
uk: Значення, які потрібно передавати як параметр *mode* :func:`access`, щоб перевірити наявність, читабельність, запис і можливість виконання *path* відповідно.

source: Change the current working directory to *path*.
ru: Измените текущий рабочий каталог на *path*.
uk: Змініть поточний робочий каталог на *шлях*.

source: This function can support :ref:`specifying a file descriptor <path_fd>`. The descriptor must refer to an opened directory, not an open file.
ru: Эта функция может поддерживать указание дескриптора файла. `. Дескриптор должен ссылаться на открытый каталог, а не на открытый файл.
uk: Ця функція може підтримувати :ref:`зазначення файлового дескриптора <path_fd>`. Дескриптор має посилатися на відкритий каталог, а не на відкритий файл.

source: This function can raise :exc:`OSError` and subclasses such as :exc:`FileNotFoundError`, :exc:`PermissionError`, and :exc:`NotADirectoryError`.
ru: Эта функция может поднять :exc:`OSError` и подклассы, такие как :exc:`FileNotFoundError` , :exc:`PermissionError` , и :exc:`NotADirectoryError` .
uk: Ця функція може викликати :exc:`OSError` і підкласи, такі як :exc:`FileNotFoundError`, :exc:`PermissionError` і :exc:`NotADirectoryError`.

source: Raises an :ref:`auditing event <auditing>` ``os.chdir`` with argument ``path``.
ru: Вызывает :ref:`событие аудита ` ``os.chdir`` с аргументом ``путь`` .
uk: Викликає :ref:`подію аудиту <auditing>` ``os.chdir`` з аргументом ``path``.

source: Added support for specifying *path* as a file descriptor on some platforms.
ru: Добавлена ​​поддержка указания *path* в качестве дескриптора файла на некоторых платформах.
uk: Додано підтримку вказівки *шляху* як дескриптора файлу на деяких платформах.

source: Set the flags of *path* to the numeric *flags*. *flags* may take a combination (bitwise OR) of the following values (as defined in the :mod:`stat` module):
ru: Установите флаги *path* на числовые *flags*. *флаги* могут принимать комбинацию (побитовое ИЛИ) следующих значений (как определено в :mode:`состояние` модуль):
uk: Встановіть прапорці *шляху* на числові *прапорці*. *flags* може приймати комбінацію (порозрядне АБО) таких значень (як визначено в модулі :mod:`stat`):

source: This function can support :ref:`not following symlinks <follow_symlinks>`.
ru: Эта функция может поддерживать :ref:`не переход по символическим ссылкам `.
uk: Ця функція підтримує :ref:`неперехід за символічними посиланнями <follow_symlinks>`.

source: Raises an :ref:`auditing event <auditing>` ``os.chflags`` with arguments ``path``, ``flags``.
ru: Вызывает :ref:`событие аудита ` ``os.chflags`` с аргументами ``путь`` , ``флаги`` .
uk: Викликає :ref:`подію аудиту <auditing>` ``os.chflags`` з аргументами ``path``, ``flags``.

source: The *follow_symlinks* argument.
ru: Аргумент *follow_symlinks*.
uk: Аргумент *follow_symlinks*.

source: Change the mode of *path* to the numeric *mode*. *mode* may take one of the following values (as defined in the :mod:`stat` module) or bitwise ORed combinations of them:
ru: Измените режим *path* на числовой *mode*. *mode* может принимать одно из следующих значений (как определено в :mode:`состояние` модуль) или их побитовые комбинации с ИЛИ:
uk: Змініть режим *шляху* на числовий *режим*. *mode* може приймати одне з наступних значень (як визначено в модулі :mod:`stat`) або їх комбінації порозрядними АБО:

source: This function can support :ref:`specifying a file descriptor <path_fd>`, :ref:`paths relative to directory descriptors <dir_fd>` and :ref:`not following symlinks <follow_symlinks>`.
ru: Эта функция может поддерживать указание дескриптора файла. `, :ref:`пути относительно дескрипторов каталогов ` и :ref:`не переходить по символическим ссылкам`.
uk: Ця функція може підтримувати :ref:`зазначення дескриптора файлу <path_fd>`, :ref:`шляхи відносно дескрипторів каталогу <dir_fd>` та :ref:`неперехід за символічними посиланнями <follow_symlinks>`.

source: Although Windows supports :func:`chmod`, you can only set the file's read-only flag with it (via the ``stat.S_IWRITE`` and ``stat.S_IREAD`` constants or a corresponding integer value). All other bits are ignored.
ru: Хотя Windows поддерживает :func:`chmod`, с его помощью вы можете установить только флаг доступа к файлу (через константы stat.S_IWRITE и stat.S_IREAD или соответствующее целочисленное значение). Все остальные биты игнорируются.
uk: Незважаючи на те, що Windows підтримує :func:`chmod`, ви можете встановити для файлу позначку лише для читання (через константи ``stat.S_IWRITE`` і ``stat.S_IREAD`` або відповідне ціле значення). Усі інші біти ігноруються.

source: Added support for specifying *path* as an open file descriptor, and the *dir_fd* and *follow_symlinks* arguments.
ru: Добавлена ​​поддержка указания *path* в качестве дескриптора открытого файла, а также аргументов *dir_fd* и *follow_symlinks*.
uk: Додано підтримку вказівки *шляху* як дескриптора відкритого файлу, а також аргументів *dir_fd* і *follow_symlinks*.

source: Change the owner and group id of *path* to the numeric *uid* and *gid*. To leave one of the ids unchanged, set it to -1.
ru: Измените владельца и идентификатор группы *path* на числовые *uid* и *gid*. Чтобы оставить один из идентификаторов неизменным, установите для него значение -1.
uk: Змініть власника та ідентифікатор групи *path* на числові *uid* і *gid*. Щоб залишити один із ідентифікаторів без змін, встановіть для нього значення -1.

source: See :func:`shutil.chown` for a higher-level function that accepts names in addition to numeric ids.
ru: Видеть :func:`shutil.chown` для функции более высокого уровня, которая принимает имена в дополнение к числовым идентификаторам.
uk: Перегляньте :func:`shutil.chown` для функції вищого рівня, яка приймає імена на додаток до числових ідентифікаторів.

source: Supports a :term:`path-like object`.
ru: Поддерживает :term:`объект, похожий на путь`.
uk: Підтримує :term:`path-like object`.

source: Change the root directory of the current process to *path*.
ru: Измените корневой каталог текущего процесса на *path*.
uk: Змініть кореневий каталог поточного процесу на *шлях*.

source: Change the current working directory to the directory represented by the file descriptor *fd*. The descriptor must refer to an opened directory, not an open file. As of Python 3.3, this is equivalent to ``os.chdir(fd)``.
ru: Измените текущий рабочий каталог на каталог, представленный файловым дескриптором *fd*. Дескриптор должен ссылаться на открытый каталог, а не на открытый файл. Начиная с Python 3.3, это эквивалентно ``os.chdir(fd)`` .
uk: Змініть поточний робочий каталог на каталог, представлений дескриптором файлу *fd*. Дескриптор має посилатися на відкритий каталог, а не на відкритий файл. Починаючи з Python 3.3, це еквівалентно ``os.chdir(fd)``.

source: Return a string representing the current working directory.
ru: Возвращает строку, представляющую текущий рабочий каталог.
uk: Повертає рядок, що представляє поточний робочий каталог.

source: Return a bytestring representing the current working directory.
ru: Возвращает строку байтов, представляющую текущий рабочий каталог.
uk: Повертає байтовий рядок, що представляє поточний робочий каталог.

source: The function now uses the UTF-8 encoding on Windows, rather than the ANSI code page: see :pep:`529` for the rationale. The function is no longer deprecated on Windows.
ru: Функция теперь использует кодировку UTF-8 в Windows, а не кодовую страницу ANSI: см. :pep:`529` для обоснования. Эта функция больше не является устаревшей в Windows.
uk: Функція тепер використовує кодування UTF-8 у Windows, а не кодову сторінку ANSI: див. :pep:`529` для обґрунтування. Ця функція більше не підтримується в Windows.
