Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/os.po
Languages: ru, uk

source: On Solaris and derivatives, the following attributes may also be available:
ru: В Solaris и его производных также могут быть доступны следующие атрибуты:
uk: У Solaris і похідних також можуть бути доступні такі атрибути:

source: String that uniquely identifies the type of the filesystem that contains the file.
ru: Строка, однозначно идентифицирующая тип файловой системы, содержащей файл.
uk: Рядок, який однозначно визначає тип файлової системи, яка містить файл.

source: On macOS systems, the following attributes may also be available:
ru: В системах macOS также могут быть доступны следующие атрибуты:
uk: У системах macOS також можуть бути доступні такі атрибути:

source: Real size of the file.
ru: Реальный размер файла.
uk: Реальний розмір файлу.

source: Creator of the file.
ru: Создатель файла.
uk: Творець файлу.

source: File type.
ru: Тип файла.
uk: Тип файлу.

source: On Windows systems, the following attributes are also available:
ru: В системах Windows также доступны следующие атрибуты:
uk: У системах Windows також доступні такі атрибути:

source: Windows file attributes: ``dwFileAttributes`` member of the ``BY_HANDLE_FILE_INFORMATION`` structure returned by :c:func:`GetFileInformationByHandle`. See the ``FILE_ATTRIBUTE_*`` constants in the :mod:`stat` module.
uk: Атрибути файлів Windows: ``dwFileAttributes``, член структури ``BY_HANDLE_FILE_INFORMATION``, повернений :c:func:`GetFileInformationByHandle`. Перегляньте константи ``FILE_ATTRIBUTE_*`` в модулі :mod:`stat`.

source: When :attr:`st_file_attributes` has the ``FILE_ATTRIBUTE_REPARSE_POINT`` set, this field contains the tag identifying the type of reparse point. See the ``IO_REPARSE_TAG_*`` constants in the :mod:`stat` module.
uk: Якщо для :attr:`st_file_attributes` встановлено ``FILE_ATTRIBUTE_REPARSE_POINT``, це поле містить тег, що визначає тип точки повторного аналізу. Перегляньте константи ``IO_REPARSE_TAG_*`` в модулі :mod:`stat`.

source: The standard module :mod:`stat` defines functions and constants that are useful for extracting information from a :c:type:`stat` structure. (On Windows, some items are filled with dummy values.)
uk: Стандартний модуль :mod:`stat` визначає функції та константи, корисні для отримання інформації зі структури :c:type:`stat`. (У Windows деякі елементи заповнюються фіктивними значеннями.)

source: For backward compatibility, a :class:`stat_result` instance is also accessible as a tuple of at least 10 integers giving the most important (and portable) members of the :c:type:`stat` structure, in the order :attr:`st_mode`, :attr:`st_ino`, :attr:`st_dev`, :attr:`st_nlink`, :attr:`st_uid`, :attr:`st_gid`, :attr:`st_size`, :attr:`st_atime`, :attr:`st_mtime`, :attr:`st_ctime`. More items may be added at the end by some implementations. For compatibility with older Python versions, accessing :class:`stat_result` as a tuple always returns integers.
uk: Для зворотної сумісності екземпляр :class:`stat_result` також доступний як кортеж із принаймні 10 цілих чисел, що надає найважливіші (і переносні) члени структури :c:type:`stat` у порядку :attr:`st_mode`, :attr:`st_ino`, :attr:`st_dev`, :attr:`st_nlink`, :attr:`st_uid`, :attr:`st_gid`, :attr:`st_size`, :attr:`st_atime`, :attr:`st_mtime`, :attr:`st_ctime`. Інші елементи можуть бути додані в кінці в деяких реалізаціях. Для сумісності зі старими версіями Python доступ до :class:`stat_result` як кортежу завжди повертає цілі числа.

source: Added the :attr:`st_atime_ns`, :attr:`st_mtime_ns`, and :attr:`st_ctime_ns` members.
uk: Додано учасників :attr:`st_atime_ns`, :attr:`st_mtime_ns` і :attr:`st_ctime_ns`.

source: Added the :attr:`st_file_attributes` member on Windows.
uk: Додано член :attr:`st_file_attributes` у Windows.

source: Windows now returns the file index as :attr:`st_ino` when available.
ru: Windows теперь возвращает индекс файла как :attr:`st_ino` когда доступно.
uk: Тепер Windows повертає індекс файлу як :attr:`st_ino`, якщо він доступний.

source: Added the :attr:`st_fstype` member to Solaris/derivatives.
ru: Добавлен :attr:`st_fstype` член Solaris/производных.
uk: Додано член :attr:`st_fstype` до Solaris/derivatives.

source: Added the :attr:`st_reparse_tag` member on Windows.
ru: Добавлен :attr:`st_reparse_tag` участник в Windows.
uk: Додано член :attr:`st_reparse_tag` у Windows.

source: On Windows, the :attr:`st_mode` member now identifies special files as :const:`S_IFCHR`, :const:`S_IFIFO` or :const:`S_IFBLK` as appropriate.
ru: В Windows :attr:`st_mode` член теперь идентифицирует специальные файлы как :const:`S_IFCHR` , :const:`S_IFIFO` или :const:`S_IFBLK` по мере необходимости.
uk: У Windows член :attr:`st_mode` тепер ідентифікує спеціальні файли як :const:`S_IFCHR`, :const:`S_IFIFO` або :const:`S_IFBLK` відповідно.

source: Perform a :c:func:`statvfs` system call on the given path. The return value is an object whose attributes describe the filesystem on the given path, and correspond to the members of the :c:type:`statvfs` structure, namely: :attr:`f_bsize`, :attr:`f_frsize`, :attr:`f_blocks`, :attr:`f_bfree`, :attr:`f_bavail`, :attr:`f_files`, :attr:`f_ffree`, :attr:`f_favail`, :attr:`f_flag`, :attr:`f_namemax`, :attr:`f_fsid`.
uk: Виконайте системний виклик :c:func:`statvfs` за вказаним шляхом. Повернене значення — це об’єкт, атрибути якого описують файлову систему на заданому шляху та відповідають членам структури :c:type:`statvfs`, а саме: :attr:`f_bsize`, :attr:`f_frsize`, :attr:`f_blocks`, :attr:`f_bfree`, :attr:`f_bavail`, :attr:`f_files`, :attr:`f_ffree`, :attr:`f_favail`, :attr:`f_flag`, :attr:`f_namemax`, :attr:`f_fsid`.

source: Two module-level constants are defined for the :attr:`f_flag` attribute's bit-flags: if :const:`ST_RDONLY` is set, the filesystem is mounted read-only, and if :const:`ST_NOSUID` is set, the semantics of setuid/setgid bits are disabled or not supported.
ru: Две константы уровня модуля определены для :attr:`f_flag` битовые флаги атрибута: if :const:`ST_RDONLY` установлено, файловая система монтируется только для чтения, и если :const:`ST_NOSUID` установлен, семантика битов setuid/setgid отключена или не поддерживается.
uk: Для бітових прапорів атрибута :attr:`f_flag` визначено дві константи рівня модуля: якщо встановлено :const:`ST_RDONLY`, файлова система монтується лише для читання, а якщо встановлено :const:`ST_NOSUID`, семантика бітів setuid/setgid вимкнена або не підтримується.

source: Additional module-level constants are defined for GNU/glibc based systems. These are :const:`ST_NODEV` (disallow access to device special files), :const:`ST_NOEXEC` (disallow program execution), :const:`ST_SYNCHRONOUS` (writes are synced at once), :const:`ST_MANDLOCK` (allow mandatory locks on an FS), :const:`ST_WRITE` (write on file/directory/symlink), :const:`ST_APPEND` (append-only file), :const:`ST_IMMUTABLE` (immutable file), :const:`ST_NOATIME` (do not update access times), :const:`ST_NODIRATIME` (do not update directory access times), :const:`ST_RELATIME` (update atime relative to mtime/ctime).
ru: Дополнительные константы уровня модуля определены для систем на базе GNU/glibc. Это :const:`ST_NODEV` (запретить доступ к специальным файлам устройства), :const:`ST_NOEXEC` (запретить выполнение программы), :const:`ST_SYNCHRONOUS` (запись синхронизируется сразу), :const:`ST_MANDLOCK` (разрешить обязательные блокировки на ФС), :const:`ST_WRITE` (записать в файл/каталог/символическую ссылку), :const:`ST_APPEND` (файл только для добавления), :const:`ST_IMMUTABLE` (неизменяемый файл), :const:`ST_NOATIME` (не обновлять время доступа), :const:`ST_NODIRATIME` (не обновлять время доступа к каталогу), :const:`ST_RELATIME` (обновить время относительно mtime/ctime).
uk: Для систем на основі GNU/glibc визначено додаткові константи рівня модуля. Це :const:`ST_NODEV` (заборона доступу до спеціальних файлів пристрою), :const:`ST_NOEXEC` (заборона виконання програми), :const:`ST_SYNCHRONOUS` (записи синхронізуються одночасно), :const:`ST_MANDLOCK` ( дозволити обов’язкове блокування FS), :const:`ST_WRITE` (запис у файл/каталог/символне посилання), :const:`ST_APPEND` (файл лише для додавання), :const:`ST_IMMUTABLE` (незмінний файл), :const:`ST_NOATIME` (не оновлювати час доступу), :const:`ST_NODIRATIME` (не оновлювати час доступу до каталогу), :const:`ST_RELATIME` (оновлювати atime відносно mtime/ctime).

source: The :const:`ST_RDONLY` and :const:`ST_NOSUID` constants were added.
ru: The :const:`ST_RDONLY` и :const:`ST_NOSUID` были добавлены константы.
uk: Додано константи :const:`ST_RDONLY` і :const:`ST_NOSUID`.

source: The :const:`ST_NODEV`, :const:`ST_NOEXEC`, :const:`ST_SYNCHRONOUS`, :const:`ST_MANDLOCK`, :const:`ST_WRITE`, :const:`ST_APPEND`, :const:`ST_IMMUTABLE`, :const:`ST_NOATIME`, :const:`ST_NODIRATIME`, and :const:`ST_RELATIME` constants were added.
ru: The :const:`ST_NODEV` , :const:`ST_NOEXEC` , :const:`ST_SYNCHRONOUS` , :const:`ST_MANDLOCK` , :const:`ST_WRITE` , :const:`ST_APPEND` , :const:`ST_IMMUTABLE` , :const:`ST_NOATIME` , :const:`ST_NODIRATIME` , и :const:`ST_RELATIME` были добавлены константы.
uk: :const:`ST_NODEV`, :const:`ST_NOEXEC`, :const:`ST_SYNCHRONOUS`, :const:`ST_MANDLOCK`, :const:`ST_WRITE`, :const:`ST_APPEND`, :const:`ST_IMMUTABLE`, Додано константи :const:`ST_NOATIME`, :const:`ST_NODIRATIME` і :const:`ST_RELATIME`.

source: Added :attr:`f_fsid`.
ru: Добавлено :attr:`f_fsid`.
uk: Додано :attr:`f_fsid`.

source: A :class:`set` object indicating which functions in the :mod:`os` module accept an open file descriptor for their *dir_fd* parameter. Different platforms provide different features, and the underlying functionality Python uses to implement the *dir_fd* parameter is not available on all platforms Python supports. For consistency's sake, functions that may support *dir_fd* always allow specifying the parameter, but will throw an exception if the functionality is used when it's not locally available. (Specifying ``None`` for *dir_fd* is always supported on all platforms.)
ru: А :класс:`набор` объект, указывающий, какие функции в :против:`нас` модуль принимает дескриптор открытого файла в качестве параметра *dir_fd*. Различные платформы предоставляют разные функции, а базовая функциональность, которую Python использует для реализации параметра *dir_fd*, доступна не на всех платформах, которые поддерживает Python. В целях единообразия функции, которые могут поддерживать *dir_fd*, всегда позволяют указывать параметр, но выдают исключение, если функция используется, когда она недоступна локально. (Указание ``Нет`` for *dir_fd* всегда поддерживается на всех платформах.)
uk: Об’єкт :class:`set`, що вказує, які функції в модулі :mod:`os` приймають дескриптор відкритого файлу для свого параметра *dir_fd*. Різні платформи надають різні функції, а основні функції, які Python використовує для реалізації параметра *dir_fd*, доступні не на всіх платформах, які підтримує Python. Заради узгодженості функції, які можуть підтримувати *dir_fd*, завжди дозволяють вказати параметр, але створять виняток, якщо функція використовується, коли вона недоступна локально. (Визначення ``None`` для *dir_fd* завжди підтримується на всіх платформах.)

source: To check whether a particular function accepts an open file descriptor for its *dir_fd* parameter, use the ``in`` operator on ``supports_dir_fd``. As an example, this expression evaluates to ``True`` if :func:`os.stat` accepts open file descriptors for *dir_fd* on the local platform::
ru: Чтобы проверить, принимает ли конкретная функция дескриптор открытого файла для своего параметра *dir_fd*, используйте команду ``в`` оператор на ``supports_dir_fd`` . Например, это выражение имеет значение ``Правда`` если :func:`os.stat` принимает дескрипторы открытых файлов для *dir_fd* на локальной платформе::
uk: Щоб перевірити, чи певна функція приймає дескриптор відкритого файлу для свого параметра *dir_fd*, використовуйте оператор ``in`` на ``supports_dir_fd``. Як приклад, цей вираз оцінюється як ``True``, якщо :func:`os.stat` приймає дескриптори відкритих файлів для *dir_fd* на локальній платформі::

source: Currently *dir_fd* parameters only work on Unix platforms; none of them work on Windows.
ru: В настоящее время параметры *dir_fd* работают только на платформах Unix; ни один из них не работает в Windows.
uk: Наразі параметри *dir_fd* працюють лише на платформах Unix; жоден з них не працює в Windows.

source: A :class:`set` object indicating whether :func:`os.access` permits specifying ``True`` for its *effective_ids* parameter on the local platform. (Specifying ``False`` for *effective_ids* is always supported on all platforms.) If the local platform supports it, the collection will contain :func:`os.access`; otherwise it will be empty.
ru: А :класс:`набор` объект, указывающий, есть ли :func:`os.access` разрешает указывать ``Правда`` для параметра *efficient_ids* на локальной платформе. (Указание ``Ложь`` for *efficient_ids* всегда поддерживается на всех платформах.) Если локальная платформа поддерживает это, коллекция будет содержать :func:`os.access` ; в противном случае оно будет пустым.
uk: Об’єкт :class:`set`, що вказує, чи дозволяє :func:`os.access` вказувати ``True`` для свого параметра *effective_ids* на локальній платформі. (Вказівка ``False`` для *effective_ids* завжди підтримується на всіх платформах.) Якщо локальна платформа підтримує це, колекція міститиме :func:`os.access`; інакше воно буде порожнім.

source: This expression evaluates to ``True`` if :func:`os.access` supports ``effective_ids=True`` on the local platform::
ru: Это выражение оценивается как ``Правда`` если :func:`os.access` поддерживает ``efficient_ids=True`` на локальной платформе::
uk: Цей вираз оцінюється як ``True``, якщо :func:`os.access` підтримує ``effective_ids=True`` на локальній платформі::

source: Currently *effective_ids* is only supported on Unix platforms; it does not work on Windows.
ru: В настоящее время *efficient_ids* поддерживается только на платформах Unix; он не работает в Windows.
uk: Наразі *effective_ids* підтримується лише на платформах Unix; це не працює в Windows.

source: A :class:`set` object indicating which functions in the :mod:`os` module permit specifying their *path* parameter as an open file descriptor on the local platform. Different platforms provide different features, and the underlying functionality Python uses to accept open file descriptors as *path* arguments is not available on all platforms Python supports.
ru: А :класс:`набор` объект, указывающий, какие функции в :против:`нас` модуль позволяет указать параметр *path* как дескриптор открытого файла на локальной платформе. Различные платформы предоставляют разные функции, а базовая функциональность, которую Python использует для принятия дескрипторов открытых файлов в качестве аргументов *path*, доступна не на всех платформах, которые поддерживает Python.
uk: Об’єкт :class:`set`, що вказує, які функції в модулі :mod:`os` дозволяють вказувати свій параметр *path* як дескриптор відкритого файлу на локальній платформі. Різні платформи надають різні функції, а основні функції, які Python використовує для прийняття відкритих файлових дескрипторів як *шлях* аргументів, доступні не на всіх платформах, які підтримує Python.

source: To determine whether a particular function permits specifying an open file descriptor for its *path* parameter, use the ``in`` operator on ``supports_fd``. As an example, this expression evaluates to ``True`` if :func:`os.chdir` accepts open file descriptors for *path* on your local platform::
ru: Чтобы определить, позволяет ли конкретная функция указывать дескриптор открытого файла для своего параметра *path*, используйте команду ``в`` оператор на ``support_fd`` . Например, это выражение имеет значение ``Правда`` если :func:`os.chdir` принимает дескрипторы открытых файлов для *path* на вашей локальной платформе::
uk: Щоб визначити, чи дозволяє певна функція вказувати дескриптор відкритого файлу для свого параметра *path*, використовуйте оператор ``in`` на ``supports_fd``. Як приклад, цей вираз має значення ``True``, якщо :func:`os.chdir` приймає дескриптори відкритих файлів для *path* на вашій локальній платформі::

source: A :class:`set` object indicating which functions in the :mod:`os` module accept ``False`` for their *follow_symlinks* parameter on the local platform. Different platforms provide different features, and the underlying functionality Python uses to implement *follow_symlinks* is not available on all platforms Python supports. For consistency's sake, functions that may support *follow_symlinks* always allow specifying the parameter, but will throw an exception if the functionality is used when it's not locally available. (Specifying ``True`` for *follow_symlinks* is always supported on all platforms.)
ru: А :класс:`набор` объект, указывающий, какие функции в :против:`нас` модуль принимает ``Ложь`` для параметра *follow_symlinks* на локальной платформе. Различные платформы предоставляют разные функции, а базовая функциональность, которую Python использует для реализации *follow_symlinks*, доступна не на всех платформах, которые поддерживает Python. В целях единообразия функции, которые могут поддерживать *follow_symlinks*, всегда позволяют указывать параметр, но выдают исключение, если функция используется, когда она недоступна локально. (Указание ``Правда`` for *follow_symlinks* всегда поддерживается на всех платформах.)
uk: Об’єкт :class:`set`, що вказує, які функції в модулі :mod:`os` приймають ``False`` для свого параметра *follow_symlinks* на локальній платформі. Різні платформи надають різні функції, а основні функції, які Python використовує для реалізації *follow_symlinks*, доступні не на всіх платформах, які підтримує Python. Заради узгодженості функції, які можуть підтримувати *follow_symlinks*, завжди дозволяють вказувати параметр, але викидають виняток, якщо функція використовується, коли вона недоступна локально. (Вказівка ``True`` для *follow_symlinks* завжди підтримується на всіх платформах.)

source: To check whether a particular function accepts ``False`` for its *follow_symlinks* parameter, use the ``in`` operator on ``supports_follow_symlinks``. As an example, this expression evaluates to ``True`` if you may specify ``follow_symlinks=False`` when calling :func:`os.stat` on the local platform::
ru: Чтобы проверить, принимает ли конкретная функция ``Ложь`` для параметра *follow_symlinks* используйте ``в`` оператор на ``support_follow_symlinks`` . Например, это выражение имеет значение ``Правда`` если вы можете указать ``follow_symlinks=False`` при звонке :func:`os.stat` на локальной платформе::
uk: Щоб перевірити, чи певна функція приймає ``False`` для свого параметра *follow_symlinks*, використовуйте оператор ``in`` у ``supports_follow_symlinks``. Як приклад, цей вираз має значення ``True``, якщо ви можете вказати ``follow_symlinks=False`` під час виклику :func:`os.stat` на локальній платформі::

source: Create a symbolic link pointing to *src* named *dst*.
ru: Создайте символическую ссылку, указывающую на *src* с именем *dst*.
uk: Створіть символічне посилання на *src* під назвою *dst*.

source: On Windows, a symlink represents either a file or a directory, and does not morph to the target dynamically. If the target is present, the type of the symlink will be created to match. Otherwise, the symlink will be created as a directory if *target_is_directory* is ``True`` or a file symlink (the default) otherwise. On non-Windows platforms, *target_is_directory* is ignored.
ru: В Windows символическая ссылка представляет либо файл, либо каталог и не преобразуется в цель динамически. Если цель присутствует, тип символической ссылки будет создан соответствующий. В противном случае символическая ссылка будет создана как каталог, если *target_is_directory* имеет значение. ``Правда`` или символическую ссылку на файл (по умолчанию) в противном случае. На платформах, отличных от Windows, *target_is_directory* игнорируется.
uk: У Windows символічне посилання представляє або файл, або каталог і не перетворюється на ціль динамічно. Якщо ціль присутня, буде створено відповідний тип символічного посилання. В іншому випадку символічне посилання буде створено як каталог, якщо *target_is_directory* має значення ``True``, або символічне посилання на файл (за замовчуванням), інакше. На платформах, відмінних від Windows, *target_is_directory* ігнорується.

source: On newer versions of Windows 10, unprivileged accounts can create symlinks if Developer Mode is enabled. When Developer Mode is not available/enabled, the *SeCreateSymbolicLinkPrivilege* privilege is required, or the process must be run as an administrator.
ru: В более новых версиях Windows 10 непривилегированные учетные записи могут создавать символические ссылки, если включен режим разработчика. Если режим разработчика недоступен/включен, требуется привилегия *SeCreateSymbolicLinkPrivilege* или процесс необходимо запускать от имени администратора.
uk: У новіших версіях Windows 10 непривілейовані облікові записи можуть створювати символічні посилання, якщо ввімкнено режим розробника. Якщо режим розробника недоступний/увімкнено, потрібен привілей *SeCreateSymbolicLinkPrivilege*, або процес потрібно запускати від імені адміністратора.

source: :exc:`OSError` is raised when the function is called by an unprivileged user.
ru: :exc:`OSError` возникает, когда функция вызывается непривилегированным пользователем.
uk: :exc:`OSError` виникає, коли функцію викликає непривілейований користувач.

source: Raises an :ref:`auditing event <auditing>` ``os.symlink`` with arguments ``src``, ``dst``, ``dir_fd``.
ru: Вызывает :ref:`событие аудита ` ``os.symlink`` с аргументами ``источник`` , ``летнее время`` , ``dir_fd`` .
uk: Викликає :ref:`подію аудиту <auditing>` ``os.symlink`` з аргументами ``src``, ``dst``, ``dir_fd``.

source: Added the *dir_fd* argument, and now allow *target_is_directory* on non-Windows platforms.
uk: Додано аргумент *dir_fd* і тепер дозволено *target_is_directory* на платформах, відмінних від Windows.

source: Added support for unelevated symlinks on Windows with Developer Mode.
ru: Добавлена ​​поддержка символических ссылок без повышенных прав в Windows в режиме разработчика.
uk: Додано підтримку непідвищених символічних посилань у Windows із режимом розробника.

source: Force write of everything to disk.
ru: Принудительная запись всего на диск.
uk: Примусово записувати все на диск.

source: Truncate the file corresponding to *path*, so that it is at most *length* bytes in size.
ru: Усеките файл, соответствующий *path*, чтобы его размер не превышал *length* байт.
uk: Обріжте файл, що відповідає *шляху*, щоб його розмір не перевищував *length* байтів.

source: Raises an :ref:`auditing event <auditing>` ``os.truncate`` with arguments ``path``, ``length``.
ru: Вызывает :ref:`событие аудита ` ``os.truncate`` с аргументами ``путь`` , ``длина`` .
uk: Викликає :ref:`подію аудиту <auditing>` ``os.truncate`` з аргументами ``path``, ``length``.

source: Remove (delete) the file *path*. This function is semantically identical to :func:`remove`; the ``unlink`` name is its traditional Unix name. Please see the documentation for :func:`remove` for further information.
ru: Удалить (удалить) файл *путь*. Эта функция семантически идентична :func:`удалить` ; тот ``отсоединить`` name — это традиционное имя Unix. Пожалуйста, ознакомьтесь с документацией для :func:`удалить` для получения дополнительной информации.
uk: Видалити (видалити) *шлях* до файлу. Ця функція семантично ідентична :func:`remove`; ім'я ``unlink`` є його традиційною назвою Unix. Будь ласка, перегляньте документацію для :func:`remove` для отримання додаткової інформації.

source: Set the access and modified times of the file specified by *path*.
ru: Установите время доступа и изменения файла, указанного *path*.
uk: Встановіть час доступу та час зміни файлу, указаного *шляхом*.
