Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/os.path.po
Languages: ru

source: Return the canonical path of the specified filename, eliminating any symbolic links encountered in the path (if they are supported by the operating system). On Windows, this function will also resolve MS-DOS (also called 8.3) style names such as ``C:\\PROGRA~1`` to ``C:\\Program Files``.
ru: Возвращает канонический путь к указанному имени файла, удаляя все символические ссылки, встречающиеся в пути (если они поддерживаются операционной системой). В Windows эта функция также преобразует имена стилей MS-DOS (также называемые 8.3), такие как ``C:\\PROGRA~1``, в ``C:\\Program Files``.

source: If a path doesn't exist or a symlink loop is encountered, and *strict* is ``True``, :exc:`OSError` is raised. If *strict* is ``False`` these errors are ignored, and so the result might be missing or otherwise inaccessible.
ru: Если путь не существует или обнаружен цикл символической ссылки, а *strict* имеет значение True, возникает :exc:`OSError`. Если *strict* имеет значение False, эти ошибки игнорируются, поэтому результат может отсутствовать или быть недоступен по какой-либо другой причине.

source: This function emulates the operating system's procedure for making a path canonical, which differs slightly between Windows and UNIX with respect to how links and subsequent path components interact.
ru: Эта функция эмулирует процедуру операционной системы для создания канонического пути, которая немного отличается в Windows и UNIX в отношении взаимодействия ссылок и последующих компонентов пути.

source: Operating system APIs make paths canonical as needed, so it's not normally necessary to call this function.
ru: API-интерфейсы операционной системы при необходимости делают пути каноническими, поэтому обычно нет необходимости вызывать эту функцию.

source: Symbolic links and junctions are now resolved on Windows.
ru: Символические ссылки и соединения теперь разрешаются в Windows.

source: The *strict* parameter was added.
ru: Добавлен параметр *strict*.

source: Return a relative filepath to *path* either from the current directory or from an optional *start* directory. This is a path computation: the filesystem is not accessed to confirm the existence or nature of *path* or *start*. On Windows, :exc:`ValueError` is raised when *path* and *start* are on different drives.
ru: Возвращает относительный путь к файлу *path* либо из текущего каталога, либо из дополнительного *начального* каталога. Это вычисление пути: к файловой системе не осуществляется доступ для подтверждения существования или природы *path* или *start*. В Windows :exc:`ValueError` возникает, когда *path* и *start* находятся на разных дисках.

source: *start* defaults to :data:`os.curdir`.
ru: *start* по умолчанию имеет значение :data:`os.curdir`.

source: Return ``True`` if both pathname arguments refer to the same file or directory. This is determined by the device number and i-node number and raises an exception if an :func:`os.stat` call on either pathname fails.
ru: Верните True, если оба аргумента пути относятся к одному и тому же файлу или каталогу. Это определяется номером устройства и номером i-узла и вызывает исключение, если вызов :func:`os.stat` по любому пути завершается неудачно.

source: Added Windows support.
ru: Добавлена поддержка Windows.

source: Windows now uses the same implementation as all other platforms.
ru: Windows теперь использует ту же реализацию, что и все другие платформы.

source: Return ``True`` if the file descriptors *fp1* and *fp2* refer to the same file.
ru: Возвращайте ``True``, если файловые дескрипторы *fp1* и *fp2* относятся к одному и тому же файлу.

source: Return ``True`` if the stat tuples *stat1* and *stat2* refer to the same file. These structures may have been returned by :func:`os.fstat`, :func:`os.lstat`, or :func:`os.stat`. This function implements the underlying comparison used by :func:`samefile` and :func:`sameopenfile`.
ru: Верните True, если кортежи статистики *stat1* и *stat2* относятся к одному и тому же файлу. Эти структуры могли быть возвращены функциями :func:`os.fstat`, :func:`os.lstat` или :func:`os.stat`. Эта функция реализует базовое сравнение, используемое :func:`samefile` и :func:`sameopenfile`.

source: Split the pathname *path* into a pair, ``(head, tail)`` where *tail* is the last pathname component and *head* is everything leading up to that. The *tail* part will never contain a slash; if *path* ends in a slash, *tail* will be empty. If there is no slash in *path*, *head* will be empty. If *path* is empty, both *head* and *tail* are empty. Trailing slashes are stripped from *head* unless it is the root (one or more slashes only). In all cases, ``join(head, tail)`` returns a path to the same location as *path* (but the strings may differ). Also see the functions :func:`dirname` and :func:`basename`.
ru: Разделите путь *path* на пару ``(head, Tail)``, где *tail* — это последний компонент пути, а *head* — все, что к нему ведет. Часть *хвост* никогда не будет содержать косую черту; если *path* заканчивается косой чертой, *tail* будет пустым. Если в *path* нет косой черты, *head* будет пустым. Если *path* пуст, *head* и *tail* пусты. Конечные косые черты удаляются из *head*, если только это не корень (только одна или несколько косых черт). Во всех случаях ``join(head, Tail)`` возвращает путь к тому же местоположению, что и *path* (но строки могут отличаться). Также см. функции :func:`dirname` и :func:`basename`.

source: Split the pathname *path* into a pair ``(drive, tail)`` where *drive* is either a mount point or the empty string. On systems which do not use drive specifications, *drive* will always be the empty string. In all cases, ``drive + tail`` will be the same as *path*.
ru: Разделите путь *path* на пару ``(диск, хвост)``, где *диск* — это либо точка монтирования, либо пустая строка. В системах, которые не используют спецификации дисков, *диск* всегда будет пустой строкой. Во всех случаях ``drive + Tail`` будет таким же, как *path*.

source: On Windows, splits a pathname into drive/UNC sharepoint and relative path.
ru: В Windows разделяет путь на диск/точку доступа UNC и относительный путь.

source: If the path contains a drive letter, drive will contain everything up to and including the colon::
ru: Если путь содержит букву диска, диск будет содержать все, включая двоеточие::

source: If the path contains a UNC path, drive will contain the host name and share::
ru: Если путь содержит путь UNC, диск будет содержать имя хоста и общий ресурс::

source: Split the pathname *path* into a 3-item tuple ``(drive, root, tail)`` where *drive* is a device name or mount point, *root* is a string of separators after the drive, and *tail* is everything after the root. Any of these items may be the empty string. In all cases, ``drive + root + tail`` will be the same as *path*.
ru: Разделите имя пути *path* на кортеж из трех элементов ``(диск, корень, хвост)``, где *диск* — это имя устройства или точка монтирования, *root* — это строка разделителей после диска, а *tail * это все после рута. Любой из этих элементов может быть пустой строкой. Во всех случаях ``диск + корень + хвост`` будет таким же, как *path*.

source: On POSIX systems, *drive* is always empty. The *root* may be empty (if *path* is relative), a single forward slash (if *path* is absolute), or two forward slashes (implementation-defined per `IEEE Std 1003.1-2017; 4.13 Pathname Resolution <https://pubs.opengroup.org/onlinepubs/9699919799/basedefs/V1_chap04.html#tag_04_13>`_.) For example::
ru: В системах POSIX *диск* всегда пуст. *Корень* может быть пустым (если *путь* является относительным), одной косой чертой (если *путь* является абсолютным) или двумя косыми чертами (определяется реализацией согласно `IEEE Std 1003.1-2017; 4.13 Разрешение пути <https) ://pubs.opengroup.org/onlinepubs/9699919799/basedefs/V1_chap04.html#tag_04_13>`_.) Например::

source: On Windows, *drive* may be empty, a drive-letter name, a UNC share, or a device name. The *root* may be empty, a forward slash, or a backward slash. For example::
ru: В Windows *диск* может быть пустым, это может быть имя диска, общий ресурс UNC или имя устройства. *Корень* может быть пустым, может быть прямой или обратной косой чертой. Например::

source: Split the pathname *path* into a pair ``(root, ext)`` such that ``root + ext == path``, and the extension, *ext*, is empty or begins with a period and contains at most one period.
ru: Разделите имя пути *path* на пару ``(root, ext)`` так, чтобы ``root + ext == path``, а расширение *ext* было пустым или начиналось с точки и содержало не более один период.

source: If the path contains no extension, *ext* will be ``''``::
ru: Если путь не содержит расширения, *ext* будет ``''``::

source: If the path contains an extension, then *ext* will be set to this extension, including the leading period. Note that previous periods will be ignored::
ru: Если путь содержит расширение, то *ext* будет установлено для этого расширения, включая начальную точку. Обратите внимание, что предыдущие периоды будут игнорироваться::

source: Leading periods of the last component of the path are considered to be part of the root::
ru: Ведущие периоды последней компоненты пути считаются частью корня:

source: ``True`` if arbitrary Unicode strings can be used as file names (within limitations imposed by the file system).
ru: ``True``, если в качестве имен файлов можно использовать произвольные строки Unicode (в пределах ограничений, налагаемых файловой системой).

source: path
ru: путь

source: operations
ru: операции

source: ~ (tilde)
ru: ~ (тильда)

source: home directory expansion
ru: расширение домашнего каталога

source: module
ru: модуль

source: $ (dollar)
ru: $ (доллар)

source: environment variables expansion
ru: расширение переменных среды

source: % (percent)
ru: % (процент)

source: environment variables expansion (Windows)
ru: расширение переменных среды (Windows)
