Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/os.po
Languages: ru, uk

source: :func:`utime` takes two optional parameters, *times* and *ns*. These specify the times set on *path* and are used as follows:
ru: :func:`отлично` принимает два необязательных параметра: *times* и *ns*. Они определяют время, установленное в *path*, и используются следующим образом:
uk: :func:`utime` приймає два необов’язкові параметри, *times* і *ns*. Вони вказують час, встановлений на *path* і використовуються таким чином:

source: If *ns* is specified, it must be a 2-tuple of the form ``(atime_ns, mtime_ns)`` where each member is an int expressing nanoseconds.
ru: Если указано *ns*, это должен быть кортеж из двух форм ``(atime_ns, mtime_ns)`` где каждый член представляет собой целое число, выражающее наносекунды.
uk: Якщо вказано *ns*, це має бути 2-кортеж у формі ``(atime_ns, mtime_ns)``, де кожен член є int, що виражає наносекунди.

source: If *times* is not ``None``, it must be a 2-tuple of the form ``(atime, mtime)`` where each member is an int or float expressing seconds.
ru: Если *раз* нет ``Нет`` , это должен быть кортеж из двух форм ``(время, мвремя)`` где каждый член представляет собой целое число или число с плавающей запятой, выражающее секунды.
uk: Якщо *times* не є ``None``, це має бути 2-кортеж у формі ``(atime, mtime)``, де кожен член є int або float, що виражає секунди.

source: If *times* is ``None`` and *ns* is unspecified, this is equivalent to specifying ``ns=(atime_ns, mtime_ns)`` where both times are the current time.
ru: Если *раз* ``Нет`` и *ns* не указано, это эквивалентно указанию ``ns=(atime_ns, mtime_ns)`` где оба времени являются текущим временем.
uk: Якщо *times* має значення ``None`` і *ns* не вказано, це еквівалентно вказівці ``ns=(atime_ns, mtime_ns)``, де обидва часи є поточним часом.

source: It is an error to specify tuples for both *times* and *ns*.
ru: Указание кортежей для *times* и *ns* является ошибкой.
uk: Помилково вказувати кортежі як для *times*, так і для *ns*.

source: Note that the exact times you set here may not be returned by a subsequent :func:`~os.stat` call, depending on the resolution with which your operating system records access and modification times; see :func:`~os.stat`. The best way to preserve exact times is to use the *st_atime_ns* and *st_mtime_ns* fields from the :func:`os.stat` result object with the *ns* parameter to `utime`.
uk: Зауважте, що точний час, який ви встановили тут, може не повертатися наступним викликом :func:`~os.stat`, залежно від роздільної здатності, з якою ваша операційна система записує час доступу та модифікації; див. :func:`~os.stat`. Найкращий спосіб зберегти точний час — використовувати поля *st_atime_ns* і *st_mtime_ns* з об’єкта результату :func:`os.stat` із параметром *ns* для `utime`.

source: Raises an :ref:`auditing event <auditing>` ``os.utime`` with arguments ``path``, ``times``, ``ns``, ``dir_fd``.
ru: Вызывает :ref:`событие аудита ` ``os.utime`` с аргументами ``путь`` , ``раз`` , ``нс`` , ``dir_fd`` .
uk: Викликає :ref:`подію аудиту <auditing>` ``os.utime`` з аргументами ``path``, ``times``, ``ns``, ``dir_fd``.

source: Added support for specifying *path* as an open file descriptor, and the *dir_fd*, *follow_symlinks*, and *ns* parameters.
ru: Добавлена ​​поддержка указания *path* в качестве дескриптора открытого файла, а также параметров *dir_fd*, *follow_symlinks* и *ns*.
uk: Додано підтримку для вказівки *шляху* як дескриптора відкритого файлу та параметрів *dir_fd*, *follow_symlinks* і *ns*.

source: Generate the file names in a directory tree by walking the tree either top-down or bottom-up. For each directory in the tree rooted at directory *top* (including *top* itself), it yields a 3-tuple ``(dirpath, dirnames, filenames)``.
ru: Сгенерируйте имена файлов в дереве каталогов, обходя дерево сверху вниз или снизу вверх. Для каждого каталога в дереве, корнем которого является каталог *top* (включая сам *top*), получается трехкортеж ``(каталог, имена каталогов, имена файлов)`` .
uk: Згенеруйте імена файлів у дереві каталогів, проходячи по дереву зверху вниз або знизу вгору. Для кожного каталогу в дереві, що знаходиться в каталозі *top* (включно з самим *top*), він дає 3-кортеж ``(dirpath, dirnames, filenames)``.

source: *dirpath* is a string, the path to the directory. *dirnames* is a list of the names of the subdirectories in *dirpath* (excluding ``'.'`` and ``'..'``). *filenames* is a list of the names of the non-directory files in *dirpath*. Note that the names in the lists contain no path components. To get a full path (which begins with *top*) to a file or directory in *dirpath*, do ``os.path.join(dirpath, name)``. Whether or not the lists are sorted depends on the file system. If a file is removed from or added to the *dirpath* directory during generating the lists, whether a name for that file be included is unspecified.
uk: *dirpath* — це рядок, шлях до каталогу. *dirnames* — це список імен підкаталогів у *dirpath* (за винятком ``'.''`` і ``'..''``). *filenaname* — це список імен файлів, які не є каталогами, у *dirpath*. Зауважте, що імена в списках не містять компонентів шляху. Щоб отримати повний шлях (який починається з *top*) до файлу або каталогу в *dirpath*, виконайте ``os.path.join(dirpath, name)``. Сортування списків залежить від файлової системи. Якщо файл видаляється або додається до каталогу *dirpath* під час генерації списків, не вказано, чи буде включено ім’я цього файлу.

source: If optional argument *topdown* is ``True`` or not specified, the triple for a directory is generated before the triples for any of its subdirectories (directories are generated top-down). If *topdown* is ``False``, the triple for a directory is generated after the triples for all of its subdirectories (directories are generated bottom-up). No matter the value of *topdown*, the list of subdirectories is retrieved before the tuples for the directory and its subdirectories are generated.
ru: Если необязательный аргумент *topdown* равен ``Правда`` или не указано, тройка для каталога генерируется раньше троек для любого из его подкаталогов (каталоги генерируются сверху вниз). Если *сверху вниз* ``Ложь`` , тройка для каталога генерируется после троек для всех его подкаталогов (каталоги генерируются снизу вверх). Независимо от значения *topdown*, список подкаталогов извлекается до того, как будут сгенерированы кортежи для каталога и его подкаталогов.
uk: Якщо необов’язковий аргумент *topdown* має значення ``True`` або не вказано, трійка для каталогу генерується перед потрійками для будь-якого з його підкаталогів (каталоги генеруються зверху вниз). Якщо *topdown* має значення ``False``, трійка для каталогу генерується після трійок для всіх його підкаталогів (каталоги генеруються знизу вгору). Незалежно від значення *topdown*, список підкаталогів витягується до створення кортежів для каталогу та його підкаталогів.

source: When *topdown* is ``True``, the caller can modify the *dirnames* list in-place (perhaps using :keyword:`del` or slice assignment), and :func:`walk` will only recurse into the subdirectories whose names remain in *dirnames*; this can be used to prune the search, impose a specific order of visiting, or even to inform :func:`walk` about directories the caller creates or renames before it resumes :func:`walk` again. Modifying *dirnames* when *topdown* is ``False`` has no effect on the behavior of the walk, because in bottom-up mode the directories in *dirnames* are generated before *dirpath* itself is generated.
ru: Когда *сверху вниз* ``Правда`` , вызывающий абонент может изменить список *dirnames* на месте (возможно, используя :keyword:`дел` или назначение среза), и :func:`прогулка` будет рекурсивно обращаться только к подкаталогам, имена которых остаются в *dirnames*; это можно использовать для ограничения поиска, установления определенного порядка посещения или даже для информирования :func:`прогулка` о каталогах, которые вызывающий абонент создает или переименовывает перед возобновлением работы :func:`прогулка` снова. Изменение *dirnames*, когда *topdown* ``Ложь`` не влияет на поведение обхода, поскольку в восходящем режиме каталоги в *dirnames* генерируются до создания самого *dirpath*.
uk: Коли *topdown* має значення ``True``, абонент може змінювати список *dirnames* на місці (можливо, використовуючи :keyword:`del` або призначення фрагментів), а :func:`walk` повертатиметься лише до підкаталогів чиї імена залишаються в *dirnames*; це можна використовувати для скорочення пошуку, встановлення певного порядку відвідування або навіть для інформування :func:`walk` про каталоги, які абонент створює або перейменовує перед тим, як він знову продовжить :func:`walk`. Зміна *dirnames*, коли *topdown* має значення ``False``, не впливає на поведінку обходу, тому що в режимі знизу вгору каталоги в *dirnames* генеруються до того, як буде згенеровано сам *dirpath*.

source: By default, errors from the :func:`scandir` call are ignored. If optional argument *onerror* is specified, it should be a function; it will be called with one argument, an :exc:`OSError` instance. It can report the error to continue with the walk, or raise the exception to abort the walk. Note that the filename is available as the ``filename`` attribute of the exception object.
ru: По умолчанию ошибки из :func:`скандир` вызов игнорируются. Если указан необязательный аргумент *onerror*, это должна быть функция; он будет вызываться с одним аргументом, :exc:`OSError` пример. Он может сообщить об ошибке, чтобы продолжить обход, или вызвать исключение, чтобы прервать обход. Обратите внимание, что имя файла доступно как ``имя файла`` атрибут объекта исключения.
uk: За замовчуванням помилки виклику :func:`scandir` ігноруються. Якщо вказано необов’язковий аргумент *onerror*, це має бути функція; він буде викликаний з одним аргументом, екземпляром :exc:`OSError`. Він може повідомити про помилку, щоб продовжити обхід, або викликати виключення, щоб перервати обхід. Зауважте, що назва файлу доступна як атрибут ``filename`` об’єкта винятку.

source: By default, :func:`walk` will not walk down into symbolic links that resolve to directories. Set *followlinks* to ``True`` to visit directories pointed to by symlinks, on systems that support them.
ru: По умолчанию, :func:`прогулка` не будет переходить к символическим ссылкам, ведущим к каталогам. Установите *followlinks* на ``Правда`` для посещения каталогов, на которые указывают символические ссылки, в системах, которые их поддерживают.
uk: За замовчуванням :func:`walk` не переходитиме до символічних посилань, які переходять до каталогів. Встановіть *followlinks* на ``True``, щоб відвідувати каталоги, на які вказують символічні посилання, у системах, які їх підтримують.

source: Be aware that setting *followlinks* to ``True`` can lead to infinite recursion if a link points to a parent directory of itself. :func:`walk` does not keep track of the directories it visited already.
ru: Имейте в виду, что для параметра *followlinks* установлено значение ``Правда`` может привести к бесконечной рекурсии, если ссылка указывает на собственный родительский каталог. :func:`прогулка` не отслеживает каталоги, которые он уже посетил.
uk: Майте на увазі, що встановлення *followlinks* значення ``True`` може призвести до нескінченної рекурсії, якщо посилання вказує на батьківський каталог самого себе. :func:`walk` не відстежує каталоги, які він уже відвідав.

source: If you pass a relative pathname, don't change the current working directory between resumptions of :func:`walk`. :func:`walk` never changes the current directory, and assumes that its caller doesn't either.
ru: Если вы передаете относительный путь, не меняйте текущий рабочий каталог между возобновлениями :func:`прогулка` . :func:`прогулка` никогда не меняет текущий каталог и предполагает, что вызывающая сторона тоже этого не делает.
uk: Якщо ви передаєте відносний шлях, не змінюйте поточний робочий каталог між відновленням :func:`walk`. :func:`walk` ніколи не змінює поточний каталог і припускає, що його виклик теж не змінює.

source: This example displays the number of bytes taken by non-directory files in each directory under the starting directory, except that it doesn't look under any CVS subdirectory::
ru: В этом примере отображается количество байтов, занимаемых файлами, не являющимися каталогами, в каждом каталоге начального каталога, за исключением того, что он не просматривается ни в одном подкаталоге CVS::
uk: У цьому прикладі показано кількість байтів, зайнятих файлами, що не є каталогами, у кожному каталозі в початковому каталозі, за винятком того, що він не шукає підкаталог CVS::

source: In the next example (simple implementation of :func:`shutil.rmtree`), walking the tree bottom-up is essential, :func:`rmdir` doesn't allow deleting a directory before the directory is empty::
ru: В следующем примере (простая реализация :func:`shutil.rmtree` ), важно пройти по дереву снизу вверх, :func:`rmdir` не позволяет удалить каталог, пока каталог не станет пустым::
uk: У наступному прикладі (проста реалізація :func:`shutil.rmtree`) важливий перехід по дереву знизу вгору, :func:`rmdir` не дозволяє видаляти каталог, поки він не стане порожнім::

source: Raises an :ref:`auditing event <auditing>` ``os.walk`` with arguments ``top``, ``topdown``, ``onerror``, ``followlinks``.
ru: Вызывает :ref:`событие аудита ` ``os.walk`` с аргументами ``верхний`` , ``сверху вниз`` , ``ошибка`` , ``следовать ссылкам`` .
uk: Викликає :ref:`подію аудиту <auditing>` ``os.walk`` з аргументами ``top``, ``topdown``, ``onerror``, ``followlinks``.

source: This function now calls :func:`os.scandir` instead of :func:`os.listdir`, making it faster by reducing the number of calls to :func:`os.stat`.
ru: Эта функция теперь вызывает :func:`os.scandir` вместо :func:`os.listdir` , что ускоряет процесс за счет сокращения количества вызовов :func:`os.stat` .
uk: Ця функція тепер викликає :func:`os.scandir` замість :func:`os.listdir`, що робить її швидшою завдяки зменшенню кількості викликів до :func:`os.stat`.

source: This behaves exactly like :func:`walk`, except that it yields a 4-tuple ``(dirpath, dirnames, filenames, dirfd)``, and it supports ``dir_fd``.
ru: Это ведет себя точно так же, как :func:`прогулка` , за исключением того, что он дает 4-кортеж ``(каталог, имена каталогов, имена файлов, dirfd)`` , и он поддерживает ``dir_fd`` .
uk: Це веде себе так само, як :func:`walk`, за винятком того, що дає 4-кортеж ``(dirpath, dirnames, filenames, dirfd)``, і підтримує ``dir_fd``.

source: *dirpath*, *dirnames* and *filenames* are identical to :func:`walk` output, and *dirfd* is a file descriptor referring to the directory *dirpath*.
ru: *dirpath*, *dirnames* и *filenames* идентичны :func:`прогулка` вывод, а *dirfd* — файловый дескриптор, ссылающийся на каталог *dirpath*.
uk: *dirpath*, *dirnames* і *filenaname* ідентичні виводу :func:`walk`, а *dirfd* є дескриптором файлу, який посилається на каталог *dirpath*.

source: This function always supports :ref:`paths relative to directory descriptors <dir_fd>` and :ref:`not following symlinks <follow_symlinks>`. Note however that, unlike other functions, the :func:`fwalk` default value for *follow_symlinks* is ``False``.
ru: Эта функция всегда поддерживает пути относительно дескрипторов каталогов. ` и :ref:`не переходить по символическим ссылкам`. Однако обратите внимание, что, в отличие от других функций, :func:`fwalk` значение по умолчанию для *follow_symlinks*: ``Ложь`` .
uk: Ця функція завжди підтримує :ref:`шляхи відносно дескрипторів каталогу <dir_fd>` і :ref:`не наступні символічні посилання <follow_symlinks>`. Проте зауважте, що, на відміну від інших функцій, значенням за замовчуванням :func:`fwalk` для *follow_symlinks* є ``False``.

source: Since :func:`fwalk` yields file descriptors, those are only valid until the next iteration step, so you should duplicate them (e.g. with :func:`dup`) if you want to keep them longer.
ru: С :func:`fwalk` дает файловые дескрипторы, они действительны только до следующего шага итерации, поэтому вам следует дублировать их (например, с помощью :func:`после` ), если вы хотите сохранить их дольше.
uk: Оскільки :func:`fwalk` дає дескриптори файлів, вони дійсні лише до наступного кроку ітерації, тому вам слід дублювати їх (наприклад, за допомогою :func:`dup`), якщо ви хочете зберегти їх довше.

source: In the next example, walking the tree bottom-up is essential: :func:`rmdir` doesn't allow deleting a directory before the directory is empty::
ru: В следующем примере необходимо пройти по дереву снизу вверх: :func:`rmdir` не позволяет удалить каталог, пока каталог не станет пустым::
uk: У наступному прикладі перехід по дереву знизу вгору важливий: :func:`rmdir` не дозволяє видаляти каталог, поки каталог не буде порожнім::

source: Raises an :ref:`auditing event <auditing>` ``os.fwalk`` with arguments ``top``, ``topdown``, ``onerror``, ``follow_symlinks``, ``dir_fd``.
ru: Вызывает :ref:`событие аудита ` ``os.fwalk`` с аргументами ``верхний`` , ``сверху вниз`` , ``ошибка`` , ``follow_symlinks`` , ``dir_fd`` .
uk: Викликає :ref:`подію аудиту <auditing>` ``os.fwalk`` з аргументами ``top``, ``topdown``, ``onerror``, ``follow_symlinks``, ``dir_fd``.

source: Added support for :class:`bytes` paths.
ru: Добавлена ​​поддержка :class:`байты` пути.
uk: Додано підтримку шляхів :class:`bytes`.

source: Create an anonymous file and return a file descriptor that refers to it. *flags* must be one of the ``os.MFD_*`` constants available on the system (or a bitwise ORed combination of them). By default, the new file descriptor is :ref:`non-inheritable <fd_inheritance>`.
ru: Создайте анонимный файл и верните дескриптор файла, который ссылается на него. *флаги* должны быть одним из ``us.MFD_*'' константы, доступные в системе (или их побитовая комбинация с операцией ИЛИ). По умолчанию новый файловый дескриптор не наследуется. `.
uk: Створіть анонімний файл і поверніть дескриптор файлу, який посилається на нього. *flags* має бути однією з констант ``os.MFD_*``, доступних у системі (або їх побітовою комбінацією АБО). За замовчуванням новий файловий дескриптор є :ref:`non-inheritable <fd_inheritance>`.

source: The name supplied in *name* is used as a filename and will be displayed as the target of the corresponding symbolic link in the directory ``/proc/self/fd/``. The displayed name is always prefixed with ``memfd:`` and serves only for debugging purposes. Names do not affect the behavior of the file descriptor, and as such multiple files can have the same name without any side effects.
ru: Имя, указанное в *name*, используется в качестве имени файла и будет отображаться как цель соответствующей символической ссылки в каталоге. ``/proc/self/fd/`` . Отображаемое имя всегда начинается с префикса ``мемфд:`` и служит только для целей отладки. Имена не влияют на поведение файлового дескриптора, поэтому несколько файлов могут иметь одно и то же имя без каких-либо побочных эффектов.
uk: Ім’я, указане в *name*, використовується як ім’я файлу та відображатиметься як ціль відповідного символічного посилання в каталозі ``/proc/self/fd/``. Ім’я, що відображається, завжди має префікс ``memfd:`` і служить лише для цілей налагодження. Імена не впливають на поведінку файлового дескриптора, тому кілька файлів можуть мати однакові назви без будь-яких побічних ефектів.

source: :ref:`Availability <availability>`: Linux 3.17 or newer with glibc 2.27 or newer.
uk: :ref:`Наявність <availability>`: Linux 3.17 або новіша версія з glibc 2.27 або новіша.

source: These flags can be passed to :func:`memfd_create`.
ru: Эти флаги можно передать :func:`memfd_create` .
uk: Ці позначки можна передати в :func:`memfd_create`.

source: :ref:`Availability <availability>`: Linux 3.17 or newer with glibc 2.27 or newer. The ``MFD_HUGE*`` flags are only available since Linux 4.14.
uk: :ref:`Наявність <availability>`: Linux 3.17 або новіша версія з glibc 2.27 або новіша. Прапорці ``MFD_HUGE*`` доступні лише з Linux 4.14.

source: Linux extended attributes
ru: Расширенные атрибуты Linux
uk: Розширені атрибути Linux

source: These functions are all available on Linux only.
ru: Все эти функции доступны только в Linux.
uk: Усі ці функції доступні лише в Linux.

source: Return the value of the extended filesystem attribute *attribute* for *path*. *attribute* can be bytes or str (directly or indirectly through the :class:`PathLike` interface). If it is str, it is encoded with the filesystem encoding.
ru: Возвращает значение расширенного атрибута файловой системы *attribute* для *path*. *атрибут* может быть байтом или строкой (прямо или косвенно через :class:`PathLike` интерфейс). Если это строка, она закодирована с помощью кодировки файловой системы.
uk: Повертає значення розширеного атрибута файлової системи *attribute* для *path*. *attribute* може бути байтом або str (прямо чи опосередковано через інтерфейс :class:`PathLike`). Якщо це str, воно закодовано з кодуванням файлової системи.

source: Raises an :ref:`auditing event <auditing>` ``os.getxattr`` with arguments ``path``, ``attribute``.
ru: Вызывает :ref:`событие аудита ` ``os.getxattr`` с аргументами ``путь`` , ``атрибут`` .
uk: Викликає :ref:`подію аудиту <auditing>` ``os.getxattr`` з аргументами ``path``, ``attribute``.

source: Accepts a :term:`path-like object` for *path* and *attribute*.
ru: Принимает объект, подобный пути, для *path* и *attribute*.
uk: Приймає :term:`path-like object` для *path* і *attribute*.

source: Return a list of the extended filesystem attributes on *path*. The attributes in the list are represented as strings decoded with the filesystem encoding. If *path* is ``None``, :func:`listxattr` will examine the current directory.
ru: Возвращает список расширенных атрибутов файловой системы по *path*. Атрибуты в списке представлены в виде строк, декодированных с помощью кодировки файловой системы. Если *путь* ``Нет`` , :func:`listxattr` проверит текущий каталог.
uk: Повертає список розширених атрибутів файлової системи за *шляхом*. Атрибути в списку представлені як рядки, декодовані за допомогою кодування файлової системи. Якщо *path* має значення ``None``, :func:`listxattr` перевірить поточний каталог.

source: Raises an :ref:`auditing event <auditing>` ``os.listxattr`` with argument ``path``.
ru: Вызывает :ref:`событие аудита ` ``os.listxattr`` с аргументом ``путь`` .
uk: Викликає :ref:`подію аудиту <auditing>` ``os.listxattr`` з аргументом ``path``.

source: Raises an :ref:`auditing event <auditing>` ``os.removexattr`` with arguments ``path``, ``attribute``.
ru: Вызывает :ref:`событие аудита ` ``os.removexattr`` с аргументами ``путь`` , ``атрибут`` .
uk: Викликає :ref:`подію аудиту <auditing>` ``os.removexattr`` з аргументами ``path``, ``attribute``.

source: A bug in Linux kernel versions less than 2.6.39 caused the flags argument to be ignored on some filesystems.
ru: Ошибка в версиях ядра Linux ниже 2.6.39 приводила к игнорированию аргумента flags в некоторых файловых системах.
uk: Помилка у версіях ядра Linux до 2.6.39 спричинила ігнорування аргументу flags у деяких файлових системах.

source: Raises an :ref:`auditing event <auditing>` ``os.setxattr`` with arguments ``path``, ``attribute``, ``value``, ``flags``.
ru: Вызывает :ref:`событие аудита ` ``os.setxattr`` с аргументами ``путь`` , ``атрибут`` , ``ценность`` , ``флаги`` .
uk: Викликає :ref:`подію аудиту <auditing>` ``os.setxattr`` з аргументами ``path``, ``attribute``, ``value``, ``flags``.

source: The maximum size the value of an extended attribute can be. Currently, this is 64 KiB on Linux.
ru: Максимальный размер значения расширенного атрибута. В настоящее время это 64 КиБ в Linux.
uk: Максимальний розмір значення розширеного атрибута. На даний момент це 64 КіБ на Linux.
