Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/os.po
Languages: ru, uk

source: The new file descriptors are now non-inheritable.
ru: Новые файловые дескрипторы теперь не наследуются.
uk: Нові файлові дескриптори тепер не успадковуються.

source: Create a pipe. Return a pair of file descriptors ``(r, w)`` usable for reading and writing, respectively. The new file descriptor is :ref:`non-inheritable <fd_inheritance>`.
ru: Создайте трубу. Вернуть пару файловых дескрипторов ``(р, ш)`` можно использовать для чтения и записи соответственно. Новый файловый дескриптор :ref:`не наследуется. `.
uk: Створіть трубу. Повертає пару файлових дескрипторів ``(r, w)``, які можна використовувати для читання та запису відповідно. Новий файловий дескриптор :ref:`не успадковується <fd_inheritance>`.

source: Create a pipe with *flags* set atomically. *flags* can be constructed by ORing together one or more of these values: :data:`O_NONBLOCK`, :data:`O_CLOEXEC`. Return a pair of file descriptors ``(r, w)`` usable for reading and writing, respectively.
ru: Создайте канал с *флагами*, установленными атомарно. *flags* могут быть созданы путем объединения OR одного или нескольких из этих значений: :data:`O_NONBLOCK` , :data:`O_CLOEXEC` . Вернуть пару файловых дескрипторов ``(р, ш)`` можно использовать для чтения и записи соответственно.
uk: Створіть трубу з *прапорцями*, встановленими атомарно. *прапорці* можуть бути створені шляхом об’єднання одного або кількох із цих значень :data:`O_NONBLOCK`, :data:`O_CLOEXEC`. Повертає пару файлових дескрипторів ``(r, w)``, які можна використовувати для читання та запису відповідно.

source: Ensures that enough disk space is allocated for the file specified by *fd* starting from *offset* and continuing for *len* bytes.
ru: Гарантирует, что для файла, указанного *fd*, выделено достаточно места на диске, начиная с *offset* и продолжая *len* байт.
uk: Переконується, що для файлу, указаного *fd*, виділено достатньо місця на диску, починаючи з *offset* і продовжуючи *len* байт.

source: Announces an intention to access data in a specific pattern thus allowing the kernel to make optimizations. The advice applies to the region of the file specified by *fd* starting at *offset* and continuing for *len* bytes. *advice* is one of :data:`POSIX_FADV_NORMAL`, :data:`POSIX_FADV_SEQUENTIAL`, :data:`POSIX_FADV_RANDOM`, :data:`POSIX_FADV_NOREUSE`, :data:`POSIX_FADV_WILLNEED` or :data:`POSIX_FADV_DONTNEED`.
ru: Объявляет о намерении получить доступ к данным по определенному шаблону, что позволяет ядру выполнять оптимизацию. Совет применим к области файла, указанной *fd*, начиная с *offset* и продолжая *len* байт. *совет* является одним из :data:`POSIX_FADV_NORMAL` , :data:`POSIX_FADV_SEQUENTIAL` , :data:`POSIX_FADV_RANDOM` , :data:`POSIX_FADV_NOREUSE` , :data:`POSIX_FADV_WILLNEED` или :data:`POSIX_FADV_DONTNEED` .
uk: Оголошує про намір отримати доступ до даних за певним шаблоном, що дозволяє ядру проводити оптимізацію. Порада стосується регіону файлу, визначеного *fd*, починаючи з *offset* і продовжуючи *len* байти. *порада* є одним із :data:`POSIX_FADV_NORMAL`, :data:`POSIX_FADV_SEQUENTIAL`, :data:`POSIX_FADV_RANDOM`, :data:`POSIX_FADV_NOREUSE`, :data:`POSIX_FADV_WILLNEED` або :data:`POSIX_FADV_DONTNEED`.

source: Flags that can be used in *advice* in :func:`posix_fadvise` that specify the access pattern that is likely to be used.
ru: Флаги, которые можно использовать в *советах* в :func:`posix_fadvise` которые определяют шаблон доступа, который, вероятно, будет использоваться.
uk: Прапорці, які можна використовувати в *advice* у :func:`posix_fadvise`, які визначають шаблон доступу, який, імовірно, буде використаний.

source: Read at most *n* bytes from file descriptor *fd* at a position of *offset*, leaving the file offset unchanged.
ru: Считайте не более *n* байт из файлового дескриптора *fd* в позиции *offset*, оставив смещение файла неизменным.
uk: Прочитати щонайбільше *n* байт із файлового дескриптора *fd* у позиції *offset*, залишаючи зміщення файлу незмінним.

source: Return a bytestring containing the bytes read. If the end of the file referred to by *fd* has been reached, an empty bytes object is returned.
ru: Возвращает строку байтов, содержащую прочитанные байты. Если достигнут конец файла, на который указывает *fd*, возвращается пустой объект байтов.
uk: Повертає байтовий рядок, що містить прочитані байти. Якщо досягнуто кінця файлу, на який посилається *fd*, повертається порожній об’єкт bytes.

source: Read from a file descriptor *fd* at a position of *offset* into mutable :term:`bytes-like objects <bytes-like object>` *buffers*, leaving the file offset unchanged. Transfer data into each buffer until it is full and then move on to the next buffer in the sequence to hold the rest of the data.
ru: Чтение из файлового дескриптора *fd* в позиции *offset* в изменяемые :term:`байтоподобные объекты. ` *buffers*, оставляя смещение файла неизменным. Передавайте данные в каждый буфер до тех пор, пока он не заполнится, а затем переходите к следующему буферу в последовательности, чтобы сохранить остальную часть данных.
uk: Читання з файлового дескриптора *fd* у позиції *offset* у змінні :term:`байт-подібні об’єкти <bytes-like object>` *buffers*, залишаючи зміщення файлу незмінним. Передайте дані в кожен буфер, доки він не заповниться, а потім перейдіть до наступного буфера в послідовності, щоб утримувати решту даних.

source: The flags argument contains a bitwise OR of zero or more of the following flags:
ru: Аргумент flags содержит побитовое ИЛИ нуля или более следующих флагов:
uk: Аргумент flags містить порозрядне АБО нуля або більше таких прапорів:

source: Return the total number of bytes actually read which can be less than the total capacity of all the objects.
ru: Возвращает общее количество фактически прочитанных байтов, которое может быть меньше общей емкости всех объектов.
uk: Повертає загальну кількість фактично прочитаних байтів, яка може бути меншою за загальну ємність усіх об’єктів.

source: The operating system may set a limit (:func:`sysconf` value ``'SC_IOV_MAX'``) on the number of buffers that can be used.
ru: Операционная система может установить ограничение ( :func:`sysconf` ценить ``'SC_IOV_MAX''` ) от количества буферов, которые можно использовать.
uk: Операційна система може встановити обмеження (:func:`sysconf` значення ``'SC_IOV_MAX'``) на кількість буферів, які можна використовувати.

source: Combine the functionality of :func:`os.readv` and :func:`os.pread`.
ru: Объедините функциональность :func:`os.readv` и :func:`os.pread` .
uk: Поєднайте функціональні можливості :func:`os.readv` і :func:`os.pread`.

source: :ref:`Availability <availability>`: Linux 2.6.30 and newer, FreeBSD 6.0 and newer, OpenBSD 2.7 and newer, AIX 7.1 and newer. Using flags requires Linux 4.6 or newer.
uk: :ref:`Доступність <availability>`: Linux 2.6.30 і новіші версії, FreeBSD 6.0 і новіші версії, OpenBSD 2.7 і новіші версії, AIX 7.1 і новіші версії. Для використання прапорів потрібна версія Linux 4.6 або новіша.

source: Do not wait for data which is not immediately available. If this flag is specified, the system call will return instantly if it would have to read data from the backing storage or wait for a lock.
ru: Не ждите данных, которые не доступны немедленно. Если этот флаг указан, системный вызов немедленно вернет управление, если ему придется прочитать данные из резервного хранилища или дождаться блокировки.
uk: Не чекайте даних, які доступні не відразу. Якщо вказано цей прапорець, системний виклик повернеться миттєво, якщо йому доведеться прочитати дані з резервного сховища або дочекатися блокування.

source: If some data was successfully read, it will return the number of bytes read. If no bytes were read, it will return ``-1`` and set errno to :data:`errno.EAGAIN`.
uk: Якщо деякі дані були успішно прочитані, він поверне кількість прочитаних байтів. Якщо не було прочитано жодного байту, він поверне ``-1`` і встановить errno як :data:`errno.EAGAIN`.

source: :ref:`Availability <availability>`: Linux 4.14 and newer.
uk: :ref:`Доступність <availability>`: Linux 4.14 і новіші версії.

source: High priority read/write. Allows block-based filesystems to use polling of the device, which provides lower latency, but may use additional resources.
ru: Чтение/запись с высоким приоритетом. Позволяет блочным файловым системам использовать опрос устройства, что обеспечивает меньшую задержку, но может использовать дополнительные ресурсы.
uk: Високий пріоритет читання/запису. Дозволяє файловим системам на основі блоків використовувати опитування пристрою, що забезпечує меншу затримку, але може використовувати додаткові ресурси.

source: Currently, on Linux, this feature is usable only on a file descriptor opened using the :data:`O_DIRECT` flag.
ru: В настоящее время в Linux эту функцию можно использовать только для дескриптора файла, открытого с помощью :data:`O_DIRECT` флаг.
uk: Наразі в Linux цю функцію можна використовувати лише для дескриптора файлу, відкритого за допомогою позначки :data:`O_DIRECT`.

source: :ref:`Availability <availability>`: Linux 4.6 and newer.
uk: :ref:`Наявність <availability>`: Linux 4.6 і новіші версії.

source: Write the bytestring in *str* to file descriptor *fd* at position of *offset*, leaving the file offset unchanged.
ru: Запишите строку байтов в *str* в файловый дескриптор *fd* в позиции *offset*, оставив смещение файла неизменным.
uk: Запишіть байтовий рядок у *str* у файловий дескриптор *fd* у позиції *offset*, залишаючи зміщення файлу без змін.

source: Return the number of bytes actually written.
ru: Возвращает количество фактически записанных байтов.
uk: Повертає кількість фактично записаних байтів.

source: Write the *buffers* contents to file descriptor *fd* at a offset *offset*, leaving the file offset unchanged. *buffers* must be a sequence of :term:`bytes-like objects <bytes-like object>`. Buffers are processed in array order. Entire contents of the first buffer is written before proceeding to the second, and so on.
uk: Запишіть вміст *buffers* у файловий дескриптор *fd* зі зміщенням *offset*, залишаючи зміщення файлу без змін. *буфери* мають бути послідовністю :term:`байт-подібних об’єктів <bytes-like object>`. Буфери обробляються в порядку масиву. Весь вміст першого буфера записується перед переходом до другого і так далі.

source: Return the total number of bytes actually written.
ru: Возвращает общее количество фактически записанных байтов.
uk: Повертає загальну кількість фактично записаних байтів.

source: Combine the functionality of :func:`os.writev` and :func:`os.pwrite`.
ru: Объедините функциональность :func:`os.writev` и :func:`os.pwrite` .
uk: Поєднайте функції :func:`os.writev` і :func:`os.pwrite`.

source: :ref:`Availability <availability>`: Linux 2.6.30 and newer, FreeBSD 6.0 and newer, OpenBSD 2.7 and newer, AIX 7.1 and newer. Using flags requires Linux 4.7 or newer.
uk: :ref:`Доступність <availability>`: Linux 2.6.30 і новіші версії, FreeBSD 6.0 і новіші версії, OpenBSD 2.7 і новіші версії, AIX 7.1 і новіші версії. Для використання прапорів потрібна версія Linux 4.7 або новіша.

source: :ref:`Availability <availability>`: Linux 4.7 and newer.
uk: :ref:`Доступність <availability>`: Linux 4.7 і новіші версії.

source: Read at most *n* bytes from file descriptor *fd*.
ru: Прочитайте не более *n* байт из файлового дескриптора *fd*.
uk: Прочитати щонайбільше *n* байт із файлового дескриптора *fd*.

source: This function is intended for low-level I/O and must be applied to a file descriptor as returned by :func:`os.open` or :func:`pipe`. To read a "file object" returned by the built-in function :func:`open` or by :func:`popen` or :func:`fdopen`, or :data:`sys.stdin`, use its :meth:`~file.read` or :meth:`~file.readline` methods.
ru: Эта функция предназначена для низкоуровневого ввода-вывода и должна применяться к дескриптору файла, возвращаемому функцией :func:`os.open` или :func:`труба` . Чтобы прочитать «файловый объект», возвращаемый встроенной функцией :func:`открыть` или через :func:`попэн` или :func:`fdopen` , или :data:`sys.stdin` , используйте его :meth:`~file.read` или :meth:`~file.readline` методы.
uk: Ця функція призначена для низькорівневого вводу-виводу та має застосовуватися до дескриптора файлу, який повертає :func:`os.open` або :func:`pipe`. Щоб прочитати "файловий об’єкт", повернутий вбудованою функцією :func:`open` або :func:`popen` або :func:`fdopen`, або :data:`sys.stdin`, використовуйте його :meth:`~file.read` або :meth:`~file.readline` методи.

source: Copy *count* bytes from file descriptor *in_fd* to file descriptor *out_fd* starting at *offset*. Return the number of bytes sent. When EOF is reached return ``0``.
ru: Скопируйте *count* байт из файлового дескриптора *in_fd* в файловый дескриптор *out_fd*, начиная с *offset*. Возвращает количество отправленных байтов. При достижении EOF возврат ``0`` .
uk: Скопіюйте *count* байтів із файлового дескриптора *in_fd* до файлового дескриптора *out_fd*, починаючи зі *offset*. Повертає кількість надісланих байтів. Коли EOF досягнуто, повертає ``0``.

source: The first function notation is supported by all platforms that define :func:`sendfile`.
ru: Первая запись функции поддерживается всеми платформами, определяющими :func:`отправить файл` .
uk: Першу нотацію функції підтримують усі платформи, які визначають :func:`sendfile`.

source: On Linux, if *offset* is given as ``None``, the bytes are read from the current position of *in_fd* and the position of *in_fd* is updated.
ru: В Linux, если *offset* указано как ``Нет`` , байты считываются из текущей позиции *in_fd*, а позиция *in_fd* обновляется.
uk: У Linux, якщо *offset* задано як ``None``, байти зчитуються з поточної позиції *in_fd*, а позиція *in_fd* оновлюється.

source: The second case may be used on macOS and FreeBSD where *headers* and *trailers* are arbitrary sequences of buffers that are written before and after the data from *in_fd* is written. It returns the same as the first case.
ru: Второй случай может использоваться в macOS и FreeBSD, где *заголовки* и *трейлеры* — это произвольные последовательности буферов, которые записываются до и после записи данных из *in_fd*. Он возвращает то же, что и в первом случае.
uk: Другий випадок можна використовувати в macOS і FreeBSD, де *заголовки* і *кінці* є довільними послідовностями буферів, які записуються до і після запису даних з *in_fd*. Він повертає те саме, що й перший випадок.

source: On macOS and FreeBSD, a value of ``0`` for *count* specifies to send until the end of *in_fd* is reached.
ru: В macOS и FreeBSD значение ``0`` for *count* указывает на отправку до тех пор, пока не будет достигнут конец *in_fd*.
uk: У macOS і FreeBSD значення ``0`` для *count* вказує на надсилання до кінця *in_fd*.

source: All platforms support sockets as *out_fd* file descriptor, and some platforms allow other types (e.g. regular file, pipe) as well.
ru: Все платформы поддерживают сокеты как файловый дескриптор *out_fd*, а некоторые платформы допускают и другие типы (например, обычный файл, канал).
uk: Усі платформи підтримують сокети як файловий дескриптор *out_fd*, а деякі платформи також дозволяють інші типи (наприклад, звичайний файл, канал).

source: Cross-platform applications should not use *headers*, *trailers* and *flags* arguments.
ru: Кроссплатформенные приложения не должны использовать аргументы *headers*, *trailers* и *flags*.
uk: Міжплатформні програми не повинні використовувати аргументи *headers*, *trailers* і *flags*.

source: For a higher-level wrapper of :func:`sendfile`, see :meth:`socket.socket.sendfile`.
ru: Для оболочки более высокого уровня :func:`отправить файл` , видеть :meth:`socket.socket.sendfile` .
uk: Щоб отримати обгортку вищого рівня :func:`sendfile`, перегляньте :meth:`socket.socket.sendfile`.

source: Parameters *out* and *in* was renamed to *out_fd* and *in_fd*.
ru: Параметры *out* и *in* были переименованы в *out_fd* и *in_fd*.
uk: Параметри *out* і *in* перейменовано на *out_fd* і *in_fd*.

source: Set the blocking mode of the specified file descriptor. Set the :data:`O_NONBLOCK` flag if blocking is ``False``, clear the flag otherwise.
ru: Установите режим блокировки указанного файлового дескриптора. Установите :data:`O_NONBLOCK` отметьте, есть ли блокировка ``Ложь`` , в противном случае снимите флаг.
uk: Встановити режим блокування вказаного файлового дескриптора. Установіть прапорець :data:`O_NONBLOCK`, якщо блокування має значення ``False``, зніміть прапорець в іншому випадку.

source: See also :func:`get_blocking` and :meth:`socket.socket.setblocking`.
ru: См. также :func:`get_blocking` и :meth:`socket.socket.setblocking` .
uk: Дивіться також :func:`get_blocking` і :meth:`socket.socket.setblocking`.

source: Parameters to the :func:`sendfile` function, if the implementation supports them.
ru: Параметры :func:`отправить файл` функции, если реализация их поддерживает.
uk: Параметри функції :func:`sendfile`, якщо реалізація їх підтримує.

source: Read from a file descriptor *fd* into a number of mutable :term:`bytes-like objects <bytes-like object>` *buffers*. Transfer data into each buffer until it is full and then move on to the next buffer in the sequence to hold the rest of the data.
ru: Считайте из файлового дескриптора *fd* несколько изменяемых :term:`байтоподобных объектов. ` *буферы*. Передавайте данные в каждый буфер до тех пор, пока он не заполнится, а затем переходите к следующему буферу в последовательности, чтобы сохранить остальную часть данных.
uk: Читання з файлового дескриптора *fd* у кілька змінних :term:`байт-подібних об’єктів <bytes-like object>` *буферів*. Передайте дані в кожен буфер, доки він не заповниться, а потім перейдіть до наступного буфера в послідовності, щоб утримувати решту даних.

source: Return the process group associated with the terminal given by *fd* (an open file descriptor as returned by :func:`os.open`).
ru: Возвращает группу процессов, связанную с терминалом, заданную *fd* (дескриптор открытого файла, возвращаемый :func:`os.open` ).
uk: Повертає групу процесів, пов’язану з терміналом, задану *fd* (дескриптор відкритого файлу, який повертає :func:`os.open`).

source: Set the process group associated with the terminal given by *fd* (an open file descriptor as returned by :func:`os.open`) to *pg*.
ru: Установите группу процессов, связанную с терминалом, заданную *fd* (дескриптор открытого файла, возвращаемый :func:`os.open` ) до *стр*.
uk: Встановіть групу процесів, пов’язану з терміналом, надану *fd* (дескриптор відкритого файлу, який повертає :func:`os.open`), на *pg*.

source: Return a string which specifies the terminal device associated with file descriptor *fd*. If *fd* is not associated with a terminal device, an exception is raised.
ru: Возвращает строку, указывающую терминальное устройство, связанное с файловым дескриптором *fd*. Если *fd* не связан с терминальным устройством, возникает исключение.
uk: Повертає рядок, який визначає термінальний пристрій, пов’язаний із файловим дескриптором *fd*. Якщо *fd* не пов’язано з термінальним пристроєм, виникає виняток.

source: Write the bytestring in *str* to file descriptor *fd*.
ru: Запишите строку байтов в *str* в файловый дескриптор *fd*.
uk: Запишіть байтовий рядок у *str* до файлового дескриптора *fd*.

source: This function is intended for low-level I/O and must be applied to a file descriptor as returned by :func:`os.open` or :func:`pipe`. To write a "file object" returned by the built-in function :func:`open` or by :func:`popen` or :func:`fdopen`, or :data:`sys.stdout` or :data:`sys.stderr`, use its :meth:`~file.write` method.
ru: Эта функция предназначена для низкоуровневого ввода-вывода и должна применяться к дескриптору файла, возвращаемому функцией :func:`os.open` или :func:`труба` . Чтобы написать «файловый объект», возвращаемый встроенной функцией :func:`открыть` или через :func:`попэн` или :func:`fdopen` , или :data:`sys.stdout` или :data:`sys.stderr` , используйте его :meth:`~file.write` метод.
uk: Ця функція призначена для низькорівневого вводу-виводу та має застосовуватися до дескриптора файлу, який повертає :func:`os.open` або :func:`pipe`. Щоб записати "файловий об’єкт", який повертає вбудована функція :func:`open` або :func:`popen` або :func:`fdopen`, або :data:`sys.stdout` або :data:`sys.stderr`, використовуйте його метод :meth:`~file.write`.

source: Write the contents of *buffers* to file descriptor *fd*. *buffers* must be a sequence of :term:`bytes-like objects <bytes-like object>`. Buffers are processed in array order. Entire contents of the first buffer is written before proceeding to the second, and so on.
ru: Запишите содержимое *buffers* в файловый дескриптор *fd*. *буферы* должны представлять собой последовательность :term:`байтоподобных объектов `. Буферы обрабатываются в порядке массива. Все содержимое первого буфера записывается перед переходом ко второму и так далее.
uk: Запишіть вміст *buffers* у файловий дескриптор *fd*. *буфери* мають бути послідовністю :term:`байт-подібних об’єктів <bytes-like object>`. Буфери обробляються в порядку масиву. Весь вміст першого буфера записується перед переходом до другого і так далі.

source: Returns the total number of bytes actually written.
ru: Возвращает общее количество фактически записанных байтов.
uk: Повертає загальну кількість фактично записаних байтів.

source: Querying the size of a terminal
ru: Запрос размера терминала
uk: Запит розміру терміналу

source: Return the size of the terminal window as ``(columns, lines)``, tuple of type :class:`terminal_size`.
ru: Верните размер окна терминала как ``(столбцы, строки)`` , кортеж типа :class:`terminal_size` .
uk: Повертає розмір вікна терміналу як ``(стовпці, рядки)``, кортеж типу :class:`terminal_size`.

source: The optional argument ``fd`` (default ``STDOUT_FILENO``, or standard output) specifies which file descriptor should be queried.
ru: Необязательный аргумент ``фд`` (по умолчанию ``STDOUT_FILENO`` или стандартный вывод) указывает, какой дескриптор файла следует запрашивать.
uk: Додатковий аргумент ``fd`` (за замовчуванням ``STDOUT_FILENO`` або стандартний вивід) визначає, який дескриптор файлу слід запитувати.

source: If the file descriptor is not connected to a terminal, an :exc:`OSError` is raised.
ru: Если дескриптор файла не подключен к терминалу, :exc:`OSError` поднят.
uk: Якщо дескриптор файлу не підключено до терміналу, виникає :exc:`OSError`.

source: :func:`shutil.get_terminal_size` is the high-level function which should normally be used, ``os.get_terminal_size`` is the low-level implementation.
ru: :func:`shutil.get_terminal_size` — это функция высокого уровня, которую обычно следует использовать, ``os.get_terminal_size`` это низкоуровневая реализация.
uk: :func:`shutil.get_terminal_size` — це функція високого рівня, яка зазвичай повинна використовуватися, ``os.get_terminal_size`` — це реалізація низького рівня.

source: A subclass of tuple, holding ``(columns, lines)`` of the terminal window size.
ru: Подкласс кортежа, содержащий ``(столбцы, строки)`` размера окна терминала.
uk: Підклас кортежу, що містить ``(стовпці, рядки)`` розміру вікна терміналу.

source: Width of the terminal window in characters.
ru: Ширина окна терминала в символах.
uk: Ширина вікна терміналу в символах.

source: Height of the terminal window in characters.
ru: Высота окна терминала в символах.
uk: Висота вікна терміналу в символах.

source: Inheritance of File Descriptors
ru: Наследование файловых дескрипторов
uk: Успадкування файлових дескрипторів
