Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/os.po
Languages: ru, uk

source: Return the number of processes in the system run queue averaged over the last 1, 5, and 15 minutes or raises :exc:`OSError` if the load average was unobtainable.
ru: Возвращает количество процессов в очереди запуска системы, усредненное за последние 1, 5 и 15 минут или увеличенное число. :exc:`OSError` если среднее значение нагрузки было невозможно получить.
uk: Повертає середню кількість процесів у черзі виконання системи за останні 1, 5 і 15 хвилин або викликає :exc:`OSError`, якщо середнє значення завантаження неможливо отримати.

source: Return integer-valued system configuration values. If the configuration value specified by *name* isn't defined, ``-1`` is returned. The comments regarding the *name* parameter for :func:`confstr` apply here as well; the dictionary that provides information on the known names is given by ``sysconf_names``.
ru: Возвращает целочисленные значения конфигурации системы. Если значение конфигурации, указанное *имя*, не определено, ``-1`` возвращается. Комментарии к параметру *name* для :func:`confstr` подайте заявку и сюда; словарь, предоставляющий информацию об известных именах, имеет вид ``sysconf_names`` .
uk: Повертає цілочисельні значення конфігурації системи. Якщо значення конфігурації, указане *name*, не визначено, повертається ``-1``. Коментарі щодо параметра *name* для :func:`confstr` також застосовуються тут; словник, який надає інформацію про відомі імена, надається ``sysconf_names``.

source: Dictionary mapping names accepted by :func:`sysconf` to the integer values defined for those names by the host operating system. This can be used to determine the set of names known to the system.
ru: Имена сопоставлений словаря, принятые :func:`sysconf` к целочисленным значениям, определенным для этих имен операционной системой хоста. Это можно использовать для определения набора имен, известных системе.
uk: Словник зіставляє імена, прийняті :func:`sysconf`, до цілих значень, визначених для цих імен головною операційною системою. Це можна використовувати для визначення набору імен, відомих системі.

source: The following data values are used to support path manipulation operations. These are defined for all platforms.
ru: Следующие значения данных используются для поддержки операций манипулирования путем. Они определены для всех платформ.
uk: Наступні значення даних використовуються для підтримки операцій маніпулювання шляхом. Вони визначені для всіх платформ.

source: Higher-level operations on pathnames are defined in the :mod:`os.path` module.
ru: Операции более высокого уровня над путями определены в :mod:`os.path` модуль.
uk: Операції вищого рівня над іменами шляхів визначені в модулі :mod:`os.path`.

source: The constant string used by the operating system to refer to the current directory. This is ``'.'`` for Windows and POSIX. Also available via :mod:`os.path`.
ru: Константная строка, используемая операционной системой для ссылки на текущий каталог. Это ``'.'`` для Windows и POSIX. Также доступно через :mod:`os.path` .
uk: Постійний рядок, який використовується операційною системою для посилання на поточний каталог. Це ``'.'`` для Windows і POSIX. Також доступний через :mod:`os.path`.

source: The constant string used by the operating system to refer to the parent directory. This is ``'..'`` for Windows and POSIX. Also available via :mod:`os.path`.
ru: Константная строка, используемая операционной системой для ссылки на родительский каталог. Это ``'..'`` для Windows и POSIX. Также доступно через :mod:`os.path` .
uk: Постійний рядок, який використовується операційною системою для посилання на батьківський каталог. Це ".." для Windows і POSIX. Також доступний через :mod:`os.path`.

source: The character used by the operating system to separate pathname components. This is ``'/'`` for POSIX and ``'\\'`` for Windows. Note that knowing this is not sufficient to be able to parse or concatenate pathnames --- use :func:`os.path.split` and :func:`os.path.join` --- but it is occasionally useful. Also available via :mod:`os.path`.
ru: Символ, используемый операционной системой для разделения компонентов пути. Это ``'/'`` для POSIX и ``'\\'`` для Windows. Обратите внимание, что знания этого недостаточно для анализа или объединения имен путей --- используйте :func:`os.path.split` и :func:`os.path.join` --- но иногда это бывает полезно. Также доступно через :mod:`os.path` .
uk: Символ, який використовується операційною системою для розділення компонентів шляху. Це ``'/'`` для POSIX і ``'\\'`` для Windows. Зауважте, що знати це недостатньо, щоб мати змогу розбирати або об’єднувати шляхи --- використовуйте :func:`os.path.split` і :func:`os.path.join` --- але іноді це корисно. Також доступний через :mod:`os.path`.

source: An alternative character used by the operating system to separate pathname components, or ``None`` if only one separator character exists. This is set to ``'/'`` on Windows systems where ``sep`` is a backslash. Also available via :mod:`os.path`.
ru: Альтернативный символ, используемый операционной системой для разделения компонентов пути, или ``Нет`` если существует только один символ-разделитель. Это установлено на ``'/'`` в системах Windows, где ``сентябрь`` это обратная косая черта. Также доступно через :mod:`os.path` .
uk: Альтернативний символ, який використовується операційною системою для розділення компонентів шляху, або "Немає", якщо існує лише один роздільний символ. У системах Windows встановлено значення ``'/''``, де ``sep`` є зворотною косою рискою. Також доступний через :mod:`os.path`.

source: The character which separates the base filename from the extension; for example, the ``'.'`` in :file:`os.py`. Also available via :mod:`os.path`.
ru: Символ, отделяющий базовое имя файла от расширения; например, ``'.'`` в :file:`os.py` . Также доступно через :mod:`os.path` .
uk: Символ, який відокремлює базову назву файлу від розширення; наприклад, ``'.'`` у :file:`os.py`. Також доступний через :mod:`os.path`.

source: The character conventionally used by the operating system to separate search path components (as in :envvar:`PATH`), such as ``':'`` for POSIX or ``';'`` for Windows. Also available via :mod:`os.path`.
ru: Символ, традиционно используемый операционной системой для разделения компонентов пути поиска (как в :envvar:`ПУТЬ` ), такой как ``':'`` для POSIX или ``';'`` для Windows. Также доступно через :mod:`os.path` .
uk: Символ, який зазвичай використовується операційною системою для розділення компонентів шляху пошуку (як у :envvar:`PATH`), наприклад ``':''`` для POSIX або ``';''`` для Windows. Також доступний через :mod:`os.path`.

source: The default search path used by :func:`exec\*p\* <execl>` and :func:`spawn\*p\* <spawnl>` if the environment doesn't have a ``'PATH'`` key. Also available via :mod:`os.path`.
ru: Путь поиска по умолчанию, используемый :func:`exec\*p\* ` и :func:`spawn\*p\*` если в среде нет ``'ПУТЬ'`` ключ. Также доступно через :mod:`os.path` .
uk: Шлях пошуку за умовчанням, який використовується :func:`exec\*p\* <execl>` і :func:`spawn\*p\* <spawnl>`, якщо середовище не має ключа ``'PATH'``. Також доступний через :mod:`os.path`.

source: The string used to separate (or, rather, terminate) lines on the current platform. This may be a single character, such as ``'\n'`` for POSIX, or multiple characters, for example, ``'\r\n'`` for Windows. Do not use *os.linesep* as a line terminator when writing files opened in text mode (the default); use a single ``'\n'`` instead, on all platforms.
ru: Строка, используемая для разделения (или, скорее, завершения) строк на текущей платформе. Это может быть один символ, например ``'\n'`` для POSIX или нескольких символов, например: ``'\r\n'`` для Windows. Не используйте *os.linesep* в качестве признака конца строки при записи файлов, открытых в текстовом режиме (по умолчанию); используйте один ``'\n'`` вместо этого на всех платформах.
uk: Рядок, який використовується для розділення (точніше, завершення) рядків на поточній платформі. Це може бути один символ, наприклад ``'\n'`` для POSIX, або кілька символів, наприклад ``'\r\n'`` для Windows. Не використовуйте *os.linesep* як символ закінчення рядка під час запису файлів, відкритих у текстовому режимі (за замовчуванням); замість цього використовуйте єдиний ``'\n'`` на всіх платформах.

source: The file path of the null device. For example: ``'/dev/null'`` for POSIX, ``'nul'`` for Windows. Also available via :mod:`os.path`.
ru: Путь к файлу нулевого устройства. Например: ``'/dev/null'`` для POSIX, ``'ноль'`` для Windows. Также доступно через :mod:`os.path` .
uk: Шлях до файлу нульового пристрою. Наприклад: ``'/dev/null`` для POSIX, ``'nul'`` для Windows. Також доступний через :mod:`os.path`.

source: Flags for use with the :func:`~sys.setdlopenflags` and :func:`~sys.getdlopenflags` functions. See the Unix manual page :manpage:`dlopen(3)` for what the different flags mean.
ru: Флаги для использования с :func:`~sys.setdlopenflags` и :func:`~sys.getdlopenflags` функции. См. страницу руководства Unix. :manpage:`dlopen(3)` что означают разные флаги.
uk: Прапори для використання з функціями :func:`~sys.setdlopenflags` і :func:`~sys.getdlopenflags`. Що означають різні прапорці, див. сторінку посібника Unix :manpage:`dlopen(3)`.

source: Random numbers
ru: Случайные числа
uk: Випадкові числа

source: Get up to *size* random bytes. The function can return less bytes than requested.
ru: Получите до *size* случайных байтов. Функция может вернуть меньше байтов, чем запрошено.
uk: Отримайте до *size* випадкових байтів. Функція може повертати менше байтів, ніж вимагається.

source: These bytes can be used to seed user-space random number generators or for cryptographic purposes.
ru: Эти байты можно использовать для заполнения генераторов случайных чисел в пользовательском пространстве или в криптографических целях.
uk: Ці байти можна використовувати для заповнення генераторів випадкових чисел у просторі користувача або для криптографічних цілей.

source: ``getrandom()`` relies on entropy gathered from device drivers and other sources of environmental noise. Unnecessarily reading large quantities of data will have a negative impact on other users of the ``/dev/random`` and ``/dev/urandom`` devices.
ru: ``герандом()`` полагается на энтропию, собранную из драйверов устройств и других источников шума окружающей среды. Чрезмерное чтение больших объемов данных окажет негативное влияние на других пользователей. ``/dev/random`` и ``/dev/urandom`` устройства.
uk: ``getrandom()`` покладається на ентропію, зібрану з драйверів пристроїв та інших джерел шуму навколишнього середовища. Невиправдане зчитування великої кількості даних матиме негативний вплив на інших користувачів пристроїв ``/dev/random`` і ``/dev/urandom``.

source: The flags argument is a bit mask that can contain zero or more of the following values ORed together: :py:data:`os.GRND_RANDOM` and :py:data:`GRND_NONBLOCK`.
uk: Аргумент flags — це бітова маска, яка може містити нуль або більше таких значень, об’єднаних АБО: :py:data:`os.GRND_RANDOM` і :py:data:`GRND_NONBLOCK`.

source: See also the `Linux getrandom() manual page <http://man7.org/linux/man-pages/man2/getrandom.2.html>`_.
uk: Дивіться також сторінку `посібника Linux getrandom() <http://man7.org/linux/man-pages/man2/getrandom.2.html>`_.

source: :ref:`Availability <availability>`: Linux 3.17 and newer.
uk: :ref:`Наявність <availability>`: Linux 3.17 і новіші версії.

source: Return a bytestring of *size* random bytes suitable for cryptographic use.
ru: Возвращает строку *size* случайных байтов, подходящую для криптографического использования.
uk: Повертає байтовий рядок *розміру* випадкових байтів, придатних для криптографічного використання.

source: This function returns random bytes from an OS-specific randomness source. The returned data should be unpredictable enough for cryptographic applications, though its exact quality depends on the OS implementation.
ru: Эта функция возвращает случайные байты из источника случайности, специфичного для ОС. Возвращаемые данные должны быть достаточно непредсказуемыми для криптографических приложений, хотя их точное качество зависит от реализации ОС.
uk: Ця функція повертає випадкові байти зі специфічного для ОС джерела випадковості. Повернуті дані мають бути досить непередбачуваними для криптографічних програм, хоча їх точна якість залежить від реалізації ОС.

source: On Linux, if the ``getrandom()`` syscall is available, it is used in blocking mode: block until the system urandom entropy pool is initialized (128 bits of entropy are collected by the kernel). See the :pep:`524` for the rationale. On Linux, the :func:`getrandom` function can be used to get random bytes in non-blocking mode (using the :data:`GRND_NONBLOCK` flag) or to poll until the system urandom entropy pool is initialized.
ru: В Linux, если ``герандом()`` Системный вызов доступен, он используется в режиме блокировки: блокируется до тех пор, пока не будет инициализирован пул случайной энтропии системы (128 бит энтропии собирается ядром). См. :pep:`524` для обоснования. В Linux :func:`случайный` функцию можно использовать для получения случайных байтов в неблокирующем режиме (с помощью :data:`GRND_NONBLOCK` флаг) или опросить до тех пор, пока не будет инициализирован системный пул случайной энтропии.
uk: У Linux, якщо доступний системний виклик ``getrandom()``, він використовується в режимі блокування: блокуйте, доки системний пул випадкової ентропії не буде ініціалізовано (128 біт ентропії збирає ядро). Перегляньте :pep:`524` для обґрунтування. У Linux функція :func:`getrandom` може бути використана для отримання випадкових байтів у неблокуючому режимі (використовуючи прапор :data:`GRND_NONBLOCK`) або для опитування, доки системний пул випадкової ентропії не буде ініціалізовано.

source: On a Unix-like system, random bytes are read from the ``/dev/urandom`` device. If the ``/dev/urandom`` device is not available or not readable, the :exc:`NotImplementedError` exception is raised.
ru: В Unix-подобной системе случайные байты считываются из ``/dev/urandom`` устройство. Если ``/dev/urandom`` устройство недоступно или не читается, :exc:`NotImplementedError` возникает исключение.
uk: У Unix-подібній системі випадкові байти зчитуються з пристрою ``/dev/urandom``. Якщо пристрій ``/dev/urandom`` недоступний або не читається, виникає виняток :exc:`NotImplementedError`.

source: The :mod:`secrets` module provides higher level functions. For an easy-to-use interface to the random number generator provided by your platform, please see :class:`random.SystemRandom`.
ru: The :mod:`секреты` модуль обеспечивает функции более высокого уровня. Простой в использовании интерфейс генератора случайных чисел, предоставляемый вашей платформой, см. :class:`random.SystemRandom` .
uk: Модуль :mod:`secrets` забезпечує функції вищого рівня. Про простий у використанні інтерфейс генератора випадкових чисел, наданий вашою платформою, див. :class:`random.SystemRandom`.

source: On Linux, ``getrandom()`` is now used in blocking mode to increase the security.
ru: В Linux, ``герандом()`` теперь используется в режиме блокировки для повышения безопасности.
uk: У Linux ``getrandom()`` тепер використовується в режимі блокування для підвищення безпеки.

source: On Linux, if the ``getrandom()`` syscall blocks (the urandom entropy pool is not initialized yet), fall back on reading ``/dev/urandom``.
ru: В Linux, если ``герандом()`` блоки системных вызовов (пул случайной энтропии еще не инициализирован), возвращаются к чтению ``/dev/urandom`` .
uk: У Linux, якщо системний виклик ``getrandom()`` блокує (пул ентропії urandom ще не ініціалізовано), поверніться до читання ``/dev/urandom``.

source: On Linux 3.17 and newer, the ``getrandom()`` syscall is now used when available. On OpenBSD 5.6 and newer, the C ``getentropy()`` function is now used. These functions avoid the usage of an internal file descriptor.
ru: В Linux 3.17 и новее ``герандом()`` syscall теперь используется, когда он доступен. В OpenBSD 5.6 и новее C ``getentropy()`` функция теперь используется. Эти функции избегают использования внутреннего файлового дескриптора.
uk: У Linux 3.17 і новіших версіях системний виклик ``getrandom()`` тепер використовується, якщо він доступний. У OpenBSD 5.6 і новіших версіях тепер використовується функція C ``getentropy()``. Ці функції уникають використання внутрішнього файлового дескриптора.

source: By default, when reading from ``/dev/random``, :func:`getrandom` blocks if no random bytes are available, and when reading from ``/dev/urandom``, it blocks if the entropy pool has not yet been initialized.
ru: По умолчанию при чтении из ``/dev/random`` , :func:`случайный` блокируется, если случайные байты недоступны, а также при чтении из ``/dev/urandom`` , он блокируется, если энтропийный пул еще не инициализирован.
uk: За замовчуванням під час читання з ``/dev/random`` :func:`getrandom` блокує, якщо випадкові байти недоступні, а під час читання з ``/dev/urandom`` блокує, якщо пул ентропії не має ще не ініціалізовано.

source: If the :py:data:`GRND_NONBLOCK` flag is set, then :func:`getrandom` does not block in these cases, but instead immediately raises :exc:`BlockingIOError`.
ru: Если :py:data:`GRND_NONBLOCK` флаг установлен, то :func:`случайный` в этих случаях не блокирует, а сразу поднимает :exc:`BlockingIOError` .
uk: Якщо встановлено прапорець :py:data:`GRND_NONBLOCK`, то :func:`getrandom` не блокує в цих випадках, а замість цього негайно викликає :exc:`BlockingIOError`.

source: If this bit is set, then random bytes are drawn from the ``/dev/random`` pool instead of the ``/dev/urandom`` pool.
ru: Если этот бит установлен, то из памяти извлекаются случайные байты. ``/dev/random`` бассейн вместо ``/dev/urandom`` бассейн.
uk: Якщо цей біт установлено, випадкові байти витягуються з пулу ``/dev/random`` замість пулу ``/dev/urandom``.

source: Return list of group ids that *user* belongs to. If *group* is not in the list, it is included; typically, *group* is specified as the group ID field from the password record for *user*, because that group ID will otherwise be potentially omitted.
ru: Возвращает список идентификаторов групп, к которым принадлежит *user*. Если *group* нет в списке, она включается; обычно *group* указывается в качестве поля идентификатора группы из записи пароля для *user*, поскольку в противном случае этот идентификатор группы может быть опущен.

source: On Windows, a *mode* of ``0o700`` is specifically handled to apply access control to the new directory such that only the current user and administrators have access. Other values of *mode* are ignored.
ru: В Windows *режим* ``0o700`` специально обрабатывается для применения контроля доступа к новому каталогу, чтобы доступ имели только текущий пользователь и администраторы. Другие значения *mode* игнорируются.

source: Windows now handles a *mode* of ``0o700``.
ru: Windows теперь поддерживает *режим* ``0o700`` .
