Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/os.po
Languages: ru, uk

source: Send signal *sig* to the process *pid*. Constants for the specific signals available on the host platform are defined in the :mod:`signal` module.
ru: Отправьте сигнал *sig* процессу *pid*. Константы для конкретных сигналов, доступных на хост-платформе, определены в :mod:`сигнал` модуль.
uk: Надішліть сигнал *sig* процесу *pid*. Константи для конкретних сигналів, доступних на хост-платформі, визначаються в модулі :mod:`signal`.

source: Windows: The :data:`signal.CTRL_C_EVENT` and :data:`signal.CTRL_BREAK_EVENT` signals are special signals which can only be sent to console processes which share a common console window, e.g., some subprocesses. Any other value for *sig* will cause the process to be unconditionally killed by the TerminateProcess API, and the exit code will be set to *sig*. The Windows version of :func:`kill` additionally takes process handles to be killed.
uk: Windows: Сигнали :data:`signal.CTRL_C_EVENT` і :data:`signal.CTRL_BREAK_EVENT` є спеціальними сигналами, які можна надсилати лише процесам консолі, які мають спільне вікно консолі, наприклад, деякі підпроцеси. Будь-яке інше значення для *sig* спричинить безумовне припинення процесу API TerminateProcess, а код виходу буде встановлено на *sig*. Версія :func:`kill` для Windows додатково приймає дескриптори процесу, які потрібно знищити.

source: See also :func:`signal.pthread_kill`.
ru: См. также :func:`signal.pthread_kill`.
uk: Дивіться також :func:`signal.pthread_kill`.

source: Raises an :ref:`auditing event <auditing>` ``os.kill`` with arguments ``pid``, ``sig``.
ru: Вызывает :ref:`событие аудита ` ``os.kill`` с аргументами ``пид`` , ``скажи'' .
uk: Викликає :ref:`подію аудиту <auditing>` ``os.kill`` з аргументами ``pid``, ``sig``.

source: Windows support.
ru: Поддержка Windos.
uk: Підтримка Windows.

source: Send the signal *sig* to the process group *pgid*.
ru: Отправьте сигнал *sig* группе процессов *pgid*.
uk: Надішліть сигнал *sig* до групи процесів *pgid*.

source: Raises an :ref:`auditing event <auditing>` ``os.killpg`` with arguments ``pgid``, ``sig``.
ru: Вызывает :ref:`событие аудита ` ``os.killpg`` с аргументами ``pgid`` , ``скажи'' .
uk: Викликає :ref:`подію аудиту <auditing>` ``os.killpg`` з аргументами ``pgid``, ``sig``.

source: Add *increment* to the process's "niceness". Return the new niceness.
ru: Добавьте *приращение* к «красивости» процесса. Верните новую красоту.
uk: Додайте *приріст* до "витонченості" процесу. Поверніть нову привабливість.

source: Return a file descriptor referring to the process *pid*. This descriptor can be used to perform process management without races and signals. The *flags* argument is provided for future extensions; no flag values are currently defined.
uk: Повертає дескриптор файлу, який посилається на процес *pid*. Цей дескриптор можна використовувати для керування процесом без перегонів і сигналів. Аргумент *flags* надається для майбутніх розширень; значення прапорів наразі не визначено.

source: See the :manpage:`pidfd_open(2)` man page for more details.
ru: См. :manpage:`pidfd_open(2)` справочную страницу для более подробной информации.
uk: Додаткову інформацію можна знайти на сторінці довідки :manpage:`pidfd_open(2)`.

source: :ref:`Availability <availability>`: Linux 5.3+
uk: :ref:`Доступність <availability>`: Linux 5.3+

source: Lock program segments into memory. The value of *op* (defined in ``<sys/lock.h>``) determines which segments are locked.
ru: Блокировка сегментов программы в памяти. Значение *op* (определенное в ``<sys/lock.h>`` ) определяет, какие сегменты заблокированы.
uk: Блокування сегментів програми в пам'яті. Значення *op* (визначене в ``<sys/lock.h>``) визначає, які сегменти заблоковано.

source: The ``close`` method returns :const:`None` if the subprocess exited successfully, or the subprocess's return code if there was an error. On POSIX systems, if the return code is positive it represents the return value of the process left-shifted by one byte. If the return code is negative, the process was terminated by the signal given by the negated value of the return code. (For example, the return value might be ``- signal.SIGKILL`` if the subprocess was killed.) On Windows systems, the return value contains the signed integer return code from the child process.
ru: The ``закрыть`` метод возвращает :const:`Нет` если подпроцесс завершился успешно, или код возврата подпроцесса, если произошла ошибка. В системах POSIX, если код возврата положительный, он представляет возвращаемое значение процесса, сдвинутое влево на один байт. Если код возврата отрицательный, процесс был завершен по сигналу, заданному отрицательным значением кода возврата. (Например, возвращаемое значение может быть ``- сигнал.SIGKILL`` если подпроцесс был уничтожен.) В системах Windows возвращаемое значение содержит целочисленный код возврата со знаком из дочернего процесса.
uk: Метод ``close`` повертає :const:`None`, якщо підпроцес завершився успішно, або код повернення підпроцесу, якщо сталася помилка. У системах POSIX, якщо код повернення позитивний, він представляє значення, що повертається процесом, зміщене вліво на один байт. Якщо код повернення від’ємний, це означає, що процес було припинено за допомогою сигналу, поданого зведеним значенням коду повернення. (Наприклад, значення, що повертається, може бути ``- signal.SIGKILL``, якщо підпроцес було закрито.) У системах Windows значення, що повертається, містить цілочисельний код повернення зі знаком від дочірнього процесу.

source: On Unix, :func:`waitstatus_to_exitcode` can be used to convert the ``close`` method result (exit status) into an exit code if it is not ``None``. On Windows, the ``close`` method result is directly the exit code (or ``None``).
ru: В Unix, :func:`waitstatus_to_exitcode` может быть использован для преобразования ``закрыть`` результат метода (статус выхода) в код выхода, если это не так ``Нет`` . В Windows ``закрыть`` Результат метода — это непосредственно код выхода (или ``Нет`` ).
uk: В Unix :func:`waitstatus_to_exitcode` можна використовувати для перетворення результату методу ``close`` (статус виходу) у код виходу, якщо він не ``None``. У Windows результатом методу ``close`` є безпосередньо код виходу (або ``None``).

source: This is implemented using :class:`subprocess.Popen`; see that class's documentation for more powerful ways to manage and communicate with subprocesses.
ru: Это реализовано с помощью :class:`subprocess.Popen` ; см. документацию этого класса, чтобы узнать о более мощных способах управления подпроцессами и взаимодействия с ними.
uk: Це реалізовано за допомогою :class:`subprocess.Popen`; перегляньте документацію цього класу, щоб дізнатися про більш потужні способи керування підпроцесами та спілкування з ними.

source: Wraps the :c:func:`posix_spawn` C library API for use from Python.
uk: Обгортає API бібліотеки C :c:func:`posix_spawn` для використання з Python.

source: Most users should use :func:`subprocess.run` instead of :func:`posix_spawn`.
ru: Большинству пользователей следует использовать :func:`subprocess.run` вместо :func:`posix_spawn` .
uk: Більшість користувачів повинні використовувати :func:`subprocess.run` замість :func:`posix_spawn`.

source: The positional-only arguments *path*, *args*, and *env* are similar to :func:`execve`.
ru: Позиционные аргументы *path*, *args* и *env* аналогичны :func:`execve`.
uk: Лише позиційні аргументи *path*, *args* і *env* подібні до :func:`execve`.

source: The *path* parameter is the path to the executable file. The *path* should contain a directory. Use :func:`posix_spawnp` to pass an executable file without directory.
ru: Параметр *path* — это путь к исполняемому файлу. *Путь* должен содержать каталог. Использовать :func:`posix_spawnp` передать исполняемый файл без каталога.
uk: Параметр *path* — це шлях до виконуваного файлу. *Шлях* має містити каталог. Використовуйте :func:`posix_spawnp`, щоб передати виконуваний файл без каталогу.

source: The *file_actions* argument may be a sequence of tuples describing actions to take on specific file descriptors in the child process between the C library implementation's :c:func:`fork` and :c:func:`exec` steps. The first item in each tuple must be one of the three type indicator listed below describing the remaining tuple elements:
ru: Аргумент *file_actions* может представлять собой последовательность кортежей, описывающих действия, которые необходимо выполнить над конкретными файловыми дескрипторами в дочернем процессе между реализациями библиотеки C. :c:func:`вилка` и :c:func:`exec` шаги. Первый элемент в каждом кортеже должен быть одним из трех индикаторов типа, перечисленных ниже, описывающих остальные элементы кортежа:
uk: Аргумент *file_actions* може бути послідовністю кортежів, що описують дії, які потрібно виконати над певними дескрипторами файлів у дочірньому процесі між кроками :c:func:`fork` і :c:func:`exec` реалізації бібліотеки C. Перший елемент у кожному кортежі має бути одним із трьох наведених нижче індикаторів типу, що описують інші елементи кортежу:

source: (``os.POSIX_SPAWN_OPEN``, *fd*, *path*, *flags*, *mode*)
ru: ( ``os.POSIX_SPAWN_OPEN`` , *fd*, *путь*, *флаги*, *режим*)
uk: (``os.POSIX_SPAWN_OPEN``, *fd*, *шлях*, *прапори*, *режим*)

source: Performs ``os.dup2(os.open(path, flags, mode), fd)``.
ru: Выполняет ``os.dup2(os.open(путь, флаги, режим), fd)`` .
uk: Виконує ``os.dup2(os.open(path, flags, mode), fd)``.

source: Performs ``os.close(fd)``.
ru: Выполняет ``os.close(fd)`` .
uk: Виконує ``os.close(fd)``.

source: Performs ``os.dup2(fd, new_fd)``.
ru: Выполняет ``os.dup2(fd, new_fd)`` .
uk: Виконує ``os.dup2(fd, new_fd)``.

source: These tuples correspond to the C library :c:func:`posix_spawn_file_actions_addopen`, :c:func:`posix_spawn_file_actions_addclose`, and :c:func:`posix_spawn_file_actions_adddup2` API calls used to prepare for the :c:func:`posix_spawn` call itself.
uk: Ці кортежі відповідають викликам API бібліотеки C :c:func:`posix_spawn_file_actions_addopen`, :c:func:`posix_spawn_file_actions_addclose` і :c:func:`posix_spawn_file_actions_adddup2`, які використовуються для підготовки до виклику :c:func:`posix_spawn` себе.

source: The *setpgroup* argument will set the process group of the child to the value specified. If the value specified is 0, the child's process group ID will be made the same as its process ID. If the value of *setpgroup* is not set, the child will inherit the parent's process group ID. This argument corresponds to the C library :c:data:`POSIX_SPAWN_SETPGROUP` flag.
uk: Аргумент *setpgroup* встановить групу дочірніх процесів на вказане значення. Якщо вказане значення дорівнює 0, ідентифікатор групи дочірнього процесу буде таким самим, як ідентифікатор її процесу. Якщо значення *setpgroup* не встановлено, дочірній процес успадкує ідентифікатор групи батьківського процесу. Цей аргумент відповідає позначці бібліотеки C :c:data:`POSIX_SPAWN_SETPGROUP`.

source: If the *resetids* argument is ``True`` it will reset the effective UID and GID of the child to the real UID and GID of the parent process. If the argument is ``False``, then the child retains the effective UID and GID of the parent. In either case, if the set-user-ID and set-group-ID permission bits are enabled on the executable file, their effect will override the setting of the effective UID and GID. This argument corresponds to the C library :c:data:`POSIX_SPAWN_RESETIDS` flag.
uk: Якщо аргумент *resetids* має значення ``True``, ефективний UID і GID дочірнього процесу буде скинуто до реального UID і GID батьківського процесу. Якщо аргумент ``False``, тоді дочірній елемент зберігає ефективний UID та GID батьківського. У будь-якому випадку, якщо біти дозволу set-user-ID і set-group-ID увімкнуто для виконуваного файлу, їх дія перевизначить налаштування ефективного UID і GID. Цей аргумент відповідає позначці бібліотеки C :c:data:`POSIX_SPAWN_RESETIDS`.

source: If the *setsid* argument is ``True``, it will create a new session ID for `posix_spawn`. *setsid* requires :c:data:`POSIX_SPAWN_SETSID` or :c:data:`POSIX_SPAWN_SETSID_NP` flag. Otherwise, :exc:`NotImplementedError` is raised.
uk: Якщо аргумент *setsid* має значення ``True``, він створить новий ідентифікатор сеансу для `posix_spawn`. *setsid* потребує позначки :c:data:`POSIX_SPAWN_SETSID` або :c:data:`POSIX_SPAWN_SETSID_NP`. В іншому випадку виникає :exc:`NotImplementedError`.

source: The *setsigmask* argument will set the signal mask to the signal set specified. If the parameter is not used, then the child inherits the parent's signal mask. This argument corresponds to the C library :c:data:`POSIX_SPAWN_SETSIGMASK` flag.
uk: Аргумент *setsigmask* встановить маску сигналу на вказаний набір сигналів. Якщо параметр не використовується, то нащадок успадковує сигнальну маску батька. Цей аргумент відповідає прапорцю бібліотеки C :c:data:`POSIX_SPAWN_SETSIGMASK`.

source: The *sigdef* argument will reset the disposition of all signals in the set specified. This argument corresponds to the C library :c:data:`POSIX_SPAWN_SETSIGDEF` flag.
uk: Аргумент *sigdef* скине розташування всіх сигналів у вказаному наборі. Цей аргумент відповідає позначці бібліотеки C :c:data:`POSIX_SPAWN_SETSIGDEF`.

source: The *scheduler* argument must be a tuple containing the (optional) scheduler policy and an instance of :class:`sched_param` with the scheduler parameters. A value of ``None`` in the place of the scheduler policy indicates that is not being provided. This argument is a combination of the C library :c:data:`POSIX_SPAWN_SETSCHEDPARAM` and :c:data:`POSIX_SPAWN_SETSCHEDULER` flags.
uk: Аргумент *scheduler* має бути кортежем, що містить (необов’язкову) політику планувальника та екземпляр :class:`sched_param` з параметрами планувальника. Значення ``None`` замість політики планувальника вказує, що не надається. Цей аргумент є комбінацією прапорів бібліотеки C :c:data:`POSIX_SPAWN_SETSCHEDPARAM` і :c:data:`POSIX_SPAWN_SETSCHEDULER`.

source: Raises an :ref:`auditing event <auditing>` ``os.posix_spawn`` with arguments ``path``, ``argv``, ``env``.
ru: Вызывает :ref:`событие аудита ` ``os.posix_spawn`` с аргументами ``путь`` , ``argv`` , ``окр`` .
uk: Викликає :ref:`подію аудиту <auditing>` ``os.posix_spawn`` з аргументами ``path``, ``argv``, ``env``.

source: Wraps the :c:func:`posix_spawnp` C library API for use from Python.
uk: Обгортає API бібліотеки C :c:func:`posix_spawnp` для використання з Python.

source: Similar to :func:`posix_spawn` except that the system searches for the *executable* file in the list of directories specified by the :envvar:`PATH` environment variable (in the same way as for ``execvp(3)``).
ru: Похоже на: :func:`posix_spawn` за исключением того, что система ищет *исполняемый* файл в списке каталогов, указанном :envvar:`ПУТЬ` переменная среды (так же, как и для ``execvp(3)`` ).
uk: Подібно до :func:`posix_spawn`, за винятком того, що система шукає *виконуваний* файл у списку каталогів, визначених змінною середовища :envvar:`PATH` (так само, як і для ``execvp(3)`` ).

source: :ref:`Availability <availability>`: See :func:`posix_spawn` documentation.
uk: :ref:`Доступність <availability>`: Див. документацію :func:`posix_spawn`.

source: Register callables to be executed when a new child process is forked using :func:`os.fork` or similar process cloning APIs. The parameters are optional and keyword-only. Each specifies a different call point.
ru: Зарегистрируйте вызываемые объекты, которые будут выполняться при разветвлении нового дочернего процесса, используя :func:`os.fork` или аналогичные API-интерфейсы клонирования процессов. Параметры являются необязательными и используются только по ключевым словам. Каждый определяет другую точку вызова.
uk: Зареєструйте виклики, які будуть виконуватися, коли новий дочірній процес розгалужується за допомогою :func:`os.fork` або аналогічного API клонування процесу. Параметри є необов’язковими та містять лише ключові слова. Кожен із них визначає окремий пункт виклику.

source: *before* is a function called before forking a child process.
ru: *before* — это функция, вызываемая перед разветвлением дочернего процесса.
uk: *before* — це функція, яка викликається перед розгалуженням дочірнього процесу.

source: *after_in_parent* is a function called from the parent process after forking a child process.
ru: *after_in_parent* — это функция, вызываемая из родительского процесса после разветвления дочернего процесса.
uk: *after_in_parent* — це функція, яка викликається з батьківського процесу після розгалуження дочірнього процесу.

source: *after_in_child* is a function called from the child process.
ru: *after_in_child* — это функция, вызываемая из дочернего процесса.
uk: *after_in_child* — це функція, яка викликається з дочірнього процесу.

source: These calls are only made if control is expected to return to the Python interpreter. A typical :mod:`subprocess` launch will not trigger them as the child is not going to re-enter the interpreter.
ru: Эти вызовы выполняются только в том случае, если ожидается, что управление вернется к интерпретатору Python. Типичный :mod:`подпроцесс` запуск не вызовет их, поскольку ребенок не собирается повторно входить в интерпретатор.
uk: Ці виклики здійснюються лише в тому випадку, якщо очікується, що контроль повернеться до інтерпретатора Python. Типовий запуск підпроцесу :mod:`subprocess` не запустить їх, оскільки дитина не збирається повторно входити в інтерпретатор.

source: Functions registered for execution before forking are called in reverse registration order. Functions registered for execution after forking (either in the parent or in the child) are called in registration order.
ru: Функции, зарегистрированные для выполнения до разветвления, вызываются в обратном порядке регистрации. Функции, зарегистрированные для выполнения после разветвления (либо в родительском, либо в дочернем элементе), вызываются в порядке регистрации.
uk: Функції, зареєстровані для виконання перед розгалуженням, викликаються у зворотному порядку реєстрації. Функції, зареєстровані для виконання після розгалуження (або в батьківському, або в дочірньому) викликаються в порядку реєстрації.

source: Note that :c:func:`fork` calls made by third-party C code may not call those functions, unless it explicitly calls :c:func:`PyOS_BeforeFork`, :c:func:`PyOS_AfterFork_Parent` and :c:func:`PyOS_AfterFork_Child`.
ru: Обратите внимание, что :c:func:`вилка` вызовы, сделанные сторонним кодом C, не могут вызывать эти функции, если только он явно не вызывает :c:func:`PyOS_BeforeFork` , :c:func:`PyOS_AfterFork_Parent` и :c:func:`PyOS_AfterFork_Child` .
uk: Зауважте, що виклики :c:func:`fork`, здійснені стороннім C-кодом, можуть не викликати ці функції, якщо тільки вони явно не викликають :c:func:`PyOS_BeforeFork`, :c:func:`PyOS_AfterFork_Parent` і :c:func:`PyOS_AfterFork_Child`.

source: There is no way to unregister a function.
ru: Отменить регистрацию функции невозможно.
uk: Немає способу скасувати реєстрацію функції.

source: Execute the program *path* in a new process.
ru: Выполните программу *путь* в новом процессе.
uk: Виконайте *шлях* програми в новому процесі.

source: (Note that the :mod:`subprocess` module provides more powerful facilities for spawning new processes and retrieving their results; using that module is preferable to using these functions. Check especially the :ref:`subprocess-replacements` section.)
ru: (Обратите внимание, что :mod:`подпроцесс` модуль предоставляет более мощные возможности для создания новых процессов и получения их результатов; использование этого модуля предпочтительнее использования этих функций. Особенно проверьте :ref:`замены подпроцессов` раздел.)
uk: (Зверніть увагу, що модуль :mod:`subprocess` надає потужніші можливості для створення нових процесів і отримання їх результатів; використання цього модуля є кращим, ніж використання цих функцій. Особливо перевірте розділ :ref:`subprocess-replacements`.)

source: If *mode* is :const:`P_NOWAIT`, this function returns the process id of the new process; if *mode* is :const:`P_WAIT`, returns the process's exit code if it exits normally, or ``-signal``, where *signal* is the signal that killed the process. On Windows, the process id will actually be the process handle, so can be used with the :func:`waitpid` function.
ru: Если *режим* :const:`P_NOWAIT` , эта функция возвращает идентификатор нового процесса; если *режим* есть :const:`P_WAIT` , возвращает код завершения процесса, если он завершается нормально, или ``-сигнал`` , где *сигнал* — сигнал, вызвавший завершение процесса. В Windows идентификатор процесса на самом деле будет дескриптором процесса, поэтому его можно использовать с :func:`waitpid` функция.
uk: Якщо *mode* :const:`P_NOWAIT`, ця функція повертає ідентифікатор процесу нового процесу; якщо *mode* дорівнює :const:`P_WAIT`, повертає код виходу процесу, якщо він завершується нормально, або ``-signal``, де *signal* є сигналом, який зупинив процес. У Windows ідентифікатор процесу фактично буде ідентифікатором процесу, тому його можна використовувати з функцією :func:`waitpid`.

source: Note on VxWorks, this function doesn't return ``-signal`` when the new process is killed. Instead it raises OSError exception.
ru: Обратите внимание, что в VxWorks эта функция не возвращает результат. ``-сигнал`` когда новый процесс будет убит. Вместо этого он вызывает исключение OSError.
uk: Зверніть увагу на VxWorks, ця функція не повертає ``-signal``, коли новий процес завершується. Натомість викликає виняток OSError.

source: The "l" and "v" variants of the :func:`spawn\* <spawnl>` functions differ in how command-line arguments are passed. The "l" variants are perhaps the easiest to work with if the number of parameters is fixed when the code is written; the individual parameters simply become additional parameters to the :func:`spawnl\*` functions. The "v" variants are good when the number of parameters is variable, with the arguments being passed in a list or tuple as the *args* parameter. In either case, the arguments to the child process must start with the name of the command being run.
uk: Варіанти "l" і "v" функцій :func:`spawn\* <spawnl>` відрізняються способом передачі аргументів командного рядка. Варіанти "l", мабуть, найлегші для роботи, якщо кількість параметрів фіксована під час написання коду; окремі параметри просто стають додатковими параметрами до функцій :func:`spawnl\*`. Варіанти "v" хороші, коли кількість параметрів є змінною, а аргументи передаються у списку або кортежі як параметр *args*. У будь-якому випадку аргументи дочірнього процесу повинні починатися з назви команди, яка виконується.
