Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/os.po
Languages: ru, uk

source: Set the flags of *path* to the numeric *flags*, like :func:`chflags`, but do not follow symbolic links. As of Python 3.3, this is equivalent to ``os.chflags(path, flags, follow_symlinks=False)``.
ru: Установите флаги *path* в числовые *flags*, например :func:`chflags` , но не переходите по символическим ссылкам. Начиная с Python 3.3, это эквивалентно ``os.chflags(path, flags, Follow_symlinks=False)`` .
uk: Встановіть прапорці *path* на числові *flags*, наприклад :func:`chflags`, але не переходьте за символічними посиланнями. Починаючи з Python 3.3, це еквівалентно ``os.chflags(path, flags, follow_symlinks=False)``.

source: Change the mode of *path* to the numeric *mode*. If path is a symlink, this affects the symlink rather than the target. See the docs for :func:`chmod` for possible values of *mode*. As of Python 3.3, this is equivalent to ``os.chmod(path, mode, follow_symlinks=False)``.
ru: Измените режим *path* на числовой *mode*. Если путь является символической ссылкой, это влияет на символическую ссылку, а не на цель. См. документацию для :func:`chmod` для возможных значений *mode*. Начиная с Python 3.3, это эквивалентно ``os.chmod(path, mode, Follow_symlinks=False)`` .
uk: Змініть режим *шляху* на числовий *режим*. Якщо шлях є символічним посиланням, це впливає на символічне посилання, а не на ціль. Перегляньте документацію для :func:`chmod`, щоб дізнатися про можливі значення *mode*. Починаючи з Python 3.3, це еквівалентно ``os.chmod(path, mode, follow_symlinks=False)``.

source: Change the owner and group id of *path* to the numeric *uid* and *gid*. This function will not follow symbolic links. As of Python 3.3, this is equivalent to ``os.chown(path, uid, gid, follow_symlinks=False)``.
ru: Измените владельца и идентификатор группы *path* на числовые *uid* и *gid*. Эта функция не будет следовать по символическим ссылкам. Начиная с Python 3.3, это эквивалентно ``os.chown(path, uid, gid, Follow_symlinks=False)`` .
uk: Змініть власника та ідентифікатор групи *path* на числові *uid* і *gid*. Ця функція не переходитиме за символічними посиланнями. Починаючи з Python 3.3, це еквівалентно ``os.chown(path, uid, gid, follow_symlinks=False)``.

source: Create a hard link pointing to *src* named *dst*.
ru: Создайте жесткую ссылку, указывающую на *src* с именем *dst*.
uk: Створіть жорстке посилання на *src* під назвою *dst*.

source: This function can support specifying *src_dir_fd* and/or *dst_dir_fd* to supply :ref:`paths relative to directory descriptors <dir_fd>`, and :ref:`not following symlinks <follow_symlinks>`.
ru: Эта функция может поддерживать указание *src_dir_fd* и/или *dst_dir_fd* для предоставления :ref:`путей относительно дескрипторов каталогов. ` и :ref:`не переходить по символическим ссылкам`.
uk: Ця функція може підтримувати вказівку *src_dir_fd* та/або *dst_dir_fd* для надання :ref:`шляхів відносно дескрипторів каталогу <dir_fd>`, і :ref:`не слідування за символічними посиланнями <follow_symlinks>`.

source: Raises an :ref:`auditing event <auditing>` ``os.link`` with arguments ``src``, ``dst``, ``src_dir_fd``, ``dst_dir_fd``.
ru: Вызывает :ref:`событие аудита ` ``os.link`` с аргументами ``источник`` , ``летнее время`` , ``src_dir_fd`` , ``dst_dir_fd`` .
uk: Викликає :ref:`подію аудиту <auditing>` ``os.link`` з аргументами ``src``, ``dst``, ``src_dir_fd``, ``dst_dir_fd``.

source: Added Windows support.
ru: Добавлена поддержка Windows.
uk: Додана підтримка Windows.

source: Added the *src_dir_fd*, *dst_dir_fd*, and *follow_symlinks* arguments.
uk: Додано аргументи *src_dir_fd*, *dst_dir_fd* і *follow_symlinks*.

source: Accepts a :term:`path-like object` for *src* and *dst*.
ru: Принимает объект, похожий на путь, для *src* и *dst*.
uk: Приймає :term:`path-like object` для *src* і *dst*.

source: Return a list containing the names of the entries in the directory given by *path*. The list is in arbitrary order, and does not include the special entries ``'.'`` and ``'..'`` even if they are present in the directory. If a file is removed from or added to the directory during the call of this function, whether a name for that file be included is unspecified.
ru: Возвращает список, содержащий имена записей в каталоге, заданном *path*. Список составлен в произвольном порядке и не включает специальные записи. ``'.'`` и ``'..'`` даже если они присутствуют в каталоге. Если файл удаляется из каталога или добавляется в него во время вызова этой функции, не указано, будет ли включено имя этого файла.
uk: Повертає список, що містить імена записів у каталозі, заданому *шляхом*. Список розташований у довільному порядку й не містить спеціальних записів ``'.''`` і ``'..''``, навіть якщо вони присутні в каталозі. Якщо файл видалено з каталогу або додано до нього під час виклику цієї функції, не вказано, чи буде включено ім’я цього файлу.

source: *path* may be a :term:`path-like object`. If *path* is of type ``bytes`` (directly or indirectly through the :class:`PathLike` interface), the filenames returned will also be of type ``bytes``; in all other circumstances, they will be of type ``str``.
ru: *path* может быть :term:`объектом, похожим на путь`. Если *path* имеет тип ``байты`` (прямо или косвенно через :class:`PathLike` интерфейс), возвращаемые имена файлов также будут иметь тип ``байты`` ; во всех остальных случаях они будут типа ``ул`` .
uk: *path* може бути :term:`path-like object`. Якщо *path* має тип ``bytes`` (прямо чи опосередковано через інтерфейс :class:`PathLike`), повернуті імена файлів також будуть типу ``bytes``; за всіх інших обставин вони будуть типу ``str``.

source: This function can also support :ref:`specifying a file descriptor <path_fd>`; the file descriptor must refer to a directory.
ru: Эта функция также может поддерживать указание дескриптора файла. `; дескриптор файла должен ссылаться на каталог.
uk: Ця функція також може підтримувати :ref:`зазначення файлового дескриптора <path_fd>`; дескриптор файлу повинен посилатися на каталог.

source: Raises an :ref:`auditing event <auditing>` ``os.listdir`` with argument ``path``.
ru: Вызывает :ref:`событие аудита ` ``os.listdir`` с аргументом ``путь`` .
uk: Викликає :ref:`подію аудиту <auditing>` ``os.listdir`` з аргументом ``path``.

source: To encode ``str`` filenames to ``bytes``, use :func:`~os.fsencode`.
ru: Чтобы закодировать ``ул`` имена файлов в ``байты`` , использовать :func:`~os.fsencode` .
uk: Щоб закодувати ``str`` імена файлів у ``байти``, використовуйте :func:`~os.fsencode`.

source: The :func:`scandir` function returns directory entries along with file attribute information, giving better performance for many common use cases.
ru: The :func:`скандир` Функция возвращает записи каталога вместе с информацией об атрибутах файла, что повышает производительность во многих распространенных случаях использования.
uk: Функція :func:`scandir` повертає записи каталогу разом із інформацією про атрибути файлів, забезпечуючи кращу продуктивність у багатьох поширених випадках використання.

source: The *path* parameter became optional.
ru: Параметр *path* стал необязательным.
uk: Параметр *path* став необов'язковим.

source: Added support for specifying *path* as an open file descriptor.
ru: Добавлена ​​поддержка указания *path* в качестве дескриптора открытого файла.
uk: Додано підтримку вказівки *шляху* як дескриптора відкритого файлу.

source: Perform the equivalent of an :c:func:`lstat` system call on the given path. Similar to :func:`~os.stat`, but does not follow symbolic links. Return a :class:`stat_result` object.
uk: Виконайте еквівалент системного виклику :c:func:`lstat` на вказаному шляху. Подібно до :func:`~os.stat`, але не переходить за символічними посиланнями. Повертає об’єкт :class:`stat_result`.

source: On platforms that do not support symbolic links, this is an alias for :func:`~os.stat`.
ru: На платформах, которые не поддерживают символические ссылки, это псевдоним :func:`~os.stat` .
uk: На платформах, які не підтримують символічні посилання, це псевдонім для :func:`~os.stat`.

source: As of Python 3.3, this is equivalent to ``os.stat(path, dir_fd=dir_fd, follow_symlinks=False)``.
ru: Начиная с Python 3.3, это эквивалентно ``os.stat(path, dir_fd=dir_fd, Follow_symlinks=False)`` .
uk: Починаючи з Python 3.3, це еквівалентно ``os.stat(path, dir_fd=dir_fd, follow_symlinks=False)``.

source: This function can also support :ref:`paths relative to directory descriptors <dir_fd>`.
ru: Эта функция также может поддерживать пути относительно дескрипторов каталогов. `.
uk: Ця функція також може підтримувати :ref:`шляхи відносно дескрипторів каталогу <dir_fd>`.

source: Added support for Windows 6.0 (Vista) symbolic links.
ru: Добавлена ​​поддержка символических ссылок Windows 6.0 (Vista).
uk: Додано підтримку символічних посилань Windows 6.0 (Vista).

source: Added the *dir_fd* parameter.
ru: Добавлен параметр *dir_fd*.
uk: Додано параметр *dir_fd*.

source: On Windows, now opens reparse points that represent another path (name surrogates), including symbolic links and directory junctions. Other kinds of reparse points are resolved by the operating system as for :func:`~os.stat`.
ru: В Windows теперь открываются точки повторной обработки, представляющие другой путь (заместители имени), включая символические ссылки и соединения каталогов. Другие виды точек повторной обработки разрешаются операционной системой, как и для :func:`~os.stat` .
uk: У Windows тепер відкриваються точки повторного аналізу, які представляють інший шлях (сурогати імен), включаючи символічні посилання та з’єднання каталогів. Інші типи точок повторного аналізу вирішуються операційною системою як для :func:`~os.stat`.

source: Create a directory named *path* with numeric mode *mode*.
ru: Создайте каталог с именем *path* с числовым режимом *mode*.
uk: Створіть каталог під назвою *path* із числовим режимом *mode*.

source: If the directory already exists, :exc:`FileExistsError` is raised. If a parent directory in the path does not exist, :exc:`FileNotFoundError` is raised.
ru: Если каталог уже существует, :exc:`FileExistsError` поднят. Если родительский каталог по пути не существует, :exc:`FileNotFoundError` поднят.
uk: Якщо каталог уже існує, виникає :exc:`FileExistsError`. Якщо батьківський каталог у шляху не існує, виникає :exc:`FileNotFoundError`.

source: On some systems, *mode* is ignored. Where it is used, the current umask value is first masked out. If bits other than the last 9 (i.e. the last 3 digits of the octal representation of the *mode*) are set, their meaning is platform-dependent. On some platforms, they are ignored and you should call :func:`chmod` explicitly to set them.
ru: В некоторых системах *mode* игнорируется. Там, где оно используется, сначала маскируется текущее значение umask. Если установлены биты, отличные от последних 9 (т.е. последних 3 цифр восьмеричного представления *режима*), их значение зависит от платформы. На некоторых платформах они игнорируются, и вам следует позвонить :func:`chmod` явно установить их.
uk: У деяких системах *режим* ігнорується. Там, де воно використовується, поточне значення umask спочатку маскується. Якщо встановлено інші біти, ніж останні 9 (тобто останні 3 цифри вісімкового представлення *режиму*), їхнє значення залежить від платформи. На деяких платформах вони ігноруються, і вам слід явно викликати :func:`chmod`, щоб встановити їх.

source: It is also possible to create temporary directories; see the :mod:`tempfile` module's :func:`tempfile.mkdtemp` function.
ru: Также возможно создавать временные каталоги; увидеть :mod:`tempfile` модуль :func:`tempfile.mkdtemp` функция.
uk: Також є можливість створювати тимчасові каталоги; подивіться функцію :func:`tempfile.mkdtemp` модуля :mod:`tempfile`.

source: Raises an :ref:`auditing event <auditing>` ``os.mkdir`` with arguments ``path``, ``mode``, ``dir_fd``.
ru: Вызывает :ref:`событие аудита ` ``os.mkdir`` с аргументами ``путь`` , ``режим`` , ``dir_fd`` .
uk: Викликає :ref:`подію аудиту <auditing>` ``os.mkdir`` з аргументами ``path``, ``mode``, ``dir_fd``.

source: Recursive directory creation function. Like :func:`mkdir`, but makes all intermediate-level directories needed to contain the leaf directory.
ru: Функция рекурсивного создания каталогов. Нравиться :func:`mkdir` , но создает все каталоги промежуточного уровня, необходимые для содержания конечного каталога.
uk: Функція рекурсивного створення каталогу. Подібно до :func:`mkdir`, але створює всі каталоги середнього рівня, необхідні для того, щоб містити кінцевий каталог.

source: The *mode* parameter is passed to :func:`mkdir` for creating the leaf directory; see :ref:`the mkdir() description <mkdir_modebits>` for how it is interpreted. To set the file permission bits of any newly-created parent directories you can set the umask before invoking :func:`makedirs`. The file permission bits of existing parent directories are not changed.
uk: Параметр *mode* передається в :func:`mkdir` для створення кінцевого каталогу; див. :ref:`опис mkdir() <mkdir_modebits>` для того, як це інтерпретується. Щоб установити біти прав доступу до будь-яких новостворених батьківських каталогів, ви можете встановити umask перед викликом :func:`makedirs`. Біти дозволів файлів існуючих батьківських каталогів не змінюються.

source: :func:`makedirs` will become confused if the path elements to create include :data:`pardir` (eg. ".." on UNIX systems).
ru: :func:`madeirs` запутается, если элементы пути, которые нужно создать, включают :data:`пардир` (например, «..» в системах UNIX).
uk: :func:`makedirs` заплутає, якщо елементи шляху, які потрібно створити, включають :data:`pardir` (наприклад, ".." у системах UNIX).

source: This function handles UNC paths correctly.
ru: Эта функция правильно обрабатывает пути UNC.
uk: Ця функція правильно обробляє шляхи UNC.

source: The *exist_ok* parameter.
ru: Параметр *exist_ok*.
uk: Параметр *exist_ok*.

source: Before Python 3.4.1, if *exist_ok* was ``True`` and the directory existed, :func:`makedirs` would still raise an error if *mode* did not match the mode of the existing directory. Since this behavior was impossible to implement safely, it was removed in Python 3.4.1. See :issue:`21082`.
ru: До Python 3.4.1, если *exist_ok* было ``Правда`` и каталог существовал, :func:`madeirs` все равно выдаст ошибку, если *mode* не соответствует режиму существующего каталога. Поскольку такое поведение было невозможно реализовать безопасно, оно было удалено в Python 3.4.1. Видеть :issue:`21082` .
uk: До Python 3.4.1, якщо *exist_ok* було ``True`` і каталог існував, :func:`makedirs` все одно викликав помилку, якщо *mode* не відповідав режиму існуючого каталогу. Оскільки таку поведінку було неможливо реалізувати безпечно, її було видалено в Python 3.4.1. Див. :issue:`21082`.

source: The *mode* argument no longer affects the file permission bits of newly-created intermediate-level directories.
uk: Аргумент *mode* більше не впливає на біти дозволів файлів новостворених каталогів проміжного рівня.

source: Create a FIFO (a named pipe) named *path* with numeric mode *mode*. The current umask value is first masked out from the mode.
ru: Создайте FIFO (именованный канал) с именем *path* и числовым режимом *mode*. Текущее значение umask сначала маскируется из режима.
uk: Створіть FIFO (іменований канал) під назвою *path* із числовим режимом *mode*. Поточне значення umask спочатку маскується з режиму.

source: FIFOs are pipes that can be accessed like regular files. FIFOs exist until they are deleted (for example with :func:`os.unlink`). Generally, FIFOs are used as rendezvous between "client" and "server" type processes: the server opens the FIFO for reading, and the client opens it for writing. Note that :func:`mkfifo` doesn't open the FIFO --- it just creates the rendezvous point.
ru: FIFO — это каналы, к которым можно получить доступ как к обычным файлам. FIFO существуют до тех пор, пока они не будут удалены (например, с помощью :func:`os.unlink` ). Обычно FIFO используются в качестве места встречи между процессами типа «клиент» и «сервер»: сервер открывает FIFO для чтения, а клиент открывает его для записи. Обратите внимание, что :func:`mkfifo` не открывает FIFO — он просто создает точку встречи.
uk: FIFO — це канали, до яких можна отримати доступ, як до звичайних файлів. FIFO існують, доки їх не буде видалено (наприклад, за допомогою :func:`os.unlink`). Зазвичай FIFO використовуються як місце зустрічі між процесами типу "клієнт" і "сервер": сервер відкриває FIFO для читання, а клієнт відкриває його для запису. Зверніть увагу, що :func:`mkfifo` не відкриває FIFO --- він лише створює точку зустрічі.

source: Create a filesystem node (file, device special file or named pipe) named *path*. *mode* specifies both the permissions to use and the type of node to be created, being combined (bitwise OR) with one of ``stat.S_IFREG``, ``stat.S_IFCHR``, ``stat.S_IFBLK``, and ``stat.S_IFIFO`` (those constants are available in :mod:`stat`). For ``stat.S_IFCHR`` and ``stat.S_IFBLK``, *device* defines the newly created device special file (probably using :func:`os.makedev`), otherwise it is ignored.
ru: Создайте узел файловой системы (файл, специальный файл устройства или именованный канал) с именем *path*. *mode* определяет как разрешения на использование, так и тип создаваемого узла, объединяя их (побитовое ИЛИ) с одним из ``stat.S_IFREG`` , ``stat.S_IFCHR`` , ``stat.S_IFBLK`` , и ``stat.S_IFIFO`` (эти константы доступны в :mode:`состояние` ). Для ``stat.S_IFCHR`` и ``stat.S_IFBLK`` , *device* определяет новый специальный файл устройства (вероятно, с использованием :func:`os.makedev` ), в противном случае он игнорируется.
uk: Створіть вузол файлової системи (файл, спеціальний файл пристрою або іменований канал) під назвою *шлях*. *mode* визначає як дозволи для використання, так і тип вузла, який буде створено, поєднуючись (побітове АБО) з одним із ``stat.S_IFREG``, ``stat.S_IFCHR``, ``stat.S_IFBLK`` і ``stat.S_IFIFO`` (ці константи доступні в :mod:`stat`). Для ``stat.S_IFCHR`` і ``stat.S_IFBLK`` *device* визначає щойно створений спеціальний файл пристрою (імовірно, використовуючи :func:`os.makedev`), інакше він ігнорується.

source: Extract the device major number from a raw device number (usually the :attr:`st_dev` or :attr:`st_rdev` field from :c:type:`stat`).
uk: Витягніть основний номер пристрою з необробленого номера пристрою (зазвичай це поле :attr:`st_dev` або :attr:`st_rdev` з :c:type:`stat`).

source: Extract the device minor number from a raw device number (usually the :attr:`st_dev` or :attr:`st_rdev` field from :c:type:`stat`).
uk: Витягніть другорядний номер пристрою з необробленого номера пристрою (зазвичай це поле :attr:`st_dev` або :attr:`st_rdev` з :c:type:`stat`).

source: Compose a raw device number from the major and minor device numbers.
ru: Составьте необработанный номер устройства из основного и второстепенного номеров устройства.
uk: Складіть необроблений номер пристрою з головного та другорядного номерів пристроїв.

source: Return system configuration information relevant to a named file. *name* specifies the configuration value to retrieve; it may be a string which is the name of a defined system value; these names are specified in a number of standards (POSIX.1, Unix 95, Unix 98, and others). Some platforms define additional names as well. The names known to the host operating system are given in the ``pathconf_names`` dictionary. For configuration variables not included in that mapping, passing an integer for *name* is also accepted.
ru: Возвращает информацию о конфигурации системы, относящуюся к именованному файлу. *имя* указывает значение конфигурации, которое требуется получить; это может быть строка, которая является именем определенного системного значения; эти имена указаны в ряде стандартов (POSIX.1, Unix 95, Unix 98 и других). Некоторые платформы также определяют дополнительные имена. Имена, известные операционной системе хоста, приведены в ``pathconf_names`` словарь. Для переменных конфигурации, не включенных в это сопоставление, также допускается передача целого числа для *name*.
uk: Повертає інформацію про конфігурацію системи, що стосується названого файлу. *name* вказує значення конфігурації для отримання; це може бути рядок, який є назвою визначеного системного значення; ці назви вказані в ряді стандартів (POSIX.1, Unix 95, Unix 98 та інші). Деякі платформи також визначають додаткові імена. Імена, відомі головній операційній системі, наведено у словнику ``pathconf_names``. Для змінних конфігурації, не включених до цього відображення, також допускається передача цілого числа для *name*.

source: This function can support :ref:`specifying a file descriptor <path_fd>`.
ru: Эта функция может поддерживать указание дескриптора файла. `.
uk: Ця функція може підтримувати :ref:`зазначення файлового дескриптора <path_fd>`.

source: Dictionary mapping names accepted by :func:`pathconf` and :func:`fpathconf` to the integer values defined for those names by the host operating system. This can be used to determine the set of names known to the system.
ru: Имена сопоставлений словаря, принятые :func:`pathconf` и :func:`fpathconf` к целочисленным значениям, определенным для этих имен операционной системой хоста. Это можно использовать для определения набора имен, известных системе.
uk: Словник зіставляє імена, прийняті :func:`pathconf` і :func:`fpathconf` до цілих значень, визначених для цих імен головною операційною системою. Це можна використовувати для визначення набору імен, відомих системі.

source: Return a string representing the path to which the symbolic link points. The result may be either an absolute or relative pathname; if it is relative, it may be converted to an absolute pathname using ``os.path.join(os.path.dirname(path), result)``.
ru: Возвращает строку, представляющую путь, на который указывает символическая ссылка. Результатом может быть абсолютный или относительный путь; если он относительный, его можно преобразовать в абсолютный путь, используя ``os.path.join(os.path.dirname(path), result)`` .
uk: Повертає рядок, що представляє шлях, на який вказує символічне посилання. Результатом може бути абсолютний або відносний шлях; якщо він відносний, його можна перетворити на абсолютний шлях за допомогою ``os.path.join(os.path.dirname(path), result)``.

source: If the *path* is a string object (directly or indirectly through a :class:`PathLike` interface), the result will also be a string object, and the call may raise a UnicodeDecodeError. If the *path* is a bytes object (direct or indirectly), the result will be a bytes object.
ru: Если *path* является строковым объектом (прямо или косвенно через :class:`PathLike` интерфейс), результатом также будет строковый объект, и вызов может вызвать ошибку UnicodeDecodeError. Если *path* является объектом bytes (прямым или косвенным), результатом будет объект bytes.
uk: Якщо *шлях* є рядковим об’єктом (прямо чи опосередковано через інтерфейс :class:`PathLike`), результат також буде рядковим об’єктом, і виклик може викликати UnicodeDecodeError. Якщо *шлях* є об’єктом bytes (прямим чи опосередкованим), результатом буде об’єкт bytes.

source: When trying to resolve a path that may contain links, use :func:`~os.path.realpath` to properly handle recursion and platform differences.
ru: При попытке разрешить путь, который может содержать ссылки, используйте :func:`~os.path.realpath` правильно обрабатывать рекурсию и различия платформ.
uk: Під час спроби визначити шлях, який може містити посилання, використовуйте :func:`~os.path.realpath` для належної обробки рекурсії та відмінностей платформи.

source: Accepts a :term:`path-like object` on Unix.
ru: Принимает :term:`объект, похожий на путь` в Unix.
uk: Приймає :term:`path-like object` в Unix.
