Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/os.po
Languages: ru, uk

source: Accepts a :term:`path-like object` and a bytes object on Windows.
ru: Принимает :term:`объект, похожий на путь`, и байтовый объект в Windows.
uk: Приймає :term:`path-like object` і об’єкт bytes у Windows.

source: Added support for directory junctions, and changed to return the substitution path (which typically includes ``\\?\`` prefix) rather than the optional "print name" field that was previously returned.
ru: Добавлена ​​поддержка соединений каталогов и изменен путь замены (который обычно включает в себя ``\\?\`` префикс), а не необязательное поле «печатное имя», которое было возвращено ранее.
uk: Додано підтримку для з’єднань каталогів і змінено, щоб повертати шлях підстановки (який зазвичай включає префікс ``\\?\``), а не необов’язкове поле "назви для друку", яке поверталося раніше.

source: Remove (delete) the file *path*. If *path* is a directory, an :exc:`IsADirectoryError` is raised. Use :func:`rmdir` to remove directories. If the file does not exist, a :exc:`FileNotFoundError` is raised.
uk: Видалити (видалити) *шлях* до файлу. Якщо *path* є каталогом, виникає помилка :exc:`IsADirectoryError`. Використовуйте :func:`rmdir` для видалення каталогів. Якщо файл не існує, виникає помилка :exc:`FileNotFoundError`.

source: This function can support :ref:`paths relative to directory descriptors <dir_fd>`.
ru: Эта функция может поддерживать пути относительно дескрипторов каталогов. `.
uk: Ця функція може підтримувати :ref:`шляхи відносно дескрипторів каталогу <dir_fd>`.

source: On Windows, attempting to remove a file that is in use causes an exception to be raised; on Unix, the directory entry is removed but the storage allocated to the file is not made available until the original file is no longer in use.
ru: В Windows попытка удалить используемый файл приводит к возникновению исключения; в Unix запись каталога удаляется, но память, выделенная для файла, не становится доступной до тех пор, пока исходный файл больше не будет использоваться.
uk: У Windows спроба видалити файл, який використовується, викликає виняток; в Unix запис каталогу видаляється, але сховище, виділене для файлу, не стає доступним, доки оригінальний файл більше не буде використовуватися.

source: This function is semantically identical to :func:`unlink`.
ru: Эта функция семантически идентична :func:`отсоединить` .
uk: Ця функція семантично ідентична :func:`unlink`.

source: Raises an :ref:`auditing event <auditing>` ``os.remove`` with arguments ``path``, ``dir_fd``.
ru: Вызывает :ref:`событие аудита ` ``os.remove`` с аргументами ``путь`` , ``dir_fd`` .
uk: Викликає :ref:`подію аудиту <auditing>` ``os.remove`` з аргументами ``path``, ``dir_fd``.

source: Remove directories recursively. Works like :func:`rmdir` except that, if the leaf directory is successfully removed, :func:`removedirs` tries to successively remove every parent directory mentioned in *path* until an error is raised (which is ignored, because it generally means that a parent directory is not empty). For example, ``os.removedirs('foo/bar/baz')`` will first remove the directory ``'foo/bar/baz'``, and then remove ``'foo/bar'`` and ``'foo'`` if they are empty. Raises :exc:`OSError` if the leaf directory could not be successfully removed.
ru: Рекурсивно удалять каталоги. Работает как :func:`rmdir` за исключением того, что если конечный каталог успешно удален, :func:`удалены каталоги` пытается последовательно удалить каждый родительский каталог, упомянутый в *path*, пока не возникнет ошибка (которая игнорируется, поскольку обычно означает, что родительский каталог не пуст). Например, ``os.removedirs('foo/bar/baz')`` сначала удалит каталог ``'фу/бар/баз''' , а затем удалите ``'фу/бар'`` и ``'фу'`` если они пусты. Поднимает :exc:`OSError` если конечный каталог не удалось успешно удалить.
uk: Видалити каталоги рекурсивно. Працює як :func:`rmdir`, за винятком того, що якщо кінцевий каталог успішно видалено, :func:`removedirs` намагається послідовно видалити кожен батьківський каталог, згаданий у *path*, доки не виникне помилка (яка ігнорується, оскільки зазвичай означає, що батьківський каталог не порожній). Наприклад, ``os.removedirs('foo/bar/baz')`` спочатку видалить каталог ``'foo/bar/baz'``, а потім видалить ``'foo/bar'`` і` `'foo'``, якщо вони порожні. Викликає :exc:`OSError`, якщо кінцевий каталог не вдалося успішно видалити.

source: Rename the file or directory *src* to *dst*. If *dst* exists, the operation will fail with an :exc:`OSError` subclass in a number of cases:
ru: Переименуйте файл или каталог *src* в *dst*. Если *dst* существует, операция завершится неудачей с :exc:`OSError` подкласс в ряде случаев:
uk: Перейменуйте файл або каталог *src* на *dst*. Якщо *dst* існує, операція буде невдалою з підкласом :exc:`OSError` у кількох випадках:

source: On Windows, if *dst* exists a :exc:`FileExistsError` is always raised.
uk: У Windows, якщо *dst* існує, завжди виникає :exc:`FileExistsError`.

source: This function can support specifying *src_dir_fd* and/or *dst_dir_fd* to supply :ref:`paths relative to directory descriptors <dir_fd>`.
ru: Эта функция может поддерживать указание *src_dir_fd* и/или *dst_dir_fd* для предоставления :ref:`путей относительно дескрипторов каталогов. `.
uk: Ця функція може підтримувати вказівку *src_dir_fd* та/або *dst_dir_fd* для надання :ref:`шляхів відносно дескрипторів каталогу <dir_fd>`.

source: If you want cross-platform overwriting of the destination, use :func:`replace`.
ru: Если вы хотите кросс-платформенную перезапись места назначения, используйте :func:`заменить` .
uk: Якщо ви бажаєте перезаписати місце призначення на різних платформах, використовуйте :func:`replace`.

source: Raises an :ref:`auditing event <auditing>` ``os.rename`` with arguments ``src``, ``dst``, ``src_dir_fd``, ``dst_dir_fd``.
ru: Вызывает :ref:`событие аудита ` ``os.rename`` с аргументами ``источник`` , ``летнее время`` , ``src_dir_fd`` , ``dst_dir_fd`` .
uk: Викликає :ref:`подію аудиту <auditing>` ``os.rename`` з аргументами ``src``, ``dst``, ``src_dir_fd``, ``dst_dir_fd``.

source: The *src_dir_fd* and *dst_dir_fd* arguments.
uk: Аргументи *src_dir_fd* і *dst_dir_fd*.

source: Recursive directory or file renaming function. Works like :func:`rename`, except creation of any intermediate directories needed to make the new pathname good is attempted first. After the rename, directories corresponding to rightmost path segments of the old name will be pruned away using :func:`removedirs`.
ru: Рекурсивная функция переименования каталогов или файлов. Работает как :func:`переименовать` , за исключением того, что сначала предпринимается попытка создания любых промежуточных каталогов, необходимых для корректного использования нового пути. После переименования каталоги, соответствующие самым правым сегментам пути старого имени, будут удалены с помощью :func:`удалены каталоги` .
uk: Функція рекурсивного перейменування каталогу або файлу. Працює як :func:`rename`, за винятком того, що спочатку намагаються створити будь-які проміжні каталоги, необхідні для того, щоб зробити нове ім’я шляху правильним. Після перейменування каталоги, які відповідають крайнім правим сегментам шляху старої назви, будуть видалені за допомогою :func:`removedirs`.

source: This function can fail with the new directory structure made if you lack permissions needed to remove the leaf directory or file.
ru: Эта функция может дать сбой при создании новой структуры каталогов, если у вас нет прав, необходимых для удаления конечного каталога или файла.
uk: Ця функція може вийти з ладу з новою структурою каталогів, якщо у вас немає дозволів, необхідних для видалення кінцевого каталогу або файлу.

source: Accepts a :term:`path-like object` for *old* and *new*.
ru: Принимает :term:`объект, похожий на путь` для *старого* и *нового*.
uk: Приймає :term:`path-like object` для *old* і *new*.

source: Rename the file or directory *src* to *dst*. If *dst* is a non-empty directory, :exc:`OSError` will be raised. If *dst* exists and is a file, it will be replaced silently if the user has permission. The operation may fail if *src* and *dst* are on different filesystems. If successful, the renaming will be an atomic operation (this is a POSIX requirement).
ru: Переименуйте файл или каталог *src* в *dst*. Если *dst* — непустой каталог, :exc:`OSError` будет повышен. Если *dst* существует и является файлом, он будет заменен автоматически, если у пользователя есть разрешение. Операция может завершиться неудачно, если *src* и *dst* находятся в разных файловых системах. В случае успеха переименование будет атомарной операцией (это требование POSIX).
uk: Перейменуйте файл або каталог *src* на *dst*. Якщо *dst* є непорожнім каталогом, буде викликано :exc:`OSError`. Якщо *dst* існує і є файлом, його буде замінено мовчки, якщо користувач має дозвіл. Операція може завершитися помилкою, якщо *src* і *dst* знаходяться в різних файлових системах. У разі успіху перейменування буде атомарною операцією (це вимога POSIX).

source: Raises an :ref:`auditing event <auditing>` ``os.rmdir`` with arguments ``path``, ``dir_fd``.
ru: Вызывает :ref:`событие аудита ` ``os.rmdir`` с аргументами ``путь`` , ``dir_fd`` .
uk: Викликає :ref:`подію аудиту <auditing>` ``os.rmdir`` з аргументами ``path``, ``dir_fd``.

source: The *dir_fd* parameter.
ru: Параметр *dir_fd*.
uk: Параметр *dir_fd*.

source: Return an iterator of :class:`os.DirEntry` objects corresponding to the entries in the directory given by *path*. The entries are yielded in arbitrary order, and the special entries ``'.'`` and ``'..'`` are not included. If a file is removed from or added to the directory after creating the iterator, whether an entry for that file be included is unspecified.
ru: Вернуть итератор :class:`os.DirEntry` объекты, соответствующие записям в каталоге, заданном *path*. Записи выдаются в произвольном порядке, а специальные записи ``'.'`` и ``'..'`` не включены. Если файл удаляется из каталога или добавляется в него после создания итератора, не указано, будет ли включена запись для этого файла.
uk: Повертає ітератор об’єктів :class:`os.DirEntry`, що відповідають записам у каталозі, визначеному *path*. Записи надаються в довільному порядку, і спеціальні записи ``'.'`` і ``'..'`` не включені. Якщо файл видалено з каталогу або додано до нього після створення ітератора, чи буде включений запис для цього файлу, не визначено.

source: Using :func:`scandir` instead of :func:`listdir` can significantly increase the performance of code that also needs file type or file attribute information, because :class:`os.DirEntry` objects expose this information if the operating system provides it when scanning a directory. All :class:`os.DirEntry` methods may perform a system call, but :func:`~os.DirEntry.is_dir` and :func:`~os.DirEntry.is_file` usually only require a system call for symbolic links; :func:`os.DirEntry.stat` always requires a system call on Unix but only requires one for symbolic links on Windows.
ru: С использованием :func:`скандир` вместо :func:`listdir` может значительно повысить производительность кода, которому также требуется информация о типе файла или атрибуте файла, поскольку :class:`os.DirEntry` объекты предоставляют эту информацию, если операционная система предоставляет ее при сканировании каталога. Все :class:`os.DirEntry` методы могут выполнять системный вызов, но :func:`~os.DirEntry.is_dir` и :func:`~os.DirEntry.is_file` обычно требуется только системный вызов для символических ссылок; :func:`os.DirEntry.stat` всегда требует системного вызова в Unix, но для символических ссылок требуется только один в Windows.
uk: Використання :func:`scandir` замість :func:`listdir` може значно підвищити продуктивність коду, який також потребує інформації про тип файлу чи атрибути файлу, оскільки об’єкти :class:`os.DirEntry` надають цю інформацію, якщо операційна система надає під час сканування каталогу. Усі методи :class:`os.DirEntry` можуть виконувати системний виклик, але :func:`~os.DirEntry.is_dir` і :func:`~os.DirEntry.is_file` зазвичай вимагають лише системного виклику для символічних посилань; :func:`os.DirEntry.stat` завжди вимагає системного виклику в Unix, але вимагає лише один для символічних посилань у Windows.

source: *path* may be a :term:`path-like object`. If *path* is of type ``bytes`` (directly or indirectly through the :class:`PathLike` interface), the type of the :attr:`~os.DirEntry.name` and :attr:`~os.DirEntry.path` attributes of each :class:`os.DirEntry` will be ``bytes``; in all other circumstances, they will be of type ``str``.
ru: *path* может быть :term:`объектом, похожим на путь`. Если *path* имеет тип ``байты`` (прямо или косвенно через :class:`PathLike` интерфейс), тип :attr:`~os.DirEntry.name` и :attr:`~os.DirEntry.path` атрибуты каждого :class:`os.DirEntry` будет ``байты`` ; во всех остальных случаях они будут типа ``ул`` .
uk: *path* може бути :term:`path-like object`. Якщо *path* має тип ``bytes`` (прямо чи опосередковано через інтерфейс :class:`PathLike`), тип :attr:`~os.DirEntry.name` і Атрибути :attr:`~os.DirEntry.path` кожного :class:`os.DirEntry` будуть ``bytes``; за всіх інших обставин вони будуть типу ``str``.

source: Raises an :ref:`auditing event <auditing>` ``os.scandir`` with argument ``path``.
ru: Вызывает :ref:`событие аудита ` ``os.scandir`` с аргументом ``путь`` .
uk: Викликає :ref:`подію аудиту <auditing>` ``os.scandir`` з аргументом ``path``.

source: The :func:`scandir` iterator supports the :term:`context manager` protocol and has the following method:
ru: The :func:`скандир` итератор поддерживает протокол :term:`context Manager` и имеет следующий метод:
uk: Ітератор :func:`scandir` підтримує протокол :term:`context manager` і має такий метод:

source: Close the iterator and free acquired resources.
ru: Закройте итератор и освободите полученные ресурсы.
uk: Закрийте ітератор і звільніть отримані ресурси.

source: This is called automatically when the iterator is exhausted or garbage collected, or when an error happens during iterating. However it is advisable to call it explicitly or use the :keyword:`with` statement.
ru: Это вызывается автоматически, когда итератор исчерпан, собран мусор или когда во время итерации возникает ошибка. Однако желательно вызывать его явно или использовать :keyword:`с` заявление.
uk: Це викликається автоматично, коли ітератор вичерпано або зібрано сміття, або коли під час ітерації трапляється помилка. Однак бажано викликати його явно або використовувати оператор :keyword:`with`.

source: The following example shows a simple use of :func:`scandir` to display all the files (excluding directories) in the given *path* that don't start with ``'.'``. The ``entry.is_file()`` call will generally not make an additional system call::
ru: В следующем примере показано простое использование :func:`скандир` для отображения всех файлов (исключая каталоги) по заданному *пути*, которые не начинаются с ``'.'`` . ``entry.is_file()`` call обычно не выполняет дополнительный системный вызов::
uk: У наступному прикладі показано просте використання :func:`scandir` для відображення всіх файлів (за винятком каталогів) у заданому *шляху*, які не починаються з ``'.'``. Виклик ``entry.is_file()`` зазвичай не здійснить додатковий системний виклик:

source: On Unix-based systems, :func:`scandir` uses the system's `opendir() <http://pubs.opengroup.org/onlinepubs/009695399/functions/opendir.html>`_ and `readdir() <http://pubs.opengroup.org/onlinepubs/009695399/functions/readdir_r.html>`_ functions. On Windows, it uses the Win32 `FindFirstFileW <https://msdn.microsoft.com/en-us/library/windows/desktop/aa364418(v=vs.85).aspx>`_ and `FindNextFileW <https://msdn.microsoft.com/en-us/library/windows/desktop/aa364428(v=vs.85).aspx>`_ functions.
uk: У системах на основі Unix :func:`scandir` використовує системні функції `opendir() <http://pubs.opengroup.org/onlinepubs/009695399/functions/opendir.html>`_ і `readdir() <http://pubs.opengroup.org/onlinepubs/009695399/functions/readdir_r.html>`_. У Windows він використовує функції Win32 `FindFirstFileW <https://msdn.microsoft.com/en-us/library/windows/desktop/aa364418(v=vs.85).aspx>`_ і `FindNextFileW <https://msdn.microsoft.com/en-us/library/windows/desktop/aa364428(v=vs.85).aspx>`_.

source: Added support for the :term:`context manager` protocol and the :func:`~scandir.close()` method. If a :func:`scandir` iterator is neither exhausted nor explicitly closed a :exc:`ResourceWarning` will be emitted in its destructor.
uk: Додано підтримку протоколу :term:`context manager` і методу :func:`~scandir.close()`. Якщо ітератор :func:`scandir` не вичерпано і не закрито явно, у його деструкторі буде видано :exc:`ResourceWarning`.

source: The function accepts a :term:`path-like object`.
ru: Функция принимает объект, похожий на путь.
uk: Функція приймає :term:`path-like object`.

source: Added support for :ref:`file descriptors <path_fd>` on Unix.
ru: Добавлена ​​поддержка :ref:`дескрипторов файлов. ` в Unix.
uk: Додано підтримку :ref:`дескрипторів файлів <path_fd>` в Unix.

source: Object yielded by :func:`scandir` to expose the file path and other file attributes of a directory entry.
ru: Объект предоставлен :func:`скандир` чтобы раскрыть путь к файлу и другие атрибуты файла записи каталога.
uk: Об’єкт, створений :func:`scandir` для показу шляху до файлу та інших атрибутів файлу в записі каталогу.

source: :func:`scandir` will provide as much of this information as possible without making additional system calls. When a ``stat()`` or ``lstat()`` system call is made, the ``os.DirEntry`` object will cache the result.
ru: :func:`скандир` предоставит как можно больше этой информации без дополнительных системных вызовов. Когда ``stat()`` или ``lstat()`` выполняется системный вызов, ``os.DirEntry`` объект будет кэшировать результат.
uk: :func:`scandir` надасть якомога більше цієї інформації без додаткових системних викликів. Коли виконується системний виклик ``stat()`` або ``lstat()``, об'єкт ``os.DirEntry`` кешує результат.

source: ``os.DirEntry`` instances are not intended to be stored in long-lived data structures; if you know the file metadata has changed or if a long time has elapsed since calling :func:`scandir`, call ``os.stat(entry.path)`` to fetch up-to-date information.
ru: ``os.DirEntry`` экземпляры не предназначены для хранения в долгоживущих структурах данных; если вы знаете, что метаданные файла изменились или прошло много времени с момента вызова :func:`скандир` , вызов ``os.stat(entry.path)`` для получения актуальной информации.
uk: Екземпляри ``os.DirEntry`` не призначені для зберігання в довгострокових структурах даних; якщо ви знаєте, що метадані файлу змінилися, або якщо після виклику :func:`scandir` минуло багато часу, викличте ``os.stat(entry.path)``, щоб отримати актуальну інформацію.

source: Because the ``os.DirEntry`` methods can make operating system calls, they may also raise :exc:`OSError`. If you need very fine-grained control over errors, you can catch :exc:`OSError` when calling one of the ``os.DirEntry`` methods and handle as appropriate.
ru: Потому что ``os.DirEntry`` методы могут выполнять вызовы операционной системы, они также могут вызывать :exc:`OSError` . Если вам нужен очень детальный контроль над ошибками, вы можете поймать :exc:`OSError` при звонке в один из ``os.DirEntry`` методы и обрабатывайте их соответствующим образом.
uk: Оскільки методи ``os.DirEntry`` можуть здійснювати виклики операційної системи, вони також можуть викликати :exc:`OSError`. Якщо вам потрібен дуже точний контроль над помилками, ви можете перехопити :exc:`OSError` під час виклику одного з методів ``os.DirEntry`` і обробити відповідно.

source: To be directly usable as a :term:`path-like object`, ``os.DirEntry`` implements the :class:`PathLike` interface.
ru: Чтобы его можно было напрямую использовать в качестве :term:`путеподобного объекта`, ``os.DirEntry`` реализует :class:`PathLike` интерфейс.
uk: Для безпосереднього використання як :term:`path-like object`, ``os.DirEntry`` реалізує інтерфейс :class:`PathLike`.

source: Attributes and methods on a ``os.DirEntry`` instance are as follows:
ru: Атрибуты и методы на ``os.DirEntry`` экземпляр следующие:
uk: Атрибути та методи екземпляра ``os.DirEntry`` такі:

source: The entry's base filename, relative to the :func:`scandir` *path* argument.
ru: Базовое имя файла записи относительно :func:`скандир` *путь* аргумент.
uk: Базове ім’я файлу запису відносно аргументу *path* :func:`scandir`.

source: The :attr:`name` attribute will be ``bytes`` if the :func:`scandir` *path* argument is of type ``bytes`` and ``str`` otherwise. Use :func:`~os.fsdecode` to decode byte filenames.
ru: The :attr:`имя` атрибут будет ``байты`` если :func:`скандир` Аргумент *path* имеет тип ``байты`` и ``ул`` в противном случае. Использовать :func:`~os.fsdecode` для декодирования байтовых имен файлов.
uk: Атрибут :attr:`name` буде ``bytes``, якщо аргумент :func:`scandir` *path* має тип ``bytes`` та ``str`` інакше. Використовуйте :func:`~os.fsdecode` для декодування байтових імен файлів.

source: The entry's full path name: equivalent to ``os.path.join(scandir_path, entry.name)`` where *scandir_path* is the :func:`scandir` *path* argument. The path is only absolute if the :func:`scandir` *path* argument was absolute. If the :func:`scandir` *path* argument was a :ref:`file descriptor <path_fd>`, the :attr:`path` attribute is the same as the :attr:`name` attribute.
ru: Полный путь записи: эквивалентно ``os.path.join(scandir_path, вход.имя)`` где *scandir_path* — это :func:`скандир` *путь* аргумент. Путь является абсолютным только в том случае, если :func:`скандир` Аргумент *path* был абсолютным. Если :func:`скандир` Аргумент *path* представлял собой файловый дескриптор :ref:` `, :attr:`путь` атрибут такой же, как и :attr:`имя` атрибут.
uk: Повний шлях до запису: еквівалент ``os.path.join(scandir_path, entry.name)``, де *scandir_path* є аргументом :func:`scandir` *path*. Шлях є абсолютним, лише якщо аргумент *path* :func:`scandir` був абсолютним. Якщо аргумент :func:`scandir` *path* був :ref:`дескриптором файлу <path_fd>`, атрибут :attr:`path` буде таким самим, як атрибут :attr:`name`.

source: The :attr:`path` attribute will be ``bytes`` if the :func:`scandir` *path* argument is of type ``bytes`` and ``str`` otherwise. Use :func:`~os.fsdecode` to decode byte filenames.
ru: The :attr:`путь` атрибут будет ``байты`` если :func:`скандир` Аргумент *path* имеет тип ``байты`` и ``ул`` в противном случае. Использовать :func:`~os.fsdecode` для декодирования байтовых имен файлов.
uk: Атрибут :attr:`path` матиме значення ``bytes``, якщо аргумент *path* :func:`scandir` має тип ``bytes`` та ``str`` інакше. Використовуйте :func:`~os.fsdecode` для декодування байтових імен файлів.

source: Return the inode number of the entry.
ru: Возвращает номер индексного дескриптора записи.
uk: Повертає номер inode запису.

source: The result is cached on the ``os.DirEntry`` object. Use ``os.stat(entry.path, follow_symlinks=False).st_ino`` to fetch up-to-date information.
ru: Результат кэшируется на ``os.DirEntry`` объект. Использовать ``os.stat(entry.path, Follow_symlinks=False).st_ino`` для получения актуальной информации.
uk: Результат кешується в об’єкті ``os.DirEntry``. Використовуйте ``os.stat(entry.path, follow_symlinks=False).st_ino``, щоб отримати актуальну інформацію.

source: On the first, uncached call, a system call is required on Windows but not on Unix.
ru: При первом некэшированном вызове системный вызов требуется в Windows, но не в Unix.
uk: Для першого некешованого виклику потрібен системний виклик у Windows, але не в Unix.
