Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/os.po
Languages: ru, uk

source: Return the parent's process id. When the parent process has exited, on Unix the id returned is the one of the init process (1), on Windows it is still the same id, which may be already reused by another process.
ru: Верните идентификатор родительского процесса. Когда родительский процесс завершился, в Unix возвращается идентификатор процесса инициализации (1), в Windows это все тот же идентификатор, который может уже повторно использоваться другим процессом.
uk: Повертає ідентифікатор батьківського процесу. Коли батьківський процес завершив роботу, в Unix повертається ідентифікатор процесу ініціалізації (1), у Windows це все ще той самий ідентифікатор, який може вже повторно використовуватися іншим процесом.

source: Added support for Windows.
ru: Добавлена поддержка Windows.
uk: Додана підтримка Windows.

source: Get program scheduling priority. The value *which* is one of :const:`PRIO_PROCESS`, :const:`PRIO_PGRP`, or :const:`PRIO_USER`, and *who* is interpreted relative to *which* (a process identifier for :const:`PRIO_PROCESS`, process group identifier for :const:`PRIO_PGRP`, and a user ID for :const:`PRIO_USER`). A zero value for *who* denotes (respectively) the calling process, the process group of the calling process, or the real user ID of the calling process.
ru: Получите приоритет планирования программы. Значение, *которое* является одним из :const:`PRIO_PROCESS` , :const:`PRIO_PGRP` , или :const:`PRIO_USER` , а *who* интерпретируется относительно *that* (идентификатор процесса для :const:`PRIO_PROCESS` , идентификатор группы процессов для :const:`PRIO_PGRP` и идентификатор пользователя для :const:`PRIO_USER` ). Нулевое значение *who* обозначает (соответственно) вызывающий процесс, группу процессов вызывающего процесса или реальный идентификатор пользователя вызывающего процесса.
uk: Отримати пріоритет планування програми. Значення *which* є одним із :const:`PRIO_PROCESS`, :const:`PRIO_PGRP` або :const:`PRIO_USER`, і *who* інтерпретується відносно *which* (ідентифікатор процесу для :const:`PRIO_PROCESS`, ідентифікатор групи процесів для :const:`PRIO_PGRP` та ідентифікатор користувача для :const:`PRIO_USER`). Нульове значення для *who* позначає (відповідно) викликаючий процес, групу процесів викликаючого процесу або справжній ідентифікатор користувача викликаючого процесу.

source: Parameters for the :func:`getpriority` and :func:`setpriority` functions.
ru: Параметры для :func:`getpriority` и :func:`setpriority` функции.
uk: Параметри для функцій :func:`getpriority` і :func:`setpriority`.

source: Return a tuple (ruid, euid, suid) denoting the current process's real, effective, and saved user ids.
ru: Возвращает кортеж (ruid, euid, suid), обозначающий реальные, эффективные и сохраненные идентификаторы пользователей текущего процесса.
uk: Повертає кортеж (ruid, euid, suid), що позначає справжні, ефективні та збережені ідентифікатори користувачів поточного процесу.

source: Return a tuple (rgid, egid, sgid) denoting the current process's real, effective, and saved group ids.
ru: Возвращает кортеж (rgid, egid, sgid), обозначающий реальные, эффективные и сохраненные идентификаторы групп текущего процесса.
uk: Повертає кортеж (rgid, egid, sgid), що позначає справжні, ефективні та збережені ідентифікатори груп поточного процесу.

source: Return the current process's real user id.
ru: Возвращает реальный идентификатор пользователя текущего процесса.
uk: Повертає справжній ідентифікатор користувача поточного процесу.

source: Call the system initgroups() to initialize the group access list with all of the groups of which the specified username is a member, plus the specified group id.
ru: Вызовите системную функцию initgroups(), чтобы инициализировать список доступа к группе, включив в него все группы, членом которых является указанное имя пользователя, а также указанный идентификатор группы.
uk: Викличте системний initgroups(), щоб ініціалізувати список доступу групи з усіма групами, членом яких є вказане ім’я користувача, а також ідентифікатор зазначеної групи.

source: Set the environment variable named *key* to the string *value*. Such changes to the environment affect subprocesses started with :func:`os.system`, :func:`popen` or :func:`fork` and :func:`execv`.
ru: Установите для переменной среды с именем *key* строку *value*. Такие изменения в среде влияют на подпроцессы, начинающиеся с :func:`os.system` , :func:`попэн` или :func:`вилка` и :func:`execv` .
uk: Встановіть змінну середовища з назвою *key* на рядкове *значення*. Такі зміни в середовищі впливають на підпроцеси, запущені з :func:`os.system`, :func:`popen` або :func:`fork` і :func:`execv`.

source: Assignments to items in :data:`os.environ` are automatically translated into corresponding calls to :func:`putenv`; however, calls to :func:`putenv` don't update :data:`os.environ`, so it is actually preferable to assign to items of :data:`os.environ`. This also applies to :func:`getenv` and :func:`getenvb`, which respectively use :data:`os.environ` and :data:`os.environb` in their implementations.
ru: Присвоения элементам в :data:`os.environ` автоматически преобразуются в соответствующие вызовы :func:`putenv` ; однако призывы к :func:`putenv` не обновлять :data:`os.environ` , поэтому на самом деле предпочтительнее назначать элементы :data:`os.environ` . Это также относится к :func:`getenv` и :func:`getenvb` , которые соответственно используют :data:`os.environ` и :data:`os.environb` в их реализациях.
uk: Призначення елементів у :data:`os.environ` автоматично перетворюються на відповідні виклики :func:`putenv`; однак виклики :func:`putenv` не оновлюють :data:`os.environ`, тому насправді краще призначати елементам :data:`os.environ`. Це також стосується :func:`getenv` і :func:`getenvb`, які відповідно використовують :data:`os.environ` і :data:`os.environb` у своїх реалізаціях.

source: On some platforms, including FreeBSD and macOS, setting ``environ`` may cause memory leaks. Refer to the system documentation for :c:func:`putenv`.
uk: На деяких платформах, включаючи FreeBSD і macOS, налаштування ``environ`` може спричинити витік пам’яті. Зверніться до системної документації для :c:func:`putenv`.

source: Raises an :ref:`auditing event <auditing>` ``os.putenv`` with arguments ``key``, ``value``.
ru: Вызывает :ref:`событие аудита ` ``os.putenv`` с аргументами ``ключ`` , ``ценность`` .
uk: Викликає :ref:`подію аудиту <auditing>` ``os.putenv`` з аргументами ``key``, ``value``.

source: The function is now always available.
ru: Функция теперь всегда доступна.
uk: Тепер функція доступна завжди.

source: Set the current process's effective group id.
ru: Вызывает :ref:`событие аудита ` ``os.putenv`` с аргументами ``ключ`` , ``ценность`` .
uk: Установіть ефективний ідентифікатор групи поточного процесу.

source: Set the current process's effective user id.
ru: Установите эффективный идентификатор пользователя текущего процесса.
uk: Встановити ефективний ідентифікатор користувача поточного процесу.

source: Set the current process' group id.
ru: Установите идентификатор группы текущего процесса.
uk: Встановіть ідентифікатор групи поточного процесу.

source: Set the list of supplemental group ids associated with the current process to *groups*. *groups* must be a sequence, and each element must be an integer identifying a group. This operation is typically available only to the superuser.
ru: Установите список идентификаторов дополнительных групп, связанных с текущим процессом, в *groups*. *группы* должны быть последовательностью, а каждый элемент должен быть целым числом, идентифицирующим группу. Эта операция обычно доступна только суперпользователю.
uk: Установіть для списку ідентифікаторів додаткових груп, пов’язаних із поточним процесом, значення *groups*. *групи* мають бути послідовністю, а кожен елемент має бути цілим числом, що ідентифікує групу. Зазвичай ця операція доступна лише суперкористувачу.

source: On macOS, the length of *groups* may not exceed the system-defined maximum number of effective group ids, typically 16. See the documentation for :func:`getgroups` for cases where it may not return the same group list set by calling setgroups().
ru: В macOS длина *групп* не может превышать установленное системой максимальное количество эффективных идентификаторов групп, обычно 16. См. документацию для получения дополнительной информации. :func:`getgroups` для случаев, когда он не может вернуть тот же список групп, заданный вызовом setgroups().
uk: У macOS довжина *groups* не може перевищувати визначену системою максимальну кількість ефективних ідентифікаторів груп, як правило, 16. Перегляньте документацію для :func:`getgroups`, щоб дізнатися про випадки, коли він може не повернути той самий список груп, встановлений за допомогою виклику setgroups().

source: Call the system call :c:func:`setpgrp` or ``setpgrp(0, 0)`` depending on which version is implemented (if any). See the Unix manual for the semantics.
uk: Викличте системний виклик :c:func:`setpgrp` або ``setpgrp(0, 0)`` залежно від того, яка версія реалізована (якщо така є). Перегляньте посібник з Unix для семантики.

source: Call the system call :c:func:`setpgid` to set the process group id of the process with id *pid* to the process group with id *pgrp*. See the Unix manual for the semantics.
uk: Викличте системний виклик :c:func:`setpgid`, щоб встановити ідентифікатор групи процесів процесу з ідентифікатором *pid* на групу процесів з ідентифікатором *pgrp*. Перегляньте посібник з Unix для семантики.

source: Set program scheduling priority. The value *which* is one of :const:`PRIO_PROCESS`, :const:`PRIO_PGRP`, or :const:`PRIO_USER`, and *who* is interpreted relative to *which* (a process identifier for :const:`PRIO_PROCESS`, process group identifier for :const:`PRIO_PGRP`, and a user ID for :const:`PRIO_USER`). A zero value for *who* denotes (respectively) the calling process, the process group of the calling process, or the real user ID of the calling process. *priority* is a value in the range -20 to 19. The default priority is 0; lower priorities cause more favorable scheduling.
ru: Установите приоритет планирования программы. Значение, *которое* является одним из :const:`PRIO_PROCESS` , :const:`PRIO_PGRP` , или :const:`PRIO_USER` , а *who* интерпретируется относительно *that* (идентификатор процесса для :const:`PRIO_PROCESS` , идентификатор группы процессов для :const:`PRIO_PGRP` и идентификатор пользователя для :const:`PRIO_USER` ). Нулевое значение *who* обозначает (соответственно) вызывающий процесс, группу процессов вызывающего процесса или реальный идентификатор пользователя вызывающего процесса. *приоритет* — значение в диапазоне от -20 до 19. Приоритет по умолчанию — 0; более низкие приоритеты приводят к более благоприятному планированию.
uk: Встановити пріоритет планування програми. Значення *which* є одним із :const:`PRIO_PROCESS`, :const:`PRIO_PGRP` або :const:`PRIO_USER` і *who* інтерпретується відносно *which* (ідентифікатор процесу для :const:`PRIO_PROCESS`, ідентифікатор групи процесів для :const:`PRIO_PGRP` та ідентифікатор користувача для :const:`PRIO_USER`). Нульове значення для *who* позначає (відповідно) викликаючий процес, групу процесів викликаючого процесу або справжній ідентифікатор користувача викликаючого процесу. *пріоритет* — це значення в діапазоні від -20 до 19. Пріоритет за замовчуванням — 0; нижчі пріоритети викликають більш сприятливе планування.

source: Set the current process's real and effective group ids.
ru: Установите реальные и эффективные идентификаторы группы текущего процесса.
uk: Встановіть справжні та ефективні ідентифікатори груп поточного процесу.

source: Set the current process's real, effective, and saved group ids.
ru: Установите реальные, эффективные и сохраненные идентификаторы групп текущего процесса.
uk: Встановіть реальні, ефективні та збережені ідентифікатори груп поточного процесу.

source: Set the current process's real, effective, and saved user ids.
ru: Установите реальные, эффективные и сохраненные идентификаторы пользователей текущего процесса.
uk: Встановіть справжні, ефективні та збережені ідентифікатори користувачів поточного процесу.

source: Set the current process's real and effective user ids.
ru: Установите реальные и эффективные идентификаторы пользователей текущего процесса.
uk: Встановіть справжні та ефективні ідентифікатори користувачів поточного процесу.

source: Call the system call :c:func:`getsid`. See the Unix manual for the semantics.
uk: Викличте системний виклик :c:func:`getsid`. Перегляньте посібник з Unix для семантики.

source: Call the system call :c:func:`setsid`. See the Unix manual for the semantics.
uk: Викличте системний виклик :c:func:`setsid`. Перегляньте посібник з Unix для семантики.

source: Set the current process's user id.
ru: Установите идентификатор пользователя текущего процесса.
uk: Встановіть ідентифікатор користувача поточного процесу.

source: Return the error message corresponding to the error code in *code*. On platforms where :c:func:`strerror` returns ``NULL`` when given an unknown error number, :exc:`ValueError` is raised.
uk: Повернути повідомлення про помилку, що відповідає коду помилки в *code*. На платформах, де :c:func:`strerror` повертає ``NULL``, коли отримує невідомий номер помилки, виникає :exc:`ValueError`.

source: ``True`` if the native OS type of the environment is bytes (eg. ``False`` on Windows).
ru: ``Правда`` если родной тип ОС среды — байты (например. ``Ложь`` в Windows).
uk: ``True``, якщо рідний тип ОС середовища - байти (наприклад, ``False`` у Windows).

source: Set the current numeric umask and return the previous umask.
ru: Установите текущую числовую маску и верните предыдущую маску.
uk: Установіть поточну цифрову umask і поверніть попередню umask.

source: Returns information identifying the current operating system. The return value is an object with five attributes:
ru: Возвращает информацию, идентифицирующую текущую операционную систему. Возвращаемое значение — это объект с пятью атрибутами:
uk: Повертає інформацію про поточну операційну систему. Значення, що повертається, є об’єктом із п’ятьма атрибутами:

source: :attr:`sysname` - operating system name
ru: :attr:`системное имя` - название операционной системы
uk: :attr:`sysname` - назва операційної системи

source: :attr:`nodename` - name of machine on network (implementation-defined)
ru: :attr:`имя_узла` - имя машины в сети (определяется реализацией)
uk: :attr:`nodename` - ім'я машини в мережі (визначено реалізацією)

source: :attr:`release` - operating system release
ru: :attr:`выпустить` - выпуск операционной системы
uk: :attr:`release` - випуск операційної системи

source: :attr:`version` - operating system version
ru: :attr:`версия` - версия операционной системы
uk: :attr:`version` - версія операційної системи

source: :attr:`machine` - hardware identifier
ru: :attr:`машина` - идентификатор оборудования
uk: :attr:`machine` - ідентифікатор обладнання

source: For backwards compatibility, this object is also iterable, behaving like a five-tuple containing :attr:`sysname`, :attr:`nodename`, :attr:`release`, :attr:`version`, and :attr:`machine` in that order.
ru: В целях обратной совместимости этот объект также является итеративным и ведет себя как кортеж из пяти элементов, содержащий :attr:`системное имя` , :attr:`имя_узла` , :attr:`выпустить` , :attr:`версия` , и :attr:`машина` в таком порядке.
uk: Для зворотної сумісності цей об’єкт також можна ітерувати, ведучи себе як п’ять кортежів, що містять :attr:`sysname`, :attr:`nodename`, :attr:`release`, :attr:`version` і :attr:`machine` в такому порядку.

source: Some systems truncate :attr:`nodename` to 8 characters or to the leading component; a better way to get the hostname is :func:`socket.gethostname` or even ``socket.gethostbyaddr(socket.gethostname())``.
ru: Некоторые системы обрезают :attr:`имя_узла` до 8 символов или до ведущего компонента; лучший способ получить имя хоста :func:`socket.gethostname` или даже ``socket.gethostbyaddr(socket.gethostname())`` .
uk: Деякі системи скорочують :attr:`nodename` до 8 символів або до початкового компонента; кращий спосіб отримати ім’я хоста – :func:`socket.gethostname` або навіть ``socket.gethostbyaddr(socket.gethostname())``.

source: :ref:`Availability <availability>`: recent flavors of Unix.
uk: :ref:`Доступність <availability>`: останні версії Unix.

source: Return type changed from a tuple to a tuple-like object with named attributes.
ru: Тип возвращаемого значения изменен с кортежа на объект, подобный кортежу, с именованными атрибутами.
uk: Тип повернення змінено з кортежу на кортежний об’єкт з іменованими атрибутами.

source: Unset (delete) the environment variable named *key*. Such changes to the environment affect subprocesses started with :func:`os.system`, :func:`popen` or :func:`fork` and :func:`execv`.
ru: Снимите (удалите) переменную среды с именем *key*. Такие изменения в среде влияют на подпроцессы, начинающиеся с :func:`os.system` , :func:`попэн` или :func:`вилка` и :func:`execv` .
uk: Скасувати (видалити) змінну середовища з назвою *key*. Такі зміни в середовищі впливають на підпроцеси, запущені з :func:`os.system`, :func:`popen` або :func:`fork` і :func:`execv`.

source: Deletion of items in :data:`os.environ` is automatically translated into a corresponding call to :func:`unsetenv`; however, calls to :func:`unsetenv` don't update :data:`os.environ`, so it is actually preferable to delete items of :data:`os.environ`.
ru: Удаление элементов в :data:`os.environ` автоматически транслируется в соответствующий вызов :func:`unsetenv` ; однако призывы к :func:`unsetenv` не обновлять :data:`os.environ` , поэтому на самом деле предпочтительнее удалять элементы :data:`os.environ` .
uk: Видалення елементів у :data:`os.environ` автоматично перетворюється на відповідний виклик :func:`unsetenv`; однак виклики :func:`unsetenv` не оновлюють :data:`os.environ`, тому насправді краще видалити елементи :data:`os.environ`.

source: Raises an :ref:`auditing event <auditing>` ``os.unsetenv`` with argument ``key``.
ru: Вызывает :ref:`событие аудита ` ``os.unsetenv`` с аргументом ``ключ`` .
uk: Викликає :ref:`подію аудиту <auditing>` ``os.unsetenv`` з аргументом ``key``.

source: The function is now always available and is also available on Windows.
ru: Функция теперь всегда доступна, а также доступна в Windows.
uk: Функція тепер доступна завжди і також доступна в Windows.

source: File Object Creation
ru: Создание файловых объектов
uk: Створення файлового об’єкта

source: These functions create new :term:`file objects <file object>`. (See also :func:`~os.open` for opening file descriptors.)
ru: Эти функции создают новые файловые объекты. `. (См. также :func:`~os.open` для открытия файловых дескрипторов.)
uk: Ці функції створюють нові :term:`файлові об’єкти <file object>`. (Див. також :func:`~os.open` для відкриття дескрипторів файлів.)

source: Return an open file object connected to the file descriptor *fd*. This is an alias of the :func:`open` built-in function and accepts the same arguments. The only difference is that the first argument of :func:`fdopen` must always be an integer.
ru: Возвращает открытый файловый объект, связанный с файловым дескриптором *fd*. Это псевдоним :func:`открыть` встроенная функция и принимает те же аргументы. Единственное отличие состоит в том, что первый аргумент :func:`fdopen` всегда должно быть целым числом.
uk: Повертає відкритий файловий об'єкт, підключений до файлового дескриптора *fd*. Це псевдонім вбудованої функції :func:`open` і приймає ті самі аргументи. Єдина відмінність полягає в тому, що перший аргумент :func:`fdopen` завжди має бути цілим числом.

source: File Descriptor Operations
ru: Операции с файловыми дескрипторами
uk: Операції файлового дескриптора

source: These functions operate on I/O streams referenced using file descriptors.
ru: Эти функции работают с потоками ввода-вывода, на которые ссылаются файловые дескрипторы.
uk: Ці функції працюють із потоками введення/виведення, на які посилаються за допомогою файлових дескрипторів.

source: File descriptors are small integers corresponding to a file that has been opened by the current process. For example, standard input is usually file descriptor 0, standard output is 1, and standard error is 2. Further files opened by a process will then be assigned 3, 4, 5, and so forth. The name "file descriptor" is slightly deceptive; on Unix platforms, sockets and pipes are also referenced by file descriptors.
ru: Дескрипторы файлов представляют собой небольшие целые числа, соответствующие файлу, открытому текущим процессом. Например, стандартный ввод обычно имеет файловый дескриптор 0, стандартный вывод — 1, а стандартная ошибка — 2. Дальнейшим файлам, открытым процессом, будут присвоены номера 3, 4, 5 и т. д. Имя «дескриптор файла» немного обманчиво; на платформах Unix сокеты и каналы также ссылаются на файловые дескрипторы.
uk: Дескриптори файлів — це малі цілі числа, що відповідають файлу, відкритому поточним процесом. Наприклад, стандартним введенням зазвичай є дескриптор файлу 0, стандартним виводом є 1, а стандартною помилкою є 2. Іншим файлам, відкритим процесом, буде присвоєно 3, 4, 5 і так далі. Назва "файловий дескриптор" трохи оманлива; на платформах Unix на сокети та канали також посилаються дескриптори файлів.

source: The :meth:`~io.IOBase.fileno` method can be used to obtain the file descriptor associated with a :term:`file object` when required. Note that using the file descriptor directly will bypass the file object methods, ignoring aspects such as internal buffering of data.
ru: The :meth:`~io.IOBase.fileno` Этот метод можно использовать для получения дескриптора файла, связанного с файловым объектом, когда это необходимо. Обратите внимание, что использование файлового дескриптора напрямую позволяет обойти методы файлового объекта, игнорируя такие аспекты, как внутренняя буферизация данных.
uk: Метод :meth:`~io.IOBase.fileno` можна використовувати для отримання дескриптора файлу, пов’язаного з :term:`file object`, коли це необхідно. Зауважте, що використання безпосередньо файлового дескриптора обійде методи файлового об’єкта, ігноруючи такі аспекти, як внутрішня буферизація даних.

source: Close file descriptor *fd*.
ru: Закройте файловый дескриптор *fd*.
uk: Закрити файловий дескриптор *fd*.

source: This function is intended for low-level I/O and must be applied to a file descriptor as returned by :func:`os.open` or :func:`pipe`. To close a "file object" returned by the built-in function :func:`open` or by :func:`popen` or :func:`fdopen`, use its :meth:`~io.IOBase.close` method.
ru: Эта функция предназначена для низкоуровневого ввода-вывода и должна применяться к дескриптору файла, возвращаемому функцией :func:`os.open` или :func:`труба` . Чтобы закрыть «файловый объект», возвращаемый встроенной функцией :func:`открыть` или через :func:`попэн` или :func:`fdopen` , используйте его :meth:`~io.IOBase.close` метод.
uk: Ця функція призначена для низькорівневого вводу-виводу та має застосовуватися до дескриптора файлу, який повертає :func:`os.open` або :func:`pipe`. Щоб закрити "файловий об’єкт", повернутий вбудованою функцією :func:`open` або :func:`popen` або :func:`fdopen`, скористайтеся його методом :meth:`~io.IOBase.close` .

source: Close all file descriptors from *fd_low* (inclusive) to *fd_high* (exclusive), ignoring errors. Equivalent to (but much faster than)::
ru: Закройте все файловые дескрипторы от *fd_low* (включительно) до *fd_high* (исключительно), игнорируя ошибки. Эквивалентно (но намного быстрее)::
uk: Закрийте всі файлові дескриптори від *fd_low* (включно) до *fd_high* (виключно), ігноруючи помилки. Еквівалентно (але набагато швидше ніж):
