Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/os.po
Languages: ru, uk

source: Return ``True`` if this entry is a directory or a symbolic link pointing to a directory; return ``False`` if the entry is or points to any other kind of file, or if it doesn't exist anymore.
ru: Возвращаться ``Правда`` если эта запись является каталогом или символической ссылкой, указывающей на каталог; возвращаться ``Ложь`` если запись является файлом любого другого типа или указывает на него, или если он больше не существует.
uk: Повертає ``True``, якщо цей запис є каталогом або символічним посиланням, що вказує на каталог; повертає ``False``, якщо запис є або вказує на будь-який інший тип файлу, або якщо він більше не існує.

source: If *follow_symlinks* is ``False``, return ``True`` only if this entry is a directory (without following symlinks); return ``False`` if the entry is any other kind of file or if it doesn't exist anymore.
ru: Если *follow_symlinks* ``Ложь`` , возвращаться ``Правда`` только если эта запись является каталогом (без символических ссылок); возвращаться ``Ложь`` если запись представляет собой файл любого другого типа или она больше не существует.
uk: Якщо *follow_symlinks* має значення ``False``, повертає ``True``, лише якщо цей запис є каталогом (без наступних символічних посилань); повертає ``False``, якщо запис є файлом будь-якого іншого типу або якщо він більше не існує.

source: The result is cached on the ``os.DirEntry`` object, with a separate cache for *follow_symlinks* ``True`` and ``False``. Call :func:`os.stat` along with :func:`stat.S_ISDIR` to fetch up-to-date information.
ru: Результат кэшируется на ``os.DirEntry`` объект с отдельным кешем для *follow_symlinks* ``Правда`` и ``Ложь`` . Вызов :func:`os.stat` вместе с :func:`stat.S_ISDIR` для получения актуальной информации.
uk: Результат кешується в об’єкті ``os.DirEntry`` з окремим кешем для *follow_symlinks* ``True`` і ``False``. Викличте :func:`os.stat` разом із :func:`stat.S_ISDIR`, щоб отримати актуальну інформацію.

source: On the first, uncached call, no system call is required in most cases. Specifically, for non-symlinks, neither Windows or Unix require a system call, except on certain Unix file systems, such as network file systems, that return ``dirent.d_type == DT_UNKNOWN``. If the entry is a symlink, a system call will be required to follow the symlink unless *follow_symlinks* is ``False``.
ru: При первом, некэшированном вызове в большинстве случаев системный вызов не требуется. В частности, для несимволических ссылок ни Windows, ни Unix не требуют системного вызова, за исключением некоторых файловых систем Unix, таких как сетевые файловые системы, которые возвращают ``dirent.d_type == DT_UNKNOWN`` . Если запись является символической ссылкой, для перехода по символической ссылке потребуется системный вызов, если только *follow_symlinks* не указано. ``Ложь`` .
uk: Під час першого некешованого виклику в більшості випадків системний виклик не потрібен. Зокрема, для несимволічних посилань ні Windows, ні Unix не потребують системного виклику, за винятком певних файлових систем Unix, таких як мережеві файлові системи, які повертають ``dirent.d_type == DT_UNKNOWN``. Якщо запис є символічним посиланням, для переходу за символічним посиланням знадобиться системний виклик, якщо *follow_symlinks* не має значення ``False``.

source: This method can raise :exc:`OSError`, such as :exc:`PermissionError`, but :exc:`FileNotFoundError` is caught and not raised.
ru: Этот метод может повысить :exc:`OSError` , такой как :exc:`PermissionError` , но :exc:`FileNotFoundError` пойман и не поднят.
uk: Цей метод може викликати :exc:`OSError`, наприклад :exc:`PermissionError`, але :exc:`FileNotFoundError` перехоплюється і не викликається.

source: Return ``True`` if this entry is a file or a symbolic link pointing to a file; return ``False`` if the entry is or points to a directory or other non-file entry, or if it doesn't exist anymore.
ru: Возвращаться ``Правда`` если эта запись является файлом или символической ссылкой, указывающей на файл; возвращаться ``Ложь`` если запись является или указывает на каталог или другую запись, не являющуюся файлом, или если она больше не существует.
uk: Повертає ``True``, якщо цей запис є файлом або символічним посиланням, що вказує на файл; повертає ``False``, якщо запис є або вказує на каталог або інший нефайловий запис, або якщо він більше не існує.

source: If *follow_symlinks* is ``False``, return ``True`` only if this entry is a file (without following symlinks); return ``False`` if the entry is a directory or other non-file entry, or if it doesn't exist anymore.
ru: Если *follow_symlinks* ``Ложь`` , возвращаться ``Правда`` только если эта запись является файлом (без символических ссылок); возвращаться ``Ложь`` если запись является каталогом или другой записью, не являющейся файлом, или если она больше не существует.
uk: Якщо *follow_symlinks* має значення ``False``, повертає ``True``, лише якщо цей запис є файлом (без наступних символічних посилань); повертає ``False``, якщо запис є каталогом чи іншим записом, що не є файлом, або якщо він більше не існує.

source: The result is cached on the ``os.DirEntry`` object. Caching, system calls made, and exceptions raised are as per :func:`~os.DirEntry.is_dir`.
ru: Результат кэшируется на ``os.DirEntry`` объект. Кэширование, выполненные системные вызовы и возникающие исключения соответствуют :func:`~os.DirEntry.is_dir` .
uk: Результат кешується в об’єкті ``os.DirEntry``. Кешування, системні виклики та викликані винятки відповідають :func:`~os.DirEntry.is_dir`.

source: Return ``True`` if this entry is a symbolic link (even if broken); return ``False`` if the entry points to a directory or any kind of file, or if it doesn't exist anymore.
ru: Возвращаться ``Правда`` если эта запись является символической ссылкой (даже если она неработающая); возвращаться ``Ложь`` если запись указывает на каталог или файл любого типа или он больше не существует.
uk: Повертає ``True``, якщо цей запис є символічним посиланням (навіть якщо пошкоджене); повертає ``False``, якщо запис вказує на каталог або будь-який файл, або якщо він більше не існує.

source: The result is cached on the ``os.DirEntry`` object. Call :func:`os.path.islink` to fetch up-to-date information.
ru: Результат кэшируется на ``os.DirEntry`` объект. Вызов :func:`os.path.islink` для получения актуальной информации.
uk: Результат кешується в об’єкті ``os.DirEntry``. Викличте :func:`os.path.islink`, щоб отримати актуальну інформацію.

source: On the first, uncached call, no system call is required in most cases. Specifically, neither Windows or Unix require a system call, except on certain Unix file systems, such as network file systems, that return ``dirent.d_type == DT_UNKNOWN``.
ru: При первом, некэшированном вызове в большинстве случаев системный вызов не требуется. В частности, ни Windows, ни Unix не требуют системного вызова, за исключением некоторых файловых систем Unix, таких как сетевые файловые системы, которые возвращают ``dirent.d_type == DT_UNKNOWN`` .
uk: Під час першого некешованого виклику в більшості випадків системний виклик не потрібен. Зокрема, ані Windows, ані Unix не потребують системного виклику, за винятком певних файлових систем Unix, таких як мережеві файлові системи, які повертають ``dirent.d_type == DT_UNKNOWN``.

source: Return a :class:`stat_result` object for this entry. This method follows symbolic links by default; to stat a symbolic link add the ``follow_symlinks=False`` argument.
ru: Вернуть :class:`stat_result` объект для этой записи. По умолчанию этот метод следует за символическими ссылками; чтобы указать символическую ссылку, добавьте ``follow_symlinks=False`` аргумент.
uk: Повернути об’єкт :class:`stat_result` для цього запису. Цей метод за умовчанням слідує символічним посиланням; щоб стати символічним посиланням, додайте аргумент ``follow_symlinks=False``.

source: On Unix, this method always requires a system call. On Windows, it only requires a system call if *follow_symlinks* is ``True`` and the entry is a reparse point (for example, a symbolic link or directory junction).
ru: В Unix этот метод всегда требует системного вызова. В Windows системный вызов требуется только в том случае, если *follow_symlinks* имеет значение. ``Правда`` и запись является точкой повторной обработки (например, символической ссылкой или соединением каталогов).
uk: В Unix цей метод завжди потребує системного виклику. У Windows системний виклик потрібен, лише якщо *follow_symlinks* має значення ``True`` і запис є точкою повторного аналізу (наприклад, символічне посилання або з’єднання каталогу).

source: On Windows, the ``st_ino``, ``st_dev`` and ``st_nlink`` attributes of the :class:`stat_result` are always set to zero. Call :func:`os.stat` to get these attributes.
ru: В Windows ``st_ino`` , ``st_dev`` и ``st_nlink`` атрибуты :class:`stat_result` всегда установлены на ноль. Вызов :func:`os.stat` чтобы получить эти атрибуты.
uk: У Windows атрибути ``st_ino``, ``st_dev`` і ``st_nlink`` :class:`stat_result` завжди встановлюються на нуль. Викличте :func:`os.stat`, щоб отримати ці атрибути.

source: The result is cached on the ``os.DirEntry`` object, with a separate cache for *follow_symlinks* ``True`` and ``False``. Call :func:`os.stat` to fetch up-to-date information.
ru: Результат кэшируется на ``os.DirEntry`` объект с отдельным кешем для *follow_symlinks* ``Правда`` и ``Ложь`` . Вызов :func:`os.stat` для получения актуальной информации.
uk: Результат кешується в об’єкті ``os.DirEntry`` з окремим кешем для *follow_symlinks* ``True`` і ``False``. Зателефонуйте :func:`os.stat`, щоб отримати актуальну інформацію.

source: Note that there is a nice correspondence between several attributes and methods of ``os.DirEntry`` and of :class:`pathlib.Path`. In particular, the ``name`` attribute has the same meaning, as do the ``is_dir()``, ``is_file()``, ``is_symlink()`` and ``stat()`` methods.
uk: Зауважте, що між декількома атрибутами та методами ``os.DirEntry`` і :class:`pathlib.Path` існує хороша відповідність. Зокрема, атрибут ``name`` має те саме значення, що й методи ``is_dir()``, ``is_file()``, ``is_symlink()`` і ``stat()`` .

source: Added support for the :class:`~os.PathLike` interface. Added support for :class:`bytes` paths on Windows.
ru: Добавлена ​​поддержка :class:`~os.PathLike` интерфейс. Добавлена ​​поддержка :class:`байты` пути в Windows.
uk: Додано підтримку інтерфейсу :class:`~os.PathLike`. Додано підтримку шляхів :class:`bytes` у Windows.

source: Get the status of a file or a file descriptor. Perform the equivalent of a :c:func:`stat` system call on the given path. *path* may be specified as either a string or bytes -- directly or indirectly through the :class:`PathLike` interface -- or as an open file descriptor. Return a :class:`stat_result` object.
ru: Получите статус файла или файлового дескриптора. Выполните эквивалент :c:func:`stat` системный вызов по заданному пути. *path* может быть указан как строка или байты — прямо или косвенно через :class:`PathLike` интерфейс - или как дескриптор открытого файла. Вернуть :class:`stat_result` объект.
uk: Отримати статус файлу або дескриптора файлу. Виконайте еквівалент системного виклику :c:func:`stat` на вказаному шляху. *шлях* можна вказати як рядок або байти — прямо чи опосередковано через інтерфейс :class:`PathLike` — або як дескриптор відкритого файлу. Повертає об’єкт :class:`stat_result`.

source: This function normally follows symlinks; to stat a symlink add the argument ``follow_symlinks=False``, or use :func:`lstat`.
ru: Эта функция обычно следует за символическими ссылками; чтобы указать символическую ссылку, добавьте аргумент ``follow_symlinks=False`` или используйте :func:`lstat` .
uk: Ця функція зазвичай слідує за символічними посиланнями; щоб стати символічним посиланням, додайте аргумент ``follow_symlinks=False`` або використовуйте :func:`lstat`.

source: This function can support :ref:`specifying a file descriptor <path_fd>` and :ref:`not following symlinks <follow_symlinks>`.
ru: Эта функция может поддерживать указание дескриптора файла. ` и :ref:`не переходить по символическим ссылкам`.
uk: Ця функція може підтримувати :ref:`зазначення файлового дескриптора <path_fd>` і :ref:`неперехід за символічними посиланнями <follow_symlinks>`.

source: On Windows, passing ``follow_symlinks=False`` will disable following all name-surrogate reparse points, which includes symlinks and directory junctions. Other types of reparse points that do not resemble links or that the operating system is unable to follow will be opened directly. When following a chain of multiple links, this may result in the original link being returned instead of the non-link that prevented full traversal. To obtain stat results for the final path in this case, use the :func:`os.path.realpath` function to resolve the path name as far as possible and call :func:`lstat` on the result. This does not apply to dangling symlinks or junction points, which will raise the usual exceptions.
ru: В Windows прохождение ``follow_symlinks=False`` отключит отслеживание всех точек повторной обработки суррогатных имен, включая символические ссылки и соединения каталогов. Другие типы точек повторной обработки, которые не похожи на ссылки или по которым операционная система не может пройти, будут открываться напрямую. При переходе по цепочке из нескольких ссылок это может привести к тому, что будет возвращена исходная ссылка вместо ссылки, не являющейся ссылкой, которая препятствовала полному обходу. В этом случае, чтобы получить результаты статистики для конечного пути, используйте команду :func:`os.path.realpath` функция для разрешения имени пути, насколько это возможно, и вызова :func:`lstat` по результату. Это не относится к висячим символическим ссылкам или точкам соединения, которые вызывают обычные исключения.
uk: У Windows передача ``follow_symlinks=False`` вимкне відстеження всіх сурогатних точок повторного аналізу імен, включаючи символічні посилання та з’єднання каталогів. Інші типи точок повторного аналізу, які не схожі на посилання або за якими операційна система не може слідувати, будуть відкриті безпосередньо. Під час переходу за ланцюгом із кількох посилань це може призвести до повернення оригінального посилання замість незв’язку, яке перешкоджало повному обходу. Щоб отримати статистичні результати для кінцевого шляху в цьому випадку, скористайтеся :func:`os.path.realpath` функцією, щоб вирішити назву шляху, наскільки це можливо, і викликайте :func:`lstat` для результату. Це не стосується висячих символічних посилань або точок з’єднання, які призведуть до звичайних винятків.

source: Example::
ru: Пример::
uk: Приклад::

source: :func:`fstat` and :func:`lstat` functions.
ru: :func:`fstat` и :func:`lstat` функции.
uk: Функції :func:`fstat` і :func:`lstat`.

source: Added the *dir_fd* and *follow_symlinks* arguments, specifying a file descriptor instead of a path.
uk: Додано аргументи *dir_fd* і *follow_symlinks* із зазначенням дескриптора файлу замість шляху.

source: On Windows, all reparse points that can be resolved by the operating system are now followed, and passing ``follow_symlinks=False`` disables following all name surrogate reparse points. If the operating system reaches a reparse point that it is not able to follow, *stat* now returns the information for the original path as if ``follow_symlinks=False`` had been specified instead of raising an error.
ru: В Windows теперь учитываются все точки повторной обработки, которые может разрешить операционная система, и передача ``follow_symlinks=False`` отключает отслеживание всех суррогатных точек повторной обработки имени. Если операционная система достигает точки повторной обработки, которую она не может пройти, *stat* теперь возвращает информацию для исходного пути, как если бы ``follow_symlinks=False`` было указано вместо того, чтобы вызывать ошибку.
uk: У Windows усі точки повторного аналізу, які може вирішити операційна система, тепер відстежуються, а передача ``follow_symlinks=False`` вимикає відстеження всіх сурогатних точок повторного аналізу імен. Якщо операційна система досягає точки повторного аналізу, за якою вона не може слідувати, *stat* тепер повертає інформацію для початкового шляху, як якщо б було вказано ``follow_symlinks=False`` замість того, щоб викликати помилку.

source: Object whose attributes correspond roughly to the members of the :c:type:`stat` structure. It is used for the result of :func:`os.stat`, :func:`os.fstat` and :func:`os.lstat`.
uk: Об’єкт, атрибути якого приблизно відповідають членам структури :c:type:`stat`. Він використовується для результату :func:`os.stat`, :func:`os.fstat` і :func:`os.lstat`.

source: Attributes:
ru: Аатрибуты:
uk: Атрибути:

source: File mode: file type and file mode bits (permissions).
ru: Режим файла: биты типа файла и режима файла (разрешения).
uk: Режим файлу: тип файлу та біти режиму файлу (дозволи).

source: Platform dependent, but if non-zero, uniquely identifies the file for a given value of ``st_dev``. Typically:
ru: Зависит от платформы, но если ненулевое значение, однозначно идентифицирует файл для заданного значения ``st_dev`` . Обычно:
uk: Залежить від платформи, але якщо не нуль, унікально ідентифікує файл для заданого значення ``st_dev``. Зазвичай:

source: the inode number on Unix,
ru: номер индексного дескриптора в Unix,
uk: номер inode в Unix,

source: the `file index <https://msdn.microsoft.com/en-us/library/aa363788>`_ on Windows
ru: индекс файла <https://msdn.microsoft.com/en-us/library/aa363788>`_ в Windows
uk: `індекс файлу <https://msdn.microsoft.com/en-us/library/aa363788>`_ у Windows

source: Identifier of the device on which this file resides.
ru: Идентификатор устройства, на котором находится этот файл.
uk: Ідентифікатор пристрою, на якому знаходиться цей файл.

source: Number of hard links.
ru: Количество жестких ссылок.
uk: Кількість жорстких посилань.

source: User identifier of the file owner.
ru: Пользовательский идентификатор владельца файла.
uk: Ідентифікатор користувача власника файлу.

source: Group identifier of the file owner.
ru: Групповой идентификатор владельца файла.
uk: Груповий ідентифікатор власника файлу.

source: Size of the file in bytes, if it is a regular file or a symbolic link. The size of a symbolic link is the length of the pathname it contains, without a terminating null byte.
ru: Размер файла в байтах, если это обычный файл или символическая ссылка. Размер символической ссылки — это длина содержащегося в ней пути без завершающего нулевого байта.
uk: Розмір файлу в байтах, якщо це звичайний файл або символьне посилання. Розмір символічного посилання - це довжина шляху, який воно містить, без кінцевого нульового байта.

source: Timestamps:
ru: Временные метки:
uk: Мітки часу:

source: Time of most recent access expressed in seconds.
ru: Время последнего доступа, выраженное в секундах.
uk: Час останнього доступу, виражений у секундах.

source: Time of most recent content modification expressed in seconds.
ru: Время последней модификации контента, выраженное в секундах.
uk: Час останньої зміни вмісту, виражений у секундах.

source: Platform dependent:
ru: Зависит от платформы:
uk: Залежить від платформи:

source: the time of most recent metadata change on Unix,
uk: час останньої зміни метаданих в Unix,

source: the time of creation on Windows, expressed in seconds.
uk: час створення в Windows, виражений у секундах.

source: Time of most recent access expressed in nanoseconds as an integer.
ru: Время последнего доступа, выраженное в наносекундах как целое число.
uk: Час останнього доступу, виражений у наносекундах як ціле число.

source: Time of most recent content modification expressed in nanoseconds as an integer.
ru: Время последней модификации контента, выраженное в наносекундах как целое число.
uk: Час останньої зміни вмісту, виражений у наносекундах як ціле число.

source: the time of creation on Windows, expressed in nanoseconds as an integer.
uk: час створення в Windows, виражений у наносекундах як ціле число.

source: The exact meaning and resolution of the :attr:`st_atime`, :attr:`st_mtime`, and :attr:`st_ctime` attributes depend on the operating system and the file system. For example, on Windows systems using the FAT or FAT32 file systems, :attr:`st_mtime` has 2-second resolution, and :attr:`st_atime` has only 1-day resolution. See your operating system documentation for details.
uk: Точне значення та роздільна здатність атрибутів :attr:`st_atime`, :attr:`st_mtime` і :attr:`st_ctime` залежать від операційної та файлової системи. Наприклад, у системах Windows, які використовують файлові системи FAT або FAT32, :attr:`st_mtime` має роздільну здатність 2 секунди, а :attr:`st_atime` — лише 1 день. Додаткову інформацію дивіться в документації вашої операційної системи.

source: Similarly, although :attr:`st_atime_ns`, :attr:`st_mtime_ns`, and :attr:`st_ctime_ns` are always expressed in nanoseconds, many systems do not provide nanosecond precision. On systems that do provide nanosecond precision, the floating-point object used to store :attr:`st_atime`, :attr:`st_mtime`, and :attr:`st_ctime` cannot preserve all of it, and as such will be slightly inexact. If you need the exact timestamps you should always use :attr:`st_atime_ns`, :attr:`st_mtime_ns`, and :attr:`st_ctime_ns`.
uk: Подібним чином, хоча :attr:`st_atime_ns`, :attr:`st_mtime_ns` і :attr:`st_ctime_ns` завжди виражаються в наносекундах, багато систем не забезпечують точність до наносекунд. У системах, які забезпечують наносекундну точність, об’єкт із плаваючою комою, який використовується для зберігання :attr:`st_atime`, :attr:`st_mtime` і :attr:`st_ctime`, не може зберегти все це, і тому буде трохи неточним . Якщо вам потрібні точні мітки часу, завжди використовуйте :attr:`st_atime_ns`, :attr:`st_mtime_ns` і :attr:`st_ctime_ns`.

source: On some Unix systems (such as Linux), the following attributes may also be available:
ru: В некоторых системах Unix (например, Linux) также могут быть доступны следующие атрибуты:
uk: У деяких системах Unix (таких як Linux) також можуть бути доступні такі атрибути:

source: Number of 512-byte blocks allocated for file. This may be smaller than :attr:`st_size`/512 when the file has holes.
ru: Количество блоков по 512 байт, выделенных для файла. Это может быть меньше, чем :attr:`st_size` /512, если в файле есть дыры.
uk: Кількість 512-байтних блоків, виділених для файлу. Це може бути менше, ніж :attr:`st_size`/512, якщо файл має отвори.

source: "Preferred" blocksize for efficient file system I/O. Writing to a file in smaller chunks may cause an inefficient read-modify-rewrite.
ru: «Предпочтительный» размер блока для эффективного ввода-вывода файловой системы. Запись в файл меньшими порциями может привести к неэффективному чтению-изменению-перезаписи.
uk: "Бажаний" розмір блоку для ефективного введення/виведення файлової системи. Запис у файл меншими фрагментами може спричинити неефективне читання-змінення-перезапис.

source: Type of device if an inode device.
ru: Тип устройства, если это индексное устройство.
uk: Тип пристрою, якщо пристрій inode.

source: User defined flags for file.
ru: Определяемые пользователем флаги для файла.
uk: Визначені користувачем позначки для файлу.

source: On other Unix systems (such as FreeBSD), the following attributes may be available (but may be only filled out if root tries to use them):
ru: В других системах Unix (таких как FreeBSD) могут быть доступны следующие атрибуты (но их можно заполнить только в том случае, если root попытается их использовать):
uk: В інших системах Unix (таких як FreeBSD) такі атрибути можуть бути доступними (але можуть бути заповнені, лише якщо root намагається їх використати):

source: File generation number.
ru: Номер генерации файла.
uk: Номер покоління файлу.

source: Time of file creation.
uk: Час створення файлу.
