Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/pathlib.po
Languages: ru

source: pathlib normalizes ``Path("my_folder/")`` to ``Path("my_folder")``, which changes a path's meaning when supplied to various operating system APIs and command-line utilities. Specifically, the absence of a trailing separator may allow the path to be resolved as either a file or directory, rather than a directory only.
ru: pathlib нормализует ``Path("my_folder/")`` до ``Path("my_folder")``, что меняет значение пути при его передаче различным API-интерфейсам операционной системы и утилитам командной строки. В частности, отсутствие завершающего разделителя может позволить разрешить путь либо как файл, либо как каталог, а не только как каталог.

source: pathlib normalizes ``Path("./my_program")`` to ``Path("my_program")``, which changes a path's meaning when used as an executable search path, such as in a shell or when spawning a child process. Specifically, the absence of a separator in the path may force it to be looked up in :envvar:`PATH` rather than the current directory.
ru: pathlib нормализует ``Path("./my_program")`` до ``Path("my_program")``, что меняет значение пути при использовании в качестве пути поиска исполняемого файла, например, в оболочке или при создании дочернего процесса . В частности, отсутствие разделителя в пути может привести к тому, что его придется искать в :envvar:`PATH`, а не в текущем каталоге.

source: As a consequence of these differences, pathlib is not a drop-in replacement for :mod:`os.path`.
ru: Как следствие этих различий, pathlib не является полной заменой :mod:`os.path`.

source: Corresponding tools
ru: Соответствующие инструменты

source: Below is a table mapping various :mod:`os` functions to their corresponding :class:`PurePath`/:class:`Path` equivalent.
ru: Ниже приведена таблица, сопоставляющая различные функции :mod:`os` с их соответствующими эквивалентами :class:`PurePath`/:class:`Path`.

source: :mod:`os` and :mod:`os.path`
ru: :mod:`os` и :mod:`os.path`

source: Footnotes
ru: Сноски

source: :func:`os.path.relpath` calls :func:`~os.path.abspath` to make paths absolute and remove "``..``" parts, whereas :meth:`PurePath.relative_to` is a lexical operation that raises :exc:`ValueError` when its inputs' anchors differ (e.g. if one path is absolute and the other relative.)
ru: :func:`os.path.relpath` вызывает :func:`~os.path.abspath`, чтобы сделать пути абсолютными и удалить части "``..``", тогда как :meth:`PurePath.relative_to` является лексическим операция, которая вызывает :exc:`ValueError`, когда ее входные привязки различаются (например, если один путь является абсолютным, а другой относительным).

source: :func:`os.path.expanduser` returns the path unchanged if the home directory can't be resolved, whereas :meth:`Path.expanduser` raises :exc:`RuntimeError`.
ru: :func:`os.path.expanduser` возвращает путь без изменений, если домашний каталог не может быть разрешен, тогда как :meth:`Path.expanduser` вызывает :exc:`RuntimeError`.

source: :func:`os.path.abspath` removes "``..``" components without resolving symlinks, which may change the meaning of the path, whereas :meth:`Path.absolute` leaves any "``..``" components in the path.
ru: :func:`os.path.abspath` удаляет компоненты "``..``" без разрешения символических ссылок, что может изменить значение пути, тогда как :meth:`Path.absolute` оставляет любые "``..` `" компоненты в пути.

source: :func:`os.walk` always follows symlinks when categorizing paths into *dirnames* and *filenames*, whereas :meth:`Path.walk` categorizes all symlinks into *filenames* when *follow_symlinks* is false (the default.)
ru: :func:`os.walk` всегда следует по символическим ссылкам при классификации путей на *имена каталогов* и *имена файлов*, тогда как :meth:`Path.walk` классифицирует все символические ссылки на *имена файлов*, когда *follow_symlinks* имеет значение false (по умолчанию).

source: path
ru: путь

source: operations
ru: операции
