Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/pathlib.po
Languages: ru

source: :mod:`!pathlib` --- Object-oriented filesystem paths
ru: :mod:`!pathlib` --- Пути к объектно-ориентированной файловой системе

source: **Source code:** :source:`Lib/pathlib/`
ru: **Исходный код:** :source:`Lib/pathlib/`

source: This module offers classes representing filesystem paths with semantics appropriate for different operating systems. Path classes are divided between :ref:`pure paths <pure-paths>`, which provide purely computational operations without I/O, and :ref:`concrete paths <concrete-paths>`, which inherit from pure paths but also provide I/O operations.
ru: Этот модуль предлагает классы, представляющие пути файловой системы с семантикой, подходящей для разных операционных систем. Классы путей делятся на :ref:`pure paths <pure-paths>`, которые обеспечивают чисто вычислительные операции без ввода-вывода, и :ref:`concrete paths <concrete-paths>`, которые наследуются от чистых путей, но также предоставляют Операции ввода-вывода.

source: Inheritance diagram showing the classes available in pathlib. The most basic class is PurePath, which has three direct subclasses: PurePosixPath, PureWindowsPath, and Path. Further to these four classes, there are two classes that use multiple inheritance: PosixPath subclasses PurePosixPath and Path, and WindowsPath subclasses PureWindowsPath and Path.
ru: Диаграмма наследования, показывающая классы, доступные в pathlib. Самый базовый класс — PurePath, у которого есть три прямых подкласса: PurePosixPath, PureWindowsPath и Path. В дополнение к этим четырем классов, есть два класса, которые используют множественное наследование: PosixPath является подклассами PurePosixPath и Path, а также WindowsPath. подклассы PureWindowsPath и Path.

source: If you've never used this module before or just aren't sure which class is right for your task, :class:`Path` is most likely what you need. It instantiates a :ref:`concrete path <concrete-paths>` for the platform the code is running on.
ru: Если вы никогда раньше не использовали этот модуль или просто не уверены, какой класс подходит для вашей задачи, :class:`Path`, скорее всего, вам нужен. Он создает экземпляр :ref:`конкретного пути <concrete-paths>` для платформы, на которой выполняется код.

source: Pure paths are useful in some special cases; for example:
ru: Чистые пути полезны в некоторых особых случаях; например:

source: If you want to manipulate Windows paths on a Unix machine (or vice versa). You cannot instantiate a :class:`WindowsPath` when running on Unix, but you can instantiate :class:`PureWindowsPath`.
ru: Если вы хотите манипулировать путями Windows на компьютере с Unix (или наоборот). Вы не можете создать экземпляр :class:`WindowsPath` при работе в Unix, но вы можете создать экземпляр :class:`PureWindowsPath`.

source: You want to make sure that your code only manipulates paths without actually accessing the OS. In this case, instantiating one of the pure classes may be useful since those simply don't have any OS-accessing operations.
ru: Вы хотите быть уверены, что ваш код только манипулирует путями, не обращаясь к ОС. В этом случае может оказаться полезным создание экземпляра одного из чистых классов, поскольку у них просто нет никаких операций доступа к ОС.

source: :pep:`428`: The pathlib module -- object-oriented filesystem paths.
ru: :pep:`428`: Модуль pathlib — пути к объектно-ориентированной файловой системе.

source: For low-level path manipulation on strings, you can also use the :mod:`os.path` module.
ru: Для низкоуровневых манипуляций с путями строк вы также можете использовать модуль :mod:`os.path`.

source: Basic use
ru: Основное использование

source: Importing the main class::
ru: Импорт основного класса::

source: Listing subdirectories::
ru: Перечисление подкаталогов::

source: Listing Python source files in this directory tree::
ru: Листинг исходных файлов Python в этом дереве каталогов::

source: Navigating inside a directory tree::
ru: Навигация внутри дерева каталогов::

source: Querying path properties::
ru: Запрос свойств пути::

source: Opening a file::
ru: Открытие файла::

source: Exceptions
ru: Исключения

source: An exception inheriting :exc:`NotImplementedError` that is raised when an unsupported operation is called on a path object.
ru: Исключение, наследующее :exc:`NotImplementedError`, которое возникает, когда неподдерживаемая операция вызывается для объекта пути.

source: Pure paths
ru: Чистые пути

source: Pure path objects provide path-handling operations which don't actually access a filesystem. There are three ways to access these classes, which we also call *flavours*:
ru: Объекты чистого пути предоставляют операции обработки пути, которые фактически не обращаются к файловой системе. Есть три способа доступа к этим классам, которые мы также называем *ароматы*:

source: A generic class that represents the system's path flavour (instantiating it creates either a :class:`PurePosixPath` or a :class:`PureWindowsPath`)::
ru: Общий класс, который представляет вариант системного пути (при его создании создается либо :class:`PurePosixPath`, либо :class:`PureWindowsPath`)::

source: Each element of *pathsegments* can be either a string representing a path segment, or an object implementing the :class:`os.PathLike` interface where the :meth:`~os.PathLike.__fspath__` method returns a string, such as another path object::
ru: Каждый элемент *pathsegments* может быть либо строкой, представляющей сегмент пути, либо объектом, реализующим интерфейс :class:`os.PathLike`, где метод :meth:`~os.PathLike.__fspath__` возвращает строку, например другой объект пути::

source: When *pathsegments* is empty, the current directory is assumed::
ru: Если *pathsegments* пусто, подразумевается текущий каталог::

source: If a segment is an absolute path, all previous segments are ignored (like :func:`os.path.join`)::
ru: Если сегмент представляет собой абсолютный путь, все предыдущие сегменты игнорируются (например, :func:`os.path.join`)::

source: On Windows, the drive is not reset when a rooted relative path segment (e.g., ``r'\foo'``) is encountered::
ru: В Windows диск не сбрасывается при обнаружении корневого сегмента относительного пути (например, ``r'\foo'``)::

source: Spurious slashes and single dots are collapsed, but double dots (``'..'``) and leading double slashes (``'//'``) are not, since this would change the meaning of a path for various reasons (e.g. symbolic links, UNC paths)::
ru: Ложные косые черты и одиночные точки сворачиваются, а двойные точки (``'..'``) и ведущие двойные косые черты (``'//'``) - нет, поскольку это может изменить смысл пути по разным причинам. (например, символические ссылки, пути UNC)::

source: (a naïve approach would make ``PurePosixPath('foo/../bar')`` equivalent to ``PurePosixPath('bar')``, which is wrong if ``foo`` is a symbolic link to another directory)
ru: (при наивном подходе ``PurePosixPath('foo/../bar')`` эквивалентен ``PurePosixPath('bar')``, что неверно, если ``foo`` является символической ссылкой на другой каталог. )

source: Pure path objects implement the :class:`os.PathLike` interface, allowing them to be used anywhere the interface is accepted.
ru: Объекты чистого пути реализуют интерфейс :class:`os.PathLike`, что позволяет использовать их везде, где этот интерфейс принят.

source: Added support for the :class:`os.PathLike` interface.
ru: Добавлена ​​поддержка интерфейса :class:`os.PathLike`.

source: A subclass of :class:`PurePath`, this path flavour represents non-Windows filesystem paths::
ru: Подкласс :class:`PurePath`, этот вариант пути представляет пути файловой системы, отличные от Windows::

source: *pathsegments* is specified similarly to :class:`PurePath`.
ru: *pathsegments* указывается аналогично :class:`PurePath`.

source: A subclass of :class:`PurePath`, this path flavour represents Windows filesystem paths, including `UNC paths`_::
ru: Подкласс :class:`PurePath`, этот вариант пути представляет пути файловой системы Windows, включая `UNC-пути`_::

source: Regardless of the system you're running on, you can instantiate all of these classes, since they don't provide any operation that does system calls.
ru: Независимо от системы, в которой вы работаете, вы можете создать экземпляры всех этих классов, поскольку они не предоставляют никаких операций, выполняющих системные вызовы.

source: General properties
ru: Общие свойства

source: Paths are immutable and :term:`hashable`. Paths of a same flavour are comparable and orderable. These properties respect the flavour's case-folding semantics::
ru: Пути являются неизменяемыми и :term:`хэшируемыми`. Пути одного и того же вкуса сопоставимы и доступны для заказа. Эти свойства учитывают семантику свертывания регистра аромата:

source: Paths of a different flavour compare unequal and cannot be ordered::
ru: Пути разного вкуса сравниваются неравными и не могут быть упорядочены::

source: Operators
ru: Операторы

source: The slash operator helps create child paths, like :func:`os.path.join`. If the argument is an absolute path, the previous path is ignored. On Windows, the drive is not reset when the argument is a rooted relative path (e.g., ``r'\foo'``)::
ru: Оператор косой черты помогает создавать дочерние пути, например :func:`os.path.join`. Если аргумент представляет собой абсолютный путь, предыдущий путь игнорируется. В Windows диск не сбрасывается, если аргументом является корневой относительный путь (например, ``r'\foo'``)::

source: A path object can be used anywhere an object implementing :class:`os.PathLike` is accepted::
ru: Объект пути можно использовать везде, где принят объект, реализующий :class:`os.PathLike`::

source: The string representation of a path is the raw filesystem path itself (in native form, e.g. with backslashes under Windows), which you can pass to any function taking a file path as a string::
ru: Строковое представление пути — это сам необработанный путь файловой системы (в собственной форме, например, с обратной косой чертой в Windows), который вы можете передать любой функции, принимающей путь к файлу в виде строки::

source: Similarly, calling :class:`bytes` on a path gives the raw filesystem path as a bytes object, as encoded by :func:`os.fsencode`::
ru: Аналогично, вызов :class:`bytes` для пути дает необработанный путь файловой системы в виде байтового объекта, закодированного :func:`os.fsencode`::

source: Calling :class:`bytes` is only recommended under Unix. Under Windows, the unicode form is the canonical representation of filesystem paths.
ru: Вызов :class:`bytes` рекомендуется только в Unix. В Windows форма Юникода является каноническим представлением путей файловой системы.

source: Accessing individual parts
ru: Доступ к отдельным частям

source: To access the individual "parts" (components) of a path, use the following property:
ru: Чтобы получить доступ к отдельным «частям» (компонентам) пути, используйте следующее свойство:

source: A tuple giving access to the path's various components::
ru: Кортеж, предоставляющий доступ к различным компонентам пути:

source: (note how the drive and local root are regrouped in a single part)
ru: (обратите внимание, как диск и локальный корень перегруппированы в одну часть)

source: Methods and properties
ru: Методы и свойства

source: Pure paths provide the following methods and properties:
ru: Чистые пути предоставляют следующие методы и свойства:

source: The implementation of the :mod:`os.path` module used for low-level path parsing and joining: either :mod:`posixpath` or :mod:`ntpath`.
ru: Реализация модуля :mod:`os.path`, используемого для низкоуровневого анализа и объединения путей: либо :mod:`posixpath`, либо :mod:`ntpath`.

source: A string representing the drive letter or name, if any::
ru: Строка, представляющая букву или имя диска, если таковое имеется::

source: UNC shares are also considered drives::
ru: Общие ресурсы UNC также считаются дисками:

source: A string representing the (local or global) root, if any::
ru: Строка, представляющая корень (локальный или глобальный), если таковой имеется::

source: UNC shares always have a root::
ru: UNC-акции всегда имеют корень::

source: If the path starts with more than two successive slashes, :class:`~pathlib.PurePosixPath` collapses them::
ru: Если путь начинается с более чем двух последовательных косых черт, :class:`~pathlib.PurePosixPath` сворачивает их::

source: This behavior conforms to *The Open Group Base Specifications Issue 6*, paragraph `4.11 Pathname Resolution <https://pubs.opengroup.org/onlinepubs/009695399/basedefs/xbd_chap04.html#tag_04_11>`_:
ru: Такое поведение соответствует *Базовым спецификациям открытой группы, выпуск 6*, параграф `4.11 Разрешение пути <https://pubs.opengroup.org/onlinepubs/009695399/basedefs/xbd_chap04.html#tag_04_11>`_:

source: *"A pathname that begins with two successive slashes may be interpreted in an implementation-defined manner, although more than two leading slashes shall be treated as a single slash."*
ru: *"Имя пути, которое начинается с двух последовательных косых черт, может интерпретироваться в зависимости от реализации, хотя более двух ведущих косых черт должны рассматриваться как одна косая черта."*

source: The concatenation of the drive and root::
ru: Объединение диска и корня::

source: An immutable sequence providing access to the logical ancestors of the path::
ru: Неизменяемая последовательность, обеспечивающая доступ к логическим предкам пути::

source: The parents sequence now supports :term:`slices <slice>` and negative index values.
ru: Родительская последовательность теперь поддерживает :term:`slices <slice>` и отрицательные значения индекса.

source: The logical parent of the path::
ru: Логический родитель пути::

source: You cannot go past an anchor, or empty path::
ru: Вы не можете пройти мимо привязки или пустого пути::

source: This is a purely lexical operation, hence the following behaviour::
ru: Это чисто лексическая операция, отсюда и следующее поведение:

source: If you want to walk an arbitrary filesystem path upwards, it is recommended to first call :meth:`Path.resolve` so as to resolve symlinks and eliminate ``".."`` components.
ru: Если вы хотите пройти по произвольному пути файловой системы вверх, рекомендуется сначала вызвать :meth:`Path.resolve`, чтобы разрешить символические ссылки и исключить компоненты ``".."``.

source: A string representing the final path component, excluding the drive and root, if any::
ru: Строка, представляющая конечный компонент пути, исключая диск и корень, если таковые имеются::

source: UNC drive names are not considered::
ru: Имена дисков UNC не учитываются::

source: The last dot-separated portion of the final component, if any::
ru: Последняя часть конечного компонента, разделенная точкой, если таковая имеется:

source: This is commonly called the file extension.
ru: Это обычно называют расширением файла.

source: A list of the path's suffixes, often called file extensions::
ru: Список суффиксов пути, часто называемых расширениями файлов::

source: The final path component, without its suffix::
ru: Последний компонент пути без суффикса::

source: Return a string representation of the path with forward slashes (``/``)::
ru: Возвращает строковое представление пути с косой чертой (``/``)::

source: Return whether the path is absolute or not. A path is considered absolute if it has both a root and (if the flavour allows) a drive::
ru: Возвращает значение, является ли путь абсолютным или нет. Путь считается абсолютным, если он имеет как корень, так и (если позволяет версия) диск::

source: Return whether or not this path is relative to the *other* path.
ru: Возвращает значение, является ли этот путь относительно *другого* пути.

source: This method is string-based; it neither accesses the filesystem nor treats "``..``" segments specially. The following code is equivalent:
ru: Этот метод основан на строках; он не обращается к файловой системе и не обрабатывает сегменты «``..``» особым образом. Следующий код эквивалентен:

source: Passing additional arguments is deprecated; if supplied, they are joined with *other*.
ru: Передача дополнительных аргументов не рекомендуется; если они указаны, они соединяются с *other*.

source: With :class:`PureWindowsPath`, return ``True`` if the path is considered reserved under Windows, ``False`` otherwise. With :class:`PurePosixPath`, ``False`` is always returned.
ru: С помощью :class:`PureWindowsPath` верните ``True``, если путь считается зарезервированным под Windows, ``False`` в противном случае. При использовании :class:`PurePosixPath` всегда возвращается ``False``.

source: Windows path names that contain a colon, or end with a dot or a space, are considered reserved. UNC paths may be reserved.
ru: Имена путей Windows, которые содержат двоеточие или заканчиваются точкой или пробелом, считаются зарезервированными. UNC-пути могут быть зарезервированы.

source: This method is deprecated; use :func:`os.path.isreserved` to detect reserved paths on Windows.
ru: Этот метод устарел; используйте :func:`os.path.isreserved` для обнаружения зарезервированных путей в Windows.

source: Calling this method is equivalent to combining the path with each of the given *pathsegments* in turn::
ru: Вызов этого метода эквивалентен объединению пути с каждым из заданных *pathsegments* по очереди::

source: Match this path against the provided glob-style pattern. Return ``True`` if matching is successful, ``False`` otherwise. For example::
ru: Сопоставьте этот путь с предоставленным шаблоном в стиле glob. Возвращайте ``True``, если сопоставление прошло успешно, и ``False`` в противном случае. Например::

source: :ref:`pathlib-pattern-language` documentation.
ru: :ref:`pathlib-pattern-language` документация.

source: As with other methods, case-sensitivity follows platform defaults::
ru: Как и в других методах, чувствительность к регистру соответствует настройкам платформы по умолчанию:

source: Set *case_sensitive* to ``True`` or ``False`` to override this behaviour.
ru: Установите для *case_sensitivity* значение True или False, чтобы переопределить это поведение.

source: Match this path against the provided non-recursive glob-style pattern. Return ``True`` if matching is successful, ``False`` otherwise.
ru: Сопоставьте этот путь с предоставленным нерекурсивным шаблоном в стиле glob. Возвращайте ``True``, если сопоставление прошло успешно, и ``False`` в противном случае.

source: This method is similar to :meth:`~PurePath.full_match`, but empty patterns aren't allowed (:exc:`ValueError` is raised), the recursive wildcard "``**``" isn't supported (it acts like non-recursive "``*``"), and if a relative pattern is provided, then matching is done from the right::
ru: Этот метод аналогичен :meth:`~PurePath.full_match`, но пустые шаблоны не допускаются (возникает :exc:`ValueError`), рекурсивный подстановочный знак "``**``" не поддерживается (он действует как нерекурсивный "``*``"), и если указан относительный шаблон, то сопоставление выполняется справа::

source: The *pattern* parameter accepts a :term:`path-like object`.
ru: Параметр *pattern* принимает объект, похожий на путь.

source: The *case_sensitive* parameter was added.
ru: Добавлен параметр *case_sensitivity*.

source: Compute a version of this path relative to the path represented by *other*. If it's impossible, :exc:`ValueError` is raised::
ru: Вычислите версию этого пути относительно пути, представленного *other*. Если это невозможно, возникает :exc:`ValueError`::

source: >>> p = PurePosixPath('/etc/passwd') >>> p.relative_to('/') PurePosixPath('etc/passwd') >>> p.relative_to('/etc') PurePosixPath('passwd') >>> p.relative_to('/usr') Traceback (most recent call last): File "<stdin>", line 1, in <module> File "pathlib.py", line 941, in relative_to raise ValueError(error_message.format(str(self), str(formatted))) ValueError: '/etc/passwd' is not in the subpath of '/usr' OR one path is relative and the other is absolute.
ru: >>> p = PurePosixPath('/etc/passwd') >>> p.relative_to('/') PurePosixPath('etc/passwd') >>> p.relative_to('/etc') PurePosixPath('passwd') >>> p.relative_to('/usr') Traceback (последний вызов последний): Файл «<stdin>», строка 1, в <модуле> Файл «pathlib.py», строка 941, в относительных_to поднять ValueError(error_message.format(str(self), str(formatted))) ValueError: «/etc/passwd» не находится в подпути «/usr» ИЛИ один путь является относительным, а другой — абсолютным.

source: When *walk_up* is false (the default), the path must start with *other*. When the argument is true, ``..`` entries may be added to form the relative path. In all other cases, such as the paths referencing different drives, :exc:`ValueError` is raised.::
ru: Если *walk_up* имеет значение false (по умолчанию), путь должен начинаться с *other*. Если аргумент равен true, записи ``..`` могут быть добавлены для формирования относительного пути. Во всех остальных случаях, например, когда пути ссылаются на разные диски, возникает :exc:`ValueError`.::

source: This function is part of :class:`PurePath` and works with strings. It does not check or access the underlying file structure. This can impact the *walk_up* option as it assumes that no symlinks are present in the path; call :meth:`~Path.resolve` first if necessary to resolve symlinks.
ru: Эта функция является частью :class:`PurePath` и работает со строками. Он не проверяет базовую файловую структуру и не получает к ней доступа. Это может повлиять на параметр *walk_up*, поскольку он предполагает, что в пути нет символических ссылок; сначала вызовите :meth:`~Path.resolve`, если необходимо разрешить символические ссылки.

source: The *walk_up* parameter was added (old behavior is the same as ``walk_up=False``).
ru: Был добавлен параметр *walk_up* (старое поведение такое же, как ``walk_up=False``).

source: Passing additional positional arguments is deprecated; if supplied, they are joined with *other*.
ru: Передача дополнительных позиционных аргументов не рекомендуется; если они указаны, они соединяются с *other*.

source: Return a new path with the :attr:`name` changed. If the original path doesn't have a name, ValueError is raised::
ru: Вернуть новый путь с измененным :attr:`name`. Если исходный путь не имеет имени, возникает ValueError::

source: Return a new path with the :attr:`stem` changed. If the original path doesn't have a name, ValueError is raised::
ru: Вернуть новый путь с измененным :attr:`stem`. Если исходный путь не имеет имени, возникает ValueError::

source: Return a new path with the :attr:`suffix` changed. If the original path doesn't have a suffix, the new *suffix* is appended instead. If the *suffix* is an empty string, the original suffix is removed::
ru: Вернуть новый путь с измененным суффиксом :attr:`suffix`. Если исходный путь не имеет суффикса, вместо него добавляется новый *суффикс*. Если *суффикс* представляет собой пустую строку, исходный суффикс удаляется::

source: Create a new path object of the same type by combining the given *pathsegments*. This method is called whenever a derivative path is created, such as from :attr:`parent` and :meth:`relative_to`. Subclasses may override this method to pass information to derivative paths, for example::
ru: Создайте новый объект пути того же типа, объединив заданные *сегменты пути*. Этот метод вызывается всякий раз, когда создается производный путь, например, из :attr:`parent` и :meth:`relative_to`. Подклассы могут переопределять этот метод для передачи информации в производные пути, например:

source: Concrete paths
ru: Конкретные пути
