Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/pathlib.po
Languages: ru

source: Concrete paths are subclasses of the pure path classes. In addition to operations provided by the latter, they also provide methods to do system calls on path objects. There are three ways to instantiate concrete paths:
ru: Конкретные пути являются подклассами классов чистых путей. В дополнение к операциям, предоставляемым последними, они также предоставляют методы для выполнения системных вызовов объектов пути. Существует три способа создания конкретных путей:

source: A subclass of :class:`PurePath`, this class represents concrete paths of the system's path flavour (instantiating it creates either a :class:`PosixPath` or a :class:`WindowsPath`)::
ru: Подкласс :class:`PurePath`, этот класс представляет конкретные пути системного пути (при его создании создается либо :class:`PosixPath`, либо :class:`WindowsPath`)::

source: A subclass of :class:`Path` and :class:`PurePosixPath`, this class represents concrete non-Windows filesystem paths::
ru: Подкласс :class:`Path` и :class:`PurePosixPath`, этот класс представляет конкретные пути к файловой системе, отличной от Windows::

source: Raises :exc:`UnsupportedOperation` on Windows. In previous versions, :exc:`NotImplementedError` was raised instead.
ru: Вызывает :exc:`UnsupportedOperation` в Windows. В предыдущих версиях вместо этого вызывалось :exc:`NotImplementedError`.

source: A subclass of :class:`Path` and :class:`PureWindowsPath`, this class represents concrete Windows filesystem paths::
ru: Подкласс :class:`Path` и :class:`PureWindowsPath`, этот класс представляет конкретные пути к файловой системе Windows::

source: Raises :exc:`UnsupportedOperation` on non-Windows platforms. In previous versions, :exc:`NotImplementedError` was raised instead.
ru: Вызывает :exc:`UnsupportedOperation` на платформах, отличных от Windows. В предыдущих версиях вместо этого вызывалось :exc:`NotImplementedError`.

source: You can only instantiate the class flavour that corresponds to your system (allowing system calls on non-compatible path flavours could lead to bugs or failures in your application)::
ru: Вы можете создать экземпляр только того класса, который соответствует вашей системе (разрешение системных вызовов по несовместимым вариантам путей может привести к ошибкам или сбоям в вашем приложении)::

source: Some concrete path methods can raise an :exc:`OSError` if a system call fails (for example because the path doesn't exist).
ru: Некоторые методы конкретного пути могут вызвать ошибку :exc:`OSError` в случае сбоя системного вызова (например, из-за того, что путь не существует).

source: Parsing and generating URIs
ru: Парсинг и генерация URI

source: Concrete path objects can be created from, and represented as, 'file' URIs conforming to :rfc:`8089`.
ru: Объекты конкретного пути могут быть созданы и представлены как «файловые» URI, соответствующие :rfc:`8089`.

source: File URIs are not portable across machines with different :ref:`filesystem encodings <filesystem-encoding>`.
ru: Файловые URI не переносятся между компьютерами с разными кодировками файловой системы <filesystem-encoding>`.

source: Return a new path object from parsing a 'file' URI. For example::
ru: Вернуть новый объект пути в результате анализа URI «файла». Например::

source: On Windows, DOS device and UNC paths may be parsed from URIs::
ru: В Windows устройства DOS и пути UNC могут быть проанализированы из URI::

source: Several variant forms are supported::
ru: Поддерживаются несколько вариантов форм:

source: :exc:`ValueError` is raised if the URI does not start with ``file:``, or the parsed path isn't absolute.
ru: :exc:`ValueError` возникает, если URI не начинается с ``file:`` или проанализированный путь не является абсолютным.

source: Represent the path as a 'file' URI. :exc:`ValueError` is raised if the path isn't absolute.
ru: Представьте путь как URI «файла». :exc:`ValueError` возникает, если путь не является абсолютным.

source: For historical reasons, this method is also available from :class:`PurePath` objects. However, its use of :func:`os.fsencode` makes it strictly impure.
ru: По историческим причинам этот метод также доступен из объектов :class:`PurePath`. Однако использование :func:`os.fsencode` делает его строго нечистым.

source: Expanding and resolving paths
ru: Расширение и разрешение путей

source: Return a new path object representing the user's home directory (as returned by :func:`os.path.expanduser` with ``~`` construct). If the home directory can't be resolved, :exc:`RuntimeError` is raised.
ru: Возвращает новый объект пути, представляющий домашний каталог пользователя (возвращаемый :func:`os.path.expanduser` с конструкцией ``~``). Если домашний каталог не может быть разрешен, возникает :exc:`RuntimeError`.

source: Return a new path with expanded ``~`` and ``~user`` constructs, as returned by :meth:`os.path.expanduser`. If a home directory can't be resolved, :exc:`RuntimeError` is raised.
ru: Возвращает новый путь с расширенными конструкциями ``~`` и ``~user``, как это возвращает :meth:`os.path.expanduser`. Если домашний каталог не может быть разрешен, возникает :exc:`RuntimeError`.

source: Return a new path object representing the current directory (as returned by :func:`os.getcwd`)::
ru: Вернуть новый объект пути, представляющий текущий каталог (возвращенный :func:`os.getcwd`)::

source: Make the path absolute, without normalization or resolving symlinks. Returns a new path object::
ru: Сделайте путь абсолютным, без нормализации или разрешения символических ссылок. Возвращает новый объект пути::

source: Make the path absolute, resolving any symlinks. A new path object is returned::
ru: Сделайте путь абсолютным, разрешая любые символические ссылки. Возвращается новый объект пути::

source: "``..``" components are also eliminated (this is the only method to do so)::
ru: Компоненты "``..``" также удаляются (это единственный способ сделать это)::

source: If a path doesn't exist or a symlink loop is encountered, and *strict* is ``True``, :exc:`OSError` is raised. If *strict* is ``False``, the path is resolved as far as possible and any remainder is appended without checking whether it exists.
ru: Если путь не существует или обнаружен цикл символической ссылки, а *strict* имеет значение True, возникает :exc:`OSError`. Если *strict* имеет значение False, путь разрешается, насколько это возможно, и любой остаток добавляется без проверки его существования.

source: The *strict* parameter was added (pre-3.6 behavior is strict).
ru: Был добавлен параметр *strict* (до версии 3.6 поведение было строгим).

source: Symlink loops are treated like other errors: :exc:`OSError` is raised in strict mode, and no exception is raised in non-strict mode. In previous versions, :exc:`RuntimeError` is raised no matter the value of *strict*.
ru: Циклы символических ссылок обрабатываются так же, как и другие ошибки: :exc:`OSError` возникает в строгом режиме, а в нестрогом режиме не возникает никаких исключений. В предыдущих версиях :exc:`RuntimeError` возникал независимо от значения *strict*.

source: Return the path to which the symbolic link points (as returned by :func:`os.readlink`)::
ru: Возвращает путь, на который указывает символическая ссылка (возвращенная :func:`os.readlink`)::

source: Raises :exc:`UnsupportedOperation` if :func:`os.readlink` is not available. In previous versions, :exc:`NotImplementedError` was raised.
ru: Вызывает :exc:`UnsupportedOperation`, если :func:`os.readlink` недоступен. В предыдущих версиях возникало :exc:`NotImplementedError`.

source: Querying file type and status
ru: Запрос типа и статуса файла

source: :meth:`~Path.exists`, :meth:`~Path.is_dir`, :meth:`~Path.is_file`, :meth:`~Path.is_mount`, :meth:`~Path.is_symlink`, :meth:`~Path.is_block_device`, :meth:`~Path.is_char_device`, :meth:`~Path.is_fifo`, :meth:`~Path.is_socket` now return ``False`` instead of raising an exception for paths that contain characters unrepresentable at the OS level.
ru: :meth:`~Path.exists`, :meth:`~Path.is_dir`, :meth:`~Path.is_file`, :meth:`~Path.is_mount`, :meth:`~Path.is_symlink`, :meth:`~Path.is_block_device`, :meth:`~Path.is_char_device`, :meth:`~Path.is_fifo`, :meth:`~Path.is_socket` теперь возвращают ``False`` вместо вызова исключение для путей, содержащих символы, непредставимые на уровне ОС.

source: Return an :class:`os.stat_result` object containing information about this path, like :func:`os.stat`. The result is looked up at each call to this method.
ru: Верните объект :class:`os.stat_result`, содержащий информацию об этом пути, например :func:`os.stat`. Результат просматривается при каждом вызове этого метода.

source: This method normally follows symlinks; to stat a symlink add the argument ``follow_symlinks=False``, or use :meth:`~Path.lstat`.
ru: Этот метод обычно следует за символическими ссылками; для проверки символической ссылки добавьте аргумент ``follow_symlinks=False`` или используйте :meth:`~Path.lstat`.

source: The *follow_symlinks* parameter was added.
ru: Добавлен параметр *follow_symlinks*.

source: Like :meth:`Path.stat` but, if the path points to a symbolic link, return the symbolic link's information rather than its target's.
ru: Подобно :meth:`Path.stat`, но если путь указывает на символическую ссылку, возвращайте информацию о символической ссылке, а не о ее цели.

source: Return ``True`` if the path points to an existing file or directory.
ru: Верните True, если путь указывает на существующий файл или каталог.

source: This method normally follows symlinks; to check if a symlink exists, add the argument ``follow_symlinks=False``.
ru: Этот метод обычно следует за символическими ссылками; чтобы проверить, существует ли символическая ссылка, добавьте аргумент «follow_symlinks=False».

source: Return ``True`` if the path points to a regular file, ``False`` if it points to another kind of file.
ru: Возвращайте True, если путь указывает на обычный файл, и False, если он указывает на файл другого типа.

source: ``False`` is also returned if the path doesn't exist or is a broken symlink; other errors (such as permission errors) are propagated.
ru: ``False`` также возвращается, если путь не существует или является неработающей символической ссылкой; другие ошибки (например, ошибки разрешений) распространяются.

source: This method normally follows symlinks; to exclude symlinks, add the argument ``follow_symlinks=False``.
ru: Этот метод обычно следует за символическими ссылками; чтобы исключить символические ссылки, добавьте аргумент «follow_symlinks=False».

source: Return ``True`` if the path points to a directory, ``False`` if it points to another kind of file.
ru: Возвращайте ``True``, если путь указывает на каталог, ``False``, если он указывает на другой тип файла.

source: This method normally follows symlinks; to exclude symlinks to directories, add the argument ``follow_symlinks=False``.
ru: Этот метод обычно следует за символическими ссылками; чтобы исключить символические ссылки на каталоги, добавьте аргумент «follow_symlinks=False».

source: Return ``True`` if the path points to a symbolic link, ``False`` otherwise.
ru: Возвращайте True, если путь указывает на символическую ссылку, и False в противном случае.

source: ``False`` is also returned if the path doesn't exist; other errors (such as permission errors) are propagated.
ru: ``False`` также возвращается, если путь не существует; другие ошибки (например, ошибки разрешений) распространяются.

source: Return ``True`` if the path points to a junction, and ``False`` for any other type of file. Currently only Windows supports junctions.
ru: Возвращайте True, если путь указывает на перекресток, и False для любого другого типа файла. В настоящее время только Windows поддерживает соединения.

source: Return ``True`` if the path is a :dfn:`mount point`: a point in a file system where a different file system has been mounted. On POSIX, the function checks whether *path*'s parent, :file:`path/..`, is on a different device than *path*, or whether :file:`path/..` and *path* point to the same i-node on the same device --- this should detect mount points for all Unix and POSIX variants. On Windows, a mount point is considered to be a drive letter root (e.g. ``c:\``), a UNC share (e.g. ``\\server\share``), or a mounted filesystem directory.
ru: Верните ``True``, если путь представляет собой :dfn:`точку монтирования`: точку в файловой системе, где была смонтирована другая файловая система. В POSIX функция проверяет, находится ли родительский элемент *path*, :file:`path/..`, на другом устройстве, чем *path*, или находятся ли :file:`path/..` и *path* точки к одному и тому же i-узлу на том же устройстве --- это должно обнаружить точки монтирования для всех вариантов Unix и POSIX. В Windows точкой монтирования считается корень диска (например, ``c:\``), общий ресурс UNC (например, ``\\server\share``) или смонтированный каталог файловой системы.

source: Windows support was added.
ru: Добавлена ​​поддержка Windows.

source: Return ``True`` if the path points to a Unix socket (or a symbolic link pointing to a Unix socket), ``False`` if it points to another kind of file.
ru: Возвращайте ``True``, если путь указывает на сокет Unix (или символическую ссылку, указывающую на сокет Unix), ``False``, если он указывает на файл другого типа.

source: Return ``True`` if the path points to a FIFO (or a symbolic link pointing to a FIFO), ``False`` if it points to another kind of file.
ru: Возвращайте ``True``, если путь указывает на FIFO (или символическую ссылку, указывающую на FIFO), ``False``, если он указывает на файл другого типа.

source: Return ``True`` if the path points to a block device (or a symbolic link pointing to a block device), ``False`` if it points to another kind of file.
ru: Возвращайте ``True``, если путь указывает на блочное устройство (или символическую ссылку, указывающую на блочное устройство), ``False``, если он указывает на другой тип файла.

source: Return ``True`` if the path points to a character device (or a symbolic link pointing to a character device), ``False`` if it points to another kind of file.
ru: Возвращайте ``True``, если путь указывает на символьное устройство (или символическую ссылку, указывающую на символьное устройство), ``False``, если он указывает на файл другого типа.

source: Return whether this path points to the same file as *other_path*, which can be either a Path object, or a string. The semantics are similar to :func:`os.path.samefile` and :func:`os.path.samestat`.
ru: Возвращает значение, указывает ли этот путь на тот же файл, что и *other_path*, который может быть либо объектом Path, либо строкой. Семантика аналогична :func:`os.path.samefile` и :func:`os.path.samestat`.

source: An :exc:`OSError` can be raised if either file cannot be accessed for some reason.
ru: Ошибка :exc:`OSError` может быть выдана, если по какой-либо причине доступ к одному из файлов невозможен.

source: Reading and writing files
ru: Чтение и запись файлов

source: Open the file pointed to by the path, like the built-in :func:`open` function does::
ru: Откройте файл, на который указывает путь, как это делает встроенная функция :func:`open`::

source: Return the decoded contents of the pointed-to file as a string::
ru: Вернуть декодированное содержимое указанного файла в виде строки::

source: The file is opened and then closed. The optional parameters have the same meaning as in :func:`open`.
ru: Файл открывается, а затем закрывается. Необязательные параметры имеют то же значение, что и в :func:`open`.

source: The *newline* parameter was added.
ru: Добавлен параметр *newline*.

source: Return the binary contents of the pointed-to file as a bytes object::
ru: Вернуть двоичное содержимое указанного файла в виде байтового объекта::

source: Open the file pointed to in text mode, write *data* to it, and close the file::
ru: Откройте указанный файл в текстовом режиме, напишите в него *данные* и закройте файл::

source: An existing file of the same name is overwritten. The optional parameters have the same meaning as in :func:`open`.
ru: Существующий файл с таким же именем будет перезаписан. Необязательные параметры имеют то же значение, что и в :func:`open`.

source: Open the file pointed to in bytes mode, write *data* to it, and close the file::
ru: Откройте указанный файл в байтовом режиме, запишите в него *данные* и закройте файл::

source: An existing file of the same name is overwritten.
ru: Существующий файл с таким же именем будет перезаписан.

source: Reading directories
ru: Чтение каталогов

source: When the path points to a directory, yield path objects of the directory contents::
ru: Когда путь указывает на каталог, выведите объекты пути содержимого каталога::

source: The children are yielded in arbitrary order, and the special entries ``'.'`` and ``'..'`` are not included. If a file is removed from or added to the directory after creating the iterator, it is unspecified whether a path object for that file is included.
ru: Дочерние элементы выводятся в произвольном порядке, а специальные записи ``'.'`` и ``'..'`` не включаются. Если файл удаляется из каталога или добавляется в него после создания итератора, не указано, включен ли объект пути для этого файла.

source: If the path is not a directory or otherwise inaccessible, :exc:`OSError` is raised.
ru: Если путь не является каталогом или недоступен по какой-либо причине, возникает :exc:`OSError`.

source: Glob the given relative *pattern* in the directory represented by this path, yielding all matching files (of any kind)::
ru: Добавьте заданный относительный *шаблон* в каталог, представленный этим путем, получив все соответствующие файлы (любого типа)::

source: By default, or when the *case_sensitive* keyword-only argument is set to ``None``, this method matches paths using platform-specific casing rules: typically, case-sensitive on POSIX, and case-insensitive on Windows. Set *case_sensitive* to ``True`` or ``False`` to override this behaviour.
ru: По умолчанию или когда для аргумента только ключевого слова *case_sensitivity* установлено значение ``None``, этот метод сопоставляет пути с использованием правил регистра, специфичных для платформы: обычно с учетом регистра в POSIX и без учета регистра в Windows. Установите для *case_sensitivity* значение True или False, чтобы переопределить это поведение.

source: By default, or when the *recurse_symlinks* keyword-only argument is set to ``False``, this method follows symlinks except when expanding "``**``" wildcards. Set *recurse_symlinks* to ``True`` to always follow symlinks.
ru: По умолчанию или когда для аргумента только ключевого слова *recurse_symlinks* установлено значение ``False``, этот метод следует за символическими ссылками, за исключением случаев расширения подстановочных знаков "``**``". Установите для *recurse_symlinks* значение ``True``, чтобы всегда переходить по символическим ссылкам.

source: Raises an :ref:`auditing event <auditing>` ``pathlib.Path.glob`` with arguments ``self``, ``pattern``.
ru: Вызывает событие аудита <auditing>`pathlib.Path.glob`` с аргументами ``self``, ``pattern``.

source: The *recurse_symlinks* parameter was added.
ru: Добавлен параметр *recurse_symlinks*.

source: Any :exc:`OSError` exceptions raised from scanning the filesystem are suppressed. In previous versions, such exceptions are suppressed in many cases, but not all.
ru: Любые исключения :exc:`OSError`, возникающие при сканировании файловой системы, подавляются. В предыдущих версиях такие исключения подавлялись во многих случаях, но не во всех.

source: Glob the given relative *pattern* recursively. This is like calling :func:`Path.glob` with "``**/``" added in front of the *pattern*.
ru: Рекурсивно добавьте заданный относительный *шаблон*. Это похоже на вызов :func:`Path.glob` с добавлением "``**/``" перед *шаблоном*.

source: :ref:`pathlib-pattern-language` and :meth:`Path.glob` documentation.
ru: Документация :ref:`pathlib-pattern-language` и :meth:`Path.glob`.

source: Raises an :ref:`auditing event <auditing>` ``pathlib.Path.rglob`` with arguments ``self``, ``pattern``.
ru: Вызывает событие аудита <auditing>`pathlib.Path.rglob`` с аргументами ``self``, ``pattern``.

source: Generate the file names in a directory tree by walking the tree either top-down or bottom-up.
ru: Сгенерируйте имена файлов в дереве каталогов, пройдя по дереву сверху вниз или снизу вверх.

source: For each directory in the directory tree rooted at *self* (including *self* but excluding '.' and '..'), the method yields a 3-tuple of ``(dirpath, dirnames, filenames)``.
ru: Для каждого каталога в дереве каталогов, корнем которого является *self* (включая *self*, но исключая «.» и «..»), метод возвращает тройной кортеж ``(dirpath, dirnames, filenames)``.

source: *dirpath* is a :class:`Path` to the directory currently being walked, *dirnames* is a list of strings for the names of subdirectories in *dirpath* (excluding ``'.'`` and ``'..'``), and *filenames* is a list of strings for the names of the non-directory files in *dirpath*. To get a full path (which begins with *self*) to a file or directory in *dirpath*, do ``dirpath / name``. Whether or not the lists are sorted is file system-dependent.
ru: *dirpath* — это :class:`Путь` к текущему каталогу, *dirnames* — это список строк с именами подкаталогов в *dirpath* (исключая ``'.'`` и ``'.. '``), а *filenames* — это список строк для имен файлов, не являющихся каталогами, в *dirpath*. Чтобы получить полный путь (который начинается с *self*) к файлу или каталогу в *dirpath*, выполните ``dirpath / name``. Сортировка списков зависит от файловой системы.

source: If the optional argument *top_down* is true (which is the default), the triple for a directory is generated before the triples for any of its subdirectories (directories are walked top-down). If *top_down* is false, the triple for a directory is generated after the triples for all of its subdirectories (directories are walked bottom-up). No matter the value of *top_down*, the list of subdirectories is retrieved before the triples for the directory and its subdirectories are walked.
ru: Если необязательный аргумент *top_down* имеет значение true (это значение по умолчанию), тройка для каталога генерируется раньше троек для любого из его подкаталогов (каталоги просматриваются сверху вниз). Если *top_down* имеет значение false, тройка для каталога генерируется после троек для всех его подкаталогов (каталоги просматриваются снизу вверх). Независимо от значения *top_down*, список подкаталогов извлекается до того, как будут пройдены тройки каталога и его подкаталогов.
