Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/pathlib.po
Languages: ru

source: When *top_down* is true, the caller can modify the *dirnames* list in-place (for example, using :keyword:`del` or slice assignment), and :meth:`Path.walk` will only recurse into the subdirectories whose names remain in *dirnames*. This can be used to prune the search, or to impose a specific order of visiting, or even to inform :meth:`Path.walk` about directories the caller creates or renames before it resumes :meth:`Path.walk` again. Modifying *dirnames* when *top_down* is false has no effect on the behavior of :meth:`Path.walk` since the directories in *dirnames* have already been generated by the time *dirnames* is yielded to the caller.
ru: Когда *top_down* имеет значение true, вызывающая сторона может изменить список *dirnames* на месте (например, используя :keyword:`del` или назначение фрагмента), а :meth:`Path.walk` будет рекурсивно обращаться только к подкаталогам. чьи имена остаются в *dirnames*. Это можно использовать для ограничения поиска или для установления определенного порядка посещения, или даже для информирования :meth:`Path.walk` о каталогах, которые вызывающий объект создает или переименовывает, прежде чем он снова возобновит :meth:`Path.walk`. Изменение *dirnames*, когда *top_down* имеет значение false, не влияет на поведение :meth:`Path.walk`, поскольку каталоги в *dirnames* уже созданы к моменту передачи *dirnames* вызывающему объекту.

source: By default, errors from :func:`os.scandir` are ignored. If the optional argument *on_error* is specified, it should be a callable; it will be called with one argument, an :exc:`OSError` instance. The callable can handle the error to continue the walk or re-raise it to stop the walk. Note that the filename is available as the ``filename`` attribute of the exception object.
ru: По умолчанию ошибки из :func:`os.scandir` игнорируются. Если указан необязательный аргумент *on_error*, он должен быть вызываемым; он будет вызываться с одним аргументом — экземпляром :exc:`OSError`. Вызываемый объект может обработать ошибку, чтобы продолжить обход, или повторно поднять его, чтобы остановить обход. Обратите внимание, что имя файла доступно как атрибут filename объекта исключения.

source: By default, :meth:`Path.walk` does not follow symbolic links, and instead adds them to the *filenames* list. Set *follow_symlinks* to true to resolve symlinks and place them in *dirnames* and *filenames* as appropriate for their targets, and consequently visit directories pointed to by symlinks (where supported).
ru: По умолчанию :meth:`Path.walk` не следует по символическим ссылкам, а вместо этого добавляет их в список *filenames*. Установите для параметра *follow_symlinks* значение true, чтобы разрешать символические ссылки и размещать их в *dirnames* и *filenames* в соответствии с их целями и, следовательно, посещать каталоги, на которые указывают символические ссылки (где это поддерживается).

source: Be aware that setting *follow_symlinks* to true can lead to infinite recursion if a link points to a parent directory of itself. :meth:`Path.walk` does not keep track of the directories it has already visited.
ru: Имейте в виду, что установка для *follow_symlinks* значения true может привести к бесконечной рекурсии, если ссылка указывает на собственный родительский каталог. :meth:`Path.walk` не отслеживает каталоги, которые он уже посетил.

source: :meth:`Path.walk` assumes the directories it walks are not modified during execution. For example, if a directory from *dirnames* has been replaced with a symlink and *follow_symlinks* is false, :meth:`Path.walk` will still try to descend into it. To prevent such behavior, remove directories from *dirnames* as appropriate.
ru: :meth:`Path.walk` предполагает, что каталоги, по которым он проходит, не изменяются во время выполнения. Например, если каталог из *dirnames* был заменен символической ссылкой, а *follow_symlinks* имеет значение false, :meth:`Path.walk` все равно попытается спуститься в него. Чтобы предотвратить такое поведение, удалите каталоги из *dirnames*, если это необходимо.

source: Unlike :func:`os.walk`, :meth:`Path.walk` lists symlinks to directories in *filenames* if *follow_symlinks* is false.
ru: В отличие от :func:`os.walk`, :meth:`Path.walk` перечисляет символические ссылки на каталоги в *filenames*, если *follow_symlinks* имеет значение false.

source: This example displays the number of bytes used by all files in each directory, while ignoring ``__pycache__`` directories::
ru: В этом примере отображается количество байтов, используемых всеми файлами в каждом каталоге, игнорируя каталоги ``__pycache__``::

source: This next example is a simple implementation of :func:`shutil.rmtree`. Walking the tree bottom-up is essential as :func:`rmdir` doesn't allow deleting a directory before it is empty::
ru: Следующий пример представляет собой простую реализацию :func:`shutil.rmtree`. Прогулка по дереву снизу вверх очень важна, поскольку :func:`rmdir` не позволяет удалить каталог, пока он не станет пустым::

source: Creating files and directories
ru: Создание файлов и каталогов

source: Create a file at this given path. If *mode* is given, it is combined with the process's ``umask`` value to determine the file mode and access flags. If the file already exists, the function succeeds when *exist_ok* is true (and its modification time is updated to the current time), otherwise :exc:`FileExistsError` is raised.
ru: Создайте файл по данному пути. Если указан *mode*, он объединяется со значением ``umask`` процесса для определения режима файла и флагов доступа. Если файл уже существует, функция завершается успешно, если *exist_ok* имеет значение true (и время его модификации обновляется до текущего времени), в противном случае выдается :exc:`FileExistsError`.

source: The :meth:`~Path.open`, :meth:`~Path.write_text` and :meth:`~Path.write_bytes` methods are often used to create files.
ru: Методы :meth:`~Path.open`, :meth:`~Path.write_text` и :meth:`~Path.write_bytes` часто используются для создания файлов.

source: Create a new directory at this given path. If *mode* is given, it is combined with the process's ``umask`` value to determine the file mode and access flags. If the path already exists, :exc:`FileExistsError` is raised.
ru: Создайте новый каталог по данному пути. Если указан *mode*, он объединяется со значением ``umask`` процесса для определения режима файла и флагов доступа. Если путь уже существует, возникает :exc:`FileExistsError`.

source: If *parents* is true, any missing parents of this path are created as needed; they are created with the default permissions without taking *mode* into account (mimicking the POSIX ``mkdir -p`` command).
ru: Если *parents* имеет значение true, все отсутствующие родительские элементы этого пути создаются по мере необходимости; они создаются с разрешениями по умолчанию без учета *mode* (имитируя команду POSIX ``mkdir -p``).

source: If *parents* is false (the default), a missing parent raises :exc:`FileNotFoundError`.
ru: Если *parents* имеет значение false (по умолчанию), отсутствующий родитель вызывает :exc:`FileNotFoundError`.

source: If *exist_ok* is false (the default), :exc:`FileExistsError` is raised if the target directory already exists.
ru: Если *exist_ok* имеет значение false (по умолчанию), :exc:`FileExistsError` возникает, если целевой каталог уже существует.

source: If *exist_ok* is true, :exc:`FileExistsError` will not be raised unless the given path already exists in the file system and is not a directory (same behavior as the POSIX ``mkdir -p`` command).
ru: Если *exist_ok* имеет значение true, :exc:`FileExistsError` не будет вызываться, если данный путь уже не существует в файловой системе и не является каталогом (то же поведение, что и у команды POSIX ``mkdir -p``).

source: The *exist_ok* parameter was added.
ru: Добавлен параметр *exist_ok*.

source: Make this path a symbolic link pointing to *target*.
ru: Сделайте этот путь символической ссылкой, указывающей на *цель*.

source: On Windows, a symlink represents either a file or a directory, and does not morph to the target dynamically. If the target is present, the type of the symlink will be created to match. Otherwise, the symlink will be created as a directory if *target_is_directory* is true or a file symlink (the default) otherwise. On non-Windows platforms, *target_is_directory* is ignored.
ru: В Windows символическая ссылка представляет либо файл, либо каталог и не преобразуется в цель динамически. Если цель присутствует, тип символической ссылки будет создан соответствующий. В противном случае символическая ссылка будет создана как каталог, если *target_is_directory* имеет значение true, или как символическая ссылка на файл (по умолчанию) в противном случае. На платформах, отличных от Windows, *target_is_directory* игнорируется.

source: The order of arguments (link, target) is the reverse of :func:`os.symlink`'s.
ru: Порядок аргументов (ссылка, цель) обратный порядку аргументов :func:`os.symlink`.

source: Raises :exc:`UnsupportedOperation` if :func:`os.symlink` is not available. In previous versions, :exc:`NotImplementedError` was raised.
ru: Вызывает :exc:`UnsupportedOperation`, если :func:`os.symlink` недоступен. В предыдущих версиях возникало :exc:`NotImplementedError`.

source: Make this path a hard link to the same file as *target*.
ru: Сделайте этот путь жесткой ссылкой на тот же файл, что и *target*.

source: The order of arguments (link, target) is the reverse of :func:`os.link`'s.
ru: Порядок аргументов (ссылка, цель) обратный порядку аргументов :func:`os.link`.

source: Raises :exc:`UnsupportedOperation` if :func:`os.link` is not available. In previous versions, :exc:`NotImplementedError` was raised.
ru: Вызывает :exc:`UnsupportedOperation`, если :func:`os.link` недоступен. В предыдущих версиях возникало :exc:`NotImplementedError`.

source: Renaming and deleting
ru: Переименование и удаление

source: Rename this file or directory to the given *target*, and return a new :class:`!Path` instance pointing to *target*. On Unix, if *target* exists and is a file, it will be replaced silently if the user has permission. On Windows, if *target* exists, :exc:`FileExistsError` will be raised. *target* can be either a string or another path object::
ru: Переименуйте этот файл или каталог в указанную *target* и верните новый экземпляр :class:`!Path`, указывающий на *target*. В Unix, если *target* существует и является файлом, он будет заменен автоматически, если у пользователя есть разрешение. В Windows, если *target* существует, будет вызвано :exc:`FileExistsError`. *target* может быть строкой или другим объектом пути::

source: The target path may be absolute or relative. Relative paths are interpreted relative to the current working directory, *not* the directory of the :class:`!Path` object.
ru: Целевой путь может быть абсолютным или относительным. Относительные пути интерпретируются относительно текущего рабочего каталога, *а не* каталога объекта :class:`!Path`.

source: It is implemented in terms of :func:`os.rename` and gives the same guarantees.
ru: Он реализован с помощью :func:`os.rename` и дает те же гарантии.

source: Added return value, return the new :class:`!Path` instance.
ru: Добавлено возвращаемое значение, возвращает новый экземпляр :class:`!Path`.

source: Rename this file or directory to the given *target*, and return a new :class:`!Path` instance pointing to *target*. If *target* points to an existing file or empty directory, it will be unconditionally replaced.
ru: Переименуйте этот файл или каталог в указанную *target* и верните новый экземпляр :class:`!Path`, указывающий на *target*. Если *target* указывает на существующий файл или пустой каталог, он будет безоговорочно заменен.

source: Remove this file or symbolic link. If the path points to a directory, use :func:`Path.rmdir` instead.
ru: Удалите этот файл или символическую ссылку. Если путь указывает на каталог, используйте вместо него :func:`Path.rmdir`.

source: If *missing_ok* is false (the default), :exc:`FileNotFoundError` is raised if the path does not exist.
ru: Если *missing_ok* имеет значение false (по умолчанию), :exc:`FileNotFoundError` возникает, если путь не существует.

source: If *missing_ok* is true, :exc:`FileNotFoundError` exceptions will be ignored (same behavior as the POSIX ``rm -f`` command).
ru: Если *missing_ok* истинно, исключения :exc:`FileNotFoundError` будут игнорироваться (то же поведение, что и у команды POSIX ``rm -f``).

source: The *missing_ok* parameter was added.
ru: Добавлен параметр *missing_ok*.

source: Remove this directory. The directory must be empty.
ru: Удалите этот каталог. Каталог должен быть пустым.

source: Permissions and ownership
ru: Разрешения и право собственности

source: Return the name of the user owning the file. :exc:`KeyError` is raised if the file's user identifier (UID) isn't found in the system database.
ru: Возвращает имя пользователя, владеющего файлом. :exc:`KeyError` возникает, если идентификатор пользователя файла (UID) не найден в системной базе данных.

source: This method normally follows symlinks; to get the owner of the symlink, add the argument ``follow_symlinks=False``.
ru: Этот метод обычно следует за символическими ссылками; чтобы узнать владельца символической ссылки, добавьте аргумент «follow_symlinks=False».

source: Raises :exc:`UnsupportedOperation` if the :mod:`pwd` module is not available. In earlier versions, :exc:`NotImplementedError` was raised.
ru: Вызывает :exc:`UnsupportedOperation`, если модуль :mod:`pwd` недоступен. В более ранних версиях возникало :exc:`NotImplementedError`.

source: Return the name of the group owning the file. :exc:`KeyError` is raised if the file's group identifier (GID) isn't found in the system database.
ru: Возвращает имя группы, владеющей файлом. :exc:`KeyError` возникает, если идентификатор группы файла (GID) не найден в системной базе данных.

source: This method normally follows symlinks; to get the group of the symlink, add the argument ``follow_symlinks=False``.
ru: Этот метод обычно следует за символическими ссылками; чтобы получить группу символической ссылки, добавьте аргумент «follow_symlinks=False».

source: Raises :exc:`UnsupportedOperation` if the :mod:`grp` module is not available. In earlier versions, :exc:`NotImplementedError` was raised.
ru: Вызывает :exc:`UnsupportedOperation`, если модуль :mod:`grp` недоступен. В более ранних версиях возникало :exc:`NotImplementedError`.

source: Change the file mode and permissions, like :func:`os.chmod`.
ru: Измените режим файла и разрешения, например :func:`os.chmod`.

source: This method normally follows symlinks. Some Unix flavours support changing permissions on the symlink itself; on these platforms you may add the argument ``follow_symlinks=False``, or use :meth:`~Path.lchmod`.
ru: Этот метод обычно следует за символическими ссылками. Некоторые версии Unix поддерживают изменение разрешений для самой символической ссылки; на этих платформах вы можете добавить аргумент ``follow_symlinks=False`` или использовать :meth:`~Path.lchmod`.

source: Like :meth:`Path.chmod` but, if the path points to a symbolic link, the symbolic link's mode is changed rather than its target's.
ru: Подобно :meth:`Path.chmod`, но если путь указывает на символическую ссылку, изменяется режим символической ссылки, а не ее целевой.

source: Pattern language
ru: Язык шаблонов

source: The following wildcards are supported in patterns for :meth:`~PurePath.full_match`, :meth:`~Path.glob` and :meth:`~Path.rglob`:
ru: Следующие подстановочные знаки поддерживаются в шаблонах для :meth:`~PurePath.full_match`, :meth:`~Path.glob` и :meth:`~Path.rglob`:

source: ``**`` (entire segment)
ru: ``**`` (весь сегмент)

source: Matches any number of file or directory segments, including zero.
ru: Соответствует любому количеству сегментов файла или каталога, включая ноль.

source: ``*`` (entire segment)
ru: ``*`` (весь сегмент)

source: Matches one file or directory segment.
ru: Соответствует одному сегменту файла или каталога.

source: ``*`` (part of a segment)
ru: ``*`` (часть сегмента)

source: Matches any number of non-separator characters, including zero.
ru: Соответствует любому количеству символов без разделителей, включая ноль.

source: Matches one non-separator character.
ru: Соответствует одному символу, не являющемуся разделителем.

source: Matches one character in *seq*.
ru: Соответствует одному символу в *seq*.

source: Matches one character not in *seq*.
ru: Соответствует одному символу, не входящему в *seq*.

source: For a literal match, wrap the meta-characters in brackets. For example, ``"[?]"`` matches the character ``"?"``.
ru: Для буквального совпадения заключите метасимволы в скобки. Например, ``"[?]"`` соответствует символу ``"?"``.

source: The "``**``" wildcard enables recursive globbing. A few examples:
ru: Подстановочный знак «``**``» включает рекурсивное подстановку. Несколько примеров:

source: Pattern
ru: Шаблон

source: Meaning
ru: Значение

source: Any path with at least one segment.
ru: Любой путь, содержащий хотя бы один сегмент.

source: Any path with a final segment ending "``.py``".
ru: Любой путь с конечным сегментом, заканчивающимся «``.py``».

source: Any path starting with "``assets/``".
ru: Любой путь, начинающийся с «``assets/``».

source: Any path starting with "``assets/``", excluding "``assets/``" itself.
ru: Любой путь, начинающийся с «``assets/``», за исключением самого «``assets/``».

source: Globbing with the "``**``" wildcard visits every directory in the tree. Large directory trees may take a long time to search.
ru: Подстановка с помощью подстановочного знака «``**``» позволяет посетить каждый каталог в дереве. Поиск в больших деревьях каталогов может занять много времени.

source: Globbing with a pattern that ends with "``**``" returns both files and directories. In previous versions, only directories were returned.
ru: Подстановка по шаблону, заканчивающемуся на "``**``", возвращает как файлы, так и каталоги. В предыдущих версиях возвращались только каталоги.

source: In :meth:`Path.glob` and :meth:`~Path.rglob`, a trailing slash may be added to the pattern to match only directories.
ru: В :meth:`Path.glob` и :meth:`~Path.rglob` к шаблону может быть добавлена ​​косая черта, чтобы соответствовать только каталогам.

source: Globbing with a pattern that ends with a pathname components separator (:data:`~os.sep` or :data:`~os.altsep`) returns only directories.
ru: Подстановка по шаблону, который заканчивается разделителем компонентов имени пути (:data:`~os.sep` или :data:`~os.altsep`), возвращает только каталоги.

source: Comparison to the :mod:`glob` module
ru: Сравнение с модулем :mod:`glob`

source: The patterns accepted and results generated by :meth:`Path.glob` and :meth:`Path.rglob` differ slightly from those by the :mod:`glob` module:
ru: Принимаемые шаблоны и результаты, генерируемые :meth:`Path.glob` и :meth:`Path.rglob`, немного отличаются от результатов модуля :mod:`glob`:

source: Files beginning with a dot are not special in pathlib. This is like passing ``include_hidden=True`` to :func:`glob.glob`.
ru: Файлы, начинающиеся с точки, не являются особенными в pathlib. Это похоже на передачу ``include_hidden=True`` в :func:`glob.glob`.

source: "``**``" pattern components are always recursive in pathlib. This is like passing ``recursive=True`` to :func:`glob.glob`.
ru: Компоненты шаблона «``**``» всегда рекурсивны в pathlib. Это похоже на передачу ``recursive=True`` в :func:`glob.glob`.

source: "``**``" pattern components do not follow symlinks by default in pathlib. This behaviour has no equivalent in :func:`glob.glob`, but you can pass ``recurse_symlinks=True`` to :meth:`Path.glob` for compatible behaviour.
ru: Компоненты шаблона «``**``» по умолчанию не следуют по символическим ссылкам в pathlib. Это поведение не имеет эквивалента в :func:`glob.glob`, но вы можете передать ``recurse_symlinks=True`` в :meth:`Path.glob` для совместимого поведения.

source: Like all :class:`PurePath` and :class:`Path` objects, the values returned from :meth:`Path.glob` and :meth:`Path.rglob` don't include trailing slashes.
ru: Как и все объекты :class:`PurePath` и :class:`Path`, значения, возвращаемые из :meth:`Path.glob` и :meth:`Path.rglob`, не включают конечные косые черты.

source: The values returned from pathlib's ``path.glob()`` and ``path.rglob()`` include the *path* as a prefix, unlike the results of ``glob.glob(root_dir=path)``.
ru: Значения, возвращаемые из ``path.glob()`` и ``path.rglob()`` библиотеки pathlib, включают *path* в качестве префикса, в отличие от результатов ``glob.glob(root_dir=path)``.

source: The values returned from pathlib's ``path.glob()`` and ``path.rglob()`` may include *path* itself, for example when globbing "``**``", whereas the results of ``glob.glob(root_dir=path)`` never include an empty string that would correspond to *path*.
ru: Значения, возвращаемые из ``path.glob()`` и ``path.rglob()`` библиотеки pathlib, могут включать сам *path*, например, при подстановке "``**``", тогда как результаты `` glob.glob(root_dir=path)`` никогда не включает пустую строку, соответствующую *path*.

source: Comparison to the :mod:`os` and :mod:`os.path` modules
ru: Сравнение с модулями :mod:`os` и :mod:`os.path`

source: pathlib implements path operations using :class:`PurePath` and :class:`Path` objects, and so it's said to be *object-oriented*. On the other hand, the :mod:`os` and :mod:`os.path` modules supply functions that work with low-level ``str`` and ``bytes`` objects, which is a more *procedural* approach. Some users consider the object-oriented style to be more readable.
ru: pathlib реализует операции с путями, используя объекты :class:`PurePath` и :class:`Path`, поэтому его называют *объектно-ориентированным*. С другой стороны, модули :mod:`os` и :mod:`os.path` предоставляют функции, которые работают с низкоуровневыми объектами ``str`` и ``bytes``, что является более *процедурным* подход. Некоторые пользователи считают объектно-ориентированный стиль более читабельным.

source: Many functions in :mod:`os` and :mod:`os.path` support ``bytes`` paths and :ref:`paths relative to directory descriptors <dir_fd>`. These features aren't available in pathlib.
ru: Многие функции в :mod:`os` и :mod:`os.path` поддерживают ``байтовые`` пути и :ref:`пути относительно дескрипторов каталогов <dir_fd>`. Эти функции недоступны в pathlib.

source: Python's ``str`` and ``bytes`` types, and portions of the :mod:`os` and :mod:`os.path` modules, are written in C and are very speedy. pathlib is written in pure Python and is often slower, but rarely slow enough to matter.
ru: Типы Python ``str`` и ``bytes``, а также части модулей :mod:`os` и :mod:`os.path` написаны на C и работают очень быстро. pathlib написан на чистом Python и часто работает медленнее, но редко настолько медленный, чтобы это имело значение.

source: pathlib's path normalization is slightly more opinionated and consistent than :mod:`os.path`. For example, whereas :func:`os.path.abspath` eliminates "``..``" segments from a path, which may change its meaning if symlinks are involved, :meth:`Path.absolute` preserves these segments for greater safety.
ru: Нормализация пути в pathlib немного более самоуверенна и последовательна, чем в :mod:`os.path`. Например, в то время как :func:`os.path.abspath` удаляет из пути сегменты "``..``", которые могут изменить его значение, если задействованы символические ссылки, :meth:`Path.absolute` сохраняет эти сегменты для большая безопасность.

source: pathlib's path normalization may render it unsuitable for some applications:
ru: Нормализация пути в pathlib может сделать его непригодным для некоторых приложений:
