Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/pdb.po
Languages: ru

source: :mod:`pdb` --- The Python Debugger
ru: :mod:`pdb` --- Отладчик Python

source: **Source code:** :source:`Lib/pdb.py`
ru: **Исходный код:** :source:`Lib/pdb.py`

source: The module :mod:`pdb` defines an interactive source code debugger for Python programs. It supports setting (conditional) breakpoints and single stepping at the source line level, inspection of stack frames, source code listing, and evaluation of arbitrary Python code in the context of any stack frame. It also supports post-mortem debugging and can be called under program control.
ru: Модуль :mod:`pdb` определяет интерактивный отладчик исходного кода программ Python. Он поддерживает установку (условных) точек останова и пошаговое выполнение на уровне строки исходного кода, проверку кадров стека, листинг исходного кода и оценку произвольного кода Python в контексте любого кадра стека. Он также поддерживает посмертную отладку и может вызываться под управлением программы.

source: The debugger is extensible -- it is actually defined as the class :class:`Pdb`. This is currently undocumented but easily understood by reading the source. The extension interface uses the modules :mod:`bdb` and :mod:`cmd`.
ru: Отладчик является расширяемым — фактически он определен как класс :class:`Pdb`. В настоящее время это недокументировано, но легко понять, прочитав исходный код. Интерфейс расширения использует модули :mod:`bdb` и :mod:`cmd`.

source: Tab-completion via the :mod:`readline` module is available for commands and command arguments, e.g. the current global and local names are offered as arguments of the ``p`` command.
ru: Заполнение табуляции через модуль :mod:`readline` доступно для команд и аргументов команды, например, текущие глобальные и локальные имена предлагаются в качестве аргументов команды ``p``.

source: The typical usage to break into the debugger is to insert::
ru: Типичное использование для взлома отладчика — это вставка::

source: at the location you want to break into the debugger, and then run the program. You can then step through the code following this statement, and continue running without the debugger using the :pdbcmd:`continue` command.
ru: в том месте, где вы хотите взломать отладчик, а затем запустить программу. Затем вы можете выполнить код, следующий за этим оператором, и продолжить работу без отладчика, используя команду :pdbcmd:`continue`.

source: The typical usage to inspect a crashed program is::
ru: Типичное использование для проверки аварийной программы:

source: The module defines the following functions; each enters the debugger in a slightly different way:
ru: Модуль определяет следующие функции; каждый входит в отладчик немного по-своему:

source: Execute the *statement* (given as a string or a code object) under debugger control. The debugger prompt appears before any code is executed; you can set breakpoints and type :pdbcmd:`continue`, or you can step through the statement using :pdbcmd:`step` or :pdbcmd:`next` (all these commands are explained below). The optional *globals* and *locals* arguments specify the environment in which the code is executed; by default the dictionary of the module :mod:`__main__` is used. (See the explanation of the built-in :func:`exec` or :func:`eval` functions.)
ru: Выполните *оператор* (заданный в виде строки или объекта кода) под управлением отладчика. Приглашение отладчика появляется перед выполнением любого кода; вы можете установить точки останова и ввести :pdbcmd:`continue`, или вы можете пошагово выполнить оператор, используя :pdbcmd:`step` или :pdbcmd:`next` (все эти команды описаны ниже). Необязательные аргументы *globals* и *locals* указывают среду, в которой выполняется код; по умолчанию используется словарь модуля :mod:`__main__`. (См. объяснение встроенных функций :func:`exec` или :func:`eval`.)

source: Call the *function* (a function or method object, not a string) with the given arguments. When :func:`runcall` returns, it returns whatever the function call returned. The debugger prompt appears as soon as the function is entered.
ru: Вызовите *функцию* (объект функции или метода, а не строку) с заданными аргументами. Когда :func:`runcall` возвращается, она возвращает всё, что вернул вызов функции. Приглашение отладчика появляется сразу после ввода функции.

source: Enter the debugger at the calling stack frame. This is useful to hard-code a breakpoint at a given point in a program, even if the code is not otherwise being debugged (e.g. when an assertion fails). If given, *header* is printed to the console just before debugging begins.
ru: Войдите в отладчик в кадре стека вызовов. Это полезно для жесткого кодирования точки останова в заданной точке программы, даже если код иначе не отлаживается (например, когда утверждение не выполняется). Если задано, *header* выводится на консоль непосредственно перед началом отладки.

source: The keyword-only argument *header*.
ru: Аргумент, содержащий только ключевые слова *header*.

source: Enter post-mortem debugging of the given *traceback* object. If no *traceback* is given, it uses the one of the exception that is currently being handled (an exception must be being handled if the default is to be used).
ru: Введите посмертную отладку данного объекта *traceback*. Если *traceback* не указан, используется то исключение, которое обрабатывается в данный момент (исключение должно обрабатываться, если используется значение по умолчанию).

source: Enter post-mortem debugging of the traceback found in :data:`sys.last_traceback`.
ru: Введите посмертную отладку обратной трассировки, найденной в :data:`sys.last_traceback`.

source: The ``run*`` functions and :func:`set_trace` are aliases for instantiating the :class:`Pdb` class and calling the method of the same name. If you want to access further features, you have to do this yourself:
ru: Функции ``run*`` и :func:`set_trace` являются псевдонимами для создания экземпляра класса :class:`Pdb` и вызова одноименного метода. Если вы хотите получить доступ к дополнительным функциям, вам придется сделать это самостоятельно:

source: :class:`Pdb` is the debugger class.
ru: :class:`Pdb` — это класс отладчика.

source: The *completekey*, *stdin* and *stdout* arguments are passed to the underlying :class:`cmd.Cmd` class; see the description there.
ru: Аргументы *completekey*, *stdin* и *stdout* передаются базовому классу :class:`cmd.Cmd`; смотри описание там.

source: The *skip* argument, if given, must be an iterable of glob-style module name patterns. The debugger will not step into frames that originate in a module that matches one of these patterns. [1]_
ru: Аргумент *skip*, если он задан, должен быть итерацией шаблонов имен модулей в стиле glob. Отладчик не будет входить в кадры, созданные в модуле, соответствующем одному из этих шаблонов. [1]_

source: The *readrc* argument defaults to true and controls whether Pdb will load .pdbrc files from the filesystem.
ru: Аргумент *readrc* по умолчанию имеет значение true и определяет, будет ли Pdb загружать файлы .pdbrc из файловой системы.

source: Example call to enable tracing with *skip*::
ru: Пример вызова для включения трассировки с помощью *skip*::

source: Raises an :ref:`auditing event <auditing>` ``pdb.Pdb`` with no arguments.
ru: Вызывает событие аудита <auditing>``pdb.Pdb`` без аргументов.

source: The *skip* argument.
ru: Аргумент *skip*

source: The *readrc* argument.
ru: Аргумент *readrc*.

source: See the documentation for the functions explained above.
ru: См. документацию по функциям, описанным выше.

source: Debugger Commands
ru: Команды отладчика

source: The commands recognized by the debugger are listed below. Most commands can be abbreviated to one or two letters as indicated; e.g. ``h(elp)`` means that either ``h`` or ``help`` can be used to enter the help command (but not ``he`` or ``hel``, nor ``H`` or ``Help`` or ``HELP``). Arguments to commands must be separated by whitespace (spaces or tabs). Optional arguments are enclosed in square brackets (``[]``) in the command syntax; the square brackets must not be typed. Alternatives in the command syntax are separated by a vertical bar (``|``).
ru: Ниже перечислены команды, распознаваемые отладчиком. Большинство команд можно сократить до одной или двух букв, как указано; например, ``h(elp)`` означает, что для ввода команды справки можно использовать либо ``h``, либо ``help`` (но не ``he`` или ``help``, ни ``H `` или ``Помощь`` или ``HELP``). Аргументы команд должны быть разделены пробелами (пробелами или табуляциями). Необязательные аргументы заключаются в квадратные скобки (``[]``) в синтаксисе команды; квадратные скобки печатать нельзя. Альтернативы в синтаксисе команды разделяются вертикальной чертой (``|``).

source: Entering a blank line repeats the last command entered. Exception: if the last command was a :pdbcmd:`list` command, the next 11 lines are listed.
ru: Ввод пустой строки повторяет последнюю введенную команду. Исключение: если последней командой была команда :pdbcmd:`list`, будут перечислены следующие 11 строк.

source: Commands that the debugger doesn't recognize are assumed to be Python statements and are executed in the context of the program being debugged. Python statements can also be prefixed with an exclamation point (``!``). This is a powerful way to inspect the program being debugged; it is even possible to change a variable or call a function. When an exception occurs in such a statement, the exception name is printed but the debugger's state is not changed.
ru: Команды, которые не распознает отладчик, считаются операторами Python и выполняются в контексте отлаживаемой программы. Операторы Python также могут иметь префикс восклицательного знака (``!``). Это мощный способ проверки отлаживаемой программы; можно даже изменить переменную или вызвать функцию. Когда в таком операторе возникает исключение, имя исключения выводится, но состояние отладчика не изменяется.

source: The debugger supports :ref:`aliases <debugger-aliases>`. Aliases can have parameters which allows one a certain level of adaptability to the context under examination.
ru: Отладчик поддерживает :ref:`aliases <debugger-aliases>`. Псевдонимы могут иметь параметры, которые обеспечивают определенный уровень адаптации к исследуемому контексту.

source: Multiple commands may be entered on a single line, separated by ``;;``. (A single ``;`` is not used as it is the separator for multiple commands in a line that is passed to the Python parser.) No intelligence is applied to separating the commands; the input is split at the first ``;;`` pair, even if it is in the middle of a quoted string. A workaround for strings with double semicolons is to use implicit string concatenation ``';'';'`` or ``";"";"``.
ru: Несколько команд можно ввести в одной строке, разделив их ``;;``. (Один ``;`` не используется, поскольку он является разделителем нескольких команд в строке, передаваемой синтаксическому анализатору Python.) Для разделения команд не применяется никакой интеллект; ввод разбивается по первой паре ``;;``, даже если она находится в середине строки в кавычках. Обходным решением для строк с двойными точками с запятой является использование неявной конкатенации строк ``';'';'`` или ``";"";"``.

source: :file:`.pdbrc` can now contain commands that continue debugging, such as :pdbcmd:`continue` or :pdbcmd:`next`. Previously, these commands had no effect.
ru: :file:`.pdbrc` теперь может содержать команды, продолжающие отладку, например :pdbcmd:`continue` или :pdbcmd:`next`. Раньше эти команды не имели никакого эффекта.

source: Without argument, print the list of available commands. With a *command* as argument, print help about that command. ``help pdb`` displays the full documentation (the docstring of the :mod:`pdb` module). Since the *command* argument must be an identifier, ``help exec`` must be entered to get help on the ``!`` command.
ru: Без аргументов вывести список доступных команд. Используя *команду* в качестве аргумента, выведите справку по этой команде. ``help pdb`` отображает полную документацию (строку документации модуля :mod:`pdb`). Поскольку аргумент *command* должен быть идентификатором, для получения справки по команде ``!`` необходимо ввести ``help exec``.

source: Move the current frame *count* (default one) levels down in the stack trace (to a newer frame).
ru: Переместить текущий уровень *count* кадров (один по умолчанию) вниз в трассировке стека (к более новому кадру).

source: Move the current frame *count* (default one) levels up in the stack trace (to an older frame).
ru: Переместить текущий уровень *count* кадров (один по умолчанию) вверх в трассировке стека (к более старому кадру).

source: With a *lineno* argument, set a break there in the current file. With a *function* argument, set a break at the first executable statement within that function. The line number may be prefixed with a filename and a colon, to specify a breakpoint in another file (probably one that hasn't been loaded yet). The file is searched on :data:`sys.path`. Note that each breakpoint is assigned a number to which all the other breakpoint commands refer.
ru: С аргументом *lineno* установите разрыв в текущем файле. С помощью аргумента *function* установите разрыв на первом исполняемом операторе внутри этой функции. Перед номером строки может стоять имя файла и двоеточие, чтобы указать точку останова в другом файле (возможно, еще не загруженном). Поиск файла осуществляется по адресу :data:`sys.path`. Обратите внимание, что каждой точке останова присвоен номер, к которому относятся все остальные команды точки останова.

source: If a second argument is present, it is an expression which must evaluate to true before the breakpoint is honored.
ru: Если присутствует второй аргумент, это выражение, которое должно иметь значение true, прежде чем будет соблюдена точка останова.

source: Without argument, list all breaks, including for each breakpoint, the number of times that breakpoint has been hit, the current ignore count, and the associated condition if any.
ru: Без аргумента перечислите все прерывания, включая для каждой точки останова, количество попаданий в эту точку останова, текущий счетчик игнорирования и связанное с ним условие, если таковое имеется.

source: Temporary breakpoint, which is removed automatically when it is first hit. The arguments are the same as for :pdbcmd:`break`.
ru: Временная точка останова, которая автоматически удаляется при первом нажатии. Аргументы те же, что и для :pdbcmd:`break`.

source: With a *filename:lineno* argument, clear all the breakpoints at this line. With a space separated list of breakpoint numbers, clear those breakpoints. Without argument, clear all breaks (but first ask confirmation).
ru: С аргументом *filename:lineno* очистите все точки останова в этой строке. С помощью списка номеров точек останова, разделенных пробелами, очистите эти точки останова. Без споров удалите все разрывы (но сначала запросите подтверждение).

source: Disable the breakpoints given as a space separated list of breakpoint numbers. Disabling a breakpoint means it cannot cause the program to stop execution, but unlike clearing a breakpoint, it remains in the list of breakpoints and can be (re-)enabled.
ru: Отключите точки останова, заданные в виде списка номеров точек останова, разделенных пробелами. Отключение точки останова означает, что она не может привести к остановке выполнения программы, но в отличие от очистки точки останова она остается в списке точек останова и может быть (повторно) включена.

source: Enable the breakpoints specified.
ru: Включите указанные точки останова.

source: Set a new *condition* for the breakpoint, an expression which must evaluate to true before the breakpoint is honored. If *condition* is absent, any existing condition is removed; i.e., the breakpoint is made unconditional.
ru: Установите новое *условие* для точки останова, выражение, которое должно иметь значение true, прежде чем точка останова будет соблюдена. Если *условие* отсутствует, любое существующее условие удаляется; т.е. точка останова становится безусловной.

source: Specify a list of commands for breakpoint number *bpnumber*. The commands themselves appear on the following lines. Type a line containing just ``end`` to terminate the commands. An example::
ru: Укажите список команд для точки останова с номером *bpnumber*. Сами команды появляются в следующих строках. Введите строку, содержащую только ``end``, чтобы завершить выполнение команд. Пример::

source: To remove all commands from a breakpoint, type ``commands`` and follow it immediately with ``end``; that is, give no commands.
ru: Чтобы удалить все команды из точки останова, введите ``commands`` и сразу же добавьте ``end``; то есть не давать никаких команд.

source: With no *bpnumber* argument, ``commands`` refers to the last breakpoint set.
ru: Без аргумента *bpnumber* ``команды`` относятся к последней установленной точке останова.

source: You can use breakpoint commands to start your program up again. Simply use the :pdbcmd:`continue` command, or :pdbcmd:`step`, or any other command that resumes execution.
ru: Вы можете использовать команды точки останова, чтобы снова запустить программу. Просто используйте команду :pdbcmd:`continue`, или :pdbcmd:`step`, или любую другую команду, которая возобновляет выполнение.

source: Specifying any command resuming execution (currently :pdbcmd:`continue`, :pdbcmd:`step`, :pdbcmd:`next`, :pdbcmd:`return`, :pdbcmd:`jump`, :pdbcmd:`quit` and their abbreviations) terminates the command list (as if that command was immediately followed by end). This is because any time you resume execution (even with a simple next or step), you may encounter another breakpoint—which could have its own command list, leading to ambiguities about which list to execute.
ru: Указание любой команды, возобновляющей выполнение (в настоящее время :pdbcmd:`continue`, :pdbcmd:`step`, :pdbcmd:`next`, :pdbcmd:`return`, :pdbcmd:`jump`, :pdbcmd:`quit` и их сокращения) завершает список команд (как будто за этой командой сразу следует конец). Это связано с тем, что каждый раз, когда вы возобновляете выполнение (даже с помощью простого следующего шага или шага), вы можете столкнуться с другой точкой останова, которая может иметь свой собственный список команд, что приводит к неопределенности относительно того, какой список выполнять.

source: Execute the current line, stop at the first possible occasion (either in a function that is called or on the next line in the current function).
ru: Выполнить текущую строку, остановиться при первом возможном случае (либо в вызываемой функции, либо на следующей строке текущей функции).

source: Continue execution until the next line in the current function is reached or it returns. (The difference between :pdbcmd:`next` and :pdbcmd:`step` is that :pdbcmd:`step` stops inside a called function, while :pdbcmd:`next` executes called functions at (nearly) full speed, only stopping at the next line in the current function.)
ru: Продолжайте выполнение до тех пор, пока не будет достигнута следующая строка в текущей функции или она не вернется. (Разница между :pdbcmd:`next` и :pdbcmd:`step` заключается в том, что :pdbcmd:`step` останавливается внутри вызываемой функции, тогда как :pdbcmd:`next` выполняет вызванные функции на (почти) полной скорости, только останавливаясь на следующей строке текущей функции.)

source: Without argument, continue execution until the line with a number greater than the current one is reached.
ru: Без аргумента продолжить выполнение до тех пор, пока не будет достигнута строка с номером, превышающим текущий.

source: Allow giving an explicit line number.
ru: Разрешить явно указывать номер строки.

source: Continue execution until the current function returns.
ru: Продолжайте выполнение до тех пор, пока текущая функция не вернется.

source: Continue execution, only stop when a breakpoint is encountered.
ru: Продолжайте выполнение, останавливайтесь только при обнаружении точки останова.

source: Set the next line that will be executed. Only available in the bottom-most frame. This lets you jump back and execute code again, or jump forward to skip code that you don't want to run.
ru: Установите следующую строку, которая будет выполнена. Доступно только в самом нижнем кадре. Это позволяет вам вернуться назад и снова выполнить код или перейти вперед, чтобы пропустить код, который вы не хотите запускать.

source: It should be noted that not all jumps are allowed -- for instance it is not possible to jump into the middle of a :keyword:`for` loop or out of a :keyword:`finally` clause.
ru: Следует отметить, что не все переходы разрешены - например, невозможно перейти в середину цикла :keyword:`for` или выйти из предложения :keyword:`finally`.

source: List source code for the current file. Without arguments, list 11 lines around the current line or continue the previous listing. With ``.`` as argument, list 11 lines around the current line. With one argument, list 11 lines around at that line. With two arguments, list the given range; if the second argument is less than the first, it is interpreted as a count.
ru: Вывести исходный код текущего файла. Без аргументов перечислите 11 строк вокруг текущей строки или продолжите предыдущий листинг. С аргументом ``.`` перечислите 11 строк вокруг текущей строки. С одним аргументом перечислите 11 строк вокруг этой строки. С двумя аргументами перечислите заданный диапазон; если второй аргумент меньше первого, он интерпретируется как счетчик.

source: The current line in the current frame is indicated by ``->``. If an exception is being debugged, the line where the exception was originally raised or propagated is indicated by ``>>``, if it differs from the current line.
ru: Текущая строка в текущем кадре обозначается ``->``. Если исключение отлаживается, строка, в которой исключение было первоначально вызвано или распространено, обозначается ``>>``, если она отличается от текущей строки.

source: The ``>>`` marker.
ru: Отметка ``>>``

source: List all source code for the current function or frame. Interesting lines are marked as for :pdbcmd:`list`.
ru: Перечислите весь исходный код для текущей функции или фрейма. Интересные строки отмечены как :pdbcmd:`list`.

source: ``print()`` can also be used, but is not a debugger command --- this executes the Python :func:`print` function.
ru: ``print()`` также можно использовать, но это не команда отладчика — она выполняет функцию Python :func:`print`.

source: Start an interactive interpreter (using the :mod:`code` module) whose global namespace contains all the (global and local) names found in the current scope.
ru: Запустите интерактивный интерпретатор (используя модуль :mod:`code`), глобальное пространство имен которого содержит все имена (глобальные и локальные), найденные в текущей области.

source: Aliases may be nested and can contain anything that can be legally typed at the pdb prompt. Note that internal pdb commands *can* be overridden by aliases. Such a command is then hidden until the alias is removed. Aliasing is recursively applied to the first word of the command line; all other words in the line are left alone.
ru: Псевдонимы могут быть вложенными и содержать все, что можно правильно ввести в командной строке pdb. Обратите внимание, что внутренние команды pdb *могут* быть переопределены псевдонимами. Такая команда затем скрывается до тех пор, пока псевдоним не будет удален. Псевдоним рекурсивно применяется к первому слову командной строки; все остальные слова в строке остаются в покое.

source: As an example, here are two useful aliases (especially when placed in the :file:`.pdbrc` file)::
ru: В качестве примера приведем два полезных псевдонима (особенно если они помещены в файл :file:`.pdbrc`)::
