Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/pdb.po
Languages: ru

source: Quit from the debugger. The program being executed is aborted.
ru: Выйдите из отладчика. Выполнение программы прерывается.

source: Footnotes
ru: Сноски

source: Whether a frame is considered to originate in a certain module is determined by the ``__name__`` in the frame globals.
ru: Будет ли кадр считаться происходящим из определенного модуля, определяется ``__name__`` в глобальных переменных кадра.
