Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/pickle.po
Languages: ru

source: For a class that has :attr:`~object.__slots__` and no instance :attr:`~object.__dict__`, the default state is a tuple whose first item is ``None`` and whose second item is a dictionary mapping slot names to slot values described in the previous bullet.
ru: Для класса, который имеет :attr:`~object.__slots__` и не имеет экземпляра :attr:`~object.__dict__`, состоянием по умолчанию является кортеж, первый элемент которого равен ``None``, а второй элемент является сопоставлением словаря. имена слотов в значения слотов, описанные в предыдущем пункте.

source: Added the default implementation of the ``__getstate__()`` method in the :class:`object` class.
ru: Добавлена ​​реализация по умолчанию метода ``__getstate__()`` в классе :class:`object`.

source: Upon unpickling, if the class defines :meth:`__setstate__`, it is called with the unpickled state. In that case, there is no requirement for the state object to be a dictionary. Otherwise, the pickled state must be a dictionary and its items are assigned to the new instance's dictionary.
ru: Если при распаковке класс определяет :meth:`__setstate__`, он вызывается с немаринованным состоянием. В этом случае нет необходимости, чтобы объект состояния был словарем. В противном случае маринованное состояние должно быть словарем, а его элементы присваиваются словарю нового экземпляра.

source: If :meth:`__reduce__` returns a state with value ``None`` at pickling, the :meth:`__setstate__` method will not be called upon unpickling.
ru: Если :meth:`__reduce__` возвращает состояние со значением ``None`` при травлении, метод :meth:`__setstate__` не будет вызываться при распаковке.

source: Refer to the section :ref:`pickle-state` for more information about how to use the methods :meth:`~object.__getstate__` and :meth:`~object.__setstate__`.
ru: Обратитесь к разделу :ref:`pickle-state` для получения дополнительной информации о том, как использовать методы :meth:`~object.__getstate__` и :meth:`~object.__setstate__`.

source: At unpickling time, some methods like :meth:`~object.__getattr__`, :meth:`~object.__getattribute__`, or :meth:`~object.__setattr__` may be called upon the instance. In case those methods rely on some internal invariant being true, the type should implement :meth:`~object.__new__` to establish such an invariant, as :meth:`~object.__init__` is not called when unpickling an instance.
ru: Во время распаковки для экземпляра могут быть вызваны некоторые методы, такие как :meth:`~object.__getattr__`, :meth:`~object.__getattribute__` или :meth:`~object.__setattr__`. В случае, если эти методы полагаются на истинность некоторого внутреннего инварианта, тип должен реализовать :meth:`~object.__new__` для установления такого инварианта, поскольку :meth:`~object.__init__` не вызывается при распаковке экземпляра.

source: As we shall see, pickle does not use directly the methods described above. In fact, these methods are part of the copy protocol which implements the :meth:`~object.__reduce__` special method. The copy protocol provides a unified interface for retrieving the data necessary for pickling and copying objects. [#]_
ru: Как мы увидим, Pickle не использует напрямую методы, описанные выше. Фактически, эти методы являются частью протокола копирования, который реализует специальный метод :meth:`~object.__reduce__`. Протокол копирования предоставляет унифицированный интерфейс для получения данных, необходимых для травления и копирования объектов. [#]_

source: Although powerful, implementing :meth:`~object.__reduce__` directly in your classes is error prone. For this reason, class designers should use the high-level interface (i.e., :meth:`~object.__getnewargs_ex__`, :meth:`~object.__getstate__` and :meth:`~object.__setstate__`) whenever possible. We will show, however, cases where using :meth:`!__reduce__` is the only option or leads to more efficient pickling or both.
ru: Несмотря на свою эффективность, реализация :meth:`~object.__reduce__` непосредственно в ваших классах чревата ошибками. По этой причине проектировщикам классов следует по возможности использовать высокоуровневый интерфейс (т. е. :meth:`~object.__getnewargs_ex__`, :meth:`~object.__getstate__` и :meth:`~object.__setstate__`). Однако мы покажем случаи, когда использование :meth:`!__reduce__` является единственным вариантом или приводит к более эффективному травлению, или и то, и другое.

source: The interface is currently defined as follows. The :meth:`__reduce__` method takes no argument and shall return either a string or preferably a tuple (the returned object is often referred to as the "reduce value").
ru: В настоящее время интерфейс определен следующим образом. Метод :meth:`__reduce__` не принимает аргументов и должен возвращать либо строку, либо, предпочтительно, кортеж (возвращаемый объект часто называют «снижающим значением»).

source: If a string is returned, the string should be interpreted as the name of a global variable. It should be the object's local name relative to its module; the pickle module searches the module namespace to determine the object's module. This behaviour is typically useful for singletons.
ru: Если возвращается строка, ее следует интерпретировать как имя глобальной переменной. Это должно быть локальное имя объекта относительно его модуля; модуль Pickle ищет пространство имен модуля, чтобы определить модуль объекта. Такое поведение обычно полезно для одиночных объектов.

source: When a tuple is returned, it must be between two and six items long. Optional items can either be omitted, or ``None`` can be provided as their value. The semantics of each item are in order:
ru: Когда возвращается кортеж, его длина должна составлять от двух до шести элементов. Необязательные элементы можно либо опустить, либо указать в качестве значения «Нет». Семантика каждого элемента следующая:

source: A callable object that will be called to create the initial version of the object.
ru: Вызываемый объект, который будет вызываться для создания начальной версии объекта.

source: A tuple of arguments for the callable object. An empty tuple must be given if the callable does not accept any argument.
ru: Кортеж аргументов для вызываемого объекта. Должен быть указан пустой кортеж, если вызываемый объект не принимает никаких аргументов.

source: Optionally, the object's state, which will be passed to the object's :meth:`__setstate__` method as previously described. If the object has no such method then, the value must be a dictionary and it will be added to the object's :attr:`~object.__dict__` attribute.
ru: Необязательно, состояние объекта, которое будет передано в метод объекта :meth:`__setstate__`, как описано ранее. Если у объекта нет такого метода, значение должно быть словарем, и оно будет добавлено к атрибуту :attr:`~object.__dict__` объекта.

source: Optionally, an iterator (and not a sequence) yielding successive items. These items will be appended to the object either using ``obj.append(item)`` or, in batch, using ``obj.extend(list_of_items)``. This is primarily used for list subclasses, but may be used by other classes as long as they have :ref:`append and extend methods <typesseq-common>` with the appropriate signature. (Whether :meth:`!append` or :meth:`!extend` is used depends on which pickle protocol version is used as well as the number of items to append, so both must be supported.)
ru: Необязательно, итератор (а не последовательность), дающий последовательные элементы. Эти элементы будут добавлены к объекту либо с помощью ``obj.append(item)``, либо, в пакетном режиме, с помощью ``obj.extend(list_of_items)``. В основном это используется для подклассов списков, но может использоваться и другими классами, если у них есть методы добавления и расширения <typesseq-common> с соответствующей сигнатурой. (Использование :meth:`!append` или :meth:`!extend` зависит от того, какая версия протокола Pickle используется, а также от количества добавляемых элементов, поэтому оба должны поддерживаться.)

source: Optionally, an iterator (not a sequence) yielding successive key-value pairs. These items will be stored to the object using ``obj[key] = value``. This is primarily used for dictionary subclasses, but may be used by other classes as long as they implement :meth:`__setitem__`.
ru: Необязательно, итератор (не последовательность), дающий последовательные пары ключ-значение. Эти элементы будут сохранены в объекте с использованием ``obj[key] = value``. В основном это используется для подклассов словарей, но может использоваться и другими классами, если они реализуют :meth:`__setitem__`.

source: Optionally, a callable with a ``(obj, state)`` signature. This callable allows the user to programmatically control the state-updating behavior of a specific object, instead of using ``obj``'s static :meth:`__setstate__` method. If not ``None``, this callable will have priority over ``obj``'s :meth:`__setstate__`.
ru: Необязательно, вызываемый объект с сигнатурой ``(obj,state)``. Этот вызываемый объект позволяет пользователю программно управлять поведением обновления состояния конкретного объекта вместо использования статического метода :meth:`__setstate__` ``obj``. Если не ``None``, этот вызываемый объект будет иметь приоритет над :meth:`__setstate__` ``obj``.

source: The optional sixth tuple item, ``(obj, state)``, was added.
ru: Был добавлен необязательный шестой элемент кортежа ``(obj,state)``.

source: Alternatively, a :meth:`__reduce_ex__` method may be defined. The only difference is this method should take a single integer argument, the protocol version. When defined, pickle will prefer it over the :meth:`__reduce__` method. In addition, :meth:`__reduce__` automatically becomes a synonym for the extended version. The main use for this method is to provide backwards-compatible reduce values for older Python releases.
ru: В качестве альтернативы можно определить метод :meth:`__reduce_ex__`. Единственное отличие состоит в том, что этот метод должен принимать один целочисленный аргумент — версию протокола. Если он определен, Pickle предпочтет его методу :meth:`__reduce__`. Кроме того, :meth:`__reduce__` автоматически становится синонимом расширенной версии. Основное использование этого метода — предоставление обратно совместимых значений сокращения для старых версий Python.

source: Persistence of External Objects
ru: Сохранение внешних объектов

source: For the benefit of object persistence, the :mod:`pickle` module supports the notion of a reference to an object outside the pickled data stream. Such objects are referenced by a persistent ID, which should be either a string of alphanumeric characters (for protocol 0) [#]_ or just an arbitrary object (for any newer protocol).
ru: В целях сохранения объекта модуль :mod:`pickle` поддерживает идею ссылки на объект вне маринованного потока данных. На такие объекты ссылается постоянный идентификатор, который должен представлять собой строку буквенно-цифровых символов (для протокола 0). [#]_ или просто произвольный объект (для любого нового протокола).

source: The resolution of such persistent IDs is not defined by the :mod:`pickle` module; it will delegate this resolution to the user-defined methods on the pickler and unpickler, :meth:`~Pickler.persistent_id` and :meth:`~Unpickler.persistent_load` respectively.
ru: Разрешение таких постоянных идентификаторов не определяется модулем :mod:`pickle`; он делегирует это разрешение определяемым пользователем методам сборщика и разблокировщика: :meth:`~Pickler.persistent_id` и :meth:`~Unpickler.persistent_load` соответственно.

source: To pickle objects that have an external persistent ID, the pickler must have a custom :meth:`~Pickler.persistent_id` method that takes an object as an argument and returns either ``None`` or the persistent ID for that object. When ``None`` is returned, the pickler simply pickles the object as normal. When a persistent ID string is returned, the pickler will pickle that object, along with a marker so that the unpickler will recognize it as a persistent ID.
ru: Чтобы выбрать объекты, имеющие внешний постоянный идентификатор, сборщик должен иметь специальный метод :meth:`~Pickler.persistent_id`, который принимает объект в качестве аргумента и возвращает либо ``None``, либо постоянный идентификатор для этого объекта. Когда возвращается None, сборщик просто выбирает объект как обычно. Когда возвращается строка постоянного идентификатора, сборщик выбирает этот объект вместе с маркером, чтобы средство отмены выбора распознало его как постоянный идентификатор.

source: To unpickle external objects, the unpickler must have a custom :meth:`~Unpickler.persistent_load` method that takes a persistent ID object and returns the referenced object.
ru: Чтобы распаковать внешние объекты, у распаковщика должен быть специальный метод :meth:`~Unpickler.persistent_load`, который принимает объект постоянного идентификатора и возвращает объект, на который ссылается.

source: Here is a comprehensive example presenting how persistent ID can be used to pickle external objects by reference.
ru: Вот подробный пример, показывающий, как можно использовать постоянный идентификатор для выбора внешних объектов по ссылке.

source: Dispatch Tables
ru: Таблица отправки

source: If one wants to customize pickling of some classes without disturbing any other code which depends on pickling, then one can create a pickler with a private dispatch table.
ru: Если вы хотите настроить травление некоторых классов, не нарушая какой-либо другой код, который зависит от травления, то можно создать сборщик с частной таблицей диспетчеризации.

source: The global dispatch table managed by the :mod:`copyreg` module is available as :data:`!copyreg.dispatch_table`. Therefore, one may choose to use a modified copy of :data:`!copyreg.dispatch_table` as a private dispatch table.
ru: Глобальная таблица диспетчеризации, управляемая модулем :mod:`copyreg`, доступна как :data:`!copyreg.dispatch_table`. Поэтому можно использовать измененную копию :data:`!copyreg.dispatch_table` в качестве частной таблицы диспетчеризации.

source: For example ::
ru: Например ::

source: creates an instance of :class:`pickle.Pickler` with a private dispatch table which handles the ``SomeClass`` class specially. Alternatively, the code ::
ru: создает экземпляр :class:`pickle.Pickler` с частной таблицей диспетчеризации, которая специально обрабатывает класс ``SomeClass``. Альтернативно, код::

source: does the same but all instances of ``MyPickler`` will by default share the private dispatch table. On the other hand, the code ::
ru: делает то же самое, но все экземпляры MyPickler по умолчанию будут совместно использовать частную таблицу отправки. С другой стороны, код::

source: modifies the global dispatch table shared by all users of the :mod:`copyreg` module.
ru: изменяет глобальную таблицу диспетчеризации, общую для всех пользователей модуля :mod:`copyreg`.

source: Handling Stateful Objects
ru: Обработка объектов с отслеживаемым состоянием

source: Here's an example that shows how to modify pickling behavior for a class. The :class:`!TextReader` class below opens a text file, and returns the line number and line contents each time its :meth:`!readline` method is called. If a :class:`!TextReader` instance is pickled, all attributes *except* the file object member are saved. When the instance is unpickled, the file is reopened, and reading resumes from the last location. The :meth:`!__setstate__` and :meth:`!__getstate__` methods are used to implement this behavior. ::
ru: Вот пример, показывающий, как изменить поведение травления для класса. Класс :class:`!TextReader` ниже открывает текстовый файл и возвращает номер строки и ее содержимое каждый раз, когда вызывается его метод :meth:`!readline`. Если экземпляр :class:`!TextReader` маринован, все атрибуты *кроме* члена файлового объекта сохраняются. Когда экземпляр распаковывается, файл открывается повторно, и чтение возобновляется с последнего места. Для реализации этого поведения используются методы :meth:`!__setstate__` и :meth:`!__getstate__`. ::

source: A sample usage might be something like this::
ru: Пример использования может быть примерно таким::

source: Custom Reduction for Types, Functions, and Other Objects
ru: Пользовательское сокращение типов, функций и других объектов

source: Sometimes, :attr:`~Pickler.dispatch_table` may not be flexible enough. In particular we may want to customize pickling based on another criterion than the object's type, or we may want to customize the pickling of functions and classes.
ru: Иногда :attr:`~Pickler.dispatch_table` может быть недостаточно гибким. В частности, мы можем захотеть настроить травление на основе другого критерия, кроме типа объекта, или мы можем захотеть настроить травление функций и классов.

source: For those cases, it is possible to subclass from the :class:`Pickler` class and implement a :meth:`~Pickler.reducer_override` method. This method can return an arbitrary reduction tuple (see :meth:`~object.__reduce__`). It can alternatively return :data:`NotImplemented` to fallback to the traditional behavior.
ru: В таких случаях можно создать подкласс класса :class:`Pickler` и реализовать метод :meth:`~Pickler.reducer_override`. Этот метод может возвращать произвольный кортеж сокращения (см. :meth:`~object.__reduce__`). В качестве альтернативы он может вернуть :data:`NotImplemented` для возврата к традиционному поведению.

source: If both the :attr:`~Pickler.dispatch_table` and :meth:`~Pickler.reducer_override` are defined, then :meth:`~Pickler.reducer_override` method takes priority.
ru: В таких случаях можно создать подкласс класса :class:`Pickler` и реализовать метод :meth:`~Pickler.reducer_override`. Этот метод может возвращать произвольный кортеж сокращения (см. :meth:`~object.__reduce__`). В качестве альтернативы он может вернуть :data:`NotImplemented` для возврата к традиционному поведению.

source: For performance reasons, :meth:`~Pickler.reducer_override` may not be called for the following objects: ``None``, ``True``, ``False``, and exact instances of :class:`int`, :class:`float`, :class:`bytes`, :class:`str`, :class:`dict`, :class:`set`, :class:`frozenset`, :class:`list` and :class:`tuple`.
ru: По соображениям производительности :meth:`~Pickler.reducer_override` не может вызываться для следующих объектов: ``None``, ``True``, ``False`` и точных экземпляров :class:`int` , :class:`float`, :class:`bytes`, :class:`str`, :class:`dict`, :class:`set`, :class:`frozenset`, :class:`list` и :class:`кортеж`.

source: Here is a simple example where we allow pickling and reconstructing a given class::
ru: Вот простой пример, где мы разрешаем травление и реконструкцию данного класса:

source: Out-of-band Buffers
ru: Внеполосные буферы

source: In some contexts, the :mod:`pickle` module is used to transfer massive amounts of data. Therefore, it can be important to minimize the number of memory copies, to preserve performance and resource consumption. However, normal operation of the :mod:`pickle` module, as it transforms a graph-like structure of objects into a sequential stream of bytes, intrinsically involves copying data to and from the pickle stream.
ru: В некоторых контекстах модуль :mod:`pickle` используется для передачи огромных объемов данных. Поэтому может быть важно минимизировать количество копий памяти, чтобы сохранить производительность и потребление ресурсов. Однако нормальная работа модуля :mod:`pickle`, поскольку он преобразует графоподобную структуру объектов в последовательный поток байтов, по своей сути включает копирование данных в поток Pickle и из него.

source: This constraint can be eschewed if both the *provider* (the implementation of the object types to be transferred) and the *consumer* (the implementation of the communications system) support the out-of-band transfer facilities provided by pickle protocol 5 and higher.
ru: Этого ограничения можно избежать, если и *поставщик* (реализация типов объектов, подлежащих передаче), и *потребитель* (реализация системы связи) поддерживают средства внеполосной передачи, предоставляемые протоколом Pickle 5 и выше.

source: Provider API
ru: API провайдера

source: The large data objects to be pickled must implement a :meth:`~object.__reduce_ex__` method specialized for protocol 5 and higher, which returns a :class:`PickleBuffer` instance (instead of e.g. a :class:`bytes` object) for any large data.
ru: Большие объекты данных, подлежащие маринованию, должны реализовывать метод :meth:`~object.__reduce_ex__`, специализированный для протокола 5 и выше, который возвращает экземпляр :class:`PickleBuffer` (вместо, например, объекта :class:`bytes`). для любых больших данных.

source: A :class:`PickleBuffer` object *signals* that the underlying buffer is eligible for out-of-band data transfer. Those objects remain compatible with normal usage of the :mod:`pickle` module. However, consumers can also opt-in to tell :mod:`pickle` that they will handle those buffers by themselves.
ru: Объект :class:`PickleBuffer` *сигнализирует* о том, что базовый буфер имеет право на внеполосную передачу данных. Эти объекты остаются совместимыми при обычном использовании модуля :mod:`pickle`. Однако потребители также могут указать :mod:`pickle`, что они будут обрабатывать эти буферы самостоятельно.

source: Consumer API
ru: Потребительский API

source: A communications system can enable custom handling of the :class:`PickleBuffer` objects generated when serializing an object graph.
ru: Система связи может обеспечить индивидуальную обработку объектов :class:`PickleBuffer`, генерируемых при сериализации графа объектов.

source: On the sending side, it needs to pass a *buffer_callback* argument to :class:`Pickler` (or to the :func:`dump` or :func:`dumps` function), which will be called with each :class:`PickleBuffer` generated while pickling the object graph. Buffers accumulated by the *buffer_callback* will not see their data copied into the pickle stream, only a cheap marker will be inserted.
ru: На стороне отправки ему необходимо передать аргумент *buffer_callback* в :class:`Pickler` (или в функцию :func:`dump` или :func:`dumps`), которая будет вызываться с каждым :class: `PickleBuffer` генерируется при травлении графа объекта. Буферы, накопленные с помощью *buffer_callback*, не будут видеть свои данные, скопированные в поток Pickle, будет вставлен только дешевый маркер.

source: On the receiving side, it needs to pass a *buffers* argument to :class:`Unpickler` (or to the :func:`load` or :func:`loads` function), which is an iterable of the buffers which were passed to *buffer_callback*. That iterable should produce buffers in the same order as they were passed to *buffer_callback*. Those buffers will provide the data expected by the reconstructors of the objects whose pickling produced the original :class:`PickleBuffer` objects.
ru: На принимающей стороне ему необходимо передать аргумент *buffers* в :class:`Unpickler` (или в функцию :func:`load` или :func:`loads`), которая представляет собой итерацию буферов, которые были передается в *buffer_callback*. Эта итерация должна создавать буферы в том же порядке, в котором они были переданы в *buffer_callback*. Эти буферы будут предоставлять данные, ожидаемые реконструкторами объектов, травление которых привело к созданию исходных объектов :class:`PickleBuffer`.

source: Between the sending side and the receiving side, the communications system is free to implement its own transfer mechanism for out-of-band buffers. Potential optimizations include the use of shared memory or datatype-dependent compression.
ru: Между отправляющей стороной и принимающей стороной система связи может реализовать собственный механизм передачи для внеполосных буферов. Потенциальные оптимизации включают использование общей памяти или сжатие в зависимости от типа данных.

source: Example
ru: Пример
