Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/pickle.po
Languages: ru

source: :mod:`!pickle` --- Python object serialization
ru: :mod:`!pickle` --- Сериализация объектов Python

source: **Source code:** :source:`Lib/pickle.py`
ru: **Исходный код:** :source:`Lib/pickle.py`

source: The :mod:`pickle` module implements binary protocols for serializing and de-serializing a Python object structure. *"Pickling"* is the process whereby a Python object hierarchy is converted into a byte stream, and *"unpickling"* is the inverse operation, whereby a byte stream (from a :term:`binary file` or :term:`bytes-like object`) is converted back into an object hierarchy. Pickling (and unpickling) is alternatively known as "serialization", "marshalling," [#]_ or "flattening"; however, to avoid confusion, the terms used here are "pickling" and "unpickling".
ru: Модуль :mod:`pickle` реализует двоичные протоколы для сериализации и десериализации объектной структуры Python. *"Пиклинг"* — это процесс, при котором иерархия объектов Python преобразуется в поток байтов, а *"распаковка"* — это обратная операция, при которой поток байтов (из :term:`двоичного файла` или :term:` байтовый объект`) преобразуется обратно в иерархию объектов. Маринование (и демаринование) также известно как «сериализация», «маршалинг». [#]_ или «сглаживание»; однако, чтобы избежать путаницы, здесь используются термины «маринование» и «расмаринование».

source: The ``pickle`` module **is not secure**. Only unpickle data you trust.
ru: Модуль ``pickle`` **небезопасен**. Распаковывайте только те данные, которым вы доверяете.

source: It is possible to construct malicious pickle data which will **execute arbitrary code during unpickling**. Never unpickle data that could have come from an untrusted source, or that could have been tampered with.
ru: Можно создать вредоносные данные травления, которые будут **выполнять произвольный код во время распаковки**. Никогда не анализируйте данные, которые могли быть получены из ненадежного источника или которые могли быть подделаны.

source: Consider signing data with :mod:`hmac` if you need to ensure that it has not been tampered with.
ru: Рассмотрите возможность подписания данных с помощью :mod:`hmac`, если вам нужно убедиться, что они не были подделаны.

source: Safer serialization formats such as :mod:`json` may be more appropriate if you are processing untrusted data. See :ref:`comparison-with-json`.
ru: Более безопасные форматы сериализации, такие как :mod:`json`, могут быть более подходящими, если вы обрабатываете ненадежные данные. См. :ref:`сравнение-с-json`.

source: Relationship to other Python modules
ru: Связь с другими модулями Python

source: Comparison with ``marshal``
ru: Сравнение с ``marshal``

source: Python has a more primitive serialization module called :mod:`marshal`, but in general :mod:`pickle` should always be the preferred way to serialize Python objects. :mod:`marshal` exists primarily to support Python's :file:`.pyc` files.
ru: В Python есть более примитивный модуль сериализации, называемый :mod:`marshal`, но в целом :mod:`pickle` всегда должен быть предпочтительным способом сериализации объектов Python. :mod:`marshal` существует в первую очередь для поддержки файлов Python :file:`.pyc`.

source: The :mod:`pickle` module differs from :mod:`marshal` in several significant ways:
ru: Модуль :mod:`pickle` отличается от :mod:`marshal` по нескольким важным параметрам:

source: The :mod:`pickle` module keeps track of the objects it has already serialized, so that later references to the same object won't be serialized again. :mod:`marshal` doesn't do this.
ru: Модуль :mod:`pickle` отслеживает объекты, которые он уже сериализовал, поэтому последующие ссылки на тот же объект не будут сериализоваться снова. :mod:`marshal` этого не делает.

source: This has implications both for recursive objects and object sharing. Recursive objects are objects that contain references to themselves. These are not handled by marshal, and in fact, attempting to marshal recursive objects will crash your Python interpreter. Object sharing happens when there are multiple references to the same object in different places in the object hierarchy being serialized. :mod:`pickle` stores such objects only once, and ensures that all other references point to the master copy. Shared objects remain shared, which can be very important for mutable objects.
ru: Это имеет значение как для рекурсивных объектов, так и для совместного использования объектов. Рекурсивные объекты — это объекты, содержащие ссылки на себя. Они не обрабатываются маршалом, и фактически попытка маршалирования рекурсивных объектов приведет к сбою вашего интерпретатора Python. Совместное использование объектов происходит, когда существует несколько ссылок на один и тот же объект в разных местах сериализуемой иерархии объектов. :mod:`pickle` сохраняет такие объекты только один раз и гарантирует, что все остальные ссылки указывают на мастер-копию. Общие объекты остаются общими, что может быть очень важно для изменяемых объектов.

source: :mod:`marshal` cannot be used to serialize user-defined classes and their instances. :mod:`pickle` can save and restore class instances transparently, however the class definition must be importable and live in the same module as when the object was stored.
ru: :mod:`marshal` нельзя использовать для сериализации пользовательских классов и их экземпляров. :mod:`pickle` может сохранять и восстанавливать экземпляры классов прозрачно, однако определение класса должно быть импортируемым и находиться в том же модуле, в котором был сохранен объект.

source: The :mod:`marshal` serialization format is not guaranteed to be portable across Python versions. Because its primary job in life is to support :file:`.pyc` files, the Python implementers reserve the right to change the serialization format in non-backwards compatible ways should the need arise. The :mod:`pickle` serialization format is guaranteed to be backwards compatible across Python releases provided a compatible pickle protocol is chosen and pickling and unpickling code deals with Python 2 to Python 3 type differences if your data is crossing that unique breaking change language boundary.
ru: Переносимость формата сериализации :mod:`marshal` не гарантируется между версиями Python. Поскольку его основной задачей в жизни является поддержка файлов :file:`.pyc`, разработчики Python оставляют за собой право изменять формат сериализации способами, не имеющими обратной совместимости, если возникнет такая необходимость. Формат сериализации :mod:`pickle` гарантированно будет обратно совместим между выпусками Python при условии, что выбран совместимый протокол Pickle, а код травления и распаковки обрабатывает различия типов Python 2 и Python 3, если ваши данные пересекают эту уникальную границу языка критических изменений. .

source: Comparison with ``json``
ru: Сравнение с ``json``

source: There are fundamental differences between the pickle protocols and `JSON (JavaScript Object Notation) <https://json.org>`_:
ru: Существуют фундаментальные различия между протоколами Pickle и `JSON (JavaScript Object Notation) <https://json.org>`_:

source: JSON is a text serialization format (it outputs unicode text, although most of the time it is then encoded to ``utf-8``), while pickle is a binary serialization format;
ru: JSON — это формат сериализации текста (он выводит текст в формате Юникода, хотя большую часть времени он кодируется в «utf-8»), тогда как Pickle — это формат двоичной сериализации;

source: JSON is human-readable, while pickle is not;
ru: JSON удобен для чтения человеком, а Pickle — нет;

source: JSON is interoperable and widely used outside of the Python ecosystem, while pickle is Python-specific;
ru: JSON совместим и широко используется за пределами экосистемы Python, тогда как Pickle специфичен для Python;

source: JSON, by default, can only represent a subset of the Python built-in types, and no custom classes; pickle can represent an extremely large number of Python types (many of them automatically, by clever usage of Python's introspection facilities; complex cases can be tackled by implementing :ref:`specific object APIs <pickle-inst>`);
ru: JSON по умолчанию может представлять только подмножество встроенных типов Python и не может представлять пользовательские классы; Pickle может представлять чрезвычайно большое количество типов Python (многие из них автоматически, за счет умелого использования средств интроспекции Python; сложные случаи можно решать, реализуя API конкретных объектов <pickle-inst>`);

source: Unlike pickle, deserializing untrusted JSON does not in itself create an arbitrary code execution vulnerability.
ru: В отличие от Pickle, десериализация ненадежного JSON сама по себе не создает уязвимости, связанной с выполнением произвольного кода.

source: The :mod:`json` module: a standard library module allowing JSON serialization and deserialization.
ru: Модуль :mod:`json`: стандартный библиотечный модуль, позволяющий сериализацию и десериализацию JSON.

source: Data stream format
ru: Формат потока данных

source: The data format used by :mod:`pickle` is Python-specific. This has the advantage that there are no restrictions imposed by external standards such as JSON (which can't represent pointer sharing); however it means that non-Python programs may not be able to reconstruct pickled Python objects.
ru: Формат данных, используемый :mod:`pickle`, зависит от Python. Преимущество этого подхода состоит в том, что не существует ограничений, налагаемых внешними стандартами, такими как JSON (который не может представлять совместное использование указателей); однако это означает, что программы, отличные от Python, могут быть не в состоянии реконструировать консервированные объекты Python.

source: By default, the :mod:`pickle` data format uses a relatively compact binary representation. If you need optimal size characteristics, you can efficiently :doc:`compress <archiving>` pickled data.
ru: По умолчанию формат данных :mod:`pickle` использует относительно компактное двоичное представление. Если вам нужны оптимальные характеристики размера, вы можете эффективно :doc:`сжать <архивирование>` маринованные данные.

source: The module :mod:`pickletools` contains tools for analyzing data streams generated by :mod:`pickle`. :mod:`pickletools` source code has extensive comments about opcodes used by pickle protocols.
ru: Модуль :mod:`pickletools` содержит инструменты для анализа потоков данных, генерируемых :mod:`pickle`. Исходный код :mod:`pickletools` содержит подробные комментарии о кодах операций, используемых протоколами Pickle.

source: There are currently 6 different protocols which can be used for pickling. The higher the protocol used, the more recent the version of Python needed to read the pickle produced.
ru: В настоящее время существует 6 различных протоколов травления. Чем выше используемый протокол, тем более поздняя версия Python необходима для чтения полученного рассола.

source: Protocol version 0 is the original "human-readable" protocol and is backwards compatible with earlier versions of Python.
ru: Протокол версии 0 — это оригинальный «удобочитаемый» протокол, обратно совместимый с более ранними версиями Python.

source: Protocol version 1 is an old binary format which is also compatible with earlier versions of Python.
ru: Протокол версии 1 — это старый двоичный формат, который также совместим с более ранними версиями Python.

source: Protocol version 2 was introduced in Python 2.3. It provides much more efficient pickling of :term:`new-style classes <new-style class>`. Refer to :pep:`307` for information about improvements brought by protocol 2.
ru: Протокол версии 2 был представлен в Python 2.3. Это обеспечивает гораздо более эффективное травление :term:`классов нового стиля <класс нового стиля>`. Обратитесь к :pep:`307` для получения информации об улучшениях, внесенных протоколом 2.

source: Protocol version 3 was added in Python 3.0. It has explicit support for :class:`bytes` objects and cannot be unpickled by Python 2.x. This was the default protocol in Python 3.0--3.7.
ru: Протокол версии 3 был добавлен в Python 3.0. Он имеет явную поддержку объектов :class:`bytes` и не может быть распакован Python 2.x. Это был протокол по умолчанию в Python 3.0–3.7.

source: Protocol version 4 was added in Python 3.4. It adds support for very large objects, pickling more kinds of objects, and some data format optimizations. It is the default protocol starting with Python 3.8. Refer to :pep:`3154` for information about improvements brought by protocol 4.
ru: Протокол версии 4 был добавлен в Python 3.4. Он добавляет поддержку очень больших объектов, выбор большего количества типов объектов и некоторую оптимизацию формата данных. Это протокол по умолчанию, начиная с Python 3.8. Обратитесь к :pep:`3154` для получения информации об улучшениях, внесенных протоколом 4.

source: Protocol version 5 was added in Python 3.8. It adds support for out-of-band data and speedup for in-band data. Refer to :pep:`574` for information about improvements brought by protocol 5.
ru: Протокол версии 5 был добавлен в Python 3.8. Он добавляет поддержку внеполосных данных и ускорение внутриполосных данных. Обратитесь к :pep:`574` для получения информации об улучшениях, внесенных протоколом 5.

source: Serialization is a more primitive notion than persistence; although :mod:`pickle` reads and writes file objects, it does not handle the issue of naming persistent objects, nor the (even more complicated) issue of concurrent access to persistent objects. The :mod:`pickle` module can transform a complex object into a byte stream and it can transform the byte stream into an object with the same internal structure. Perhaps the most obvious thing to do with these byte streams is to write them onto a file, but it is also conceivable to send them across a network or store them in a database. The :mod:`shelve` module provides a simple interface to pickle and unpickle objects on DBM-style database files.
ru: Сериализация — более примитивное понятие, чем постоянство; хотя :mod:`pickle` читает и записывает файловые объекты, он не решает ни проблему именования постоянных объектов, ни (еще более сложную) проблему одновременного доступа к постоянным объектам. Модуль :mod:`pickle` может преобразовать сложный объект в поток байтов, а также преобразовать поток байтов в объект с той же внутренней структурой. Возможно, самое очевидное, что можно сделать с этими потоками байтов, — это записать их в файл, но их также можно отправить по сети или сохранить в базе данных. Модуль :mod:`shelve` предоставляет простой интерфейс для выбора и удаления объектов в файлах базы данных в стиле DBM.

source: Module Interface
ru: Интерфейс модуля

source: To serialize an object hierarchy, you simply call the :func:`dumps` function. Similarly, to de-serialize a data stream, you call the :func:`loads` function. However, if you want more control over serialization and de-serialization, you can create a :class:`Pickler` or an :class:`Unpickler` object, respectively.
ru: Чтобы сериализовать иерархию объектов, вы просто вызываете функцию :func:`dumps`. Аналогично, чтобы десериализовать поток данных, вы вызываете функцию :func:`loads`. Однако, если вам нужен больший контроль над сериализацией и десериализацией, вы можете создать объект :class:`Pickler` или :class:`Unpickler` соответственно.

source: The :mod:`pickle` module provides the following constants:
ru: Модуль :mod:`pickle` предоставляет следующие константы:

source: An integer, the highest :ref:`protocol version <pickle-protocols>` available. This value can be passed as a *protocol* value to functions :func:`dump` and :func:`dumps` as well as the :class:`Pickler` constructor.
ru: Целое число, наивысшая доступная версия протокола <pickle-protocols>`. Это значение можно передать как значение *протокола* в функции :func:`dump` и :func:`dumps`, а также в конструктор :class:`Pickler`.

source: An integer, the default :ref:`protocol version <pickle-protocols>` used for pickling. May be less than :data:`HIGHEST_PROTOCOL`. Currently the default protocol is 4, first introduced in Python 3.4 and incompatible with previous versions.
ru: Целое число, версия протокола по умолчанию <pickle-protocols>, используемая для травления. Может быть меньше :data:`HIGHEST_PROTOCOL`. В настоящее время протоколом по умолчанию является 4, впервые представленный в Python 3.4 и несовместимый с предыдущими версиями.

source: The default protocol is 3.
ru: Протокол по умолчанию — 3.

source: The default protocol is 4.
ru: Протокол по умолчанию — 4.

source: The :mod:`pickle` module provides the following functions to make the pickling process more convenient:
ru: Модуль :mod:`pickle` предоставляет следующие функции, делающие процесс маринования более удобным:

source: Write the pickled representation of the object *obj* to the open :term:`file object` *file*. This is equivalent to ``Pickler(file, protocol).dump(obj)``.
ru: Запишите маринованное представление объекта *obj* в открытый :term:`file object` *file*. Это эквивалентно ``Pickler(файл, протокол).dump(obj)``.

source: Arguments *file*, *protocol*, *fix_imports* and *buffer_callback* have the same meaning as in the :class:`Pickler` constructor.
ru: Аргументы *file*, *protocol*, *fix_imports* и *buffer_callback* имеют то же значение, что и в конструкторе :class:`Pickler`.

source: The *buffer_callback* argument was added.
ru: Был добавлен аргумент *buffer_callback*.

source: Return the pickled representation of the object *obj* as a :class:`bytes` object, instead of writing it to a file.
ru: Верните обработанное представление объекта *obj* как объект :class:`bytes` вместо записи его в файл.

source: Arguments *protocol*, *fix_imports* and *buffer_callback* have the same meaning as in the :class:`Pickler` constructor.
ru: Аргументы *protocol*, *fix_imports* и *buffer_callback* имеют то же значение, что и в конструкторе :class:`Pickler`.

source: Read the pickled representation of an object from the open :term:`file object` *file* and return the reconstituted object hierarchy specified therein. This is equivalent to ``Unpickler(file).load()``.
ru: Считайте маринованное представление объекта из открытого :term:`file object` *file* и верните указанную в нем восстановленную иерархию объектов. Это эквивалентно ``Unpickler(file).load()``.

source: The protocol version of the pickle is detected automatically, so no protocol argument is needed. Bytes past the pickled representation of the object are ignored.
ru: Версия протокола рассола определяется автоматически, поэтому аргумент протокола не требуется. Байты после маринованного представления объекта игнорируются.

source: Arguments *file*, *fix_imports*, *encoding*, *errors*, *strict* and *buffers* have the same meaning as in the :class:`Unpickler` constructor.
ru: Аргументы *file*, *fix_imports*, *encoding*, *errors*, *strict* и *buffers* имеют то же значение, что и в конструкторе :class:`Unpickler`.

source: The *buffers* argument was added.
ru: Был добавлен аргумент *buffers*.

source: Return the reconstituted object hierarchy of the pickled representation *data* of an object. *data* must be a :term:`bytes-like object`.
ru: Возвращает восстановленную иерархию объектов маринованного представления *данных* объекта. *данные* должны быть :term:`байтоподобным объектом`.

source: Arguments *fix_imports*, *encoding*, *errors*, *strict* and *buffers* have the same meaning as in the :class:`Unpickler` constructor.
ru: Аргументы *fix_imports*, *encoding*, *errors*, *strict* и *buffers* имеют то же значение, что и в конструкторе :class:`Unpickler`.

source: The :mod:`pickle` module defines three exceptions:
ru: Модуль :mod:`pickle` определяет три исключения:

source: Common base class for the other pickling exceptions. It inherits from :exc:`Exception`.
ru: Общий базовый класс для других исключений травления. Он наследуется от :exc:`Exception`.

source: Error raised when an unpicklable object is encountered by :class:`Pickler`. It inherits from :exc:`PickleError`.
ru: Ошибка возникает, когда :class:`Pickler` обнаруживает неподдающийся пикированию объект. Он наследуется от :exc:`PickleError`.

source: Refer to :ref:`pickle-picklable` to learn what kinds of objects can be pickled.
ru: Обратитесь к :ref:`pickle-picklable`, чтобы узнать, какие типы объектов можно мариновать.

source: Error raised when there is a problem unpickling an object, such as a data corruption or a security violation. It inherits from :exc:`PickleError`.
ru: Ошибка возникает, когда возникает проблема с распаковкой объекта, например повреждение данных или нарушение безопасности. Он наследуется от :exc:`PickleError`.

source: Note that other exceptions may also be raised during unpickling, including (but not necessarily limited to) AttributeError, EOFError, ImportError, and IndexError.
ru: Обратите внимание, что во время распаковки также могут быть вызваны другие исключения, включая (но не обязательно ограничиваясь ими) AttributeError, EOFError, ImportError и IndexError.

source: The :mod:`pickle` module exports three classes, :class:`Pickler`, :class:`Unpickler` and :class:`PickleBuffer`:
ru: Модуль :mod:`pickle` экспортирует три класса: :class:`Pickler`, :class:`Unpickler` и :class:`PickleBuffer`:

source: This takes a binary file for writing a pickle data stream.
ru: Для записи потока данных Pickle требуется двоичный файл.

source: The optional *protocol* argument, an integer, tells the pickler to use the given protocol; supported protocols are 0 to :data:`HIGHEST_PROTOCOL`. If not specified, the default is :data:`DEFAULT_PROTOCOL`. If a negative number is specified, :data:`HIGHEST_PROTOCOL` is selected.
ru: Необязательный аргумент *protocol*, целое число, сообщает сборщику использовать данный протокол; поддерживаемые протоколы от 0 до :data:`HIGHEST_PROTOCOL`. Если не указано, по умолчанию используется :data:`DEFAULT_PROTOCOL`. Если указано отрицательное число, выбирается :data:`HIGHEST_PROTOCOL`.

source: The *file* argument must have a write() method that accepts a single bytes argument. It can thus be an on-disk file opened for binary writing, an :class:`io.BytesIO` instance, or any other custom object that meets this interface.
ru: Аргумент *file* должен иметь метод write(), который принимает аргумент в один байт. Таким образом, это может быть файл на диске, открытый для двоичной записи, экземпляр :class:`io.BytesIO` или любой другой пользовательский объект, соответствующий этому интерфейсу.

source: If *fix_imports* is true and *protocol* is less than 3, pickle will try to map the new Python 3 names to the old module names used in Python 2, so that the pickle data stream is readable with Python 2.
ru: Если *fix_imports* имеет значение true и *protocol* меньше 3, Pickle попытается сопоставить новые имена Python 3 со старыми именами модулей, используемыми в Python 2, чтобы поток данных Pickle был доступен для чтения с помощью Python 2.

source: If *buffer_callback* is ``None`` (the default), buffer views are serialized into *file* as part of the pickle stream.
ru: Если *buffer_callback* имеет значение «None» (по умолчанию), представления буфера сериализуются в *file* как часть потока Pickle.

source: If *buffer_callback* is not ``None``, then it can be called any number of times with a buffer view. If the callback returns a false value (such as ``None``), the given buffer is :ref:`out-of-band <pickle-oob>`; otherwise the buffer is serialized in-band, i.e. inside the pickle stream.
ru: Если *buffer_callback* не равен None, то его можно вызывать любое количество раз с представлением буфера. Если обратный вызов возвращает ложное значение (например, None), данный буфер является :ref:`внеполосным <pickle-oob>`; в противном случае буфер сериализуется внутри полосы, т. е. внутри потока травления.
