Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/pickle.po
Languages: ru

source: Here is a trivial example where we implement a :class:`bytearray` subclass able to participate in out-of-band buffer pickling::
ru: Вот тривиальный пример, в котором мы реализуем подкласс :class:`bytearray`, способный участвовать во внеполосном травлении буфера:

source: The reconstructor (the ``_reconstruct`` class method) returns the buffer's providing object if it has the right type. This is an easy way to simulate zero-copy behaviour on this toy example.
ru: Реконструктор (метод класса ``_reconstruct``) возвращает объект, предоставляющий буфер, если он имеет правильный тип. Это простой способ смоделировать поведение нулевого копирования на этом игрушечном примере.

source: On the consumer side, we can pickle those objects the usual way, which when unserialized will give us a copy of the original object::
ru: На стороне потребителя мы можем выбрать эти объекты обычным способом, который при десериализации даст нам копию исходного объекта:

source: But if we pass a *buffer_callback* and then give back the accumulated buffers when unserializing, we are able to get back the original object::
ru: Но если мы передадим *buffer_callback*, а затем вернем накопленные буферы при десериализации, мы сможем вернуть исходный объект:

source: This example is limited by the fact that :class:`bytearray` allocates its own memory: you cannot create a :class:`bytearray` instance that is backed by another object's memory. However, third-party datatypes such as NumPy arrays do not have this limitation, and allow use of zero-copy pickling (or making as few copies as possible) when transferring between distinct processes or systems.
ru: Этот пример ограничен тем фактом, что :class:`bytearray` выделяет свою собственную память: вы не можете создать экземпляр :class:`bytearray`, который поддерживается памятью другого объекта. Однако сторонние типы данных, такие как массивы NumPy, не имеют этого ограничения и позволяют использовать травление с нулевым копированием (или создание как можно меньшего количества копий) при передаче между отдельными процессами или системами.

source: :pep:`574` -- Pickle protocol 5 with out-of-band data
ru: :pep:`574` -- Протокол Pickle 5 с внеполосными данными

source: Restricting Globals
ru: Ограничение глобальных переменных

source: By default, unpickling will import any class or function that it finds in the pickle data. For many applications, this behaviour is unacceptable as it permits the unpickler to import and invoke arbitrary code. Just consider what this hand-crafted pickle data stream does when loaded::
ru: По умолчанию распаковка импортирует любой класс или функцию, найденную в данных рассола. Для многих приложений такое поведение неприемлемо, поскольку оно позволяет сборщику импортировать и вызывать произвольный код. Просто подумайте, что делает этот созданный вручную поток данных Pickle при загрузке:

source: In this example, the unpickler imports the :func:`os.system` function and then apply the string argument "echo hello world". Although this example is inoffensive, it is not difficult to imagine one that could damage your system.
ru: В этом примере сборщик импортирует функцию :func:`os.system`, а затем применяет строковый аргумент «echo hello world». Хотя этот пример безобиден, нетрудно представить себе такой, который может повредить вашу систему.

source: For this reason, you may want to control what gets unpickled by customizing :meth:`Unpickler.find_class`. Unlike its name suggests, :meth:`Unpickler.find_class` is called whenever a global (i.e., a class or a function) is requested. Thus it is possible to either completely forbid globals or restrict them to a safe subset.
ru: По этой причине вы можете контролировать, что будет распаковываться, настроив :meth:`Unpickler.find_class`. В отличие от названия, :meth:`Unpickler.find_class` вызывается всякий раз, когда запрашивается глобальный объект (т. е. класс или функция). Таким образом, можно либо полностью запретить глобальные переменные, либо ограничить их безопасным подмножеством.

source: Here is an example of an unpickler allowing only few safe classes from the :mod:`builtins` module to be loaded::
ru: Вот пример распаковщика, позволяющего загружать только несколько безопасных классов из модуля :mod:`builtins`::

source: A sample usage of our unpickler working as intended::
ru: Пример использования нашего сборщика, работающего по назначению:

source: As our examples shows, you have to be careful with what you allow to be unpickled. Therefore if security is a concern, you may want to consider alternatives such as the marshalling API in :mod:`xmlrpc.client` or third-party solutions.
ru: Как показывают наши примеры, нужно быть осторожным с тем, что вы позволяете немариновать. Поэтому, если безопасность вызывает беспокойство, вы можете рассмотреть альтернативы, такие как API маршалинга в :mod:`xmlrpc.client` или сторонние решения.

source: Performance
ru: Производительность

source: Recent versions of the pickle protocol (from protocol 2 and upwards) feature efficient binary encodings for several common features and built-in types. Also, the :mod:`pickle` module has a transparent optimizer written in C.
ru: Последние версии протокола Pickle (начиная с протокола 2 и выше) обеспечивают эффективное двоичное кодирование для нескольких общих функций и встроенных типов. Также модуль :mod:`pickle` имеет прозрачный оптимизатор, написанный на C.

source: Examples
ru: Примеры

source: For the simplest code, use the :func:`dump` and :func:`load` functions. ::
ru: Для простейшего кода используйте функции :func:`dump` и :func:`load`. ::

source: The following example reads the resulting pickled data. ::
ru: В следующем примере считываются полученные маринованные данные. ::

source: Module :mod:`copyreg`
ru: Модуль :mod:`copyreg`

source: Pickle interface constructor registration for extension types.
ru: Регистрация конструктора интерфейса Pickle для типов расширений.

source: Module :mod:`pickletools`
ru: Модуль :mod:`pickletools`

source: Tools for working with and analyzing pickled data.
ru: Инструменты для работы и анализа маринованных данных.

source: Module :mod:`shelve`
ru: Модуль :mod:`shelve`

source: Indexed databases of objects; uses :mod:`pickle`.
ru: Индексированные базы данных объектов; использует :mod:`pickle`.

source: Module :mod:`copy`
ru: Модуль :mod:`copy`

source: Shallow and deep object copying.
ru: Мелкое и глубокое копирование объектов.

source: Module :mod:`marshal`
ru: Модуль :mod:`marshal`

source: High-performance serialization of built-in types.
ru: Высокопроизводительная сериализация встроенных типов.

source: Footnotes
ru: Сноски

source: Don't confuse this with the :mod:`marshal` module
ru: Не путайте это с модулем :mod:`marshal`.

source: This is why :keyword:`lambda` functions cannot be pickled: all :keyword:`!lambda` functions share the same name: ``<lambda>``.
ru: Вот почему функции :keyword:`lambda` не могут быть маринованы: все функции :keyword:`!lambda` имеют одно и то же имя: ``<lambda>``.

source: The exception raised will likely be an :exc:`ImportError` or an :exc:`AttributeError` but it could be something else.
ru: Вызванное исключение, скорее всего, будет :exc:`ImportError` или :exc:`AttributeError`, но это может быть и что-то другое.

source: The :mod:`copy` module uses this protocol for shallow and deep copying operations.
ru: Модуль :mod:`copy` использует этот протокол для операций поверхностного и глубокого копирования.

source: The limitation on alphanumeric characters is due to the fact that persistent IDs in protocol 0 are delimited by the newline character. Therefore if any kind of newline characters occurs in persistent IDs, the resulting pickled data will become unreadable.
ru: Ограничение на буквенно-цифровые символы связано с тем, что постоянные идентификаторы в протоколе 0 разделяются символом новой строки. Поэтому, если в постоянных идентификаторах встречаются какие-либо символы новой строки, полученные маринованные данные станут нечитаемыми.

source: objects
ru: объекты

source: External Data Representation
ru: Представление внешних данных

source: copy
ru: копировать

source: protocol
ru: протокол
