Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/pickle.po
Languages: ru

source: It is an error if *buffer_callback* is not ``None`` and *protocol* is ``None`` or smaller than 5.
ru: Это ошибка, если *buffer_callback* не равен None, а *protocol* равен None или меньше 5.

source: Write the pickled representation of *obj* to the open file object given in the constructor.
ru: Запишите маринованное представление *obj* в объект открытого файла, указанный в конструкторе.

source: Do nothing by default. This exists so a subclass can override it.
ru: По умолчанию ничего не делать. Это существует для того, чтобы подкласс мог его переопределить.

source: If :meth:`persistent_id` returns ``None``, *obj* is pickled as usual. Any other value causes :class:`Pickler` to emit the returned value as a persistent ID for *obj*. The meaning of this persistent ID should be defined by :meth:`Unpickler.persistent_load`. Note that the value returned by :meth:`persistent_id` cannot itself have a persistent ID.
ru: Если :meth:`persistent_id` возвращает ``None``, *obj* маринуется как обычно. Любое другое значение приводит к тому, что :class:`Pickler` выдает возвращаемое значение как постоянный идентификатор для *obj*. Значение этого постоянного идентификатора должно определяться :meth:`Unpickler.persistent_load`. Обратите внимание, что значение, возвращаемое :meth:`persistent_id`, само по себе не может иметь постоянный идентификатор.

source: See :ref:`pickle-persistent` for details and examples of uses.
ru: Подробности и примеры использования см. в разделе :ref:`pickle-persistent`.

source: Add the default implementation of this method in the C implementation of :class:`!Pickler`.
ru: Добавьте реализацию этого метода по умолчанию в реализацию C :class:`!Pickler`.

source: A pickler object's dispatch table is a registry of *reduction functions* of the kind which can be declared using :func:`copyreg.pickle`. It is a mapping whose keys are classes and whose values are reduction functions. A reduction function takes a single argument of the associated class and should conform to the same interface as a :meth:`~object.__reduce__` method.
ru: Таблица диспетчеризации объекта пиклера представляет собой реестр *функций сокращения* того типа, который можно объявить с помощью :func:`copyreg.pickle`. Это отображение, ключами которого являются классы, а значениями — функции редукции. Функция сокращения принимает один аргумент связанного класса и должна соответствовать тому же интерфейсу, что и метод :meth:`~object.__reduce__`.

source: By default, a pickler object will not have a :attr:`dispatch_table` attribute, and it will instead use the global dispatch table managed by the :mod:`copyreg` module. However, to customize the pickling for a specific pickler object one can set the :attr:`dispatch_table` attribute to a dict-like object. Alternatively, if a subclass of :class:`Pickler` has a :attr:`dispatch_table` attribute then this will be used as the default dispatch table for instances of that class.
ru: По умолчанию объект выбора не будет иметь атрибута :attr:`dispatch_table`, и вместо этого он будет использовать глобальную таблицу диспетчеризации, управляемую модулем :mod:`copyreg`. Однако, чтобы настроить травление для конкретного объекта пиклера, можно установить атрибут :attr:`dispatch_table` для объекта, похожего на dict. Альтернативно, если подкласс :class:`Pickler` имеет атрибут :attr:`dispatch_table`, то он будет использоваться в качестве таблицы отправки по умолчанию для экземпляров этого класса.

source: See :ref:`pickle-dispatch` for usage examples.
ru: См. примеры использования в :ref:`pickle-dispatch`.

source: Special reducer that can be defined in :class:`Pickler` subclasses. This method has priority over any reducer in the :attr:`dispatch_table`. It should conform to the same interface as a :meth:`~object.__reduce__` method, and can optionally return :data:`NotImplemented` to fallback on :attr:`dispatch_table`-registered reducers to pickle ``obj``.
ru: Специальный редуктор, который можно определить в подклассах :class:`Pickler`. Этот метод имеет приоритет над любым редуктором в таблице :attr:`dispatch_table`. Он должен соответствовать тому же интерфейсу, что и метод :meth:`~object.__reduce__`, и может опционально возвращать :data:`NotImplemented` для отката к зарегистрированным в :attr:`dispatch_table` редьюсерам для выбора ``obj``.

source: For a detailed example, see :ref:`reducer_override`.
ru: Подробный пример см. в разделе :ref:`reducer_override`.

source: Deprecated. Enable fast mode if set to a true value. The fast mode disables the usage of memo, therefore speeding the pickling process by not generating superfluous PUT opcodes. It should not be used with self-referential objects, doing otherwise will cause :class:`Pickler` to recurse infinitely.
ru: Устарело. Включите быстрый режим, если установлено истинное значение. Быстрый режим отключает использование memo, что ускоряет процесс травления за счет отсутствия генерации лишних кодов операций PUT. Его не следует использовать с самореферентными объектами, иначе это приведет к бесконечной рекурсии :class:`Pickler`.

source: Use :func:`pickletools.optimize` if you need more compact pickles.
ru: Используйте :func:`pickletools.optimize`, если вам нужны более компактные соленья.

source: This takes a binary file for reading a pickle data stream.
ru: Для чтения потока данных Pickle требуется двоичный файл.

source: The protocol version of the pickle is detected automatically, so no protocol argument is needed.
ru: Версия протокола рассола определяется автоматически, поэтому аргумент протокола не требуется.

source: The argument *file* must have three methods, a read() method that takes an integer argument, a readinto() method that takes a buffer argument and a readline() method that requires no arguments, as in the :class:`io.BufferedIOBase` interface. Thus *file* can be an on-disk file opened for binary reading, an :class:`io.BytesIO` object, or any other custom object that meets this interface.
ru: Аргумент *file* должен иметь три метода: метод read(), который принимает целочисленный аргумент, метод readinto(), который принимает аргумент буфера, и метод readline(), который не требует аргументов, как в :class:`io. Интерфейс .BufferedIOBase. Таким образом, *file* может быть файлом на диске, открытым для двоичного чтения, объектом :class:`io.BytesIO` или любым другим пользовательским объектом, который соответствует этому интерфейсу.

source: The optional arguments *fix_imports*, *encoding* and *errors* are used to control compatibility support for pickle stream generated by Python 2. If *fix_imports* is true, pickle will try to map the old Python 2 names to the new names used in Python 3. The *encoding* and *errors* tell pickle how to decode 8-bit string instances pickled by Python 2; these default to 'ASCII' and 'strict', respectively. The *encoding* can be 'bytes' to read these 8-bit string instances as bytes objects. Using ``encoding='latin1'`` is required for unpickling NumPy arrays and instances of :class:`~datetime.datetime`, :class:`~datetime.date` and :class:`~datetime.time` pickled by Python 2.
ru: Необязательные аргументы *fix_imports*, *encoding* и *errors* используются для управления поддержкой совместимости потока Pickle, сгенерированного Python 2. Если *fix_imports* имеет значение true, Pickle попытается сопоставить старые имена Python 2 с новыми используемыми именами. в Python 3. *encoding* и *errors* сообщают Pickle, как декодировать экземпляры 8-битных строк, обработанные Python 2; по умолчанию они имеют значения «ASCII» и «строгий» соответственно. *Кодировка* может быть «байтовой» для чтения этих экземпляров 8-битной строки как байтовых объектов. Использование ``encoding='latin1'`` необходимо для распаковки массивов NumPy и экземпляров :class:`~datetime.datetime`, :class:`~datetime.date` и :class:`~datetime.time`, маринованных Питон 2.

source: If *buffers* is ``None`` (the default), then all data necessary for deserialization must be contained in the pickle stream. This means that the *buffer_callback* argument was ``None`` when a :class:`Pickler` was instantiated (or when :func:`dump` or :func:`dumps` was called).
ru: Если *buffers* имеет значение None (по умолчанию), то все данные, необходимые для десериализации, должны содержаться в потоке Pickle. Это означает, что аргумент *buffer_callback* был ``None``, когда был создан экземпляр :class:`Pickler` (или когда был вызван :func:`dump` или :func:`dumps`).

source: If *buffers* is not ``None``, it should be an iterable of buffer-enabled objects that is consumed each time the pickle stream references an :ref:`out-of-band <pickle-oob>` buffer view. Such buffers have been given in order to the *buffer_callback* of a Pickler object.
ru: Если *buffers* не имеет значения None, это должна быть итерация объектов с включенным буфером, которая используется каждый раз, когда поток Pickle ссылается на представление буфера :ref:`out-of-band <pickle-oob>`. Такие буферы даны для *buffer_callback* объекта Pickler.

source: Read the pickled representation of an object from the open file object given in the constructor, and return the reconstituted object hierarchy specified therein. Bytes past the pickled representation of the object are ignored.
ru: Считайте маринованное представление объекта из объекта открытого файла, заданного в конструкторе, и верните указанную в нем восстановленную иерархию объектов. Байты после маринованного представления объекта игнорируются.

source: Raise an :exc:`UnpicklingError` by default.
ru: По умолчанию вызовите :exc:`UnpicklingError`.

source: If defined, :meth:`persistent_load` should return the object specified by the persistent ID *pid*. If an invalid persistent ID is encountered, an :exc:`UnpicklingError` should be raised.
ru: Если определено, :meth:`persistent_load` должен возвращать объект, указанный постоянным идентификатором *pid*. Если обнаружен неверный постоянный идентификатор, должно быть выдано :exc:`UnpicklingError`.

source: Add the default implementation of this method in the C implementation of :class:`!Unpickler`.
ru: Добавьте реализацию этого метода по умолчанию в реализацию C :class:`!Unpickler`.

source: Import *module* if necessary and return the object called *name* from it, where the *module* and *name* arguments are :class:`str` objects. Note, unlike its name suggests, :meth:`find_class` is also used for finding functions.
ru: Импортируйте *module*, если необходимо, и верните из него объект с именем *name*, где аргументы *module* и *name* являются объектами :class:`str`. Обратите внимание: в отличие от названия, :meth:`find_class` также используется для поиска функций.

source: Subclasses may override this to gain control over what type of objects and how they can be loaded, potentially reducing security risks. Refer to :ref:`pickle-restrict` for details.
ru: Подклассы могут переопределить это, чтобы получить контроль над тем, какие типы объектов и как они могут быть загружены, что потенциально снижает риски безопасности. Подробности см. в разделе :ref:`pickle-restrict`.

source: Raises an :ref:`auditing event <auditing>` ``pickle.find_class`` with arguments ``module``, ``name``.
ru: Вызывает событие аудита <auditing>` ``pickle.find_class`` с аргументами ``module``, ``name``.

source: A wrapper for a buffer representing picklable data. *buffer* must be a :ref:`buffer-providing <bufferobjects>` object, such as a :term:`bytes-like object` or a N-dimensional array.
ru: Обертка для буфера, представляющего поддающиеся выборке данные. *buffer* должен быть объектом <bufferobjects>, предоставляющим буфер, например :term:`bytes-like object` или N-мерным массивом.

source: :class:`PickleBuffer` is itself a buffer provider, therefore it is possible to pass it to other APIs expecting a buffer-providing object, such as :class:`memoryview`.
ru: :class:`PickleBuffer` сам по себе является поставщиком буфера, поэтому его можно передать другим API, ожидающим объект, предоставляющий буфер, например :class:`memoryview`.

source: :class:`PickleBuffer` objects can only be serialized using pickle protocol 5 or higher. They are eligible for :ref:`out-of-band serialization <pickle-oob>`.
ru: Объекты :class:`PickleBuffer` могут быть сериализованы только с использованием протокола Pickle 5 или выше. Они имеют право на внеполосную сериализацию <pickle-oob>`.

source: Return a :class:`memoryview` of the memory area underlying this buffer. The returned object is a one-dimensional, C-contiguous memoryview with format ``B`` (unsigned bytes). :exc:`BufferError` is raised if the buffer is neither C- nor Fortran-contiguous.
ru: Возвращает :class:`memoryview` области памяти, лежащей в основе этого буфера. Возвращаемый объект представляет собой одномерное C-непрерывное представление памяти в формате B (беззнаковые байты). :exc:`BufferError` возникает, если буфер не является смежным ни с C, ни с Fortran.

source: Release the underlying buffer exposed by the PickleBuffer object.
ru: Освободите базовый буфер, предоставленный объектом PickleBuffer.

source: What can be pickled and unpickled?
ru: Что можно мариновать и немариновать?

source: The following types can be pickled:
ru: Можно мариновать следующие виды:

source: built-in constants (``None``, ``True``, ``False``, ``Ellipsis``, and :data:`NotImplemented`);
ru: встроенные константы (``None``, ``True``, ``False``, ``Многоточие`` и :data:`NotImplemented``);

source: integers, floating-point numbers, complex numbers;
ru: целые числа, числа с плавающей запятой, комплексные числа;

source: strings, bytes, bytearrays;
ru: строки, байты, массивы байтов;

source: tuples, lists, sets, and dictionaries containing only picklable objects;
ru: кортежи, списки, наборы и словари, содержащие только поддающиеся выборке объекты;

source: functions (built-in and user-defined) accessible from the top level of a module (using :keyword:`def`, not :keyword:`lambda`);
ru: функции (встроенные и определяемые пользователем), доступные с верхнего уровня модуля (с использованием :keyword:`def`, а не :keyword:`lambda`);

source: classes accessible from the top level of a module;
ru: классы, доступные с верхнего уровня модуля;

source: instances of such classes whose the result of calling :meth:`~object.__getstate__` is picklable (see section :ref:`pickle-inst` for details).
ru: экземпляры таких классов, результат вызова :meth:`~object.__getstate__` можно выбрать (подробности см. в разделе :ref:`pickle-inst`).

source: Attempts to pickle unpicklable objects will raise the :exc:`PicklingError` exception; when this happens, an unspecified number of bytes may have already been written to the underlying file. Trying to pickle a highly recursive data structure may exceed the maximum recursion depth, a :exc:`RecursionError` will be raised in this case. You can carefully raise this limit with :func:`sys.setrecursionlimit`.
ru: Попытки мариновать неконфигурируемые объекты вызовут исключение :exc:`PicklingError`; когда это происходит, неопределенное количество байтов может быть уже записано в базовый файл. Попытка выбрать высокорекурсивную структуру данных может превысить максимальную глубину рекурсии, в этом случае будет выдано сообщение :exc:`RecursionError`. Вы можете осторожно увеличить этот предел с помощью :func:`sys.setrecursionlimit`.

source: Note that functions (built-in and user-defined) are pickled by fully :term:`qualified name`, not by value. [#]_ This means that only the function name is pickled, along with the name of the containing module and classes. Neither the function's code, nor any of its function attributes are pickled. Thus the defining module must be importable in the unpickling environment, and the module must contain the named object, otherwise an exception will be raised. [#]_
ru: Обратите внимание, что функции (встроенные и определяемые пользователем) выбираются по полному имени, а не по значению. [#]_ Это означает, что маринуется только имя функции, а также имя содержащего ее модуля и классов. Ни код функции, ни какой-либо из ее атрибутов функции не маринуются. Таким образом, определяющий модуль должен быть доступен для импорта в среду распаковки, и модуль должен содержать именованный объект, в противном случае будет возбуждено исключение. [#]_

source: Similarly, classes are pickled by fully qualified name, so the same restrictions in the unpickling environment apply. Note that none of the class's code or data is pickled, so in the following example the class attribute ``attr`` is not restored in the unpickling environment::
ru: Аналогично, классы маринуются по полному имени, поэтому в среде распаковки применяются те же ограничения. Обратите внимание, что ни один код или данные класса не маринуются, поэтому в следующем примере атрибут класса attr не восстанавливается в среде распаковки:

source: These restrictions are why picklable functions and classes must be defined at the top level of a module.
ru: Эти ограничения объясняют, почему поддающиеся выбору функции и классы должны определяться на верхнем уровне модуля.

source: Similarly, when class instances are pickled, their class's code and data are not pickled along with them. Only the instance data are pickled. This is done on purpose, so you can fix bugs in a class or add methods to the class and still load objects that were created with an earlier version of the class. If you plan to have long-lived objects that will see many versions of a class, it may be worthwhile to put a version number in the objects so that suitable conversions can be made by the class's :meth:`~object.__setstate__` method.
ru: Аналогичным образом, когда экземпляры класса маринуются, код и данные их класса не маринуются вместе с ними. Маринуются только данные экземпляра. Это сделано специально, чтобы вы могли исправлять ошибки в классе или добавлять в класс методы и при этом загружать объекты, созданные с помощью более ранней версии класса. Если вы планируете иметь долгоживущие объекты, которые будут видеть множество версий класса, возможно, стоит поместить в объекты номер версии, чтобы можно было выполнить подходящие преобразования с помощью метода :meth:`~object.__setstate__` класса. .

source: Pickling Class Instances
ru: Экземпляры классов травления

source: In this section, we describe the general mechanisms available to you to define, customize, and control how class instances are pickled and unpickled.
ru: В этом разделе мы описываем общие механизмы, доступные вам для определения, настройки и управления способом консервирования и расконсервации экземпляров классов.

source: In most cases, no additional code is needed to make instances picklable. By default, pickle will retrieve the class and the attributes of an instance via introspection. When a class instance is unpickled, its :meth:`~object.__init__` method is usually *not* invoked. The default behaviour first creates an uninitialized instance and then restores the saved attributes. The following code shows an implementation of this behaviour::
ru: В большинстве случаев для возможности выбора экземпляров не требуется никакого дополнительного кода. По умолчанию Pickle извлекает класс и атрибуты экземпляра посредством самоанализа. Когда экземпляр класса не маринован, его метод :meth:`~object.__init__` обычно *не* вызывается. Поведение по умолчанию сначала создает неинициализированный экземпляр, а затем восстанавливает сохраненные атрибуты. Следующий код демонстрирует реализацию этого поведения:

source: Classes can alter the default behaviour by providing one or several special methods:
ru: Классы могут изменять поведение по умолчанию, предоставляя один или несколько специальных методов:

source: In protocols 2 and newer, classes that implements the :meth:`__getnewargs_ex__` method can dictate the values passed to the :meth:`__new__` method upon unpickling. The method must return a pair ``(args, kwargs)`` where *args* is a tuple of positional arguments and *kwargs* a dictionary of named arguments for constructing the object. Those will be passed to the :meth:`__new__` method upon unpickling.
ru: В протоколах 2 и новее классы, реализующие метод :meth:`__getnewargs_ex__`, могут определять значения, передаваемые методу :meth:`__new__` при распаковке. Метод должен возвращать пару ``(args, kwargs)``, где *args* — это кортеж позиционных аргументов, а *kwargs* — словарь именованных аргументов для построения объекта. Они будут переданы методу :meth:`__new__` при распаковке.

source: You should implement this method if the :meth:`__new__` method of your class requires keyword-only arguments. Otherwise, it is recommended for compatibility to implement :meth:`__getnewargs__`.
ru: Вам следует реализовать этот метод, если метод :meth:`__new__` вашего класса требует аргументов, содержащих только ключевые слова. В противном случае для совместимости рекомендуется реализовать :meth:`__getnewargs__`.

source: :meth:`__getnewargs_ex__` is now used in protocols 2 and 3.
ru: :meth:`__getnewargs_ex__` теперь используется в протоколах 2 и 3.

source: This method serves a similar purpose as :meth:`__getnewargs_ex__`, but supports only positional arguments. It must return a tuple of arguments ``args`` which will be passed to the :meth:`__new__` method upon unpickling.
ru: Этот метод служит той же цели, что и :meth:`__getnewargs_ex__`, но поддерживает только позиционные аргументы. Он должен вернуть кортеж аргументов ``args``, который будет передан методу :meth:`__new__` при распаковке.

source: :meth:`__getnewargs__` will not be called if :meth:`__getnewargs_ex__` is defined.
ru: :meth:`__getnewargs__` не будет вызываться, если :meth:`__getnewargs_ex__` определен.

source: Before Python 3.6, :meth:`__getnewargs__` was called instead of :meth:`__getnewargs_ex__` in protocols 2 and 3.
ru: До Python 3.6 вместо :meth:`__getnewargs_ex__` в протоколах 2 и 3 вызывался :meth:`__getnewargs__`.

source: Classes can further influence how their instances are pickled by overriding the method :meth:`__getstate__`. It is called and the returned object is pickled as the contents for the instance, instead of a default state. There are several cases:
ru: Классы могут дополнительно влиять на то, как их экземпляры обрабатываются, переопределяя метод :meth:`__getstate__`. Он вызывается, и возвращаемый объект маринуется как содержимое экземпляра, а не как состояние по умолчанию. Есть несколько случаев:

source: For a class that has no instance :attr:`~object.__dict__` and no :attr:`~object.__slots__`, the default state is ``None``.
ru: Для класса, у которого нет экземпляра :attr:`~object.__dict__` и :attr:`~object.__slots__`, состоянием по умолчанию является ``None``.

source: For a class that has an instance :attr:`~object.__dict__` and no :attr:`~object.__slots__`, the default state is ``self.__dict__``.
ru: Для класса, у которого есть экземпляр :attr:`~object.__dict__` и нет :attr:`~object.__slots__`, состоянием по умолчанию является ``self.__dict__``.

source: For a class that has an instance :attr:`~object.__dict__` and :attr:`~object.__slots__`, the default state is a tuple consisting of two dictionaries: ``self.__dict__``, and a dictionary mapping slot names to slot values. Only slots that have a value are included in the latter.
ru: Для класса, имеющего экземпляры :attr:`~object.__dict__` и :attr:`~object.__slots__`, состоянием по умолчанию является кортеж, состоящий из двух словарей: ``self.__dict__`` и сопоставления словаря. имена слотов в значения слотов. В последний включены только слоты, имеющие значение.
