Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/platform.po
Languages: ru

source: :mod:`!platform` --- Access to underlying platform's identifying data
ru: :mod:`!platform` --- Доступ к идентификационным данным базовой платформы.

source: **Source code:** :source:`Lib/platform.py`
ru: **Исходный код:** :source:`Lib/platform.py`

source: Specific platforms listed alphabetically, with Linux included in the Unix section.
ru: Конкретные платформы перечислены в алфавитном порядке, при этом Linux включен в раздел Unix.

source: Cross Platform
ru: Кросс-платформенный

source: Queries the given executable (defaults to the Python interpreter binary) for various architecture information.
ru: Запрашивает заданный исполняемый файл (по умолчанию двоичный файл интерпретатора Python) для получения различной информации об архитектуре.

source: Returns a tuple ``(bits, linkage)`` which contain information about the bit architecture and the linkage format used for the executable. Both values are returned as strings.
ru: Возвращает кортеж ``(bits, linkage)``, который содержит информацию о битовой архитектуре и формате связи, используемом для исполняемого файла. Оба значения возвращаются в виде строк.

source: Values that cannot be determined are returned as given by the parameter presets. If bits is given as ``''``, the ``sizeof(pointer)`` (or ``sizeof(long)`` on Python version < 1.5.2) is used as indicator for the supported pointer size.
ru: Значения, которые невозможно определить, возвращаются в соответствии с предустановками параметров. Если биты заданы как ``''``, ``sizeof(pointer)`` (или ``sizeof(long)`` в версии Python < 1.5.2) используется в качестве индикатора поддерживаемого размера указателя.

source: The function relies on the system's :file:`file` command to do the actual work. This is available on most if not all Unix platforms and some non-Unix platforms and then only if the executable points to the Python interpreter. Reasonable defaults are used when the above needs are not met.
ru: Фактическая работа функции зависит от системной команды :file:`file`. Это доступно на большинстве, если не на всех, платформах Unix и некоторых платформах, отличных от Unix, и то только в том случае, если исполняемый файл указывает на интерпретатор Python. Разумные значения по умолчанию используются, когда вышеуказанные потребности не удовлетворяются.

source: On macOS (and perhaps other platforms), executable files may be universal files containing multiple architectures.
ru: В macOS (и, возможно, на других платформах) исполняемые файлы могут быть универсальными файлами, содержащими несколько архитектур.

source: To get at the "64-bitness" of the current interpreter, it is more reliable to query the :data:`sys.maxsize` attribute::
ru: Чтобы получить «64-битность» текущего интерпретатора, более надежно запросить атрибут :data:`sys.maxsize`::

source: Returns the machine type, e.g. ``'AMD64'``. An empty string is returned if the value cannot be determined.
ru: Возвращает тип машины, например ``'AMD64'``. Пустая строка возвращается, если значение невозможно определить.

source: Returns the computer's network name (may not be fully qualified!). An empty string is returned if the value cannot be determined.
ru: Возвращает сетевое имя компьютера (может быть неполным!). Пустая строка возвращается, если значение невозможно определить.

source: Returns a single string identifying the underlying platform with as much useful information as possible.
ru: Возвращает одну строку, идентифицирующую базовую платформу и содержащую как можно больше полезной информации.

source: The output is intended to be *human readable* rather than machine parseable. It may look different on different platforms and this is intended.
ru: Вывод должен быть *читабельным* для человека, а не машинным анализом. На разных платформах он может выглядеть по-разному, и это так и задумано.

source: If *aliased* is true, the function will use aliases for various platforms that report system names which differ from their common names, for example SunOS will be reported as Solaris. The :func:`system_alias` function is used to implement this.
ru: Если *aliased* имеет значение true, функция будет использовать псевдонимы для различных платформ, которые сообщают имена систем, которые отличаются от их обычных имен, например, SunOS будет сообщаться как Solaris. Для реализации этого используется функция :func:`system_alias`.

source: Setting *terse* to true causes the function to return only the absolute minimum information needed to identify the platform.
ru: Если для параметра *terse* установлено значение true, функция будет возвращать только абсолютный минимум информации, необходимой для идентификации платформы.

source: On macOS, the function now uses :func:`mac_ver`, if it returns a non-empty release string, to get the macOS version rather than the darwin version.
ru: В macOS функция теперь использует :func:`mac_ver`, если она возвращает непустую строку выпуска, чтобы получить версию macOS, а не версию darwin.

source: Returns the (real) processor name, e.g. ``'amdk6'``.
ru: Возвращает (реальное) имя процессора, например, ``'amdk6'``.

source: An empty string is returned if the value cannot be determined. Note that many platforms do not provide this information or simply return the same value as for :func:`machine`. NetBSD does this.
ru: Пустая строка возвращается, если значение невозможно определить. Обратите внимание, что многие платформы не предоставляют эту информацию или просто возвращают то же значение, что и для :func:`machine`. NetBSD делает это.

source: Returns a tuple ``(buildno, builddate)`` stating the Python build number and date as strings.
ru: Возвращает кортеж ``(buildno, builddate)``, указывающий номер и дату сборки Python в виде строк.

source: Returns a string identifying the compiler used for compiling Python.
ru: Возвращает строку, идентифицирующую компилятор, использованный для компиляции Python.

source: Returns a string identifying the Python implementation SCM branch.
ru: Возвращает строку, идентифицирующую ветвь SCM реализации Python.

source: Returns a string identifying the Python implementation. Possible return values are: 'CPython', 'IronPython', 'Jython', 'PyPy'.
ru: Возвращает строку, идентифицирующую реализацию Python. Возможные возвращаемые значения: «CPython», «IronPython», «Jython», «PyPy».

source: Returns a string identifying the Python implementation SCM revision.
ru: Возвращает строку, идентифицирующую версию SCM реализации Python.

source: Returns the Python version as string ``'major.minor.patchlevel'``.
ru: Возвращает версию Python в виде строки ``'major.minor.patchlevel'``.

source: Note that unlike the Python ``sys.version``, the returned value will always include the patchlevel (it defaults to 0).
ru: Обратите внимание, что в отличие от ``sys.version`` Python, возвращаемое значение всегда будет включать уровень исправления (по умолчанию оно равно 0).

source: Returns the Python version as tuple ``(major, minor, patchlevel)`` of strings.
ru: Возвращает версию Python в виде кортежа строк ``(основной, дополнительный, уровень исправлений)``.

source: Note that unlike the Python ``sys.version``, the returned value will always include the patchlevel (it defaults to ``'0'``).
ru: Обратите внимание, что в отличие от Python ``sys.version``, возвращаемое значение всегда будет включать уровень исправления (по умолчанию оно равно ``'0'``).

source: Returns the system's release, e.g. ``'2.2.0'`` or ``'NT'``. An empty string is returned if the value cannot be determined.
ru: Возвращает версию системы, например ``'2.2.0'`` или ``'NT'``. Пустая строка возвращается, если значение невозможно определить.

source: Returns the system/OS name, such as ``'Linux'``, ``'Darwin'``, ``'Java'``, ``'Windows'``. An empty string is returned if the value cannot be determined.
ru: Возвращает имя системы/ОС, например ``'Linux'``, ``'Darwin'``, ``'Java'``, ``'Windows'``. Пустая строка возвращается, если значение невозможно определить.

source: On iOS and Android, this returns the user-facing OS name (i.e, ``'iOS``, ``'iPadOS'`` or ``'Android'``). To obtain the kernel name (``'Darwin'`` or ``'Linux'``), use :func:`os.uname`.
ru: В iOS и Android возвращается имя операционной системы, обращенной к пользователю (т. е. «iOS», «iPadOS» или «Android»). Чтобы получить имя ядра («Darwin» или «Linux»), используйте :func:`os.uname`.

source: Returns ``(system, release, version)`` aliased to common marketing names used for some systems. It also does some reordering of the information in some cases where it would otherwise cause confusion.
ru: Возвращает ``(system, Release, Version)``, аналогичный общепринятым маркетинговым названиям, используемым для некоторых систем. Он также выполняет некоторое изменение порядка информации в некоторых случаях, когда в противном случае это могло бы вызвать путаницу.

source: Returns the system's release version, e.g. ``'#3 on degas'``. An empty string is returned if the value cannot be determined.
ru: Возвращает версию выпуска системы, например ``'#3 при дегазации'``. Пустая строка возвращается, если значение невозможно определить.

source: On iOS and Android, this is the user-facing OS version. To obtain the Darwin or Linux kernel version, use :func:`os.uname`.
ru: В iOS и Android это версия ОС, ориентированная на пользователя. Чтобы получить версию ядра Darwin или Linux, используйте :func:`os.uname`.

source: Fairly portable uname interface. Returns a :func:`~collections.namedtuple` containing six attributes: :attr:`system`, :attr:`node`, :attr:`release`, :attr:`version`, :attr:`machine`, and :attr:`processor`.
ru: Довольно портативный интерфейс uname. Возвращает :func:`~collections.namedtuple`, содержащий шесть атрибутов: :attr:`system`, :attr:`node`, :attr:`release`, :attr:`version`, :attr:`machine`, и :attr:`процессор`.

source: :attr:`processor` is resolved late, on demand.
ru: :attr:`processor` разрешается поздно, по требованию.

source: Note: the first two attribute names differ from the names presented by :func:`os.uname`, where they are named :attr:`sysname` and :attr:`nodename`.
ru: Примечание: имена первых двух атрибутов отличаются от имен, представленных :func:`os.uname`, где они называются :attr:`sysname` и :attr:`nodename`.

source: Entries which cannot be determined are set to ``''``.
ru: Записи, которые невозможно определить, устанавливаются в ``''``.

source: Result changed from a tuple to a :func:`~collections.namedtuple`.
ru: Результат изменен с кортежа на :func:`~collections.namedtuple`.

source: :attr:`processor` is resolved late instead of immediately.
ru: :attr:`processor` разрешается поздно, а не сразу.

source: Java Platform
ru: Платформа Java

source: Version interface for Jython.
ru: Интерфейс версии для Jython.

source: Returns a tuple ``(release, vendor, vminfo, osinfo)`` with *vminfo* being a tuple ``(vm_name, vm_release, vm_vendor)`` and *osinfo* being a tuple ``(os_name, os_version, os_arch)``. Values which cannot be determined are set to the defaults given as parameters (which all default to ``''``).
ru: Возвращает кортеж ``(release,vendor,vminfo,osinfo)``, где *vminfo* является кортежем ``(vm_name, vm_release, vm_vendor)`` и *osinfo* является кортежем ``(os_name, os_version, os_arch) ``. Значениям, которые невозможно определить, присваиваются значения по умолчанию, заданные в качестве параметров (которые по умолчанию равны ``''``).

source: It was largely untested, had a confusing API, and was only useful for Jython support.
ru: Он практически не тестировался, имел запутанный API и был полезен только для поддержки Jython.

source: Windows Platform
ru: Платформа Windows

source: Get additional version information from the Windows Registry and return a tuple ``(release, version, csd, ptype)`` referring to OS release, version number, CSD level (service pack) and OS type (multi/single processor). Values which cannot be determined are set to the defaults given as parameters (which all default to an empty string).
ru: Получите дополнительную информацию о версии из реестра Windows и верните кортеж ``(release, version, csd, ptype)``, относящийся к выпуску ОС, номеру версии, уровню CSD (пакет обновления) и типу ОС (много/одиночный процессор). Значениям, которые невозможно определить, присваиваются значения по умолчанию, заданные в качестве параметров (которые по умолчанию представляют собой пустую строку).

source: As a hint: *ptype* is ``'Uniprocessor Free'`` on single processor NT machines and ``'Multiprocessor Free'`` on multi processor machines. The ``'Free'`` refers to the OS version being free of debugging code. It could also state ``'Checked'`` which means the OS version uses debugging code, i.e. code that checks arguments, ranges, etc.
ru: Подсказка: *ptype* — это ``'Uniprocessor Free'`` на однопроцессорных машинах NT и ``'Multiprocessor Free'`` на многопроцессорных машинах. «Бесплатно» относится к версии ОС, свободной от отладочного кода. Также может быть указано «Проверено», что означает, что версия ОС использует код отладки, т. е. код, который проверяет аргументы, диапазоны и т. д.

source: Returns a string representing the current Windows edition, or ``None`` if the value cannot be determined. Possible values include but are not limited to ``'Enterprise'``, ``'IoTUAP'``, ``'ServerStandard'``, and ``'nanoserver'``.
ru: Возвращает строку, представляющую текущую версию Windows, или None, если значение невозможно определить. Возможные значения включают, помимо прочего, ``'Enterprise'``, ``'IoTUAP'``, ``'ServerStandard'`` и ``'nanoserver'``.

source: Return ``True`` if the Windows edition returned by :func:`win32_edition` is recognized as an IoT edition.
ru: Возвращайте True, если редакция Windows, возвращаемая :func:`win32_edition`, распознается как редакция IoT.

source: macOS Platform
ru: Платформа macOS

source: Get macOS version information and return it as tuple ``(release, versioninfo, machine)`` with *versioninfo* being a tuple ``(version, dev_stage, non_release_version)``.
ru: Получите информацию о версии macOS и верните ее в виде кортежа ``(release, versioninfo, Machine)``, где *versioninfo* является кортежем ``(version, dev_stage, non_release_version)``.

source: Entries which cannot be determined are set to ``''``. All tuple entries are strings.
ru: Записи, которые невозможно определить, устанавливаются в ``''``. Все записи кортежа являются строками.

source: iOS Platform
ru: Платформа iOS

source: Get iOS version information and return it as a :func:`~collections.namedtuple` with the following attributes:
ru: Получите информацию о версии iOS и верните ее как :func:`~collections.namedtuple` со следующими атрибутами:

source: ``system`` is the OS name; either ``'iOS'`` or ``'iPadOS'``.
ru: ``system`` — имя ОС; либо ``'iOS'``, либо ``'iPadOS'``.

source: ``release`` is the iOS version number as a string (e.g., ``'17.2'``).
ru: ``release`` — это номер версии iOS в виде строки (например, ``'17.2'``).

source: ``model`` is the device model identifier; this will be a string like ``'iPhone13,2'`` for a physical device, or ``'iPhone'`` on a simulator.
ru: ``model`` — идентификатор модели устройства; это будет строка типа «iPhone13,2» для физического устройства или «iPhone» на симуляторе.

source: ``is_simulator`` is a boolean describing if the app is running on a simulator or a physical device.
ru: ``is_simulator`` — это логическое значение, описывающее, работает ли приложение на симуляторе или на физическом устройстве.

source: Entries which cannot be determined are set to the defaults given as parameters.
ru: Для записей, которые невозможно определить, устанавливаются значения по умолчанию, заданные в качестве параметров.

source: Unix Platforms
ru: Unix Платформы

source: Tries to determine the libc version against which the file executable (defaults to the Python interpreter) is linked. Returns a tuple of strings ``(lib, version)`` which default to the given parameters in case the lookup fails.
ru: Пытается определить версию libc, с которой связан исполняемый файл (по умолчанию — интерпретатор Python). Возвращает кортеж строк ``(lib, version)``, которые по умолчанию соответствуют заданным параметрам в случае неудачного поиска.

source: Note that this function has intimate knowledge of how different libc versions add symbols to the executable is probably only usable for executables compiled using :program:`gcc`.
ru: Обратите внимание, что эта функция хорошо знает, как разные версии libc добавляют символы в исполняемый файл. Вероятно, ее можно использовать только для исполняемых файлов, скомпилированных с использованием :program:`gcc`.

source: The file is read and scanned in chunks of *chunksize* bytes.
ru: Файл читается и сканируется частями размером *chunksize* байт.

source: Linux Platforms
ru: Linux-платформы

source: Get operating system identification from ``os-release`` file and return it as a dict. The ``os-release`` file is a `freedesktop.org standard <https://www.freedesktop.org/software/systemd/man/os-release.html>`_ and is available in most Linux distributions. A noticeable exception is Android and Android-based distributions.
ru: Получите идентификатор операционной системы из файла ``os-release`` и верните его как dict. Файл ``os-release`` является стандартом ``freedesktop.org <https://www.freedesktop.org/software/systemd/man/os-release.html>`_ и доступен в большинстве дистрибутивов Linux. Заметным исключением являются Android и дистрибутивы на базе Android.

source: Raises :exc:`OSError` or subclass when neither ``/etc/os-release`` nor ``/usr/lib/os-release`` can be read.
ru: Вызывает :exc:`OSError` или подкласс, когда ни ``/etc/os-release``, ни ``/usr/lib/os-release`` не могут быть прочитаны.

source: On success, the function returns a dictionary where keys and values are strings. Values have their special characters like ``"`` and ``$`` unquoted. The fields ``NAME``, ``ID``, and ``PRETTY_NAME`` are always defined according to the standard. All other fields are optional. Vendors may include additional fields.
ru: В случае успеха функция возвращает словарь, в котором ключи и значения являются строками. Значения имеют специальные символы, такие как ``"`` и ``$`` без кавычек. Поля ``NAME``, ``ID`` и ``PRETTY_NAME`` всегда определяются в соответствии со стандартом. Все остальные поля Поставщики могут включать дополнительные поля.

source: Note that fields like ``NAME``, ``VERSION``, and ``VARIANT`` are strings suitable for presentation to users. Programs should use fields like ``ID``, ``ID_LIKE``, ``VERSION_ID``, or ``VARIANT_ID`` to identify Linux distributions.
ru: Обратите внимание, что такие поля, как «ИМЯ», «ВЕРСИЯ» и «ВАРИАНТ», представляют собой строки, подходящие для представления пользователям. Программы должны использовать такие поля, как ``ID``, ``ID_LIKE``, ``VERSION_ID`` или ``VARIANT_ID`` для идентификации дистрибутивов Linux.

source: Example::
ru: Пример::

source: Android Platform
ru: Платформа Android

source: Get Android device information. Returns a :func:`~collections.namedtuple` with the following attributes. Values which cannot be determined are set to the defaults given as parameters.
ru: Получите информацию об устройстве Android. Возвращает :func:`~collections.namedtuple` со следующими атрибутами. Для значений, которые невозможно определить, устанавливаются значения по умолчанию, заданные в качестве параметров.

source: ``release`` - Android version, as a string (e.g. ``"14"``).
ru: ``release`` - версия Android, в виде строки (например, ``"14"``).

source: ``api_level`` - API level of the running device, as an integer (e.g. ``34`` for Android 14). To get the API level which Python was built against, see :func:`sys.getandroidapilevel`.
ru: ``api_level`` — уровень API работающего устройства в виде целого числа (например, ``34`` для Android 14). Чтобы узнать уровень API, на котором был построен Python, см. :func:`sys.getandroidapilevel`.

source: ``manufacturer`` - `Manufacturer name <https://developer.android.com/reference/android/os/Build#MANUFACTURER>`__.
ru: ``производитель`` - `Название производителя <https://developer.android.com/reference/android/os/Build#MANUFACTURER>`__.

source: ``model`` - `Model name <https://developer.android.com/reference/android/os/Build#MODEL>`__ – typically the marketing name or model number.
ru: ``model`` – `Название модели <https://developer.android.com/reference/android/os/Build#MODEL>`__ — обычно маркетинговое название или номер модели.

source: ``device`` - `Device name <https://developer.android.com/reference/android/os/Build#DEVICE>`__ – typically the model number or a codename.
ru: ``device`` — `Имя устройства <https://developer.android.com/reference/android/os/Build#DEVICE>`__ — обычно номер модели или кодовое имя.

source: ``is_emulator`` - ``True`` if the device is an emulator; ``False`` if it's a physical device.
ru: ``is_emulator`` - ``True``, если устройство является эмулятором; ``False``, если это физическое устройство.

source: Google maintains a `list of known model and device names <https://storage.googleapis.com/play_public/supported_devices.html>`__.
ru: Google ведет `список известных моделей и названий устройств <https://storage.googleapis.com/play_public/supported_devices.html>`__.
