Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/poplib.po
Languages: ru

source: :mod:`!poplib` --- POP3 protocol client
ru: :mod:`!poplib` --- Клиент протокола POP3

source: **Source code:** :source:`Lib/poplib.py`
ru: **Исходный код:** :source:`Lib/poplib.py`

source: This module defines a class, :class:`POP3`, which encapsulates a connection to a POP3 server and implements the protocol as defined in :rfc:`1939`. The :class:`POP3` class supports both the minimal and optional command sets from :rfc:`1939`. The :class:`POP3` class also supports the ``STLS`` command introduced in :rfc:`2595` to enable encrypted communication on an already established connection.
ru: Этот модуль определяет класс :class:`POP3`, который инкапсулирует соединение с POP3-сервером и реализует протокол, определенный в :rfc:`1939`. Класс :class:`POP3` поддерживает как минимальный, так и дополнительный набор команд из :rfc:`1939`. Класс :class:`POP3` также поддерживает команду ``STLS``, представленную в :rfc:`2595`, для включения зашифрованной связи по уже установленному соединению.

source: Additionally, this module provides a class :class:`POP3_SSL`, which provides support for connecting to POP3 servers that use SSL as an underlying protocol layer.
ru: Кроме того, этот модуль предоставляет класс :class:`POP3_SSL`, который обеспечивает поддержку подключения к серверам POP3, использующим SSL в качестве базового уровня протокола.

source: Note that POP3, though widely supported, is obsolescent. The implementation quality of POP3 servers varies widely, and too many are quite poor. If your mailserver supports IMAP, you would be better off using the :class:`imaplib.IMAP4` class, as IMAP servers tend to be better implemented.
ru: Обратите внимание, что POP3, хотя и широко поддерживается, устарел. Качество реализации POP3-серверов сильно различается, и многие из них весьма низки. Если ваш почтовый сервер поддерживает IMAP, вам лучше использовать класс :class:`imaplib.IMAP4`, поскольку серверы IMAP, как правило, лучше реализованы.

source: Availability
ru: Доступность

source: This module does not work or is not available on WebAssembly. See :ref:`wasm-availability` for more information.
ru: Этот модуль не работает или недоступен в WebAssembly. См. :ref:`wasm-availability` для получения дополнительной информации.

source: The :mod:`poplib` module provides two classes:
ru: Модуль :mod:`poplib` предоставляет два класса:

source: This class implements the actual POP3 protocol. The connection is created when the instance is initialized. If *port* is omitted, the standard POP3 port (110) is used. The optional *timeout* parameter specifies a timeout in seconds for the connection attempt (if not specified, the global default timeout setting will be used).
ru: Этот класс реализует настоящий протокол POP3. Соединение создается при инициализации экземпляра. Если *port* опущен, используется стандартный порт POP3 (110). Необязательный параметр *timeout* указывает тайм-аут в секундах для попытки подключения (если он не указан, будет использоваться глобальная настройка тайм-аута по умолчанию).

source: Raises an :ref:`auditing event <auditing>` ``poplib.connect`` with arguments ``self``, ``host``, ``port``.
ru: Вызывает :ref:`событие аудита <auditing>``poplib.connect`` с аргументами ``self``, ``host``, ``port``.

source: All commands will raise an :ref:`auditing event <auditing>` ``poplib.putline`` with arguments ``self`` and ``line``, where ``line`` is the bytes about to be sent to the remote host.
ru: Все команды вызывают событие аудита <auditing>``poplib.putline`` с аргументами ``self`` и ``line``, где ``line`` — это байты, которые будут отправлены в удаленный хост.

source: If the *timeout* parameter is set to be zero, it will raise a :class:`ValueError` to prevent the creation of a non-blocking socket.
ru: Если параметр *timeout* установлен в нулевое значение, он вызовет :class:`ValueError`, чтобы предотвратить создание неблокирующего сокета.

source: This is a subclass of :class:`POP3` that connects to the server over an SSL encrypted socket. If *port* is not specified, 995, the standard POP3-over-SSL port is used. *timeout* works as in the :class:`POP3` constructor. *context* is an optional :class:`ssl.SSLContext` object which allows bundling SSL configuration options, certificates and private keys into a single (potentially long-lived) structure. Please read :ref:`ssl-security` for best practices.
ru: Это подкласс :class:`POP3`, который подключается к серверу через зашифрованный SSL-сокет. Если *порт* не указан, 995, используется стандартный порт POP3-over-SSL. *timeout* работает как в конструкторе :class:`POP3`. *context* — это необязательный объект :class:`ssl.SSLContext`, который позволяет объединять параметры конфигурации SSL, сертификаты и закрытые ключи в единую (потенциально долгоживущую) структуру. Пожалуйста, прочтите :ref:`ssl-security` для получения лучших практик.

source: *context* parameter added.
ru: добавлен параметр *context*.

source: The class now supports hostname check with :attr:`ssl.SSLContext.check_hostname` and *Server Name Indication* (see :const:`ssl.HAS_SNI`).
ru: Класс теперь поддерживает проверку имени хоста с помощью :attr:`ssl.SSLContext.check_hostname` и *Индикации имени сервера* (см. :const:`ssl.HAS_SNI`).

source: The deprecated *keyfile* and *certfile* parameters have been removed.
ru: Устаревшие параметры *keyfile* и *certfile* были удалены.

source: One exception is defined as an attribute of the :mod:`poplib` module:
ru: Одно исключение определено как атрибут модуля :mod:`poplib`:

source: Exception raised on any errors from this module (errors from :mod:`socket` module are not caught). The reason for the exception is passed to the constructor as a string.
ru: Исключение возникает при любых ошибках этого модуля (ошибки модуля :mod:`socket` не перехватываются). Причина исключения передается конструктору в виде строки.

source: Module :mod:`imaplib`
ru: Модуль :mod:`imaplib`

source: The standard Python IMAP module.
ru: Стандартный модуль Python IMAP.

source: `Frequently Asked Questions About Fetchmail <http://www.catb.org/~esr/fetchmail/fetchmail-FAQ.html>`_
ru: `Часто задаваемые вопросы о Fetchmail <http://www.catb.org/~esr/fetchmail/fetchmail-FAQ.html>`_

source: The FAQ for the :program:`fetchmail` POP/IMAP client collects information on POP3 server variations and RFC noncompliance that may be useful if you need to write an application based on the POP protocol.
ru: В FAQ по POP/IMAP-клиенту :program:`fetchmail` собрана информация о вариантах POP3-сервера и несоответствии RFC, что может быть полезно, если вам нужно написать приложение на основе протокола POP.

source: POP3 Objects
ru: Объекты POP3

source: All POP3 commands are represented by methods of the same name, in lowercase; most return the response text sent by the server.
ru: Все команды POP3 представлены одноименными методами, написанными строчными буквами; большинство из них возвращают текст ответа, отправленный сервером.

source: A :class:`POP3` instance has the following methods:
ru: Экземпляр :class:`POP3` имеет следующие методы:

source: Set the instance's debugging level. This controls the amount of debugging output printed. The default, ``0``, produces no debugging output. A value of ``1`` produces a moderate amount of debugging output, generally a single line per request. A value of ``2`` or higher produces the maximum amount of debugging output, logging each line sent and received on the control connection.
ru: Установите уровень отладки экземпляра. Это контролирует количество выводимых отладочных данных. Значение по умолчанию, ``0``, не выдает никаких отладочных данных. Значение «1» дает умеренный объем отладочной информации, обычно одну строку на запрос. Значение ``2`` или выше обеспечивает максимальный объем отладочной информации, регистрируя каждую строку, отправленную и полученную по управляющему соединению.

source: Returns the greeting string sent by the POP3 server.
ru: Возвращает строку приветствия, отправленную POP3-сервером.

source: Query the server's capabilities as specified in :rfc:`2449`. Returns a dictionary in the form ``{'name': ['param'...]}``.
ru: Запросите возможности сервера, как указано в :rfc:`2449`. Возвращает словарь в форме ``{'name': ['param'...]}``.

source: Send user command, response should indicate that a password is required.
ru: Отправьте пользовательскую команду, в ответе должно быть указано, что требуется пароль.

source: Send password, response includes message count and mailbox size. Note: the mailbox on the server is locked until :meth:`~POP3.quit` is called.
ru: Отправьте пароль, ответ включает количество сообщений и размер почтового ящика. Примечание: почтовый ящик на сервере заблокирован до тех пор, пока не будет вызван :meth:`~POP3.quit`.

source: Use the more secure APOP authentication to log into the POP3 server.
ru: Используйте более безопасную аутентификацию APOP для входа на сервер POP3.

source: Use RPOP authentication (similar to UNIX r-commands) to log into POP3 server.
ru: Используйте аутентификацию RPOP (аналогично r-командам UNIX) для входа на сервер POP3.

source: Get mailbox status. The result is a tuple of 2 integers: ``(message count, mailbox size)``.
ru: Получить статус почтового ящика. Результатом является кортеж из двух целых чисел: ``(количество сообщений, размер почтового ящика)``.

source: Request message list, result is in the form ``(response, ['mesg_num octets', ...], octets)``. If *which* is set, it is the message to list.
ru: Запросить список сообщений, результат в форме ``(ответ, ['mesg_num октетов', ...], октеты)``. Если *который* установлен, это сообщение для вывода в список.

source: Retrieve whole message number *which*, and set its seen flag. Result is in form ``(response, ['line', ...], octets)``.
ru: Получить весь номер сообщения *который* и установить для него флаг просмотра. Результат имеет форму ``(ответ, ['строка', ...], октеты)``.

source: Flag message number *which* for deletion. On most servers deletions are not actually performed until QUIT (the major exception is Eudora QPOP, which deliberately violates the RFCs by doing pending deletes on any disconnect).
ru: Пометить номер сообщения, *который* подлежит удалению. На большинстве серверов удаление фактически не выполняется до момента выхода из режима QUIT (основным исключением является Eudora QPOP, которая намеренно нарушает RFC, выполняя ожидающие удаления при любом отключении).

source: Remove any deletion marks for the mailbox.
ru: Удалите все пометки удаления для почтового ящика.

source: Do nothing. Might be used as a keep-alive.
ru: Ничего не делайте. Может использоваться как средство поддержания жизни.

source: Signoff: commit changes, unlock mailbox, drop connection.
ru: Подписание: зафиксировать изменения, разблокировать почтовый ящик, разорвать соединение.

source: Retrieves the message header plus *howmuch* lines of the message after the header of message number *which*. Result is in form ``(response, ['line', ...], octets)``.
ru: Извлекает заголовок сообщения плюс *сколько* строк сообщения после заголовка сообщения с номером *который*. Результат имеет форму ``(ответ, ['строка', ...], октеты)``.

source: The POP3 TOP command this method uses, unlike the RETR command, doesn't set the message's seen flag; unfortunately, TOP is poorly specified in the RFCs and is frequently broken in off-brand servers. Test this method by hand against the POP3 servers you will use before trusting it.
ru: Команда POP3 TOP, которую использует этот метод, в отличие от команды RETR, не устанавливает флаг просмотра сообщения; к сожалению, TOP плохо указан в RFC и часто нарушается на серверах других производителей. Проверьте этот метод вручную на POP3-серверах, которые вы будете использовать, прежде чем доверять ему.

source: Return message digest (unique id) list. If *which* is specified, result contains the unique id for that message in the form ``'response mesgnum uid``, otherwise result is list ``(response, ['mesgnum uid', ...], octets)``.
ru: Возвращаемый список дайджестов сообщений (уникальный идентификатор). Если указано *который*, результат содержит уникальный идентификатор для этого сообщения в форме ``'response mesgnum uid``, в противном случае результатом является список ``(response, ['mesgnum uid', ...], октеты)` `.

source: Try to switch to UTF-8 mode. Returns the server response if successful, raises :class:`error_proto` if not. Specified in :RFC:`6856`.
ru: Попробуйте переключиться в режим UTF-8. Возвращает ответ сервера в случае успеха, в противном случае вызывает :class:`error_proto`. Указано в :RFC:`6856`.

source: Start a TLS session on the active connection as specified in :rfc:`2595`. This is only allowed before user authentication
ru: Запустите сеанс TLS для активного соединения, как указано в :rfc:`2595`. Это разрешено только до аутентификации пользователя.

source: *context* parameter is a :class:`ssl.SSLContext` object which allows bundling SSL configuration options, certificates and private keys into a single (potentially long-lived) structure. Please read :ref:`ssl-security` for best practices.
ru: Параметр *context* — это объект :class:`ssl.SSLContext`, который позволяет объединять параметры конфигурации SSL, сертификаты и закрытые ключи в единую (потенциально долгоживущую) структуру. Пожалуйста, прочтите :ref:`ssl-security` для получения лучших практик.

source: This method supports hostname checking via :attr:`ssl.SSLContext.check_hostname` and *Server Name Indication* (see :const:`ssl.HAS_SNI`).
ru: Этот метод поддерживает проверку имени хоста через :attr:`ssl.SSLContext.check_hostname` и *Индикацию имени сервера* (см. :const:`ssl.HAS_SNI`).

source: Instances of :class:`POP3_SSL` have no additional methods. The interface of this subclass is identical to its parent.
ru: Экземпляры :class:`POP3_SSL` не имеют дополнительных методов. Интерфейс этого подкласса идентичен его родительскому.

source: POP3 Example
ru: Пример POP3

source: Here is a minimal example (without error checking) that opens a mailbox and retrieves and prints all messages::
ru: Вот минимальный пример (без проверки ошибок), который открывает почтовый ящик, извлекает и печатает все сообщения:

source: At the end of the module, there is a test section that contains a more extensive example of usage.
ru: В конце модуля есть тестовый раздел, содержащий более подробный пример использования.

source: protocol
ru: протокол
