Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/pty.po
Languages: ru

source: :mod:`!pty` --- Pseudo-terminal utilities
ru: :mod:`!pty` --- Утилиты псевдотерминала

source: **Source code:** :source:`Lib/pty.py`
ru: **Исходный код:**

source: The :mod:`pty` module defines operations for handling the pseudo-terminal concept: starting another process and being able to write to and read from its controlling terminal programmatically.
ru: Модуль :mod:`pty` определяет операции для обработки концепции псевдотерминала: запуск другого процесса и возможность программной записи и чтения с его управляющего терминала.

source: Availability
ru: Доступность

source: Pseudo-terminal handling is highly platform dependent. This code is mainly tested on Linux, FreeBSD, and macOS (it is supposed to work on other POSIX platforms but it's not been thoroughly tested).
ru: Обработка псевдотерминала сильно зависит от платформы. Этот код в основном тестировался на Linux, FreeBSD и macOS (предполагается, что он будет работать на других платформах POSIX, но он не был тщательно протестирован).

source: The :mod:`pty` module defines the following functions:
ru: Модуль :mod:`pty` определяет следующие функции:

source: Fork. Connect the child's controlling terminal to a pseudo-terminal. Return value is ``(pid, fd)``. Note that the child gets *pid* 0, and the *fd* is *invalid*. The parent's return value is the *pid* of the child, and *fd* is a file descriptor connected to the child's controlling terminal (and also to the child's standard input and output).
ru: Вилка. Подключите управляющий терминал ребенка к псевдотерминалу. Возвращаемое значение: ``(pid, fd)``. Обратите внимание, что дочерний элемент получает *pid* 0, а *fd* является *недействительным*. Возвращаемое значение родителя — это *pid* дочернего элемента, а *fd* — это файловый дескриптор, подключенный к управляющему терминалу дочернего элемента (а также к стандартному вводу и выводу дочернего элемента).

source: On macOS the use of this function is unsafe when mixed with using higher-level system APIs, and that includes using :mod:`urllib.request`.
ru: В macOS использование этой функции небезопасно в сочетании с использованием системных API более высокого уровня, включая использование :mod:`urllib.request` .

source: Open a new pseudo-terminal pair, using :func:`os.openpty` if possible, or emulation code for generic Unix systems. Return a pair of file descriptors ``(master, slave)``, for the master and the slave end, respectively.
ru: Откройте новую пару псевдотерминалов, используя :func:`os.openpty`, если это возможно, или код эмуляции для общих систем Unix. Возвращает пару файловых дескрипторов ``(master, подчиненный)`` для главного и подчиненного конца соответственно.

source: Spawn a process, and connect its controlling terminal with the current process's standard io. This is often used to baffle programs which insist on reading from the controlling terminal. It is expected that the process spawned behind the pty will eventually terminate, and when it does *spawn* will return.
ru: Создайте процесс и подключите его управляющий терминал к стандартному io. Это часто используется, чтобы сбить с толку программы, которые настаивают на чтении с управляющего терминала. Ожидается, что процесс, порожденный за pty, в конечном итоге завершится, и когда это произойдет, *spawn* вернется.

source: A loop copies STDIN of the current process to the child and data received from the child to STDOUT of the current process. It is not signaled to the child if STDIN of the current process closes down.
ru: Цикл копирует STDIN текущего процесса в дочерний процесс, а данные, полученные от дочернего процесса, в STDOUT текущего процесса. Дочернему процессу не сообщается, если STDIN текущего процесса закрывается.

source: The functions *master_read* and *stdin_read* are passed a file descriptor which they should read from, and they should always return a byte string. In order to force spawn to return before the child process exits an empty byte array should be returned to signal end of file.
ru: Функциям *master_read* и *stdin_read* передается дескриптор файла, из которого они должны читать, и они всегда должны возвращать строку байтов. Чтобы заставить spawn вернуться до того, как дочерний процесс завершится, пустой массив байтов должен быть возвращен в сигнальный конец файла.

source: The default implementation for both functions will read and return up to 1024 bytes each time the function is called. The *master_read* callback is passed the pseudoterminal’s master file descriptor to read output from the child process, and *stdin_read* is passed file descriptor 0, to read from the parent process's standard input.
ru: Реализация по умолчанию для обеих функций будет считывать и возвращать до 1024 байтов при каждом вызове функции. Обратному вызову *master_read* передается главный файловый дескриптор псевдотерминала для чтения выходных данных дочернего процесса, а *stdin_read* передается файловый дескриптор 0 для чтения из стандартного ввода родительского процесса.

source: Returning an empty byte string from either callback is interpreted as an end-of-file (EOF) condition, and that callback will not be called after that. If *stdin_read* signals EOF the controlling terminal can no longer communicate with the parent process OR the child process. Unless the child process will quit without any input, *spawn* will then loop forever. If *master_read* signals EOF the same behavior results (on linux at least).
ru: Возврат пустой строки байтов из любого обратного вызова интерпретируется как условие конца файла (EOF), и после этого обратный вызов не будет вызываться. Если *stdin_read* сигнализирует EOF, управляющий терминал больше не может взаимодействовать с родительским процессом ИЛИ дочерним процессом. Если дочерний процесс не завершится без каких-либо входных данных, *spawn* будет зацикливаться навсегда. Если *master_read* сигнализирует EOF, результат будет таким же (по крайней мере, в Linux).

source: Return the exit status value from :func:`os.waitpid` on the child process.
ru: Верните значение статуса завершения из :func:`os.waitpid` в дочернем процессе.

source: :func:`os.waitstatus_to_exitcode` can be used to convert the exit status into an exit code.
ru: :func:`os.waitstatus_to_exitcode` можно использовать для преобразования статуса выхода в код выхода.

source: Raises an :ref:`auditing event <auditing>` ``pty.spawn`` with argument ``argv``.
ru: Вызывает событие аудита <auditing>``pty.spawn`` с аргументом ``argv``.

source: :func:`spawn` now returns the status value from :func:`os.waitpid` on the child process.
ru: :func:`spawn` теперь возвращает значение статуса из :func:`os.waitpid` дочернего процесса.

source: Example
ru: Пример

source: The following program acts like the Unix command :manpage:`script(1)`, using a pseudo-terminal to record all input and output of a terminal session in a "typescript". ::
ru: Следующая программа действует как команда Unix :manpage:`script(1)`, используя псевдотерминал для записи всех входных и выходных данных сеанса терминала в «машинописный текст». ::
