Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/quopri.po
Languages: ru

source: :mod:`!quopri` --- Encode and decode MIME quoted-printable data
ru: :mod:`!quopri` --- Кодирование и декодирование MIME-данных для печати в кавычках

source: **Source code:** :source:`Lib/quopri.py`
ru: **Исходный код:** :source:`Lib/quopri.py`

source: This module performs quoted-printable transport encoding and decoding, as defined in :rfc:`1521`: "MIME (Multipurpose Internet Mail Extensions) Part One: Mechanisms for Specifying and Describing the Format of Internet Message Bodies". The quoted-printable encoding is designed for data where there are relatively few nonprintable characters; the base64 encoding scheme available via the :mod:`base64` module is more compact if there are many such characters, as when sending a graphics file.
ru: Этот модуль выполняет транспортное кодирование и декодирование с возможностью печати в кавычках, как определено в :rfc:`1521`: «MIME (многоцелевые расширения почты Интернета), часть первая: механизмы определения и описания формата тел интернет-сообщений». Кодировка quote-printable предназначена для данных, в которых относительно мало непечатаемых символов; схема кодирования base64, доступная через модуль :mod:`base64`, более компактна, если таких символов много, как при отправке графического файла.

source: Decode the contents of the *input* file and write the resulting decoded binary data to the *output* file. *input* and *output* must be :term:`binary file objects <file object>`. If the optional argument *header* is present and true, underscore will be decoded as space. This is used to decode "Q"-encoded headers as described in :rfc:`1522`: "MIME (Multipurpose Internet Mail Extensions) Part Two: Message Header Extensions for Non-ASCII Text".
ru: Декодируйте содержимое *входного* файла и запишите полученные декодированные двоичные данные в *выходной* файл. *входные* и *выходные* должны быть :term:`объектами двоичного файла <объект файла>`. Если необязательный аргумент *header* присутствует и имеет значение true, подчеркивание будет декодировано как пробел. Это используется для декодирования заголовков в кодировке «Q», как описано в :rfc:`1522`: «MIME (многоцелевые расширения Интернет-почты), часть вторая: расширения заголовков сообщений для текста, отличного от ASCII».

source: Encode the contents of the *input* file and write the resulting quoted-printable data to the *output* file. *input* and *output* must be :term:`binary file objects <file object>`. *quotetabs*, a non-optional flag which controls whether to encode embedded spaces and tabs; when true it encodes such embedded whitespace, and when false it leaves them unencoded. Note that spaces and tabs appearing at the end of lines are always encoded, as per :rfc:`1521`. *header* is a flag which controls if spaces are encoded as underscores as per :rfc:`1522`.
ru: Закодируйте содержимое *входного* файла и запишите полученные данные для печати в *выходной* файл. *входные* и *выходные* должны быть :term:`объектами двоичного файла <объект файла>`. *quotetabs*, необязательный флаг, который определяет, следует ли кодировать встроенные пробелы и табуляции; когда true, он кодирует такие встроенные пробелы, а когда false, он оставляет их незакодированными. Обратите внимание, что пробелы и табуляции, появляющиеся в конце строк, всегда кодируются согласно :rfc:`1521`. *header* — это флаг, который контролирует, кодируются ли пробелы как символы подчеркивания согласно :rfc:`1522`.

source: Like :func:`decode`, except that it accepts a source :class:`bytes` and returns the corresponding decoded :class:`bytes`.
ru: Подобно :func:`decode`, за исключением того, что он принимает исходный :class:`bytes` и возвращает соответствующий декодированный :class:`bytes`.

source: Like :func:`encode`, except that it accepts a source :class:`bytes` and returns the corresponding encoded :class:`bytes`. By default, it sends a ``False`` value to *quotetabs* parameter of the :func:`encode` function.
ru: Подобно :func:`encode`, за исключением того, что он принимает исходный :class:`bytes` и возвращает соответствующий закодированный :class:`bytes`. По умолчанию он отправляет значение False в параметр *quotetabs* функции :func:`encode`.

source: Module :mod:`base64`
ru: Модуль :mod:`base64`

source: Encode and decode MIME base64 data
ru: Кодирование и декодирование данных MIME base64

source: encoding
ru: кодирование

source: quoted-printable encoding
ru: кодировка для печати в кавычках
