Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/random.po
Languages: ru

source: Most of the random module's algorithms and seeding functions are subject to change across Python versions, but two aspects are guaranteed not to change:
ru: Большинство алгоритмов и начальных функций модуля случайных чисел могут быть изменены в разных версиях Python, но два аспекта гарантированно не изменятся:

source: If a new seeding method is added, then a backward compatible seeder will be offered.
ru: Если будет добавлен новый метод посева, то будет предложена сеялка с обратной совместимостью.

source: The generator's :meth:`~Random.random` method will continue to produce the same sequence when the compatible seeder is given the same seed.
ru: Метод генератора :meth:`~Random.random` будет продолжать создавать ту же последовательность, когда совместимой сеялке будет предоставлено то же самое начальное число.

source: Examples
ru: Примеры

source: Basic examples::
ru: Основные примеры::

source: Simulations::
ru: Моделирование::

source: Example of `statistical bootstrapping <https://en.wikipedia.org/wiki/Bootstrapping_(statistics)>`_ using resampling with replacement to estimate a confidence interval for the mean of a sample::
ru: Пример `статистической начальной загрузки <https://en.wikipedia.org/wiki/Bootstrapping_(statistics)>`_ с использованием повторной выборки с заменой для оценки доверительного интервала для среднего значения выборки:

source: Example of a `resampling permutation test <https://en.wikipedia.org/wiki/Resampling_(statistics)#Permutation_tests>`_ to determine the statistical significance or `p-value <https://en.wikipedia.org/wiki/P-value>`_ of an observed difference between the effects of a drug versus a placebo::
ru: Пример `теста перестановки повторной выборки <https://en.wikipedia.org/wiki/Resampling_(statistics)#Permutation_tests>`_ для определения статистической значимости или `p-значения <https://en.wikipedia.org/ wiki/P-value>`_ наблюдаемой разницы между эффектами препарата и плацебо::

source: Simulation of arrival times and service deliveries for a multiserver queue::
ru: Моделирование времени прибытия и предоставления услуг для многосерверной очереди:

source: `Statistics for Hackers <https://www.youtube.com/watch?v=Iq9DzN6mvYA>`_ a video tutorial by `Jake Vanderplas <https://us.pycon.org/2016/speaker/profile/295/>`_ on statistical analysis using just a few fundamental concepts including simulation, sampling, shuffling, and cross-validation.
ru: `Статистика для хакеров <https://www.youtube.com/watch?v=Iq9DzN6mvYA>`_ видеоурок `Джейка Вандерпласа <https://us.pycon.org/2016/speaker/profile/295/> `_ по статистическому анализу с использованием всего нескольких фундаментальных концепций, включая моделирование, выборку, перетасовку и перекрестную проверку.

source: `Economics Simulation <https://nbviewer.org/url/norvig.com/ipython/Economics.ipynb>`_ a simulation of a marketplace by `Peter Norvig <https://norvig.com/bio.html>`_ that shows effective use of many of the tools and distributions provided by this module (gauss, uniform, sample, betavariate, choice, triangular, and randrange).
ru: `Экономическое моделирование <https://nbviewer.org/url/norvig.com/ipython/Economics.ipynb>`_ моделирование рынка `Питера Норвига <https://norvig.com/bio.html>`_ это показывает эффективное использование многих инструментов и распределений, предоставляемых этим модулем (гауссовое, равномерное, выборочное, бета-вариация, выбор, треугольное и рандомизированное).

source: `A Concrete Introduction to Probability (using Python) <https://nbviewer.org/url/norvig.com/ipython/Probability.ipynb>`_ a tutorial by `Peter Norvig <https://norvig.com/bio.html>`_ covering the basics of probability theory, how to write simulations, and how to perform data analysis using Python.
ru: `Конкретное введение в вероятность (с использованием Python) <https://nbviewer.org/url/norvig.com/ipython/Probability.ipynb>`_ учебник `Питера Норвига <https://norvig.com/bio. html>`_, посвященный основам теории вероятностей, написанию моделирования и выполнению анализа данных с помощью Python.

source: Recipes
ru: Рецепты

source: These recipes show how to efficiently make random selections from the combinatoric iterators in the :mod:`itertools` module:
ru: Эти рецепты показывают, как эффективно делать случайный выбор из комбинаторных итераторов в модуле :mod:`itertools`:

source: The default :func:`.random` returns multiples of 2⁻⁵³ in the range *0.0 ≤ x < 1.0*. All such numbers are evenly spaced and are exactly representable as Python floats. However, many other representable floats in that interval are not possible selections. For example, ``0.05954861408025609`` isn't an integer multiple of 2⁻⁵³.
ru: По умолчанию :func:`.random` возвращает кратные 2⁻⁵³ в диапазоне *0,0 ≤ x < 1,0*. Все такие числа расположены на равном расстоянии друг от друга и точно представляются как числа с плавающей запятой в Python. Однако многие другие представимые числа с плавающей запятой в этом интервале не являются возможным выбором. Например, ``0,05954861408025609`` не является целым числом, кратным 2⁻⁵³.

source: The following recipe takes a different approach. All floats in the interval are possible selections. The mantissa comes from a uniform distribution of integers in the range *2⁵² ≤ mantissa < 2⁵³*. The exponent comes from a geometric distribution where exponents smaller than *-53* occur half as often as the next larger exponent.
ru: В следующем рецепте используется другой подход. Все числа с плавающей запятой в интервале являются возможными вариантами выбора. Мантисса получается из равномерного распределения целых чисел в диапазоне *2⁵² ≤ мантисса < 2⁵³*. Показатель получается из геометрического распределения, где показатели степени меньше *-53* встречаются вдвое реже, чем следующий больший показатель.

source: All :ref:`real valued distributions <real-valued-distributions>` in the class will use the new method::
ru: Все :ref:`распределения с действительными значениями <real-valued-distributions>` в классе будут использовать новый метод::

source: The recipe is conceptually equivalent to an algorithm that chooses from all the multiples of 2⁻¹⁰⁷⁴ in the range *0.0 ≤ x < 1.0*. All such numbers are evenly spaced, but most have to be rounded down to the nearest representable Python float. (The value 2⁻¹⁰⁷⁴ is the smallest positive unnormalized float and is equal to ``math.ulp(0.0)``.)
ru: Рецепт концептуально эквивалентен алгоритму, который выбирает из всех кратных 2⁻¹⁰⁷⁴ в диапазоне *0,0 ≤ x < 1,0*. Все такие числа расположены равномерно, но большинство из них необходимо округлить до ближайшего представимого числа с плавающей запятой Python. (Значение 2⁻¹⁰⁷⁴ представляет собой наименьшее положительное ненормализованное число с плавающей запятой и равно ``math.ulp(0.0)``.)

source: `Generating Pseudo-random Floating-Point Values <https://allendowney.com/research/rand/downey07randfloat.pdf>`_ a paper by Allen B. Downey describing ways to generate more fine-grained floats than normally generated by :func:`.random`.
ru: `Генерация псевдослучайных значений с плавающей запятой <https://allendowney.com/research/rand/downey07randfloat.pdf>`_ статья Аллена Б. Дауни, описывающая способы генерации более мелкозернистых чисел с плавающей запятой, чем обычно генерируемые :func :`.случайный`.
