Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/random.po
Languages: ru

source: **Source code:** :source:`Lib/random.py`
ru: **Исходный код:** :source:`Lib/random.py`

source: This module implements pseudo-random number generators for various distributions.
ru: Этот модуль реализует генераторы псевдослучайных чисел для различных распределений.

source: For integers, there is uniform selection from a range. For sequences, there is uniform selection of a random element, a function to generate a random permutation of a list in-place, and a function for random sampling without replacement.
ru: Для целых чисел существует равномерный выбор из диапазона. Для последовательностей есть равномерный выбор случайного элемента, функция генерации случайной перестановки списка на месте и функция случайной выборки без замены.

source: On the real line, there are functions to compute uniform, normal (Gaussian), lognormal, negative exponential, gamma, and beta distributions. For generating distributions of angles, the von Mises distribution is available.
ru: На реальной линии имеются функции для вычисления равномерного, нормального (гауссовского), логнормального, отрицательного экспоненциального, гамма- и бета-распределений. Для создания распределений углов доступно распределение фон Мизеса.

source: Almost all module functions depend on the basic function :func:`.random`, which generates a random float uniformly in the half-open range ``0.0 <= X < 1.0``. Python uses the Mersenne Twister as the core generator. It produces 53-bit precision floats and has a period of 2\*\*19937-1. The underlying implementation in C is both fast and threadsafe. The Mersenne Twister is one of the most extensively tested random number generators in existence. However, being completely deterministic, it is not suitable for all purposes, and is completely unsuitable for cryptographic purposes.
ru: Почти все функции модуля зависят от базовой функции :func:`.random`, которая равномерно генерирует случайное число с плавающей запятой в полуоткрытом диапазоне ``0.0 <= X < 1.0``. Python использует Mersenne Twister в качестве основного генератора. Он производит 53-битные числа с плавающей запятой и имеет период 2\*\*19937-1. Базовая реализация на C является одновременно быстрой и потокобезопасной. Mersenne Twister — один из наиболее тщательно протестированных существующих генераторов случайных чисел. Однако, будучи полностью детерминированным, он подходит не для всех целей и совершенно непригоден для криптографических целей.

source: The functions supplied by this module are actually bound methods of a hidden instance of the :class:`random.Random` class. You can instantiate your own instances of :class:`Random` to get generators that don't share state.
ru: Функции, предоставляемые этим модулем, на самом деле являются связанными методами скрытого экземпляра класса :class:`random.Random`. Вы можете создать свои собственные экземпляры :class:`Random`, чтобы получить генераторы, которые не имеют общего состояния.

source: Class :class:`Random` can also be subclassed if you want to use a different basic generator of your own devising: see the documentation on that class for more details.
ru: Класс :class:`Random` также может быть подклассом, если вы хотите использовать другой базовый генератор собственной разработки: более подробную информацию см. в документации по этому классу.

source: The :mod:`random` module also provides the :class:`SystemRandom` class which uses the system function :func:`os.urandom` to generate random numbers from sources provided by the operating system.
ru: Модуль :mod:`random` также предоставляет класс :class:`SystemRandom`, который использует системную функцию :func:`os.urandom` для генерации случайных чисел из источников, предоставляемых операционной системой.

source: The pseudo-random generators of this module should not be used for security purposes. For security or cryptographic uses, see the :mod:`secrets` module.
ru: Псевдослучайные генераторы этого модуля не следует использовать в целях безопасности. Для обеспечения безопасности или криптографии см. модуль :mod:`secrets`.

source: M. Matsumoto and T. Nishimura, "Mersenne Twister: A 623-dimensionally equidistributed uniform pseudorandom number generator", ACM Transactions on Modeling and Computer Simulation Vol. 8, No. 1, January pp.3--30 1998.
ru: М. Мацумото и Т. Нишимура, «Mersenne Twister: 623-мерный равнораспределенный равномерный генератор псевдослучайных чисел», ACM Transactions on Modeling and Computer Simulation Vol. 8, № 1, стр. 3-30 января 1998 г.

source: Bookkeeping functions
ru: Бухгалтерские функции

source: Initialize the random number generator.
ru: Инициализируйте генератор случайных чисел.

source: If *a* is omitted or ``None``, the current system time is used. If randomness sources are provided by the operating system, they are used instead of the system time (see the :func:`os.urandom` function for details on availability).
ru: Если *a* опущено или ``None``, используется текущее системное время. Если источники случайности предоставляются операционной системой, они используются вместо системного времени (подробную информацию о доступности см. в функции :func:`os.urandom`).

source: If *a* is an int, it is used directly.
ru: Если *a* является целым числом, оно используется напрямую.

source: With version 2 (the default), a :class:`str`, :class:`bytes`, or :class:`bytearray` object gets converted to an :class:`int` and all of its bits are used.
ru: В версии 2 (по умолчанию) объект :class:`str`, :class:`bytes` или :class:`bytearray` преобразуется в :class:`int` и используются все его биты.

source: With version 1 (provided for reproducing random sequences from older versions of Python), the algorithm for :class:`str` and :class:`bytes` generates a narrower range of seeds.
ru: В версии 1 (предусмотренной для воспроизведения случайных последовательностей из старых версий Python) алгоритм для :class:`str` и :class:`bytes` генерирует более узкий диапазон начальных чисел.

source: Moved to the version 2 scheme which uses all of the bits in a string seed.
ru: Перешел на схему версии 2, в которой используются все биты начального числа строки.

source: The *seed* must be one of the following types: ``None``, :class:`int`, :class:`float`, :class:`str`, :class:`bytes`, or :class:`bytearray`.
ru: *Seed* должно быть одного из следующих типов: ``None``, :class:`int`, :class:`float`, :class:`str`, :class:`bytes` или :class: `bytearray`.

source: Return an object capturing the current internal state of the generator. This object can be passed to :func:`setstate` to restore the state.
ru: Возвращает объект, фиксирующий текущее внутреннее состояние генератора. Этот объект можно передать в :func:`setstate` для восстановления состояния.

source: *state* should have been obtained from a previous call to :func:`getstate`, and :func:`setstate` restores the internal state of the generator to what it was at the time :func:`getstate` was called.
ru: *state* должно было быть получено в результате предыдущего вызова :func:`getstate`, а :func:`setstate` восстанавливает внутреннее состояние генератора до того, каким оно было на момент вызова :func:`getstate`.

source: Functions for bytes
ru: Функции для байтов

source: Generate *n* random bytes.
ru: Сгенерировать *n* случайных байтов.

source: This method should not be used for generating security tokens. Use :func:`secrets.token_bytes` instead.
ru: Этот метод не следует использовать для создания токенов безопасности. Вместо этого используйте :func:`secrets.token_bytes`.

source: Functions for integers
ru: Функции для целых чисел

source: :meth:`randrange` is more sophisticated about producing equally distributed values. Formerly it used a style like ``int(random()*n)`` which could produce slightly uneven distributions.
ru: :meth:`randrange` более сложен в создании равномерно распределенных значений. Раньше использовался стиль типа int(random()*n), который мог привести к слегка неравномерному распределению.

source: Return a random integer *N* such that ``a <= N <= b``. Alias for ``randrange(a, b+1)``.
ru: Возвращает случайное целое число *N* такое, что ``a <= N <= b``. Псевдоним для randrange(a, b+1)``.

source: This method now accepts zero for *k*.
ru: Этот метод теперь принимает ноль для *k*.

source: Functions for sequences
ru: Функции для последовательностей

source: Return a random element from the non-empty sequence *seq*. If *seq* is empty, raises :exc:`IndexError`.
ru: Возвращает случайный элемент из непустой последовательности *seq*. Если *seq* пусто, выдается :exc:`IndexError`.

source: Return a *k* sized list of elements chosen from the *population* with replacement. If the *population* is empty, raises :exc:`IndexError`.
ru: Возвращает список элементов размером *k*, выбранных из *популяции* с заменой. Если *популяция* пуста, выдается :exc:`IndexError`.

source: If a *weights* sequence is specified, selections are made according to the relative weights. Alternatively, if a *cum_weights* sequence is given, the selections are made according to the cumulative weights (perhaps computed using :func:`itertools.accumulate`). For example, the relative weights ``[10, 5, 30, 5]`` are equivalent to the cumulative weights ``[10, 15, 45, 50]``. Internally, the relative weights are converted to cumulative weights before making selections, so supplying the cumulative weights saves work.
ru: Если указана последовательность *веса*, выбор осуществляется в соответствии с относительными весами. Альтернативно, если задана последовательность *cum_weights*, выбор осуществляется в соответствии с совокупными весами (возможно, рассчитанными с использованием :func:`itertools.accumulate`). Например, относительные веса ``[10, 5, 30, 5]`` эквивалентны совокупным весам ``[10, 15, 45, 50]``. Внутренне относительные веса преобразуются в совокупные веса перед выполнением выбора, поэтому предоставление совокупных весов экономит работу.

source: If neither *weights* nor *cum_weights* are specified, selections are made with equal probability. If a weights sequence is supplied, it must be the same length as the *population* sequence. It is a :exc:`TypeError` to specify both *weights* and *cum_weights*.
ru: Если ни *weights*, ни *cum_weights* не указаны, выбор осуществляется с равной вероятностью. Если указана последовательность весов, она должна быть той же длины, что и последовательность *population*. Это :exc:`TypeError`, позволяющий указать как *weights*, так и *cum_weights*.

source: The *weights* or *cum_weights* can use any numeric type that interoperates with the :class:`float` values returned by :func:`random` (that includes integers, floats, and fractions but excludes decimals). Weights are assumed to be non-negative and finite. A :exc:`ValueError` is raised if all weights are zero.
ru: *weights* или *cum_weights* могут использовать любой числовой тип, который взаимодействует со значениями :class:`float`, возвращаемыми :func:`random` (который включает целые числа, числа с плавающей запятой и дроби, но исключает десятичные числа). Предполагается, что веса неотрицательны и конечны. :exc:`ValueError` возникает, если все веса равны нулю.

source: Raises a :exc:`ValueError` if all weights are zero.
ru: Вызывает :exc:`ValueError`, если все веса равны нулю.

source: Shuffle the sequence *x* in place.
ru: Перетасуйте последовательность *x* на месте.

source: To shuffle an immutable sequence and return a new shuffled list, use ``sample(x, k=len(x))`` instead.
ru: Чтобы перетасовать неизменяемую последовательность и вернуть новый перетасованный список, используйте вместо этого ``sample(x, k=len(x))``.

source: Note that even for small ``len(x)``, the total number of permutations of *x* can quickly grow larger than the period of most random number generators. This implies that most permutations of a long sequence can never be generated. For example, a sequence of length 2080 is the largest that can fit within the period of the Mersenne Twister random number generator.
ru: Обратите внимание, что даже для небольшого ``len(x)`` общее количество перестановок *x* может быстро превысить период большинства генераторов случайных чисел. Это означает, что большинство перестановок длинной последовательности никогда не могут быть созданы. Например, последовательность длиной 2080 — это наибольшая последовательность, которая может уместиться в период генератора случайных чисел Mersenne Twister.

source: Removed the optional parameter *random*.
ru: Удален необязательный параметр *random*.

source: Return a *k* length list of unique elements chosen from the population sequence. Used for random sampling without replacement.
ru: Возвращает список длиной *k* уникальных элементов, выбранных из последовательности совокупности. Используется для случайной выборки без замены.

source: Returns a new list containing elements from the population while leaving the original population unchanged. The resulting list is in selection order so that all sub-slices will also be valid random samples. This allows raffle winners (the sample) to be partitioned into grand prize and second place winners (the subslices).
ru: Возвращает новый список, содержащий элементы совокупности, оставляя исходную совокупность неизменной. Результирующий список находится в порядке выбора, так что все подсрезы также будут действительными случайными выборками. Это позволяет разделить победителей лотереи (выборку) на обладателей главного приза и победителей, занявших второе место (подсрезы).

source: Members of the population need not be :term:`hashable` or unique. If the population contains repeats, then each occurrence is a possible selection in the sample.
ru: Члены популяции не обязательно должны быть :term:`хэшируемыми` или уникальными. Если популяция содержит повторы, то каждое появление является возможным выбором в выборке.

source: Repeated elements can be specified one at a time or with the optional keyword-only *counts* parameter. For example, ``sample(['red', 'blue'], counts=[4, 2], k=5)`` is equivalent to ``sample(['red', 'red', 'red', 'red', 'blue', 'blue'], k=5)``.
ru: Повторяющиеся элементы можно указывать по одному или с помощью необязательного параметра *counts*, содержащего только ключевые слова. Например, ``sample(['red', 'blue'], counts=[4, 2], k=5)`` эквивалентен ``sample(['red', 'red', 'red' , 'красный', 'синий', 'синий'], k=5)``.

source: To choose a sample from a range of integers, use a :func:`range` object as an argument. This is especially fast and space efficient for sampling from a large population: ``sample(range(10000000), k=60)``.
ru: Чтобы выбрать образец из диапазона целых чисел, используйте объект :func:`range` в качестве аргумента. Это особенно быстро и эффективно для выборки из большой совокупности: ``sample(range(10000000), k=60)``.

source: If the sample size is larger than the population size, a :exc:`ValueError` is raised.
ru: Если размер выборки превышает размер генеральной совокупности, выдается ошибка :exc:`ValueError`.

source: Added the *counts* parameter.
ru: Добавлен параметр *counts*.

source: The *population* must be a sequence. Automatic conversion of sets to lists is no longer supported.
ru: *Популяция* должна быть последовательностью. Автоматическое преобразование наборов в списки больше не поддерживается.

source: Real-valued distributions
ru: Распределения с реальными значениями

source: The following functions generate specific real-valued distributions. Function parameters are named after the corresponding variables in the distribution's equation, as used in common mathematical practice; most of these equations can be found in any statistics text.
ru: Следующие функции генерируют конкретные распределения вещественных значений. Параметры функции названы в честь соответствующих переменных в уравнении распределения, используемых в обычной математической практике; большинство этих уравнений можно найти в любом тексте по статистике.

source: The end-point value ``b`` may or may not be included in the range depending on floating-point rounding in the expression ``a + (b-a) * random()``.
ru: Значение конечной точки ``b`` может быть включено или не включено в диапазон в зависимости от округления с плавающей запятой в выражении ``a + (ba) * random()``.

source: Beta distribution. Conditions on the parameters are ``alpha > 0`` and ``beta > 0``. Returned values range between 0 and 1.
ru: Бета-дистрибутив. Условия для параметров: «альфа > 0» и «бета > 0». Возвращаемые значения находятся в диапазоне от 0 до 1.

source: Exponential distribution. *lambd* is 1.0 divided by the desired mean. It should be nonzero. (The parameter would be called "lambda", but that is a reserved word in Python.) Returned values range from 0 to positive infinity if *lambd* is positive, and from negative infinity to 0 if *lambd* is negative.
ru: Экспоненциальное распределение. *лямбд* равен 1,0, разделенному на желаемое среднее значение. Оно должно быть ненулевым. (Параметр мог бы называться «лямбда», но в Python это зарезервированное слово.) Возвращаемые значения варьируются от 0 до положительной бесконечности, если *lambd* положительное значение, и от отрицательной бесконечности до 0, если *lambd* отрицательное значение.

source: Gamma distribution. (*Not* the gamma function!) The shape and scale parameters, *alpha* and *beta*, must have positive values. (Calling conventions vary and some sources define 'beta' as the inverse of the scale).
ru: Гамма-распределение. (*Не* гамма-функция!) Параметры формы и масштаба, *alpha* и *beta*, должны иметь положительные значения. (Соглашения о вызовах различаются, и некоторые источники определяют «бету» как обратную шкалу).

source: The probability distribution function is::
ru: Функция распределения вероятностей:

source: Normal distribution, also called the Gaussian distribution. *mu* is the mean, and *sigma* is the standard deviation. This is slightly faster than the :func:`normalvariate` function defined below.
ru: Нормальное распределение, также называемое распределением Гаусса. *mu* — среднее значение, а *сигма* — стандартное отклонение. Это немного быстрее, чем функция :func:`normalvariate`, определенная ниже.

source: Multithreading note: When two threads call this function simultaneously, it is possible that they will receive the same return value. This can be avoided in three ways. 1) Have each thread use a different instance of the random number generator. 2) Put locks around all calls. 3) Use the slower, but thread-safe :func:`normalvariate` function instead.
ru: Примечание о многопоточности: когда два потока вызывают эту функцию одновременно, возможно, они получат одно и то же возвращаемое значение. Этого можно избежать тремя способами. 1) Пусть каждый поток использует отдельный экземпляр генератора случайных чисел. 2) Установите блокировки на все звонки. 3) Вместо этого используйте более медленную, но потокобезопасную функцию :func:`normalvariate`.

source: *mu* and *sigma* now have default arguments.
ru: *mu* и *sigma* теперь имеют аргументы по умолчанию.

source: Log normal distribution. If you take the natural logarithm of this distribution, you'll get a normal distribution with mean *mu* and standard deviation *sigma*. *mu* can have any value, and *sigma* must be greater than zero.
ru: Лог нормального распределения. Если вы возьмете натуральный логарифм этого распределения, вы получите нормальное распределение со средним значением *mu* и стандартным отклонением *sigma*. *mu* может иметь любое значение, а *sigma* должно быть больше нуля.

source: Normal distribution. *mu* is the mean, and *sigma* is the standard deviation.
ru: Нормальное распределение. *mu* — среднее значение, а *сигма* — стандартное отклонение.

source: *mu* is the mean angle, expressed in radians between 0 and 2\*\ *pi*, and *kappa* is the concentration parameter, which must be greater than or equal to zero. If *kappa* is equal to zero, this distribution reduces to a uniform random angle over the range 0 to 2\*\ *pi*.
ru: *mu* — средний угол, выраженный в радианах от 0 до 2\*\ *pi*, а *kappa* — параметр концентрации, который должен быть больше или равен нулю. Если *каппа* равно нулю, это распределение сводится к равномерному случайному углу в диапазоне от 0 до 2\*\ *pi*.

source: Pareto distribution. *alpha* is the shape parameter.
ru: Распределение Парето. *alpha* — параметр формы.

source: Weibull distribution. *alpha* is the scale parameter and *beta* is the shape parameter.
ru: Распределение Вейбулла. *alpha* — параметр масштаба, *beta* — параметр формы.

source: Alternative Generator
ru: Альтернативный генератор

source: Class that implements the default pseudo-random number generator used by the :mod:`random` module.
ru: Класс, реализующий генератор псевдослучайных чисел по умолчанию, используемый модулем :mod:`random`.

source: Formerly the *seed* could be any hashable object. Now it is limited to: ``None``, :class:`int`, :class:`float`, :class:`str`, :class:`bytes`, or :class:`bytearray`.
ru: Раньше *сид* мог быть любым хешируемым объектом. Теперь оно ограничено: ``None``, :class:`int`, :class:`float`, :class:`str`, :class:`bytes` или :class:`bytearray`.

source: Subclasses of :class:`!Random` should override the following methods if they wish to make use of a different basic generator:
ru: Подклассы :class:`!Random` должны переопределять следующие методы, если они хотят использовать другой базовый генератор:

source: Override this method in subclasses to customise the :meth:`~random.seed` behaviour of :class:`!Random` instances.
ru: Переопределите этот метод в подклассах, чтобы настроить поведение :meth:`~random.seed` экземпляров :class:`!Random`.

source: Override this method in subclasses to customise the :meth:`~random.getstate` behaviour of :class:`!Random` instances.
ru: Переопределите этот метод в подклассах, чтобы настроить поведение :meth:`~random.getstate` экземпляров :class:`!Random`.

source: Override this method in subclasses to customise the :meth:`~random.setstate` behaviour of :class:`!Random` instances.
ru: Переопределите этот метод в подклассах, чтобы настроить поведение :meth:`~random.setstate` экземпляров :class:`!Random`.

source: Override this method in subclasses to customise the :meth:`~random.random` behaviour of :class:`!Random` instances.
ru: Переопределите этот метод в подклассах, чтобы настроить поведение :meth:`~random.random` экземпляров :class:`!Random`.

source: Optionally, a custom generator subclass can also supply the following method:
ru: При желании подкласс пользовательского генератора также может предоставить следующий метод:

source: Override this method in subclasses to customise the :meth:`~random.getrandbits` behaviour of :class:`!Random` instances.
ru: Переопределите этот метод в подклассах, чтобы настроить поведение :meth:`~random.getrandbits` экземпляров :class:`!Random`.

source: Class that uses the :func:`os.urandom` function for generating random numbers from sources provided by the operating system. Not available on all systems. Does not rely on software state, and sequences are not reproducible. Accordingly, the :meth:`seed` method has no effect and is ignored. The :meth:`getstate` and :meth:`setstate` methods raise :exc:`NotImplementedError` if called.
ru: Класс, который использует функцию :func:`os.urandom` для генерации случайных чисел из источников, предоставляемых операционной системой. Доступно не во всех системах. Не зависит от состояния программного обеспечения, последовательности не воспроизводятся. Соответственно, метод :meth:`seed` не имеет никакого эффекта и игнорируется. Методы :meth:`getstate` и :meth:`setstate` вызывают :exc:`NotImplementedError` при вызове.

source: Notes on Reproducibility
ru: Заметки о воспроизводимости
