Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/re.po
Languages: ru

source: :mod:`re` --- Regular expression operations
ru: :mod:`re` --- Регулярные выражения

source: This module provides regular expression matching operations similar to those found in Perl.
ru: Этот модуль предоставляет операции сопоставления регулярных выражений, аналогичные тем, которые есть в Perl.

source: The solution is to use Python's raw string notation for regular expression patterns; backslashes are not handled in any special way in a string literal prefixed with ``'r'``. So ``r"\n"`` is a two-character string containing ``'\'`` and ``'n'``, while ``"\n"`` is a one-character string containing a newline. Usually patterns will be expressed in Python code using this raw string notation.
ru: Решение состоит в том, чтобы использовать необработанную строковую нотацию Python для шаблонов регулярных выражений; обратные косые черты не обрабатываются каким-либо особым образом в строковом литерале с префиксом ``'r'``. Таким образом, ``r"\n"`` представляет собой двухсимвольную строку, содержащую ``'\'`` и ``'n'``, а ``"\n"`` представляет собой односимвольную строку, содержащую новая строка. Обычно шаблоны выражаются в коде Python с использованием этой необработанной строковой нотации.

source: It is important to note that most regular expression operations are available as module-level functions and methods on :ref:`compiled regular expressions <re-objects>`. The functions are shortcuts that don't require you to compile a regex object first, but miss some fine-tuning parameters.
ru: Важно отметить, что большинство операций с регулярными выражениями доступны в виде функций и методов уровня модуля в :ref:`скомпилированных регулярных выражениях <re-objects>`. Функции представляют собой ярлыки, которые не требуют предварительной компиляции объекта регулярного выражения, но пропускают некоторые параметры тонкой настройки.

source: Regular Expression Syntax
ru: Синтаксис регулярных выражений

source: A regular expression (or RE) specifies a set of strings that matches it; the functions in this module let you check if a particular string matches a given regular expression (or if a given regular expression matches a particular string, which comes down to the same thing).
ru: Регулярное выражение (или RE) определяет набор соответствующих ему строк; Функции в этом модуле позволяют вам проверить, соответствует ли определенная строка заданному регулярному выражению (или соответствует ли данное регулярное выражение определенной строке, что сводится к одному и тому же).

source: Regular expressions can be concatenated to form new regular expressions; if *A* and *B* are both regular expressions, then *AB* is also a regular expression. In general, if a string *p* matches *A* and another string *q* matches *B*, the string *pq* will match AB. This holds unless *A* or *B* contain low precedence operations; boundary conditions between *A* and *B*; or have numbered group references. Thus, complex expressions can easily be constructed from simpler primitive expressions like the ones described here. For details of the theory and implementation of regular expressions, consult the Friedl book [Frie09]_, or almost any textbook about compiler construction.
ru: Регулярные выражения можно объединять для формирования новых регулярных выражений; если *A* и *B* являются регулярными выражениями, то *AB* также является регулярным выражением. В общем, если строка *p* соответствует *A*, а другая строка *q* соответствует *B*, строка *pq* будет соответствовать AB. Это справедливо, если только *A* или *B* не содержат операций с низким приоритетом; граничные условия между *A* и *B*; или иметь пронумерованные ссылки на группы. Таким образом, сложные выражения можно легко создать из более простых примитивных выражений, подобных описанным здесь. Подробную информацию о теории и реализации регулярных выражений можно найти в книге Фридла. [Frie09]_ или почти любой учебник по построению компиляторов.

source: A brief explanation of the format of regular expressions follows. For further information and a gentler presentation, consult the :ref:`regex-howto`.
ru: Ниже приводится краткое объяснение формата регулярных выражений. Для получения дополнительной информации и более наглядного представления обратитесь к :ref:`regex-howto`.

source: Regular expressions can contain both special and ordinary characters. Most ordinary characters, like ``'A'``, ``'a'``, or ``'0'``, are the simplest regular expressions; they simply match themselves. You can concatenate ordinary characters, so ``last`` matches the string ``'last'``. (In the rest of this section, we'll write RE's in ``this special style``, usually without quotes, and strings to be matched ``'in single quotes'``.)
ru: Регулярные выражения могут содержать как специальные, так и обычные символы. Большинство обычных символов, таких как ``'A'``, ``'a'`` или ``'0'``, являются простейшими регулярными выражениями; они просто соответствуют самим себе. Вы можете объединять обычные символы, чтобы ``last`` соответствовал строке ``'last'``. (В оставшейся части этого раздела мы будем писать RE в ``этом специальном стиле``, обычно без кавычек, а сопоставляемые строки заключать ``'в одинарные кавычки'``.)

source: Some characters, like ``'|'`` or ``'('``, are special. Special characters either stand for classes of ordinary characters, or affect how the regular expressions around them are interpreted.
ru: Некоторые символы, такие как ``'|'`` или ``'('``, являются специальными. Специальные символы либо обозначают классы обычных символов, либо влияют на интерпретацию регулярных выражений вокруг них.

source: The special characters are:
ru: Специальные символы:

source: (Caret.) Matches the start of the string, and in :const:`MULTILINE` mode also matches immediately after each newline.
ru: (Вставка.) Соответствует началу строки, а в режиме :const:`MULTILINE` также соответствует сразу после каждой новой строки.

source: Matches the end of the string or just before the newline at the end of the string, and in :const:`MULTILINE` mode also matches before a newline. ``foo`` matches both 'foo' and 'foobar', while the regular expression ``foo$`` matches only 'foo'. More interestingly, searching for ``foo.$`` in ``'foo1\nfoo2\n'`` matches 'foo2' normally, but 'foo1' in :const:`MULTILINE` mode; searching for a single ``$`` in ``'foo\n'`` will find two (empty) matches: one just before the newline, and one at the end of the string.
ru: Соответствует концу строки или непосредственно перед новой строкой в ​​конце строки, а в режиме :const:`MULTILINE` также соответствует перед новой строкой. ``foo`` соответствует как "foo", так и "foobar", тогда как регулярное выражение ``foo$`` соответствует только "foo". Более интересно, поиск ``foo.$`` в ``'foo1\nfoo2\n'`` обычно соответствует 'foo2', но 'foo1' в режиме :const:`MULTILINE`; поиск одного ``$`` в ``'foo\n'`` найдет два (пустых) совпадения: одно непосредственно перед новой строкой и одно в конце строки.

source: Causes the resulting RE to match 0 or more repetitions of the preceding RE, as many repetitions as are possible. ``ab*`` will match 'a', 'ab', or 'a' followed by any number of 'b's.
ru: Заставляет результирующий RE соответствовать 0 или более повторениям предыдущего RE, насколько это возможно. ``ab*`` будет соответствовать "a", "ab" или "a", за которыми следует любое количество букв "b".

source: Causes the resulting RE to match 1 or more repetitions of the preceding RE. ``ab+`` will match 'a' followed by any non-zero number of 'b's; it will not match just 'a'.
ru: Заставляет результирующий RE соответствовать одному или нескольким повторениям предыдущего RE. ``ab+`` будет соответствовать "a", за которым следует любое ненулевое количество "b"; он не будет соответствовать просто «a».

source: Causes the resulting RE to match 0 or 1 repetitions of the preceding RE. ``ab?`` will match either 'a' or 'ab'.
ru: Заставляет результирующий RE соответствовать 0 или 1 повторению предыдущего RE. ``ab?`` будет соответствовать либо "a", либо "ab".

source: Specifies that exactly *m* copies of the previous RE should be matched; fewer matches cause the entire RE not to match. For example, ``a{6}`` will match exactly six ``'a'`` characters, but not five.
ru: Указывает, что должно быть сопоставлено ровно *m* копий предыдущего RE; меньшее количество совпадений приводит к тому, что весь RE не будет совпадать. Например, ``a{6}`` будет соответствовать ровно шести символам ``'a'``, а не пяти.

source: Causes the resulting RE to match from *m* to *n* repetitions of the preceding RE, attempting to match as many repetitions as possible. For example, ``a{3,5}`` will match from 3 to 5 ``'a'`` characters. Omitting *m* specifies a lower bound of zero, and omitting *n* specifies an infinite upper bound. As an example, ``a{4,}b`` will match ``'aaaab'`` or a thousand ``'a'`` characters followed by a ``'b'``, but not ``'aaab'``. The comma may not be omitted or the modifier would be confused with the previously described form.
ru: Заставляет результирующий RE соответствовать от *m* до *n* повторений предыдущего RE, пытаясь сопоставить как можно больше повторений. Например, ``a{3,5}`` будет соответствовать от 3 до 5 символов ``'a'``. Пропуск *m* задает нижнюю границу, равную нулю, а пропуск *n* задает бесконечную верхнюю границу. Например, ``a{4,}b`` будет соответствовать ``'aaaab'`` или тысяче символов ``'a'``, за которыми следует ``'b'``, но не ``' аааб'``. Запятую нельзя опускать, иначе модификатор можно спутать с ранее описанной формой.

source: Either escapes special characters (permitting you to match characters like ``'*'``, ``'?'``, and so forth), or signals a special sequence; special sequences are discussed below.
ru: Либо экранирует специальные символы (что позволяет сопоставлять такие символы, как ``'*'``, ``'?'`` и т. д.), либо сигнализирует специальную последовательность; специальные последовательности обсуждаются ниже.

source: If you're not using a raw string to express the pattern, remember that Python also uses the backslash as an escape sequence in string literals; if the escape sequence isn't recognized by Python's parser, the backslash and subsequent character are included in the resulting string. However, if Python would recognize the resulting sequence, the backslash should be repeated twice. This is complicated and hard to understand, so it's highly recommended that you use raw strings for all but the simplest expressions.
ru: Если вы не используете необработанную строку для выражения шаблона, помните, что Python также использует обратную косую черту в качестве escape-последовательности в строковых литералах; если escape-последовательность не распознается синтаксическим анализатором Python, в результирующую строку включаются обратная косая черта и последующий символ. Однако, если Python распознает полученную последовательность, обратную косую черту следует повторить дважды. Это сложно и трудно понять, поэтому настоятельно рекомендуется использовать необработанные строки для всех выражений, кроме самых простых.

source: Used to indicate a set of characters. In a set:
ru: Используется для обозначения набора символов. В наборе:

source: Characters can be listed individually, e.g. ``[amk]`` will match ``'a'``, ``'m'``, or ``'k'``.
ru: Символы могут быть указаны индивидуально, например, ``[amk]`` будет соответствовать ``'a'``, ``'m'`` или ``'k'``.

source: Ranges of characters can be indicated by giving two characters and separating them by a ``'-'``, for example ``[a-z]`` will match any lowercase ASCII letter, ``[0-5][0-9]`` will match all the two-digits numbers from ``00`` to ``59``, and ``[0-9A-Fa-f]`` will match any hexadecimal digit. If ``-`` is escaped (e.g. ``[a\-z]``) or if it's placed as the first or last character (e.g. ``[-a]`` or ``[a-]``), it will match a literal ``'-'``.
ru: Диапазоны символов можно указать, задав два символа и разделив их знаком ``'-'``, например ``[az]`` будет соответствовать любой строчной букве ASCII, ``[0-5][0-9] ]`` будет соответствовать всем двузначным числам от ``00`` до ``59``, а ``[0-9A-Fa-f]`` будет соответствовать любой шестнадцатеричной цифре. Если ``-`` экранирован (например, ``[a\-z]``) или если он помещен в качестве первого или последнего символа (например, ``[-a]`` или ``[a-]`` ), он будет соответствовать буквальному ``'-'``.

source: Special characters lose their special meaning inside sets. For example, ``[(+*)]`` will match any of the literal characters ``'('``, ``'+'``, ``'*'``, or ``')'``.
ru: Специальные символы теряют свое особое значение внутри наборов. Например, ``[(+*)]`` будет соответствовать любому из литеральных символов ``'('``, ``'+'``, ``'*'`` или ``')' ``.

source: Characters that are not within a range can be matched by :dfn:`complementing` the set. If the first character of the set is ``'^'``, all the characters that are *not* in the set will be matched. For example, ``[^5]`` will match any character except ``'5'``, and ``[^^]`` will match any character except ``'^'``. ``^`` has no special meaning if it's not the first character in the set.
ru: Символы, не входящие в диапазон, могут быть сопоставлены путем :dfn:`дополнения` набора. Если первый символ набора — ``'^'``, все символы, *не* входящие в набор, будут сопоставлены. Например, ``[^5]`` будет соответствовать любому символу, кроме ``'5'``, а ``[^^]`` будет соответствовать любому символу, кроме ``'^'``. ``^`` не имеет особого значения, если это не первый символ в наборе.

source: To match a literal ``']'`` inside a set, precede it with a backslash, or place it at the beginning of the set. For example, both ``[()[\]{}]`` and ``[]()[{}]`` will match a right bracket, as well as left bracket, braces, and parentheses.
ru: Чтобы сопоставить литерал ``']'`` внутри набора, поставьте перед ним обратную косую черту или поместите его в начало набора. Например, ``[()[\]{}]`` и ``[]()[{}]`` будут соответствовать правой скобке, а также левой скобке, фигурным и круглым скобкам.

source: Support of nested sets and set operations as in `Unicode Technical Standard #18`_ might be added in the future. This would change the syntax, so to facilitate this change a :exc:`FutureWarning` will be raised in ambiguous cases for the time being. That includes sets starting with a literal ``'['`` or containing literal character sequences ``'--'``, ``'&&'``, ``'~~'``, and ``'||'``. To avoid a warning escape them with a backslash.
ru: В будущем может быть добавлена ​​поддержка вложенных наборов и операций над множествами, как в «Техническом стандарте Unicode #18». Это приведет к изменению синтаксиса, поэтому для облегчения этого изменения в настоящее время в неоднозначных случаях будет вызываться :exc:`FutureWarning`. Сюда входят наборы, начинающиеся с литерала ``'['`` или содержащие литеральные последовательности символов ``'--'``, ``'&&'``, ``'~~'`` и ``'| |'``. Чтобы избежать предупреждения, экранируйте их обратной косой чертой.

source: :exc:`FutureWarning` is raised if a character set contains constructs that will change semantically in the future.
ru: :exc:`FutureWarning` возникает, если набор символов содержит конструкции, которые семантически изменятся в будущем.

source: ``A|B``, where *A* and *B* can be arbitrary REs, creates a regular expression that will match either *A* or *B*. An arbitrary number of REs can be separated by the ``'|'`` in this way. This can be used inside groups (see below) as well. As the target string is scanned, REs separated by ``'|'`` are tried from left to right. When one pattern completely matches, that branch is accepted. This means that once *A* matches, *B* will not be tested further, even if it would produce a longer overall match. In other words, the ``'|'`` operator is never greedy. To match a literal ``'|'``, use ``\|``, or enclose it inside a character class, as in ``[|]``.
ru: ``A|B``, где *A* и *B* могут быть произвольными RE, создает регулярное выражение, которое будет соответствовать либо *A*, либо *B*. Таким образом, произвольное количество RE можно разделить с помощью ``'|'``. Это также можно использовать внутри групп (см. ниже). При сканировании целевой строки RE, разделенные ``'|'``, проверяются слева направо. Когда один шаблон полностью совпадает, эта ветвь принимается. Это означает, что как только *A* совпадет, *B* не будет проверяться дальше, даже если это приведет к более длинному общему совпадению. Другими словами, оператор ``'|'`` никогда не бывает жадным. Чтобы сопоставить литерал ``'|'``, используйте ``\|`` или заключите его в класс символов, как в ``[|]``.

source: Matches whatever regular expression is inside the parentheses, and indicates the start and end of a group; the contents of a group can be retrieved after a match has been performed, and can be matched later in the string with the ``\number`` special sequence, described below. To match the literals ``'('`` or ``')'``, use ``\(`` or ``\)``, or enclose them inside a character class: ``[(]``, ``[)]``.
ru: Соответствует любому регулярному выражению, находящемуся внутри круглых скобок, и указывает начало и конец группы; содержимое группы может быть получено после выполнения сопоставления и может быть сопоставлено позже в строке с помощью специальной последовательности ``\number``, описанной ниже. Чтобы сопоставить литералы ``'('`` или ``')'``, используйте ``\(`` или ``\)`` или заключите их в класс символов: ``[(]`` , ``[)]``.

source: This is an extension notation (a ``'?'`` following a ``'('`` is not meaningful otherwise). The first character after the ``'?'`` determines what the meaning and further syntax of the construct is. Extensions usually do not create a new group; ``(?P<name>...)`` is the only exception to this rule. Following are the currently supported extensions.
ru: Это обозначение расширения (``'?'`` после ``' (в противном случае '`` не имеет смысла). Первый символ после ``'?'`` определяет значение и дальнейший синтаксис Конструкция is. Расширения обычно не создают новую группу; единственное исключение из этого правила — ``(?P<name>...)``. ​​Ниже приведены поддерживаемые в настоящее время расширения.

source: A non-capturing version of regular parentheses. Matches whatever regular expression is inside the parentheses, but the substring matched by the group *cannot* be retrieved after performing a match or referenced later in the pattern.
ru: Незахватывающая версия обычных круглых скобок. Соответствует любому регулярному выражению, находящемуся внутри круглых скобок, но подстроку, соответствующую группе, *нельзя* получить после выполнения сопоставления или использовать в шаблоне позже.

source: The letters ``'a'``, ``'L'`` and ``'u'`` also can be used in a group.
ru: Буквы ``'a'``, ``'L'`` и ``'u'`` также могут использоваться в группе.

source: Named groups can be referenced in three contexts. If the pattern is ``(?P<quote>['"]).*?(?P=quote)`` (i.e. matching a string quoted with either single or double quotes):
ru: На именованные группы можно ссылаться в трех контекстах. Если шаблон ``(?P<quote>['"]).*?(?P=quote)`` (т.е. соответствует строке, заключенной в одинарные или двойные кавычки):

source: Context of reference to group "quote"
ru: Контекст обращения к группе «цитата»

source: Ways to reference it
ru: Способы ссылки на него

source: in the same pattern itself
ru: по той же схеме

source: ``(?P=quote)`` (as shown)
ru: ``(?P=quote)`` (как показано)

source: when processing match object *m*
ru: при обработке объекта соответствия *m*

source: ``m.end('quote')`` (etc.)
ru: ``m.end('quote')`` (и т.д.)

source: in a string passed to the *repl* argument of ``re.sub()``
ru: в строке, передаваемой в аргумент *repl* функции ``re.sub()``

source: A backreference to a named group; it matches whatever text was matched by the earlier group named *name*.
ru: Обратная ссылка на именованную группу; он соответствует любому тексту, который был найден в предыдущей группе с именем *name*.

source: A comment; the contents of the parentheses are simply ignored.
ru: Комментарий; содержимое скобок просто игнорируется.

source: Matches if ``...`` matches next, but doesn't consume any of the string. This is called a :dfn:`lookahead assertion`. For example, ``Isaac (?=Asimov)`` will match ``'Isaac '`` only if it's followed by ``'Asimov'``.
ru: Соответствует, если ``...`` соответствует следующему, но не использует какую-либо строку. Это называется :dfn:`упреждающим утверждением`. Например, ``Isaac (?=Asimov)`` будет соответствовать ``'Isaac '``, только если за ним следует ``'Asimov'``.

source: Matches if ``...`` doesn't match next. This is a :dfn:`negative lookahead assertion`. For example, ``Isaac (?!Asimov)`` will match ``'Isaac '`` only if it's *not* followed by ``'Asimov'``.
ru: Соответствует, если ``...`` не соответствует следующему. Это :dfn:`утверждение отрицательного прогнозирования`. Например, ``Isaac (?!Asimov)`` будет соответствовать ``'Isaac '``, только если за ним *не* следует ``'Asimov'``.

source: Matches if the current position in the string is preceded by a match for ``...`` that ends at the current position. This is called a :dfn:`positive lookbehind assertion`. ``(?<=abc)def`` will find a match in ``'abcdef'``, since the lookbehind will back up 3 characters and check if the contained pattern matches. The contained pattern must only match strings of some fixed length, meaning that ``abc`` or ``a|b`` are allowed, but ``a*`` and ``a{3,4}`` are not. Note that patterns which start with positive lookbehind assertions will not match at the beginning of the string being searched; you will most likely want to use the :func:`search` function rather than the :func:`match` function:
ru: Соответствует, если текущей позиции в строке предшествует совпадение с ``...``, которое заканчивается в текущей позиции. Это называется :dfn:`позитивным утверждением ретроспективного просмотра`. ``(?<=abc)def`` найдет совпадение в ``'abcdef'``, поскольку просмотр назад скопирует 3 символа и проверит, соответствует ли содержащийся шаблон. Содержащийся шаблон должен соответствовать только строкам некоторой фиксированной длины. Это означает, что ``abc`` или ``a|b`` разрешены, но ``a*`` и ``a{3,4}`` недопустимы. . Обратите внимание, что шаблоны, начинающиеся с положительных утверждений просмотра назад, не будут соответствовать началу искомой строки; вы, скорее всего, захотите использовать функцию :func:`search` вместо функции :func:`match`:

source: This example looks for a word following a hyphen:
ru: В этом примере выполняется поиск слова, следующего за дефисом:

source: Added support for group references of fixed length.
ru: Добавлена ​​поддержка групповых ссылок фиксированной длины.

source: Matches if the current position in the string is not preceded by a match for ``...``. This is called a :dfn:`negative lookbehind assertion`. Similar to positive lookbehind assertions, the contained pattern must only match strings of some fixed length. Patterns which start with negative lookbehind assertions may match at the beginning of the string being searched.
ru: Соответствует, если текущей позиции в строке не предшествует совпадение с ``...``. Это называется :dfn:`утверждением отрицательного просмотра`. Подобно утверждениям положительного просмотра назад, содержащийся шаблон должен соответствовать только строкам некоторой фиксированной длины. Шаблоны, начинающиеся с отрицательных утверждений просмотра назад, могут совпадать в начале искомой строки.
