Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/re.po
Languages: ru

source: Will try to match with ``yes-pattern`` if the group with given *id* or *name* exists, and with ``no-pattern`` if it doesn't. ``no-pattern`` is optional and can be omitted. For example, ``(<)?(\w+@\w+(?:\.\w+)+)(?(1)>|$)`` is a poor email matching pattern, which will match with ``'<user@host.com>'`` as well as ``'user@host.com'``, but not with ``'<user@host.com'`` nor ``'user@host.com>'``.
ru: Попытается сопоставить с ``yes-pattern``, если группа с данным *id* или *name* существует, и с ``no-pattern``, если нет. ``no-pattern`` не является обязательным и может быть опущен. Например, ``(<)?(\w+@\w+(?:\.\w+)+)(?(1)>|$)`` — это плохой шаблон соответствия электронной почты, который будет соответствовать ``' <user@host.com>'``, а также ``'user@host.com'``, но не с ``'<user@host.com'`` и ``'user@host.com> '``.

source: The special sequences consist of ``'\'`` and a character from the list below. If the ordinary character is not an ASCII digit or an ASCII letter, then the resulting RE will match the second character. For example, ``\$`` matches the character ``'$'``.
ru: Специальные последовательности состоят из ``'\'`` и символа из списка ниже. Если обычный символ не является цифрой ASCII или буквой ASCII, то результирующий RE будет соответствовать второму символу. Например, ``\$`` соответствует символу ``'$'``.

source: Matches the contents of the group of the same number. Groups are numbered starting from 1. For example, ``(.+) \1`` matches ``'the the'`` or ``'55 55'``, but not ``'thethe'`` (note the space after the group). This special sequence can only be used to match one of the first 99 groups. If the first digit of *number* is 0, or *number* is 3 octal digits long, it will not be interpreted as a group match, but as the character with octal value *number*. Inside the ``'['`` and ``']'`` of a character class, all numeric escapes are treated as characters.
ru: Соответствует содержимому группы с тем же номером. Группы нумеруются начиная с 1. Например, ``(.+) \1`` соответствует ``'the'`` или ``'55 55'``, но не ``'thethe'`` (примечание пробел после группы). Эту специальную последовательность можно использовать только для сопоставления с одной из первых 99 групп. Если первая цифра *number* равна 0 или *number* состоит из 3 восьмеричных цифр, оно будет интерпретироваться не как совпадение группы, а как символ с восьмеричным значением *number*. Внутри ``'['`` и ``']'`` класса символов все числовые escape-символы обрабатываются как символы.

source: Matches only at the start of the string.
ru: Соответствует только началу строки.

source: For Unicode (str) patterns:
ru: Для шаблонов Unicode (str):

source: For 8-bit (bytes) patterns:
ru: Для 8-битных (байтовых) шаблонов:

source: Matches characters considered whitespace in the ASCII character set; this is equivalent to ``[ \t\n\r\f\v]``.
ru: Соответствует символам, которые считаются пробелами в наборе символов ASCII; это эквивалентно ``[ \t\n\r\f\v]``.

source: Matches only at the end of the string.
ru: Соответствует только концу строки.

source: (Note that ``\b`` is used to represent word boundaries, and means "backspace" only inside character classes.)
ru: (Обратите внимание, что ``\b`` используется для обозначения границ слов и означает «возврат» только внутри классов символов.)

source: Octal escapes are included in a limited form. If the first digit is a 0, or if there are three octal digits, it is considered an octal escape. Otherwise, it is a group reference. As for string literals, octal escapes are always at most three digits in length.
ru: Восьмеричные побеги включены в ограниченном виде. Если первая цифра равна 0 или имеется три восьмеричные цифры, это считается восьмеричным escape. В противном случае это групповая ссылка. Что касается строковых литералов, восьмеричные escape-символы всегда имеют длину не более трех цифр.

source: The ``'\u'`` and ``'\U'`` escape sequences have been added.
ru: Были добавлены escape-последовательности ``'\u'`` и ``'\U'``.

source: Unknown escapes consisting of ``'\'`` and an ASCII letter now are errors.
ru: Неизвестные escape-символы, состоящие из ``'\'`` и буквы ASCII, теперь являются ошибками.

source: Module Contents
ru: Содержимое модуля

source: The module defines several functions, constants, and an exception. Some of the functions are simplified versions of the full featured methods for compiled regular expressions. Most non-trivial applications always use the compiled form.
ru: Модуль определяет несколько функций, констант и исключений. Некоторые функции представляют собой упрощенные версии полнофункциональных методов для скомпилированных регулярных выражений. Большинство нетривиальных приложений всегда используют скомпилированную форму.

source: Flags
ru: Флаги

source: Flag constants are now instances of :class:`RegexFlag`, which is a subclass of :class:`enum.IntFlag`.
ru: Константы флагов теперь являются экземплярами :class:`RegexFlag`, который является подклассом :class:`enum.IntFlag`.

source: This flag allows you to write regular expressions that look nicer and are more readable by allowing you to visually separate logical sections of the pattern and add comments. Whitespace within the pattern is ignored, except when in a character class, or when preceded by an unescaped backslash, or within tokens like ``*?``, ``(?:`` or ``(?P<...>``. For example, ``(? :`` and ``* ?`` are not allowed. When a line contains a ``#`` that is not in a character class and is not preceded by an unescaped backslash, all characters from the leftmost such ``#`` through the end of the line are ignored.
ru: Этот флаг позволяет вам писать регулярные выражения, которые выглядят лучше и более читабельны, позволяя визуально разделять логические разделы шаблона и добавлять комментарии. Пробелы внутри шаблона игнорируются, за исключением случаев, когда они находятся в классе символов, или когда им предшествует неэкранированная обратная косая черта, или внутри токенов, таких как ``*?``, ``(?:`` или ``(?P<... >`` Например, ``(? :`` и ``* ?`` не допускаются. Если строка содержит символ ``#``, который не принадлежит классу символов и которому не предшествует неэкранированная обратная косая черта. , все символы начиная с самого левого, например ``#``, до конца строки игнорируются.

source: This means that the two following regular expression objects that match a decimal number are functionally equal::
ru: Это означает, что два следующих объекта регулярных выражений, соответствующие десятичному числу, функционально равны:

source: Corresponds to the inline flag ``(?x)``.
ru: Соответствует встроенному флагу ``(?x)``.

source: Functions
ru: Функции

source: Compile a regular expression pattern into a :ref:`regular expression object <re-objects>`, which can be used for matching using its :func:`~Pattern.match`, :func:`~Pattern.search` and other methods, described below.
ru: Скомпилируйте шаблон регулярного выражения в :ref:`объект регулярного выражения <re-objects>`, который можно использовать для сопоставления с помощью его :func:`~Pattern.match`, :func:`~Pattern.search` и других методы, описанные ниже.

source: The sequence ::
ru: Последовательность ::

source: is equivalent to ::
ru: эквивалентно::

source: but using :func:`re.compile` and saving the resulting regular expression object for reuse is more efficient when the expression will be used several times in a single program.
ru: но использование :func:`re.compile` и сохранение полученного объекта регулярного выражения для повторного использования более эффективно, когда выражение будет использоваться несколько раз в одной программе.

source: The compiled versions of the most recent patterns passed to :func:`re.compile` and the module-level matching functions are cached, so programs that use only a few regular expressions at a time needn't worry about compiling regular expressions.
ru: Скомпилированные версии самых последних шаблонов, передаваемые в :func:`re.compile`, и функции сопоставления на уровне модуля кэшируются, поэтому программам, которые используют только несколько регулярных выражений одновременно, не нужно беспокоиться о компиляции регулярных выражений.

source: Note that even in :const:`MULTILINE` mode, :func:`re.match` will only match at the beginning of the string and not at the beginning of each line.
ru: Обратите внимание, что даже в режиме :const:`MULTILINE` :func:`re.match` будет соответствовать только началу строки, а не началу каждой строки.

source: If you want to locate a match anywhere in *string*, use :func:`search` instead (see also :ref:`search-vs-match`).
ru: Если вы хотите найти совпадение в любом месте *строки*, используйте вместо этого :func:`search` (см. также :ref:`search-vs-match`).

source: Split *string* by the occurrences of *pattern*. If capturing parentheses are used in *pattern*, then the text of all groups in the pattern are also returned as part of the resulting list. If *maxsplit* is nonzero, at most *maxsplit* splits occur, and the remainder of the string is returned as the final element of the list. ::
ru: Разделить *строку* по вхождениям *шаблона*. Если в *шаблоне* используются захватывающие круглые скобки, то текст всех групп в шаблоне также возвращается как часть результирующего списка. Если *maxsplit* не равно нулю, происходит не более *maxsplit* разбиений, а остаток строки возвращается как последний элемент списка. ::

source: If there are capturing groups in the separator and it matches at the start of the string, the result will start with an empty string. The same holds for the end of the string::
ru: Если в разделителе есть группы захвата и они совпадают в начале строки, результат начнется с пустой строки. То же самое справедливо и для конца строки::

source: That way, separator components are always found at the same relative indices within the result list.
ru: Таким образом, компоненты разделителя всегда находятся в одних и тех же относительных индексах в списке результатов.

source: Empty matches for the pattern split the string only when not adjacent to a previous empty match.
ru: Пустые совпадения с шаблоном разделяют строку только в том случае, если они не являются соседними с предыдущим пустым совпадением.

source: Added the optional flags argument.
ru: Добавлен необязательный аргумент флагов.

source: Added support of splitting on a pattern that could match an empty string.
ru: Добавлена ​​поддержка разделения по шаблону, который может соответствовать пустой строке.

source: Return all non-overlapping matches of *pattern* in *string*, as a list of strings or tuples. The *string* is scanned left-to-right, and matches are returned in the order found. Empty matches are included in the result.
ru: Возвращает все непересекающиеся совпадения *pattern* в *string* в виде списка строк или кортежей. *Строка* сканируется слева направо, и совпадения возвращаются в найденном порядке. Пустые совпадения включаются в результат.

source: The result depends on the number of capturing groups in the pattern. If there are no groups, return a list of strings matching the whole pattern. If there is exactly one group, return a list of strings matching that group. If multiple groups are present, return a list of tuples of strings matching the groups. Non-capturing groups do not affect the form of the result.
ru: Результат зависит от количества групп захвата в шаблоне. Если групп нет, верните список строк, соответствующих всему шаблону. Если существует ровно одна группа, верните список строк, соответствующих этой группе. Если присутствует несколько групп, верните список кортежей строк, соответствующих группам. Незахватывающие группы не влияют на форму результата.

source: Non-empty matches can now start just after a previous empty match.
ru: Непустые совпадения теперь могут начинаться сразу после предыдущего пустого совпадения.

source: Return the string obtained by replacing the leftmost non-overlapping occurrences of *pattern* in *string* by the replacement *repl*. If the pattern isn't found, *string* is returned unchanged. *repl* can be a string or a function; if it is a string, any backslash escapes in it are processed. That is, ``\n`` is converted to a single newline character, ``\r`` is converted to a carriage return, and so forth. Unknown escapes of ASCII letters are reserved for future use and treated as errors. Other unknown escapes such as ``\&`` are left alone. Backreferences, such as ``\6``, are replaced with the substring matched by group 6 in the pattern. For example::
ru: Возвращает строку, полученную путем замены крайних левых непересекающихся вхождений *pattern* в *string* заменой *repl*. Если шаблон не найден, *строка* возвращается без изменений. *repl* может быть строкой или функцией; если это строка, любые символы обратной косой черты в ней обрабатываются. То есть ``\n`` преобразуется в один символ новой строки, ``\r`` преобразуется в возврат каретки и так далее. Неизвестные escape-символы ASCII-букв зарезервированы для использования в будущем и рассматриваются как ошибки. Другие неизвестные escape-последовательности, такие как ``\&``, остаются в покое. Обратные ссылки, такие как ``\6``, заменяются подстрокой, соответствующей группе 6 в шаблоне. Например::

source: The optional argument *count* is the maximum number of pattern occurrences to be replaced; *count* must be a non-negative integer. If omitted or zero, all occurrences will be replaced. Empty matches for the pattern are replaced only when not adjacent to a previous empty match, so ``sub('x*', '-', 'abxd')`` returns ``'-a-b--d-'``.
ru: Необязательный аргумент *count* — это максимальное количество вхождений шаблона, которые необходимо заменить; *count* должно быть неотрицательным целым числом. Если он опущен или равен нулю, все вхождения будут заменены. Пустые совпадения шаблона заменяются только в том случае, если они не являются соседними с предыдущим пустым совпадением, поэтому ``sub('x*', '-', 'abxd')`` возвращает ``'-ab--d-'`` .

source: In string-type *repl* arguments, in addition to the character escapes and backreferences described above, ``\g<name>`` will use the substring matched by the group named ``name``, as defined by the ``(?P<name>...)`` syntax. ``\g<number>`` uses the corresponding group number; ``\g<2>`` is therefore equivalent to ``\2``, but isn't ambiguous in a replacement such as ``\g<2>0``. ``\20`` would be interpreted as a reference to group 20, not a reference to group 2 followed by the literal character ``'0'``. The backreference ``\g<0>`` substitutes in the entire substring matched by the RE.
ru: В аргументах строкового типа *repl*, в дополнение к escape-символам и обратным ссылкам, описанным выше, ``\g<name>`` будет использовать подстроку, соответствующую группе с именем ``name``, как определено в `` (?P<имя>...)`` синтаксис. ``\g<number>`` использует соответствующий номер группы; Таким образом, ``\g<2>`` эквивалентен ``\2``, но не является двусмысленным при замене, такой как ``\g<2>0``. ``\20`` будет интерпретироваться как ссылка на группу 20, а не как ссылка на группу 2, за которой следует буквальный символ ``'0'``. Обратная ссылка ``\g<0>`` заменяет всю подстроку, соответствующую RE.

source: Unmatched groups are replaced with an empty string.
ru: Несовпадающие группы заменяются пустой строкой.

source: Unknown escapes in *pattern* consisting of ``'\'`` and an ASCII letter now are errors.
ru: Неизвестные escape-символы в *шаблоне*, состоящем из ``'\'`` и буквы ASCII, теперь являются ошибками.

source: Unknown escapes in *repl* consisting of ``'\'`` and an ASCII letter now are errors.
ru: Неизвестные escape-последовательности в *repl*, состоящие из ``'\'`` и буквы ASCII, теперь являются ошибками.

source: Empty matches for the pattern are replaced when adjacent to a previous non-empty match.
ru: Пустые совпадения шаблона заменяются, если они соседствуют с предыдущим непустым совпадением.

source: Perform the same operation as :func:`sub`, but return a tuple ``(new_string, number_of_subs_made)``.
ru: Выполните ту же операцию, что и :func:`sub`, но верните кортеж ``(new_string, number_of_subs_made)``.

source: Escape special characters in *pattern*. This is useful if you want to match an arbitrary literal string that may have regular expression metacharacters in it. For example::
ru: Экранируйте специальные символы в *шаблоне*. Это полезно, если вы хотите сопоставить произвольную литеральную строку, которая может содержать метасимволы регулярного выражения. Например::

source: This function must not be used for the replacement string in :func:`sub` and :func:`subn`, only backslashes should be escaped. For example::
ru: Эту функцию нельзя использовать для строки замены в :func:`sub` и :func:`subn`, экранировать следует только обратную косую черту. Например::

source: The ``'_'`` character is no longer escaped.
ru: Символ ``'_'`` больше не экранируется.

source: Only characters that can have special meaning in a regular expression are escaped. As a result, ``'!'``, ``'"'``, ``'%'``, ``"'"``, ``','``, ``'/'``, ``':'``, ``';'``, ``'<'``, ``'='``, ``'>'``, ``'@'``, and ``"`"`` are no longer escaped.
ru: Экранируются только символы, которые могут иметь особое значение в регулярном выражении. В результате ``'!'``, ``'"'``, ``'%'``, ``"'"``, ``','``, ``'/'` `, ``':'``, ``';'``, ``'<'``, ``'='``, ``'>'``, ``'@'``, и ``"`"`` больше не экранируются.

source: Clear the regular expression cache.
ru: Очистите кеш регулярных выражений.

source: Exceptions
ru: Исключения

source: Exception raised when a string passed to one of the functions here is not a valid regular expression (for example, it might contain unmatched parentheses) or when some other error occurs during compilation or matching. It is never an error if a string contains no match for a pattern. The error instance has the following additional attributes:
ru: Исключение возникает, когда строка, переданная одной из функций, не является допустимым регулярным выражением (например, она может содержать несовпадающие круглые скобки) или когда во время компиляции или сопоставления возникает какая-либо другая ошибка. Если строка не содержит совпадений с шаблоном, это никогда не является ошибкой. Экземпляр ошибки имеет следующие дополнительные атрибуты:

source: The unformatted error message.
ru: Неформатированное сообщение об ошибке.

source: The regular expression pattern.
ru: Шаблон регулярного выражения.

source: The index in *pattern* where compilation failed (may be ``None``).
ru: Индекс в *pattern*, где компиляция не удалась (может быть ``None``).

source: The line corresponding to *pos* (may be ``None``).
ru: Строка, соответствующая *pos* (может быть ``None``).

source: The column corresponding to *pos* (may be ``None``).
ru: Столбец, соответствующий *pos* (может быть ``None``).

source: Added additional attributes.
ru: Добавлены дополнительные атрибуты.

source: Regular Expression Objects
ru: Объекты регулярных выражений

source: The optional second parameter *pos* gives an index in the string where the search is to start; it defaults to ``0``. This is not completely equivalent to slicing the string; the ``'^'`` pattern character matches at the real beginning of the string and at positions just after a newline, but not necessarily at the index where the search is to start.
ru: Необязательный второй параметр *pos* задает индекс в строке, с которой должен начаться поиск; по умолчанию он равен ``0``. Это не полностью эквивалентно разрезанию строки; символ шаблона ``'^'`` соответствует реальному началу строки и позициям сразу после новой строки, но не обязательно по индексу, с которого должен начаться поиск.

source: The optional parameter *endpos* limits how far the string will be searched; it will be as if the string is *endpos* characters long, so only the characters from *pos* to ``endpos - 1`` will be searched for a match. If *endpos* is less than *pos*, no match will be found; otherwise, if *rx* is a compiled regular expression object, ``rx.search(string, 0, 50)`` is equivalent to ``rx.search(string[:50], 0)``. ::
ru: Необязательный параметр *endpos* ограничивает глубину поиска строки; это будет так, как будто строка состоит из символов *endpos*, поэтому для поиска соответствия будут искаться только символы от *pos* до ``endpos - 1``. Если *endpos* меньше, чем *pos*, совпадение не будет найдено; в противном случае, если *rx* является скомпилированным объектом регулярного выражения, ``rx.search(string, 0, 50)`` эквивалентен ``rx.search(string[:50], 0)``. ::

source: The optional *pos* and *endpos* parameters have the same meaning as for the :meth:`~Pattern.search` method. ::
ru: Необязательные параметры *pos* и *endpos* имеют то же значение, что и для метода :meth:`~Pattern.search`. ::

source: If you want to locate a match anywhere in *string*, use :meth:`~Pattern.search` instead (see also :ref:`search-vs-match`).
ru: Если вы хотите найти совпадение в любом месте *string*, используйте вместо этого :meth:`~Pattern.search` (см. также :ref:`search-vs-match`).

source: Identical to the :func:`split` function, using the compiled pattern.
ru: Идентичен функции :func:`split`, использует скомпилированный шаблон.

source: Similar to the :func:`findall` function, using the compiled pattern, but also accepts optional *pos* and *endpos* parameters that limit the search region like for :meth:`search`.
ru: Аналогично функции :func:`findall`, использует скомпилированный шаблон, но также принимает дополнительные параметры *pos* и *endpos*, которые ограничивают область поиска, как для :meth:`search`.

source: Similar to the :func:`finditer` function, using the compiled pattern, but also accepts optional *pos* and *endpos* parameters that limit the search region like for :meth:`search`.
ru: Аналогично функции :func:`finditer`, использует скомпилированный шаблон, но также принимает дополнительные параметры *pos* и *endpos*, которые ограничивают область поиска, как для :meth:`search`.

source: Identical to the :func:`sub` function, using the compiled pattern.
ru: Идентичен функции :func:`sub`, использует скомпилированный шаблон.

source: Identical to the :func:`subn` function, using the compiled pattern.
ru: Идентичен функции :func:`subn`, использует скомпилированный шаблон.

source: The number of capturing groups in the pattern.
ru: Количество групп захвата в шаблоне.

source: A dictionary mapping any symbolic group names defined by ``(?P<id>)`` to group numbers. The dictionary is empty if no symbolic groups were used in the pattern.
ru: Словарь, сопоставляющий любые символические имена групп, определенные ``(?P<id>)`` с номерами групп. Словарь пуст, если в шаблоне не использовались символические группы.

source: The pattern string from which the pattern object was compiled.
ru: Строка шаблона, из которой был скомпилирован объект шаблона.

source: Added support of :func:`copy.copy` and :func:`copy.deepcopy`. Compiled regular expression objects are considered atomic.
ru: Добавлена ​​поддержка :func:`copy.copy` и :func:`copy.deepcopy`. Скомпилированные объекты регулярных выражений считаются атомарными.

source: Match Objects
ru: Сопоставить объекты

source: Match objects always have a boolean value of ``True``. Since :meth:`~Pattern.match` and :meth:`~Pattern.search` return ``None`` when there is no match, you can test whether there was a match with a simple ``if`` statement::
ru: Объекты совпадений всегда имеют логическое значение ``True``. Поскольку :meth:`~Pattern.match` и :meth:`~Pattern.search` возвращают ``None``, если совпадений нет, вы можете проверить, было ли совпадение, с помощью простого оператора ``if``: :
