Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/re.po
Languages: ru

source: Returns one or more subgroups of the match. If there is a single argument, the result is a single string; if there are multiple arguments, the result is a tuple with one item per argument. Without arguments, *group1* defaults to zero (the whole match is returned). If a *groupN* argument is zero, the corresponding return value is the entire matching string; if it is in the inclusive range [1..99], it is the string matching the corresponding parenthesized group. If a group number is negative or larger than the number of groups defined in the pattern, an :exc:`IndexError` exception is raised. If a group is contained in a part of the pattern that did not match, the corresponding result is ``None``. If a group is contained in a part of the pattern that matched multiple times, the last match is returned. ::
ru: Возвращает одну или несколько подгрупп соответствия. Если имеется один аргумент, результатом будет одна строка; если имеется несколько аргументов, результатом является кортеж с одним элементом на каждый аргумент. Без аргументов *group1* по умолчанию равно нулю (возвращается все совпадение). Если аргумент *groupN* равен нулю, соответствующее возвращаемое значение — это вся соответствующая строка; если оно находится в инклюзивном диапазоне [1..99], это строка, соответствующая соответствующей группе в скобках. Если номер группы отрицательный или превышает количество групп, определенных в шаблоне, возникает исключение :exc:`IndexError`. Если группа содержится в части шаблона, которая не совпала, соответствующий результат — «Нет». Если группа содержится в части шаблона, которая совпала несколько раз, возвращается последнее совпадение. ::

source: If the regular expression uses the ``(?P<name>...)`` syntax, the *groupN* arguments may also be strings identifying groups by their group name. If a string argument is not used as a group name in the pattern, an :exc:`IndexError` exception is raised.
ru: Если регулярное выражение использует синтаксис ``(?P<name>...)``, аргументы *groupN* также могут быть строками, идентифицирующими группы по их имени. Если строковый аргумент не используется в качестве имени группы в шаблоне, возникает исключение :exc:`IndexError`.

source: A moderately complicated example::
ru: Умеренно сложный пример:

source: Named groups can also be referred to by their index::
ru: На именованные группы также можно ссылаться по их индексу::

source: If a group matches multiple times, only the last match is accessible::
ru: Если группа совпадает несколько раз, доступно только последнее совпадение:

source: This is identical to ``m.group(g)``. This allows easier access to an individual group from a match::
ru: Это идентично ``m.group(g)``. Это упрощает доступ к отдельной группе из матча:

source: Return a tuple containing all the subgroups of the match, from 1 up to however many groups are in the pattern. The *default* argument is used for groups that did not participate in the match; it defaults to ``None``.
ru: Возвращает кортеж, содержащий все подгруппы соответствия, от 1 до любого количества групп, содержащихся в шаблоне. Аргумент *default* используется для групп, не участвовавших в сопоставлении; по умолчанию установлено значение «Нет».

source: For example::
ru: Например::

source: If we make the decimal place and everything after it optional, not all groups might participate in the match. These groups will default to ``None`` unless the *default* argument is given::
ru: Если мы сделаем десятичный знак и все, что после него, необязательным, не все группы смогут участвовать в сопоставлении. По умолчанию для этих групп будет установлено значение «Нет», если не указан аргумент *default*::

source: Return a dictionary containing all the *named* subgroups of the match, keyed by the subgroup name. The *default* argument is used for groups that did not participate in the match; it defaults to ``None``. For example::
ru: Возвращает словарь, содержащий все *именованные* подгруппы соответствия, ключом которых является имя подгруппы. Аргумент *default* используется для групп, не участвовавших в сопоставлении; по умолчанию установлено значение «Нет». Например::

source: Return the indices of the start and end of the substring matched by *group*; *group* defaults to zero (meaning the whole matched substring). Return ``-1`` if *group* exists but did not contribute to the match. For a match object *m*, and a group *g* that did contribute to the match, the substring matched by group *g* (equivalent to ``m.group(g)``) is ::
ru: Возвращает индексы начала и конца подстроки, соответствующей *group*; *group* по умолчанию равно нулю (имеется в виду вся совпавшая подстрока). Верните ``-1``, если *group* существует, но не участвовала в совпадении. Для объекта соответствия *m* и группы *g*, которая внесла свой вклад в совпадение, подстрока, совпадающая с группой *g* (эквивалентна ``m.group(g)``), равна ::

source: Note that ``m.start(group)`` will equal ``m.end(group)`` if *group* matched a null string. For example, after ``m = re.search('b(c?)', 'cba')``, ``m.start(0)`` is 1, ``m.end(0)`` is 2, ``m.start(1)`` and ``m.end(1)`` are both 2, and ``m.start(2)`` raises an :exc:`IndexError` exception.
ru: Обратите внимание, что ``m.start(group)`` будет равно ``m.end(group)``, если *group* соответствует нулевой строке. Например, после ``m = re.search('b(c?)', 'cba')``, ``m.start(0)`` равен 1, ``m.end(0)`` равно 2, ``m.start(1)`` и ``m.end(1)`` оба равны 2, а ``m.start(2)`` вызывает исключение :exc:`IndexError`.

source: An example that will remove *remove_this* from email addresses::
ru: Пример удаления *remove_this* из адресов электронной почты::

source: For a match *m*, return the 2-tuple ``(m.start(group), m.end(group))``. Note that if *group* did not contribute to the match, this is ``(-1, -1)``. *group* defaults to zero, the entire match.
ru: Для совпадения *m* верните кортеж из двух ``(m.start(group), m.end(group))``. Обратите внимание: если *group* не участвовала в совпадении, это ``(-1, -1)``. *group* по умолчанию равно нулю, все совпадение.

source: The value of *pos* which was passed to the :meth:`~Pattern.search` or :meth:`~Pattern.match` method of a :ref:`regex object <re-objects>`. This is the index into the string at which the RE engine started looking for a match.
ru: Значение *pos*, которое было передано методу :meth:`~Pattern.search` или :meth:`~Pattern.match` объекта :ref:`regex <re-objects>`. Это индекс строки, с которой механизм RE начал поиск совпадения.

source: The value of *endpos* which was passed to the :meth:`~Pattern.search` or :meth:`~Pattern.match` method of a :ref:`regex object <re-objects>`. This is the index into the string beyond which the RE engine will not go.
ru: Значение *endpos*, которое было передано методу :meth:`~Pattern.search` или :meth:`~Pattern.match` объекта :ref:`regex <re-objects>`. Это индекс строки, за пределы которого механизм RE не выходит.

source: The integer index of the last matched capturing group, or ``None`` if no group was matched at all. For example, the expressions ``(a)b``, ``((a)(b))``, and ``((ab))`` will have ``lastindex == 1`` if applied to the string ``'ab'``, while the expression ``(a)(b)`` will have ``lastindex == 2``, if applied to the same string.
ru: Целочисленный индекс последней совпадающей группы захвата или «Нет», если ни одна группа не была сопоставлена ​​вообще. Например, выражения ``(a)b``, ``((a)(b))`` и ``((ab))`` будут иметь ``lastindex == 1``, ​​если они применяются к строку ``'ab'``, а выражение ``(a)(b)`` будет иметь ``lastindex == 2``, если оно применяется к той же строке.

source: The name of the last matched capturing group, or ``None`` if the group didn't have a name, or if no group was matched at all.
ru: Имя последней совпадающей группы захвата или «Нет», если у группы не было имени или если ни одна группа не была сопоставлена ​​вообще.

source: The :ref:`regular expression object <re-objects>` whose :meth:`~Pattern.match` or :meth:`~Pattern.search` method produced this match instance.
ru: :ref:`Объект регулярного выражения <re-objects>`, чей метод :meth:`~Pattern.match` или :meth:`~Pattern.search` создал этот экземпляр совпадения.

source: The string passed to :meth:`~Pattern.match` or :meth:`~Pattern.search`.
ru: Строка передается в :meth:`~Pattern.match` или :meth:`~Pattern.search`.

source: Added support of :func:`copy.copy` and :func:`copy.deepcopy`. Match objects are considered atomic.
ru: Добавлена ​​поддержка :func:`copy.copy` и :func:`copy.deepcopy`. Объекты совпадений считаются атомарными.

source: Regular Expression Examples
ru: Примеры регулярных выражений

source: Checking for a Pair
ru: Проверка пары

source: In this example, we'll use the following helper function to display match objects a little more gracefully::
ru: В этом примере мы будем использовать следующую вспомогательную функцию для более изящного отображения объектов соответствия:

source: Suppose you are writing a poker program where a player's hand is represented as a 5-character string with each character representing a card, "a" for ace, "k" for king, "q" for queen, "j" for jack, "t" for 10, and "2" through "9" representing the card with that value.
ru: Предположим, вы пишете покерную программу, в которой рука игрока представлена ​​в виде строки из 5 символов, где каждый символ представляет карту: «a» — туз, «k» — король, «q» — дама, «j» — валет, «t» означает 10, а от «2» до «9» представляет карту с этим значением.

source: To see if a given string is a valid hand, one could do the following::
ru: Чтобы проверить, является ли данная строка допустимой рукой, можно сделать следующее:

source: That last hand, ``"727ak"``, contained a pair, or two of the same valued cards. To match this with a regular expression, one could use backreferences as such::
ru: Последняя рука, «727ak», содержала пару или две карты одного достоинства. Чтобы сопоставить это с регулярным выражением, можно использовать обратные ссылки как таковые:

source: To find out what card the pair consists of, one could use the :meth:`~Match.group` method of the match object in the following manner::
ru: Чтобы узнать, из какой карты состоит пара, можно использовать метод :meth:`~Match.group` объекта match следующим образом:

source: Simulating scanf()
ru: Имитация scanf()

source: Regular Expression
ru: Регулярное выражение

source: To extract the filename and numbers from a string like ::
ru: Чтобы извлечь имя файла и номера из строки типа:::

source: The equivalent regular expression would be ::
ru: Эквивалентным регулярным выражением будет:::

source: Python offers different primitive operations based on regular expressions:
ru: Python предлагает различные примитивные операции, основанные на регулярных выражениях:

source: :func:`re.match` checks for a match only at the beginning of the string
ru: :func:`re.match` проверяет совпадение только в начале строки

source: :func:`re.search` checks for a match anywhere in the string (this is what Perl does by default)
ru: :func:`re.search` проверяет совпадение в любом месте строки (это то, что Perl делает по умолчанию)

source: :func:`re.fullmatch` checks for entire string to be a match
ru: :func:`re.fullmatch` проверяет совпадение всей строки

source: Regular expressions beginning with ``'^'`` can be used with :func:`search` to restrict the match at the beginning of the string::
ru: Регулярные выражения, начинающиеся с ``'^'``, можно использовать с :func:`search` для ограничения совпадения в начале строки::

source: Note however that in :const:`MULTILINE` mode :func:`match` only matches at the beginning of the string, whereas using :func:`search` with a regular expression beginning with ``'^'`` will match at the beginning of each line. ::
ru: Однако обратите внимание, что в режиме :const:`MULTILINE` :func:`match` соответствует только началу строки, тогда как использование :func:`search` с регулярным выражением, начинающимся с ``'^'``, будет соответствовать в начало каждой строки. ::

source: Making a Phonebook
ru: Создание телефонной книги

source: :func:`split` splits a string into a list delimited by the passed pattern. The method is invaluable for converting textual data into data structures that can be easily read and modified by Python as demonstrated in the following example that creates a phonebook.
ru: :func:`split` разбивает строку на список, ограниченный переданным шаблоном. Этот метод бесценен для преобразования текстовых данных в структуры данных, которые можно легко читать и изменять с помощью Python, как показано в следующем примере создания телефонной книги.

source: First, here is the input. Normally it may come from a file, here we are using triple-quoted string syntax
ru: Во-первых, вот входные данные. Обычно это может быть получено из файла, здесь мы используем синтаксис строки в тройных кавычках.

source: The entries are separated by one or more newlines. Now we convert the string into a list with each nonempty line having its own entry:
ru: Записи разделяются одной или несколькими символами новой строки. Теперь мы преобразуем строку в список, где каждая непустая строка имеет собственную запись:

source: Finally, split each entry into a list with first name, last name, telephone number, and address. We use the ``maxsplit`` parameter of :func:`split` because the address has spaces, our splitting pattern, in it:
ru: Наконец, разделите каждую запись на список с именем, фамилией, номером телефона и адресом. Мы используем параметр maxsplit функции :func:split, потому что в адресе есть пробелы, наш шаблон разделения:

source: The ``:?`` pattern matches the colon after the last name, so that it does not occur in the result list. With a ``maxsplit`` of ``4``, we could separate the house number from the street name:
ru: Шаблон ``:?`` соответствует двоеточию после фамилии, поэтому он не встречается в списке результатов. Используя maxsplit, равный 4, мы могли бы отделить номер дома от названия улицы:

source: Text Munging
ru: Разрушение текста

source: :func:`sub` replaces every occurrence of a pattern with a string or the result of a function. This example demonstrates using :func:`sub` with a function to "munge" text, or randomize the order of all the characters in each word of a sentence except for the first and last characters::
ru: :func:`sub` заменяет каждое вхождение шаблона строкой или результатом функции. В этом примере показано использование :func:`sub` с функцией «объединения» текста или рандомизации порядка всех символов в каждом слове предложения, за исключением первого и последнего символов::

source: Finding all Adverbs
ru: Поиск всех наречий

source: :func:`findall` matches *all* occurrences of a pattern, not just the first one as :func:`search` does. For example, if a writer wanted to find all of the adverbs in some text, they might use :func:`findall` in the following manner::
ru: :func:`findall` соответствует *всем* вхождениям шаблона, а не только первому, как это делает :func:`search`. Например, если автор хочет найти все наречия в каком-то тексте, он может использовать :func:`findall` следующим образом:

source: Finding all Adverbs and their Positions
ru: Нахождение всех наречий и их позиций

source: Raw String Notation
ru: Обозначение необработанной строки

source: Raw string notation (``r"text"``) keeps regular expressions sane. Without it, every backslash (``'\'``) in a regular expression would have to be prefixed with another one to escape it. For example, the two following lines of code are functionally identical::
ru: Необработанная строковая нотация (``r"text"``) сохраняет работоспособность регулярных выражений. Без него к каждой обратной косой черте (``'\'``) в регулярном выражении нужно было бы добавлять еще один префикс, чтобы избежать ее. Например, две следующие строки кода функционально идентичны:

source: When one wants to match a literal backslash, it must be escaped in the regular expression. With raw string notation, this means ``r"\\"``. Without raw string notation, one must use ``"\\\\"``, making the following lines of code functionally identical::
ru: Если кто-то хочет сопоставить буквальную обратную косую черту, ее необходимо экранировать в регулярном выражении. При записи необработанных строк это означает ``r"\\"``. Без нотации необработанной строки необходимо использовать ``"\\\\"``, делая следующие строки кода функционально идентичными:

source: Writing a Tokenizer
ru: Написание токенизатора

source: A `tokenizer or scanner <https://en.wikipedia.org/wiki/Lexical_analysis>`_ analyzes a string to categorize groups of characters. This is a useful first step in writing a compiler or interpreter.
ru: `Токенизатор или сканер <https://en.wikipedia.org/wiki/Lexical_anasis>`_ анализирует строку для классификации групп символов. Это полезный первый шаг в написании компилятора или интерпретатора.

source: The text categories are specified with regular expressions. The technique is to combine those into a single master regular expression and to loop over successive matches::
ru: Текстовые категории задаются с помощью регулярных выражений. Техника состоит в том, чтобы объединить их в одно главное регулярное выражение и перебрать последовательные совпадения:

source: The tokenizer produces the following output::
ru: Токенизатор выдает следующий результат:

source: Friedl, Jeffrey. Mastering Regular Expressions. 3rd ed., O'Reilly Media, 2009. The third edition of the book no longer covers Python at all, but the first edition covered writing good regular expression patterns in great detail.
ru: Фридл, Джеффри. Освоение регулярных выражений. 3-е изд., O'Reilly Media, 2009. Третье издание книги больше не рассматривает Python вообще, но в первом издании очень подробно описано написание хороших шаблонов регулярных выражений.
