Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/reprlib.po
Languages: ru

source: :mod:`!reprlib` --- Alternate :func:`repr` implementation
ru: :mod:`!reprlib` --- Альтернативная реализация :func:`repr`

source: **Source code:** :source:`Lib/reprlib.py`
ru: **Исходный код:** :source:`Lib/reprlib.py`

source: The :mod:`!reprlib` module provides a means for producing object representations with limits on the size of the resulting strings. This is used in the Python debugger and may be useful in other contexts as well.
ru: Модуль :mod:`!reprlib` предоставляет средства для создания представлений объектов с ограничениями на размер результирующих строк. Это используется в отладчике Python и может быть полезно и в других контекстах.

source: This module provides a class, an instance, and a function:
ru: Этот модуль предоставляет класс, экземпляр и функцию:

source: Class which provides formatting services useful in implementing functions similar to the built-in :func:`repr`; size limits for different object types are added to avoid the generation of representations which are excessively long.
ru: Класс, предоставляющий услуги форматирования, полезные для реализации функций, аналогичных встроенному :func:`repr`; ограничения размера для различных типов объектов добавляются, чтобы избежать создания слишком длинных представлений.

source: The keyword arguments of the constructor can be used as a shortcut to set the attributes of the :class:`Repr` instance. Which means that the following initialization::
ru: Аргументы ключевого слова конструктора можно использовать как ярлык для установки атрибутов экземпляра :class:`Repr`. Это означает, что следующая инициализация::

source: Is equivalent to::
ru: Это эквивалентно::

source: See section `Repr Objects`_ for more information about :class:`Repr` attributes.
ru: См. раздел `Объекты Repr`_ для получения дополнительной информации об атрибутах :class:`Repr`.

source: Allow attributes to be set via keyword arguments.
ru: Разрешить установку атрибутов с помощью аргументов ключевого слова.

source: This is an instance of :class:`Repr` which is used to provide the :func:`.repr` function described below. Changing the attributes of this object will affect the size limits used by :func:`.repr` and the Python debugger.
ru: Это экземпляр :class:`Repr`, который используется для предоставления функции :func:`.repr`, описанной ниже. Изменение атрибутов этого объекта повлияет на ограничения размера, используемые :func:`.repr` и отладчиком Python.

source: This is the :meth:`~Repr.repr` method of ``aRepr``. It returns a string similar to that returned by the built-in function of the same name, but with limits on most sizes.
ru: Это метод :meth:`~Repr.repr` ``aRepr``. Он возвращает строку, аналогичную той, которую возвращает одноименная встроенная функция, но с ограничениями на большинство размеров.

source: In addition to size-limiting tools, the module also provides a decorator for detecting recursive calls to :meth:`~object.__repr__` and substituting a placeholder string instead.
ru: В дополнение к инструментам ограничения размера, модуль также предоставляет декоратор для обнаружения рекурсивных вызовов :meth:`~object.__repr__` и замены вместо этого строки-заполнителя.

source: Decorator for :meth:`~object.__repr__` methods to detect recursive calls within the same thread. If a recursive call is made, the *fillvalue* is returned, otherwise, the usual :meth:`!__repr__` call is made. For example:
ru: Декоратор для методов :meth:`~object.__repr__` для обнаружения рекурсивных вызовов внутри одного потока. Если выполняется рекурсивный вызов, возвращается *fillvalue*, в противном случае выполняется обычный вызов :meth:`!__repr__`. Например:

source: Repr Objects
ru: Репродукция объектов

source: :class:`Repr` instances provide several attributes which can be used to provide size limits for the representations of different object types, and methods which format specific object types.
ru: Экземпляры :class:`Repr` предоставляют несколько атрибутов, которые можно использовать для ограничения размера представлений различных типов объектов, а также методов, форматирующих определенные типы объектов.

source: This string is displayed for recursive references. It defaults to ``...``.
ru: Эта строка отображается для рекурсивных ссылок. По умолчанию это ``...``.

source: Depth limit on the creation of recursive representations. The default is ``6``.
ru: Ограничение глубины создания рекурсивных представлений. По умолчанию установлено ``6``.

source: Limits on the number of entries represented for the named object type. The default is ``4`` for :attr:`maxdict`, ``5`` for :attr:`maxarray`, and ``6`` for the others.
ru: Ограничения на количество записей, представленных для именованного типа объекта. По умолчанию используется ``4`` для :attr:`maxdict`, ``5`` для :attr:`maxarray` и ``6`` для остальных.

source: Maximum number of characters in the representation for an integer. Digits are dropped from the middle. The default is ``40``.
ru: Максимальное количество символов в представлении целого числа. Цифры опущены из середины. По умолчанию установлено ``40``.

source: Limit on the number of characters in the representation of the string. Note that the "normal" representation of the string is used as the character source: if escape sequences are needed in the representation, these may be mangled when the representation is shortened. The default is ``30``.
ru: Ограничение количества символов в представлении строки. Обратите внимание, что в качестве источника символов используется «нормальное» представление строки: если в представлении необходимы escape-последовательности, они могут быть искажены при сокращении представления. По умолчанию установлено ``30``.

source: This limit is used to control the size of object types for which no specific formatting method is available on the :class:`Repr` object. It is applied in a similar manner as :attr:`maxstring`. The default is ``20``.
ru: Это ограничение используется для управления размером типов объектов, для которых в объекте :class:`Repr` не доступен конкретный метод форматирования. Он применяется аналогично :attr:`maxstring`. По умолчанию установлено ``20``.

source: If this attribute is set to ``None`` (the default), the output is formatted with no line breaks or indentation, like the standard :func:`repr`. For example:
ru: Если для этого атрибута установлено значение «Нет» (по умолчанию), выходные данные форматируются без разрывов строк и отступов, как в стандартном :func:`repr`. Например:

source: If :attr:`~Repr.indent` is set to a string, each recursion level is placed on its own line, indented by that string:
ru: Если :attr:`~Repr.indent` установлен на строку, каждый уровень рекурсии размещается на отдельной строке с отступом этой строки:

source: Setting :attr:`~Repr.indent` to a positive integer value behaves as if it was set to a string with that number of spaces:
ru: Установка :attr:`~Repr.indent` положительного целочисленного значения ведет себя так, как если бы ему была присвоена строка с таким количеством пробелов:

source: The equivalent to the built-in :func:`repr` that uses the formatting imposed by the instance.
ru: Эквивалент встроенной функции :func:`repr`, которая использует форматирование, заданное экземпляром.

source: Recursive implementation used by :meth:`.repr`. This uses the type of *obj* to determine which formatting method to call, passing it *obj* and *level*. The type-specific methods should call :meth:`repr1` to perform recursive formatting, with ``level - 1`` for the value of *level* in the recursive call.
ru: Рекурсивная реализация, используемая :meth:`.repr`. При этом используется тип *obj*, чтобы определить, какой метод форматирования вызывать, передавая ему *obj* и *level*. Методы, специфичные для типа, должны вызывать :meth:`repr1` для выполнения рекурсивного форматирования с ``level - 1`` для значения *level* в рекурсивном вызове.

source: Formatting methods for specific types are implemented as methods with a name based on the type name. In the method name, **TYPE** is replaced by ``'_'.join(type(obj).__name__.split())``. Dispatch to these methods is handled by :meth:`repr1`. Type-specific methods which need to recursively format a value should call ``self.repr1(subobj, level - 1)``.
ru: Методы форматирования для конкретных типов реализованы как методы с именем, основанным на имени типа. В имени метода **TYPE** заменяется на ``'_'.join(type(obj).__name__.split())``. Отправка этим методам осуществляется с помощью :meth:`repr1`. Методы, специфичные для типа, которым необходимо рекурсивно форматировать значение, должны вызывать ``self.repr1(subobj, level - 1)``.

source: Subclassing Repr Objects
ru: Создание подклассов объектов Repr

source: The use of dynamic dispatching by :meth:`Repr.repr1` allows subclasses of :class:`Repr` to add support for additional built-in object types or to modify the handling of types already supported. This example shows how special support for file objects could be added:
ru: Использование динамической диспетчеризации с помощью :meth:`Repr.repr1` позволяет подклассам :class:`Repr` добавлять поддержку дополнительных встроенных типов объектов или изменять обработку уже поддерживаемых типов. В этом примере показано, как можно добавить специальную поддержку файловых объектов:
