Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/resource.po
Languages: ru

source: :mod:`!resource` --- Resource usage information
ru: :mod:`!resource` --- Информация об использовании ресурса

source: This module provides basic mechanisms for measuring and controlling system resources utilized by a program.
ru: Этот модуль предоставляет базовые механизмы для измерения и контроля системных ресурсов, используемых программой.

source: Availability
ru: Доступность

source: Symbolic constants are used to specify particular system resources and to request usage information about either the current process or its children.
ru: Символические константы используются для указания конкретных системных ресурсов и для запроса информации об использовании текущего процесса или его дочерних элементов.

source: An :exc:`OSError` is raised on syscall failure.
ru: При сбое системного вызова возникает ошибка :exc:`OSError`.

source: A deprecated alias of :exc:`OSError`.
ru: Устаревший псевдоним :exc:`OSError`.

source: Following :pep:`3151`, this class was made an alias of :exc:`OSError`.
ru: После :pep:`3151` этому классу был присвоен псевдоним :exc:`OSError`.

source: Resource Limits
ru: Лимиты ресурсов

source: Resources usage can be limited using the :func:`setrlimit` function described below. Each resource is controlled by a pair of limits: a soft limit and a hard limit. The soft limit is the current limit, and may be lowered or raised by a process over time. The soft limit can never exceed the hard limit. The hard limit can be lowered to any value greater than the soft limit, but not raised. (Only processes with the effective UID of the super-user can raise a hard limit.)
ru: Использование ресурсов можно ограничить с помощью функции :func:`setrlimit`, описанной ниже. Каждый ресурс контролируется парой лимитов: мягким лимитом и жестким лимитом. Мягкий предел — это текущий предел, который может со временем понижаться или повышаться в ходе процесса. Мягкий предел никогда не может превышать жесткий предел. Жесткий предел можно снизить до любого значения, превышающего мягкий предел, но не повысить. (Только процессы с эффективным UID суперпользователя могут поднять жесткий предел.)

source: The specific resources that can be limited are system dependent. They are described in the :manpage:`getrlimit(2)` man page. The resources listed below are supported when the underlying operating system supports them; resources which cannot be checked or controlled by the operating system are not defined in this module for those platforms.
ru: Конкретные ресурсы, которые могут быть ограничены, зависят от системы. Они описаны на странице руководства :manpage:`getrlimit(2)`. Перечисленные ниже ресурсы поддерживаются, если их поддерживает базовая операционная система; ресурсы, которые не могут быть проверены или проконтролированы операционной системой, не определены в этом модуле для этих платформ.

source: Constant used to represent the limit for an unlimited resource.
ru: Константа используется для обозначения предела неограниченного ресурса.

source: Returns a tuple ``(soft, hard)`` with the current soft and hard limits of *resource*. Raises :exc:`ValueError` if an invalid resource is specified, or :exc:`error` if the underlying system call fails unexpectedly.
ru: Возвращает кортеж ``(soft, hard)`` с текущими мягкими и жесткими ограничениями *resource*. Вызывает :exc:`ValueError`, если указан недопустимый ресурс, или :exc:`error`, если базовый системный вызов неожиданно завершается сбоем.

source: Sets new limits of consumption of *resource*. The *limits* argument must be a tuple ``(soft, hard)`` of two integers describing the new limits. A value of :data:`~resource.RLIM_INFINITY` can be used to request a limit that is unlimited.
ru: Устанавливает новые лимиты потребления *ресурса*. Аргумент *limits* должен представлять собой кортеж ``(soft, hard)`` из двух целых чисел, описывающих новые ограничения. Значение :data:`~resource.RLIM_INFINITY` можно использовать для запроса неограниченного лимита.

source: Raises :exc:`ValueError` if an invalid resource is specified, if the new soft limit exceeds the hard limit, or if a process tries to raise its hard limit. Specifying a limit of :data:`~resource.RLIM_INFINITY` when the hard or system limit for that resource is not unlimited will result in a :exc:`ValueError`. A process with the effective UID of super-user can request any valid limit value, including unlimited, but :exc:`ValueError` will still be raised if the requested limit exceeds the system imposed limit.
ru: Вызывает :exc:`ValueError`, если указан недопустимый ресурс, если новый мягкий предел превышает жесткий предел или если процесс пытается повысить свой жесткий предел. Указание ограничения :data:`~resource.RLIM_INFINITY`, когда жесткое или системное ограничение для этого ресурса не является неограниченным, приведет к ошибке :exc:`ValueError`. Процесс с действующим UID суперпользователя может запросить любое допустимое предельное значение, включая неограниченное, но :exc:`ValueError` все равно будет выдаваться, если запрошенный лимит превышает установленный системой лимит.

source: ``setrlimit`` may also raise :exc:`error` if the underlying system call fails.
ru: ``setrlimit`` может также вызвать :exc:`error`, если базовый системный вызов завершился неудачно.

source: VxWorks only supports setting :data:`RLIMIT_NOFILE`.
ru: VxWorks поддерживает только настройку :data:`RLIMIT_NOFILE`.

source: Raises an :ref:`auditing event <auditing>` ``resource.setrlimit`` with arguments ``resource``, ``limits``.
ru: Вызывает :ref:`событие аудита <auditing>` ``resource.setrlimit`` с аргументами ``resource``, ``limits``.

source: Combines :func:`setrlimit` and :func:`getrlimit` in one function and supports to get and set the resources limits of an arbitrary process. If *pid* is 0, then the call applies to the current process. *resource* and *limits* have the same meaning as in :func:`setrlimit`, except that *limits* is optional.
ru: Сочетает :func:`setrlimit` и :func:`getrlimit` в одной функции и поддерживает получение и установку ограничений ресурсов произвольного процесса. Если *pid* равен 0, вызов применяется к текущему процессу. *resource* и *limits* имеют то же значение, что и в :func:`setrlimit`, за исключением того, что *limits* является необязательным.

source: When *limits* is not given the function returns the *resource* limit of the process *pid*. When *limits* is given the *resource* limit of the process is set and the former resource limit is returned.
ru: Если *limits* не задано, функция возвращает ограничение *resource* процесса *pid*. Когда задано *limits*, устанавливается ограничение *resource* процесса и возвращается прежнее ограничение ресурса.

source: Raises :exc:`ProcessLookupError` when *pid* can't be found and :exc:`PermissionError` when the user doesn't have ``CAP_SYS_RESOURCE`` for the process.
ru: Вызывает :exc:`ProcessLookupError`, когда *pid* не может быть найден, и :exc:`PermissionError`, когда у пользователя нет ``CAP_SYS_RESOURCE`` для процесса.

source: Raises an :ref:`auditing event <auditing>` ``resource.prlimit`` with arguments ``pid``, ``resource``, ``limits``.
ru: Вызывает :ref:`событие аудита <auditing>` ``resource.prlimit`` с аргументами ``pid``, ``resource``, ``limits``.

source: These symbols define resources whose consumption can be controlled using the :func:`setrlimit` and :func:`getrlimit` functions described below. The values of these symbols are exactly the constants used by C programs.
ru: Эти символы определяют ресурсы, потреблением которых можно управлять с помощью функций :func:`setrlimit` и :func:`getrlimit`, описанных ниже. Значения этих символов в точности соответствуют константам, используемым программами на языке C.

source: The Unix man page for :manpage:`getrlimit(2)` lists the available resources. Note that not all systems use the same symbol or same value to denote the same resource. This module does not attempt to mask platform differences --- symbols not defined for a platform will not be available from this module on that platform.
ru: На странице руководства Unix для :manpage:`getrlimit(2)` перечислены доступные ресурсы. Обратите внимание, что не все системы используют один и тот же символ или одно и то же значение для обозначения одного и того же ресурса. Этот модуль не пытается скрыть различия платформ — символы, не определенные для платформы, не будут доступны из этого модуля на этой платформе.

source: The maximum size (in bytes) of a core file that the current process can create. This may result in the creation of a partial core file if a larger core would be required to contain the entire process image.
ru: Максимальный размер (в байтах) основного файла, который может создать текущий процесс. Это может привести к созданию частичного файла ядра, если для хранения всего образа процесса потребуется ядро ​​большего размера.

source: The maximum amount of processor time (in seconds) that a process can use. If this limit is exceeded, a :const:`SIGXCPU` signal is sent to the process. (See the :mod:`signal` module documentation for information about how to catch this signal and do something useful, e.g. flush open files to disk.)
ru: Максимальное количество процессорного времени (в секундах), которое может использовать процесс. Если этот предел превышен, процессу отправляется сигнал :const:`SIGXCPU`. (См. документацию модуля :mod:`signal` для получения информации о том, как перехватить этот сигнал и сделать что-нибудь полезное, например, записать открытые файлы на диск.)

source: The maximum size of a file which the process may create.
ru: Максимальный размер файла, который может создать процесс.

source: The maximum size (in bytes) of the process's heap.
ru: Максимальный размер (в байтах) кучи процесса.

source: The maximum size (in bytes) of the call stack for the current process. This only affects the stack of the main thread in a multi-threaded process.
ru: Максимальный размер (в байтах) стека вызовов текущего процесса. Это влияет только на стек основного потока в многопоточном процессе.

source: The maximum resident set size that should be made available to the process.
ru: Максимальный размер резидентного набора, который должен быть доступен процессу.

source: The maximum number of processes the current process may create.
ru: Максимальное количество процессов, которые может создать текущий процесс.

source: The maximum number of open file descriptors for the current process.
ru: Максимальное количество открытых файловых дескрипторов для текущего процесса.

source: The BSD name for :const:`RLIMIT_NOFILE`.
ru: Имя BSD для :const:`RLIMIT_NOFILE`.

source: The maximum address space which may be locked in memory.
ru: Максимальное адресное пространство, которое может быть заблокировано в памяти.

source: The largest area of mapped memory which the process may occupy.
ru: Самая большая область отображаемой памяти, которую может занимать процесс.

source: The maximum area (in bytes) of address space which may be taken by the process.
ru: Максимальная область (в байтах) адресного пространства, которую может занять процесс.

source: The number of bytes that can be allocated for POSIX message queues.
ru: Число байтов, которые можно выделить для очередей сообщений POSIX.

source: The ceiling for the process's nice level (calculated as 20 - rlim_cur).
ru: Потолок приятного уровня процесса (рассчитывается как 20 - rlim_cur).

source: The ceiling of the real-time priority.
ru: Потолок приоритета реального времени.

source: The time limit (in microseconds) on CPU time that a process can spend under real-time scheduling without making a blocking syscall.
ru: Ограничение времени (в микросекундах) процессорного времени, которое процесс может потратить при планировании в реальном времени без выполнения блокирующего системного вызова.

source: The number of signals which the process may queue.
ru: Количество сигналов, которые процесс может поставить в очередь.

source: The maximum size (in bytes) of socket buffer usage for this user. This limits the amount of network memory, and hence the amount of mbufs, that this user may hold at any time.
ru: Максимальный размер (в байтах) использования буфера сокета для этого пользователя. Это ограничивает объем сетевой памяти и, следовательно, объем mbufs, который этот пользователь может хранить в любое время.

source: The maximum size (in bytes) of the swap space that may be reserved or used by all of this user id's processes. This limit is enforced only if bit 1 of the vm.overcommit sysctl is set. Please see `tuning(7) <https://man.freebsd.org/cgi/man.cgi?query=tuning&sektion=7>`__ for a complete description of this sysctl.
ru: Максимальный размер (в байтах) пространства подкачки, которое может быть зарезервировано или использовано всеми процессами с этим идентификатором пользователя. Это ограничение применяется только в том случае, если установлен бит 1 sysctl vm.overcommit. Пожалуйста, смотрите `tuning(7) <https://man.freebsd.org/cgi/man.cgi?query=tuning&sektion=7>`__ для полного описания этого sysctl.

source: The maximum number of pseudo-terminals created by this user id.
ru: Максимальное количество псевдотерминалов, созданных этим идентификатором пользователя.

source: The maximum number of kqueues this user id is allowed to create.
ru: Максимальное количество kочередей, которые может создать этот идентификатор пользователя.

source: Resource Usage
ru: Использование ресурсов

source: These functions are used to retrieve resource usage information:
ru: Эти функции используются для получения информации об использовании ресурсов:

source: This function returns an object that describes the resources consumed by either the current process or its children, as specified by the *who* parameter. The *who* parameter should be specified using one of the :const:`!RUSAGE_\*` constants described below.
ru: Эта функция возвращает объект, описывающий ресурсы, потребляемые текущим процессом или его дочерними процессами, как указано параметром *who*. Параметр *who* должен быть указан с использованием одной из констант :const:`!RUSAGE_\*`, описанных ниже.

source: A simple example::
ru: Простой пример::

source: The fields of the return value each describe how a particular system resource has been used, e.g. amount of time spent running is user mode or number of times the process was swapped out of main memory. Some values are dependent on the clock tick internal, e.g. the amount of memory the process is using.
ru: Каждое из полей возвращаемого значения описывает, как использовался конкретный системный ресурс, например, количество времени, затраченное на работу в пользовательском режиме, или количество раз, когда процесс был выгружен из основной памяти. Некоторые значения зависят от внутреннего такта часов, например, от объема памяти, используемой процессом.

source: For backward compatibility, the return value is also accessible as a tuple of 16 elements.
ru: Для обратной совместимости возвращаемое значение также доступно в виде кортежа из 16 элементов.

source: The fields :attr:`ru_utime` and :attr:`ru_stime` of the return value are floating-point values representing the amount of time spent executing in user mode and the amount of time spent executing in system mode, respectively. The remaining values are integers. Consult the :manpage:`getrusage(2)` man page for detailed information about these values. A brief summary is presented here:
ru: Поля :attr:`ru_utime` и :attr:`ru_stime` возвращаемого значения представляют собой значения с плавающей запятой, представляющие количество времени, затраченное на выполнение в пользовательском режиме, и количество времени, затраченное на выполнение в системном режиме, соответственно. Остальные значения являются целыми числами. Обратитесь к странице руководства :manpage:`getrusage(2)` для получения подробной информации об этих значениях. Краткое содержание представлено здесь:

source: Index
ru: Индекс

source: Field
ru: Поле

source: Resource
ru: Ресурс

source: time in user mode (float seconds)
ru: время в пользовательском режиме (в секундах с плавающей запятой)

source: time in system mode (float seconds)
ru: время в системном режиме (секунды с плавающей запятой)

source: maximum resident set size
ru: максимальный размер резидентного набора

source: shared memory size
ru: размер общей памяти

source: unshared memory size
ru: объем неразделяемой памяти

source: unshared stack size
ru: размер неразделенного стека

source: page faults not requiring I/O
ru: ошибки страниц, не требующие ввода-вывода

source: page faults requiring I/O
ru: ошибки страниц, требующие ввода-вывода

source: number of swap outs
ru: количество свопов

source: block input operations
ru: блок операции ввода

source: block output operations
ru: блок операции вывода

source: messages sent
ru: отправленные сообщения

source: messages received
ru: полученные сообщения

source: signals received
ru: полученные сигналы

source: voluntary context switches
ru: добровольное переключение контекста

source: involuntary context switches
ru: непроизвольное переключение контекста

source: This function will raise a :exc:`ValueError` if an invalid *who* parameter is specified. It may also raise :exc:`error` exception in unusual circumstances.
ru: Эта функция вызовет :exc:`ValueError`, если указан неверный параметр *who*. Это также может вызвать исключение :exc:`error` в необычных обстоятельствах.

source: Returns the number of bytes in a system page. (This need not be the same as the hardware page size.)
ru: Возвращает количество байтов в системной странице. (Этот размер не обязательно должен совпадать с аппаратным размером страницы.)

source: The following :const:`!RUSAGE_\*` symbols are passed to the :func:`getrusage` function to specify which processes information should be provided for.
ru: Следующие символы :const:`!RUSAGE_\*` передаются в функцию :func:`getrusage`, чтобы указать, для каких процессов должна быть предоставлена ​​информация.

source: Pass to :func:`getrusage` to request resources consumed by the calling process, which is the sum of resources used by all threads in the process.
ru: Перейдите к :func:`getrusage`, чтобы запросить ресурсы, потребляемые вызывающим процессом, которые представляют собой сумму ресурсов, используемых всеми потоками в процессе.

source: Pass to :func:`getrusage` to request resources consumed by child processes of the calling process which have been terminated and waited for.
ru: Перейдите к :func:`getrusage`, чтобы запросить ресурсы, потребляемые дочерними процессами вызывающего процесса, которые были завершены и ожидаются.

source: Pass to :func:`getrusage` to request resources consumed by both the current process and child processes. May not be available on all systems.
ru: Перейдите к :func:`getrusage`, чтобы запросить ресурсы, потребляемые как текущим процессом, так и дочерними процессами. Может быть доступно не во всех системах.

source: Pass to :func:`getrusage` to request resources consumed by the current thread. May not be available on all systems.
ru: Перейдите к :func:`getrusage`, чтобы запросить ресурсы, потребляемые текущим потоком. Может быть доступно не во всех системах.
