Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/secrets.po
Languages: ru

source: **Source code:** :source:`Lib/secrets.py`
ru: **Исходный код:** :source:`Lib/secrets.py`

source: The :mod:`secrets` module is used for generating cryptographically strong random numbers suitable for managing data such as passwords, account authentication, security tokens, and related secrets.
ru: Модуль :mod:`secrets` используется для генерации криптостойких случайных чисел, подходящих для управления такими данными, как пароли, аутентификация учетных записей, токены безопасности и связанные с ними секреты.

source: In particular, :mod:`secrets` should be used in preference to the default pseudo-random number generator in the :mod:`random` module, which is designed for modelling and simulation, not security or cryptography.
ru: В частности, :mod:`secrets` следует использовать вместо генератора псевдослучайных чисел по умолчанию в модуле :mod:`random`, который предназначен для моделирования и симуляции, а не для обеспечения безопасности или криптографии.

source: Random numbers
ru: Случайные числа

source: The :mod:`secrets` module provides access to the most secure source of randomness that your operating system provides.
ru: Модуль :mod:`secrets` обеспечивает доступ к самому безопасному источнику случайных данных, который предоставляет ваша операционная система.

source: A class for generating random numbers using the highest-quality sources provided by the operating system. See :class:`random.SystemRandom` for additional details.
ru: Класс для генерации случайных чисел с использованием источников самого высокого качества, предоставляемых операционной системой. Дополнительную информацию см. в :class:`random.SystemRandom`.

source: Return a randomly chosen element from a non-empty sequence.
ru: Вернуть случайно выбранный элемент из непустой последовательности.

source: Generating tokens
ru: Генерация токенов

source: The :mod:`secrets` module provides functions for generating secure tokens, suitable for applications such as password resets, hard-to-guess URLs, and similar.
ru: Модуль :mod:`secrets` предоставляет функции для генерации токенов безопасности, подходящих для таких приложений, как сброс пароля, трудно угадываемые URL-адреса и тому подобное.

source: Return a random byte string containing *nbytes* number of bytes. If *nbytes* is ``None`` or not supplied, a reasonable default is used.
ru: Возвращает случайную строку байтов, содержащую *nbytes* количество байтов. Если *nbytes* имеет значение None или не указано, используется разумное значение по умолчанию.

source: Return a random text string, in hexadecimal. The string has *nbytes* random bytes, each byte converted to two hex digits. If *nbytes* is ``None`` or not supplied, a reasonable default is used.
ru: Возвращает случайную текстовую строку в шестнадцатеричном формате. Строка содержит *nbytes* случайных байтов, каждый байт преобразуется в две шестнадцатеричные цифры. Если *nbytes* имеет значение None или не указано, используется разумное значение по умолчанию.

source: Return a random URL-safe text string, containing *nbytes* random bytes. The text is Base64 encoded, so on average each byte results in approximately 1.3 characters. If *nbytes* is ``None`` or not supplied, a reasonable default is used.
ru: Возвращает случайную текстовую строку, безопасную для URL-адресов, содержащую *nbytes* случайные байты. Текст закодирован Base64, поэтому в среднем каждый байт содержит примерно 1,3 символа. Если *nbytes* имеет значение None или не указано, используется разумное значение по умолчанию.

source: How many bytes should tokens use?
ru: Сколько байтов должны использовать токены?

source: To be secure against `brute-force attacks <https://en.wikipedia.org/wiki/Brute-force_attack>`_, tokens need to have sufficient randomness. Unfortunately, what is considered sufficient will necessarily increase as computers get more powerful and able to make more guesses in a shorter period. As of 2015, it is believed that 32 bytes (256 bits) of randomness is sufficient for the typical use-case expected for the :mod:`secrets` module.
ru: Чтобы быть защищенными от `грубых атак <https://en.wikipedia.org/wiki/Brute-force_attack>`_, токены должны иметь достаточную случайность. К сожалению, то, что считается достаточным, обязательно увеличится по мере того, как компьютеры станут более мощными и смогут делать больше предположений за более короткий период. По состоянию на 2015 год считается, что 32 байта (256 бит) случайности достаточно для типичного сценария использования, ожидаемого для модуля :mod:`secrets`.

source: For those who want to manage their own token length, you can explicitly specify how much randomness is used for tokens by giving an :class:`int` argument to the various ``token_*`` functions. That argument is taken as the number of bytes of randomness to use.
ru: Для тех, кто хочет управлять длиной своего токена, вы можете явно указать, какая степень случайности используется для токенов, передав аргумент :class:`int` различным функциям ``token_*``. Этот аргумент принимается за количество используемых случайных байтов.

source: Otherwise, if no argument is provided, or if the argument is ``None``, the ``token_*`` functions will use a reasonable default instead.
ru: В противном случае, если аргумент не указан или если аргумент равен None, функции token_*`` вместо этого будут использовать разумное значение по умолчанию.

source: That default is subject to change at any time, including during maintenance releases.
ru: Это значение по умолчанию может быть изменено в любое время, в том числе во время обновлений.

source: Other functions
ru: Другие функции

source: Return ``True`` if strings or :term:`bytes-like objects <bytes-like object>` *a* and *b* are equal, otherwise ``False``, using a "constant-time compare" to reduce the risk of `timing attacks <https://codahale.com/a-lesson-in-timing-attacks/>`_. See :func:`hmac.compare_digest` for additional details.
ru: Возвращайте ``True``, если строки или :term:`bytes-like object <bytes-like object>` *a* и *b* равны, в противном случае ``False``, используя «сравнение в постоянном времени» для снизить риск `временных атак <https://codahale.com/a-lesson-in-timing-attacks/>`_. Дополнительную информацию см. в :func:`hmac.compare_digest`.

source: Recipes and best practices
ru: Рецепты и лучшие практики

source: This section shows recipes and best practices for using :mod:`secrets` to manage a basic level of security.
ru: В этом разделе показаны рецепты и лучшие практики использования :mod:`secrets` для управления базовым уровнем безопасности.

source: Generate an eight-character alphanumeric password:
ru: Создайте восьмизначный буквенно-цифровой пароль:

source: Generate a ten-character alphanumeric password with at least one lowercase character, at least one uppercase character, and at least three digits:
ru: Создайте десятизначный буквенно-цифровой пароль, содержащий хотя бы один символ нижнего регистра, хотя бы один символ верхнего регистра и как минимум три цифры:

source: Generate an `XKCD-style passphrase <https://xkcd.com/936/>`_:
ru: Создайте парольную фразу в стиле XKCD <https://xkcd.com/936/>`_:

source: Generate a hard-to-guess temporary URL containing a security token suitable for password recovery applications:
ru: Создайте трудно угадываемый временный URL-адрес, содержащий токен безопасности, подходящий для приложений по восстановлению пароля:
