Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/security_warnings.po
Languages: cs, id_id, ru

source: Security Considerations
cs: Bezpečnostní aspekty
id_id: Pertimbangan Keamanan
ru: Вопросы безопасности

source: The following modules have specific security considerations:
cs: K následujícím modulům se váží specifické bezpečnostní aspekty:
id_id: Modul-modul berikut ini memiliki pertimbangan keamanan yang spesifik:
ru: Следующие модули имеют особые соображения безопасности:

source: :mod:`cgi`: :ref:`CGI security considerations <cgi-security>`
ru: :mod:`cgi`: :ref:`Соображения безопасности CGI <cgi-security>`

source: :mod:`hashlib`: :ref:`all constructors take a "usedforsecurity" keyword-only argument disabling known insecure and blocked algorithms <hashlib-usedforsecurity>`
cs: :mod:`hashlib`: :ref:`všechny konstruktory berou "usedforsecurity" keyword-only parametr, který zakáže známé nezabezpečené a blokované aloritmy <hashlib-usedforsecurity>`
id_id: :mod:`hashlib`: :ref:`semua konstruktor hanya menggunakan argumen dengan kata kunci "usedforsecurity", menonaktifkan algoritma-algoritma yang diketahui tidak aman dan diblokir.
ru: :mod:`hashlib`: :ref:`все конструкторы принимают аргумент, содержащий только ключевое слово "usedforsecurity", отключающий известные небезопасные и заблокированные алгоритмы <hashlib-usedforsecurity>`

source: :mod:`http.server` is not suitable for production use, only implementing basic security checks. See the :ref:`security considerations <http.server-security>`.
ru: :mod:`http.server` не подходит для промышленного использования, он реализует только базовые проверки безопасности. См. :ref:`соображения безопасности <http.server-security>`.

source: :mod:`logging`: :ref:`Logging configuration uses eval() <logging-eval-security>`
cs: :mod:`logging`: :ref:`Konfigurace logování používá eval() <logging-eval-security>`
id_id: :mod:`logging`: :ref:`Konfigurasi pencatatan menggunakan eval() <logging-eval-security>`
ru: :mod:`logging`: :ref:`Конфигурация ведения журнала использует eval() <logging-eval-security>`

source: :mod:`multiprocessing`: :ref:`Connection.recv() uses pickle <multiprocessing-recv-pickle-security>`
cs: :mod:`multiprocessing`: :ref:`Connection.recv() používá pickle <multiprocessing-recv-pickle-security>`
id_id: :mod:`multiprocessing`: :ref:`Connection.recv() menggunakan pickle<multiprocessing-recv-pickle-security>`
ru: :mod:`multiprocessing`: :ref:`Connection.recv() использует Pickle <multiprocessing-recv-pickle-security>`

source: :mod:`pickle`: :ref:`Restricting globals in pickle <pickle-restrict>`
cs: :mod:`pickle`: :ref:`Omezení globálních jmen v pickle <pickle-restrict>`
id_id: :mod:`pickle`: :ref:`Membatasi globals pada pickle <pickle-restrict>`
ru: :mod:`pickle`: :ref:`Ограничение глобальных переменных в рассоле <pickle-restrict>`

source: :mod:`random` shouldn't be used for security purposes, use :mod:`secrets` instead
cs: :mod:`random` nesmí být použit k účelům zabezpečení, namísto něj použijte :mod:`secrets`
id_id: :mod:`random` tidak boleh digunakan untuk tujuan keamanan, gunakan :mod:`secrets` sebagai gantinya
ru: :mod:`random` не следует использовать в целях безопасности, вместо этого используйте :mod:`secrets`

source: :mod:`shelve`: :ref:`shelve is based on pickle and thus unsuitable for dealing with untrusted sources <shelve-security>`
cs: :mod:`shelve`: :ref:`shelve je postaven na modulu pickle, a je tudíž nevhodný ke zpracování dat z nedůvěryhodných zdrojů <shelve-security>`
id_id: :mod:`shelve`: :ref:`shelve berdasarkan pada pickle dan oleh sebab itu tidak cocok untuk menangani sumber-sumber yang tidak terpercaya <shelve-security>`
ru: :mod:`shelve`: :ref:`shelve основан на рассоле и поэтому не подходит для работы с ненадежными источниками <shelve-security>`

source: :mod:`ssl`: :ref:`SSL/TLS security considerations <ssl-security>`
cs: :mod:`ssl`: :ref:`Bezpečnostní aspekty SSL/TLS <ssl-security>`
id_id: :mod:`ssl`: :ref:`Pertimbangan keamanan SSL/TLSÂ <ssl-security>`
ru: :mod:`ssl`: :ref:`Аспекты безопасности SSL/TLS <ssl-security>`

source: :mod:`subprocess`: :ref:`Subprocess security considerations <subprocess-security>`
cs: :mod:`subprocess`: :ref:`Bezpečností aspekty podprocesů <subprocess-security>`
id_id: :mod:`subprocess`: :ref:`Pertimbangan keamanan subprocess <subprocess-security>`
ru: :mod:`subprocess`: :ref:`Аспекты безопасности подпроцесса <subprocess-security>`

source: :mod:`tempfile`: :ref:`mktemp is deprecated due to vulnerability to race conditions <tempfile-mktemp-deprecated>`
cs: :mod:`tempfile`: :ref:`mktemp je deprikovaný, neboť je náchylný k souběhům (race conditions) <tempfile-mktemp-deprecated>`
id_id: :mod:`tempfile`: :ref:`mktempt sudah tidak digunakan lagi oleh karena rentan terhadap race condition <tempfile-mktemp-deprecated>`
ru: :mod:`tempfile`: :ref:`mktemp устарел из-за уязвимости к условиям гонки <tempfile-mktemp-deprecated>`

source: :mod:`xml`: :ref:`XML vulnerabilities <xml-vulnerabilities>`
cs: :mod:`xml`: :ref:`XML zranitelnosti <xml-vulnerabilities>`
id_id: :mod:`xml`: :ref:`Kerentanan XML <xml-vulnerabilities>`
ru: :mod:`xml`: :ref:`Уязвимости XML <xml-vulnerabilities>`

source: :mod:`zipfile`: :ref:`maliciously prepared .zip files can cause disk volume exhaustion <zipfile-resources-limitations>`
cs: :mod:`zipfile`: :ref:`útočníkem připravené soubory .zip mohou vyčerpat všechno dostupné místo na disku <zipfile-resources-limitations>`
id_id: :mod:`zipfile`: :ref:`File-file .zip yang disiapkan dengan maksud jahat dapat menyebabkan kehabisan volume disk <zipfile-resources-limitations>`
ru: :mod:`zipfile`: :ref:`злоумышленно подготовленные .zip-файлы могут привести к исчерпанию объема диска <zipfile-resources-limitations>`
