Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/selectors.po
Languages: ru

source: **Source code:** :source:`Lib/selectors.py`
ru: **Исходный код:** :source:`Lib/selectors.py`

source: Introduction
ru: Введение

source: This module allows high-level and efficient I/O multiplexing, built upon the :mod:`select` module primitives. Users are encouraged to use this module instead, unless they want precise control over the OS-level primitives used.
ru: Этот модуль обеспечивает высокоуровневое и эффективное мультиплексирование ввода-вывода, основанное на примитивах модуля :mod:`select`. Вместо этого пользователям рекомендуется использовать этот модуль, если только им не нужен точный контроль над используемыми примитивами уровня ОС.

source: It defines a :class:`BaseSelector` abstract base class, along with several concrete implementations (:class:`KqueueSelector`, :class:`EpollSelector`...), that can be used to wait for I/O readiness notification on multiple file objects. In the following, "file object" refers to any object with a :meth:`~io.IOBase.fileno` method, or a raw file descriptor. See :term:`file object`.
ru: Он определяет абстрактный базовый класс :class:`BaseSelector`, а также несколько конкретных реализаций (:class:`KqueueSelector`, :class:`EpollSelector`...), которые можно использовать для ожидания уведомления о готовности ввода-вывода. несколько файловых объектов. Далее «файловый объект» относится к любому объекту с методом :meth:`~io.IOBase.fileno` или к необработанному файловому дескриптору. См. :term:`файловый объект`.

source: :class:`DefaultSelector` is an alias to the most efficient implementation available on the current platform: this should be the default choice for most users.
ru: :class:`DefaultSelector` — это псевдоним наиболее эффективной реализации, доступной на текущей платформе: это должен быть выбор по умолчанию для большинства пользователей.

source: The type of file objects supported depends on the platform: on Windows, sockets are supported, but not pipes, whereas on Unix, both are supported (some other types may be supported as well, such as fifos or special file devices).
ru: Тип поддерживаемых файловых объектов зависит от платформы: в Windows поддерживаются сокеты, но не каналы, тогда как в Unix поддерживаются оба (также могут поддерживаться некоторые другие типы, такие как fifo или специальные файловые устройства).

source: Low-level I/O multiplexing module.
ru: Модуль низкоуровневого мультиплексирования ввода-вывода.

source: This module does not work or is not available on WebAssembly platforms ``wasm32-emscripten`` and ``wasm32-wasi``. See :ref:`wasm-availability` for more information.
ru: Этот модуль не работает или недоступен на платформах WebAssembly «wasm32-emscripten» и «wasm32-wasi». См. :ref:`wasm-availability` для получения дополнительной информации.

source: Classes
ru: Классы

source: Classes hierarchy::
ru: Иерархия классов::

source: In the following, *events* is a bitwise mask indicating which I/O events should be waited for on a given file object. It can be a combination of the modules constants below:
ru: Далее *events* — это побитовая маска, указывающая, какие события ввода-вывода следует ожидать для данного файлового объекта. Это может быть комбинация констант модулей ниже:

source: Constant
ru: Константа

source: Meaning
ru: Значение

source: Available for read
ru: Доступно для чтения

source: Available for write
ru: Доступен для записи

source: A :class:`SelectorKey` is a :class:`~collections.namedtuple` used to associate a file object to its underlying file descriptor, selected event mask and attached data. It is returned by several :class:`BaseSelector` methods.
ru: :class:`SelectorKey` — это :class:`~collections.namedtuple`, используемый для связывания файлового объекта с его базовым файловым дескриптором, маской выбранного события и присоединенными данными. Его возвращают несколько методов BaseSelector.

source: File object registered.
ru: Зарегистрированный файловый объект.

source: Underlying file descriptor.
ru: Базовый файловый дескриптор.

source: Events that must be waited for on this file object.
ru: События, которых необходимо ожидать в этом файловом объекте.

source: Optional opaque data associated to this file object: for example, this could be used to store a per-client session ID.
ru: Необязательные непрозрачные данные, связанные с этим файловым объектом: например, их можно использовать для хранения идентификатора сеанса каждого клиента.

source: A :class:`BaseSelector` is used to wait for I/O event readiness on multiple file objects. It supports file stream registration, unregistration, and a method to wait for I/O events on those streams, with an optional timeout. It's an abstract base class, so cannot be instantiated. Use :class:`DefaultSelector` instead, or one of :class:`SelectSelector`, :class:`KqueueSelector` etc. if you want to specifically use an implementation, and your platform supports it. :class:`BaseSelector` and its concrete implementations support the :term:`context manager` protocol.
ru: :class:`BaseSelector` используется для ожидания готовности события ввода-вывода для нескольких файловых объектов. Он поддерживает регистрацию файловых потоков, отмену регистрации и метод ожидания событий ввода-вывода в этих потоках с дополнительным тайм-аутом. Это абстрактный базовый класс, поэтому его экземпляр не может быть создан. Вместо этого используйте :class:`DefaultSelector` или один из :class:`SelectSelector`, :class:`KqueueSelector` и т. д., если вы хотите конкретно использовать реализацию и ваша платформа ее поддерживает. :class:`BaseSelector` и его конкретные реализации поддерживают протокол :term:`context Manager`.

source: Register a file object for selection, monitoring it for I/O events.
ru: Зарегистрируйте файловый объект для выбора, отслеживая его на предмет событий ввода-вывода.

source: *fileobj* is the file object to monitor. It may either be an integer file descriptor or an object with a ``fileno()`` method. *events* is a bitwise mask of events to monitor. *data* is an opaque object.
ru: *fileobj* — файловый объект для мониторинга. Это может быть либо целочисленный дескриптор файла, либо объект с методом fileno(). *events* — это побитовая маска событий, которые нужно отслеживать. *data* — непрозрачный объект.

source: This returns a new :class:`SelectorKey` instance, or raises a :exc:`ValueError` in case of invalid event mask or file descriptor, or :exc:`KeyError` if the file object is already registered.
ru: Это возвращает новый экземпляр :class:`SelectorKey` или вызывает :exc:`ValueError` в случае недопустимой маски события или дескриптора файла, или :exc:`KeyError`, если файловый объект уже зарегистрирован.

source: Unregister a file object from selection, removing it from monitoring. A file object shall be unregistered prior to being closed.
ru: Отменить регистрацию файлового объекта из выделения, сняв его с мониторинга. Перед закрытием файловый объект должен быть отменен регистрации.

source: *fileobj* must be a file object previously registered.
ru: *fileobj* должен быть ранее зарегистрированным файловым объектом.

source: This returns the associated :class:`SelectorKey` instance, or raises a :exc:`KeyError` if *fileobj* is not registered. It will raise :exc:`ValueError` if *fileobj* is invalid (e.g. it has no ``fileno()`` method or its ``fileno()`` method has an invalid return value).
ru: Это возвращает связанный экземпляр :class:`SelectorKey` или вызывает :exc:`KeyError`, если *fileobj* не зарегистрирован. Он выдаст :exc:`ValueError`, если *fileobj* недействителен (например, у него нет метода ``fileno()`` или его метод ``fileno()`` имеет недопустимое возвращаемое значение).

source: Change a registered file object's monitored events or attached data.
ru: Измените отслеживаемые события или прикрепленные данные зарегистрированного файлового объекта.

source: This is equivalent to ``BaseSelector.unregister(fileobj)`` followed by ``BaseSelector.register(fileobj, events, data)``, except that it can be implemented more efficiently.
ru: Это эквивалентно ``BaseSelector.unregister(fileobj)``, за которым следует ``BaseSelector.register(fileobj, event, data)``, за исключением того, что его можно реализовать более эффективно.

source: This returns a new :class:`SelectorKey` instance, or raises a :exc:`ValueError` in case of invalid event mask or file descriptor, or :exc:`KeyError` if the file object is not registered.
ru: Это возвращает новый экземпляр :class:`SelectorKey` или вызывает :exc:`ValueError` в случае недопустимой маски события или дескриптора файла, или :exc:`KeyError`, если файловый объект не зарегистрирован.

source: Wait until some registered file objects become ready, or the timeout expires.
ru: Подождите, пока некоторые зарегистрированные файловые объекты не станут готовы или пока не истечет время ожидания.

source: If ``timeout > 0``, this specifies the maximum wait time, in seconds. If ``timeout <= 0``, the call won't block, and will report the currently ready file objects. If *timeout* is ``None``, the call will block until a monitored file object becomes ready.
ru: Если ``timeout > 0``, это определяет максимальное время ожидания в секундах. Если ``timeout <= 0``, вызов не будет блокироваться и сообщит о готовых в данный момент файловых объектах. Если *timeout* имеет значение «None», вызов будет блокироваться до тех пор, пока отслеживаемый файловый объект не станет готовым.

source: This returns a list of ``(key, events)`` tuples, one for each ready file object.
ru: Это возвращает список кортежей ``(ключ, события)``, по одному для каждого готового файлового объекта.

source: *key* is the :class:`SelectorKey` instance corresponding to a ready file object. *events* is a bitmask of events ready on this file object.
ru: *key* — это экземпляр :class:`SelectorKey`, соответствующий готовому файловому объекту. *events* — это битовая маска событий, готовых для этого файлового объекта.

source: This method can return before any file object becomes ready or the timeout has elapsed if the current process receives a signal: in this case, an empty list will be returned.
ru: Этот метод может вернуться до того, как какой-либо файловый объект станет готов или истечет время ожидания, если текущий процесс получит сигнал: в этом случае будет возвращен пустой список.

source: The selector is now retried with a recomputed timeout when interrupted by a signal if the signal handler did not raise an exception (see :pep:`475` for the rationale), instead of returning an empty list of events before the timeout.
ru: Селектор теперь повторяется с перевычисленным таймаутом, когда он прерывается сигналом, если обработчик сигнала не вызвал исключение (обоснование см. в :pep:`475`), вместо возврата пустого списка событий до таймаута.

source: Close the selector.
ru: Закройте селектор.

source: This must be called to make sure that any underlying resource is freed. The selector shall not be used once it has been closed.
ru: Это необходимо вызвать, чтобы убедиться, что любой базовый ресурс освобожден. Селектор нельзя использовать после его закрытия.

source: Return the key associated with a registered file object.
ru: Верните ключ, связанный с зарегистрированным файловым объектом.

source: This returns the :class:`SelectorKey` instance associated to this file object, or raises :exc:`KeyError` if the file object is not registered.
ru: Это возвращает экземпляр :class:`SelectorKey`, связанный с этим файловым объектом, или вызывает :exc:`KeyError`, если файловый объект не зарегистрирован.

source: Return a mapping of file objects to selector keys.
ru: Вернуть сопоставление файловых объектов с клавишами выбора.

source: This returns a :class:`~collections.abc.Mapping` instance mapping registered file objects to their associated :class:`SelectorKey` instance.
ru: Это возвращает экземпляр :class:`~collections.abc.Mapping`, сопоставляющий зарегистрированные файловые объекты со связанным с ними экземпляром :class:`SelectorKey`.

source: The default selector class, using the most efficient implementation available on the current platform. This should be the default choice for most users.
ru: Класс селектора по умолчанию, использующий наиболее эффективную реализацию, доступную на текущей платформе. Это должен быть выбор по умолчанию для большинства пользователей.

source: :func:`select.select`-based selector.
ru: Селектор на основе :func:`select.select`.

source: :func:`select.poll`-based selector.
ru: Селектор на основе :func:`select.poll`

source: :func:`select.epoll`-based selector.
ru: Селектор на основе :func:`select.epoll`

source: This returns the file descriptor used by the underlying :func:`select.epoll` object.
ru: Это возвращает дескриптор файла, используемый базовым объектом :func:`select.epoll`.

source: :func:`select.devpoll`-based selector.
ru: Селектор на основе :func:`select.devpoll`

source: This returns the file descriptor used by the underlying :func:`select.devpoll` object.
ru: Это возвращает дескриптор файла, используемый базовым объектом :func:`select.devpoll`.

source: :func:`select.kqueue`-based selector.
ru: Селектор на основе

source: This returns the file descriptor used by the underlying :func:`select.kqueue` object.
ru: Это возвращает дескриптор файла, используемый базовым объектом :func:`select.kqueue`.

source: Examples
ru: Примеры

source: Here is a simple echo server implementation::
ru: Вот простая реализация эхо-сервера::
