Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/site.po
Languages: ru

source: :mod:`!site` --- Site-specific configuration hook
ru: :mod:`!site` --- Перехватчик конфигурации для конкретного сайта

source: **Source code:** :source:`Lib/site.py`
ru: **Исходный код:** :source:`Lib/site.py`

source: **This module is automatically imported during initialization.** The automatic import can be suppressed using the interpreter's :option:`-S` option.
ru: **Этот модуль автоматически импортируется во время инициализации.** Автоматический импорт можно отключить с помощью опции интерпретатора :option:`-S`.

source: Importing this module normally appends site-specific paths to the module search path and adds :ref:`callables <site-consts>`, including :func:`help` to the built-in namespace. However, Python startup option :option:`-S` blocks this and this module can be safely imported with no automatic modifications to the module search path or additions to the builtins. To explicitly trigger the usual site-specific additions, call the :func:`main` function.
ru: Импорт этого модуля обычно добавляет пути, специфичные для сайта, к пути поиска модуля и добавляет :ref:`callables <site-consts>`, включая :func:`help` во встроенное пространство имен. Однако опция запуска Python :option:`-S` блокирует это, и этот модуль можно безопасно импортировать без автоматических изменений пути поиска модуля или дополнений к встроенным функциям. Чтобы явно вызвать обычные дополнения, специфичные для сайта, вызовите функцию :func:`main`.

source: Importing the module used to trigger paths manipulation even when using :option:`-S`.
ru: Импорт модуля, используемого для запуска манипуляций с путями, даже при использовании :option:`-S`.

source: It starts by constructing up to four directories from a head and a tail part. For the head part, it uses ``sys.prefix`` and ``sys.exec_prefix``; empty heads are skipped. For the tail part, it uses the empty string and then :file:`lib/site-packages` (on Windows) or :file:`lib/python{X.Y[t]}/site-packages` (on Unix and macOS). (The optional suffix "t" indicates the :term:`free threading` build, and is appended if ``"t"`` is present in the :data:`sys.abiflags` constant.) For each of the distinct head-tail combinations, it sees if it refers to an existing directory, and if so, adds it to ``sys.path`` and also inspects the newly added path for configuration files.
ru: Он начинается с построения до четырех каталогов из головы и хвостовой части. Для части головки он использует `` sys.prefix`` и `` sys.exec_prefix``; Пустые головы пропущены. Для хвостовой части он использует пустую строку, а затем: File: `lib/site-packages` (в Windows) или: file:` lib/python {xy [t]}/site-packages` (на Unix и Macos ) (Необязательный суффикс «t» указывает: термин: `бесплатный потоки« сборка »и добавляется, если` `` t "` `присутствует в: data:` sys.abiflags` constant.) Для каждой из отдельных головных -Комбинации хвоста, он видит, ссылается ли он к существующему каталогу, и если да, добавляет его в `` sys.path``, а также осматривает недавно добавленный путь для файлов конфигурации.

source: Support for the "site-python" directory has been removed.
ru: Поддержка каталога site-python удалена.

source: On Unix, :term:`Free threading <free threading>` Python installations are identified by the "t" suffix in the version-specific directory name, such as :file:`lib/python3.13t/`.
ru: В Unix :term:`Free threading <free threading>` Установки Python обозначаются суффиксом «t» в имени каталога, специфичном для версии, например :file:`lib/python3.13t/`.

source: If a file named "pyvenv.cfg" exists one directory above sys.executable, sys.prefix and sys.exec_prefix are set to that directory and it is also checked for site-packages (sys.base_prefix and sys.base_exec_prefix will always be the "real" prefixes of the Python installation). If "pyvenv.cfg" (a bootstrap configuration file) contains the key "include-system-site-packages" set to anything other than "true" (case-insensitive), the system-level prefixes will not be searched for site-packages; otherwise they will.
ru: Если файл с именем «pyvenv.cfg» существует на один каталог выше sys.executable, sys.prefix и sys.exec_prefix устанавливаются в этот каталог, а также проверяется наличие пакетов сайта (sys.base_prefix и sys.base_exec_prefix всегда будут «настоящие» префиксы установки Python). Если «pyvenv.cfg» (файл конфигурации начальной загрузки) содержит ключ «include-system-site-packages», для которого установлено любое значение, кроме «true» (без учета регистра), префиксы системного уровня не будут искаться для site- пакеты; в противном случае они будут.

source: A path configuration file is a file whose name has the form :file:`{name}.pth` and exists in one of the four directories mentioned above; its contents are additional items (one per line) to be added to ``sys.path``. Non-existing items are never added to ``sys.path``, and no check is made that the item refers to a directory rather than a file. No item is added to ``sys.path`` more than once. Blank lines and lines beginning with ``#`` are skipped. Lines starting with ``import`` (followed by space or tab) are executed.
ru: Файл конфигурации пути — это файл, имя которого имеет форму :file:`{имя}.pth` и существует в одном из четырех каталогов, упомянутых выше; его содержимое представляет собой дополнительные элементы (по одному на строку), которые необходимо добавить в ``sys.path``. Несуществующие элементы никогда не добавляются в ``sys.path``, и не производится проверка того, что элемент относится к каталогу, а не к файлу. Ни один элемент не добавляется в ``sys.path`` более одного раза. Пустые строки и строки, начинающиеся с ``#``, пропускаются. Строки, начинающиеся с импорта (за которым следует пробел или табуляция), выполняются.

source: An executable line in a :file:`.pth` file is run at every Python startup, regardless of whether a particular module is actually going to be used. Its impact should thus be kept to a minimum. The primary intended purpose of executable lines is to make the corresponding module(s) importable (load 3rd-party import hooks, adjust :envvar:`PATH` etc). Any other initialization is supposed to be done upon a module's actual import, if and when it happens. Limiting a code chunk to a single line is a deliberate measure to discourage putting anything more complex here.
ru: Исполняемая строка в файле :file:`.pth` запускается при каждом запуске Python, независимо от того, будет ли фактически использоваться конкретный модуль. Таким образом, его влияние должно быть сведено к минимуму. Основная цель исполняемых строк — сделать соответствующие модули импортируемыми (загрузить сторонние перехватчики импорта, настроить :envvar:`PATH` и т. д.). Любая другая инициализация должна выполняться при фактическом импорте модуля, если и когда это произойдет. Ограничение фрагмента кода одной строкой — намеренная мера, препятствующая размещению здесь чего-либо более сложного.

source: The :file:`.pth` files are now decoded by UTF-8 at first and then by the :term:`locale encoding` if it fails.
ru: Файлы :file:`.pth` теперь сначала декодируются с помощью UTF-8, а затем с помощью :term:`локальной кодировки`, если это не удается.

source: For example, suppose ``sys.prefix`` and ``sys.exec_prefix`` are set to :file:`/usr/local`. The Python X.Y library is then installed in :file:`/usr/local/lib/python{X.Y}`. Suppose this has a subdirectory :file:`/usr/local/lib/python{X.Y}/site-packages` with three subsubdirectories, :file:`foo`, :file:`bar` and :file:`spam`, and two path configuration files, :file:`foo.pth` and :file:`bar.pth`. Assume :file:`foo.pth` contains the following::
ru: Например, предположим, что ``sys.prefix`` и ``sys.exec_prefix`` установлены в :file:`/usr/local`. Библиотека Python XY затем устанавливается в :file:`/usr/local/lib/python{XY}`. Предположим, что здесь есть подкаталог :file:`/usr/local/lib/python{XY}/site-packages` с тремя подкаталогами: :file:`foo`, :file:`bar` и :file:`spam`, и два файла конфигурации пути: :file:`foo.pth` и :file:`bar.pth`. Предположим, что :file:`foo.pth` содержит следующее::

source: and :file:`bar.pth` contains::
ru: и :file:`bar.pth` содержит::

source: Then the following version-specific directories are added to ``sys.path``, in this order::
ru: Затем в ``sys.path`` добавляются следующие каталоги для конкретной версии в следующем порядке:

source: Note that :file:`bletch` is omitted because it doesn't exist; the :file:`bar` directory precedes the :file:`foo` directory because :file:`bar.pth` comes alphabetically before :file:`foo.pth`; and :file:`spam` is omitted because it is not mentioned in either path configuration file.
ru: Обратите внимание, что :file:`blech` опущен, поскольку он не существует; каталог :file:`bar` предшествует каталогу :file:`foo`, поскольку :file:`bar.pth` идет в алфавитном порядке перед :file:`foo.pth`; и :file:`spam` опущен, поскольку он не упоминается ни в одном файле конфигурации пути.

source: After these path manipulations, an attempt is made to import a module named :mod:`sitecustomize`, which can perform arbitrary site-specific customizations. It is typically created by a system administrator in the site-packages directory. If this import fails with an :exc:`ImportError` or its subclass exception, and the exception's :attr:`~ImportError.name` attribute equals to ``'sitecustomize'``, it is silently ignored. If Python is started without output streams available, as with :file:`pythonw.exe` on Windows (which is used by default to start IDLE), attempted output from :mod:`sitecustomize` is ignored. Any other exception causes a silent and perhaps mysterious failure of the process.
ru: После этих манипуляций с путями предпринимается попытка импортировать модуль с именем :mod:`sitecustomize`, который может выполнять произвольные настройки для конкретного сайта. Обычно он создается системным администратором в каталоге site-packages. Если этот импорт завершается неудачно с исключением :exc:`ImportError` или его подкласса, а атрибут :attr:`~ImportError.name` такого исключения равен ``'sitecustomize'``, он игнорируется. Если Python запускается без доступных потоков вывода, как в случае с :file:`pythonw.exe` в Windows (который по умолчанию используется для запуска IDLE), попытка вывода из :mod:`sitecustomize` игнорируется. Любое другое исключение вызывает молчаливый и, возможно, загадочный сбой процесса.

source: After this, an attempt is made to import a module named :mod:`usercustomize`, which can perform arbitrary user-specific customizations, if :data:`~site.ENABLE_USER_SITE` is true. This file is intended to be created in the user site-packages directory (see below), which is part of ``sys.path`` unless disabled by :option:`-s`. If this import fails with an :exc:`ImportError` or its subclass exception, and the exception's :attr:`~ImportError.name` attribute equals to ``'usercustomize'``, it is silently ignored.
ru: После этого предпринимается попытка импортировать модуль с именем :mod:`usercustomize`, который может выполнять произвольные пользовательские настройки, если :data:`~site.ENABLE_USER_SITE` имеет значение true. Этот файл предназначен для создания в каталоге пользовательских site-packages (см. ниже), который является частью ``sys.path``, если он не отключен с помощью :option:`-s`. Если этот импорт завершается неудачей с исключением :exc:`ImportError` или его подкласса, а атрибут :attr:`~ImportError.name` такого исключения равен ``'usercustomize'``, он игнорируется автоматически.

source: Note that for some non-Unix systems, ``sys.prefix`` and ``sys.exec_prefix`` are empty, and the path manipulations are skipped; however the import of :mod:`sitecustomize` and :mod:`usercustomize` is still attempted.
ru: Обратите внимание, что для некоторых систем, отличных от Unix, ``sys.prefix`` и ``sys.exec_prefix`` пусты, и манипуляции с путями пропускаются; однако импорт :mod:`sitecustomize` и :mod:`usercustomize` все еще предпринимается.

source: Readline configuration
ru: Конфигурация строки чтения

source: On systems that support :mod:`readline`, this module will also import and configure the :mod:`rlcompleter` module, if Python is started in :ref:`interactive mode <tut-interactive>` and without the :option:`-S` option. The default behavior is enable tab-completion and to use :file:`~/.python_history` as the history save file. To disable it, delete (or override) the :data:`sys.__interactivehook__` attribute in your :mod:`sitecustomize` or :mod:`usercustomize` module or your :envvar:`PYTHONSTARTUP` file.
ru: В системах, поддерживающих :mod:`readline`, этот модуль также импортирует и настроит модуль :mod:`rlcompleter`, если Python запускается в :ref:`интерактивном режиме <tut-interactive>` и без :option: Опция `-S`. Поведение по умолчанию — включение табуляции и использование :file:`~/.python_history` в качестве файла сохранения истории. Чтобы отключить его, удалите (или переопределите) атрибут :data:`sys.__interactivehook__` в вашем :mod:`sitecustomize` или :mod:`usercustomize` модуле или в вашем :envvar:`PYTHONSTARTUP` файле.

source: Activation of rlcompleter and history was made automatic.
ru: Активация rlcompleter и истории сделана автоматической.

source: Module contents
ru: Содержимое модуля

source: A list of prefixes for site-packages directories.
ru: Список префиксов для каталогов site-packages.

source: Flag showing the status of the user site-packages directory. ``True`` means that it is enabled and was added to ``sys.path``. ``False`` means that it was disabled by user request (with :option:`-s` or :envvar:`PYTHONNOUSERSITE`). ``None`` means it was disabled for security reasons (mismatch between user or group id and effective id) or by an administrator.
ru: Флаг, показывающий состояние пользовательского каталога site-packages. ``True`` означает, что он включен и добавлен в ``sys.path``. ``False`` означает, что он был отключен по запросу пользователя (с помощью :option:`-s` или :envvar:`PYTHONNOUSERSITE`). ``Нет`` означает, что он был отключен по соображениям безопасности (несоответствие между идентификатором пользователя или группы и эффективным идентификатором) или администратором.

source: Path to the user site-packages for the running Python. Can be ``None`` if :func:`getusersitepackages` hasn't been called yet. Default value is :file:`~/.local/lib/python{X.Y}[t]/site-packages` for UNIX and non-framework macOS builds, :file:`~/Library/Python/{X.Y}/lib/python/site-packages` for macOS framework builds, and :file:`{%APPDATA%}\\Python\\Python{XY}\\site-packages` on Windows. The optional "t" indicates the free-threaded build. This directory is a site directory, which means that :file:`.pth` files in it will be processed.
ru: Путь к пользовательским сайтам-пакетам для работающего Python. Может быть None, если :func:`getusersitepackages` еще не вызывалась. Значение по умолчанию: :file:`~/.local/lib/python{XY}[t]/site-packages` для сборок UNIX и macOS без платформы, :file:`~/Library/Python/{XY}/lib. /python/site-packages` для сборок платформы macOS и :file:`{ %А PPDATA%}\\Python\\Python{XY}\\site-packages` в Windows. Необязательный «t» указывает на сборку со свободным потоком. Этот каталог является каталогом сайта, а это означает, что в нем будут обрабатываться файлы :file:`.pth`.

source: Path to the base directory for the user site-packages. Can be ``None`` if :func:`getuserbase` hasn't been called yet. Default value is :file:`~/.local` for UNIX and macOS non-framework builds, :file:`~/Library/Python/{X.Y}` for macOS framework builds, and :file:`{%APPDATA%}\\Python` for Windows. This value is used to compute the installation directories for scripts, data files, Python modules, etc. for the :ref:`user installation scheme <sysconfig-user-scheme>`. See also :envvar:`PYTHONUSERBASE`.
ru: Путь к базовому каталогу для пользовательских сайтов-пакетов. Может быть None, если :func:`getuserbase` еще не вызывалась. Значение по умолчанию: :file:`~/.local` для сборок без платформы UNIX и macOS, :file:`~/Library/Python/{XY}` для сборок платформы macOS и :file:`{ %А PPDATA%}\\Python` для Windows. Это значение используется для вычисления каталогов установки сценариев, файлов данных, модулей Python и т. д. для :ref:`пользовательской схемы установки <sysconfig-user-scheme>`. См. также :envvar:`PYTHONUSERBASE`.

source: Adds all the standard site-specific directories to the module search path. This function is called automatically when this module is imported, unless the Python interpreter was started with the :option:`-S` flag.
ru: Добавляет все стандартные каталоги, специфичные для сайта, в путь поиска модуля. Эта функция вызывается автоматически при импорте этого модуля, если только интерпретатор Python не был запущен с флагом :option:`-S`.

source: This function used to be called unconditionally.
ru: Раньше эта функция вызывалась безусловно.

source: Add a directory to sys.path and process its :file:`.pth` files. Typically used in :mod:`sitecustomize` or :mod:`usercustomize` (see above).
ru: Добавьте каталог в sys.path и обработайте его файлы :file:`.pth`. Обычно используется в :mod:`sitecustomize` или :mod:`usercustomize` (см. выше).

source: Return a list containing all global site-packages directories.
ru: Возвращает список, содержащий все глобальные каталоги пакетов сайта.

source: Return the path of the user base directory, :data:`USER_BASE`. If it is not initialized yet, this function will also set it, respecting :envvar:`PYTHONUSERBASE`.
ru: Возвращает путь к базовому каталогу пользователя: data:`USER_BASE`. Если он еще не инициализирован, эта функция также установит его, учитывая :envvar:`PYTHONUSERBASE`.

source: Return the path of the user-specific site-packages directory, :data:`USER_SITE`. If it is not initialized yet, this function will also set it, respecting :data:`USER_BASE`. To determine if the user-specific site-packages was added to ``sys.path`` :data:`ENABLE_USER_SITE` should be used.
ru: Возвращает путь к каталогу пользовательских пакетов сайта: data:`USER_SITE`. Если он еще не инициализирован, эта функция также установит его, учитывая :data:`USER_BASE`. Чтобы определить, были ли добавлены специфичные для пользователя пакеты сайта в ``sys.path``, следует использовать :data:`ENABLE_USER_SITE`.

source: Command Line Interface
ru: Интерфейс командной строки

source: The :mod:`site` module also provides a way to get the user directories from the command line:
ru: Модуль :mod:`site` также предоставляет возможность получить пользовательские каталоги из командной строки:

source: If it is called without arguments, it will print the contents of :data:`sys.path` on the standard output, followed by the value of :data:`USER_BASE` and whether the directory exists, then the same thing for :data:`USER_SITE`, and finally the value of :data:`ENABLE_USER_SITE`.
ru: Если он вызывается без аргументов, он выведет на стандартный вывод содержимое :data:`sys.path`, за которым следует значение :data:`USER_BASE` и сведения о том, существует ли каталог, то же самое происходит и с :data. :`USER_SITE` и, наконец, значение :data:`ENABLE_USER_SITE`.

source: Print the path to the user base directory.
ru: Распечатайте путь к базовому каталогу пользователя.

source: Print the path to the user site-packages directory.
ru: Распечатайте путь к каталогу пользовательских site-packages.

source: If both options are given, user base and user site will be printed (always in this order), separated by :data:`os.pathsep`.
ru: Если указаны обе опции, база пользователей и сайт пользователя будут распечатаны (всегда в этом порядке), разделенные :data:`os.pathsep`.

source: If any option is given, the script will exit with one of these values: ``0`` if the user site-packages directory is enabled, ``1`` if it was disabled by the user, ``2`` if it is disabled for security reasons or by an administrator, and a value greater than 2 if there is an error.
ru: Если указана какая-либо опция, сценарий завершит работу с одним из следующих значений: ``0``, если каталог пакетов сайта пользователя включен, ``1``, если он был отключен пользователем, ``2``, если он отключен по соображениям безопасности или администратором, а значение больше 2 — в случае ошибки.

source: :pep:`370` -- Per user site-packages directory
ru: :pep:`370` -- Каталог пакетов сайта для каждого пользователя

source: :ref:`sys-path-init` -- The initialization of :data:`sys.path`.
ru: :ref:`sys-path-init` -- Инициализация :data:`sys.path`.

source: module
ru: модуль

source: search
ru: поиск

source: path
ru: путь

source: directory
ru: каталог

source: comment
ru: комментарий

source: statement
ru: инструкция

source: import
ru: импорт

source: package
ru: пакет

source: configuration
ru: конфигурация

source: file
ru: файл
