Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/smtplib.po
Languages: ru

source: :mod:`!smtplib` --- SMTP protocol client
ru: :mod:`!smtplib` --- Клиент протокола SMTP

source: **Source code:** :source:`Lib/smtplib.py`
ru: **Исходный код:** :source:`Lib/smtplib.py`

source: The :mod:`smtplib` module defines an SMTP client session object that can be used to send mail to any internet machine with an SMTP or ESMTP listener daemon. For details of SMTP and ESMTP operation, consult :rfc:`821` (Simple Mail Transfer Protocol) and :rfc:`1869` (SMTP Service Extensions).
ru: Модуль :mod:`smtplib` определяет объект сеанса SMTP-клиента, который можно использовать для отправки почты на любой интернет-компьютер с демоном-слушателем SMTP или ESMTP. Подробную информацию о работе SMTP и ESMTP см. в :rfc:`821` (простой протокол передачи почты) и :rfc:`1869` (расширения службы SMTP).

source: Availability
ru: Доступность

source: This module does not work or is not available on WebAssembly. See :ref:`wasm-availability` for more information.
ru: Этот модуль не работает или недоступен в WebAssembly. См. :ref:`wasm-availability` для получения дополнительной информации.

source: An :class:`SMTP` instance encapsulates an SMTP connection. It has methods that support a full repertoire of SMTP and ESMTP operations. If the optional *host* and *port* parameters are given, the SMTP :meth:`connect` method is called with those parameters during initialization. If specified, *local_hostname* is used as the FQDN of the local host in the HELO/EHLO command. Otherwise, the local hostname is found using :func:`socket.getfqdn`. If the :meth:`connect` call returns anything other than a success code, an :exc:`SMTPConnectError` is raised. The optional *timeout* parameter specifies a timeout in seconds for blocking operations like the connection attempt (if not specified, the global default timeout setting will be used). If the timeout expires, :exc:`TimeoutError` is raised. The optional *source_address* parameter allows binding to some specific source address in a machine with multiple network interfaces, and/or to some specific source TCP port. It takes a 2-tuple ``(host, port)``, for the socket to bind to as its source address before connecting. If omitted (or if *host* or *port* are ``''`` and/or ``0`` respectively) the OS default behavior will be used.
ru: Экземпляр :class:`SMTP` инкапсулирует SMTP-соединение. Он имеет методы, поддерживающие полный набор операций SMTP и ESMTP. Если указаны необязательные параметры *host* и *port*, метод SMTP :meth:`connect` вызывается с этими параметрами во время инициализации. Если указано, *local_hostname* используется в качестве полного доменного имени локального хоста в команде HELO/EHLO. В противном случае локальное имя хоста находится с помощью :func:`socket.getfqdn`. Если вызов :meth:`connect` возвращает что-либо, кроме кода успеха, возникает ошибка :exc:`SMTPConnectError`. Необязательный параметр *timeout* указывает тайм-аут в секундах для блокировки таких операций, как попытка подключения (если он не указан, будет использоваться глобальная настройка тайм-аута по умолчанию). Если тайм-аут истекает, возникает :exc:`TimeoutError`. Необязательный параметр *source_address* позволяет выполнить привязку к определенному исходному адресу на машине с несколькими сетевыми интерфейсами и/или к определенному исходному TCP-порту. Требуется двухкортеж (хост, порт) для привязки сокета в качестве исходного адреса перед подключением. Если этот параметр опущен (или если *host* или *port* имеют значения ``''`` и/или ``0`` соответственно), будет использоваться поведение ОС по умолчанию.

source: For normal use, you should only require the initialization/connect, :meth:`sendmail`, and :meth:`SMTP.quit` methods. An example is included below.
ru: Для обычного использования вам потребуются только методы инициализации/подключения, :meth:`sendmail` и :meth:`SMTP.quit`. Пример приведен ниже.

source: The :class:`SMTP` class supports the :keyword:`with` statement. When used like this, the SMTP ``QUIT`` command is issued automatically when the :keyword:`!with` statement exits. E.g.::
ru: Класс :class:`SMTP` поддерживает оператор :keyword:`with`. При таком использовании команда SMTP ``QUIT`` выдается автоматически при выходе из оператора :keyword:`!with`. Например::

source: All commands will raise an :ref:`auditing event <auditing>` ``smtplib.SMTP.send`` with arguments ``self`` and ``data``, where ``data`` is the bytes about to be sent to the remote host.
ru: Все команды вызовут :ref:`событие аудита <auditing>``smtplib.SMTP.send`` с аргументами ``self`` и ``data``, где ``данные`` — это байты, которые будут переданы. отправляется на удаленный хост.

source: Support for the :keyword:`with` statement was added.
ru: Добавлена ​​поддержка оператора :keyword:`with`.

source: *source_address* argument was added.
ru: Добавлен аргумент *source_address*.

source: The SMTPUTF8 extension (:rfc:`6531`) is now supported.
ru: Расширение SMTPUTF8 (:rfc:`6531`) теперь поддерживается.

source: If the *timeout* parameter is set to be zero, it will raise a :class:`ValueError` to prevent the creation of a non-blocking socket.
ru: Если параметр *timeout* установлен в нулевое значение, он вызовет :class:`ValueError`, чтобы предотвратить создание неблокирующего сокета.

source: An :class:`SMTP_SSL` instance behaves exactly the same as instances of :class:`SMTP`. :class:`SMTP_SSL` should be used for situations where SSL is required from the beginning of the connection and using :meth:`starttls` is not appropriate. If *host* is not specified, the local host is used. If *port* is zero, the standard SMTP-over-SSL port (465) is used. The optional arguments *local_hostname*, *timeout* and *source_address* have the same meaning as they do in the :class:`SMTP` class. *context*, also optional, can contain a :class:`~ssl.SSLContext` and allows configuring various aspects of the secure connection. Please read :ref:`ssl-security` for best practices.
ru: Экземпляр :class:`SMTP_SSL` ведет себя точно так же, как экземпляры :class:`SMTP`. :class:`SMTP_SSL` следует использовать в ситуациях, когда SSL требуется с самого начала соединения и использование :meth:`starttls` не подходит. Если *host* не указан, используется локальный хост. Если *port* равен нулю, используется стандартный порт SMTP-over-SSL (465). Необязательные аргументы *local_hostname*, *timeout* и *source_address* имеют то же значение, что и в классе :class:`SMTP`. *context*, также необязательный, может содержать :class:`~ssl.SSLContext` и позволяет настраивать различные аспекты безопасного соединения. Пожалуйста, прочтите :ref:`ssl-security` для получения лучших практик.

source: *context* was added.
ru: *context* был добавлен.

source: The *source_address* argument was added.
ru: Был добавлен аргумент *source_address*.

source: The class now supports hostname check with :attr:`ssl.SSLContext.check_hostname` and *Server Name Indication* (see :const:`ssl.HAS_SNI`).
ru: Класс теперь поддерживает проверку имени хоста с помощью :attr:`ssl.SSLContext.check_hostname` и *Индикации имени сервера* (см. :const:`ssl.HAS_SNI`).

source: If the *timeout* parameter is set to be zero, it will raise a :class:`ValueError` to prevent the creation of a non-blocking socket
ru: Если параметр *timeout* установлен равным нулю, он вызовет :class:`ValueError`, чтобы предотвратить создание неблокирующего сокета.

source: The deprecated *keyfile* and *certfile* parameters have been removed.
ru: Устаревшие параметры *keyfile* и *certfile* были удалены.

source: The LMTP protocol, which is very similar to ESMTP, is heavily based on the standard SMTP client. It's common to use Unix sockets for LMTP, so our :meth:`connect` method must support that as well as a regular host:port server. The optional arguments *local_hostname* and *source_address* have the same meaning as they do in the :class:`SMTP` class. To specify a Unix socket, you must use an absolute path for *host*, starting with a '/'.
ru: Протокол LMTP, очень похожий на ESMTP, во многом основан на стандартном клиенте SMTP. Для LMTP обычно используются сокеты Unix, поэтому наш метод :meth:`connect` должен поддерживать это так же, как и обычный сервер хост:порт. Необязательные аргументы *local_hostname* и *source_address* имеют то же значение, что и в классе :class:`SMTP`. Чтобы указать сокет Unix, вы должны использовать абсолютный путь для *host*, начинающийся с '/'.

source: Authentication is supported, using the regular SMTP mechanism. When using a Unix socket, LMTP generally don't support or require any authentication, but your mileage might vary.
ru: Поддерживается аутентификация с использованием обычного механизма SMTP. При использовании сокета Unix LMTP обычно не поддерживает и не требует аутентификации, но ваш опыт может отличаться.

source: The optional *timeout* parameter was added.
ru: Добавлен необязательный параметр *timeout*.

source: A nice selection of exceptions is defined as well:
ru: Также определен хороший выбор исключений:

source: Subclass of :exc:`OSError` that is the base exception class for all the other exceptions provided by this module.
ru: Подкласс :exc:`OSError`, который является базовым классом исключений для всех других исключений, предоставляемых этим модулем.

source: SMTPException became subclass of :exc:`OSError`
ru: SMTPException стал подклассом :exc:`OSError`

source: This exception is raised when the server unexpectedly disconnects, or when an attempt is made to use the :class:`SMTP` instance before connecting it to a server.
ru: Это исключение возникает, когда сервер неожиданно отключается или когда предпринимается попытка использовать экземпляр :class:`SMTP` перед его подключением к серверу.

source: Base class for all exceptions that include an SMTP error code. These exceptions are generated in some instances when the SMTP server returns an error code. The error code is stored in the :attr:`smtp_code` attribute of the error, and the :attr:`smtp_error` attribute is set to the error message.
ru: Базовый класс для всех исключений, включающих код ошибки SMTP. Эти исключения генерируются в некоторых случаях, когда SMTP-сервер возвращает код ошибки. Код ошибки хранится в атрибуте :attr:`smtp_code` ошибки, а атрибут :attr:`smtp_error` устанавливается в сообщение об ошибке.

source: Sender address refused. In addition to the attributes set by on all :exc:`SMTPResponseException` exceptions, this sets 'sender' to the string that the SMTP server refused.
ru: Адрес отправителя отклонен. В дополнение к атрибутам, установленным для всех исключений :exc:`SMTPResponseException`, в качестве отправителя устанавливается строка, которую SMTP-сервер отклонил.

source: All recipient addresses refused. The errors for each recipient are accessible through the attribute :attr:`recipients`, which is a dictionary of exactly the same sort as :meth:`SMTP.sendmail` returns.
ru: Все адреса получателей отказались. Ошибки для каждого получателя доступны через атрибут :attr:`recipients`, который представляет собой словарь точно такого же типа, что и возвращаемый :meth:`SMTP.sendmail`.

source: The SMTP server refused to accept the message data.
ru: SMTP-сервер отказался принять данные сообщения.

source: Error occurred during establishment of a connection with the server.
ru: Произошла ошибка при установлении соединения с сервером.

source: The server refused our ``HELO`` message.
ru: Сервер отклонил наше сообщение HELO.

source: The command or option attempted is not supported by the server.
ru: Использованная команда или параметр не поддерживается сервером.

source: SMTP authentication went wrong. Most probably the server didn't accept the username/password combination provided.
ru: Аутентификация SMTP прошла неправильно. Скорее всего, сервер не принял предоставленную комбинацию имени пользователя и пароля.

source: :rfc:`821` - Simple Mail Transfer Protocol
ru: :rfc:`821` - Простой протокол передачи почты

source: Protocol definition for SMTP. This document covers the model, operating procedure, and protocol details for SMTP.
ru: Определение протокола для SMTP. В этом документе описаны модель, порядок работы и подробности протокола SMTP.

source: :rfc:`1869` - SMTP Service Extensions
ru: :rfc:`1869` - Расширения службы SMTP

source: Definition of the ESMTP extensions for SMTP. This describes a framework for extending SMTP with new commands, supporting dynamic discovery of the commands provided by the server, and defines a few additional commands.
ru: Определение расширений ESMTP для SMTP. Здесь описывается структура расширения SMTP новыми командами, поддержка динамического обнаружения команд, предоставляемых сервером, и определяется несколько дополнительных команд.

source: SMTP Objects
ru: Объекты SMTP

source: An :class:`SMTP` instance has the following methods:
ru: Экземпляр :class:`SMTP` имеет следующие методы:

source: Set the debug output level. A value of 1 or ``True`` for *level* results in debug messages for connection and for all messages sent to and received from the server. A value of 2 for *level* results in these messages being timestamped.
ru: Установите уровень вывода отладки. Значение 1 или ``True`` для *level* приводит к появлению отладочных сообщений для соединения и для всех сообщений, отправленных и полученных с сервера. Значение 2 для *level* приводит к тому, что этим сообщениям присваивается временная метка.

source: Added debuglevel 2.
ru: Добавлен уровень отладки 2.

source: Send a command *cmd* to the server. The optional argument *args* is simply concatenated to the command, separated by a space.
ru: Отправьте команду *cmd* на сервер. Необязательный аргумент *args* просто присоединяется к команде, разделяясь пробелом.

source: This returns a 2-tuple composed of a numeric response code and the actual response line (multiline responses are joined into one long line.)
ru: Возвращает кортеж из двух чисел, состоящий из числового кода ответа и фактической строки ответа (многострочные ответы объединяются в одну длинную строку).

source: In normal operation it should not be necessary to call this method explicitly. It is used to implement other methods and may be useful for testing private extensions.
ru: При нормальной работе нет необходимости явно вызывать этот метод. Он используется для реализации других методов и может быть полезен для тестирования частных расширений.

source: If the connection to the server is lost while waiting for the reply, :exc:`SMTPServerDisconnected` will be raised.
ru: Если соединение с сервером потеряно во время ожидания ответа, будет поднято :exc:`SMTPServerDisconnected`.

source: Connect to a host on a given port. The defaults are to connect to the local host at the standard SMTP port (25). If the hostname ends with a colon (``':'``) followed by a number, that suffix will be stripped off and the number interpreted as the port number to use. This method is automatically invoked by the constructor if a host is specified during instantiation. Returns a 2-tuple of the response code and message sent by the server in its connection response.
ru: Подключитесь к хосту по заданному порту. По умолчанию подключение к локальному хосту осуществляется через стандартный порт SMTP (25). Если имя хоста заканчивается двоеточием (``':'``), за которым следует число, этот суффикс будет удален, а число интерпретируется как номер используемого порта. Этот метод автоматически вызывается конструктором, если во время создания экземпляра указан хост. Возвращает кортеж из двух кодов ответа и сообщения, отправленного сервером в ответе на соединение.

source: Raises an :ref:`auditing event <auditing>` ``smtplib.connect`` with arguments ``self``, ``host``, ``port``.
ru: Вызывает событие аудита <auditing>`smtplib.connect`` с аргументами ``self``, ``host``, ``port``.

source: Identify yourself to the SMTP server using ``HELO``. The hostname argument defaults to the fully qualified domain name of the local host. The message returned by the server is stored as the :attr:`helo_resp` attribute of the object.
ru: Идентифицируйте себя на SMTP-сервере, используя HELO. Аргумент имени хоста по умолчанию соответствует полному доменному имени локального хоста. Сообщение, возвращаемое сервером, сохраняется как атрибут :attr:`helo_resp` объекта.

source: In normal operation it should not be necessary to call this method explicitly. It will be implicitly called by the :meth:`sendmail` when necessary.
ru: При нормальной работе нет необходимости явно вызывать этот метод. При необходимости он будет неявно вызываться :meth:`sendmail`.

source: Identify yourself to an ESMTP server using ``EHLO``. The hostname argument defaults to the fully qualified domain name of the local host. Examine the response for ESMTP option and store them for use by :meth:`has_extn`. Also sets several informational attributes: the message returned by the server is stored as the :attr:`ehlo_resp` attribute, :attr:`does_esmtp` is set to ``True`` or ``False`` depending on whether the server supports ESMTP, and :attr:`esmtp_features` will be a dictionary containing the names of the SMTP service extensions this server supports, and their parameters (if any).
ru: Идентифицируйте себя на сервере ESMTP, используя EHLO. Аргумент имени хоста по умолчанию соответствует полному доменному имени локального хоста. Проверьте ответ на параметр ESMTP и сохраните его для использования :meth:`has_extn`. Также устанавливает несколько информационных атрибутов: сообщение, возвращаемое сервером, сохраняется как атрибут :attr:`ehlo_resp`, :attr:`does_esmtp` устанавливается в ``True`` или ``False`` в зависимости от того, поддерживает ли сервер ESMTP и :attr:`esmtp_features` будут словарем, содержащим имена расширений службы SMTP, которые поддерживает этот сервер, и их параметры (если таковые имеются).

source: Unless you wish to use :meth:`has_extn` before sending mail, it should not be necessary to call this method explicitly. It will be implicitly called by :meth:`sendmail` when necessary.
ru: Если вы не хотите использовать :meth:`has_extn` перед отправкой почты, нет необходимости явно вызывать этот метод. При необходимости он будет неявно вызываться :meth:`sendmail`.

source: This method calls :meth:`ehlo` and/or :meth:`helo` if there has been no previous ``EHLO`` or ``HELO`` command this session. It tries ESMTP ``EHLO`` first.
ru: Этот метод вызывает :meth:`ehlo` и/или :meth:`helo`, если в этом сеансе не было предыдущей команды ``EHLO`` или ``HELO``. Сначала он пробует ESMTP ``EHLO``.

source: The server didn't reply properly to the ``HELO`` greeting.
ru: Сервер не ответил должным образом на приветствие HELO.

source: Return :const:`True` if *name* is in the set of SMTP service extensions returned by the server, :const:`False` otherwise. Case is ignored.
ru: Верните :const:`True`, если *name* входит в набор расширений службы SMTP, возвращаемых сервером, :const:`False` в противном случае. Случай игнорируется.

source: Check the validity of an address on this server using SMTP ``VRFY``. Returns a tuple consisting of code 250 and a full :rfc:`822` address (including human name) if the user address is valid. Otherwise returns an SMTP error code of 400 or greater and an error string.
ru: Проверьте действительность адреса на этом сервере с помощью SMTP ``VRFY``. Возвращает кортеж, состоящий из кода 250 и полного адреса :rfc:`822` (включая человеческое имя), если адрес пользователя действителен. В противном случае возвращается код ошибки SMTP 400 или выше и строка ошибки.

source: Many sites disable SMTP ``VRFY`` in order to foil spammers.
ru: Многие сайты отключают SMTP ``VRFY``, чтобы помешать спамерам.

source: Log in on an SMTP server that requires authentication. The arguments are the username and the password to authenticate with. If there has been no previous ``EHLO`` or ``HELO`` command this session, this method tries ESMTP ``EHLO`` first. This method will return normally if the authentication was successful, or may raise the following exceptions:
ru: Войдите на SMTP-сервер, требующий аутентификации. Аргументами являются имя пользователя и пароль для аутентификации. Если в этом сеансе не было предыдущей команды ``EHLO`` или ``HELO``, этот метод сначала пробует ESMTP ``EHLO``. Этот метод обычно завершает работу, если аутентификация прошла успешно, или может вызвать следующие исключения:

source: The server didn't accept the username/password combination.
ru: Сервер не принял комбинацию имени пользователя и пароля.

source: The ``AUTH`` command is not supported by the server.
ru: Команда ``AUTH`` не поддерживается сервером.

source: No suitable authentication method was found.
ru: Подходящий метод аутентификации не найден.

source: Each of the authentication methods supported by :mod:`smtplib` are tried in turn if they are advertised as supported by the server. See :meth:`auth` for a list of supported authentication methods. *initial_response_ok* is passed through to :meth:`auth`.
ru: Каждый из методов аутентификации, поддерживаемых :mod:`smtplib`, проверяется по очереди, если они объявлены как поддерживаемые сервером. См. :meth:`auth` для получения списка поддерживаемых методов аутентификации. *initial_response_ok* передается в :meth:`auth`.

source: Optional keyword argument *initial_response_ok* specifies whether, for authentication methods that support it, an "initial response" as specified in :rfc:`4954` can be sent along with the ``AUTH`` command, rather than requiring a challenge/response.
ru: Необязательный аргумент ключевого слова *initial_response_ok* указывает, можно ли для методов аутентификации, которые его поддерживают, отправлять «первоначальный ответ», как указано в :rfc:`4954`, вместе с командой ``AUTH``, вместо того, чтобы требовать запрос/ответ. .

source: :exc:`SMTPNotSupportedError` may be raised, and the *initial_response_ok* parameter was added.
ru: :exc:`SMTPNotSupportedError`, и был добавлен параметр *initial_response_ok*.

source: Issue an ``SMTP`` ``AUTH`` command for the specified authentication *mechanism*, and handle the challenge response via *authobject*.
ru: Выполните команду ``SMTP`` ``AUTH`` для указанного *механизма* аутентификации и обработайте ответ на запрос через *authobject*.

source: *mechanism* specifies which authentication mechanism is to be used as argument to the ``AUTH`` command; the valid values are those listed in the ``auth`` element of :attr:`esmtp_features`.
ru: *механизм* указывает, какой механизм аутентификации будет использоваться в качестве аргумента команды ``AUTH``; допустимые значения перечислены в элементе ``auth`` файла :attr:`esmtp_features`.

source: *authobject* must be a callable object taking an optional single argument::
ru: *authobject* должен быть вызываемым объектом, принимающим один необязательный аргумент::

source: If optional keyword argument *initial_response_ok* is true, ``authobject()`` will be called first with no argument. It can return the :rfc:`4954` "initial response" ASCII ``str`` which will be encoded and sent with the ``AUTH`` command as below. If the ``authobject()`` does not support an initial response (e.g. because it requires a challenge), it should return ``None`` when called with ``challenge=None``. If *initial_response_ok* is false, then ``authobject()`` will not be called first with ``None``.
ru: Если необязательный аргумент ключевого слова *initial_response_ok* имеет значение true, сначала будет вызвана функция authobject() без аргументов. Он может вернуть :rfc:`4954` "начальный ответ" ASCII ``str``, который будет закодирован и отправлен с помощью команды ``AUTH``, как показано ниже. Если ``authobject()`` не поддерживает первоначальный ответ (например, потому что он требует запроса), он должен возвращать ``None`` при вызове с ``challenge=None``. Если *initial_response_ok* имеет значение false, то ``authobject()`` не будет вызываться первым с ``None``.
