Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/smtplib.po
Languages: ru

source: If the initial response check returns ``None``, or if *initial_response_ok* is false, ``authobject()`` will be called to process the server's challenge response; the *challenge* argument it is passed will be a ``bytes``. It should return ASCII ``str`` *data* that will be base64 encoded and sent to the server.
ru: Если первоначальная проверка ответа возвращает None или если *initial_response_ok* имеет значение false, будет вызвана функция authobject() для обработки ответа на запрос сервера; передаваемый аргумент *challenge* будет ``bytes``. Он должен вернуть ASCII ``str`` *данные*, которые будут закодированы в base64 и отправлены на сервер.

source: The ``SMTP`` class provides ``authobjects`` for the ``CRAM-MD5``, ``PLAIN``, and ``LOGIN`` mechanisms; they are named ``SMTP.auth_cram_md5``, ``SMTP.auth_plain``, and ``SMTP.auth_login`` respectively. They all require that the ``user`` and ``password`` properties of the ``SMTP`` instance are set to appropriate values.
ru: Класс SMTP предоставляет объекты авторизации для механизмов CRAM-MD5, PLAIN и LOGIN; они называются SMTP.auth_cram_md5, SMTP.auth_plain и SMTP.auth_login соответственно. Все они требуют, чтобы свойства ``user`` и ``password`` экземпляра ``SMTP`` были установлены на соответствующие значения.

source: User code does not normally need to call ``auth`` directly, but can instead call the :meth:`login` method, which will try each of the above mechanisms in turn, in the order listed. ``auth`` is exposed to facilitate the implementation of authentication methods not (or not yet) supported directly by :mod:`smtplib`.
ru: Пользовательскому коду обычно не требуется напрямую вызывать ``auth``, вместо этого он может вызвать метод :meth:`login`, который поочередно проверит каждый из вышеперечисленных механизмов в указанном порядке. ``auth`` предоставляется для облегчения реализации методов аутентификации, которые не поддерживаются (или еще не поддерживаются) непосредственно :mod:`smtplib`.

source: Put the SMTP connection in TLS (Transport Layer Security) mode. All SMTP commands that follow will be encrypted. You should then call :meth:`ehlo` again.
ru: Переведите SMTP-соединение в режим TLS (Transport Layer Security). Все последующие команды SMTP будут зашифрованы. Затем вам следует снова вызвать :meth:`ehlo`.

source: If *keyfile* and *certfile* are provided, they are used to create an :class:`ssl.SSLContext`.
ru: Если указаны *keyfile* и *certfile*, они используются для создания :class:`ssl.SSLContext`.

source: Optional *context* parameter is an :class:`ssl.SSLContext` object; This is an alternative to using a keyfile and a certfile and if specified both *keyfile* and *certfile* should be ``None``.
ru: Необязательный параметр *context* представляет собой объект :class:`ssl.SSLContext`; Это альтернатива использованию файла ключа и файла сертификата. Если указано, что *keyfile* и *certfile* должны иметь значение «None».

source: If there has been no previous ``EHLO`` or ``HELO`` command this session, this method tries ESMTP ``EHLO`` first.
ru: Если в этом сеансе не было предыдущей команды ``EHLO`` или ``HELO``, этот метод сначала пробует ESMTP ``EHLO``.

source: The server does not support the STARTTLS extension.
ru: Сервер не поддерживает расширение STARTTLS.

source: SSL/TLS support is not available to your Python interpreter.
ru: Поддержка SSL/TLS недоступна для вашего интерпретатора Python.

source: The method now supports hostname check with :attr:`SSLContext.check_hostname` and *Server Name Indicator* (see :const:`~ssl.HAS_SNI`).
ru: Этот метод теперь поддерживает проверку имени хоста с помощью :attr:`SSLContext.check_hostname` и *Индикатора имени сервера* (см. :const:`~ssl.HAS_SNI`).

source: The error raised for lack of STARTTLS support is now the :exc:`SMTPNotSupportedError` subclass instead of the base :exc:`SMTPException`.
ru: Ошибка, возникающая из-за отсутствия поддержки STARTTLS, теперь относится к подклассу :exc:`SMTPNotSupportedError` вместо базового :exc:`SMTPException`.

source: Send mail. The required arguments are an :rfc:`822` from-address string, a list of :rfc:`822` to-address strings (a bare string will be treated as a list with 1 address), and a message string. The caller may pass a list of ESMTP options (such as ``8bitmime``) to be used in ``MAIL FROM`` commands as *mail_options*. ESMTP options (such as ``DSN`` commands) that should be used with all ``RCPT`` commands can be passed as *rcpt_options*. (If you need to use different ESMTP options to different recipients you have to use the low-level methods such as :meth:`mail`, :meth:`rcpt` and :meth:`data` to send the message.)
ru: Отправить почту. Обязательными аргументами являются строка исходящего адреса :rfc:`822`, список строк исходящего адреса :rfc:`822` (пустая строка будет рассматриваться как список с 1 адресом) и строка сообщения. Вызывающая сторона может передать список опций ESMTP (например, 8bitmime), которые будут использоваться в командах MAIL FROM, как *mail_options*. Параметры ESMTP (например, команды DSN), которые следует использовать со всеми командами RCPT, можно передавать как *rcpt_options*. (Если вам нужно использовать разные параметры ESMTP для разных получателей, вам придется использовать методы низкого уровня, такие как :meth:`mail`, :meth:`rcpt` и :meth:`data` для отправки сообщения.)

source: The *from_addr* and *to_addrs* parameters are used to construct the message envelope used by the transport agents. ``sendmail`` does not modify the message headers in any way.
ru: Параметры *from_addr* и *to_addrs* используются для создания конверта сообщения, используемого агентами транспорта. ``sendmail`` никак не изменяет заголовки сообщений.

source: *msg* may be a string containing characters in the ASCII range, or a byte string. A string is encoded to bytes using the ascii codec, and lone ``\r`` and ``\n`` characters are converted to ``\r\n`` characters. A byte string is not modified.
ru: *msg* может быть строкой, содержащей символы в диапазоне ASCII, или строкой байтов. Строка кодируется в байты с использованием кодека ascii, а отдельные символы ``\r`` и ``\n`` преобразуются в символы ``\r\n``. Строка байтов не изменяется.

source: If there has been no previous ``EHLO`` or ``HELO`` command this session, this method tries ESMTP ``EHLO`` first. If the server does ESMTP, message size and each of the specified options will be passed to it (if the option is in the feature set the server advertises). If ``EHLO`` fails, ``HELO`` will be tried and ESMTP options suppressed.
ru: Если в этом сеансе не было предыдущей команды ``EHLO`` или ``HELO``, этот метод сначала пробует ESMTP ``EHLO``. Если сервер выполняет ESMTP, ему будут переданы размер сообщения и все указанные параметры (если этот параметр входит в набор функций, рекламируемый сервером). Если EHLO завершится неудачей, будет опробован HELO, а параметры ESMTP будут отключены.

source: This method will return normally if the mail is accepted for at least one recipient. Otherwise it will raise an exception. That is, if this method does not raise an exception, then someone should get your mail. If this method does not raise an exception, it returns a dictionary, with one entry for each recipient that was refused. Each entry contains a tuple of the SMTP error code and the accompanying error message sent by the server.
ru: Этот метод вернет нормальный результат, если почта будет принята хотя бы для одного получателя. В противном случае это вызовет исключение. То есть, если этот метод не вызывает исключения, то вашу почту должен кто-то получить. Если этот метод не вызывает исключения, он возвращает словарь с одной записью для каждого получателя, которому было отказано. Каждая запись содержит кортеж кода ошибки SMTP и сопутствующее сообщение об ошибке, отправленное сервером.

source: If ``SMTPUTF8`` is included in *mail_options*, and the server supports it, *from_addr* and *to_addrs* may contain non-ASCII characters.
ru: Если ``SMTPUTF8`` включен в *mail_options* и сервер поддерживает его, *from_addr* и *to_addrs* могут содержать символы, отличные от ASCII.

source: This method may raise the following exceptions:
ru: Этот метод может вызвать следующие исключения:

source: All recipients were refused. Nobody got the mail. The :attr:`recipients` attribute of the exception object is a dictionary with information about the refused recipients (like the one returned when at least one recipient was accepted).
ru: Всем получателям было отказано. Никто не получил письмо. Атрибут :attr:`recipients` объекта исключения представляет собой словарь с информацией об отклоненных получателях (например, тот, который возвращается, когда хотя бы один получатель был принят).

source: The server didn't accept the *from_addr*.
ru: Сервер не принял *from_addr*.

source: The server replied with an unexpected error code (other than a refusal of a recipient).
ru: Сервер ответил неожиданным кодом ошибки (кроме отказа получателя).

source: ``SMTPUTF8`` was given in the *mail_options* but is not supported by the server.
ru: ``SMTPUTF8`` указан в *mail_options*, но не поддерживается сервером.

source: Unless otherwise noted, the connection will be open even after an exception is raised.
ru: Если не указано иное, соединение будет открыто даже после возникновения исключения.

source: *msg* may be a byte string.
ru: *msg* может быть строкой байтов.

source: ``SMTPUTF8`` support added, and :exc:`SMTPNotSupportedError` may be raised if ``SMTPUTF8`` is specified but the server does not support it.
ru: Добавлена ​​поддержка ``SMTPUTF8``, и :exc:`SMTPNotSupportedError` может быть вызвано, если ``SMTPUTF8`` указан, но сервер его не поддерживает.

source: This is a convenience method for calling :meth:`sendmail` with the message represented by an :class:`email.message.Message` object. The arguments have the same meaning as for :meth:`sendmail`, except that *msg* is a ``Message`` object.
ru: Это удобный метод для вызова :meth:`sendmail` с сообщением, представленным объектом :class:`email.message.Message`. Аргументы имеют то же значение, что и для :meth:`sendmail`, за исключением того, что *msg* является объектом ``Message``.

source: If *from_addr* is ``None`` or *to_addrs* is ``None``, ``send_message`` fills those arguments with addresses extracted from the headers of *msg* as specified in :rfc:`5322`\: *from_addr* is set to the :mailheader:`Sender` field if it is present, and otherwise to the :mailheader:`From` field. *to_addrs* combines the values (if any) of the :mailheader:`To`, :mailheader:`Cc`, and :mailheader:`Bcc` fields from *msg*. If exactly one set of :mailheader:`Resent-*` headers appear in the message, the regular headers are ignored and the :mailheader:`Resent-*` headers are used instead. If the message contains more than one set of :mailheader:`Resent-*` headers, a :exc:`ValueError` is raised, since there is no way to unambiguously detect the most recent set of :mailheader:`Resent-` headers.
ru: Если *from_addr* имеет значение None или *to_addrs* имеет значение None, send_message заполняет эти аргументы адресами, извлеченными из заголовков *msg*, как указано в :rfc:`5322`\: *from_addr* устанавливается в поле :mailheader:`Sender`, если оно присутствует, а в противном случае — в поле :mailheader:`From`. *to_addrs* объединяет значения (если есть) полей :mailheader:`To`, :mailheader:`Cc` и :mailheader:`Bcc` из *msg*. Если в сообщении присутствует ровно один набор заголовков :mailheader:`Resent-*`, обычные заголовки игнорируются и вместо них используются заголовки :mailheader:`Resent-*`. Если сообщение содержит более одного набора заголовков :mailheader:`Resent-*`, возникает ошибка :exc:`ValueError`, поскольку не существует способа однозначно определить самый последний набор заголовков :mailheader:`Resent-`. .

source: ``send_message`` serializes *msg* using :class:`~email.generator.BytesGenerator` with ``\r\n`` as the *linesep*, and calls :meth:`sendmail` to transmit the resulting message. Regardless of the values of *from_addr* and *to_addrs*, ``send_message`` does not transmit any :mailheader:`Bcc` or :mailheader:`Resent-Bcc` headers that may appear in *msg*. If any of the addresses in *from_addr* and *to_addrs* contain non-ASCII characters and the server does not advertise ``SMTPUTF8`` support, an :exc:`SMTPNotSupportedError` is raised. Otherwise the ``Message`` is serialized with a clone of its :mod:`~email.policy` with the :attr:`~email.policy.EmailPolicy.utf8` attribute set to ``True``, and ``SMTPUTF8`` and ``BODY=8BITMIME`` are added to *mail_options*.
ru: `` send_message`` `serializes *msg *Использование: class:` ~ email.generator.bytesgenerator` с `` \ r \ n`` как *lineep *и вызовы: meth: `sendmail` для передачи полученного сообщения. Независимо от значений *from_addr *и *to_addrs *, `` send_message` `не передает ни одного: Mailheader:` bcc` или: mailheader: `reveld-bcc` заголовки, которые могут появиться в *msg *. Если какой-либо из адресов в * from_addr * и * to_addrs * содержит не ASCII символы, а сервер не рекламирует `` smtputf8``, поднятся. В противном случае «Сообщение» сериализовано с клоном его: mod: `~ email.policy` с: attr:` ~ email.policy.emailpolicy.utf8`, установленным для `` true`` и `` `` Smtputf8`` и `` body = 8bitmime`` 'добавляются в *mail_options *.

source: Support for internationalized addresses (``SMTPUTF8``).
ru: Поддержка интернационализированных адресов (SMTPUTF8).

source: Terminate the SMTP session and close the connection. Return the result of the SMTP ``QUIT`` command.
ru: Поддержка интернационализированных адресов (SMTPUTF8).

source: Low-level methods corresponding to the standard SMTP/ESMTP commands ``HELP``, ``RSET``, ``NOOP``, ``MAIL``, ``RCPT``, and ``DATA`` are also supported. Normally these do not need to be called directly, so they are not documented here. For details, consult the module code.
ru: Также используются низкоуровневые методы, соответствующие стандартным командам SMTP/ESMTP HELP, RSET, NOOP, MAIL, RCPT и DATA. поддерживается. Обычно их не нужно вызывать напрямую, поэтому они здесь не документированы. Подробную информацию см. в коде модуля.

source: SMTP Example
ru: Пример SMTP

source: This example prompts the user for addresses needed in the message envelope ('To' and 'From' addresses), and the message to be delivered. Note that the headers to be included with the message must be included in the message as entered; this example doesn't do any processing of the :rfc:`822` headers. In particular, the 'To' and 'From' addresses must be included in the message headers explicitly::
ru: В этом примере пользователю предлагается ввести адреса, необходимые в конверте сообщения (адреса «Кому» и «От»), а также сообщение, которое необходимо доставить. Обратите внимание, что заголовки, которые будут включены в сообщение, должны быть включены в сообщение в том виде, в котором оно введено; этот пример не выполняет никакой обработки заголовков :rfc:`822`. В частности, адреса «Кому» и «От» должны быть явно включены в заголовки сообщений:

source: In general, you will want to use the :mod:`email` package's features to construct an email message, which you can then send via :meth:`~smtplib.SMTP.send_message`; see :ref:`email-examples`.
ru: В общем, вы захотите использовать возможности пакета :mod:`email` для создания сообщения электронной почты, которое затем можно будет отправить через :meth:`~smtplib.SMTP.send_message`; см. :ref:`примеры электронной почты`.

source: protocol
ru: протокол

source: Simple Mail Transfer Protocol
ru: Простой протокол передачи почты
