Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/socketserver.po
Languages: ru

source: This function is called when the :attr:`timeout` attribute has been set to a value other than :const:`None` and the timeout period has passed with no requests being received. The default action for forking servers is to collect the status of any child processes that have exited, while in threading servers this method does nothing.
ru: Эта функция вызывается, когда для атрибута :attr:`timeout` установлено значение, отличное от :const:`None`, и период таймаута прошел, а запросы не получены. Действием по умолчанию для разветвленных серверов является сбор состояния всех завершившихся дочерних процессов, тогда как на многопоточных серверах этот метод ничего не делает.

source: Calls :meth:`finish_request` to create an instance of the :attr:`RequestHandlerClass`. If desired, this function can create a new process or thread to handle the request; the :class:`ForkingMixIn` and :class:`ThreadingMixIn` classes do this.
ru: Вызывает :meth:`finish_request` для создания экземпляра :attr:`RequestHandlerClass`. При желании эта функция может создать новый процесс или поток для обработки запроса; это делают классы :class:`ForkingMixIn` и :class:`ThreadingMixIn`.

source: Called by the server's constructor to activate the server. The default behavior for a TCP server just invokes :meth:`~socket.socket.listen` on the server's socket. May be overridden.
ru: Вызывается конструктором сервера для активации сервера. Поведение по умолчанию для TCP-сервера просто вызывает :meth:`~socket.socket.listen` в сокете сервера. Может быть переопределено.

source: Called by the server's constructor to bind the socket to the desired address. May be overridden.
ru: Вызывается конструктором сервера для привязки сокета к желаемому адресу. Может быть переопределено.

source: Must return a Boolean value; if the value is :const:`True`, the request will be processed, and if it's :const:`False`, the request will be denied. This function can be overridden to implement access controls for a server. The default implementation always returns :const:`True`.
ru: Должен возвращать логическое значение; если значение :const:`True`, запрос будет обработан, а если :const:`False`, запрос будет отклонен. Эту функцию можно переопределить для реализации контроля доступа к серверу. Реализация по умолчанию всегда возвращает :const:`True`.

source: Support for the :term:`context manager` protocol was added. Exiting the context manager is equivalent to calling :meth:`server_close`.
ru: Добавлена ​​поддержка протокола :term:`контекстного менеджера`. Выход из контекстного менеджера эквивалентен вызову :meth:`server_close`.

source: Request Handler Objects
ru: Объекты обработчика запроса

source: This is the superclass of all request handler objects. It defines the interface, given below. A concrete request handler subclass must define a new :meth:`handle` method, and can override any of the other methods. A new instance of the subclass is created for each request.
ru: Это суперкласс всех объектов-обработчиков запросов. Он определяет интерфейс, приведенный ниже. Конкретный подкласс обработчика запросов должен определять новый метод :meth:`handle` и может переопределять любой другой метод. Для каждого запроса создается новый экземпляр подкласса.

source: Called before the :meth:`handle` method to perform any initialization actions required. The default implementation does nothing.
ru: Вызывается перед методом :meth:`handle` для выполнения любых необходимых действий по инициализации. Реализация по умолчанию ничего не делает.

source: This function must do all the work required to service a request. The default implementation does nothing. Several instance attributes are available to it; the request is available as :attr:`request`; the client address as :attr:`client_address`; and the server instance as :attr:`server`, in case it needs access to per-server information.
ru: Эта функция должна выполнять всю работу, необходимую для обслуживания запроса. Реализация по умолчанию ничего не делает. Ему доступны несколько атрибутов экземпляра; запрос доступен как :attr:`request`; адрес клиента как :attr:`client_address`; и экземпляр сервера как :attr:`server`, на случай, если ему потребуется доступ к информации по каждому серверу.

source: The type of :attr:`request` is different for datagram or stream services. For stream services, :attr:`request` is a socket object; for datagram services, :attr:`request` is a pair of string and socket.
ru: Тип :attr:`request` различен для дейтаграммных и потоковых сервисов. Для потоковых сервисов :attr:`request` — это объект сокета; для служб дейтаграмм :attr:`request` — это пара строки и сокета.

source: Called after the :meth:`handle` method to perform any clean-up actions required. The default implementation does nothing. If :meth:`setup` raises an exception, this function will not be called.
ru: Вызывается после метода :meth:`handle` для выполнения любых необходимых действий по очистке. Реализация по умолчанию ничего не делает. Если :meth:`setup` вызывает исключение, эта функция не будет вызвана.

source: The *new* :class:`socket.socket` object to be used to communicate with the client.
ru: *новый* объект :class:`socket.socket`, который будет использоваться для связи с клиентом.

source: Client address returned by :meth:`BaseServer.get_request`.
ru: Адрес клиента, возвращаемый :meth:`BaseServer.get_request`.

source: :class:`BaseServer` object used for handling the request.
ru: Объект :class:`BaseServer`, используемый для обработки запроса.

source: These :class:`BaseRequestHandler` subclasses override the :meth:`~BaseRequestHandler.setup` and :meth:`~BaseRequestHandler.finish` methods, and provide :attr:`rfile` and :attr:`wfile` attributes.
ru: Эти подклассы :class:`BaseRequestHandler` переопределяют методы :meth:`~BaseRequestHandler.setup` и :meth:`~BaseRequestHandler.finish` и предоставляют атрибуты :attr:`rfile` и :attr:`wfile`.

source: A file object from which receives the request is read. Support the :class:`io.BufferedIOBase` readable interface.
ru: Читается файловый объект, из которого поступает запрос. Поддержка читаемого интерфейса :class:`io.BufferedIOBase`.

source: A file object to which the reply is written. Support the :class:`io.BufferedIOBase` writable interface
ru: Файловый объект, в который записывается ответ. Поддержка записываемого интерфейса :class:`io.BufferedIOBase`.

source: :attr:`wfile` also supports the :class:`io.BufferedIOBase` writable interface.
ru: :attr:`wfile` также поддерживает записываемый интерфейс :class:`io.BufferedIOBase`.

source: Examples
ru: Примеры

source: :class:`socketserver.TCPServer` Example
ru: Пример :class:`socketserver.TCPServer`

source: This is the server side::
ru: Это серверная часть::

source: An alternative request handler class that makes use of streams (file-like objects that simplify communication by providing the standard file interface)::
ru: Альтернативный класс обработчика запросов, использующий потоки (файлоподобные объекты, которые упрощают взаимодействие, предоставляя стандартный файловый интерфейс)::

source: The difference is that the ``readline()`` call in the second handler will call ``recv()`` multiple times until it encounters a newline character, while the the first handler had to use a ``recv()`` loop to accumulate data until a newline itself. If it had just used a single ``recv()`` without the loop it would just have returned what has been received so far from the client. TCP is stream based: data arrives in the order it was sent, but there no correlation between client ``send()`` or ``sendall()`` calls and the number of ``recv()`` calls on the server required to receive it.
ru: Разница в том, что вызов `` `readline ()` `` во втором обработчике назовет `` recv () `` несколько раз, пока не столкнется с новым символом, в то время как первый обработчик должен был использовать `recv ()` `Цикл для накопления данных до самой новой линии. Если бы он только что использовал один `` recv () `` без цикла, это просто вернуло бы то, что было получено так далеко от клиента. TCP основан на потоке: данные поступают в заказ, который он был отправлен, но нет никакой корреляции между клиентом `` send () `` `` `sendall ()` `` `и количество` `recv ()` `Вызовы на сервер, необходимый для его получения.

source: This is the client side::
ru: Это клиентская сторона::

source: The output of the example should look something like this:
ru: Вывод примера должен выглядеть примерно так:

source: Server:
ru: Сервер:

source: Client:
ru: Клиент:

source: :class:`socketserver.UDPServer` Example
ru: Пример :class:`socketserver.UDPServer`

source: The output of the example should look exactly like for the TCP server example.
ru: Вывод примера должен выглядеть точно так же, как в примере с TCP-сервером.

source: Asynchronous Mixins
ru: Асинхронные миксеры

source: To build asynchronous handlers, use the :class:`ThreadingMixIn` and :class:`ForkingMixIn` classes.
ru: Для создания асинхронных обработчиков используйте классы :class:`ThreadingMixIn` и :class:`ForkingMixIn`.

source: An example for the :class:`ThreadingMixIn` class::
ru: Пример класса :class:`ThreadingMixIn`::

source: The :class:`ForkingMixIn` class is used in the same way, except that the server will spawn a new process for each request. Available only on POSIX platforms that support :func:`~os.fork`.
ru: Класс :class:`ForkingMixIn` используется таким же образом, за исключением того, что сервер будет запускать новый процесс для каждого запроса. Доступно только на платформах POSIX, поддерживающих :func:`~os.fork`.
