Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/socketserver.po
Languages: ru

source: :mod:`!socketserver` --- A framework for network servers
ru: :mod:`!socketserver` --- Фреймворк для сетевых серверов.

source: **Source code:** :source:`Lib/socketserver.py`
ru: **Исходный код:** :source:`Lib/socketserver.py`

source: The :mod:`socketserver` module simplifies the task of writing network servers.
ru: Модуль :mod:`socketserver` упрощает задачу написания сетевых серверов.

source: Availability
ru: Доступность

source: This module does not work or is not available on WebAssembly. See :ref:`wasm-availability` for more information.
ru: Этот модуль не работает или недоступен в WebAssembly. См. :ref:`wasm-availability` для получения дополнительной информации.

source: There are four basic concrete server classes:
ru: Существует четыре основных конкретных класса серверов:

source: This uses the internet TCP protocol, which provides for continuous streams of data between the client and server. If *bind_and_activate* is true, the constructor automatically attempts to invoke :meth:`~BaseServer.server_bind` and :meth:`~BaseServer.server_activate`. The other parameters are passed to the :class:`BaseServer` base class.
ru: При этом используется интернет-протокол TCP, который обеспечивает непрерывные потоки данных между клиентом и сервером. Если *bind_and_activate* имеет значение true, конструктор автоматически пытается вызвать :meth:`~BaseServer.server_bind` и :meth:`~BaseServer.server_activate`. Остальные параметры передаются базовому классу :class:`BaseServer`.

source: This uses datagrams, which are discrete packets of information that may arrive out of order or be lost while in transit. The parameters are the same as for :class:`TCPServer`.
ru: При этом используются дейтаграммы, представляющие собой отдельные пакеты информации, которые могут прийти не по порядку или быть потеряны во время передачи. Параметры такие же, как и для :class:`TCPServer`.

source: These more infrequently used classes are similar to the TCP and UDP classes, but use Unix domain sockets; they're not available on non-Unix platforms. The parameters are the same as for :class:`TCPServer`.
ru: Эти более редко используемые классы похожи на классы TCP и UDP, но используют сокеты домена Unix; они недоступны на платформах, отличных от Unix. Параметры такие же, как и для :class:`TCPServer`.

source: These four classes process requests :dfn:`synchronously`; each request must be completed before the next request can be started. This isn't suitable if each request takes a long time to complete, because it requires a lot of computation, or because it returns a lot of data which the client is slow to process. The solution is to create a separate process or thread to handle each request; the :class:`ForkingMixIn` and :class:`ThreadingMixIn` mix-in classes can be used to support asynchronous behaviour.
ru: Эти четыре класса обрабатывают запросы :dfn:`синхронно`; каждый запрос должен быть завершен, прежде чем можно будет запустить следующий запрос. Это не подходит, если выполнение каждого запроса занимает много времени, поскольку требует большого количества вычислений или возвращает много данных, которые клиент медленно обрабатывает. Решение состоит в том, чтобы создать отдельный процесс или поток для обработки каждого запроса; смешанные классы :class:`ForkingMixIn` и :class:`ThreadingMixIn` могут использоваться для поддержки асинхронного поведения.

source: Creating a server requires several steps. First, you must create a request handler class by subclassing the :class:`BaseRequestHandler` class and overriding its :meth:`~BaseRequestHandler.handle` method; this method will process incoming requests. Second, you must instantiate one of the server classes, passing it the server's address and the request handler class. It is recommended to use the server in a :keyword:`with` statement. Then call the :meth:`~BaseServer.handle_request` or :meth:`~BaseServer.serve_forever` method of the server object to process one or many requests. Finally, call :meth:`~BaseServer.server_close` to close the socket (unless you used a :keyword:`!with` statement).
ru: Создание сервера требует нескольких шагов. Во-первых, вы должны создать класс обработчика запросов, создав подкласс класса :class:`BaseRequestHandler` и переопределив его метод :meth:`~BaseRequestHandler.handle`; этот метод будет обрабатывать входящие запросы. Во-вторых, вы должны создать экземпляр одного из классов сервера, передав ему адрес сервера и класс обработчика запросов. Рекомендуется использовать сервер в операторе :keyword:`with`. Затем вызовите метод :meth:`~BaseServer.handle_request` или :meth:`~BaseServer.serve_forever` объекта сервера для обработки одного или нескольких запросов. Наконец, вызовите :meth:`~BaseServer.server_close`, чтобы закрыть сокет (если вы не использовали оператор :keyword:`!with`).

source: When inheriting from :class:`ThreadingMixIn` for threaded connection behavior, you should explicitly declare how you want your threads to behave on an abrupt shutdown. The :class:`ThreadingMixIn` class defines an attribute *daemon_threads*, which indicates whether or not the server should wait for thread termination. You should set the flag explicitly if you would like threads to behave autonomously; the default is :const:`False`, meaning that Python will not exit until all threads created by :class:`ThreadingMixIn` have exited.
ru: При наследовании от :class:`ThreadingMixIn` для поведения потокового соединения вы должны явно указать, как вы хотите, чтобы ваши потоки вели себя при внезапном завершении работы. Класс :class:`ThreadingMixIn` определяет атрибут *daemon_threads*, который указывает, должен ли сервер ожидать завершения потока. Вам следует установить этот флаг явно, если вы хотите, чтобы потоки работали автономно; значение по умолчанию — :const:`False`, что означает, что Python не завершит работу до тех пор, пока не закроются все потоки, созданные :class:`ThreadingMixIn`.

source: Server classes have the same external methods and attributes, no matter what network protocol they use.
ru: Классы серверов имеют одни и те же внешние методы и атрибуты независимо от того, какой сетевой протокол они используют.

source: Server Creation Notes
ru: Примечания по созданию сервера

source: There are five classes in an inheritance diagram, four of which represent synchronous servers of four types::
ru: На диаграмме наследования имеется пять классов, четыре из которых представляют собой синхронные серверы четырех типов:

source: Note that :class:`UnixDatagramServer` derives from :class:`UDPServer`, not from :class:`UnixStreamServer` --- the only difference between an IP and a Unix server is the address family.
ru: Обратите внимание, что :class:`UnixDatagramServer` происходит от :class:`UDPServer`, а не от :class:`UnixStreamServer` --- единственная разница между IP-сервером и сервером Unix - это семейство адресов.

source: Forking and threading versions of each type of server can be created using these mix-in classes. For instance, :class:`ThreadingUDPServer` is created as follows::
ru: С помощью этих смешанных классов можно создать версии разветвления и многопоточности для каждого типа сервера. Например, :class:`ThreadingUDPServer` создается следующим образом::

source: class ThreadingUDPServer(ThreadingMixIn, UDPServer): pass
ru: класс ThreadingUDPServer (ThreadingMixIn, UDPServer): проходить

source: The mix-in class comes first, since it overrides a method defined in :class:`UDPServer`. Setting the various attributes also changes the behavior of the underlying server mechanism.
ru: На первом месте стоит дополнительный класс, поскольку он переопределяет метод, определенный в :class:`UDPServer`. Установка различных атрибутов также меняет поведение базового серверного механизма.

source: :class:`ForkingMixIn` and the Forking classes mentioned below are only available on POSIX platforms that support :func:`~os.fork`.
ru: :class:`ForkingMixIn` и упомянутые ниже классы Forking доступны только на платформах POSIX, поддерживающих :func:`~os.fork`.

source: :meth:`ForkingMixIn.server_close <BaseServer.server_close>` waits until all child processes complete, except if :attr:`block_on_close` attribute is ``False``.
ru: :meth:`ForkingMixIn.server_close <BaseServer.server_close>` ожидает завершения всех дочерних процессов, за исключением случаев, когда атрибут :attr:`block_on_close` имеет значение ``False``.

source: :meth:`ThreadingMixIn.server_close <BaseServer.server_close>` waits until all non-daemon threads complete, except if :attr:`block_on_close` attribute is ``False``.
ru: :meth:`ThreadingMixIn.server_close <BaseServer.server_close>` ожидает завершения всех потоков, не являющихся демонами, за исключением случаев, когда атрибут :attr:`block_on_close` имеет значение ``False``.

source: For :class:`ThreadingMixIn` use daemonic threads by setting :data:`ThreadingMixIn.daemon_threads <daemon_threads>` to ``True`` to not wait until threads complete.
ru: Для :class:`ThreadingMixIn` используйте демонические потоки, установив для :data:`ThreadingMixIn.daemon_threads <daemon_threads>` значение ``True``, чтобы не ждать завершения потоков.

source: :meth:`ForkingMixIn.server_close <BaseServer.server_close>` and :meth:`ThreadingMixIn.server_close <BaseServer.server_close>` now waits until all child processes and non-daemonic threads complete. Add a new :attr:`ForkingMixIn.block_on_close <block_on_close>` class attribute to opt-in for the pre-3.7 behaviour.
ru: :meth:`ForkingMixIn.server_close <BaseServer.server_close>` и :meth:`ThreadingMixIn.server_close <BaseServer.server_close>` теперь ждут завершения всех дочерних процессов и недемонических потоков. Добавьте новый атрибут класса :attr:`ForkingMixIn.block_on_close <block_on_close>`, чтобы включить поведение версии до версии 3.7.

source: These classes are pre-defined using the mix-in classes.
ru: Эти классы предварительно определены с использованием дополнительных классов.

source: The ``ForkingUnixStreamServer`` and ``ForkingUnixDatagramServer`` classes were added.
ru: Были добавлены классы ForkingUnixStreamServer и ForkingUnixDatagramServer.

source: To implement a service, you must derive a class from :class:`BaseRequestHandler` and redefine its :meth:`~BaseRequestHandler.handle` method. You can then run various versions of the service by combining one of the server classes with your request handler class. The request handler class must be different for datagram or stream services. This can be hidden by using the handler subclasses :class:`StreamRequestHandler` or :class:`DatagramRequestHandler`.
ru: Чтобы реализовать службу, вы должны получить класс от :class:`BaseRequestHandler` и переопределить его метод :meth:`~BaseRequestHandler.handle`. Затем вы можете запускать различные версии службы, комбинируя один из классов сервера с классом обработчика запросов. Класс обработчика запросов должен быть разным для датаграммных или потоковых служб. Это можно скрыть с помощью подклассов обработчиков :class:`StreamRequestHandler` или :class:`DatagramRequestHandler`.

source: Of course, you still have to use your head! For instance, it makes no sense to use a forking server if the service contains state in memory that can be modified by different requests, since the modifications in the child process would never reach the initial state kept in the parent process and passed to each child. In this case, you can use a threading server, but you will probably have to use locks to protect the integrity of the shared data.
ru: Конечно, вам все равно придется работать головой! Например, нет смысла использовать разветвляющийся сервер, если служба содержит состояние в памяти, которое может быть изменено различными запросами, поскольку изменения в дочернем процессе никогда не достигнут начального состояния, хранящегося в родительском процессе и передаваемого каждому дочернему процессу. . В этом случае вы можете использовать потоковый сервер, но вам, вероятно, придется использовать блокировки для защиты целостности общих данных.

source: On the other hand, if you are building an HTTP server where all data is stored externally (for instance, in the file system), a synchronous class will essentially render the service "deaf" while one request is being handled -- which may be for a very long time if a client is slow to receive all the data it has requested. Here a threading or forking server is appropriate.
ru: С другой стороны, если вы создаете HTTP-сервер, на котором все данные хранятся снаружи (например, в файловой системе), синхронный класс по существу сделает службу «глухой», пока обрабатывается один запрос, что может быть в течение очень долгого времени, если клиент медленно получает все запрошенные данные. Здесь уместен многопоточный или разветвляющийся сервер.

source: In some cases, it may be appropriate to process part of a request synchronously, but to finish processing in a forked child depending on the request data. This can be implemented by using a synchronous server and doing an explicit fork in the request handler class :meth:`~BaseRequestHandler.handle` method.
ru: В некоторых случаях может оказаться целесообразным обрабатывать часть запроса синхронно, но завершать обработку в разветвленном дочернем элементе в зависимости от данных запроса. Это можно реализовать с помощью синхронного сервера и явного разветвления метода класса обработчика запроса :meth:`~BaseRequestHandler.handle`.

source: Another approach to handling multiple simultaneous requests in an environment that supports neither threads nor :func:`~os.fork` (or where these are too expensive or inappropriate for the service) is to maintain an explicit table of partially finished requests and to use :mod:`selectors` to decide which request to work on next (or whether to handle a new incoming request). This is particularly important for stream services where each client can potentially be connected for a long time (if threads or subprocesses cannot be used).
ru: Другой подход к обработке нескольких одновременных запросов в среде, которая не поддерживает ни потоки, ни :func:`~os.fork` (или там, где они слишком дороги или не подходят для службы), состоит в том, чтобы поддерживать явную таблицу частично завершенных запросов и использовать :mod:`селекторы`, чтобы решить, над каким запросом работать дальше (или обрабатывать ли новый входящий запрос). Это особенно важно для потоковых сервисов, где каждый клиент потенциально может быть подключен в течение длительного времени (если невозможно использовать потоки или подпроцессы).

source: Server Objects
ru: Объекты сервера

source: This is the superclass of all Server objects in the module. It defines the interface, given below, but does not implement most of the methods, which is done in subclasses. The two parameters are stored in the respective :attr:`server_address` and :attr:`RequestHandlerClass` attributes.
ru: Это суперкласс всех объектов Сервера в модуле. Он определяет интерфейс, представленный ниже, но не реализует большинство методов, что делается в подклассах. Эти два параметра хранятся в соответствующих атрибутах :attr:`server_address` и :attr:`RequestHandlerClass`.

source: Return an integer file descriptor for the socket on which the server is listening. This function is most commonly passed to :mod:`selectors`, to allow monitoring multiple servers in the same process.
ru: Возвращает целочисленный файловый дескриптор сокета, который прослушивает сервер. Эта функция чаще всего передается :mod:`selectors`, чтобы позволить контролировать несколько серверов в одном процессе.

source: Process a single request. This function calls the following methods in order: :meth:`get_request`, :meth:`verify_request`, and :meth:`process_request`. If the user-provided :meth:`~BaseRequestHandler.handle` method of the handler class raises an exception, the server's :meth:`handle_error` method will be called. If no request is received within :attr:`timeout` seconds, :meth:`handle_timeout` will be called and :meth:`handle_request` will return.
ru: Обработка одного запроса. Эта функция вызывает следующие методы по порядку: :meth:`get_request`, :meth:`verify_request` и :meth:`process_request`. Если предоставленный пользователем метод :meth:`~BaseRequestHandler.handle` класса обработчика вызывает исключение, будет вызван серверный метод :meth:`handle_error`. Если в течение :attr:`timeout` секунд не будет получено ни одного запроса, будет вызван :meth:`handle_timeout` и :meth:`handle_request` вернет значение.

source: Handle requests until an explicit :meth:`shutdown` request. Poll for shutdown every *poll_interval* seconds. Ignores the :attr:`timeout` attribute. It also calls :meth:`service_actions`, which may be used by a subclass or mixin to provide actions specific to a given service. For example, the :class:`ForkingMixIn` class uses :meth:`service_actions` to clean up zombie child processes.
ru: Обрабатывать запросы до тех пор, пока не будет получен явный запрос :meth:`shutdown`. Опрос на выключение каждые *poll_interval* секунд. Игнорирует атрибут :attr:`timeout`. Он также вызывает :meth:`service_actions`, который может использоваться подклассом или миксином для выполнения действий, специфичных для данного сервиса. Например, класс :class:`ForkingMixIn` использует :meth:`service_actions` для очистки дочерних процессов-зомби.

source: Added ``service_actions`` call to the ``serve_forever`` method.
ru: Добавлен вызов service_actions к методу serve_forever.

source: This is called in the :meth:`serve_forever` loop. This method can be overridden by subclasses or mixin classes to perform actions specific to a given service, such as cleanup actions.
ru: Это вызывается в цикле :meth:`serve_forever`. Этот метод может быть переопределен подклассами или классами примеси для выполнения действий, специфичных для данной службы, таких как действия по очистке.

source: Tell the :meth:`serve_forever` loop to stop and wait until it does. :meth:`shutdown` must be called while :meth:`serve_forever` is running in a different thread otherwise it will deadlock.
ru: Прикажите циклу :meth:`serve_forever` остановиться и подождать, пока он это сделает. :meth:`shutdown` должен вызываться, пока :meth:`serve_forever` работает в другом потоке, иначе произойдет тупиковая ситуация.

source: Clean up the server. May be overridden.
ru: Очистите сервер. Может быть переопределено.

source: The family of protocols to which the server's socket belongs. Common examples are :const:`socket.AF_INET`, :const:`socket.AF_INET6`, and :const:`socket.AF_UNIX`. Subclass the TCP or UDP server classes in this module with class attribute ``address_family = AF_INET6`` set if you want IPv6 server classes.
ru: Семейство протоколов, которым принадлежит сокет сервера. Общие примеры: const: `socket.af_inet`,: const:` socket.af_inet6` и: const: `socket.af_unix`. Подкласс классов TCP или UDP -сервера в этом модуле с атрибутом класса `` address_family = af_inet6`` Установите, если вы хотите классы сервера IPv6.

source: The user-provided request handler class; an instance of this class is created for each request.
ru: Класс обработчика пользовательских запросов; экземпляр этого класса создается для каждого запроса.

source: The address on which the server is listening. The format of addresses varies depending on the protocol family; see the documentation for the :mod:`socket` module for details. For internet protocols, this is a tuple containing a string giving the address, and an integer port number: ``('127.0.0.1', 80)``, for example.
ru: Адрес, который прослушивает сервер. Формат адресов варьируется в зависимости от семейства протоколов; подробности см. в документации модуля :mod:`socket`. Для интернет-протоколов это кортеж, содержащий строку, задающую адрес, и целочисленный номер порта: например, ``('127.0.0.1', 80)``.

source: The socket object on which the server will listen for incoming requests.
ru: Объект сокета, на котором сервер будет прослушивать входящие запросы.

source: The server classes support the following class variables:
ru: Классы сервера поддерживают следующие переменные класса:

source: Whether the server will allow the reuse of an address. This defaults to :const:`False`, and can be set in subclasses to change the policy.
ru: Разрешит ли сервер повторное использование адреса. По умолчанию это :const:`False` и может быть установлено в подклассах для изменения политики.

source: The size of the request queue. If it takes a long time to process a single request, any requests that arrive while the server is busy are placed into a queue, up to :attr:`request_queue_size` requests. Once the queue is full, further requests from clients will get a "Connection denied" error. The default value is usually 5, but this can be overridden by subclasses.
ru: Размер очереди запросов. Если обработка одного запроса занимает много времени, любые запросы, поступающие, пока сервер занят, помещаются в очередь, вплоть до запросов :attr:`request_queue_size`. Как только очередь заполнится, дальнейшие запросы от клиентов будут получать ошибку «Соединение отклонено». Значение по умолчанию обычно равно 5, но оно может быть переопределено подклассами.

source: The type of socket used by the server; :const:`socket.SOCK_STREAM` and :const:`socket.SOCK_DGRAM` are two common values.
ru: Тип сокета, используемый сервером; :const:`socket.SOCK_STREAM` и :const:`socket.SOCK_DGRAM` — два общих значения.

source: Timeout duration, measured in seconds, or :const:`None` if no timeout is desired. If :meth:`handle_request` receives no incoming requests within the timeout period, the :meth:`handle_timeout` method is called.
ru: Продолжительность тайм-аута, измеряемая в секундах, или :const:`None`, если тайм-аут не требуется. Если :meth:`handle_request` не получает входящих запросов в течение периода ожидания, вызывается метод :meth:`handle_timeout`.

source: There are various server methods that can be overridden by subclasses of base server classes like :class:`TCPServer`; these methods aren't useful to external users of the server object.
ru: Существуют различные серверные методы, которые могут быть переопределены подклассами базовых серверных классов, например :class:`TCPServer`; эти методы бесполезны для внешних пользователей объекта сервера.

source: Actually processes the request by instantiating :attr:`RequestHandlerClass` and calling its :meth:`~BaseRequestHandler.handle` method.
ru: Фактически обрабатывает запрос, создавая экземпляр :attr:`RequestHandlerClass` и вызывая его метод :meth:`~BaseRequestHandler.handle`.

source: Must accept a request from the socket, and return a 2-tuple containing the *new* socket object to be used to communicate with the client, and the client's address.
ru: Должен принять запрос из сокета и вернуть кортеж из двух элементов, содержащий *новый* объект сокета, который будет использоваться для связи с клиентом, и адрес клиента.

source: This function is called if the :meth:`~BaseRequestHandler.handle` method of a :attr:`RequestHandlerClass` instance raises an exception. The default action is to print the traceback to standard error and continue handling further requests.
ru: Эта функция вызывается, если метод :meth:`~BaseRequestHandler.handle` экземпляра :attr:`RequestHandlerClass` вызывает исключение. Действие по умолчанию — распечатать обратную трассировку до стандартной ошибки и продолжить обработку дальнейших запросов.

source: Now only called for exceptions derived from the :exc:`Exception` class.
ru: Теперь вызывается только для исключений, производных от класса :exc:`Exception`.
