Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/ssl.po
Languages: ru

source: Certificates in general are part of a public-key / private-key system. In this system, each *principal*, (which may be a machine, or a person, or an organization) is assigned a unique two-part encryption key. One part of the key is public, and is called the *public key*; the other part is kept secret, and is called the *private key*. The two parts are related, in that if you encrypt a message with one of the parts, you can decrypt it with the other part, and **only** with the other part.
ru: Сертификаты в целом являются частью системы открытого/закрытого ключей. В этой системе каждому *участнику* (которым может быть машина, человек или организация) назначается уникальный ключ шифрования, состоящий из двух частей. Одна часть ключа является общедоступной и называется *открытым ключом*; другая часть хранится в секрете и называется *закрытым ключом*. Эти две части связаны тем, что если вы зашифруете сообщение с помощью одной из частей, вы сможете расшифровать его с помощью другой части, и **только** с помощью другой части.

source: A certificate contains information about two principals. It contains the name of a *subject*, and the subject's public key. It also contains a statement by a second principal, the *issuer*, that the subject is who they claim to be, and that this is indeed the subject's public key. The issuer's statement is signed with the issuer's private key, which only the issuer knows. However, anyone can verify the issuer's statement by finding the issuer's public key, decrypting the statement with it, and comparing it to the other information in the certificate. The certificate also contains information about the time period over which it is valid. This is expressed as two fields, called "notBefore" and "notAfter".
ru: Сертификат содержит информацию о двух принципалах. Он содержит имя *субъекта* и открытый ключ субъекта. Он также содержит заявление второго принципала, *эмитента*, о том, что субъект является тем, кем он себя называет, и что это действительно открытый ключ субъекта. Заявление эмитента подписывается закрытым ключом эмитента, который известен только эмитенту. Однако любой может проверить заявление эмитента, найдя открытый ключ эмитента, расшифровав с его помощью заявление и сравнив его с другой информацией в сертификате. Сертификат также содержит информацию о периоде времени, в течение которого он действителен. Это выражается в двух полях, называемых «notBefore» и «notAfter».

source: In the Python use of certificates, a client or server can use a certificate to prove who they are. The other side of a network connection can also be required to produce a certificate, and that certificate can be validated to the satisfaction of the client or server that requires such validation. The connection attempt can be set to raise an exception if the validation fails. Validation is done automatically, by the underlying OpenSSL framework; the application need not concern itself with its mechanics. But the application does usually need to provide sets of certificates to allow this process to take place.
ru: При использовании сертификатов в Python клиент или сервер могут использовать сертификат, чтобы доказать, кем они являются. Другой стороне сетевого подключения также может потребоваться выдать сертификат, и этот сертификат может быть проверен в соответствии с требованиями клиента или сервера, которому требуется такая проверка. Попытку подключения можно настроить так, чтобы она вызывала исключение в случае неудачной проверки. Проверка выполняется автоматически базовой платформой OpenSSL; приложению не нужно беспокоиться о своей механике. Но для осуществления этого процесса приложению обычно необходимо предоставить наборы сертификатов.

source: Python uses files to contain certificates. They should be formatted as "PEM" (see :rfc:`1422`), which is a base-64 encoded form wrapped with a header line and a footer line::
ru: Python использует файлы для хранения сертификатов. Они должны быть отформатированы как «PEM» (см. :rfc:`1422`), который представляет собой форму в кодировке Base64, обернутую строкой заголовка и строкой нижнего колонтитула:

source: Certificate chains
ru: Цепочки сертификатов

source: The Python files which contain certificates can contain a sequence of certificates, sometimes called a *certificate chain*. This chain should start with the specific certificate for the principal who "is" the client or server, and then the certificate for the issuer of that certificate, and then the certificate for the issuer of *that* certificate, and so on up the chain till you get to a certificate which is *self-signed*, that is, a certificate which has the same subject and issuer, sometimes called a *root certificate*. The certificates should just be concatenated together in the certificate file. For example, suppose we had a three certificate chain, from our server certificate to the certificate of the certification authority that signed our server certificate, to the root certificate of the agency which issued the certification authority's certificate::
ru: Файлы Python, содержащие сертификаты, могут содержать последовательность сертификатов, иногда называемую *цепочкой сертификатов*. Эта цепочка должна начинаться с конкретного сертификата для принципала, который «является» клиентом или сервером, затем сертификата для эмитента этого сертификата, а затем сертификата для эмитента *этого* сертификата, и так далее по цепочке. пока вы не дойдете до *самозаверяющего* сертификата, то есть сертификата, имеющего тот же субъект и того же эмитента, который иногда называют *корневым сертификатом*. Сертификаты следует просто объединить в файл сертификата. Например, предположим, что у нас есть цепочка из трех сертификатов: от сертификата нашего сервера до сертификата центра сертификации, подписавшего наш сертификат сервера, до корневого сертификата агентства, выдавшего сертификат центра сертификации:

source: CA certificates
ru: Сертификаты CA

source: If you are going to require validation of the other side of the connection's certificate, you need to provide a "CA certs" file, filled with the certificate chains for each issuer you are willing to trust. Again, this file just contains these chains concatenated together. For validation, Python will use the first chain it finds in the file which matches. The platform's certificates file can be used by calling :meth:`SSLContext.load_default_certs`, this is done automatically with :func:`.create_default_context`.
ru: Если вам потребуется проверка другой стороны сертификата соединения, вам необходимо предоставить файл «CA сертификаты», заполненный цепочками сертификатов для каждого эмитента, которому вы готовы доверять. Опять же, этот файл просто содержит эти цепочки, объединенные вместе. Для проверки Python будет использовать первую найденную цепочку в файле, который соответствует. Файл сертификатов платформы можно использовать, вызвав :meth:`SSLContext.load_default_certs`, это делается автоматически с помощью :func:`.create_default_context`.

source: Combined key and certificate
ru: Комбинированный ключ и сертификат

source: Often the private key is stored in the same file as the certificate; in this case, only the ``certfile`` parameter to :meth:`SSLContext.load_cert_chain` needs to be passed. If the private key is stored with the certificate, it should come before the first certificate in the certificate chain::
ru: Часто закрытый ключ хранится в том же файле, что и сертификат; в этом случае необходимо передать только параметр ``certfile`` в :meth:`SSLContext.load_cert_chain`. Если закрытый ключ хранится вместе с сертификатом, он должен располагаться перед первым сертификатом в цепочке сертификатов:

source: Self-signed certificates
ru: Самоподписанные сертификаты

source: If you are going to create a server that provides SSL-encrypted connection services, you will need to acquire a certificate for that service. There are many ways of acquiring appropriate certificates, such as buying one from a certification authority. Another common practice is to generate a self-signed certificate. The simplest way to do this is with the OpenSSL package, using something like the following::
ru: Если вы собираетесь создать сервер, предоставляющий службы соединений с шифрованием SSL, вам необходимо будет приобрести сертификат для этой службы. Существует множество способов получения соответствующих сертификатов, например покупка сертификата в центре сертификации. Другая распространенная практика — создание самозаверяющего сертификата. Самый простой способ сделать это — использовать пакет OpenSSL, используя что-то вроде следующего:

source: The disadvantage of a self-signed certificate is that it is its own root certificate, and no one else will have it in their cache of known (and trusted) root certificates.
ru: Недостаток самозаверяющего сертификата заключается в том, что это собственный корневой сертификат, и никто другой не будет иметь его в своем кеше известных (и доверенных) корневых сертификатов.

source: Examples
ru: Примеры

source: Testing for SSL support
ru: Тестирование поддержки SSL

source: To test for the presence of SSL support in a Python installation, user code should use the following idiom::
ru: Чтобы проверить наличие поддержки SSL в установке Python, пользовательский код должен использовать следующую идиому:

source: Client-side operation
ru: Работа на стороне клиента

source: This example creates a SSL context with the recommended security settings for client sockets, including automatic certificate verification::
ru: В этом примере создается контекст SSL с рекомендуемыми настройками безопасности для клиентских сокетов, включая автоматическую проверку сертификата:

source: If you prefer to tune security settings yourself, you might create a context from scratch (but beware that you might not get the settings right)::
ru: Если вы предпочитаете настраивать параметры безопасности самостоятельно, вы можете создать контекст с нуля (но будьте осторожны, вы можете неправильно настроить параметры)::

source: (this snippet assumes your operating system places a bundle of all CA certificates in ``/etc/ssl/certs/ca-bundle.crt``; if not, you'll get an error and have to adjust the location)
ru: (в этом фрагменте предполагается, что ваша операционная система помещает пакет всех сертификатов CA в ``/etc/ssl/certs/ca-bundle.crt``; в противном случае вы получите сообщение об ошибке и вам придется изменить местоположение)

source: The :data:`PROTOCOL_TLS_CLIENT` protocol configures the context for cert validation and hostname verification. :attr:`~SSLContext.verify_mode` is set to :data:`CERT_REQUIRED` and :attr:`~SSLContext.check_hostname` is set to ``True``. All other protocols create SSL contexts with insecure defaults.
ru: Протокол :data:`PROTOCOL_TLS_CLIENT` настраивает контекст для проверки сертификатов и проверки имени хоста. Для :attr:`~SSLContext.verify_mode` установлено значение :data:`CERT_REQUIRED`, а для :attr:`~SSLContext.check_hostname` установлено значение ``True``. Все остальные протоколы создают контексты SSL с небезопасными настройками по умолчанию.

source: When you use the context to connect to a server, :const:`CERT_REQUIRED` and :attr:`~SSLContext.check_hostname` validate the server certificate: it ensures that the server certificate was signed with one of the CA certificates, checks the signature for correctness, and verifies other properties like validity and identity of the hostname::
ru: Когда вы используете контекст для подключения к серверу, :const:`CERT_REQUIRED` и :attr:`~SSLContext.check_hostname` проверяют сертификат сервера: они гарантируют, что сертификат сервера был подписан одним из сертификатов CA, проверяет подпись на правильность и проверяет другие свойства, такие как достоверность и идентичность имени хоста::

source: You may then fetch the certificate::
ru: Затем вы можете получить сертификат::

source: Visual inspection shows that the certificate does identify the desired service (that is, the HTTPS host ``www.python.org``)::
ru: Визуальная проверка показывает, что сертификат действительно идентифицирует нужную службу (то есть хост HTTPS www.python.org):

source: Now the SSL channel is established and the certificate verified, you can proceed to talk with the server::
ru: Теперь SSL-канал установлен и сертификат проверен, можно приступать к общению с сервером:

source: Server-side operation
ru: Работа на стороне сервера

source: For server operation, typically you'll need to have a server certificate, and private key, each in a file. You'll first create a context holding the key and the certificate, so that clients can check your authenticity. Then you'll open a socket, bind it to a port, call :meth:`listen` on it, and start waiting for clients to connect::
ru: Для работы сервера обычно вам необходимо иметь сертификат сервера и закрытый ключ, каждый из которых находится в файле. Сначала вы создадите контекст, содержащий ключ и сертификат, чтобы клиенты могли проверить вашу подлинность. Затем вы открываете сокет, привязываете его к порту, вызываете на нем :meth:`listen` и начинаете ждать подключения клиентов::

source: When a client connects, you'll call :meth:`accept` on the socket to get the new socket from the other end, and use the context's :meth:`SSLContext.wrap_socket` method to create a server-side SSL socket for the connection::
ru: Когда клиент подключается, вы вызываете :meth:`accept` для сокета, чтобы получить новый сокет с другого конца, и используете контекстный метод :meth:`SSLContext.wrap_socket` для создания SSL-сокета на стороне сервера для соединение::

source: Then you'll read data from the ``connstream`` and do something with it till you are finished with the client (or the client is finished with you)::
ru: Затем вы будете читать данные из ``connstream`` и что-то делать с ними, пока не закончите работу с клиентом (или клиент не закончит работу с вами)::

source: And go back to listening for new client connections (of course, a real server would probably handle each client connection in a separate thread, or put the sockets in :ref:`non-blocking mode <ssl-nonblocking>` and use an event loop).
ru: И вернитесь к прослушиванию новых клиентских подключений (конечно, реальный сервер, вероятно, будет обрабатывать каждое клиентское соединение в отдельном потоке или переведет сокеты в :ref:`неблокирующий режим <ssl-nonblocking>` и будет использовать событие петля).

source: Notes on non-blocking sockets
ru: Примечания о неблокирующих сокетах

source: SSL sockets behave slightly different than regular sockets in non-blocking mode. When working with non-blocking sockets, there are thus several things you need to be aware of:
ru: Сокеты SSL ведут себя немного иначе, чем обычные сокеты в неблокирующем режиме. Таким образом, при работе с неблокирующими сокетами необходимо учитывать несколько вещей:

source: Most :class:`SSLSocket` methods will raise either :exc:`SSLWantWriteError` or :exc:`SSLWantReadError` instead of :exc:`BlockingIOError` if an I/O operation would block. :exc:`SSLWantReadError` will be raised if a read operation on the underlying socket is necessary, and :exc:`SSLWantWriteError` for a write operation on the underlying socket. Note that attempts to *write* to an SSL socket may require *reading* from the underlying socket first, and attempts to *read* from the SSL socket may require a prior *write* to the underlying socket.
ru: Большинство методов :class:`SSLSocket` вызовут либо :exc:`SSLWantWriteError`, либо :exc:`SSLWantReadError` вместо :exc:`BlockingIOError`, если операция ввода-вывода блокируется. :exc:`SSLWantReadError` будет вызываться, если необходима операция чтения в базовом сокете, и :exc:`SSLWantWriteError` для операции записи в базовом сокете. Обратите внимание, что попытки *записи* в сокет SSL могут сначала потребовать *чтения* из базового сокета, а попытки *чтения* из сокета SSL могут потребовать предварительной *записи* в базовый сокет.

source: In earlier Python versions, the :meth:`!SSLSocket.send` method returned zero instead of raising :exc:`SSLWantWriteError` or :exc:`SSLWantReadError`.
ru: В более ранних версиях Python метод :meth:`!SSLSocket.send` возвращал ноль вместо вызова :exc:`SSLWantWriteError` или :exc:`SSLWantReadError`.

source: Calling :func:`~select.select` tells you that the OS-level socket can be read from (or written to), but it does not imply that there is sufficient data at the upper SSL layer. For example, only part of an SSL frame might have arrived. Therefore, you must be ready to handle :meth:`SSLSocket.recv` and :meth:`SSLSocket.send` failures, and retry after another call to :func:`~select.select`.
ru: Вызов :func:`~select.select` сообщает вам, что сокет уровня ОС можно читать (или записывать), но это не означает, что на верхнем уровне SSL имеется достаточно данных. Например, могла быть доставлена ​​только часть кадра SSL. Поэтому вы должны быть готовы обработать сбои :meth:`SSLSocket.recv` и :meth:`SSLSocket.send` и повторить попытку после следующего вызова :func:`~select.select`.

source: Conversely, since the SSL layer has its own framing, a SSL socket may still have data available for reading without :func:`~select.select` being aware of it. Therefore, you should first call :meth:`SSLSocket.recv` to drain any potentially available data, and then only block on a :func:`~select.select` call if still necessary.
ru: И наоборот, поскольку уровень SSL имеет свою собственную структуру, сокет SSL может по-прежнему иметь данные, доступные для чтения, без :func:`~select.select` ведома об этом. Поэтому вам следует сначала вызвать :meth:`SSLSocket.recv`, чтобы удалить любые потенциально доступные данные, а затем заблокировать вызов :func:`~select.select` только в том случае, если это все еще необходимо.

source: (of course, similar provisions apply when using other primitives such as :func:`~select.poll`, or those in the :mod:`selectors` module)
ru: (конечно, аналогичные положения применяются и при использовании других примитивов, таких как :func:`~select.poll` или тех, которые находятся в модуле :mod:`selectors`)

source: The SSL handshake itself will be non-blocking: the :meth:`SSLSocket.do_handshake` method has to be retried until it returns successfully. Here is a synopsis using :func:`~select.select` to wait for the socket's readiness::
ru: Само рукопожатие SSL будет неблокирующим: метод :meth:`SSLSocket.do_handshake` необходимо повторять до тех пор, пока он не вернется успешно. Вот краткий обзор использования :func:`~select.select` для ожидания готовности сокета::

source: The :mod:`asyncio` module supports :ref:`non-blocking SSL sockets <ssl-nonblocking>` and provides a higher level API. It polls for events using the :mod:`selectors` module and handles :exc:`SSLWantWriteError`, :exc:`SSLWantReadError` and :exc:`BlockingIOError` exceptions. It runs the SSL handshake asynchronously as well.
ru: Модуль :mod:`asyncio` поддерживает :ref:`неблокирующие SSL-сокеты <ssl-nonblocking>` и предоставляет API более высокого уровня. Он опрашивает события с помощью модуля :mod:`selectors` и обрабатывает исключения :exc:`SSLWantWriteError`, :exc:`SSLWantReadError` и :exc:`BlockingIOError`. Он также выполняет подтверждение SSL асинхронно.

source: Memory BIO Support
ru: Поддержка памяти BIO

source: Ever since the SSL module was introduced in Python 2.6, the :class:`SSLSocket` class has provided two related but distinct areas of functionality:
ru: С тех пор, как модуль SSL был представлен в Python 2.6, класс :class:`SSLSocket` предоставил две связанные, но разные области функциональности:

source: SSL protocol handling
ru: Обработка протокола SSL

source: Network IO
ru: Сетевой ввод-вывод

source: The network IO API is identical to that provided by :class:`socket.socket`, from which :class:`SSLSocket` also inherits. This allows an SSL socket to be used as a drop-in replacement for a regular socket, making it very easy to add SSL support to an existing application.
ru: Сетевой API ввода-вывода идентичен тому, который предоставляется :class:`socket.socket`, от которого также наследуется :class:`SSLSocket`. Это позволяет использовать сокет SSL в качестве замены обычного сокета, что упрощает добавление поддержки SSL в существующее приложение.

source: Combining SSL protocol handling and network IO usually works well, but there are some cases where it doesn't. An example is async IO frameworks that want to use a different IO multiplexing model than the "select/poll on a file descriptor" (readiness based) model that is assumed by :class:`socket.socket` and by the internal OpenSSL socket IO routines. This is mostly relevant for platforms like Windows where this model is not efficient. For this purpose, a reduced scope variant of :class:`SSLSocket` called :class:`SSLObject` is provided.
ru: Сочетание обработки протокола SSL и сетевого ввода-вывода обычно работает хорошо, но в некоторых случаях это не так. Примером являются асинхронные платформы ввода-вывода, которые хотят использовать другую модель мультиплексирования ввода-вывода, отличную от модели «выбор/опрос файлового дескриптора» (на основе готовности), которая предполагается классом:`socket.socket` и внутренним вводом-выводом сокета OpenSSL. процедуры. Это в основном актуально для таких платформ, как Windows, где эта модель неэффективна. Для этой цели предусмотрен вариант :class:`SSLSocket` с ограниченной областью действия, называемый :class:`SSLObject`.

source: A reduced-scope variant of :class:`SSLSocket` representing an SSL protocol instance that does not contain any network IO methods. This class is typically used by framework authors that want to implement asynchronous IO for SSL through memory buffers.
ru: Вариант :class:`SSLSocket` с ограниченной областью действия, представляющий экземпляр протокола SSL, который не содержит никаких сетевых методов ввода-вывода. Этот класс обычно используется авторами платформы, которые хотят реализовать асинхронный ввод-вывод для SSL через буферы памяти.

source: This class implements an interface on top of a low-level SSL object as implemented by OpenSSL. This object captures the state of an SSL connection but does not provide any network IO itself. IO needs to be performed through separate "BIO" objects which are OpenSSL's IO abstraction layer.
ru: Этот класс реализует интерфейс поверх объекта SSL низкого уровня, реализованного OpenSSL. Этот объект фиксирует состояние SSL-соединения, но сам не предоставляет никаких сетевых операций ввода-вывода. Ввод-вывод должен выполняться через отдельные объекты «BIO», которые являются уровнем абстракции ввода-вывода OpenSSL.

source: This class has no public constructor. An :class:`SSLObject` instance must be created using the :meth:`~SSLContext.wrap_bio` method. This method will create the :class:`SSLObject` instance and bind it to a pair of BIOs. The *incoming* BIO is used to pass data from Python to the SSL protocol instance, while the *outgoing* BIO is used to pass data the other way around.
ru: У этого класса нет открытого конструктора. Экземпляр :class:`SSLObject` должен быть создан с использованием метода :meth:`~SSLContext.wrap_bio`. Этот метод создаст экземпляр :class:`SSLObject` и привяжет его к паре BIO. *Входящий* BIO используется для передачи данных из Python в экземпляр протокола SSL, а *исходящий* BIO используется для передачи данных наоборот.

source: The following methods are available:
ru: Доступны следующие методы:

source: When compared to :class:`SSLSocket`, this object lacks the following features:
ru: По сравнению с :class:`SSLSocket`, этот объект лишен следующих функций:

source: Any form of network IO; ``recv()`` and ``send()`` read and write only to the underlying :class:`MemoryBIO` buffers.
ru: Любая форма сетевого ввода-вывода; ``recv()`` и ``send()`` читают и записывают только в базовые буферы :class:`MemoryBIO`.
