Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/ssl.po
Languages: ru

source: This is a legacy API retained for backwards compatibility. When possible, you should use :attr:`sni_callback` instead. The given *server_name_callback* is similar to *sni_callback*, except that when the server hostname is an IDN-encoded internationalized domain name, the *server_name_callback* receives a decoded U-label (``"pythön.org"``).
ru: Это устаревший API, сохраненный для обратной совместимости. По возможности вместо этого следует использовать :attr:`sni_callback`. Данное *server_name_callback* аналогично *sni_callback*, за исключением того, что, когда имя хоста сервера является интернационализированным доменным именем в кодировке IDN, *server_name_callback* получает декодированную U-метку (``"pythön.org"``).

source: If there is a decoding error on the server name, the TLS connection will terminate with an :const:`ALERT_DESCRIPTION_INTERNAL_ERROR` fatal TLS alert message to the client.
ru: Если в имени сервера имеется ошибка декодирования, соединение TLS прервется с выдачей клиенту :const:`ALERT_DESCRIPTION_INTERNAL_ERROR` фатального предупреждающего сообщения TLS.

source: Load the key generation parameters for Diffie-Hellman (DH) key exchange. Using DH key exchange improves forward secrecy at the expense of computational resources (both on the server and on the client). The *dhfile* parameter should be the path to a file containing DH parameters in PEM format.
ru: Загрузите параметры генерации ключей для обмена ключами Диффи-Хеллмана (DH). Использование обмена ключами DH улучшает прямую секретность за счет вычислительных ресурсов (как на сервере, так и на клиенте). Параметр *dhfile* должен указывать путь к файлу, содержащему параметры DH в формате PEM.

source: This setting doesn't apply to client sockets. You can also use the :data:`OP_SINGLE_DH_USE` option to further improve security.
ru: Этот параметр не применяется к клиентским сокетам. Вы также можете использовать опцию :data:`OP_SINGLE_DH_USE` для дальнейшего повышения безопасности.

source: Set the curve name for Elliptic Curve-based Diffie-Hellman (ECDH) key exchange. ECDH is significantly faster than regular DH while arguably as secure. The *curve_name* parameter should be a string describing a well-known elliptic curve, for example ``prime256v1`` for a widely supported curve.
ru: Задайте имя кривой для обмена ключами Диффи-Хеллмана (ECDH) на основе эллиптической кривой. ECDH значительно быстрее обычного DH, но при этом, возможно, столь же безопасен. Параметр *curve_name* должен представлять собой строку, описывающую хорошо известную эллиптическую кривую, например «prime256v1» для широко поддерживаемой кривой.

source: This setting doesn't apply to client sockets. You can also use the :data:`OP_SINGLE_ECDH_USE` option to further improve security.
ru: Этот параметр не применяется к клиентским сокетам. Вы также можете использовать опцию :data:`OP_SINGLE_ECDH_USE` для дальнейшего повышения безопасности.

source: This method is not available if :data:`HAS_ECDH` is ``False``.
ru: Этот метод недоступен, если :data:`HAS_ECDH` имеет значение ``False``.

source: `SSL/TLS & Perfect Forward Secrecy <https://vincent.bernat.ch/en/blog/2011-ssl-perfect-forward-secrecy>`_
ru: `SSL/TLS и идеальная прямая секретность <https://vincent.bernat.ch/en/blog/2011-ssl-perfect-forward-secrecy>`_

source: Wrap an existing Python socket *sock* and return an instance of :attr:`SSLContext.sslsocket_class` (default :class:`SSLSocket`). The returned SSL socket is tied to the context, its settings and certificates. *sock* must be a :const:`~socket.SOCK_STREAM` socket; other socket types are unsupported.
ru: Оберните существующий сокет Python *sock* и верните экземпляр :attr:`SSLContext.sslsocket_class` (по умолчанию :class:`SSLSocket`). Возвращаемый сокет SSL привязан к контексту, его настройкам и сертификатам. *sock* должен быть сокетом :const:`~socket.SOCK_STREAM`; другие типы сокетов не поддерживаются.

source: The parameter ``server_side`` is a boolean which identifies whether server-side or client-side behavior is desired from this socket.
ru: Параметр server_side представляет собой логическое значение, которое определяет, требуется ли от этого сокета поведение на стороне сервера или на стороне клиента.

source: For client-side sockets, the context construction is lazy; if the underlying socket isn't connected yet, the context construction will be performed after :meth:`connect` is called on the socket. For server-side sockets, if the socket has no remote peer, it is assumed to be a listening socket, and the server-side SSL wrapping is automatically performed on client connections accepted via the :meth:`accept` method. The method may raise :exc:`SSLError`.
ru: Для клиентских сокетов построение контекста является ленивым; если базовый сокет еще не подключен, построение контекста будет выполнено после вызова :meth:`connect` в сокете. Для сокетов на стороне сервера, если у сокета нет удаленного узла, предполагается, что он является прослушивающим сокетом, а упаковка SSL на стороне сервера автоматически выполняется для клиентских подключений, принятых с помощью метода :meth:`accept`. Этот метод может вызвать ошибку :exc:`SSLError`.

source: On client connections, the optional parameter *server_hostname* specifies the hostname of the service which we are connecting to. This allows a single server to host multiple SSL-based services with distinct certificates, quite similarly to HTTP virtual hosts. Specifying *server_hostname* will raise a :exc:`ValueError` if *server_side* is true.
ru: При клиентских подключениях необязательный параметр *server_hostname* указывает имя хоста службы, к которой мы подключаемся. Это позволяет на одном сервере размещать несколько служб на основе SSL с разными сертификатами, что очень похоже на виртуальные хосты HTTP. Указание *server_hostname* вызовет ошибку :exc:`ValueError`, если *server_side* имеет значение true.

source: The parameter ``do_handshake_on_connect`` specifies whether to do the SSL handshake automatically after doing a :meth:`socket.connect`, or whether the application program will call it explicitly, by invoking the :meth:`SSLSocket.do_handshake` method. Calling :meth:`SSLSocket.do_handshake` explicitly gives the program control over the blocking behavior of the socket I/O involved in the handshake.
ru: Параметр do_handshake_on_connect определяет, будет ли SSL-подтверждение выполняться автоматически после выполнения :meth:`socket.connect` или же прикладная программа будет вызывать его явно, вызывая метод :meth:`SSLSocket.do_handshake`. Вызов :meth:`SSLSocket.do_handshake` явно дает программе контроль над поведением блокировки сокетного ввода-вывода, участвующего в рукопожатии.

source: The parameter ``suppress_ragged_eofs`` specifies how the :meth:`SSLSocket.recv` method should signal unexpected EOF from the other end of the connection. If specified as :const:`True` (the default), it returns a normal EOF (an empty bytes object) in response to unexpected EOF errors raised from the underlying socket; if :const:`False`, it will raise the exceptions back to the caller.
ru: Параметр ``suppress_ragged_eofs`` определяет, как метод :meth:`SSLSocket.recv` должен сигнализировать о неожиданном EOF с другого конца соединения. Если указано как :const:`True` (по умолчанию), он возвращает обычный EOF (объект с пустыми байтами) в ответ на неожиданные ошибки EOF, возникшие из базового сокета; если :const:`False`, исключения будут возвращены вызывающей стороне.

source: *session*, see :attr:`~SSLSocket.session`.
ru: *session*, см. :attr:`~SSLSocket.session`.

source: To wrap an :class:`SSLSocket` in another :class:`SSLSocket`, use :meth:`SSLContext.wrap_bio`.
ru: Чтобы обернуть :class:`SSLSocket` в другой :class:`SSLSocket`, используйте :meth:`SSLContext.wrap_bio`.

source: Always allow a server_hostname to be passed, even if OpenSSL does not have SNI.
ru: Всегда разрешайте передачу server_hostname, даже если OpenSSL не имеет SNI.

source: *session* argument was added.
ru: Добавлен аргумент *session*.

source: The method returns an instance of :attr:`SSLContext.sslsocket_class` instead of hard-coded :class:`SSLSocket`.
ru: Метод возвращает экземпляр :attr:`SSLContext.sslsocket_class` вместо жестко запрограммированного :class:`SSLSocket`.

source: The return type of :meth:`SSLContext.wrap_socket`, defaults to :class:`SSLSocket`. The attribute can be overridden on instance of class in order to return a custom subclass of :class:`SSLSocket`.
ru: Тип возвращаемого значения :meth:`SSLContext.wrap_socket` по умолчанию равен :class:`SSLSocket`. Атрибут можно переопределить в экземпляре класса, чтобы вернуть пользовательский подкласс :class:`SSLSocket`.

source: Wrap the BIO objects *incoming* and *outgoing* and return an instance of :attr:`SSLContext.sslobject_class` (default :class:`SSLObject`). The SSL routines will read input data from the incoming BIO and write data to the outgoing BIO.
ru: Оберните *входящие* и *исходящие* объекты BIO и верните экземпляр :attr:`SSLContext.sslobject_class` (по умолчанию :class:`SSLObject`). Подпрограммы SSL будут считывать входные данные из входящего BIO и записывать данные в исходящий BIO.

source: The *server_side*, *server_hostname* and *session* parameters have the same meaning as in :meth:`SSLContext.wrap_socket`.
ru: Параметры *server_side*, *server_hostname* и *session* имеют то же значение, что и в :meth:`SSLContext.wrap_socket`.

source: The method returns an instance of :attr:`SSLContext.sslobject_class` instead of hard-coded :class:`SSLObject`.
ru: Метод возвращает экземпляр :attr:`SSLContext.sslobject_class` вместо жестко запрограммированного :class:`SSLObject`.

source: The return type of :meth:`SSLContext.wrap_bio`, defaults to :class:`SSLObject`. The attribute can be overridden on instance of class in order to return a custom subclass of :class:`SSLObject`.
ru: Тип возвращаемого значения :meth:`SSLContext.wrap_bio` по умолчанию равен :class:`SSLObject`. Атрибут можно переопределить в экземпляре класса, чтобы вернуть пользовательский подкласс :class:`SSLObject`.

source: Whether to match the peer cert's hostname in :meth:`SSLSocket.do_handshake`. The context's :attr:`~SSLContext.verify_mode` must be set to :data:`CERT_OPTIONAL` or :data:`CERT_REQUIRED`, and you must pass *server_hostname* to :meth:`~SSLContext.wrap_socket` in order to match the hostname. Enabling hostname checking automatically sets :attr:`~SSLContext.verify_mode` from :data:`CERT_NONE` to :data:`CERT_REQUIRED`. It cannot be set back to :data:`CERT_NONE` as long as hostname checking is enabled. The :data:`PROTOCOL_TLS_CLIENT` protocol enables hostname checking by default. With other protocols, hostname checking must be enabled explicitly.
ru: Соответствовать ли имени хоста однорангового сертификата в :meth:`SSLSocket.do_handshake`. Для :attr:`~SSLContext.verify_mode` контекста должно быть установлено значение :data:`CERT_OPTIONAL` или :data:`CERT_REQUIRED`, и вы должны передать *server_hostname* в :meth:`~SSLContext.wrap_socket` для соответствия имя хоста. Включение проверки имени хоста автоматически изменяет :attr:`~SSLContext.verify_mode` с :data:`CERT_NONE` на :data:`CERT_REQUIRED`. Его нельзя вернуть обратно в :data:`CERT_NONE`, пока включена проверка имени хоста. Протокол :data:`PROTOCOL_TLS_CLIENT` по умолчанию включает проверку имени хоста. В других протоколах проверка имени хоста должна быть включена явно.

source: :attr:`~SSLContext.verify_mode` is now automatically changed to :data:`CERT_REQUIRED` when hostname checking is enabled and :attr:`~SSLContext.verify_mode` is :data:`CERT_NONE`. Previously the same operation would have failed with a :exc:`ValueError`.
ru: :attr:`~SSLContext.verify_mode` теперь автоматически меняется на :data:`CERT_REQUIRED`, когда включена проверка имени хоста, а :attr:`~SSLContext.verify_mode` имеет значение :data:`CERT_NONE`. Раньше та же операция завершалась бы неудачно с ошибкой :exc:`ValueError`.

source: Write TLS keys to a keylog file, whenever key material is generated or received. The keylog file is designed for debugging purposes only. The file format is specified by NSS and used by many traffic analyzers such as Wireshark. The log file is opened in append-only mode. Writes are synchronized between threads, but not between processes.
ru: Записывайте ключи TLS в файл журнала ключей при каждом создании или получении материала ключа. Файл журнала ключей предназначен только для целей отладки. Формат файла определяется NSS и используется многими анализаторами трафика, такими как Wireshark. Файл журнала открывается в режиме только добавления. Запись синхронизируется между потоками, но не между процессами.

source: A :class:`TLSVersion` enum member representing the highest supported TLS version. The value defaults to :attr:`TLSVersion.MAXIMUM_SUPPORTED`. The attribute is read-only for protocols other than :attr:`PROTOCOL_TLS`, :attr:`PROTOCOL_TLS_CLIENT`, and :attr:`PROTOCOL_TLS_SERVER`.
ru: Член перечисления :class:`TLSVersion`, представляющий самую высокую поддерживаемую версию TLS. По умолчанию используется значение :attr:`TLSVersion.MAXIMUM_SUPPORTED`. Атрибут доступен только для чтения для протоколов, отличных от :attr:`PROTOCOL_TLS`, :attr:`PROTOCOL_TLS_CLIENT` и :attr:`PROTOCOL_TLS_SERVER`.

source: The attributes :attr:`~SSLContext.maximum_version`, :attr:`~SSLContext.minimum_version` and :attr:`SSLContext.options` all affect the supported SSL and TLS versions of the context. The implementation does not prevent invalid combination. For example a context with :attr:`OP_NO_TLSv1_2` in :attr:`~SSLContext.options` and :attr:`~SSLContext.maximum_version` set to :attr:`TLSVersion.TLSv1_2` will not be able to establish a TLS 1.2 connection.
ru: Атрибуты :attr:`~SSLContext.maximum_version`, :attr:`~SSLContext.minimum_version` и :attr:`SSLContext.options` влияют на поддерживаемые версии контекста SSL и TLS. Реализация не предотвращает недопустимую комбинацию. Например, контекст с :attr:`OP_NO_TLSv1_2` в :attr:`~SSLContext.options` и :attr:`~SSLContext.maximum_version` со значением :attr:`TLSVersion.TLSv1_2` не сможет установить TLS 1.2. связь.

source: Like :attr:`SSLContext.maximum_version` except it is the lowest supported version or :attr:`TLSVersion.MINIMUM_SUPPORTED`.
ru: Аналогично :attr:`SSLContext.maximum_version`, за исключением того, что это самая низкая поддерживаемая версия или :attr:`TLSVersion.MINIMUM_SUPPORTED`.

source: Control the number of TLS 1.3 session tickets of a :attr:`PROTOCOL_TLS_SERVER` context. The setting has no impact on TLS 1.0 to 1.2 connections.
ru: Управляйте количеством билетов сеанса TLS 1.3 контекста :attr:`PROTOCOL_TLS_SERVER`. Этот параметр не влияет на соединения TLS 1.0–1.2.

source: An integer representing the set of SSL options enabled on this context. The default value is :data:`OP_ALL`, but you can specify other options such as :data:`OP_NO_SSLv2` by ORing them together.
ru: Целое число, представляющее набор параметров SSL, включенных в этом контексте. Значением по умолчанию является :data:`OP_ALL`, но вы можете указать другие параметры, такие как :data:`OP_NO_SSLv2`, соединив их вместе с помощью OR.

source: :attr:`SSLContext.options` returns :class:`Options` flags:
ru: :attr:`SSLContext.options` возвращает флаги :class:`Options`:

source: All ``OP_NO_SSL*`` and ``OP_NO_TLS*`` options have been deprecated since Python 3.7. Use :attr:`SSLContext.minimum_version` and :attr:`SSLContext.maximum_version` instead.
ru: Все параметры ``OP_NO_SSL*`` и ``OP_NO_TLS*`` устарели, начиная с Python 3.7. Вместо этого используйте :attr:`SSLContext.minimum_version` и :attr:`SSLContext.maximum_version`.

source: Enable TLS 1.3 post-handshake client authentication. Post-handshake auth is disabled by default and a server can only request a TLS client certificate during the initial handshake. When enabled, a server may request a TLS client certificate at any time after the handshake.
ru: Включите аутентификацию клиента после подтверждения TLS 1.3. По умолчанию аутентификация после рукопожатия отключена, и сервер может запрашивать сертификат клиента TLS только во время первоначального рукопожатия. Если этот параметр включен, сервер может запросить сертификат клиента TLS в любое время после рукопожатия.

source: When enabled on client-side sockets, the client signals the server that it supports post-handshake authentication.
ru: При включении сокетов на стороне клиента клиент сигнализирует серверу, что поддерживает аутентификацию после рукопожатия.

source: When enabled on server-side sockets, :attr:`SSLContext.verify_mode` must be set to :data:`CERT_OPTIONAL` or :data:`CERT_REQUIRED`, too. The actual client cert exchange is delayed until :meth:`SSLSocket.verify_client_post_handshake` is called and some I/O is performed.
ru: При включении в сокетах на стороне сервера для :attr:`SSLContext.verify_mode` также должно быть установлено значение :data:`CERT_OPTIONAL` или :data:`CERT_REQUIRED`. Фактический обмен сертификатами клиента откладывается до тех пор, пока не будет вызван :meth:`SSLSocket.verify_client_post_handshake` и не будут выполнены некоторые операции ввода-вывода.

source: The protocol version chosen when constructing the context. This attribute is read-only.
ru: Версия протокола, выбранная при построении контекста. Этот атрибут доступен только для чтения.

source: Whether :attr:`~SSLContext.check_hostname` falls back to verify the cert's subject common name in the absence of a subject alternative name extension (default: true).
ru: Возвращается ли :attr:`~SSLContext.check_hostname` для проверки общего имени субъекта сертификата при отсутствии расширения альтернативного имени субъекта (по умолчанию: true).

source: The flag had no effect with OpenSSL before version 1.1.1l. Python 3.8.9, 3.9.3, and 3.10 include workarounds for previous versions.
ru: Флаг не имел никакого эффекта в OpenSSL до версии 1.1.1l. Python 3.8.9, 3.9.3 и 3.10 включает обходные пути для предыдущих версий.

source: The flags for certificate verification operations. You can set flags like :data:`VERIFY_CRL_CHECK_LEAF` by ORing them together. By default OpenSSL does neither require nor verify certificate revocation lists (CRLs).
ru: Флаги операций проверки сертификата. Вы можете установить такие флаги, как :data:`VERIFY_CRL_CHECK_LEAF`, соединив их вместе с помощью ИЛИ. По умолчанию OpenSSL не требует и не проверяет списки отзыва сертификатов (CRL).

source: :attr:`SSLContext.verify_flags` returns :class:`VerifyFlags` flags:
ru: :attr:`SSLContext.verify_flags` возвращает флаги :class:`VerifyFlags`:

source: Whether to try to verify other peers' certificates and how to behave if verification fails. This attribute must be one of :data:`CERT_NONE`, :data:`CERT_OPTIONAL` or :data:`CERT_REQUIRED`.
ru: Стоит ли пытаться проверить сертификаты других узлов и как действовать, если проверка не удалась. Этот атрибут должен быть одним из :data:`CERT_NONE`, :data:`CERT_OPTIONAL` или :data:`CERT_REQUIRED`.

source: :attr:`SSLContext.verify_mode` returns :class:`VerifyMode` enum:
ru: :attr:`SSLContext.verify_mode` возвращает :class:`VerifyMode` перечисление:

source: Enables TLS-PSK (pre-shared key) authentication on a client-side connection.
ru: Включает аутентификацию TLS-PSK (предварительный общий ключ) при соединении на стороне клиента.

source: In general, certificate based authentication should be preferred over this method.
ru: В общем, аутентификация на основе сертификатов должна быть предпочтительнее этого метода.

source: The parameter ``callback`` is a callable object with the signature: ``def callback(hint: str | None) -> tuple[str | None, bytes]``. The ``hint`` parameter is an optional identity hint sent by the server. The return value is a tuple in the form (client-identity, psk). Client-identity is an optional string which may be used by the server to select a corresponding PSK for the client. The string must be less than or equal to ``256`` octets when UTF-8 encoded. PSK is a :term:`bytes-like object` representing the pre-shared key. Return a zero length PSK to reject the connection.
ru: Параметр ``callback`` представляет собой вызываемый объект с сигнатурой: ``def callback(hint: str | None) -> tuple[str | Нет, байты]``. Параметр «hint» — это необязательная идентификационная подсказка, отправляемая сервером. Возвращаемое значение представляет собой кортеж в форме (client-identity, psk). Client-identity — это необязательная строка, которая может использоваться сервером для выбора соответствующего PSK для клиента. Строка должна быть меньше или равна 256 октетам в кодировке UTF-8. PSK — это :term:`байтовый объект`, представляющий предварительно общий ключ. Верните PSK нулевой длины, чтобы отклонить соединение.

source: Setting ``callback`` to :const:`None` removes any existing callback.
ru: Установка для ``callback`` значения :const:`None` удаляет любой существующий обратный вызов.

source: When using TLS 1.3:
ru: При использовании TLS 1.3:

source: the ``hint`` parameter is always :const:`None`.
ru: параметр ``hint`` всегда имеет значение :const:`None`.

source: client-identity must be a non-empty string.
ru: client-identity должен быть непустой строкой.

source: Example usage::
ru: Пример использования::

source: This method will raise :exc:`NotImplementedError` if :data:`HAS_PSK` is ``False``.
ru: Этот метод вызовет :exc:`NotImplementedError`, если :data:`HAS_PSK` имеет значение ``False``.

source: Enables TLS-PSK (pre-shared key) authentication on a server-side connection.
ru: Включает аутентификацию TLS-PSK (предварительный общий ключ) при соединении на стороне сервера.

source: The parameter ``callback`` is a callable object with the signature: ``def callback(identity: str | None) -> bytes``. The ``identity`` parameter is an optional identity sent by the client which can be used to select a corresponding PSK. The return value is a :term:`bytes-like object` representing the pre-shared key. Return a zero length PSK to reject the connection.
ru: Параметр ``callback`` представляет собой вызываемый объект с сигнатурой: ``def callback(identity: str | None) -> bytes``. Параметр «identity» — это необязательный идентификатор, отправленный клиентом, который можно использовать для выбора соответствующего PSK. Возвращаемое значение представляет собой :term:`байтовый объект`, представляющий предварительно общий ключ. Верните PSK нулевой длины, чтобы отклонить соединение.

source: The parameter ``identity_hint`` is an optional identity hint string sent to the client. The string must be less than or equal to ``256`` octets when UTF-8 encoded.
ru: Параметр identity_hint — это необязательная строка идентификационной подсказки, отправляемая клиенту. Строка должна быть меньше или равна 256 октетам в кодировке UTF-8.

source: When using TLS 1.3 the ``identity_hint`` parameter is not sent to the client.
ru: При использовании TLS 1.3 параметр identity_hint не отправляется клиенту.

source: Certificates
ru: Сертификаты
