Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/ssl.po
Languages: ru

source: Whether the OpenSSL library has built-in support for the TLS 1.2 protocol.
ru: Имеет ли библиотека OpenSSL встроенную поддержку протокола TLS 1.2.

source: Whether the OpenSSL library has built-in support for the TLS 1.3 protocol.
ru: Имеет ли библиотека OpenSSL встроенную поддержку протокола TLS 1.3.

source: Whether the OpenSSL library has built-in support for TLS-PSK.
ru: Имеет ли библиотека OpenSSL встроенную поддержку TLS-PSK.

source: List of supported TLS channel binding types. Strings in this list can be used as arguments to :meth:`SSLSocket.get_channel_binding`.
ru: Список поддерживаемых типов привязки канала TLS. Строки в этом списке можно использовать в качестве аргументов для :meth:`SSLSocket.get_channel_binding`.

source: The version string of the OpenSSL library loaded by the interpreter::
ru: Строка версии библиотеки OpenSSL, загруженная интерпретатором::

source: A tuple of five integers representing version information about the OpenSSL library::
ru: Кортеж из пяти целых чисел, представляющих информацию о версии библиотеки OpenSSL:

source: The raw version number of the OpenSSL library, as a single integer::
ru: Необработанный номер версии библиотеки OpenSSL в виде одного целого числа::

source: Alert Descriptions from :rfc:`5246` and others. The `IANA TLS Alert Registry <https://www.iana.org/assignments/tls-parameters/tls-parameters.xml#tls-parameters-6>`_ contains this list and references to the RFCs where their meaning is defined.
ru: Описания предупреждений из :rfc:`5246` и других. `Реестр оповещений IANA TLS <https://www.iana.org/assignments/tls-parameters/tls-parameters.xml#tls-parameters-6>`_ содержит этот список и ссылки на RFC, в которых определено их значение. .

source: Used as the return value of the callback function in :meth:`SSLContext.set_servername_callback`.
ru: Используется в качестве возвращаемого значения функции обратного вызова в :meth:`SSLContext.set_servername_callback`.

source: :class:`enum.IntEnum` collection of ALERT_DESCRIPTION_* constants.
ru: :class:`enum.IntEnum` коллекция констант ALERT_DESCRIPTION_*.

source: Option for :func:`create_default_context` and :meth:`SSLContext.load_default_certs`. This value indicates that the context may be used to authenticate web servers (therefore, it will be used to create client-side sockets).
ru: Опция для :func:`create_default_context` и :meth:`SSLContext.load_default_certs`. Это значение указывает, что контекст может использоваться для аутентификации веб-серверов (поэтому он будет использоваться для создания сокетов на стороне клиента).

source: Option for :func:`create_default_context` and :meth:`SSLContext.load_default_certs`. This value indicates that the context may be used to authenticate web clients (therefore, it will be used to create server-side sockets).
ru: Опция для :func:`create_default_context` и :meth:`SSLContext.load_default_certs`. Это значение указывает, что контекст может использоваться для аутентификации веб-клиентов (поэтому он будет использоваться для создания сокетов на стороне сервера).

source: :class:`enum.IntEnum` collection of SSL_ERROR_* constants.
ru: :class:`enum.IntEnum` коллекция констант SSL_ERROR_*.

source: :class:`enum.IntEnum` collection of SSL and TLS versions for :attr:`SSLContext.maximum_version` and :attr:`SSLContext.minimum_version`.
ru: :class:`enum.IntEnum` коллекция версий SSL и TLS для :attr:`SSLContext.maximum_version` и :attr:`SSLContext.minimum_version`.

source: The minimum or maximum supported SSL or TLS version. These are magic constants. Their values don't reflect the lowest and highest available TLS/SSL versions.
ru: Минимальная или максимальная поддерживаемая версия SSL или TLS. Это магические константы. Их значения не отражают самые низкие и самые высокие доступные версии TLS/SSL.

source: SSL 3.0 to TLS 1.3.
ru: От SSL 3.0 до TLS 1.3.

source: All :class:`TLSVersion` members except :attr:`TLSVersion.TLSv1_2` and :attr:`TLSVersion.TLSv1_3` are deprecated.
ru: Все члены :class:`TLSVersion`, кроме :attr:`TLSVersion.TLSv1_2` и :attr:`TLSVersion.TLSv1_3`, устарели.

source: SSL Sockets
ru: Сокеты SSL

source: SSL sockets provide the following methods of :ref:`socket-objects`:
ru: Сокеты SSL предоставляют следующие методы :ref:`socket-objects`:

source: :meth:`~socket.socket.sendfile` (but :mod:`os.sendfile` will be used for plain-text sockets only, else :meth:`~socket.socket.send` will be used)
ru: :meth:`~socket.socket.sendfile` (но :mod:`os.sendfile` будет использоваться только для текстовых сокетов, иначе будет использоваться :meth:`~socket.socket.send`)

source: However, since the SSL (and TLS) protocol has its own framing atop of TCP, the SSL sockets abstraction can, in certain respects, diverge from the specification of normal, OS-level sockets. See especially the :ref:`notes on non-blocking sockets <ssl-nonblocking>`.
ru: Однако, поскольку протокол SSL (и TLS) имеет собственную структуру поверх TCP, абстракция сокетов SSL может в некоторых отношениях отличаться от спецификации обычных сокетов уровня ОС. Особенно смотрите :ref:`примечания о неблокирующих сокетах <ssl-nonblocking>`.

source: Instances of :class:`SSLSocket` must be created using the :meth:`SSLContext.wrap_socket` method.
ru: Экземпляры :class:`SSLSocket` должны быть созданы с использованием метода :meth:`SSLContext.wrap_socket`.

source: The :meth:`sendfile` method was added.
ru: Был добавлен метод :meth:`sendfile`.

source: The :meth:`shutdown` does not reset the socket timeout each time bytes are received or sent. The socket timeout is now the maximum total duration of the shutdown.
ru: :meth:`shutdown` не сбрасывает таймаут сокета каждый раз, когда байты принимаются или отправляются. Тайм-аут сокета теперь равен максимальной общей продолжительности выключения.

source: It is deprecated to create a :class:`SSLSocket` instance directly, use :meth:`SSLContext.wrap_socket` to wrap a socket.
ru: Устарело создавать экземпляр :class:`SSLSocket` напрямую, используйте :meth:`SSLContext.wrap_socket` для переноса сокета.

source: :class:`SSLSocket` instances must to created with :meth:`~SSLContext.wrap_socket`. In earlier versions, it was possible to create instances directly. This was never documented or officially supported.
ru: Экземпляры :class:`SSLSocket` должны создаваться с помощью :meth:`~SSLContext.wrap_socket`. В более ранних версиях можно было создавать экземпляры напрямую. Это никогда не было задокументировано и официально не поддержано.

source: Python now uses ``SSL_read_ex`` and ``SSL_write_ex`` internally. The functions support reading and writing of data larger than 2 GB. Writing zero-length data no longer fails with a protocol violation error.
ru: Python теперь использует SSL_read_ex и SSL_write_ex внутри себя. Функции поддерживают чтение и запись данных размером более 2 ГБ. Запись данных нулевой длины больше не завершается ошибкой нарушения протокола.

source: SSL sockets also have the following additional methods and attributes:
ru: Сокеты SSL также имеют следующие дополнительные методы и атрибуты:

source: Read up to *len* bytes of data from the SSL socket and return the result as a ``bytes`` instance. If *buffer* is specified, then read into the buffer instead, and return the number of bytes read.
ru: Считайте до *len* байт данных из сокета SSL и верните результат в виде экземпляра ``bytes``. Если указан *buffer*, вместо этого читайте в буфер и возвращайте количество прочитанных байтов.

source: Raise :exc:`SSLWantReadError` or :exc:`SSLWantWriteError` if the socket is :ref:`non-blocking <ssl-nonblocking>` and the read would block.
ru: Поднимите :exc:`SSLWantReadError` или :exc:`SSLWantWriteError`, если сокет :ref:`неблокирующий <ssl-nonblocking>` и чтение будет заблокировано.

source: As at any time a re-negotiation is possible, a call to :meth:`read` can also cause write operations.
ru: Поскольку в любой момент возможно повторное согласование, вызов :meth:`read` также может вызвать операции записи.

source: The socket timeout is no longer reset each time bytes are received or sent. The socket timeout is now the maximum total duration to read up to *len* bytes.
ru: Тайм-аут сокета больше не сбрасывается каждый раз при получении или отправке байтов. Тайм-аут сокета теперь равен максимальной общей продолжительности чтения до *len* байт.

source: Use :meth:`~SSLSocket.recv` instead of :meth:`~SSLSocket.read`.
ru: Используйте :meth:`~SSLSocket.recv` вместо :meth:`~SSLSocket.read`.

source: Write *buf* to the SSL socket and return the number of bytes written. The *buf* argument must be an object supporting the buffer interface.
ru: Запишите *buf* в сокет SSL и верните количество записанных байтов. Аргумент *buf* должен быть объектом, поддерживающим интерфейс буфера.

source: Raise :exc:`SSLWantReadError` or :exc:`SSLWantWriteError` if the socket is :ref:`non-blocking <ssl-nonblocking>` and the write would block.
ru: Поднимите :exc:`SSLWantReadError` или :exc:`SSLWantWriteError`, если сокет :ref:`неблокирующий <ssl-nonblocking>` и запись будет заблокирована.

source: As at any time a re-negotiation is possible, a call to :meth:`write` can also cause read operations.
ru: Поскольку в любой момент возможно повторное согласование, вызов :meth:`write` также может вызвать операции чтения.

source: The socket timeout is no longer reset each time bytes are received or sent. The socket timeout is now the maximum total duration to write *buf*.
ru: Тайм-аут сокета больше не сбрасывается каждый раз при получении или отправке байтов. Тайм-аут сокета теперь равен максимальной общей продолжительности записи *buf*.

source: Use :meth:`~SSLSocket.send` instead of :meth:`~SSLSocket.write`.
ru: Используйте :meth:`~SSLSocket.send` вместо :meth:`~SSLSocket.write`.

source: The :meth:`~SSLSocket.read` and :meth:`~SSLSocket.write` methods are the low-level methods that read and write unencrypted, application-level data and decrypt/encrypt it to encrypted, wire-level data. These methods require an active SSL connection, i.e. the handshake was completed and :meth:`SSLSocket.unwrap` was not called.
ru: Методы :meth:`~SSLSocket.read` и :meth:`~SSLSocket.write` — это методы низкого уровня, которые читают и записывают незашифрованные данные уровня приложения и дешифруют/шифруют их в зашифрованные данные на уровне сети. Эти методы требуют активного SSL-соединения, т.е. рукопожатие было завершено, а :meth:`SSLSocket.unwrap` не был вызван.

source: Normally you should use the socket API methods like :meth:`~socket.socket.recv` and :meth:`~socket.socket.send` instead of these methods.
ru: Обычно вместо этих методов следует использовать методы API сокетов, такие как :meth:`~socket.socket.recv` и :meth:`~socket.socket.send`.

source: Perform the SSL setup handshake.
ru: Выполните подтверждение установки SSL.

source: The handshake method also performs :func:`match_hostname` when the :attr:`~SSLContext.check_hostname` attribute of the socket's :attr:`~SSLSocket.context` is true.
ru: Метод рукопожатия также выполняет :func:`match_hostname`, когда атрибут :attr:`~SSLContext.check_hostname` сокета :attr:`~SSLSocket.context` имеет значение true.

source: The socket timeout is no longer reset each time bytes are received or sent. The socket timeout is now the maximum total duration of the handshake.
ru: Тайм-аут сокета больше не сбрасывается каждый раз при получении или отправке байтов. Тайм-аут сокета теперь равен максимальной общей продолжительности рукопожатия.

source: Hostname or IP address is matched by OpenSSL during handshake. The function :func:`match_hostname` is no longer used. In case OpenSSL refuses a hostname or IP address, the handshake is aborted early and a TLS alert message is sent to the peer.
ru: Имя хоста или IP-адрес сопоставляется OpenSSL во время рукопожатия. Функция :func:`match_hostname` больше не используется. В случае, если OpenSSL отклоняет имя хоста или IP-адрес, рукопожатие прерывается досрочно, и партнеру отправляется предупреждающее сообщение TLS.

source: If there is no certificate for the peer on the other end of the connection, return ``None``. If the SSL handshake hasn't been done yet, raise :exc:`ValueError`.
ru: Если сертификат для узла на другом конце соединения отсутствует, верните None. Если подтверждение SSL еще не выполнено, поднимите :exc:`ValueError`.

source: If the ``binary_form`` parameter is :const:`False`, and a certificate was received from the peer, this method returns a :class:`dict` instance. If the certificate was not validated, the dict is empty. If the certificate was validated, it returns a dict with several keys, amongst them ``subject`` (the principal for which the certificate was issued) and ``issuer`` (the principal issuing the certificate). If a certificate contains an instance of the *Subject Alternative Name* extension (see :rfc:`3280`), there will also be a ``subjectAltName`` key in the dictionary.
ru: Если параметр ``binary_form`` имеет значение :const:`False` и сертификат был получен от узла, этот метод возвращает экземпляр :class:`dict`. Если сертификат не был проверен, словарь пуст. Если сертификат был проверен, он возвращает dict с несколькими ключами, среди которых «субъект» (принципал, для которого был выдан сертификат) и «эмитент» (принципал, выдавший сертификат). Если сертификат содержит экземпляр расширения *Альтернативное имя субъекта* (см. :rfc:`3280`), в словаре также будет ключ ``subjectAltName``.

source: The ``subject`` and ``issuer`` fields are tuples containing the sequence of relative distinguished names (RDNs) given in the certificate's data structure for the respective fields, and each RDN is a sequence of name-value pairs. Here is a real-world example::
ru: Поля «субъект» и «эмитент» представляют собой кортежи, содержащие последовательность относительных отличительных имен (RDN), заданных в структуре данных сертификата для соответствующих полей, и каждое RDN представляет собой последовательность пар имя-значение. Вот реальный пример:

source: If the ``binary_form`` parameter is :const:`True`, and a certificate was provided, this method returns the DER-encoded form of the entire certificate as a sequence of bytes, or :const:`None` if the peer did not provide a certificate. Whether the peer provides a certificate depends on the SSL socket's role:
ru: Если параметр ``binary_form`` имеет значение :const:`True` и был предоставлен сертификат, этот метод возвращает закодированную DER форму всего сертификата в виде последовательности байтов или :const:`None`, если партнер сертификат не предоставил. Предоставляет ли партнер сертификат, зависит от роли сокета SSL:

source: for a client SSL socket, the server will always provide a certificate, regardless of whether validation was required;
ru: для клиентского сокета SSL сервер всегда будет предоставлять сертификат, независимо от того, требовалась ли проверка;

source: for a server SSL socket, the client will only provide a certificate when requested by the server; therefore :meth:`getpeercert` will return :const:`None` if you used :const:`CERT_NONE` (rather than :const:`CERT_OPTIONAL` or :const:`CERT_REQUIRED`).
ru: для сокета SSL сервера клиент будет предоставлять сертификат только по запросу сервера; поэтому :meth:`getpeercert` вернет :const:`None`, если вы использовали :const:`CERT_NONE` (а не :const:`CERT_OPTIONAL` или :const:`CERT_REQUIRED`).

source: See also :attr:`SSLContext.check_hostname`.
ru: См. также :attr:`SSLContext.check_hostname`.

source: The returned dictionary includes additional items such as ``issuer`` and ``notBefore``.
ru: Возвращенный словарь включает дополнительные элементы, такие как «issuer» и «notBefore».

source: :exc:`ValueError` is raised when the handshake isn't done. The returned dictionary includes additional X509v3 extension items such as ``crlDistributionPoints``, ``caIssuers`` and ``OCSP`` URIs.
ru: :exc:`ValueError` возникает, когда рукопожатие не завершено. Возвращенный словарь включает дополнительные элементы расширения X509v3, такие как crlDistributionPoints, caIssuers и URI OCSP.

source: IPv6 address strings no longer have a trailing new line.
ru: Строки адреса IPv6 больше не имеют завершающей новой строки.

source: Returns verified certificate chain provided by the other end of the SSL channel as a list of DER-encoded bytes. If certificate verification was disabled method acts the same as :meth:`~SSLSocket.get_unverified_chain`.
ru: Возвращает проверенную цепочку сертификатов, предоставленную другим концом канала SSL, в виде списка байтов в кодировке DER. Если проверка сертификата отключена, метод действует так же, как :meth:`~SSLSocket.get_unverified_chain`.

source: Returns raw certificate chain provided by the other end of the SSL channel as a list of DER-encoded bytes.
ru: Возвращает необработанную цепочку сертификатов, предоставленную другим концом канала SSL, в виде списка байтов в кодировке DER.

source: Returns a three-value tuple containing the name of the cipher being used, the version of the SSL protocol that defines its use, and the number of secret bits being used. If no connection has been established, returns ``None``.
ru: Возвращает кортеж из трех значений, содержащий имя используемого шифра, версию протокола SSL, определяющую его использование, и количество используемых секретных битов. Если соединение не установлено, возвращается ``None``.

source: Return the list of ciphers available in both the client and server. Each entry of the returned list is a three-value tuple containing the name of the cipher, the version of the SSL protocol that defines its use, and the number of secret bits the cipher uses. :meth:`~SSLSocket.shared_ciphers` returns ``None`` if no connection has been established or the socket is a client socket.
ru: Возвращает список шифров, доступных как на клиенте, так и на сервере. Каждая запись возвращаемого списка представляет собой кортеж из трех значений, содержащий имя шифра, версию протокола SSL, определяющую его использование, и количество секретных битов, которые использует шифр. :meth:`~SSLSocket.shared_ciphers` возвращает ``None``, если соединение не установлено или сокет является клиентским.

source: Return the compression algorithm being used as a string, or ``None`` if the connection isn't compressed.
ru: Возвращает используемый алгоритм сжатия в виде строки или «Нет», если соединение не сжимается.

source: If the higher-level protocol supports its own compression mechanism, you can use :data:`OP_NO_COMPRESSION` to disable SSL-level compression.
ru: Если протокол более высокого уровня поддерживает собственный механизм сжатия, вы можете использовать :data:`OP_NO_COMPRESSION`, чтобы отключить сжатие на уровне SSL.

source: Get channel binding data for current connection, as a bytes object. Returns ``None`` if not connected or the handshake has not been completed.
ru: Получите данные привязки канала для текущего соединения в виде байтового объекта. Возвращает None, если соединение не установлено или рукопожатие не завершено.

source: The *cb_type* parameter allow selection of the desired channel binding type. Valid channel binding types are listed in the :data:`CHANNEL_BINDING_TYPES` list. Currently only the 'tls-unique' channel binding, defined by :rfc:`5929`, is supported. :exc:`ValueError` will be raised if an unsupported channel binding type is requested.
ru: Параметр *cb_type* позволяет выбрать желаемый тип привязки канала. Допустимые типы привязки каналов перечислены в списке :data:`CHANNEL_BINDING_TYPES`. В настоящее время поддерживается только привязка канала «tls-unique», определенная :rfc:`5929`. :exc:`ValueError` будет вызван, если запрошен неподдерживаемый тип привязки канала.

source: Return the protocol that was selected during the TLS handshake. If :meth:`SSLContext.set_alpn_protocols` was not called, if the other party does not support ALPN, if this socket does not support any of the client's proposed protocols, or if the handshake has not happened yet, ``None`` is returned.
ru: Верните протокол, выбранный во время подтверждения TLS. Если :meth:`SSLContext.set_alpn_protocols` не был вызван, если другая сторона не поддерживает ALPN, если этот сокет не поддерживает ни один из предложенных клиентом протоколов или если рукопожатие еще не произошло, ``Нет`` будет вернулся.

source: Return the higher-level protocol that was selected during the TLS/SSL handshake. If :meth:`SSLContext.set_npn_protocols` was not called, or if the other party does not support NPN, or if the handshake has not yet happened, this will return ``None``.
ru: Возвращает протокол более высокого уровня, который был выбран во время установления связи TLS/SSL. Если :meth:`SSLContext.set_npn_protocols` не был вызван, или если другая сторона не поддерживает NPN, или если рукопожатие еще не произошло, это вернет ``None``.

source: NPN has been superseded by ALPN
ru: NPN был заменен ALPN.

source: Performs the SSL shutdown handshake, which removes the TLS layer from the underlying socket, and returns the underlying socket object. This can be used to go from encrypted operation over a connection to unencrypted. The returned socket should always be used for further communication with the other side of the connection, rather than the original socket.
ru: Выполняет подтверждение завершения SSL, которое удаляет уровень TLS из базового сокета и возвращает базовый объект сокета. Это можно использовать для перехода от зашифрованной операции через соединение к незашифрованной. Возвращенный сокет всегда следует использовать для дальнейшего взаимодействия с другой стороной соединения, а не исходный сокет.

source: Requests post-handshake authentication (PHA) from a TLS 1.3 client. PHA can only be initiated for a TLS 1.3 connection from a server-side socket, after the initial TLS handshake and with PHA enabled on both sides, see :attr:`SSLContext.post_handshake_auth`.
ru: Запрашивает аутентификацию после рукопожатия (PHA) от клиента TLS 1.3. PHA может быть инициирован только для соединения TLS 1.3 из сокета на стороне сервера, после первоначального подтверждения TLS и при включенном PHA с обеих сторон, см. :attr:`SSLContext.post_handshake_auth`.

source: The method does not perform a cert exchange immediately. The server-side sends a CertificateRequest during the next write event and expects the client to respond with a certificate on the next read event.
ru: Этот метод не выполняет обмен сертификатами немедленно. Серверная сторона отправляет запрос сертификата во время следующего события записи и ожидает, что клиент ответит сертификатом на следующее событие чтения.

source: If any precondition isn't met (e.g. not TLS 1.3, PHA not enabled), an :exc:`SSLError` is raised.
ru: Если какое-либо предварительное условие не выполнено (например, TLS 1.3 не включен, PHA не включен), выдается ошибка :exc:`SSLError`.

source: Only available with OpenSSL 1.1.1 and TLS 1.3 enabled. Without TLS 1.3 support, the method raises :exc:`NotImplementedError`.
ru: Доступно только при включенном OpenSSL 1.1.1 и TLS 1.3. Без поддержки TLS 1.3 метод вызывает :exc:`NotImplementedError`.

source: Return the actual SSL protocol version negotiated by the connection as a string, or ``None`` if no secure connection is established. As of this writing, possible return values include ``"SSLv2"``, ``"SSLv3"``, ``"TLSv1"``, ``"TLSv1.1"`` and ``"TLSv1.2"``. Recent OpenSSL versions may define more return values.
ru: Возвращает фактическую версию протокола SSL, согласованную соединением, в виде строки или ``None``, если безопасное соединение не установлено. На момент написания этой статьи возможные возвращаемые значения включали ``"SSLv2"``, ``"SSLv3"``, ``"TLSv1"``, ``"TLSv1.1"`` и ``"TLSv1.2" ``. Последние версии OpenSSL могут определять больше возвращаемых значений.
