Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/ssl.po
Languages: ru

source: Returns the number of already decrypted bytes available for read, pending on the connection.
ru: Возвращает количество уже расшифрованных байтов, доступных для чтения, ожидающих соединения.

source: The :class:`SSLContext` object this SSL socket is tied to.
ru: Объект :class:`SSLContext`, к которому привязан этот SSL-сокет.

source: A boolean which is ``True`` for server-side sockets and ``False`` for client-side sockets.
ru: Логическое значение, которое имеет значение True для сокетов на стороне сервера и False для сокетов на стороне клиента.

source: Hostname of the server: :class:`str` type, or ``None`` for server-side socket or if the hostname was not specified in the constructor.
ru: Имя хоста сервера: тип :class:`str` или ``None`` для сокета на стороне сервера или если имя хоста не было указано в конструкторе.

source: The attribute is now always ASCII text. When ``server_hostname`` is an internationalized domain name (IDN), this attribute now stores the A-label form (``"xn--pythn-mua.org"``), rather than the U-label form (``"pythön.org"``).
ru: Атрибут теперь всегда представляет собой текст ASCII. Когда ``server_hostname`` является интернационализированным доменным именем (IDN), этот атрибут теперь хранит форму A-метки (``"xn--pythn-mua.org"``), а не форму U-метки (` `"pythön.org"``).

source: The :class:`SSLSession` for this SSL connection. The session is available for client and server side sockets after the TLS handshake has been performed. For client sockets the session can be set before :meth:`~SSLSocket.do_handshake` has been called to reuse a session.
ru: :class:`SSLSession` для этого SSL-соединения. Сеанс доступен для сокетов на стороне клиента и сервера после выполнения подтверждения TLS. Для клиентских сокетов сеанс может быть установлен до вызова :meth:`~SSLSocket.do_handshake` для повторного использования сеанса.

source: SSL Contexts
ru: Контексты SSL

source: An SSL context holds various data longer-lived than single SSL connections, such as SSL configuration options, certificate(s) and private key(s). It also manages a cache of SSL sessions for server-side sockets, in order to speed up repeated connections from the same clients.
ru: Контекст SSL содержит различные данные, которые хранятся дольше, чем отдельные соединения SSL, такие как параметры конфигурации SSL, сертификат(ы) и закрытый ключ(и). Он также управляет кешем сеансов SSL для сокетов на стороне сервера, чтобы ускорить повторные соединения от одних и тех же клиентов.

source: Create a new SSL context. You may pass *protocol* which must be one of the ``PROTOCOL_*`` constants defined in this module. The parameter specifies which version of the SSL protocol to use. Typically, the server chooses a particular protocol version, and the client must adapt to the server's choice. Most of the versions are not interoperable with the other versions. If not specified, the default is :data:`PROTOCOL_TLS`; it provides the most compatibility with other versions.
ru: Создайте новый контекст SSL. Вы можете передать *protocol*, который должен быть одной из констант ``PROTOCOL_*``, определенных в этом модуле. Параметр указывает, какую версию протокола SSL использовать. Обычно сервер выбирает конкретную версию протокола, и клиент должен адаптироваться к выбору сервера. Большинство версий несовместимы с другими версиями. Если не указано, по умолчанию используется :data:`PROTOCOL_TLS`; он обеспечивает максимальную совместимость с другими версиями.

source: Here's a table showing which versions in a client (down the side) can connect to which versions in a server (along the top):
ru: Вот таблица, показывающая, какие версии на клиенте (внизу) могут подключаться к каким версиям на сервере (вверху):

source: *client* / **server**
ru: *клиент* / **сервер**

source: **TLS** [3]_
ru: **ТЛС** [3]_

source: yes
ru: да

source: no
ru: нет

source: no [1]_
ru: нет [1]_

source: no [2]_
ru: нет [2]_

source: Footnotes
ru: Сноски

source: :class:`SSLContext` disables SSLv2 with :data:`OP_NO_SSLv2` by default.
ru: :class:`SSLContext` по умолчанию отключает SSLv2 с помощью :data:`OP_NO_SSLv2`.

source: :class:`SSLContext` disables SSLv3 with :data:`OP_NO_SSLv3` by default.
ru: :class:`SSLContext` по умолчанию отключает SSLv3 с помощью :data:`OP_NO_SSLv3`.

source: TLS 1.3 protocol will be available with :data:`PROTOCOL_TLS` in OpenSSL >= 1.1.1. There is no dedicated PROTOCOL constant for just TLS 1.3.
ru: Протокол TLS 1.3 будет доступен с :data:`PROTOCOL_TLS` в OpenSSL >= 1.1.1. Специальной константы PROTOCOL только для TLS 1.3 не существует.

source: :func:`create_default_context` lets the :mod:`ssl` module choose security settings for a given purpose.
ru: :func:`create_default_context` позволяет модулю :mod:`ssl` выбирать настройки безопасности для определенной цели.

source: The context is created with secure default values. The options :data:`OP_NO_COMPRESSION`, :data:`OP_CIPHER_SERVER_PREFERENCE`, :data:`OP_SINGLE_DH_USE`, :data:`OP_SINGLE_ECDH_USE`, :data:`OP_NO_SSLv2`, and :data:`OP_NO_SSLv3` (except for :data:`PROTOCOL_SSLv3`) are set by default. The initial cipher suite list contains only ``HIGH`` ciphers, no ``NULL`` ciphers and no ``MD5`` ciphers.
ru: Контекст создается с безопасными значениями по умолчанию. Опции :data:`OP_NO_COMPRESSION`, :data:`OP_CIPHER_SERVER_PREFERENCE`, :data:`OP_SINGLE_DH_USE`, :data:`OP_SINGLE_ECDH_USE`, :data:`OP_NO_SSLv2` и :data:`OP_NO_SSLv3` (кроме :data: `PROTOCOL_SSLv3`) установлены по умолчанию. Исходный список наборов шифров содержит только шифры «HIGH», не содержит шифров «NULL» и шифров «MD5».

source: :class:`SSLContext` without protocol argument is deprecated. The context class will either require :data:`PROTOCOL_TLS_CLIENT` or :data:`PROTOCOL_TLS_SERVER` protocol in the future.
ru: :class:`SSLContext` без аргумента протокола устарел. В будущем для класса контекста потребуется либо протокол :data:`PROTOCOL_TLS_CLIENT`, либо :data:`PROTOCOL_TLS_SERVER`.

source: The default cipher suites now include only secure AES and ChaCha20 ciphers with forward secrecy and security level 2. RSA and DH keys with less than 2048 bits and ECC keys with less than 224 bits are prohibited. :data:`PROTOCOL_TLS`, :data:`PROTOCOL_TLS_CLIENT`, and :data:`PROTOCOL_TLS_SERVER` use TLS 1.2 as minimum TLS version.
ru: Наборы шифров по умолчанию теперь включают только безопасные шифры AES и ChaCha20 с прямой секретностью и уровнем безопасности 2. Ключи RSA и DH длиной менее 2048 бит и ключи ECC длиной менее 224 бит запрещены. :data:`PROTOCOL_TLS`, :data:`PROTOCOL_TLS_CLIENT` и :data:`PROTOCOL_TLS_SERVER` используют TLS 1.2 в качестве минимальной версии TLS.

source: :class:`SSLContext` only supports limited mutation once it has been used by a connection. Adding new certificates to the internal trust store is allowed, but changing ciphers, verification settings, or mTLS certificates may result in surprising behavior.
ru: :class:`SSLContext` поддерживает ограниченную мутацию только после того, как она была использована соединением. Добавление новых сертификатов во внутреннее хранилище доверенных сертификатов разрешено, но изменение шифров, настроек проверки или сертификатов mTLS может привести к неожиданному поведению.

source: :class:`SSLContext` is designed to be shared and used by multiple connections. Thus, it is thread-safe as long as it is not reconfigured after being used by a connection.
ru: :class:`SSLContext` предназначен для совместного использования и использования несколькими соединениями. Таким образом, он является потокобезопасным до тех пор, пока не будет переконфигурирован после использования соединением.

source: :class:`SSLContext` objects have the following methods and attributes:
ru: Объекты :class:`SSLContext` имеют следующие методы и атрибуты:

source: Get statistics about quantities of loaded X.509 certificates, count of X.509 certificates flagged as CA certificates and certificate revocation lists as dictionary.
ru: Получайте статистику о количестве загруженных сертификатов X.509, количестве сертификатов X.509, помеченных как сертификаты CA, и списках отзыва сертификатов в виде словаря.

source: Example for a context with one CA cert and one other cert::
ru: Пример контекста с одним сертификатом CA и еще одним сертификатом::

source: Load a private key and the corresponding certificate. The *certfile* string must be the path to a single file in PEM format containing the certificate as well as any number of CA certificates needed to establish the certificate's authenticity. The *keyfile* string, if present, must point to a file containing the private key. Otherwise the private key will be taken from *certfile* as well. See the discussion of :ref:`ssl-certificates` for more information on how the certificate is stored in the *certfile*.
ru: Загрузите закрытый ключ и соответствующий сертификат. Строка *certfile* должна представлять собой путь к одному файлу в формате PEM, содержащему сертификат, а также любое количество сертификатов CA, необходимых для установления подлинности сертификата. Строка *keyfile*, если она присутствует, должна указывать на файл, содержащий закрытый ключ. В противном случае закрытый ключ также будет взят из *certfile*. См. обсуждение :ref:`ssl-certificates` для получения дополнительной информации о том, как сертификат хранится в *certfile*.

source: The *password* argument may be a function to call to get the password for decrypting the private key. It will only be called if the private key is encrypted and a password is necessary. It will be called with no arguments, and it should return a string, bytes, or bytearray. If the return value is a string it will be encoded as UTF-8 before using it to decrypt the key. Alternatively a string, bytes, or bytearray value may be supplied directly as the *password* argument. It will be ignored if the private key is not encrypted and no password is needed.
ru: Аргумент *пароль* может быть функцией, которую нужно вызвать, чтобы получить пароль для расшифровки закрытого ключа. Он будет вызываться только в том случае, если закрытый ключ зашифрован и необходим пароль. Он будет вызываться без аргументов и должен возвращать строку, байты или массив байтов. Если возвращаемое значение является строкой, оно будет закодировано как UTF-8, прежде чем использовать его для расшифровки ключа. В качестве альтернативы строка, байты или значение массива байтов могут быть переданы непосредственно в качестве аргумента *пароль*. Он будет игнорироваться, если закрытый ключ не зашифрован и пароль не требуется.

source: If the *password* argument is not specified and a password is required, OpenSSL's built-in password prompting mechanism will be used to interactively prompt the user for a password.
ru: Если аргумент *password* не указан и требуется пароль, встроенный механизм запроса пароля OpenSSL будет использоваться для интерактивного запроса пароля у пользователя.

source: An :class:`SSLError` is raised if the private key doesn't match with the certificate.
ru: Ошибка :class:`SSLError` возникает, если закрытый ключ не соответствует сертификату.

source: New optional argument *password*.
ru: Новый необязательный аргумент *password*.

source: Load a set of default "certification authority" (CA) certificates from default locations. On Windows it loads CA certs from the ``CA`` and ``ROOT`` system stores. On all systems it calls :meth:`SSLContext.set_default_verify_paths`. In the future the method may load CA certificates from other locations, too.
ru: Загрузите набор сертификатов центра сертификации (CA) по умолчанию из мест по умолчанию. В Windows он загружает сертификаты CA из системных хранилищ CA и ROOT. Во всех системах он вызывает :meth:`SSLContext.set_default_verify_paths`. В будущем метод может загружать сертификаты CA и из других мест.

source: The *purpose* flag specifies what kind of CA certificates are loaded. The default settings :const:`Purpose.SERVER_AUTH` loads certificates, that are flagged and trusted for TLS web server authentication (client side sockets). :const:`Purpose.CLIENT_AUTH` loads CA certificates for client certificate verification on the server side.
ru: Флаг *цели* указывает, какие сертификаты CA загружаются. Настройки по умолчанию :const:`Purpose.SERVER_AUTH` загружают сертификаты, которые помечены и доверены для аутентификации веб-сервера TLS (сокеты на стороне клиента). :const:`Purpose.CLIENT_AUTH` загружает сертификаты CA для проверки сертификата клиента на стороне сервера.

source: Load a set of "certification authority" (CA) certificates used to validate other peers' certificates when :data:`verify_mode` is other than :data:`CERT_NONE`. At least one of *cafile* or *capath* must be specified.
ru: Загрузите набор сертификатов «центра сертификации» (CA), используемых для проверки сертификатов других узлов, если :data:`verify_mode` отличается от :data:`CERT_NONE`. Должен быть указан хотя бы один из *cafile* или *capath*.

source: This method can also load certification revocation lists (CRLs) in PEM or DER format. In order to make use of CRLs, :attr:`SSLContext.verify_flags` must be configured properly.
ru: Этот метод также может загружать списки отзыва сертификатов (CRL) в формате PEM или DER. Чтобы использовать CRL, необходимо правильно настроить :attr:`SSLContext.verify_flags`.

source: The *cafile* string, if present, is the path to a file of concatenated CA certificates in PEM format. See the discussion of :ref:`ssl-certificates` for more information about how to arrange the certificates in this file.
ru: Строка *cafile*, если она присутствует, представляет собой путь к файлу объединенных сертификатов CA в формате PEM. См. обсуждение :ref:`ssl-certificates` для получения дополнительной информации о том, как расположить сертификаты в этом файле.

source: The *cadata* object, if present, is either an ASCII string of one or more PEM-encoded certificates or a :term:`bytes-like object` of DER-encoded certificates. Like with *capath* extra lines around PEM-encoded certificates are ignored but at least one certificate must be present.
ru: Объект *cadata*, если он присутствует, представляет собой либо строку ASCII одного или нескольких сертификатов в кодировке PEM, либо :term:`байтовый объект` сертификатов в кодировке DER. Как и в случае с *capath*, дополнительные строки вокруг сертификатов, закодированных в PEM, игнорируются, но должен присутствовать хотя бы один сертификат.

source: New optional argument *cadata*
ru: Новый необязательный аргумент *cadata*

source: Get a list of loaded "certification authority" (CA) certificates. If the ``binary_form`` parameter is :const:`False` each list entry is a dict like the output of :meth:`SSLSocket.getpeercert`. Otherwise the method returns a list of DER-encoded certificates. The returned list does not contain certificates from *capath* unless a certificate was requested and loaded by a SSL connection.
ru: Получите список загруженных сертификатов центра сертификации (CA). Если параметр ``binary_form`` имеет значение :const:`False`, каждая запись списка представляет собой словарь, подобный выводу :meth:`SSLSocket.getpeercert`. В противном случае метод возвращает список сертификатов в кодировке DER. Возвращенный список не содержит сертификатов из *capath*, если только сертификат не был запрошен и загружен посредством SSL-соединения.

source: Certificates in a capath directory aren't loaded unless they have been used at least once.
ru: Сертификаты в каталоге capath не загружаются, если они не использовались хотя бы один раз.

source: Get a list of enabled ciphers. The list is in order of cipher priority. See :meth:`SSLContext.set_ciphers`.
ru: Получить список включенных шифров. Список расположен в порядке приоритета шифрования. См. :meth:`SSLContext.set_ciphers`.

source: Load a set of default "certification authority" (CA) certificates from a filesystem path defined when building the OpenSSL library. Unfortunately, there's no easy way to know whether this method succeeds: no error is returned if no certificates are to be found. When the OpenSSL library is provided as part of the operating system, though, it is likely to be configured properly.
ru: Загрузите набор сертификатов «центра сертификации» (CA) по умолчанию из пути файловой системы, определенного при создании библиотеки OpenSSL. К сожалению, нет простого способа узнать, удался ли этот метод: ошибка не возвращается, если сертификаты не найдены. Однако, если библиотека OpenSSL предоставляется как часть операционной системы, она, скорее всего, будет настроена правильно.

source: when connected, the :meth:`SSLSocket.cipher` method of SSL sockets will give the currently selected cipher.
ru: при подключении метод SSL-сокетов :meth:`SSLSocket.cipher` выдаст текущий выбранный шифр.

source: TLS 1.3 cipher suites cannot be disabled with :meth:`~SSLContext.set_ciphers`.
ru: Наборы шифров TLS 1.3 нельзя отключить с помощью :meth:`~SSLContext.set_ciphers`.

source: Specify which protocols the socket should advertise during the SSL/TLS handshake. It should be a list of ASCII strings, like ``['http/1.1', 'spdy/2']``, ordered by preference. The selection of a protocol will happen during the handshake, and will play out according to :rfc:`7301`. After a successful handshake, the :meth:`SSLSocket.selected_alpn_protocol` method will return the agreed-upon protocol.
ru: Укажите, какие протоколы должен объявлять сокет во время подтверждения SSL/TLS. Это должен быть список строк ASCII, например ``['http/1.1', 'spdy/2']``, упорядоченный по предпочтениям. Выбор протокола произойдет во время рукопожатия и будет выполняться в соответствии с :rfc:`7301`. После успешного рукопожатия метод :meth:`SSLSocket.selected_alpn_protocol` вернет согласованный протокол.

source: This method will raise :exc:`NotImplementedError` if :data:`HAS_ALPN` is ``False``.
ru: Этот метод вызовет :exc:`NotImplementedError`, если :data:`HAS_ALPN` имеет значение ``False``.

source: Specify which protocols the socket should advertise during the SSL/TLS handshake. It should be a list of strings, like ``['http/1.1', 'spdy/2']``, ordered by preference. The selection of a protocol will happen during the handshake, and will play out according to the `Application Layer Protocol Negotiation <https://en.wikipedia.org/wiki/Application-Layer_Protocol_Negotiation>`_. After a successful handshake, the :meth:`SSLSocket.selected_npn_protocol` method will return the agreed-upon protocol.
ru: Укажите, какие протоколы должен объявлять сокет во время подтверждения SSL/TLS. Это должен быть список строк, например ``['http/1.1', 'spdy/2']``, упорядоченный по предпочтениям. Выбор протокола произойдет во время рукопожатия и будет выполняться в соответствии с `согласованием протокола уровня приложения <https://en.wikipedia.org/wiki/Application-Layer_Protocol_Negotiation>`_. После успешного рукопожатия метод :meth:`SSLSocket.selected_npn_protocol` вернет согласованный протокол.

source: This method will raise :exc:`NotImplementedError` if :data:`HAS_NPN` is ``False``.
ru: Этот метод вызовет :exc:`NotImplementedError`, если :data:`HAS_NPN` имеет значение ``False``.

source: Register a callback function that will be called after the TLS Client Hello handshake message has been received by the SSL/TLS server when the TLS client specifies a server name indication. The server name indication mechanism is specified in :rfc:`6066` section 3 - Server Name Indication.
ru: Зарегистрируйте функцию обратного вызова, которая будет вызываться после получения сообщения подтверждения связи TLS Client Hello сервером SSL/TLS, когда клиент TLS указывает указание имени сервера. Механизм указания имени сервера указан в разделе 3 :rfc:`6066` — Указание имени сервера.

source: Only one callback can be set per ``SSLContext``. If *sni_callback* is set to ``None`` then the callback is disabled. Calling this function a subsequent time will disable the previously registered callback.
ru: Для каждого ``SSLContext`` может быть установлен только один обратный вызов. Если для *sni_callback* установлено значение «Нет», то обратный вызов отключен. Вызов этой функции в последующий раз отключит ранее зарегистрированный обратный вызов.

source: The callback function will be called with three arguments; the first being the :class:`ssl.SSLSocket`, the second is a string that represents the server name that the client is intending to communicate (or :const:`None` if the TLS Client Hello does not contain a server name) and the third argument is the original :class:`SSLContext`. The server name argument is text. For internationalized domain name, the server name is an IDN A-label (``"xn--pythn-mua.org"``).
ru: Функция обратного вызова будет вызвана с тремя аргументами; первый — это :class:`ssl.SSLSocket`, второй — это строка, представляющая имя сервера, с которым клиент намеревается связаться (или :const:`None`, если TLS Client Hello не содержит имя сервера) а третий аргумент — это исходный :class:`SSLContext`. Аргумент имени сервера представляет собой текст. Для интернационализированного доменного имени имя сервера представляет собой A-метку IDN (``"xn--pythn-mua.org"``).

source: A typical use of this callback is to change the :class:`ssl.SSLSocket`'s :attr:`SSLSocket.context` attribute to a new object of type :class:`SSLContext` representing a certificate chain that matches the server name.
ru: Типичное использование этого обратного вызова — изменение атрибута :attr:`SSLSocket.context` :class:`ssl.SSLSocket` на новый объект типа :class:`SSLContext`, представляющий цепочку сертификатов, соответствующую имени сервера. .

source: Due to the early negotiation phase of the TLS connection, only limited methods and attributes are usable like :meth:`SSLSocket.selected_alpn_protocol` and :attr:`SSLSocket.context`. The :meth:`SSLSocket.getpeercert`, :meth:`SSLSocket.get_verified_chain`, :meth:`SSLSocket.get_unverified_chain` :meth:`SSLSocket.cipher` and :meth:`SSLSocket.compression` methods require that the TLS connection has progressed beyond the TLS Client Hello and therefore will not return meaningful values nor can they be called safely.
ru: Из-за ранней фазы согласования TLS-соединения можно использовать только ограниченные методы и атрибуты, такие как :meth:`SSLSocket.selected_alpn_protocol` и :attr:`SSLSocket.context`. Методы :meth:`SSLSocket.getpeercert`, :meth:`SSLSocket.get_verified_chain`, :meth:`SSLSocket.get_unverified_chain` :meth:`SSLSocket.cipher` и :meth:`SSLSocket.compression` требуют, чтобы было установлено TLS-соединение. вышел за пределы TLS Client Hello и, следовательно, не будет возвращать значимые значения и не может быть безопасно вызван.

source: The *sni_callback* function must return ``None`` to allow the TLS negotiation to continue. If a TLS failure is required, a constant :const:`ALERT_DESCRIPTION_* <ALERT_DESCRIPTION_INTERNAL_ERROR>` can be returned. Other return values will result in a TLS fatal error with :const:`ALERT_DESCRIPTION_INTERNAL_ERROR`.
ru: Функция *sni_callback* должна возвращать None, чтобы разрешить продолжение согласования TLS. Если требуется сбой TLS, может быть возвращена константа :const:`ALERT_DESCRIPTION_* <ALERT_DESCRIPTION_INTERNAL_ERROR>`. Другие возвращаемые значения приведут к фатальной ошибке TLS с :const:`ALERT_DESCRIPTION_INTERNAL_ERROR`.

source: If an exception is raised from the *sni_callback* function the TLS connection will terminate with a fatal TLS alert message :const:`ALERT_DESCRIPTION_HANDSHAKE_FAILURE`.
ru: Если в функции *sni_callback* возникает исключение, соединение TLS прервется с неустранимым предупреждающим сообщением TLS :const:`ALERT_DESCRIPTION_HANDSHAKE_FAILURE`.

source: This method will raise :exc:`NotImplementedError` if the OpenSSL library had OPENSSL_NO_TLSEXT defined when it was built.
ru: Этот метод вызовет :exc:`NotImplementedError`, если в библиотеке OpenSSL при ее сборке был определен OPENSSL_NO_TLSEXT.
