Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/ssl.po
Languages: ru

source: There is no *do_handshake_on_connect* machinery. You must always manually call :meth:`~SSLSocket.do_handshake` to start the handshake.
ru: Механизма *do_handshake_on_connect* нет. Вы всегда должны вручную вызывать :meth:`~SSLSocket.do_handshake`, чтобы начать рукопожатие.

source: There is no handling of *suppress_ragged_eofs*. All end-of-file conditions that are in violation of the protocol are reported via the :exc:`SSLEOFError` exception.
ru: Обработка *suppress_ragged_eofs* не производится. Обо всех состояниях конца файла, нарушающих протокол, сообщается через исключение :exc:`SSLEOFError`.

source: The method :meth:`~SSLSocket.unwrap` call does not return anything, unlike for an SSL socket where it returns the underlying socket.
ru: Вызов метода :meth:`~SSLSocket.unwrap` ничего не возвращает, в отличие от сокета SSL, где он возвращает базовый сокет.

source: The *server_name_callback* callback passed to :meth:`SSLContext.set_servername_callback` will get an :class:`SSLObject` instance instead of a :class:`SSLSocket` instance as its first parameter.
ru: Обратный вызов *server_name_callback*, переданный в :meth:`SSLContext.set_servername_callback`, получит экземпляр :class:`SSLObject` вместо экземпляра :class:`SSLSocket` в качестве первого параметра.

source: Some notes related to the use of :class:`SSLObject`:
ru: Некоторые примечания, связанные с использованием :class:`SSLObject`:

source: All IO on an :class:`SSLObject` is :ref:`non-blocking <ssl-nonblocking>`. This means that for example :meth:`~SSLSocket.read` will raise an :exc:`SSLWantReadError` if it needs more data than the incoming BIO has available.
ru: Все операции ввода-вывода на :class:`SSLObject` являются :ref:`неблокирующими <ssl-nonblocking>`. Это означает, что, например, :meth:`~SSLSocket.read` вызовет :exc:`SSLWantReadError`, если ему нужно больше данных, чем доступно входящему BIO.

source: :class:`SSLObject` instances must be created with :meth:`~SSLContext.wrap_bio`. In earlier versions, it was possible to create instances directly. This was never documented or officially supported.
ru: Экземпляры :class:`SSLObject` должны быть созданы с помощью :meth:`~SSLContext.wrap_bio`. В более ранних версиях можно было создавать экземпляры напрямую. Это никогда не было задокументировано и официально не поддержано.

source: An SSLObject communicates with the outside world using memory buffers. The class :class:`MemoryBIO` provides a memory buffer that can be used for this purpose. It wraps an OpenSSL memory BIO (Basic IO) object:
ru: SSLObject взаимодействует с внешним миром, используя буферы памяти. Класс :class:`MemoryBIO` предоставляет буфер памяти, который можно использовать для этой цели. Он оборачивает объект памяти OpenSSL BIO (Basic IO):

source: A memory buffer that can be used to pass data between Python and an SSL protocol instance.
ru: Буфер памяти, который можно использовать для передачи данных между Python и экземпляром протокола SSL.

source: Return the number of bytes currently in the memory buffer.
ru: Возвращает количество байтов, находящихся в данный момент в буфере памяти.

source: A boolean indicating whether the memory BIO is current at the end-of-file position.
ru: Логическое значение, указывающее, является ли память BIO текущей в позиции конца файла.

source: Read up to *n* bytes from the memory buffer. If *n* is not specified or negative, all bytes are returned.
ru: Считайте до *n* байт из буфера памяти. Если *n* не указано или отрицательное значение, возвращаются все байты.

source: Write the bytes from *buf* to the memory BIO. The *buf* argument must be an object supporting the buffer protocol.
ru: Запишите байты из *buf* в память BIO. Аргумент *buf* должен быть объектом, поддерживающим протокол буфера.

source: The return value is the number of bytes written, which is always equal to the length of *buf*.
ru: Возвращаемое значение — это количество записанных байтов, которое всегда равно длине *buf*.

source: Write an EOF marker to the memory BIO. After this method has been called, it is illegal to call :meth:`~MemoryBIO.write`. The attribute :attr:`eof` will become true after all data currently in the buffer has been read.
ru: Запишите маркер EOF в память BIO. После вызова этого метода вызов :meth:`~MemoryBIO.write` недопустим. Атрибут :attr:`eof` станет истинным после того, как все данные, находящиеся в данный момент в буфере, будут прочитаны.

source: SSL session
ru: SSL-сессия

source: Session object used by :attr:`~SSLSocket.session`.
ru: Объект сеанса, используемый :attr:`~SSLSocket.session`.

source: Security considerations
ru: Соображения безопасности

source: Best defaults
ru: Лучшие занчения по умолчанию

source: For **client use**, if you don't have any special requirements for your security policy, it is highly recommended that you use the :func:`create_default_context` function to create your SSL context. It will load the system's trusted CA certificates, enable certificate validation and hostname checking, and try to choose reasonably secure protocol and cipher settings.
ru: При **клиентском использовании**, если у вас нет каких-либо особых требований к вашей политике безопасности, настоятельно рекомендуется использовать функцию :func:`create_default_context` для создания контекста SSL. Он загрузит доверенные сертификаты ЦС системы, включит проверку сертификатов и проверку имени хоста, а также попытается выбрать достаточно безопасный протокол и настройки шифрования.

source: For example, here is how you would use the :class:`smtplib.SMTP` class to create a trusted, secure connection to a SMTP server::
ru: Например, вот как можно использовать класс :class:`smtplib.SMTP` для создания доверенного и безопасного соединения с SMTP-сервером:

source: If a client certificate is needed for the connection, it can be added with :meth:`SSLContext.load_cert_chain`.
ru: Если для соединения необходим сертификат клиента, его можно добавить с помощью :meth:`SSLContext.load_cert_chain`.

source: By contrast, if you create the SSL context by calling the :class:`SSLContext` constructor yourself, it will not have certificate validation nor hostname checking enabled by default. If you do so, please read the paragraphs below to achieve a good security level.
ru: Напротив, если вы создаете контекст SSL, вызывая конструктор :class:`SSLContext` самостоятельно, по умолчанию в нем не будет включена ни проверка сертификата, ни проверка имени хоста. Если вы это сделаете, пожалуйста, прочитайте параграфы ниже, чтобы достичь хорошего уровня безопасности.

source: Manual settings
ru: Ручные настройки

source: Verifying certificates
ru: Проверка сертификатов

source: When calling the :class:`SSLContext` constructor directly, :const:`CERT_NONE` is the default. Since it does not authenticate the other peer, it can be insecure, especially in client mode where most of the time you would like to ensure the authenticity of the server you're talking to. Therefore, when in client mode, it is highly recommended to use :const:`CERT_REQUIRED`. However, it is in itself not sufficient; you also have to check that the server certificate, which can be obtained by calling :meth:`SSLSocket.getpeercert`, matches the desired service. For many protocols and applications, the service can be identified by the hostname. This common check is automatically performed when :attr:`SSLContext.check_hostname` is enabled.
ru: При непосредственном вызове конструктора :class:`SSLContext` по умолчанию используется :const:`CERT_NONE`. Поскольку он не аутентифицирует другой узел, он может быть небезопасным, особенно в клиентском режиме, где большую часть времени вам нужно убедиться в подлинности сервера, с которым вы разговариваете. Поэтому в режиме клиента настоятельно рекомендуется использовать :const:`CERT_REQUIRED`. Однако одного этого недостаточно; вам также необходимо проверить, что сертификат сервера, который можно получить, вызвав :meth:`SSLSocket.getpeercert`, соответствует желаемому сервису. Для многих протоколов и приложений службу можно идентифицировать по имени хоста. Эта общая проверка выполняется автоматически, когда включен :attr:`SSLContext.check_hostname`.

source: Hostname matchings is now performed by OpenSSL. Python no longer uses :func:`match_hostname`.
ru: Сопоставление имен хостов теперь выполняется OpenSSL. Python больше не использует :func:`match_hostname`.

source: In server mode, if you want to authenticate your clients using the SSL layer (rather than using a higher-level authentication mechanism), you'll also have to specify :const:`CERT_REQUIRED` and similarly check the client certificate.
ru: В режиме сервера, если вы хотите аутентифицировать своих клиентов с использованием уровня SSL (вместо использования механизма аутентификации более высокого уровня), вам также придется указать :const:`CERT_REQUIRED` и аналогичным образом проверить сертификат клиента.

source: Protocol versions
ru: Версии протоколов

source: SSL versions 2 and 3 are considered insecure and are therefore dangerous to use. If you want maximum compatibility between clients and servers, it is recommended to use :const:`PROTOCOL_TLS_CLIENT` or :const:`PROTOCOL_TLS_SERVER` as the protocol version. SSLv2 and SSLv3 are disabled by default.
ru: SSL версии 2 и 3 считаются небезопасными и поэтому их опасно использовать. Если вам нужна максимальная совместимость между клиентами и серверами, рекомендуется использовать :const:`PROTOCOL_TLS_CLIENT` или :const:`PROTOCOL_TLS_SERVER` в качестве версии протокола. SSLv2 и SSLv3 отключены по умолчанию.

source: The SSL context created above will only allow TLSv1.3 and later (if supported by your system) connections to a server. :const:`PROTOCOL_TLS_CLIENT` implies certificate validation and hostname checks by default. You have to load certificates into the context.
ru: Созданный выше контекст SSL позволит подключаться к серверу только по протоколу TLSv1.3 и более поздних версий (если поддерживается вашей системой). :const:`PROTOCOL_TLS_CLIENT` по умолчанию подразумевает проверку сертификата и проверку имени хоста. Вам необходимо загрузить сертификаты в контекст.

source: Cipher selection
ru: Выбор шифра

source: Multi-processing
ru: Мультиобработка

source: If using this module as part of a multi-processed application (using, for example the :mod:`multiprocessing` or :mod:`concurrent.futures` modules), be aware that OpenSSL's internal random number generator does not properly handle forked processes. Applications must change the PRNG state of the parent process if they use any SSL feature with :func:`os.fork`. Any successful call of :func:`~ssl.RAND_add` or :func:`~ssl.RAND_bytes` is sufficient.
ru: Если вы используете этот модуль как часть многопроцессорного приложения (используя, например, модули :mod:`multiprocessing` или :mod:`concurrent.futures`), имейте в виду, что внутренний генератор случайных чисел OpenSSL не обрабатывает должным образом раздвоенные процессы. . Приложения должны изменить состояние PRNG родительского процесса, если они используют какую-либо функцию SSL с :func:`os.fork`. Достаточно любого успешного вызова :func:`~ssl.RAND_add` или :func:`~ssl.RAND_bytes`.

source: The TLS 1.3 protocol behaves slightly differently than previous version of TLS/SSL. Some new TLS 1.3 features are not yet available.
ru: Протокол TLS 1.3 ведет себя немного иначе, чем предыдущая версия TLS/SSL. Некоторые новые функции TLS 1.3 пока недоступны.

source: TLS 1.3 uses a disjunct set of cipher suites. All AES-GCM and ChaCha20 cipher suites are enabled by default. The method :meth:`SSLContext.set_ciphers` cannot enable or disable any TLS 1.3 ciphers yet, but :meth:`SSLContext.get_ciphers` returns them.
ru: TLS 1.3 использует разрозненный набор наборов шифров. Все наборы шифров AES-GCM и ChaCha20 включены по умолчанию. Метод :meth:`SSLContext.set_ciphers` пока не может включать или отключать какие-либо шифры TLS 1.3, но :meth:`SSLContext.get_ciphers` возвращает их.

source: Session tickets are no longer sent as part of the initial handshake and are handled differently. :attr:`SSLSocket.session` and :class:`SSLSession` are not compatible with TLS 1.3.
ru: Билеты сеанса больше не отправляются как часть первоначального рукопожатия и обрабатываются по-другому. :attr:`SSLSocket.session` и :class:`SSLSession` несовместимы с TLS 1.3.

source: Client-side certificates are also no longer verified during the initial handshake. A server can request a certificate at any time. Clients process certificate requests while they send or receive application data from the server.
ru: Сертификаты на стороне клиента также больше не проверяются во время первоначального подтверждения. Сервер может запросить сертификат в любое время. Клиенты обрабатывают запросы сертификатов во время отправки или получения данных приложения с сервера.

source: TLS 1.3 features like early data, deferred TLS client cert request, signature algorithm configuration, and rekeying are not supported yet.
ru: Функции TLS 1.3, такие как ранние данные, отложенный запрос сертификата клиента TLS, настройка алгоритма подписи и смена ключей, пока не поддерживаются.

source: Class :class:`socket.socket`
ru: Класс :class:`socket.socket`

source: Documentation of underlying :mod:`socket` class
ru: Документация базового класса :mod:`socket`

source: `SSL/TLS Strong Encryption: An Introduction <https://httpd.apache.org/docs/trunk/en/ssl/ssl_intro.html>`_
ru: `Сильное шифрование SSL/TLS: введение <https://httpd.apache.org/docs/trunk/en/ssl/ssl_intro.html>`_

source: Intro from the Apache HTTP Server documentation
ru: Введение из документации HTTP-сервера Apache.

source: :rfc:`RFC 1422: Privacy Enhancement for Internet Electronic Mail: Part II: Certificate-Based Key Management <1422>`
ru: :rfc:`RFC 1422: Повышение конфиденциальности для электронной почты Интернета: Часть II: Управление ключами на основе сертификатов <1422>`

source: :rfc:`RFC 4086: Randomness Requirements for Security <4086>`
ru: :rfc:`RFC 4086: Требования случайности для безопасности <4086>`

source: Donald E., Jeffrey I. Schiller
ru: Дональд Э., Джеффри И. Шиллер

source: :rfc:`RFC 5280: Internet X.509 Public Key Infrastructure Certificate and Certificate Revocation List (CRL) Profile <5280>`
ru: :rfc:`RFC 5280: Профиль сертификата инфраструктуры открытых ключей Internet X.509 и списка отзыва сертификатов (CRL) <5280>`

source: :rfc:`RFC 5246: The Transport Layer Security (TLS) Protocol Version 1.2 <5246>`
ru: :rfc:`RFC 5246: Протокол безопасности транспортного уровня (TLS) версии 1.2 <5246>`

source: T. Dierks et. al.
ru: Т. Диркс и др. к.

source: :rfc:`RFC 6066: Transport Layer Security (TLS) Extensions <6066>`
ru: :rfc:`RFC 6066: Расширения безопасности транспортного уровня (TLS) <6066>`

source: `IANA TLS: Transport Layer Security (TLS) Parameters <https://www.iana.org/assignments/tls-parameters/tls-parameters.xml>`_
ru: `IANA TLS: Параметры безопасности транспортного уровня (TLS) <https://www.iana.org/assignments/tls-parameters/tls-parameters.xml>`_

source: :rfc:`RFC 7525: Recommendations for Secure Use of Transport Layer Security (TLS) and Datagram Transport Layer Security (DTLS) <7525>`
ru: :rfc:`RFC 7525: Рекомендации по безопасному использованию безопасности транспортного уровня (TLS) и безопасности транспортного уровня дейтаграмм (DTLS) <7525>`

source: `Mozilla's Server Side TLS recommendations <https://wiki.mozilla.org/Security/Server_Side_TLS>`_
ru: `Рекомендации Mozilla по серверному TLS <https://wiki.mozilla.org/Security/Server_Side_TLS>`_

source: (use in module ssl)
ru: (используйте в модуле SSL)

source: Transport Layer Security
ru: Безопасность транспортного уровня

source: certificates
ru: сертификаты

source: X509 certificate
ru: Сертификат X509
