Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/ssl.po
Languages: ru

source: :attr:`openssl_cafile_env` - OpenSSL's environment key that points to a cafile,
ru: :attr:`openssl_cafile_env` — ключ среды OpenSSL, указывающий на файл cafile,

source: :attr:`openssl_cafile` - hard coded path to a cafile,
ru: :attr:`openssl_cafile` - жестко запрограммированный путь к файлу кафе,

source: :attr:`openssl_capath_env` - OpenSSL's environment key that points to a capath,
ru: :attr:`openssl_capath_env` — ключ среды OpenSSL, указывающий на capath,

source: :attr:`openssl_capath` - hard coded path to a capath directory
ru: :attr:`openssl_capath` — жестко запрограммированный путь к каталогу capath.

source: Retrieve certificates from Windows' system cert store. *store_name* may be one of ``CA``, ``ROOT`` or ``MY``. Windows may provide additional cert stores, too.
ru: Получите сертификаты из хранилища системных сертификатов Windows. *store_name* может быть одним из ``CA``, ``ROOT`` или ``MY``. Windows также может предоставлять дополнительные хранилища сертификатов.

source: The function returns a list of (cert_bytes, encoding_type, trust) tuples. The encoding_type specifies the encoding of cert_bytes. It is either :const:`x509_asn` for X.509 ASN.1 data or :const:`pkcs_7_asn` for PKCS#7 ASN.1 data. Trust specifies the purpose of the certificate as a set of OIDS or exactly ``True`` if the certificate is trustworthy for all purposes.
ru: Функция возвращает список кортежей (cert_bytes,coding_type,trust). Тип_кодирования указывает кодировку cert_bytes. Это либо :const:`x509_asn` для данных X.509 ASN.1, либо :const:`pkcs_7_asn` для данных PKCS#7 ASN.1. Доверие определяет назначение сертификата в виде набора OIDS или в точности «True», если сертификат заслуживает доверия для всех целей.

source: Example::
ru: Пример::

source: Retrieve CRLs from Windows' system cert store. *store_name* may be one of ``CA``, ``ROOT`` or ``MY``. Windows may provide additional cert stores, too.
ru: Получите CRL из хранилища системных сертификатов Windows. *store_name* может быть одним из ``CA``, ``ROOT`` или ``MY``. Windows также может предоставлять дополнительные хранилища сертификатов.

source: The function returns a list of (cert_bytes, encoding_type, trust) tuples. The encoding_type specifies the encoding of cert_bytes. It is either :const:`x509_asn` for X.509 ASN.1 data or :const:`pkcs_7_asn` for PKCS#7 ASN.1 data.
ru: Функция возвращает список кортежей (cert_bytes,coding_type,trust). Тип_кодирования указывает кодировку cert_bytes. Это либо :const:`x509_asn` для данных X.509 ASN.1, либо :const:`pkcs_7_asn` для данных PKCS#7 ASN.1.

source: Constants
ru: Константы

source: All constants are now :class:`enum.IntEnum` or :class:`enum.IntFlag` collections.
ru: Все константы теперь представляют собой коллекции :class:`enum.IntEnum` или :class:`enum.IntFlag`.

source: Possible value for :attr:`SSLContext.verify_mode`. Except for :const:`PROTOCOL_TLS_CLIENT`, it is the default mode. With client-side sockets, just about any cert is accepted. Validation errors, such as untrusted or expired cert, are ignored and do not abort the TLS/SSL handshake.
ru: Возможное значение для :attr:`SSLContext.verify_mode`. За исключением :const:`PROTOCOL_TLS_CLIENT`, это режим по умолчанию. При использовании клиентских сокетов принимается практически любой сертификат. Ошибки проверки, такие как ненадежный сертификат или сертификат с истекшим сроком действия, игнорируются и не прерывают подтверждение TLS/SSL.

source: In server mode, no certificate is requested from the client, so the client does not send any for client cert authentication.
ru: В режиме сервера сертификат от клиента не запрашивается, поэтому клиент не отправляет его для проверки подлинности сертификата клиента.

source: See the discussion of :ref:`ssl-security` below.
ru: См. обсуждение :ref:`ssl-security` ниже.

source: Possible value for :attr:`SSLContext.verify_mode`. In client mode, :const:`CERT_OPTIONAL` has the same meaning as :const:`CERT_REQUIRED`. It is recommended to use :const:`CERT_REQUIRED` for client-side sockets instead.
ru: Возможное значение для :attr:`SSLContext.verify_mode`. В клиентском режиме :const:`CERT_OPTIONAL` имеет то же значение, что и :const:`CERT_REQUIRED`. Вместо этого рекомендуется использовать :const:`CERT_REQUIRED` для клиентских сокетов.

source: In server mode, a client certificate request is sent to the client. The client may either ignore the request or send a certificate in order perform TLS client cert authentication. If the client chooses to send a certificate, it is verified. Any verification error immediately aborts the TLS handshake.
ru: В режиме сервера клиенту отправляется запрос сертификата клиента. Клиент может либо проигнорировать запрос, либо отправить сертификат, чтобы выполнить аутентификацию сертификата клиента TLS. Если клиент решает отправить сертификат, он проверяется. Любая ошибка проверки немедленно прерывает рукопожатие TLS.

source: Use of this setting requires a valid set of CA certificates to be passed to :meth:`SSLContext.load_verify_locations`.
ru: Для использования этого параметра требуется передать действительный набор сертификатов CA в :meth:`SSLContext.load_verify_locations`.

source: Possible value for :attr:`SSLContext.verify_mode`. In this mode, certificates are required from the other side of the socket connection; an :class:`SSLError` will be raised if no certificate is provided, or if its validation fails. This mode is **not** sufficient to verify a certificate in client mode as it does not match hostnames. :attr:`~SSLContext.check_hostname` must be enabled as well to verify the authenticity of a cert. :const:`PROTOCOL_TLS_CLIENT` uses :const:`CERT_REQUIRED` and enables :attr:`~SSLContext.check_hostname` by default.
ru: Возможное значение для :attr:`SSLContext.verify_mode`. В этом режиме требуются сертификаты с другой стороны сокетного соединения; :class:`SSLError` будет вызван, если сертификат не предоставлен или его проверка не удалась. Этого режима **недостаточно** для проверки сертификата в режиме клиента, поскольку он не соответствует именам хостов. :attr:`~SSLContext.check_hostname` также должен быть включен для проверки подлинности сертификата. :const:`PROTOCOL_TLS_CLIENT` использует :const:`CERT_REQUIRED` и включает :attr:`~SSLContext.check_hostname` по умолчанию.

source: With server socket, this mode provides mandatory TLS client cert authentication. A client certificate request is sent to the client and the client must provide a valid and trusted certificate.
ru: При использовании сокета сервера этот режим обеспечивает обязательную аутентификацию сертификата клиента TLS. Запрос сертификата клиента отправляется клиенту, и клиент должен предоставить действительный и надежный сертификат.

source: :class:`enum.IntEnum` collection of CERT_* constants.
ru: :class:`enum.IntEnum` коллекция констант CERT_*.

source: Possible value for :attr:`SSLContext.verify_flags`. In this mode, certificate revocation lists (CRLs) are not checked. By default OpenSSL does neither require nor verify CRLs.
ru: Возможное значение для :attr:`SSLContext.verify_flags`. В этом режиме списки отзыва сертификатов (CRL) не проверяются. По умолчанию OpenSSL не требует и не проверяет CRL.

source: Possible value for :attr:`SSLContext.verify_flags`. In this mode, only the peer cert is checked but none of the intermediate CA certificates. The mode requires a valid CRL that is signed by the peer cert's issuer (its direct ancestor CA). If no proper CRL has been loaded with :attr:`SSLContext.load_verify_locations`, validation will fail.
ru: Возможное значение для :attr:`SSLContext.verify_flags`. В этом режиме проверяется только сертификат узла, но не проверяется ни один из сертификатов промежуточного центра сертификации. Для этого режима требуется действительный CRL, подписанный эмитентом однорангового сертификата (его прямым предком CA). Если правильный CRL не был загружен с помощью :attr:`SSLContext.load_verify_locations`, проверка завершится неудачно.

source: Possible value for :attr:`SSLContext.verify_flags`. In this mode, CRLs of all certificates in the peer cert chain are checked.
ru: Возможное значение для :attr:`SSLContext.verify_flags`. В этом режиме проверяются CRL всех сертификатов в цепочке одноранговых сертификатов.

source: Possible value for :attr:`SSLContext.verify_flags` to disable workarounds for broken X.509 certificates.
ru: Возможное значение для :attr:`SSLContext.verify_flags` для отключения обходных путей для поврежденных сертификатов X.509.

source: Possible value for :attr:`SSLContext.verify_flags` to enables proxy certificate verification.
ru: Возможное значение для :attr:`SSLContext.verify_flags`, чтобы включить проверку сертификата прокси.

source: Possible value for :attr:`SSLContext.verify_flags`. It instructs OpenSSL to prefer trusted certificates when building the trust chain to validate a certificate. This flag is enabled by default.
ru: Возможное значение для :attr:`SSLContext.verify_flags`. Он указывает OpenSSL отдавать предпочтение доверенным сертификатам при построении цепочки доверия для проверки сертификата. Этот флаг включен по умолчанию.

source: Possible value for :attr:`SSLContext.verify_flags`. It instructs OpenSSL to accept intermediate CAs in the trust store to be treated as trust-anchors, in the same way as the self-signed root CA certificates. This makes it possible to trust certificates issued by an intermediate CA without having to trust its ancestor root CA.
ru: Возможное значение для :attr:`SSLContext.verify_flags`. Он предписывает OpenSSL принимать промежуточные центры сертификации в хранилище доверенных сертификатов, которые будут рассматриваться как якоря доверия, так же, как и самозаверяющие корневые сертификаты центра сертификации. Это позволяет доверять сертификатам, выданным промежуточным центром сертификации, без необходимости доверять своему родительскому корневому центру сертификации.

source: :class:`enum.IntFlag` collection of VERIFY_* constants.
ru: :class:`enum.IntFlag` коллекция констант VERIFY_*.

source: Selects the highest protocol version that both the client and server support. Despite the name, this option can select both "SSL" and "TLS" protocols.
ru: Выбирает самую высокую версию протокола, которую поддерживают как клиент, так и сервер. Несмотря на название, эта опция может выбирать как протоколы «SSL», так и «TLS».

source: TLS clients and servers require different default settings for secure communication. The generic TLS protocol constant is deprecated in favor of :data:`PROTOCOL_TLS_CLIENT` and :data:`PROTOCOL_TLS_SERVER`.
ru: Клиентам и серверам TLS требуются разные настройки по умолчанию для безопасной связи. Общая константа протокола TLS устарела в пользу :data:`PROTOCOL_TLS_CLIENT` и :data:`PROTOCOL_TLS_SERVER`.

source: Auto-negotiate the highest protocol version that both the client and server support, and configure the context client-side connections. The protocol enables :data:`CERT_REQUIRED` and :attr:`~SSLContext.check_hostname` by default.
ru: Выполните автоматическое согласование самой высокой версии протокола, которую поддерживают как клиент, так и сервер, и настройте контекстные соединения на стороне клиента. Протокол включает :data:`CERT_REQUIRED` и :attr:`~SSLContext.check_hostname` по умолчанию.

source: Auto-negotiate the highest protocol version that both the client and server support, and configure the context server-side connections.
ru: Выполните автоматическое согласование самой высокой версии протокола, которую поддерживают как клиент, так и сервер, и настройте контекстные соединения на стороне сервера.

source: Alias for :data:`PROTOCOL_TLS`.
ru: Псевдоним для :data:`PROTOCOL_TLS`.

source: Use :data:`PROTOCOL_TLS` instead.
ru: Вместо этого используйте :data:`PROTOCOL_TLS`.

source: Selects SSL version 3 as the channel encryption protocol.
ru: Выбирает SSL версии 3 в качестве протокола шифрования канала.

source: This protocol is not available if OpenSSL is compiled with the ``no-ssl3`` option.
ru: Этот протокол недоступен, если OpenSSL скомпилирован с опцией no-ssl3.

source: SSL version 3 is insecure. Its use is highly discouraged.
ru: SSL версии 3 небезопасен. Его использование крайне не рекомендуется.

source: OpenSSL has deprecated all version specific protocols. Use the default protocol :data:`PROTOCOL_TLS_SERVER` or :data:`PROTOCOL_TLS_CLIENT` with :attr:`SSLContext.minimum_version` and :attr:`SSLContext.maximum_version` instead.
ru: OpenSSL объявил устаревшими все протоколы конкретной версии. Вместо этого используйте протокол по умолчанию :data:`PROTOCOL_TLS_SERVER` или :data:`PROTOCOL_TLS_CLIENT` с :attr:`SSLContext.minimum_version` и :attr:`SSLContext.maximum_version`.

source: Selects TLS version 1.0 as the channel encryption protocol.
ru: В качестве протокола шифрования канала выбирается TLS версии 1.0.

source: OpenSSL has deprecated all version specific protocols.
ru: OpenSSL объявил устаревшими все протоколы конкретной версии.

source: Selects TLS version 1.1 as the channel encryption protocol. Available only with openssl version 1.0.1+.
ru: Выбирает TLS версии 1.1 в качестве протокола шифрования канала. Доступно только с версией openssl 1.0.1+.

source: Selects TLS version 1.2 as the channel encryption protocol. Available only with openssl version 1.0.1+.
ru: В качестве протокола шифрования канала выбирается TLS версии 1.2. Доступно только с версией openssl 1.0.1+.

source: Enables workarounds for various bugs present in other SSL implementations. This option is set by default. It does not necessarily set the same flags as OpenSSL's ``SSL_OP_ALL`` constant.
ru: Позволяет обходные пути для различных ошибок, присутствующих в других реализациях SSL. Эта опция установлена ​​по умолчанию. Он не обязательно устанавливает те же флаги, что и константа OpenSSL ``SSL_OP_ALL``.

source: Prevents an SSLv2 connection. This option is only applicable in conjunction with :const:`PROTOCOL_TLS`. It prevents the peers from choosing SSLv2 as the protocol version.
ru: Запрещает соединение SSLv2. Эта опция применима только в сочетании с :const:`PROTOCOL_TLS`. Это не позволяет узлам выбирать SSLv2 в качестве версии протокола.

source: SSLv2 is deprecated
ru: SSLv2 устарел

source: Prevents an SSLv3 connection. This option is only applicable in conjunction with :const:`PROTOCOL_TLS`. It prevents the peers from choosing SSLv3 as the protocol version.
ru: Запрещает соединение SSLv3. Эта опция применима только в сочетании с :const:`PROTOCOL_TLS`. Это не позволяет узлам выбирать SSLv3 в качестве версии протокола.

source: SSLv3 is deprecated
ru: SSLv3 устарел

source: Prevents a TLSv1 connection. This option is only applicable in conjunction with :const:`PROTOCOL_TLS`. It prevents the peers from choosing TLSv1 as the protocol version.
ru: Запрещает соединение TLSv1. Эта опция применима только в сочетании с :const:`PROTOCOL_TLS`. Это не позволяет узлам выбирать TLSv1 в качестве версии протокола.

source: The option is deprecated since OpenSSL 1.1.0, use the new :attr:`SSLContext.minimum_version` and :attr:`SSLContext.maximum_version` instead.
ru: Эта опция устарела, начиная с OpenSSL 1.1.0, вместо нее используйте новые :attr:`SSLContext.minimum_version` и :attr:`SSLContext.maximum_version`.

source: Prevents a TLSv1.1 connection. This option is only applicable in conjunction with :const:`PROTOCOL_TLS`. It prevents the peers from choosing TLSv1.1 as the protocol version. Available only with openssl version 1.0.1+.
ru: Предотвращает соединение TLSv1.1. Эта опция применима только в сочетании с :const:`PROTOCOL_TLS`. Это не позволяет узлам выбирать TLSv1.1 в качестве версии протокола. Доступно только с версией openssl 1.0.1+.

source: The option is deprecated since OpenSSL 1.1.0.
ru: Эта опция устарела, начиная с OpenSSL 1.1.0.

source: Prevents a TLSv1.2 connection. This option is only applicable in conjunction with :const:`PROTOCOL_TLS`. It prevents the peers from choosing TLSv1.2 as the protocol version. Available only with openssl version 1.0.1+.
ru: Предотвращает соединение TLSv1.2. Эта опция применима только в сочетании с :const:`PROTOCOL_TLS`. Это не позволяет узлам выбирать TLSv1.2 в качестве версии протокола. Доступно только с версией openssl 1.0.1+.

source: Prevents a TLSv1.3 connection. This option is only applicable in conjunction with :const:`PROTOCOL_TLS`. It prevents the peers from choosing TLSv1.3 as the protocol version. TLS 1.3 is available with OpenSSL 1.1.1 or later. When Python has been compiled against an older version of OpenSSL, the flag defaults to *0*.
ru: Предотвращает соединение TLSv1.3. Эта опция применима только в сочетании с :const:`PROTOCOL_TLS`. Это не позволяет узлам выбирать TLSv1.3 в качестве версии протокола. TLS 1.3 доступен с OpenSSL 1.1.1 или более поздней версии. Если Python скомпилирован с использованием более старой версии OpenSSL, флаг по умолчанию равен *0*.

source: The option is deprecated since OpenSSL 1.1.0. It was added to 2.7.15 and 3.6.3 for backwards compatibility with OpenSSL 1.0.2.
ru: Эта опция устарела, начиная с OpenSSL 1.1.0. Он был добавлен в версии 2.7.15 и 3.6.3 для обратной совместимости с OpenSSL 1.0.2.

source: Disable all renegotiation in TLSv1.2 and earlier. Do not send HelloRequest messages, and ignore renegotiation requests via ClientHello.
ru: Отключите все повторные согласования в TLSv1.2 и более ранних версиях. Не отправляйте сообщения HelloRequest и игнорируйте запросы на повторное согласование через ClientHello.

source: This option is only available with OpenSSL 1.1.0h and later.
ru: Эта опция доступна только в OpenSSL 1.1.0h и более поздних версиях.

source: Use the server's cipher ordering preference, rather than the client's. This option has no effect on client sockets and SSLv2 server sockets.
ru: Используйте предпочтения порядка шифрования сервера, а не клиента. Этот параметр не влияет на клиентские сокеты и серверные сокеты SSLv2.

source: Prevents reuse of the same DH key for distinct SSL sessions. This improves forward secrecy but requires more computational resources. This option only applies to server sockets.
ru: Предотвращает повторное использование одного и того же ключа DH для разных сеансов SSL. Это улучшает прямую секретность, но требует больше вычислительных ресурсов. Эта опция применима только к серверным сокетам.

source: Prevents reuse of the same ECDH key for distinct SSL sessions. This improves forward secrecy but requires more computational resources. This option only applies to server sockets.
ru: Предотвращает повторное использование одного и того же ключа ECDH для разных сеансов SSL. Это улучшает прямую секретность, но требует больше вычислительных ресурсов. Эта опция применима только к серверным сокетам.

source: Send dummy Change Cipher Spec (CCS) messages in TLS 1.3 handshake to make a TLS 1.3 connection look more like a TLS 1.2 connection.
ru: Отправляйте фиктивные сообщения Change Cipher Spec (CCS) при рукопожатии TLS 1.3, чтобы соединение TLS 1.3 больше походило на соединение TLS 1.2.

source: This option is only available with OpenSSL 1.1.1 and later.
ru: Эта опция доступна только в OpenSSL 1.1.1 и более поздних версиях.

source: Disable compression on the SSL channel. This is useful if the application protocol supports its own compression scheme.
ru: Отключите сжатие на канале SSL. Это полезно, если протокол приложения поддерживает собственную схему сжатия.

source: :class:`enum.IntFlag` collection of OP_* constants.
ru: :class:`enum.IntFlag` коллекция констант OP_*.

source: Prevent client side from requesting a session ticket.
ru: Запретить клиентской стороне запрос билета сеанса.

source: Ignore unexpected shutdown of TLS connections.
ru: Игнорировать неожиданное завершение соединений TLS.

source: This option is only available with OpenSSL 3.0.0 and later.
ru: Эта опция доступна только в OpenSSL 3.0.0 и более поздних версиях.

source: Enable the use of the kernel TLS. To benefit from the feature, OpenSSL must have been compiled with support for it, and the negotiated cipher suites and extensions must be supported by it (a list of supported ones may vary by platform and kernel version).
ru: Включите использование TLS ядра. Чтобы воспользоваться этой функцией, OpenSSL должен быть скомпилирован с ее поддержкой, а также должны поддерживаться согласованные наборы шифров и расширения (список поддерживаемых может варьироваться в зависимости от платформы и версии ядра).

source: Note that with enabled kernel TLS some cryptographic operations are performed by the kernel directly and not via any available OpenSSL Providers. This might be undesirable if, for example, the application requires all cryptographic operations to be performed by the FIPS provider.
ru: Обратите внимание, что при включенном TLS ядра некоторые криптографические операции выполняются непосредственно ядром, а не через какие-либо доступные провайдеры OpenSSL. Это может быть нежелательно, если, например, приложение требует, чтобы все криптографические операции выполнял поставщик FIPS.

source: Allow legacy insecure renegotiation between OpenSSL and unpatched servers only.
ru: Разрешить устаревшее небезопасное повторное согласование только между OpenSSL и непропатченными серверами.

source: Whether the OpenSSL library has built-in support for the *Application-Layer Protocol Negotiation* TLS extension as described in :rfc:`7301`.
ru: Имеет ли библиотека OpenSSL встроенную поддержку расширения TLS *Application-Layer Protocol Negotiation*, как описано в :rfc:`7301`.

source: Whether the OpenSSL library has built-in support not checking subject common name and :attr:`SSLContext.hostname_checks_common_name` is writeable.
ru: Имеет ли библиотека OpenSSL встроенную поддержку отсутствия проверки общего имени субъекта и возможность записи :attr:`SSLContext.hostname_checks_common_name`.

source: Whether the OpenSSL library has built-in support for the Elliptic Curve-based Diffie-Hellman key exchange. This should be true unless the feature was explicitly disabled by the distributor.
ru: Имеет ли библиотека OpenSSL встроенную поддержку обмена ключами Диффи-Хеллмана на основе эллиптической кривой. Это должно быть правдой, если эта функция не была явно отключена дистрибьютором.

source: Whether the OpenSSL library has built-in support for the *Server Name Indication* extension (as defined in :rfc:`6066`).
ru: Имеет ли библиотека OpenSSL встроенную поддержку расширения *Индикация имени сервера* (как определено в :rfc:`6066`).

source: Whether the OpenSSL library has built-in support for the *Next Protocol Negotiation* as described in the `Application Layer Protocol Negotiation <https://en.wikipedia.org/wiki/Application-Layer_Protocol_Negotiation>`_. When true, you can use the :meth:`SSLContext.set_npn_protocols` method to advertise which protocols you want to support.
ru: Имеет ли библиотека OpenSSL встроенную поддержку *Next Protocol Negotiation*, как описано в `Согласование протокола прикладного уровня <https://en.wikipedia.org/wiki/Application-Layer_Protocol_Negotiation>`_. Если это правда, вы можете использовать метод :meth:`SSLContext.set_npn_protocols`, чтобы объявить, какие протоколы вы хотите поддерживать.

source: Whether the OpenSSL library has built-in support for the SSL 2.0 protocol.
ru: Имеет ли библиотека OpenSSL встроенную поддержку протокола SSL 2.0.

source: Whether the OpenSSL library has built-in support for the SSL 3.0 protocol.
ru: Имеет ли библиотека OpenSSL встроенную поддержку протокола SSL 3.0.

source: Whether the OpenSSL library has built-in support for the TLS 1.0 protocol.
ru: Имеет ли библиотека OpenSSL встроенную поддержку протокола TLS 1.0.

source: Whether the OpenSSL library has built-in support for the TLS 1.1 protocol.
ru: Имеет ли библиотека OpenSSL встроенную поддержку протокола TLS 1.1.
