Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/ssl.po
Languages: ru

source: :mod:`!ssl` --- TLS/SSL wrapper for socket objects
ru: :mod:`!ssl` --- TLS/SSL-оболочка для объектов сокетов

source: **Source code:** :source:`Lib/ssl.py`
ru: **Исходный код:** :source:`Lib/ssl.py`

source: This module provides access to Transport Layer Security (often known as "Secure Sockets Layer") encryption and peer authentication facilities for network sockets, both client-side and server-side. This module uses the OpenSSL library. It is available on all modern Unix systems, Windows, macOS, and probably additional platforms, as long as OpenSSL is installed on that platform.
ru: Этот модуль обеспечивает доступ к средствам шифрования транспортного уровня (часто называемого «Secure Sockets Layer») и одноранговой аутентификации для сетевых сокетов, как на стороне клиента, так и на стороне сервера. Этот модуль использует библиотеку OpenSSL. Он доступен на всех современных системах Unix, Windows, macOS и, возможно, на дополнительных платформах, если на этой платформе установлен OpenSSL.

source: Some behavior may be platform dependent, since calls are made to the operating system socket APIs. The installed version of OpenSSL may also cause variations in behavior. For example, TLSv1.3 comes with OpenSSL version 1.1.1.
ru: Некоторое поведение может зависеть от платформы, поскольку выполняются вызовы API-интерфейсов сокетов операционной системы. Установленная версия OpenSSL также может вызывать изменения в поведении. Например, TLSv1.3 поставляется с OpenSSL версии 1.1.1.

source: Don't use this module without reading the :ref:`ssl-security`. Doing so may lead to a false sense of security, as the default settings of the ssl module are not necessarily appropriate for your application.
ru: Не используйте этот модуль, не прочитав :ref:`ssl-security`. Это может привести к ложному чувству безопасности, поскольку настройки модуля SSL по умолчанию не обязательно подходят для вашего приложения.

source: This module does not work or is not available on WebAssembly. See :ref:`wasm-availability` for more information.
ru: Этот модуль не работает или недоступен в WebAssembly. См. :ref:`wasm-availability` для получения дополнительной информации.

source: This section documents the objects and functions in the ``ssl`` module; for more general information about TLS, SSL, and certificates, the reader is referred to the documents in the "See Also" section at the bottom.
ru: В этом разделе описаны объекты и функции модуля ``ssl``; Для получения более общей информации о TLS, SSL и сертификатах читатель может обратиться к документам в разделе «См. также» внизу.

source: This module provides a class, :class:`ssl.SSLSocket`, which is derived from the :class:`socket.socket` type, and provides a socket-like wrapper that also encrypts and decrypts the data going over the socket with SSL. It supports additional methods such as :meth:`getpeercert`, which retrieves the certificate of the other side of the connection, :meth:`cipher`, which retrieves the cipher being used for the secure connection or :meth:`get_verified_chain`, :meth:`get_unverified_chain` which retrieves certificate chain.
ru: Этот модуль предоставляет класс :class:`ssl.SSLSocket`, который является производным от типа :class:`socket.socket` и предоставляет оболочку, подобную сокету, которая также шифрует и расшифровывает данные, проходящие через сокет с помощью SSL. . Он поддерживает дополнительные методы, такие как :meth:`getpeercert`, который получает сертификат другой стороны соединения, :meth:`cipher`, который получает шифр, используемый для безопасного соединения, или :meth:`get_verified_chain`, :meth:`get_unverified_chain`, который извлекает цепочку сертификатов.

source: For more sophisticated applications, the :class:`ssl.SSLContext` class helps manage settings and certificates, which can then be inherited by SSL sockets created through the :meth:`SSLContext.wrap_socket` method.
ru: Для более сложных приложений класс :class:`ssl.SSLContext` помогает управлять настройками и сертификатами, которые затем могут быть унаследованы SSL-сокетами, созданными с помощью метода :meth:`SSLContext.wrap_socket`.

source: Updated to support linking with OpenSSL 1.1.0
ru: Обновлено для поддержки связи с OpenSSL 1.1.0.

source: OpenSSL 0.9.8, 1.0.0 and 1.0.1 are deprecated and no longer supported. In the future the ssl module will require at least OpenSSL 1.0.2 or 1.1.0.
ru: OpenSSL 0.9.8, 1.0.0 и 1.0.1 устарели и больше не поддерживаются. В будущем для модуля SSL потребуется OpenSSL как минимум 1.0.2 или 1.1.0.

source: :pep:`644` has been implemented. The ssl module requires OpenSSL 1.1.1 or newer.
ru: :pep:`644` реализован. Для модуля SSL требуется OpenSSL 1.1.1 или новее.

source: Use of deprecated constants and functions result in deprecation warnings.
ru: Использование устаревших констант и функций приводит к появлению предупреждений об устаревании.

source: Functions, Constants, and Exceptions
ru: Функции, константы и исключения

source: Socket creation
ru: Создание сокетов

source: Instances of :class:`SSLSocket` must be created using the :meth:`SSLContext.wrap_socket` method. The helper function :func:`create_default_context` returns a new context with secure default settings.
ru: Экземпляры :class:`SSLSocket` должны быть созданы с использованием метода :meth:`SSLContext.wrap_socket`. Вспомогательная функция :func:`create_default_context` возвращает новый контекст с безопасными настройками по умолчанию.

source: Client socket example with default context and IPv4/IPv6 dual stack::
ru: Пример клиентского сокета с контекстом по умолчанию и двойным стеком IPv4/IPv6:

source: Client socket example with custom context and IPv4::
ru: Пример клиентского сокета с пользовательским контекстом и IPv4::

source: Server socket example listening on localhost IPv4::
ru: Пример сокета сервера, прослушивающего локальный хост IPv4::

source: Context creation
ru: Создание контекста

source: A convenience function helps create :class:`SSLContext` objects for common purposes.
ru: Удобная функция помогает создавать объекты SSLContext для общих целей.

source: Return a new :class:`SSLContext` object with default settings for the given *purpose*. The settings are chosen by the :mod:`ssl` module, and usually represent a higher security level than when calling the :class:`SSLContext` constructor directly.
ru: Вернуть новый объект :class:`SSLContext` с настройками по умолчанию для данной *цели*. Настройки выбираются модулем :mod:`ssl` и обычно представляют более высокий уровень безопасности, чем при непосредственном вызове конструктора :class:`SSLContext`.

source: *cafile*, *capath*, *cadata* represent optional CA certificates to trust for certificate verification, as in :meth:`SSLContext.load_verify_locations`. If all three are :const:`None`, this function can choose to trust the system's default CA certificates instead.
ru: *cafile*, *capath*, *cadata* представляют собой дополнительные сертификаты CA, которым можно доверять при проверке сертификата, как в :meth:`SSLContext.load_verify_locations`. Если все три имеют значение :const:`None`, эта функция может вместо этого доверять сертификатам ЦС системы по умолчанию.

source: The settings are: :data:`PROTOCOL_TLS_CLIENT` or :data:`PROTOCOL_TLS_SERVER`, :data:`OP_NO_SSLv2`, and :data:`OP_NO_SSLv3` with high encryption cipher suites without RC4 and without unauthenticated cipher suites. Passing :const:`~Purpose.SERVER_AUTH` as *purpose* sets :data:`~SSLContext.verify_mode` to :data:`CERT_REQUIRED` and either loads CA certificates (when at least one of *cafile*, *capath* or *cadata* is given) or uses :meth:`SSLContext.load_default_certs` to load default CA certificates.
ru: Настройки: :data:`PROTOCOL_TLS_CLIENT` или :data:`PROTOCOL_TLS_SERVER`, :data:`OP_NO_SSLv2` и :data:`OP_NO_SSLv3` с наборами шифров с высоким уровнем шифрования без RC4 и без наборов шифров без аутентификации. Передача :const:`~Purpose.SERVER_AUTH` в качестве *цели* устанавливает для :data:`~SSLContext.verify_mode` значение :data:`CERT_REQUIRED` и либо загружает сертификаты CA (когда хотя бы один из *cafile*, *capath* или *cadata* задано) или использует :meth:`SSLContext.load_default_certs` для загрузки сертификатов CA по умолчанию.

source: When :attr:`~SSLContext.keylog_filename` is supported and the environment variable :envvar:`SSLKEYLOGFILE` is set, :func:`create_default_context` enables key logging.
ru: Если поддерживается :attr:`~SSLContext.keylog_filename` и установлена ​​переменная среды :envvar:`SSLKEYLOGFILE`, :func:`create_default_context` включает регистрацию ключей.

source: The default settings for this context include :data:`VERIFY_X509_PARTIAL_CHAIN` and :data:`VERIFY_X509_STRICT`. These make the underlying OpenSSL implementation behave more like a conforming implementation of :rfc:`5280`, in exchange for a small amount of incompatibility with older X.509 certificates.
ru: Настройки по умолчанию для этого контекста включают :data:`VERIFY_X509_PARTIAL_CHAIN` и :data:`VERIFY_X509_STRICT`. Это делает базовую реализацию OpenSSL более похожей на соответствующую реализацию :rfc:`5280` в обмен на небольшую несовместимость со старыми сертификатами X.509.

source: The protocol, options, cipher and other settings may change to more restrictive values anytime without prior deprecation. The values represent a fair balance between compatibility and security.
ru: Протокол, параметры, шифр и другие настройки могут быть изменены на более строгие значения в любое время без предварительного прекращения поддержки. Значения представляют собой справедливый баланс между совместимостью и безопасностью.

source: If your application needs specific settings, you should create a :class:`SSLContext` and apply the settings yourself.
ru: Если вашему приложению требуются определенные настройки, вам следует создать :class:`SSLContext` и применить настройки самостоятельно.

source: If you find that when certain older clients or servers attempt to connect with a :class:`SSLContext` created by this function that they get an error stating "Protocol or cipher suite mismatch", it may be that they only support SSL3.0 which this function excludes using the :data:`OP_NO_SSLv3`. SSL3.0 is widely considered to be `completely broken <https://en.wikipedia.org/wiki/POODLE>`_. If you still wish to continue to use this function but still allow SSL 3.0 connections you can re-enable them using::
ru: Если вы обнаружите, что когда некоторые старые клиенты или серверы пытаются подключиться с помощью :class:`SSLContext`, созданного этой функцией, они получают сообщение об ошибке «Несоответствие протокола или набора шифров», возможно, они поддерживают только SSL3.0, который эта функция исключает использование :data:`OP_NO_SSLv3`. SSL3.0 широко считается «полностью сломанным <https://en.wikipedia.org/wiki/POODLE>». Если вы по-прежнему хотите продолжать использовать эту функцию, но по-прежнему разрешаете соединения SSL 3.0, вы можете повторно включить их, используя:

source: This context enables :data:`VERIFY_X509_STRICT` by default, which may reject pre-:rfc:`5280` or malformed certificates that the underlying OpenSSL implementation otherwise would accept. While disabling this is not recommended, you can do so using::
ru: Этот контекст включает :data:`VERIFY_X509_STRICT` по умолчанию, что может отклонять сертификаты до:rfc:`5280` или некорректные сертификаты, которые в противном случае приняла бы базовая реализация OpenSSL. Хотя отключать это не рекомендуется, вы можете сделать это, используя::

source: RC4 was dropped from the default cipher string.
ru: RC4 был исключен из строки шифрования по умолчанию.

source: ChaCha20/Poly1305 was added to the default cipher string.
ru: ChaCha20/Poly1305 был добавлен в строку шифрования по умолчанию.

source: 3DES was dropped from the default cipher string.
ru: 3DES был исключен из строки шифрования по умолчанию.

source: Support for key logging to :envvar:`SSLKEYLOGFILE` was added.
ru: Добавлена ​​поддержка регистрации ключей в :envvar:`SSLKEYLOGFILE`.

source: The context now uses :data:`PROTOCOL_TLS_CLIENT` or :data:`PROTOCOL_TLS_SERVER` protocol instead of generic :data:`PROTOCOL_TLS`.
ru: Контекст теперь использует протокол :data:`PROTOCOL_TLS_CLIENT` или :data:`PROTOCOL_TLS_SERVER` вместо общего :data:`PROTOCOL_TLS`.

source: The context now uses :data:`VERIFY_X509_PARTIAL_CHAIN` and :data:`VERIFY_X509_STRICT` in its default verify flags.
ru: Контекст теперь использует :data:`VERIFY_X509_PARTIAL_CHAIN` и :data:`VERIFY_X509_STRICT` в своих флагах проверки по умолчанию.

source: Exceptions
ru: Исключения

source: Raised to signal an error from the underlying SSL implementation (currently provided by the OpenSSL library). This signifies some problem in the higher-level encryption and authentication layer that's superimposed on the underlying network connection. This error is a subtype of :exc:`OSError`. The error code and message of :exc:`SSLError` instances are provided by the OpenSSL library.
ru: Вызывается, чтобы сигнализировать об ошибке базовой реализации SSL (в настоящее время предоставляемой библиотекой OpenSSL). Это означает некоторую проблему на уровне шифрования и аутентификации более высокого уровня, который накладывается на базовое сетевое соединение. Эта ошибка является подтипом :exc:`OSError`. Код ошибки и сообщение экземпляров :exc:`SSLError` предоставляются библиотекой OpenSSL.

source: :exc:`SSLError` used to be a subtype of :exc:`socket.error`.
ru: :exc:`SSLError` раньше был подтипом :exc:`socket.error`.

source: A string mnemonic designating the OpenSSL submodule in which the error occurred, such as ``SSL``, ``PEM`` or ``X509``. The range of possible values depends on the OpenSSL version.
ru: Строковая мнемоника, обозначающая субмодуль OpenSSL, в котором произошла ошибка, например SSL, PEM или X509. Диапазон возможных значений зависит от версии OpenSSL.

source: A string mnemonic designating the reason this error occurred, for example ``CERTIFICATE_VERIFY_FAILED``. The range of possible values depends on the OpenSSL version.
ru: Строковая мнемоника, обозначающая причину возникновения этой ошибки, например CERTIFICATE_VERIFY_FAILED. Диапазон возможных значений зависит от версии OpenSSL.

source: A subclass of :exc:`SSLError` raised when trying to read or write and the SSL connection has been closed cleanly. Note that this doesn't mean that the underlying transport (read TCP) has been closed.
ru: Подкласс :exc:`SSLError`, возникающий при попытке чтения или записи, и SSL-соединение было корректно закрыто. Обратите внимание, что это не означает, что базовый транспорт (читай TCP) был закрыт.

source: A subclass of :exc:`SSLError` raised by a :ref:`non-blocking SSL socket <ssl-nonblocking>` when trying to read or write data, but more data needs to be received on the underlying TCP transport before the request can be fulfilled.
ru: Подкласс :exc:`SSLError`, вызываемый :ref:`неблокирующим сокетом SSL <ssl-nonblocking>` при попытке чтения или записи данных, но перед запросом необходимо получить больше данных по базовому TCP-транспорту. может быть выполнено.

source: A subclass of :exc:`SSLError` raised by a :ref:`non-blocking SSL socket <ssl-nonblocking>` when trying to read or write data, but more data needs to be sent on the underlying TCP transport before the request can be fulfilled.
ru: Подкласс :exc:`SSLError`, вызываемый :ref:`неблокирующим сокетом SSL <ssl-nonblocking>` при попытке чтения или записи данных, но перед запросом необходимо отправить больше данных по базовому TCP-транспорту. может быть выполнено.

source: A subclass of :exc:`SSLError` raised when a system error was encountered while trying to fulfill an operation on a SSL socket. Unfortunately, there is no easy way to inspect the original errno number.
ru: Подкласс :exc:`SSLError`, вызываемый при возникновении системной ошибки при попытке выполнить операцию над сокетом SSL. К сожалению, нет простого способа проверить исходный номер ошибки.

source: A subclass of :exc:`SSLError` raised when the SSL connection has been terminated abruptly. Generally, you shouldn't try to reuse the underlying transport when this error is encountered.
ru: Подкласс :exc:`SSLError`, вызываемый при внезапном разрыве SSL-соединения. Как правило, при возникновении этой ошибки не следует пытаться повторно использовать базовый транспорт.

source: A subclass of :exc:`SSLError` raised when certificate validation has failed.
ru: Подкласс :exc:`SSLError`, вызываемый при неудачной проверке сертификата.

source: A numeric error number that denotes the verification error.
ru: Числовой номер ошибки, обозначающий ошибку проверки.

source: A human readable string of the verification error.
ru: Удобочитаемая строка ошибки проверки.

source: An alias for :exc:`SSLCertVerificationError`.
ru: Псевдоним для :exc:`SSLCertVerificationError`.

source: The exception is now an alias for :exc:`SSLCertVerificationError`.
ru: Исключением теперь является псевдоним для :exc:`SSLCertVerificationError`.

source: Random generation
ru: Случайная генерация

source: Return *num* cryptographically strong pseudo-random bytes. Raises an :class:`SSLError` if the PRNG has not been seeded with enough data or if the operation is not supported by the current RAND method. :func:`RAND_status` can be used to check the status of the PRNG and :func:`RAND_add` can be used to seed the PRNG.
ru: Возвращает *num* криптостойкие псевдослучайные байты. Вызывает :class:`SSLError`, если в PRNG недостаточно данных или если операция не поддерживается текущим методом RAND. :func:`RAND_status` можно использовать для проверки статуса PRNG, а :func:`RAND_add` можно использовать для заполнения PRNG.

source: For almost all applications :func:`os.urandom` is preferable.
ru: Почти для всех приложений предпочтительнее использовать :func:`os.urandom`.

source: Read the Wikipedia article, `Cryptographically secure pseudorandom number generator (CSPRNG) <https://en.wikipedia.org/wiki/Cryptographically_secure_pseudorandom_number_generator>`_, to get the requirements of a cryptographically strong generator.
ru: Прочтите статью в Википедии «Криптографически безопасный генератор псевдослучайных чисел (CSPRNG) <https://en.wikipedia.org/wiki/Cryptographically_secure_pseudorandom_number_generator>», чтобы узнать требования к криптостойкому генератору.

source: Return ``True`` if the SSL pseudo-random number generator has been seeded with 'enough' randomness, and ``False`` otherwise. You can use :func:`ssl.RAND_egd` and :func:`ssl.RAND_add` to increase the randomness of the pseudo-random number generator.
ru: Возвращайте ``True``, если генератор псевдослучайных чисел SSL заполнил "достаточную" случайность, и ``False`` в противном случае. Вы можете использовать :func:`ssl.RAND_egd` и :func:`ssl.RAND_add` для увеличения случайности генератора псевдослучайных чисел.

source: Mix the given *bytes* into the SSL pseudo-random number generator. The parameter *entropy* (a float) is a lower bound on the entropy contained in string (so you can always use ``0.0``). See :rfc:`1750` for more information on sources of entropy.
ru: Смешайте данные *байты* с генератором псевдослучайных чисел SSL. Параметр *entropy* (число с плавающей запятой) представляет собой нижнюю границу энтропии, содержащейся в строке (поэтому вы всегда можете использовать ``0.0``). См. :rfc:`1750` для получения дополнительной информации об источниках энтропии.

source: Writable :term:`bytes-like object` is now accepted.
ru: Доступный для записи :term:`байтовый объект` теперь принимается.

source: Certificate handling
ru: Обработка сертификатов

source: Return the time in seconds since the Epoch, given the ``cert_time`` string representing the "notBefore" or "notAfter" date from a certificate in ``"%b %d %H:%M:%S %Y %Z"`` strptime format (C locale).
ru: Возвращает время в секундах с начала Эпохи, учитывая строку ``cert_time``, представляющую дату "notBefore" или "notAfter" из сертификата в ``"%b. %д %H:%M:%S %Y %Z"`` формат strptime (локаль C).

source: Here's an example:
ru: Вот пример:

source: "notBefore" or "notAfter" dates must use GMT (:rfc:`5280`).
ru: Даты «notBefore» или «notAfter» должны использовать GMT (:rfc:`5280`).

source: Interpret the input time as a time in UTC as specified by 'GMT' timezone in the input string. Local timezone was used previously. Return an integer (no fractions of a second in the input format)
ru: Интерпретируйте входное время как время в формате UTC, указанное часовым поясом GMT во входной строке. Ранее использовался местный часовой пояс. Возвращает целое число (без долей секунды во входном формате)

source: Given the address ``addr`` of an SSL-protected server, as a (*hostname*, *port-number*) pair, fetches the server's certificate, and returns it as a PEM-encoded string. If ``ssl_version`` is specified, uses that version of the SSL protocol to attempt to connect to the server. If *ca_certs* is specified, it should be a file containing a list of root certificates, the same format as used for the *cafile* parameter in :meth:`SSLContext.load_verify_locations`. The call will attempt to validate the server certificate against that set of root certificates, and will fail if the validation attempt fails. A timeout can be specified with the ``timeout`` parameter.
ru: Учитывая адрес ``addr`` сервера, защищенного SSL, в виде пары (*имя хоста*, *номер-порт*), извлекается сертификат сервера и возвращает его в виде строки в кодировке PEM. Если указана ``ssl_version``, используется эта версия протокола SSL для попытки подключения к серверу. Если указан *ca_certs*, это должен быть файл, содержащий список корневых сертификатов, тот же формат, который используется для параметра *cafile* в :meth:`SSLContext.load_verify_locations`. Вызов попытается проверить сертификат сервера на соответствие этому набору корневых сертификатов и завершится неудачей, если попытка проверки завершится неудачей. Тайм-аут можно указать с помощью параметра ``timeout``.

source: This function is now IPv6-compatible.
ru: Эта функция теперь совместима с IPv6.

source: The default *ssl_version* is changed from :data:`PROTOCOL_SSLv3` to :data:`PROTOCOL_TLS` for maximum compatibility with modern servers.
ru: Значение *ssl_version* по умолчанию изменено с :data:`PROTOCOL_SSLv3` на :data:`PROTOCOL_TLS` для максимальной совместимости с современными серверами.

source: The *timeout* parameter was added.
ru: Добавлен параметр *timeout*.

source: Given a certificate as a DER-encoded blob of bytes, returns a PEM-encoded string version of the same certificate.
ru: Если сертификат представляет собой блок байтов в кодировке DER, возвращается строковая версия того же сертификата в кодировке PEM.

source: Given a certificate as an ASCII PEM string, returns a DER-encoded sequence of bytes for that same certificate.
ru: Учитывая сертификат в виде строки ASCII PEM, возвращает последовательность байтов в кодировке DER для этого же сертификата.

source: Returns a named tuple with paths to OpenSSL's default cafile and capath. The paths are the same as used by :meth:`SSLContext.set_default_verify_paths`. The return value is a :term:`named tuple` ``DefaultVerifyPaths``:
ru: Возвращает именованный кортеж с путями к файлу cafile и capath OpenSSL по умолчанию. Пути такие же, как и в :meth:`SSLContext.set_default_verify_paths`. Возвращаемое значение представляет собой именованный кортеж ``DefaultVerifyPaths``:

source: :attr:`cafile` - resolved path to cafile or ``None`` if the file doesn't exist,
ru: :attr:`cafile` - разрешенный путь к cafile или ``None``, если файл не существует,

source: :attr:`capath` - resolved path to capath or ``None`` if the directory doesn't exist,
ru: :attr:`capath` - разрешенный путь к capath или ``None``, если каталог не существует,
