Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/statistics.po
Languages: ru

source: Measures the agreement between two normal probability distributions. Returns a value between 0.0 and 1.0 giving `the overlapping area for the two probability density functions <https://www.rasch.org/rmt/rmt101r.htm>`_.
ru: Измеряет согласие между двумя нормальными распределениями вероятностей. Возвращает значение от 0,0 до 1,0, определяющее `область перекрытия для двух функций плотности вероятности <https://www.rasch.org/rmt/rmt101r.htm>`_.

source: Divide the normal distribution into *n* continuous intervals with equal probability. Returns a list of (n - 1) cut points separating the intervals.
ru: Разделите нормальное распределение на *n* непрерывные интервалы с равной вероятностью. Возвращает список из (n – 1) точек разреза, разделяющих интервалы.

source: Set *n* to 4 for quartiles (the default). Set *n* to 10 for deciles. Set *n* to 100 for percentiles which gives the 99 cuts points that separate the normal distribution into 100 equal sized groups.
ru: Установите для параметра *n* значение 4 для квартилей (по умолчанию). Установите *n* равным 10 для децилей. Установите *n* равным 100 для процентилей, что дает 99 точек разреза, разделяющих нормальное распределение на 100 групп одинакового размера.

source: Compute the `Standard Score <https://www.statisticshowto.com/probability-and-statistics/z-score/>`_ describing *x* in terms of the number of standard deviations above or below the mean of the normal distribution: ``(x - mean) / stdev``.
ru: Вычислите `Стандартный показатель <https://www.statisticshowto.com/probability-and-statistics/z-score/>`_, описывающий *x* в терминах количества стандартных отклонений выше или ниже среднего нормального распределения. : ``(x - среднее)/stdev``.

source: Instances of :class:`NormalDist` support addition, subtraction, multiplication and division by a constant. These operations are used for translation and scaling. For example:
ru: Экземпляры :class:`NormalDist` поддерживают сложение, вычитание, умножение и деление на константу. Эти операции используются для перевода и масштабирования. Например:

source: Dividing a constant by an instance of :class:`NormalDist` is not supported because the result wouldn't be normally distributed.
ru: Деление константы на экземпляр :class:`NormalDist` не поддерживается, поскольку результат не будет нормально распределяться.

source: Since normal distributions arise from additive effects of independent variables, it is possible to `add and subtract two independent normally distributed random variables <https://en.wikipedia.org/wiki/Sum_of_normally_distributed_random_variables>`_ represented as instances of :class:`NormalDist`. For example:
ru: Поскольку нормальное распределение возникает в результате аддитивного воздействия независимых переменных, можно `сложить и вычесть две независимые нормально распределенные случайные величины <https://en.wikipedia.org/wiki/Sum_of_normally_distributed_random_variables>`_, представленные как экземпляры :class:` НормальныйДист`. Например:

source: Examples and Recipes
ru: Примеры и рецепты

source: Classic probability problems
ru: Классические вероятностные задачи

source: :class:`NormalDist` readily solves classic probability problems.
ru: :class:`NormalDist` легко решает классические вероятностные задачи.

source: For example, given `historical data for SAT exams <https://nces.ed.gov/programs/digest/d17/tables/dt17_226.40.asp>`_ showing that scores are normally distributed with a mean of 1060 and a standard deviation of 195, determine the percentage of students with test scores between 1100 and 1200, after rounding to the nearest whole number:
ru: Например, если взять «исторические данные по экзаменам SAT <https://nces.ed.gov/programs/digest/d17/tables/dt17_226.40.asp>», показывающие, что баллы обычно распределяются со средним значением 1060 и стандартное отклонение 195, определите процент студентов с результатами тестов от 1100 до 1200 после округления до ближайшего целого числа:

source: Find the `quartiles <https://en.wikipedia.org/wiki/Quartile>`_ and `deciles <https://en.wikipedia.org/wiki/Decile>`_ for the SAT scores:
ru: Найдите `квартили <https://en.wikipedia.org/wiki/Quartile>`_ и `deciles <https://en.wikipedia.org/wiki/Decile>`_ для баллов SAT:

source: Monte Carlo inputs for simulations
ru: Входные данные Монте-Карло для моделирования

source: To estimate the distribution for a model that isn't easy to solve analytically, :class:`NormalDist` can generate input samples for a `Monte Carlo simulation <https://en.wikipedia.org/wiki/Monte_Carlo_method>`_:
ru: Чтобы оценить распределение для модели, которую нелегко решить аналитически, :class:`NormalDist` может сгенерировать входные выборки для `симуляции Монте-Карло <https://en.wikipedia.org/wiki/Monte_Carlo_method>`_:

source: Approximating binomial distributions
ru: Аппроксимация биномиальных распределений

source: Normal distributions can be used to approximate `Binomial distributions <https://mathworld.wolfram.com/BinomialDistribution.html>`_ when the sample size is large and when the probability of a successful trial is near 50%.
ru: Нормальные распределения можно использовать для аппроксимации `Биномиальных распределений <https://mathworld.wolfram.com/BinomialDistribution.html>`_, когда размер выборки велик и когда вероятность успешного испытания составляет около 50%.

source: For example, an open source conference has 750 attendees and two rooms with a 500 person capacity. There is a talk about Python and another about Ruby. In previous conferences, 65% of the attendees preferred to listen to Python talks. Assuming the population preferences haven't changed, what is the probability that the Python room will stay within its capacity limits?
ru: Например, конференция с открытым исходным кодом имеет 750 участников и два зала вместимостью 500 человек. Идет разговор о Python и еще один о Ruby. На предыдущих конференциях 65% участников предпочитали слушать доклады о Python. Если предположить, что предпочтения населения не изменились, какова вероятность того, что комната Python останется в пределах своей вместимости?

source: Naive bayesian classifier
ru: Наивный байесовский классификатор

source: Normal distributions commonly arise in machine learning problems.
ru: Нормальные распределения обычно возникают в задачах машинного обучения.

source: Wikipedia has a `nice example of a Naive Bayesian Classifier <https://en.wikipedia.org/wiki/Naive_Bayes_classifier#Person_classification>`_. The challenge is to predict a person's gender from measurements of normally distributed features including height, weight, and foot size.
ru: В Википедии есть «хороший пример наивного байесовского классификатора <https://en.wikipedia.org/wiki/Naive_Bayes_classifier#Person_classification>». Задача состоит в том, чтобы предсказать пол человека на основе измерений нормально распределенных характеристик, включая рост, вес и размер стопы.

source: We're given a training dataset with measurements for eight people. The measurements are assumed to be normally distributed, so we summarize the data with :class:`NormalDist`:
ru: Нам предоставлен набор обучающих данных с измерениями для восьми человек. Предполагается, что измерения нормально распределены, поэтому мы суммируем данные с помощью :class:`NormalDist`:

source: Next, we encounter a new person whose feature measurements are known but whose gender is unknown:
ru: Затем мы встречаем нового человека, характеристики которого известны, но пол неизвестен:

source: Starting with a 50% `prior probability <https://en.wikipedia.org/wiki/Prior_probability>`_ of being male or female, we compute the posterior as the prior times the product of likelihoods for the feature measurements given the gender:
ru: Начиная с 50%-ной «априорной вероятности <https://en.wikipedia.org/wiki/Prior_probability>» быть мужчиной или женщиной, мы вычисляем апостериорное значение как произведение априорных умножений вероятностей для измерений признаков с учетом пола. :

source: The final prediction goes to the largest posterior. This is known as the `maximum a posteriori <https://en.wikipedia.org/wiki/Maximum_a_posteriori_estimation>`_ or MAP:
ru: Окончательный прогноз относится к самому большому апостериору. Это известно как `максимум апостериори <https://en.wikipedia.org/wiki/Maximum_a_posteriori_estimation>`_ или MAP:

source: Kernel density estimation
ru: Оценка плотности ядра

source: It is possible to estimate a continuous probability distribution from a fixed number of discrete samples.
ru: Можно оценить непрерывное распределение вероятностей по фиксированному количеству дискретных выборок.

source: The basic idea is to smooth the data using `a kernel function such as a normal distribution, triangular distribution, or uniform distribution <https://en.wikipedia.org/wiki/Kernel_(statistics)#Kernel_functions_in_common_use>`_. The degree of smoothing is controlled by a scaling parameter, ``h``, which is called the *bandwidth*.
ru: Основная идея состоит в том, чтобы сгладить данные с помощью `функции ядра, такой как нормальное распределение, треугольное распределение или равномерное распределение <https://en.wikipedia.org/wiki/Kernel_(statistics)#Kernel_functions_in_common_use>`_. Степень сглаживания контролируется параметром масштабирования h, который называется *пропускной способностью*.

source: `Wikipedia has an example <https://en.wikipedia.org/wiki/Kernel_density_estimation#Example>`_ where we can use the ``kde_normal()`` recipe to generate and plot a probability density function estimated from a small sample:
ru: `В Википедии есть пример <https://en.wikipedia.org/wiki/Kernel_density_estimation#Example>`_, где мы можем использовать рецепт ``kde_normal()`` для генерации и построения функции плотности вероятности, оцененной на основе небольшой выборки. :

source: The points in ``xarr`` and ``yarr`` can be used to make a PDF plot:
ru: Точки в ``xarr`` и ``yarr`` можно использовать для создания графика PDF:

source: Scatter plot of the estimated probability density function.
ru: Диаграмма рассеяния оцененной функции плотности вероятности.

source: `Resample <https://en.wikipedia.org/wiki/Resampling_(statistics)>`_ the data to produce 100 new selections:
ru: `Выполните повторную выборку <https://en.wikipedia.org/wiki/Resampling_(statistics)>`_ данных, чтобы получить 100 новых выборок:

source: Determine the probability of a new selection being below ``2.0``:
ru: Определите вероятность того, что новый выбор окажется ниже ``2,0``:

source: Add a new sample data point and find the new CDF at ``2.0``:
ru: Добавьте новую точку выборки данных и найдите новый CDF по адресу ``2.0``:
