Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/statistics.po
Languages: ru

source: :mod:`!statistics` --- Mathematical statistics functions
ru: :mod:`!statistics` --- Функции математической статистики

source: **Source code:** :source:`Lib/statistics.py`
ru: **Исходный код:** :source:`Lib/statistics.py`

source: This module provides functions for calculating mathematical statistics of numeric (:class:`~numbers.Real`-valued) data.
ru: Этот модуль предоставляет функции для расчета математической статистики числовых данных (:class:`~numbers.Real`).

source: The module is not intended to be a competitor to third-party libraries such as `NumPy <https://numpy.org>`_, `SciPy <https://scipy.org/>`_, or proprietary full-featured statistics packages aimed at professional statisticians such as Minitab, SAS and Matlab. It is aimed at the level of graphing and scientific calculators.
ru: Модуль не предназначен для конкуренции со сторонними библиотеками, такими как `NumPy <https://numpy.org>`_, `SciPy <https://scipy.org/>`_ или проприетарными полнофункциональными статистические пакеты, предназначенные для профессиональных статистиков, такие как Minitab, SAS и Matlab. Он ориентирован на уровень графических и научных калькуляторов.

source: Unless explicitly noted, these functions support :class:`int`, :class:`float`, :class:`~decimal.Decimal` and :class:`~fractions.Fraction`. Behaviour with other types (whether in the numeric tower or not) is currently unsupported. Collections with a mix of types are also undefined and implementation-dependent. If your input data consists of mixed types, you may be able to use :func:`map` to ensure a consistent result, for example: ``map(float, input_data)``.
ru: Если явно не указано иное, эти функции поддерживают :class:`int`, :class:`float`, :class:`~decimal.Decimal` и :class:`~fractions.Fraction`. Поведение с другими типами (будь то в числовой башне или нет) в настоящее время не поддерживается. Коллекции со смешанными типами также не определены и зависят от реализации. Если ваши входные данные состоят из смешанных типов, вы можете использовать :func:`map` для обеспечения согласованного результата, например: ``map(float, input_data)``.

source: Some datasets use ``NaN`` (not a number) values to represent missing data. Since NaNs have unusual comparison semantics, they cause surprising or undefined behaviors in the statistics functions that sort data or that count occurrences. The functions affected are ``median()``, ``median_low()``, ``median_high()``, ``median_grouped()``, ``mode()``, ``multimode()``, and ``quantiles()``. The ``NaN`` values should be stripped before calling these functions::
ru: В некоторых наборах данных для представления недостающих данных используются значения NaN (а не числа). Поскольку NaN имеют необычную семантику сравнения, они вызывают неожиданное или неопределенное поведение статистических функций, которые сортируют данные или подсчитывают вхождения. Затронутые функции: ``median()``, ``median_low()``, ``median_high()``, ``median_grouped()``, ``mode()``, ``multimode()` ` и ``квантили()``. Значения ``NaN`` должны быть удалены перед вызовом этих функций:

source: Averages and measures of central location
ru: Средние значения и показатели центрального расположения

source: These functions calculate an average or typical value from a population or sample.
ru: Эти функции вычисляют среднее или типичное значение для генеральной совокупности или выборки.

source: Arithmetic mean ("average") of data.
ru: Среднее арифметическое («среднее») данных.

source: Fast, floating-point arithmetic mean, with optional weighting.
ru: Быстрое среднее арифметическое с плавающей запятой и дополнительным взвешиванием.

source: Geometric mean of data.
ru: Среднее геометрическое данных.

source: Harmonic mean of data.
ru: Гармоническое среднее данных.

source: Median (middle value) of data.
ru: Медиана (среднее значение) данных.

source: Low median of data.
ru: Низкая медиана данных.

source: High median of data.
ru: Высокая медиана данных.

source: Median (50th percentile) of grouped data.
ru: Медиана (50-й процентиль) сгруппированных данных.

source: Single mode (most common value) of discrete or nominal data.
ru: Одиночный режим (наиболее распространенное значение) дискретных или номинальных данных.

source: List of modes (most common values) of discrete or nominal data.
ru: Список режимов (наиболее распространенных значений) дискретных или номинальных данных.

source: Divide data into intervals with equal probability.
ru: Разделите данные на интервалы с равной вероятностью.

source: Measures of spread
ru: Меры распространения

source: These functions calculate a measure of how much the population or sample tends to deviate from the typical or average values.
ru: Эти функции вычисляют меру того, насколько генеральная совокупность или выборка имеет тенденцию отклоняться от типичных или средних значений.

source: Population standard deviation of data.
ru: Стандартное отклонение данных по совокупности.

source: Population variance of data.
ru: Популяционная дисперсия данных.

source: Sample standard deviation of data.
ru: Выборочное стандартное отклонение данных.

source: Sample variance of data.
ru: Выборочная дисперсия данных.

source: Statistics for relations between two inputs
ru: Статистика отношений между двумя входами

source: These functions calculate statistics regarding relations between two inputs.
ru: Эти функции вычисляют статистику относительно отношений между двумя входными данными.

source: Sample covariance for two variables.
ru: Выборочная ковариация для двух переменных.

source: Pearson and Spearman's correlation coefficients.
ru: Коэффициенты корреляции Пирсона и Спирмена.

source: Slope and intercept for simple linear regression.
ru: Наклон и точка пересечения для простой линейной регрессии.

source: Function details
ru: Детали функций

source: Note: The functions do not require the data given to them to be sorted. However, for reading convenience, most of the examples show sorted sequences.
ru: Примечание. Функции не требуют сортировки переданных им данных. Однако для удобства чтения в большинстве примеров показаны отсортированные последовательности.

source: Return the sample arithmetic mean of *data* which can be a sequence or iterable.
ru: Возвращает выборочное среднее арифметическое *данных*, которое может быть последовательностью или итерируемым.

source: The arithmetic mean is the sum of the data divided by the number of data points. It is commonly called "the average", although it is only one of many different mathematical averages. It is a measure of the central location of the data.
ru: Среднее арифметическое — это сумма данных, деленная на количество точек данных. Его обычно называют «средним», хотя это лишь одно из множества различных математических средних. Это мера центрального расположения данных.

source: If *data* is empty, :exc:`StatisticsError` will be raised.
ru: Если *data* пусто, будет выдано :exc:`StatisticsError`.

source: Some examples of use:
ru: Некоторые примеры использования:

source: The mean is strongly affected by `outliers <https://en.wikipedia.org/wiki/Outlier>`_ and is not necessarily a typical example of the data points. For a more robust, although less efficient, measure of `central tendency <https://en.wikipedia.org/wiki/Central_tendency>`_, see :func:`median`.
ru: На среднее значение сильно влияют «выбросы <https://en.wikipedia.org/wiki/Outlier>» и оно не обязательно является типичным примером точек данных. Более надежную, хотя и менее эффективную меру «центральной тенденции <https://en.wikipedia.org/wiki/Central_tendency>»_ см. в :func:`median`.

source: The sample mean gives an unbiased estimate of the true population mean, so that when taken on average over all the possible samples, ``mean(sample)`` converges on the true mean of the entire population. If *data* represents the entire population rather than a sample, then ``mean(data)`` is equivalent to calculating the true population mean μ.
ru: Среднее значение выборки дает несмещенную оценку истинного среднего значения генеральной совокупности, так что при усреднении по всем возможным выборкам «среднее значение (выборка)» сходится к истинному среднему значению всей генеральной совокупности. Если *данные* представляют собой всю совокупность, а не выборку, то «среднее значение(данные)» эквивалентно вычислению истинного среднего значения популяции μ.

source: Convert *data* to floats and compute the arithmetic mean.
ru: Преобразуйте *данные* в числа с плавающей запятой и вычислите среднее арифметическое.

source: This runs faster than the :func:`mean` function and it always returns a :class:`float`. The *data* may be a sequence or iterable. If the input dataset is empty, raises a :exc:`StatisticsError`.
ru: Это работает быстрее, чем функция :func:`mean`, и всегда возвращает :class:`float`. *Данные* могут быть последовательностью или итерируемыми. Если входной набор данных пуст, выдается ошибка :exc:`StatisticsError`.

source: Optional weighting is supported. For example, a professor assigns a grade for a course by weighting quizzes at 20%, homework at 20%, a midterm exam at 30%, and a final exam at 30%:
ru: Поддерживается дополнительное взвешивание. Например, профессор выставляет оценку за курс, взвешивая тесты в 20 %, домашние задания в 20 %, промежуточный экзамен в 30 % и выпускной экзамен в 30 %:

source: If *weights* is supplied, it must be the same length as the *data* or a :exc:`ValueError` will be raised.
ru: Если указан *weights*, он должен быть той же длины, что и *data*, иначе будет выдано :exc:`ValueError`.

source: Added support for *weights*.
ru: Добавлена ​​поддержка *весов*.

source: Convert *data* to floats and compute the geometric mean.
ru: Преобразуйте *данные* в числа с плавающей запятой и вычислите среднее геометрическое.

source: The geometric mean indicates the central tendency or typical value of the *data* using the product of the values (as opposed to the arithmetic mean which uses their sum).
ru: Среднее геометрическое указывает центральную тенденцию или типичное значение *данных*, используя произведение значений (в отличие от среднего арифметического, которое использует их сумму).

source: Raises a :exc:`StatisticsError` if the input dataset is empty, if it contains a zero, or if it contains a negative value. The *data* may be a sequence or iterable.
ru: Вызывает :exc:`StatisticsError`, если входной набор данных пуст, содержит ноль или отрицательное значение. *Данные* могут быть последовательностью или итерируемыми.

source: No special efforts are made to achieve exact results. (However, this may change in the future.)
ru: Никаких особых усилий для достижения точных результатов не предпринимается. (Однако в будущем это может измениться.)

source: Return the harmonic mean of *data*, a sequence or iterable of real-valued numbers. If *weights* is omitted or ``None``, then equal weighting is assumed.
ru: Возвращает среднее гармоническое значение *данных*, последовательности или итерации действительных чисел. Если *weights* опущено или ``None``, то предполагается равный вес.

source: The harmonic mean is the reciprocal of the arithmetic :func:`mean` of the reciprocals of the data. For example, the harmonic mean of three values *a*, *b* and *c* will be equivalent to ``3/(1/a + 1/b + 1/c)``. If one of the values is zero, the result will be zero.
ru: Среднее гармоническое является обратной величиной арифметического :func:`mean` обратных величин данных. Например, среднее гармоническое трех значений *a*, *b* и *c* будет эквивалентно ``3/(1/a + 1/b + 1/c)``. Если одно из значений равно нулю, результат будет нулевым.

source: The harmonic mean is a type of average, a measure of the central location of the data. It is often appropriate when averaging ratios or rates, for example speeds.
ru: Среднее гармоническое — это тип среднего значения, мера центрального расположения данных. Это часто целесообразно при усреднении коэффициентов или скоростей, например, скоростей.

source: Suppose a car travels 10 km at 40 km/hr, then another 10 km at 60 km/hr. What is the average speed?
ru: Предположим, автомобиль проезжает 10 км со скоростью 40 км/ч, затем еще 10 км со скоростью 60 км/ч. Какова средняя скорость?

source: Suppose a car travels 40 km/hr for 5 km, and when traffic clears, speeds-up to 60 km/hr for the remaining 30 km of the journey. What is the average speed?
ru: Предположим, что автомобиль едет со скоростью 40 км/ч на протяжении 5 км, а когда пробка освобождается, остающиеся 30 км пути он развивает скорость до 60 км/ч. Какова средняя скорость?

source: :exc:`StatisticsError` is raised if *data* is empty, any element is less than zero, or if the weighted sum isn't positive.
ru: :exc:`StatisticsError` возникает, если *data* пусто, любой элемент меньше нуля или если взвешенная сумма не положительна.

source: The current algorithm has an early-out when it encounters a zero in the input. This means that the subsequent inputs are not tested for validity. (This behavior may change in the future.)
ru: Текущий алгоритм имеет ранний выход, когда на входе обнаруживается ноль. Это означает, что последующие входные данные не проверяются на достоверность. (Это поведение может измениться в будущем.)

source: Return the median (middle value) of numeric data, using the common "mean of middle two" method. If *data* is empty, :exc:`StatisticsError` is raised. *data* can be a sequence or iterable.
ru: Возвращает медиану (среднее значение) числовых данных, используя общий метод «среднего среднего значения». Если *data* пусто, возникает :exc:`StatisticsError`. *данные* могут быть последовательностью или итерацией.

source: The median is a robust measure of central location and is less affected by the presence of outliers. When the number of data points is odd, the middle data point is returned:
ru: Медиана является надежным показателем центрального местоположения и на нее меньше влияет наличие выбросов. Если количество точек данных нечетное, возвращается средняя точка данных:

source: When the number of data points is even, the median is interpolated by taking the average of the two middle values:
ru: Когда количество точек данных четное, медиана интерполируется путем взятия среднего значения двух средних значений:

source: This is suited for when your data is discrete, and you don't mind that the median may not be an actual data point.
ru: Это подходит для случаев, когда ваши данные дискретны и вы не возражаете против того, что медиана может не быть фактической точкой данных.

source: If the data is ordinal (supports order operations) but not numeric (doesn't support addition), consider using :func:`median_low` or :func:`median_high` instead.
ru: Это подходит для случаев, когда ваши данные дискретны и вы не возражаете против того, что медиана может не быть фактической точкой данных.

source: Return the low median of numeric data. If *data* is empty, :exc:`StatisticsError` is raised. *data* can be a sequence or iterable.
ru: Верните нижнюю медиану числовых данных. Если *data* пусто, возникает :exc:`StatisticsError`. *данные* могут быть последовательностью или итерацией.

source: The low median is always a member of the data set. When the number of data points is odd, the middle value is returned. When it is even, the smaller of the two middle values is returned.
ru: Нижняя медиана всегда является членом набора данных. Если количество точек данных нечетное, возвращается среднее значение. Если оно четное, возвращается меньшее из двух средних значений.

source: Use the low median when your data are discrete and you prefer the median to be an actual data point rather than interpolated.
ru: Используйте низкую медиану, если ваши данные дискретны и вы предпочитаете, чтобы медиана была фактической точкой данных, а не интерполированной.

source: Return the high median of data. If *data* is empty, :exc:`StatisticsError` is raised. *data* can be a sequence or iterable.
ru: Верните высокую медиану данных. Если *data* пусто, возникает :exc:`StatisticsError`. *данные* могут быть последовательностью или итерацией.

source: The high median is always a member of the data set. When the number of data points is odd, the middle value is returned. When it is even, the larger of the two middle values is returned.
ru: Высокая медиана всегда является членом набора данных. Если количество точек данных нечетное, возвращается среднее значение. Если оно четное, возвращается большее из двух средних значений.

source: Use the high median when your data are discrete and you prefer the median to be an actual data point rather than interpolated.
ru: Используйте высокую медиану, если ваши данные дискретны и вы предпочитаете, чтобы медиана была фактической точкой данных, а не интерполированной.

source: Estimates the median for numeric data that has been `grouped or binned <https://en.wikipedia.org/wiki/Data_binning>`_ around the midpoints of consecutive, fixed-width intervals.
ru: Оценивает медиану для числовых данных, которые были `сгруппированы или распределены <https://en.wikipedia.org/wiki/Data_binning>`_ вокруг средних точек последовательных интервалов фиксированной ширины.

source: The *data* can be any iterable of numeric data with each value being exactly the midpoint of a bin. At least one value must be present.
ru: *данные* могут быть любыми итерируемыми числовыми данными, каждое значение которых соответствует точно средней точке интервала. Должно присутствовать хотя бы одно значение.

source: The *interval* is the width of each bin.
ru: *interval* — это ширина каждого интервала.

source: For example, demographic information may have been summarized into consecutive ten-year age groups with each group being represented by the 5-year midpoints of the intervals:
ru: Например, демографическая информация могла быть суммирована по последовательным десятилетним возрастным группам, причем каждая группа была представлена ​​5-летними средними точками интервалов:

source: The 50th percentile (median) is the 536th person out of the 1071 member cohort. That person is in the 30 to 40 year old age group.
ru: 50-й процентиль (медиана) — это 536-й человек из когорты из 1071 участника. Это человек в возрастной группе от 30 до 40 лет.

source: The regular :func:`median` function would assume that everyone in the tricenarian age group was exactly 35 years old. A more tenable assumption is that the 484 members of that age group are evenly distributed between 30 and 40. For that, we use :func:`median_grouped`:
ru: Обычная функция :func:`median` предполагает, что всем в трехмерной возрастной группе было ровно 35 лет. Более разумное предположение состоит в том, что 484 члена этой возрастной группы равномерно распределены между 30 и 40 годами. Для этого мы используем :func:`median_grouped`:

source: The caller is responsible for making sure the data points are separated by exact multiples of *interval*. This is essential for getting a correct result. The function does not check this precondition.
ru: Вызывающая сторона несет ответственность за то, чтобы точки данных были разделены точными интервалами, кратными *интервалу*. Это необходимо для получения правильного результата. Функция не проверяет это предварительное условие.

source: Inputs may be any numeric type that can be coerced to a float during the interpolation step.
ru: Входные данные могут быть любого числового типа, который можно привести к числу с плавающей запятой на этапе интерполяции.

source: Return the single most common data point from discrete or nominal *data*. The mode (when it exists) is the most typical value and serves as a measure of central location.
ru: Возвращает единственную наиболее распространенную точку данных из дискретных или номинальных *данных*. Мода (если она существует) является наиболее типичной величиной и служит мерой центрального местоположения.

source: If there are multiple modes with the same frequency, returns the first one encountered in the *data*. If the smallest or largest of those is desired instead, use ``min(multimode(data))`` or ``max(multimode(data))``. If the input *data* is empty, :exc:`StatisticsError` is raised.
ru: Если существует несколько режимов с одинаковой частотой, возвращается первый из *данных*. Если вместо этого требуется наименьший или наибольший из них, используйте ``min(multimode(data))`` или ``max(multimode(data))``. Если входные *данные* пусты, возникает :exc:`StatisticsError`.

source: ``mode`` assumes discrete data and returns a single value. This is the standard treatment of the mode as commonly taught in schools:
ru: ``режим`` предполагает дискретные данные и возвращает одно значение. Это стандартная трактовка этого режима, которую обычно преподают в школах:

source: The mode is unique in that it is the only statistic in this package that also applies to nominal (non-numeric) data:
ru: Этот режим уникален тем, что это единственная статистика в этом пакете, которая также применима к номинальным (нечисловым) данным:

source: Only hashable inputs are supported. To handle type :class:`set`, consider casting to :class:`frozenset`. To handle type :class:`list`, consider casting to :class:`tuple`. For mixed or nested inputs, consider using this slower quadratic algorithm that only depends on equality tests: ``max(data, key=data.count)``.
ru: Поддерживаются только хэшируемые входы. Для обработки типа :class:`set` рассмотрите возможность приведения к :class:`frozenset`. Для обработки типа :class:`list` рассмотрите возможность приведения к :class:`tuple`. Для смешанных или вложенных входных данных рассмотрите возможность использования этого более медленного квадратичного алгоритма, который зависит только от проверок на равенство: ``max(data, key=data.count)``.

source: Now handles multimodal datasets by returning the first mode encountered. Formerly, it raised :exc:`StatisticsError` when more than one mode was found.
ru: Теперь обрабатывает мультимодальные наборы данных, возвращая первый обнаруженный режим. Раньше выдавалась ошибка :exc:`StatisticsError`, когда было обнаружено более одного режима.

source: Return a list of the most frequently occurring values in the order they were first encountered in the *data*. Will return more than one result if there are multiple modes or an empty list if the *data* is empty:
ru: Возвращает список наиболее часто встречающихся значений в том порядке, в котором они впервые встречаются в *данных*. Вернет более одного результата, если имеется несколько режимов или пустой список, если *данные* пусты:

source: Return the population standard deviation (the square root of the population variance). See :func:`pvariance` for arguments and other details.
ru: Верните стандартное отклонение генеральной совокупности (квадратный корень из дисперсии генеральной совокупности). См. аргументы и другие подробности в :func:`pvariance`.

source: Return the population variance of *data*, a non-empty sequence or iterable of real-valued numbers. Variance, or second moment about the mean, is a measure of the variability (spread or dispersion) of data. A large variance indicates that the data is spread out; a small variance indicates it is clustered closely around the mean.
ru: Возвращает дисперсию совокупности *данных*, непустой последовательности или итерации действительных чисел. Дисперсия, или второй момент относительно среднего значения, является мерой изменчивости (разброса или дисперсии) данных. Большая дисперсия указывает на то, что данные разбросаны; небольшая дисперсия указывает на то, что она сгруппирована близко к среднему значению.
