Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/statistics.po
Languages: ru

source: If the optional second argument *mu* is given, it should be the *population* mean of the *data*. It can also be used to compute the second moment around a point that is not the mean. If it is missing or ``None`` (the default), the arithmetic mean is automatically calculated.
ru: Если указан необязательный второй аргумент *mu*, это должно быть среднее значение *популяции* *данных*. Его также можно использовать для вычисления второго момента вокруг точки, которая не является средним значением. Если он отсутствует или «Нет» (по умолчанию), среднее арифметическое вычисляется автоматически.

source: Use this function to calculate the variance from the entire population. To estimate the variance from a sample, the :func:`variance` function is usually a better choice.
ru: Используйте эту функцию, чтобы вычислить дисперсию от всей генеральной совокупности. Для оценки дисперсии по выборке обычно лучше использовать функцию :func:`variance`.

source: Raises :exc:`StatisticsError` if *data* is empty.
ru: Вызывает :exc:`StatisticsError`, если *data* пусто.

source: Examples:
ru: Примеры:

source: If you have already calculated the mean of your data, you can pass it as the optional second argument *mu* to avoid recalculation:
ru: Если вы уже рассчитали среднее значение своих данных, вы можете передать его в качестве необязательного второго аргумента *mu*, чтобы избежать перерасчета:

source: Decimals and Fractions are supported:
ru: Поддерживаются десятичные дроби и дроби:

source: When called with the entire population, this gives the population variance σ². When called on a sample instead, this is the biased sample variance s², also known as variance with N degrees of freedom.
ru: При вызове для всей совокупности это дает дисперсию совокупности σ². Если вместо этого использовать выборку, это будет смещенная выборочная дисперсия s², также известная как дисперсия с N степенями свободы.

source: If you somehow know the true population mean μ, you may use this function to calculate the variance of a sample, giving the known population mean as the second argument. Provided the data points are a random sample of the population, the result will be an unbiased estimate of the population variance.
ru: Если вы каким-то образом знаете истинное среднее значение генеральной совокупности μ, вы можете использовать эту функцию для расчета дисперсии выборки, передав известное среднее значение генеральной совокупности в качестве второго аргумента. При условии, что точки данных представляют собой случайную выборку генеральной совокупности, результатом будет несмещенная оценка дисперсии генеральной совокупности.

source: Return the sample standard deviation (the square root of the sample variance). See :func:`variance` for arguments and other details.
ru: Возвращает стандартное отклонение выборки (квадратный корень из выборочной дисперсии). См. аргументы и другие подробности в :func:`variance`.

source: Return the sample variance of *data*, an iterable of at least two real-valued numbers. Variance, or second moment about the mean, is a measure of the variability (spread or dispersion) of data. A large variance indicates that the data is spread out; a small variance indicates it is clustered closely around the mean.
ru: Возвращает выборочную дисперсию *данных*, итерацию по крайней мере двух действительных чисел. Дисперсия, или второй момент относительно среднего значения, является мерой изменчивости (разброса или дисперсии) данных. Большая дисперсия указывает на то, что данные разбросаны; небольшая дисперсия указывает на то, что она сгруппирована близко к среднему значению.

source: If the optional second argument *xbar* is given, it should be the *sample* mean of *data*. If it is missing or ``None`` (the default), the mean is automatically calculated.
ru: Если указан необязательный второй аргумент *xbar*, это должно быть *выборочное* среднее значение *данных*. Если оно отсутствует или «Нет» (по умолчанию), среднее значение рассчитывается автоматически.

source: Use this function when your data is a sample from a population. To calculate the variance from the entire population, see :func:`pvariance`.
ru: Используйте эту функцию, если ваши данные представляют собой выборку из генеральной совокупности. Чтобы вычислить дисперсию для всей генеральной совокупности, см. :func:`pvariance`.

source: Raises :exc:`StatisticsError` if *data* has fewer than two values.
ru: Вызывает :exc:`StatisticsError`, если *data* имеет менее двух значений.

source: If you have already calculated the sample mean of your data, you can pass it as the optional second argument *xbar* to avoid recalculation:
ru: Если вы уже рассчитали выборочное среднее значение ваших данных, вы можете передать его в качестве необязательного второго аргумента *xbar*, чтобы избежать перерасчета:

source: This function does not attempt to verify that you have passed the actual mean as *xbar*. Using arbitrary values for *xbar* can lead to invalid or impossible results.
ru: Эта функция не пытается проверить, что вы передали фактическое среднее значение как *xbar*. Использование произвольных значений *xbar* может привести к неверным или невозможным результатам.

source: Decimal and Fraction values are supported:
ru: Поддерживаются десятичные и дробные значения:

source: This is the sample variance s² with Bessel's correction, also known as variance with N-1 degrees of freedom. Provided that the data points are representative (e.g. independent and identically distributed), the result should be an unbiased estimate of the true population variance.
ru: Это выборочная дисперсия s² с поправкой Бесселя, также известная как дисперсия с N-1 степенями свободы. При условии, что точки данных репрезентативны (например, независимы и одинаково распределены), результатом должна быть несмещенная оценка истинной генеральной дисперсии.

source: If you somehow know the actual population mean μ you should pass it to the :func:`pvariance` function as the *mu* parameter to get the variance of a sample.
ru: Если вы каким-то образом знаете фактическое среднее значение генеральной совокупности μ, вам следует передать его в функцию :func:`pvariance` в качестве параметра *mu*, чтобы получить дисперсию выборки.

source: Divide *data* into *n* continuous intervals with equal probability. Returns a list of ``n - 1`` cut points separating the intervals.
ru: Разделите *данные* на *n* непрерывные интервалы с равной вероятностью. Возвращает список точек отсечения ``n - 1``, ​​разделяющих интервалы.

source: Set *n* to 4 for quartiles (the default). Set *n* to 10 for deciles. Set *n* to 100 for percentiles which gives the 99 cuts points that separate *data* into 100 equal sized groups. Raises :exc:`StatisticsError` if *n* is not least 1.
ru: Установите для параметра *n* значение 4 для квартилей (по умолчанию). Установите *n* равным 10 для децилей. Установите *n* на 100 для процентилей, что дает 99 точек разреза, разделяющих *данные* на 100 групп одинакового размера. Вызывает :exc:`StatisticsError`, если *n* не меньше 1.

source: The *data* can be any iterable containing sample data. For meaningful results, the number of data points in *data* should be larger than *n*. Raises :exc:`StatisticsError` if there are not at least two data points.
ru: *данными* может быть любая итерация, содержащая образцы данных. Для получения значимых результатов количество точек данных в *data* должно быть больше, чем *n*. Вызывает :exc:`StatisticsError`, если нет хотя бы двух точек данных.

source: The cut points are linearly interpolated from the two nearest data points. For example, if a cut point falls one-third of the distance between two sample values, ``100`` and ``112``, the cut-point will evaluate to ``104``.
ru: Точки разреза линейно интерполируются из двух ближайших точек данных. Например, если точка отсечения попадает на одну треть расстояния между двумя выборочными значениями, «100» и «112», то точка отсечения будет равна «104».

source: The *method* for computing quantiles can be varied depending on whether the *data* includes or excludes the lowest and highest possible values from the population.
ru: *Метод* вычисления квантилей может варьироваться в зависимости от того, включают ли *данные* самые низкие и самые высокие возможные значения из совокупности или исключают их.

source: The default *method* is "exclusive" and is used for data sampled from a population that can have more extreme values than found in the samples. The portion of the population falling below the *i-th* of *m* sorted data points is computed as ``i / (m + 1)``. Given nine sample values, the method sorts them and assigns the following percentiles: 10%, 20%, 30%, 40%, 50%, 60%, 70%, 80%, 90%.
ru: *Метод* по умолчанию является «эксклюзивным» и используется для данных, отобранных из совокупности, которые могут иметь более экстремальные значения, чем найденные в выборках. Доля генеральной совокупности, находящаяся ниже *i-й* из *m* отсортированных точек данных, вычисляется как ``i / (m + 1)``. Учитывая девять выборочных значений, метод сортирует их и присваивает следующие процентили: 10%, 20%, 30%, 40%, 50%, 60%, 70%, 80%, 90%.

source: Setting the *method* to "inclusive" is used for describing population data or for samples that are known to include the most extreme values from the population. The minimum value in *data* is treated as the 0th percentile and the maximum value is treated as the 100th percentile. The portion of the population falling below the *i-th* of *m* sorted data points is computed as ``(i - 1) / (m - 1)``. Given 11 sample values, the method sorts them and assigns the following percentiles: 0%, 10%, 20%, 30%, 40%, 50%, 60%, 70%, 80%, 90%, 100%.
ru: Установка для *метода* значения «включающий» используется для описания данных генеральной совокупности или для выборок, которые, как известно, включают наиболее экстремальные значения генеральной совокупности. Минимальное значение в *data* рассматривается как 0-й процентиль, а максимальное значение — как 100-й процентиль. Доля генеральной совокупности, попадающая ниже *i-й* из *m* отсортированных точек данных, вычисляется как ``(i - 1) / (m - 1)``. Учитывая 11 выборочных значений, метод сортирует их и присваивает следующие процентили: 0%, 10%, 20%, 30%, 40%, 50%, 60%, 70%, 80%, 90%, 100%.

source: Return the sample covariance of two inputs *x* and *y*. Covariance is a measure of the joint variability of two inputs.
ru: Возвращает выборочную ковариацию двух входных данных *x* и *y*. Ковариация — это мера совместной изменчивости двух входных данных.

source: Both inputs must be of the same length (no less than two), otherwise :exc:`StatisticsError` is raised.
ru: Оба входных параметра должны иметь одинаковую длину (не менее двух), в противном случае выдается сообщение :exc:`StatisticsError`.

source: Return the `Pearson's correlation coefficient <https://en.wikipedia.org/wiki/Pearson_correlation_coefficient>`_ for two inputs. Pearson's correlation coefficient *r* takes values between -1 and +1. It measures the strength and direction of a linear relationship.
ru: Верните коэффициент корреляции Пирсона <https://en.wikipedia.org/wiki/Pearson_correlation_coefficient>`_ для двух входных данных. Коэффициент корреляции Пирсона *r* принимает значения от -1 до +1. Он измеряет силу и направление линейной зависимости.

source: If *method* is "ranked", computes `Spearman's rank correlation coefficient <https://en.wikipedia.org/wiki/Spearman%27s_rank_correlation_coefficient>`_ for two inputs. The data is replaced by ranks. Ties are averaged so that equal values receive the same rank. The resulting coefficient measures the strength of a monotonic relationship.
ru: Если *метод* является «ранжированным», вычисляет коэффициент ранговой корреляции Спирмена <https://en.wikipedia.org/wiki/Spearman %27с _rank_correlation_coefficient>`_ для двух входов. Данные заменяются рангами. Ничьи усредняются, так что равные значения получают одинаковый ранг. Полученный коэффициент измеряет силу монотонной зависимости.

source: Spearman's correlation coefficient is appropriate for ordinal data or for continuous data that doesn't meet the linear proportion requirement for Pearson's correlation coefficient.
ru: Коэффициент корреляции Спирмена подходит для порядковых данных или для непрерывных данных, которые не соответствуют требованию линейной пропорции для коэффициента корреляции Пирсона.

source: Both inputs must be of the same length (no less than two), and need not to be constant, otherwise :exc:`StatisticsError` is raised.
ru: Оба входных значения должны иметь одинаковую длину (не менее двух) и не обязательно должны быть постоянными, в противном случае выдается сообщение :exc:`StatisticsError`.

source: Example with `Kepler's laws of planetary motion <https://en.wikipedia.org/wiki/Kepler's_laws_of_planetary_motion>`_:
ru: Пример с `законами движения планет Кеплера <https://en.wikipedia.org/wiki/Kepler's_laws_of_planetary_motion>`_:

source: Added support for Spearman's rank correlation coefficient.
ru: Добавлена ​​поддержка коэффициента ранговой корреляции Спирмена.

source: Return the slope and intercept of `simple linear regression <https://en.wikipedia.org/wiki/Simple_linear_regression>`_ parameters estimated using ordinary least squares. Simple linear regression describes the relationship between an independent variable *x* and a dependent variable *y* in terms of this linear function:
ru: Возвращает наклон и точку пересечения параметров `простой линейной регрессии <https://en.wikipedia.org/wiki/Simple_linear_reгрессия>`_, оцененных с использованием обычного метода наименьших квадратов. Простая линейная регрессия описывает связь между независимой переменной *x* и зависимой переменной *y* с помощью этой линейной функции:

source: where ``slope`` and ``intercept`` are the regression parameters that are estimated, and ``noise`` represents the variability of the data that was not explained by the linear regression (it is equal to the difference between predicted and actual values of the dependent variable).
ru: где «наклон» и «пересечение» — это оцениваемые параметры регрессии, а «шум» представляет собой изменчивость данных, которая не была объяснена линейной регрессией (он равен разнице между прогнозируемыми и фактические значения зависимой переменной).

source: Both inputs must be of the same length (no less than two), and the independent variable *x* cannot be constant; otherwise a :exc:`StatisticsError` is raised.
ru: Оба входа должны иметь одинаковую длину (не менее двух), а независимая переменная *x* не может быть постоянной; в противном случае выдается ошибка :exc:`StatisticsError`.

source: For example, we can use the `release dates of the Monty Python films <https://en.wikipedia.org/wiki/Monty_Python#Films>`_ to predict the cumulative number of Monty Python films that would have been produced by 2019 assuming that they had kept the pace.
ru: Например, мы можем использовать `даты выхода фильмов о Монти Пайтоне <https://en.wikipedia.org/wiki/Monty_Python#Films>`_, чтобы предсказать совокупное количество фильмов о Монти Пайтоне, которые были бы сняты к 2019 году. предполагая, что они держат темп.

source: If *proportional* is true, the independent variable *x* and the dependent variable *y* are assumed to be directly proportional. The data is fit to a line passing through the origin. Since the *intercept* will always be 0.0, the underlying linear function simplifies to:
ru: Если *proportional* истинно, независимая переменная *x* и зависимая переменная *y* считаются прямо пропорциональными. Данные соответствуют линии, проходящей через начало координат. Поскольку *перехват* всегда будет равен 0,0, базовая линейная функция упрощается до:

source: Continuing the example from :func:`correlation`, we look to see how well a model based on major planets can predict the orbital distances for dwarf planets:
ru: Продолжая пример из :func:`correlation`, мы посмотрим, насколько хорошо модель, основанная на больших планетах, может предсказать орбитальные расстояния карликовых планет:

source: Added support for *proportional*.
ru: Добавлена ​​поддержка *пропорционального*.

source: Exceptions
ru: Исключения

source: A single exception is defined:
ru: Определено единственное исключение:

source: Subclass of :exc:`ValueError` for statistics-related exceptions.
ru: Подкласс :exc:`ValueError` для исключений, связанных со статистикой.

source: :class:`NormalDist` objects
ru: Объекты :class:`NormalDist`

source: :class:`NormalDist` is a tool for creating and manipulating normal distributions of a `random variable <http://www.stat.yale.edu/Courses/1997-98/101/ranvar.htm>`_. It is a class that treats the mean and standard deviation of data measurements as a single entity.
ru: :class:`NormalDist` — это инструмент для создания и управления нормальными распределениями `случайной переменной <http://www.stat.yale.edu/Courses/1997-98/101/ranvar.htm>`_. Это класс, который рассматривает среднее и стандартное отклонение измерений данных как единое целое.

source: Normal distributions arise from the `Central Limit Theorem <https://en.wikipedia.org/wiki/Central_limit_theorem>`_ and have a wide range of applications in statistics.
ru: Нормальные распределения возникают из `Центральной предельной теоремы <https://en.wikipedia.org/wiki/Central_limit_theorem>`_ и имеют широкий спектр приложений в статистике.

source: Returns a new *NormalDist* object where *mu* represents the `arithmetic mean <https://en.wikipedia.org/wiki/Arithmetic_mean>`_ and *sigma* represents the `standard deviation <https://en.wikipedia.org/wiki/Standard_deviation>`_.
ru: Возвращает новый объект *NormalDist*, где *mu* представляет собой `среднее арифметическое <https://en.wikipedia.org/wiki/Arithmetic_mean>`_, а *sigma* представляет `стандартное отклонение <https://en.wikipedia .org/wiki/Standard_deviation>`_.

source: If *sigma* is negative, raises :exc:`StatisticsError`.
ru: Если *sigma* отрицательное значение, выдается :exc:`StatisticsError`.

source: A read-only property for the `arithmetic mean <https://en.wikipedia.org/wiki/Arithmetic_mean>`_ of a normal distribution.
ru: Доступное только для чтения свойство для `среднего арифметического <https://en.wikipedia.org/wiki/Arithmetic_mean>`_ нормального распределения.

source: A read-only property for the `median <https://en.wikipedia.org/wiki/Median>`_ of a normal distribution.
ru: Доступное только для чтения свойство для `медианы <https://en.wikipedia.org/wiki/Median>`_ нормального распределения.

source: A read-only property for the `mode <https://en.wikipedia.org/wiki/Mode_(statistics)>`_ of a normal distribution.
ru: Свойство, доступное только для чтения, для `mode <https://en.wikipedia.org/wiki/Mode_(statistics)>`_ нормального распределения.

source: A read-only property for the `standard deviation <https://en.wikipedia.org/wiki/Standard_deviation>`_ of a normal distribution.
ru: Доступное только для чтения свойство для `стандартного отклонения <https://en.wikipedia.org/wiki/Standard_deviation>`_ нормального распределения.

source: A read-only property for the `variance <https://en.wikipedia.org/wiki/Variance>`_ of a normal distribution. Equal to the square of the standard deviation.
ru: Доступное только для чтения свойство для `дисперсии <https://en.wikipedia.org/wiki/Variance>`_ нормального распределения. Равен квадрату стандартного отклонения.

source: Makes a normal distribution instance with *mu* and *sigma* parameters estimated from the *data* using :func:`fmean` and :func:`stdev`.
ru: Создает экземпляр нормального распределения с параметрами *mu* и *sigma*, оцененными на основе *данных* с использованием :func:`fmean` и :func:`stdev`.

source: The *data* can be any :term:`iterable` and should consist of values that can be converted to type :class:`float`. If *data* does not contain at least two elements, raises :exc:`StatisticsError` because it takes at least one point to estimate a central value and at least two points to estimate dispersion.
ru: *Данные* могут быть любыми :term:`iterable` и должны состоять из значений, которые можно преобразовать в тип :class:`float`. Если *data* не содержит хотя бы двух элементов, возникает ошибка :exc:`StatisticsError`, поскольку для оценки центрального значения требуется как минимум одна точка, а для оценки дисперсии — как минимум две точки.

source: Generates *n* random samples for a given mean and standard deviation. Returns a :class:`list` of :class:`float` values.
ru: Генерирует *n* случайные выборки для заданного среднего значения и стандартного отклонения. Возвращает :class:`list` значений :class:`float`.

source: If *seed* is given, creates a new instance of the underlying random number generator. This is useful for creating reproducible results, even in a multi-threading context.
ru: Если задано *seed*, создается новый экземпляр базового генератора случайных чисел. Это полезно для получения воспроизводимых результатов даже в многопоточном контексте.

source: Using a `probability density function (pdf) <https://en.wikipedia.org/wiki/Probability_density_function>`_, compute the relative likelihood that a random variable *X* will be near the given value *x*. Mathematically, it is the limit of the ratio ``P(x <= X < x+dx) / dx`` as *dx* approaches zero.
ru: Используя `функцию плотности вероятности (pdf) <https://en.wikipedia.org/wiki/Probability_density_function>`_, вычислите относительную вероятность того, что случайная величина *X* будет находиться рядом с заданным значением *x*. Математически это предел отношения ``P(x <= X < x+dx) / dx``, когда *dx* приближается к нулю.

source: The relative likelihood is computed as the probability of a sample occurring in a narrow range divided by the width of the range (hence the word "density"). Since the likelihood is relative to other points, its value can be greater than ``1.0``.
ru: Относительная вероятность рассчитывается как вероятность попадания выборки в узкий диапазон, деленная на ширину диапазона (отсюда и слово «плотность»). Поскольку вероятность определяется относительно других точек, ее значение может быть больше, чем «1,0».

source: Using a `cumulative distribution function (cdf) <https://en.wikipedia.org/wiki/Cumulative_distribution_function>`_, compute the probability that a random variable *X* will be less than or equal to *x*. Mathematically, it is written ``P(X <= x)``.
ru: Используя `кумулятивную функцию распределения (cdf) <https://en.wikipedia.org/wiki/Cumulative_distribution_function>`_, вычислите вероятность того, что случайная величина *X* будет меньше или равна *x*. Математически это записывается ``P(X <= x)``.

source: Compute the inverse cumulative distribution function, also known as the `quantile function <https://en.wikipedia.org/wiki/Quantile_function>`_ or the `percent-point <https://web.archive.org/web/20190203145224/https://www.statisticshowto.datasciencecentral.com/inverse-distribution-function/>`_ function. Mathematically, it is written ``x : P(X <= x) = p``.
ru: Вычислите обратную кумулятивную функцию распределения, также известную как `функция квантиля <https://en.wikipedia.org/wiki/Quantile_function>`_ или `процентная точка <https://web.archive.org/web/ 20190203145224/https://www.statisticshowto.datasciencecentral.com/inverse-distribution-function/>`_ функция. Математически это записывается ``x : P(X <= x) = p``.

source: Finds the value *x* of the random variable *X* such that the probability of the variable being less than or equal to that value equals the given probability *p*.
ru: Находит значение *x* случайной величины *X* такое, что вероятность того, что переменная окажется меньше или равна этому значению, равна заданной вероятности *p*.
