Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: fa, ru, uk

source: A ``GenericAlias`` object with :class:`typing.ParamSpec` parameters may not have correct ``__parameters__`` after substitution because :class:`typing.ParamSpec` is intended primarily for static type checking.
fa: یک شی ``GenericAlias`` با پارامترهای :class:`typing.ParamSpec` ممکن است پس از جایگزینی دارای ``__parameters__`` صحیح نباشد زیرا :class:`typing.ParamSpec` عمدتاً برای بررسی نوع استاتیک در نظر گرفته شده است.
ru: А ``GenericAlias`` объект с :class:`typing.ParamSpec` параметры могут быть неверными ``__parameters__`` после замены, потому что :class:`typing.ParamSpec` предназначен в первую очередь для статической проверки типов.
uk: Об’єкт ``GenericAlias`` з параметрами :class:`typing.ParamSpec` може не мати правильних ``__parameters__`` після заміни, тому що :class:`typing.ParamSpec` призначений насамперед для статичної перевірки типу.

source: A boolean that is true if the alias has been unpacked using the ``*`` operator (see :data:`~typing.TypeVarTuple`).
fa: اگر نام مستعار با استفاده از عملگر ``*`` باز شده باشد، درست است (به :data:`~typing.TypeVarTuple` مراجعه کنید).
ru: Логическое значение, имеющее значение true, если псевдоним был распакован с помощью ``*`` оператор (см. :data:`~typing.TypeVarTuple` ).

source: :pep:`484` - Type Hints
fa: :pep:`484` - نکات را تایپ کنید
ru: :pep:`484` - Тип подсказка
uk: :pep:`484` - підказки типу

source: Introducing Python's framework for type annotations.
fa: معرفی چارچوب پایتون برای حاشیه نویسی نوع.
ru: Знакомство с платформой Python для аннотаций типов.
uk: Представляємо структуру Python для анотацій типів.

source: :pep:`585` - Type Hinting Generics In Standard Collections
fa: :pep:`585` - Hinting Generics را در مجموعه های استاندارد تایپ کنید
ru: :pep:`585` - Обобщенные типы хинтинга в стандартных коллекциях
uk: :pep:`585` - Універсальні підказки типів у стандартних колекціях

source: Introducing the ability to natively parameterize standard-library classes, provided they implement the special class method :meth:`~object.__class_getitem__`.
fa: معرفی قابلیت پارامترسازی بومی کلاس‌های کتابخانه استاندارد، مشروط بر اینکه متد کلاس ویژه :meth:`~object.__class_getitem__` را پیاده‌سازی کنند.
ru: Представление возможности параметризации классов стандартной библиотеки при условии, что они реализуют специальный метод класса. :meth:`~object.__class_getitem__` .
uk: Представляємо можливість нативної параметризації класів стандартної бібліотеки, якщо вони реалізують спеціальний метод класу :meth:`~object.__class_getitem__`.

source: :ref:`Generics`, :ref:`user-defined generics <user-defined-generics>` and :class:`typing.Generic`
fa: :ref:`Generics`، :ref:`user-defined generics <user-defined-generics>` و :class:`typing.Generic`
ru: :ref:`Дженериксы` , :ref:`определяемые пользователем дженерики ` и :class:`типирование.Общий`
uk: :ref:`Generics`, :ref:`визначені користувачем узагальнення <user-defined-generics>` і :class:`typing.Generic`

source: Documentation on how to implement generic classes that can be parameterized at runtime and understood by static type-checkers.
fa: مستنداتی در مورد نحوه پیاده‌سازی کلاس‌های عمومی که می‌توانند در زمان اجرا پارامتری شوند و توسط چک‌کننده‌های نوع استاتیک درک شوند.
uk: Документація про те, як реалізувати загальні класи, які можна параметризувати під час виконання та розуміти статичними засобами перевірки типів.

source: Union Type
fa: نوع اتحادیه
ru: Тип союза
uk: Тип союзу

source: A union object holds the value of the ``|`` (bitwise or) operation on multiple :ref:`type objects <bltin-type-objects>`. These types are intended primarily for :term:`type annotations <annotation>`. The union type expression enables cleaner type hinting syntax compared to :data:`typing.Union`.
fa: یک شی اتحادیه مقدار عملیات ``|`` (بیتی یا) را روی چند :ref:`type objects <bltin-type-objects>` نگه می دارد. این نوع در درجه اول برای :term:`type annotations <annotation>` در نظر گرفته شده است. عبارت union type syntax نوع تمیزتر را در مقایسه با :data:`typing.Union` فعال می کند.
ru: Объект объединения содержит значение ``|`` (побитовое или) операция над несколькими объектами типа :ref:` `. Эти типы предназначены в первую очередь для аннотаций типов.`. Выражение типа объединения обеспечивает более чистый синтаксис подсказок типов по сравнению с :data:`typing.Union` .
uk: Об’єкт об’єднання містить значення операції ``|`` (порозрядної або) на кількох :ref:`об’єктах типу <bltin-type-objects>`. Ці типи призначені насамперед для :term:`анотацій типу <annotation>`. Вираз типу об’єднання забезпечує чіткіший синтаксис підказки типу порівняно з :data:`typing.Union`.

source: Defines a union object which holds types *X*, *Y*, and so forth. ``X | Y`` means either X or Y. It is equivalent to ``typing.Union[X, Y]``. For example, the following function expects an argument of type :class:`int` or :class:`float`::
fa: یک شیء اتحاد را تعریف می کند که دارای انواع *X*، *Y* و غیره است. ``X | Y`` به معنای X یا Y است. معادل ``typing.Union[X, Y]`` است. به عنوان مثال، تابع زیر یک آرگومان از نوع :class:`int` یا :class:`float` را انتظار دارد:
ru: Определяет объект объединения, содержащий типы *X*, *Y* и т. д. `` Х | И `` означает либо X, либо Y. Это эквивалентно ``типирование.Объединение[X, Y]`` . Например, следующая функция ожидает аргумент типа :класс:`int` или :class:`плавать` ::
uk: Визначає об’єкт об’єднання, який містить типи *X*, *Y* і так далі. ``X | Y`` означає X або Y. Це еквівалентно ``typing.Union[X, Y]``. Наприклад, наступна функція очікує аргумент типу :class:`int` або :class:`float`::

source: The ``|`` operand cannot be used at runtime to define unions where one or more members is a forward reference. For example, ``int | "Foo"``, where ``"Foo"`` is a reference to a class not yet defined, will fail at runtime. For unions which include forward references, present the whole expression as a string, e.g. ``"int | Foo"``.
fa: عملوند ``|`` را نمی توان در زمان اجرا برای تعریف اتحادیه هایی که در آن یک یا چند عضو مرجع پیشرو هستند استفاده کرد. به عنوان مثال، ``int | "Foo"``، که در آن ``"Foo"`` ارجاع به کلاسی است که هنوز تعریف نشده است، در زمان اجرا با شکست مواجه خواهد شد. برای اتحادیه هایی که شامل ارجاعات رو به جلو هستند، کل عبارت را به عنوان یک رشته ارائه کنید، به عنوان مثال. ``"int | Foo"``.
ru: The ``|`` операнд нельзя использовать во время выполнения для определения объединений, в которых один или несколько членов являются прямой ссылкой. Например, ``интервал | "Фу"`` , где ``"Фу"`` является ссылкой на еще не определенный класс, произойдет сбой во время выполнения. Для объединений, которые включают прямые ссылки, представьте все выражение в виде строки, например ``"int | Фу"`` .

source: Union objects can be tested for equality with other union objects. Details:
fa: اشیاء اتحادیه را می توان برای برابری با سایر اشیاء اتحادیه آزمایش کرد. جزئیات:
ru: Объекты объединения можно проверить на равенство с другими объектами объединения. Подробности:
uk: Об’єкти об’єднання можна перевірити на рівність з іншими об’єктами об’єднання. Подробиці:

source: Unions of unions are flattened::
fa: اتحادیه های اتحادیه ها مسطح می شوند::
ru: Союзы союзов сглажены::
uk: Союзи союзів сплощені::

source: Redundant types are removed::
fa: انواع اضافی حذف می شوند:
ru: Лишние типы удалены:
uk: Зайві типи видаляються:

source: When comparing unions, the order is ignored::
fa: هنگام مقایسه اتحادیه ها، ترتیب نادیده گرفته می شود::
ru: При сравнении объединений порядок игнорируется::
uk: Під час порівняння об'єднань порядок ігнорується:

source: It is compatible with :data:`typing.Union`::
fa: با :data:`typing.Union` سازگار است::
ru: Он совместим с :data:`typing.Union` ::
uk: Він сумісний з :data:`typing.Union`::

source: Optional types can be spelled as a union with ``None``::
fa: انواع اختیاری را می توان به صورت یک اتحاد با ``None`` نوشت::
ru: Необязательные типы могут быть записаны как объединение с ``Нет`` ::
uk: Необов'язкові типи можуть бути написані як об'єднання з ``None``::

source: Calls to :func:`isinstance` and :func:`issubclass` are also supported with a union object::
fa: فراخوانی به :func:`isinstance` و :func:`issubclass` نیز با یک شی اتحادیه پشتیبانی می شود:
ru: Звонки в :func:`isinstance` и :func:`issubclass` также поддерживаются с помощью объекта объединения::
uk: Виклики :func:`isinstance` і :func:`issubclass` також підтримуються з об’єктом об’єднання::

source: However, :ref:`parameterized generics <types-genericalias>` in union objects cannot be checked::
fa: با این حال، :ref:`parameterized generics <types-genericalias>` در اشیاء اتحادیه قابل بررسی نیست:
ru: Однако :ref:`параметризованные дженерики ` в объектах объединения невозможно проверить::

source: >>> isinstance(1, int | list[int]) # short-circuit evaluation True >>> isinstance([1], int | list[int]) Traceback (most recent call last): ... TypeError: isinstance() argument 2 cannot be a parameterized generic
fa: >>> ininstance(1, int | list[int]) # ارزیابی اتصال کوتاه درست است >>> instance([1], int | list[int]) ردیابی (آخرین تماس اخیر): ... TypeError: آرگومان 2 ()instance نمی تواند یک پارامتر عمومی باشد

source: The user-exposed type for the union object can be accessed from :data:`types.UnionType` and used for :func:`isinstance` checks. An object cannot be instantiated from the type::
fa: نوع در معرض کاربر برای شی اتحاد می تواند از :data:`types.UnionType` دسترسی داشته باشد و برای بررسی های :func:`isinstance` استفاده شود. یک شی را نمی توان از نوع::
ru: Доступ к пользовательскому типу объекта объединения можно получить из :data:`types.UnionType` и используется для :func:`isinstance` чеки. Объект не может быть создан из типа::
uk: Доступ до відкритого користувачем типу для об’єкта union можна отримати з :data:`types.UnionType` і використовувати для перевірки :func:`isinstance`. Об’єкт не може бути створений із типу::

source: >>> import types >>> isinstance(int | str, types.UnionType) True >>> types.UnionType() Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: cannot create 'types.UnionType' instances
fa: >>> انواع واردات >>> ininstance(int | str, type.UnionType) درست است >>> type.UnionType() ردیابی (آخرین تماس اخیر): فایل "<stdin>", خط 1، در <module> TypeError: نمی تواند نمونه های 'types.UnionType' ایجاد کند

source: The :meth:`!__or__` method for type objects was added to support the syntax ``X | Y``. If a metaclass implements :meth:`!__or__`, the Union may override it:
fa: روش :meth:`!__or__` برای اشیاء نوع برای پشتیبانی از نحو ``X | Y`` اضافه شد. اگر متاکلاس :meth:`!__or__` را پیاده سازی کند، اتحادیه ممکن است آن را لغو کند:
ru: The :meth:`!__or__` добавлен метод для объектов типа для поддержки синтаксиса `` Х | И `` . Если метакласс реализует :meth:`!__or__` , Союз может отменить это:

source: :pep:`604` -- PEP proposing the ``X | Y`` syntax and the Union type.
fa: :pep:`604` -- PEP دستور ``X | Y`` و نوع Union را پیشنهاد می کند.
ru: :pep:`604` -- PEP предлагает `` Х | И `` синтаксис и тип Union.
uk: :pep:`604` -- PEP пропонує ``X | Синтаксис Y`` і тип Union.

source: Other Built-in Types
fa: سایر انواع داخلی
ru: Другие встроенные типы
uk: Інші вбудовані типи

source: The interpreter supports several other kinds of objects. Most of these support only one or two operations.
fa: مفسر از چندین نوع شیء دیگر پشتیبانی می کند. اکثر اینها فقط یک یا دو عملیات را پشتیبانی می کنند.
ru: Интерпретатор поддерживает несколько других типов объектов. Большинство из них поддерживают только одну или две операции.
uk: Інтерпретатор підтримує кілька інших видів об'єктів. Більшість із них підтримує лише одну або дві операції.

source: Modules
fa: ماژول ها
ru: Модули
uk: Модулі

source: The only special operation on a module is attribute access: ``m.name``, where *m* is a module and *name* accesses a name defined in *m*'s symbol table. Module attributes can be assigned to. (Note that the :keyword:`import` statement is not, strictly speaking, an operation on a module object; ``import foo`` does not require a module object named *foo* to exist, rather it requires an (external) *definition* for a module named *foo* somewhere.)
fa: تنها عملیات ویژه در یک ماژول دسترسی به ویژگی است: ``m.name``، که در آن *m* یک ماژول است و *name* به نامی که در جدول نماد *m* تعریف شده است دسترسی پیدا می کند. ویژگی های ماژول را می توان به آن اختصاص داد. (توجه داشته باشید که دستور :keyword:`import`, به طور دقیق, عملیاتی بر روی یک شی ماژول نیست؛ ``import foo`` برای وجود شی ماژول به نام *foo* نیازی ندارد, بلکه به یک *definition* (خارجی) برای ماژولی به نام *foo* در جایی نیاز دارد.)
ru: Единственная специальная операция над модулем — это доступ к атрибутам: ``m.name`` , где *m* — модуль, а *name* обращается к имени, определенному в таблице символов *m*. Атрибуты модуля могут быть назначены. (Обратите внимание, что :keyword:`импорт` Строго говоря, оператор не является операцией над объектом модуля; ``импортировать foo`` не требует существования объекта модуля с именем *foo*, скорее требуется (внешнее) *определение* для модуля с именем *foo* где-то.)
uk: Єдиною спеціальною операцією над модулем є доступ до атрибутів: ``m.name``, де *m* — це модуль, а *name* отримує доступ до імені, визначеного в таблиці символів *m*. Модулю можна призначити атрибути. (Зауважте, що оператор :keyword:`import` не є, строго кажучи, операцією над об’єктом модуля; ``import foo`` не вимагає існування об’єкта модуля з назвою *foo*, скоріше для цього потрібен (зовнішній) *визначення* для модуля з назвою *foo* десь.)

source: A special attribute of every module is :attr:`~object.__dict__`. This is the dictionary containing the module's symbol table. Modifying this dictionary will actually change the module's symbol table, but direct assignment to the :attr:`~object.__dict__` attribute is not possible (you can write ``m.__dict__['a'] = 1``, which defines ``m.a`` to be ``1``, but you can't write ``m.__dict__ = {}``). Modifying :attr:`~object.__dict__` directly is not recommended.
fa: ویژگی خاص هر ماژول :attr:`~object.__dict__` است. این فرهنگ لغت حاوی جدول نماد ماژول است. اصلاح این فرهنگ لغت در واقع جدول نماد ماژول را تغییر می دهد، اما انتساب مستقیم به ویژگی :attr:`~object.__dict__` امکان پذیر نیست (شما می توانید ``m.__dict__['a'] = 1`` را بنویسید که ``m.a`` را ``1`` تعریف می کند, اما نمی توانید ``m.__dict__ = {}`` بنویسید). تغییر مستقیم :attr:`~object.__dict__` توصیه نمی شود.
ru: Особым атрибутом каждого модуля является :attr:`~object.__dict__` . Это словарь, содержащий таблицу символов модуля. Изменение этого словаря фактически изменит таблицу символов модуля, но прямое присвоение :attr:`~object.__dict__` атрибут невозможен (вы можете написать ``m.__dict__['a'] = 1`` , который определяет ``ма`` быть ``1`` , но ты не можешь написать ``m.__dict__ = {}`` ). Модификация :attr:`~object.__dict__` напрямую не рекомендуется.
uk: Спеціальним атрибутом кожного модуля є :attr:`~object.__dict__`. Це словник, що містить таблицю символів модуля. Зміна цього словника фактично змінить таблицю символів модуля, але пряме призначення атрибуту :attr:`~object.__dict__` неможливо (ви можете написати ``m.__dict__['a'] = 1``, що визначає ``m.a`` буде ``1``, але ви не можете написати ``m.__dict__ = {}``). Не рекомендується безпосередньо змінювати :attr:`~object.__dict__`.

source: Modules built into the interpreter are written like this: ``<module 'sys' (built-in)>``. If loaded from a file, they are written as ``<module 'os' from '/usr/local/lib/pythonX.Y/os.pyc'>``.
fa: ماژول های تعبیه شده در مفسر به این صورت نوشته می شوند: ``<module 'sys' (built-in)>``. اگر از یک فایل بارگذاری شوند، به صورت ``<module 'os' from '/usr/local/lib/pythonX.Y/os.pyc'>`` نوشته می شوند.
ru: Модули, встроенные в интерпретатор, пишутся так: ``<модуль 'sys' (встроенный)>`` . Если они загружены из файла, они записываются как ``<модуль 'os' из '/usr/local/lib/pythonX.Y/os.pyc'>`` .
uk: Модулі, вбудовані в інтерпретатор, записуються так: ``<module 'sys' (built-in)>``. Якщо завантажуються з файлу, вони записуються як ``<module 'os' from '/usr/local/lib/pythonX.Y/os.pyc'>``.

source: Classes and Class Instances
fa: کلاس ها و نمونه های کلاس
ru: Классы и экземпляры классов
uk: Класи та екземпляри класів

source: See :ref:`objects` and :ref:`class` for these.
fa: برای این موارد به :ref:`objects` و :ref:`class` مراجعه کنید.
ru: Видеть :ref:`объекты` и :ref:`класс` для этих.
uk: Перегляньте :ref:`objects` і :ref:`class` для них.

source: Functions
fa: توابع
ru: Функции
uk: Функції

source: Function objects are created by function definitions. The only operation on a function object is to call it: ``func(argument-list)``.
fa: اشیاء تابع توسط تعاریف تابع ایجاد می شوند. تنها عملیات روی یک شی تابع فراخوانی آن است: ``func(argument-list)``.
ru: Объекты функций создаются определениями функций. Единственная операция над функциональным объектом — это его вызов: ``func(список-аргументов)`` .
uk: Функціональні об’єкти створюються визначеннями функцій. Єдина операція над об’єктом-функцією – це викликати його: ``func(список-аргументів)``.

source: There are really two flavors of function objects: built-in functions and user-defined functions. Both support the same operation (to call the function), but the implementation is different, hence the different object types.
fa: در واقع دو نوع شیء تابع وجود دارد: توابع داخلی و توابع تعریف شده توسط کاربر. هر دو از یک عملیات (برای فراخوانی تابع) پشتیبانی می کنند، اما پیاده سازی متفاوت است، بنابراین انواع شی متفاوت است.
ru: На самом деле существует два типа функциональных объектов: встроенные функции и пользовательские функции. Оба поддерживают одну и ту же операцию (вызов функции), но реализация разная, отсюда и разные типы объектов.
uk: Насправді існує два види функціональних об’єктів: вбудовані функції та функції, визначені користувачем. Обидва підтримують однакову операцію (виклик функції), але реалізація різна, отже, різні типи об’єктів.

source: See :ref:`function` for more information.
fa: برای اطلاعات بیشتر به :ref:`function` مراجعه کنید.
ru: Видеть :ref:`функция` для получения дополнительной информации.
uk: Перегляньте :ref:`function` для отримання додаткової інформації.

source: Methods
fa: روش ها
ru: Методы
uk: методи

source: Methods are functions that are called using the attribute notation. There are two flavors: :ref:`built-in methods <builtin-methods>` (such as :meth:`append` on lists) and :ref:`class instance method <instance-methods>`. Built-in methods are described with the types that support them.
fa: متدها توابعی هستند که با استفاده از نماد مشخصه فراخوانی می شوند. دو طعم وجود دارد: :ref:`built-in methods <builtin-methods>` (مانند :meth:`append` در لیست ها) و :ref:`class instance method <instance-methods>`. روش های داخلی با انواعی که از آنها پشتیبانی می کنند توضیح داده شده اند.
ru: Методы — это функции, которые вызываются с использованием нотации атрибута. Есть два варианта: :ref:`встроенные методы ` (например, :meth:`добавить` в списках) и метод экземпляра класса.`. Встроенные методы описываются типами, которые их поддерживают.

source: If you access a method (a function defined in a class namespace) through an instance, you get a special object: a :dfn:`bound method` (also called :ref:`instance method <instance-methods>`) object. When called, it will add the ``self`` argument to the argument list. Bound methods have two special read-only attributes: :attr:`m.__self__ <method.__self__>` is the object on which the method operates, and :attr:`m.__func__ <method.__func__>` is the function implementing the method. Calling ``m(arg-1, arg-2, ..., arg-n)`` is completely equivalent to calling ``m.__func__(m.__self__, arg-1, arg-2, ..., arg-n)``.
fa: اگر از طریق یک نمونه به یک متد (یک تابع تعریف‌شده در فضای نام کلاس) دسترسی داشته باشید، یک شی خاص دریافت می‌کنید: یک شی :dfn:`bound method` (که همچنین به عنوان :ref:`instance method <instance-methods>` شناخته می‌شود). هنگام فراخوانی، آرگومان ``self`` به لیست آرگومان اضافه می‌شود. متدهای bound دارای دو ویژگی فقط خواندنی هستند: :attr:`m.__self__ <method.__self__>` شی‌ای است که متد بر روی آن عمل می‌کند و :attr:`m.__func__ <method.__func__>` تابع پیاده‌سازی‌کننده متد می‌باشد. فراخوانی ``m(arg-1, arg-2, ..., arg-n)`` کاملاً معادل فراخوانی ``m.__func__(m.__self__, arg-1, arg-2, ..., arg-n)`` است.
ru: Если вы получаете доступ к методу (функции, определенной в пространстве имен класса) через экземпляр, вы получаете специальный объект: :dfn:`связанный метод` (также называемый :ref:`метод экземпляра). `) объект. При вызове он добавит ``сам`` аргумент в список аргументов. Привязанные методы имеют два специальных атрибута, доступных только для чтения: :attr:`m.__self__. <method.__self__>` — это объект, с которым работает метод, а :attr:`m.__func__ <method.__func__>` — это функция, реализующая метод. Вызов ``m(arg-1, arg-2, ..., arg-n)`` полностью эквивалентно вызову ``m.__func__(m.__self__, arg-1, arg-2, ..., arg-n)`` .

source: Like :ref:`function objects <user-defined-funcs>`, bound method objects support getting arbitrary attributes. However, since method attributes are actually stored on the underlying function object (:attr:`method.__func__`), setting method attributes on bound methods is disallowed. Attempting to set an attribute on a method results in an :exc:`AttributeError` being raised. In order to set a method attribute, you need to explicitly set it on the underlying function object:
fa: مانند :ref:`function objects <user-defined-funcs>`، اشیاء متد محدود از دریافت ویژگی‌های دلخواه پشتیبانی می‌کنند. با این حال، از آنجایی که ویژگی‌های متد در واقع روی شی تابع زیرین (:attr:`method.__func__`) ذخیره می‌شوند، تنظیم ویژگی‌های متد در روش‌های محدود مجاز نیست. تلاش برای تنظیم یک ویژگی در یک متد منجر به افزایش :exc:`AttributeError` می شود. برای تنظیم یک ویژگی متد، باید آن را به صراحت روی شی تابع زیرین تنظیم کنید:
ru: Как :ref:`функциональные объекты `, привязанные объекты метода поддерживают получение произвольных атрибутов. Однако, поскольку атрибуты метода фактически хранятся в базовом объекте функции ( :attr:`method.__func__` ), установка атрибутов метода для связанных методов запрещена. Попытка установить атрибут метода приводит к :exc:`AttributeError` воспитывается. Чтобы установить атрибут метода, вам необходимо явно установить его в базовом объекте функции:

source: >>> class C: ... def method(self): ... pass ... >>> c = C() >>> c.method.whoami = 'my name is method' # can't set on the method Traceback (most recent call last): File "<stdin>", line 1, in <module> AttributeError: 'method' object has no attribute 'whoami' >>> c.method.__func__.whoami = 'my name is method' >>> c.method.whoami 'my name is method'
fa: >>> کلاس C: ... روش دف (خود): ... بگذرد ... >>> c = C() >>> c.method.whoami = 'نام من روش است' # نمی تواند روی متد تنظیم شود ردیابی (آخرین تماس اخیر): فایل "<stdin>", خط 1، در <module> AttributeError: شی «method» هیچ ویژگی «whoami» ندارد >>> c.method.__func__.whoami = 'نام من روش است' >>> c.method.whoami "اسم من روش است"

source: See :ref:`instance-methods` for more information.
fa: برای اطلاعات بیشتر به :ref:`instance-methods` مراجعه کنید.
ru: Видеть :ref:`методы экземпляра` для получения дополнительной информации.

source: Code Objects
fa: اشیاء کد
ru: Объекты кода
uk: Об'єкти коду
