Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: fa, ru, uk

source: Since 2 hexadecimal digits correspond precisely to a single byte, hexadecimal numbers are a commonly used format for describing binary data. Accordingly, the bytes type has an additional class method to read data in that format:
fa: از آنجایی که 2 رقم هگزادسیمال دقیقاً با یک بایت مطابقت دارد، اعداد هگزادسیمال فرمت رایجی برای توصیف داده های باینری هستند. بر این اساس، نوع بایت دارای یک متد کلاس اضافی برای خواندن داده ها در آن قالب است:
ru: Поскольку две шестнадцатеричные цифры точно соответствуют одному байту, шестнадцатеричные числа являются широко используемым форматом для описания двоичных данных. Соответственно, тип bytes имеет дополнительный метод класса для чтения данных в этом формате:
uk: Оскільки 2 шістнадцяткові цифри точно відповідають одному байту, шістнадцяткові числа є широко використовуваним форматом для опису двійкових даних. Відповідно, тип bytes має додатковий метод класу для читання даних у цьому форматі:

source: This :class:`bytes` class method returns a bytes object, decoding the given string object. The string must contain two hexadecimal digits per byte, with ASCII whitespace being ignored.
fa: این متد کلاس :class:`bytes` یک شی بایت را برمی گرداند و شی رشته داده شده را رمزگشایی می کند. رشته باید دارای دو رقم هگزا دسیمال در هر بایت باشد و فضای سفید ASCII نادیده گرفته شود.
ru: Этот :class:`байты` Метод класса возвращает объект байтов, декодируя заданный строковый объект. Строка должна содержать две шестнадцатеричные цифры на байт, при этом пробелы ASCII игнорируются.
uk: Цей метод класу :class:`bytes` повертає об’єкт bytes, декодуючи даний рядковий об’єкт. Рядок має містити дві шістнадцяткові цифри на байт, при цьому пробіли ASCII ігноруються.

source: :meth:`bytes.fromhex` now skips all ASCII whitespace in the string, not just spaces.
fa: اکنون :meth:`bytes.fromhex` از تمام فضاهای سفید ASCII در رشته صرفنظر می کند، نه فقط فضاها.
ru: :meth:`bytes.fromhex` теперь пропускает все пробелы ASCII в строке, а не только пробелы.
uk: :meth:`bytes.fromhex` тепер пропускає всі пробіли ASCII у рядку, а не лише пробіли.

source: A reverse conversion function exists to transform a bytes object into its hexadecimal representation.
fa: یک تابع تبدیل معکوس برای تبدیل یک شی بایت به نمایش هگزادسیمال آن وجود دارد.
ru: Существует функция обратного преобразования для преобразования байтового объекта в его шестнадцатеричное представление.
uk: Існує функція зворотного перетворення для перетворення об’єкта байтів у його шістнадцяткове представлення.

source: Return a string object containing two hexadecimal digits for each byte in the instance.
fa: یک شی رشته حاوی دو رقم هگزا دسیمال برای هر بایت موجود در نمونه برگردانید.
ru: Возвращает строковый объект, содержащий две шестнадцатеричные цифры для каждого байта экземпляра.
uk: Повертає рядковий об’єкт, що містить дві шістнадцяткові цифри для кожного байта екземпляра.

source: If you want to make the hex string easier to read, you can specify a single character separator *sep* parameter to include in the output. By default, this separator will be included between each byte. A second optional *bytes_per_sep* parameter controls the spacing. Positive values calculate the separator position from the right, negative values from the left.
fa: اگر می‌خواهید خوانش رشته هگزا را آسان‌تر کنید، می‌توانید یک پارامتر جداکننده نویسه *sep* را برای درج در خروجی مشخص کنید. به طور پیش فرض، این جداکننده بین هر بایت قرار می گیرد. دومین پارامتر اختیاری *bytes_per_sep* فاصله را کنترل می کند. مقادیر مثبت موقعیت جداکننده را از سمت راست و مقادیر منفی از سمت چپ محاسبه می کنند.
ru: Если вы хотите облегчить чтение шестнадцатеричной строки, вы можете указать один параметр-разделитель символов *sep* для включения в выходные данные. По умолчанию этот разделитель будет включен между каждым байтом. Второй необязательный параметр *bytes_per_sep* управляет интервалом. Положительные значения вычисляют положение разделителя справа, отрицательные значения — слева.

source: :meth:`bytes.hex` now supports optional *sep* and *bytes_per_sep* parameters to insert separators between bytes in the hex output.
fa: :meth:`bytes.hex` اکنون از پارامترهای اختیاری *sep* و *bytes_per_sep* برای قرار دادن جداکننده ها بین بایت ها در خروجی هگز پشتیبانی می کند.
ru: :meth:`bytes.hex` теперь поддерживает дополнительные параметры *sep* и *bytes_per_sep* для вставки разделителей между байтами в шестнадцатеричном выводе.
uk: :meth:`bytes.hex` тепер підтримує додаткові параметри *sep* і *bytes_per_sep* для вставки роздільників між байтами в шістнадцятковому виведенні.

source: Since bytes objects are sequences of integers (akin to a tuple), for a bytes object *b*, ``b[0]`` will be an integer, while ``b[0:1]`` will be a bytes object of length 1. (This contrasts with text strings, where both indexing and slicing will produce a string of length 1)
fa: از آنجایی که اشیاء بایت دنباله ای از اعداد صحیح هستند (مشابه یک تاپلی), برای یک شی بایتی *b*، ``b[0]`` یک عدد صحیح خواهد بود، در حالی که ``b[0:1]`` یک شی بایت به طول 1 خواهد بود. (این در تضاد با رشته های متنی است, جایی که هر دو نمایه سازی و برش رشته ای به طول 1 تولید می کنند)
ru: Поскольку объекты bytes представляют собой последовательности целых чисел (сродни кортежу), для объекта bytes *b*, ``b[0]`` будет целым числом, а ``б[0:1]`` будет байтовым объектом длиной 1. (Это контрастирует с текстовыми строками, где индексация и нарезка создают строку длины 1)
uk: Оскільки об’єкти bytes — це послідовності цілих чисел (подібно до кортежу), для об’єкта bytes *b* "b[0]" буде цілим числом, тоді як "b[0:1]" буде байтом об’єкт довжини 1. (Це контрастує з текстовими рядками, де як індексування, так і нарізка створять рядок довжиною 1)

source: The representation of bytes objects uses the literal format (``b'...'``) since it is often more useful than e.g. ``bytes([46, 46, 46])``. You can always convert a bytes object into a list of integers using ``list(b)``.
fa: نمایش اشیاء بایت از فرمت تحت اللفظی (``b'...'``) استفاده می کند زیرا اغلب مفیدتر از مثال است. ``bytes([46, 46, 46])``. همیشه می توانید با استفاده از ``list(b)`` یک شی بایت را به لیستی از اعداد صحیح تبدیل کنید.
ru: Представление объектов байтов использует литеральный формат ( ``б'...'`` ), так как это часто более полезно, чем, например, ``байты([46, 46, 46])`` . Вы всегда можете преобразовать объект байтов в список целых чисел, используя ``список(б)`` .
uk: Для представлення об’єктів bytes використовується літеральний формат (``b'...''``), оскільки він часто корисніший, ніж, наприклад, ``bytes([46, 46, 46])``. Ви завжди можете перетворити об’єкт bytes на список цілих чисел за допомогою ``list(b)``.

source: Bytearray Objects
fa: اشیاء بایت آرایه
ru: Объекты байтовых массивов
uk: Об’єкти байтового масиву

source: :class:`bytearray` objects are a mutable counterpart to :class:`bytes` objects.
fa: اشیاء :class:`bytearray` همتای قابل تغییر برای اشیاء :class:`bytes` هستند.
ru: :class:`bytearray` объекты являются изменяемым аналогом :class:`байты` объекты.
uk: Об’єкти :class:`bytearray` є змінними аналогами об’єктів :class:`bytes`.

source: There is no dedicated literal syntax for bytearray objects, instead they are always created by calling the constructor:
fa: هیچ نحو اختصاصی اختصاصی برای اشیاء بایت آرایه وجود ندارد، در عوض آنها همیشه با فراخوانی سازنده ایجاد می شوند:
ru: Для объектов bytearray не существует специального синтаксиса литералов, вместо этого они всегда создаются путем вызова конструктора:
uk: Для об’єктів bytearray немає виділеного синтаксису літералів, натомість вони завжди створюються шляхом виклику конструктора:

source: Creating an empty instance: ``bytearray()``
fa: ایجاد یک نمونه خالی: ``bytearray()``
ru: Создание пустого экземпляра: ``bytearray()``
uk: Створення порожнього екземпляра: ``bytearray()``

source: Creating a zero-filled instance with a given length: ``bytearray(10)``
fa: ایجاد یک نمونه پر از صفر با طول معین: ``bytearray(10)``
ru: Создание заполненного нулями экземпляра заданной длины: ``bytearray(10)``
uk: Створення екземпляра із заповненням нуля із заданою довжиною: ``bytearray(10)``

source: From an iterable of integers: ``bytearray(range(20))``
fa: از یک تکرارپذیر از اعداد صحیح: ``bytearray(range(20))``
ru: Из итерации целых чисел: ``bytearray(диапазон(20))``
uk: З ітерації цілих чисел: ``bytearray(range(20))``

source: Copying existing binary data via the buffer protocol: ``bytearray(b'Hi!')``
fa: کپی کردن داده های باینری موجود از طریق پروتکل بافر: ``bytearray(b'Hi!')``
ru: Копирование существующих двоичных данных через протокол буфера: ``bytearray(b'Привет!')``
uk: Копіювання наявних двійкових даних за допомогою буферного протоколу: ``bytearray(b'Hi!')``

source: As bytearray objects are mutable, they support the :ref:`mutable <typesseq-mutable>` sequence operations in addition to the common bytes and bytearray operations described in :ref:`bytes-methods`.
fa: از آنجایی که اشیاء بایت آرایه قابل تغییر هستند، از عملیات توالی :ref:`mutable <typesseq-mutable>` علاوه بر بایت های رایج و عملیات بایت آرایه که در :ref:`bytes-methods` توضیح داده شده است، پشتیبانی می کنند.
ru: Поскольку объекты bytearray являются изменяемыми, они поддерживают :ref:`mutable ` операции с последовательностями в дополнение к обычным операциям с байтами и байтовыми массивами, описанным в :ref:`байтовые-методы` .
uk: Оскільки об’єкти bytearray є змінними, вони підтримують операції послідовності :ref:`mutable <typesseq-mutable>` на додаток до звичайних операцій з байтами та байтовими масивами, описаних у :ref:`bytes-methods`.

source: Also see the :ref:`bytearray <func-bytearray>` built-in.
fa: همچنین :ref:`bytearray <func-bytearray>` داخلی را ببینید.
ru: Также см. :ref:`bytearray ` встроенный.
uk: Також перегляньте вбудований :ref:`bytearray <func-bytearray>`.

source: Since 2 hexadecimal digits correspond precisely to a single byte, hexadecimal numbers are a commonly used format for describing binary data. Accordingly, the bytearray type has an additional class method to read data in that format:
fa: از آنجایی که 2 رقم هگزادسیمال دقیقاً با یک بایت مطابقت دارد، اعداد هگزادسیمال فرمت رایجی برای توصیف داده های باینری هستند. بر این اساس، نوع بایت آرایه یک متد کلاس اضافی برای خواندن داده ها در آن قالب دارد:
ru: Поскольку две шестнадцатеричные цифры точно соответствуют одному байту, шестнадцатеричные числа являются широко используемым форматом для описания двоичных данных. Соответственно, тип bytearray имеет дополнительный метод класса для чтения данных в этом формате:
uk: Оскільки 2 шістнадцяткові цифри точно відповідають одному байту, шістнадцяткові числа є широко використовуваним форматом для опису двійкових даних. Відповідно, тип bytearray має додатковий метод класу для читання даних у цьому форматі:

source: This :class:`bytearray` class method returns bytearray object, decoding the given string object. The string must contain two hexadecimal digits per byte, with ASCII whitespace being ignored.
fa: این متد کلاس :class:`bytearray` شی بایت آرایه را برمی گرداند و شی رشته داده شده را رمزگشایی می کند. رشته باید شامل دو رقم هگزا دسیمال در هر بایت باشد و فضای سفید ASCII نادیده گرفته شود.
ru: Этот :class:`bytearray` Метод класса возвращает объект bytearray, декодируя заданный строковый объект. Строка должна содержать две шестнадцатеричные цифры на байт, при этом пробелы ASCII игнорируются.
uk: Цей метод класу :class:`bytearray` повертає об’єкт bytearray, декодуючи заданий рядковий об’єкт. Рядок має містити дві шістнадцяткові цифри на байт, при цьому пробіли ASCII ігноруються.

source: :meth:`bytearray.fromhex` now skips all ASCII whitespace in the string, not just spaces.
fa: اکنون :meth:`bytearray.fromhex` از تمام فضاهای سفید ASCII در رشته صرفنظر می کند، نه فقط فضاها.
ru: :meth:`bytearray.fromhex` теперь пропускает все пробелы ASCII в строке, а не только пробелы.
uk: :meth:`bytearray.fromhex` тепер пропускає всі пробіли ASCII у рядку, а не лише пробіли.

source: A reverse conversion function exists to transform a bytearray object into its hexadecimal representation.
fa: یک تابع تبدیل معکوس برای تبدیل یک شی بایت آرایه به نمایش هگزادسیمال آن وجود دارد.
ru: Существует функция обратного преобразования для преобразования объекта байтового массива в его шестнадцатеричное представление.
uk: Існує функція зворотного перетворення для перетворення об’єкта байтового масиву в його шістнадцяткове представлення.

source: Similar to :meth:`bytes.hex`, :meth:`bytearray.hex` now supports optional *sep* and *bytes_per_sep* parameters to insert separators between bytes in the hex output.
fa: مشابه :meth:`bytes.hex`، :meth:`bytearray.hex` اکنون از پارامترهای اختیاری *sep* و *bytes_per_sep* برای قرار دادن جداکننده ها بین بایت ها در خروجی هگز پشتیبانی می کند.
ru: Похоже на: :meth:`bytes.hex` , :meth:`bytearray.hex` теперь поддерживает дополнительные параметры *sep* и *bytes_per_sep* для вставки разделителей между байтами в шестнадцатеричном выводе.
uk: Подібно до :meth:`bytes.hex`, :meth:`bytearray.hex` тепер підтримує додаткові параметри *sep* і *bytes_per_sep* для вставки роздільників між байтами в шістнадцятковому виведенні.

source: Since bytearray objects are sequences of integers (akin to a list), for a bytearray object *b*, ``b[0]`` will be an integer, while ``b[0:1]`` will be a bytearray object of length 1. (This contrasts with text strings, where both indexing and slicing will produce a string of length 1)
fa: از آنجا که اشیاء بایت آرایه دنباله ای از اعداد صحیح هستند (مشابه یک لیست), برای یک شی بایت آرایه *b*، ``b[0]`` یک عدد صحیح خواهد بود، در حالی که ``b[0:1]`` یک شی آرایه بایتی به طول 1 خواهد بود.
ru: Поскольку объекты байтового массива представляют собой последовательности целых чисел (сродни списку), для объекта байтового массива *b*, ``b[0]`` будет целым числом, а ``б[0:1]`` будет объектом байтового массива длины 1. (Это контрастирует с текстовыми строками, где индексация и нарезка создают строку длины 1)
uk: Оскільки об’єкти bytearray — це послідовності цілих чисел (схожі на список), для об’єкта bytearray *b* "b[0]" буде цілим числом, а "b[0:1]" буде масивом bytearray об’єкт довжини 1. (Це контрастує з текстовими рядками, де як індексування, так і нарізка створять рядок довжиною 1)

source: The representation of bytearray objects uses the bytes literal format (``bytearray(b'...')``) since it is often more useful than e.g. ``bytearray([46, 46, 46])``. You can always convert a bytearray object into a list of integers using ``list(b)``.
fa: نمایش اشیاء بایت آرایه از فرمت تحت اللفظی بایت (``bytearray(b'...')``) استفاده می‌کند، زیرا اغلب مفیدتر از مانند مثال است. ``bytearray([46, 46, 46])``. همیشه می توانید یک شی بایت آرایه را با استفاده از ``list(b)`` به لیستی از اعداد صحیح تبدیل کنید.
ru: Для представления объектов bytearray используется литеральный формат байтов ( ``bytearray(b'...')`` ), так как это часто более полезно, чем, например, ``bytearray([46, 46, 46])`` . Вы всегда можете преобразовать объект bytearray в список целых чисел, используя ``список(б)`` .
uk: У представленні об’єктів bytearray використовується формат літералу bytes (``bytearray(b'...')``), оскільки він часто корисніший, ніж, наприклад, ``bytearray([46, 46, 46])``. Ви завжди можете перетворити об’єкт bytearray на список цілих чисел за допомогою ``list(b)``.

source: Bytes and Bytearray Operations
fa: بایت ها و عملیات بیت آرایه
ru: Байты и операции с байтовыми массивами
uk: Операції з байтами та масивом байтів

source: Both bytes and bytearray objects support the :ref:`common <typesseq-common>` sequence operations. They interoperate not just with operands of the same type, but with any :term:`bytes-like object`. Due to this flexibility, they can be freely mixed in operations without causing errors. However, the return type of the result may depend on the order of operands.
fa: هم بایت ها و هم اشیاء بایت آرایه از عملیات توالی :ref:`common <typesseq-common>` پشتیبانی می کنند. آنها نه تنها با عملوندهای هم نوع، بلکه با هر :term:`bytes-like object` تعامل دارند. با توجه به این انعطاف، می توان آنها را آزادانه در عملیات بدون ایجاد خطا مخلوط کرد. با این حال، نوع برگشتی نتیجه ممکن است به ترتیب عملوندها بستگی داشته باشد.
ru: Объекты bytes и bytearray поддерживают :ref:`common `последовательность операций. Они взаимодействуют не только с операндами одного и того же типа, но и с любым :term:`байтоподобным объектом`. Благодаря такой гибкости их можно свободно смешивать в операциях, не вызывая ошибок. Однако тип возвращаемого результата может зависеть от порядка операндов.
uk: Як об’єкти bytes, так і bytearray підтримують операції послідовності :ref:`common <typesseq-common>`. Вони взаємодіють не тільки з операндами того самого типу, але й з будь-яким :term:`bytes-like object`. Завдяки цій гнучкості їх можна вільно змішувати під час операцій, не викликаючи помилок. Однак тип результату може залежати від порядку операндів.

source: The methods on bytes and bytearray objects don't accept strings as their arguments, just as the methods on strings don't accept bytes as their arguments. For example, you have to write::
fa: متدهای روی بایت ها و اشیاء بایت آرگومان رشته ها را نمی پذیرند، همانطور که متدهای روی رشته ها بایت ها را به عنوان آرگومان های خود نمی پذیرند. برای مثال باید بنویسید:
ru: Методы объектов bytes и bytearray не принимают строки в качестве аргументов, так же как методы строк не принимают в качестве аргументов байты. Например, вам нужно написать::
uk: Методи для об’єктів bytes і bytearray не приймають рядки як аргументи, так само як методи для рядків не приймають байти як аргументи. Наприклад, ви повинні написати::

source: and::
fa: و::
ru: и::
uk: і::

source: Some bytes and bytearray operations assume the use of ASCII compatible binary formats, and hence should be avoided when working with arbitrary binary data. These restrictions are covered below.
fa: برخی از بایت‌ها و عملیات بایت آرایه استفاده از فرمت‌های باینری سازگار با ASCII را فرض می‌کنند و بنابراین هنگام کار با داده‌های باینری دلخواه باید از آنها اجتناب شود. این محدودیت ها در زیر پوشش داده شده است.
ru: Некоторые операции с байтами и массивами байтов предполагают использование двоичных форматов, совместимых с ASCII, и, следовательно, их следует избегать при работе с произвольными двоичными данными. Эти ограничения описаны ниже.
uk: Деякі операції з байтами та масивами байтів передбачають використання двійкових форматів, сумісних із ASCII, і тому їх слід уникати під час роботи з довільними двійковими даними. Ці обмеження описані нижче.

source: Using these ASCII based operations to manipulate binary data that is not stored in an ASCII based format may lead to data corruption.
fa: استفاده از این عملیات مبتنی بر ASCII برای دستکاری داده های باینری که در قالب ASCII ذخیره نشده اند ممکن است منجر به خراب شدن داده ها شود.
ru: Использование этих операций на основе ASCII для управления двоичными данными, которые не хранятся в формате на основе ASCII, может привести к повреждению данных.
uk: Використання цих операцій на основі ASCII для обробки двійкових даних, які не зберігаються у форматі на основі ASCII, може призвести до пошкодження даних.

source: The following methods on bytes and bytearray objects can be used with arbitrary binary data.
fa: روش های زیر بر روی بایت ها و اشیاء آرایه بایتی را می توان با داده های باینری دلخواه استفاده کرد.
ru: Следующие методы для байтов и объектов bytearray можно использовать с произвольными двоичными данными.
uk: Наступні методи для об’єктів bytes і bytearray можна використовувати з довільними двійковими даними.

source: Return the number of non-overlapping occurrences of subsequence *sub* in the range [*start*, *end*]. Optional arguments *start* and *end* are interpreted as in slice notation.
fa: تعداد رخدادهای غیر همپوشانی دنباله *sub* را در محدوده [*start*, *end*] برگردانید. آرگومان های اختیاری *start* و *end* به صورت نمادگذاری برش تفسیر می شوند.
ru: Возвращает количество непересекающихся вхождений подпоследовательности *sub* в диапазоне [*start*, *end*]. Необязательные аргументы *start* и *end* интерпретируются как в нотации среза.
uk: Повертає кількість неперекриваючих входжень підпослідовності *sub* у діапазоні [*початок*, *кінець*]. Необов’язкові аргументи *початок* і *кінець* інтерпретуються як у нотації фрагментів.

source: The subsequence to search for may be any :term:`bytes-like object` or an integer in the range 0 to 255.
fa: دنباله ای که باید جستجو شود ممکن است هر :term:`bytes-like object` یا یک عدد صحیح در محدوده 0 تا 255 باشد.
ru: Подпоследовательностью для поиска может быть любой :term:`байтовый объект` или целое число в диапазоне от 0 до 255.
uk: Підпослідовністю для пошуку може бути будь-який :term:`bytes-like object` або ціле число в діапазоні від 0 до 255.

source: If *sub* is empty, returns the number of empty slices between characters which is the length of the bytes object plus one.
fa: اگر *sub* خالی باشد، تعداد برش های خالی بین کاراکترها را برمی گرداند که طول شی بایت به اضافه یک است.
ru: Если *sub* пусто, возвращает количество пустых фрагментов между символами, которое равно длине объекта байтов плюс один.

source: Also accept an integer in the range 0 to 255 as the subsequence.
fa: همچنین یک عدد صحیح در محدوده 0 تا 255 را به عنوان دنباله قبول کنید.
ru: Также примите целое число в диапазоне от 0 до 255 в качестве подпоследовательности.
uk: Також прийняти ціле число в діапазоні від 0 до 255 як підпослідовність.

source: If the binary data starts with the *prefix* string, return ``bytes[len(prefix):]``. Otherwise, return a copy of the original binary data::
fa: اگر داده های باینری با رشته *prefix* شروع می شود، ``bytes[len(prefix):]`` را برگردانید. در غیر این صورت، یک کپی از داده های باینری اصلی را برگردانید::
ru: Если двоичные данные начинаются со строки *префикса*, верните ``bytes[len(prefix):]`` . В противном случае верните копию исходных двоичных данных::
uk: Якщо двійкові дані починаються з рядка *prefix*, поверніть ``bytes[len(prefix):]``. В іншому випадку поверніть копію вихідних двійкових даних::

source: The *prefix* may be any :term:`bytes-like object`.
fa: *prefix* ممکن است هر :term:`bytes-like object` باشد.
ru: *Префикс* может быть любым :term:`байтоподобным объектом`.
uk: *Префікс* може бути будь-яким :term:`bytes-like object`.

source: The bytearray version of this method does *not* operate in place - it always produces a new object, even if no changes were made.
fa: نسخه بایت آرایه این روش *not* در جای خود کار می کند - همیشه یک شی جدید تولید می کند، حتی اگر هیچ تغییری ایجاد نشده باشد.
ru: Версия этого метода *не* работает на месте — она всегда создает новый объект, даже если не было внесено никаких изменений.
uk: Версія bytearray цього методу *не* працює на місці – вона завжди створює новий об’єкт, навіть якщо не було зроблено жодних змін.

source: If the binary data ends with the *suffix* string and that *suffix* is not empty, return ``bytes[:-len(suffix)]``. Otherwise, return a copy of the original binary data::
fa: اگر داده های باینری به رشته *suffix* ختم می شود و *suffix* خالی نیست، ``bytes[:-len(suffix)]`` را برگردانید. در غیر این صورت، یک کپی از داده های باینری اصلی را برگردانید::
ru: Если двоичные данные заканчиваются строкой *суффикс* и этот *суффикс* не пуст, верните ``bytes[:-len(суффикс)]`` . В противном случае верните копию исходных двоичных данных::
uk: Якщо двійкові дані закінчуються рядком *суфікса* і цей *суфікс* не порожній, поверніть ``bytes[:-len(suffix)]``. В іншому випадку поверніть копію вихідних двійкових даних::

source: The *suffix* may be any :term:`bytes-like object`.
fa: *suffix* ممکن است هر :term:`bytes-like object` باشد.
ru: *Суффикс* может быть любым :term:`байтоподобным объектом`.
uk: *Суфіксом* може бути будь-який :term:`bytes-like object`.

source: Return the bytes decoded to a :class:`str`.
fa: بایت های رمزگشایی شده را به :class:`str` برگردانید.
ru: Вернуть декодированные байты в :class:`str` .
