Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: fa, ru, uk

source: Return ``True`` if all bytes in the sequence are ASCII whitespace and the sequence is not empty, ``False`` otherwise. ASCII whitespace characters are those byte values in the sequence ``b' \t\n\r\x0b\f'`` (space, tab, newline, carriage return, vertical tab, form feed).
fa: اگر تمام بایت‌های دنباله فضای خالی ASCII هستند و دنباله خالی نیست، ``True`` را برگردانید، در غیر این صورت ``False`` را برگردانید. کاراکترهای فضای خالی ASCII آن مقادیر بایت در دنباله ``b' \t\n\r\x0b\f'`` هستند (فضا, برگه, خط جدید, بازگشت بار, برگه عمودی, فید فرم).
ru: Возвращаться ``Правда`` если все байты в последовательности представляют собой пробелы ASCII и последовательность не пуста, ``Ложь`` в противном случае. Пробелы ASCII — это значения байтов в последовательности. ``b' \t\n\r\x0b\f'`` (пробел, табуляция, новая строка, возврат каретки, вертикальная табуляция, перевод страницы).
uk: Повертає ``True``, якщо всі байти в послідовності є пробілами ASCII і послідовність не порожня, ``False`` інакше. Пробільні символи ASCII – це значення байтів у послідовності ``b' \t\n\r\x0b\f''`` (пробіл, табуляція, новий рядок, повернення каретки, вертикальна табуляція, передача форми).

source: Return ``True`` if the sequence is ASCII titlecase and the sequence is not empty, ``False`` otherwise. See :meth:`bytes.title` for more details on the definition of "titlecase".
fa: اگر دنباله ASCII titlecase است و دنباله خالی نیست، ``True`` را برگردانید، در غیر این صورت ``False`` را برگردانید. برای جزئیات بیشتر در مورد تعریف "titlecase" به :meth:`bytes.title` مراجعه کنید.
ru: Возвращаться ``Правда`` если последовательность является регистром заголовков ASCII и не пуста, ``Ложь`` в противном случае. Видеть :meth:`bytes.title` для получения более подробной информации об определении «заглавного регистра».
uk: Повертає ``True``, якщо послідовність має регістр заголовків ASCII і послідовність не є порожньою, ``False`` інакше. Дивіться :meth:`bytes.title`, щоб дізнатися більше про визначення "заголовка".

source: Return ``True`` if there is at least one uppercase alphabetic ASCII character in the sequence and no lowercase ASCII characters, ``False`` otherwise.
fa: اگر حداقل یک نویسه ASCII حروف الفبای بزرگ در دنباله وجود دارد و هیچ نویسه ASCII کوچک وجود ندارد، ``True`` را برگردانید، در غیر این صورت ``False``.
ru: Возвращаться ``Правда`` если в последовательности есть хотя бы один буквенный символ ASCII в верхнем регистре и нет символов ASCII в нижнем регистре, ``Ложь`` в противном случае.
uk: Повертає ``True``, якщо в послідовності є принаймні один символ ASCII у верхньому регістрі та відсутні символи ASCII у нижньому регістрі, інакше ``False``.

source: Return a copy of the sequence with all the uppercase ASCII characters converted to their corresponding lowercase counterpart.
fa: یک کپی از دنباله را با تمام کاراکترهای ASCII بزرگ به همتای کوچک مربوطه خود برگردانید.
ru: Возвращает копию последовательности, в которой все символы ASCII верхнего регистра преобразованы в соответствующие символы нижнего регистра.
uk: Повертає копію послідовності з усіма символами ASCII у верхньому регістрі, перетвореними на їхні відповідні відповідники у нижньому регістрі.

source: Return a list of the lines in the binary sequence, breaking at ASCII line boundaries. This method uses the :term:`universal newlines` approach to splitting lines. Line breaks are not included in the resulting list unless *keepends* is given and true.
fa: فهرستی از خطوط در دنباله باینری را برگردانید که در مرزهای خطوط ASCII شکسته می شوند. این روش از رویکرد :term:`universal newlines` برای تقسیم خطوط استفاده می کند. شکست خط در لیست حاصل گنجانده نمی شود مگر اینکه *keepends* داده شده و درست باشد.
ru: Возвращает список строк двоичной последовательности, разрывающихся на границах строк ASCII. Этот метод использует :term:`универсальный подход новой строки` для разделения строк. Разрывы строк не включаются в результирующий список, если не указано значение *keepends* и истинное значение.
uk: Повертає список рядків у двійковій послідовності, розриваючи межі рядків ASCII. Цей метод використовує підхід :term:`universal newlines` до розділення рядків. Розриви рядків не включаються до результуючого списку, якщо не задано *keepends* і воно є істинним.

source: Unlike :meth:`~bytes.split` when a delimiter string *sep* is given, this method returns an empty list for the empty string, and a terminal line break does not result in an extra line::
fa: برخلاف :meth:`~bytes.split` که یک رشته جداکننده *sep* داده می شود، این روش یک لیست خالی برای رشته خالی برمی گرداند و شکست خط پایانی منجر به یک خط اضافی نمی شود:
ru: В отличие от :meth:`~bytes.split` если указана строка-разделитель *sep*, этот метод возвращает пустой список для пустой строки, а разрыв конечной строки не приводит к появлению дополнительной строки::
uk: На відміну від :meth:`~bytes.split`, коли задано рядок розділювача *sep*, цей метод повертає порожній список для порожнього рядка, а розрив кінцевого рядка не призводить до додаткового рядка::

source: Return a copy of the sequence with all the lowercase ASCII characters converted to their corresponding uppercase counterpart and vice-versa.
fa: یک کپی از دنباله را با تمام نویسه‌های ASCII کوچک به همتای بزرگ مربوطه خود و بالعکس برگردانید.
ru: Возвращает копию последовательности, в которой все символы ASCII нижнего регистра преобразованы в соответствующие символы верхнего регистра и наоборот.
uk: Повертає копію послідовності з усіма символами нижнього регістру ASCII, перетвореними на їхні відповідні відповідники у верхньому регістрі та навпаки.

source: Unlike :func:`str.swapcase`, it is always the case that ``bin.swapcase().swapcase() == bin`` for the binary versions. Case conversions are symmetrical in ASCII, even though that is not generally true for arbitrary Unicode code points.
fa: برخلاف :func:`str.swapcase`، همیشه ``bin.swapcase().swapcase() == bin`` برای نسخه های باینری وجود دارد. تبدیل‌های Case در ASCII متقارن هستند، حتی اگر این به طور کلی برای نقاط کد دلخواه یونیکد صادق نیست.

source: Return a titlecased version of the binary sequence where words start with an uppercase ASCII character and the remaining characters are lowercase. Uncased byte values are left unmodified.
fa: یک نسخه با حروف عنوان از دنباله باینری که در آن کلمات با یک کاراکتر ASCII بزرگ شروع می‌شوند و کاراکترهای باقیمانده با حروف کوچک هستند، برگردانید. مقادیر بایت بدون حروف بدون تغییر رها می شوند.
ru: Возвращает версию двоичной последовательности с заголовком, где слова начинаются с символа ASCII в верхнем регистре, а остальные символы — в нижнем регистре. Значения байтов без регистра остаются неизмененными.
uk: Повертає версію двійкової послідовності в заголовку, де слова починаються з символу ASCII у верхньому регістрі, а решта символів – у нижньому регістрі. Значення байтів без регістру залишаються незмінними.

source: Lowercase ASCII characters are those byte values in the sequence ``b'abcdefghijklmnopqrstuvwxyz'``. Uppercase ASCII characters are those byte values in the sequence ``b'ABCDEFGHIJKLMNOPQRSTUVWXYZ'``. All other byte values are uncased.
fa: حروف کوچک ASCII مقادیر بایتی در دنباله ``b'abcdefghijklmnopqrstuvwxyz'`` هستند. کاراکترهای ASCII بزرگ آن مقادیر بایت در دنباله ``b'ABCDEFGHIJKLMNOPQRSTUVWXYZ'`` هستند. سایر مقادیر بایت بدون حروف هستند.
ru: Символы ASCII нижнего регистра — это значения байтов в последовательности. ``b'abcdefghijklmnopqrstuvwxyz'`` . Символы ASCII верхнего регистра — это значения байтов в последовательности. ``b'ABCDEFGHIJKLMNOPQRSTUVWXYZ'`` . Все остальные байтовые значения не имеют регистра.
uk: Символи ASCII у нижньому регістрі – це значення байтів у послідовності ``b'abcdefghijklmnopqrstuvwxyz``. Символи ASCII у верхньому регістрі – це значення байтів у послідовності ``b'ABCDEFGHIJKLMNOPQRSTUVWXYZ``. Усі інші значення байтів без регістру.

source: A workaround for apostrophes can be constructed using regular expressions::
fa: یک راه حل برای آپوستروف ها می تواند با استفاده از عبارات منظم ساخته شود:
ru: Обходной путь для апострофов можно создать с помощью регулярных выражений::
uk: Обхідний шлях для апострофів можна створити за допомогою регулярних виразів:

source: Return a copy of the sequence with all the lowercase ASCII characters converted to their corresponding uppercase counterpart.
fa: یک کپی از دنباله را با تمام کاراکترهای ASCII کوچک به همتای بزرگ مربوطه خود برگردانید.
ru: Возвращает копию последовательности, в которой все символы ASCII нижнего регистра преобразованы в соответствующие символы верхнего регистра.
uk: Повертає копію послідовності з усіма символами нижнього регістру ASCII, перетвореними на їхні відповідні відповідники у верхньому регістрі.

source: Return a copy of the sequence left filled with ASCII ``b'0'`` digits to make a sequence of length *width*. A leading sign prefix (``b'+'``/ ``b'-'``) is handled by inserting the padding *after* the sign character rather than before. For :class:`bytes` objects, the original sequence is returned if *width* is less than or equal to ``len(seq)``.
fa: یک کپی از دنباله سمت چپ پر شده با ارقام ASCII ``b'0'`` را برگردانید تا دنباله ای به طول *width* بسازید. پیشوند علامت پیشرو (``b'+'``/``b'-'``) با درج نویسه علامت *after* به جای قبل انجام می شود. برای اشیاء :class:`bytes`، اگر *width* کمتر یا مساوی با ``len(seq)`` باشد، دنباله اصلی برگردانده می شود.
ru: Вернуть копию последовательности, заполненную ASCII. ``b'0'`` цифры, чтобы составить последовательность длиной *шириной*. Ведущий префикс знака ( ``б'+'`` / ``б'-'`` ) обрабатывается путем вставки дополнения *после* символа знака, а не перед ним. Для :class:`байты` объекты, исходная последовательность возвращается, если *width* меньше или равна ``len(seq)`` .
uk: Поверніть копію послідовності зліва, заповнену цифрами ASCII ``b'0``, щоб створити послідовність довжиною *ширина*. Початковий префікс знака (``b'+'``/ ``b'-'``) обробляється шляхом вставки заповнення *після* символу знака, а не перед ним. Для об’єктів :class:`bytes` оригінальна послідовність повертається, якщо *width* менше або дорівнює ``len(seq)``.

source: ``printf``-style Bytes Formatting
fa: قالب بندی بایت به سبک ``printf``
ru: ``printf`` -стиль форматирования байтов
uk: Форматування байтів у стилі ``printf``

source: The formatting operations described here exhibit a variety of quirks that lead to a number of common errors (such as failing to display tuples and dictionaries correctly). If the value being printed may be a tuple or dictionary, wrap it in a tuple.
fa: عملیات قالب‌بندی که در اینجا توضیح داده شده است، خصلت‌های مختلفی را نشان می‌دهد که منجر به تعدادی خطای رایج (مانند عدم نمایش صحیح تاپل‌ها و دیکشنری‌ها) می‌شود. اگر مقدار چاپ شده ممکن است یک تاپل یا فرهنگ لغت باشد، آن را در یک تاپلی بپیچید.
ru: Описанные здесь операции форматирования имеют ряд особенностей, которые приводят к ряду распространенных ошибок (например, к неправильному отображению кортежей и словарей). Если печатаемое значение может быть кортежем или словарем, оберните его в кортеж.
uk: Операції форматування, описані тут, демонструють різноманітні особливості, які призводять до низки поширених помилок (наприклад, неправильне відображення кортежів і словників). Якщо значення, яке друкується, може бути кортежем або словником, оберніть його в кортеж.

source: Bytes objects (``bytes``/``bytearray``) have one unique built-in operation: the ``%`` operator (modulo). This is also known as the bytes *formatting* or *interpolation* operator. Given ``format % values`` (where *format* is a bytes object), ``%`` conversion specifications in *format* are replaced with zero or more elements of *values*. The effect is similar to using the :c:func:`sprintf` in the C language.
fa: اشیاء بایت (``bytes``/``bytearray``) یک عملیات داخلی منحصر به فرد دارند: عملگر ``%`` (ماژول). این عملگر بایت *formatting* یا *interpolation* نیز شناخته می شود. با توجه به ``format % values`` (که در آن *format* یک شی بایت است), مشخصات تبدیل ``%`` در *format* با عناصر صفر یا بیشتر از *values* جایگزین می شود. این اثر مشابه استفاده از :c:func:`sprintf` در زبان C است.
ru: Байтовые объекты ( ``байты`` / ``bytearray`` ) имеют одну уникальную встроенную операцию: ``%`` оператор (по модулю). Это также известно как оператор *форматирования* байтов или *интерполяции*. Данный ``формат % значений`` (где *format* — байтовый объект), ``%`` спецификации преобразования в *формате* заменяются нулем или более элементами *значений*. Эффект аналогичен использованию :c:func:`sprintf` на языке Си.
uk: Об’єкти Bytes (``bytes``/``bytearray``) мають одну унікальну вбудовану операцію: оператор ``%`` (за модулем). Це також відоме як оператор *форматування* або *інтерполяції* байтів. Враховуючи ``формат % значень`` (де *format* є об’єктом байтів), ``%`` специфікації перетворення у *format* замінюються нулем або більше елементами *значень*. Ефект подібний до використання :c:func:`sprintf` у мові C.

source: If *format* requires a single argument, *values* may be a single non-tuple object. [5]_ Otherwise, *values* must be a tuple with exactly the number of items specified by the format bytes object, or a single mapping object (for example, a dictionary).
fa: اگر *format* به یک آرگومان واحد نیاز داشته باشد، *values* ممکن است یک شی غیر چندگانه باشد. [5]_ در غیر این صورت، *values* باید یک تاپل با تعداد آیتم های مشخص شده توسط شی قالب بایت یا یک شی نگاشت واحد (مثلاً یک فرهنگ لغت) باشد.
ru: Если для *format* требуется один аргумент, *values* может быть одним объектом, не являющимся кортежем. [5]_ В противном случае *значения* должны быть кортежем с количеством элементов, указанным в объекте байтов формата, или одним объектом сопоставления (например, словарем).
uk: Якщо для *format* потрібен один аргумент, *values* може бути одним некортежним об’єктом. [5]_ В іншому випадку *values* має бути кортежем із точною кількістю елементів, указаною об’єктом format bytes, або одним об’єктом відображення (наприклад, словником).

source: When the right argument is a dictionary (or other mapping type), then the formats in the bytes object *must* include a parenthesised mapping key into that dictionary inserted immediately after the ``'%'`` character. The mapping key selects the value to be formatted from the mapping. For example:
fa: هنگامی که آرگومان مناسب یک فرهنگ لغت (یا نوع نقشه برداری دیگر) باشد، فرمت های موجود در شی بایت *must* شامل یک کلید نگاشت پرانتز در آن فرهنگ لغت است که بلافاصله بعد از کاراکتر ``'%'`` درج شده است. کلید نگاشت مقداری را که باید قالب بندی شود از نقشه برداری انتخاب می کند. به عنوان مثال:
ru: Если правым аргументом является словарь (или другой тип сопоставления), тогда форматы в объекте bytes *должны* включать заключенный в круглые скобки ключ сопоставления в этот словарь, вставленный сразу после ``'%'`` характер. Ключ сопоставления выбирает значение для форматирования из сопоставления. Например:
uk: Коли правильний аргумент є словником (або іншим типом відображення), тоді формати в об’єкті bytes *мають* містити ключ відображення в дужках у цьому словнику, вставлений відразу після символу ``'%'``. Ключ відображення вибирає значення, яке потрібно відформатувати, із відображення. Наприклад:

source: Single byte (accepts integer or single byte objects).
fa: تک بایت (اشیاء عدد صحیح یا تک بایت را می پذیرد).
ru: Однобайтовый (принимает целочисленные или однобайтовые объекты).
uk: Однобайтовий (приймає цілі чи однобайтові об’єкти).

source: Bytes (any object that follows the :ref:`buffer protocol <bufferobjects>` or has :meth:`~object.__bytes__`).
fa: بایت ها (هر شیئی که از :ref:`buffer protocol <bufferobjects>` پیروی می کند یا دارای :meth:`~object.__bytes__` است).
ru: Байты (любой объект, который следует протоколу :ref:`buffer ` или имеет :meth:`~object.__bytes__` ).

source: ``'s'`` is an alias for ``'b'`` and should only be used for Python2/3 code bases.
fa: ``'s'`` نام مستعار ``'b'`` است و فقط باید برای پایه کد Python2/3 استفاده شود.
ru: ``'`` это псевдоним для ``'б'`` и должен использоваться только для баз кода Python2/3.
uk: ``'s''`` є псевдонімом для ``'b''`` і має використовуватися лише для базового коду Python2/3.

source: Bytes (converts any Python object using ``repr(obj).encode('ascii', 'backslashreplace')``).
fa: بایت ها (هر شی پایتون را با استفاده از ``repr(obj).encode('ascii', 'backslashreplace')`` تبدیل می کند).
ru: Байты (преобразует любой объект Python, используя ``repr(obj).encode('ascii', 'обратная косая черта')`` ).
uk: Байти (перетворює будь-який об’єкт Python за допомогою ``repr(obj).encode('ascii', 'backslashreplace')``).

source: ``'r'`` is an alias for ``'a'`` and should only be used for Python2/3 code bases.
fa: ``'r'`` نام مستعار ``'a'`` است و فقط باید برای پایه کد Python2/3 استفاده شود.
ru: ``'р'`` это псевдоним для ``'а'`` и должен использоваться только для баз кода Python2/3.
uk: ``'r'`` є псевдонімом для ``'a'`` і має використовуватися лише для базових кодів Python2/3.

source: ``b'%s'`` is deprecated, but will not be removed during the 3.x series.
fa: ``b'%s'`` منسوخ شده است، اما در طول سری 3.x حذف نخواهد شد.
ru: ``b'%s'`` устарел, но не будет удален в серии 3.x.
uk: ``b'%s`` є застарілим, але не буде видалено протягом серії 3.x.

source: ``b'%r'`` is deprecated, but will not be removed during the 3.x series.
fa: ``b'%r'`` منسوخ شده است، اما در طول سری 3.x حذف نخواهد شد.
ru: ``b'%r'`` устарел, но не будет удален в серии 3.x.
uk: ``b'%r''`` є застарілим, але не буде видалено протягом серії 3.x.

source: :pep:`461` - Adding % formatting to bytes and bytearray
fa: :pep:`461` - اضافه کردن درصد قالب بندی به بایت ها و آرایه بایت
ru: :pep:`461` - Добавление % форматирования к байтам и байтовым массивам.
uk: :pep:`461` - Додано форматування % до байтів і масиву байтів

source: Memory Views
fa: نماهای حافظه
ru: Виды памяти
uk: Перегляди пам'яті

source: :class:`memoryview` objects allow Python code to access the internal data of an object that supports the :ref:`buffer protocol <bufferobjects>` without copying.
fa: اشیاء :class:`memoryview` به کد پایتون اجازه می دهد تا به داده های داخلی یک شی که از :ref:`buffer protocol <bufferobjects>` پشتیبانی می کند بدون کپی دسترسی پیدا کند.
ru: :class:`memoryview` объекты позволяют коду Python получать доступ к внутренним данным объекта, который поддерживает протокол :ref:`buffer `без копирования.
uk: Об’єкти :class:`memoryview` дозволяють коду Python отримувати доступ до внутрішніх даних об’єкта, який підтримує :ref:`протокол буфера <bufferobjects>` без копіювання.

source: Create a :class:`memoryview` that references *object*. *object* must support the buffer protocol. Built-in objects that support the buffer protocol include :class:`bytes` and :class:`bytearray`.
fa: یک :class:`memoryview` ایجاد کنید که به *object* اشاره کند. *object* باید از پروتکل بافر پشتیبانی کند. اشیاء داخلی که از پروتکل بافر پشتیبانی می کنند عبارتند از :class:`bytes` و :class:`bytearray`.
ru: Создайте :class:`memoryview` который ссылается на *объект*. *объект* должен поддерживать протокол буфера. Встроенные объекты, поддерживающие протокол буфера, включают в себя :class:`байты` и :class:`bytearray` .
uk: Створіть :class:`memoryview`, який посилається на *об’єкт*. *об’єкт* має підтримувати протокол буфера. Вбудовані об’єкти, які підтримують протокол буфера, включають :class:`bytes` і :class:`bytearray`.

source: A :class:`memoryview` has the notion of an *element*, which is the atomic memory unit handled by the originating *object*. For many simple types such as :class:`bytes` and :class:`bytearray`, an element is a single byte, but other types such as :class:`array.array` may have bigger elements.
fa: :class:`memoryview` مفهوم *element* را دارد که واحد حافظه اتمی است که توسط *object* مبدا اداره می شود. برای بسیاری از انواع ساده مانند :class:`bytes` و :class:`bytearray`، یک عنصر یک بایت است، اما انواع دیگر مانند :class:`array.array` ممکن است عناصر بزرگتری داشته باشند.
ru: А :class:`memoryview` имеет понятие *элемента*, который представляет собой атомарную единицу памяти, обрабатываемую исходным *объектом*. Для многих простых типов, таких как :class:`байты` и :class:`bytearray` , элемент представляет собой один байт, но другие типы, такие как :class:`array.array` может иметь более крупные элементы.
uk: :class:`memoryview` має поняття *елемента*, який є атомарною одиницею пам’яті, яка обробляється вихідним *об’єктом*. Для багатьох простих типів, таких як :class:`bytes` і :class:`bytearray`, елемент є одним байтом, але інші типи, такі як :class:`array.array`, можуть мати більші елементи.

source: ``len(view)`` is equal to the length of :class:`~memoryview.tolist`, which is the nested list representation of the view. If ``view.ndim = 1``, this is equal to the number of elements in the view.
fa: ``len(view)`` برابر با طول :class:`~memoryview.tolist` است که نمایش لیست تودرتوی نما است. اگر ``view.ndim = 1``، این برابر با تعداد عناصر در نما است.

source: If ``view.ndim == 0``, ``len(view)`` now raises :exc:`TypeError` instead of returning 1.
fa: اگر ``view.ndim == 0``، ``len(view)`` اکنون به جای برگرداندن 1، :exc:`TypeError` را افزایش می دهد.

source: The :class:`~memoryview.itemsize` attribute will give you the number of bytes in a single element.
fa: ویژگی :class:`~memoryview.itemsize` تعداد بایت های یک عنصر را به شما می دهد.

source: A :class:`memoryview` supports slicing and indexing to expose its data. One-dimensional slicing will result in a subview::
fa: :class:`memoryview` از برش و نمایه سازی برای نمایش داده های خود پشتیبانی می کند. برش تک بعدی منجر به یک نمای فرعی می شود:
ru: А :class:`memoryview` поддерживает нарезку и индексирование для предоставления данных. Одномерная нарезка приведет к созданию подпредставления::
uk: :class:`memoryview` підтримує нарізку та індексування для показу своїх даних. Одновимірне нарізання призведе до підвиду::

source: >>> v = memoryview(b'abcefg') >>> v[1] 98 >>> v[-1] 103 >>> v[1:4] <memory at 0x7f3ddc9f4350> >>> bytes(v[1:4]) b'bce'
fa: >>> v = نمای حافظه (b'abcefg') >>> v[1] 98 >>> v[-1] 103 >>> v[1:4] <حافظه در 0x7f3ddc9f4350> >>> بایت (v[1:4]) قبل از میلاد
