Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: fa, ru, uk

source: Two methods support conversion to and from hexadecimal strings. Since Python's floats are stored internally as binary numbers, converting a float to or from a *decimal* string usually involves a small rounding error. In contrast, hexadecimal strings allow exact representation and specification of floating-point numbers. This can be useful when debugging, and in numerical work.
fa: دو روش از تبدیل به رشته های هگزادسیمال و از آن پشتیبانی می کنند. از آنجایی که شناورهای پایتون در داخل به عنوان اعداد باینری ذخیره می شوند، تبدیل یک شناور به یا از یک رشته *decimal* معمولاً شامل یک خطای گرد کردن کوچک است. در مقابل، رشته‌های هگزا دسیمال امکان نمایش و تعیین دقیق اعداد ممیز شناور را فراهم می‌کنند. این می تواند هنگام اشکال زدایی و در کار عددی مفید باشد.
ru: Два метода поддерживают преобразование в шестнадцатеричные строки и обратно. Поскольку числа с плавающей запятой в Python хранятся внутри как двоичные числа, преобразование числа с плавающей запятой в *десятичную* строку или из нее обычно приводит к небольшой ошибке округления. Напротив, шестнадцатеричные строки допускают точное представление и спецификацию чисел с плавающей запятой. Это может быть полезно при отладке и числовой работе.
uk: Два методи підтримують перетворення до та з шістнадцяткових рядків. Оскільки числа з плаваючою точкою Python зберігаються усередині як двійкові числа, перетворення числа з плаваючою точкою в *десятковий* рядок або з нього зазвичай включає невелику помилку округлення. Навпаки, шістнадцяткові рядки дозволяють точне представлення та специфікацію чисел з плаваючою комою. Це може бути корисним під час налагодження та чисельної роботи.

source: Return a representation of a floating-point number as a hexadecimal string. For finite floating-point numbers, this representation will always include a leading ``0x`` and a trailing ``p`` and exponent.
fa: نمایشی از یک عدد ممیز شناور را به عنوان یک رشته هگزادسیمال برگردانید. برای اعداد ممیز شناور متناهی، این نمایش همیشه شامل یک ``0x`` پیشرو و یک ``p`` و یک توان بعد است.
ru: Возвращает представление числа с плавающей запятой в виде шестнадцатеричной строки. Для конечных чисел с плавающей запятой это представление всегда будет включать ведущий ``0x`` и конечный ``п`` и показатель.
uk: Повертає представлення числа з плаваючою комою як шістнадцятковий рядок. Для скінченних чисел з плаваючою комою це представлення завжди включатиме ``0x`` на початку та ``p`` у кінці та експоненту.

source: Class method to return the float represented by a hexadecimal string *s*. The string *s* may have leading and trailing whitespace.
fa: روش کلاس برای برگرداندن شناور نشان داده شده توسط یک رشته هگزادسیمال *s*. رشته *s* ممکن است دارای فضای خالی پیشرو و انتهایی باشد.
ru: Метод класса, возвращающий число с плавающей запятой, представленное шестнадцатеричной строкой *s*. Строка *s* может иметь начальные и конечные пробелы.
uk: Метод класу для повернення числа з плаваючою точкою, представленого шістнадцятковим рядком *s*. Рядок *s* може мати пробіли на початку та в кінці.

source: Note that :meth:`float.hex` is an instance method, while :meth:`float.fromhex` is a class method.
fa: توجه داشته باشید که :meth:`float.hex` یک متد نمونه است، در حالی که :meth:`float.fromhex` یک متد کلاس است.
ru: Обратите внимание, что :meth:`float.hex` является методом экземпляра, а :meth:`float.fromhex` это метод класса.
uk: Зауважте, що :meth:`float.hex` є методом екземпляра, тоді як :meth:`float.fromhex` є методом класу.

source: A hexadecimal string takes the form::
fa: یک رشته هگزادسیمال به شکل زیر است:
ru: Шестнадцатеричная строка имеет вид::
uk: Шістнадцятковий рядок має вигляд::

source: [sign] ['0x'] integer ['.' fraction] ['p' exponent]
fa: [sign] ['0x'] عدد صحیح ['.' کسری] [نمایش 'p']

source: where the optional ``sign`` may by either ``+`` or ``-``, ``integer`` and ``fraction`` are strings of hexadecimal digits, and ``exponent`` is a decimal integer with an optional leading sign. Case is not significant, and there must be at least one hexadecimal digit in either the integer or the fraction. This syntax is similar to the syntax specified in section 6.4.4.2 of the C99 standard, and also to the syntax used in Java 1.5 onwards. In particular, the output of :meth:`float.hex` is usable as a hexadecimal floating-point literal in C or Java code, and hexadecimal strings produced by C's ``%a`` format character or Java's ``Double.toHexString`` are accepted by :meth:`float.fromhex`.
fa: در جایی که ``sign`` اختیاری ممکن است با ``+`` یا ``-`` باشد، ``integer`` و ``fraction`` رشته هایی از ارقام هگزا دسیمال هستند و ``exponent`` یک عدد صحیح اعشاری با علامت ابتدایی اختیاری است. حروف کوچک و بزرگ مهم نیست و باید حداقل یک رقم هگزادسیمال در عدد صحیح یا کسری وجود داشته باشد. این نحو شبیه به نحو مشخص شده در بخش 6.4.4.2 استاندارد C99 و همچنین سینتکس مورد استفاده در جاوا 1.5 به بعد است. به طور خاص، خروجی :meth:`float.hex` به عنوان یک ممیز شناور هگزا دسیمال در کد C یا جاوا قابل استفاده است و رشته های هگزادسیمال تولید شده توسط کاراکتر فرمت ``%a`` C یا ``Double.toHexString`` جاوا توسط :meth:`float.fromhex` پذیرفته می شود.
ru: где необязательно ``подписать`` может либо ``+`` или ``-`` , ``целое`` и ``фракция`` представляют собой строки шестнадцатеричных цифр, а ``экспонента`` — десятичное целое число с необязательным ведущим знаком. Регистр не имеет значения, и в целом или дробном числе должна быть хотя бы одна шестнадцатеричная цифра. Этот синтаксис аналогичен синтаксису, указанному в разделе 6.4.4.2 стандарта C99, а также синтаксису, используемому в Java 1.5 и более поздних версиях. В частности, вывод :meth:`float.hex` можно использовать как шестнадцатеричный литерал с плавающей запятой в коде C или Java, а также шестнадцатеричные строки, созданные с помощью C. ``%a`` символ формата или Java ``Double.toHexString`` принимаются :meth:`float.fromhex` .
uk: де необов’язковий ``знак`` може мати ``+`` або ``-``, ``ціле число`` і ``дріб`` є рядками шістнадцяткових цифр, а ``експонента`` є десятковим цілим числом з необов’язковим переднім знаком. Регістр не є значущим, і в цілому чи дробі має бути принаймні одна шістнадцяткова цифра. Цей синтаксис подібний до синтаксису, зазначеного в розділі 6.4.4.2 стандарту C99, а також до синтаксису, який використовується в Java 1.5 і далі. Зокрема, вихід :meth:`float.hex` можна використовувати як шістнадцятковий літерал із плаваючою комою в коді C або Java, а також шістнадцяткові рядки, створені символом формату C ``%a`` або ``Double.toHexString`` Java приймаються :meth:`float.fromhex`.

source: Note that the exponent is written in decimal rather than hexadecimal, and that it gives the power of 2 by which to multiply the coefficient. For example, the hexadecimal string ``0x3.a7p10`` represents the floating-point number ``(3 + 10./16 + 7./16**2) * 2.0**10``, or ``3740.0``::
fa: توجه داشته باشید که توان به جای هگزادسیمال به صورت اعشاری نوشته می شود و توان 2 را می دهد تا ضریب را در آن ضرب کنیم. به عنوان مثال، رشته هگزادسیمال ``0x3.a7p10`` عدد ممیز شناور ``(3 + 10./16 + 7./16**2) * 2.0**10`` یا ``3740.0``::
ru: Обратите внимание, что показатель степени записывается в десятичной, а не шестнадцатеричной форме, и что он дает степень 2, на которую можно умножить коэффициент. Например, шестнадцатеричная строка ``0x3.a7p10'' представляет число с плавающей запятой ``(3 + 10./16 + 7./16**2) * 2.0**10`` , или ``3740.0`` ::
uk: Зауважте, що експонента записується в десятковій, а не в шістнадцятковій формі, і що вона дає ступінь 2, на який потрібно помножити коефіцієнт. Наприклад, шістнадцятковий рядок ``0x3.a7p10`` представляє число з плаваючою комою ``(3 + 10./16 + 7./16**2) * 2.0**10`` або ``3740.0``::

source: Applying the reverse conversion to ``3740.0`` gives a different hexadecimal string representing the same number::
fa: اعمال تبدیل معکوس به ``3740.0`` یک رشته هگزادسیمال متفاوت به دست می دهد که نشان دهنده همان عدد است:
ru: Применяя обратное преобразование к ``3740.0`` дает другую шестнадцатеричную строку, представляющую то же число::
uk: Застосування зворотного перетворення до ``3740.0`` дає інший шістнадцятковий рядок, що представляє те саме число::

source: Hashing of numeric types
fa: هش کردن انواع عددی
ru: Хеширование числовых типов
uk: Хешування числових типів

source: For numbers ``x`` and ``y``, possibly of different types, it's a requirement that ``hash(x) == hash(y)`` whenever ``x == y`` (see the :meth:`~object.__hash__` method documentation for more details). For ease of implementation and efficiency across a variety of numeric types (including :class:`int`, :class:`float`, :class:`decimal.Decimal` and :class:`fractions.Fraction`) Python's hash for numeric types is based on a single mathematical function that's defined for any rational number, and hence applies to all instances of :class:`int` and :class:`fractions.Fraction`, and all finite instances of :class:`float` and :class:`decimal.Decimal`. Essentially, this function is given by reduction modulo ``P`` for a fixed prime ``P``. The value of ``P`` is made available to Python as the :attr:`~sys.hash_info.modulus` attribute of :data:`sys.hash_info`.
fa: برای اعداد ``x`` و ``y``، که ممکن است از انواع مختلف باشند، این الزام است که هرگاه ``x == y`` باشد، در نتیجه داشته باشیم ``hash(x) == hash(y)`` (برای جزئیات بیشتر به مستندات روش :meth:`~object.__hash__` مراجعه کنید). برای سهولت پیاده‌سازی و کارایی در میان انواع عددی متفاوت (از جمله :class:`int`, :class:`float`, :class:`decimal.Decimal` و :class:`fractions.Fraction`) هش پایتون برای انواع عددی بر اساس یک تابع ریاضی یکتا تعریف شده است که برای هر عدد گویا معتبر است و بر همین اساس در تمامی نمونه‌های :class:`int` و :class:`fractions.Fraction`, و همچنین در تمامی نمونه‌های متناهی :class:`float` و :class:`decimal.Decimal` اعمال می‌شود. اساساً، این تابع به صورت کاهش باقی‌مانده نسبت به ``P``، که یک عدد اول ثابت است، تعریف شده است. مقدار ``P`` به عنوان ویژگی :attr:`~sys.hash_info.modulus` در :data:`sys.hash_info` در دسترس پایتون قرار گرفته است.
ru: Для чисел ``х`` и ``и`` , возможно, разных типов, требуется, чтобы ``хэш(x) == хэш(y)`` в любое время ``х == у`` (см. :meth:`~object.__hash__` документацию по методу для более подробной информации). Для простоты реализации и эффективности работы с различными числовыми типами (включая :класс:`int` , :class:`плавать` , :class:`decimal.Decimal` и :class:`fractions.Fraction` ) Хэш Python для числовых типов основан на одной математической функции, которая определена для любого рационального числа и, следовательно, применима ко всем экземплярам :класс:`int` и :class:`fractions.Fraction` и все конечные случаи :class:`плавать` и :class:`decimal.Decimal` . По сути, эта функция задается приведением по модулю ``П`` для фиксированного простого числа ``П`` . The value of ``P`` is made available to Python as the :attr:`~sys.hash_info.modulus` attribute of :data:`sys.hash_info`.

source: Currently, the prime used is ``P = 2**31 - 1`` on machines with 32-bit C longs and ``P = 2**61 - 1`` on machines with 64-bit C longs.
fa: در حال حاضر، پرایم مورد استفاده ``P = 2**31 - 1`` در ماشین‌های با طول C 32 بیت و ``P = 2**61 - 1`` در ماشین‌هایی با طول C 64 بیت است.
ru: В настоящее время используется простое число ``P = 2**31 - 1`` на машинах с 32-битными лонгами C и ``P = 2**61 - 1`` на машинах с 64-битными лонгами C.
uk: В даний час простим числом, яке використовується, є ``P = 2**31 - 1`` на машинах з 32-розрядним C long і ``P = 2**61 - 1`` на машинах з 64-бітним C long.

source: Here are the rules in detail:
fa: در اینجا قوانین به تفصیل آمده است:
ru: Вот правила подробно:
uk: Ось правила в деталях:

source: If ``x = m / n`` is a nonnegative rational number and ``n`` is not divisible by ``P``, define ``hash(x)`` as ``m * invmod(n, P) % P``, where ``invmod(n, P)`` gives the inverse of ``n`` modulo ``P``.
fa: اگر ``x = m / n`` یک عدد گویا غیرمنفی است و ``n`` بر ``P`` بخش پذیر نیست، ``hash(x)`` را به عنوان ``m * invmod(n, P) % P`` تعریف کنید، جایی که ``invmod(n, P)`` معکوس مدول ``n`` ``P`` را می دهد.
ru: Если ``x = m/n`` является неотрицательным рациональным числом и ``н`` не делится на ``П`` , определять ``хэш(x)`` как ``m * invmod(n, P) % P`` , где ``invmod(n, P)`` дает обратное значение ``н`` модуль ``П`` .
uk: Якщо ``x = m / n`` є невід’ємним раціональним числом, а ``n`` не ділиться на ``P``, визначте ``hash(x)`` як ``m * invmod(n, P`` ) % P``, де ``invmod(n, P)`` дає обернене ``n`` за модулем ``P``.

source: If ``x = m / n`` is a nonnegative rational number and ``n`` is divisible by ``P`` (but ``m`` is not) then ``n`` has no inverse modulo ``P`` and the rule above doesn't apply; in this case define ``hash(x)`` to be the constant value ``sys.hash_info.inf``.
fa: اگر ``x = m / n`` یک عدد گویا غیرمنفی است و ``n`` بر ``P`` بخش پذیر است (اما ``m`` نیست) پس ``n`` مدول معکوس ``P`` ندارد و قانون بالا اعمال نمی شود. در این مورد ``hash(x)`` را به عنوان مقدار ثابت ``sys.hash_info.inf`` تعریف کنید.
ru: Если ``x = m/n`` является неотрицательным рациональным числом и ``н`` делится на ``П`` (но ``м`` нет) тогда ``н`` не имеет обратного модуля ``П`` и приведенное выше правило не применяется; в этом случае определить ``хэш(x)`` быть постоянным значением ``sys.hash_info.inf`` .
uk: Якщо ``x = m / n`` є невід’ємним раціональним числом, а ``n`` ділиться на ``P`` (але ``m`` не ділиться на ``m``), тоді ``n`` не має оберненого модуля``P`` і правило вище не застосовується; у цьому випадку визначте ``hash(x)`` як постійне значення ``sys.hash_info.inf``.

source: If ``x = m / n`` is a negative rational number define ``hash(x)`` as ``-hash(-x)``. If the resulting hash is ``-1``, replace it with ``-2``.
fa: اگر ``x = m / n`` یک عدد گویا منفی است، ``hash(x)`` را به عنوان ``-hash(-x)`` تعریف کنید. اگر هش حاصل ``-1`` است، آن را با ``-2`` جایگزین کنید.
ru: Если ``x = m/n`` является отрицательным рациональным числом, определяют ``хэш(x)`` как ``-хэш(-x)`` . Если полученный хэш ``-1`` , замените его на ``-2`` .
uk: Якщо ``x = m / n`` є від’ємним раціональним числом, визначте ``hash(x)`` як ``-hash(-x)``. Якщо отриманий хеш дорівнює ``-1``, замініть його ``-2``.

source: The particular values ``sys.hash_info.inf`` and ``-sys.hash_info.inf`` are used as hash values for positive infinity or negative infinity (respectively).
fa: مقادیر خاص ``sys.hash_info.inf`` و ``-sys.hash_info.inf`` به عنوان مقادیر هش برای بی‌نهایت مثبت یا بی‌نهایت منفی (به ترتیب) استفاده می‌شوند.
ru: Особые ценности ``sys.hash_info.inf`` и ``-sys.hash_info.inf`` используются в качестве хэш-значений для положительной бесконечности или отрицательной бесконечности (соответственно).
uk: Конкретні значення ``sys.hash_info.inf`` і ``-sys.hash_info.inf`` використовуються як хеш-значення для позитивної нескінченності або негативної нескінченності (відповідно).

source: For a :class:`complex` number ``z``, the hash values of the real and imaginary parts are combined by computing ``hash(z.real) + sys.hash_info.imag * hash(z.imag)``, reduced modulo ``2**sys.hash_info.width`` so that it lies in ``range(-2**(sys.hash_info.width - 1), 2**(sys.hash_info.width - 1))``. Again, if the result is ``-1``, it's replaced with ``-2``.
fa: برای یک عدد :class:`complex` ``z``، مقادیر هش بخش واقعی و خیالی با محاسبه ``hash(z.real) + sys.hash_info.imag * hash(z.imag)``، مدول کاهش‌یافته ``2**sys.hash_info.width`` ترکیب می‌شوند تا در ``range(-2**(sys.hash_info.width - 1), 2**(sys.hash_info.width - 1))`` قرار گیرد. دوباره، اگر نتیجه ``-1`` باشد، با ``-2`` جایگزین می شود.
ru: Для :class:`сложный` число ``с`` хеш-значения действительной и мнимой частей объединяются путем вычисления ``hash(z.real) + sys.hash_info.imag * hash(z.imag)`` , уменьшено по модулю ``2**sys.hash_info.width`` так что оно лежит в ``диапазон(-2**(sys.hash_info.width - 1), 2**(sys.hash_info.width - 1))`` . Опять же, если результат ``-1`` , он заменяется на ``-2`` .
uk: Для :class:`complex` числа ``z`` хеш-значення дійсної та уявної частин поєднуються шляхом обчислення ``hash(z.real) + sys.hash_info.imag * hash(z.imag)``, зменшено за модулем ``2**sys.hash_info.width`` так, щоб він знаходився в ``діапазоні (-2**(sys.hash_info.width - 1), 2**(sys.hash_info.width - 1) ))``. Знову ж таки, якщо результат ``-1``, він замінюється на ``-2``.

source: To clarify the above rules, here's some example Python code, equivalent to the built-in hash, for computing the hash of a rational number, :class:`float`, or :class:`complex`::
fa: برای روشن شدن قوانین فوق، در اینجا چند نمونه کد پایتون، معادل هش داخلی، برای محاسبه هش یک عدد گویا، :class:`float` یا :class:`complex` آورده شده است:
ru: Чтобы прояснить вышеизложенные правила, приведем пример кода Python, эквивалентного встроенному хешу, для вычисления хеша рационального числа: :class:`плавать` , или :class:`сложный` ::
uk: Щоб прояснити наведені вище правила, ось приклад коду Python, еквівалентного вбудованому хешу, для обчислення хешу раціонального числа, :class:`float` або :class:`complex`::

source: Boolean Type - :class:`bool`
fa: نوع بولی - :class:`bool`

source: Booleans represent truth values. The :class:`bool` type has exactly two constant instances: ``True`` and ``False``.
fa: بولی ها مقادیر حقیقت را نشان می دهند. نوع :class:`bool` دقیقاً دو نمونه ثابت دارد: ``True`` و ``False``.

source: The built-in function :func:`bool` converts any value to a boolean, if the value can be interpreted as a truth value (see section :ref:`truth` above).
fa: تابع داخلی :func:`bool` هر مقداری را به یک بولی تبدیل می کند، در صورتی که مقدار را بتوان به عنوان یک مقدار واقعی تفسیر کرد (به بخش :ref:`truth` در بالا مراجعه کنید).

source: For logical operations, use the :ref:`boolean operators <boolean>` ``and``, ``or`` and ``not``. When applying the bitwise operators ``&``, ``|``, ``^`` to two booleans, they return a bool equivalent to the logical operations "and", "or", "xor". However, the logical operators ``and``, ``or`` and ``!=`` should be preferred over ``&``, ``|`` and ``^``.
fa: برای عملیات منطقی، از :ref:`boolean operators <boolean>` ``and``، ``or`` و ``not`` استفاده کنید. هنگامی که عملگرهای بیتی ``&``، ``|``، ``^`` را به دو بولی اعمال می‌کنند، آنها یک Bool معادل عملیات منطقی "and"، "or"، "xor" برمی‌گردانند. با این حال، عملگرهای منطقی ``and``، ``or`` و ``!=`` باید بر ``&``، ``|`` و ``^`` ترجیح داده شوند.

source: The use of the bitwise inversion operator ``~`` is deprecated and will raise an error in Python 3.16.
fa: استفاده از عملگر معکوس بیتی ``~`` منسوخ شده است و باعث بروز خطا در پایتون 3.16 می شود.

source: :class:`bool` is a subclass of :class:`int` (see :ref:`typesnumeric`). In many numeric contexts, ``False`` and ``True`` behave like the integers 0 and 1, respectively. However, relying on this is discouraged; explicitly convert using :func:`int` instead.
fa: :class:`bool` زیر کلاس :class:`int` است (به :ref:`typesnumeric` مراجعه کنید). در بسیاری از زمینه های عددی، ``False`` و ``True`` به ترتیب مانند اعداد صحیح 0 و 1 رفتار می کنند. با این حال، تکیه بر این دلسرد می شود; در عوض با استفاده از :func:`int` به صراحت تبدیل کنید.

source: Iterator Types
fa: انواع تکرار کننده
ru: Типы итераторов
uk: Типи ітераторів

source: Python supports a concept of iteration over containers. This is implemented using two distinct methods; these are used to allow user-defined classes to support iteration. Sequences, described below in more detail, always support the iteration methods.
fa: پایتون از مفهوم تکرار بر روی کانتینرها پشتیبانی می کند. این با استفاده از دو روش مجزا اجرا می شود. اینها برای اجازه دادن به کلاس های تعریف شده توسط کاربر برای پشتیبانی از تکرار استفاده می شوند. توالی‌هایی که در زیر با جزئیات بیشتر توضیح داده شده‌اند، همیشه از روش‌های تکرار پشتیبانی می‌کنند.
ru: Python поддерживает концепцию итерации по контейнерам. Это реализуется с использованием двух разных методов; они используются для того, чтобы пользовательские классы могли поддерживать итерацию. Последовательности, более подробно описанные ниже, всегда поддерживают итерационные методы.
uk: Python підтримує концепцію ітерації над контейнерами. Це реалізується за допомогою двох різних методів; вони використовуються, щоб дозволити визначеним користувачем класам підтримувати ітерацію. Послідовності, описані нижче більш детально, завжди підтримують ітераційні методи.

source: One method needs to be defined for container objects to provide :term:`iterable` support:
fa: برای پشتیبانی از :term:`iterable` باید یک روش برای اشیاء کانتینر تعریف شود:
ru: Для объектов-контейнеров необходимо определить один метод, чтобы обеспечить поддержку :term:`iterable`:
uk: Потрібно визначити один метод для об’єктів-контейнерів, щоб забезпечити підтримку :term:`iterable`:

source: Return an :term:`iterator` object. The object is required to support the iterator protocol described below. If a container supports different types of iteration, additional methods can be provided to specifically request iterators for those iteration types. (An example of an object supporting multiple forms of iteration would be a tree structure which supports both breadth-first and depth-first traversal.) This method corresponds to the :c:member:`~PyTypeObject.tp_iter` slot of the type structure for Python objects in the Python/C API.
fa: یک شی :term:`iterator` را برگردانید. شی برای پشتیبانی از پروتکل تکرار کننده که در زیر توضیح داده شده است مورد نیاز است. اگر ظرفی از انواع مختلف تکرار پشتیبانی می‌کند، می‌توان روش‌های دیگری را برای درخواست تکرارکننده‌های خاص برای آن انواع تکرار ارائه کرد. (نمونه‌ای از یک شی که از چندین شکل تکرار پشتیبانی می‌کند, ساختار درختی است که هم پیمایش اول عرض و هم از پیمایش عمق را پشتیبانی می‌کند.) این روش مطابق با شکاف :c:member:`~PyTypeObject.tp_iter` ساختار نوع برای اشیاء پایتون در Python/C API است.
ru: Верните объект :term:`iterator`. Объект должен поддерживать протокол итератора, описанный ниже. Если контейнер поддерживает разные типы итераций, можно предоставить дополнительные методы для специального запроса итераторов для этих типов итераций. (Примером объекта, поддерживающего несколько форм итерации, может быть древовидная структура, которая поддерживает обход как в ширину, так и в глубину.) Этот метод соответствует методу :c:member:`~PyTypeObject.tp_iter` слот структуры типа для объектов Python в API Python/C.
uk: Повертає об’єкт :term:`iterator`. Об’єкт повинен підтримувати описаний нижче протокол ітератора. Якщо контейнер підтримує різні типи ітерацій, можна надати додаткові методи для спеціального запиту ітераторів для цих типів ітерацій. (Прикладом об’єкта, що підтримує кілька форм ітерації, може бути деревоподібна структура, яка підтримує обхід як у ширину, так і в глибину.) Цей метод відповідає слоту :c:member:`~PyTypeObject.tp_iter` структури типу для об’єктів Python в API Python/C.

source: The iterator objects themselves are required to support the following two methods, which together form the :dfn:`iterator protocol`:
fa: خود اشیاء iterator باید از دو روش زیر پشتیبانی کنند که با هم پروتکل :dfn:` iterator را تشکیل می دهند:
ru: Сами объекты итератора должны поддерживать следующие два метода, которые вместе образуют :dfn:`протокол итератора`:
uk: Самі об’єкти ітератора повинні підтримувати наступні два методи, які разом утворюють :dfn:`iterator protocol`:
