Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: fa, ru, uk

source: This method sorts the list in place, using only ``<`` comparisons between items. Exceptions are not suppressed - if any comparison operations fail, the entire sort operation will fail (and the list will likely be left in a partially modified state).
fa: این روش با استفاده از مقایسه ``<`` بین موارد، لیست را در جای خود مرتب می کند. استثناها سرکوب نمی شوند - اگر هر یک از عملیات مقایسه با شکست مواجه شود، کل عملیات مرتب سازی با شکست مواجه می شود (و لیست احتمالاً در یک حالت اصلاح شده باقی می ماند).
ru: Этот метод сортирует список на месте, используя только ``<`` сравнения между предметами. Исключения не подавляются: если какие-либо операции сравнения завершатся неудачно, вся операция сортировки завершится неудачно (и список, скорее всего, останется в частично измененном состоянии).
uk: Цей метод сортує список на місці, використовуючи лише ``<`` порівняння між елементами. Винятки не пригнічуються — якщо будь-яка операція порівняння завершиться невдало, вся операція сортування буде невдалою (і список, ймовірно, залишиться в частково зміненому стані).

source: :meth:`sort` accepts two arguments that can only be passed by keyword (:ref:`keyword-only arguments <keyword-only_parameter>`):
fa: :meth:`sort` دو آرگومان را می پذیرد که فقط با کلمه کلیدی (:ref:`keyword-only arguments <keyword-only_parameter>`) قابل ارسال هستند:
ru: :meth:`сортировка` принимает два аргумента, которые могут быть переданы только по ключевому слову (:ref:`keyword-only аргументы `):
uk: :meth:`sort` приймає два аргументи, які можуть бути передані лише ключовим словом (:ref:`аргументи лише для ключових слів <keyword-only_parameter>`):

source: *key* specifies a function of one argument that is used to extract a comparison key from each list element (for example, ``key=str.lower``). The key corresponding to each item in the list is calculated once and then used for the entire sorting process. The default value of ``None`` means that list items are sorted directly without calculating a separate key value.
fa: *key* تابعی از یک آرگومان را مشخص می کند که برای استخراج یک کلید مقایسه از هر عنصر لیست (مثلا ``key=str.lower``) استفاده می شود. کلید مربوط به هر مورد در لیست یک بار محاسبه می شود و سپس برای کل فرآیند مرتب سازی استفاده می شود. مقدار پیش‌فرض ``None`` به این معنی است که آیتم‌های لیست مستقیماً بدون محاسبه مقدار کلید جداگانه مرتب می‌شوند.
ru: *key* определяет функцию одного аргумента, которая используется для извлечения ключа сравнения из каждого элемента списка (например, ``key=str.lower`` ). Ключ, соответствующий каждому элементу списка, вычисляется один раз и затем используется для всего процесса сортировки. Значение по умолчанию ``Нет`` означает, что элементы списка сортируются напрямую, без вычисления отдельного значения ключа.
uk: *key* визначає функцію одного аргументу, яка використовується для отримання ключа порівняння з кожного елемента списку (наприклад, ``key=str.lower``). Ключ, що відповідає кожному елементу в списку, обчислюється один раз, а потім використовується для всього процесу сортування. Значення за замовчуванням "Немає" означає, що елементи списку сортуються безпосередньо без обчислення окремого значення ключа.

source: The :func:`functools.cmp_to_key` utility is available to convert a 2.x style *cmp* function to a *key* function.
fa: ابزار :func:`functools.cmp_to_key` برای تبدیل تابع *cmp* سبک 2.x به تابع *key* در دسترس است.
ru: The :func:`functools.cmp_to_key` доступна утилита для преобразования функции *cmp* в стиле версии 2.x в функцию *key*.
uk: Утиліта :func:`functools.cmp_to_key` доступна для перетворення функції *cmp* у стилі 2.x на функцію *key*.

source: *reverse* is a boolean value. If set to ``True``, then the list elements are sorted as if each comparison were reversed.
fa: *reverse* یک مقدار بولی است. اگر روی ``True`` تنظیم شود، عناصر لیست طوری مرتب می شوند که گویی هر مقایسه معکوس شده است.
ru: *reverse* - логическое значение. Если установлено значение ``True``, то элементы списка сортируются так, как если бы каждое сравнение было обратным.
uk: *reverse* — це логічне значення. Якщо встановлено значення ``True``, елементи списку сортуються так, ніби кожне порівняння було зворотним.

source: This method modifies the sequence in place for economy of space when sorting a large sequence. To remind users that it operates by side effect, it does not return the sorted sequence (use :func:`sorted` to explicitly request a new sorted list instance).
fa: این روش هنگام مرتب‌سازی یک توالی بزرگ، توالی را برای صرفه‌جویی در فضا تغییر می‌دهد. برای یادآوری به کاربران که با اثر جانبی عمل می کند، دنباله مرتب شده را بر نمی گرداند (از :func:`sorted` برای درخواست صریح یک نمونه لیست مرتب شده جدید استفاده کنید).
ru: Этот метод изменяет последовательность на месте для экономии места при сортировке большой последовательности. Чтобы напомнить пользователям, что он работает побочным эффектом, он не возвращает отсортированную последовательность (используйте :func:`отсортировано` для явного запроса нового экземпляра отсортированного списка).
uk: Цей метод змінює наявну послідовність для економії простору під час сортування великої послідовності. Щоб нагадати користувачам, що він працює за побічним ефектом, він не повертає відсортовану послідовність (використовуйте :func:`sorted`, щоб явно запитати новий екземпляр відсортованого списку).

source: The :meth:`sort` method is guaranteed to be stable. A sort is stable if it guarantees not to change the relative order of elements that compare equal --- this is helpful for sorting in multiple passes (for example, sort by department, then by salary grade).
fa: روش :meth:`sort` تضمین شده است که پایدار است. مرتب‌سازی پایدار است اگر تضمین کند که ترتیب نسبی عناصری که با هم مقایسه می‌شوند تغییر نمی‌کند --- این برای مرتب‌سازی در چند پاس مفید است (مثلاً مرتب‌سازی بر اساس بخش, سپس بر اساس درجه حقوق).
ru: The :meth:`сортировка` метод гарантированно стабилен. Сортировка является стабильной, если она гарантирует отсутствие изменения относительного порядка элементов, которые сравниваются равными. Это полезно при сортировке за несколько проходов (например, сортировка по отделу, а затем по уровню заработной платы).
uk: Метод :meth:`sort` гарантовано буде стабільним. Сортування є стабільним, якщо воно гарантує відсутність зміни відносного порядку порівнюваних рівних елементів --- це корисно для сортування за кілька проходів (наприклад, сортування за відділом, а потім за ступенем зарплати).

source: For sorting examples and a brief sorting tutorial, see :ref:`sortinghowto`.
fa: برای نمونه‌های مرتب‌سازی و یک آموزش مختصر مرتب‌سازی، به :ref:`sortinghowto` مراجعه کنید.
ru: Для примеров сортировки и краткого руководства по сортировке см. :ref:`sortinghowto`.
uk: Приклади сортування та короткий посібник із сортування див. :ref:`sortinghowto`.

source: While a list is being sorted, the effect of attempting to mutate, or even inspect, the list is undefined. The C implementation of Python makes the list appear empty for the duration, and raises :exc:`ValueError` if it can detect that the list has been mutated during a sort.
fa: در حالی که یک لیست مرتب می شود، اثر تلاش برای جهش، یا حتی بازرسی، لیست تعریف نشده است. پیاده سازی C پایتون باعث می شود که لیست برای مدت زمان خالی به نظر برسد و اگر بتواند تشخیص دهد که لیست در طول مرتب سازی جهش یافته است، :exc:`ValueError` را افزایش می دهد.
ru: Пока список сортируется, эффект от попытки изменения или даже проверки списка не определен. Реализация Python на C делает список пустым на время и вызывает :exc:`ValueError` если он может обнаружить, что список был изменен во время сортировки.
uk: Поки список сортується, ефект від спроби змінити або навіть перевірити список не визначено. Реалізація Python на C робить список порожнім протягом певного часу та викликає :exc:`ValueError`, якщо він може виявити, що список було змінено під час сортування.

source: Tuples
fa: تاپل ها
ru: Кортежи
uk: Кортежі

source: Tuples are immutable sequences, typically used to store collections of heterogeneous data (such as the 2-tuples produced by the :func:`enumerate` built-in). Tuples are also used for cases where an immutable sequence of homogeneous data is needed (such as allowing storage in a :class:`set` or :class:`dict` instance).
fa: تاپل ها توالی های تغییرناپذیری هستند که معمولاً برای ذخیره مجموعه ای از داده های ناهمگن استفاده می شوند (مانند 2 تاپل تولید شده توسط :func:`enumerate` داخلی). تاپل ها همچنین برای مواردی استفاده می شوند که به دنباله ای تغییرناپذیر از داده های همگن نیاز است (مانند اجازه ذخیره سازی در یک نمونه :class:`set` یا :class:`dict`).
ru: Кортежи — это неизменяемые последовательности, обычно используемые для хранения коллекций гетерогенных данных (например, двухкортежей, созданных :func:`перечислить` встроенный). Кортежи также используются в случаях, когда необходима неизменяемая последовательность однородных данных (например, для хранения в :класс:`набор` или :class:`dict` пример).
uk: Кортежі — це незмінні послідовності, які зазвичай використовуються для зберігання колекцій різнорідних даних (таких як 2-кортежі, створені за допомогою вбудованої функції :func:`enumerate`). Кортежі також використовуються у випадках, коли потрібна незмінна послідовність однорідних даних (наприклад, дозволити зберігання в екземплярі :class:`set` або :class:`dict`).

source: Tuples may be constructed in a number of ways:
fa: تاپل ها ممکن است به روش های مختلفی ساخته شوند:
ru: Кортежи могут быть созданы несколькими способами:
uk: Кортежі можна побудувати кількома способами:

source: Using a pair of parentheses to denote the empty tuple: ``()``
fa: استفاده از یک جفت پرانتز برای نشان دادن تاپل خالی: ``()``
ru: Использование пары круглых скобок для обозначения пустого кортежа: ``()``
uk: Використання пари круглих дужок для позначення порожнього кортежу: ``()``

source: Using a trailing comma for a singleton tuple: ``a,`` or ``(a,)``
fa: استفاده از کاما انتهایی برای یک تاپل تکی: ``a,`` یا ``(a,)``
ru: Использование завершающей запятой для одноэлементного кортежа: ``а,`` или ``(а,)``
uk: Використання кінцевої коми для одноэлементного кортежу: ``a,`` або ``(a,)``

source: Separating items with commas: ``a, b, c`` or ``(a, b, c)``
fa: جداسازی موارد با کاما: ``a, b, c`` یا ``(a, b, c)``
ru: Разделение элементов запятыми: ``а, б, в`` или ``(а, б, в)``
uk: Розділення елементів комами: ``a, b, c`` або ``(a, b, c)``

source: Using the :func:`tuple` built-in: ``tuple()`` or ``tuple(iterable)``
fa: استفاده از :func:`tuple` داخلی: ``tuple()`` یا ``tuple(iterable)``
ru: Используя :func:`кортеж` встроенный: ``кортеж()`` или ``кортеж(итерируемый)''
uk: Використання вбудованого :func:`tuple`: ``tuple()`` або ``tuple(iterable)``

source: The constructor builds a tuple whose items are the same and in the same order as *iterable*'s items. *iterable* may be either a sequence, a container that supports iteration, or an iterator object. If *iterable* is already a tuple, it is returned unchanged. For example, ``tuple('abc')`` returns ``('a', 'b', 'c')`` and ``tuple( [1, 2, 3] )`` returns ``(1, 2, 3)``. If no argument is given, the constructor creates a new empty tuple, ``()``.
fa: سازنده یک تاپل می‌سازد که آیتم‌های آن مشابه و به ترتیب آیتم‌های *iterable* هستند. *iterable* ممکن است یک دنباله باشد، یک ظرف که از تکرار پشتیبانی می کند، یا یک شی تکرار شونده. اگر *iterable* قبلاً یک تاپل باشد، بدون تغییر برگردانده می شود. برای مثال، ``tuple('abc')`` ``('a', 'b', 'c')`` و ``tuple( [1, 2, 3] )`` ``(1, 2, 3)`` را برمی گرداند. اگر هیچ آرگومانی داده نشود، سازنده یک تاپل خالی جدید به نام ``()`` ایجاد می کند.
ru: Конструктор создает кортеж, элементы которого такие же и в том же порядке, что и элементы *iterable*. *iterable* может быть последовательностью, контейнером, поддерживающим итерацию, или объектом-итератором. Если *iterable* уже является кортежем, он возвращается без изменений. Например, ``кортеж('abc')`` возвращает ``('a', 'b', 'c')`` и ``кортеж( [1, 2, 3] )`` возвращает ``(1, 2, 3)`` . Если аргумент не указан, конструктор создает новый пустой кортеж. ``()`` .
uk: Конструктор будує кортеж, елементи якого є такими ж і в тому ж порядку, що й елементи *iterable*. *iterable* може бути або послідовністю, контейнером, який підтримує ітерацію, або об’єктом ітератора. Якщо *iterable* вже є кортежем, він повертається без змін. Наприклад, ``tuple('abc')`` повертає ``('a', 'b', 'c')``, ``tuple( [1, 2, 3] )`` повертає ``( 1, 2, 3)``. Якщо аргумент не задано, конструктор створює новий порожній кортеж ``()``.

source: Note that it is actually the comma which makes a tuple, not the parentheses. The parentheses are optional, except in the empty tuple case, or when they are needed to avoid syntactic ambiguity. For example, ``f(a, b, c)`` is a function call with three arguments, while ``f((a, b, c))`` is a function call with a 3-tuple as the sole argument.
fa: توجه داشته باشید که در واقع کاما است که تاپل را می سازد، نه پرانتز. پرانتزها اختیاری هستند، به جز در حالت تاپلی خالی، یا زمانی که برای جلوگیری از ابهام نحوی مورد نیاز هستند. به عنوان مثال، ``f(a, b, c)`` یک فراخوانی تابع با سه آرگومان است، در حالی که ``f((a, b, c))`` یک فراخوانی تابع با 3-tuple به عنوان تنها آرگومان است.
ru: Обратите внимание, что на самом деле кортеж образует запятая, а не круглые скобки. Круглые скобки необязательны, за исключением случая пустого кортежа или случаев, когда они необходимы во избежание синтаксической двусмысленности. Например, ``f(a, b, c)`` — это вызов функции с тремя аргументами, а ``f((a, b, c))`` — это вызов функции с тройкой в ​​качестве единственного аргумента.
uk: Зауважте, що насправді кома створює кортеж, а не круглі дужки. Дужки необов’язкові, за винятком порожнього кортежу або коли вони потрібні для уникнення синтаксичної неоднозначності. Наприклад, "f(a, b, c)" — це виклик функції з трьома аргументами, тоді як "f((a, b, c))" — це виклик функції з 3-кортежем як єдиним аргумент.

source: Tuples implement all of the :ref:`common <typesseq-common>` sequence operations.
fa: Tuples تمام عملیات توالی :ref:`common <typesseq-common>` را اجرا می کند.
ru: Кортежи реализуют все :ref:`common `последовательность операций.
uk: Кортежі реалізують усі :ref:`загальні <typesseq-common>` операції послідовності.

source: For heterogeneous collections of data where access by name is clearer than access by index, :func:`collections.namedtuple` may be a more appropriate choice than a simple tuple object.
fa: برای مجموعه‌های ناهمگن از داده‌ها که دسترسی به نام واضح‌تر از دسترسی به فهرست است، :func:`collections.namedtuple` ممکن است انتخاب مناسب‌تری نسبت به یک شی چندگانه ساده باشد.
ru: Для разнородных коллекций данных, где доступ по имени более понятен, чем доступ по индексу, :func:`collections.namedtuple` может быть более подходящим выбором, чем простой объект-кортеж.
uk: Для різнорідних колекцій даних, де доступ за іменем є зрозумілішим, ніж доступ за індексом, :func:`collections.namedtuple` може бути більш відповідним вибором, ніж простий об’єкт кортежу.

source: Ranges
fa: محدوده ها
ru: Диапазоны
uk: діапазони

source: The :class:`range` type represents an immutable sequence of numbers and is commonly used for looping a specific number of times in :keyword:`for` loops.
fa: نوع :class:`range` نشان دهنده یک دنباله غیرقابل تغییر از اعداد است و معمولاً برای حلقه زدن تعداد مشخصی از بارها در حلقه های :keyword:`for` استفاده می شود.
ru: The :class:`диапазон` Тип представляет неизменяемую последовательность чисел и обычно используется для повторения определенного количества раз в :keyword:`для` петли.
uk: Тип :class:`range` представляє незмінну послідовність чисел і зазвичай використовується для повторення певної кількості разів у циклах :keyword:`for`.

source: The arguments to the range constructor must be integers (either built-in :class:`int` or any object that implements the :meth:`~object.__index__` special method). If the *step* argument is omitted, it defaults to ``1``. If the *start* argument is omitted, it defaults to ``0``. If *step* is zero, :exc:`ValueError` is raised.
fa: آرگومان های سازنده محدوده باید اعداد صحیح باشند (یا :class:`int` داخلی یا هر شیئی که متد ویژه :meth:`~object.__index__` را پیاده سازی می کند). اگر آرگومان *step* حذف شود، به طور پیش فرض روی ``1`` قرار می گیرد. اگر آرگومان *start* حذف شود، به طور پیش فرض روی ``0`` قرار می گیرد. اگر *step* صفر باشد، :exc:`ValueError` افزایش می یابد.
ru: Аргументы конструктора диапазона должны быть целыми числами (либо встроенными, либо встроенными). :класс:`int` или любой объект, реализующий :meth:`~object.__index__` специальный метод). Если аргумент *step* опущен, по умолчанию используется значение ``1`` . Если аргумент *start* опущен, по умолчанию используется значение ``0`` . Если *шаг* равен нулю, :exc:`ValueError` поднят.
uk: Аргументи конструктора діапазону мають бути цілими числами (або вбудованим :class:`int`, або будь-яким об’єктом, який реалізує спеціальний метод :meth:`~object.__index__`). Якщо аргумент *step* опущено, за умовчанням він дорівнює ``1``. Якщо аргумент *початок* опущено, за умовчанням він дорівнює ``0``. Якщо *крок* дорівнює нулю, виникає :exc:`ValueError`.

source: For a positive *step*, the contents of a range ``r`` are determined by the formula ``r[i] = start + step*i`` where ``i >= 0`` and ``r[i] < stop``.
fa: برای *step* مثبت، محتویات یک محدوده ``r`` با فرمول ``r[i] = start + step*i`` که در آن ``i >= 0`` و ``r[i] < stop`` تعیین می شود.
ru: Для положительного *шага* содержимое диапазона ``р`` определяются по формуле ``r[i] = начало + шаг*i`` где ``я >= 0`` и ``r[i] <стоп`` .
uk: Для позитивного *кроку* вміст діапазону ``r`` визначається за формулою ``r[i] = start + step*i``, де ``i >= 0`` і ``r[ i] < stop``.

source: For a negative *step*, the contents of the range are still determined by the formula ``r[i] = start + step*i``, but the constraints are ``i >= 0`` and ``r[i] > stop``.
fa: برای *step* منفی، محتویات محدوده همچنان با فرمول ``r[i] = start + step*i`` تعیین می شود، اما محدودیت ها ``i >= 0`` و ``r[i] > stop`` هستند.
ru: При отрицательном *шаге* содержимое диапазона по-прежнему определяется по формуле ``r[i] = начало + шаг*i`` , но ограничения ``я >= 0`` и ``r[i] > стоп`` .
uk: Для від’ємного *кроку* вміст діапазону все ще визначається формулою ``r[i] = start + step*i``, але обмеження ``i >= 0`` і ``r[ i] > stop``.

source: A range object will be empty if ``r[0]`` does not meet the value constraint. Ranges do support negative indices, but these are interpreted as indexing from the end of the sequence determined by the positive indices.
fa: اگر ``r[0]`` محدودیت مقدار را برآورده نکند، یک شی محدوده خالی خواهد بود. محدوده ها از شاخص های منفی پشتیبانی می کنند، اما این شاخص ها به عنوان نمایه سازی از انتهای دنباله تعیین شده توسط شاخص های مثبت تفسیر می شوند.
ru: Объект диапазона будет пустым, если ``r[0]`` не соответствует ценностному ограничению. Диапазоны поддерживают отрицательные индексы, но они интерпретируются как индексация с конца последовательности, определяемой положительными индексами.
uk: Об’єкт діапазону буде порожнім, якщо ``r[0]`` не відповідає обмеженню значення. Діапазони підтримують негативні індекси, але вони інтерпретуються як індексування з кінця послідовності, визначеної позитивними індексами.

source: Ranges containing absolute values larger than :data:`sys.maxsize` are permitted but some features (such as :func:`len`) may raise :exc:`OverflowError`.
fa: محدوده های حاوی مقادیر مطلق بزرگتر از :data:`sys.maxsize` مجاز هستند، اما برخی از ویژگی ها (مانند :func:`len`) ممکن است :exc:`OverflowError` را افزایش دهند.
ru: Диапазоны, содержащие абсолютные значения, превышающие :data:`sys.maxsize` разрешены, но некоторые функции (например, :func:`лен` ) может поднять :exc:`OverflowError` .
uk: Діапазони, що містять абсолютні значення, більші за :data:`sys.maxsize`, дозволені, але деякі функції (такі як :func:`len`) можуть викликати :exc:`OverflowError`.

source: Range examples::
fa: نمونه های محدوده::
ru: Примеры диапазонов::
uk: Приклади асортименту::

source: Ranges implement all of the :ref:`common <typesseq-common>` sequence operations except concatenation and repetition (due to the fact that range objects can only represent sequences that follow a strict pattern and repetition and concatenation will usually violate that pattern).
fa: محدوده ها همه عملیات دنباله :ref:`common <typesseq-common>` را به جز الحاق و تکرار اجرا می کنند (به دلیل این واقعیت که اشیاء محدوده فقط می توانند دنباله هایی را نشان دهند که از یک الگوی دقیق پیروی می کنند و تکرار و الحاق معمولاً آن الگو را نقض می کند).
ru: Диапазоны реализуют все :ref:`common ` операции с последовательностями, за исключением конкатенации и повторения (поскольку объекты диапазона могут представлять только последовательности, которые следуют строгому шаблону, а повторение и конкатенация обычно нарушают этот шаблон).
uk: Діапазони реалізують усі :ref:`загальні <typesseq-common>` операції послідовності, окрім конкатенації та повторення (через те, що об’єкти діапазону можуть представляти лише послідовності, які дотримуються строгого шаблону, а повторення та конкатенація зазвичай порушують цей шаблон).

source: The value of the *start* parameter (or ``0`` if the parameter was not supplied)
fa: مقدار پارامتر *start* (یا ``0`` اگر پارامتر ارائه نشده باشد)
ru: Значение параметра *start* (или ``0`` если параметр не был указан)
uk: Значення параметра *start* (або ``0``, якщо параметр не було надано)

source: The value of the *stop* parameter
fa: مقدار پارامتر *stop*
ru: Значение параметра *stop*
uk: Значення параметра *stop*

source: The value of the *step* parameter (or ``1`` if the parameter was not supplied)
fa: مقدار پارامتر *step* (یا ``1`` اگر پارامتر ارائه نشده باشد)
ru: Значение параметра *step* (или ``1`` если параметр не был указан)
uk: Значення параметра *step* (або ``1``, якщо параметр не було надано)

source: The advantage of the :class:`range` type over a regular :class:`list` or :class:`tuple` is that a :class:`range` object will always take the same (small) amount of memory, no matter the size of the range it represents (as it only stores the ``start``, ``stop`` and ``step`` values, calculating individual items and subranges as needed).
fa: مزیت نوع :class:`range` نسبت به یک :class:`list` یا :class:`tuple` معمولی این است که یک شی :class:`range` همیشه همان مقدار (کم) حافظه را اشغال می کند، صرف نظر از اندازه محدوده ای که نشان می دهد (زیرا فقط مقادیر ``start``, ``stop`` و ``step`` را ذخیره می کند و مقادیر مورد نیاز را به صورت جداگانه محاسبه می کند).
ru: Преимущество :class:`диапазон` печатать поверх обычного :class:`список` или :class:`кортеж` это :class:`диапазон` объект всегда будет занимать один и тот же (небольшой) объем памяти, независимо от размера представляемого им диапазона (поскольку он хранит только ``старт`` , ``стоп`` и ``шаг`` значений, вычисляя отдельные позиции и поддиапазоны по мере необходимости).
uk: Перевага типу :class:`range` перед звичайним :class:`list` або :class:`tuple` полягає в тому, що об’єкт :class:`range` завжди займатиме однаковий (невеликий) обсяг пам’яті, ні не має значення розмір діапазону, який він представляє (оскільки він зберігає лише значення ``start``, ``stop`` і ``step``, обчислюючи окремі елементи та піддіапазони за потреби).
