Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: fa, ru, uk

source: Range objects implement the :class:`collections.abc.Sequence` ABC, and provide features such as containment tests, element index lookup, slicing and support for negative indices (see :ref:`typesseq`):
fa: اشیاء محدوده :class:`collections.abc.Sequence` ABC را پیاده‌سازی می‌کنند و ویژگی‌هایی مانند آزمایش‌های مهار، جستجوی فهرست عناصر، برش و پشتیبانی از شاخص‌های منفی را ارائه می‌کنند (به :ref:`typesseq` مراجعه کنید):
ru: Объекты диапазона реализуют :class:`collections.abc.Sequence` ABC и предоставляют такие функции, как тесты на сдерживание, поиск по индексу элементов, нарезку и поддержку отрицательных индексов (см. :ref:`typesseq` ):
uk: Об’єкти діапазону реалізують :class:`collections.abc.Sequence` ABC і надають такі функції, як тести на обмеження, пошук індексу елемента, нарізка та підтримка негативних індексів (див. :ref:`typesseq`):

source: Testing range objects for equality with ``==`` and ``!=`` compares them as sequences. That is, two range objects are considered equal if they represent the same sequence of values. (Note that two range objects that compare equal might have different :attr:`~range.start`, :attr:`~range.stop` and :attr:`~range.step` attributes, for example ``range(0) == range(2, 1, 3)`` or ``range(0, 3, 2) == range(0, 4, 2)``.)
fa: آزمایش اشیاء محدوده برای برابری با ``==`` و ``!=`` آنها را به عنوان دنباله مقایسه می کند. به این معنا که دو شی محدوده در صورتی برابر در نظر گرفته می شوند که دنباله ای از مقادیر یکسان را نشان دهند. (توجه داشته باشید که دو شی محدوده ای که با هم مقایسه می شوند ممکن است ویژگی های :attr:`~range.start`, :attr:`~range.stop` و :attr:`~range.step` متفاوتی داشته باشند, برای مثال ``range(0) == range(2, 1, 3)`` یا ``range(0, 3, 2) == range(0, 4, 2)``.)
ru: Проверка объектов диапазона на равенство с ``==`` и ``!=`` сравнивает их как последовательности. То есть два объекта диапазона считаются равными, если они представляют одну и ту же последовательность значений. (Обратите внимание, что два объекта диапазона, которые сравниваются равными, могут иметь разные :attr:`~range.start` , :attr:`~range.stop` и :attr:`~range.step` атрибуты, например ``диапазон(0) == диапазон(2, 1, 3)`` или ``диапазон(0, 3, 2) == диапазон(0, 4, 2)`` .)
uk: Перевірка об’єктів діапазону на рівність за допомогою ``==`` і ``!=`` порівнює їх як послідовності. Тобто два об’єкти діапазону вважаються рівними, якщо вони представляють однакову послідовність значень. (Зверніть увагу, що два об’єкти діапазону, які порівнюються, можуть мати різні атрибути :attr:`~range.start`, :attr:`~range.stop` і :attr:`~range.step`, наприклад ``range(0 ) == діапазон(2, 1, 3)`` або ``діапазон(0, 3, 2) == діапазон(0, 4, 2)``.)

source: Implement the Sequence ABC. Support slicing and negative indices. Test :class:`int` objects for membership in constant time instead of iterating through all items.
fa: دنباله ABC را اجرا کنید. از برش و شاخص های منفی پشتیبانی کنید. به جای تکرار در تمام موارد، اشیاء :class:`int` را برای عضویت در زمان ثابت آزمایش کنید.
ru: Реализуйте последовательность ABC. Поддержка нарезки и отрицательных индексов. Тест :класс:`int` объекты для членства в постоянное время вместо перебора всех элементов.
uk: Реалізуйте послідовність ABC. Підтримка нарізки та негативних індексів. Перевіряйте об’єкти :class:`int` на приналежність у постійному часі замість повторення всіх елементів.

source: Define '==' and '!=' to compare range objects based on the sequence of values they define (instead of comparing based on object identity).
fa: «==» و «!=» را برای مقایسه اشیاء محدوده بر اساس توالی مقادیری که تعریف می کنند (به جای مقایسه بر اساس هویت شی) تعریف کنید.
ru: Определите '==' и '!=' для сравнения объектов диапазона на основе последовательности значений, которые они определяют (вместо сравнения на основе идентичности объекта).
uk: Визначте "==" і "!=", щоб порівнювати об’єкти діапазону на основі послідовності значень, які вони визначають (замість порівняння на основі ідентичності об’єкта).

source: Added the :attr:`~range.start`, :attr:`~range.stop` and :attr:`~range.step` attributes.
fa: ویژگی های :attr:`~range.start`، :attr:`~range.stop` و :attr:`~range.step` اضافه شده است.
ru: Добавлены сайты :attr:`~range.start`, :attr:`~range.stop` и :attr:`~range.step` атрибут .

source: The `linspace recipe <https://code.activestate.com/recipes/579000-equally-spaced-numbers-linspace/>`_ shows how to implement a lazy version of range suitable for floating-point applications.
fa: `linspace recipe <https://code.activestate.com/recipes/579000-equally-spaced-numbers-linspace/>`_ نشان می دهد که چگونه می توان یک نسخه تنبل از محدوده مناسب برای برنامه های ممیز شناور را پیاده سازی کرد.

source: Text Sequence Type --- :class:`str`
fa: نوع دنباله متن --- :class:`str`
ru: Тип текстовой последовательности --- :class:`str`
uk: Тип текстової послідовності --- :class:`str`

source: Textual data in Python is handled with :class:`str` objects, or :dfn:`strings`. Strings are immutable :ref:`sequences <typesseq>` of Unicode code points. String literals are written in a variety of ways:
fa: داده های متنی در پایتون با اشیاء :class:`str` یا :dfn:`strings` مدیریت می شود. رشته ها :ref:`sequences <typesseq>` تغییرناپذیر نقاط کد یونیکد هستند. لفظ رشته ای به روش های مختلفی نوشته می شود:
ru: Текстовые данные в Python обрабатываются с помощью :class:`str` объекты или :dfn:`strings`. Строки неизменяемы :ref:`sequences ` кодовых точек Юникода. Строковые литералы записываются разными способами:
uk: Текстові дані в Python обробляються за допомогою об’єктів :class:`str` або :dfn:`strings`. Рядки є незмінними :ref:`послідовностями <typesseq>` кодових точок Unicode. Рядкові літерали записуються різними способами:

source: Single quotes: ``'allows embedded "double" quotes'``
fa: نقل قول تک: ``'allows embedded "double" quotes'``
ru: Одиночные кавычки: ``'allows embedded "double" quotes'``
uk: Одинарні лапки: ``'дозволяє вбудовані "подвійні" лапки'``

source: Double quotes: ``"allows embedded 'single' quotes"``
fa: دو نقل قول: ``"allows embedded 'single' quotes"``
ru: Двойные кавычки: ``"allows embedded 'single' quotes"``
uk: Подвійні лапки: ``"дозволяє вбудовані 'одинарні' лапки"``

source: Triple quoted: ``'''Three single quotes'''``, ``"""Three double quotes"""``
fa: نقل قول سه گانه: ``'''Three single quotes'''``، ``"""Three double quotes"""``
ru: Тройное цитирование: ``'''Three single quotes'''``, ``"""Three double quotes"""``
uk: Потрійні лапки: ``''Три одинарні лапки''''``, ``"""Три подвійні лапки"""``

source: Triple quoted strings may span multiple lines - all associated whitespace will be included in the string literal.
fa: رشته‌های نقل‌قول‌شده سه‌گانه ممکن است چندین خط را دربر گیرند - تمام فضای خالی مرتبط در رشته تحت اللفظی گنجانده می‌شود.
ru: Строки в тройных кавычках могут занимать несколько строк — все связанные пробелы будут включены в строковый литерал.
uk: Рядки з потрійними лапками можуть охоплювати кілька рядків - усі пов’язані пробіли будуть включені в рядковий літерал.

source: String literals that are part of a single expression and have only whitespace between them will be implicitly converted to a single string literal. That is, ``("spam " "eggs") == "spam eggs"``.
fa: حروف رشته ای که بخشی از یک عبارت واحد هستند و فقط فضای خالی بین آنها وجود دارد به طور ضمنی به یک رشته واحد تبدیل می شوند. یعنی ``("spam " "eggs") == "spam eggs"``.
ru: Строковые литералы, являющиеся частью одного выражения и между которыми есть только пробелы, будут неявно преобразованы в один строковый литерал. То есть, ``("спам" "яйца") == "спам яйца"`` .
uk: Рядкові літерали, які є частиною одного виразу і мають лише пробіли між собою, будуть неявно перетворені в один рядковий літерал. Тобто ``("спам " "яйця") == "спам яйця"``.

source: See :ref:`strings` for more about the various forms of string literal, including supported :ref:`escape sequences <escape-sequences>`, and the ``r`` ("raw") prefix that disables most escape sequence processing.
fa: برای اطلاعات بیشتر در مورد اشکال مختلف رشته تحت اللفظی، از جمله :ref:`escape sequences <escape-sequences>` پشتیبانی شده و پیشوند ``r`` ("خام") که اکثر پردازش دنباله فرار را غیرفعال می کند، به :ref:`strings` مراجعه کنید.
ru: Видеть :ref:`строки` подробнее о различных формах строковых литералов, включая поддерживаемые escape-последовательности. `, и ``р`` («raw») префикс, который отключает большую часть обработки escape-последовательностей.

source: Strings may also be created from other objects using the :class:`str` constructor.
fa: رشته ها همچنین ممکن است از اشیاء دیگر با استفاده از سازنده :class:`str` ایجاد شوند.
ru: Строки также могут быть созданы из других объектов с помощью :class:`str` конструктор.
uk: Рядки також можна створювати з інших об’єктів за допомогою конструктора :class:`str`.

source: Since there is no separate "character" type, indexing a string produces strings of length 1. That is, for a non-empty string *s*, ``s[0] == s[0:1]``.
fa: از آنجایی که هیچ نوع "کاراکتر" جداگانه ای وجود ندارد، نمایه سازی یک رشته رشته هایی به طول 1 تولید می کند. یعنی برای یک رشته غیر خالی *s*، ``s[0] == s[0:1]``.
ru: Поскольку отдельного типа «символ» не существует, индексация строки создает строки длины 1. То есть для непустой строки *s*, ``s[0] == s[0:1]`` .
uk: Оскільки окремого типу "символів" немає, індексування рядка створює рядки довжиною 1. Тобто для непорожнього рядка *s* ``s[0] == s[0:1]``.

source: There is also no mutable string type, but :meth:`str.join` or :class:`io.StringIO` can be used to efficiently construct strings from multiple fragments.
fa: همچنین هیچ نوع رشته قابل تغییری وجود ندارد، اما از :meth:`str.join` یا :class:`io.StringIO` می توان برای ساخت موثر رشته ها از چند قطعه استفاده کرد.
ru: Также нет изменяемого типа строки, но :meth:`str.join` или :class:`io.StringIO` может использоваться для эффективного создания строк из нескольких фрагментов.
uk: Також немає змінного типу рядка, але :meth:`str.join` або :class:`io.StringIO` можна використовувати для ефективного створення рядків із кількох фрагментів.

source: For backwards compatibility with the Python 2 series, the ``u`` prefix is once again permitted on string literals. It has no effect on the meaning of string literals and cannot be combined with the ``r`` prefix.
fa: برای سازگاری رو به عقب با سری پایتون 2، پیشوند ``u`` یک بار دیگر در حروف رشته‌ای مجاز است. این هیچ تاثیری بر معنای لفظ رشته ای ندارد و نمی توان آن را با پیشوند ``r`` ترکیب کرد.
ru: Для обратной совместимости с серией Python 2 ``в'' префикс снова разрешен для строковых литералов. Он не влияет на значение строковых литералов и не может комбинироваться с ``р`` префикс.
uk: Для зворотної сумісності з серією Python 2 префікс ``u`` знову дозволений у рядкових літералах. Він не впливає на значення рядкових літералів і не може поєднуватися з префіксом ``r``.

source: Return a :ref:`string <textseq>` version of *object*. If *object* is not provided, returns the empty string. Otherwise, the behavior of ``str()`` depends on whether *encoding* or *errors* is given, as follows.
fa: یک نسخه :ref:`string <textseq>` از *object* را برگردانید. اگر *object* ارائه نشده باشد، رشته خالی را برمی گرداند. در غیر این صورت، رفتار ``str()`` بستگی به این دارد که *encoding* یا *errors* داده شده باشد، به شرح زیر.
ru: Вернуть :ref:`строку `версия *объекта*. Если *object* не указан, возвращается пустая строка. В противном случае поведение ``стр()`` зависит от того, задано ли *кодирование* или *ошибки*, следующим образом.
uk: Повертає :ref:`string <textseq>` версію *об’єкта*. Якщо *object* не надано, повертає порожній рядок. В іншому випадку поведінка ``str()`` залежить від того, чи вказано *кодування* чи *помилки*, як показано нижче.

source: If neither *encoding* nor *errors* is given, ``str(object)`` returns :meth:`type(object).__str__(object) <object.__str__>`, which is the "informal" or nicely printable string representation of *object*. For string objects, this is the string itself. If *object* does not have a :meth:`~object.__str__` method, then :func:`str` falls back to returning :func:`repr(object) <repr>`.
fa: اگر نه *encoding* و نه *errors* داده شود، ``str(object)`` :meth:`type(object).__str__(object) <object.__str__>` را برمی گرداند، که نمایش رشته "غیررسمی" یا قابل چاپ زیبای *object* است. برای اشیاء رشته، این خود رشته است. اگر *object* روش :meth:`~object.__str__` ندارد، :func:`str` به :func:`repr(object) <repr>` برمی‌گردد.

source: If at least one of *encoding* or *errors* is given, *object* should be a :term:`bytes-like object` (e.g. :class:`bytes` or :class:`bytearray`). In this case, if *object* is a :class:`bytes` (or :class:`bytearray`) object, then ``str(bytes, encoding, errors)`` is equivalent to :meth:`bytes.decode(encoding, errors) <bytes.decode>`. Otherwise, the bytes object underlying the buffer object is obtained before calling :meth:`bytes.decode`. See :ref:`binaryseq` and :ref:`bufferobjects` for information on buffer objects.
fa: اگر حداقل یکی از *encoding* یا *errors* داده شده باشد، *object* باید :term:`bytes-like object` باشد (به عنوان مثال :class:`bytes` یا :class:`bytearray`). در این مورد، اگر *object* یک شی :class:`bytes` (یا :class:`bytearray`) باشد، ``str(bytes, encoding, errors)`` معادل :meth:`bytes.decode(encoding, errors) <bytes.decode>` است. در غیر این صورت، شی بایتی که در زیر شی بافر قرار دارد، قبل از فراخوانی :meth:`bytes.decode` به دست می آید. برای اطلاعات در مورد اشیاء بافر به :ref:`binaryseq` و :ref:`bufferobjects` مراجعه کنید.
ru: Если указан хотя бы один из *кодирования* или *ошибок*, *объект* должен быть :term:`байтоподобным объектом` (например, :class:`байты` или :class:`bytearray` ). В этом случае, если *объект* является :class:`байты` (или :class:`bytearray` ) объект, то ``str(байты, кодировка, ошибки)`` эквивалентно :meth:`bytes.decode(кодировка, ошибки) <bytes.decode>` . В противном случае объект байтов, лежащий в основе объекта буфера, получается перед вызовом. :meth:`bytes.decode` . Видеть :ref:`binaryseq` и :ref:`bufferobjects` для получения информации о буферных объектах.
uk: Якщо вказано принаймні одну з *кодування* або *помилок*, *об’єкт* має бути :term:`bytes-like object` (наприклад, :class:`bytes` або :class:`bytearray`). У цьому випадку, якщо *object* є об’єктом :class:`bytes` (або :class:`bytearray`), тоді ``str(bytes, encoding, errors)`` еквівалентно :meth:`bytes.decode (кодування, помилки) <bytes.decode>`. В іншому випадку об’єкт bytes, що лежить в основі об’єкта буфера, отримується перед викликом :meth:`bytes.decode`. Перегляньте :ref:`binaryseq` і :ref:`bufferobjects` для отримання інформації про буферні об’єкти.

source: Passing a :class:`bytes` object to :func:`str` without the *encoding* or *errors* arguments falls under the first case of returning the informal string representation (see also the :option:`-b` command-line option to Python). For example::
fa: ارسال یک شی :class:`bytes` به :func:`str` بدون آرگومان های *encoding* یا *errors* تحت اولین مورد بازگرداندن نمایش رشته غیررسمی قرار می گیرد (همچنین به گزینه خط فرمان :option:`-b` به پایتون مراجعه کنید). به عنوان مثال::
ru: Прохождение :class:`байты` возражать против :func:`str` без аргументов *encoding* или *errors* подпадает под первый случай возврата неформального строкового представления (см. также :option:`-b` опция командной строки для Python). Например::
uk: Передача об’єкта :class:`bytes` до :func:`str` без аргументів *encoding* або *errors* підпадає під перший випадок повернення неформального представлення рядка (див. також команду :option:`-b`- рядок для Python). Наприклад::

source: For more information on the ``str`` class and its methods, see :ref:`textseq` and the :ref:`string-methods` section below. To output formatted strings, see the :ref:`f-strings` and :ref:`formatstrings` sections. In addition, see the :ref:`stringservices` section.
fa: هنگام قالب‌بندی یک عدد (:class:`int`, :class:`float`, :class:`complex`, :class:`decimal.Decimal` و کلاس‌های فرعی) با نوع ``n`` (مثلاً: ``'{:n}'.format(1234)``)، این تابع به‌طور موقت محلی ``LC_CTYPE`` را به محلی ``LC_NUMERIC`` تنظیم می‌کند تا فیلدهای ``decimal_point`` و ``thousands_sep`` مربوط به :c:func:`localeconv`، در صورتی که غیر ASCII باشند یا بیشتر از 1 بایت طول داشته باشند، رمزگشایی شوند، به شرطی که محلی ``LC_NUMERIC`` با محلی ``LC_CTYPE`` متفاوت باشد. این تغییر موقت بر سایر رشته‌ها تأثیر می‌گذارد
ru: Для получения дополнительной информации о ``ул`` класс и его методы, см. :ref:`textseq` и :ref:`строковые методы` раздел ниже. Чтобы вывести форматированные строки, см. :ref:`Ф-струны` и :ref:`formatstrings` разделы. Кроме того, см. :ref:`stringservices` раздел.
uk: Додаткову інформацію про клас ``str`` і його методи див. у розділі :ref:`textseq` і :ref:`string-methods` нижче. Щоб вивести форматовані рядки, перегляньте розділи :ref:`f-strings` і :ref:`formatstrings`. Крім того, перегляньте розділ :ref:`stringservices`.

source: String Methods
fa: روش های رشته ای
ru: Методы строк
uk: Рядкові методи

source: Strings implement all of the :ref:`common <typesseq-common>` sequence operations, along with the additional methods described below.
fa: رشته ها تمام عملیات توالی :ref:`common <typesseq-common>` را به همراه روش های اضافی که در زیر توضیح داده شده است، اجرا می کنند.
ru: Строки реализуют все :ref:`common ` операции последовательности, а также дополнительные методы, описанные ниже.
uk: Рядки реалізують усі :ref:`загальні <typesseq-common>` операції послідовності разом із додатковими методами, описаними нижче.

source: Strings also support two styles of string formatting, one providing a large degree of flexibility and customization (see :meth:`str.format`, :ref:`formatstrings` and :ref:`string-formatting`) and the other based on C ``printf`` style formatting that handles a narrower range of types and is slightly harder to use correctly, but is often faster for the cases it can handle (:ref:`old-string-formatting`).
fa: رشته‌ها همچنین از دو سبک قالب‌بندی رشته پشتیبانی می‌کنند، یکی انعطاف‌پذیری و سفارشی‌سازی زیادی را ارائه می‌کند (به :meth:`str.format`, :ref:`formatstrings` و :ref:`string-formatting` مراجعه کنید) و دیگری مبتنی بر قالب‌بندی سبک C ``printf`` است که طیف باریک‌تری از انواع را مدیریت می‌کند و استفاده صحیح کمی سخت‌تر است، اما اغلب برای مواردی که می‌تواند کار کند، سریع‌تر است (:ref:`old-string-formatting`).
ru: Строки также поддерживают два стиля форматирования строк, один из которых обеспечивает большую степень гибкости и настройки (см. :meth:`str.format` , :ref:`formatstrings` и :ref:`форматирование строк` ) и другой на основе C ``printf`` форматирование стиля, которое обрабатывает более узкий диапазон типов и его немного сложнее правильно использовать, но часто быстрее в тех случаях, когда оно может обрабатываться ( :ref:`старое форматирование строк` ).
uk: Рядки також підтримують два стилі форматування рядків: один забезпечує велику гнучкість і налаштування (див. :meth:`str.format`, :ref:`formatstrings` і :ref:`string-formatting`), а інший базується на Форматування стилю C ``printf``, яке обробляє вужчий діапазон типів і трохи важче правильно використовувати, але часто швидше для випадків, які воно може обробляти (:ref:`old-string-formatting`).

source: The :ref:`textservices` section of the standard library covers a number of other modules that provide various text related utilities (including regular expression support in the :mod:`re` module).
fa: بخش :ref:`textservices` کتابخانه استاندارد تعدادی ماژول دیگر را پوشش می دهد که ابزارهای مختلف مرتبط با متن را ارائه می دهند (از جمله پشتیبانی از عبارت منظم در ماژول :mod:`re`).
ru: The :ref:`текстовые сервисы` раздел стандартной библиотеки охватывает ряд других модулей, которые предоставляют различные утилиты, связанные с текстом (включая поддержку регулярных выражений в :mod:`re` модуль).
uk: Розділ :ref:`textservices` стандартної бібліотеки охоплює низку інших модулів, які надають різноманітні утиліти, пов’язані з текстом (зокрема підтримку регулярних виразів у модулі :mod:`re`).

source: Return a copy of the string with its first character capitalized and the rest lowercased.
fa: یک کپی از رشته را با کاراکتر اول آن با حروف بزرگ و بقیه با حروف کوچک برگردانید.
ru: Верните копию строки, в которой первый символ записан с заглавной буквы, а остальные — строчными.
uk: Повертає копію рядка з великим першим символом, а решта малими.

source: The first character is now put into titlecase rather than uppercase. This means that characters like digraphs will only have their first letter capitalized, instead of the full character.
fa: کاراکتر اول در حال حاضر به جای حروف بزرگ به حروف عنوان اضافه می شود. این بدان معنی است که کاراکترهایی مانند دیگراف به جای کاراکتر کامل، فقط حرف اول خود را بزرگ می کنند.
ru: Первый символ теперь отображается в заглавном, а не в верхнем регистре. Это означает, что в таких символах, как орграфы, заглавной будет только первая буква, а не полный символ.
uk: Перший символ тепер вводиться в заголовок, а не у верхній регістр. Це означає, що такі символи, як диграфи, матимуть велику першу літеру, а не повний символ.

source: Return a casefolded copy of the string. Casefolded strings may be used for caseless matching.
fa: یک کپی تا شده از رشته را برگردانید. رشته های جعبه دار ممکن است برای تطبیق بدون کیس استفاده شوند.
ru: Верните копию строки в свёрнутом регистре. Строки в регистре можно использовать для сопоставления без регистра.
uk: Повертає згорнуту копію рядка. Для зіставлення без регістру можна використовувати рядки з регістром.

source: Casefolding is similar to lowercasing but more aggressive because it is intended to remove all case distinctions in a string. For example, the German lowercase letter ``'ß'`` is equivalent to ``"ss"``. Since it is already lowercase, :meth:`lower` would do nothing to ``'ß'``; :meth:`casefold` converts it to ``"ss"``.
fa: Casefolding شبیه به حروف کوچک است اما تهاجمی تر است زیرا در نظر گرفته شده است که تمام تمایزهای حروف را در یک رشته حذف کند. به عنوان مثال، حرف کوچک آلمانی ``'ß'`` معادل ``"ss"`` است. از آنجایی که از قبل حروف کوچک است، :meth:`lower` هیچ کاری برای ``'ß'`` انجام نمی دهد. :meth:`casefold` آن را به ``"ss"`` تبدیل می کند.
ru: Свертывание регистра похоже на преобразование нижнего регистра, но более агрессивно, поскольку оно предназначено для удаления всех различий в регистре в строке. Например, немецкая строчная буква ``'ß'`` эквивалентно ``"сс"`` . Поскольку оно уже в нижнем регистре, :meth:`нижний` ничего бы не сделал, чтобы ``'ß'`` ; :meth:`casefold` преобразует его в ``"сс"`` .
uk: Згортання регістру подібне до нижнього регістру, але більш агресивне, оскільки воно призначене для видалення всіх відмінностей регістру в рядку. Наприклад, німецька мала літера ``'ß'`` еквівалентна ``"ss"``. Оскільки це вже малий регістр, :meth:`lower` нічого не зробить для ``'ß'``; :meth:`casefold` перетворює його на ``"ss"``.

source: The casefolding algorithm is `described in section 3.13 'Default Case Folding' of the Unicode Standard <https://www.unicode.org/versions/Unicode15.1.0/ch03.pdf>`__.
fa: الگوریتم casefolding `described in section 3.13 'Default Case Folding' of the Unicode Standard <https://www.unicode.org/versions/Unicode15.1.0/ch03.pdf>`__ است.
