Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: fa, ru, uk

source: Update the set, removing elements found in others.
fa: مجموعه را به روز کنید و عناصر موجود در سایرین را حذف کنید.
ru: Обновите набор, удалив элементы, найденные в других.
uk: Оновіть набір, видаляючи елементи, знайдені в інших.

source: Update the set, keeping only elements found in either set, but not in both.
fa: مجموعه را به روز کنید، فقط عناصر موجود در هر دو مجموعه را حفظ کنید، اما نه در هر دو.
ru: Обновите набор, сохраняя только элементы, найденные в любом наборе, но не в обоих.
uk: Оновіть набір, зберігаючи лише елементи, знайдені в будь-якому наборі, але не в обох.

source: Add element *elem* to the set.
fa: عنصر *elem* را به مجموعه اضافه کنید.
ru: Добавьте в набор элемент *elem*.
uk: Додайте елемент *elem* до набору.

source: Remove element *elem* from the set. Raises :exc:`KeyError` if *elem* is not contained in the set.
fa: عنصر *elem* را از مجموعه حذف کنید. اگر *elem* در مجموعه موجود نباشد، :exc:`KeyError` را افزایش می دهد.
ru: Удалить элемент *elem* из набора. Поднимает :exc:`KeyError` если *elem* не содержится в наборе.
uk: Видалити елемент *elem* із набору. Викликає :exc:`KeyError`, якщо *elem* не міститься в наборі.

source: Remove element *elem* from the set if it is present.
fa: عنصر *elem* را در صورت وجود از مجموعه حذف کنید.
ru: Удалите элемент *elem* из набора, если он присутствует.
uk: Видалити елемент *elem* із набору, якщо він присутній.

source: Remove and return an arbitrary element from the set. Raises :exc:`KeyError` if the set is empty.
fa: یک عنصر دلخواه را از مجموعه حذف و برگردانید. اگر مجموعه خالی باشد، :exc:`KeyError` را افزایش می دهد.
ru: Удалить и вернуть произвольный элемент из набора. Поднимает :exc:`KeyError` если набор пуст.
uk: Вилучити та повернути довільний елемент із набору. Викликає :exc:`KeyError`, якщо набір порожній.

source: Remove all elements from the set.
fa: تمام عناصر را از مجموعه حذف کنید.
ru: Удалите все элементы из набора.
uk: Видаліть усі елементи з набору.

source: Note, the non-operator versions of the :meth:`update`, :meth:`intersection_update`, :meth:`difference_update`, and :meth:`symmetric_difference_update` methods will accept any iterable as an argument.
fa: توجه داشته باشید، نسخه‌های غیر عامل متدهای :meth:`update`، :meth:`intersection_update`، :meth:`difference_update`، و :meth:`symmetric_difference_update` هر تکرارپذیری را به عنوان آرگومان می‌پذیرند.
ru: Обратите внимание, что версии без оператора :meth:`обновить` , :meth:`intersection_update` , :meth:`difference_update` , и :meth:`symmetric_difference_update` методы будут принимать любую итерацию в качестве аргумента.
uk: Зауважте, що безоператорні версії методів :meth:`update`, :meth:`intersection_update`, :meth:`difference_update` і :meth:`symmetric_difference_update` прийматимуть будь-яку ітерацію як аргумент.

source: Note, the *elem* argument to the :meth:`~object.__contains__`, :meth:`remove`, and :meth:`discard` methods may be a set. To support searching for an equivalent frozenset, a temporary one is created from *elem*.
fa: توجه داشته باشید، آرگومان *elem* به متدهای :meth:`~object.__contains__`، :meth:`remove` و :meth:`discard` ممکن است یک مجموعه باشد. برای پشتیبانی از جستجوی یک منجمد معادل، یک مجموعه موقت از *elem* ایجاد می شود.
ru: Обратите внимание, что аргумент *elem* для :meth:`~object.__contains__` , :meth:`удалить` , и :meth:`выбросить` методы могут быть набором. Для поддержки поиска эквивалентного замороженного набора из *elem* создается временный набор.

source: Mapping Types --- :class:`dict`
fa: انواع نقشه برداری --- :class:`dict`
ru: Типы сопоставления --- :class:`dict`
uk: Типи зіставлення --- :class:`dict`

source: A :term:`mapping` object maps :term:`hashable` values to arbitrary objects. Mappings are mutable objects. There is currently only one standard mapping type, the :dfn:`dictionary`. (For other containers see the built-in :class:`list`, :class:`set`, and :class:`tuple` classes, and the :mod:`collections` module.)
fa: یک شی :term:`mapping` مقادیر :term:`hashable` را به اشیاء دلخواه نگاشت می کند. نگاشت ها اشیا قابل تغییر هستند. در حال حاضر تنها یک نوع نگاشت استاندارد وجود دارد، :dfn:`dictionary`. (برای سایر کانتینرها به کلاس های داخلی :class:`list`, :class:`set`, و :class:`tuple` و ماژول :mod:`collections` مراجعه کنید.)
ru: Объект :term:`mapping` отображает :term:`hashable` значения на произвольные объекты. Отображения — это изменяемые объекты. В настоящее время существует только один стандартный тип сопоставления — :dfn:`dictionary`. (Для других контейнеров см. встроенный :class:`список` , :класс:`набор` , и :class:`кортеж` занятия и :mod:`коллекции` модуль.)
uk: Об’єкт :term:`mapping` відображає значення :term:`hashable` на довільні об’єкти. Відображення є змінними об'єктами. Зараз існує лише один стандартний тип відображення, :dfn:`dictionary`. (Для інших контейнерів перегляньте вбудовані класи :class:`list`, :class:`set` і :class:`tuple`, а також модуль :mod:`collections`.)

source: A dictionary's keys are *almost* arbitrary values. Values that are not :term:`hashable`, that is, values containing lists, dictionaries or other mutable types (that are compared by value rather than by object identity) may not be used as keys. Values that compare equal (such as ``1``, ``1.0``, and ``True``) can be used interchangeably to index the same dictionary entry.
fa: کلیدهای یک فرهنگ لغت مقادیر دلخواه *almost* هستند. مقادیری که :term:`hashable` نیستند، یعنی مقادیری که شامل لیست ها، فرهنگ لغت ها یا انواع قابل تغییر هستند (که به جای هویت شی با ارزش مقایسه می شوند) نمی توانند به عنوان کلید استفاده شوند. مقادیری که با هم مقایسه می شوند (مانند ``1``, ``1.0``, و ``True``) می توانند به جای هم برای نمایه سازی یک مدخل فرهنگ لغت استفاده شوند.
ru: Ключи словаря — это *почти* произвольные значения. Значения, которые не являются :term:`хешируемыми`, то есть значения, содержащие списки, словари или другие изменяемые типы (которые сравниваются по значению, а не по идентификатору объекта), не могут использоваться в качестве ключей. Значения, которые сравниваются равными (например, ``1`` , ``1.0`` , и ``Правда`` ) можно использовать как взаимозаменяемые для индексации одной и той же словарной статьи.

source: Return a new dictionary initialized from an optional positional argument and a possibly empty set of keyword arguments.
fa: یک فرهنگ لغت جدید را که از یک آرگومان موقعیتی اختیاری و یک مجموعه احتمالاً خالی از آرگومان های کلیدواژه مقداردهی شده است، بازگردانید.
ru: Возвращает новый словарь, инициализированный необязательным позиционным аргументом и, возможно, пустым набором аргументов ключевого слова.
uk: Повертає новий словник, ініціалізований необов’язковим позиційним аргументом і, можливо, порожнім набором ключових аргументів.

source: Dictionaries can be created by several means:
fa: فرهنگ لغت را می توان به روش های مختلفی ایجاد کرد:
ru: Словари можно создавать несколькими способами:
uk: Словники можна створювати кількома способами:

source: Use a comma-separated list of ``key: value`` pairs within braces: ``{'jack': 4098, 'sjoerd': 4127}`` or ``{4098: 'jack', 4127: 'sjoerd'}``
fa: از یک لیست جدا شده با کاما از جفت های ``key: value`` در پرانتزها استفاده کنید: ``{'jack': 4098, 'sjoerd': 4127}`` یا ``{4098: 'jack', 4127: 'sjoerd'}``
ru: Используйте список разделенных запятыми ``ключ: значение`` пары в фигурных скобках: ``{'джек': 4098, 'сйорд': 4127}`` или ``{4098: 'домкрат', 4127: 'пила'}``
uk: Використовуйте розділений комами список пар ``ключ: значення`` у дужках: ``{'jack': 4098, 'sjoerd': 4127}`` або ``{4098: 'jack', 4127: 'sjoerd' }``

source: Use a dict comprehension: ``{}``, ``{x: x ** 2 for x in range(10)}``
fa: از درک دیکت استفاده کنید: ``{}``، ``{x: x ** 2 for x in range(10)}``
ru: Используйте понимание dict: ``{}`` , ``{x: x ** 2 для x в диапазоне (10)}``
uk: Використовуйте розуміння диктового слова: ``{}``, ``{x: x ** 2 для x в діапазоні (10)}``

source: Use the type constructor: ``dict()``, ``dict([('foo', 100), ('bar', 200)])``, ``dict(foo=100, bar=200)``
fa: از سازنده نوع استفاده کنید: ``dict()``، ``dict([('foo', 100), ('bar', 200)])``، ``dict(foo=100, bar=200)``
ru: Используйте конструктор типа: ``дикт()`` , ``dict([('foo', 100), ('bar', 200)])`` , ``dict(foo=100, bar=200)``
uk: Використовуйте конструктор типу: ``dict()``, ``dict([('foo', 100), ('bar', 200)])``, ``dict(foo=100, bar=200)``

source: If no positional argument is given, an empty dictionary is created. If a positional argument is given and it defines a ``keys()`` method, a dictionary is created by calling :meth:`~object.__getitem__` on the argument with each returned key from the method. Otherwise, the positional argument must be an :term:`iterable` object. Each item in the iterable must itself be an iterable with exactly two elements. The first element of each item becomes a key in the new dictionary, and the second element the corresponding value. If a key occurs more than once, the last value for that key becomes the corresponding value in the new dictionary.
fa: اگر آرگومان موقعیتی داده نشود، یک فرهنگ لغت خالی ایجاد می شود. اگر یک آرگومان موقعیتی داده شود و یک متد ``keys()`` را تعریف کند، یک فرهنگ لغت با فراخوانی :meth:`~object.__getitem__` روی آرگومان با هر کلید برگشتی از متد ایجاد می شود. در غیر این صورت، آرگومان موقعیتی باید یک شی :term:`iterable` باشد. هر مورد در تکرارپذیر باید خودش یک تکرارپذیر با دو عنصر باشد. عنصر اول هر آیتم به یک کلید در فرهنگ لغت جدید تبدیل می شود و عنصر دوم مقدار مربوطه. اگر یک کلید بیش از یک بار اتفاق بیفتد، آخرین مقدار آن کلید به مقدار مربوطه در فرهنگ لغت جدید تبدیل می شود.

source: If keyword arguments are given, the keyword arguments and their values are added to the dictionary created from the positional argument. If a key being added is already present, the value from the keyword argument replaces the value from the positional argument.
fa: اگر آرگومان های کلمه کلیدی داده شوند، آرگومان های کلیدواژه و مقادیر آنها به فرهنگ لغت ایجاد شده از آرگومان موقعیتی اضافه می شوند. اگر یک کلید در حال اضافه شدن از قبل وجود داشته باشد، مقدار آرگومان کلمه کلیدی جایگزین مقدار آرگومان موقعیتی می شود.
ru: Если заданы аргументы ключевого слова, аргументы ключевого слова и их значения добавляются в словарь, созданный на основе позиционного аргумента. Если добавляемый ключ уже присутствует, значение аргумента ключевого слова заменяет значение позиционного аргумента.
uk: Якщо надано аргументи ключового слова, аргументи ключового слова та їхні значення додаються до словника, створеного з позиційного аргументу. Якщо ключ, який додається, уже присутній, значення з аргументу ключового слова замінює значення з позиційного аргументу.

source: To illustrate, the following examples all return a dictionary equal to ``{"one": 1, "two": 2, "three": 3}``::
fa: برای نشان دادن، مثال‌های زیر همگی یک دیکشنری برابر با ``{"one": 1, "two": 2, "three": 3}`` برمی‌گردانند:
ru: Для иллюстрации: все следующие примеры возвращают словарь, равный ``{"один": 1, "два": 2, "три": 3}`` ::
uk: Для ілюстрації, усі наступні приклади повертають словник, що дорівнює ``{"one": 1, "two": 2, "three": 3}``::

source: Providing keyword arguments as in the first example only works for keys that are valid Python identifiers. Otherwise, any valid keys can be used.
fa: ارائه آرگومان های کلمه کلیدی مانند مثال اول فقط برای کلیدهایی کار می کند که شناسه پایتون معتبر هستند. در غیر این صورت، می توان از هر کلید معتبر استفاده کرد.
ru: Предоставление аргументов ключевого слова, как в первом примере, работает только для ключей, которые являются допустимыми идентификаторами Python. В противном случае можно использовать любые действительные ключи.
uk: Надання аргументів ключових слів, як у першому прикладі, працює лише для ключів, які є дійсними ідентифікаторами Python. В іншому випадку можна використовувати будь-які дійсні ключі.

source: These are the operations that dictionaries support (and therefore, custom mapping types should support too):
fa: اینها عملیاتی هستند که دیکشنری ها پشتیبانی می کنند (و بنابراین, انواع نقشه برداری سفارشی نیز باید پشتیبانی کنند):
ru: Это операции, которые поддерживают словари (и, следовательно, пользовательские типы сопоставлений также должны поддерживать):
uk: Це операції, які підтримують словники (і, отже, також повинні підтримуватися спеціальні типи зіставлення):

source: Return a list of all the keys used in the dictionary *d*.
fa: فهرستی از تمام کلیدهای استفاده شده در فرهنگ لغت *d* را برگردانید.
ru: Возвращает список всех ключей, используемых в словаре *d*.
uk: Повернути список усіх ключів, які використовуються у словнику *d*.

source: Return the number of items in the dictionary *d*.
fa: تعداد موارد موجود در فرهنگ لغت *d* را برگردانید.
ru: Возвращает количество элементов в словаре *d*.
uk: Повернути кількість елементів у словнику *d*.

source: Return the item of *d* with key *key*. Raises a :exc:`KeyError` if *key* is not in the map.
fa: مورد *d* را با کلید *key* برگردانید. اگر *key* در نقشه نباشد یک :exc:`KeyError` را افزایش می دهد.
ru: Верните элемент *d* с помощью ключа *key*. поднимает вопрос :exc:`KeyError` если *ключ* отсутствует на карте.
uk: Поверніть елемент *d* за допомогою ключа *key*. Викликає :exc:`KeyError`, якщо *key* немає на карті.

source: If a subclass of dict defines a method :meth:`__missing__` and *key* is not present, the ``d[key]`` operation calls that method with the key *key* as argument. The ``d[key]`` operation then returns or raises whatever is returned or raised by the ``__missing__(key)`` call. No other operations or methods invoke :meth:`__missing__`. If :meth:`__missing__` is not defined, :exc:`KeyError` is raised. :meth:`__missing__` must be a method; it cannot be an instance variable::
fa: اگر یک زیر کلاس از dict متد :meth:`__missing__` را تعریف کند و *key* وجود نداشته باشد، عملیات ``d[key]`` آن متد را با کلید *key* به عنوان آرگومان فراخوانی می کند. سپس عملیات ``d[key]`` هر آنچه را که توسط فراخوانی ``__missing__(key)`` برگردانده یا افزایش یافته است، برمی گرداند یا افزایش می دهد. هیچ عملیات یا روش دیگری :meth:`__missing__` را فراخوانی نمی کند. اگر :meth:`__missing__` تعریف نشده باشد، :exc:`KeyError` مطرح می شود. :meth:`__missing__` باید یک روش باشد. نمی تواند یک متغیر نمونه باشد::
ru: Если подкласс dict определяет метод :meth:`__missing__` и *ключ* отсутствует, ``d[ключ]`` операция вызывает этот метод с ключом *key* в качестве аргумента. ``d[ключ]`` затем операция возвращает или вызывает все, что возвращается или создается функцией ``__missing__(ключ)`` вызов. Никакие другие операции или методы не вызывают :meth:`__missing__` . Если :meth:`__missing__` не определено, :exc:`KeyError` поднят. :meth:`__missing__` должен быть методом; это не может быть переменная экземпляра::
uk: Якщо підклас dict визначає метод :meth:`__missing__` і *key* відсутній, операція ``d[key]`` викликає цей метод із ключем *key* як аргументом. Потім операція ``d[key]`` повертає або викликає все, що повертається або викликається викликом ``__missing__(key)``. Жодні інші операції чи методи не викликають :meth:`__missing__`. Якщо :meth:`__missing__` не визначено, виникає :exc:`KeyError`. :meth:`__missing__` має бути методом; це не може бути змінна екземпляра::

source: The example above shows part of the implementation of :class:`collections.Counter`. A different ``__missing__`` method is used by :class:`collections.defaultdict`.
fa: مثال بالا بخشی از اجرای :class:`collections.Counter` را نشان می دهد. یک روش ``__missing__`` متفاوت توسط :class:`collections.defaultdict` استفاده می شود.
ru: В приведенном выше примере показана часть реализации :class:`collections.Counter` . Другой ``__missing__`` метод используется :class:`collections.defaultdict` .
uk: Наведений вище приклад показує частину реалізації :class:`collections.Counter`. Інший метод ``__missing__`` використовується :class:`collections.defaultdict`.

source: Set ``d[key]`` to *value*.
fa: ``d[key]`` را روی *value* تنظیم کنید.
ru: Набор ``d[ключ]`` чтобы *ценить*.
uk: Установіть для ``d[key]`` значення *value*.

source: Remove ``d[key]`` from *d*. Raises a :exc:`KeyError` if *key* is not in the map.
fa: ``d[key]`` را از *d* حذف کنید. اگر *key* در نقشه نباشد یک :exc:`KeyError` را افزایش می دهد.
ru: Удалять ``d[ключ]`` от *д*. поднимает вопрос :exc:`KeyError` если *ключ* отсутствует на карте.
uk: Видаліть ``d[key]`` з *d*. Викликає :exc:`KeyError`, якщо *key* немає на карті.

source: Return ``True`` if *d* has a key *key*, else ``False``.
fa: اگر *d* دارای کلید *key* است، ``True`` را برگردانید، در غیر این صورت ``False``.
ru: Возвращаться ``Правда`` если у *d* есть ключ *key*, иначе ``Ложь`` .
uk: Повертає ``True``, якщо *d* має ключ *key*, інакше ``False``.

source: Equivalent to ``not key in d``.
fa: معادل ``not key in d``.
ru: Эквивалентно ``не вводить d`` .
uk: Еквівалент ``не вводити d``.

source: Return an iterator over the keys of the dictionary. This is a shortcut for ``iter(d.keys())``.
fa: یک تکرارکننده را روی کلیدهای فرهنگ لغت برگردانید. این یک میانبر برای ``iter(d.keys())`` است.
ru: Возвращает итератор по ключам словаря. Это ярлык для ``iter(d.keys())`` .
uk: Повертає ітератор над ключами словника. Це ярлик для ``iter(d.keys())``.

source: Remove all items from the dictionary.
fa: همه موارد را از فرهنگ لغت حذف کنید.
ru: Удалить все элементы из словаря.
uk: Видаліть усі елементи зі словника.

source: Return a shallow copy of the dictionary.
fa: یک نسخه کم عمق از فرهنگ لغت را برگردانید.
ru: Верните неполную копию словаря.
uk: Поверніть мілку копію словника.

source: Create a new dictionary with keys from *iterable* and values set to *value*.
fa: یک فرهنگ لغت جدید با کلیدهای *iterable* و مقادیر تنظیم شده روی *value* ایجاد کنید.
ru: Создайте новый словарь с ключами из *iterable* и значениями, установленными в *value*.
uk: Створіть новий словник із ключами з *iterable* і значеннями, встановленими на *value*.

source: :meth:`fromkeys` is a class method that returns a new dictionary. *value* defaults to ``None``. All of the values refer to just a single instance, so it generally doesn't make sense for *value* to be a mutable object such as an empty list. To get distinct values, use a :ref:`dict comprehension <dict>` instead.
fa: :meth:`fromkeys` یک متد کلاسی است که یک دیکشنری جدید را برمی گرداند. *value* به طور پیش فرض روی ``None`` است. همه مقادیر فقط به یک نمونه اشاره می کنند، بنابراین به طور کلی منطقی نیست که *value* یک شیء قابل تغییر مانند یک لیست خالی باشد. برای دریافت مقادیر متمایز، به جای آن از :ref:`dict comprehension <dict>` استفاده کنید.
ru: :meth:`fromkeys` — это метод класса, который возвращает новый словарь. *значение* по умолчанию равно ``Нет`` . Все значения относятся только к одному экземпляру, поэтому, как правило, не имеет смысла, чтобы *value* было изменяемым объектом, например пустым списком. Чтобы получить различные значения, используйте понимание :ref:`dict ` вместо этого.
uk: :meth:`fromkeys` — це метод класу, який повертає новий словник. *value* за замовчуванням ``None``. Усі значення стосуються лише одного екземпляра, тому загалом не має сенсу, щоб *value* було змінним об’єктом, таким як порожній список. Щоб отримати різні значення, замість цього використовуйте :ref:`dict comprehension <dict>`.

source: Return the value for *key* if *key* is in the dictionary, else *default*. If *default* is not given, it defaults to ``None``, so that this method never raises a :exc:`KeyError`.
fa: اگر *key* در فرهنگ لغت است، مقدار *key* را برگردانید، در غیر این صورت *default*. اگر *default* داده نشود، به طور پیش فرض روی ``None`` قرار می گیرد، به طوری که این روش هرگز :exc:`KeyError` را افزایش نمی دهد.
ru: Возвращает значение *key*, если *key* находится в словаре, иначе *default*. Если *default* не указано, по умолчанию используется значение ``Нет`` , так что этот метод никогда не вызывает :exc:`KeyError` .
uk: Повертає значення для *key*, якщо *key* є в словнику, інакше *за замовчуванням*. Якщо *default* не вказано, за замовчуванням буде ``None``, тому цей метод ніколи не викликає :exc:`KeyError`.

source: Return a new view of the dictionary's items (``(key, value)`` pairs). See the :ref:`documentation of view objects <dict-views>`.
fa: نمای جدیدی از موارد فرهنگ لغت (جفت ``(key, value)``) را برگردانید. :ref:`documentation of view objects <dict-views>` را ببینید.
ru: Вернуть новое представление элементов словаря ( ``(ключ, значение)`` пары). См. :ref:`документацию по объектам просмотра. `.
uk: Повертає нове подання елементів словника (пари "(ключ, значення)"). Перегляньте :ref:`документацію об’єктів перегляду <dict-views>`.

source: Return a new view of the dictionary's keys. See the :ref:`documentation of view objects <dict-views>`.
fa: نمای جدیدی از کلیدهای فرهنگ لغت را برگردانید. :ref:`documentation of view objects <dict-views>` را ببینید.
ru: Вернуть новое представление ключей словаря. См. :ref:`документацию по объектам просмотра. `.
uk: Повернути новий вигляд ключів словника. Перегляньте :ref:`документацію об’єктів перегляду <dict-views>`.

source: If *key* is in the dictionary, remove it and return its value, else return *default*. If *default* is not given and *key* is not in the dictionary, a :exc:`KeyError` is raised.
fa: اگر *key* در فرهنگ لغت است، آن را حذف کنید و مقدار آن را برگردانید، در غیر این صورت *default* را برگردانید. اگر *default* داده نشود و *key* در فرهنگ لغت نباشد، یک :exc:`KeyError` مطرح می شود.
ru: Если *key* есть в словаре, удалите его и верните его значение, иначе верните *default*. Если *default* не задано и *key* отсутствует в словаре, :exc:`KeyError` поднят.
uk: Якщо *key* є у словнику, видаліть його та поверніть його значення, інакше поверніть *default*. Якщо *default* не вказано, а *key* немає в словнику, виникає :exc:`KeyError`.

source: Remove and return a ``(key, value)`` pair from the dictionary. Pairs are returned in :abbr:`LIFO (last-in, first-out)` order.
fa: یک جفت ``(key, value)`` را از فرهنگ لغت بردارید و برگردانید. جفت ها به ترتیب :abbr: `LIFO (آخرین ورود, اولین خروج)` برگردانده می شوند.
ru: Удалить и вернуть ``(ключ, значение)`` пара из словаря. Пары возвращаются в порядке :abbr:`LIFO (последний пришел, первый ушел)`.
uk: Видалити та повернути пару ``(ключ, значення)`` зі словника. Пари повертаються в порядку :abbr:`LIFO (останній прийшов, перший вийшов)`.

source: :meth:`popitem` is useful to destructively iterate over a dictionary, as often used in set algorithms. If the dictionary is empty, calling :meth:`popitem` raises a :exc:`KeyError`.
fa: :meth:`popitem` برای تکرار مخرب در فرهنگ لغت مفید است، همانطور که اغلب در الگوریتم های مجموعه استفاده می شود. اگر فرهنگ لغت خالی باشد، فراخوانی :meth:`popitem` باعث افزایش یک :exc:`KeyError` می شود.
ru: :meth:`Я пью` полезен для деструктивного перебора словаря, что часто используется в алгоритмах множеств. Если словарь пуст, вызов :meth:`Я пью` поднимает вопрос :exc:`KeyError` .
uk: :meth:`popitem` корисний для деструктивного повторення словника, як це часто використовується в набір алгоритмів. Якщо словник порожній, виклик :meth:`popitem` викликає :exc:`KeyError`.

source: LIFO order is now guaranteed. In prior versions, :meth:`popitem` would return an arbitrary key/value pair.
fa: سفارش LIFO اکنون تضمین شده است. در نسخه های قبلی، :meth:`popitem` یک جفت کلید/مقدار دلخواه را برمی گرداند.
ru: Заказ LIFO теперь гарантирован. В предыдущих версиях :meth:`Я пью` вернет произвольную пару ключ/значение.
uk: Замовлення LIFO тепер гарантовано. У попередніх версіях :meth:`popitem` повертав довільну пару ключ/значення.

source: Return a reverse iterator over the keys of the dictionary. This is a shortcut for ``reversed(d.keys())``.
fa: یک تکرار معکوس روی کلیدهای فرهنگ لغت برگردانید. این یک میانبر برای ``reversed(d.keys())`` است.
ru: Верните обратный итератор по ключам словаря. Это ярлык для ``обратный(d.keys())`` .
uk: Повертає зворотний ітератор над ключами словника. Це ярлик для ``reversed(d.keys())``.
