Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: fa, ru, uk

source: Python defines several context managers to support easy thread synchronisation, prompt closure of files or other objects, and simpler manipulation of the active decimal arithmetic context. The specific types are not treated specially beyond their implementation of the context management protocol. See the :mod:`contextlib` module for some examples.
fa: پایتون چندین مدیر زمینه را برای پشتیبانی از همگام‌سازی رشته‌ها، بستن سریع فایل‌ها یا سایر اشیاء و دستکاری ساده‌تر زمینه حسابی اعشاری فعال تعریف می‌کند. انواع خاص به طور خاص فراتر از اجرای پروتکل مدیریت زمینه مورد توجه قرار نمی گیرند. برای چند نمونه به ماژول :mod:`contextlib` مراجعه کنید.
ru: Python определяет несколько менеджеров контекста для поддержки простой синхронизации потоков, быстрого закрытия файлов или других объектов и более простого манипулирования активным контекстом десятичной арифметики. Конкретные типы не рассматриваются специально, за исключением их реализации протокола управления контекстом. См. :mod:`contextlib` модуль для некоторых примеров.
uk: Python визначає декілька контекстних менеджерів для підтримки легкої синхронізації потоків, швидкого закриття файлів чи інших об’єктів і простішого маніпулювання активним десятковим арифметичним контекстом. Конкретні типи не розглядаються спеціально за межами їх реалізації в протоколі керування контекстом. Перегляньте модуль :mod:`contextlib` для деяких прикладів.

source: Python's :term:`generator`\s and the :class:`contextlib.contextmanager` decorator provide a convenient way to implement these protocols. If a generator function is decorated with the :class:`contextlib.contextmanager` decorator, it will return a context manager implementing the necessary :meth:`~contextmanager.__enter__` and :meth:`~contextmanager.__exit__` methods, rather than the iterator produced by an undecorated generator function.
fa: :term:`generator`\s پایتون و تزئین کننده :class:`contextlib.contextmanager` راه مناسبی برای پیاده سازی این پروتکل ها ارائه می دهند. اگر یک تابع مولد با تزئین کننده :class:`contextlib.contextmanager` تزئین شده باشد، به جای تکرار کننده تولید شده توسط یک تابع مولد تزئین نشده، مدیر زمینه ای را که روش های ضروری :meth:`~contextmanager.__enter__` و :meth:`~contextmanager.__exit__` را اجرا می کند، برمی گرداند.
ru: Python :term:`generator`\s и :class:`contextlib.contextmanager` декоратор предоставляет удобный способ реализации этих протоколов. Если функция генератора украшена :class:`contextlib.contextmanager` декоратор, он вернет контекстный менеджер, реализующий необходимые :meth:`~contextmanager.__enter__` и :meth:`~contextmanager.__exit__` методы, а не итератор, созданный недекорированной функцией-генератором.
uk: :term:`generator`\s Python і декоратор :class:`contextlib.contextmanager` забезпечують зручний спосіб реалізації цих протоколів. Якщо функція-генератор прикрашена декоратором :class:`contextlib.contextmanager`, вона повертатиме менеджер контексту, який реалізує необхідні методи :meth:`~contextmanager.__enter__` і :meth:`~contextmanager.__exit__`, а не ітератор, створений недекорованою функцією генератора.

source: Note that there is no specific slot for any of these methods in the type structure for Python objects in the Python/C API. Extension types wanting to define these methods must provide them as a normal Python accessible method. Compared to the overhead of setting up the runtime context, the overhead of a single class dictionary lookup is negligible.
fa: توجه داشته باشید که هیچ شکاف خاصی برای هیچ یک از این روش ها در ساختار نوع برای اشیاء پایتون در Python/C API وجود ندارد. انواع برنامه های افزودنی که می خواهند این روش ها را تعریف کنند باید آنها را به عنوان یک روش معمولی قابل دسترسی پایتون ارائه دهند. در مقایسه با سربار تنظیم زمینه زمان اجرا، سربار جستجوی فرهنگ لغت تک کلاس ناچیز است.
ru: Обратите внимание, что в структуре типов объектов Python в API Python/C нет специального слота для любого из этих методов. Типы расширений, желающие определить эти методы, должны предоставить их как обычный доступный метод Python. По сравнению с накладными расходами на настройку контекста времени выполнения, накладные расходы на поиск в словаре одного класса незначительны.
uk: Зауважте, що немає спеціального слота для жодного з цих методів у структурі типу для об’єктів Python в API Python/C. Типи розширень, які хочуть визначити ці методи, повинні надати їх як звичайний доступний метод Python. Порівняно з накладними витратами на налаштування контексту виконання, накладні витрати на пошук словника одного класу є незначними.

source: Type Annotation Types --- :ref:`Generic Alias <types-genericalias>`, :ref:`Union <types-union>`
fa: انواع حاشیه نویسی --- :ref:`Generic Alias <types-genericalias>`, :ref:`Union <types-union>`
ru: Тип аннотация Типы --- :ref:`обобщённый псевдоним <types-genericalias>` , :ref:`Union <types-union>`
uk: Типи анотацій типу --- :ref:`Загальний псевдонім <types-genericalias>`, :ref:`Об’єднання <types-union>`

source: The core built-in types for :term:`type annotations <annotation>` are :ref:`Generic Alias <types-genericalias>` and :ref:`Union <types-union>`.
fa: انواع هسته داخلی :term:`type annotations <annotation>` :ref:`Generic Alias <types-genericalias>` و :ref:`Union <types-union>` هستند.
ru: Основные встроенные типы для аннотаций :term:`type ` являются :ref:`Общим псевдонимом ` и :ref:`Союз`.
uk: Основними вбудованими типами для :term:`анотацій типу <annotation>` є :ref:`Generic Alias <types-genericalias>` і :ref:`Union <types-union>`.

source: Generic Alias Type
fa: نوع نام مستعار عمومی
ru: Общий тип псевдонима
uk: Загальний тип псевдоніма

source: ``GenericAlias`` objects are generally created by :ref:`subscripting <subscriptions>` a class. They are most often used with :ref:`container classes <sequence-types>`, such as :class:`list` or :class:`dict`. For example, ``list[int]`` is a ``GenericAlias`` object created by subscripting the ``list`` class with the argument :class:`int`. ``GenericAlias`` objects are intended primarily for use with :term:`type annotations <annotation>`.
fa: اشیاء ``GenericAlias`` عموماً توسط یک کلاس :ref:`subscripting <subscriptions>` ایجاد می شوند. آنها اغلب با :ref:`container classes <sequence-types>` استفاده می شوند، مانند :class:`list` یا :class:`dict`. به عنوان مثال، ``list[int]`` یک شی ``GenericAlias`` است که با اشتراک کلاس ``list`` با آرگومان :class:`int` ایجاد شده است. اشیاء ``GenericAlias`` عمدتاً برای استفاده با :term:`type annotations <annotation>` در نظر گرفته شده اند.
ru: ``GenericAlias`` объекты обычно создаются путем :ref:`подписки `класс. Чаще всего они используются с классами-контейнерами. `, например :class:`список` или :class:`dict` . Например, ``список[int]`` это ``GenericAlias`` объект, созданный путем подписки на ``список`` класс с аргументом :класс:`int` . ``GenericAlias`` объекты предназначены в первую очередь для использования с аннотациями :term:`type`.
uk: Об’єкти ``GenericAlias`` зазвичай створюються :ref:`індексом <subscriptions>` класу. Найчастіше вони використовуються з :ref:`контейнерними класами <sequence-types>`, такими як :class:`list` або :class:`dict`. Наприклад, ``list[int]`` є об’єктом ``GenericAlias``, створеним шляхом підписання класу ``list`` з аргументом :class:`int`. Об’єкти ``GenericAlias`` призначені насамперед для використання з :term:`анотаціями типу <annotation>`.

source: It is generally only possible to subscript a class if the class implements the special method :meth:`~object.__class_getitem__`.
fa: به طور کلی تنها زمانی می توان یک کلاس را زیرنویس کرد که کلاس متد خاص :meth:`~object.__class_getitem__` را پیاده سازی کند.
ru: Как правило, индексировать класс можно только в том случае, если класс реализует специальный метод. :meth:`~object.__class_getitem__` .
uk: Як правило, індекс класу можливий, лише якщо клас реалізує спеціальний метод :meth:`~object.__class_getitem__`.

source: A ``GenericAlias`` object acts as a proxy for a :term:`generic type`, implementing *parameterized generics*.
fa: یک شی ``GenericAlias`` به عنوان یک پروکسی برای یک :term:`generic type` عمل می کند و *parameterized generics* را پیاده سازی می کند.
ru: А ``GenericAlias`` объект действует как прокси для :term:`generic type`, реализуя *параметризованные дженерики*.
uk: Об’єкт ``GenericAlias`` діє як проксі для :term:`generic type`, реалізуючи *параметризовані генерики*.

source: For a container class, the argument(s) supplied to a :ref:`subscription <subscriptions>` of the class may indicate the type(s) of the elements an object contains. For example, ``set[bytes]`` can be used in type annotations to signify a :class:`set` in which all the elements are of type :class:`bytes`.
fa: برای یک کلاس کانتینری، آرگومان(های) ارائه شده به یک :ref:`subscription <subscriptions>` از کلاس ممکن است نوع(های) عناصر موجود در یک شی را نشان دهد. به عنوان مثال، ``set[bytes]`` را می توان در حاشیه نویسی نوع استفاده کرد تا به یک :class:`set` اشاره کند که در آن همه عناصر از نوع :class:`bytes` هستند.
ru: Для класса контейнера аргументы, передаваемые в :ref:`subscription ` класса может указывать тип(ы) элементов, которые содержит объект. Например, ``установить[байты]`` может использоваться в аннотациях типов для обозначения :класс:`набор` в котором все элементы имеют тип :class:`байты` .
uk: Для класу-контейнера аргумент(и), що надаються :ref:`підписці <subscriptions>` класу, може вказувати тип(и) елементів, які містить об’єкт. Наприклад, ``set[bytes]`` можна використовувати в анотаціях типу для позначення :class:`set`, у якому всі елементи мають тип :class:`bytes`.

source: For a class which defines :meth:`~object.__class_getitem__` but is not a container, the argument(s) supplied to a subscription of the class will often indicate the return type(s) of one or more methods defined on an object. For example, :mod:`regular expressions <re>` can be used on both the :class:`str` data type and the :class:`bytes` data type:
fa: برای کلاسی که :meth:`~object.__class_getitem__` را تعریف می کند اما یک کانتینر نیست، آرگومان(های) ارائه شده به اشتراک کلاس اغلب نوع(های) بازگشتی یک یا چند متد تعریف شده روی یک شی را نشان می دهد. به عنوان مثال، :mod:`regular expressions <re>` را می توان در هر دو نوع داده :class:`str` و نوع داده :class:`bytes` استفاده کرد:
ru: Для класса, который определяет :meth:`~object.__class_getitem__` но не является контейнером, аргумент(ы), предоставленный подписке на класс, часто будет указывать тип(ы) возвращаемого значения одного или нескольких методов, определенных для объекта. Например, :mod:`регулярные выражения `можно использовать как на :class:`str` тип данных и :class:`байты` тип данных:
uk: Для класу, який визначає :meth:`~object.__class_getitem__`, але не є контейнером, аргумент(и), що надаються до підписки класу, часто вказуватиме тип(и) повернення одного або кількох методів, визначених для об’єкта . Наприклад, :mod:`регулярні вирази <re>` можна використовувати як для типу даних :class:`str`, так і для типу даних :class:`bytes`:

source: If ``x = re.search('foo', 'foo')``, ``x`` will be a :ref:`re.Match <match-objects>` object where the return values of ``x.group(0)`` and ``x[0]`` will both be of type :class:`str`. We can represent this kind of object in type annotations with the ``GenericAlias`` ``re.Match[str]``.
fa: اگر ``x = re.search('foo', 'foo')``، ``x`` یک شی :ref:`re.Match <match-objects>` خواهد بود که مقادیر بازگشتی ``x.group(0)`` و ``x[0]`` هر دو از نوع :class:`str` خواهند بود. ما می توانیم این نوع شی را در حاشیه نویسی نوع با ``GenericAlias`` ``re.Match[str]`` نشان دهیم.
ru: Если ``x = re.search('foo', 'foo')`` , ``х`` будет :ref:`re.Match `объект, в котором возвращаются значения ``x.group(0)`` и ``x[0]`` оба будут типа :class:`str` . Мы можем представить этот тип объекта в аннотациях типа с помощью ``GenericAlias`` ``re.Match[str]`` .
uk: Якщо ``x = re.search('foo', 'foo')``, ``x`` буде об’єктом :ref:`re.Match <match-objects>`, де повертаються значення ``x.group(0 )`` і ``x[0]`` будуть мати тип :class:`str`. Ми можемо представити цей тип об’єктів в анотаціях типу за допомогою ``GenericAlias`` ``re.Match[str]``.

source: If ``y = re.search(b'bar', b'bar')``, (note the ``b`` for :class:`bytes`), ``y`` will also be an instance of ``re.Match``, but the return values of ``y.group(0)`` and ``y[0]`` will both be of type :class:`bytes`. In type annotations, we would represent this variety of :ref:`re.Match <match-objects>` objects with ``re.Match[bytes]``.
fa: اگر ``y = re.search(b'bar', b'bar')``، (به ``b`` برای :class:`bytes` توجه کنید)، ``y`` نیز نمونه ای از ``re.Match`` خواهد بود، اما مقادیر بازگشتی ``y.group(0)`` و ``y[0]`` هر دو از نوع :class:`bytes` خواهند بود. در حاشیه نویسی نوع، ما این تنوع از اشیاء :ref:`re.Match <match-objects>` را با ``re.Match[bytes]`` نشان می دهیم.
ru: Если ``y = re.search(b'bar', b'bar')`` , (обратите внимание на ``б`` для :class:`байты` ), ``и`` также будет примером ``re.Match`` , но возвращаемые значения ``y.group(0)`` и ``у[0]`` оба будут типа :class:`байты` . В аннотациях типов мы бы представляли эту разновидность :ref:`re.Match `объекты с ``re.Match[байты]`` .
uk: Якщо ``y = re.search(b'bar', b'bar')`` (зверніть увагу на ``b`` для :class:`bytes`), ``y`` також буде екземпляром ``re.Match``, але повертані значення ``y.group(0)`` і ``y[0]`` будуть мати тип :class:`bytes`. В анотаціях типів ми б представили цю різноманітність об’єктів :ref:`re.Match <match-objects>` за допомогою ``re.Match[bytes]``.

source: ``GenericAlias`` objects are instances of the class :class:`types.GenericAlias`, which can also be used to create ``GenericAlias`` objects directly.
fa: اشیاء ``GenericAlias`` نمونه هایی از کلاس :class:`types.GenericAlias` هستند که می توانند برای ایجاد مستقیم اشیاء ``GenericAlias`` نیز استفاده شوند.
ru: ``GenericAlias`` объекты являются экземплярами класса :class:`types.GenericAlias` , который также можно использовать для создания ``GenericAlias`` объекты напрямую.
uk: Об’єкти ``GenericAlias`` є екземплярами класу :class:`types.GenericAlias`, який також можна використовувати для безпосереднього створення об’єктів ``GenericAlias``.

source: Creates a ``GenericAlias`` representing a type ``T`` parameterized by types *X*, *Y*, and more depending on the ``T`` used. For example, a function expecting a :class:`list` containing :class:`float` elements::
fa: یک ``GenericAlias`` ایجاد می کند که نشان دهنده نوع ``T`` است که با انواع *X*، *Y* و موارد دیگر بسته به ``T`` مورد استفاده، پارامتر شده است. به عنوان مثال، تابعی که انتظار دارد یک :class:`list` حاوی عناصر :class:`float` باشد:
ru: Создает ``GenericAlias`` представляющий тип ``Т`` параметризуется типами *X*, *Y* и другими в зависимости от ``Т`` использовал. Например, функция, ожидающая :class:`список` содержащий :class:`плавать` элементы::
uk: Створює ``Generic Alias``, що представляє тип ``T``, параметризований типами *X*, *Y* тощо залежно від ``T``, що використовується. Наприклад, функція, яка очікує :class:`list`, що містить елементи :class:`float`::

source: Another example for :term:`mapping` objects, using a :class:`dict`, which is a generic type expecting two type parameters representing the key type and the value type. In this example, the function expects a ``dict`` with keys of type :class:`str` and values of type :class:`int`::
fa: مثال دیگری برای اشیاء :term:`mapping`، با استفاده از :class:`dict`، که یک نوع عمومی است و انتظار دو پارامتر نوع را دارد که نوع کلید و نوع مقدار را نشان می دهد. در این مثال، تابع یک ``dict`` با کلیدهای نوع :class:`str` و مقادیر نوع :class:`int`::
ru: Другой пример объектов :term:`mapping` с использованием :class:`dict` , который является универсальным типом, ожидающим два параметра типа, представляющие тип ключа и тип значения. В этом примере функция ожидает ``дикт`` с ключами типа :class:`str` и значения типа :класс:`int` ::
uk: Інший приклад для об’єктів :term:`mapping` з використанням :class:`dict`, який є загальним типом, який очікує двох параметрів типу, що представляють тип ключа та тип значення. У цьому прикладі функція очікує ``dict`` з ключами типу :class:`str` і значеннями типу :class:`int`::

source: The builtin functions :func:`isinstance` and :func:`issubclass` do not accept ``GenericAlias`` types for their second argument::
fa: توابع داخلی :func:`isinstance` و :func:`issubclass` انواع ``GenericAlias`` را برای آرگومان دوم خود نمی پذیرند:
ru: Встроенные функции :func:`isinstance` и :func:`issubclass` не принимать ``GenericAlias`` типы для их второго аргумента::
uk: Вбудовані функції :func:`isinstance` і :func:`issubclass` не приймають типи ``GenericAlias`` для свого другого аргументу::

source: >>> isinstance([1, 2], list[str]) Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: isinstance() argument 2 cannot be a parameterized generic
fa: >>> نمونه ([1, 2], list[str]) ردیابی (آخرین تماس اخیر): فایل "<stdin>", خط 1، در <module> TypeError: آرگومان 2 ()instance نمی تواند یک پارامتر عمومی باشد

source: The Python runtime does not enforce :term:`type annotations <annotation>`. This extends to generic types and their type parameters. When creating a container object from a ``GenericAlias``, the elements in the container are not checked against their type. For example, the following code is discouraged, but will run without errors::
fa: زمان اجرا پایتون :term:`type annotations <annotation>` را اجرا نمی کند. این به انواع عمومی و پارامترهای نوع آنها گسترش می یابد. هنگام ایجاد یک شی کانتینر از یک ``GenericAlias``، عناصر موجود در کانتینر با نوع خود بررسی نمی شوند. به عنوان مثال، کد زیر ممنوع است، اما بدون خطا اجرا می شود:
ru: Среда выполнения Python не применяет аннотации :term:`type. `. Это распространяется на универсальные типы и их параметры типа. При создании объекта-контейнера из ``GenericAlias`` , элементы в контейнере не проверяются на соответствие их типу. Например, следующий код не рекомендуется, но будет работать без ошибок:
uk: Середовище виконання Python не вимагає :term:`анотацій типу <annotation>`. Це поширюється на загальні типи та їхні параметри типу. Під час створення об’єкта-контейнера з ``GenericAlias`` елементи в контейнері не перевіряються на їх тип. Наприклад, наступний код не рекомендується, але працюватиме без помилок:

source: Furthermore, parameterized generics erase type parameters during object creation::
fa: علاوه بر این، ژنریک های پارامتری شده پارامترهای نوع را در حین ایجاد شی پاک می کنند:
ru: Более того, параметризованные дженерики стирают параметры типа во время создания объекта:
uk: Крім того, параметризовані генерики стирають параметри типу під час створення об’єкта:

source: >>> t = list[str] >>> type(t) <class 'types.GenericAlias'> >>> l = t() >>> type(l) <class 'list'>
fa: >>> t = لیست[str] >>> نوع (t) <class 'types.GenericAlias'> >>> l = t() >>> نوع (l) <class 'list'>

source: Calling :func:`repr` or :func:`str` on a generic shows the parameterized type::
fa: فراخوانی :func:`repr` یا :func:`str` در یک ژنریک نوع پارامتر شده را نشان می دهد:
ru: Вызов :func:`repr` или :func:`str` в дженерике показывает параметризованный тип::
uk: Виклик :func:`repr` або :func:`str` у загальному показує параметризований тип::

source: The :meth:`~object.__getitem__` method of generic containers will raise an exception to disallow mistakes like ``dict[str][str]``::
fa: روش :meth:`~object.__getitem__` در کانتینرهای عمومی استثنایی برای عدم اجازه اشتباهات مانند ``dict[str][str]`` ایجاد می کند:
ru: The :meth:`~object.__getitem__` метод универсальных контейнеров вызовет исключение, чтобы исключить такие ошибки, как ``дикт[стр][стр]'' ::
uk: Метод :meth:`~object.__getitem__` загальних контейнерів викличе виняток, щоб заборонити такі помилки, як ``dict[str][str]``::

source: >>> dict[str][str] Traceback (most recent call last): ... TypeError: dict[str] is not a generic class
fa: >>> dict[str][str] ردیابی (آخرین تماس اخیر): ... TypeError: dict[str] یک کلاس عمومی نیست

source: However, such expressions are valid when :ref:`type variables <generics>` are used. The index must have as many elements as there are type variable items in the ``GenericAlias`` object's :attr:`~genericalias.__args__`. ::
fa: با این حال، چنین عباراتی زمانی معتبر هستند که از :ref:`type variables <generics>` استفاده می شود. شاخص باید به تعداد عناصر متغیر نوع در :attr:`~genericalias.__args__` شی ``GenericAlias`` باشد. ::
ru: Однако такие выражения действительны, когда переменные типа :ref:` ` используются. Индекс должен содержать столько элементов, сколько элементов переменной типа имеется в индексе. ``GenericAlias`` объект :attr:`~genericalias.__args__` . ::
uk: Однак такі вирази дійсні, коли використовуються :ref:`змінні типу <generics>`. Індекс має містити стільки елементів, скільки елементів змінних типу в об’єкті ``GenericAlias`` :attr:`~genericalias.__args__`. ::

source: Standard Generic Classes
fa: کلاس های عمومی استاندارد
ru: Стандартные универсальные классы
uk: Стандартні загальні класи

source: The following standard library classes support parameterized generics. This list is non-exhaustive.
fa: کلاس های کتابخانه استاندارد زیر از ژنریک های پارامتری شده پشتیبانی می کنند. این فهرست غیر جامع است.
ru: Следующие классы стандартной библиотеки поддерживают параметризованные дженерики. Этот список не является исчерпывающим.
uk: Наступні стандартні бібліотечні класи підтримують параметризовані генерики. Цей список не є вичерпним.

source: Special Attributes of ``GenericAlias`` objects
fa: ویژگی های خاص اشیاء ``GenericAlias``
ru: Особые атрибуты ``GenericAlias`` объекты
uk: Спеціальні атрибути об’єктів ``GenericAlias``

source: All parameterized generics implement special read-only attributes.
fa: همه ژنریک های پارامتری شده ویژگی های ویژه فقط خواندنی را پیاده سازی می کنند.
ru: Все параметризованные дженерики реализуют специальные атрибуты, доступные только для чтения.
uk: Усі параметризовані генерики реалізують спеціальні атрибути лише для читання.

source: This attribute points at the non-parameterized generic class::
fa: این ویژگی به کلاس عمومی غیر پارامتری اشاره می کند:
ru: Этот атрибут указывает на непараметризованный универсальный класс:
uk: Цей атрибут вказує на непараметризований загальний клас::

source: >>> list[int].__origin__ <class 'list'>
fa: >>> لیست[int].__origin__ <class 'list'>

source: This attribute is a :class:`tuple` (possibly of length 1) of generic types passed to the original :meth:`~object.__class_getitem__` of the generic class::
fa: این ویژگی یک :class:`tuple` (احتمالاً به طول 1) از انواع عمومی است که به :meth:`~object.__class_getitem__` اصلی کلاس عمومی منتقل شده است:
ru: Этот атрибут представляет собой :class:`кортеж` (возможно, длины 1) универсальных типов, переданных оригиналу :meth:`~object.__class_getitem__` общего класса::
uk: Цей атрибут є :class:`tuple` (можливо, довжиною 1) загальних типів, переданих до оригінального :meth:`~object.__class_getitem__` загального класу::

source: >>> dict[str, list[int]].__args__ (<class 'str'>, list[int])
fa: >>> dict[str, list[int]].__args__ (<class 'str'>, لیست[int])

source: This attribute is a lazily computed tuple (possibly empty) of unique type variables found in ``__args__``::
fa: این ویژگی یک تاپلی محاسبه‌شده (احتمالاً خالی) از متغیرهای نوع منحصربه‌فرد است که در ``__args__``::
ru: Этот атрибут представляет собой лениво вычисляемый кортеж (возможно, пустой) переменных уникального типа, найденных в ``__args__`` ::
uk: Цей атрибут є ліниво обчисленим кортежем (можливо, порожнім) унікальних змінних типу, знайдених у ``__args__``::
