Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: fa, ru, uk

source: *errors* controls how decoding errors are handled. If ``'strict'`` (the default), a :exc:`UnicodeError` exception is raised. Other possible values are ``'ignore'``, ``'replace'``, and any other name registered via :func:`codecs.register_error`. See :ref:`error-handlers` for details.
fa: *errors* نحوه رسیدگی به خطاهای رمزگشایی را کنترل می کند. اگر ``'strict'`` (پیش فرض), یک استثنا :exc:`UnicodeError` مطرح می شود. مقادیر احتمالی دیگر ``'ignore'``، ``'replace'`` و هر نام دیگری که از طریق :func:`codecs.register_error` ثبت شده است می باشد. برای جزئیات بیشتر به :ref:`error-handlers` مراجعه کنید.
ru: *errors* управляет обработкой ошибок декодирования. Если ``'строгий'`` (по умолчанию), а :exc:`UnicodeError` возникает исключение. Другие возможные значения: ``'игнорировать'`` , ``'заменить'`` и любое другое имя, зарегистрированное через :func:`codecs.register_error` . Видеть :ref:`обработчики ошибок` для получения подробной информации.

source: For performance reasons, the value of *errors* is not checked for validity unless a decoding error actually occurs, :ref:`devmode` is enabled or a :ref:`debug build <debug-build>` is used.
fa: به دلایل عملکرد، مقدار *errors* از نظر اعتبار بررسی نمی شود، مگر اینکه واقعاً یک خطای رمزگشایی رخ دهد، :ref:`devmode` فعال شود یا از :ref:`debug build <debug-build>` استفاده شود.
ru: По соображениям производительности значение *errors* не проверяется на достоверность, если только не возникает ошибка декодирования. :ref:`devmode` включен или имеется :ref:`отладочная сборка ` используется.

source: Passing the *encoding* argument to :class:`str` allows decoding any :term:`bytes-like object` directly, without needing to make a temporary :class:`!bytes` or :class:`!bytearray` object.
fa: ارسال آرگومان *encoding* به :class:`str` امکان رمزگشایی مستقیم هر :term:`bytes-like object` را بدون نیاز به ایجاد یک شی موقت :class:`!bytes` یا :class:`!bytearray` می دهد.
ru: Передача аргумента *encoding* в :class:`str` позволяет декодировать любой :term:`байтовый объект` напрямую, без необходимости создания временного :class:`!bytes` или :class:`!bytearray` объект.

source: Return ``True`` if the binary data ends with the specified *suffix*, otherwise return ``False``. *suffix* can also be a tuple of suffixes to look for. With optional *start*, test beginning at that position. With optional *end*, stop comparing at that position.
fa: اگر داده های باینری به *suffix* مشخص شده ختم شود، ``True`` را برگردانید، در غیر این صورت ``False`` را برگردانید. *suffix* همچنین می تواند چندین پسوند باشد که باید به دنبال آن باشید. با *start* اختیاری، آزمایش را از همان موقعیت شروع کنید. با *end* اختیاری، مقایسه را در آن موقعیت متوقف کنید.
ru: Возвращаться ``Правда`` если двоичные данные заканчиваются указанным *суффиксом*, в противном случае верните ``Ложь`` . *suffix* также может представлять собой кортеж суффиксов, которые нужно искать. Если используется необязательный *start*, тест начинается с этой позиции. Если используется необязательный *end*, остановите сравнение в этой позиции.
uk: Повертає ``True``, якщо двійкові дані закінчуються вказаним *суфіксом*, інакше повертає ``False``. *suffix* також може бути кортежем суфіксів для пошуку. З необов'язковим *початком* тестування починається з цієї позиції. З необов’язковим *end*, припинити порівняння на цій позиції.

source: The suffix(es) to search for may be any :term:`bytes-like object`.
fa: پسوند(های) مورد جستجو ممکن است هر :term:`bytes-like object` باشد.
ru: Суффиксом(ами) для поиска может быть любой :term:`байтовый объект`.
uk: Суфікс(и) для пошуку може бути будь-яким :term:`bytes-like object`.

source: Return the lowest index in the data where the subsequence *sub* is found, such that *sub* is contained in the slice ``s[start:end]``. Optional arguments *start* and *end* are interpreted as in slice notation. Return ``-1`` if *sub* is not found.
fa: کمترین شاخص را در داده‌هایی که دنباله *sub* یافت می‌شود، برگردانید، به طوری که *sub* در برش ``s[start:end]`` وجود دارد. آرگومان های اختیاری *start* و *end* به صورت نمادگذاری برش تفسیر می شوند. اگر *sub* یافت نشد، ``-1`` را برگردانید.
ru: Возвращает самый низкий индекс в данных, где найдена подпоследовательность *sub*, так что *sub* содержится в срезе. ``s[начало:конец]`` . Необязательные аргументы *start* и *end* интерпретируются как в нотации среза. Возвращаться ``-1`` если *sub* не найден.
uk: Повертає найнижчий індекс у даних, де знайдено підпослідовність *sub*, так що *sub* міститься в сегменті ``s[start:end]``. Необов’язкові аргументи *початок* і *кінець* інтерпретуються як у нотації фрагментів. Повертає ``-1``, якщо *sub* не знайдено.

source: The :meth:`~bytes.find` method should be used only if you need to know the position of *sub*. To check if *sub* is a substring or not, use the :keyword:`in` operator::
fa: روش :meth:`~bytes.find` فقط در صورتی باید استفاده شود که باید موقعیت *sub* را بدانید. برای بررسی اینکه آیا *sub* یک رشته فرعی است یا نه، از عملگر :keyword:`in` استفاده کنید:
ru: The :meth:`~bytes.find` метод следует использовать только в том случае, если вам нужно знать положение *sub*. Чтобы проверить, является ли *sub* подстрокой или нет, используйте команду :keyword:`в` оператор::
uk: Метод :meth:`~bytes.find` слід використовувати, лише якщо вам потрібно знати позицію *sub*. Щоб перевірити, чи є *sub* підрядком, скористайтеся оператором :keyword:`in`::

source: Like :meth:`~bytes.find`, but raise :exc:`ValueError` when the subsequence is not found.
fa: مانند :meth:`~bytes.find`، اما زمانی که دنباله بعدی پیدا نشد، :exc:`ValueError` را بالا ببرید.
ru: Нравиться :meth:`~bytes.find` , но поднять :exc:`ValueError` когда подпоследовательность не найдена.
uk: Як :meth:`~bytes.find`, але викликає :exc:`ValueError`, коли підпослідовність не знайдено.

source: Return a bytes or bytearray object which is the concatenation of the binary data sequences in *iterable*. A :exc:`TypeError` will be raised if there are any values in *iterable* that are not :term:`bytes-like objects <bytes-like object>`, including :class:`str` objects. The separator between elements is the contents of the bytes or bytearray object providing this method.
fa: یک بایت یا شی بایت آرایه که الحاق توالی داده های باینری در *iterable* است را برگردانید. اگر مقادیری در *iterable* وجود داشته باشد که :term:`bytes-like objects <bytes-like object>` نیستند، از جمله اشیاء :class:`str`، یک :exc:`TypeError` بالا می رود. جداکننده بین عناصر محتویات بایت ها یا شی بایت آرایه است که این روش را ارائه می دهد.
ru: Возвращает объект bytes или bytearray, который представляет собой объединение последовательностей двоичных данных в *iterable*. А :exc:`TypeError` будет поднято, если в *iterable* есть какие-либо значения, которые не являются :term:`байтоподобными объектами `, в том числе :class:`str` объекты. Разделителем между элементами является содержимое объекта bytes или bytearray, предоставляющего этот метод.
uk: Повертає об’єкт bytes або bytearray, який є конкатенацією двійкових послідовностей даних у *iterable*. Помилка :exc:`TypeError` буде викликана, якщо в *iterable* є будь-які значення, які не є :term:`bytes-подібними об’єктами <bytes-like object>`, включаючи об’єкти :class:`str`. Роздільником між елементами є вміст об’єкта bytes або bytearray, що забезпечує цей метод.

source: This static method returns a translation table usable for :meth:`bytes.translate` that will map each character in *from* into the character at the same position in *to*; *from* and *to* must both be :term:`bytes-like objects <bytes-like object>` and have the same length.
fa: این روش استاتیک یک جدول ترجمه قابل استفاده برای :meth:`bytes.translate` را برمی گرداند که هر کاراکتر در *from* را به کاراکتر در همان موقعیت در *to* نگاشت می کند. *from* و *to* هر دو باید :term:`bytes-like objects <bytes-like object>` باشند و طول یکسانی داشته باشند.
ru: Этот статический метод возвращает таблицу перевода, пригодную для :meth:`bytes.translate` это сопоставит каждый символ в *from* с символом в той же позиции в *to*; *from* и *to* должны быть :term:`байтоподобными объектами ` и иметь одинаковую длину.
uk: Цей статичний метод повертає таблицю перекладу, придатну для :meth:`bytes.translate`, яка відобразить кожен символ у *from* на символ у тій же позиції в *to*; *from* і *to* мають бути :term:`байтоподібними об’єктами <bytes-like object>` і мати однакову довжину.

source: Split the sequence at the first occurrence of *sep*, and return a 3-tuple containing the part before the separator, the separator itself or its bytearray copy, and the part after the separator. If the separator is not found, return a 3-tuple containing a copy of the original sequence, followed by two empty bytes or bytearray objects.
fa: دنباله را در اولین رخداد *sep* تقسیم کنید و یک 3 تایی حاوی قسمت قبل از جداکننده، خود جداکننده یا کپی آرایه بایتی آن و قسمت بعد از جداکننده را برگردانید. اگر جداکننده پیدا نشد، یک 3 تایی حاوی یک کپی از دنباله اصلی و به دنبال آن دو بایت خالی یا شی بایت آرایه برگردانید.
ru: Разделите последовательность при первом появлении *sep* и верните кортеж из трех частей, содержащий часть перед разделителем, сам разделитель или его копию в виде массива байтов и часть после разделителя. Если разделитель не найден, верните тройной кортеж, содержащий копию исходной последовательности, за которой следуют два пустых байта или объекты байтового массива.
uk: Розділіть послідовність при першому входженні *sep* і поверніть 3-кортеж, що містить частину перед роздільником, сам роздільник або його копію байтового масиву та частину після роздільника. Якщо роздільник не знайдено, поверніть 3-кортеж, що містить копію вихідної послідовності, за якою слідують два порожні байти або об’єкти bytearray.

source: The separator to search for may be any :term:`bytes-like object`.
fa: جداکننده برای جستجو ممکن است هر :term:`bytes-like object` باشد.
ru: Разделителем для поиска может быть любой :term:`байтовый объект`.
uk: Роздільником для пошуку може бути будь-який :term:`bytes-like object`.

source: Return a copy of the sequence with all occurrences of subsequence *old* replaced by *new*. If the optional argument *count* is given, only the first *count* occurrences are replaced.
fa: یک کپی از دنباله را با همه تکرارهای بعدی *old* با *new* برگردانید. اگر آرگومان اختیاری *count* داده شود، تنها اولین رخدادهای *count* جایگزین می شوند.
ru: Верните копию последовательности, в которой все вхождения подпоследовательности *old* заменены на *new*. Если указан необязательный аргумент *count*, заменяются только первые вхождения *count*.
uk: Повертає копію послідовності з заміною всіх входжень підпослідовності *old* на *new*. Якщо вказано необов’язковий аргумент *count*, заміняються лише перші випадки *count*.

source: The subsequence to search for and its replacement may be any :term:`bytes-like object`.
fa: دنباله جستجو و جایگزینی آن ممکن است هر :term:`bytes-like object` باشد.
ru: Подпоследовательность для поиска и ее замены может быть любым :term:`байтоподобным объектом`.
uk: Підпослідовністю для пошуку та її заміною може бути будь-який :term:`bytes-like object`.

source: Return the highest index in the sequence where the subsequence *sub* is found, such that *sub* is contained within ``s[start:end]``. Optional arguments *start* and *end* are interpreted as in slice notation. Return ``-1`` on failure.
fa: بالاترین شاخص را در دنباله ای که دنباله فرعی *sub* یافت می شود، برگردانید، به طوری که *sub* در ``s[start:end]`` قرار دارد. آرگومان های اختیاری *start* و *end* به صورت نمادگذاری برش تفسیر می شوند. ``-1`` را در صورت خرابی برگردانید.
ru: Возвращает наивысший индекс в последовательности, где найдена подпоследовательность *sub*, такая, что *sub* содержится внутри ``s[начало:конец]`` . Необязательные аргументы *start* и *end* интерпретируются как в нотации среза. Возвращаться ``-1`` при неудаче.
uk: Повертає найвищий індекс у послідовності, де знайдено підпослідовність *sub*, так що *sub* міститься в ``s[start:end]``. Необов’язкові аргументи *початок* і *кінець* інтерпретуються як у нотації фрагментів. Повернути ``-1`` у разі помилки.

source: Like :meth:`~bytes.rfind` but raises :exc:`ValueError` when the subsequence *sub* is not found.
fa: مانند :meth:`~bytes.rfind` اما وقتی دنباله *sub* یافت نشد :exc:`ValueError` را افزایش می دهد.
ru: Нравиться :meth:`~bytes.rfind` но поднимает :exc:`ValueError` когда подпоследовательность *sub* не найдена.
uk: Подібно до :meth:`~bytes.rfind`, але викликає :exc:`ValueError`, коли підпослідовність *sub* не знайдено.

source: Split the sequence at the last occurrence of *sep*, and return a 3-tuple containing the part before the separator, the separator itself or its bytearray copy, and the part after the separator. If the separator is not found, return a 3-tuple containing two empty bytes or bytearray objects, followed by a copy of the original sequence.
fa: دنباله را در آخرین رخداد *sep* تقسیم کنید و یک 3 تایی حاوی قسمت قبل از جداکننده، خود جداکننده یا کپی آرایه بایتی آن و قسمت بعد از جداکننده را برگردانید. اگر جداکننده پیدا نشد، یک 3 تاپل حاوی دو بایت خالی یا شی بایت آرایه و به دنبال آن یک کپی از دنباله اصلی برگردانید.
ru: Разделите последовательность при последнем вхождении *sep* и верните кортеж из трех частей, содержащий часть перед разделителем, сам разделитель или его копию в виде массива байтов и часть после разделителя. Если разделитель не найден, верните тройной кортеж, содержащий два пустых байта или объекта байтового массива, за которыми следует копия исходной последовательности.
uk: Розділіть послідовність при останньому входженні *sep* і поверніть 3-кортеж, що містить частину перед роздільником, сам роздільник або його копію байтового масиву та частину після роздільника. Якщо роздільник не знайдено, поверніть 3-кортеж, що містить два порожні об’єкти байтів або масиву байтів, а потім копію вихідної послідовності.

source: Return ``True`` if the binary data starts with the specified *prefix*, otherwise return ``False``. *prefix* can also be a tuple of prefixes to look for. With optional *start*, test beginning at that position. With optional *end*, stop comparing at that position.
fa: اگر داده های باینری با *prefix* مشخص شده شروع شد، ``True`` را برگردانید، در غیر این صورت ``False`` را برگردانید. *prefix* همچنین می تواند چندین پیشوند برای جستجو باشد. با *start* اختیاری، آزمایش را از همان موقعیت شروع کنید. با *end* اختیاری، مقایسه را در آن موقعیت متوقف کنید.
ru: Возвращаться ``Правда`` если двоичные данные начинаются с указанного *префикса*, в противном случае верните ``Ложь`` . *prefix* также может представлять собой кортеж префиксов для поиска. Если используется необязательный *start*, тест начинается с этой позиции. Если используется необязательный *end*, остановите сравнение в этой позиции.
uk: Повертає ``True``, якщо двійкові дані починаються з указаного *префікса*, інакше повертає ``False``. *префікс* також може бути кортежем префіксів для пошуку. З необов’язковим *початком* тестування починається з цієї позиції. З необов’язковим *end*, припинити порівняння на цій позиції.

source: The prefix(es) to search for may be any :term:`bytes-like object`.
fa: پیشوند(های) مورد جستجو ممکن است هر :term:`bytes-like object` باشد.
ru: Префикс(ы) для поиска может быть любым :term:`байтоподобным объектом`.
uk: Префікс(и) для пошуку може бути будь-яким :term:`bytes-like object`.

source: Return a copy of the bytes or bytearray object where all bytes occurring in the optional argument *delete* are removed, and the remaining bytes have been mapped through the given translation table, which must be a bytes object of length 256.
fa: یک کپی از بایت‌ها یا شی بایت آرایه را برگردانید که در آن همه بایت‌های موجود در آرگومان اختیاری *delete* حذف می‌شوند و بایت‌های باقی‌مانده از طریق جدول ترجمه داده شده نگاشت شده‌اند، که باید یک شی بایت به طول 256 باشد.
ru: Возвращает копию объекта bytes или bytearray, где все байты, встречающиеся в необязательном аргументе *delete*, удалены, а оставшиеся байты сопоставлены с помощью данной таблицы перевода, которая должна быть объектом bytes длиной 256.
uk: Повертає копію об’єкта bytes або bytearray, де всі байти, що зустрічаються в необов’язковому аргументі *delete*, видаляються, а решта байтів відображено через задану таблицю перекладу, яка має бути об’єктом bytes довжиною 256.

source: You can use the :func:`bytes.maketrans` method to create a translation table.
fa: برای ایجاد جدول ترجمه می توانید از روش :func:`bytes.maketrans` استفاده کنید.
ru: Вы можете использовать :func:`bytes.maketrans` метод создания таблицы перевода.
uk: Ви можете використовувати метод :func:`bytes.maketrans` для створення таблиці перекладу.

source: Set the *table* argument to ``None`` for translations that only delete characters::
fa: برای ترجمه هایی که فقط کاراکترها را حذف می کنند، آرگومان *table* را روی ``None`` تنظیم کنید:
ru: Установите для аргумента *table* значение ``Нет`` для переводов, которые удаляют только символы::
uk: Встановіть для аргументу *table* значення ``None`` для перекладів, які видаляють лише символи::

source: *delete* is now supported as a keyword argument.
fa: *delete* اکنون به عنوان آرگومان کلمه کلیدی پشتیبانی می شود.
ru: *delete* теперь поддерживается в качестве аргумента ключевого слова.
uk: *delete* тепер підтримується як аргумент ключового слова.

source: The following methods on bytes and bytearray objects have default behaviours that assume the use of ASCII compatible binary formats, but can still be used with arbitrary binary data by passing appropriate arguments. Note that all of the bytearray methods in this section do *not* operate in place, and instead produce new objects.
fa: روش‌های زیر روی بایت‌ها و اشیاء بایت آرایه رفتارهای پیش‌فرضی دارند که استفاده از فرمت‌های باینری سازگار با ASCII را فرض می‌کنند، اما همچنان می‌توانند با داده‌های باینری دلخواه با ارسال آرگومان‌های مناسب استفاده شوند. توجه داشته باشید که تمام متدهای بایت آرایه در این بخش *not* در جای خود عمل می کنند و در عوض اشیاء جدیدی تولید می کنند.
ru: Следующие методы для объектов bytes и bytearray имеют поведение по умолчанию, предполагающее использование двоичных форматов, совместимых с ASCII, но их по-прежнему можно использовать с произвольными двоичными данными, передавая соответствующие аргументы. Обратите внимание, что все методы bytearray в этом разделе *не* работают на месте, а вместо этого создают новые объекты.
uk: Наведені нижче методи для об’єктів bytes і bytearray мають поведінку за замовчуванням, яка передбачає використання ASCII-сумісних двійкових форматів, але все одно їх можна використовувати з довільними двійковими даними шляхом передачі відповідних аргументів. Зауважте, що всі методи bytearray у цьому розділі *не* працюють на місці, а створюють нові об’єкти.

source: Return a copy of the object centered in a sequence of length *width*. Padding is done using the specified *fillbyte* (default is an ASCII space). For :class:`bytes` objects, the original sequence is returned if *width* is less than or equal to ``len(s)``.
fa: یک کپی از شی در مرکز دنباله ای به طول *width* برگردانید. padding با استفاده از *fillbyte* مشخص شده انجام می شود (پیش فرض یک فضای ASCII است). برای اشیاء :class:`bytes`، اگر *width* کمتر یا مساوی با ``len(s)`` باشد، دنباله اصلی برگردانده می شود.
ru: Возвращает копию объекта с центром в последовательности длины *ширины*. Заполнение выполняется с использованием указанного *fillbyte* (по умолчанию используется пробел ASCII). Для :class:`байты` объекты, исходная последовательность возвращается, если *width* меньше или равна ``лен(ы)`` .
uk: Повертає копію об’єкта з центром у послідовності довжиною *шириною*. Доповнення виконується за допомогою вказаного *fillbyte* (за замовчуванням це пробіл ASCII). Для об’єктів :class:`bytes` оригінальна послідовність повертається, якщо *width* менше або дорівнює ``len(s)``.

source: Return a copy of the object left justified in a sequence of length *width*. Padding is done using the specified *fillbyte* (default is an ASCII space). For :class:`bytes` objects, the original sequence is returned if *width* is less than or equal to ``len(s)``.
fa: یک کپی از شی را که در دنباله ای به طول *width* توجیه شده است، برگردانید. Padding با استفاده از *fillbyte* مشخص شده انجام می شود (پیش فرض یک فضای ASCII است). برای اشیاء :class:`bytes`، اگر *width* کمتر یا مساوی با ``len(s)`` باشد، دنباله اصلی برگردانده می شود.
ru: Возвращает копию объекта, выровненную по левому краю, в последовательности длиной *ширины*. Заполнение выполняется с использованием указанного *fillbyte* (по умолчанию используется пробел ASCII). Для :class:`байты` объекты, исходная последовательность возвращается, если *width* меньше или равна ``лен(ы)`` .
uk: Повертає копію об’єкта, вирівняну за лівим краєм у послідовності довжини *ширина*. Доповнення виконується за допомогою вказаного *fillbyte* (за замовчуванням це пробіл ASCII). Для об’єктів :class:`bytes` вихідна послідовність повертається, якщо *width* менше або дорівнює ``len(s)``.

source: Return a copy of the sequence with specified leading bytes removed. The *chars* argument is a binary sequence specifying the set of byte values to be removed - the name refers to the fact this method is usually used with ASCII characters. If omitted or ``None``, the *chars* argument defaults to removing ASCII whitespace. The *chars* argument is not a prefix; rather, all combinations of its values are stripped::
fa: یک کپی از دنباله را با حذف بایت های اصلی مشخص شده برگردانید. آرگومان *chars* یک دنباله باینری است که مجموعه ای از مقادیر بایت را مشخص می کند که باید حذف شوند - این نام به این واقعیت اشاره دارد که این روش معمولاً با کاراکترهای ASCII استفاده می شود. در صورت حذف یا ``None``، آرگومان *chars* به طور پیش‌فرض فضای سفید ASCII را حذف می‌کند. آرگومان *chars* یک پیشوند نیست. بلکه تمام ترکیبات مقادیر آن حذف می شوند::
ru: Вернуть копию последовательности с удаленными указанными ведущими байтами. Аргумент *chars* представляет собой двоичную последовательность, определяющую набор удаляемых байтовых значений. Название указывает на тот факт, что этот метод обычно используется с символами ASCII. Если опущено или ``Нет`` , аргумент *chars* по умолчанию удаляет пробелы ASCII. Аргумент *chars* не является префиксом; скорее, все комбинации его значений удаляются::
uk: Повертає копію послідовності з видаленими вказаними початковими байтами. Аргумент *chars* є двійковою послідовністю, яка визначає набір значень байтів, які потрібно видалити. Назва вказує на те, що цей метод зазвичай використовується з символами ASCII. Якщо пропущено або ``None``, аргумент *chars* за умовчанням видаляє пробіли ASCII. Аргумент *chars* не є префіксом; навпаки, усі комбінації його значень видаляються:

source: The binary sequence of byte values to remove may be any :term:`bytes-like object`. See :meth:`~bytes.removeprefix` for a method that will remove a single prefix string rather than all of a set of characters. For example::
fa: توالی دودویی مقادیر بایت برای حذف ممکن است هر :term:`bytes-like object` باشد. :meth:`~bytes.removeprefix` را برای روشی ببینید که یک رشته پیشوند واحد را به جای همه مجموعه ای از کاراکترها حذف می کند. به عنوان مثال::
ru: Двоичная последовательность удаляемых байтовых значений может быть любым :term:`байтоподобным объектом`. Видеть :meth:`~bytes.removeprefix` для метода, который удалит одну строку префикса, а не весь набор символов. Например::
uk: Двійкова послідовність байтових значень для видалення може бути будь-яким :term:`bytes-like object`. Перегляньте :meth:`~bytes.removeprefix` для методу, який видаляє один рядок префікса, а не весь набір символів. Наприклад::
