Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: fa, ru, uk

source: If :class:`~memoryview.format` is one of the native format specifiers from the :mod:`struct` module, indexing with an integer or a tuple of integers is also supported and returns a single *element* with the correct type. One-dimensional memoryviews can be indexed with an integer or a one-integer tuple. Multi-dimensional memoryviews can be indexed with tuples of exactly *ndim* integers where *ndim* is the number of dimensions. Zero-dimensional memoryviews can be indexed with the empty tuple.
fa: اگر :class:`~memoryview.format` یکی از مشخص‌کننده‌های قالب بومی از ماژول :mod:`struct` باشد، نمایه‌سازی با یک عدد صحیح یا چند عدد صحیح نیز پشتیبانی می‌شود و یک *element* را با نوع صحیح برمی‌گرداند. مموری‌نماهای یک بعدی را می‌توان با یک عدد صحیح یا یک تاپل یک عدد صحیح نمایه کرد. مموری‌نماهای چند بعدی را می‌توان با چند اعداد صحیح *ndim* که در آن *ndim* تعداد ابعاد است، فهرست‌بندی کرد. نماهای حافظه صفر بعدی را می توان با تاپل خالی ایندکس کرد.
ru: Если :class:`~memoryview.format` является одним из спецификаторов собственного формата из :mod:`структура` модуль также поддерживается индексирование целыми числами или кортежами целых чисел и возвращает один *элемент* правильного типа. Одномерные представления памяти можно индексировать с помощью целого числа или одноцелого кортежа. Многомерные представления памяти можно индексировать с помощью кортежей, состоящих ровно из *ndim* целых чисел, где *ndim* — количество измерений. Нульмерные представления памяти можно индексировать с помощью пустого кортежа.
uk: Якщо :class:`~memoryview.format` є одним із власних специфікаторів формату з модуля :mod:`struct`, індексація за допомогою цілого числа або кортежу цілих чисел також підтримується та повертає один *елемент* із правильним типом . Одновимірні представлення пам'яті можна індексувати за допомогою цілого або одноцілого кортежу. Багатовимірні представлення пам’яті можна індексувати за допомогою кортежів з точно *ndim* цілих чисел, де *ndim* є кількістю вимірів. Нульвимірні представлення пам'яті можна індексувати за допомогою порожнього кортежу.

source: Here is an example with a non-byte format::
fa: در اینجا یک مثال با فرمت غیر بایتی آورده شده است:
ru: Вот пример с небайтовым форматом:
uk: Ось приклад небайтового формату::

source: If the underlying object is writable, the memoryview supports one-dimensional slice assignment. Resizing is not allowed::
fa: اگر شی زیرین قابل نوشتن باشد، مموری ویو از تخصیص برش یک بعدی پشتیبانی می کند. تغییر اندازه مجاز نیست::
ru: Если базовый объект доступен для записи, представление памяти поддерживает одномерное назначение среза. Изменение размера не допускается::
uk: Якщо основний об’єкт доступний для запису, memoryview підтримує одновимірне призначення фрагментів. Зміна розміру заборонена::

source: >>> data = bytearray(b'abcefg') >>> v = memoryview(data) >>> v.readonly False >>> v[0] = ord(b'z') >>> data bytearray(b'zbcefg') >>> v[1:4] = b'123' >>> data bytearray(b'z123fg') >>> v[2:3] = b'spam' Traceback (most recent call last): File "<stdin>", line 1, in <module> ValueError: memoryview assignment: lvalue and rvalue have different structures >>> v[2:6] = b'spam' >>> data bytearray(b'z1spam')
fa: >>> داده = آرایه بایت (b'abcefg') >>> v = نمای حافظه (داده) >>> v.readonly نادرست >>> v[0] = ord(b'z') >>> داده ها بایت آرایه (b'zbcefg') >>> v[1:4] = b'123' >>> داده ها آرایه بایت (b'z123fg') >>> v[2:3] = b'spam' ردیابی (آخرین تماس اخیر): فایل "<stdin>", خط 1، در <module> ValueError: انتساب memoryview: lvalue و rvalue ساختارهای متفاوتی دارند >>> v[2:6] = b'spam' >>> داده ها بایت آرایه (b'z1spam')

source: One-dimensional memoryviews of :term:`hashable` (read-only) types with formats 'B', 'b' or 'c' are also hashable. The hash is defined as ``hash(m) == hash(m.tobytes())``::
fa: مموری‌های تک بعدی انواع :term:`hashable` (فقط خواندنی) با فرمت‌های «B»، «b» یا «c» نیز قابل هش هستند. هش به صورت ``hash(m) == hash(m.tobytes())`` تعریف می شود:
ru: Одномерные представления памяти типов :term:`hashable` (только для чтения) с форматами «B», «b» или «c» также являются хэшируемыми. Хэш определяется как ``хэш(m) == хэш(m.tobytes())`` ::

source: One-dimensional memoryviews can now be sliced. One-dimensional memoryviews with formats 'B', 'b' or 'c' are now :term:`hashable`.
fa: اکنون می توان نماهای حافظه یک بعدی را برش داد. نماهای حافظه یک بعدی با فرمت های «B»، «b» یا «c» اکنون :term:`hashable` هستند.
ru: Одномерные представления памяти теперь можно нарезать. Одномерные представления памяти в форматах «B», «b» или «c» теперь :term:`хешируются`.

source: memoryview is now registered automatically with :class:`collections.abc.Sequence`
fa: Memoryview اکنون به طور خودکار با :class:`collections.abc.Sequence` ثبت می شود
ru: MemoryView теперь автоматически регистрируется с помощью :class:`collections.abc.Sequence`
uk: memoryview тепер автоматично реєструється в :class:`collections.abc.Sequence`

source: memoryviews can now be indexed with tuple of integers.
fa: Memoryviews اکنون می تواند با چند عدد صحیح ایندکس شود.
ru: Просмотры памяти теперь можно индексировать с помощью кортежа целых чисел.
uk: memoryviews тепер можна індексувати кортежем цілих чисел.

source: :class:`memoryview` has several methods:
fa: :class:`memoryview` چندین روش دارد:
ru: :class:`memoryview` имеет несколько методов:
uk: :class:`memoryview` має кілька методів:

source: A memoryview and a :pep:`3118` exporter are equal if their shapes are equivalent and if all corresponding values are equal when the operands' respective format codes are interpreted using :mod:`struct` syntax.
fa: یک مموری ویو و یک صادرکننده :pep:`3118` در صورتی که اشکال آنها معادل باشد و اگر همه مقادیر متناظر با کدهای قالب مربوطه عملوندها با استفاده از نحو :mod:`struct` تفسیر شوند، برابر هستند.
ru: Просмотр памяти и :pep:`3118` экспортера равны, если их формы эквивалентны и если все соответствующие значения равны, когда соответствующие коды формата операндов интерпретируются с использованием :mod:`структура` синтаксис.
uk: Memoriview і експортер :pep:`3118` є рівними, якщо їхні форми еквівалентні та якщо всі відповідні значення рівні, коли відповідні коди формату операндів інтерпретуються за допомогою синтаксису :mod:`struct`.

source: For the subset of :mod:`struct` format strings currently supported by :meth:`tolist`, ``v`` and ``w`` are equal if ``v.tolist() == w.tolist()``::
fa: برای زیر مجموعه رشته های قالب :mod:`struct` که در حال حاضر توسط :meth:`tolist` پشتیبانی می شود، ``v`` و ``w`` برابر هستند اگر ``v.tolist() == w.tolist()``::
ru: Для подмножества :mod:`структура` строки формата, поддерживаемые в настоящее время :meth:`толист` , ``v`` и ``ч`` равны, если ``v.tolist() == w.tolist()`` ::
uk: Для підмножини рядків формату :mod:`struct`, які зараз підтримуються :meth:`tolist`, ``v`` і ``w`` рівні, якщо ``v.tolist() == w.tolist()``::

source: If either format string is not supported by the :mod:`struct` module, then the objects will always compare as unequal (even if the format strings and buffer contents are identical)::
fa: اگر هر یک از رشته های قالب توسط ماژول :mod:`struct` پشتیبانی نمی شود، آنگاه اشیاء همیشه به عنوان نابرابر مقایسه می شوند (حتی اگر رشته های قالب و محتوای بافر یکسان باشند):
ru: Если какая-либо строка формата не поддерживается :mod:`структура` модуль, то объекты всегда будут сравниваться как неравные (даже если строки формата и содержимое буфера идентичны)::
uk: Якщо будь-який рядок формату не підтримується модулем :mod:`struct`, тоді об’єкти завжди порівнюватимуться як нерівні (навіть якщо рядки формату та вміст буфера ідентичні)::

source: Note that, as with floating-point numbers, ``v is w`` does *not* imply ``v == w`` for memoryview objects.
fa: توجه داشته باشید که مانند اعداد ممیز شناور، ``v is w`` *not* به معنای ``v == w`` برای اشیاء مموری دید است.

source: Previous versions compared the raw memory disregarding the item format and the logical array structure.
fa: نسخه های قبلی حافظه خام را بدون توجه به فرمت آیتم و ساختار آرایه منطقی مقایسه کردند.
ru: Предыдущие версии сравнивали необработанную память без учета формата элемента и структуры логического массива.
uk: Попередні версії порівнювали необроблену пам’ять без урахування формату елемента та логічної структури масиву.

source: Return the data in the buffer as a bytestring. This is equivalent to calling the :class:`bytes` constructor on the memoryview. ::
fa: داده ها را در بافر به عنوان بایت تست برگردانید. این معادل فراخوانی سازنده :class:`bytes` در مموری ویو است. ::
ru: Верните данные в буфер в виде байтовой строки. Это эквивалентно вызову :class:`байты` конструктор в MemoryView. ::
uk: Повертає дані в буфері як байтовий рядок. Це еквівалентно виклику конструктора :class:`bytes` у memoryview. ::

source: For non-contiguous arrays the result is equal to the flattened list representation with all elements converted to bytes. :meth:`tobytes` supports all format strings, including those that are not in :mod:`struct` module syntax.
fa: برای آرایه های غیر پیوسته، نتیجه برابر است با نمایش لیست مسطح با تمام عناصر تبدیل به بایت. :meth:`tobytes` از تمام رشته های قالب، از جمله رشته هایی که در نحو ماژول :mod:`struct` نیستند، پشتیبانی می کند.
ru: Для несмежных массивов результат равен представлению плоского списка, в котором все элементы преобразованы в байты. :meth:`тобайты` поддерживает все строки формата, включая те, которых нет в :mod:`структура` синтаксис модуля.
uk: Для несуміжних масивів результат дорівнює представленню зведеного списку з усіма елементами, перетвореними на байти. :meth:`tobytes` підтримує всі рядки формату, включно з тими, яких немає в синтаксисі модуля :mod:`struct`.

source: *order* can be {'C', 'F', 'A'}. When *order* is 'C' or 'F', the data of the original array is converted to C or Fortran order. For contiguous views, 'A' returns an exact copy of the physical memory. In particular, in-memory Fortran order is preserved. For non-contiguous views, the data is converted to C first. *order=None* is the same as *order='C'*.
fa: *order* می تواند {'C', 'F', 'A'} باشد. وقتی *order* 'C' یا 'F' باشد، داده های آرایه اصلی به ترتیب C یا Fortran تبدیل می شوند. برای نماهای پیوسته، 'A' یک کپی دقیق از حافظه فیزیکی را برمی گرداند. به طور خاص، نظم فرترن در حافظه حفظ می شود. برای نماهای غیر پیوسته، ابتدا داده ها به C تبدیل می شوند. *order=None* همان *order='C'* است.
ru: *порядок* может быть {'C', 'F', 'A'}. Когда *order* имеет значение «C» или «F», данные исходного массива преобразуются в порядок C или Fortran. Для смежных представлений «A» возвращает точную копию физической памяти. В частности, сохраняется порядок Фортрана в памяти. Для несмежных представлений данные сначала преобразуются в C. *order=None* — то же самое, что *order='C'*.
uk: *порядок* може бути {'C', 'F', 'A'}. Якщо *порядок* має значення "C" або "F", дані вихідного масиву перетворюються на порядок C або Fortran. Для суміжних переглядів "A" повертає точну копію фізичної пам’яті. Зокрема, зберігається порядок Fortran у пам'яті. Для несуміжних переглядів дані спочатку перетворюються на C. *order=None* те саме, що *order='C'*.

source: Return a string object containing two hexadecimal digits for each byte in the buffer. ::
fa: یک شی رشته حاوی دو رقم هگزادسیمال برای هر بایت در بافر را برگردانید. ::
ru: Возвращает строковый объект, содержащий две шестнадцатеричные цифры для каждого байта в буфере. ::
uk: Повертає рядковий об’єкт, що містить дві шістнадцяткові цифри для кожного байта в буфері. ::

source: Similar to :meth:`bytes.hex`, :meth:`memoryview.hex` now supports optional *sep* and *bytes_per_sep* parameters to insert separators between bytes in the hex output.
fa: مشابه :meth:`bytes.hex`، :meth:`memoryview.hex` اکنون از پارامترهای اختیاری *sep* و *bytes_per_sep* برای قرار دادن جداکننده ها بین بایت ها در خروجی هگز پشتیبانی می کند.
ru: Похоже на: :meth:`bytes.hex` , :meth:`memoryview.hex` теперь поддерживает дополнительные параметры *sep* и *bytes_per_sep* для вставки разделителей между байтами в шестнадцатеричном выводе.
uk: Подібно до :meth:`bytes.hex`, :meth:`memoryview.hex` тепер підтримує додаткові параметри *sep* і *bytes_per_sep* для вставки роздільників між байтами в шістнадцятковому виведенні.

source: Return the data in the buffer as a list of elements. ::
fa: داده ها را در بافر به عنوان لیستی از عناصر برگردانید. ::
ru: Верните данные в буфер в виде списка элементов. ::
uk: Повертає дані в буфері як список елементів. ::

source: :meth:`tolist` now supports all single character native formats in :mod:`struct` module syntax as well as multi-dimensional representations.
fa: :meth:`tolist` اکنون از تمام فرمت های بومی تک کاراکتری در نحو ماژول :mod:`struct` و همچنین نمایش های چند بعدی پشتیبانی می کند.
ru: :meth:`толист` теперь поддерживает все односимвольные форматы в :mod:`структура` синтаксис модуля, а также многомерные представления.
uk: :meth:`tolist` тепер підтримує всі односимвольні рідні формати в синтаксисі модуля :mod:`struct`, а також багатовимірні представлення.

source: Return a readonly version of the memoryview object. The original memoryview object is unchanged. ::
fa: یک نسخه فقط خواندنی از شی memoryview را برگردانید. شیء اصلی memoryview بدون تغییر است. ::
ru: Верните версию объекта MemoryView, доступную только для чтения. Исходный объект MemoryView не изменяется. ::
uk: Повертає версію об’єкта memoryview лише для читання. Оригінальний об’єкт memoryview не змінено. ::

source: >>> m = memoryview(bytearray(b'abc')) >>> mm = m.toreadonly() >>> mm.tolist() [97, 98, 99] >>> mm[0] = 42 Traceback (most recent call last): File "<stdin>", line 1, in <module> TypeError: cannot modify read-only memory >>> m[0] = 43 >>> mm.tolist() [43, 98, 99]
fa: >>> m = مموری نمایش (بایت آرایه (b'abc')) >>> mm = m.toreadonly() >>> mm.tolist() [97, 98, 99] >>> میلی متر[0] = 42 ردیابی (آخرین تماس اخیر): فایل "<stdin>", خط 1، در <module> TypeError: نمی توان حافظه فقط خواندنی را تغییر داد >>> m[0] = 43 >>> mm.tolist() [43, 98, 99]

source: Release the underlying buffer exposed by the memoryview object. Many objects take special actions when a view is held on them (for example, a :class:`bytearray` would temporarily forbid resizing); therefore, calling release() is handy to remove these restrictions (and free any dangling resources) as soon as possible.
fa: بافر زیرین را که توسط شی memoryview در معرض دید قرار می گیرد، رها کنید. بسیاری از اشیاء هنگامی که یک نما روی آنها نگه داشته می شود اقدامات ویژه ای انجام می دهند (به عنوان مثال, یک :class:`bytearray` تغییر اندازه را به طور موقت ممنوع می کند). بنابراین، فراخوانی ()release برای حذف این محدودیت‌ها (و آزاد کردن منابع آویزان) در اسرع وقت مفید است.
ru: Освободите базовый буфер, предоставленный объектом MemoryView. Многие объекты выполняют специальные действия, когда на них удерживается взгляд (например, :class:`bytearray` временно запретит изменение размера); поэтому вызов Release() удобен для того, чтобы как можно скорее снять эти ограничения (и освободить все висящие ресурсы).
uk: Вивільніть базовий буфер, відкритий об’єктом memoryview. Багато об’єктів виконують спеціальні дії, коли їх переглядають (наприклад, :class:`bytearray` тимчасово забороняє зміну розміру); отже, виклик release() є зручним, щоб усунути ці обмеження (і звільнити будь-які завислі ресурси) якомога швидше.

source: After this method has been called, any further operation on the view raises a :class:`ValueError` (except :meth:`release` itself which can be called multiple times)::
fa: پس از فراخوانی این متد، هر عملیات دیگری در view یک :class:`ValueError` را افزایش می دهد (به جز خود :meth:`release` که می تواند چندین بار فراخوانی شود):

source: >>> m = memoryview(b'abc') >>> m.release() >>> m[0] Traceback (most recent call last): File "<stdin>", line 1, in <module> ValueError: operation forbidden on released memoryview object
fa: >>> m = مموری نمای (b'abc') >>> m.release() >>> m[0] ردیابی (آخرین تماس اخیر): فایل "<stdin>", خط 1، در <module> ValueError: عملیات بر روی شیء منتشر شده memoryview ممنوع است

source: The context management protocol can be used for a similar effect, using the ``with`` statement::
fa: پروتکل مدیریت زمینه را می توان برای اثر مشابه با استفاده از دستور ``with`` استفاده کرد:
ru: Для аналогичного эффекта можно использовать протокол управления контекстом, используя ``с`` заявление::
uk: Протокол керування контекстом може бути використаний для подібного ефекту, використовуючи оператор ``with``::

source: >>> with memoryview(b'abc') as m: ... m[0] ... 97 >>> m[0] Traceback (most recent call last): File "<stdin>", line 1, in <module> ValueError: operation forbidden on released memoryview object
fa: >>> با نمای حافظه (b'abc') به عنوان m: ... m[0] ... 97 >>> m[0] ردیابی (آخرین تماس اخیر): فایل "<stdin>", خط 1، در <module> ValueError: عملیات بر روی شیء منتشر شده memoryview ممنوع است

source: Cast a memoryview to a new format or shape. *shape* defaults to ``[byte_length//new_itemsize]``, which means that the result view will be one-dimensional. The return value is a new memoryview, but the buffer itself is not copied. Supported casts are 1D -> C-:term:`contiguous` and C-contiguous -> 1D.
fa: یک مموری ویو را به قالب یا شکل جدید ارسال کنید. *shape* به طور پیش فرض روی ``[byte_length//new_itemsize]`` است، به این معنی که نمای نتیجه یک بعدی خواهد بود. مقدار بازگشتی یک مموری نمای جدید است، اما خود بافر کپی نمی شود. بازیگران پشتیبانی شده 1D -> C-:term:`contiguous` و C-contiguous -> 1D هستند.
ru: Приведите представление памяти к новому формату или форме. *форма* по умолчанию ``[byte_length//new_itemsize]`` , что означает, что представление результатов будет одномерным. Возвращаемое значение — это новое представление памяти, но сам буфер не копируется. Поддерживаемые приведения: 1D -> C-:term:`contigious` и C-contigious -> 1D.
uk: Транслюйте пам’ять у новий формат або форму. *shape* за умовчанням має значення ``[byte_length//new_itemsize]``, що означає, що перегляд результату буде одновимірним. Поверненим значенням є новий перегляд пам’яті, але сам буфер не копіюється. Підтримувані приведення: 1D -> C-:term:`contiguous` і C-contiguous -> 1D.

source: The destination format is restricted to a single element native format in :mod:`struct` syntax. One of the formats must be a byte format ('B', 'b' or 'c'). The byte length of the result must be the same as the original length. Note that all byte lengths may depend on the operating system.
fa: فرمت مقصد به یک قالب بومی یک عنصر در نحو :mod:`struct` محدود شده است. یکی از فرمت ها باید قالب بایتی باشد ('B', 'b' یا 'c'). طول بایت نتیجه باید با طول اصلی یکسان باشد. توجه داشته باشید که طول تمام بایت ها ممکن است به سیستم عامل بستگی داشته باشد.
ru: Формат назначения ограничен собственным форматом одного элемента в :mod:`структура` синтаксис. Один из форматов должен быть байтовым («B», «b» или «c»). Длина результата в байтах должна быть такой же, как исходная длина. Обратите внимание, что длина всех байтов может зависеть от операционной системы.

source: Cast 1D/long to 1D/unsigned bytes::
fa: بایت های 1 بعدی/طولانی تا 1 بعدی/بدون علامت ارسال کنید::
ru: Привести 1D/длинные байты к 1D/беззнаковым байтам::
uk: Перетворення 1D/long на 1D/беззнакові байти::

source: Cast 1D/unsigned bytes to 1D/char::
fa: بایت های 1 بعدی/بدون علامت به 1D/char ارسال کنید::
ru: Преобразование 1D/беззнаковых байтов в 1D/char::
uk: Перетворення 1D/беззнакових байтів у 1D/char::

source: >>> b = bytearray(b'zyz') >>> x = memoryview(b) >>> x[0] = b'a' Traceback (most recent call last): ... TypeError: memoryview: invalid type for format 'B' >>> y = x.cast('c') >>> y[0] = b'a' >>> b bytearray(b'ayz')
fa: >>> b = آرایه بایت (b'zyz') >>> x = نمای حافظه (ب) >>> x[0] = b'a' ردیابی (آخرین تماس اخیر): ... TypeError: memoryview: نوع نامعتبر برای قالب "B" >>> y = x.cast('c') >>> y[0] = b'a' >>> ب بایت آرایه (بعیز)

source: Cast 1D/bytes to 3D/ints to 1D/signed char::
fa: ارسال 1 بعدی/بایت به 3 بعدی/اینت به 1 بعدی/نویسه امضا شده::
ru: Привести 1D/байты к 3D/целые числа к 1D/знаковому символу::
uk: Перетворити 1D/байти на 3D/ints на 1D/signed char::

source: Cast 1D/unsigned long to 2D/unsigned long::
fa: بازیگران 1 بعدی / بدون علامت طولانی به 2 بعدی / بدون علامت طولانی::
ru: Преобразование 1D/unsigned long в 2D/unsigned long::
uk: Перетворення 1D/unsigned long на 2D/unsigned long ::

source: The source format is no longer restricted when casting to a byte view.
fa: هنگام ارسال به نمای بایت، قالب منبع دیگر محدود نمی شود.
ru: Исходный формат больше не ограничен при приведении к байтовому представлению.
uk: Вихідний формат більше не обмежений під час трансляції до байтового перегляду.

source: There are also several readonly attributes available:
fa: چندین ویژگی فقط خواندنی نیز وجود دارد:
ru: Также доступно несколько атрибутов только для чтения:
uk: Також є кілька доступних атрибутів лише для читання:

source: The underlying object of the memoryview::
fa: هدف اصلی مموری ویو:
ru: Базовый объект MemoryView::
uk: Основний об’єкт memoryview::

source: ``nbytes == product(shape) * itemsize == len(m.tobytes())``. This is the amount of space in bytes that the array would use in a contiguous representation. It is not necessarily equal to ``len(m)``::
fa: ``nbytes == product(shape) * itemsize == len(m.tobytes())``. این مقدار فضایی بر حسب بایت است که آرایه در یک نمایش پیوسته از آن استفاده می کند. لزوما برابر با ``len(m)`` نیست::
ru: ``nbytes == product(shape) * itemsize == len(m.tobytes())`` . Это объем пространства в байтах, который массив будет использовать в непрерывном представлении. Оно не обязательно равно ``только(м)'' ::
uk: ``nbytes == product(shape) * itemsize == len(m.tobytes())``. Це обсяг простору в байтах, який буде використовуватися масивом у безперервному представленні. Воно не обов’язково дорівнює ``len(m)``::

source: Multi-dimensional arrays::
fa: آرایه های چند بعدی::
ru: Многомерные массивы::
uk: Багатовимірні масиви::

source: A bool indicating whether the memory is read only.
fa: یک بوول که نشان می دهد آیا حافظه فقط خواندنی است یا خیر.
ru: Логическое значение, указывающее, доступна ли память только для чтения.
uk: Bool, що вказує, чи є пам’ять лише для читання.

source: A string containing the format (in :mod:`struct` module style) for each element in the view. A memoryview can be created from exporters with arbitrary format strings, but some methods (e.g. :meth:`tolist`) are restricted to native single element formats.
fa: یک رشته حاوی قالب (به سبک ماژول :mod:`struct`) برای هر عنصر در نما. مموری ویو را می توان از صادرکنندگان با رشته های قالب دلخواه ایجاد کرد، اما برخی روش ها (مانند :meth:`tolist`) به فرمت های تک عنصری بومی محدود می شوند.
ru: Строка, содержащая формат (в :mod:`структура` стиль модуля) для каждого элемента в представлении. Представление памяти может быть создано из экспортеров с произвольными строками формата, но некоторые методы (например, :meth:`толист` ) ограничены собственными форматами отдельных элементов.
uk: Рядок, що містить формат (у стилі модуля :mod:`struct`) для кожного елемента в поданні. Огляд пам’яті можна створити з експортерів із довільними рядками формату, але деякі методи (наприклад, :meth:`tolist`) обмежені рідними одноелементними форматами.

source: format ``'B'`` is now handled according to the struct module syntax. This means that ``memoryview(b'abc')[0] == b'abc'[0] == 97``.
fa: فرمت ``'B'`` اکنون بر اساس نحو ماژول ساختار مدیریت می شود. این بدان معنی است که ``memoryview(b'abc')[0] == b'abc'[0] == 97``.
ru: формат ``'Б'`` теперь обрабатывается в соответствии с синтаксисом модуля структуры. Это означает, что ``memoryview(b'abc')[0] == b'abc'[0] == 97`` .
uk: формат ``'B'`` тепер обробляється відповідно до синтаксису модуля struct. Це означає, що ``memoryview(b'abc')[0] == b'abc'[0] == 97``.

source: The size in bytes of each element of the memoryview::
fa: اندازه هر عنصر مموری ویو بر حسب بایت:
ru: Размер в байтах каждого элемента MemoryView::
uk: Розмір у байтах кожного елемента memoryview::
