Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: fa, ru, uk

source: Test your application thoroughly if you use a low limit. Ensure your tests run with the limit set early via the environment or flag so that it applies during startup and even during any installation step that may invoke Python to precompile ``.py`` sources to ``.pyc`` files.
fa: اگر از محدودیت کم استفاده می کنید، برنامه خود را به طور کامل آزمایش کنید. مطمئن شوید که آزمایش‌های شما با محدودیتی که از طریق محیط یا پرچم تعیین شده است اجرا می‌شوند تا در هنگام راه‌اندازی و حتی در طول هر مرحله نصبی که ممکن است پایتون را برای کامپایل کردن منابع ``.py`` به فایل‌های ``.pyc`` از پیش فراخوانی کند، اعمال شود.
ru: Тщательно протестируйте свое приложение, если вы используете нижний предел. Убедитесь, что ваши тесты выполняются с ограничением, установленным заранее через среду или флаг, чтобы оно применялось во время запуска и даже на любом этапе установки, который может вызвать Python для предварительной компиляции. ``.py`` источники для ``.pyc`` файлы.

source: Recommended configuration
fa: پیکربندی توصیه شده
ru: Рекомендуемая конфигурация

source: The default :data:`sys.int_info.default_max_str_digits` is expected to be reasonable for most applications. If your application requires a different limit, set it from your main entry point using Python version agnostic code as these APIs were added in security patch releases in versions before 3.12.
fa: انتظار می رود :data:`sys.int_info.default_max_str_digits` پیش فرض برای اکثر برنامه ها معقول باشد. اگر برنامه شما به محدودیت دیگری نیاز دارد، آن را از نقطه ورودی اصلی خود با استفاده از کد آگنوستیک نسخه پایتون تنظیم کنید زیرا این APIها در نسخه های قبل از 3.12 در نسخه های وصله امنیتی منتشر شده اضافه شده اند.

source: Example::
fa: مثال::
ru: Пример::
uk: Приклад::

source: If you need to disable it entirely, set it to ``0``.
fa: اگر باید آن را به طور کامل غیرفعال کنید، آن را روی ``0`` تنظیم کنید.
ru: Если вам нужно полностью отключить его, установите для него значение ``0`` .

source: Footnotes
fa: پاورقی ها
ru: Сноски
uk: Виноски

source: Additional information on these special methods may be found in the Python Reference Manual (:ref:`customization`).
fa: اطلاعات اضافی در مورد این روش‌های خاص را می‌توانید در راهنمای مرجع پایتون (:ref:`customization`) پیدا کنید.
ru: Дополнительную информацию об этих специальных методах можно найти в Справочном руководстве Python ( :ref:`кастомизация` ).
uk: Додаткову інформацію про ці спеціальні методи можна знайти в довідковому посібнику Python (:ref:`customization`).

source: As a consequence, the list ``[1, 2]`` is considered equal to ``[1.0, 2.0]``, and similarly for tuples.
fa: در نتیجه، لیست ``[1, 2]`` برابر با ``[1.0, 2.0]`` و به طور مشابه برای تاپل ها در نظر گرفته می شود.
ru: Как следствие, список ``[1, 2]`` считается равным ``[1.0, 2.0]`` и аналогично для кортежей.
uk: Як наслідок, список ``[1, 2]`` вважається рівним ``[1.0, 2.0]``, і аналогічно для кортежів.

source: They must have since the parser can't tell the type of the operands.
fa: آنها باید داشته باشند زیرا تجزیه کننده نمی تواند نوع عملوندها را تشخیص دهد.
ru: Должно быть, так как синтаксический анализатор не может определить тип операндов.
uk: Мабуть, оскільки аналізатор не може визначити тип операндів.

source: Cased characters are those with general category property being one of "Lu" (Letter, uppercase), "Ll" (Letter, lowercase), or "Lt" (Letter, titlecase).
fa: نویسه‌های حروف کوچک، آنهایی هستند که ویژگی دسته‌بندی عمومی آنها یکی از «Lu» (حروف, بزرگ)، «Ll» (حروف, حروف کوچک), یا «Lt» (حروف, حروف عنوان) است.
ru: Символы в регистре — это символы, общее свойство категории которых равно «Lu» (буква, верхний регистр), «Ll» (буква, нижний регистр) или «Lt» (буква, заголовок).
uk: Регістр символів — це символи загальної категорії, які мають одну з таких властивостей: "Lu" (літера, верхній регістр), "Ll" (літера, нижній регістр) або "Lt" (літера, регістр заголовка).

source: To format only a tuple you should therefore provide a singleton tuple whose only element is the tuple to be formatted.
fa: برای فرمت کردن فقط یک تاپل، باید یک تاپل تک تنی تهیه کنید که تنها عنصر آن تاپلی است که باید قالب بندی شود.
ru: Поэтому, чтобы форматировать только кортеж, вам следует предоставить одноэлементный кортеж, единственным элементом которого является форматируемый кортеж.
uk: Щоб відформатувати лише кортеж, ви повинні надати одиночний кортеж, єдиним елементом якого є кортеж, який потрібно відформатувати.

source: built-in
fa: ساخته شده است
ru: встроенный

source: types
fa: انواع
ru: типы
uk: види

source: statement
fa: بیانیه
ru: инструкция
uk: заява

source: if
fa: اگر

source: while
fa: در حالی که

source: truth
fa: حقیقت

source: value
fa: ارزش
ru: значение
uk: значення

source: Boolean
fa: بولی
ru: Логический тип

source: operations
fa: عملیات
ru: операции

source: false
fa: نادرست
ru: ложь
uk: помилковий

source: true
fa: درست است
ru: истина
uk: правда

source: None (Built-in object)
fa: هیچ (شیء داخلی)
ru: None (встроенный object)

source: False (Built-in object)
fa: نادرست (شیء داخلی)
ru: False (встроенный object)

source: operator
fa: اپراتور
ru: оператор
uk: оператор

source: or
fa: یا

source: and
fa: و

source: False
fa: نادرست
ru: Ложь
uk: помилковий

source: True
fa: درست است
ru: Истина
uk: правда

source: not
fa: نه

source: chaining
fa: زنجیر زدن
ru: цепочка

source: comparisons
fa: مقایسه ها
ru: сравнения

source: comparison
fa: مقایسه
ru: сравнение

source: < (less)
fa: < (کمتر)
ru: < (меньше)

source: > (greater)
fa: > (بزرگتر)
ru: > (больше)

source: is
fa: است

source: is not
fa: نیست

source: object
fa: شی
ru: объект
uk: об'єкт

source: numeric
fa: عددی
ru: числовой

source: objects
fa: اشیاء
ru: объекты

source: comparing
fa: مقایسه کردن
ru: сравнение

source: __eq__() (instance method)
fa: __eq__() (روش نمونه)

source: __ne__() (instance method)
fa: __ne__() (روش نمونه)

source: __lt__() (instance method)
fa: __lt__() (روش نمونه)

source: __le__() (instance method)
fa: __le__() (روش نمونه)

source: __gt__() (instance method)
fa: __gt__() (روش نمونه)

source: __ge__() (instance method)
fa: __ge__() (روش نمونه)

source: in
fa: در

source: not in
fa: نه در

source: integer
fa: عدد صحیح
ru: целое число
uk: ціле число

source: floating-point
fa: ممیز شناور

source: complex number
fa: عدد مختلط
ru: комплексное число
uk: комплексне число

source: C
fa: سی

source: language
fa: زبان
ru: язык

source: literals
fa: به معنای واقعی کلمه
ru: литералы

source: hexadecimal
fa: هگزادسیمال
ru: шестнадцатеричная

source: octal
fa: هشتی
ru: восьмеричный

source: binary
fa: باینری
ru: бинарные

source: arithmetic
fa: حسابی
ru: арифметическме

source: built-in function
fa: عملکرد داخلی
ru: встроенная функция

source: int
fa: بین المللی

source: float
fa: شناور
uk: плавати

source: complex
fa: مجتمع
ru: комплексные

source: unary operator
fa: اپراتور unary
ru: унарный оператор

source: binary operator
fa: عملگر باینری
ru: бинарный оператор

source: * (asterisk)
fa: * (ستاره)
ru: * (звёздочка)

source: / (slash)
fa: / (اسلش)
ru: / (косая черта)

source: % (percent)
fa: % (درصد)
ru: % (процент)

source: operations on
fa: عملیات بر روی
ru: операции по

source: conjugate() (complex number method)
fa: conjugate() (روش اعداد مختلط)
ru: conjugate() (метод комплексных чисел)

source: module
fa: ماژول
ru: модуль
uk: модуль

source: math
fa: ریاضی
ru: математика
uk: математика

source: floor() (in module math)
fa: floor() (در ریاضیات ماژول)
ru: Floor() (в математическом модуле)

source: ceil() (in module math)
fa: ceil() (در ریاضیات ماژول)
ru: ceil() (в математическом модуле)

source: trunc() (in module math)
fa: trunc() (در ریاضیات ماژول)

source: conversions
fa: تبدیل ها
ru: конверсии

source: bitwise
fa: به صورت بیتی
ru: побитовый

source: shifting
fa: جابجایی
ru: смещение

source: masking
fa: پوشاندن
ru: маскировка

source: | (vertical bar)
fa: | (نوار عمودی)
ru: | (вертикальная полоса)

source: ^ (caret)
fa: ^ (کارت)

source: & (ampersand)
fa: & (امپرسند)
ru: & (амперсанд)

source: values
fa: ارزش ها
ru: значения
uk: значення

source: iterator protocol
fa: پروتکل تکرار کننده
ru: протокол итератора

source: protocol
fa: پروتکل
ru: протокол

source: iterator
fa: تکرار کننده
ru: итератор
uk: ітератор

source: sequence
fa: دنباله
ru: последовательность
uk: послідовність

source: iteration
fa: تکرار
ru: итерация

source: container
fa: ظرف
ru: контейнер

source: iteration over
fa: تکرار به پایان رسید
ru: итерация над

source: len
fa: لن

source: min
fa: دقیقه

source: max
fa: حداکثر

source: concatenation
fa: الحاق
ru: конкатенация

source: operation
fa: عملیات
ru: операция

source: repetition
fa: تکرار
ru: повторение

source: subscript
fa: زیرنویس
ru: нижний индекс

source: slice
fa: برش
ru: срез
uk: шматочок

source: count() (sequence method)
fa: count() (روش دنباله ای)

source: index() (sequence method)
fa: index() (روش دنباله ای)

source: loop
fa: حلقه
ru: цикл

source: over mutable sequence
fa: بیش از توالی قابل تغییر
ru: над изменяемой последовательностью

source: mutable sequence
fa: توالی قابل تغییر
ru: изменяемая последовательность

source: loop over
fa: حلقه روی
ru: цикл по адресу

source: immutable
fa: تغییرناپذیر
ru: неизменяемый
uk: незмінний

source: tuple
fa: چندتایی
ru: кортеж
uk: кортеж

source: hash
fa: هش

source: mutable
fa: قابل تغییر
ru: изменяемый
uk: мінливий

source: list
fa: فهرست
ru: список
uk: список

source: bytearray
fa: بایت آرایه
ru: байтовый массив

source: type
fa: نوع
ru: тип
uk: тип

source: assignment
fa: تکلیف
ru: присваивание

source: del
fa: دل

source: append() (sequence method)
fa: append() (روش دنباله ای)

source: clear() (sequence method)
fa: clear() (روش دنباله ای)

source: copy() (sequence method)
fa: copy() (روش دنباله ای)

source: extend() (sequence method)
fa: extend() (روش دنباله ای)

source: insert() (sequence method)
fa: insert() (روش دنباله)

source: pop() (sequence method)
fa: pop() (روش دنباله ای)

source: remove() (sequence method)
fa: remove() (روش دنباله ای)

source: reverse() (sequence method)
fa: reverse() (روش دنباله ای)

source: range
fa: محدوده

source: string
fa: رشته
ru: строка
uk: рядок

source: text sequence type
fa: نوع دنباله متن

source: str (built-in class)
fa: خیابان (کلاس توکار)

source: (see also string)
fa: (همچنین به رشته مراجعه کنید)
ru: (см. также строка )

source: buffer protocol
fa: پروتکل بافر
ru: Буферный протокол

source: bytes
fa: بایت ها
ru: байт
uk: байтів

source: methods
fa: روش ها
ru: методы

source: re
fa: دوباره
uk: повторно

source: universal newlines
fa: خطوط جدید جهانی
ru: универсальные переводы строк
uk: універсальні символи нового рядка

source: str.splitlines method
fa: روش str.splitlines

source: formatting, string (%)
fa: قالب بندی، رشته (%)

source: interpolation, string (%)
fa: درون یابی، رشته (%)

source: printf-style formatting
fa: قالب بندی به سبک printf

source: sprintf-style formatting
fa: قالب بندی به سبک sprintf

source: in printf-style formatting
fa: در قالب بندی به سبک printf

source: . (dot)
fa: . (نقطه)
ru: . (точка)

source: space
fa: فضا
uk: простір

source: binary sequence types
fa: انواع توالی باینری
ru: типы двоичных последовательностей

source: memoryview
fa: مموری ویو

source: array
fa: آرایه
uk: масив

source: bytes.splitlines method
fa: روش bytes.splitlines

source: bytearray.splitlines method
fa: روش bytearray.splitlines

source: formatting
fa: قالب بندی
ru: форматирование

source: bytes (%)
fa: بایت (%)
ru: байты (%)

source: bytearray (%)
fa: آرایه بایت (%)
ru: байтовый массив (%)

source: interpolation
fa: درون یابی
ru: интерполяция

source: set
fa: مجموعه
ru: установить
uk: встановити

source: mapping
fa: نقشه برداری
ru: сопоставление
uk: відображення

source: dictionary
fa: فرهنگ لغت
ru: словарь
uk: словник

source: context manager
fa: مدیر زمینه
ru: контекстный менеджер
uk: контекстний менеджер

source: context management protocol
fa: پروتکل مدیریت زمینه
ru: протокол управления контекстом

source: context management
fa: مدیریت زمینه
ru: управление контекстом

source: annotation
fa: حاشیه نویسی
ru: аннотация
uk: анотація

source: type annotation; type hint
fa: حاشیه نویسی را تایپ کنید. اشاره را تایپ کنید

source: Generic
fa: عمومی
ru: Общий

source: Alias
fa: نام مستعار
ru: псевдоним

source: Union
fa: اتحادیه
ru: Союз

source: union
fa: اتحادیه
ru: союз

source: method
fa: روش
ru: метод
uk: метод

source: code
fa: کد
ru: код
uk: код

source: code object
fa: شی کد
ru: объект кода

source: compile
fa: کامپایل کردن
ru: скомпилировать

source: __code__ (function object attribute)
fa: __code__ (ویژگی شی تابع)

source: exec
fa: اجرایی

source: eval
fa: ارزیابی

source: ellipsis literal
fa: بیضی به معنای واقعی کلمه

source: not equal
ru: не равно
uk: не рівні

source: Return ``True`` if all characters in the string are printable or the string is empty, ``False`` otherwise. Nonprintable characters are those characters defined in the Unicode character database as "Other" or "Separator", excepting the ASCII space (0x20) which is considered printable. (Note that printable characters in this context are those which should not be escaped when :func:`repr` is invoked on a string. It has no bearing on the handling of strings written to :data:`sys.stdout` or :data:`sys.stderr`.)
ru: Возвращаться ``Правда`` если все символы в строке доступны для печати или строка пуста, ``Ложь`` в противном случае. Непечатаемые символы — это символы, определенные в базе данных символов Юникода как «Другие» или «Разделители», за исключением пробела ASCII (0x20), который считается печатаемым. (Обратите внимание, что печатные символы в этом контексте — это те символы, которые не следует экранировать при :func:`repr` вызывается для строки. Это не имеет никакого отношения к обработке строк, записанных в :data:`sys.stdout` или :data:`sys.stderr` .)
uk: Повертає ``True``, якщо всі символи в рядку можна надрукувати або рядок порожній, ``False`` інакше. Символи, що не друкуються, — це символи, визначені в базі даних символів Unicode як "Інші" або "Розділювачі", за винятком пробілу ASCII (0x20), який вважається придатним для друку. (Зауважте, що друковані символи в цьому контексті – це ті символи, які не слід екранувати, коли :func:`repr` викликається в рядку. Це не впливає на обробку рядків, записаних у :data:`sys.stdout` або :data:`sys.stderr`.)

source: Return a copy of the string with all occurrences of substring *old* replaced by *new*. If the optional argument *count* is given, only the first *count* occurrences are replaced.
ru: Возвращает копию строки, в которой все вхождения подстроки *old* заменены на *new*. Если указан необязательный аргумент *count*, заменяются только первые вхождения *count*.
uk: Повертає копію рядка з усіма входженнями підрядка *old*, заміненими на *new*. Якщо вказано необов’язковий аргумент *count*, заміняються лише перші випадки *count*.

source: String objects have one unique built-in operation: the ``%`` operator (modulo). This is also known as the string *formatting* or *interpolation* operator. Given ``format % values`` (where *format* is a string), ``%`` conversion specifications in *format* are replaced with zero or more elements of *values*. The effect is similar to using the :c:func:`sprintf` in the C language.
ru: Строковые объекты имеют одну уникальную встроенную операцию: оператор % (по модулю). Это также известно как оператор *форматирования* строки или *интерполяции*. Учитывая ``формат % значений`` (где *format* — это строка), спецификации преобразования ``%`` в *format* заменяются нулем или более элементами *values*. Эффект аналогичен использованию :c:func:`sprintf` в языке C.
uk: Рядкові об’єкти мають одну унікальну вбудовану операцію: оператор ``%`` (по модулю). Це також відоме як оператор *форматування* рядка або *інтерполяції*. З огляду на ``формат % значень`` (де *format* є рядком), ``%`` специфікації перетворення у *format* замінюються нулем або більше елементами *значень*. Ефект подібний до використання :c:func:`sprintf` у мові C.

source: If no positional argument is given, an empty dictionary is created. If a positional argument is given and it is a mapping object, a dictionary is created with the same key-value pairs as the mapping object. Otherwise, the positional argument must be an :term:`iterable` object. Each item in the iterable must itself be an iterable with exactly two objects. The first object of each item becomes a key in the new dictionary, and the second object the corresponding value. If a key occurs more than once, the last value for that key becomes the corresponding value in the new dictionary.
ru: Если позиционный аргумент не указан, создается пустой словарь. Если задан позиционный аргумент и это объект сопоставления, словарь создается с теми же парами ключ-значение, что и объект сопоставления. В противном случае позиционный аргумент должен быть :term:`iterable` объектом. Каждый элемент в итерации сам по себе должен быть итерацией ровно с двумя объектами. Первый объект каждого элемента становится ключом в новом словаре, а второй объект — соответствующим значением. Если ключ встречается более одного раза, последнее значение этого ключа становится соответствующим значением в новом словаре.
uk: Якщо позиційний аргумент не задано, створюється порожній словник. Якщо вказано позиційний аргумент і він є об’єктом відображення, словник створюється з тими самими парами ключ-значення, що й об’єкт відображення. В іншому випадку позиційний аргумент має бути об’єктом :term:`iterable`. Кожен елемент у ітераторі повинен сам бути ітератором із рівно двома об’єктами. Перший об’єкт кожного елемента стає ключем у новому словнику, а другий об’єкт – відповідним значенням. Якщо ключ зустрічається більше одного разу, останнє значення цього ключа стає відповідним значенням у новому словнику.

source: :meth:`update` accepts either another dictionary object or an iterable of key/value pairs (as tuples or other iterables of length two). If keyword arguments are specified, the dictionary is then updated with those key/value pairs: ``d.update(red=1, blue=2)``.
ru: :meth:`обновить` принимает либо другой объект словаря, либо итерацию пар ключ/значение (в виде кортежей или других итераций длины два). Если указаны аргументы ключевого слова, словарь затем обновляется этими парами ключ/значение: ``d.update(красный=1, синий=2)`` .
uk: :meth:`update` приймає або інший об’єкт словника, або ітерацію пар ключ/значення (як кортежі чи інші ітерації довжиною два). Якщо вказано аргументи ключового слова, словник оновлюється такими парами ключ/значення: ``d.update(red=1, blue=2)``.

source: A dictionary or other mapping object used to store an object's (writable) attributes.
ru: Словарь или другой объект сопоставления, используемый для хранения атрибутов объекта (доступных для записи).
uk: Словник або інший об’єкт відображення, який використовується для зберігання атрибутів об’єкта (для запису).

source: The class to which a class instance belongs.
ru: Класс, которому принадлежит экземпляр класса.
uk: Клас, до якого належить екземпляр класу.

source: The tuple of base classes of a class object.
ru: Кортеж базовых классов объекта класса.
uk: Кортеж базових класів об’єкта класу.

source: This attribute is a tuple of classes that are considered when looking for base classes during method resolution.
ru: Этот атрибут представляет собой кортеж классов, которые учитываются при поиске базовых классов во время разрешения метода.
uk: Цей атрибут є кортежем класів, які враховуються під час пошуку базових класів під час вирішення методу.

source: This method can be overridden by a metaclass to customize the method resolution order for its instances. It is called at class instantiation, and its result is stored in :attr:`~class.__mro__`.
ru: Этот метод может быть переопределен метаклассом, чтобы настроить порядок разрешения методов для его экземпляров. Он вызывается при создании экземпляра класса, а его результат сохраняется в :attr:`~class.__mro__` .
uk: Цей метод може бути перевизначений метакласом, щоб налаштувати порядок вирішення методів для його екземплярів. Він викликається під час створення екземпляра класу, а його результат зберігається в :attr:`~class.__mro__`.

source: Each class keeps a list of weak references to its immediate subclasses. This method returns a list of all those references still alive. The list is in definition order. Example::
ru: Каждый класс хранит список слабых ссылок на свои непосредственные подклассы. Этот метод возвращает список всех живых ссылок. Список приведен в порядке определения. Пример::
uk: Кожен клас зберігає список слабких посилань на його безпосередні підкласи. Цей метод повертає список усіх посилань, які ще живі. Список у порядку визначення. Приклад::

source: + (plus)
ru: + (плюс)

source: - (minus)
ru: - (минус)

source: ~ (tilde)
ru: ~ (тильда)

source: By default, an object is considered true unless its class defines either a :meth:`__bool__` method that returns ``False`` or a :meth:`__len__` method that returns zero, when called with the object. [1]_ Here are most of the built-in objects considered false:
uk: За замовчуванням об’єкт вважається істинним, якщо його клас не визначає або метод :meth:`__bool__`, який повертає ``False``, або метод :meth:`__len__`, який повертає нуль під час виклику з об’єктом. [1]_ Ось більшість вбудованих об’єктів, які вважаються помилковими:

source: constants defined to be false: ``None`` and ``False``.
uk: константи, визначені як false: ``None`` і ``False``.

source: ``x or y``
uk: ``x або y``

source: ``x and y``
uk: ``x і y``

source: ``not x``
uk: ``не x``

source: ``is``
uk: ``є``

source: ``is not``
uk: ``не``

source: Two more operations with the same syntactic priority, :keyword:`in` and :keyword:`not in`, are supported by types that are :term:`iterable` or implement the :meth:`__contains__` method.
uk: Ще дві операції з таким же синтаксичним пріоритетом, :keyword:`in` і :keyword:`not in`, підтримуються типами, які є :term:`iterable` або реалізують метод :meth:`__contains__`.

source: Numbers are created by numeric literals or as the result of built-in functions and operators. Unadorned integer literals (including hex, octal and binary numbers) yield integers. Numeric literals containing a decimal point or an exponent sign yield floating point numbers. Appending ``'j'`` or ``'J'`` to a numeric literal yields an imaginary number (a complex number with a zero real part) which you can add to an integer or float to get a complex number with real and imaginary parts.
uk: Числа створюються за допомогою числових літералів або як результат вбудованих функцій і операторів. Неприкрашені цілі літерали (включаючи шістнадцяткові, вісімкові та двійкові числа) дають цілі числа. Числові літерали, що містять десяткову кому або знак експоненти, дають числа з плаваючою комою. Додавання ``'j'`` або ``'J''`` до числового літералу дає уявне число (комплексне число з нульовою дійсною частиною), яке ви можете додати до цілого числа або числа з плаваючою точкою, щоб отримати комплексне число з дійсним і уявні частини.

source: Also referred to as integer division. The resultant value is a whole integer, though the result's type is not necessarily int. The result is always rounded towards minus infinity: ``1//2`` is ``0``, ``(-1)//2`` is ``-1``, ``1//(-2)`` is ``-1``, and ``(-1)//(-2)`` is ``0``.
uk: Також називається цілим діленням. Результуюче значення є цілим числом, хоча тип результату не обов’язково є int. Результат завжди округлюється до мінус нескінченності: ``1//2`` це ``0``, ``(-1)//2`` ``-1``, ``1//(- 2) "`` — це "-1", а "(-1)//(-2)" — це "0".
