Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: fa, ru, uk

source: Return a copy of the object right justified in a sequence of length *width*. Padding is done using the specified *fillbyte* (default is an ASCII space). For :class:`bytes` objects, the original sequence is returned if *width* is less than or equal to ``len(s)``.
fa: یک کپی از سمت راست شیء توجیه شده در دنباله ای به طول *width* را برگردانید. padding با استفاده از *fillbyte* مشخص شده انجام می شود (پیش فرض یک فضای ASCII است). برای اشیاء :class:`bytes`، اگر *width* کمتر یا مساوی با ``len(s)`` باشد، دنباله اصلی برگردانده می شود.
ru: Возвращает копию объекта, выровненную по правому краю в последовательности длины *ширины*. Заполнение выполняется с использованием указанного *fillbyte* (по умолчанию используется пробел ASCII). Для :class:`байты` объекты, исходная последовательность возвращается, если *width* меньше или равна ``лен(ы)`` .
uk: Повертає копію об’єкта, вирівняну по правому краю в послідовності довжина *ширина*. Доповнення виконується за допомогою вказаного *fillbyte* (за замовчуванням це пробіл ASCII). Для об’єктів :class:`bytes` оригінальна послідовність повертається, якщо *width* менше або дорівнює ``len(s)``.

source: Split the binary sequence into subsequences of the same type, using *sep* as the delimiter string. If *maxsplit* is given, at most *maxsplit* splits are done, the *rightmost* ones. If *sep* is not specified or ``None``, any subsequence consisting solely of ASCII whitespace is a separator. Except for splitting from the right, :meth:`rsplit` behaves like :meth:`split` which is described in detail below.
fa: با استفاده از *sep* به عنوان رشته جداکننده، دنباله باینری را به دنباله های فرعی از همان نوع تقسیم کنید. اگر *maxsplit* داده شود، حداکثر تقسیم *maxsplit* انجام می شود، آنهایی که *rightmost* هستند. اگر *sep* یا ``None`` مشخص نشده باشد، هر دنباله ای که صرفاً از فضای سفید ASCII تشکیل شده باشد، جداکننده است. به جز تقسیم از راست، :meth:`rsplit` مانند :meth:`split` رفتار می کند که در زیر به تفصیل توضیح داده شده است.
ru: Разделите двоичную последовательность на подпоследовательности одного и того же типа, используя *sep* в качестве строки-разделителя. Если указано *maxsplit*, выполняется не более *maxsplit* разбиений, *самых правых*. Если *sep* не указано или ``Нет`` , любая подпоследовательность, состоящая исключительно из пробелов ASCII, является разделителем. За исключением раскола справа, :meth:`rsplit` ведет себя как :meth:`сплит` что подробно описано ниже.
uk: Розділіть бінарну послідовність на підпослідовності одного типу, використовуючи *sep* як рядок-роздільник. Якщо задано *maxsplit*, виконується щонайбільше *maxsplit* розбиття, *найправіші*. Якщо *sep* не вказано або ``None``, будь-яка підпослідовність, що складається виключно з пробілів ASCII, є роздільником. За винятком розділення справа, :meth:`rsplit` поводиться як :meth:`split`, що детально описано нижче.

source: Return a copy of the sequence with specified trailing bytes removed. The *chars* argument is a binary sequence specifying the set of byte values to be removed - the name refers to the fact this method is usually used with ASCII characters. If omitted or ``None``, the *chars* argument defaults to removing ASCII whitespace. The *chars* argument is not a suffix; rather, all combinations of its values are stripped::
fa: یک کپی از دنباله را با حذف بایت های انتهایی مشخص شده برگردانید. آرگومان *chars* یک دنباله باینری است که مجموعه ای از مقادیر بایت را مشخص می کند که باید حذف شوند - این نام به این واقعیت اشاره دارد که این روش معمولاً با کاراکترهای ASCII استفاده می شود. در صورت حذف یا ``None``، آرگومان *chars* به طور پیش‌فرض فضای سفید ASCII را حذف می‌کند. آرگومان *chars* پسوند نیست. بلکه تمام ترکیبات مقادیر آن حذف می شوند::
ru: Вернуть копию последовательности с удаленными указанными конечными байтами. Аргумент *chars* представляет собой двоичную последовательность, определяющую набор удаляемых байтовых значений. Название указывает на тот факт, что этот метод обычно используется с символами ASCII. Если опущено или ``Нет`` , аргумент *chars* по умолчанию удаляет пробелы ASCII. Аргумент *chars* не является суффиксом; скорее, все комбинации его значений удаляются::
uk: Повертає копію послідовності з видаленими вказаними кінцевими байтами. Аргумент *chars* є двійковою послідовністю, яка визначає набір значень байтів, які потрібно видалити. Назва вказує на те, що цей метод зазвичай використовується з символами ASCII. Якщо пропущено або ``None``, аргумент *chars* за замовчуванням видаляє пробіли ASCII. Аргумент *chars* не є суфіксом; навпаки, усі комбінації його значень видаляються:

source: The binary sequence of byte values to remove may be any :term:`bytes-like object`. See :meth:`~bytes.removesuffix` for a method that will remove a single suffix string rather than all of a set of characters. For example::
fa: توالی دودویی مقادیر بایت برای حذف ممکن است هر :term:`bytes-like object` باشد. :meth:`~bytes.removesuffix` را برای روشی ببینید که یک رشته پسوند واحد را به جای همه مجموعه ای از کاراکترها حذف می کند. به عنوان مثال::
ru: Двоичная последовательность удаляемых байтовых значений может быть любым :term:`байтоподобным объектом`. Видеть :meth:`~bytes.removesuffix` для метода, который удалит одну суффиксную строку, а не весь набор символов. Например::
uk: Двійкова послідовність байтових значень для видалення може бути будь-яким :term:`bytes-like object`. Перегляньте :meth:`~bytes.removesuffix`, щоб дізнатися про метод, який видалить один рядок суфікса, а не весь набір символів. Наприклад::

source: Split the binary sequence into subsequences of the same type, using *sep* as the delimiter string. If *maxsplit* is given and non-negative, at most *maxsplit* splits are done (thus, the list will have at most ``maxsplit+1`` elements). If *maxsplit* is not specified or is ``-1``, then there is no limit on the number of splits (all possible splits are made).
fa: با استفاده از *sep* به عنوان رشته جداکننده، دنباله باینری را به دنباله های فرعی از همان نوع تقسیم کنید. اگر *maxsplit* داده شود و غیر منفی باشد، حداکثر تقسیم *maxsplit* انجام می شود (بنابراین, لیست حداکثر دارای عناصر ``maxsplit+1`` خواهد بود). اگر *maxsplit* مشخص نشده باشد یا ``-1`` باشد، محدودیتی در تعداد تقسیم ها وجود ندارد (همه تقسیم های ممکن انجام می شود).
ru: Разделите двоичную последовательность на подпоследовательности одного и того же типа, используя *sep* в качестве строки-разделителя. Если задано *maxsplit* и оно неотрицательно, выполняется не более *maxsplit* разбиений (таким образом, в списке будет не более ``макссплит+1`` элементы). Если *maxsplit* не указан или ``-1`` , то количество разбиений не ограничено (сделаны все возможные разбиения).
uk: Розділіть бінарну послідовність на підпослідовності одного типу, використовуючи *sep* як рядок-роздільник. Якщо задано *maxsplit* і воно є невід’ємним, виконується щонайбільше розділень *maxsplit* (отже, список матиме щонайбільше елементів ``maxsplit+1``). Якщо *maxsplit* не вказано або дорівнює ``-1``, тоді немає обмежень на кількість розбивок (виконуються всі можливі розбиття).

source: If *sep* is given, consecutive delimiters are not grouped together and are deemed to delimit empty subsequences (for example, ``b'1,,2'.split(b',')`` returns ``[b'1', b'', b'2']``). The *sep* argument may consist of a multibyte sequence as a single delimiter. Splitting an empty sequence with a specified separator returns ``[b'']`` or ``[bytearray(b'')]`` depending on the type of object being split. The *sep* argument may be any :term:`bytes-like object`.
fa: اگر *sep* داده شود، جداکننده‌های متوالی با هم گروه‌بندی نمی‌شوند و به نظر می‌رسد که دنباله‌های خالی را محدود می‌کنند (برای مثال, ``b'1,,2'.split(b',')`` ``[b'1', b'', b'2']`` را برمی‌گرداند). آرگومان *sep* ممکن است از یک دنباله چند بایتی به عنوان یک جداکننده منفرد تشکیل شده باشد. تقسیم یک دنباله خالی با یک جداکننده مشخص, ``[b'']`` یا ``[bytearray(b'')]`` را بسته به نوع شیئی که تقسیم می شود، برمی گرداند. آرگومان *sep* ممکن است هر :term:`bytes-like object` باشد.

source: If *sep* is not specified or is ``None``, a different splitting algorithm is applied: runs of consecutive ASCII whitespace are regarded as a single separator, and the result will contain no empty strings at the start or end if the sequence has leading or trailing whitespace. Consequently, splitting an empty sequence or a sequence consisting solely of ASCII whitespace without a specified separator returns ``[]``.
fa: اگر *sep* مشخص نشده باشد یا ``None`` باشد، یک الگوریتم تقسیم متفاوت اعمال می‌شود: اجرای فضای سفید متوالی ASCII به عنوان یک جداکننده در نظر گرفته می‌شود و اگر دنباله دارای فضای سفید پیشرو یا انتهایی باشد، نتیجه در ابتدا یا انتهای آن رشته‌های خالی نخواهد داشت. در نتیجه، تقسیم یک دنباله خالی یا یک دنباله متشکل از فضای سفید ASCII بدون جداکننده مشخص، ``[]`` را برمی‌گرداند.
ru: Если *sep* не указано или ``Нет`` , применяется другой алгоритм разделения: серии последовательных пробелов ASCII рассматриваются как один разделитель, и результат не будет содержать пустых строк в начале или конце, если последовательность имеет начальные или конечные пробелы. Следовательно, разделение пустой последовательности или последовательности, состоящей исключительно из пробелов ASCII без указанного разделителя, возвращает результат. ``[]`` .
uk: Якщо *sep* не вказано або має значення ``None``, застосовується інший алгоритм поділу: цикли послідовних пробілів ASCII розглядаються як один роздільник, і результат не міститиме порожніх рядків на початку або в кінці, якщо послідовність має пробіли на початку або в кінці. Отже, розділення порожньої послідовності або послідовності, що складається виключно з пробілів ASCII без указаного роздільника, повертає ``[]``.

source: Return a copy of the sequence with specified leading and trailing bytes removed. The *chars* argument is a binary sequence specifying the set of byte values to be removed - the name refers to the fact this method is usually used with ASCII characters. If omitted or ``None``, the *chars* argument defaults to removing ASCII whitespace. The *chars* argument is not a prefix or suffix; rather, all combinations of its values are stripped::
fa: یک کپی از دنباله را با حذف بایت های اصلی و انتهایی مشخص شده برگردانید. آرگومان *chars* یک دنباله باینری است که مجموعه ای از مقادیر بایت را مشخص می کند که باید حذف شوند - این نام به این واقعیت اشاره دارد که این روش معمولاً با کاراکترهای ASCII استفاده می شود. در صورت حذف یا ``None``، آرگومان *chars* به طور پیش‌فرض فضای سفید ASCII را حذف می‌کند. آرگومان *chars* یک پیشوند یا پسوند نیست. بلکه تمام ترکیبات مقادیر آن حذف می شوند::
ru: Вернуть копию последовательности с удаленными указанными ведущими и конечными байтами. Аргумент *chars* представляет собой двоичную последовательность, определяющую набор удаляемых байтовых значений. Название указывает на тот факт, что этот метод обычно используется с символами ASCII. Если опущено или ``Нет`` , аргумент *chars* по умолчанию удаляет пробелы ASCII. Аргумент *chars* не является префиксом или суффиксом; скорее, все комбинации его значений удаляются::
uk: Повертає копію послідовності з вилученими вказаними початковим і кінцевим байтами. Аргумент *chars* є двійковою послідовністю, яка визначає набір значень байтів, які потрібно видалити. Назва вказує на те, що цей метод зазвичай використовується з символами ASCII. Якщо пропущено або ``None``, аргумент *chars* за замовчуванням видаляє пробіли ASCII. Аргумент *chars* не є префіксом або суфіксом; навпаки, усі комбінації його значень видаляються:

source: The binary sequence of byte values to remove may be any :term:`bytes-like object`.
fa: توالی دودویی مقادیر بایت برای حذف ممکن است هر :term:`bytes-like object` باشد.
ru: Двоичная последовательность удаляемых байтовых значений может быть любым :term:`байтоподобным объектом`.
uk: Двійкова послідовність байтових значень для видалення може бути будь-яким :term:`bytes-like object`.

source: The following methods on bytes and bytearray objects assume the use of ASCII compatible binary formats and should not be applied to arbitrary binary data. Note that all of the bytearray methods in this section do *not* operate in place, and instead produce new objects.
fa: روش‌های زیر روی بایت‌ها و اشیاء بایت آرایه استفاده از فرمت‌های باینری سازگار با ASCII را فرض می‌کنند و نباید برای داده‌های باینری دلخواه اعمال شوند. توجه داشته باشید که تمام متدهای بایت آرایه در این بخش *not* در جای خود عمل می کنند و در عوض اشیاء جدیدی تولید می کنند.
ru: Следующие методы для объектов байтов и байтовых массивов предполагают использование двоичных форматов, совместимых с ASCII, и их не следует применять к произвольным двоичным данным. Обратите внимание, что все методы bytearray в этом разделе *не* работают на месте, а вместо этого создают новые объекты.
uk: Наступні методи для об’єктів bytes і bytearray передбачають використання двійкових форматів, сумісних із ASCII, і їх не слід застосовувати до довільних двійкових даних. Зауважте, що всі методи bytearray у цьому розділі *не* працюють на місці, а створюють нові об’єкти.

source: Return a copy of the sequence with each byte interpreted as an ASCII character, and the first byte capitalized and the rest lowercased. Non-ASCII byte values are passed through unchanged.
fa: یک کپی از دنباله را با هر بایت به عنوان یک کاراکتر ASCII برگردانید و اولین بایت با حروف بزرگ و بقیه با حروف کوچک نوشته شود. مقادیر بایت غیر ASCII بدون تغییر منتقل می شوند.
ru: Возвращает копию последовательности, в которой каждый байт интерпретируется как символ ASCII, причем первый байт пишется с заглавной буквы, а остальные — со строчной. Значения байтов, отличные от ASCII, передаются без изменений.
uk: Повертає копію послідовності з кожним байтом, інтерпретованим як символ ASCII, і перший байт у великому регістрі, а решта – у нижньому. Байтові значення, відмінні від ASCII, передаються без змін.

source: Return a copy of the sequence where all ASCII tab characters are replaced by one or more ASCII spaces, depending on the current column and the given tab size. Tab positions occur every *tabsize* bytes (default is 8, giving tab positions at columns 0, 8, 16 and so on). To expand the sequence, the current column is set to zero and the sequence is examined byte by byte. If the byte is an ASCII tab character (``b'\t'``), one or more space characters are inserted in the result until the current column is equal to the next tab position. (The tab character itself is not copied.) If the current byte is an ASCII newline (``b'\n'``) or carriage return (``b'\r'``), it is copied and the current column is reset to zero. Any other byte value is copied unchanged and the current column is incremented by one regardless of how the byte value is represented when printed::
fa: یک کپی از دنباله ای را برگردانید که در آن همه کاراکترهای برگه ASCII با یک یا چند فاصله ASCII جایگزین می شوند، بسته به ستون فعلی و اندازه برگه داده شده. موقعیت های برگه در هر *tabsize* بایت رخ می دهد (پیش فرض 8 است که موقعیت های برگه را در ستون های 0, 8, 16 و غیره می دهد). برای گسترش دنباله، ستون فعلی صفر می شود و دنباله بایت به بایت بررسی می شود. اگر بایت یک کاراکتر برگه ASCII (``b'\t'``) باشد، یک یا چند کاراکتر فاصله در نتیجه درج می شود تا زمانی که ستون فعلی با موقعیت زبانه بعدی برابر شود. (خود کاراکتر برگه کپی نشده است.) اگر بایت فعلی یک خط جدید ASCII (``b'\n'``) یا بازگشتی حامل (``b'\r'``) باشد، کپی می شود و ستون فعلی به صفر بازنشانی می شود. هر مقدار بایت دیگر بدون تغییر کپی می شود و ستون فعلی یک عدد افزایش می یابد، صرف نظر از نحوه نمایش مقدار بایت هنگام چاپ:
ru: Возвращает копию последовательности, в которой все символы табуляции ASCII заменяются одним или несколькими пробелами ASCII, в зависимости от текущего столбца и заданного размера табуляции. Позиции табуляции встречаются через каждые *tabsize* байты (по умолчанию — 8, что дает позиции табуляции в столбцах 0, 8, 16 и т. д.). Чтобы расширить последовательность, текущий столбец устанавливается на ноль, и последовательность проверяется побайтно. Если байт представляет собой символ табуляции ASCII ( ``б'\т'`` ), в результат вставляются один или несколько символов пробела, пока текущий столбец не сравняется со следующей позицией табуляции. (Сам символ табуляции не копируется.) Если текущий байт является символом новой строки ASCII ( ``б'\n'`` ) или возврат каретки ( ``б'\р'`` ), он копируется, и текущий столбец сбрасывается в ноль. Любое другое значение байта копируется без изменений, а текущий столбец увеличивается на единицу независимо от того, как значение байта представляется при печати:
uk: Повертає копію послідовності, де всі символи табуляції ASCII замінено одним або декількома пробілами ASCII, залежно від поточного стовпця та заданого розміру табуляції. Позиції табуляції відбуваються кожні байти *табуляції* (за замовчуванням — 8, надаючи позиції табуляції в стовпцях 0, 8, 16 і так далі). Щоб розширити послідовність, поточний стовпець встановлюється на нуль і послідовність перевіряється побайтно. Якщо байт є символом табуляції ASCII (``b'\t'``), один або більше символів пробілу вставляються в результат, доки поточний стовпець не буде відповідати наступній позиції табуляції. (Сам символ табуляції не копіюється.) Якщо поточний байт є ASCII символом нового рядка (``b'\n'``) або поверненням каретки (``b'\r'``), він копіюється і поточний стовпець скидається на нуль. Будь-яке інше значення байта копіюється без змін, а поточний стовпець збільшується на одиницю незалежно від того, як значення байта представлено під час друку::

source: Return ``True`` if all bytes in the sequence are alphabetical ASCII characters or ASCII decimal digits and the sequence is not empty, ``False`` otherwise. Alphabetic ASCII characters are those byte values in the sequence ``b'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ'``. ASCII decimal digits are those byte values in the sequence ``b'0123456789'``.
fa: اگر تمام بایت‌های دنباله حروف الفبای اسکی یا ارقام اعشاری ASCII هستند و دنباله خالی نیست، ``True`` را برگردانید، در غیر این صورت ``False``. کاراکترهای ASCII الفبایی آن مقادیر بایت در دنباله ``b'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ'`` هستند. ارقام اعشاری ASCII آن مقادیر بایت در دنباله ``b'0123456789'`` هستند.
ru: Возвращаться ``Правда`` если все байты в последовательности являются буквенными символами ASCII или десятичными цифрами ASCII и последовательность не пуста, ``Ложь`` в противном случае. Алфавитные символы ASCII — это значения байтов в последовательности. ``b'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ'`` . Десятичные цифры ASCII — это значения байтов в последовательности ``b'0123456789'`` .
uk: Повертає ``True``, якщо всі байти в послідовності є алфавітними символами ASCII або десятковими цифрами ASCII і послідовність не є порожньою, ``False`` інакше. Алфавітні символи ASCII – це значення байтів у послідовності ``b'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ``. Десяткові цифри ASCII – це значення байтів у послідовності ``b'0123456789``.

source: Return ``True`` if all bytes in the sequence are alphabetic ASCII characters and the sequence is not empty, ``False`` otherwise. Alphabetic ASCII characters are those byte values in the sequence ``b'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ'``.
fa: اگر همه بایت‌های دنباله حروف الفبای ASCII هستند و دنباله خالی نیست، ``True`` را برگردانید، در غیر این صورت ``False`` را برگردانید. کاراکترهای ASCII حروف الفبا آن مقادیر بایت در دنباله ``b'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ'`` هستند.
ru: Возвращаться ``Правда`` если все байты в последовательности являются буквенными символами ASCII и последовательность не пуста, ``Ложь`` в противном случае. Алфавитные символы ASCII — это значения байтов в последовательности. ``b'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ'`` .
uk: Повертає ``True``, якщо всі байти в послідовності є алфавітними символами ASCII і послідовність не є пустою, ``False`` інакше. Алфавітні символи ASCII – це значення байтів у послідовності ``b'abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ``.

source: Return ``True`` if the sequence is empty or all bytes in the sequence are ASCII, ``False`` otherwise. ASCII bytes are in the range 0-0x7F.
fa: اگر دنباله خالی است یا تمام بایت های دنباله ASCII هستند، ``True`` را برگردانید در غیر این صورت ``False``. بایت های ASCII در محدوده 0-0x7F هستند.
ru: Возвращаться ``Правда`` если последовательность пуста или все байты в последовательности являются ASCII, ``Ложь`` в противном случае. Байты ASCII находятся в диапазоне 0–0x7F.
uk: Повертає ``True``, якщо послідовність порожня або всі байти в послідовності ASCII, ``False`` інакше. Байти ASCII знаходяться в діапазоні 0-0x7F.

source: Return ``True`` if all bytes in the sequence are ASCII decimal digits and the sequence is not empty, ``False`` otherwise. ASCII decimal digits are those byte values in the sequence ``b'0123456789'``.
fa: اگر تمام بایت های دنباله ارقام اعشاری ASCII هستند و دنباله خالی نیست، ``True`` را برگردانید، در غیر این صورت ``False`` را برگردانید. ارقام اعشاری ASCII آن مقادیر بایت در دنباله ``b'0123456789'`` هستند.
ru: Возвращаться ``Правда`` если все байты в последовательности представляют собой десятичные цифры ASCII и последовательность не пуста, ``Ложь`` в противном случае. Десятичные цифры ASCII — это значения байтов в последовательности ``b'0123456789'`` .
uk: Повертає ``True``, якщо всі байти в послідовності є десятковими цифрами ASCII і послідовність не порожня, ``False`` інакше. Десяткові цифри ASCII – це значення байтів у послідовності ``b'0123456789``.

source: Return ``True`` if there is at least one lowercase ASCII character in the sequence and no uppercase ASCII characters, ``False`` otherwise.
fa: اگر حداقل یک نویسه ASCII کوچک در دنباله وجود دارد و هیچ نویسه ASCII بزرگ وجود ندارد، ``True`` را برگردانید، در غیر این صورت ``False``.
ru: Возвращаться ``Правда`` если в последовательности есть хотя бы один символ ASCII нижнего регистра и нет символов ASCII верхнего регистра, ``Ложь`` в противном случае.
uk: Повертає ``True``, якщо в послідовності є принаймні один символ нижнього регістру ASCII і немає символів ASCII у верхньому регістрі, інакше ``False``.

source: Lowercase ASCII characters are those byte values in the sequence ``b'abcdefghijklmnopqrstuvwxyz'``. Uppercase ASCII characters are those byte values in the sequence ``b'ABCDEFGHIJKLMNOPQRSTUVWXYZ'``.
fa: حروف کوچک ASCII مقادیر بایتی در دنباله ``b'abcdefghijklmnopqrstuvwxyz'`` هستند. کاراکترهای ASCII بزرگ آن مقادیر بایت در دنباله ``b'ABCDEFGHIJKLMNOPQRSTUVWXYZ'`` هستند.
ru: Символы ASCII нижнего регистра — это значения байтов в последовательности. ``b'abcdefghijklmnopqrstuvwxyz'`` . Символы ASCII верхнего регистра — это значения байтов в последовательности. ``b'ABCDEFGHIJKLMNOPQRSTUVWXYZ'`` .
uk: Символи ASCII у нижньому регістрі – це значення байтів у послідовності ``b'abcdefghijklmnopqrstuvwxyz``. Символи ASCII у верхньому регістрі – це значення байтів у послідовності ``b'ABCDEFGHIJKLMNOPQRSTUVWXYZ``.
