Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: fa, ru, uk

source: An integer indicating how many dimensions of a multi-dimensional array the memory represents.
fa: یک عدد صحیح که نشان می دهد حافظه چند بعد از یک آرایه چند بعدی را نشان می دهد.
ru: Целое число, указывающее, сколько измерений многомерного массива представляет память.
uk: Ціле число, що вказує, скільки вимірів багатовимірного масиву представляє пам’ять.

source: A tuple of integers the length of :attr:`ndim` giving the shape of the memory as an N-dimensional array.
fa: چند اعداد صحیح به طول :attr:`ndim` شکل حافظه را به عنوان یک آرایه N بعدی می دهد.
ru: Кортеж целых чисел длиной :attr:`я` придание памяти формы N-мерного массива.
uk: Кортеж цілих чисел довжиною :attr:`ndim`, що надає форму пам’яті як N-вимірного масиву.

source: An empty tuple instead of ``None`` when ndim = 0.
fa: یک تاپل خالی به جای ``None`` وقتی ndim = 0 است.
ru: Пустой кортеж вместо ``Нет`` когда ндим = 0.
uk: Порожній кортеж замість ``None``, коли ndim = 0.

source: A tuple of integers the length of :attr:`ndim` giving the size in bytes to access each element for each dimension of the array.
fa: چند اعداد صحیح به طول :attr:`ndim` که اندازه را بر حسب بایت برای دسترسی به هر عنصر برای هر بعد آرایه می دهد.
ru: Кортеж целых чисел длиной :attr:`я` указание размера в байтах для доступа к каждому элементу для каждого измерения массива.
uk: Кортеж цілих чисел довжиною :attr:`ndim`, що вказує розмір у байтах для доступу до кожного елемента для кожного виміру масиву.

source: Used internally for PIL-style arrays. The value is informational only.
fa: به صورت داخلی برای آرایه های به سبک PIL استفاده می شود. ارزش فقط اطلاعاتی است.
uk: Використовується внутрішньо для масивів у стилі PIL. Значення лише інформаційне.

source: A bool indicating whether the memory is C-:term:`contiguous`.
fa: یک بولی که نشان می دهد حافظه C-:term:`contiguous` است یا خیر.
ru: Логическое значение, указывающее, является ли память C-:term:`непрерывной`.
uk: Логічне значення, яке вказує, чи є пам’ять C-:term:`contiguous`.

source: A bool indicating whether the memory is Fortran :term:`contiguous`.
fa: یک بولی که نشان می دهد حافظه Fortran :term:`contiguous` است یا خیر.
ru: Логическое значение, указывающее, является ли память :term:`непрерывной` в формате Фортрана.
uk: Логічне значення, що вказує, чи є пам’ять Fortran :term:`contiguous`.

source: A bool indicating whether the memory is :term:`contiguous`.
fa: یک بولی که نشان می دهد حافظه :term:`contiguous` است یا خیر.
ru: Логическое значение, указывающее, является ли память :term:`непрерывной`.
uk: Bool, що вказує, чи є пам’ять :term:`contiguous`.

source: Set Types --- :class:`set`, :class:`frozenset`
fa: انواع مجموعه --- :class:`set`, :class:`frozenset`
ru: Типы наборов --- :class:`set`, :class:`frozenset`
uk: Типи наборів --- :class:`set`, :class:`frozenset`

source: A :dfn:`set` object is an unordered collection of distinct :term:`hashable` objects. Common uses include membership testing, removing duplicates from a sequence, and computing mathematical operations such as intersection, union, difference, and symmetric difference. (For other containers see the built-in :class:`dict`, :class:`list`, and :class:`tuple` classes, and the :mod:`collections` module.)
fa: یک شی :dfn:`set` مجموعه ای نامرتب از اشیاء متمایز :term:`hashable` است. کاربردهای رایج شامل تست عضویت، حذف موارد تکراری از یک دنباله و محاسبه عملیات ریاضی مانند تقاطع، اتحاد، تفاوت و تفاوت متقارن است. (برای سایر کانتینرها به کلاس های داخلی :class:`dict`, :class:`list`, و :class:`tuple` و ماژول :mod:`collections` مراجعه کنید.)
ru: Объект :dfn:`set` представляет собой неупорядоченную коллекцию различных :term:`hashable` объектов. Обычное использование включает проверку членства, удаление дубликатов из последовательности и вычисление математических операций, таких как пересечение, объединение, разность и симметричная разность. (Для других контейнеров см. встроенный :class:`dict` , :class:`список` , и :class:`кортеж` занятия и :mod:`коллекции` модуль.)
uk: Об’єкт :dfn:`set` — це невпорядкована колекція окремих об’єктів :term:`hashable`. Загальне використання включає тестування членства, видалення дублікатів із послідовності та обчислення математичних операцій, таких як перетин, об’єднання, різниця та симетрична різниця. (Для інших контейнерів перегляньте вбудовані класи :class:`dict`, :class:`list` і :class:`tuple`, а також модуль :mod:`collections`.)

source: Like other collections, sets support ``x in set``, ``len(set)``, and ``for x in set``. Being an unordered collection, sets do not record element position or order of insertion. Accordingly, sets do not support indexing, slicing, or other sequence-like behavior.
fa: مانند سایر مجموعه ها، مجموعه ها از ``x in set``، ``len(set)`` و ``for x in set`` پشتیبانی می کنند. مجموعه‌ها از آنجایی که مجموعه‌ای نامرتب هستند، موقعیت یا ترتیب درج عنصر را ثبت نمی‌کنند. بر این اساس، مجموعه ها از نمایه سازی، برش یا سایر رفتارهای توالی مانند پشتیبانی نمی کنند.
ru: Как и другие коллекции, наборы поддерживают ``x в наборе`` , ``лен(набор)`` , и ``для x в наборе`` . Будучи неупорядоченной коллекцией, наборы не записывают положение элемента или порядок вставки. Соответственно, наборы не поддерживают индексирование, нарезку или другое поведение, подобное последовательностям.
uk: Як і інші колекції, набори підтримують ``x in set``, ``len(set)`` і ``for x in set``. Будучи невпорядкованою колекцією, набори не записують положення елемента або порядок вставки. Відповідно, набори не підтримують індексування, нарізку чи іншу поведінку, подібну до послідовності.

source: There are currently two built-in set types, :class:`set` and :class:`frozenset`. The :class:`set` type is mutable --- the contents can be changed using methods like :meth:`~set.add` and :meth:`~set.remove`. Since it is mutable, it has no hash value and cannot be used as either a dictionary key or as an element of another set. The :class:`frozenset` type is immutable and :term:`hashable` --- its contents cannot be altered after it is created; it can therefore be used as a dictionary key or as an element of another set.
fa: در حال حاضر دو نوع مجموعه داخلی وجود دارد، :class:`set` و :class:`frozenset`. نوع :class:`set` قابل تغییر است --- محتویات را می توان با استفاده از روش هایی مانند :meth:`~set.add` و :meth:`~set.remove` تغییر داد. از آنجایی که قابل تغییر است، هیچ مقدار هش ندارد و نمی تواند به عنوان کلید فرهنگ لغت یا به عنوان عنصری از مجموعه دیگری استفاده شود. نوع :class:`frozenset` تغییرناپذیر است و :term:`hashable` --- محتویات آن را نمی توان پس از ایجاد تغییر داد. بنابراین می توان از آن به عنوان کلید فرهنگ لغت یا به عنوان عنصری از مجموعه دیگری استفاده کرد.
ru: В настоящее время существует два встроенных типа наборов: :класс:`набор` и :class:`frozenset` . :класс:`набор` тип является изменяемым --- содержимое можно изменить с помощью таких методов, как :meth:`~set.add` и :meth:`~set.remove` . Поскольку он изменчив, он не имеет хэш-значения и не может использоваться ни как ключ словаря, ни как элемент другого набора. :class:`frozenset` type является неизменяемым и :term:`hashable` --- его содержимое не может быть изменено после его создания; поэтому его можно использовать как ключ словаря или как элемент другого набора.
uk: Наразі існує два вбудовані типи наборів: :class:`set` і :class:`frozenset`. Тип :class:`set` є змінним --- вміст можна змінити за допомогою таких методів, як :meth:`~set.add` і :meth:`~set.remove`. Оскільки він є змінним, він не має хеш-значення і не може використовуватися ні як ключ словника, ні як елемент іншого набору. Тип :class:`frozenset` є незмінним і :term:`hashable` --- його вміст не можна змінити після створення; тому його можна використовувати як ключ до словника або як елемент іншого набору.

source: Non-empty sets (not frozensets) can be created by placing a comma-separated list of elements within braces, for example: ``{'jack', 'sjoerd'}``, in addition to the :class:`set` constructor.
fa: مجموعه‌های غیر خالی (نه مجموعه‌های منجمد) را می‌توان با قرار دادن فهرستی از عناصر جدا شده با کاما در داخل پرانتزها ایجاد کرد، برای مثال: ``{'jack', 'sjoerd'}``، علاوه بر سازنده :class:`set`.
ru: Непустые наборы (не замороженные наборы) можно создавать, помещая список элементов, разделенных запятыми, в фигурные скобки, например: ``{'джек', 'сйорд'}`` , в дополнение к :класс:`набор` конструктор.
uk: Непорожні набори (не заморожені набори) можна створити шляхом розміщення списку елементів, розділених комами, у фігурних дужках, наприклад: ``{'jack', 'sjoerd'}``, на додаток до :class:`set` конструктор.

source: The constructors for both classes work the same:
fa: سازنده های هر دو کلاس یکسان کار می کنند:
ru: Конструкторы для обоих классов работают одинаково:
uk: Конструктори для обох класів працюють однаково:

source: Return a new set or frozenset object whose elements are taken from *iterable*. The elements of a set must be :term:`hashable`. To represent sets of sets, the inner sets must be :class:`frozenset` objects. If *iterable* is not specified, a new empty set is returned.
fa: یک مجموعه جدید یا شیء منجمد شده که عناصر آن از *iterable* گرفته شده است را برگردانید. عناصر یک مجموعه باید :term:`hashable` باشد. برای نمایش مجموعه ای از مجموعه ها، مجموعه های داخلی باید اشیاء :class:`frozenset` باشند. اگر *iterable* مشخص نشده باشد، یک مجموعه خالی جدید برگردانده می شود.
ru: Возвращает новый объект set или Frozenset, элементы которого взяты из *iterable*. Элементы набора должны быть :term:`hashable`. Чтобы представлять наборы наборов, внутренние наборы должны быть :class:`frozenset` объекты. Если *iterable* не указано, возвращается новый пустой набор.
uk: Повертає новий набір або заморожений об’єкт, елементи якого взяті з *iterable*. Елементи набору мають бути :term:`hashable`. Щоб представити набори наборів, внутрішні набори мають бути об’єктами :class:`frozenset`. Якщо *iterable* не вказано, повертається новий порожній набір.

source: Sets can be created by several means:
fa: مجموعه ها را می توان به روش های مختلفی ایجاد کرد:
ru: Наборы можно создавать несколькими способами:
uk: Набори можна створювати кількома способами:

source: Use a comma-separated list of elements within braces: ``{'jack', 'sjoerd'}``
fa: از یک لیست جدا شده با کاما از عناصر درون پرانتز استفاده کنید: ``{'jack', 'sjoerd'}``
ru: Используйте список элементов, разделенных запятыми, в фигурных скобках: ``{'джек', 'сйорд'}``
uk: Використовуйте список елементів, розділених комами, у фігурних дужках: ``{'jack', 'sjoerd'}``

source: Use a set comprehension: ``{c for c in 'abracadabra' if c not in 'abc'}``
fa: از یک مجموعه درک استفاده کنید: ``{c for c in 'abracadabra' if c not in 'abc'}``
ru: Используйте понимание множества: ``{c вместо c в 'abracadabra', если c не в 'abc'}``
uk: Використовуйте розуміння набору: ``{c для c в 'abracadabra' якщо c не в 'abc'}``

source: Use the type constructor: ``set()``, ``set('foobar')``, ``set(['a', 'b', 'foo'])``
fa: از سازنده نوع استفاده کنید: ``set()``، ``set('foobar')``، ``set(['a', 'b', 'foo'])``
ru: Используйте конструктор типа: ``set()`` , ``set('foobar')`` , ``set(['a', 'b', 'foo'])``
uk: Використовуйте конструктор типу: ``set()``, ``set('foobar')``, ``set(['a', 'b', 'foo'])``

source: Instances of :class:`set` and :class:`frozenset` provide the following operations:
fa: نمونه های :class:`set` و :class:`frozenset` عملیات زیر را ارائه می دهند:
ru: Экземпляры :класс:`набор` и :class:`frozenset` обеспечить следующие операции:
uk: Екземпляри :class:`set` і :class:`frozenset` забезпечують такі операції:

source: Return the number of elements in set *s* (cardinality of *s*).
fa: تعداد عناصر موجود در مجموعه *s* را برگردانید (کاردینالیته *s*).
ru: Возвращает количество элементов в наборе *s* (мощность *s*).
uk: Повертає кількість елементів у наборі *s* (мощність *s*).

source: Test *x* for membership in *s*.
fa: *x* را برای عضویت در *s* تست کنید.
ru: Проверьте *x* на членство в *s*.
uk: Перевірте *x* на членство в *s*.

source: Test *x* for non-membership in *s*.
fa: *x* را برای عدم عضویت در *s* آزمایش کنید.
ru: Проверьте *x* на отсутствие членства в *s*.
uk: Перевірте *x* на неналежність до *s*.

source: Return ``True`` if the set has no elements in common with *other*. Sets are disjoint if and only if their intersection is the empty set.
fa: اگر مجموعه هیچ عنصر مشترکی با *other* ندارد، ``True`` را برگردانید. مجموعه‌ها متفرق هستند اگر و تنها در صورتی که تقاطع آنها مجموعه خالی باشد.
ru: Возвращаться ``Правда`` если в наборе нет общих элементов с *other*. Множества непересекающиеся тогда и только тогда, когда их пересечение является пустым множеством.
uk: Повертає ``True``, якщо набір не має спільних елементів з *other*. Множини непересічні тоді і тільки тоді, коли їх перетин є порожньою множиною.

source: Test whether every element in the set is in *other*.
fa: تست کنید که آیا هر عنصر در مجموعه در *other* است یا خیر.
ru: Проверьте, находится ли каждый элемент в наборе в *other*.
uk: Перевірте, чи кожен елемент у наборі знаходиться в *other*.

source: Test whether the set is a proper subset of *other*, that is, ``set <= other and set != other``.
fa: تست کنید که آیا مجموعه زیرمجموعه مناسب *other*، یعنی ``set <= other and set != other`` است یا خیر.
ru: Проверьте, является ли набор правильным подмножеством *other*, то есть ``set <= другое и set != другое`` .
uk: Перевірте, чи набір є правильною підмножиною *other*, тобто ``set <= other і set != other``.

source: Test whether every element in *other* is in the set.
fa: تست کنید که آیا هر عنصر در *other* در مجموعه است یا خیر.
ru: Проверьте, находится ли каждый элемент в *other* в наборе.
uk: Перевірте, чи всі елементи в *other* є в наборі.

source: Test whether the set is a proper superset of *other*, that is, ``set >= other and set != other``.
fa: تست کنید که آیا مجموعه فوق مجموعه مناسب *other*، یعنی ``set >= other and set != other`` است یا خیر.
ru: Проверьте, является ли этот набор надмножеством *other*, то есть ``установить >= другое и установить != другое`` .
uk: Перевірте, чи є набір правильною надмножиною *other*, тобто ``set >= other і set != other``.

source: Return a new set with elements from the set and all others.
fa: یک مجموعه جدید با عناصر مجموعه و سایر موارد را برگردانید.
ru: Вернуть новый набор с элементами из этого набора и всеми остальными.
uk: Повернути новий набір з елементами з набору та всі інші.

source: Return a new set with elements common to the set and all others.
fa: یک مجموعه جدید با عناصر مشترک در مجموعه و سایر موارد را برگردانید.
ru: Вернуть новый набор с элементами, общими для этого набора и всех остальных.
uk: Повертає новий набір із елементами, спільними для набору та всіх інших.

source: Return a new set with elements in the set that are not in the others.
fa: مجموعه جدیدی را با عناصر موجود در مجموعه که در سایرین وجود ندارد، برگردانید.
ru: Вернуть новый набор с элементами в наборе, которых нет в других.
uk: Повертає новий набір з елементами в наборі, яких немає в інших.

source: Return a new set with elements in either the set or *other* but not both.
fa: یک مجموعه جدید را با عناصر در مجموعه یا *other* برگردانید اما نه هر دو.
ru: Вернуть новый набор с элементами либо из набора, либо из *other*, но не из обоих.
uk: Повертає новий набір з елементами або в наборі, або в *іншому*, але не в обох.

source: Return a shallow copy of the set.
fa: یک کپی کم عمق از مجموعه را برگردانید.
ru: Верните неглубокую копию набора.
uk: Поверніть мілку копію набору.

source: Note, the non-operator versions of :meth:`union`, :meth:`intersection`, :meth:`difference`, :meth:`symmetric_difference`, :meth:`issubset`, and :meth:`issuperset` methods will accept any iterable as an argument. In contrast, their operator based counterparts require their arguments to be sets. This precludes error-prone constructions like ``set('abc') & 'cbs'`` in favor of the more readable ``set('abc').intersection('cbs')``.
fa: توجه داشته باشید، نسخه‌های غیر عامل متدهای :meth:`union`، :meth:`intersection`، :meth:`difference`، :meth:`symmetric_difference`، :meth:`issubset`، و :meth:`issuperset`، هر تکرارپذیری را به عنوان آرگومان می‌پذیرند. در مقابل، همتایان مبتنی بر اپراتور آنها نیاز دارند که آرگومان های آنها مجموعه باشد. این مانع از ساختارهای مستعد خطا مانند ``set('abc') & 'cbs'`` به نفع خواناتر ``set('abc').intersection('cbs')`` می شود.
ru: Обратите внимание, что версии без оператора :meth:`union` , :meth:`пересечение` , :meth:`разница` , :meth:`symmetric_difference` , :meth:`issubset` , и :meth:`суперсет` методы будут принимать любую итерацию в качестве аргумента. Напротив, их аналоги на основе операторов требуют, чтобы их аргументы были заданы. Это исключает подверженные ошибкам конструкции, такие как ``set('abc') & 'cbs'`` в пользу более читабельного ``set('abc').intersection('cbs')`` .
uk: Зауважте, версії без операторів :meth:`union`, :meth:`intersection`, :meth:`difference`, :meth:`symmetric_difference`, :meth:`issubset` і :meth:`issuperset` методи приймуть будь-яку ітерацію як аргумент. На відміну від цього, їхні аналоги на основі операторів вимагають, щоб їхні аргументи були наборами. Це виключає такі схильні до помилок конструкції, як ``set('abc') & 'cbs'`` на користь більш читабельного ``set('abc').intersection('cbs')``.

source: Both :class:`set` and :class:`frozenset` support set to set comparisons. Two sets are equal if and only if every element of each set is contained in the other (each is a subset of the other). A set is less than another set if and only if the first set is a proper subset of the second set (is a subset, but is not equal). A set is greater than another set if and only if the first set is a proper superset of the second set (is a superset, but is not equal).
fa: هر دو :class:`set` و :class:`frozenset` برای تنظیم مقایسه ها پشتیبانی می کنند. دو مجموعه برابر هستند اگر و فقط در صورتی که هر عنصر از هر مجموعه در دیگری موجود باشد (هر کدام زیرمجموعه دیگری است). یک مجموعه کمتر از مجموعه دیگر است اگر و تنها در صورتی که مجموعه اول زیرمجموعه مناسب مجموعه دوم باشد (یک زیر مجموعه است, اما برابر نیست). یک مجموعه بزرگتر از مجموعه دیگر است اگر و تنها در صورتی که مجموعه اول یک ابر مجموعه مناسب از مجموعه دوم باشد (یک ابر مجموعه است, اما برابر نیست).
ru: Оба :класс:`набор` и :class:`frozenset` набор поддержки для установки сравнений. Два множества равны тогда и только тогда, когда каждый элемент каждого множества содержится в другом (каждое является подмножеством другого). Набор меньше другого набора тогда и только тогда, когда первый набор является собственным подмножеством второго набора (является подмножеством, но не равен). Набор больше другого набора тогда и только тогда, когда первый набор является собственным надмножеством второго набора (является надмножеством, но не равен).
uk: І :class:`set`, і :class:`frozenset` підтримують набір для встановлення порівнянь. Дві множини рівні тоді і тільки тоді, коли кожен елемент кожної множини міститься в іншій (кожен є підмножиною іншого). Набір менший за інший набір тоді і тільки тоді, коли перший набір є належним підмножиною другого набору (є підмножиною, але не дорівнює). Набір більший за інший набір тоді і тільки тоді, коли перший набір є належним надмножиною другого набору (є надмножиною, але не є рівним).

source: Instances of :class:`set` are compared to instances of :class:`frozenset` based on their members. For example, ``set('abc') == frozenset('abc')`` returns ``True`` and so does ``set('abc') in set([frozenset('abc')])``.
fa: نمونه‌های :class:`set` با نمونه‌های :class:`frozenset` بر اساس اعضایشان مقایسه می‌شوند. برای مثال، ``set('abc') == frozenset('abc')`` ``True`` را برمی‌گرداند و ``set('abc') in set([frozenset('abc')])`` را نیز برمی‌گرداند.
ru: Экземпляры :класс:`набор` сравниваются с примерами :class:`frozenset` на основе их членов. Например, ``set('abc') == замороженный набор('abc')`` возвращает ``Правда`` и так же ``set('abc') в set([frozenset('abc')])`` .
uk: Примірники :class:`set` порівнюються з примірниками :class:`frozenset` на основі їхніх членів. Наприклад, ``set('abc') == frozenset('abc')`` повертає ``True``, а також ``set('abc')`` у ``set([frozenset('abc')])``.

source: The subset and equality comparisons do not generalize to a total ordering function. For example, any two nonempty disjoint sets are not equal and are not subsets of each other, so *all* of the following return ``False``: ``a<b``, ``a==b``, or ``a>b``.
fa: مقایسه زیر مجموعه و برابری به یک تابع ترتیب کل تعمیم نمی یابد. به عنوان مثال، هر دو مجموعه مجزای غیر خالی برابر نیستند و زیرمجموعه یکدیگر نیستند، بنابراین *all* از ``False`` برمی‌گرداند: ``a<b``، ``a==b`` یا ``a>b``.
ru: Сравнения подмножества и равенства не обобщаются до полной функции упорядочения. Например, любые два непустых непересекающихся множества не равны и не являются подмножествами друг друга, поэтому *все* из следующих значений возвращают ``Ложь`` : ``a<b`` , ``a==b`` , или ``a>b`` .
uk: Порівняння підмножини та рівності не узагальнюють до загальної функції впорядкування. Наприклад, будь-які дві непорожні непересічні множини не рівні і не є підмножинами одна одної, тому *всі* з наступного повертають ``False``: ``a <b``, ``a==b``, or ``a> b``.

source: Since sets only define partial ordering (subset relationships), the output of the :meth:`list.sort` method is undefined for lists of sets.
fa: از آنجایی که مجموعه ها فقط ترتیب جزئی را تعریف می کنند (روابط زیر مجموعه), خروجی روش :meth:`list.sort` برای لیست مجموعه ها تعریف نشده است.
ru: Поскольку множества определяют только частичный порядок (отношения подмножества), выходные данные :meth:`list.sort` метод не определен для списков наборов.
uk: Оскільки набори визначають лише часткове впорядкування (відносини підмножин), вихід методу :meth:`list.sort` не визначений для списків наборів.

source: Set elements, like dictionary keys, must be :term:`hashable`.
fa: عناصر مجموعه، مانند کلیدهای فرهنگ لغت، باید :term:`hashable` باشند.
ru: Элементы набора, такие как ключи словаря, должны быть :term:`hashable`.
uk: Елементи набору, як і ключі словника, мають бути :term:`hashable`.

source: Binary operations that mix :class:`set` instances with :class:`frozenset` return the type of the first operand. For example: ``frozenset('ab') | set('bc')`` returns an instance of :class:`frozenset`.
fa: عملیات باینری که نمونه های :class:`set` را با :class:`frozenset` مخلوط می کنند، نوع عملوند اول را برمی گرداند. به عنوان مثال: ``frozenset('ab') | set('bc')`` نمونه ای از :class:`frozenset` را برمی گرداند.
ru: Бинарные операции, которые смешивают :класс:`набор` случаи с :class:`frozenset` вернуть тип первого операнда. Например: ``frozenset('ab') | set('BC')`` возвращает экземпляр :class:`frozenset` .
uk: Бінарні операції, які поєднують екземпляри :class:`set` із :class:`frozenset`, повертають тип першого операнда. Наприклад: ``frozenset('ab') | set('bc')`` повертає екземпляр :class:`frozenset`.

source: The following table lists operations available for :class:`set` that do not apply to immutable instances of :class:`frozenset`:
fa: جدول زیر عملیات های موجود برای :class:`set` را فهرست می کند که برای نمونه های تغییرناپذیر :class:`frozenset` اعمال نمی شود:
ru: В следующей таблице перечислены операции, доступные для :класс:`набор` которые не применяются к неизменяемым экземплярам :class:`frozenset` :
uk: У наступній таблиці наведено операції, доступні для :class:`set`, які не застосовуються до незмінних екземплярів :class:`frozenset`:

source: Update the set, adding elements from all others.
fa: مجموعه را به روز کنید، عناصری را از بقیه اضافه کنید.
ru: Обновите набор, добавив элементы из всех остальных.
uk: Оновіть набір, додавши елементи з усіх інших.

source: Update the set, keeping only elements found in it and all others.
fa: مجموعه را به روز کنید و فقط عناصر موجود در آن و سایر موارد را حفظ کنید.
ru: Обновите набор, сохранив только найденные в нем элементы и все остальные.
uk: Оновіть набір, зберігаючи лише елементи, знайдені в ньому, і всі інші.
