Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: fa, ru, uk

source: the pair ``(x // y, x % y)``
fa: جفت ``(x // y, x % y)``
ru: пара ``(x // y, x % y)``
uk: пара ``(x // y, x % y)``

source: *x* to the power *y*
fa: *x* به قدرت *y*
ru: *x* в степени *y*
uk: *x* у степені *y*

source: Also referred to as integer division. For operands of type :class:`int`, the result has type :class:`int`. For operands of type :class:`float`, the result has type :class:`float`. In general, the result is a whole integer, though the result's type is not necessarily :class:`int`. The result is always rounded towards minus infinity: ``1//2`` is ``0``, ``(-1)//2`` is ``-1``, ``1//(-2)`` is ``-1``, and ``(-1)//(-2)`` is ``0``.
fa: به آن تقسیم عدد صحیح نیز گفته می شود. برای عملوندهای نوع :class:`int`، نتیجه دارای نوع :class:`int` است. برای عملوندهای نوع :class:`float`، نتیجه دارای نوع :class:`float` است. به طور کلی، نتیجه یک عدد صحیح کامل است، اگرچه نوع نتیجه لزوماً :class:`int` نیست. نتیجه همیشه به سمت منهای بی نهایت گرد می شود: ``1//2`` ``0``، ``(-1)//2`` ``-1``، ``1//(-2)`` ``-1`` و ``(-1)//(-2)`` ``0`` است.
ru: Также называется целочисленным делением. Для операндов типа :класс:`int` , результат имеет тип :класс:`int` . Для операндов типа :class:`плавать` , результат имеет тип :class:`плавать` . Как правило, результат представляет собой целое число, хотя тип результата не обязательно :класс:`int` . Результат всегда округляется в сторону минус бесконечности: ``1//2`` является ``0`` , ``(-1)//2`` является ``-1`` , ``1//(-2)`` является ``-1`` , и ``(-1)//(-2)`` является ``0`` .

source: Not for complex numbers. Instead convert to floats using :func:`abs` if appropriate.
fa: نه برای اعداد مختلط در عوض در صورت لزوم با استفاده از :func:`abs` به شناور تبدیل کنید.
ru: Не для комплексных чисел. Вместо этого преобразуйте в числа с плавающей запятой, используя :func:`abs` если это уместно.
uk: Не для комплексних чисел. Натомість конвертуйте у числа з плаваючою точкою за допомогою :func:`abs`, якщо це доречно.

source: Conversion from :class:`float` to :class:`int` truncates, discarding the fractional part. See functions :func:`math.floor` and :func:`math.ceil` for alternative conversions.
fa: تبدیل از :class:`float` به :class:`int` کوتاه می شود و قسمت کسری را دور می اندازد. برای تبدیل‌های جایگزین به توابع :func:`math.floor` و :func:`math.ceil` مراجعه کنید.
ru: Преобразование из :class:`плавать` к :класс:`int` усекается, отбрасывая дробную часть. См. функции :func:`math.floor` и :func:`math.ceil` для альтернативных преобразований.

source: float also accepts the strings "nan" and "inf" with an optional prefix "+" or "-" for Not a Number (NaN) and positive or negative infinity.
fa: float همچنین رشته‌های «nan» و «inf» را با پیشوند اختیاری «+» یا «-» برای No Number (NaN) و بی‌نهایت مثبت یا منفی می‌پذیرد.
ru: float также принимает строки «nan» и «inf» с необязательным префиксом «+» или «-» для обозначения «не число» (NaN) и положительную или отрицательную бесконечность.
uk: float також приймає рядки "nan" і "inf" з необов'язковим префіксом "+" або "-" для Not a Number (NaN) і додатною або від'ємною нескінченністю.

source: Python defines ``pow(0, 0)`` and ``0 ** 0`` to be ``1``, as is common for programming languages.
fa: پایتون ``pow(0, 0)`` و ``0 ** 0`` را ``1`` تعریف می کند، همانطور که برای زبان های برنامه نویسی رایج است.
ru: Python определяет ``pow(0, 0)`` и ``0 ** 0`` быть ``1`` , как это обычно бывает с языками программирования.
uk: Python визначає ``pow(0, 0)`` і ``0 ** 0`` як ``1``, як це прийнято для мов програмування.

source: The numeric literals accepted include the digits ``0`` to ``9`` or any Unicode equivalent (code points with the ``Nd`` property).
fa: حروف عددی پذیرفته شده شامل ارقام ``0`` تا ``9`` یا هر معادل یونیکد (نقاط کد دارای ویژگی ``Nd``) است.
ru: Принимаемые числовые литералы включают цифры ``0`` к ``9`` или любой эквивалент Unicode (кодовые точки с ``Нд`` свойство).
uk: Прийнятні числові літерали включають цифри від ``0`` до ``9`` або будь-який еквівалент Unicode (кодові точки з властивістю ``Nd``).

source: See `the Unicode Standard <https://unicode.org/Public/UNIDATA/extracted/DerivedNumericType.txt>`_ for a complete list of code points with the ``Nd`` property.
fa: برای لیست کامل نقاط کد با ویژگی ``Nd`` به `the Unicode Standard <https://unicode.org/Public/UNIDATA/extracted/DerivedNumericType.txt>`_ مراجعه کنید.

source: All :class:`numbers.Real` types (:class:`int` and :class:`float`) also include the following operations:
fa: تمام انواع :class:`numbers.Real` (:class:`int` و :class:`float`) همچنین شامل عملیات زیر می باشند:
ru: Все :class:`numbers.Real` типы ( :класс:`int` и :class:`плавать` ) также включают в себя следующие операции:
uk: Усі типи :class:`numbers.Real` (:class:`int` і :class:`float`) також містять такі операції:

source: *x* truncated to :class:`~numbers.Integral`
fa: *x* به :class:`~numbers.Integral` کوتاه شد
ru: *x* сокращено до :class:`~numbers.Integral`
uk: *x* скорочено до :class:`~numbers.Integral`

source: *x* rounded to *n* digits, rounding half to even. If *n* is omitted, it defaults to 0.
fa: *x* به رقم *n* گرد شد و از نصف به زوج گرد شد. اگر *n* حذف شود، به طور پیش فرض 0 است.
ru: *x* округляется до *n* цифр, округляя половину до четного. Если *n* опущено, по умолчанию оно равно 0.
uk: *x* округлено до *n* цифр, округлення половини до парного числа. Якщо *n* опущено, за умовчанням дорівнює 0.

source: the greatest :class:`~numbers.Integral` <= *x*
fa: بزرگترین :class:`~numbers.Integral` <= *x*
ru: величайший :class:`~numbers.Integral` <= *х*
uk: найбільший :class:`~numbers.Integral` <= *x*

source: the least :class:`~numbers.Integral` >= *x*
fa: حداقل :class:`~numbers.Integral` >= *x*
ru: наименьший :class:`~numbers.Integral` >= *х*
uk: найменший :class:`~numbers.Integral` >= *x*

source: For additional numeric operations see the :mod:`math` and :mod:`cmath` modules.
fa: برای عملیات عددی بیشتر به ماژول های :mod:`math` و :mod:`cmath` مراجعه کنید.
ru: Дополнительные числовые операции см. :mod:`математика` и :mod:`cmath` модули.
uk: Для отримання додаткових числових операцій перегляньте модулі :mod:`math` і :mod:`cmath`.

source: Bitwise Operations on Integer Types
fa: عملیات بیتی در انواع عدد صحیح
ru: Побитовые операции с целочисленными типами
uk: Побітові операції над цілими типами

source: Bitwise operations only make sense for integers. The result of bitwise operations is calculated as though carried out in two's complement with an infinite number of sign bits.
fa: عملیات بیتی فقط برای اعداد صحیح معنا دارد. نتیجه عملیات بیتی به گونه ای محاسبه می شود که گویی در مکمل دو با تعداد بی نهایت بیت علامت انجام می شود.
ru: Побитовые операции имеют смысл только для целых чисел. Результат побитовых операций вычисляется так, как если бы они выполнялись в дополнении до двух с бесконечным числом знаковых битов.
uk: Побітові операції мають сенс лише для цілих чисел. Результат порозрядних операцій обчислюється так, ніби виконується в доповненні до двох із нескінченною кількістю знакових бітів.

source: The priorities of the binary bitwise operations are all lower than the numeric operations and higher than the comparisons; the unary operation ``~`` has the same priority as the other unary numeric operations (``+`` and ``-``).
fa: اولویت‌های عملیات بیتی باینری همگی کمتر از عملیات عددی و بالاتر از مقایسه‌ها هستند. عملیات یکنواخت ``~`` دارای اولویت مشابه سایر عملیات عددی یکنواخت (``+`` و ``-``) است.
ru: Приоритеты двоичных поразрядных операций ниже, чем у числовых операций, и выше, чем у сравнений; унарная операция ``~`` имеет тот же приоритет, что и другие унарные числовые операции ( ``+`` и ``-`` ).
uk: Пріоритети двійкових порозрядних операцій нижчі, ніж числових операцій, і вищі, ніж порівняння; унарна операція ``~`` має той самий пріоритет, що й інші унарні числові операції (``+`` і ``-``).

source: This table lists the bitwise operations sorted in ascending priority:
fa: این جدول عملیات بیتی مرتب شده در اولویت صعودی را فهرست می کند:
ru: В этой таблице перечислены побитовые операции, отсортированные по возрастанию приоритета:
uk: У цій таблиці наведено порозрядні операції, відсортовані за зростанням пріоритету:

source: bitwise :dfn:`or` of *x* and *y*
fa: به صورت بیتی :dfn:`or` از *x* و *y*
ru: побитовое :dfn:`или` из *x* и *y*
uk: порозрядно :dfn:`or` *x* і *y*

source: bitwise :dfn:`exclusive or` of *x* and *y*
fa: بیتی :dfn:`انحصاری یا` از *x* و *y*
ru: побитовое :dfn:`исключающее или` из *x* и *y*
uk: порозрядно :dfn:`exclusive or` *x* та *y*

source: bitwise :dfn:`and` of *x* and *y*
fa: به صورت بیتی :dfn:`and` از *x* و *y*
ru: побитовое :dfn:`and` из *x* и *y*
uk: порозрядно :dfn:`and` *x* і *y*

source: *x* shifted left by *n* bits
fa: *x* توسط بیت *n* به چپ منتقل شد
ru: *x* сдвинуто влево на *n* бит
uk: *x* зміщено вліво на *n* бітів

source: *x* shifted right by *n* bits
fa: *x* با بیت *n* به راست جابجا شد
ru: *x* сдвинуто вправо на *n* бит
uk: *x* зміщено праворуч на *n* бітів

source: the bits of *x* inverted
fa: بیت های *x* معکوس شدند
ru: биты *x* инвертированы
uk: біти *x* інвертовані

source: Negative shift counts are illegal and cause a :exc:`ValueError` to be raised.
fa: تعداد شیفت های منفی غیرقانونی است و باعث افزایش :exc:`ValueError` می شود.
ru: Отрицательное количество смен является незаконным и приводит к :exc:`ValueError` быть поднятым.
uk: Підрахунок від’ємного зсуву є незаконним і викликає :exc:`ValueError`.

source: A left shift by *n* bits is equivalent to multiplication by ``pow(2, n)``.
fa: یک شیفت به چپ توسط *n* بیت معادل ضرب در ``pow(2, n)`` است.
ru: Сдвиг влево на *n* бит эквивалентен умножению на ``pow(2, n)`` .
uk: Зсув вліво на *n* бітів еквівалентний множенню на ``pow(2, n)``.

source: A right shift by *n* bits is equivalent to floor division by ``pow(2, n)``.
fa: یک شیفت به راست توسط *n* بیت معادل تقسیم طبقه توسط ``pow(2, n)`` است.
ru: Сдвиг вправо на *n* бит эквивалентен делению нижнего уровня на ``pow(2, n)`` .
uk: Зсув праворуч на *n* бітів еквівалентний діленню підлоги за допомогою ``pow(2, n)``.

source: Performing these calculations with at least one extra sign extension bit in a finite two's complement representation (a working bit-width of ``1 + max(x.bit_length(), y.bit_length())`` or more) is sufficient to get the same result as if there were an infinite number of sign bits.
fa: انجام این محاسبات با حداقل یک بیت اضافه علامت اضافی در یک نمایش مکمل دو محدود (عرض بیت کاری ``1 + max(x.bit_length(), y.bit_length())`` یا بیشتر) برای بدست آوردن همان نتیجه کافی است که گویی تعداد بی نهایت بیت علامت وجود دارد.
ru: Выполнение этих вычислений по крайней мере с одним дополнительным битом расширения знака в конечном представлении с дополнением до двух (рабочая разрядность ``1 + max(x.bit_length(), y.bit_length())`` или более) достаточно для получения того же результата, как если бы число знаковых битов было бесконечным.
uk: Виконання цих обчислень із принаймні одним додатковим бітом розширення знака в поданні скінченних двох доповнень (робоча бітова ширина ``1 + max(x.bit_length(), y.bit_length())`` або більше) є достатньою для отримати той самий результат, ніби існує нескінченна кількість знакових бітів.

source: Additional Methods on Integer Types
fa: روش های اضافی در انواع عدد صحیح
ru: Дополнительные методы для целочисленных типов
uk: Додаткові методи для цілих типів

source: The int type implements the :class:`numbers.Integral` :term:`abstract base class`. In addition, it provides a few more methods:
fa: نوع int :class:`numbers.Integral` :term:`abstract base class` را پیاده سازی می کند. علاوه بر این، چند روش دیگر را ارائه می دهد:
ru: Тип int реализует :class:`numbers.Integral` :term:`абстрактный базовый класс`. Кроме того, он предоставляет еще несколько методов:
uk: Тип int реалізує :class:`numbers.Integral` :term:`abstract base class`. Крім того, він надає ще кілька методів:

source: Return the number of bits necessary to represent an integer in binary, excluding the sign and leading zeros::
fa: تعداد بیت های لازم برای نمایش یک عدد صحیح به صورت باینری را به استثنای علامت و صفرهای ابتدایی برگردانید::
ru: Возвращает количество бит, необходимое для представления целого числа в двоичном формате, исключая знак и ведущие нули::
uk: Повертає кількість бітів, необхідних для представлення цілого числа в двійковій системі, за винятком знака та нулів на початку::

source: More precisely, if ``x`` is nonzero, then ``x.bit_length()`` is the unique positive integer ``k`` such that ``2**(k-1) <= abs(x) < 2**k``. Equivalently, when ``abs(x)`` is small enough to have a correctly rounded logarithm, then ``k = 1 + int(log(abs(x), 2))``. If ``x`` is zero, then ``x.bit_length()`` returns ``0``.
fa: به طور دقیق تر، اگر ``x`` غیر صفر باشد، ``x.bit_length()`` عدد صحیح مثبت منحصر به فرد ``k`` است به طوری که ``2**(k-1) <= abs(x) < 2**k``. به طور معادل، زمانی که ``abs(x)`` به اندازه کافی کوچک است که لگاریتمی به درستی گرد داشته باشد، ``k = 1 + int(log(abs(x), 2))``. اگر ``x`` صفر باشد، ``x.bit_length()`` ``0`` را برمی گرداند.
ru: Точнее, если ``х`` не равно нулю, то ``x.bit_length()`` уникальное положительное целое число ``к`` такой, что ``2**(k-1) <= abs(x) < 2**k`` . Эквивалентно, когда ``абс(х)`` достаточно мал, чтобы иметь правильно округленный логарифм, тогда ``k = 1 + int(log(abs(x), 2))`` . Если ``х`` равно нулю, то ``x.bit_length()`` возвращает ``0`` .
uk: Точніше, якщо ``x`` відмінне від нуля, то ``x.bit_length()`` є унікальним натуральним числом ``k`` таким, що ``2**(k-1) <= abs(x) < 2**k``. Аналогічно, коли ``abs(x)`` достатньо малий, щоб мати правильно округлений логарифм, тоді ``k = 1 + int(log(abs(x), 2))``. Якщо ``x`` дорівнює нулю, то ``x.bit_length()`` повертає ``0``.

source: Equivalent to::
fa: معادل::
ru: Эквивалентно::
uk: Дорівнює::

source: Return the number of ones in the binary representation of the absolute value of the integer. This is also known as the population count. Example::
fa: تعداد یک ها را در نمایش دودویی قدر مطلق عدد صحیح برگردانید. این به عنوان شمارش جمعیت نیز شناخته می شود. مثال::
ru: Возвращает количество единиц в двоичном представлении абсолютного значения целого числа. Это также известно как подсчет населения. Пример::
uk: Повертає кількість одиниць у двійковому представленні абсолютного значення цілого числа. Це також відомо як підрахунок населення. Приклад::

source: Return an array of bytes representing an integer.
fa: آرایه ای از بایت ها را که یک عدد صحیح را نشان می دهد برگردانید.
ru: Возвращает массив байтов, представляющий целое число.
uk: Повертає масив байтів, що представляє ціле число.

source: The integer is represented using *length* bytes, and defaults to 1. An :exc:`OverflowError` is raised if the integer is not representable with the given number of bytes.
fa: عدد صحیح با استفاده از *length* بایت نمایش داده می شود و به طور پیش فرض 1 است. اگر عدد صحیح با تعداد بایت های داده شده قابل نمایش نباشد، :exc:`OverflowError` افزایش می یابد.
ru: Целое число представляется в виде *длины* байтов и по умолчанию равно 1. :exc:`OverflowError` возникает, если целое число не представляется заданным количеством байтов.

source: The *byteorder* argument determines the byte order used to represent the integer, and defaults to ``"big"``. If *byteorder* is ``"big"``, the most significant byte is at the beginning of the byte array. If *byteorder* is ``"little"``, the most significant byte is at the end of the byte array.
fa: آرگومان *byteorder* ترتیب بایت های مورد استفاده برای نمایش عدد صحیح را تعیین می کند و به طور پیش فرض برای ``"big"`` قرار می گیرد. اگر *byteorder* ``"big"`` باشد، مهم ترین بایت در ابتدای آرایه بایت است. اگر *byteorder* ``"little"`` باشد، مهم ترین بایت در انتهای آرایه بایت است.
ru: Аргумент *byteorder* определяет порядок байтов, используемый для представления целого числа, и по умолчанию имеет значение ``"большой"`` . Если *byteorder* ``"большой"`` , наиболее значимый байт находится в начале массива байтов. Если *byteorder* ``"маленький"`` , наиболее значимый байт находится в конце массива байтов.

source: The *signed* argument determines whether two's complement is used to represent the integer. If *signed* is ``False`` and a negative integer is given, an :exc:`OverflowError` is raised. The default value for *signed* is ``False``.
fa: آرگومان *signed* تعیین می کند که آیا مکمل دو برای نمایش عدد صحیح استفاده می شود یا خیر. اگر *signed* ``False`` باشد و یک عدد صحیح منفی داده شود، یک :exc:`OverflowError` بلند می شود. مقدار پیش فرض *signed* ``False`` است.
ru: Аргумент *signed* определяет, используется ли дополнение до двух для представления целого числа. Если *подписано* ``Ложь`` и задано отрицательное целое число, :exc:`OverflowError` поднят. Значение по умолчанию для *подписанного*: ``Ложь`` .
uk: Аргумент *signed* визначає, чи використовується доповнення до двох для представлення цілого числа. Якщо *signed* має значення ``False`` і вказано від’ємне ціле число, виникає :exc:`OverflowError`. Значенням за замовчуванням для *signed* є ``False``.

source: The default values can be used to conveniently turn an integer into a single byte object::
fa: مقادیر پیش‌فرض را می‌توان برای تبدیل راحت یک عدد صحیح به یک شی بایت تک استفاده کرد:
ru: Значения по умолчанию можно использовать для удобного преобразования целого числа в однобайтовый объект:

source: However, when using the default arguments, don't try to convert a value greater than 255 or you'll get an :exc:`OverflowError`.
fa: با این حال، هنگام استفاده از آرگومان های پیش فرض، سعی نکنید مقداری بزرگتر از 255 را تبدیل کنید وگرنه یک :exc:`OverflowError` دریافت خواهید کرد.
ru: Однако при использовании аргументов по умолчанию не пытайтесь преобразовать значение больше 255, иначе вы получите ошибку. :exc:`OverflowError` .

source: Added default argument values for ``length`` and ``byteorder``.
fa: مقادیر آرگومان پیش فرض برای ``length`` و ``byteorder`` اضافه شد.
ru: Добавлены значения аргументов по умолчанию для ``длина`` и ``заявка на обмен'' .

source: Return the integer represented by the given array of bytes.
fa: عدد صحیح نشان داده شده توسط آرایه بایت داده شده را برگردانید.
ru: Возвращает целое число, представленное заданным массивом байтов.
uk: Повертає ціле число, представлене заданим масивом байтів.

source: The argument *bytes* must either be a :term:`bytes-like object` or an iterable producing bytes.
fa: آرگومان *bytes* یا باید یک :term:`bytes-like object` باشد یا یک بایت تولید کننده تکرارپذیر.
ru: Аргумент *bytes* должен быть либо :term:`байтоподобным объектом`, либо итерируемым объектом, производящим байты.
uk: Аргумент *bytes* має бути або :term:`bytes-like object`, або ітерованим, що створює байти.

source: The *byteorder* argument determines the byte order used to represent the integer, and defaults to ``"big"``. If *byteorder* is ``"big"``, the most significant byte is at the beginning of the byte array. If *byteorder* is ``"little"``, the most significant byte is at the end of the byte array. To request the native byte order of the host system, use :data:`sys.byteorder` as the byte order value.
fa: آرگومان *byteorder* ترتیب بایت های مورد استفاده برای نمایش عدد صحیح را تعیین می کند و به طور پیش فرض برای ``"big"`` قرار می گیرد. اگر *byteorder* ``"big"`` باشد، مهم ترین بایت در ابتدای آرایه بایت است. اگر *byteorder* ``"little"`` باشد، مهم ترین بایت در انتهای آرایه بایت است. برای درخواست ترتیب بایت بومی سیستم میزبان، از :data:`sys.byteorder` به عنوان مقدار سفارش بایت استفاده کنید.
ru: Аргумент *byteorder* определяет порядок байтов, используемый для представления целого числа, и по умолчанию имеет значение ``"большой"`` . Если *byteorder* ``"большой"`` , наиболее значимый байт находится в начале массива байтов. Если *byteorder* ``"маленький"`` , наиболее значимый байт находится в конце массива байтов. Чтобы запросить собственный порядок байтов хост-системы, используйте :data:`sys.byteorder` как значение порядка байтов.

source: The *signed* argument indicates whether two's complement is used to represent the integer.
fa: آرگومان *signed* نشان می دهد که آیا از مکمل two برای نمایش عدد صحیح استفاده می شود یا خیر.
ru: Аргумент *signed* указывает, используется ли дополнение до двух для представления целого числа.
uk: Аргумент *signed* вказує, чи використовується доповнення до двох для представлення цілого числа.

source: Added default argument value for ``byteorder``.
fa: مقدار آرگومان پیش فرض برای ``byteorder`` اضافه شد.
ru: Добавлено значение аргумента по умолчанию для ``заявка на обмен'' .

source: Return a pair of integers whose ratio is equal to the original integer and has a positive denominator. The integer ratio of integers (whole numbers) is always the integer as the numerator and ``1`` as the denominator.
fa: یک جفت اعداد صحیح که نسبت آنها برابر با عدد صحیح اصلی و دارای مخرج مثبت است را برگردانید. نسبت صحیح اعداد صحیح (اعداد کامل) همیشه عدد صحیح به عنوان صورت و ``1`` به عنوان مخرج است.

source: Returns ``True``. Exists for duck type compatibility with :meth:`float.is_integer`.
fa: ``True`` را برمی گرداند. برای سازگاری نوع اردک با :meth:`float.is_integer` وجود دارد.

source: Additional Methods on Float
fa: روش های اضافی در شناور
ru: Дополнительные методы с плавающей запятой
uk: Додаткові методи для Float

source: The float type implements the :class:`numbers.Real` :term:`abstract base class`. float also has the following additional methods.
fa: نوع float :class:`numbers.Real` :term:`abstract base class` را پیاده سازی می کند. float روش های اضافی زیر را نیز دارد.
ru: Тип float реализует :class:`numbers.Real` :term:`абстрактный базовый класс`. float также имеет следующие дополнительные методы.
uk: Тип float реалізує :class:`numbers.Real` :term:`abstract base class`. float також має такі додаткові методи.

source: Return a pair of integers whose ratio is exactly equal to the original float. The ratio is in lowest terms and has a positive denominator. Raises :exc:`OverflowError` on infinities and a :exc:`ValueError` on NaNs.
fa: یک جفت اعداد صحیح که نسبت آنها دقیقاً برابر با شناور اصلی است را برگردانید. این نسبت در کمترین مقدار و دارای مخرج مثبت است. :exc:`OverflowError` را روی بی نهایت ها و :exc:`ValueError` را روی NaN ها افزایش می دهد.

source: Return ``True`` if the float instance is finite with integral value, and ``False`` otherwise::
fa: اگر نمونه شناور با مقدار انتگرال محدود است، ``True`` را برگردانید و در غیر این صورت ``False``::
ru: Возвращаться ``Правда`` если экземпляр числа с плавающей запятой конечен с целочисленным значением и ``Ложь`` в противном случае::
uk: Повертає ``True``, якщо екземпляр float є кінцевим із цілим значенням, і ``False`` інакше::
