Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: fa, ru, uk

source: Built-in Types
fa: انواع داخلی
ru: Встроенные типы
uk: Вбудовані типи

source: The following sections describe the standard types that are built into the interpreter.
fa: بخش های زیر انواع استانداردی را که در مفسر تعبیه شده اند توضیح می دهد.
ru: В следующих разделах описаны стандартные типы, встроенные в интерпретатор.
uk: У наступних розділах описуються стандартні типи, вбудовані в інтерпретатор.

source: The principal built-in types are numerics, sequences, mappings, classes, instances and exceptions.
fa: انواع اصلی داخلی عبارتند از اعداد، دنباله ها، نگاشت ها، کلاس ها، نمونه ها و استثناها.
ru: Основными встроенными типами являются числа, последовательности, сопоставления, классы, экземпляры и исключения.
uk: Основними вбудованими типами є числа, послідовності, відображення, класи, екземпляри та винятки.

source: Some collection classes are mutable. The methods that add, subtract, or rearrange their members in place, and don't return a specific item, never return the collection instance itself but ``None``.
fa: برخی از کلاس های مجموعه قابل تغییر هستند. متدهایی که اعضای خود را در جای خود اضافه، تفریق یا بازآرایی می کنند، و آیتم خاصی را بر نمی گرداند، هرگز خود نمونه مجموعه را باز نمی گرداند، جز ``None``.
ru: Некоторые классы коллекций изменяемы. Методы, которые добавляют, вычитают или переставляют свои члены на месте и не возвращают конкретный элемент, никогда не возвращают сам экземпляр коллекции, а ``None``.
uk: Деякі класи колекцій є змінними. Методи, які додають, віднімають або переставляють свої члени на місці, і не повертають конкретний елемент, ніколи не повертають сам екземпляр колекції, але ``Жодного``.

source: Some operations are supported by several object types; in particular, practically all objects can be compared for equality, tested for truth value, and converted to a string (with the :func:`repr` function or the slightly different :func:`str` function). The latter function is implicitly used when an object is written by the :func:`print` function.
fa: برخی از عملیات توسط چندین نوع شی پشتیبانی می شوند. به طور خاص، عملاً همه اشیا را می توان برای برابری مقایسه کرد، برای مقدار صدق آزمایش کرد و به یک رشته (با تابع :func:`repr` یا تابع :func:`str` کمی متفاوت) تبدیل کرد. تابع دوم به طور ضمنی زمانی استفاده می شود که یک شی توسط تابع :func:`print` نوشته شود.
ru: Некоторые операции поддерживаются несколькими типами объектов; в частности, практически все объекты можно сравнить на равенство, проверить на истинность и преобразовать в строку (с помощью :func:`repr` функция или немного другая :func:`str` функция). Последняя функция неявно используется, когда объект записывается с помощью :func:`печать` функция.
uk: Деякі операції підтримуються кількома типами об'єктів; зокрема, практично всі об’єкти можна порівняти на рівність, перевірити на значення істинності та перетворити на рядок (за допомогою функції :func:`repr` або трохи іншої функції :func:`str`). Остання функція неявно використовується, коли об’єкт записується функцією :func:`print`.

source: Truth Value Testing
fa: تست ارزش حقیقت
ru: Проверка логического значения
uk: Перевірка правдивості

source: Any object can be tested for truth value, for use in an :keyword:`if` or :keyword:`while` condition or as operand of the Boolean operations below.
fa: هر شی را می توان برای مقدار صدق، برای استفاده در شرایط :keyword:`if` یا :keyword:`while` یا به عنوان عملوند عملیات بولی زیر آزمایش کرد.
ru: Любой объект может быть проверен на истинность для использования в :keyword:`если` или :keyword:`пока` условие или в качестве операнда приведенных ниже логических операций.
uk: Будь-який об’єкт можна перевірити на значення істинності, для використання в умовах :keyword:`if` або :keyword:`while` або як операнд логічних операцій, наведених нижче.

source: By default, an object is considered true unless its class defines either a :meth:`~object.__bool__` method that returns ``False`` or a :meth:`~object.__len__` method that returns zero, when called with the object. [1]_ Here are most of the built-in objects considered false:
fa: به طور پیش‌فرض، یک شیء درست در نظر گرفته می‌شود، مگر اینکه کلاس آن متد :meth:`~object.__bool__` را تعریف کند که ``False`` را برمی‌گرداند یا متد :meth:`~object.__len__` را که صفر را برمی‌گرداند، در صورت فراخوانی با شی. [1]_ در اینجا بیشتر اشیاء داخلی نادرست در نظر گرفته می شوند:
ru: По умолчанию объект считается истинным, если его класс не определяет :meth:`~object.__bool__` метод, который возвращает ``Ложь`` или :meth:`~object.__len__` метод, который возвращает ноль при вызове с объектом. [1]_ Вот большинство встроенных объектов, которые считаются ложными:

source: constants defined to be false: ``None`` and ``False``
fa: ثابت های نادرست تعریف شده: ``None`` و ``False``
ru: константы определены как ложные: ``Нет`` и ``Ложь``

source: zero of any numeric type: ``0``, ``0.0``, ``0j``, ``Decimal(0)``, ``Fraction(0, 1)``
fa: صفر از هر نوع عددی: ``0``، ``0.0``، ``0j``، ``Decimal(0)``، ``Fraction(0, 1)``
ru: ноль любого числового типа: ``0`` , ``0.0`` , ``0j`` , ``Десятичный(0)`` , ``Дробь(0, 1)``
uk: нуль будь-якого числового типу: ``0``, ``0.0``, ``0j``, ``Decimal(0)``, ``Fraction(0, 1)``

source: empty sequences and collections: ``''``, ``()``, ``[]``, ``{}``, ``set()``, ``range(0)``
fa: دنباله ها و مجموعه های خالی: ``''``، ``()``، ``[]``، ``{}``، ``set()``، ``range(0)``
ru: пустые последовательности и коллекции: ``''`` , ``()`` , ``[]`` , ``{}`` , ``set()`` , ``диапазон(0)``
uk: порожні послідовності та колекції: ``''``, ``()``, ``[]``, ``{}``, ``set()``, ``range(0)``

source: Operations and built-in functions that have a Boolean result always return ``0`` or ``False`` for false and ``1`` or ``True`` for true, unless otherwise stated. (Important exception: the Boolean operations ``or`` and ``and`` always return one of their operands.)
fa: عملیات و توابع داخلی که دارای نتیجه Boolean هستند همیشه ``0`` یا ``False`` را برای false و ``1`` یا ``True`` را برای true برمی‌گردانند، مگر اینکه خلاف آن ذکر شده باشد. (استثنای مهم: عملیات بولی ``or`` و ``and`` همیشه یکی از عملوندهای خود را برمی گرداند.)
ru: Операции и встроенные функции, имеющие логический результат, всегда возвращают значение. ``0`` или ``Ложь`` за ложь и ``1`` или ``Правда`` верно, если не указано иное. (Важное исключение: логические операции ``или`` и ``и`` всегда возвращают один из своих операндов.)
uk: Операції та вбудовані функції, які мають логічний результат, завжди повертають ``0`` або ``False`` для false і ``1`` або ``True`` для true, якщо не вказано інше. (Важливий виняток: логічні операції "або" та "і" завжди повертають один із своїх операндів.)

source: Boolean Operations --- :keyword:`!and`, :keyword:`!or`, :keyword:`!not`
fa: عملیات بولی --- :keyword:`!and`, :keyword:`!or`, :keyword:`!not`
ru: Булевы операции --- :keyword:`!и` , :keyword:`!or` , :keyword:`!нет`
uk: Логічні операції --- :keyword:`!and`, :keyword:`!or`, :keyword:`!not`

source: These are the Boolean operations, ordered by ascending priority:
fa: اینها عملیات بولی هستند که بر اساس اولویت صعودی مرتب شده اند:
ru: Это логические операции, упорядоченные по возрастанию приоритета:
uk: Це логічні операції, упорядковані за зростанням пріоритету:

source: Operation
fa: عملیات
ru: Операция
uk: Операція

source: Result
fa: نتیجه
ru: Результат
uk: Результат

source: Notes
fa: یادداشت ها
ru: Примечания
uk: Примітки

source: if *x* is true, then *x*, else *y*
fa: اگر *x* درست باشد، *x*، در غیر این صورت *y*
ru: если *x* истинно, то *x*, иначе *y*

source: if *x* is false, then *x*, else *y*
fa: اگر *x* نادرست است، *x*، در غیر این صورت *y*
ru: если *x* ложно, то *x*, иначе *y*
uk: якщо *x* false, тоді *x*, інакше *y*

source: if *x* is false, then ``True``, else ``False``
fa: اگر *x* نادرست است، ``True``، در غیر این صورت ``False``
ru: если *x* ложно, то ``Правда`` , еще ``Ложь``
uk: якщо *x* false, тоді ``True``, інакше ``False``

source: Notes:
fa: یادداشت ها:
ru: Примечания:
uk: Примітки:

source: This is a short-circuit operator, so it only evaluates the second argument if the first one is false.
fa: این یک اپراتور اتصال کوتاه است، بنابراین تنها اگر آرگومان اول نادرست باشد، آرگومان دوم را ارزیابی می کند.
ru: Это сокращенный оператор, поэтому он оценивает второй аргумент только в том случае, если первый имеет значение false.
uk: Це оператор короткого замикання, тому він обчислює лише другий аргумент, якщо перший невірний.

source: This is a short-circuit operator, so it only evaluates the second argument if the first one is true.
fa: این یک عملگر اتصال کوتاه است، بنابراین تنها اگر آرگومان اول درست باشد، آرگومان دوم را ارزیابی می کند.
ru: Это сокращенный оператор, поэтому он оценивает второй аргумент только в том случае, если первый аргумент истинен.
uk: Це оператор короткого замикання, тому він обчислює лише другий аргумент, якщо перший істинний.

source: ``not`` has a lower priority than non-Boolean operators, so ``not a == b`` is interpreted as ``not (a == b)``, and ``a == not b`` is a syntax error.
fa: ``not`` اولویت کمتری نسبت به عملگرهای غیر بولی دارد، بنابراین ``not a == b`` به عنوان ``not (a == b)`` تفسیر می شود و ``a == not b`` یک خطای نحوی است.
ru: ``не`` имеет более низкий приоритет, чем нелогические операторы, поэтому ``не а == б`` интерпретируется как ``не (a == b)`` , и ``а == не б`` является синтаксической ошибкой.
uk: ``not`` має нижчий пріоритет, ніж не-булеві оператори, тому ``not a == b`` інтерпретується як ``not (a == b)``, а ``a == not b`` є синтаксичною помилкою.

source: Comparisons
fa: مقایسه ها
ru: Сравнения
uk: Порівняння

source: There are eight comparison operations in Python. They all have the same priority (which is higher than that of the Boolean operations). Comparisons can be chained arbitrarily; for example, ``x < y <= z`` is equivalent to ``x < y and y <= z``, except that *y* is evaluated only once (but in both cases *z* is not evaluated at all when ``x < y`` is found to be false).
fa: هشت عمل مقایسه در پایتون وجود دارد. همه آنها اولویت یکسانی دارند (که بالاتر از اولویت عملیات بولی است). مقایسه ها را می توان به صورت خودسرانه زنجیره ای کرد. به عنوان مثال، ``x < y <= z`` معادل ``x < y and y <= z`` است، با این تفاوت که *y* فقط یک بار ارزیابی می شود (اما در هر دو مورد, زمانی که ``x < y`` نادرست است, *z* اصلا ارزیابی نمی شود).
ru: В Python имеется восемь операций сравнения. Все они имеют одинаковый приоритет (который выше, чем у логических операций). Сравнения могут быть связаны произвольно; например, ``x < y <= z`` эквивалентно ``x < y и y <= z`` , за исключением того, что *y* вычисляется только один раз (но в обоих случаях *z* вообще не вычисляется, когда ``х < у`` оказывается ложным).
uk: У Python є вісім операцій порівняння. Усі вони мають однаковий пріоритет (вищий, ніж у логічних операцій). Порівняння можна зв'язувати довільно; наприклад, ``x < y <= z`` еквівалентно ``x < y і y <= z``, за винятком того, що *y* обчислюється лише один раз (але в обох випадках *z* не обчислюється в все, коли ``x < y`` виявляється хибним).

source: This table summarizes the comparison operations:
fa: این جدول عملیات مقایسه را خلاصه می کند:
ru: В этой таблице суммированы операции сравнения:
uk: Ця таблиця підсумовує операції порівняння:

source: Meaning
fa: معنی
ru: Значение
uk: Значення

source: strictly less than
fa: به شدت کمتر از
ru: строго меньше, чем
uk: строго менше ніж

source: less than or equal
fa: کمتر یا مساوی
ru: меньше или равно
uk: менше або дорівнює

source: strictly greater than
fa: به شدت بیشتر از
ru: строго больше, чем
uk: строго більше ніж

source: greater than or equal
fa: بزرگتر یا مساوی
ru: больше или равно
uk: більше або дорівнює

source: equal
fa: برابر
ru: равный
uk: рівні

source: object identity
fa: هویت شی
ru: идентичность объекта
uk: ідентичність об'єкта

source: negated object identity
fa: هویت شی نفی
ru: отрицаемая идентичность объекта
uk: заперечена ідентичність об'єкта

source: Objects of different types, except different numeric types, never compare equal. The ``==`` operator is always defined but for some object types (for example, class objects) is equivalent to :keyword:`is`. The ``<``, ``<=``, ``>`` and ``>=`` operators are only defined where they make sense; for example, they raise a :exc:`TypeError` exception when one of the arguments is a complex number.
fa: اشیاء از انواع مختلف، به جز انواع عددی مختلف، هرگز برابر نیستند. عملگر ``==`` همیشه تعریف شده است اما برای برخی از انواع شی (به عنوان مثال, اشیاء کلاس) معادل :keyword:`is` است. اپراتورهای ``<``، ``<=``، ``>`` و ``>=`` فقط در جایی تعریف می شوند که منطقی باشند. به عنوان مثال، زمانی که یکی از آرگومان ها یک عدد مختلط باشد، یک استثنا :exc:`TypeError` را مطرح می کنند.
ru: Объекты разных типов, за исключением разных числовых типов, никогда не сравниваются равными. ``==`` оператор всегда определен, но для некоторых типов объектов (например, объектов класса) эквивалентен :keyword:`есть` . ``<`` , ``<=`` , ``>`` и ``>=`` операторы определяются только там, где они имеют смысл; например, они поднимают :exc:`TypeError` исключение, когда один из аргументов является комплексным числом.
uk: Об’єкти різних типів, за винятком різних числових типів, ніколи не порівнюються. Оператор ``==`` завжди визначений, але для деяких типів об’єктів (наприклад, об’єктів класу) еквівалентний :keyword:`is`. Оператори ``<``, ``<=``, ``>`` і ``>=`` визначені лише там, де вони мають сенс; наприклад, вони викликають виняток :exc:`TypeError`, коли один із аргументів є комплексним числом.

source: Non-identical instances of a class normally compare as non-equal unless the class defines the :meth:`~object.__eq__` method.
fa: نمونه های غیر یکسان یک کلاس معمولاً به عنوان غیر برابر مقایسه می شوند مگر اینکه کلاس متد :meth:`~object.__eq__` را تعریف کند.
ru: Неидентичные экземпляры класса обычно сравниваются как неравные, если класс не определяет :meth:`~object.__eq__` метод.
uk: Неідентичні екземпляри класу зазвичай порівнюються як нерівні, якщо клас не визначає метод :meth:`~object.__eq__`.

source: Instances of a class cannot be ordered with respect to other instances of the same class, or other types of object, unless the class defines enough of the methods :meth:`~object.__lt__`, :meth:`~object.__le__`, :meth:`~object.__gt__`, and :meth:`~object.__ge__` (in general, :meth:`~object.__lt__` and :meth:`~object.__eq__` are sufficient, if you want the conventional meanings of the comparison operators).
fa: نمونه‌های یک کلاس را نمی‌توان با توجه به نمونه‌های دیگر همان کلاس یا سایر انواع شی مرتب کرد، مگر اینکه کلاس به اندازه کافی متدهای :meth:`~object.__lt__`، :meth:`~object.__le__`، :meth:`~object.__gt__` و :meth:`~object.__ge__` را تعریف کند (به طور کلی, :meth:`~object.__lt__` و :meth:`~object.__eq__`, اگر معانی متعارف عملگرها را بخواهید, کافی هستند).
ru: Экземпляры класса не могут быть упорядочены относительно других экземпляров того же класса или других типов объектов, если только класс не определяет достаточное количество методов. :meth:`~object.__lt__` , :meth:`~object.__le__` , :meth:`~object.__gt__` , и :meth:`~object.__ge__` (в общем, :meth:`~object.__lt__` и :meth:`~object.__eq__` достаточно, если вам нужны общепринятые значения операторов сравнения).
uk: Екземпляри класу не можуть бути впорядковані відносно інших екземплярів того самого класу або інших типів об’єктів, якщо клас не визначає достатньо методів :meth:`~object.__lt__`, :meth:`~object.__le__` , :meth:`~object.__gt__` і :meth:`~object.__ge__` (загалом, :meth:`~object.__lt__` і :meth:`~object.__eq__` достатньо, якщо ви хочете звичайні значення операторів порівняння).

source: The behavior of the :keyword:`is` and :keyword:`is not` operators cannot be customized; also they can be applied to any two objects and never raise an exception.
fa: رفتار اپراتورهای :keyword:`is` و :keyword:`is not` قابل تنظیم نیست. همچنین آنها را می توان برای هر دو شی اعمال کرد و هرگز استثناء ایجاد نمی کند.
ru: Поведение :keyword:`есть` и :keyword:`is not` операторы нельзя настроить; также их можно применять к любым двум объектам и никогда не вызывать исключения.
uk: Поведінку операторів :keyword:`is` і :keyword:`is not` не можна налаштувати; також вони можуть бути застосовані до будь-яких двох об’єктів і ніколи не викликають винятків.

source: Two more operations with the same syntactic priority, :keyword:`in` and :keyword:`not in`, are supported by types that are :term:`iterable` or implement the :meth:`~object.__contains__` method.
fa: دو عملیات دیگر با اولویت نحوی یکسان، :keyword:`in` و :keyword:`not in`، توسط انواعی پشتیبانی می‌شوند که :term:`iterable` هستند یا روش :meth:`~object.__contains__` را پیاده‌سازی می‌کنند.
ru: Еще две операции с тем же синтаксическим приоритетом, :keyword:`в` и :keyword:`not in`, поддерживаются типами, которые являются :term:`iterable` или реализуют :meth:`~object.__contains__` метод.

source: Numeric Types --- :class:`int`, :class:`float`, :class:`complex`
fa: انواع عددی --- :class:`int`، :class:`float`، :class:`complex`
ru: Числовые типы --- :класс:`int` , :class:`плавать` , :class:`сложный`
uk: Числові типи --- :class:`int`, :class:`float`, :class:`complex`

source: There are three distinct numeric types: :dfn:`integers`, :dfn:`floating-point numbers`, and :dfn:`complex numbers`. In addition, Booleans are a subtype of integers. Integers have unlimited precision. Floating-point numbers are usually implemented using :c:expr:`double` in C; information about the precision and internal representation of floating-point numbers for the machine on which your program is running is available in :data:`sys.float_info`. Complex numbers have a real and imaginary part, which are each a floating-point number. To extract these parts from a complex number *z*, use ``z.real`` and ``z.imag``. (The standard library includes the additional numeric types :mod:`fractions.Fraction`, for rationals, and :mod:`decimal.Decimal`, for floating-point numbers with user-definable precision.)
fa: سه نوع عددی متمایز وجود دارد: :dfn: `اعداد صحیح`، :dfn: `اعداد ممیز شناور` و :dfn:` اعداد مختلط. بعلاوه، Booleans زیرنوعی از اعداد صحیح هستند. اعداد صحیح دقت نامحدودی دارند. اعداد ممیز شناور معمولاً با استفاده از :c:expr:`double` در C پیاده سازی می شوند. اطلاعات مربوط به دقت و نمایش داخلی اعداد ممیز شناور برای ماشینی که برنامه شما روی آن اجرا می شود در :data:`sys.float_info` موجود است. اعداد مختلط یک قسمت واقعی و خیالی دارند که هر کدام یک عدد ممیز شناور هستند. برای استخراج این قطعات از یک عدد مختلط *z*، از ``z.real`` و ``z.imag`` استفاده کنید. (کتابخانه استاندارد شامل انواع عددی اضافی :mod:`fractions.Fraction`, برای منطقی, و :mod:`decimal.Decimal`, برای اعداد ممیز شناور با دقت قابل تعریف توسط کاربر است.)

source: Numbers are created by numeric literals or as the result of built-in functions and operators. Unadorned integer literals (including hex, octal and binary numbers) yield integers. Numeric literals containing a decimal point or an exponent sign yield floating-point numbers. Appending ``'j'`` or ``'J'`` to a numeric literal yields an imaginary number (a complex number with a zero real part) which you can add to an integer or float to get a complex number with real and imaginary parts.
fa: اعداد توسط حروف عددی یا در نتیجه توابع و عملگرهای داخلی ایجاد می شوند. اعداد صحیح بدون تزئین (شامل اعداد هگز, هشت و دودویی) اعداد صحیح را به دست می دهند. لفظ های عددی حاوی یک نقطه اعشار یا یک علامت توان اعداد ممیز شناور را به دست می دهند. با اضافه کردن ``'j'`` یا ``'J'`` به یک عدد واقعی یک عدد خیالی (یک عدد مختلط با قسمت واقعی صفر) به دست می‌آید که می‌توانید آن را به یک عدد صحیح یا شناور اضافه کنید تا یک عدد مختلط با قسمت‌های واقعی و فرضی بدست آورید.

source: Python fully supports mixed arithmetic: when a binary arithmetic operator has operands of different numeric types, the operand with the "narrower" type is widened to that of the other, where integer is narrower than floating point, which is narrower than complex. A comparison between numbers of different types behaves as though the exact values of those numbers were being compared. [2]_
fa: پایتون به طور کامل از محاسبات مختلط پشتیبانی می‌کند: زمانی که یک عملگر حسابی باینری دارای عملوندهایی از انواع مختلف عددی است، عملوند با نوع «باریک‌تر» به دیگری گسترده می‌شود، جایی که عدد صحیح از ممیز شناور باریک‌تر است، که باریک‌تر از مختلط است. مقایسه بین اعداد از انواع مختلف طوری رفتار می کند که گویی مقادیر دقیق آن اعداد در حال مقایسه هستند. [2]_
ru: Python полностью поддерживает смешанную арифметику: когда оператор двоичной арифметики имеет операнды разных числовых типов, операнд с «более узким» типом расширяется до операнда другого, где целое число уже, чем с плавающей запятой, которое уже, чем комплексное. Сравнение чисел разных типов происходит так, как если бы сравнивались точные значения этих чисел. [2]_
uk: Python повністю підтримує змішану арифметику: коли двійковий арифметичний оператор має операнди різних числових типів, операнд із "вужчим" типом розширюється до операнда іншого типу, де ціле число вужче за число з плаваючою крапкою, яке є вужчим за комплексний. Порівняння між числами різних типів поводиться так, ніби порівнюються точні значення цих чисел. [2]_

source: The constructors :func:`int`, :func:`float`, and :func:`complex` can be used to produce numbers of a specific type.
fa: سازنده های :func:`int`، :func:`float` و :func:`complex` می توانند برای تولید اعداد از یک نوع خاص استفاده شوند.
ru: Конструкторы :func:`int` , :func:`плавающий` , и :func:`сложный` может использоваться для создания чисел определенного типа.
uk: Конструктори :func:`int`, :func:`float` і :func:`complex` можна використовувати для отримання чисел певного типу.

source: All numeric types (except complex) support the following operations (for priorities of the operations, see :ref:`operator-summary`):
fa: همه انواع عددی (به جز مختلط) از عملیات زیر پشتیبانی می کنند (برای اولویت های عملیات, به :ref:`operator-summary` مراجعه کنید):
ru: Все числовые типы (кроме комплексных) поддерживают следующие операции (приоритеты операций см. :ref:`operator-summary` ):
uk: Усі числові типи (крім комплексних) підтримують наступні операції (пріоритети операцій див. :ref:`operator-summary`):

source: Full documentation
fa: مستندات کامل
ru: Полная документация
uk: Повна документація

source: sum of *x* and *y*
fa: مجموع *x* و *y*
ru: сумма *x* и *y*
uk: сума *x* і *y*

source: difference of *x* and *y*
fa: تفاوت *x* و *y*
ru: разница *x* и *y*
uk: різниця *x* і *y*

source: product of *x* and *y*
fa: محصول *x* و *y*
ru: произведение *x* и *y*
uk: добуток *x* і *y*

source: quotient of *x* and *y*
fa: ضریب *x* و *y*
ru: частное от *x* и *y*
uk: частка *x* і *y*

source: floored quotient of *x* and *y*
fa: ضریب کفپوش *x* و *y*
ru: частное от *x* и *y*
uk: частка *x* і *y*

source: remainder of ``x / y``
fa: باقیمانده ``x / y``
ru: остаток ``х/у``
uk: залишок ``x / y``

source: *x* negated
fa: *x* نفی شد
ru: *x* отрицается
uk: *x* заперечено

source: *x* unchanged
fa: *x* بدون تغییر
ru: *x* без изменений
uk: *x* без змін

source: absolute value or magnitude of *x*
fa: مقدار مطلق یا بزرگی *x*
ru: абсолютное значение или величина *x*
uk: абсолютне значення або величина *x*

source: *x* converted to integer
fa: *x* به عدد صحیح تبدیل شد
ru: *x* преобразовано в целое число
uk: *x* перетворено на ціле число

source: *x* converted to floating point
fa: *x* به ممیز شناور تبدیل شد
ru: *x* преобразовано в формат с плавающей запятой
uk: *x* перетворено на число з плаваючою комою

source: a complex number with real part *re*, imaginary part *im*. *im* defaults to zero.
fa: یک عدد مختلط با قسمت واقعی *re*، قسمت خیالی *im*. پیش فرض *im* صفر است.
ru: комплексное число с действительной частью *re* и мнимой частью *im*. *im* по умолчанию равно нулю.
uk: комплексне число з дійсною частиною *re*, уявною частиною *im*. *im* за замовчуванням дорівнює нулю.

source: conjugate of the complex number *c*
fa: مزدوج عدد مختلط *c*
ru: сопряженное комплексному числу *c*
uk: спряжене комплексне число *c*
