Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: fa, ru, uk

source: Code objects are used by the implementation to represent "pseudo-compiled" executable Python code such as a function body. They differ from function objects because they don't contain a reference to their global execution environment. Code objects are returned by the built-in :func:`compile` function and can be extracted from function objects through their :attr:`~function.__code__` attribute. See also the :mod:`code` module.
fa: اشیاء کد توسط پیاده سازی برای نمایش کدهای اجرایی پایتون "شبه کامپایل شده" مانند یک تابع استفاده می شود. آنها با اشیاء تابع متفاوت هستند زیرا حاوی ارجاعی به محیط اجرای جهانی خود نیستند. اشیاء کد توسط تابع داخلی :func:`compile` برگردانده می شوند و می توان آنها را از طریق ویژگی :attr:`~function.__code__` از اشیاء تابع استخراج کرد. ماژول :mod:`code` را نیز ببینید.
ru: Объекты кода используются реализацией для представления «псевдоскомпилированного» исполняемого кода Python, такого как тело функции. Они отличаются от объектов-функций, поскольку не содержат ссылки на свою глобальную среду выполнения. Объекты кода возвращаются встроенным :func:`скомпилировать` функции и могут быть извлечены из функциональных объектов через их :attr:`~function.__code__` атрибут. См. также :mod:`код` модуль.

source: Accessing :attr:`~function.__code__` raises an :ref:`auditing event <auditing>` ``object.__getattr__`` with arguments ``obj`` and ``"__code__"``.
fa: دسترسی به :attr:`~function.__code__` یک :ref:`auditing event <auditing>` ``object.__getattr__`` با آرگومان های ``obj`` و ``"__code__"`` را افزایش می دهد.
ru: Доступ :attr:`~function.__code__` вызывает :ref:`событие аудита ` ``object.__getattr__`` с аргументами ``объект`` и ``"__code__"`` .

source: A code object can be executed or evaluated by passing it (instead of a source string) to the :func:`exec` or :func:`eval` built-in functions.
fa: یک شی کد را می توان با ارسال آن (به جای رشته منبع) به توابع داخلی :func:`exec` یا :func:`eval` اجرا یا ارزیابی کرد.
ru: Объект кода можно выполнить или оценить, передав его (вместо исходной строки) в :func:`exec` или :func:`eval` встроенные функции.
uk: Об’єкт коду можна виконати або оцінити, передавши його (замість вихідного рядка) у вбудовані функції :func:`exec` або :func:`eval`.

source: See :ref:`types` for more information.
fa: برای اطلاعات بیشتر به :ref:`types` مراجعه کنید.
ru: Видеть :ref:`типы` для получения дополнительной информации.
uk: Перегляньте :ref:`types` для отримання додаткової інформації.

source: Type Objects
fa: اشیاء را تایپ کنید
ru: Объекты типа
uk: Об'єкти типу

source: Type objects represent the various object types. An object's type is accessed by the built-in function :func:`type`. There are no special operations on types. The standard module :mod:`types` defines names for all standard built-in types.
fa: اشیاء نوع نشان دهنده انواع مختلف شی هستند. نوع یک شی توسط تابع داخلی :func:`type` قابل دسترسی است. هیچ عملیات خاصی روی انواع وجود ندارد. ماژول استاندارد :mod:`types` نام هایی را برای همه انواع استاندارد داخلی تعریف می کند.
ru: Объекты типов представляют различные типы объектов. Доступ к типу объекта осуществляется встроенной функцией :func:`тип` . Специальных операций над типами нет. Стандартный модуль :mod:`типы` определяет имена для всех стандартных встроенных типов.
uk: Об’єкти типу представляють різні типи об’єктів. Доступ до типу об’єкта здійснюється за допомогою вбудованої функції :func:`type`. Над типами немає спеціальних операцій. Стандартний модуль :mod:`types` визначає імена для всіх стандартних вбудованих типів.

source: Types are written like this: ``<class 'int'>``.
fa: انواع به این صورت نوشته می شود: ``<class 'int'>``.
ru: Типы записываются так: ``<класс 'int'>`` .
uk: Типи записуються так: ``<class 'int'>``.

source: The Null Object
fa: شی پوچ
ru: Нулевой объект
uk: Нульовий об’єкт

source: This object is returned by functions that don't explicitly return a value. It supports no special operations. There is exactly one null object, named ``None`` (a built-in name). ``type(None)()`` produces the same singleton.
fa: این شی توسط توابعی که به صراحت مقداری را بر نمی گردند، برگردانده می شود. هیچ عملیات خاصی را پشتیبانی نمی کند. دقیقاً یک شی تهی به نام ``None`` (یک نام داخلی) وجود دارد. ``type(None)()`` همان تک تنه را تولید می کند.
ru: Этот объект возвращается функциями, которые не возвращают значение явно. Он не поддерживает никаких специальных операций. Существует ровно один нулевой объект с именем ``Нет`` (встроенное имя). ``тип(Нет)()`` производит тот же синглтон.
uk: Цей об’єкт повертають функції, які явно не повертають значення. Він не підтримує ніяких спеціальних операцій. Існує рівно один нульовий об’єкт із назвою ``None`` (вбудована назва). ``type(None)()`` створює той самий синглтон.

source: It is written as ``None``.
fa: به صورت ``None`` نوشته شده است.
ru: Это написано как ``Нет`` .
uk: Він записується як ``None``.

source: The Ellipsis Object
fa: شی بیضی
ru: Объект «Эллипсис»
uk: Об’єкт "Еліпсис".

source: This object is commonly used by slicing (see :ref:`slicings`). It supports no special operations. There is exactly one ellipsis object, named :const:`Ellipsis` (a built-in name). ``type(Ellipsis)()`` produces the :const:`Ellipsis` singleton.
fa: این شی معمولاً با برش استفاده می شود (به :ref:`slicings` مراجعه کنید). هیچ عملیات خاصی را پشتیبانی نمی کند. دقیقاً یک شیء بیضی وجود دارد، به نام :const:`Ellipsis` (یک نام داخلی). ``type(Ellipsis)()`` تک تنه :const:`Ellipsis` را تولید می کند.
ru: Этот объект обычно используется при нарезке (см. :ref:`нарезки` ). Он не поддерживает никаких специальных операций. Существует ровно один объект с многоточием с именем :const:`Многоточие` (встроенное имя). ``тип(многоточие)()`` производит :const:`Многоточие` синглтон.
uk: Цей об’єкт зазвичай використовується для нарізки (див. :ref:`slicings`). Він не підтримує ніяких спеціальних операцій. Існує рівно один об’єкт з крапкою, який називається :const:`Ellipsis` (вбудована назва). ``type(Ellipsis)()`` виробляє :const:`Ellipsis` синглтон.

source: It is written as ``Ellipsis`` or ``...``.
fa: به صورت ``Ellipsis`` یا ``...`` نوشته شده است.
ru: Это написано как ``Многоточие`` или ``...`` .
uk: Він записується як ``Еліпсис`` або ``...``.

source: The NotImplemented Object
fa: شیء NotImplemented
ru: Нереализованный объект
uk: Об’єкт NotImplemented

source: This object is returned from comparisons and binary operations when they are asked to operate on types they don't support. See :ref:`comparisons` for more information. There is exactly one :data:`NotImplemented` object. :code:`type(NotImplemented)()` produces the singleton instance.
fa: زمانی که از آنها خواسته می‌شود روی انواعی که پشتیبانی نمی‌کنند عمل کنند، این شی از مقایسه‌ها و عملیات باینری بازگردانده می‌شود. برای اطلاعات بیشتر به :ref:`comparisons` مراجعه کنید. دقیقا یک شی :data:`NotImplemented` وجود دارد. :code:`type(NotImplemented)()` نمونه singleton را تولید می کند.
ru: Этот объект возвращается из сравнений и двоичных операций, когда их просят работать с типами, которые они не поддерживают. Видеть :ref:`сравнения` для получения дополнительной информации. Есть ровно один :data:`NotImplemented` объект. :code:`type(NotImplemented)()` создает экземпляр синглтона.

source: It is written as :code:`NotImplemented`.
fa: به صورت :code:'NotImplemented' نوشته شده است.
ru: Это написано как :code:`Нереализован` .

source: Internal Objects
fa: اشیاء داخلی
ru: Внутренние объекты
uk: Внутрішні об'єкти

source: See :ref:`types` for this information. It describes :ref:`stack frame objects <frame-objects>`, :ref:`traceback objects <traceback-objects>`, and slice objects.
fa: برای این اطلاعات به :ref:`types` مراجعه کنید. این :ref:`stack frame objects <frame-objects>`، :ref:`traceback objects <traceback-objects>` و اشیاء برش را توصیف می کند.
ru: Видеть :ref:`типы` для этой информации. Он описывает объекты фрейма стека. `, :ref:`объекты трассировки` и нарезать объекты.

source: Special Attributes
fa: ویژگی های خاص
ru: Специальные атрибуты
uk: Спеціальні атрибути

source: The implementation adds a few special read-only attributes to several object types, where they are relevant. Some of these are not reported by the :func:`dir` built-in function.
fa: پیاده‌سازی چند ویژگی خاص فقط خواندنی را به چندین نوع شی اضافه می‌کند، جایی که آنها مرتبط هستند. برخی از اینها توسط عملکرد داخلی :func:`dir` گزارش نشده است.
ru: Реализация добавляет несколько специальных атрибутов, доступных только для чтения, к нескольким типам объектов, где они уместны. О некоторых из них не сообщается :func:`скажи` встроенная функция.
uk: Реалізація додає кілька спеціальних атрибутів лише для читання до кількох типів об’єктів, де вони актуальні. Деякі з них не повідомляються вбудованою функцією :func:`dir`.

source: The name of the class, function, method, descriptor, or generator instance.
fa: نام کلاس، تابع، متد، توصیفگر یا نمونه مولد.
ru: Имя класса, функции, метода, дескриптора или экземпляра генератора.
uk: Ім'я класу, функції, методу, дескриптора або екземпляра генератора.

source: The :term:`qualified name` of the class, function, method, descriptor, or generator instance.
fa: :term:`qualified name` کلاس، تابع، متد، توصیفگر یا نمونه مولد.
ru: :term:`полное имя` класса, функции, метода, дескриптора или экземпляра генератора.
uk: :term:`qualified name` класу, функції, методу, дескриптора або екземпляра генератора.

source: The name of the module in which a class or function was defined.
fa: نام ماژولی که یک کلاس یا تابع در آن تعریف شده است.

source: The documentation string of a class or function, or ``None`` if undefined.
fa: رشته مستندات یک کلاس یا تابع یا ``None`` اگر تعریف نشده باشد.

source: The :ref:`type parameters <type-params>` of generic classes, functions, and :ref:`type aliases <type-aliases>`. For classes and functions that are not generic, this will be an empty tuple.
fa: :ref:`type parameters <type-params>` از کلاس های عمومی، توابع و :ref:`type aliases <type-aliases>`. برای کلاس ها و توابعی که عمومی نیستند، این یک تاپل خالی خواهد بود.

source: Integer string conversion length limitation
fa: محدودیت طول تبدیل رشته عدد صحیح
ru: Ограничение длины преобразования целочисленной строки

source: CPython has a global limit for converting between :class:`int` and :class:`str` to mitigate denial of service attacks. This limit *only* applies to decimal or other non-power-of-two number bases. Hexadecimal, octal, and binary conversions are unlimited. The limit can be configured.
fa: CPython یک محدودیت جهانی برای تبدیل بین :class:`int` و :class:`str` برای کاهش حملات انکار سرویس دارد. این محدودیت *only* برای پایه های اعشاری یا سایر پایه های غیر توان دو عدد اعمال می شود. تبدیل های هگزادسیمال، اکتال و باینری نامحدود هستند. محدودیت را می توان پیکربندی کرد.
ru: CPython имеет глобальное ограничение на преобразование между :класс:`int` и :class:`str` для смягчения атак типа «отказ в обслуживании». Это ограничение *только* применяется к десятичным или другим системам счисления, отличным от степени двойки. Шестнадцатеричные, восьмеричные и двоичные преобразования не ограничены. Лимит можно настроить.

source: The :class:`int` type in CPython is an arbitrary length number stored in binary form (commonly known as a "bignum"). There exists no algorithm that can convert a string to a binary integer or a binary integer to a string in linear time, *unless* the base is a power of 2. Even the best known algorithms for base 10 have sub-quadratic complexity. Converting a large value such as ``int('1' * 500_000)`` can take over a second on a fast CPU.
fa: نوع :class:`int` در CPython یک عدد طول دلخواه است که به شکل باینری ذخیره می شود (که معمولاً به عنوان "bignum" شناخته می شود). هیچ الگوریتمی وجود ندارد که بتواند یک رشته را در زمان خطی به یک عدد صحیح باینری یا یک عدد صحیح باینری را به یک رشته تبدیل کند، پایه *unless* توان 2 است. حتی بهترین الگوریتم های شناخته شده برای پایه 10 دارای پیچیدگی زیر درجه دوم هستند. تبدیل یک مقدار بزرگ مانند ``int('1' * 500_000)`` می تواند در یک CPU سریع یک ثانیه طول بکشد.
ru: The :класс:`int` тип в CPython — это число произвольной длины, хранящееся в двоичной форме (широко известное как «bignum»). Не существует алгоритма, который мог бы преобразовать строку в двоичное целое число или двоичное целое число в строку за линейное время, *если только* основание не является степенью 2. Даже самые известные алгоритмы для основания 10 имеют субквадратическую сложность. Преобразование большого значения, например ``int('1' * 500_000)`` может занять больше секунды на быстром процессоре.

source: Limiting conversion size offers a practical way to avoid :cve:`2020-10735`.
fa: محدود کردن اندازه تبدیل یک راه عملی برای جلوگیری از :cve:`2020-10735` ارائه می دهد.

source: The limit is applied to the number of digit characters in the input or output string when a non-linear conversion algorithm would be involved. Underscores and the sign are not counted towards the limit.
fa: محدودیت برای تعداد کاراکترهای رقمی در رشته ورودی یا خروجی اعمال می شود که یک الگوریتم تبدیل غیرخطی درگیر باشد. زیرخط و علامت در حد محدود محاسبه نمی شود.
ru: Ограничение применяется к количеству цифровых символов во входной или выходной строке, когда используется алгоритм нелинейного преобразования. Символы подчеркивания и знак не учитываются при расчете лимита.

source: When an operation would exceed the limit, a :exc:`ValueError` is raised:
fa: هنگامی که یک عملیات از حد مجاز فراتر می رود، یک :exc:`ValueError` افزایش می یابد:
ru: Если операция превысит лимит, :exc:`ValueError` поднят:

source: >>> import sys >>> sys.set_int_max_str_digits(4300) # Illustrative, this is the default. >>> _ = int('2' * 5432) Traceback (most recent call last): ... ValueError: Exceeds the limit (4300 digits) for integer string conversion: value has 5432 digits; use sys.set_int_max_str_digits() to increase the limit >>> i = int('2' * 4300) >>> len(str(i)) 4300 >>> i_squared = i*i >>> len(str(i_squared)) Traceback (most recent call last): ... ValueError: Exceeds the limit (4300 digits) for integer string conversion; use sys.set_int_max_str_digits() to increase the limit >>> len(hex(i_squared)) 7144 >>> assert int(hex(i_squared), base=16) == i*i # Hexadecimal is unlimited.
fa: >>> سیستم را وارد کنید >>> sys.set_int_max_str_digits(4300) # گویا, این پیش فرض است. >>> _ = int('2' * 5432) Traceback (most recent call last): ... ValueError: Exceeds the limit (4300 digits) for integer string conversion: value has 5432 digits; use sys.set_int_max_str_digits() to increase the limit >>> i = int('2' * 4300) >>> len(str(i)) 4300 >>> i_squared = i*i >>> len(str(i_squared)) Traceback (most recent call last): ... ValueError: Exceeds the limit (4300 digits) for integer string conversion; use sys.set_int_max_str_digits() to increase the limit >>> len(hex(i_squared)) 7144 >>> assert int(hex(i_squared), base=16) == i*i # هگزادسیمال نامحدود است.

source: The default limit is 4300 digits as provided in :data:`sys.int_info.default_max_str_digits <sys.int_info>`. The lowest limit that can be configured is 640 digits as provided in :data:`sys.int_info.str_digits_check_threshold <sys.int_info>`.
fa: حد پیش فرض 4300 رقم است که در :data:`sys.int_info.default_max_str_digits <sys.int_info>` ارائه شده است. کمترین حدی که می توان پیکربندی کرد 640 رقم است که در :data:`sys.int_info.str_digits_check_threshold <sys.int_info>` ارائه شده است.
ru: Ограничение по умолчанию составляет 4300 цифр, как указано в :data:`sys.int_info.default_max_str_digits. <sys.int_info>` . Самый низкий предел, который можно настроить, составляет 640 цифр, как указано в :data:`sys.int_info.str_digits_check_threshold. <sys.int_info>` .

source: Verification:
fa: تایید:
ru: Верификация:

source: Affected APIs
fa: APIهای تحت تأثیر
ru: Затронутые API

source: The limitation only applies to potentially slow conversions between :class:`int` and :class:`str` or :class:`bytes`:
fa: این محدودیت فقط برای تبدیل‌های بالقوه کند بین :class:`int` و :class:`str` یا :class:`bytes` اعمال می‌شود:
ru: Ограничение применяется только к потенциально медленным преобразованиям между :класс:`int` и :class:`str` или :class:`байты` :

source: ``int(string)`` with default base 10.
fa: ``int(string)`` با پایه پیش فرض 10.
ru: ``int(строка)`` с базой по умолчанию 10.

source: ``int(string, base)`` for all bases that are not a power of 2.
fa: ``int(string, base)`` برای همه پایه هایی که توان 2 نیستند.
ru: ``int(строка, база)`` для всех оснований, не являющихся степенью 2.

source: any other string conversion to base 10, for example ``f"{integer}"``, ``"{}".format(integer)``, or ``b"%d" % integer``.
fa: هر تبدیل رشته دیگر به پایه 10، به عنوان مثال ``f"{integer}"``، ``"{}".format(integer)``، یا ``b"%d" % integer``.
ru: любое другое преобразование строк в базу 10, например ``f"{integer}"`` , ``"{}".format(целое число)`` , или ``b"%d" % целое число`` .

source: The limitations do not apply to functions with a linear algorithm:
fa: محدودیت ها برای توابع با الگوریتم خطی اعمال نمی شود:
ru: Ограничения не распространяются на функции с линейным алгоритмом:

source: ``int(string, base)`` with base 2, 4, 8, 16, or 32.
fa: ``int(string, base)`` با پایه 2، 4، 8، 16 یا 32.
ru: ``int(строка, база)`` с основанием 2, 4, 8, 16 или 32.

source: :func:`int.from_bytes` and :func:`int.to_bytes`.
fa: :func:`int.from_bytes` و :func:`int.to_bytes`.
ru: :func:`int.from_bytes` и :func:`int.to_bytes`.

source: :ref:`formatspec` for hex, octal, and binary numbers.
fa: :ref:`formatspec` برای اعداد هگز، هشت و دودویی.
ru: :ref:`formatspec` для шестнадцатеричных, восьмеричных и двоичных чисел.

source: :class:`str` to :class:`float`.
fa: :class:`str` تا :class:`float`.
ru: :class:`str` на :class:`float`.

source: :class:`str` to :class:`decimal.Decimal`.
fa: :class:`str` تا :class:`decimal.Decimal`.
ru: :class:`str` на :class:`decimal.Decimal`.

source: Configuring the limit
fa: پیکربندی حد
ru: Настройка лимита

source: Before Python starts up you can use an environment variable or an interpreter command line flag to configure the limit:
fa: قبل از راه‌اندازی پایتون، می‌توانید از یک متغیر محیطی یا پرچم خط فرمان مفسر برای پیکربندی محدودیت استفاده کنید:
ru: Перед запуском Python вы можете использовать переменную среды или флаг командной строки интерпретатора, чтобы настроить ограничение:

source: :envvar:`PYTHONINTMAXSTRDIGITS`, e.g. ``PYTHONINTMAXSTRDIGITS=640 python3`` to set the limit to 640 or ``PYTHONINTMAXSTRDIGITS=0 python3`` to disable the limitation.
fa: :envvar:`PYTHONINTMAXSTRDIGITS`، به عنوان مثال ``PYTHONINTMAXSTRDIGITS=640 python3`` برای تنظیم محدودیت روی 640 یا ``PYTHONINTMAXSTRDIGITS=0 python3`` برای غیرفعال کردن محدودیت.
ru: :envvar:`PYTHONINTMAXSTRDIGITS` , например ``PYTHONINTMAXSTRDIGITS=640 python3`` чтобы установить ограничение на 640 или ``PYTHONINTMAXSTRDIGITS=0 python3`` чтобы отключить ограничение.

source: :option:`-X int_max_str_digits <-X>`, e.g. ``python3 -X int_max_str_digits=640``
fa: :option:`-X int_max_str_digits <-X>`، به عنوان مثال ``python3 -X int_max_str_digits=640``
ru: :option:`-X int_max_str_digits `, например ``python3 -X int_max_str_digits=640``

source: :data:`sys.flags.int_max_str_digits` contains the value of :envvar:`PYTHONINTMAXSTRDIGITS` or :option:`-X int_max_str_digits <-X>`. If both the env var and the ``-X`` option are set, the ``-X`` option takes precedence. A value of *-1* indicates that both were unset, thus a value of :data:`sys.int_info.default_max_str_digits` was used during initialization.
fa: :data:`sys.flags.int_max_str_digits` حاوی مقدار :envvar:`PYTHONINTMAXSTRDIGITS` یا :option:`-X int_max_str_digits <-X>` است. اگر هر دو گزینه env var و ``-X`` تنظیم شده باشند، گزینه ``-X`` اولویت دارد. مقدار *-1* نشان می دهد که هر دو تنظیم نشده بودند، بنابراین مقدار :data:`sys.int_info.default_max_str_digits` در هنگام مقداردهی اولیه استفاده شد.
ru: :data:`sys.flags.int_max_str_digits` содержит значение :envvar:`PYTHONINTMAXSTRDIGITS` или :option:`-X int_max_str_digits `. Если и env var, и ``-X`` опция установлена, ``-X`` вариант имеет приоритет. Значение *-1* указывает, что оба были отключены, поэтому значение :data:`sys.int_info.default_max_str_digits` использовался во время инициализации.

source: From code, you can inspect the current limit and set a new one using these :mod:`sys` APIs:
fa: از کد، می توانید محدودیت فعلی را بررسی کرده و با استفاده از این API های :mod:`sys` یک محدودیت جدید تنظیم کنید:
ru: Из кода вы можете проверить текущий предел и установить новый, используя эти :mod:`sys` API:

source: :func:`sys.get_int_max_str_digits` and :func:`sys.set_int_max_str_digits` are a getter and setter for the interpreter-wide limit. Subinterpreters have their own limit.
fa: :func:`sys.get_int_max_str_digits` و :func:`sys.set_int_max_str_digits` یک گیرنده و تنظیم کننده برای حد گسترده مترجم هستند. مترجم فرعی محدودیت خاص خود را دارد.
ru: :func:`sys.get_int_max_str_digits` и :func:`sys.set_int_max_str_digits` являются геттером и установщиком ограничения для всего интерпретатора. У субинтерпретаторов есть свой предел.

source: Information about the default and minimum can be found in :data:`sys.int_info`:
fa: اطلاعات مربوط به پیش فرض و حداقل را می توان در :data:`sys.int_info` یافت:
ru: Информацию о значениях по умолчанию и минимуме можно найти в :data:`sys.int_info` :

source: :data:`sys.int_info.default_max_str_digits <sys.int_info>` is the compiled-in default limit.
fa: :data:`sys.int_info.default_max_str_digits <sys.int_info>` حد پیش فرض کامپایل شده است.
ru: :data:`sys.int_info.default_max_str_digits <sys.int_info>` — это скомпилированный предел по умолчанию.

source: :data:`sys.int_info.str_digits_check_threshold <sys.int_info>` is the lowest accepted value for the limit (other than 0 which disables it).
fa: :data:`sys.int_info.str_digits_check_threshold <sys.int_info>` کمترین مقدار پذیرفته شده برای حد است (به غیر از 0 که آن را غیرفعال می کند).
ru: :data:`sys.int_info.str_digits_check_threshold <sys.int_info>` — наименьшее допустимое значение предела (кроме 0, которое отключает его).

source: Setting a low limit *can* lead to problems. While rare, code exists that contains integer constants in decimal in their source that exceed the minimum threshold. A consequence of setting the limit is that Python source code containing decimal integer literals longer than the limit will encounter an error during parsing, usually at startup time or import time or even at installation time - anytime an up to date ``.pyc`` does not already exist for the code. A workaround for source that contains such large constants is to convert them to ``0x`` hexadecimal form as it has no limit.
fa: تنظیم یک حد پایین *can* منجر به مشکلاتی می شود. در حالی که نادر است، کدی وجود دارد که دارای اعداد صحیح به صورت اعشاری در منبع خود است که از حداقل آستانه فراتر می رود. پیامد تنظیم محدودیت این است که کد منبع پایتون حاوی اعداد صحیح اعشاری طولانی‌تر از حد مجاز، در هنگام تجزیه معمولاً در زمان راه‌اندازی یا زمان وارد کردن یا حتی در زمان نصب با خطا مواجه می‌شود - هر زمان که ``.pyc`` به‌روز برای کد وجود نداشته باشد. یک راه حل برای منبعی که دارای چنین ثابت های بزرگی است، تبدیل آنها به شکل هگزادسیمال ``0x`` است زیرا محدودیتی ندارد.
ru: Установка нижнего предела *может* привести к проблемам. Хотя и редко, но существует код, который содержит в исходном виде целочисленные константы в десятичном формате, превышающие минимальный порог. Последствием установки ограничения является то, что исходный код Python, содержащий десятичные целые литералы, длина которых превышает предел, столкнется с ошибкой во время анализа, обычно во время запуска или во время импорта или даже во время установки - в любое время и в обновленном виде. ``.pyc`` для кода еще не существует. Обходной путь для источника, содержащего такие большие константы, — преобразовать их в ``0x`` шестнадцатеричной форме, поскольку она не имеет предела.
