Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: fa, ru, uk

source: For numbers ``x`` and ``y``, possibly of different types, it's a requirement that ``hash(x) == hash(y)`` whenever ``x == y`` (see the :meth:`~object.__hash__` method documentation for more details). For ease of implementation and efficiency across a variety of numeric types (including :class:`int`, :class:`float`, :class:`decimal.Decimal` and :class:`fractions.Fraction`) Python's hash for numeric types is based on a single mathematical function that's defined for any rational number, and hence applies to all instances of :class:`int` and :class:`fractions.Fraction`, and all finite instances of :class:`float` and :class:`decimal.Decimal`. Essentially, this function is given by reduction modulo ``P`` for a fixed prime ``P``. The value of ``P`` is made available to Python as the :attr:`modulus` attribute of :data:`sys.hash_info`.
uk: Для чисел ``x`` і ``y``, можливо, різних типів, є вимога, щоб ``hash(x) == hash(y)`` щоразу, коли ``x == y`` (див. : документація методу :meth:`~object.__hash__` для отримання додаткової інформації). Для простоти впровадження та ефективності для різноманітних числових типів (зокрема :class:`int`, :class:`float`, :class:`decimal.Decimal` і :class:`fractions.Fraction`) хеш Python для числових типи базується на одній математичній функції, яка визначена для будь-якого раціонального числа, і, отже, застосовується до всіх екземплярів :class:`int` і :class:`fractions.Fraction`, а також усіх кінцевих екземплярів :class:`float` і :class:`decimal.Decimal`. По суті, ця функція задана скороченням за модулем ``P`` для фіксованого простого ``P``. Значення ``P`` стає доступним для Python як атрибут :attr:`modulus` :data:`sys.hash_info`.

source: Python's :term:`generator`\s provide a convenient way to implement the iterator protocol. If a container object's :meth:`__iter__` method is implemented as a generator, it will automatically return an iterator object (technically, a generator object) supplying the :meth:`__iter__` and :meth:`~generator.__next__` methods. More information about generators can be found in :ref:`the documentation for the yield expression <yieldexpr>`.
uk: :term:`generator`\s Python надають зручний спосіб реалізації протоколу ітератора. Якщо метод :meth:`__iter__` об’єкта-контейнера реалізовано як генератор, він автоматично повертатиме об’єкт-ітератор (технічно, об’єкт-генератор), що надає методи :meth:`__iter__` і :meth:`~generator.__next__` . Більше інформації про генератори можна знайти в :ref:`документації для виразу yield <yieldexpr>`.

source: ``x in s``
uk: ``x в s``

source: ``x not in s``
uk: ``x не в s``

source: ``min(s)``
uk: ``хв(и)``

source: remove the first item from *s* where ``s[i]`` is equal to *x*
uk: видалити перший елемент із *s*, де ``s[i]`` дорівнює *x*

source: *t* must have the same length as the slice it is replacing.
uk: *t* має мати таку саму довжину, що й фрагмент, який він замінює.

source: The :attr:`~range.start`, :attr:`~range.stop` and :attr:`~range.step` attributes.
uk: Атрибути :attr:`~range.start`, :attr:`~range.stop` і :attr:`~range.step`.

source: See :ref:`strings` for more about the various forms of string literal, including supported escape sequences, and the ``r`` ("raw") prefix that disables most escape sequence processing.
uk: Перегляньте :ref:`strings`, щоб дізнатися більше про різні форми рядкових літералів, включаючи підтримувані керуючі послідовності та префікс ``r`` ("необроблений"), який вимикає більшість обробки керуючих послідовностей.

source: If *sep* is given, consecutive delimiters are not grouped together and are deemed to delimit empty strings (for example, ``'1,,2'.split(',')`` returns ``['1', '', '2']``). The *sep* argument may consist of multiple characters (for example, ``'1<>2<>3'.split('<>')`` returns ``['1', '2', '3']``). Splitting an empty string with a specified separator returns ``['']``.
uk: Якщо задано *sep*, послідовні розділювачі не групуються разом і вважаються роздільниками порожніх рядків (наприклад, ``'1,,2'.split(',')`` повертає ``['1', ' ', '2']``). Аргумент *sep* може складатися з кількох символів (наприклад, ``'1 <> 2 <> 3'.split(' <> ')`` повертає ``['1', '2', '3']`` ). Розділення порожнього рядка з указаним роздільником повертає ``['']``.

source: Return a copy of the string in which each character has been mapped through the given translation table. The table must be an object that implements indexing via :meth:`__getitem__`, typically a :term:`mapping` or :term:`sequence`. When indexed by a Unicode ordinal (an integer), the table object can do any of the following: return a Unicode ordinal or a string, to map the character to one or more other characters; return ``None``, to delete the character from the return string; or raise a :exc:`LookupError` exception, to map the character to itself.
uk: Повертає копію рядка, у якому кожен символ було зіставлено через задану таблицю перекладу. Таблиця має бути об’єктом, який реалізує індексування через :meth:`__getitem__`, як правило, :term:`mapping` або :term:`sequence`. Коли індексується порядковим номером Unicode (цілим числом), об’єкт таблиці може виконувати будь-яку з наступних дій: повертати порядковий номер Unicode або рядок, щоб зіставити символ з одним або декількома іншими символами; return ``None``, щоб видалити символ із рядка повернення; або викликати виняток :exc:`LookupError`, щоб зіставити символ із собою.

source: ``'i'``
uk: ``'я''``

source: Floating point exponential format (lowercase).
uk: Експоненціальний формат із плаваючою комою (нижній регістр).

source: Floating point exponential format (uppercase).
uk: Експоненціальний формат із плаваючою комою (верхній регістр).

source: Floating point decimal format.
uk: Десятковий формат із плаваючою комою.

source: Floating point format. Uses lowercase exponential format if exponent is less than -4 or not less than precision, decimal format otherwise.
uk: Формат з плаваючою комою. Використовує нижній регістр експоненціального формату, якщо показник степеня менший за -4 або не менший за точність, десятковий формат інакше.

source: Floating point format. Uses uppercase exponential format if exponent is less than -4 or not less than precision, decimal format otherwise.
uk: Формат з плаваючою комою. Використовує експоненціальний формат у верхньому регістрі, якщо показник степеня менший за -4 або не менший за точність, інакше – десятковий формат.

source: If *sep* is given, consecutive delimiters are not grouped together and are deemed to delimit empty subsequences (for example, ``b'1,,2'.split(b',')`` returns ``[b'1', b'', b'2']``). The *sep* argument may consist of a multibyte sequence (for example, ``b'1<>2<>3'.split(b'<>')`` returns ``[b'1', b'2', b'3']``). Splitting an empty sequence with a specified separator returns ``[b'']`` or ``[bytearray(b'')]`` depending on the type of object being split. The *sep* argument may be any :term:`bytes-like object`.
uk: Якщо задано *sep*, послідовні розділювачі не групуються разом і вважаються розмежовуючими порожні підпослідовності (наприклад, ``b'1,,2'.split(b',')`` повертає ``[b'1 ', b'', b'2']``). Аргумент *sep* може складатися з багатобайтової послідовності (наприклад, ``b'1 <> 2 <> 3'.split(b' <> ')`` повертає ``[b'1', b'2', b '3']``). Розділення порожньої послідовності з указаним роздільником повертає ``[b'']`` або ``[bytearray(b'')]`` залежно від типу об’єкта, який розділяється. Аргументом *sep* може бути будь-який :term:`bytes-like object`.

source: Unlike :func:`str.swapcase()`, it is always the case that ``bin.swapcase().swapcase() == bin`` for the binary versions. Case conversions are symmetrical in ASCII, even though that is not generally true for arbitrary Unicode code points.
uk: На відміну від :func:`str.swapcase()`, це завжди так, що ``bin.swapcase().swapcase() == bin`` для бінарних версій. Перетворення регістру є симетричним у ASCII, навіть якщо це зазвичай не вірно для довільних кодових точок Unicode.

source: Bytes (any object that follows the :ref:`buffer protocol <bufferobjects>` or has :meth:`__bytes__`).
uk: Байти (будь-який об’єкт, який відповідає :ref:`протоколу буфера <bufferobjects>` або має :meth:`__bytes__`).

source: Note that, as with floating point numbers, ``v is w`` does *not* imply ``v == w`` for memoryview objects.
uk: Зауважте, що, як і у випадку з числами з плаваючою комою, ``v є w`` *не* означає ``v == w`` для об'єктів memoryview.

source: After this method has been called, any further operation on the view raises a :class:`ValueError` (except :meth:`release()` itself which can be called multiple times)::
uk: Після виклику цього методу будь-яка подальша операція з представленням викликає помилку :class:`ValueError` (крім самого :meth:`release()`, який можна викликати кілька разів)::

source: The destination format is restricted to a single element native format in :mod:`struct` syntax. One of the formats must be a byte format ('B', 'b' or 'c'). The byte length of the result must be the same as the original length.
uk: Цільовий формат обмежується рідним форматом одного елемента в синтаксисі :mod:`struct`. Один із форматів має бути байтовим ("B", "b" або "c"). Довжина результату в байтах має збігатися з вихідною.

source: Note, the *elem* argument to the :meth:`__contains__`, :meth:`remove`, and :meth:`discard` methods may be a set. To support searching for an equivalent frozenset, a temporary one is created from *elem*.
uk: Зауважте, що аргумент *elem* для методів :meth:`__contains__`, :meth:`remove` і :meth:`discard` може бути набором. Щоб підтримувати пошук еквівалентного замороженого набору, тимчасовий набір створюється з *elem*.

source: The exception passed in should never be reraised explicitly - instead, this method should return a false value to indicate that the method completed successfully and does not want to suppress the raised exception. This allows context management code to easily detect whether or not an :meth:`__exit__` method has actually failed.
uk: Переданий виняток ніколи не слід повторно викликати явно — натомість цей метод має повертати значення false, щоб вказати, що метод завершився успішно та не хоче придушувати викликаний виняток. Це дозволяє коду керування контекстом легко визначати, чи метод :meth:`__exit__` фактично не вдався.

source: :ref:`re.Pattern <re-objects>`
uk: :ref:`re.Патерн <re-objects>`

source: :class:`shelve.BsdDbShelf`
uk: :class:`полиця.BsdDbShelf`

source: :class:`shelve.DbfilenameShelf`
uk: :class:`полиця.DbfilenameShelf`

source: :class:`shelve.Shelf`
uk: :class:`полиця.Полиця`

source: However, union objects containing :ref:`parameterized generics <types-genericalias>` cannot be used::
uk: Однак об’єкти об’єднання, що містять :ref:`параметризовані генерики <types-genericalias>`, не можна використовувати:

source: The :meth:`__or__` method for type objects was added to support the syntax ``X | Y``. If a metaclass implements :meth:`__or__`, the Union may override it::
uk: Метод :meth:`__or__` було додано для підтримки синтаксису ``X | Y``. Якщо метаклас реалізує :meth:`__or__`, об’єднання може замінити його::

source: Methods are functions that are called using the attribute notation. There are two flavors: built-in methods (such as :meth:`append` on lists) and class instance methods. Built-in methods are described with the types that support them.
uk: Методи — це функції, які викликаються за допомогою нотації атрибутів. Є два варіанти: вбудовані методи (такі як :meth:`append` у списках) і методи екземплярів класу. Вбудовані методи описані з типами, які їх підтримують.

source: If you access a method (a function defined in a class namespace) through an instance, you get a special object: a :dfn:`bound method` (also called :dfn:`instance method`) object. When called, it will add the ``self`` argument to the argument list. Bound methods have two special read-only attributes: ``m.__self__`` is the object on which the method operates, and ``m.__func__`` is the function implementing the method. Calling ``m(arg-1, arg-2, ..., arg-n)`` is completely equivalent to calling ``m.__func__(m.__self__, arg-1, arg-2, ..., arg-n)``.
uk: Якщо ви отримуєте доступ до методу (функції, визначеної в просторі імен класу) через екземпляр, ви отримуєте спеціальний об’єкт: об’єкт :dfn:`зв’язаний метод` (також званий :dfn:`instance method`). Під час виклику він додасть аргумент ``self`` до списку аргументів. Зв’язані методи мають два спеціальні атрибути лише для читання: ``m.__self__`` - це об'єкт, з яким працює метод, і ``m.__func__`` - це функція, що реалізує метод. Виклик ``m(arg-1, arg-2, ..., arg-n)`` повністю еквівалентний виклику ``m.__func__(m.__self__, arg-1, arg-2, ..., arg-n)``.

source: Like function objects, bound method objects support getting arbitrary attributes. However, since method attributes are actually stored on the underlying function object (``meth.__func__``), setting method attributes on bound methods is disallowed. Attempting to set an attribute on a method results in an :exc:`AttributeError` being raised. In order to set a method attribute, you need to explicitly set it on the underlying function object::
uk: Як і функціональні об’єкти, зв’язані об’єкти методів підтримують отримання довільних атрибутів. Однак, оскільки атрибути методу фактично зберігаються в базовому об’єкті функції (``meth.__func__``), встановлення атрибутів методу для зв’язаних методів заборонено. Спроба встановити атрибут для методу призводить до появи :exc:`AttributeError`. Щоб установити атрибут методу, вам потрібно явно встановити його на базовому об’єкті функції::

source: Code objects are used by the implementation to represent "pseudo-compiled" executable Python code such as a function body. They differ from function objects because they don't contain a reference to their global execution environment. Code objects are returned by the built-in :func:`compile` function and can be extracted from function objects through their :attr:`__code__` attribute. See also the :mod:`code` module.
uk: Об’єкти коду використовуються реалізацією для представлення "псевдокомпільованого" виконуваного коду Python, такого як тіло функції. Вони відрізняються від функціональних об’єктів, оскільки не містять посилання на своє глобальне середовище виконання. Об’єкти коду повертаються вбудованою функцією :func:`compile` і можуть бути витягнуті з об’єктів функції через їх атрибут :attr:`__code__`. Дивіться також модуль :mod:`code`.

source: Accessing ``__code__`` raises an :ref:`auditing event <auditing>` ``object.__getattr__`` with arguments ``obj`` and ``"__code__"``.
uk: Доступ до ``__code__`` викликає :ref:`подію аудиту <auditing>` ``object.__getattr__`` з аргументами ``obj`` і ``"__code__"``.

source: This object is returned from comparisons and binary operations when they are asked to operate on types they don't support. See :ref:`comparisons` for more information. There is exactly one ``NotImplemented`` object. ``type(NotImplemented)()`` produces the singleton instance.
uk: Цей об’єкт повертається з порівнянь і двійкових операцій, коли їх запитують оперувати типами, які вони не підтримують. Перегляньте :ref:`comparisons` для отримання додаткової інформації. Існує рівно один об’єкт ``NotImplemented``. ``type(NotImplemented)()`` створює одиночний екземпляр.

source: It is written as ``NotImplemented``.
uk: Це написано як ``NotImplemented``.

source: See :ref:`types` for this information. It describes stack frame objects, traceback objects, and slice objects.
uk: Перегляньте :ref:`types` цю інформацію. Він описує об’єкти фрейму стека, об’єкти трасування та об’єкти фрагментів.
