Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: fa, ru, uk

source: Precision (optional), given as a ``'.'`` (dot) followed by the precision. If specified as ``'*'`` (an asterisk), the actual precision is read from the next element of the tuple in *values*, and the value to convert comes after the precision.
fa: دقت (اختیاری), به عنوان یک ``'.'`` (نقطه) و به دنبال آن دقت. اگر به عنوان ``'*'`` (ستاره) مشخص شود، دقت واقعی از عنصر بعدی تاپل در *values* خوانده می شود و مقدار تبدیل پس از دقت می آید.
ru: Точность (необязательно), заданная как ``'.'`` (точка), за которой следует точность. Если указано как ``'*'`` (звездочка), фактическая точность считывается из следующего элемента кортежа в *values*, а преобразуемое значение идет после точности.
uk: Точність (необов’язкова), подається як ``'.'`` (крапка), за якою йде точність. Якщо вказано як ``'*'`` (зірочка), фактична точність зчитується з наступного елемента кортежу в *значеннях*, а значення для перетворення йде після точності.

source: Length modifier (optional).
fa: اصلاح کننده طول (اختیاری).
ru: Модификатор длины (необязательно).
uk: Модифікатор довжини (необов'язково).

source: Conversion type.
fa: نوع تبدیل
ru: Тип приведения.
uk: Тип перетворення.

source: When the right argument is a dictionary (or other mapping type), then the formats in the string *must* include a parenthesised mapping key into that dictionary inserted immediately after the ``'%'`` character. The mapping key selects the value to be formatted from the mapping. For example:
fa: هنگامی که آرگومان مناسب یک فرهنگ لغت (یا نوع نقشه برداری دیگر) باشد، فرمت های رشته *must* شامل یک کلید نگاشت پرانتز شده در آن فرهنگ لغت است که بلافاصله بعد از کاراکتر ``'%'`` درج می شود. کلید نگاشت مقداری را که باید قالب بندی شود از نقشه برداری انتخاب می کند. به عنوان مثال:
ru: Если правым аргументом является словарь (или другой тип сопоставления), тогда форматы в строке *должны* включать заключенный в круглые скобки ключ сопоставления в этот словарь, вставленный сразу после ``'%'`` характер. Ключ сопоставления выбирает значение для форматирования из сопоставления. Например:
uk: Якщо правильний аргумент є словником (або іншим типом відображення), то формати в рядку *мають* містити ключ відображення в дужках у цьому словнику, вставлений одразу після символу ``'%'``. Ключ відображення вибирає значення, яке потрібно відформатувати, із відображення. Наприклад:

source: In this case no ``*`` specifiers may occur in a format (since they require a sequential parameter list).
fa: در این مورد هیچ مشخص کننده ``*`` ممکن است در یک قالب وجود نداشته باشد (زیرا آنها به یک لیست پارامترهای متوالی نیاز دارند).
ru: В данном случае нет ``*`` спецификаторы могут встречаться в формате (поскольку они требуют последовательного списка параметров).
uk: У цьому випадку у форматі не може бути специфікаторів ``*`` (оскільки вони вимагають послідовного списку параметрів).

source: The conversion flag characters are:
fa: کاراکترهای پرچم تبدیل عبارتند از:
ru: Символы флага преобразования:
uk: Символи прапора перетворення:

source: Flag
fa: پرچم
ru: Флаг
uk: Прапор

source: The value conversion will use the "alternate form" (where defined below).
fa: تبدیل مقدار از "فرم جایگزین" (جایی که در زیر تعریف شده است) استفاده می کند.
ru: Преобразование значений будет использовать «альтернативную форму» (если это определено ниже).
uk: Перетворення значень використовуватиме "альтернативну форму" (де визначено нижче).

source: The conversion will be zero padded for numeric values.
fa: برای مقادیر عددی، تبدیل صفر خواهد شد.
ru: Преобразование будет дополнено нулями для числовых значений.
uk: Перетворення буде доповнено нулем для числових значень.

source: The converted value is left adjusted (overrides the ``'0'`` conversion if both are given).
fa: مقدار تبدیل شده تنظیم می شود (اگر هر دو داده شوند, تبدیل ``'0'`` را لغو می کند).
ru: Преобразованное значение остается скорректированным (переопределяет ``'0'`` преобразование, если даны оба).
uk: Перетворене значення коригується зліва (перевизначає перетворення ``'0'``, якщо подано обидва значення).

source: (a space) A blank should be left before a positive number (or empty string) produced by a signed conversion.
fa: (یک فاصله) باید قبل از یک عدد مثبت (یا رشته خالی) که توسط یک تبدیل امضا شده ایجاد می شود، یک خالی گذاشته شود.
ru: (пробел) Перед положительным числом (или пустой строкой), полученным в результате знакового преобразования, следует оставить пробел.
uk: (пробіл) Пробіл слід залишити перед додатним числом (або порожнім рядком), утвореним перетворенням зі знаком.

source: A sign character (``'+'`` or ``'-'``) will precede the conversion (overrides a "space" flag).
fa: یک کاراکتر علامت (``'+'`` یا ``'-'``) قبل از تبدیل قرار می گیرد (پرچم "فضا" را لغو می کند).
ru: Знаковый персонаж ( ``'+'`` или ``'-'`` ) будет предшествовать преобразованию (переопределяет флаг «пробел»).
uk: Символ знака (``'+'`` або ``'-'``) передуватиме перетворенню (перевизначає позначку "пробіл").

source: A length modifier (``h``, ``l``, or ``L``) may be present, but is ignored as it is not necessary for Python -- so e.g. ``%ld`` is identical to ``%d``.
fa: یک اصلاح کننده طول (``h``, ``l`` یا ``L``) ممکن است وجود داشته باشد، اما نادیده گرفته می شود زیرا برای پایتون ضروری نیست - به عنوان مثال. ``%ld`` با ``%d`` یکسان است.
ru: Модификатор длины ( ``ч`` , ``л`` , или ``Л`` ) может присутствовать, но игнорируется, поскольку в нем нет необходимости для Python, например ``%ld`` идентичен ``%d`` .
uk: Модифікатор довжини (``h``, ``l`` або ``L``) може бути присутнім, але він ігнорується, оскільки він не є необхідним для Python - так, напр. ``%ld`` ідентичний ``%d``.

source: The conversion types are:
fa: انواع تبدیل عبارتند از:
ru: Типы конверсий:
uk: Типи перетворення:

source: Conversion
fa: تبدیل
ru: Конверсия
uk: Перетворення

source: Signed integer decimal.
fa: عدد صحیح اعشاری امضا شده
ru: Целое десятичное число со знаком.
uk: Ціле десяткове число зі знаком.

source: Signed octal value.
fa: مقدار هشتی امضا شده
ru: Восьмеричное значение со знаком.
uk: Вісімкове значення зі знаком.

source: Obsolete type -- it is identical to ``'d'``.
fa: نوع منسوخ -- با ``'d'`` یکسان است.
ru: Устаревший тип -- он идентичен ``'d'`` .
uk: Застарілий тип -- він ідентичний ``'d'``.

source: Signed hexadecimal (lowercase).
fa: هگزادسیمال امضا شده (حروف کوچک).
ru: Шестнадцатеричное число со знаком (строчная буква).
uk: Шістнадцяткове число зі знаком (нижній регістр).

source: Signed hexadecimal (uppercase).
fa: هگزادسیمال امضا شده (بزرگ).
ru: Шестнадцатеричное число со знаком (заглавные буквы).
uk: Шістнадцяткове число зі знаком (верхній регістр).

source: Floating-point exponential format (lowercase).
fa: فرمت نمایی ممیز شناور (کوچک).

source: Floating-point exponential format (uppercase).
fa: فرمت نمایی ممیز شناور (بزرگ).

source: Floating-point decimal format.
fa: فرمت اعشاری ممیز شناور.

source: Floating-point format. Uses lowercase exponential format if exponent is less than -4 or not less than precision, decimal format otherwise.
fa: فرمت ممیز شناور اگر نما کمتر از 4- باشد یا از دقت کمتر نباشد، از قالب نمایی کوچک استفاده می کند، در غیر این صورت از قالب اعشاری استفاده می کند.

source: Floating-point format. Uses uppercase exponential format if exponent is less than -4 or not less than precision, decimal format otherwise.
fa: فرمت ممیز شناور اگر نما کمتر از -4 یا کمتر از دقت نباشد، از قالب نمایی بزرگ استفاده می کند، در غیر این صورت از قالب اعشاری استفاده می کند.

source: Single character (accepts integer or single character string).
fa: تک کاراکتر (رشته اعداد صحیح یا تک کاراکتری را می پذیرد).
ru: Одиночный символ (принимает целое число или строку из одного символа).
uk: Один символ (приймає рядок цілих чи односимвольних символів).

source: String (converts any Python object using :func:`repr`).
fa: رشته (هر شی پایتون را با استفاده از :func:`repr` تبدیل می کند).
ru: String (преобразует любой объект Python, используя :func:`repr` ).
uk: Рядок (перетворює будь-який об’єкт Python за допомогою :func:`repr`).

source: String (converts any Python object using :func:`str`).
fa: رشته (هر شی پایتون را با استفاده از :func:`str` تبدیل می کند).
ru: String (преобразует любой объект Python, используя :func:`str` ).
uk: Рядок (перетворює будь-який об’єкт Python за допомогою :func:`str`).

source: String (converts any Python object using :func:`ascii`).
fa: رشته (هر شی پایتون را با استفاده از :func:`ascii` تبدیل می کند).
ru: String (преобразует любой объект Python, используя :func:`ascii` ).
uk: Рядок (перетворює будь-який об’єкт Python за допомогою :func:`ascii`).

source: No argument is converted, results in a ``'%'`` character in the result.
fa: هیچ آرگومانی تبدیل نمی شود، در نتیجه یک کاراکتر ``'%'`` ایجاد می شود.
ru: Никакой аргумент не преобразуется, в результате ``'%'`` характер результата.
uk: Жоден аргумент не перетворюється, результатом є символ ``'%'`` в результаті.

source: The alternate form causes a leading octal specifier (``'0o'``) to be inserted before the first digit.
fa: شکل متناوب باعث می شود که یک مشخص کننده هشتی پیشرو (``'0o'``) قبل از رقم اول درج شود.
ru: Альтернативная форма приводит к использованию ведущего восьмеричного спецификатора ( ``'0о'`` ), который нужно вставить перед первой цифрой.
uk: Альтернативна форма призводить до того, що початковий вісімковий специфікатор (``'0o'``) буде вставлено перед першою цифрою.

source: The alternate form causes a leading ``'0x'`` or ``'0X'`` (depending on whether the ``'x'`` or ``'X'`` format was used) to be inserted before the first digit.
fa: فرم جایگزین باعث می شود که یک ``'0x'`` یا ``'0X'`` پیشرو (بسته به اینکه از فرمت ``'x'`` یا ``'X'`` استفاده شده است) قبل از رقم اول درج شود.
ru: Альтернативная форма вызывает ведущее ``'0x'`` или ``'0X'`` (в зависимости от того, ``'х'`` или ``'Х'`` использовался формат) для вставки перед первой цифрой.
uk: Альтернативна форма призводить до того, що початковий ``'0x'`` або ``'0X'`` (залежно від того, використовувався формат ``'x'`` або ``'X'``) буде вставлено перед перша цифра.

source: The alternate form causes the result to always contain a decimal point, even if no digits follow it.
fa: شکل جایگزین باعث می شود که نتیجه همیشه دارای یک نقطه اعشار باشد، حتی اگر هیچ رقمی از آن پیروی نکند.
ru: Альтернативная форма приводит к тому, что результат всегда содержит десятичную точку, даже если за ней не следуют никакие цифры.
uk: Альтернативна форма призводить до того, що результат завжди містить десяткову крапку, навіть якщо за нею не йде цифра.

source: The precision determines the number of digits after the decimal point and defaults to 6.
fa: دقت تعداد ارقام بعد از نقطه اعشار را تعیین می کند و به طور پیش فرض 6 است.
ru: Точность определяет количество цифр после десятичной точки и по умолчанию равна 6.
uk: Точність визначає кількість цифр після коми та за замовчуванням дорівнює 6.

source: The alternate form causes the result to always contain a decimal point, and trailing zeroes are not removed as they would otherwise be.
fa: شکل متناوب باعث می شود که نتیجه همیشه دارای یک نقطه اعشار باشد و صفرهای انتهایی آنطور که در غیر این صورت حذف می شدند حذف نمی شوند.
ru: Альтернативная форма приводит к тому, что результат всегда содержит десятичную точку, а конечные нули не удаляются, как это было бы в противном случае.
uk: Альтернативна форма призводить до того, що результат завжди містить десяткову кому, а кінцеві нулі не видаляються, як це було б інакше.

source: The precision determines the number of significant digits before and after the decimal point and defaults to 6.
fa: دقت، تعداد ارقام مهم قبل و بعد از اعشار را تعیین می کند و 6 را به طور پیش فرض تعیین می کند.
ru: Точность определяет количество значащих цифр до и после десятичной точки и по умолчанию равна 6.
uk: Точність визначає кількість значущих цифр до та після десяткової коми та за умовчанням дорівнює 6.

source: If precision is ``N``, the output is truncated to ``N`` characters.
fa: اگر دقت ``N`` باشد، خروجی به نویسه ``N`` کوتاه می شود.
ru: Если точность ``Н`` , вывод усекается до ``Н`` персонажи.
uk: Якщо точність ``N``, вивід скорочується до ``N`` символів.

source: See :pep:`237`.
fa: :pep:`237` را ببینید.
ru: См. :pep:`237`.
uk: Дивіться :pep:`237`.

source: Since Python strings have an explicit length, ``%s`` conversions do not assume that ``'\0'`` is the end of the string.
fa: از آنجایی که رشته‌های پایتون دارای طول صریح هستند، تبدیل‌های ``%s`` فرض نمی‌کنند که ``'\0'`` انتهای رشته است.
ru: Поскольку строки Python имеют явную длину, ``%s`` преобразования не предполагают, что ``'\0'`` это конец строки.
uk: Оскільки рядки Python мають явну довжину, перетворення ``%s`` не припускають, що ``'\0`` є кінцем рядка.

source: ``%f`` conversions for numbers whose absolute value is over 1e50 are no longer replaced by ``%g`` conversions.
fa: تبدیل‌های ``%f`` برای اعدادی که قدر مطلق آنها بیش از 1e50 است، دیگر با تبدیل‌های ``%g`` جایگزین نمی‌شوند.
ru: ``%f`` преобразования для чисел, абсолютное значение которых превышает 1e50, больше не заменяются на ``%g`` конверсии.
uk: Перетворення ``%f`` для чисел, абсолютне значення яких перевищує 1e50, більше не замінюються перетвореннями ``%g``.

source: Binary Sequence Types --- :class:`bytes`, :class:`bytearray`, :class:`memoryview`
fa: انواع توالی باینری --- :class:`bytes`, :class:`bytearray`, :class:`memoryview`
ru: Типы двоичных последовательностей --- :class:`байты` , :class:`bytearray` , :class:`memoryview`
uk: Типи бінарних послідовностей --- :class:`bytes`, :class:`bytearray`, :class:`memoryview`

source: The core built-in types for manipulating binary data are :class:`bytes` and :class:`bytearray`. They are supported by :class:`memoryview` which uses the :ref:`buffer protocol <bufferobjects>` to access the memory of other binary objects without needing to make a copy.
fa: انواع داخلی داخلی برای دستکاری داده های باینری :class:`bytes` و :class:`bytearray` هستند. آنها توسط :class:`memoryview` پشتیبانی می شوند که از :ref:`buffer protocol <bufferobjects>` برای دسترسی به حافظه سایر اشیاء باینری بدون نیاز به کپی استفاده می کند.
ru: Основные встроенные типы для управления двоичными данными: :class:`байты` и :class:`bytearray` . Их поддерживают :class:`memoryview` который использует протокол :ref:`buffer ` для доступа к памяти других двоичных объектов без необходимости создания копии.
uk: Основними вбудованими типами для обробки двійкових даних є :class:`bytes` і :class:`bytearray`. Вони підтримуються :class:`memoryview`, який використовує :ref:`протокол буфера <bufferobjects>` для доступу до пам’яті інших бінарних об’єктів без необхідності створення копії.

source: The :mod:`array` module supports efficient storage of basic data types like 32-bit integers and IEEE754 double-precision floating values.
fa: ماژول :mod:`array` از ذخیره سازی کارآمد انواع داده های پایه مانند اعداد صحیح 32 بیتی و مقادیر شناور با دقت دوگانه IEEE754 پشتیبانی می کند.
ru: The :mod:`массив` Модуль поддерживает эффективное хранение базовых типов данных, таких как 32-битные целые числа и плавающие значения двойной точности IEEE754.
uk: Модуль :mod:`array` підтримує ефективне зберігання основних типів даних, таких як 32-розрядні цілі числа та плаваючі значення подвійної точності IEEE754.

source: Bytes Objects
fa: اشیاء بایت
ru: Байтовые объекты
uk: Об'єкти Bytes

source: Bytes objects are immutable sequences of single bytes. Since many major binary protocols are based on the ASCII text encoding, bytes objects offer several methods that are only valid when working with ASCII compatible data and are closely related to string objects in a variety of other ways.
fa: اشیاء بایت دنباله های تغییرناپذیری از تک بایت ها هستند. از آنجایی که بسیاری از پروتکل‌های دودویی اصلی مبتنی بر رمزگذاری متن ASCII هستند، اشیاء بایت روش‌های مختلفی را ارائه می‌دهند که فقط در هنگام کار با داده‌های سازگار با ASCII معتبر هستند و از طرق مختلف دیگر با اشیاء رشته‌ای مرتبط هستند.
ru: Объекты Bytes представляют собой неизменяемые последовательности отдельных байтов. Поскольку многие основные двоичные протоколы основаны на текстовой кодировке ASCII, объекты bytes предлагают несколько методов, которые действительны только при работе с данными, совместимыми с ASCII, и тесно связаны со строковыми объектами множеством других способов.
uk: Об’єкти Bytes — це незмінні послідовності окремих байтів. Оскільки багато основних двійкових протоколів базуються на текстовому кодуванні ASCII, об’єкти bytes пропонують кілька методів, які дійсні лише під час роботи з даними, сумісними з ASCII, і тісно пов’язані з рядковими об’єктами різними способами.

source: Firstly, the syntax for bytes literals is largely the same as that for string literals, except that a ``b`` prefix is added:
fa: اولاً، نحو برای بایت‌ها تا حد زیادی شبیه به حرف‌های رشته‌ای است، با این تفاوت که پیشوند ``b`` اضافه می‌شود:
ru: Во-первых, синтаксис байтовых литералов во многом такой же, как и для строковых литералов, за исключением того, что ``б`` добавлен префикс:
uk: По-перше, синтаксис байтових літералів здебільшого такий самий, як і для рядкових літералів, за винятком того, що додано префікс ``b``:

source: Single quotes: ``b'still allows embedded "double" quotes'``
fa: نقل قول تک: ``b'still allows embedded "double" quotes'``
ru: Одиночные кавычки: ``b'still allows embedded "double" quotes'``
uk: Одинарні лапки: ``b'все ще дозволяє вбудовані "подвійні" лапки``

source: Double quotes: ``b"still allows embedded 'single' quotes"``
fa: دو نقل قول: ``b"still allows embedded 'single' quotes"``
ru: Двойные кавычки: ``b"still allows embedded 'single' quotes"``
uk: Подвійні лапки: ``b"все ще дозволяє вбудовані 'одинарні' лапки``

source: Triple quoted: ``b'''3 single quotes'''``, ``b"""3 double quotes"""``
fa: نقل قول سه گانه: ``b'''3 single quotes'''``، ``b"""3 double quotes"""``
ru: Тройное цитирование: ``b'''3 single quotes'''``, ``b"""3 double quotes"""``
uk: Потрійні лапки: ``b''''3 одинарні лапки''''``, ``b"""3 подвійні лапки"""``

source: Only ASCII characters are permitted in bytes literals (regardless of the declared source code encoding). Any binary values over 127 must be entered into bytes literals using the appropriate escape sequence.
fa: فقط کاراکترهای ASCII به معنای واقعی کلمه مجاز هستند (صرف نظر از رمزگذاری کد منبع اعلام شده). هر مقدار باینری بیش از 127 باید با استفاده از دنباله فرار مناسب در بایت ها وارد شود.
ru: В байтовых литералах разрешены только символы ASCII (независимо от заявленной кодировки исходного кода). Любые двоичные значения больше 127 необходимо вводить в байтовые литералы, используя соответствующую escape-последовательность.
uk: У байтових літералах дозволені лише символи ASCII (незалежно від оголошеного кодування вихідного коду). Будь-які двійкові значення понад 127 потрібно вводити в байтові літерали за допомогою відповідної керуючої послідовності.

source: As with string literals, bytes literals may also use a ``r`` prefix to disable processing of escape sequences. See :ref:`strings` for more about the various forms of bytes literal, including supported escape sequences.
fa: همانند رشته‌های literal، بایت‌ها نیز ممکن است از پیشوند ``r`` برای غیرفعال کردن پردازش دنباله‌های فرار استفاده کنند. برای اطلاعات بیشتر در مورد اشکال مختلف بایت ها، از جمله توالی های فرار پشتیبانی شده، به :ref:`strings` مراجعه کنید.
ru: Как и строковые литералы, байтовые литералы также могут использовать ``р`` префикс для отключения обработки escape-последовательностей. Видеть :ref:`строки` подробнее о различных формах байтовых литералов, включая поддерживаемые escape-последовательности.
uk: Як і рядкові літерали, літерали bytes також можуть використовувати префікс ``r``, щоб вимкнути обробку керуючих послідовностей. Перегляньте :ref:`strings`, щоб дізнатися більше про різні форми літералів байтів, включаючи підтримувані керуючі послідовності.

source: While bytes literals and representations are based on ASCII text, bytes objects actually behave like immutable sequences of integers, with each value in the sequence restricted such that ``0 <= x < 256`` (attempts to violate this restriction will trigger :exc:`ValueError`). This is done deliberately to emphasise that while many binary formats include ASCII based elements and can be usefully manipulated with some text-oriented algorithms, this is not generally the case for arbitrary binary data (blindly applying text processing algorithms to binary data formats that are not ASCII compatible will usually lead to data corruption).
fa: در حالی که واژه‌ها و نمایش‌های بایت‌ها بر اساس متن ASCII هستند، اشیاء بایت‌ها در واقع مانند دنباله‌های غیرقابل تغییر اعداد صحیح رفتار می‌کنند، با هر مقدار در دنباله محدود به‌گونه‌ای که ``0 <= x < 256`` (تلاش برای نقض این محدودیت باعث تحریک :exc:`ValueError` می‌شود). این کار عمداً برای تأکید بر این نکته انجام می‌شود که در حالی که بسیاری از فرمت‌های باینری شامل عناصر مبتنی بر ASCII هستند و می‌توان آن‌ها را با برخی از الگوریتم‌های متن‌محور به‌طور مفید دستکاری کرد، این معمولاً برای داده‌های باینری دلخواه صدق نمی‌کند (استفاده کورکورانه از الگوریتم‌های پردازش متن برای قالب‌های داده باینری که با ASCII سازگار نیستند, معمولاً منجر به خراب شدن داده‌ها می‌شود).
ru: В то время как литералы и представления байтов основаны на тексте ASCII, объекты байтов фактически ведут себя как неизменяемые последовательности целых чисел, при этом каждое значение в последовательности ограничено таким образом, что ``0 <= x < 256`` (попытки нарушить это ограничение вызовут :exc:`ValueError` ). Это сделано намеренно, чтобы подчеркнуть, что, хотя многие двоичные форматы включают элементы на основе ASCII и ими можно с пользой манипулировать с помощью некоторых тексто-ориентированных алгоритмов, обычно это не относится к произвольным двоичным данным (слепое применение алгоритмов обработки текста к форматам двоичных данных, которые не являются Совместимость с ASCII обычно приводит к повреждению данных).
uk: У той час як байтові літерали та представлення базуються на тексті ASCII, об’єкти байтів фактично поводяться як незмінні послідовності цілих чисел, де кожне значення в послідовності обмежено таким чином, що ``0 <= x < 256`` (спроби порушити це обмеження викличуть :exc:`ValueError`). Це зроблено навмисно, щоб підкреслити, що хоча багато двійкових форматів включають елементи на основі ASCII і ними можна корисно маніпулювати за допомогою деяких текстово-орієнтованих алгоритмів, це зазвичай не стосується довільних двійкових даних (сліпе застосування алгоритмів обробки тексту до двійкових форматів даних, які не Сумісність із ASCII зазвичай призводить до пошкодження даних).

source: In addition to the literal forms, bytes objects can be created in a number of other ways:
fa: علاوه بر اشکال تحت اللفظی، اشیاء بایت را می توان به روش های دیگری نیز ایجاد کرد:
ru: Помимо литеральных форм, объекты bytes можно создавать и другими способами:
uk: Окрім літеральних форм, об’єкти bytes можна створювати кількома іншими способами:

source: A zero-filled bytes object of a specified length: ``bytes(10)``
fa: یک شی بایت پر از صفر با طول مشخص: ``bytes(10)``
ru: Объект указанной длины с нулевым заполнением байтов: ``байты(10)``
uk: Об’єкт із заповненими нулем байтами вказаної довжини: ``bytes(10)``

source: From an iterable of integers: ``bytes(range(20))``
fa: از یک تکرارپذیر از اعداد صحیح: ``bytes(range(20))``
ru: Объект указанной длины с нулевым заполнением байтов: ``байты(10)``
uk: З ітерації цілих чисел: ``bytes(range(20))``

source: Copying existing binary data via the buffer protocol: ``bytes(obj)``
fa: کپی کردن داده های باینری موجود از طریق پروتکل بافر: ``bytes(obj)``
ru: Копирование существующих двоичных данных через протокол буфера: ``байты(obj)``
uk: Копіювання існуючих двійкових даних через протокол буфера: ``bytes(obj)``

source: Also see the :ref:`bytes <func-bytes>` built-in.
fa: همچنین :ref:`bytes <func-bytes>` داخلی را ببینید.
ru: Также см. :ref:`bytes ` встроенный.
uk: Також перегляньте вбудований :ref:`bytes <func-bytes>`.
