Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: fa, ru, uk

source: Concatenating immutable sequences always results in a new object. This means that building up a sequence by repeated concatenation will have a quadratic runtime cost in the total sequence length. To get a linear runtime cost, you must switch to one of the alternatives below:
fa: پیوستن دنباله های تغییرناپذیر همیشه منجر به یک شی جدید می شود. این بدان معنی است که ساخت یک دنباله با الحاق مکرر هزینه زمان اجرا درجه دوم در طول کل دنباله خواهد داشت. برای دریافت هزینه زمان اجرا خطی، باید به یکی از گزینه های زیر بروید:
ru: Объединение неизменяемых последовательностей всегда приводит к созданию нового объекта. Это означает, что построение последовательности путем повторной конкатенации будет иметь квадратичные затраты времени выполнения по отношению к общей длине последовательности. Чтобы получить линейную стоимость времени выполнения, необходимо переключиться на одну из альтернатив ниже:
uk: Конкатенація незмінних послідовностей завжди призводить до нового об’єкта. Це означає, що створення послідовності шляхом повторної конкатенації матиме квадратичну вартість виконання в загальній довжині послідовності. Щоб отримати лінійну вартість роботи, ви повинні перейти до однієї з наведених нижче альтернатив:

source: if concatenating :class:`str` objects, you can build a list and use :meth:`str.join` at the end or else write to an :class:`io.StringIO` instance and retrieve its value when complete
fa: اگر اشیاء :class:`str` را به هم متصل کنید، می توانید یک لیست بسازید و در پایان از :meth:`str.join` استفاده کنید یا در غیر این صورت در یک نمونه :class:`io.StringIO` بنویسید و پس از تکمیل مقدار آن را بازیابی کنید.
ru: если объединить :class:`str` объекты, вы можете создать список и использовать :meth:`str.join` в конце или напишите :class:`io.StringIO` экземпляр и получить его значение после завершения
uk: якщо конкатенувати об’єкти :class:`str`, ви можете створити список і використовувати :meth:`str.join` наприкінці або записати в екземпляр :class:`io.StringIO` і отримати його значення після завершення

source: if concatenating :class:`bytes` objects, you can similarly use :meth:`bytes.join` or :class:`io.BytesIO`, or you can do in-place concatenation with a :class:`bytearray` object. :class:`bytearray` objects are mutable and have an efficient overallocation mechanism
fa: اگر اشیاء :class:`bytes` را به هم متصل کنید، می توانید به طور مشابه از :meth:`bytes.join` یا :class:`io.BytesIO` استفاده کنید، یا می توانید الحاق در محل با یک شی :class:`bytearray` انجام دهید. اشیاء :class:`bytearray` قابل تغییر هستند و مکانیسم تخصیص بیش از حد کارآمدی دارند
ru: если объединить :class:`байты` объекты, вы можете аналогичным образом использовать :meth:`bytes.join` или :class:`io.BytesIO` или вы можете выполнить объединение на месте с помощью :class:`bytearray` объект. :class:`bytearray` объекты изменяемы и имеют эффективный механизм перераспределения
uk: якщо конкатенація об’єктів :class:`bytes`, ви можете так само використовувати :meth:`bytes.join` або :class:`io.BytesIO`, або ви можете виконати конкатенацію на місці з об’єктом :class:`bytearray`. Об’єкти :class:`bytearray` є змінними та мають ефективний механізм загального розподілу

source: if concatenating :class:`tuple` objects, extend a :class:`list` instead
fa: اگر اشیاء :class:`tuple` را به هم متصل کنید، به جای آن یک :class:`list` را گسترش دهید
ru: если объединить :class:`кортеж` объекты, расширить :class:`список` вместо
uk: якщо конкатенація об’єктів :class:`tuple`, замість цього розширте :class:`list`

source: for other types, investigate the relevant class documentation
fa: برای انواع دیگر، مستندات کلاس مربوطه را بررسی کنید
ru: для других типов изучите соответствующую документацию по классу
uk: для інших типів дослідіть відповідну документацію класу

source: Some sequence types (such as :class:`range`) only support item sequences that follow specific patterns, and hence don't support sequence concatenation or repetition.
fa: برخی از انواع توالی (مانند :class:`range`) فقط از دنباله آیتم هایی پشتیبانی می کنند که از الگوهای خاصی پیروی می کنند، و از این رو از الحاق یا تکرار دنباله پشتیبانی نمی کنند.
ru: Некоторые типы последовательностей (например, :class:`диапазон` ) поддерживают только последовательности элементов, соответствующие определенным шаблонам, и, следовательно, не поддерживают конкатенацию или повторение последовательностей.
uk: Деякі типи послідовностей (наприклад, :class:`range`) підтримують лише послідовності елементів, які відповідають певним шаблонам, і, отже, не підтримують конкатенацію або повторення послідовності.

source: ``index`` raises :exc:`ValueError` when *x* is not found in *s*. Not all implementations support passing the additional arguments *i* and *j*. These arguments allow efficient searching of subsections of the sequence. Passing the extra arguments is roughly equivalent to using ``s[i:j].index(x)``, only without copying any data and with the returned index being relative to the start of the sequence rather than the start of the slice.
fa: هنگامی که *x* در *s* یافت نمی شود، ``index`` :exc:`ValueError` را افزایش می دهد. همه پیاده سازی ها از ارسال آرگومان های اضافی *i* و *j* پشتیبانی نمی کنند. این آرگومان‌ها امکان جستجوی مؤثر زیربخش‌های دنباله را فراهم می‌کنند. ارسال آرگومان‌های اضافی تقریباً معادل استفاده از ``s[i:j].index(x)`` است، فقط بدون کپی کردن هیچ داده‌ای و با ایندکس بازگشتی نسبت به شروع دنباله به جای شروع برش.
ru: ``индекс`` поднимает :exc:`ValueError` когда *x* не найден в *s*. Не все реализации поддерживают передачу дополнительных аргументов *i* и *j*. Эти аргументы позволяют эффективно искать подразделы последовательности. Передача дополнительных аргументов примерно эквивалентна использованию ``s[i:j].index(x)`` , только без копирования каких-либо данных и с возвращаемым индексом, относящимся к началу последовательности, а не к началу среза.
uk: ``index`` викликає :exc:`ValueError`, коли *x* не знайдено в *s*. Не всі реалізації підтримують передачу додаткових аргументів *i* і *j*. Ці аргументи дозволяють здійснювати ефективний пошук підрозділів послідовності. Передача додаткових аргументів приблизно еквівалентна використанню ``s[i:j].index(x)``, тільки без копіювання будь-яких даних і з повернутим індексом відносно початку послідовності, а не початку фрагмента. .

source: Immutable Sequence Types
fa: انواع توالی تغییرناپذیر
ru: Неизменяемые типы последовательностей
uk: Незмінні типи послідовностей

source: The only operation that immutable sequence types generally implement that is not also implemented by mutable sequence types is support for the :func:`hash` built-in.
fa: تنها عملیاتی که انواع توالی غیرقابل تغییر معمولاً اجرا می‌کنند و توسط انواع توالی تغییرپذیر نیز اجرا نمی‌شود، پشتیبانی از :func:`hash` داخلی است.
ru: Единственная операция, которую обычно реализуют неизменяемые типы последовательностей и которая не реализуется также изменяемыми типами последовательностей, — это поддержка :func:`хэш` встроенный.
uk: Єдина операція, яку зазвичай реалізують незмінні типи послідовностей, яка також не реалізована змінними типами послідовностей, це підтримка вбудованого :func:`hash`.

source: This support allows immutable sequences, such as :class:`tuple` instances, to be used as :class:`dict` keys and stored in :class:`set` and :class:`frozenset` instances.
fa: این پشتیبانی به دنباله های تغییرناپذیر مانند نمونه های :class:`tuple` اجازه می دهد تا به عنوان کلیدهای :class:`dict` استفاده شوند و در نمونه های :class:`set` و :class:`frozenset` ذخیره شوند.
ru: Эта поддержка позволяет использовать неизменяемые последовательности, такие как :class:`кортеж` экземпляры, которые будут использоваться в качестве :class:`dict` ключи и храниться в :класс:`набор` и :class:`frozenset` экземпляры.
uk: Ця підтримка дозволяє використовувати незмінні послідовності, такі як екземпляри :class:`tuple`, як ключі :class:`dict` і зберігати їх у екземплярах :class:`set` і :class:`frozenset`.

source: Attempting to hash an immutable sequence that contains unhashable values will result in :exc:`TypeError`.
fa: تلاش برای هش کردن یک دنباله غیرقابل تغییر که حاوی مقادیر غیرقابل درهم سازی است منجر به :exc:`TypeError` می شود.
ru: Попытка хешировать неизменяемую последовательность, содержащую нехешируемые значения, приведет к :exc:`TypeError` .
uk: Спроба хешувати незмінну послідовність, яка містить нехешовані значення, призведе до :exc:`TypeError`.

source: Mutable Sequence Types
fa: انواع توالی قابل تغییر
ru: Изменяемые типы последовательностей
uk: Змінні типи послідовностей

source: The operations in the following table are defined on mutable sequence types. The :class:`collections.abc.MutableSequence` ABC is provided to make it easier to correctly implement these operations on custom sequence types.
fa: عملیات در جدول زیر بر روی انواع توالی قابل تغییر تعریف شده است. :class:`collections.abc.MutableSequence` ABC برای سهولت اجرای صحیح این عملیات در انواع توالی سفارشی ارائه شده است.
ru: Операции в следующей таблице определены для изменяемых типов последовательностей. :class:`collections.abc.MutableSequence` ABC предусмотрен для упрощения правильной реализации этих операций над пользовательскими типами последовательностей.
uk: Операції в наведеній нижче таблиці визначено для змінних типів послідовностей. :class:`collections.abc.MutableSequence` ABC надається, щоб спростити правильну реалізацію цих операцій у настроюваних типах послідовностей.

source: In the table *s* is an instance of a mutable sequence type, *t* is any iterable object and *x* is an arbitrary object that meets any type and value restrictions imposed by *s* (for example, :class:`bytearray` only accepts integers that meet the value restriction ``0 <= x <= 255``).
fa: در جدول *s* نمونه ای از یک نوع توالی قابل تغییر است، *t* هر شیء قابل تکرار است و *x* یک شی دلخواه است که هر نوع و مقدار محدودیت اعمال شده توسط *s* را برآورده می کند (به عنوان مثال, :class:`bytearray` فقط اعداد صحیحی را می پذیرد که دارای محدودیت مقدار ``0 <= x <= 255`` باشند).
ru: В таблице *s* — это экземпляр изменяемого типа последовательности, *t* — любой итерируемый объект, а *x* — произвольный объект, который соответствует любым ограничениям типа и значения, налагаемым *s* (например, :class:`bytearray` принимает только целые числа, соответствующие ограничению значения ``0 <= x <= 255`` ).
uk: У таблиці *s* є екземпляром змінного типу послідовності, *t* є будь-яким ітерованим об’єктом, а *x* є довільним об’єктом, який відповідає будь-яким обмеженням типу та значення, накладеним *s* (наприклад, :class:`bytearray` приймає лише цілі числа, які відповідають обмеженню значення ``0 <= x <= 255``).

source: item *i* of *s* is replaced by *x*
fa: مورد *i* از *s* با *x* جایگزین شده است
ru: элемент *i* из *s* заменяется на *x*
uk: пункт *i* з *s* замінено на *x*

source: slice of *s* from *i* to *j* is replaced by the contents of the iterable *t*
fa: تکه ای از *s* از *i* به *j* با محتویات *t* قابل تکرار جایگزین می شود.
ru: фрагмент *s* от *i* до *j* заменяется содержимым итерируемого *t*
uk: фрагмент *s* від *i* до *j* замінюється вмістом ітерованого *t*

source: same as ``s[i:j] = []``
fa: همانند ``s[i:j] = []``
ru: то же, что ``s[i:j] = []``
uk: те саме, що ``s[i:j] = []``

source: the elements of ``s[i:j:k]`` are replaced by those of *t*
fa: عناصر ``s[i:j:k]`` با عناصر *t* جایگزین می شوند
ru: элементы ``s[i:j:k]`` заменяются на *t*
uk: елементи ``s[i:j:k]`` замінюються на елементи *t*

source: removes the elements of ``s[i:j:k]`` from the list
fa: عناصر ``s[i:j:k]`` را از لیست حذف می کند
ru: удаляет элементы ``s[i:j:k]`` из списка
uk: видаляє елементи ``s[i:j:k]`` зі списку

source: appends *x* to the end of the sequence (same as ``s[len(s):len(s)] = [x]``)
fa: *x* را به انتهای دنباله اضافه می کند (همان ``s[len(s):len(s)] = [x]``)
ru: добавляет *x* в конец последовательности (так же, как ``s[len(s):len(s)] = [x]`` )
uk: додає *x* до кінця послідовності (те саме, що ``s[len(s):len(s)] = [x]``)

source: removes all items from *s* (same as ``del s[:]``)
fa: تمام موارد را از *s* (همان ``del s[:]``) حذف می کند
ru: удаляет все элементы из *s* (так же, как ``дель s[:]`` )
uk: видаляє всі елементи з *s* (те саме, що ``del s[:]``)

source: creates a shallow copy of *s* (same as ``s[:]``)
fa: یک کپی کم عمق از *s* (همان ``s[:]``) ایجاد می کند
ru: создает неглубокую копию *s* (так же, как ``s[:]`` )
uk: створює поверхневу копію *s* (те саме, що ``s[:]``)

source: ``s.extend(t)`` or ``s += t``
fa: ``s.extend(t)`` یا ``s += t``
ru: ``s.extend(t)`` или ``s += t``
uk: ``s.extend(t)`` або ``s += t``

source: extends *s* with the contents of *t* (for the most part the same as ``s[len(s):len(s)] = t``)
fa: *s* را با محتویات *t* گسترش می دهد (در بیشتر موارد مشابه ``s[len(s):len(s)] = t``)
ru: расширяет *s* содержимым *t* (по большей части то же самое, что и ``s[len(s):len(s)] = t`` )
uk: розширює *s* вмістом *t* (здебільшого те саме, що ``s[len(s):len(s)] = t``)

source: updates *s* with its contents repeated *n* times
fa: به روز رسانی *s* با محتوای آن *n* بار تکرار شده است
ru: обновляет *s*, его содержимое повторяется *n* раз
uk: оновлює *s* з повторенням його вмісту *n* разів

source: inserts *x* into *s* at the index given by *i* (same as ``s[i:i] = [x]``)
fa: *x* را در شاخص *i* (همان ``s[i:i] = [x]``) در *s* قرار می دهد.
ru: вставляет *x* в *s* по индексу, заданному *i* (так же, как ``s[i:i] = [x]`` )
uk: вставляє *x* в *s* за індексом, заданим *i* (те саме, що ``s[i:i] = [x]``)

source: ``s.pop()`` or ``s.pop(i)``
fa: ``s.pop()`` یا ``s.pop(i)``
ru: ``s.pop()`` или ``s.pop(i)``
uk: ``s.pop()`` або ``s.pop(i)``

source: retrieves the item at *i* and also removes it from *s*
fa: مورد را در *i* بازیابی می کند و همچنین آن را از *s* حذف می کند
ru: извлекает элемент по адресу *i*, а также удаляет его из *s*
uk: отримує елемент у *i*, а також видаляє його з *s*

source: removes the first item from *s* where ``s[i]`` is equal to *x*
fa: اولین مورد را از *s* حذف می کند که در آن ``s[i]`` برابر با *x* است.

source: reverses the items of *s* in place
fa: موارد *s* را در جای خود معکوس می کند
ru: меняет местами элементы *s* на месте
uk: перевертає елементи *s* на місце

source: If *k* is not equal to ``1``, *t* must have the same length as the slice it is replacing.
fa: اگر *k* برابر با ``1`` نباشد، *t* باید همان طول برشی که جایگزین می شود داشته باشد.

source: The optional argument *i* defaults to ``-1``, so that by default the last item is removed and returned.
fa: آرگومان اختیاری *i* به طور پیش فرض روی ``-1`` است، به طوری که به طور پیش فرض آخرین مورد حذف شده و برگردانده می شود.
ru: Необязательный аргумент *i* по умолчанию имеет значение ``-1`` , так что по умолчанию последний элемент удаляется и возвращается.
uk: Необов’язковий аргумент *i* за умовчанням має значення ``-1``, тому за замовчуванням останній елемент видаляється та повертається.

source: :meth:`remove` raises :exc:`ValueError` when *x* is not found in *s*.
fa: هنگامی که *x* در *s* یافت نمی شود، :meth:`remove` :exc:`ValueError` را افزایش می دهد.
ru: :meth:`удалить` поднимает :exc:`ValueError` когда *x* не найден в *s*.
uk: :meth:`remove` викликає :exc:`ValueError`, коли *x* не знайдено в *s*.

source: The :meth:`reverse` method modifies the sequence in place for economy of space when reversing a large sequence. To remind users that it operates by side effect, it does not return the reversed sequence.
fa: روش :meth:`reverse` توالی را برای صرفه جویی در فضا هنگام معکوس کردن یک دنباله بزرگ تغییر می دهد. برای یادآوری به کاربران که با اثر جانبی عمل می کند، دنباله معکوس را بر نمی گرداند.
ru: The :meth:`обратный` Метод изменяет последовательность на месте для экономии места при реверсировании большой последовательности. Чтобы напомнить пользователям, что он действует побочным эффектом, он не возвращает обратную последовательность.
uk: Метод :meth:`reverse` змінює поточну послідовність для економії простору під час реверсування великої послідовності. Щоб нагадати користувачам, що він працює за побічним ефектом, він не повертає зворотну послідовність.

source: :meth:`clear` and :meth:`!copy` are included for consistency with the interfaces of mutable containers that don't support slicing operations (such as :class:`dict` and :class:`set`). :meth:`!copy` is not part of the :class:`collections.abc.MutableSequence` ABC, but most concrete mutable sequence classes provide it.
fa: :meth:`clear` و :meth:`!copy` برای سازگاری با رابط های ظروف قابل تغییر که از عملیات برش پشتیبانی نمی کنند (مانند :class:`dict` و :class:`set`) گنجانده شده اند. :meth:`!copy` بخشی از :class:`collections.abc.MutableSequence` ABC نیست، اما بیشتر کلاس‌های توالی قابل تغییر بتن آن را ارائه می‌کنند.
ru: :meth:`чисто` и :meth:`!копировать` включены для согласованности с интерфейсами изменяемых контейнеров, которые не поддерживают операции нарезки (например, :class:`dict` и :класс:`набор` ). :meth:`!копировать` не является частью :class:`collections.abc.MutableSequence` ABC, но его предоставляют большинство конкретных классов изменяемых последовательностей.
uk: :meth:`clear` і :meth:`!copy` включено для узгодженості з інтерфейсами змінних контейнерів, які не підтримують операції зрізання (таких як :class:`dict` і :class:`set`). :meth:`!copy` не є частиною :class:`collections.abc.MutableSequence` ABC, але більшість конкретних змінних класів послідовності надають його.

source: :meth:`clear` and :meth:`!copy` methods.
fa: روش های :meth:`clear` و :meth:`!copy`.
ru: :meth:`clear` и :meth:`!copy` методы .
uk: Методи :meth:`clear` і :meth:`!copy`.

source: The value *n* is an integer, or an object implementing :meth:`~object.__index__`. Zero and negative values of *n* clear the sequence. Items in the sequence are not copied; they are referenced multiple times, as explained for ``s * n`` under :ref:`typesseq-common`.
fa: مقدار *n* یک عدد صحیح یا یک شی است که :meth:`~object.__index__` را پیاده سازی می کند. مقادیر صفر و منفی *n* دنباله را پاک می کند. موارد موجود در دنباله کپی نمی شوند. همانطور که برای ``s * n`` در :ref:`typesseq-common` توضیح داده شد، چندین بار به آنها ارجاع داده می شود.
ru: Значение *n* является целым числом или объектом, реализующим :meth:`~object.__index__` . Нулевые и отрицательные значения *n* очищают последовательность. Элементы последовательности не копируются; на них ссылаются несколько раз, как объяснено для ``с*н`` под :ref:`typesseq-common` .
uk: Значення *n* є цілим числом або об’єктом, що реалізує :meth:`~object.__index__`. Нульові та негативні значення *n* очищають послідовність. Елементи послідовності не копіюються; на них посилаються кілька разів, як пояснюється для ``s * n`` у :ref:`typesseq-common`.

source: Lists
fa: لیست ها
ru: Списки
uk: списки

source: Lists are mutable sequences, typically used to store collections of homogeneous items (where the precise degree of similarity will vary by application).
fa: فهرست‌ها توالی‌های قابل تغییر هستند که معمولاً برای ذخیره مجموعه‌هایی از آیتم‌های همگن استفاده می‌شوند (که در آن درجه دقیق شباهت بر اساس کاربرد متفاوت است).
ru: Списки представляют собой изменяемые последовательности, обычно используемые для хранения коллекций однородных элементов (где точная степень сходства зависит от приложения).
uk: Списки — це змінювані послідовності, які зазвичай використовуються для зберігання колекцій однорідних елементів (де точний ступінь подібності залежить від програми).

source: Lists may be constructed in several ways:
fa: فهرست ها را می توان به روش های مختلفی ساخت:
ru: Списки могут быть составлены несколькими способами:
uk: Списки можна створювати кількома способами:

source: Using a pair of square brackets to denote the empty list: ``[]``
fa: استفاده از یک جفت براکت مربع برای نشان دادن لیست خالی: ``[]``
ru: Использование пары квадратных скобок для обозначения пустого списка: ``[]``
uk: Використання пари квадратних дужок для позначення порожнього списку: ``[]``

source: Using square brackets, separating items with commas: ``[a]``, ``[a, b, c]``
fa: با استفاده از براکت مربع، موارد را با کاما جدا کنید: ``[a]``، ``[a, b, c]``
ru: Используя квадратные скобки, разделяя элементы запятыми: ``[а]`` , ``[а, б, в]``
uk: Використовуючи квадратні дужки, розділяючи елементи комами: ``[a]``, ``[a, b, c]``

source: Using a list comprehension: ``[x for x in iterable]``
fa: با استفاده از درک لیست: ``[x for x in iterable]``
ru: Использование понимания списка:: ``[x for x in iterable]``
uk: Використання розуміння списку: ``[x for x in iterable]``

source: Using the type constructor: ``list()`` or ``list(iterable)``
fa: با استفاده از سازنده نوع: ``list()`` یا ``list(iterable)``
ru: Использование конструктора типа: ``список()`` или ``список(итеративный)``
uk: Використання конструктора типу: ``list()`` або ``list(iterable)``

source: The constructor builds a list whose items are the same and in the same order as *iterable*'s items. *iterable* may be either a sequence, a container that supports iteration, or an iterator object. If *iterable* is already a list, a copy is made and returned, similar to ``iterable[:]``. For example, ``list('abc')`` returns ``['a', 'b', 'c']`` and ``list( (1, 2, 3) )`` returns ``[1, 2, 3]``. If no argument is given, the constructor creates a new empty list, ``[]``.
fa: سازنده لیستی می سازد که آیتم های آن مشابه و به ترتیب آیتم های *iterable* هستند. *iterable* ممکن است یک دنباله باشد، یک ظرف که از تکرار پشتیبانی می کند، یا یک شی تکرار شونده. اگر *iterable* از قبل یک لیست است، یک کپی ساخته شده و بازگردانده می شود، مشابه ``iterable[:]``. برای مثال، ``list('abc')`` ``['a', 'b', 'c']`` و ``list( (1, 2, 3) )`` ``[1, 2, 3]`` را برمی گرداند. اگر هیچ آرگومانی داده نشود، سازنده یک لیست خالی جدید به نام ``[]`` ایجاد می کند.
ru: Конструктор создает список, элементы которого такие же и в том же порядке, что и элементы *iterable*. *iterable* может быть последовательностью, контейнером, поддерживающим итерацию, или объектом-итератором. Если *iterable* уже является списком, создается и возвращается копия, аналогично ``итерируемый[:]`` . Например, ``список('abc')`` возвращает ``['a', 'b', 'c']`` и ``список( (1, 2, 3))`` возвращает ``[1, 2, 3]`` . Если аргумент не указан, конструктор создает новый пустой список. ``[]`` .
uk: Конструктор створює список, елементи якого є такими ж і в тому ж порядку, що й елементи *iterable*. *iterable* може бути або послідовністю, контейнером, який підтримує ітерацію, або об’єктом ітератора. Якщо *iterable* вже є списком, копія створюється та повертається, подібно до ``iterable[:]``. Наприклад, ``list('abc')`` повертає ``['a', 'b', 'c']``, а ``list( (1, 2, 3) )`` повертає ``[ 1, 2, 3]``. Якщо аргумент не задано, конструктор створює новий порожній список, ``[]``.

source: Many other operations also produce lists, including the :func:`sorted` built-in.
fa: بسیاری از عملیات های دیگر نیز لیست هایی را تولید می کنند، از جمله :func:`sorted` داخلی.
ru: Многие другие операции также создают списки, включая `:func:`отсортировано` отсортировано` встроенный.
uk: Багато інших операцій також створюють списки, включаючи вбудовану :func:`sorted`.

source: Lists implement all of the :ref:`common <typesseq-common>` and :ref:`mutable <typesseq-mutable>` sequence operations. Lists also provide the following additional method:
fa: لیست ها تمام عملیات دنباله :ref:`common <typesseq-common>` و :ref:`mutable <typesseq-mutable>` را اجرا می کنند. فهرست ها همچنین روش اضافی زیر را ارائه می دهند:
ru: Списки реализуют все :ref:`common ` и :ref:`изменяемый`последовательность операций. Списки также предоставляют следующий дополнительный метод:
uk: Списки реалізують усі :ref:`common <typesseq-common>` і :ref:`mutable <typesseq-mutable>` операції послідовності. Списки також надають наступний додатковий метод:
