Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: fa, ru, uk

source: If *key* is in the dictionary, return its value. If not, insert *key* with a value of *default* and return *default*. *default* defaults to ``None``.
fa: اگر *key* در فرهنگ لغت وجود دارد، مقدار آن را برگردانید. اگر نه، *key* را با مقدار *default* وارد کنید و *default* را برگردانید. *default* به طور پیش فرض روی ``None`` است.
ru: Если *key* есть в словаре, верните его значение. Если нет, вставьте *key* со значением *default* и верните *default*. *по умолчанию* по умолчанию ``Нет`` .
uk: Якщо *key* є в словнику, поверніть його значення. Якщо ні, вставте *ключ* зі значенням *default* і поверніть *default*. *default* за замовчуванням ``None``.

source: Update the dictionary with the key/value pairs from *other*, overwriting existing keys. Return ``None``.
fa: فرهنگ لغت را با جفت‌های کلید/مقدار از *other* به‌روزرسانی کنید و کلیدهای موجود را بازنویسی کنید. ``None`` را برگردانید.
ru: Обновите словарь парами ключ/значение из *other*, перезаписав существующие ключи. Возвращаться ``Нет`` .
uk: Оновіть словник парами ключ/значення з *other*, перезаписавши існуючі ключі. Повернути ``Жодного``.

source: :meth:`update` accepts either another object with a ``keys()`` method (in which case :meth:`~object.__getitem__` is called with every key returned from the method) or an iterable of key/value pairs (as tuples or other iterables of length two). If keyword arguments are specified, the dictionary is then updated with those key/value pairs: ``d.update(red=1, blue=2)``.
fa: :meth:`update` یا شیء دیگری را با متد ``keys()`` می پذیرد (در این صورت :meth:`~object.__getitem__` با هر کلیدی که از متد برگردانده می شود فراخوانی می شود) یا یک جفت کلید/مقدار تکرار شونده (به صورت چند تایی یا تکرارپذیرهای دیگر با طول دو). اگر آرگومان های کلمه کلیدی مشخص شده باشند، فرهنگ لغت با آن جفت های کلید/مقدار به روز می شود: ``d.update(red=1, blue=2)``.

source: Return a new view of the dictionary's values. See the :ref:`documentation of view objects <dict-views>`.
fa: نمای جدیدی از مقادیر فرهنگ لغت را برگردانید. :ref:`documentation of view objects <dict-views>` را ببینید.
ru: Верните новое представление значений словаря. См. :ref:`документацию по объектам просмотра. `.
uk: Повернути нове подання значень словника. Перегляньте :ref:`документацію об’єктів перегляду <dict-views>`.

source: An equality comparison between one ``dict.values()`` view and another will always return ``False``. This also applies when comparing ``dict.values()`` to itself::
fa: مقایسه برابری بین یک نمای ``dict.values()`` و نمای دیگر همیشه ``False`` را برمی گرداند. این همچنین هنگام مقایسه ``dict.values()`` با خودش صدق می کند:
ru: Сравнение равенства между одним ``dict.values()`` просмотр и другой всегда вернется ``Ложь`` . Это также применимо при сравнении ``dict.values()`` себе::
uk: Порівняння рівності між одним переглядом ``dict.values()`` та іншим завжди повертатиме ``False``. Це також стосується порівняння ``dict.values()`` із собою::

source: Create a new dictionary with the merged keys and values of *d* and *other*, which must both be dictionaries. The values of *other* take priority when *d* and *other* share keys.
fa: یک فرهنگ لغت جدید با کلیدها و مقادیر ادغام شده *d* و *other* ایجاد کنید، که هر دو باید دیکشنری باشند. مقادیر *other* زمانی که کلیدهای مشترک *d* و *other* اولویت دارند.
ru: Создайте новый словарь с объединенными ключами и значениями *d* и *other*, которые оба должны быть словарями. Значения *other* имеют приоритет, если *d* и *other* имеют общие ключи.
uk: Створіть новий словник із об’єднаними ключами та значеннями *d* та *other*, які мають бути словниками. Значення *other* мають пріоритет, коли *d* та *other* мають спільні ключі.

source: Update the dictionary *d* with keys and values from *other*, which may be either a :term:`mapping` or an :term:`iterable` of key/value pairs. The values of *other* take priority when *d* and *other* share keys.
fa: فرهنگ لغت *d* را با کلیدها و مقادیر *other* به روز کنید، که ممکن است یک :term:`mapping` یا یک :term:`iterable` از جفت های کلید/مقدار باشد. مقادیر *other* در هنگام اشتراک گذاری کلیدهای *d* و *other* اولویت دارند.
ru: Обновите словарь *d*, добавив ключи и значения из *other*, которые могут быть либо :term:`mapping`, либо :term:`iterable` пар ключ/значение. Значения *other* имеют приоритет, если *d* и *other* имеют общие ключи.
uk: Оновіть словник *d* ключами та значеннями з *other*, які можуть бути :term:`mapping` або :term:`iterable` пар ключ/значення. Значення *other* мають пріоритет, коли *d* та *other* мають спільні ключі.

source: Dictionaries compare equal if and only if they have the same ``(key, value)`` pairs (regardless of ordering). Order comparisons ('<', '<=', '>=', '>') raise :exc:`TypeError`.
fa: دیکشنری ها اگر و فقط در صورتی که جفت های ``(key, value)`` یکسانی داشته باشند (بدون در نظر گرفتن سفارش) برابر هستند. مقایسه‌های سفارش ('<', '<=', '>=', '>') :exc:`TypeError` را افزایش می‌دهد.
ru: Словари сравнивают равные тогда и только тогда, когда они имеют одинаковые значения. ``(ключ, значение)`` пары (независимо от заказа). Сравнение порядков ('<', '<=', '>=', '>') повышает :exc:`TypeError` .
uk: Словники порівнюються рівними тоді і тільки тоді, коли вони мають однакові пари ``(ключ, значення)`` (незалежно від порядку). Порівняння порядку (' <', '<=', '> =', '>') викликає :exc:`TypeError`.

source: Dictionaries preserve insertion order. Note that updating a key does not affect the order. Keys added after deletion are inserted at the end. ::
fa: فرهنگ لغت ترتیب درج را حفظ می کند. توجه داشته باشید که به‌روزرسانی یک کلید بر ترتیب تأثیری ندارد. کلیدهای اضافه شده پس از حذف در انتها درج می شوند. ::
ru: Словари сохраняют порядок вставки. Обратите внимание, что обновление ключа не влияет на порядок. Ключи, добавленные после удаления, вставляются в конце. ::
uk: Словники зберігають порядок вставки. Зауважте, що оновлення ключа не впливає на порядок. Ключі, додані після видалення, вставляються в кінці. ::

source: Dictionary order is guaranteed to be insertion order. This behavior was an implementation detail of CPython from 3.6.
fa: سفارش دیکشنری تضمین شده است که سفارش درج است. این رفتار جزییات پیاده سازی CPython از 3.6 بود.
ru: Порядок словаря гарантированно является порядком вставки. Такое поведение было частью реализации CPython начиная с версии 3.6.
uk: Порядок словника гарантовано буде порядком вставки. Така поведінка була деталлю реалізації CPython від 3.6.

source: Dictionaries and dictionary views are reversible. ::
fa: لغت نامه ها و نماهای فرهنگ لغت برگشت پذیر هستند. ::
ru: Словари и представления словарей обратимы. ::
uk: Словники та перегляди словників є оборотними. ::

source: Dictionaries are now reversible.
fa: دیکشنری ها اکنون قابل برگشت هستند.
ru: Словари теперь обратимы.
uk: Словники тепер оборотні.

source: :class:`types.MappingProxyType` can be used to create a read-only view of a :class:`dict`.
fa: :class:`types.MappingProxyType` می تواند برای ایجاد یک نمای فقط خواندنی از :class:`dict` استفاده شود.
ru: :class:`types.MappingProxyType` может использоваться для создания представления только для чтения :class:`dict` .
uk: :class:`types.MappingProxyType` можна використовувати для створення перегляду :class:`dict` лише для читання.

source: Dictionary view objects
fa: دیکشنری مشاهده اشیاء
ru: Объекты представления словаря
uk: Об’єкти перегляду словника

source: The objects returned by :meth:`dict.keys`, :meth:`dict.values` and :meth:`dict.items` are *view objects*. They provide a dynamic view on the dictionary's entries, which means that when the dictionary changes, the view reflects these changes.
fa: اشیاء بازگردانده شده توسط :meth:`dict.keys`، :meth:`dict.values` و :meth:`dict.items` *view objects* هستند. آنها یک نمای پویا در مورد مدخل های فرهنگ لغت ارائه می دهند، به این معنی که وقتی فرهنگ لغت تغییر می کند، نمای این تغییرات را منعکس می کند.
ru: Объекты, возвращенные :meth:`dict.keys` , :meth:`dict.values` и :meth:`dict.items` являются *объектами просмотра*. Они обеспечивают динамическое представление записей словаря, а это означает, что при изменении словаря представление отражает эти изменения.
uk: Об’єкти, які повертаються :meth:`dict.keys`, :meth:`dict.values` і :meth:`dict.items`, є *об’єктами перегляду*. Вони забезпечують динамічний перегляд статей словника, що означає, що коли словник змінюється, перегляд відображає ці зміни.

source: Dictionary views can be iterated over to yield their respective data, and support membership tests:
fa: نماهای فرهنگ لغت را می توان برای به دست آوردن داده های مربوطه تکرار کرد و از آزمون های عضویت پشتیبانی کرد:
ru: Представления словаря можно перебирать для получения соответствующих данных и поддерживать тесты членства:
uk: Перегляди словників можна повторювати, щоб отримати відповідні дані та підтримувати тести членства:

source: Return the number of entries in the dictionary.
fa: تعداد مدخل های فرهنگ لغت را برگردانید.
ru: Возвращает количество записей в словаре.
uk: Повернути кількість статей у словнику.

source: Return an iterator over the keys, values or items (represented as tuples of ``(key, value)``) in the dictionary.
fa: یک تکرارکننده روی کلیدها، مقادیر یا آیتم‌ها (که به صورت چند تایی از ``(key, value)`` نشان داده شده‌اند) در فرهنگ لغت برگردانید.
ru: Возвращает итератор по ключам, значениям или элементам (представленным в виде кортежей ``(ключ, значение)`` ) в словаре.
uk: Повертає ітератор над ключами, значеннями або елементами (представленими у вигляді кортежів ``(ключ, значення)``) у словнику.

source: Keys and values are iterated over in insertion order. This allows the creation of ``(value, key)`` pairs using :func:`zip`: ``pairs = zip(d.values(), d.keys())``. Another way to create the same list is ``pairs = [(v, k) for (k, v) in d.items()]``.
fa: کلیدها و مقادیر به ترتیب درج تکرار می شوند. این امکان ایجاد جفت های ``(value, key)`` را با استفاده از :func:`zip`: ``pairs = zip(d.values(), d.keys())`` فراهم می کند. راه دیگری برای ایجاد همین لیست ``pairs = [(v, k) for (k, v) in d.items()]`` است.
ru: Ключи и значения перебираются в порядке вставки. Это позволяет создавать ``(значение, ключ)`` пары, используя :func:`zip` : ``pairs = zip(d.values(), d.keys())`` . Другой способ создать тот же список: ``pairs = [(v, k) для (k, v) в d.items()]`` .
uk: Ключі та значення повторюються в порядку вставки. Це дозволяє створювати пари ``(значення, ключ)`` за допомогою :func:`zip`: ``pairs = zip(d.values(), d.keys())``. Інший спосіб створити той самий список: ``pairs = [(v, k) for (k, v) in d.items()]``.

source: Iterating views while adding or deleting entries in the dictionary may raise a :exc:`RuntimeError` or fail to iterate over all entries.
fa: تکرار نماها در حین افزودن یا حذف مدخل ها در فرهنگ لغت ممکن است :exc:`RuntimeError` را افزایش دهد یا بر روی همه مدخل ها تکرار نشود.
ru: Повторение представлений при добавлении или удалении записей в словаре может привести к возникновению проблемы. :exc:`RuntimeError` или не удастся перебрать все записи.
uk: Ітерація подання під час додавання чи видалення записів у словнику може викликати :exc:`RuntimeError` або не вдається виконати ітерацію по всіх записах.

source: Dictionary order is guaranteed to be insertion order.
fa: سفارش دیکشنری تضمین شده است که سفارش درج است.
ru: Порядок словаря гарантированно является порядком вставки.
uk: Порядок словника гарантовано буде порядком вставки.

source: Return ``True`` if *x* is in the underlying dictionary's keys, values or items (in the latter case, *x* should be a ``(key, value)`` tuple).
fa: اگر *x* در کلیدها، مقادیر یا موارد فرهنگ لغت زیرین قرار دارد، ``True`` را برگردانید (در مورد دوم, *x* باید یک تاپلی ``(key, value)`` باشد).
ru: Возвращаться ``Правда`` если *x* находится в ключах, значениях или элементах базового словаря (в последнем случае *x* должно быть ``(ключ, значение)`` кортеж).
uk: Повертає ``True``, якщо *x* міститься в ключах, значеннях або елементах основного словника (в останньому випадку *x* має бути кортежем ``(ключ, значення)``).

source: Return a reverse iterator over the keys, values or items of the dictionary. The view will be iterated in reverse order of the insertion.
fa: یک تکرار معکوس روی کلیدها، مقادیر یا موارد فرهنگ لغت برگردانید. نمای به ترتیب معکوس درج تکرار می شود.
ru: Верните обратный итератор по ключам, значениям или элементам словаря. Представление будет повторяться в порядке, обратном вставке.
uk: Повертає зворотний ітератор над ключами, значеннями або елементами словника. Подання буде повторено в порядку, зворотному до вставки.

source: Dictionary views are now reversible.
fa: نماهای دیکشنری اکنون قابل برگشت هستند.
ru: Представления словаря теперь обратимы.
uk: Перегляди словника тепер оборотні.

source: Return a :class:`types.MappingProxyType` that wraps the original dictionary to which the view refers.
fa: یک :class:`types.MappingProxyType` را برگردانید که فرهنگ لغت اصلی را که نما به آن ارجاع می دهد، می پیچد.
ru: Вернуть :class:`types.MappingProxyType` который оборачивает исходный словарь, на который ссылается представление.
uk: Повертає :class:`types.MappingProxyType`, який обгортає вихідний словник, на який посилається перегляд.

source: Keys views are set-like since their entries are unique and :term:`hashable`. Items views also have set-like operations since the (key, value) pairs are unique and the keys are hashable. If all values in an items view are hashable as well, then the items view can interoperate with other sets. (Values views are not treated as set-like since the entries are generally not unique.) For set-like views, all of the operations defined for the abstract base class :class:`collections.abc.Set` are available (for example, ``==``, ``<``, or ``^``). While using set operators, set-like views accept any iterable as the other operand, unlike sets which only accept sets as the input.
fa: نماهای کلیدها مانند مجموعه هستند زیرا ورودی های آنها منحصر به فرد و :term:`hashable` هستند. نماهای آیتم ها نیز عملیاتی شبیه به مجموعه دارند زیرا جفت های (کلید, مقدار) منحصر به فرد هستند و کلیدها قابل هش هستند. اگر همه مقادیر در نمای آیتم ها نیز قابل هش باشند، نمای آیتم ها می تواند با مجموعه های دیگر تعامل داشته باشد. (نماهای مقادیر به‌عنوان مجموعه‌ای در نظر گرفته نمی‌شوند زیرا ورودی‌ها معمولاً منحصربه‌فرد نیستند.) برای نماهای مجموعه‌مانند، همه عملیات تعریف‌شده برای کلاس پایه انتزاعی :class:`collections.abc.Set` در دسترس هستند (به عنوان مثال, ``==``, ``<``, یا ``^``). هنگام استفاده از عملگرهای مجموعه، نماهای مجموعه مانند هر تکرارپذیر را به عنوان عملوند دیگر می پذیرند، بر خلاف مجموعه هایی که فقط مجموعه ها را به عنوان ورودی می پذیرند.

source: An example of dictionary view usage::
fa: نمونه ای از استفاده از نمای فرهنگ لغت::
ru: Пример использования представления словаря::
uk: Приклад використання перегляду словника::

source: Context Manager Types
fa: انواع مدیریت زمینه
ru: Типы контекстных менеджеров
uk: Типи менеджера контексту

source: Python's :keyword:`with` statement supports the concept of a runtime context defined by a context manager. This is implemented using a pair of methods that allow user-defined classes to define a runtime context that is entered before the statement body is executed and exited when the statement ends:
fa: عبارت :keyword:`with` پایتون از مفهوم یک زمینه زمان اجرا تعریف شده توسط یک مدیر زمینه پشتیبانی می کند. این با استفاده از یک جفت روش پیاده‌سازی می‌شود که به کلاس‌های تعریف‌شده توسط کاربر اجازه می‌دهد تا یک زمینه زمان اجرا را تعریف کنند که قبل از اجرای متن دستور وارد شده و پس از پایان دستور خارج می‌شود:
ru: Python :keyword:`с` Оператор поддерживает концепцию контекста времени выполнения, определенного менеджером контекста. Это реализовано с помощью пары методов, которые позволяют определяемым пользователем классам определять контекст времени выполнения, который вводится до выполнения тела инструкции и завершается по завершении инструкции:
uk: Оператор Python :keyword:`with` підтримує концепцію контексту виконання, визначеного менеджером контексту. Це реалізовано за допомогою пари методів, які дозволяють визначеним користувачем класам визначати контекст виконання, який вводиться перед виконанням тіла оператора та виходить, коли оператор закінчується:

source: Enter the runtime context and return either this object or another object related to the runtime context. The value returned by this method is bound to the identifier in the :keyword:`!as` clause of :keyword:`with` statements using this context manager.
fa: متن زمان اجرا را وارد کنید و این شی یا یک شی دیگر مربوط به زمینه زمان اجرا را برگردانید. مقدار بازگردانده شده توسط این روش به شناسه در عبارت :keyword:`!as` از دستورات :keyword:`with` با استفاده از این مدیر زمینه محدود می شود.
ru: Введите контекст времени выполнения и верните либо этот объект, либо другой объект, связанный с контекстом времени выполнения. Значение, возвращаемое этим методом, привязано к идентификатору в :keyword:`!as` пункт :keyword:`с` операторы, использующие этот менеджер контекста.
uk: Введіть контекст середовища виконання та поверніть або цей об’єкт, або інший об’єкт, пов’язаний із контекстом середовища виконання. Значення, яке повертає цей метод, прив’язується до ідентифікатора в пункті :keyword:`!as` операторів :keyword:`with` за допомогою цього менеджера контексту.

source: An example of a context manager that returns itself is a :term:`file object`. File objects return themselves from __enter__() to allow :func:`open` to be used as the context expression in a :keyword:`with` statement.
fa: مثالی از یک مدیر زمینه که خود را برمی‌گرداند، یک :term:`file object` است. اشیاء فایل خود را از __enter__() برمی‌گردانند تا اجازه دهند :func:`open` به عنوان عبارت زمینه در یک دستور :keyword:`with` استفاده شود.
ru: Примером контекстного менеджера, который возвращает сам себя, является :term:`файловый объект`. Файловые объекты возвращают себя из __enter__(), чтобы разрешить :func:`открыть` использоваться в качестве контекстного выражения в :keyword:`с` заявление.
uk: Прикладом контекстного менеджера, який повертає сам себе, є :term:`file object`. Файлові об’єкти повертаються з __enter__(), щоб дозволити використовувати :func:`open` як вираз контексту в операторі :keyword:`with`.

source: An example of a context manager that returns a related object is the one returned by :func:`decimal.localcontext`. These managers set the active decimal context to a copy of the original decimal context and then return the copy. This allows changes to be made to the current decimal context in the body of the :keyword:`with` statement without affecting code outside the :keyword:`!with` statement.
fa: نمونه ای از یک مدیر زمینه که یک شی مرتبط را برمی گرداند، همان چیزی است که توسط :func:`decimal.localcontext` برگردانده شده است. این مدیران زمینه اعشاری فعال را روی یک کپی از بافت اعشاری اصلی تنظیم می کنند و سپس کپی را برمی گردانند. این اجازه می دهد تا تغییراتی در بافت اعشاری فعلی در متن دستور :keyword:`with` بدون تأثیر بر روی کد خارج از دستور :keyword:`!with` ایجاد شود.
ru: Примером менеджера контекста, который возвращает связанный объект, является тот, который возвращается :func:`decimal.localcontext` . Эти менеджеры устанавливают активный десятичный контекст в копию исходного десятичного контекста, а затем возвращают копию. Это позволяет вносить изменения в текущий десятичный контекст в теле :keyword:`с` оператор, не затрагивая код вне :keyword:`!с` заявление.
uk: Прикладом менеджера контексту, який повертає пов’язаний об’єкт, є той, який повертає :func:`decimal.localcontext`. Ці менеджери встановлюють активний десятковий контекст на копію вихідного десяткового контексту, а потім повертають копію. Це дозволяє вносити зміни до поточного десяткового контексту в тілі оператора :keyword:`with`, не впливаючи на код поза оператором :keyword:`!with`.

source: Exit the runtime context and return a Boolean flag indicating if any exception that occurred should be suppressed. If an exception occurred while executing the body of the :keyword:`with` statement, the arguments contain the exception type, value and traceback information. Otherwise, all three arguments are ``None``.
fa: از زمینه زمان اجرا خارج شوید و یک پرچم Boolean را برگردانید که نشان می دهد هر استثنایی که رخ داده است باید سرکوب شود. اگر در هنگام اجرای متن دستور :keyword:`with` یک استثنا رخ دهد، آرگومان ها حاوی اطلاعات نوع استثنا، مقدار و ردیابی هستند. در غیر این صورت، هر سه آرگومان ``None`` هستند.
ru: Выйдите из контекста времени выполнения и верните логический флаг, указывающий, следует ли подавлять возникшее исключение. Если исключение произошло во время выполнения тела :keyword:`с` аргументы содержат тип исключения, значение и информацию трассировки. В противном случае все три аргумента ``Нет`` .
uk: Вийдіть із контексту виконання та поверніть логічний прапор, який вказує, чи має бути придушено будь-який виняток, який стався. Якщо виняток стався під час виконання тіла оператора :keyword:`with`, аргументи містять тип винятку, значення та інформацію про відстеження. В іншому випадку всі три аргументи є ``Жодним``.

source: Returning a true value from this method will cause the :keyword:`with` statement to suppress the exception and continue execution with the statement immediately following the :keyword:`!with` statement. Otherwise the exception continues propagating after this method has finished executing. Exceptions that occur during execution of this method will replace any exception that occurred in the body of the :keyword:`!with` statement.
fa: برگرداندن یک مقدار واقعی از این متد باعث می‌شود که دستور :keyword:`with` استثنا را سرکوب کرده و با دستور بلافاصله بعد از دستور :keyword:`!with` اجرا را ادامه دهد. در غیر این صورت، پس از پایان اجرای این روش، استثنا به انتشار ادامه می‌دهد. استثناهایی که در طول اجرای این متد رخ می دهند جایگزین هر استثنایی می شوند که در متن دستور :keyword:`!with` رخ داده است.
ru: Возврат истинного значения из этого метода приведет к :keyword:`с` оператор, чтобы подавить исключение и продолжить выполнение с оператора, следующего сразу за :keyword:`!с` заявление. В противном случае исключение продолжает распространяться после завершения выполнения этого метода. Исключения, возникающие во время выполнения этого метода, заменят любое исключение, возникшее в теле метода. :keyword:`!с` заявление.
uk: Повернення цього методу справжнього значення призведе до того, що оператор :keyword:`with` придушить виняток і продовжить виконання з оператором, який слідує безпосередньо за оператором :keyword:`!with`. В іншому випадку виняткова ситуація продовжує поширюватися після завершення виконання цього методу. Винятки, які виникають під час виконання цього методу, замінять будь-які винятки, які виникли в тілі оператора :keyword:`!with`.

source: The exception passed in should never be reraised explicitly - instead, this method should return a false value to indicate that the method completed successfully and does not want to suppress the raised exception. This allows context management code to easily detect whether or not an :meth:`~object.__exit__` method has actually failed.
fa: استثنا ارسال شده هرگز نباید به طور صریح مجدداً افزایش یابد - در عوض، این متد باید یک مقدار نادرست برگرداند تا نشان دهد که متد با موفقیت انجام شده است و نمی‌خواهد استثنای مطرح شده را سرکوب کند. این به کد مدیریت زمینه اجازه می دهد تا به راحتی تشخیص دهد که آیا روش :meth:`~object.__exit__` واقعاً شکست خورده است یا خیر.
ru: Переданное исключение никогда не должно вызываться повторно явно — вместо этого этот метод должен возвращать ложное значение, чтобы указать, что метод завершился успешно и не желает подавлять возникшее исключение. Это позволяет коду управления контекстом легко определить, есть ли :meth:`~object.__exit__` метод фактически не сработал.
