Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: fa, ru, uk

source: Return the :term:`iterator` object itself. This is required to allow both containers and iterators to be used with the :keyword:`for` and :keyword:`in` statements. This method corresponds to the :c:member:`~PyTypeObject.tp_iter` slot of the type structure for Python objects in the Python/C API.
fa: خود شی :term:`iterator` را برگردانید. این مورد لازم است تا امکان استفاده از کانتینرها و تکرارکننده ها با دستورات :keyword:`for` و :keyword:`in` فراهم شود. این روش با شکاف :c:member:`~PyTypeObject.tp_iter` ساختار نوع برای اشیاء پایتون در Python/C API مطابقت دارد.
ru: Верните сам объект :term:`iterator`. Это необходимо для того, чтобы можно было использовать как контейнеры, так и итераторы с :keyword:`для` и :keyword:`в` заявления. Этот метод соответствует :c:member:`~PyTypeObject.tp_iter` слот структуры типа для объектов Python в API Python/C.
uk: Повертає сам об’єкт :term:`iterator`. Це потрібно, щоб дозволити використовувати як контейнери, так і ітератори з операторами :keyword:`for` і :keyword:`in`. Цей метод відповідає слоту :c:member:`~PyTypeObject.tp_iter` структури типу для об’єктів Python в API Python/C.

source: Return the next item from the :term:`iterator`. If there are no further items, raise the :exc:`StopIteration` exception. This method corresponds to the :c:member:`~PyTypeObject.tp_iternext` slot of the type structure for Python objects in the Python/C API.
fa: مورد بعدی را از :term:`iterator` برگردانید. اگر مورد دیگری وجود ندارد، استثناء :exc:`StopIteration` را مطرح کنید. این روش مربوط به شکاف :c:member:`~PyTypeObject.tp_iternext` از ساختار نوع برای اشیاء پایتون در Python/C API است.
ru: Вернуть следующий элемент из :term:`итератора`. Если дополнительных элементов нет, поднимите :exc:`СтопИтерация` исключение. Этот метод соответствует :c:member:`~PyTypeObject.tp_iternext` слот структуры типа для объектов Python в API Python/C.
uk: Повертає наступний елемент із :term:`iterator`. Якщо більше елементів немає, підніміть виняток :exc:`StopIteration`. Цей метод відповідає слоту :c:member:`~PyTypeObject.tp_iternext` структури типу для об’єктів Python в API Python/C.

source: Python defines several iterator objects to support iteration over general and specific sequence types, dictionaries, and other more specialized forms. The specific types are not important beyond their implementation of the iterator protocol.
fa: پایتون چندین شی تکرار کننده را برای پشتیبانی از تکرار بر روی انواع توالی های عمومی و خاص، دیکشنری ها و سایر اشکال تخصصی تر تعریف می کند. انواع خاص فراتر از اجرای پروتکل تکرارکننده مهم نیستند.
ru: Python определяет несколько объектов-итераторов для поддержки итерации по общим и конкретным типам последовательностей, словарям и другим более специализированным формам. Конкретные типы не важны, кроме реализации протокола итератора.
uk: Python визначає декілька об’єктів-ітераторів для підтримки ітерації загальних і конкретних типів послідовностей, словників та інших більш спеціалізованих форм. Конкретні типи не важливі за межами їхньої реалізації протоколу ітератора.

source: Once an iterator's :meth:`~iterator.__next__` method raises :exc:`StopIteration`, it must continue to do so on subsequent calls. Implementations that do not obey this property are deemed broken.
fa: هنگامی که متد :meth:`~iterator.__next__` تکرار کننده :exc:`StopIteration` را افزایش می دهد، باید این کار را در تماس های بعدی ادامه دهد. اجراهایی که از این ویژگی تبعیت نمی کنند شکسته تلقی می شوند.
ru: Как только итератор :meth:`~iterator.__next__` метод вызывает :exc:`СтопИтерация` , он должен продолжать делать это при последующих вызовах. Реализации, не подчиняющиеся этому свойству, считаются сломанными.
uk: Коли метод :meth:`~iterator.__next__` ітератора викликає :exc:`StopIteration`, він повинен продовжувати робити це під час наступних викликів. Реалізації, які не підкоряються цій властивості, вважаються зламаними.

source: Generator Types
fa: انواع ژنراتور
ru: Типы генераторов
uk: Типи генераторів

source: Python's :term:`generator`\s provide a convenient way to implement the iterator protocol. If a container object's :meth:`~iterator.__iter__` method is implemented as a generator, it will automatically return an iterator object (technically, a generator object) supplying the :meth:`!__iter__` and :meth:`~generator.__next__` methods. More information about generators can be found in :ref:`the documentation for the yield expression <yieldexpr>`.
fa: :term:`generator` پایتون راه مناسبی برای پیاده سازی پروتکل تکرار کننده ارائه می دهد. اگر روش :meth:`~iterator.__iter__` یک شی کانتینر به عنوان یک مولد پیاده سازی شود، به طور خودکار یک شی تکرار کننده (از لحاظ فنی, یک شی مولد) که متدهای :meth:`!__iter__` و :meth:`~generator.__next__` را تامین می کند، برمی گرداند. اطلاعات بیشتر در مورد ژنراتورها را می توان در :ref:`the documentation for the yield expression <yieldexpr>` یافت.
ru: :term:`generator`\s Python предоставляют удобный способ реализации протокола итератора. Если объект-контейнер :meth:`~iterator.__iter__` реализован как генератор, он автоматически возвращает объект-итератор (технически объект-генератор), предоставляющий :meth:`!__iter__` и :meth:`~generator.__next__` методы. Дополнительную информацию о генераторах можно найти в документации по выражению доходности. `.

source: Sequence Types --- :class:`list`, :class:`tuple`, :class:`range`
fa: انواع توالی --- :class:`list`، :class:`tuple`، :class:`range`
ru: Типы последовательностей --- :class:`список` , :class:`кортеж` , :class:`диапазон`
uk: Типи послідовностей --- :class:`list`, :class:`tuple`, :class:`range`

source: There are three basic sequence types: lists, tuples, and range objects. Additional sequence types tailored for processing of :ref:`binary data <binaryseq>` and :ref:`text strings <textseq>` are described in dedicated sections.
fa: سه نوع توالی اصلی وجود دارد: لیست ها، تاپل ها و اشیاء محدوده. انواع توالی اضافی که برای پردازش :ref:`binary data <binaryseq>` و :ref:`text strings <textseq>` طراحی شده اند در بخش های اختصاصی توضیح داده شده اند.
ru: Существует три основных типа последовательностей: списки, кортежи и объекты диапазона. Дополнительные типы последовательностей, предназначенные для обработки двоичных данных. ` и :ref:`текстовые строки` описаны в специальных разделах.
uk: Існує три основні типи послідовностей: списки, кортежі та об’єкти діапазону. Додаткові типи послідовностей, призначені для обробки :ref:`бінарних даних <binaryseq>` і :ref:`текстових рядків <textseq>`, описані у спеціальних розділах.

source: Common Sequence Operations
fa: عملیات توالی مشترک
ru: Общие операции с последовательностью
uk: Загальні операції послідовності

source: The operations in the following table are supported by most sequence types, both mutable and immutable. The :class:`collections.abc.Sequence` ABC is provided to make it easier to correctly implement these operations on custom sequence types.
fa: عملیات‌های جدول زیر توسط اکثر انواع توالی، هم قابل تغییر و هم غیرقابل تغییر پشتیبانی می‌شوند. :class:`collections.abc.Sequence` ABC برای سهولت اجرای صحیح این عملیات در انواع توالی سفارشی ارائه شده است.
ru: Операции в следующей таблице поддерживаются большинством типов последовательностей, как изменяемых, так и неизменяемых. :class:`collections.abc.Sequence` ABC предусмотрен для упрощения правильной реализации этих операций над пользовательскими типами последовательностей.
uk: Операції в наведеній нижче таблиці підтримують більшість типів послідовностей, як змінних, так і незмінних. :class:`collections.abc.Sequence` ABC надається, щоб спростити правильну реалізацію цих операцій у настроюваних типах послідовностей.

source: This table lists the sequence operations sorted in ascending priority. In the table, *s* and *t* are sequences of the same type, *n*, *i*, *j* and *k* are integers and *x* is an arbitrary object that meets any type and value restrictions imposed by *s*.
fa: این جدول عملیات های دنباله ای را که در اولویت صعودی مرتب شده اند فهرست می کند. در جدول، *s* و *t* دنباله هایی از یک نوع هستند، *n*، *i*، *j* و *k* اعداد صحیح هستند و *x* یک شی دلخواه است که هر نوع و مقدار محدودیت اعمال شده توسط *s* را برآورده می کند.
ru: В этой таблице перечислены операции последовательности, отсортированные по возрастанию приоритета. В таблице *s* и *t* — однотипные последовательности, *n*, *i*, *j* и *k* — целые числа, а *x* — произвольный объект, удовлетворяющий любым ограничениям типа и значения. навязано *s*.
uk: У цій таблиці наведено послідовність операцій, відсортованих за зростанням пріоритету. У таблиці *s* і *t* — послідовності одного типу, *n*, *i*, *j* і *k* — цілі числа, а *x* — довільний об’єкт, який відповідає будь-яким обмеженням щодо типу та значення накладений *s*.

source: The ``in`` and ``not in`` operations have the same priorities as the comparison operations. The ``+`` (concatenation) and ``*`` (repetition) operations have the same priority as the corresponding numeric operations. [3]_
fa: عملیات ``in`` و ``not in`` دارای اولویت های مشابه عملیات مقایسه هستند. عملیات ``+`` (الحاق) و ``*`` (تکرار) اولویت مشابهی با عملیات عددی مربوطه دارند. [3]_
ru: The ``в`` и ``не в`` операции имеют те же приоритеты, что и операции сравнения. ``+`` (конкатенация) и ``*`` Операции (повторения) имеют тот же приоритет, что и соответствующие числовые операции. [3]_
uk: Операції ``in`` і ``not in`` мають ті самі пріоритети, що й операції порівняння. Операції ``+`` (конкатенація) і ``*`` (повторення) мають той самий пріоритет, що й відповідні числові операції. [3]_

source: ``True`` if an item of *s* is equal to *x*, else ``False``
fa: ``True`` اگر یک مورد از *s* برابر با *x* باشد، در غیر این صورت ``False``
ru: ``Правда`` если элемент *s* равен *x*, иначе ``Ложь``
uk: ``True``, якщо елемент *s* дорівнює *x*, інакше ``False``

source: ``False`` if an item of *s* is equal to *x*, else ``True``
fa: ``False`` اگر یک مورد از *s* برابر با *x* باشد، در غیر این صورت ``True``
ru: ``False`` если элемент из *s* равно *x*, иначе ``True``
uk: ``False``, якщо елемент *s* дорівнює *x*, інакше ``True``

source: the concatenation of *s* and *t*
fa: الحاق *s* و *t*
ru: объединение *s* и *t*
uk: конкатенація *s* і *t*

source: ``s * n`` or ``n * s``
fa: ``s * n`` یا ``n * s``
ru: ``s * n`` или ``n * s``
uk: ``s * n`` або ``n * s``

source: equivalent to adding *s* to itself *n* times
fa: معادل اضافه کردن *s* به خود *n* بار
ru: эквивалентно добавлению *s* к самому себе *n* раз
uk: еквівалентно додаванню *s* до самого себе *n* разів

source: *i*\ th item of *s*, origin 0
fa: *i*\ امین مورد از *s*، مبدا 0
ru: *i*\-й элемент *s*, происхождение 0
uk: *i*\ ий елемент з *s*, джерело 0

source: slice of *s* from *i* to *j*
fa: برشی از *s* از *i* به *j*
ru: кусочек *s* от *i* до *j*
uk: фрагмент *s* від *i* до *j*

source: slice of *s* from *i* to *j* with step *k*
fa: تکه ای از *s* از *i* به *j* با مرحله *k*
ru: кусочек *s* от *i* до *j* с шагом *k*
uk: фрагмент *s* від *i* до *j* з кроком *k*

source: length of *s*
fa: طول *s*
ru: длина *s*
uk: довжина *s*

source: smallest item of *s*
fa: کوچکترین مورد از *s*
ru: самый маленький предмет из *s*
uk: найменший елемент *s*

source: largest item of *s*
fa: بزرگترین مورد از *s*
ru: самый большой предмет из *s*
uk: найбільший предмет *s*

source: index of the first occurrence of *x* in *s* (at or after index *i* and before index *j*)
fa: شاخص اولین وقوع *x* در *s* (در یا بعد از شاخص *i* و قبل از شاخص *j*)
ru: индекс первого вхождения *x* в *s* (после или после индекса *i* и перед индексом *j*)
uk: індекс першого входження *x* у *s* (за або після індексу *i* та перед індексом *j*)

source: total number of occurrences of *x* in *s*
fa: تعداد کل موارد *x* در *s*
ru: общее количество вхождений *x* в *s*
uk: загальна кількість входжень *x* у *s*

source: Sequences of the same type also support comparisons. In particular, tuples and lists are compared lexicographically by comparing corresponding elements. This means that to compare equal, every element must compare equal and the two sequences must be of the same type and have the same length. (For full details see :ref:`comparisons` in the language reference.)
fa: دنباله هایی از همان نوع نیز از مقایسه پشتیبانی می کنند. به‌ویژه، تاپل‌ها و فهرست‌ها از نظر واژگانی با مقایسه عناصر متناظر با هم مقایسه می‌شوند. این بدان معنی است که برای مقایسه برابر، هر عنصر باید برابر باشد و دو دنباله باید از یک نوع و طول یکسان باشند. (برای جزئیات کامل به :ref:`comparisons` در مرجع زبان مراجعه کنید.)
ru: Последовательности одного типа также поддерживают сравнения. В частности, кортежи и списки сравниваются лексикографически путем сравнения соответствующих элементов. Это означает, что для сравнения на равенство каждый элемент должен сравниваться равным, а две последовательности должны быть одного типа и иметь одинаковую длину. (Подробнее см. :ref:`сравнения` в справочнике по языку.)
uk: Послідовності одного типу також підтримують порівняння. Зокрема, кортежі та списки порівнюються лексикографічно шляхом порівняння відповідних елементів. Це означає, що для порівняння однаково кожен елемент повинен порівнюватись рівно, а дві послідовності мають бути одного типу та мати однакову довжину. (Для отримання повної інформації див. :ref:`comparisons` у мовній довідці.)

source: Forward and reversed iterators over mutable sequences access values using an index. That index will continue to march forward (or backward) even if the underlying sequence is mutated. The iterator terminates only when an :exc:`IndexError` or a :exc:`StopIteration` is encountered (or when the index drops below zero).
fa: تکرار کننده های رو به جلو و معکوس بر روی توالی های قابل تغییر به مقادیر با استفاده از یک شاخص دسترسی پیدا می کنند. حتی اگر دنباله اصلی جهش یافته باشد، این شاخص به حرکت به جلو (یا عقب) ادامه خواهد داد. تکرار کننده تنها زمانی خاتمه می یابد که با :exc:`IndexError` یا :exc:`StopIteration` مواجه می شوید (یا زمانی که ایندکس به زیر صفر می رسد).
ru: Прямые и обратные итераторы для изменяемых последовательностей получают доступ к значениям с помощью индекса. Этот индекс будет продолжать двигаться вперед (или назад), даже если базовая последовательность мутирует. Итератор завершает работу только тогда, когда :exc:`IndexError` или :exc:`СтопИтерация` (или когда индекс падает ниже нуля).
uk: Прямі та зворотні ітератори над змінними послідовностями отримують доступ до значень за допомогою індексу. Цей індекс буде продовжувати рух вперед (або назад), навіть якщо базова послідовність змінена. Ітератор завершується лише тоді, коли зустрічається :exc:`IndexError` або :exc:`StopIteration` (або коли індекс падає нижче нуля).

source: While the ``in`` and ``not in`` operations are used only for simple containment testing in the general case, some specialised sequences (such as :class:`str`, :class:`bytes` and :class:`bytearray`) also use them for subsequence testing::
fa: در حالی که عملیات ``in`` و ``not in`` فقط برای آزمایش ساده مهار در حالت کلی استفاده می شود، برخی از توالی های تخصصی (مانند :class:`str`, :class:`bytes` و :class:`bytearray`) نیز از آنها برای آزمایش بعدی استفاده می کنند:
ru: В то время как ``в`` и ``не в`` операции используются только для простого тестирования сдерживания, в общем случае некоторые специализированные последовательности (например, :class:`str` , :class:`байты` и :class:`bytearray` ) также используйте их для тестирования подпоследовательностей::
uk: У той час як операції ``in`` і ``not in`` використовуються лише для простого тестування локалізації в загальному випадку, деякі спеціалізовані послідовності (такі як :class:`str`, :class:`bytes` і :class:`bytearray`) також використовуйте їх для тестування підпослідовності::

source: Values of *n* less than ``0`` are treated as ``0`` (which yields an empty sequence of the same type as *s*). Note that items in the sequence *s* are not copied; they are referenced multiple times. This often haunts new Python programmers; consider::
fa: مقادیر *n* کمتر از ``0`` به عنوان ``0`` در نظر گرفته می شوند (که یک دنباله خالی از همان نوع *s* را ایجاد می کند). توجه داشته باشید که موارد در دنباله *s* کپی نمی شوند. آنها چندین بار ارجاع داده می شوند. این اغلب برنامه نویسان پایتون جدید را آزار می دهد. در نظر بگیرید::
ru: Значения *n* менее ``0`` рассматриваются как ``0`` (что дает пустую последовательность того же типа, что и *s*). Обратите внимание, что элементы последовательности *s* не копируются; на них ссылаются несколько раз. Это часто преследует новых программистов Python; учитывать::
uk: Значення *n*, менші за ``0``, розглядаються як ``0`` (що дає порожню послідовність того самого типу, що й *s*). Зверніть увагу, що елементи в послідовності *s* не копіюються; на них посилаються кілька разів. Це часто переслідує нових програмістів Python; розглянути::

source: What has happened is that ``[[]]`` is a one-element list containing an empty list, so all three elements of ``[[]] * 3`` are references to this single empty list. Modifying any of the elements of ``lists`` modifies this single list. You can create a list of different lists this way::
fa: اتفاقی که افتاده این است که ``[[]]`` یک لیست تک عنصری حاوی یک لیست خالی است، بنابراین هر سه عنصر ``[[]] * 3`` ارجاعاتی به این لیست خالی هستند. اصلاح هر یک از عناصر ``lists`` این لیست واحد را اصلاح می کند. شما می توانید لیستی از لیست های مختلف را به این ترتیب ایجاد کنید:
ru: Произошло то, что ``[[]]`` представляет собой одноэлементный список, содержащий пустой список, поэтому все три элемента ``[[]] * 3`` являются ссылками на этот единственный пустой список. Изменение любого из элементов ``списки`` изменяет этот единственный список. Вы можете создать список различных списков таким образом:
uk: Сталося те, що ``[[]]`` є одноелементним списком, який містить порожній список, тому всі три елементи ``[[]] * 3`` є посиланнями на цей єдиний порожній список. Зміна будь-якого з елементів ``списків`` змінює цей єдиний список. Ви можете створити список різних списків таким чином:

source: Further explanation is available in the FAQ entry :ref:`faq-multidimensional-list`.
fa: توضیحات بیشتر در مدخل سؤالات متداول :ref:`faq-multidimensional-list` موجود است.
ru: Дальнейшее объяснение доступно в разделе часто задаваемых вопросов. :ref:`faq-многомерный-список` .
uk: Подальші пояснення доступні в розділі поширених запитань :ref:`faq-multidimensional-list`.

source: If *i* or *j* is negative, the index is relative to the end of sequence *s*: ``len(s) + i`` or ``len(s) + j`` is substituted. But note that ``-0`` is still ``0``.
fa: اگر *i* یا *j* منفی باشد، شاخص نسبت به انتهای دنباله *s* است: ``len(s) + i`` یا ``len(s) + j`` جایگزین شده است. اما توجه داشته باشید که ``-0`` همچنان ``0`` است.
ru: Если *i* или *j* отрицательны, индекс относится к концу последовательности *s*: ``лен(ы) + я`` или ``только(ы) + j'' заменяется. Но обратите внимание, что ``-0`` все еще ``0`` .
uk: Якщо *i* або *j* є від’ємними, індекс відноситься до кінця послідовності *s*: замінюється ``len(s) + i`` або ``len(s) + j``. Але зауважте, що ``-0`` все одно ``0``.

source: The slice of *s* from *i* to *j* is defined as the sequence of items with index *k* such that ``i <= k < j``. If *i* or *j* is greater than ``len(s)``, use ``len(s)``. If *i* is omitted or ``None``, use ``0``. If *j* is omitted or ``None``, use ``len(s)``. If *i* is greater than or equal to *j*, the slice is empty.
fa: برش *s* از *i* به *j* به عنوان دنباله ای از موارد با شاخص *k* تعریف می شود به طوری که ``i <= k < j``. اگر *i* یا *j* بزرگتر از ``len(s)`` است، از ``len(s)`` استفاده کنید. اگر *i* حذف شده است یا ``None``، از ``0`` استفاده کنید. اگر *j* حذف شده یا ``None``، از ``len(s)`` استفاده کنید. اگر *i* بزرگتر یا مساوی با *j* باشد، برش خالی است.
ru: Срез *s* от *i* до *j* определяется как последовательность элементов с индексом *k* такая, что ``i <= k < j`` . Если *i* или *j* больше, чем ``лен(ы)`` , использовать ``лен(ы)`` . Если *i* опущено или ``Нет`` , использовать ``0`` . Если *j* опущено или ``Нет`` , использовать ``лен(ы)`` . Если *i* больше или равно *j*, срез пуст.
uk: Зріз *s* від *i* до *j* визначається як послідовність елементів з індексом *k*, така що ``i <= k < j``. Якщо *i* або *j* більше ніж ``len(s)``, використовуйте ``len(s)``. Якщо *i* пропущено або ``None``, використовуйте ``0``. Якщо *j* пропущено або ``None``, використовуйте ``len(s)``. Якщо *i* більше або дорівнює *j*, фрагмент порожній.

source: The slice of *s* from *i* to *j* with step *k* is defined as the sequence of items with index ``x = i + n*k`` such that ``0 <= n < (j-i)/k``. In other words, the indices are ``i``, ``i+k``, ``i+2*k``, ``i+3*k`` and so on, stopping when *j* is reached (but never including *j*). When *k* is positive, *i* and *j* are reduced to ``len(s)`` if they are greater. When *k* is negative, *i* and *j* are reduced to ``len(s) - 1`` if they are greater. If *i* or *j* are omitted or ``None``, they become "end" values (which end depends on the sign of *k*). Note, *k* cannot be zero. If *k* is ``None``, it is treated like ``1``.
fa: برش *s* از *i* به *j* با مرحله *k* به عنوان دنباله ای از موارد با شاخص ``x = i + n*k`` تعریف می شود به طوری که ``0 <= n < (j-i)/k``. به عبارت دیگر، شاخص‌ها ``i``، ``i+k``، ``i+2*k``، ``i+3*k`` و غیره هستند که با رسیدن به *j* متوقف می‌شوند (اما هرگز شامل *j* نمی‌شوند). هنگامی که *k* مثبت است، *i* و *j* اگر بزرگتر باشند به ``len(s)`` کاهش می یابد. وقتی *k* منفی است، اگر بزرگتر باشند، *i* و *j* به ``len(s) - 1`` کاهش می یابد. اگر *i* یا *j* حذف شوند یا ``None``، به مقادیر "پایان" تبدیل می شوند (که پایان به علامت *k* بستگی دارد). توجه داشته باشید، *k* نمی تواند صفر باشد. اگر *k* ``None`` باشد، مانند ``1`` رفتار می شود.
ru: Срез *s* от *i* до *j* с шагом *k* определяется как последовательность элементов с индексом ``x = я + n*k`` такой, что ``0 <= n < (ji)/k`` . Другими словами, индексы ``я`` , ``я+к`` , ``я+2*к`` , ``я+3*к`` и так далее, останавливаясь при достижении *j* (но никогда не включая *j*). Когда *k* положительное значение, *i* и *j* уменьшаются до ``лен(ы)`` если они больше. Когда *k* отрицательное значение, *i* и *j* уменьшаются до ``лен(ы) - 1`` если они больше. Если *i* или *j* опущены или ``Нет`` , они становятся «конечными» значениями (какой конец зависит от знака *k*). Обратите внимание: *k* не может быть нулевым. Если *k* есть ``Нет`` , это рассматривается как ``1`` .
uk: Зріз *s* від *i* до *j* з кроком *k* визначається як послідовність елементів з індексом ``x = i + n*k`` так, що ``0 <= n < (j-i )/k``. Іншими словами, індекси ``i``, ``i+k``, ``i+2*k``, ``i+3*k`` і так далі, зупиняючись, коли *j* є досягнуто (але ніколи не включаючи *j*). Коли *k* додатне, *i* і *j* скорочуються до ``len(s)``, якщо вони більші. Коли *k* від’ємне, *i* та *j* скорочуються до ``len(s) - 1``, якщо вони більші. Якщо *i* або *j* пропущені або ``None``, вони стають "кінцевими" значеннями (кінець залежить від знака *k*). Зауважте, *k* не може дорівнювати нулю. Якщо *k* має значення ``None``, воно розглядається як ``1``.
