Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: fa, ru, uk

source: Return ``True`` if all characters in the string are numeric characters, and there is at least one character, ``False`` otherwise. Numeric characters include digit characters, and all characters that have the Unicode numeric value property, e.g. U+2155, VULGAR FRACTION ONE FIFTH. Formally, numeric characters are those with the property value Numeric_Type=Digit, Numeric_Type=Decimal or Numeric_Type=Numeric.
fa: اگر همه کاراکترهای رشته دارای کاراکترهای عددی هستند و حداقل یک کاراکتر وجود دارد، ``True`` را برگردانید، در غیر این صورت ``False``. کاراکترهای عددی شامل کاراکترهای رقمی هستند و همه کاراکترهایی که دارای خاصیت مقدار عددی یونیکد هستند، به عنوان مثال. U+2155، کسری مبتذل یک پنجم. به طور رسمی، کاراکترهای عددی آنهایی هستند که دارای مقدار ویژگی Numeric_Type=رقم، Numeric_Type=اعشاری یا Numeric_Type=Numeric هستند.
ru: Возвращаться ``Правда`` если все символы в строке являются цифрами и имеется хотя бы один символ, ``Ложь`` в противном случае. К числовым символам относятся цифры и все символы, имеющие свойство числового значения Юникода, например U+2155, ОБЫЧНАЯ ДРОБЬ ОДНА ПЯТАЯ. Формально числовыми символами являются символы со значением свойства Numeric_Type=Digit, Numeric_Type=Decimal или Numeric_Type=Numeric.
uk: Повертає ``True``, якщо всі символи в рядку є цифровими символами, і є принаймні один символ, ``False`` інакше. Цифрові символи включають цифрові символи та всі символи, які мають властивість числового значення Unicode, напр. U+2155, ВУЛЬГАРНА ФРАКЦІЯ ОДНА П’ЯТА. Формально цифровими символами є символи зі значенням властивості Numeric_Type=Digit, Numeric_Type=Decimal або Numeric_Type=Numeric.

source: Return ``True`` if there are only whitespace characters in the string and there is at least one character, ``False`` otherwise.
fa: اگر فقط کاراکترهای فضای خالی در رشته وجود دارد و حداقل یک کاراکتر وجود دارد، ``True`` را برگردانید، در غیر این صورت ``False``.
ru: Возвращаться ``Правда`` если в строке есть только пробельные символы и есть хотя бы один символ, ``Ложь`` в противном случае.
uk: Повертає ``True``, якщо в рядку є лише пробіли та є принаймні один символ, ``False`` інакше.

source: A character is *whitespace* if in the Unicode character database (see :mod:`unicodedata`), either its general category is ``Zs`` ("Separator, space"), or its bidirectional class is one of ``WS``, ``B``, or ``S``.
fa: یک کاراکتر اگر در پایگاه داده کاراکترهای یونیکد (به :mod:`unicodedata` مراجعه کنید), یا دسته کلی آن ``Zs`` («جداکننده, فاصله») باشد، یا کلاس دوطرفه آن یکی از ``WS``، ``B`` یا ``S`` باشد، *whitespace* است.
ru: Символ является *пробелом*, если он находится в базе данных символов Юникода (см. :mod:`unicodedata` ), либо его общая категория ``Зс`` («Разделитель, пробел»), или его двунаправленный класс является одним из ``WS`` , ``Б`` , или ``С`` .
uk: Символ є *пробілом*, якщо в базі даних символів Unicode (див. :mod:`unicodedata`) або його загальна категорія ``Zs`` ("Роздільник, пробіл"), або його двонаправлений клас є одним із ``WS``, ``B`` або ``S``.

source: Return ``True`` if the string is a titlecased string and there is at least one character, for example uppercase characters may only follow uncased characters and lowercase characters only cased ones. Return ``False`` otherwise.
fa: اگر رشته یک رشته با حروف عنوان است و حداقل یک کاراکتر وجود دارد، ``True`` را برگردانید، به عنوان مثال، کاراکترهای بزرگ ممکن است فقط از کاراکترهای بدون حروف و کاراکترهای کوچک فقط به دنبال کاراکترهای حروف کوچک باشند. در غیر این صورت ``False`` را برگردانید.
ru: Возвращаться ``Правда`` если строка представляет собой строку с заголовком и содержит хотя бы один символ, например, символы верхнего регистра могут следовать только за символами без регистра, а символы нижнего регистра - только за символами с регистром. Возвращаться ``Ложь`` в противном случае.
uk: Повертає ``True``, якщо рядок є рядком із заголовком і містить принаймні один символ, наприклад, символи верхнього регістру можуть слідувати лише за символами без регістру, а символи нижнього регістру – лише за символами в регістрі. В іншому випадку поверніть ``False``.

source: Return ``True`` if all cased characters [4]_ in the string are uppercase and there is at least one cased character, ``False`` otherwise.
fa: اگر همه کاراکترهای با حروف [4]_ در رشته بزرگ باشند و حداقل یک کاراکتر با حروف وجود داشته باشد، ``True`` را برگردانید، در غیر این صورت ``False``.
ru: Возвращаться ``Правда`` если все символы в регистре [4]_ в строке указаны прописные буквы и есть хотя бы один регистровый символ, ``Ложь`` в противном случае.
uk: Повертає ``True``, якщо всі символи регістру [4]_ в рядку є верхніми і є принаймні один символ регістру, ``False`` інакше.

source: Return a string which is the concatenation of the strings in *iterable*. A :exc:`TypeError` will be raised if there are any non-string values in *iterable*, including :class:`bytes` objects. The separator between elements is the string providing this method.
fa: رشته ای را برگردانید که الحاق رشته ها در *iterable* است. اگر مقادیر غیر رشته ای در *iterable* از جمله اشیاء :class:`bytes` وجود داشته باشد، یک :exc:`TypeError` بالا می رود. جداکننده بین عناصر رشته ای است که این روش را ارائه می دهد.
ru: Возвращает строку, которая представляет собой объединение строк в *iterable*. А :exc:`TypeError` будет поднято, если в *iterable* есть какие-либо нестроковые значения, включая :class:`байты` объекты. Разделителем между элементами является строка, предоставляющая этот метод.
uk: Повертає рядок, який є конкатенацією рядків у *iterable*. Помилка :exc:`TypeError` буде викликана, якщо в *iterable* є будь-які нерядкові значення, включаючи об’єкти :class:`bytes`. Роздільником між елементами є рядок, що забезпечує цей метод.

source: Return the string left justified in a string of length *width*. Padding is done using the specified *fillchar* (default is an ASCII space). The original string is returned if *width* is less than or equal to ``len(s)``.
fa: رشته سمت چپ توجیه شده در رشته ای به طول *width* را برگردانید. Padding با استفاده از *fillchar* مشخص شده انجام می شود (پیش فرض یک فضای ASCII است). اگر *width* کمتر یا مساوی با ``len(s)`` باشد، رشته اصلی برگردانده می شود.
ru: Возвращает строку длиной *ширина*, выровненную по левому краю. Заполнение выполняется с использованием указанного *fillchar* (по умолчанию используется пробел ASCII). Исходная строка возвращается, если *ширина* меньше или равна ``лен(ы)`` .
uk: Повертає рядок, вирівняний за лівим краєм, у рядку довжини *width*. Заповнення виконується за допомогою вказаного *fillchar* (за замовчуванням це пробіл ASCII). Оригінальний рядок повертається, якщо *width* менше або дорівнює ``len(s)``.

source: Return a copy of the string with all the cased characters [4]_ converted to lowercase.
fa: یک کپی از رشته را با تمام حروف کوچک [4]_ به حروف کوچک تبدیل کنید.
ru: Вернуть копию строки со всеми регистровыми символами [4]_ преобразован в нижний регистр.
uk: Повертає копію рядка з усіма регістровими символами [4]_, перетвореними на нижній регістр.

source: The lowercasing algorithm used is `described in section 3.13 'Default Case Folding' of the Unicode Standard <https://www.unicode.org/versions/Unicode15.1.0/ch03.pdf>`__.
fa: الگوریتم حروف کوچک مورد استفاده `described in section 3.13 'Default Case Folding' of the Unicode Standard <https://www.unicode.org/versions/Unicode15.1.0/ch03.pdf>`__ است.

source: Return a copy of the string with leading characters removed. The *chars* argument is a string specifying the set of characters to be removed. If omitted or ``None``, the *chars* argument defaults to removing whitespace. The *chars* argument is not a prefix; rather, all combinations of its values are stripped::
fa: یک کپی از رشته را با نویسه های اصلی حذف شده برگردانید. آرگومان *chars* رشته ای است که مجموعه کاراکترهایی را که باید حذف شوند را مشخص می کند. اگر حذف شود یا ``None``، آرگومان *chars* به طور پیش‌فرض فضای خالی را حذف می‌کند. آرگومان *chars* یک پیشوند نیست. بلکه تمام ترکیبات مقادیر آن حذف می شوند::
ru: Верните копию строки с удаленными ведущими символами. Аргумент *chars* представляет собой строку, определяющую набор символов, которые необходимо удалить. Если опущено или ``Нет`` , аргумент *chars* по умолчанию удаляет пробелы. Аргумент *chars* не является префиксом; скорее, все комбинации его значений удаляются::
uk: Повертає копію рядка з видаленими початковими символами. Аргумент *chars* — це рядок, який визначає набір символів, які потрібно видалити. Якщо пропущено або ``None``, аргумент *chars* за умовчанням видаляє пробіли. Аргумент *chars* не є префіксом; навпаки, усі комбінації його значень видаляються:

source: See :meth:`str.removeprefix` for a method that will remove a single prefix string rather than all of a set of characters. For example::
fa: :meth:`str.removeprefix` را برای روشی ببینید که یک رشته پیشوند واحد را به جای همه مجموعه ای از کاراکترها حذف می کند. به عنوان مثال::
ru: Видеть :meth:`str.removeprefix` для метода, который удалит одну строку префикса, а не весь набор символов. Например::
uk: Перегляньте :meth:`str.removeprefix` для методу, який видаляє один рядок префікса, а не весь набір символів. Наприклад::

source: This static method returns a translation table usable for :meth:`str.translate`.
fa: این روش استاتیک یک جدول ترجمه قابل استفاده برای :meth:`str.translate` را برمی گرداند.
ru: Этот статический метод возвращает таблицу перевода, пригодную для :meth:`str.translate` .
uk: Цей статичний метод повертає таблицю перекладу, яку можна використовувати для :meth:`str.translate`.

source: If there is only one argument, it must be a dictionary mapping Unicode ordinals (integers) or characters (strings of length 1) to Unicode ordinals, strings (of arbitrary lengths) or ``None``. Character keys will then be converted to ordinals.
fa: اگر تنها یک آرگومان وجود داشته باشد، باید یک فرهنگ لغت باشد که ترتیبات یونیکد (اعداد صحیح) یا کاراکترها (رشته های طول 1) را به ترتیبات یونیکد، رشته ها (با طول دلخواه) یا ``None`` نگاشت می کند. سپس کلیدهای کاراکتر به ترتیبی تبدیل می شوند.
ru: Если имеется только один аргумент, это должен быть словарь, отображающий порядковые номера Юникода (целые числа) или символы (строки длины 1) в порядковые номера Юникода, строки (произвольной длины) или ``Нет`` . Ключи символов будут преобразованы в порядковые номера.
uk: Якщо є лише один аргумент, це має бути словник, який відображає порядкові номери Unicode (цілі числа) або символи (рядки довжиною 1) на порядкові номери Unicode, рядки (довільної довжини) або ``None``. Потім символьні ключі будуть перетворені на порядкові.

source: If there are two arguments, they must be strings of equal length, and in the resulting dictionary, each character in x will be mapped to the character at the same position in y. If there is a third argument, it must be a string, whose characters will be mapped to ``None`` in the result.
fa: اگر دو آرگومان وجود داشته باشد، آنها باید رشته هایی با طول مساوی باشند و در فرهنگ لغت حاصل، هر کاراکتر x در همان موقعیت در y به کاراکتر نگاشت می شود. اگر آرگومان سومی وجود داشته باشد، باید رشته ای باشد که کاراکترهای آن در نتیجه به ``None`` نگاشت می شوند.
ru: Если есть два аргумента, они должны быть строками одинаковой длины, и в результирующем словаре каждый символ x будет сопоставлен с символом в той же позиции в y. Если есть третий аргумент, это должна быть строка, символы которой будут сопоставлены с ``Нет`` в результате.
uk: Якщо є два аргументи, вони мають бути рядками однакової довжини, і в отриманому словнику кожен символ у x буде зіставлено зі символом у тій же позиції в y. Якщо є третій аргумент, це має бути рядок, символи якого будуть зіставлені на ``None`` у результаті.

source: Split the string at the first occurrence of *sep*, and return a 3-tuple containing the part before the separator, the separator itself, and the part after the separator. If the separator is not found, return a 3-tuple containing the string itself, followed by two empty strings.
fa: رشته را در اولین رخداد *sep* تقسیم کنید و یک 3 تایی حاوی قسمت قبل از جداکننده، خود جداکننده و قسمت بعد از جداکننده را برگردانید. اگر جداکننده پیدا نشد، یک 3 تایی حاوی خود رشته و به دنبال آن دو رشته خالی برگردانید.
ru: Разделите строку при первом появлении *sep* и верните кортеж из трех частей, содержащий часть перед разделителем, сам разделитель и часть после разделителя. Если разделитель не найден, верните тройной кортеж, содержащий саму строку, за которой следуют две пустые строки.
uk: Розділіть рядок при першому входженні *sep* і поверніть 3-кортеж, що містить частину перед роздільником, сам роздільник і частину після роздільника. Якщо роздільник не знайдено, поверніть 3-кортеж, що містить сам рядок, а потім два порожні рядки.

source: If the string starts with the *prefix* string, return ``string[len(prefix):]``. Otherwise, return a copy of the original string::
fa: اگر رشته با رشته *prefix* شروع می شود، ``string[len(prefix):]`` را برگردانید. در غیر این صورت، یک کپی از رشته اصلی را برگردانید::
ru: Если строка начинается со строки *префикс*, верните ``строка[длин(префикс):]`` . В противном случае верните копию исходной строки::
uk: Якщо рядок починається з рядка *prefix*, поверніть ``string[len(prefix):]``. В іншому випадку поверніть копію оригінального рядка::

source: If the string ends with the *suffix* string and that *suffix* is not empty, return ``string[:-len(suffix)]``. Otherwise, return a copy of the original string::
fa: اگر رشته به رشته *suffix* ختم می شود و *suffix* خالی نیست، ``string[:-len(suffix)]`` را برگردانید. در غیر این صورت، یک کپی از رشته اصلی را برگردانید::
ru: Если строка заканчивается строкой *суффикс* и этот *суффикс* не пуст, верните ``строка[:-len(суффикс)]`` . В противном случае верните копию исходной строки::
uk: Якщо рядок закінчується рядком *suffix* і цей *suffix* не є порожнім, поверніть ``string[:-len(suffix)]``. В іншому випадку поверніть копію оригінального рядка::

source: Return a copy of the string with all occurrences of substring *old* replaced by *new*. If *count* is given, only the first *count* occurrences are replaced. If *count* is not specified or ``-1``, then all occurrences are replaced.
fa: یک کپی از رشته را با همه موارد زیر رشته *old* به جای *new* برگردانید. اگر *count* داده شود، فقط اولین رخدادهای *count* جایگزین می شوند. اگر *count* یا ``-1`` مشخص نشده باشد، تمام رخدادها جایگزین می شوند.

source: *count* is now supported as a keyword argument.
fa: *count* اکنون به عنوان آرگومان کلمه کلیدی پشتیبانی می شود.

source: Return the highest index in the string where substring *sub* is found, such that *sub* is contained within ``s[start:end]``. Optional arguments *start* and *end* are interpreted as in slice notation. Return ``-1`` on failure.
fa: بالاترین شاخص را در رشته ای که زیررشته *sub* یافت می شود، برگردانید، به طوری که *sub* در ``s[start:end]`` قرار دارد. آرگومان های اختیاری *start* و *end* به صورت نمادگذاری برش تفسیر می شوند. ``-1`` را در صورت خرابی برگردانید.
ru: Возвращает наибольший индекс в строке, где найдена подстрока *sub*, такая, что *sub* содержится внутри ``s[начало:конец]`` . Необязательные аргументы *start* и *end* интерпретируются как в нотации среза. Возвращаться ``-1`` при неудаче.
uk: Повертає найвищий індекс у рядку, де знайдено підрядок *sub*, так що *sub* міститься в ``s[start:end]``. Необов’язкові аргументи *початок* і *кінець* інтерпретуються як у нотації фрагментів. Повернути ``-1`` у разі помилки.

source: Like :meth:`rfind` but raises :exc:`ValueError` when the substring *sub* is not found.
fa: مانند :meth:`rfind` اما زمانی که زیر رشته *sub* یافت نمی شود، :exc:`ValueError` را افزایش می دهد.
ru: Нравиться :meth:`rfind` но поднимает :exc:`ValueError` когда подстрока *sub* не найдена.
uk: Подібно до :meth:`rfind`, але викликає :exc:`ValueError`, коли підрядок *sub* не знайдено.

source: Return the string right justified in a string of length *width*. Padding is done using the specified *fillchar* (default is an ASCII space). The original string is returned if *width* is less than or equal to ``len(s)``.
fa: رشته ای را که در رشته ای به طول *width* توجیه شده است به سمت راست برگردانید. Padding با استفاده از *fillchar* مشخص شده انجام می شود (پیش فرض یک فضای ASCII است). اگر *width* کمتر یا مساوی با ``len(s)`` باشد، رشته اصلی برگردانده می شود.
ru: Возвращает строку длиной *ширина*, выровненную по правому краю. Заполнение выполняется с использованием указанного *fillchar* (по умолчанию используется пробел ASCII). Исходная строка возвращается, если *ширина* меньше или равна ``лен(ы)`` .
uk: Повертає рядок, вирівняний по правому краю, у рядку довжини *width*. Заповнення виконується за допомогою вказаного *fillchar* (за замовчуванням це пробіл ASCII). Оригінальний рядок повертається, якщо *width* менше або дорівнює ``len(s)``.

source: Split the string at the last occurrence of *sep*, and return a 3-tuple containing the part before the separator, the separator itself, and the part after the separator. If the separator is not found, return a 3-tuple containing two empty strings, followed by the string itself.
fa: رشته را در آخرین رخداد *sep* تقسیم کنید و یک 3 تایی حاوی قسمت قبل از جداکننده، خود جداکننده و قسمت بعد از جداکننده را برگردانید. اگر جداکننده پیدا نشد، یک 3 تایی حاوی دو رشته خالی و به دنبال آن خود رشته برگردانید.
ru: Разделите строку по последнему вхождению *sep* и верните тройной кортеж, содержащий часть перед разделителем, сам разделитель и часть после разделителя. Если разделитель не найден, верните тройной кортеж, содержащий две пустые строки, за которыми следует сама строка.
uk: Розділіть рядок на останнє входження *sep* і поверніть 3-кортеж, що містить частину перед роздільником, сам роздільник і частину після роздільника. Якщо роздільник не знайдено, поверніть 3-кортеж, що містить два порожні рядки, а потім сам рядок.

source: Return a list of the words in the string, using *sep* as the delimiter string. If *maxsplit* is given, at most *maxsplit* splits are done, the *rightmost* ones. If *sep* is not specified or ``None``, any whitespace string is a separator. Except for splitting from the right, :meth:`rsplit` behaves like :meth:`split` which is described in detail below.
fa: فهرستی از کلمات موجود در رشته را با استفاده از *sep* به عنوان رشته جداکننده برگردانید. اگر *maxsplit* داده شود، حداکثر تقسیم *maxsplit* انجام می شود، آنهایی که *rightmost* هستند. اگر *sep* یا ``None`` مشخص نشده باشد، هر رشته فضای خالی یک جداکننده است. به جز تقسیم از راست، :meth:`rsplit` مانند :meth:`split` رفتار می کند که در زیر به تفصیل توضیح داده شده است.
ru: Возвращает список слов в строке, используя *sep* в качестве строки-разделителя. Если указано *maxsplit*, выполняется не более *maxsplit* разбиений, *самых правых*. Если *sep* не указано или ``Нет`` , любая строка пробелов является разделителем. За исключением раскола справа, :meth:`rsplit` ведет себя как :meth:`сплит` что подробно описано ниже.
uk: Повертає список слів у рядку, використовуючи *sep* як роздільник. Якщо задано *maxsplit*, виконується щонайбільше *maxsplit* розбиття, *найправіші*. Якщо *sep* не вказано або ``None``, будь-який пробільний рядок є роздільником. За винятком розділення справа, :meth:`rsplit` поводиться як :meth:`split`, що детально описано нижче.

source: Return a copy of the string with trailing characters removed. The *chars* argument is a string specifying the set of characters to be removed. If omitted or ``None``, the *chars* argument defaults to removing whitespace. The *chars* argument is not a suffix; rather, all combinations of its values are stripped::
fa: یک کپی از رشته با حذف کاراکترهای انتهایی برگردانید. آرگومان *chars* رشته ای است که مجموعه کاراکترهایی را که باید حذف شوند را مشخص می کند. اگر حذف شود یا ``None``، آرگومان *chars* به طور پیش‌فرض فضای خالی را حذف می‌کند. آرگومان *chars* پسوند نیست. بلکه تمام ترکیبات مقادیر آن حذف می شوند::
ru: Верните копию строки с удаленными конечными символами. Аргумент *chars* представляет собой строку, определяющую набор символов, которые необходимо удалить. Если опущено или ``Нет`` , аргумент *chars* по умолчанию удаляет пробелы. Аргумент *chars* не является суффиксом; скорее, все комбинации его значений удаляются::
uk: Повертає копію рядка з видаленими кінцевими символами. Аргумент *chars* — це рядок, який визначає набір символів, які потрібно видалити. Якщо пропущено або ``None``, аргумент *chars* за умовчанням видаляє пробіли. Аргумент *chars* не є суфіксом; навпаки, усі комбінації його значень видаляються:

source: See :meth:`str.removesuffix` for a method that will remove a single suffix string rather than all of a set of characters. For example::
fa: :meth:`str.removesuffix` را برای روشی ببینید که یک رشته پسوند واحد را به جای همه مجموعه ای از کاراکترها حذف می کند. به عنوان مثال::
ru: Видеть :meth:`str.removesuffix` для метода, который удалит одну суффиксную строку, а не весь набор символов. Например::
uk: Перегляньте :meth:`str.removesuffix` для методу, який видаляє один рядок суфікса, а не весь набір символів. Наприклад::

source: Return a list of the words in the string, using *sep* as the delimiter string. If *maxsplit* is given, at most *maxsplit* splits are done (thus, the list will have at most ``maxsplit+1`` elements). If *maxsplit* is not specified or ``-1``, then there is no limit on the number of splits (all possible splits are made).
fa: فهرستی از کلمات موجود در رشته را با استفاده از *sep* به عنوان رشته جداکننده برگردانید. اگر *maxsplit* داده شود، حداکثر تقسیم *maxsplit* انجام می شود (بنابراین, لیست حداکثر دارای عناصر ``maxsplit+1`` خواهد بود). اگر *maxsplit* یا ``-1`` مشخص نشده باشد، محدودیتی در تعداد تقسیم ها وجود ندارد (همه تقسیم های ممکن انجام می شود).
ru: Возвращает список слов в строке, используя *sep* в качестве строки-разделителя. Если указано *maxsplit*, будет выполнено не более *maxsplit* разбиений (таким образом, в списке будет не более ``макссплит+1`` элементы). Если *maxsplit* не указано или ``-1`` , то количество разбиений не ограничено (сделаны все возможные разбиения).
uk: Повертає список слів у рядку, використовуючи *sep* як роздільник. Якщо вказано *maxsplit*, виконується щонайбільше *maxsplit* розбиття (отже, список міститиме щонайбільше елементів ``maxsplit+1``). Якщо *maxsplit* не вказано або ``-1``, тоді немає обмеження на кількість розділень (виконуються всі можливі розділення).

source: If *sep* is given, consecutive delimiters are not grouped together and are deemed to delimit empty strings (for example, ``'1,,2'.split(',')`` returns ``['1', '', '2']``). The *sep* argument may consist of multiple characters as a single delimiter (to split with multiple delimiters, use :func:`re.split`). Splitting an empty string with a specified separator returns ``['']``.
fa: اگر *sep* داده شود، جداکننده های متوالی با هم گروه بندی نمی شوند و به نظر می رسد که رشته های خالی را محدود می کنند (برای مثال, ``'1,,2'.split(',')`` ``['1', '', '2']`` را برمی گرداند). آرگومان *sep* ممکن است از چندین کاراکتر به عنوان یک جداکننده منفرد تشکیل شده باشد (برای تقسیم با چند جداکننده, از :func:`re.split` استفاده کنید). تقسیم یک رشته خالی با جداکننده مشخص شده, ``['']`` را برمی گرداند.

source: For example::
fa: به عنوان مثال::
ru: Например::
uk: Наприклад::
