Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: fa, ru, uk

source: If *sep* is not specified or is ``None``, a different splitting algorithm is applied: runs of consecutive whitespace are regarded as a single separator, and the result will contain no empty strings at the start or end if the string has leading or trailing whitespace. Consequently, splitting an empty string or a string consisting of just whitespace with a ``None`` separator returns ``[]``.
fa: اگر *sep* مشخص نشده باشد یا ``None`` باشد، یک الگوریتم تقسیم متفاوت اعمال می‌شود: اجراهای فضای سفید متوالی به عنوان یک جداکننده در نظر گرفته می‌شوند و در صورتی که رشته دارای فضای سفید پیشرو یا انتهایی باشد، نتیجه در ابتدا یا انتهای آن رشته‌ای خالی نخواهد داشت. در نتیجه، تقسیم یک رشته خالی یا رشته ای که فقط از فضای خالی با جداکننده ``None`` تشکیل شده است، ``[]`` را برمی گرداند.
ru: Если *sep* не указано или ``Нет`` , применяется другой алгоритм разделения: серии последовательных пробелов рассматриваются как один разделитель, и результат не будет содержать пустых строк в начале или конце, если строка имеет начальные или конечные пробелы. Следовательно, разделение пустой строки или строки, состоящей только из пробелов, с помощью ``Нет`` разделитель возвращает ``[]`` .
uk: Якщо *sep* не вказано або має значення ``None``, застосовується інший алгоритм поділу: цикли послідовних пробілів розглядаються як один роздільник, і результат не міститиме порожніх рядків на початку або в кінці, якщо рядок має пробіли на початку або в кінці. Отже, розділення порожнього рядка або рядка, що складається лише з пробілів, за допомогою розділювача ``None`` повертає ``[]``.

source: Return a list of the lines in the string, breaking at line boundaries. Line breaks are not included in the resulting list unless *keepends* is given and true.
fa: فهرستی از خطوط در رشته را برگردانید که در مرزهای خط شکسته می شوند. شکست خط در لیست حاصل گنجانده نمی شود مگر اینکه *keepends* داده شده و درست باشد.
ru: Возвращает список строк в строке, разрывающихся на границах строк. Разрывы строк не включаются в результирующий список, если не указано значение *keepends* и истинное значение.
uk: Повертає список рядків у рядку, розриваючи межі рядків. Розриви рядків не включаються в результуючий список, якщо *keepends* не задано і не відповідає дійсності.

source: This method splits on the following line boundaries. In particular, the boundaries are a superset of :term:`universal newlines`.
fa: این روش بر روی مرزهای خط زیر تقسیم می شود. به طور خاص، مرزها ابر مجموعه ای از :term:`universal newlines` هستند.
ru: Этот метод разбивается на следующих границах строк. В частности, границы представляют собой расширенный набор :term:`универсальных символов новой строки`.
uk: Цей метод розбивається на наступні межі рядків. Зокрема, межі є надмножиною :term:`universal newlines`.

source: Representation
fa: نمایندگی
ru: Представление
uk: Представництво

source: Description
fa: توضیحات
ru: Описание
uk: опис

source: Line Feed
fa: تغذیه خط
ru: Перевод строки
uk: Переведення рядка

source: Carriage Return
fa: کالسکه برگشت
ru: Возврат каретки
uk: Повернення каретки

source: Carriage Return + Line Feed
fa: کالسکه برگشت + تغذیه خط
ru: Возврат каретки + перевод строки
uk: Повернення каретки + Переведення рядка

source: ``\v`` or ``\x0b``
fa: ``\v`` یا ``\x0b``
ru: ``\v`` или ``\x0b``
uk: ``\v`` або ``\x0b``

source: Line Tabulation
fa: جدول بندی خط
ru: Табуляция строк
uk: Лінія табуляції

source: ``\f`` or ``\x0c``
fa: ``\f`` یا ``\x0c``
ru: ``\f`` или ``\x0c``
uk: ``\f`` або ``\x0c``

source: Form Feed
fa: فید فرم
ru: Перевод каретки
uk: Подача форми

source: File Separator
fa: جداکننده فایل
ru: Разделитель файлов
uk: Роздільник файлів

source: Group Separator
fa: جداکننده گروه
ru: Разделитель групп
uk: Роздільник груп

source: Record Separator
fa: جداکننده رکورد
ru: Разделитель записей
uk: Розділювач записів

source: Next Line (C1 Control Code)
fa: خط بعدی (کد کنترل C1)
ru: Следующая строка (код управления C1)
uk: Наступний рядок (контрольний код C1)

source: Line Separator
fa: جداکننده خطوط
ru: Разделитель строк
uk: Розділювач рядків

source: Paragraph Separator
fa: جداکننده پاراگراف
ru: Разделитель абзацев
uk: Роздільник абзаців

source: ``\v`` and ``\f`` added to list of line boundaries.
fa: ``\v`` و ``\f`` به لیست مرزهای خطوط اضافه شدند.
ru: ``\v`` и ``\f`` добавлен в список границ линий.
uk: ``\v`` і ``\f`` додано до списку меж ліній.

source: Unlike :meth:`~str.split` when a delimiter string *sep* is given, this method returns an empty list for the empty string, and a terminal line break does not result in an extra line::
fa: برخلاف :meth:`~str.split` که یک رشته جداکننده *sep* داده می شود، این روش یک لیست خالی برای رشته خالی برمی گرداند و شکست خط پایانی منجر به یک خط اضافی نمی شود:
ru: В отличие от :meth:`~str.split` если указана строка-разделитель *sep*, этот метод возвращает пустой список для пустой строки, а разрыв конечной строки не приводит к появлению дополнительной строки::
uk: На відміну від :meth:`~str.split`, коли задано рядок роздільника *sep*, цей метод повертає порожній список для порожнього рядка, а розрив кінцевого рядка не призводить до додаткового рядка::

source: For comparison, ``split('\n')`` gives::
fa: برای مقایسه، ``split('\n')`` می دهد:
ru: Для сравнения: ``split('\n')`` дает::
uk: Для порівняння ``split('\n')`` дає:

source: Return ``True`` if string starts with the *prefix*, otherwise return ``False``. *prefix* can also be a tuple of prefixes to look for. With optional *start*, test string beginning at that position. With optional *end*, stop comparing string at that position.
fa: اگر رشته با *prefix* شروع شد، ``True`` را برگردانید، در غیر این صورت ``False`` را برگردانید. *prefix* همچنین می تواند چندین پیشوند برای جستجو باشد. با *start* اختیاری، رشته را از همان موقعیت شروع کنید. با *end* اختیاری، مقایسه رشته در آن موقعیت را متوقف کنید.
ru: Возвращаться ``Правда`` если строка начинается с *префикса*, в противном случае возврат ``Ложь`` . *prefix* также может представлять собой кортеж префиксов для поиска. Если используется необязательный *start*, тестовая строка начинается с этой позиции. Если используется необязательный *end*, прекратите сравнение строки в этой позиции.
uk: Повертає ``True``, якщо рядок починається з *префікса*, інакше повертає ``False``. *префікс* також може бути кортежем префіксів для пошуку. З необов’язковим *початком*, тестовий рядок починається з цієї позиції. З необов’язковим *end* припиняє порівнювати рядок у цій позиції.

source: Return a copy of the string with the leading and trailing characters removed. The *chars* argument is a string specifying the set of characters to be removed. If omitted or ``None``, the *chars* argument defaults to removing whitespace. The *chars* argument is not a prefix or suffix; rather, all combinations of its values are stripped::
fa: یک کپی از رشته را با حذف کاراکترهای اصلی و انتهایی برگردانید. آرگومان *chars* رشته ای است که مجموعه کاراکترهایی را که باید حذف شوند را مشخص می کند. اگر حذف شود یا ``None``، آرگومان *chars* به طور پیش‌فرض فضای خالی را حذف می‌کند. آرگومان *chars* یک پیشوند یا پسوند نیست. بلکه تمام ترکیبات مقادیر آن حذف می شوند::
ru: Верните копию строки с удаленными ведущими и конечными символами. Аргумент *chars* представляет собой строку, определяющую набор символов, которые необходимо удалить. Если опущено или ``Нет`` , аргумент *chars* по умолчанию удаляет пробелы. Аргумент *chars* не является префиксом или суффиксом; скорее, все комбинации его значений удаляются::
uk: Повертає копію рядка з видаленими початковими та кінцевими символами. Аргумент *chars* — це рядок, який визначає набір символів, які потрібно видалити. Якщо пропущено або ``None``, аргумент *chars* за умовчанням видаляє пробіли. Аргумент *chars* не є префіксом або суфіксом; навпаки, усі комбінації його значень видаляються:

source: The outermost leading and trailing *chars* argument values are stripped from the string. Characters are removed from the leading end until reaching a string character that is not contained in the set of characters in *chars*. A similar action takes place on the trailing end. For example::
fa: بیرونی ترین مقادیر آرگومان *chars* پیشرو و انتهایی از رشته حذف می شوند. کاراکترها تا رسیدن به یک کاراکتر رشته ای که در مجموعه کاراکترها در *chars* وجود ندارد، از انتهای اصلی حذف می شوند. یک عمل مشابه در انتهای انتهایی انجام می شود. به عنوان مثال::
ru: Крайние начальные и конечные значения аргументов *chars* удаляются из строки. Символы удаляются с начального конца до тех пор, пока не будет достигнут строковый символ, не содержащийся в наборе символов в *chars*. Аналогичное действие происходит и на заднем конце. Например::
uk: Зовнішні початкові та кінцеві значення аргументів *chars* видаляються з рядка. Символи видаляються з початку, доки не досягнеться символ рядка, який не міститься в наборі символів у *chars*. Подібна дія відбувається на кінці. Наприклад::

source: Return a copy of the string with uppercase characters converted to lowercase and vice versa. Note that it is not necessarily true that ``s.swapcase().swapcase() == s``.
fa: یک کپی از رشته را با حروف بزرگ به حروف کوچک و بالعکس برگردانید. توجه داشته باشید که لزوماً ``s.swapcase().swapcase() == s`` درست نیست.
ru: Возвращает копию строки с символами верхнего регистра, преобразованными в нижний регистр, и наоборот. Обратите внимание, что это не обязательно верно, что ``s.swapcase().swapcase() == s`` .
uk: Повертає копію рядка з символами верхнього регістру, перетвореними на малі, і навпаки. Зауважте, що ``s.swapcase().swapcase() == s`` не обов’язково правда.

source: Return a titlecased version of the string where words start with an uppercase character and the remaining characters are lowercase.
fa: یک نسخه با حروف عنوان رشته را برگردانید که در آن کلمات با یک کاراکتر بزرگ شروع می شوند و کاراکترهای باقی مانده با حروف کوچک هستند.
ru: Возвращает версию строки с заголовком, где слова начинаются с символа верхнего регистра, а остальные символы — строчные.
uk: Повертає версію рядка в заголовку, де слова починаються з великої літери, а решта символів – нижніми.

source: The algorithm uses a simple language-independent definition of a word as groups of consecutive letters. The definition works in many contexts but it means that apostrophes in contractions and possessives form word boundaries, which may not be the desired result::
fa: این الگوریتم از یک تعریف ساده مستقل از زبان از یک کلمه به عنوان گروه هایی از حروف متوالی استفاده می کند. این تعریف در بسیاری از زمینه ها کار می کند، اما به این معنی است که آپاستروف ها در انقباضات و مالکیت ها مرزهای کلمه را تشکیل می دهند، که ممکن است نتیجه مطلوب نباشد:
ru: Алгоритм использует простое независимое от языка определение слова как группы последовательных букв. Определение работает во многих контекстах, но это означает, что апострофы в сокращениях и притяжательных падежах образуют границы слов, что может быть нежелательным результатом:
uk: Алгоритм використовує просте незалежне від мови визначення слова як групи послідовних букв. Визначення працює в багатьох контекстах, але це означає, що апостроф у скороченнях і присвійних формах формує межі слів, що може бути не бажаним результатом:

source: The :func:`string.capwords` function does not have this problem, as it splits words on spaces only.
fa: تابع :func:`string.capwords` این مشکل را ندارد، زیرا کلمات را فقط در فاصله ها تقسیم می کند.
ru: The :func:`string.capwords` Функция не имеет этой проблемы, поскольку она разбивает слова только на пробелы.
uk: Функція :func:`string.capwords` не має цієї проблеми, оскільки вона розділяє слова лише на пробіли.

source: Alternatively, a workaround for apostrophes can be constructed using regular expressions::
fa: روش دیگر، یک راه حل برای آپستروف ها می تواند با استفاده از عبارات منظم ساخته شود:
ru: Альтернативно, обходной путь для апострофов можно создать с помощью регулярных выражений:
uk: Крім того, обхідний шлях для апострофів можна створити за допомогою регулярних виразів::

source: Return a copy of the string in which each character has been mapped through the given translation table. The table must be an object that implements indexing via :meth:`~object.__getitem__`, typically a :term:`mapping` or :term:`sequence`. When indexed by a Unicode ordinal (an integer), the table object can do any of the following: return a Unicode ordinal or a string, to map the character to one or more other characters; return ``None``, to delete the character from the return string; or raise a :exc:`LookupError` exception, to map the character to itself.
fa: یک کپی از رشته ای که در آن هر کاراکتر از طریق جدول ترجمه داده شده نگاشت شده است، برگردانید. جدول باید یک شی باشد که نمایه سازی را از طریق :meth:`~object.__getitem__`، معمولاً یک :term:`mapping` یا :term:`sequence` پیاده سازی می کند. هنگامی که توسط یک ترتیبی یونیکد (یک عدد صحیح) ایندکس می شود، شی جدول می تواند یکی از کارهای زیر را انجام دهد: یک ترتیب یونیکد یا یک رشته را برگرداند تا کاراکتر را به یک یا چند کاراکتر دیگر نگاشت کند. بازگشت ``None``، برای حذف کاراکتر از رشته بازگشت؛ یا یک استثنای :exc:`LookupError` را برای نگاشت کاراکتر به خودش مطرح کنید.
ru: Возвращает копию строки, в которой каждый символ сопоставлен с помощью данной таблицы перевода. Таблица должна быть объектом, реализующим индексацию через :meth:`~object.__getitem__` , обычно это :term:`отображение` или :term:`sequence`. При индексировании порядковым номером Юникода (целым числом) объект таблицы может выполнять любое из следующих действий: возвращать порядковый номер Юникода или строку для сопоставления символа с одним или несколькими другими символами; возвращаться ``Нет`` , чтобы удалить символ из возвращаемой строки; или поднять :exc:`Ошибка поиска` исключение, чтобы сопоставить персонаж с самим собой.

source: You can use :meth:`str.maketrans` to create a translation map from character-to-character mappings in different formats.
fa: می توانید از :meth:`str.maketrans` برای ایجاد نقشه ترجمه از نگاشت کاراکتر به کاراکتر در قالب های مختلف استفاده کنید.
ru: Вы можете использовать :meth:`str.maketrans` для создания карты перевода из посимвольных сопоставлений в разных форматах.
uk: Ви можете використовувати :meth:`str.maketrans`, щоб створити карту перекладу з відображень символів у різні формати.

source: See also the :mod:`codecs` module for a more flexible approach to custom character mappings.
fa: همچنین ماژول :mod:`codecs` را برای رویکردی انعطاف‌پذیرتر به نگاشت کاراکترهای سفارشی ببینید.
ru: См. также :mod:`кодеки` модуль для более гибкого подхода к пользовательским сопоставлениям символов.
uk: Перегляньте також модуль :mod:`codecs` для більш гнучкого підходу до нестандартних відображень символів.

source: Return a copy of the string with all the cased characters [4]_ converted to uppercase. Note that ``s.upper().isupper()`` might be ``False`` if ``s`` contains uncased characters or if the Unicode category of the resulting character(s) is not "Lu" (Letter, uppercase), but e.g. "Lt" (Letter, titlecase).
fa: یک کپی از رشته را با تمام حروف کوچک [4]_ به حروف بزرگ تبدیل کنید. توجه داشته باشید که ``s.upper().isupper()`` ممکن است ``False`` باشد اگر ``s`` دارای کاراکترهای بدون حروف باشد یا اگر دسته یونیکد کاراکتر(های) حاصل "Lu" (حروف, بزرگ) نباشد، اما به عنوان مثال. "Lt" (حرف, عنوان).
ru: Вернуть копию строки со всеми регистровыми символами [4]_ преобразован в верхний регистр. Обратите внимание, что ``s.upper().isupper()`` может быть ``Ложь`` если ``с`` содержит символы без регистра или если категория Юникода результирующих символов не «Lu» (буква, верхний регистр), а, например, «Lt» (буква, заглавный регистр).
uk: Повертає копію рядка з усіма символами [4]_, перетвореними на верхній регістр. Зауважте, що ``s.upper().isupper()`` може мати значення ``False``, якщо ``s`` містить символи без регістру або якщо категорія Юнікоду результуючих символів не є "Lu" (літера , верхній регістр), але напр. "Lt" (літера, регістр).

source: The uppercasing algorithm used is `described in section 3.13 'Default Case Folding' of the Unicode Standard <https://www.unicode.org/versions/Unicode15.1.0/ch03.pdf>`__.
fa: الگوریتم بزرگ استفاده شده `described in section 3.13 'Default Case Folding' of the Unicode Standard <https://www.unicode.org/versions/Unicode15.1.0/ch03.pdf>`__ است.

source: Return a copy of the string left filled with ASCII ``'0'`` digits to make a string of length *width*. A leading sign prefix (``'+'``/``'-'``) is handled by inserting the padding *after* the sign character rather than before. The original string is returned if *width* is less than or equal to ``len(s)``.
fa: یک کپی از رشته سمت چپ پر شده با ارقام ASCII ``'0'`` را برگردانید تا یک رشته به طول *width* بسازید. پیشوند علامت پیشرو (``'+'``/``'-'``) با درج نویسه علامت *after* به جای قبل انجام می شود. اگر *width* کمتر یا مساوی با ``len(s)`` باشد، رشته اصلی برگردانده می شود.
ru: Вернуть копию строки, заполненной ASCII. ``'0'`` цифры, чтобы получилась строка длиной *ширины*. Ведущий префикс знака ( ``'+'`` / ``'-'`` ) обрабатывается путем вставки дополнения *после* символа знака, а не перед ним. Исходная строка возвращается, если *ширина* меньше или равна ``лен(ы)`` .
uk: Поверніть копію рядка зліва, заповненого цифрами ASCII ``'0''``, щоб отримати рядок довжини *width*. Початковий префікс знака (``'+'``/``'-'``) обробляється шляхом вставки заповнення *після* символу знака, а не перед ним. Оригінальний рядок повертається, якщо *width* менше або дорівнює ``len(s)``.

source: ``printf``-style String Formatting
fa: قالب بندی رشته ای به سبک ``printf``
ru: ``printf`` -стиль форматирования строк
uk: Форматування рядків у стилі ``printf``

source: The formatting operations described here exhibit a variety of quirks that lead to a number of common errors (such as failing to display tuples and dictionaries correctly). Using the newer :ref:`formatted string literals <f-strings>`, the :meth:`str.format` interface, or :ref:`template strings <template-strings>` may help avoid these errors. Each of these alternatives provides their own trade-offs and benefits of simplicity, flexibility, and/or extensibility.
fa: عملیات قالب‌بندی که در اینجا توضیح داده شده است، خصلت‌های مختلفی را نشان می‌دهد که منجر به تعدادی خطای رایج (مانند عدم نمایش صحیح تاپل‌ها و دیکشنری‌ها) می‌شود. استفاده از :ref:`formatted string literals <f-strings>` جدیدتر، رابط :meth:`str.format` یا :ref:`template strings <template-strings>` ممکن است به جلوگیری از این خطاها کمک کند. هر یک از این گزینه‌ها معاوضه‌ها و مزایای خود را از جمله سادگی، انعطاف‌پذیری و/یا توسعه‌پذیری ارائه می‌کنند.
ru: Описанные здесь операции форматирования имеют ряд особенностей, которые приводят к ряду распространенных ошибок (например, к неправильному отображению кортежей и словарей). Использование новых форматированных строковых литералов `, :meth:`str.format` интерфейс или строки шаблона` может помочь избежать этих ошибок. Каждая из этих альтернатив предлагает свои собственные компромиссы и преимущества простоты, гибкости и/или расширяемости.
uk: Операції форматування, описані тут, демонструють різноманітні особливості, які призводять до низки поширених помилок (наприклад, неправильне відображення кортежів і словників). Використання нових :ref:`відформатованих рядкових літералів <f-strings>`, інтерфейсу :meth:`str.format` або :ref:`шаблонних рядків <template-strings>` може допомогти уникнути цих помилок. Кожна з цих альтернатив забезпечує власні компроміси та переваги простоти, гнучкості та/або розширюваності.

source: String objects have one unique built-in operation: the ``%`` operator (modulo). This is also known as the string *formatting* or *interpolation* operator. Given ``format % values`` (where *format* is a string), ``%`` conversion specifications in *format* are replaced with zero or more elements of *values*. The effect is similar to using the :c:func:`sprintf` function in the C language. For example:
fa: اشیاء رشته ای یک عملیات داخلی منحصر به فرد دارند: عملگر ``%`` (مدول). به این عملگر رشته *formatting* یا *interpolation* نیز می‌گویند. با توجه به ``format % values`` (که در آن *format* یک رشته است), مشخصات تبدیل ``%`` در *format* با عناصر صفر یا بیشتر از *values* جایگزین می شود. این اثر مشابه استفاده از تابع :c:func:`sprintf` در زبان C است. به عنوان مثال:

source: >>> print('%s has %d quote types.' % ('Python', 2)) Python has 2 quote types.
fa: >>> print('%s دارای %d نوع نقل قول است.' % ('Python', 2)) پایتون 2 نوع نقل قول دارد.

source: If *format* requires a single argument, *values* may be a single non-tuple object. [5]_ Otherwise, *values* must be a tuple with exactly the number of items specified by the format string, or a single mapping object (for example, a dictionary).
fa: اگر *format* به یک آرگومان واحد نیاز داشته باشد، *values* ممکن است یک شی غیر چندگانه باشد. [5]_ در غیر این صورت، *values* باید یک تاپل با تعداد موارد مشخص شده توسط رشته قالب یا یک شی نگاشت واحد (مثلاً یک فرهنگ لغت) باشد.
ru: Если для *format* требуется один аргумент, *values* может быть одним объектом, не являющимся кортежем. [5]_ В противном случае *значения* должны быть кортежем с количеством элементов, указанным в строке формата, или одним объектом сопоставления (например, словарем).
uk: Якщо для *format* потрібен один аргумент, *values* може бути одним некортежним об’єктом. [5]_ В іншому випадку *values* має бути кортежем із точною кількістю елементів, визначених рядком формату, або одним об’єктом відображення (наприклад, словником).

source: A conversion specifier contains two or more characters and has the following components, which must occur in this order:
fa: یک مشخص کننده تبدیل شامل دو یا چند کاراکتر است و دارای اجزای زیر است که باید به این ترتیب رخ دهد:
ru: Спецификатор преобразования содержит два или более символов и включает следующие компоненты, которые должны встречаться в следующем порядке:
uk: Специфікатор перетворення містить два або більше символів і має наступні компоненти, які мають відображатися в такому порядку:

source: The ``'%'`` character, which marks the start of the specifier.
fa: کاراکتر ``'%'`` که شروع مشخص کننده را نشان می دهد.
ru: The ``'%'`` символ, который отмечает начало спецификатора.
uk: Символ ``'%'``, який позначає початок специфікатора.

source: Mapping key (optional), consisting of a parenthesised sequence of characters (for example, ``(somename)``).
fa: کلید نگاشت (اختیاری), متشکل از یک دنباله پرانتز از کاراکترها (به عنوان مثال, ``(somename)``).
ru: Ключ сопоставления (необязательно), состоящий из последовательности символов в скобках (например, ``(какое-то имя)`` ).
uk: Ключ відображення (необов’язковий), що складається з послідовності символів у дужках (наприклад, ``(якесь ім’я)``).

source: Conversion flags (optional), which affect the result of some conversion types.
fa: پرچم های تبدیل (اختیاری), که بر نتیجه برخی از انواع تبدیل تأثیر می گذارد.
ru: Флаги преобразования (необязательно), которые влияют на результат некоторых типов преобразования.
uk: Прапорці перетворення (опціонально), які впливають на результат деяких типів перетворення.

source: Minimum field width (optional). If specified as an ``'*'`` (asterisk), the actual width is read from the next element of the tuple in *values*, and the object to convert comes after the minimum field width and optional precision.
fa: حداقل عرض میدان (اختیاری). اگر به عنوان ``'*'`` (ستاره) مشخص شود، عرض واقعی از عنصر بعدی تاپل در *values* خوانده می شود و شیء تبدیل پس از حداقل عرض میدان و دقت اختیاری می آید.
ru: Минимальная ширина поля (необязательно). Если указано как ``'*'`` (звездочка), фактическая ширина считывается из следующего элемента кортежа в *values*, а преобразуемый объект идет после минимальной ширины поля и дополнительной точности.
uk: Мінімальна ширина поля (опціонально). Якщо вказано як ``'*'`` (зірочка), фактична ширина зчитується з наступного елемента кортежу в *значеннях*, а об’єкт для перетворення йде після мінімальної ширини поля та необов’язкової точності.
