Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/stdtypes.po
Languages: fa, ru, uk

source: Return centered in a string of length *width*. Padding is done using the specified *fillchar* (default is an ASCII space). The original string is returned if *width* is less than or equal to ``len(s)``.
fa: برگرداندن در مرکز یک رشته به طول *width*. Padding با استفاده از *fillchar* مشخص شده انجام می شود (پیش فرض یک فضای ASCII است). اگر *width* کمتر یا مساوی با ``len(s)`` باشد، رشته اصلی برگردانده می شود.
ru: Возврат по центру строки длиной *ширина*. Заполнение выполняется с использованием указанного *fillchar* (по умолчанию используется пробел ASCII). Исходная строка возвращается, если *ширина* меньше или равна ``лен(ы)`` .
uk: Повернення з центром у рядку довжиною *width*. Заповнення виконується за допомогою вказаного *fillchar* (за замовчуванням це пробіл ASCII). Оригінальний рядок повертається, якщо *width* менше або дорівнює ``len(s)``.

source: Return the number of non-overlapping occurrences of substring *sub* in the range [*start*, *end*]. Optional arguments *start* and *end* are interpreted as in slice notation.
fa: تعداد رخدادهای غیر همپوشانی رشته فرعی *sub* را در محدوده [*start*, *end*] برگردانید. آرگومان های اختیاری *start* و *end* به صورت نمادگذاری برش تفسیر می شوند.
ru: Возвращает количество непересекающихся вхождений подстроки *sub* в диапазоне [*start*, *end*]. Необязательные аргументы *start* и *end* интерпретируются как в нотации среза.
uk: Повертає кількість неперекриваючих входжень підрядка *sub* у діапазоні [*початок*, *кінець*]. Необов’язкові аргументи *початок* і *кінець* інтерпретуються як у нотації фрагментів.

source: If *sub* is empty, returns the number of empty strings between characters which is the length of the string plus one.
fa: اگر *sub* خالی باشد، تعداد رشته های خالی بین کاراکترها را برمی گرداند که طول رشته به اضافه یک است.
ru: Если *sub* пусто, возвращает количество пустых строк между символами, равное длине строки плюс один.

source: Return the string encoded to :class:`bytes`.
fa: رشته کد شده به :class:`bytes` را برگردانید.
ru: Вернуть строку, закодированную в :class:`байты` .

source: *encoding* defaults to ``'utf-8'``; see :ref:`standard-encodings` for possible values.
fa: *encoding* به طور پیش فرض روی ``'utf-8'`` است. برای مقادیر ممکن به :ref:`standard-encodings` مراجعه کنید.
ru: *кодировка* по умолчанию ``'utf-8'`` ; видеть :ref:`стандартные кодировки` для возможных значений.

source: *errors* controls how encoding errors are handled. If ``'strict'`` (the default), a :exc:`UnicodeError` exception is raised. Other possible values are ``'ignore'``, ``'replace'``, ``'xmlcharrefreplace'``, ``'backslashreplace'`` and any other name registered via :func:`codecs.register_error`. See :ref:`error-handlers` for details.
fa: *errors* نحوه رسیدگی به خطاهای کدگذاری را کنترل می کند. اگر ``'strict'`` (پیش فرض), یک استثنا :exc:`UnicodeError` مطرح می شود. مقادیر احتمالی دیگر ``'ignore'``، ``'replace'``، ``'xmlcharrefreplace'``، ``'backslashreplace'`` و هر نام دیگری ثبت شده از طریق :func:`codecs.register_error` هستند. برای جزئیات بیشتر به :ref:`error-handlers` مراجعه کنید.
ru: *errors* управляет обработкой ошибок кодирования. Если ``'строгий'`` (по умолчанию), а :exc:`UnicodeError` возникает исключение. Другие возможные значения: ``'игнорировать'`` , ``'заменить'`` , ``'xmlcharrefreplace'`` , ``'обратная косая черта'`` и любое другое имя, зарегистрированное через :func:`codecs.register_error` . Видеть :ref:`обработчики ошибок` для получения подробной информации.

source: For performance reasons, the value of *errors* is not checked for validity unless an encoding error actually occurs, :ref:`devmode` is enabled or a :ref:`debug build <debug-build>` is used.
fa: به دلایل عملکرد، مقدار *errors* از نظر اعتبار بررسی نمی شود، مگر اینکه واقعاً یک خطای رمزگذاری رخ دهد، :ref:`devmode` فعال شود یا از :ref:`debug build <debug-build>` استفاده شود.
ru: По соображениям производительности значение *errors* не проверяется на достоверность, если только не возникает ошибка кодирования. :ref:`devmode` включен или имеется :ref:`отладочная сборка ` используется.

source: Added support for keyword arguments.
fa: پشتیبانی از آرگومان های کلمه کلیدی اضافه شده است.
ru: Добавлена ​​поддержка аргументов ключевых слов.
uk: Додано підтримку аргументів ключових слів.

source: The value of the *errors* argument is now checked in :ref:`devmode` and in :ref:`debug mode <debug-build>`.
fa: مقدار آرگومان *errors* اکنون در :ref:`devmode` و در :ref:`debug mode <debug-build>` بررسی می شود.
ru: Значение аргумента *errors* теперь проверяется. :ref:`devmode` и в :ref:`режиме отладки `.

source: Return ``True`` if the string ends with the specified *suffix*, otherwise return ``False``. *suffix* can also be a tuple of suffixes to look for. With optional *start*, test beginning at that position. With optional *end*, stop comparing at that position.
fa: اگر رشته به *suffix* مشخص شده ختم شود، ``True`` را برگردانید، در غیر این صورت ``False`` را برگردانید. *suffix* همچنین می تواند چندین پسوند باشد که باید به دنبال آن باشید. با *start* اختیاری، آزمایش را از همان موقعیت شروع کنید. با *end* اختیاری، مقایسه را در آن موقعیت متوقف کنید.
ru: Возвращаться ``Правда`` если строка заканчивается указанным *суффиксом*, в противном случае верните ``Ложь`` . *suffix* также может представлять собой кортеж суффиксов, которые нужно искать. Если используется необязательный *start*, тест начинается с этой позиции. Если используется необязательный *end*, остановите сравнение в этой позиции.
uk: Повертає ``True``, якщо рядок закінчується вказаним *суфіксом*, інакше повертає ``False``. *suffix* також може бути кортежем суфіксів для пошуку. З необов'язковим *початком* тестування починається з цієї позиції. З необов’язковим *end*, припинити порівняння на цій позиції.

source: Return a copy of the string where all tab characters are replaced by one or more spaces, depending on the current column and the given tab size. Tab positions occur every *tabsize* characters (default is 8, giving tab positions at columns 0, 8, 16 and so on). To expand the string, the current column is set to zero and the string is examined character by character. If the character is a tab (``\t``), one or more space characters are inserted in the result until the current column is equal to the next tab position. (The tab character itself is not copied.) If the character is a newline (``\n``) or return (``\r``), it is copied and the current column is reset to zero. Any other character is copied unchanged and the current column is incremented by one regardless of how the character is represented when printed.
fa: یک کپی از رشته را برگردانید که در آن همه کاراکترهای برگه با یک یا چند فاصله، بسته به ستون فعلی و اندازه برگه داده شده، جایگزین می شوند. موقعیت‌های برگه‌ها در هر نویسه *tabsize* رخ می‌دهند (پیش‌فرض 8 است که موقعیت‌های تب را در ستون‌های 0, 8, 16 و غیره می‌دهد). برای گسترش رشته، ستون فعلی صفر می شود و رشته کاراکتر به کاراکتر بررسی می شود. اگر کاراکتر یک زبانه باشد (``\t``), یک یا چند کاراکتر فاصله در نتیجه درج می شود تا زمانی که ستون فعلی با موقعیت زبانه بعدی برابر شود. (خود کاراکتر برگه کپی نشده است.) اگر کاراکتر یک خط جدید (``\n``) یا بازگشتی (``\r``) باشد، کپی می شود و ستون فعلی به صفر بازنشانی می شود. هر کاراکتر دیگری بدون تغییر کپی می‌شود و ستون فعلی یک عدد افزایش می‌یابد، صرفنظر از نحوه نمایش نویسه هنگام چاپ.
ru: Возвращает копию строки, в которой все символы табуляции заменены одним или несколькими пробелами, в зависимости от текущего столбца и заданного размера табуляции. Позиции табуляции встречаются через каждые символы *tabsize* (по умолчанию — 8, что соответствует позициям табуляции в столбцах 0, 8, 16 и т. д.). Чтобы расширить строку, текущий столбец устанавливается на ноль, и строка проверяется посимвольно. Если символ представляет собой табуляцию ( ``\t`` ), в результат вставляются один или несколько символов пробела, пока текущий столбец не сравняется со следующей позицией табуляции. (Сам символ табуляции не копируется.) Если символ представляет собой новую строку ( ``\n`` ) или вернуть ( ``\r`` ), он копируется, и текущий столбец сбрасывается в ноль. Любой другой символ копируется без изменений, а текущий столбец увеличивается на единицу независимо от того, как символ представлен при печати.
uk: Повертає копію рядка, де всі символи табуляції замінені одним або кількома пробілами, залежно від поточного стовпця та заданого розміру табуляції. Позиції табуляції відбуваються з кожним символом *tabsize* (за замовчуванням — 8, надаючи позиції табуляції в стовпцях 0, 8, 16 тощо). Щоб розгорнути рядок, поточний стовпець встановлюється на нуль, а рядок перевіряється символ за символом. Якщо символ є табуляцією (``\t``), один або кілька символів пробілу вставляються в результат, доки поточний стовпець не зрівняється з позицією наступної табуляції. (Сам символ табуляції не копіюється.) Якщо символ є символом нового рядка (``\n``) або повернення (``\r``), він копіюється, а поточний стовпець скидається до нуля. Будь-який інший символ копіюється без змін, а поточний стовпець збільшується на одиницю незалежно від того, як символ представлено під час друку.

source: Return the lowest index in the string where substring *sub* is found within the slice ``s[start:end]``. Optional arguments *start* and *end* are interpreted as in slice notation. Return ``-1`` if *sub* is not found.
fa: کمترین شاخص را در رشته ای که زیر رشته *sub* در برش ``s[start:end]`` یافت می شود، برگردانید. آرگومان های اختیاری *start* و *end* به صورت نمادگذاری برش تفسیر می شوند. اگر *sub* یافت نشد، ``-1`` را برگردانید.
ru: Возвращает самый низкий индекс в строке, где в срезе находится подстрока *sub*. ``s[начало:конец]`` . Необязательные аргументы *start* и *end* интерпретируются как в нотации среза. Возвращаться ``-1`` если *sub* не найден.
uk: Повертає найнижчий індекс у рядку, де підрядок *sub* знайдено в фрагменті ``s[start:end]``. Необов’язкові аргументи *початок* і *кінець* інтерпретуються як у нотації фрагментів. Повертає ``-1``, якщо *sub* не знайдено.

source: The :meth:`~str.find` method should be used only if you need to know the position of *sub*. To check if *sub* is a substring or not, use the :keyword:`in` operator::
fa: روش :meth:`~str.find` فقط در صورتی باید استفاده شود که باید موقعیت *sub* را بدانید. برای بررسی اینکه آیا *sub* یک رشته فرعی است یا نه، از عملگر :keyword:`in` استفاده کنید:
ru: The :meth:`~str.find` метод следует использовать только в том случае, если вам нужно знать положение *sub*. Чтобы проверить, является ли *sub* подстрокой или нет, используйте команду :keyword:`в` оператор::
uk: Метод :meth:`~str.find` слід використовувати, лише якщо вам потрібно знати позицію *sub*. Щоб перевірити, чи є *sub* підрядком, скористайтеся оператором :keyword:`in`::

source: Perform a string formatting operation. The string on which this method is called can contain literal text or replacement fields delimited by braces ``{}``. Each replacement field contains either the numeric index of a positional argument, or the name of a keyword argument. Returns a copy of the string where each replacement field is replaced with the string value of the corresponding argument.
fa: عملیات قالب بندی رشته را انجام دهید. رشته ای که این متد بر روی آن فراخوانی می شود می تواند حاوی متن تحت اللفظی یا فیلدهای جایگزین باشد که با پرانتزهای ``{}`` محدود شده اند. هر فیلد جایگزین شامل یا شاخص عددی یک آرگومان موقعیتی یا نام یک آرگومان کلمه کلیدی است. یک کپی از رشته را برمی‌گرداند که در آن هر فیلد جایگزین با مقدار رشته آرگومان مربوطه جایگزین می‌شود.
ru: Выполните операцию форматирования строки. Строка, для которой вызывается этот метод, может содержать литеральный текст или поля замены, разделенные фигурными скобками. ``{}`` . Каждое поле замены содержит либо числовой индекс позиционного аргумента, либо имя аргумента ключевого слова. Возвращает копию строки, в которой каждое поле замены заменяется строковым значением соответствующего аргумента.
uk: Виконайте операцію форматування рядка. Рядок, у якому викликається цей метод, може містити літеральний текст або поля заміни, розділені дужками ``{}``. Кожне поле заміни містить або числовий індекс позиційного аргументу, або назву ключового аргументу. Повертає копію рядка, де кожне поле заміни замінено рядковим значенням відповідного аргументу.

source: See :ref:`formatstrings` for a description of the various formatting options that can be specified in format strings.
fa: برای توضیح گزینه‌های قالب‌بندی مختلف که می‌توانند در رشته‌های قالب مشخص شوند، به :ref:`formatstrings` مراجعه کنید.
ru: Видеть :ref:`formatstrings` для описания различных параметров форматирования, которые можно указать в строках формата.
uk: Перегляньте :ref:`formatstrings` для опису різних параметрів форматування, які можна вказати в рядках формату.

source: When formatting a number (:class:`int`, :class:`float`, :class:`complex`, :class:`decimal.Decimal` and subclasses) with the ``n`` type (ex: ``'{:n}'.format(1234)``), the function temporarily sets the ``LC_CTYPE`` locale to the ``LC_NUMERIC`` locale to decode ``decimal_point`` and ``thousands_sep`` fields of :c:func:`localeconv` if they are non-ASCII or longer than 1 byte, and the ``LC_NUMERIC`` locale is different than the ``LC_CTYPE`` locale. This temporary change affects other threads.
fa: هنگام قالب‌بندی یک عدد (:class:`int`, :class:`float`, :class:`complex`, :class:`decimal.Decimal` و کلاس‌های فرعی) با نوع ``n`` (مثلاً: ``'{:n}'.format(1234)``)، این تابع به‌طور موقت محلی ``LC_CTYPE`` را به محلی ``LC_NUMERIC`` تنظیم می‌کند تا فیلدهای ``decimal_point`` و ``thousands_sep`` مربوط به :c:func:`localeconv`، در صورتی که غیر ASCII باشند یا بیشتر از 1 بایت طول داشته باشند، رمزگشایی شوند، به شرطی که محلی ``LC_NUMERIC`` با محلی ``LC_CTYPE`` متفاوت باشد. این تغییر موقت بر سایر رشته‌ها تأثیر می‌گذارد
ru: При форматировании числа ( :класс:`int` , :class:`плавать` , :class:`сложный` , :class:`decimal.Decimal` и подклассы) с ``н`` тип (например: ``'{:n}'.format(1234)`` ), функция временно устанавливает ``LC_CTYPE`` локаль для ``LC_NUMERIC`` локаль для декодирования ``десятичная_точка`` и ``тысячи_сентября`` поля :c:func:`localeconv` если они не ASCII или длиннее 1 байта, и ``LC_NUMERIC`` локаль отличается от ``LC_CTYPE`` локаль. Это временное изменение влияет на другие потоки.
uk: Під час форматування числа (:class:`int`, :class:`float`, :class:`complex`, :class:`decimal.Decimal` і підкласів) із типом ``n`` (наприклад: ``'{:n}'.format(1234)``, функція тимчасово встановлює локаль ``LC_CTYPE`` на мову ``LC_NUMERIC`` для декодування полів ``decimal_point`` і ``thousands_sep`` :c:func:`localeconv`, якщо вони не є ASCII або довші за 1 байт, а локаль ``LC_NUMERIC`` відрізняється від локалі ``LC_CTYPE``. Ця тимчасова зміна впливає на інші потоки.

source: When formatting a number with the ``n`` type, the function sets temporarily the ``LC_CTYPE`` locale to the ``LC_NUMERIC`` locale in some cases.
fa: هنگام قالب بندی یک عدد با نوع ``n``، این تابع در برخی موارد به طور موقت محلی ``LC_CTYPE`` را به محلی ``LC_NUMERIC`` تنظیم می کند.
ru: При форматировании числа с помощью ``н`` тип, функция временно устанавливает ``LC_CTYPE`` локаль для ``LC_NUMERIC`` локаль в некоторых случаях.
uk: Під час форматування числа за допомогою типу ``n``, у деяких випадках функція тимчасово встановлює ``LC_CTYPE`` локаль ``LC_NUMERIC``.

source: Similar to ``str.format(**mapping)``, except that ``mapping`` is used directly and not copied to a :class:`dict`. This is useful if for example ``mapping`` is a dict subclass:
fa: مشابه ``str.format(**mapping)``، با این تفاوت که ``mapping`` مستقیما استفاده می شود و در :class:`dict` کپی نمی شود. اگر برای مثال ``mapping`` یک زیر کلاس dict باشد، این مفید است:
ru: Похоже на: ``str.format(**отображение)`` , за исключением того, что ``картографирование`` используется напрямую, а не копируется в :class:`dict` . Это полезно, если, например, ``картографирование`` это подкласс dict:
uk: Подібно до ``str.format(**mapping)``, за винятком того, що ``mapping`` використовується безпосередньо, а не копіюється в :class:`dict`. Це корисно, якщо, наприклад, ``mapping`` є підкласом dict:

source: Like :meth:`~str.find`, but raise :exc:`ValueError` when the substring is not found.
fa: مانند :meth:`~str.find`، اما وقتی رشته فرعی پیدا نشد، :exc:`ValueError` را بالا ببرید.
ru: Нравиться :meth:`~str.find` , но поднять :exc:`ValueError` когда подстрока не найдена.
uk: Як :meth:`~str.find`, але викликає :exc:`ValueError`, коли підрядок не знайдено.

source: Return ``True`` if all characters in the string are alphanumeric and there is at least one character, ``False`` otherwise. A character ``c`` is alphanumeric if one of the following returns ``True``: ``c.isalpha()``, ``c.isdecimal()``, ``c.isdigit()``, or ``c.isnumeric()``.
fa: اگر همه کاراکترهای رشته حروف عددی هستند و حداقل یک کاراکتر وجود دارد، ``True`` را برگردانید، در غیر این صورت ``False`` را برگردانید. یک کاراکتر ``c`` الفبایی است اگر یکی از موارد زیر ``True`` را برگرداند: ``c.isalpha()``، ``c.isdecimal()``، ``c.isdigit()``، یا ``c.isnumeric()``.
ru: Возвращаться ``Правда`` если все символы в строке буквенно-цифровые и есть хотя бы один символ, ``Ложь`` в противном случае. Персонаж ``с`` является буквенно-цифровым, если возвращается одно из следующих значений ``Правда`` : ``c.isalpha()`` , ``c.isdecimal()`` , ``c.isdigit()`` , или ``c.isnumeric()`` .
uk: Повертає ``True``, якщо всі символи в рядку є буквено-цифровими і є принаймні один символ, ``False`` інакше. Символ ``c`` є буквено-цифровим, якщо одне з наступного повертає ``True``: ``c.isalpha()``, ``c.isdecimal()``, ``c.isdigit()`` або ``c.isnumeric()``.

source: Return ``True`` if all characters in the string are alphabetic and there is at least one character, ``False`` otherwise. Alphabetic characters are those characters defined in the Unicode character database as "Letter", i.e., those with general category property being one of "Lm", "Lt", "Lu", "Ll", or "Lo". Note that this is different from the `Alphabetic property defined in the section 4.10 'Letters, Alphabetic, and Ideographic' of the Unicode Standard <https://www.unicode.org/versions/Unicode15.1.0/ch04.pdf>`_.
fa: اگر همه کاراکترهای رشته حروف الفبا هستند و حداقل یک کاراکتر وجود دارد، ``True`` را برگردانید، در غیر این صورت ``False`` را برگردانید. کاراکترهای الفبایی آن دسته از کاراکترهایی هستند که در پایگاه داده کاراکترهای یونیکد به عنوان "حرف" تعریف می شوند، یعنی آنهایی که دارای ویژگی دسته بندی عمومی هستند یکی از "Lm"، "Lt"، "Lu"، "Ll" یا "Lo" هستند. توجه داشته باشید که این با `Alphabetic property defined in the section 4.10 'Letters, Alphabetic, and Ideographic' of the Unicode Standard <https://www.unicode.org/versions/Unicode15.1.0/ch04.pdf>`_ متفاوت است.

source: Return ``True`` if the string is empty or all characters in the string are ASCII, ``False`` otherwise. ASCII characters have code points in the range U+0000-U+007F.
fa: اگر رشته خالی است یا تمام کاراکترهای رشته ASCII هستند، ``True`` را برگردانید، در غیر این صورت ``False``. کاراکترهای اسکی دارای نقاط کد در محدوده U+0000-U+007F هستند.
ru: Возвращаться ``Правда`` если строка пуста или все символы в ней являются ASCII, ``Ложь`` в противном случае. Символы ASCII имеют кодовые точки в диапазоне от U+0000 до U+007F.
uk: Повертає ``True``, якщо рядок порожній або всі символи в рядку є ASCII, ``False`` інакше. Символи ASCII мають кодові точки в діапазоні U+0000-U+007F.

source: Return ``True`` if all characters in the string are decimal characters and there is at least one character, ``False`` otherwise. Decimal characters are those that can be used to form numbers in base 10, e.g. U+0660, ARABIC-INDIC DIGIT ZERO. Formally a decimal character is a character in the Unicode General Category "Nd".
fa: اگر همه کاراکترهای رشته اعشاری هستند و حداقل یک کاراکتر وجود دارد، ``True`` را برگردانید، در غیر این صورت ``False``. کاراکترهای اعشاری آنهایی هستند که می توان از آنها برای تشکیل اعداد در پایه 10 استفاده کرد، به عنوان مثال. U+0660، رقم عربی- هندی صفر. به طور رسمی یک کاراکتر اعشاری یک کاراکتر در رده عمومی یونیکد "Nd" است.
ru: Возвращаться ``Правда`` если все символы в строке являются десятичными символами и существует хотя бы один символ, ``Ложь`` в противном случае. Десятичные символы — это те символы, которые можно использовать для формирования чисел по основанию 10, например U+0660, АРАБСКАЯ-ИНДИЙСКАЯ ЦИФРА НОЛЬ. Формально десятичный символ — это символ общей категории Юникода «Nd».
uk: Повертає ``True``, якщо всі символи в рядку є десятковими символами і є принаймні один символ, ``False`` інакше. Десяткові символи – це ті, які можна використовувати для утворення чисел за основою 10, напр. U+0660, АРАБСЬКО-ІНДІЙСЬКА ЦИФРА НУЛЬ. Формально десятковий символ — це символ у загальній категорії Unicode "Nd".

source: Return ``True`` if all characters in the string are digits and there is at least one character, ``False`` otherwise. Digits include decimal characters and digits that need special handling, such as the compatibility superscript digits. This covers digits which cannot be used to form numbers in base 10, like the Kharosthi numbers. Formally, a digit is a character that has the property value Numeric_Type=Digit or Numeric_Type=Decimal.
fa: اگر همه کاراکترهای رشته رقمی هستند و حداقل یک کاراکتر وجود دارد، ``True`` را برگردانید، در غیر این صورت ``False`` را برگردانید. ارقام شامل کاراکترهای اعشاری و ارقامی هستند که نیاز به رسیدگی خاصی دارند، مانند ارقام فوق‌نویس سازگاری. این شامل ارقامی است که نمی توان از آنها برای تشکیل اعداد در پایه 10 استفاده کرد، مانند اعداد خاروستی. به طور رسمی، یک رقم، کاراکتری است که دارای مقدار ویژگی Numeric_Type=Digit یا Numeric_Type=Decimal است.
ru: Возвращаться ``Правда`` если все символы в строке являются цифрами и имеется хотя бы один символ, ``Ложь`` в противном случае. Цифры включают десятичные символы и цифры, требующие специальной обработки, например цифры верхнего индекса совместимости. Сюда входят цифры, которые нельзя использовать для образования чисел по основанию 10, например числа Харости. Формально цифра — это символ, имеющий значение свойства Numeric_Type=Digit или Numeric_Type=Decimal.
uk: Повертає ``True``, якщо всі символи в рядку є цифрами і є принаймні один символ, ``False`` інакше. Цифри включають десяткові символи та цифри, які потребують спеціальної обробки, наприклад цифри сумісності над індексом. Це охоплює цифри, які не можна використовувати для формування чисел з основою 10, як-от числа Харості. Формально цифра — це символ, який має значення властивості Numeric_Type=Digit або Numeric_Type=Decimal.

source: Return ``True`` if the string is a valid identifier according to the language definition, section :ref:`identifiers`.
fa: اگر رشته طبق تعریف زبان، بخش :ref:`identifiers` یک شناسه معتبر است، ``True`` را برگردانید.
ru: Возвращаться ``Правда`` если строка является допустимым идентификатором в соответствии с определением языка, раздел :ref:`идентификаторы` .
uk: Повертає ``True``, якщо рядок є дійсним ідентифікатором відповідно до визначення мови, розділ :ref:`identifiers`.

source: :func:`keyword.iskeyword` can be used to test whether string ``s`` is a reserved identifier, such as :keyword:`def` and :keyword:`class`.
fa: از :func:`keyword.iskeyword` می توان برای آزمایش اینکه آیا رشته ``s`` یک شناسه رزرو شده است، مانند :keyword:`def` و :keyword:`class` استفاده کرد.

source: Example: ::
fa: مثال: ::
ru: Пример: ::
uk: Приклад: ::

source: Return ``True`` if all cased characters [4]_ in the string are lowercase and there is at least one cased character, ``False`` otherwise.
fa: اگر همه کاراکترهای با حروف [4]_ در رشته کوچک هستند و حداقل یک کاراکتر با حروف کوچک وجود دارد، ``True`` را برگردانید، در غیر این صورت ``False``.
ru: Возвращаться ``Правда`` если все символы в регистре [4]_ в строке написаны строчными буквами и есть хотя бы один регистровый символ, ``Ложь`` в противном случае.
uk: Повертає ``True``, якщо всі символи регістру [4]_ в рядку є малими і є принаймні один символ регістру, ``False`` інакше.
