Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/symtable.po
Languages: ru

source: **Source code:** :source:`Lib/symtable.py`
ru: **Исходный код:** :source:`Lib/symtable.py`

source: Symbol tables are generated by the compiler from AST just before bytecode is generated. The symbol table is responsible for calculating the scope of every identifier in the code. :mod:`symtable` provides an interface to examine these tables.
ru: Таблицы символов генерируются компилятором из AST непосредственно перед генерацией байт-кода. Таблица символов отвечает за вычисление области действия каждого идентификатора в коде. :mod:`symtable` предоставляет интерфейс для просмотра этих таблиц.

source: Generating Symbol Tables
ru: Генерация таблиц символов

source: Return the toplevel :class:`SymbolTable` for the Python source *code*. *filename* is the name of the file containing the code. *compile_type* is like the *mode* argument to :func:`compile`.
ru: Верните верхний уровень :class:`SymbolTable` для исходного *кода* Python. *filename* — имя файла, содержащего код. *compile_type* аналогичен аргументу *mode* для :func:`compile`.

source: Examining Symbol Tables
ru: Изучение таблиц символов

source: A namespace table for a block. The constructor is not public.
ru: Таблица пространства имен для блока. Конструктор не является общедоступным.

source: Return the table's identifier.
ru: Вернуть идентификатор таблицы.

source: Return the number of the first line in the block this table represents.
ru: Возвращает номер первой строки в блоке, который представляет эта таблица.

source: Return ``True`` if the locals in this table can be optimized.
ru: Верните True, если локальные значения в этой таблице можно оптимизировать.

source: Return ``True`` if the block is a nested class or function.
ru: Верните True, если блок является вложенным классом или функцией.

source: Return ``True`` if the block has nested namespaces within it. These can be obtained with :meth:`get_children`.
ru: Верните True, если в блоке есть вложенные пространства имен. Их можно получить с помощью :meth:`get_children`.

source: Lookup *name* in the table and return a :class:`Symbol` instance.
ru: Найдите *имя* в таблице и верните экземпляр :class:`Symbol`.

source: Return a list of :class:`Symbol` instances for names in the table.
ru: Возвращает список экземпляров :class:`Symbol` для имен в таблице.

source: Return a list of the nested symbol tables.
ru: Возвращает список вложенных таблиц символов.

source: Return a tuple containing names of parameters to this function.
ru: Верните в эту функцию кортеж, содержащий имена параметров.

source: Return a tuple containing names of locals in this function.
ru: Верните кортеж, содержащий имена локальных жителей в этой функции.

source: Return a tuple containing names of globals in this function.
ru: Верните кортеж, содержащий имена глобальных переменных в этой функции.

source: Return a tuple containing names of nonlocals in this function.
ru: Верните кортеж, содержащий имена нелокальных переменных в этой функции.

source: Return a tuple containing names of free variables in this function.
ru: Верните кортеж, содержащий имена свободных переменных в этой функции.

source: An entry in a :class:`SymbolTable` corresponding to an identifier in the source. The constructor is not public.
ru: Запись в :class:`SymbolTable`, соответствующая идентификатору в источнике. Конструктор не является общедоступным.

source: Return the symbol's name.
ru: Верните имя символа.

source: Return ``True`` if the symbol is used in its block.
ru: Верните True, если символ используется в его блоке.

source: Return ``True`` if the symbol is created from an import statement.
ru: Верните ``True``, если символ создан из оператора импорта.

source: Return ``True`` if the symbol is a parameter.
ru: Верните ``True``, если символ является параметром.

source: Return ``True`` if the symbol is global.
ru: Верните ``True``, если символ является глобальным.

source: Return ``True`` if the symbol is nonlocal.
ru: Верните ``True``, если символ нелокальный.

source: Return ``True`` if the symbol is declared global with a global statement.
ru: Верните ``True``, если символ объявлен глобальным с помощью глобального оператора.

source: Return ``True`` if the symbol is local to its block.
ru: Верните ``True``, если символ является локальным для своего блока.

source: Return ``True`` if the symbol is annotated.
ru: Верните ``True``, если символ аннотирован.

source: Return ``True`` if the symbol is referenced in its block, but not assigned to.
ru: Верните ``True``, если на символ есть ссылка в его блоке, но ему не присвоено значение.

source: Return ``True`` if the symbol is assigned to in its block.
ru: Верните ``True``, если символ назначен в его блоке.

source: Return ``True`` if name binding introduces new namespace.
ru: Верните True, если привязка имени вводит новое пространство имен.

source: If the name is used as the target of a function or class statement, this will be true.
ru: Если имя используется в качестве цели оператора функции или класса, это будет верно.

source: For example::
ru: Например::

source: Note that a single name can be bound to multiple objects. If the result is ``True``, the name may also be bound to other objects, like an int or list, that does not introduce a new namespace.
ru: Обратите внимание, что одно имя может быть связано с несколькими объектами. Если результат — «True», имя также может быть связано с другими объектами, такими как int или список, которые не вводят новое пространство имен.

source: Return a list of namespaces bound to this name.
ru: Вернуть список пространств имен, привязанных к этому имени.
