Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/sys.po
Languages: ru

source: An exception has occurred. The local trace function is called; *arg* is a tuple ``(exception, value, traceback)``; the return value specifies the new local trace function.
ru: Произошло исключение. Вызывается локальная функция трассировки; *arg* — это кортеж ``(исключение, значение, обратная трассировка)``; возвращаемое значение указывает новую локальную функцию трассировки.

source: The interpreter is about to execute a new opcode (see :mod:`dis` for opcode details). The local trace function is called; *arg* is ``None``; the return value specifies the new local trace function. Per-opcode events are not emitted by default: they must be explicitly requested by setting :attr:`~frame.f_trace_opcodes` to :const:`True` on the :ref:`frame <frame-objects>`.
ru: Интерпретатор собирается выполнить новый код операции (подробности см. в :mod:`dis`). Вызывается локальная функция трассировки; *arg* — ``Нет``; возвращаемое значение указывает новую локальную функцию трассировки. События для каждого кода операции не создаются по умолчанию: они должны быть явно запрошены путем установки :attr:`~frame.f_trace_opcodes` в :const:`True` в :ref:`frame <frame-objects>`.

source: Note that as an exception is propagated down the chain of callers, an ``'exception'`` event is generated at each level.
ru: Обратите внимание, что по мере распространения исключения по цепочке вызывающих объектов на каждом уровне генерируется событие «исключение».

source: For more fine-grained usage, it's possible to set a trace function by assigning ``frame.f_trace = tracefunc`` explicitly, rather than relying on it being set indirectly via the return value from an already installed trace function. This is also required for activating the trace function on the current frame, which :func:`settrace` doesn't do. Note that in order for this to work, a global tracing function must have been installed with :func:`settrace` in order to enable the runtime tracing machinery, but it doesn't need to be the same tracing function (e.g. it could be a low overhead tracing function that simply returns ``None`` to disable itself immediately on each frame).
ru: Для более детального использования можно установить функцию трассировки, явно назначив ``frame.f_trace = Tracefunc``, вместо того, чтобы полагаться на то, что она будет установлена ​​косвенно через возвращаемое значение из уже установленной функции трассировки. Это также необходимо для активации функции трассировки текущего кадра, чего :func:`settrace` не делает. Обратите внимание, что для того, чтобы это работало, должна быть установлена ​​глобальная функция трассировки с помощью :func:`settrace`, чтобы включить механизм трассировки во время выполнения, но это не обязательно должна быть одна и та же функция трассировки (например, это может быть функция трассировки с низкими издержками, которая просто возвращает None для немедленного отключения в каждом кадре).

source: For more information on code and frame objects, refer to :ref:`types`.
ru: Дополнительную информацию об объектах кода и фреймов см. в разделе :ref:`types`.

source: Raises an :ref:`auditing event <auditing>` ``sys.settrace`` with no arguments.
ru: Вызывает событие аудита <auditing>``sys.settrace`` без аргументов.

source: The :func:`settrace` function is intended only for implementing debuggers, profilers, coverage tools and the like. Its behavior is part of the implementation platform, rather than part of the language definition, and thus may not be available in all Python implementations.
ru: Функция :func:`settrace` предназначена только для реализации отладчиков, профилировщиков, инструментов покрытия и т.п. Его поведение является частью платформы реализации, а не частью определения языка, и поэтому может быть доступно не во всех реализациях Python.

source: ``'opcode'`` event type added; :attr:`~frame.f_trace_lines` and :attr:`~frame.f_trace_opcodes` attributes added to frames
ru: добавлен тип события ``'opcode'``; Атрибуты :attr:`~frame.f_trace_lines` и :attr:`~frame.f_trace_opcodes` добавлены в кадры.

source: Accepts two optional keyword arguments which are callables that accept an :term:`asynchronous generator iterator` as an argument. The *firstiter* callable will be called when an asynchronous generator is iterated for the first time. The *finalizer* will be called when an asynchronous generator is about to be garbage collected.
ru: Принимает два необязательных аргумента ключевого слова, которые являются вызываемыми объектами, принимающими в качестве аргумента :term:`итератор асинхронного генератора`. Вызываемая функция *firstiter* будет вызываться при первой итерации асинхронного генератора. *Финализатор* будет вызываться, когда асинхронный генератор собирается собрать мусор.

source: Raises an :ref:`auditing event <auditing>` ``sys.set_asyncgen_hooks_firstiter`` with no arguments.
ru: Вызывает событие аудита <auditing>``sys.set_asyncgen_hooks_firstiter`` без аргументов.

source: Raises an :ref:`auditing event <auditing>` ``sys.set_asyncgen_hooks_finalizer`` with no arguments.
ru: Вызывает событие аудита <auditing>``sys.set_asyncgen_hooks_finalizer`` без аргументов.

source: Two auditing events are raised because the underlying API consists of two calls, each of which must raise its own event.
ru: Возникают два события аудита, поскольку базовый API состоит из двух вызовов, каждый из которых должен вызывать свое собственное событие.

source: See :pep:`525` for more details, and for a reference example of a *finalizer* method see the implementation of ``asyncio.Loop.shutdown_asyncgens`` in :source:`Lib/asyncio/base_events.py`
ru: См. :pep:`525` для более подробной информации, а справочный пример метода *finalizer* см. в реализации ``asyncio.Loop.shutdown_asyncgens`` в :source:`Lib/asyncio/base_events.py`

source: To enable, pass a *depth* value greater than zero; this sets the number of frames whose information will be captured. To disable, pass set *depth* to zero.
ru: Чтобы включить, передайте значение *глубины* больше нуля; это устанавливает количество кадров, информация о которых будет захвачена. Чтобы отключить, передайте параметру *глубина* нулевое значение.

source: This setting is thread-specific.
ru: Этот параметр зависит от потока.

source: Changes the :term:`filesystem encoding and error handler` to 'mbcs' and 'replace' respectively, for consistency with versions of Python prior to 3.6.
ru: Изменяет :term:`кодировку файловой системы и обработчик ошибок` на 'mbcs' и 'replace' соответственно, для совместимости с версиями Python до 3.6.

source: This is equivalent to defining the :envvar:`PYTHONLEGACYWINDOWSFSENCODING` environment variable before launching Python.
ru: Это эквивалентно определению переменной среды :envvar:`PYTHONLEGACYWINDOWSFSENCODING` перед запуском Python.

source: See also :func:`sys.getfilesystemencoding` and :func:`sys.getfilesystemencodeerrors`.
ru: См. также :func:`sys.getfilesystemencoding` и :func:`sys.getfilesystemencodeerrors`.

source: See :pep:`529` for more details.
ru: См. :pep:`529` для более подробной информации.

source: :term:`File objects <file object>` used by the interpreter for standard input, output and errors:
ru: :term:`Файловые объекты <файловый объект>` используются интерпретатором для стандартного ввода, вывода и ошибок:

source: ``stdin`` is used for all interactive input (including calls to :func:`input`);
ru: ``stdin`` используется для всего интерактивного ввода (включая вызовы :func:`input`);

source: ``stdout`` is used for the output of :func:`print` and :term:`expression` statements and for the prompts of :func:`input`;
ru: ``stdout`` используется для вывода операторов :func:`print` и :term:`expression`, а также для подсказок :func:`input`;

source: The interpreter's own prompts and its error messages go to ``stderr``.
ru: Собственные запросы интерпретатора и сообщения об ошибках передаются в stderr.

source: These streams are regular :term:`text files <text file>` like those returned by the :func:`open` function. Their parameters are chosen as follows:
ru: Эти потоки представляют собой обычные :term:`текстовые файлы <текстовый файл>`, подобные тем, которые возвращаются функцией :func:`open`. Их параметры выбраны следующие:

source: The encoding and error handling are is initialized from :c:member:`PyConfig.stdio_encoding` and :c:member:`PyConfig.stdio_errors`.
ru: Кодирование и обработка ошибок инициализируются из :c:member:`PyConfig.stdio_encoding` и :c:member:`PyConfig.stdio_errors`.

source: On Windows, UTF-8 is used for the console device. Non-character devices such as disk files and pipes use the system locale encoding (i.e. the ANSI codepage). Non-console character devices such as NUL (i.e. where ``isatty()`` returns ``True``) use the value of the console input and output codepages at startup, respectively for stdin and stdout/stderr. This defaults to the system :term:`locale encoding` if the process is not initially attached to a console.
ru: В Windows для консольного устройства используется UTF-8. Несимвольные устройства, такие как дисковые файлы и каналы, используют кодировку локали системы (т. е. кодовую страницу ANSI). Неконсольные символьные устройства, такие как NUL (т.е. где ``isatty()`` возвращает ``True``), используют значения кодовых страниц ввода и вывода консоли при запуске соответственно для stdin и stdout/stderr. По умолчанию используется системная кодировка локали, если процесс изначально не подключен к консоли.

source: The special behaviour of the console can be overridden by setting the environment variable PYTHONLEGACYWINDOWSSTDIO before starting Python. In that case, the console codepages are used as for any other character device.
ru: Особое поведение консоли можно переопределить, установив переменную среды PYTHONLEGACYWINDOWSSTDIO перед запуском Python. В этом случае кодовые страницы консоли используются так же, как и для любого другого символьного устройства.

source: Under all platforms, you can override the character encoding by setting the :envvar:`PYTHONIOENCODING` environment variable before starting Python or by using the new :option:`-X` ``utf8`` command line option and :envvar:`PYTHONUTF8` environment variable. However, for the Windows console, this only applies when :envvar:`PYTHONLEGACYWINDOWSSTDIO` is also set.
ru: На всех платформах вы можете переопределить кодировку символов, установив переменную среды :envvar:`PYTHONIOENCODING` перед запуском Python или используя новый параметр командной строки :option:`-X```utf8`` и :envvar:`PYTHONUTF8. `переменная среды. Однако для консоли Windows это применимо только в том случае, если также установлен :envvar:`PYTHONLEGACYWINDOWSSTDIO`.

source: When interactive, the ``stdout`` stream is line-buffered. Otherwise, it is block-buffered like regular text files. The ``stderr`` stream is line-buffered in both cases. You can make both streams unbuffered by passing the :option:`-u` command-line option or setting the :envvar:`PYTHONUNBUFFERED` environment variable.
ru: В интерактивном режиме поток stdout буферизуется по строкам. В противном случае он буферизуется по блокам, как обычные текстовые файлы. В обоих случаях поток stderr буферизуется по строкам. Вы можете сделать оба потока небуферизованными, передав параметр командной строки :option:`-u` или установив переменную среды :envvar:`PYTHONUNBUFFERED`.

source: Non-interactive ``stderr`` is now line-buffered instead of fully buffered.
ru: Неинтерактивный stderr теперь буферизуется построчно, а не полностью.

source: To write or read binary data from/to the standard streams, use the underlying binary :data:`~io.TextIOBase.buffer` object. For example, to write bytes to :data:`stdout`, use ``sys.stdout.buffer.write(b'abc')``.
ru: Чтобы записать или прочитать двоичные данные из/в стандартные потоки, используйте базовый двоичный объект :data:`~io.TextIOBase.buffer`. Например, чтобы записать байты в :data:`stdout`, используйте ``sys.stdout.buffer.write(b'abc')``.

source: However, if you are writing a library (and do not control in which context its code will be executed), be aware that the standard streams may be replaced with file-like objects like :class:`io.StringIO` which do not support the :attr:`!buffer` attribute.
ru: Однако, если вы пишете библиотеку (и не контролируете, в каком контексте будет выполняться ее код), имейте в виду, что стандартные потоки могут быть заменены файловоподобными объектами, такими как :class:`io.StringIO`, которые не поддерживают атрибут :attr:`!buffer`.

source: These objects contain the original values of ``stdin``, ``stderr`` and ``stdout`` at the start of the program. They are used during finalization, and could be useful to print to the actual standard stream no matter if the ``sys.std*`` object has been redirected.
ru: Эти объекты содержат исходные значения stdin, stderr и stdout в начале программы. Они используются во время финализации и могут быть полезны для печати в фактический стандартный поток, независимо от того, был ли перенаправлен объект ``sys.std*``.

source: It can also be used to restore the actual files to known working file objects in case they have been overwritten with a broken object. However, the preferred way to do this is to explicitly save the previous stream before replacing it, and restore the saved object.
ru: Его также можно использовать для восстановления реальных файлов до известных рабочих файловых объектов в случае, если они были перезаписаны поврежденным объектом. Однако предпочтительный способ сделать это — явно сохранить предыдущий поток перед его заменой и восстановить сохраненный объект.

source: Under some conditions ``stdin``, ``stdout`` and ``stderr`` as well as the original values ``__stdin__``, ``__stdout__`` and ``__stderr__`` can be ``None``. It is usually the case for Windows GUI apps that aren't connected to a console and Python apps started with :program:`pythonw`.
ru: При некоторых условиях ``stdin``, ``stdout`` и ``stderr``, а также исходные значения ``__stdin__``, ``__stdout__`` и ``__stderr__`` могут быть ``None`` . Обычно это касается приложений Windows с графическим интерфейсом, которые не подключены к консоли, и приложений Python, начинающихся с :program:`pythonw`.

source: A frozenset of strings containing the names of standard library modules.
ru: Замороженный набор строк, содержащий имена модулей стандартной библиотеки.

source: It is the same on all platforms. Modules which are not available on some platforms and modules disabled at Python build are also listed. All module kinds are listed: pure Python, built-in, frozen and extension modules. Test modules are excluded.
ru: Это одинаково на всех платформах. Также перечислены модули, недоступные на некоторых платформах, и модули, отключенные при сборке Python. Перечислены все типы модулей: чистый Python, встроенные, замороженные и модули расширения. Тестовые модули исключены.

source: For packages, only the main package is listed: sub-packages and sub-modules are not listed. For example, the ``email`` package is listed, but the ``email.mime`` sub-package and the ``email.message`` sub-module are not listed.
ru: Для пакетов указан только основной пакет: подпакеты и подмодули не указаны. Например, в списке указан пакет ``email``, но подпакет ``email.mime`` и подмодуль ``email.message`` не указаны.

source: See also the :data:`sys.builtin_module_names` list.
ru: См. также список :data:`sys.builtin_module_names`.

source: A :term:`named tuple` holding information about the thread implementation.
ru: :term:`named tuple`, содержащий информацию о реализации потока.

source: The name of the thread implementation:
ru: Имя реализации потока:

source: ``"pthread-stubs"``: stub POSIX threads (on WebAssembly platforms without threading support)
ru: ``"pthread-stubs"``: заглушка потоков POSIX (на платформах WebAssembly без поддержки потоков)

source: The name of the lock implementation:
ru: Имя реализации блокировки:

source: ``"semaphore"``: a lock uses a semaphore
ru: ``"семафор"``: блокировка использует семафор.

source: ``"mutex+cond"``: a lock uses a mutex and a condition variable
ru: ``"mutex+cond"``: блокировка использует мьютекс и условную переменную.

source: ``None`` if this information is unknown
ru: ``None``, если эта информация неизвестна

source: The name and version of the thread library. It is a string, or ``None`` if this information is unknown.
ru: Имя и версия библиотеки потоков. Это строка или «Нет», если эта информация неизвестна.

source: When this variable is set to an integer value, it determines the maximum number of levels of traceback information printed when an unhandled exception occurs. The default is ``1000``. When set to ``0`` or less, all traceback information is suppressed and only the exception type and value are printed.
ru: Когда этой переменной присвоено целочисленное значение, она определяет максимальное количество уровней информации трассировки, выводимой при возникновении необработанного исключения. По умолчанию установлено ``1000``. Если установлено значение «0» или меньше, вся информация обратной трассировки подавляется и печатаются только тип и значение исключения.

source: Handle an unraisable exception.
ru: Обработка невызываемого исключения.

source: Called when an exception has occurred but there is no way for Python to handle it. For example, when a destructor raises an exception or during garbage collection (:func:`gc.collect`).
ru: Вызывается, когда произошло исключение, но Python не может его обработать. Например, когда деструктор вызывает исключение или во время сборки мусора (:func:`gc.collect`).

source: The *unraisable* argument has the following attributes:
ru: Аргумент *unraisable* имеет следующие атрибуты:

source: :attr:`!exc_type`: Exception type.
ru: :attr:`!exc_type`: Тип исключения.

source: :attr:`!exc_value`: Exception value, can be ``None``.
ru: :attr:`!exc_value`: Значение исключения, может быть ``Нет``.

source: :attr:`!exc_traceback`: Exception traceback, can be ``None``.
ru: :attr:`!exc_traceback`: обратная трассировка исключений, может быть ``Нет``.

source: :attr:`!err_msg`: Error message, can be ``None``.
ru: :attr:`!err_msg`: Сообщение об ошибке, может быть ``Нет``.

source: :attr:`!object`: Object causing the exception, can be ``None``.
ru: :attr:`!object`: Объект, вызывающий исключение, может быть ``None``.

source: The default hook formats :attr:`!err_msg` and :attr:`!object` as: ``f'{err_msg}: {object!r}'``; use "Exception ignored in" error message if :attr:`!err_msg` is ``None``.
ru: Форматы ловушек по умолчанию :attr:`!err_msg` и :attr:`!object` как: ``f'{err_msg}: {object!r}'``; используйте сообщение об ошибке «Исключение игнорируется», если :attr:`!err_msg` имеет значение ``None``.

source: :func:`sys.unraisablehook` can be overridden to control how unraisable exceptions are handled.
ru: :func:`sys.unraisablehook` можно переопределить, чтобы контролировать обработку невозбуждаемых исключений.

source: :func:`excepthook` which handles uncaught exceptions.
ru: :func:`Exceptionhook`, который обрабатывает неперехваченные исключения.

source: Storing :attr:`!exc_value` using a custom hook can create a reference cycle. It should be cleared explicitly to break the reference cycle when the exception is no longer needed.
ru: Сохранение :attr:`!exc_value` с использованием специального перехватчика может создать ссылочный цикл. Его следует очистить явно, чтобы прервать ссылочный цикл, когда исключение больше не требуется.

source: Storing :attr:`!object` using a custom hook can resurrect it if it is set to an object which is being finalized. Avoid storing :attr:`!object` after the custom hook completes to avoid resurrecting objects.
ru: Сохранение :attr:`!object` с использованием пользовательского хука может воскресить его, если для него установлен объект, который находится в стадии финализации. Избегайте сохранения :attr:`!object` после завершения пользовательского перехватчика, чтобы избежать воскрешения объектов.

source: Raise an auditing event ``sys.unraisablehook`` with arguments *hook*, *unraisable* when an exception that cannot be handled occurs. The *unraisable* object is the same as what will be passed to the hook. If no hook has been set, *hook* may be ``None``.
ru: Вызовите событие аудита ``sys.unraisablehook`` с аргументами *hook*, *unraisable*, когда возникает исключение, которое невозможно обработать. Объект *unraisable* аналогичен тому, что будет передано в перехватчик. Если крючок не установлен, *крючок* может иметь значение «Нет».

source: A string containing the version number of the Python interpreter plus additional information on the build number and compiler used. This string is displayed when the interactive interpreter is started. Do not extract version information out of it, rather, use :data:`version_info` and the functions provided by the :mod:`platform` module.
ru: Строка, содержащая номер версии интерпретатора Python, а также дополнительную информацию о номере сборки и используемом компиляторе. Эта строка отображается при запуске интерактивного интерпретатора. Не извлекайте из него информацию о версии, а используйте :data:`version_info` и функции, предоставляемые модулем :mod:`platform`.

source: The C API version for this interpreter. Programmers may find this useful when debugging version conflicts between Python and extension modules.
ru: Версия C API для этого интерпретатора. Программистам это может оказаться полезным при отладке конфликтов версий между Python и модулями расширения.

source: A tuple containing the five components of the version number: *major*, *minor*, *micro*, *releaselevel*, and *serial*. All values except *releaselevel* are integers; the release level is ``'alpha'``, ``'beta'``, ``'candidate'``, or ``'final'``. The ``version_info`` value corresponding to the Python version 2.0 is ``(2, 0, 0, 'final', 0)``. The components can also be accessed by name, so ``sys.version_info[0]`` is equivalent to ``sys.version_info.major`` and so on.
ru: Кортеж, содержащий пять компонентов номера версии: *major*, *minor*, *micro*, *releaselevel* и *serial*. Все значения, кроме *releaselevel*, являются целыми числами; уровень выпуска — «альфа», «бета», «кандидат» или «финальный». Значение version_info, соответствующее версии Python 2.0, равно ``(2, 0, 0, 'final', 0)``. Доступ к компонентам также возможен по имени, поэтому ``sys.version_info[0]`` эквивалентен ``sys.version_info.major`` и так далее.

source: Added named component attributes.
ru: Добавлены атрибуты именованных компонентов.

source: This is an implementation detail of the warnings framework; do not modify this value. Refer to the :mod:`warnings` module for more information on the warnings framework.
ru: Это деталь реализации системы предупреждений; не изменяйте это значение. Обратитесь к модулю :mod:`warnings` для получения дополнительной информации о системе предупреждений.

source: The version number used to form registry keys on Windows platforms. This is stored as string resource 1000 in the Python DLL. The value is normally the major and minor versions of the running Python interpreter. It is provided in the :mod:`sys` module for informational purposes; modifying this value has no effect on the registry keys used by Python.
ru: Номер версии, используемый для формирования ключей реестра на платформах Windows. Он хранится как строковый ресурс 1000 в Python DLL. Обычно это значение представляет собой основную и дополнительную версии работающего интерпретатора Python. Он предоставляется в модуле :mod:`sys` для информационных целей; изменение этого значения не влияет на ключи реестра, используемые Python.
