Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/sys.po
Languages: ru

source: Get the :term:`filesystem error handler <filesystem encoding and error handler>`: the error handler used with the :term:`filesystem encoding <filesystem encoding and error handler>` to convert between Unicode filenames and bytes filenames. The filesystem encoding is returned from :func:`getfilesystemencoding`.
ru: Получите :term:`обработчик ошибок файловой системы <кодировка файловой системы и обработчик ошибок>`: обработчик ошибок, используемый с :term:`кодировкой файловой системы <кодировка файловой системы и обработчик ошибок>` для преобразования имен файлов в Юникоде и байтовых имен файлов. Кодировка файловой системы возвращается из :func:`getfilesystemencoding`.

source: Returns the current value for the :ref:`integer string conversion length limitation <int_max_str_digits>`. See also :func:`set_int_max_str_digits`.
ru: Возвращает текущее значение ограничения длины преобразования целочисленной строки <int_max_str_digits>`. См. также :func:`set_int_max_str_digits`.

source: Return the reference count of the *object*. The count returned is generally one higher than you might expect, because it includes the (temporary) reference as an argument to :func:`getrefcount`.
ru: Возвращает счетчик ссылок *объекта*. Возвращаемое значение обычно на единицу больше, чем вы могли ожидать, поскольку оно включает (временную) ссылку в качестве аргумента функции :func:`getrefcount`.

source: Return the current value of the recursion limit, the maximum depth of the Python interpreter stack. This limit prevents infinite recursion from causing an overflow of the C stack and crashing Python. It can be set by :func:`setrecursionlimit`.
ru: Возвращает текущее значение предела рекурсии, максимальную глубину стека интерпретатора Python. Это ограничение не позволяет бесконечной рекурсии вызвать переполнение стека C и сбой Python. Его можно установить с помощью :func:`setrecursionlimit`.

source: Return the size of an object in bytes. The object can be any type of object. All built-in objects will return correct results, but this does not have to hold true for third-party extensions as it is implementation specific.
ru: Возвращает размер объекта в байтах. Объект может быть объектом любого типа. Все встроенные объекты будут возвращать правильные результаты, но это не обязательно относится к сторонним расширениям, поскольку это зависит от реализации.

source: Only the memory consumption directly attributed to the object is accounted for, not the memory consumption of objects it refers to.
ru: Учитывается только потребление памяти, непосредственно связанное с объектом, а не потребление памяти объектами, на которые он ссылается.

source: If given, *default* will be returned if the object does not provide means to retrieve the size. Otherwise a :exc:`TypeError` will be raised.
ru: Если задано, будет возвращено значение *default*, если объект не предоставляет средства для получения размера. В противном случае будет выдано :exc:`TypeError`.

source: :func:`getsizeof` calls the object's ``__sizeof__`` method and adds an additional garbage collector overhead if the object is managed by the garbage collector.
ru: :func:`getsizeof` вызывает метод объекта ``__sizeof__`` и добавляет дополнительные издержки сборщика мусора, если объект управляется сборщиком мусора.

source: Return the interpreter's "thread switch interval"; see :func:`setswitchinterval`.
ru: Возвращает «интервал переключения потоков» интерпретатора; см. :func:`setswitchinterval`.

source: Return a frame object from the call stack. If optional integer *depth* is given, return the frame object that many calls below the top of the stack. If that is deeper than the call stack, :exc:`ValueError` is raised. The default for *depth* is zero, returning the frame at the top of the call stack.
ru: Возвращает объект кадра из стека вызовов. Если указано необязательное целое число *глубина*, верните объект кадра, который многие вызывают ниже вершины стека. Если это глубже, чем стек вызовов, возникает :exc:`ValueError`. Значение по умолчанию для *глубины* равно нулю, возвращая кадр наверху стека вызовов.

source: Raises an :ref:`auditing event <auditing>` ``sys._getframe`` with argument ``frame``.
ru: Вызывает событие аудита <auditing>``sys._getframe`` с аргументом ``frame``.

source: This function should be used for internal and specialized purposes only. It is not guaranteed to exist in all implementations of Python.
ru: Эту функцию следует использовать только для внутренних и специализированных целей. Не гарантируется его существование во всех реализациях Python.

source: Get the profiler function as set by :func:`setprofile`.
ru: Получите функцию профилировщика, установленную :func:`setprofile`.

source: Get the trace function as set by :func:`settrace`.
ru: Получите функцию трассировки, установленную :func:`settrace`.

source: The :func:`gettrace` function is intended only for implementing debuggers, profilers, coverage tools and the like. Its behavior is part of the implementation platform, rather than part of the language definition, and thus may not be available in all Python implementations.
ru: Функция :func:`gettrace` предназначена только для реализации отладчиков, профилировщиков, инструментов покрытия и т.п. Его поведение является частью платформы реализации, а не частью определения языка, и поэтому может быть доступно не во всех реализациях Python.

source: Return a named tuple describing the Windows version currently running. The named elements are *major*, *minor*, *build*, *platform*, *service_pack*, *service_pack_minor*, *service_pack_major*, *suite_mask*, *product_type* and *platform_version*. *service_pack* contains a string, *platform_version* a 3-tuple and all other values are integers. The components can also be accessed by name, so ``sys.getwindowsversion()[0]`` is equivalent to ``sys.getwindowsversion().major``. For compatibility with prior versions, only the first 5 elements are retrievable by indexing.
ru: Возвращает именованный кортеж, описывающий текущую версию Windows. Именованные элементы: *major*, *minor*, *build*, *platform*, *service_pack*, *service_pack_minor*, *service_pack_major*, *suite_mask*, *product_type* и *platform_version*. *service_pack* содержит строку, *platform_version* — кортеж из трех элементов, а все остальные значения являются целыми числами. Доступ к компонентам также возможен по имени, поэтому ``sys.getwindowsversion()[0]`` эквивалентен ``sys.getwindowsversion().major``. Для совместимости с предыдущими версиями индексированием можно получить только первые 5 элементов.

source: *product_type* may be one of the following values:
ru: *product_type* может иметь одно из следующих значений:

source: Constant
ru: Константа

source: Meaning
ru: Значение

source: The system is a workstation.
ru: Система представляет собой рабочую станцию.

source: The system is a domain controller.
ru: Система является контроллером домена.

source: The system is a server, but not a domain controller.
ru: Система является сервером, а не контроллером домена.

source: This function wraps the Win32 :c:func:`!GetVersionEx` function; see the Microsoft documentation on :c:func:`!OSVERSIONINFOEX` for more information about these fields.
ru: Эта функция оборачивает функцию Win32 :c:func:`!GetVersionEx`; дополнительную информацию об этих полях см. в документации Microsoft по :c:func:`!OSVERSIONINFOEX`.

source: *platform_version* returns the major version, minor version and build number of the current operating system, rather than the version that is being emulated for the process. It is intended for use in logging rather than for feature detection.
ru: *platform_version* возвращает основную версию, дополнительную версию и номер сборки текущей операционной системы, а не версию, которая эмулируется для процесса. Он предназначен для использования в журналировании, а не для обнаружения функций.

source: *platform_version* derives the version from kernel32.dll which can be of a different version than the OS version. Please use :mod:`platform` module for achieving accurate OS version.
ru: *platform_version* получает версию из kernel32.dll, которая может отличаться от версии ОС. Пожалуйста, используйте модуль :mod:`platform` для получения точной версии ОС.

source: Changed to a named tuple and added *service_pack_minor*, *service_pack_major*, *suite_mask*, and *product_type*.
ru: Изменен на именованный кортеж и добавлены *service_pack_minor*, *service_pack_major*, *suite_mask* и *product_type*.

source: Added *platform_version*
ru: Добавлена *платформа_версии*.

source: Returns an *asyncgen_hooks* object, which is similar to a :class:`~collections.namedtuple` of the form ``(firstiter, finalizer)``, where *firstiter* and *finalizer* are expected to be either ``None`` or functions which take an :term:`asynchronous generator iterator` as an argument, and are used to schedule finalization of an asynchronous generator by an event loop.
ru: Возвращает объект *asyncgen_hooks*, который похож на :class:`~collections.namedtuple` формы ``(firstiter, Finalizer)``, где *firstiter* и *finalizer* должны быть либо ``None ``или функции, которые принимают :term:`итератор асинхронного генератора` в качестве аргумента и используются для планирования завершения асинхронного генератора с помощью цикла событий.

source: See :pep:`525` for more details.
ru: См. :pep:`525` для более подробной информации.

source: This function has been added on a provisional basis (see :pep:`411` for details.)
ru: Эта функция была добавлена ​​временно (подробности см. в :pep:`411`).

source: Get the current coroutine origin tracking depth, as set by :func:`set_coroutine_origin_tracking_depth`.
ru: Получите текущую глубину отслеживания происхождения сопрограммы, как установлено :func:`set_coroutine_origin_tracking_length`.

source: This function has been added on a provisional basis (see :pep:`411` for details.) Use it only for debugging purposes.
ru: Эта функция была добавлена ​​временно (подробности см. в :pep:`411`). Используйте ее только в целях отладки.

source: A :term:`named tuple` giving parameters of the numeric hash implementation. For more details about hashing of numeric types, see :ref:`numeric-hash`.
ru: :term:`named tuple`, задающий параметры реализации числового хэша. Более подробную информацию о хешировании числовых типов см. в разделе :ref:`numeric-hash`.

source: The width in bits used for hash values
ru: Ширина в битах, используемая для хеш-значений.

source: The prime modulus P used for numeric hash scheme
ru: Простой модуль P, используемый для числовой схемы хэширования.

source: The hash value returned for a positive infinity
ru: Хэш-значение возвращается для положительной бесконечности.

source: (This attribute is no longer used)
ru: (Этот атрибут больше не используется)

source: The multiplier used for the imaginary part of a complex number
ru: Множитель, используемый для мнимой части комплексного числа.

source: The name of the algorithm for hashing of str, bytes, and memoryview
ru: Название алгоритма хеширования строк, байтов и памяти.

source: The internal output size of the hash algorithm
ru: Внутренний выходной размер алгоритма хеширования

source: The size of the seed key of the hash algorithm
ru: Размер начального ключа хэш-алгоритма

source: Added *algorithm*, *hash_bits* and *seed_bits*
ru: Добавлен *алгоритм*, *hash_bits* и *seed_bits*.

source: The version number encoded as a single integer. This is guaranteed to increase with each version, including proper support for non-production releases. For example, to test that the Python interpreter is at least version 1.5.2, use::
ru: Номер версии, закодированный как одно целое число. Это гарантированно увеличивается с каждой версией, включая правильную поддержку непроизводственных выпусков. Например, чтобы проверить, что интерпретатор Python имеет версию не ниже 1.5.2, используйте::

source: This is called ``hexversion`` since it only really looks meaningful when viewed as the result of passing it to the built-in :func:`hex` function. The :term:`named tuple` :data:`sys.version_info` may be used for a more human-friendly encoding of the same information.
ru: Это называется ``hexversion``, поскольку оно действительно выглядит значимым только тогда, когда рассматривается как результат его передачи встроенной функции :func:`hex`. :term:`named tuple` :data:`sys.version_info` может использоваться для более удобного для человека кодирования той же информации.

source: More details of ``hexversion`` can be found at :ref:`apiabiversion`.
ru: Более подробную информацию о «hexversion» можно найти по адресу :ref:`apiabiversion`.

source: An object containing information about the implementation of the currently running Python interpreter. The following attributes are required to exist in all Python implementations.
ru: Объект, содержащий информацию о реализации текущего интерпретатора Python. Следующие атрибуты должны существовать во всех реализациях Python.

source: *name* is the implementation's identifier, e.g. ``'cpython'``. The actual string is defined by the Python implementation, but it is guaranteed to be lower case.
ru: *name* — это идентификатор реализации, например ``'cpython'``. Фактическая строка определяется реализацией Python, но она гарантированно будет в нижнем регистре.

source: *version* is a named tuple, in the same format as :data:`sys.version_info`. It represents the version of the Python *implementation*. This has a distinct meaning from the specific version of the Python *language* to which the currently running interpreter conforms, which ``sys.version_info`` represents. For example, for PyPy 1.8 ``sys.implementation.version`` might be ``sys.version_info(1, 8, 0, 'final', 0)``, whereas ``sys.version_info`` would be ``sys.version_info(2, 7, 2, 'final', 0)``. For CPython they are the same value, since it is the reference implementation.
ru: *version* — это именованный кортеж в том же формате, что и :data:`sys.version_info`. Он представляет собой версию *реализации* Python. Это имеет отличное значение от конкретной версии *языка* Python, которой соответствует работающий в данный момент интерпретатор, который представляет ``sys.version_info``. Например, для PyPy 1.8 ``sys.implementation.version`` может быть ``sys.version_info(1, 8, 0, 'final', 0)``, тогда как ``sys.version_info`` будет `` sys.version_info(2, 7, 2, 'final', 0)``. Для CPython это одно и то же значение, поскольку это эталонная реализация.

source: *hexversion* is the implementation version in hexadecimal format, like :data:`sys.hexversion`.
ru: *hexversion* — это версия реализации в шестнадцатеричном формате, например :data:`sys.hexversion`.

source: *cache_tag* is the tag used by the import machinery in the filenames of cached modules. By convention, it would be a composite of the implementation's name and version, like ``'cpython-33'``. However, a Python implementation may use some other value if appropriate. If ``cache_tag`` is set to ``None``, it indicates that module caching should be disabled.
ru: *cache_tag* — это тег, используемый механизмом импорта в именах файлов кэшированных модулей. По соглашению, это будет комбинация имени и версии реализации, например ``'cpython-33'``. Однако реализация Python может использовать и другое значение, если это необходимо. Если для параметра «cache_tag» установлено значение «Нет», это означает, что кэширование модуля должно быть отключено.

source: :data:`sys.implementation` may contain additional attributes specific to the Python implementation. These non-standard attributes must start with an underscore, and are not described here. Regardless of its contents, :data:`sys.implementation` will not change during a run of the interpreter, nor between implementation versions. (It may change between Python language versions, however.) See :pep:`421` for more information.
ru: :data:`sys.implementation` может содержать дополнительные атрибуты, специфичные для реализации Python. Эти нестандартные атрибуты должны начинаться с подчеркивания и здесь не описаны. Независимо от своего содержимого, :data:`sys.implementation` не будет меняться ни во время работы интерпретатора, ни между версиями реализации. (Однако это может меняться в зависимости от версии языка Python.) Дополнительную информацию смотрите в :pep:`421`.

source: The addition of new required attributes must go through the normal PEP process. See :pep:`421` for more information.
ru: Добавление новых обязательных атрибутов должно проходить через обычный процесс PEP. См. :pep:`421` для получения дополнительной информации.

source: A :term:`named tuple` that holds information about Python's internal representation of integers. The attributes are read only.
ru: :term:`named tuple`, который содержит информацию о внутреннем представлении целых чисел в Python. Атрибуты доступны только для чтения.

source: The number of bits held in each digit. Python integers are stored internally in base ``2**int_info.bits_per_digit``.
ru: Количество битов, содержащихся в каждой цифре. Целые числа Python хранятся внутри базы ``2**int_info.bits_per_digit``.

source: The size in bytes of the C type used to represent a digit.
ru: Размер в байтах типа C, используемый для представления цифры.

source: The default value for :func:`sys.get_int_max_str_digits` when it is not otherwise explicitly configured.
ru: Значение по умолчанию для :func:`sys.get_int_max_str_digits`, если оно не настроено иным образом явно.

source: The minimum non-zero value for :func:`sys.set_int_max_str_digits`, :envvar:`PYTHONINTMAXSTRDIGITS`, or :option:`-X int_max_str_digits <-X>`.
ru: Минимальное ненулевое значение для :func:`sys.set_int_max_str_digits`, :envvar:`PYTHONINTMAXSTRDIGITS` или :option:`-X int_max_str_digits <-X>`.

source: Added :attr:`~int_info.default_max_str_digits` and :attr:`~int_info.str_digits_check_threshold`.
ru: Добавлены :attr:`~int_info.default_max_str_digits` и :attr:`~int_info.str_digits_check_threshold`.

source: When this attribute exists, its value is automatically called (with no arguments) when the interpreter is launched in :ref:`interactive mode <tut-interactive>`. This is done after the :envvar:`PYTHONSTARTUP` file is read, so that you can set this hook there. The :mod:`site` module :ref:`sets this <rlcompleter-config>`.
ru: Если этот атрибут существует, его значение автоматически вызывается (без аргументов) при запуске интерпретатора в интерактивном режиме <tut-interactive>`. Это делается после того, как файл :envvar:`PYTHONSTARTUP` прочитан, чтобы вы могли установить там этот хук. Модуль :mod:`site` :ref:`устанавливает этот <rlcompleter-config>`.

source: Raises an :ref:`auditing event <auditing>` ``cpython.run_interactivehook`` with the hook object as the argument when the hook is called on startup.
ru: Вызывает :ref:`событие аудита <auditing>` ``cpython.run_interactivehook`` с объектом-перехватчиком в качестве аргумента, когда перехватчик вызывается при запуске.

source: Enter *string* in the table of "interned" strings and return the interned string -- which is *string* itself or a copy. Interning strings is useful to gain a little performance on dictionary lookup -- if the keys in a dictionary are interned, and the lookup key is interned, the key comparisons (after hashing) can be done by a pointer compare instead of a string compare. Normally, the names used in Python programs are automatically interned, and the dictionaries used to hold module, class or instance attributes have interned keys.
ru: Введите *строку* в таблицу «внутренних» строк и верните встроенную строку, которая является самой *строкой* или ее копией. Интернирование строк полезно для повышения производительности поиска по словарю — если ключи в словаре интернированы, а ключ поиска интернирован, сравнение ключей (после хеширования) может выполняться путем сравнения указателей вместо сравнения строк. Обычно имена, используемые в программах Python, автоматически интернируются, а словари, используемые для хранения атрибутов модуля, класса или экземпляра, имеют интернированные ключи.

source: Interned strings are not immortal; you must keep a reference to the return value of :func:`intern` around to benefit from it.
ru: Интернированные строки не бессмертны; вы должны хранить ссылку на возвращаемое значение :func:`intern`, чтобы извлечь из этого пользу.

source: Return :const:`True` if the Python interpreter is :term:`shutting down <interpreter shutdown>`, :const:`False` otherwise.
ru: Верните :const:`True`, если интерпретатор Python :term:`выключается <интерпретатор завершение работы>`, :const:`False` в противном случае.

source: An integer giving the maximum value a variable of type :c:type:`Py_ssize_t` can take. It's usually ``2**31 - 1`` on a 32-bit platform and ``2**63 - 1`` on a 64-bit platform.
ru: Целое число, задающее максимальное значение, которое может принимать переменная типа :c:type:`Py_ssize_t`. Обычно это ``2**31 - 1`` на 32-битной платформе и ``2**63 - 1`` на 64-битной платформе.

source: An integer giving the value of the largest Unicode code point, i.e. ``1114111`` (``0x10FFFF`` in hexadecimal).
ru: Целое число, задающее значение наибольшей кодовой точки Юникода, т. е. ``1114111`` (``0x10FFFF`` в шестнадцатеричном формате).

source: Before :pep:`393`, ``sys.maxunicode`` used to be either ``0xFFFF`` or ``0x10FFFF``, depending on the configuration option that specified whether Unicode characters were stored as UCS-2 or UCS-4.
ru: До :pep:`393` ``sys.maxunicode`` использовался как ``0xFFFF`` или ``0x10FFFF``, в зависимости от параметра конфигурации, определяющего, сохранялись ли символы Юникода как UCS-2 или UCS-. 4.

source: A list of :term:`meta path finder` objects that have their :meth:`~importlib.abc.MetaPathFinder.find_spec` methods called to see if one of the objects can find the module to be imported. By default, it holds entries that implement Python's default import semantics. The :meth:`~importlib.abc.MetaPathFinder.find_spec` method is called with at least the absolute name of the module being imported. If the module to be imported is contained in a package, then the parent package's :attr:`__path__` attribute is passed in as a second argument. The method returns a :term:`module spec`, or ``None`` if the module cannot be found.
ru: Список объектов :term:`meta path finder`, у которых есть методы :meth:`~importlib.abc.MetaPathFinder.find_spec`, вызываемые для проверки, может ли один из объектов найти импортируемый модуль. По умолчанию он содержит записи, реализующие семантику импорта Python по умолчанию. Метод :meth:`~importlib.abc.MetaPathFinder.find_spec` вызывается как минимум с абсолютным именем импортируемого модуля. Если импортируемый модуль содержится в пакете, то атрибут :attr:`__path__` родительского пакета передается в качестве второго аргумента. Метод возвращает спецификацию модуля или None, если модуль не найден.

source: The abstract base class defining the interface of finder objects on :data:`meta_path`.
ru: Абстрактный базовый класс, определяющий интерфейс объектов поиска в :data:`meta_path`.

source: The concrete class which :meth:`~importlib.abc.MetaPathFinder.find_spec` should return instances of.
ru: Конкретный класс, экземпляры которого :meth:`~importlib.abc.MetaPathFinder.find_spec` должен возвращать.
