Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/sys.po
Languages: ru

source: If this is set (not ``None``), Python will write bytecode-cache ``.pyc`` files to (and read them from) a parallel directory tree rooted at this directory, rather than from ``__pycache__`` directories in the source code tree. Any ``__pycache__`` directories in the source code tree will be ignored and new ``.pyc`` files written within the pycache prefix. Thus if you use :mod:`compileall` as a pre-build step, you must ensure you run it with the same pycache prefix (if any) that you will use at runtime.
ru: Если этот параметр установлен (не ``None``), Python будет записывать файлы кэша байт-кода ``.pyc`` в параллельное дерево каталогов (и читать их из него), а не из ``__pycache__``. каталоги в дереве исходного кода. Любые каталоги ``__pycache__`` в дереве исходного кода будут игнорироваться, а новые файлы ``.pyc`` будут записываться с префиксом pycache. Таким образом, если вы используете :mod:`compileall` в качестве шага перед сборкой, вы должны убедиться, что вы запускаете его с тем же префиксом pycache (если таковой имеется), который вы будете использовать во время выполнения.

source: A relative path is interpreted relative to the current working directory.
ru: Относительный путь интерпретируется относительно текущего рабочего каталога.

source: This value is initially set based on the value of the :option:`-X` ``pycache_prefix=PATH`` command-line option or the :envvar:`PYTHONPYCACHEPREFIX` environment variable (command-line takes precedence). If neither are set, it is ``None``.
ru: Первоначально это значение устанавливается на основе значения параметра командной строки :option:`-X` ``pycache_prefix=PATH`` или переменной среды :envvar:`PYTHONPYCACHEPREFIX` (командная строка имеет приоритет). Если ни один из них не установлен, это «Нет».

source: This function prints out a given traceback and exception to ``sys.stderr``.
ru: Эта функция выводит заданную обратную трассировку и исключение для ``sys.stderr``.

source: When an exception other than :exc:`SystemExit` is raised and uncaught, the interpreter calls ``sys.excepthook`` with three arguments, the exception class, exception instance, and a traceback object. In an interactive session this happens just before control is returned to the prompt; in a Python program this happens just before the program exits. The handling of such top-level exceptions can be customized by assigning another three-argument function to ``sys.excepthook``.
ru: Когда исключение, отличное от :exc:`SystemExit`, возбуждается и не перехватывается, интерпретатор вызывает ``sys.Exceptionhook`` с тремя аргументами: классом исключения, экземпляром исключения и объектом трассировки. В интерактивном сеансе это происходит непосредственно перед возвратом управления в командную строку; в программе Python это происходит непосредственно перед выходом из программы. Обработку таких исключений верхнего уровня можно настроить, назначив еще одну функцию с тремя аргументами для ``sys.Exceptionhook``.

source: Raise an auditing event ``sys.excepthook`` with arguments ``hook``, ``type``, ``value``, ``traceback`` when an uncaught exception occurs. If no hook has been set, ``hook`` may be ``None``. If any hook raises an exception derived from :class:`RuntimeError` the call to the hook will be suppressed. Otherwise, the audit hook exception will be reported as unraisable and ``sys.excepthook`` will be called.
ru: Вызовите событие аудита ``sys.excepthook`` с аргументами ``hook``, ``type``, ``value``, ``traceback``, когда происходит неперехваченное исключение. Если крючок не установлен, «крючок» может быть «Нет». Если какой-либо перехватчик вызывает исключение, полученное из :class:`RuntimeError`, вызов перехватчика будет подавлен. В противном случае об исключении контрольной точки будет сообщено как о невозможном вызвать sys.excepthook.

source: The :func:`sys.unraisablehook` function handles unraisable exceptions and the :func:`threading.excepthook` function handles exception raised by :func:`threading.Thread.run`.
ru: Функция :func:`sys.unraisablehook` обрабатывает невозможные исключения, а функция :func:`threading.excepthook` обрабатывает исключения, вызванные :func:`threading.Thread.run`.

source: These objects contain the original values of ``breakpointhook``, ``displayhook``, ``excepthook``, and ``unraisablehook`` at the start of the program. They are saved so that ``breakpointhook``, ``displayhook`` and ``excepthook``, ``unraisablehook`` can be restored in case they happen to get replaced with broken or alternative objects.
ru: Эти объекты содержат исходные значения ``breakpointhook``, ``displayhook``, ``excepthook`` и ``unraisablehook`` в начале программы. Они сохраняются таким образом, что ``breakpointhook``, ``displayhook`` и ``excepthook``, ``unraisablehook`` могут быть восстановлены в случае, если они будут заменены сломанными или альтернативными объектами.

source: This function, when called while an exception handler is executing (such as an ``except`` or ``except*`` clause), returns the exception instance that was caught by this handler. When exception handlers are nested within one another, only the exception handled by the innermost handler is accessible.
ru: Эта функция, вызываемая во время выполнения обработчика исключений (например, предложения «кроме» или «кроме*»), возвращает экземпляр исключения, перехваченный этим обработчиком. Когда обработчики исключений вложены друг в друга, доступно только исключение, обрабатываемое самым внутренним обработчиком.

source: If no exception handler is executing, this function returns ``None``.
ru: Если ни один обработчик исключений не выполняется, эта функция возвращает None.

source: This function returns the old-style representation of the handled exception. If an exception ``e`` is currently handled (so :func:`exception` would return ``e``), :func:`exc_info` returns the tuple ``(type(e), e, e.__traceback__)``. That is, a tuple containing the type of the exception (a subclass of :exc:`BaseException`), the exception itself, and a :ref:`traceback object <traceback-objects>` which typically encapsulates the call stack at the point where the exception last occurred.
ru: Эта функция возвращает представление обработанного исключения в старом стиле. Если в настоящий момент обрабатывается исключение ``e`` (поэтому :func:`Exception` возвращает ``e``), :func:`exc_info` возвращает кортеж ``(type(e), e, e.__traceback__ )``. То есть кортеж, содержащий тип исключения (подкласс :exc:`BaseException`), само исключение и :ref:`объект трассировки <traceback-objects>`, который обычно инкапсулирует стек вызовов в этой точке. где исключение произошло в последний раз.

source: If no exception is being handled anywhere on the stack, this function return a tuple containing three ``None`` values.
ru: Если нигде в стеке не обрабатывается исключение, эта функция возвращает кортеж, содержащий три значения None.

source: The ``type`` and ``traceback`` fields are now derived from the ``value`` (the exception instance), so when an exception is modified while it is being handled, the changes are reflected in the results of subsequent calls to :func:`exc_info`.
ru: Поля ``type`` и ``traceback`` теперь являются производными от ``value`` (экземпляра исключения), поэтому, когда исключение изменяется во время его обработки, изменения отражаются в результатах последующих вызывает :func:`exc_info`.

source: A string giving the site-specific directory prefix where the platform-dependent Python files are installed; by default, this is also ``'/usr/local'``. This can be set at build time with the ``--exec-prefix`` argument to the :program:`configure` script. Specifically, all configuration files (e.g. the :file:`pyconfig.h` header file) are installed in the directory :file:`{exec_prefix}/lib/python{X.Y}/config`, and shared library modules are installed in :file:`{exec_prefix}/lib/python{X.Y}/lib-dynload`, where *X.Y* is the version number of Python, for example ``3.2``.
ru: Строка, указывающая префикс каталога для конкретного сайта, в котором установлены зависящие от платформы файлы Python; по умолчанию это также ``'/usr/local'``. Это можно установить во время сборки с помощью аргумента ``--exec-prefix`` скрипта :program:`configure`. В частности, все файлы конфигурации (например, заголовочный файл :file:`pyconfig.h`) устанавливаются в каталог :file:`{exec_prefix}/lib/python{XY}/config`, а модули общей библиотеки устанавливаются в: файл:`{exec_prefix}/lib/python{XY}/lib-dynload`, где *XY* — номер версии Python, например ``3.2``.

source: If a :ref:`virtual environment <venv-def>` is in effect, this value will be changed in ``site.py`` to point to the virtual environment. The value for the Python installation will still be available, via :data:`base_exec_prefix`.
ru: Если действует :ref:`виртуальная среда <venv-def>`, это значение будет изменено в ``site.py``, чтобы указать на виртуальную среду. Значение для установки Python по-прежнему будет доступно через :data:`base_exec_prefix`.

source: A string giving the absolute path of the executable binary for the Python interpreter, on systems where this makes sense. If Python is unable to retrieve the real path to its executable, :data:`sys.executable` will be an empty string or ``None``.
ru: Строка, указывающая абсолютный путь к исполняемому двоичному файлу интерпретатора Python в системах, где это имеет смысл. Если Python не может получить реальный путь к своему исполняемому файлу, :data:`sys.executable` будет пустой строкой или ``None``.

source: Raise a :exc:`SystemExit` exception, signaling an intention to exit the interpreter.
ru: Вызовите исключение :exc:`SystemExit`, сигнализирующее о намерении выйти из интерпретатора.

source: The optional argument *arg* can be an integer giving the exit status (defaulting to zero), or another type of object. If it is an integer, zero is considered "successful termination" and any nonzero value is considered "abnormal termination" by shells and the like. Most systems require it to be in the range 0--127, and produce undefined results otherwise. Some systems have a convention for assigning specific meanings to specific exit codes, but these are generally underdeveloped; Unix programs generally use 2 for command line syntax errors and 1 for all other kind of errors. If another type of object is passed, ``None`` is equivalent to passing zero, and any other object is printed to :data:`stderr` and results in an exit code of 1. In particular, ``sys.exit("some error message")`` is a quick way to exit a program when an error occurs.
ru: Необязательный аргумент *arg* может быть целым числом, указывающим статус завершения (по умолчанию равно нулю), или объектом другого типа. Если это целое число, ноль считается «успешным завершением», а любое ненулевое значение считается «ненормальным завершением» оболочками и т.п. Большинство систем требуют, чтобы оно находилось в диапазоне 0–127, и в противном случае выдают неопределенные результаты. В некоторых системах существует соглашение о присвоении определенных значений конкретным кодам выхода, но они, как правило, недостаточно развиты; Программы Unix обычно используют 2 для синтаксических ошибок командной строки и 1 для всех других типов ошибок. Если передается другой тип объекта, ``None`` эквивалентен передаче нуля, а любой другой объект печатается в :data:`stderr` и приводит к коду завершения 1. В частности, ``sys.exit( «некоторое сообщение об ошибке»)`` — это быстрый способ выйти из программы в случае возникновения ошибки.

source: Since :func:`exit` ultimately "only" raises an exception, it will only exit the process when called from the main thread, and the exception is not intercepted. Cleanup actions specified by finally clauses of :keyword:`try` statements are honored, and it is possible to intercept the exit attempt at an outer level.
ru: Поскольку :func:`exit` в конечном итоге «только» вызывает исключение, он завершит процесс только при вызове из основного потока, и исключение не будет перехвачено. Действия по очистке, указанные в предложенияхfinally операторов :keyword:`try`, учитываются, и можно перехватить попытку выхода на внешнем уровне.

source: If an error occurs in the cleanup after the Python interpreter has caught :exc:`SystemExit` (such as an error flushing buffered data in the standard streams), the exit status is changed to 120.
ru: Если при очистке возникает ошибка после того, как интерпретатор Python перехватил :exc:`SystemExit` (например, ошибка при очистке буферизованных данных в стандартных потоках), статус выхода изменяется на 120.

source: The :term:`named tuple` *flags* exposes the status of command line flags. The attributes are read only.
ru: :term:`named tuple` *flags* отображает состояние флагов командной строки. Атрибуты доступны только для чтения.

source: :option:`-O` or :option:`-OO`
ru: :option:`-O` или :option:`-OO`

source: :option:`-X int_max_str_digits <-X>` (:ref:`integer string conversion length limitation <int_max_str_digits>`)
ru: :option:`-X int_max_str_digits <-X>` (:ref:`ограничение длины преобразования целочисленной строки <int_max_str_digits>`)

source: Added ``quiet`` attribute for the new :option:`-q` flag.
ru: Добавлен атрибут Quiet для нового флага :option:`-q`.

source: The ``hash_randomization`` attribute.
ru: Атрибут ``hash_randomization``.

source: Removed obsolete ``division_warning`` attribute.
ru: Удален устаревший атрибут «division_warning».

source: Added ``isolated`` attribute for :option:`-I` ``isolated`` flag.
ru: Добавлен атрибут ``isolated`` для флага ``isolated`` :option:`-I`.

source: Added the ``dev_mode`` attribute for the new :ref:`Python Development Mode <devmode>` and the ``utf8_mode`` attribute for the new :option:`-X` ``utf8`` flag.
ru: Добавлен атрибут ``dev_mode`` для нового режима разработки Python <devmode>` и атрибут ``utf8_mode`` для нового флага :option:`-X` ``utf8``.

source: Added ``warn_default_encoding`` attribute for :option:`-X` ``warn_default_encoding`` flag.
ru: Добавлен атрибут warn_default_encoding для флага :option:`-X ``warn_default_encoding``.

source: Added the ``safe_path`` attribute for :option:`-P` option.
ru: Добавлен атрибут ``safe_path`` для опции :option:`-P`.

source: Added the ``int_max_str_digits`` attribute.
ru: Добавлен атрибут int_max_str_digits.

source: A :term:`named tuple` holding information about the float type. It contains low level information about the precision and internal representation. The values correspond to the various floating-point constants defined in the standard header file :file:`float.h` for the 'C' programming language; see section 5.2.4.2.2 of the 1999 ISO/IEC C standard [C99]_, 'Characteristics of floating types', for details.
ru: :term:`named tuple`, содержащий информацию о типе float. Он содержит информацию низкого уровня о точности и внутреннем представлении. Значения соответствуют различным константам с плавающей запятой, определенным в стандартном заголовочном файле :file:`float.h` для языка программирования C; см. раздел 5.2.4.2.2 стандарта ISO/IEC C 1999 г. [C99]_ , «Характеристики плавающих типов», подробнее.

source: Attributes of the :data:`!float_info` :term:`named tuple`
ru: Атрибуты :data:`!float_info` :term:`named tuple`

source: attribute
ru: атрибут

source: float.h macro
ru: Макрос float.h

source: explanation
ru: объяснение

source: difference between 1.0 and the least value greater than 1.0 that is representable as a float.
ru: разница между 1,0 и наименьшим значением, превышающим 1,0, которое можно представить в виде числа с плавающей запятой.

source: See also :func:`math.ulp`.
ru: См. также :func:`math.ulp`.

source: The maximum number of decimal digits that can be faithfully represented in a float; see below.
ru: Максимальное количество десятичных цифр, которые могут быть точно представлены в виде числа с плавающей запятой; см. ниже.

source: Float precision: the number of base-``radix`` digits in the significand of a float.
ru: Точность числа с плавающей точкой: количество цифр по основанию системы счисления в мантиссе числа с плавающей запятой.

source: The maximum representable positive finite float.
ru: Максимально представимое положительное конечное число с плавающей запятой.

source: The maximum integer *e* such that ``radix**(e-1)`` is a representable finite float.
ru: Максимальное целое число *e* такое, что ``основание**(e-1)`` является представимым конечным числом с плавающей запятой.

source: The maximum integer *e* such that ``10**e`` is in the range of representable finite floats.
ru: Максимальное целое число *e* такое, что ``10**e`` находится в диапазоне представимых конечных чисел с плавающей запятой.

source: The minimum representable positive *normalized* float.
ru: Минимальное представимое положительное *нормализованное* число с плавающей запятой.

source: Use :func:`math.ulp(0.0) <math.ulp>` to get the smallest positive *denormalized* representable float.
ru: Используйте :func:`math.ulp(0.0) <math.ulp>`, чтобы получить наименьшее положительное *денормализованное* представимое число с плавающей запятой.

source: The minimum integer *e* such that ``radix**(e-1)`` is a normalized float.
ru: Минимальное целое число *e* такое, что ``основание**(e-1)`` является нормализованным числом с плавающей запятой.

source: The minimum integer *e* such that ``10**e`` is a normalized float.
ru: Минимальное целое число *e* такое, что ``10**e`` является нормализованным числом с плавающей запятой.

source: The radix of exponent representation.
ru: Основание экспоненциального представления.

source: An integer representing the rounding mode for floating-point arithmetic. This reflects the value of the system :c:macro:`!FLT_ROUNDS` macro at interpreter startup time:
ru: Целое число, представляющее режим округления для арифметических операций с плавающей запятой. Это отражает значение системного макроса :c:macro:`!FLT_ROUNDS` во время запуска интерпретатора:

source: ``-1``: indeterminable
ru: ``-1``: неопределенное

source: ``0``: toward zero
ru: ``0``: к нулю

source: ``1``: to nearest
ru: ``1``: до ближайшего

source: ``2``: toward positive infinity
ru: ``2``: к положительной бесконечности

source: ``3``: toward negative infinity
ru: ``3``: к отрицательной бесконечности

source: All other values for :c:macro:`!FLT_ROUNDS` characterize implementation-defined rounding behavior.
ru: Все остальные значения :c:macro:`!FLT_ROUNDS` характеризуют поведение округления, определяемое реализацией.

source: The attribute :attr:`sys.float_info.dig` needs further explanation. If ``s`` is any string representing a decimal number with at most :attr:`!sys.float_info.dig` significant digits, then converting ``s`` to a float and back again will recover a string representing the same decimal value::
ru: Атрибут :attr:`sys.float_info.dig` требует дальнейшего объяснения. Если ``s`` представляет собой любую строку, представляющую десятичное число, содержащую не более :attr:`!sys.float_info.dig` значащих цифр, то преобразование ``s`` в число с плавающей запятой и обратно восстановит строку, представляющую ту же самую строку. десятичное значение::

source: But for strings with more than :attr:`sys.float_info.dig` significant digits, this isn't always true::
ru: Но для строк, содержащих более :attr:`sys.float_info.dig` значащих цифр, это не всегда верно::

source: A string indicating how the :func:`repr` function behaves for floats. If the string has value ``'short'`` then for a finite float ``x``, ``repr(x)`` aims to produce a short string with the property that ``float(repr(x)) == x``. This is the usual behaviour in Python 3.1 and later. Otherwise, ``float_repr_style`` has value ``'legacy'`` and ``repr(x)`` behaves in the same way as it did in versions of Python prior to 3.1.
ru: Строка, указывающая, как функция :func:`repr` ведет себя для чисел с плавающей запятой. Если строка имеет значение ``'short'``, то для конечного числа с плавающей запятой ``x``, ``repr(x)`` стремится создать короткую строку со свойством ``float(repr(x)) == х``. Это обычное поведение в Python 3.1 и более поздних версиях. В противном случае ``float_repr_style`` имеет значение ``'legacy'``, а ``repr(x)`` ведет себя так же, как и в версиях Python до 3.1.

source: Return the build time API version of Android as an integer.
ru: Возвращает версию API времени сборки Android в виде целого числа.

source: Return the name of the current default string encoding used by the Unicode implementation.
ru: Возвращает имя текущей кодировки строки по умолчанию, используемой реализацией Unicode.

source: Return the current value of the flags that are used for :c:func:`dlopen` calls. Symbolic names for the flag values can be found in the :mod:`os` module (:samp:`RTLD_{xxx}` constants, e.g. :const:`os.RTLD_LAZY`).
ru: Возвращает текущее значение флагов, которые используются для вызовов :c:func:`dlopen`. Символические имена значений флагов можно найти в модуле :mod:`os` (константы :samp:`RTLD_{xxx}`, например :const:`os.RTLD_LAZY`).

source: Get the :term:`filesystem encoding <filesystem encoding and error handler>`: the encoding used with the :term:`filesystem error handler <filesystem encoding and error handler>` to convert between Unicode filenames and bytes filenames. The filesystem error handler is returned from :func:`getfilesystemencodeerrors`.
ru: Получите :term:`кодировку файловой системы <кодировка файловой системы и обработчик ошибок>`: кодировку, используемую с :term:`обработчиком ошибок файловой системы <кодировка файловой системы и обработчик ошибок>` для преобразования имен файлов в Юникоде и байтовых имен файлов. Обработчик ошибок файловой системы возвращается из :func:`getfilesystemencodeerrors`.

source: For best compatibility, str should be used for filenames in all cases, although representing filenames as bytes is also supported. Functions accepting or returning filenames should support either str or bytes and internally convert to the system's preferred representation.
ru: Для лучшей совместимости во всех случаях для имен файлов следует использовать str, хотя также поддерживается представление имен файлов в байтах. Функции, принимающие или возвращающие имена файлов, должны поддерживать строку или байты и выполнять внутреннее преобразование в предпочтительное представление системы.

source: :func:`os.fsencode` and :func:`os.fsdecode` should be used to ensure that the correct encoding and errors mode are used.
ru: :func:`os.fsencode` и :func:`os.fsdecode` следует использовать, чтобы гарантировать использование правильной кодировки и режима ошибок.

source: The :term:`filesystem encoding and error handler` are configured at Python startup by the :c:func:`PyConfig_Read` function: see :c:member:`~PyConfig.filesystem_encoding` and :c:member:`~PyConfig.filesystem_errors` members of :c:type:`PyConfig`.
ru: :term:`Кодировка файловой системы и обработчик ошибок` настраиваются при запуске Python с помощью :c:func:`PyConfig_Read` функция: см. :c:member:`~PyConfig.filesystem_encoding` и :c:member:`~PyConfig.filesystem_errors` члены :c:type:`PyConfig` .

source: :func:`getfilesystemencoding` result cannot be ``None`` anymore.
ru: :func:`getfilesystemencoding` результат больше не может быть ``None``.

source: Windows is no longer guaranteed to return ``'mbcs'``. See :pep:`529` and :func:`_enablelegacywindowsfsencoding` for more information.
ru: Windows больше не гарантированно возвращает ``'mbcs'``. Дополнительную информацию смотрите в :pep:`529` и :func:`_enablelegacywindowsfsencoding`.

source: Return ``'utf-8'`` if the :ref:`Python UTF-8 Mode <utf8-mode>` is enabled.
ru: Возвращает ``'utf-8'``, если :ref:`Python UTF-8 Mode <utf8-mode>` включен.
