Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/sys.po
Languages: ru

source: This is a dictionary that maps module names to modules which have already been loaded. This can be manipulated to force reloading of modules and other tricks. However, replacing the dictionary will not necessarily work as expected and deleting essential items from the dictionary may cause Python to fail. If you want to iterate over this global dictionary always use ``sys.modules.copy()`` or ``tuple(sys.modules)`` to avoid exceptions as its size may change during iteration as a side effect of code or activity in other threads.
ru: Это словарь, который сопоставляет имена модулей с уже загруженными модулями. Этим можно манипулировать, чтобы принудительно перезагрузить модули и другие трюки. Однако замена словаря не обязательно будет работать должным образом, а удаление важных элементов из словаря может привести к сбою Python. Если вы хотите перебирать этот глобальный словарь, всегда используйте ``sys.modules.copy()`` или ``tuple(sys.modules)``, чтобы избежать исключений, поскольку его размер может измениться во время итерации как побочный эффект кода или активность в других темах.

source: The list of the original command line arguments passed to the Python executable.
ru: Список исходных аргументов командной строки, передаваемых в исполняемый файл Python.

source: The elements of :data:`sys.orig_argv` are the arguments to the Python interpreter, while the elements of :data:`sys.argv` are the arguments to the user's program. Arguments consumed by the interpreter itself will be present in :data:`sys.orig_argv` and missing from :data:`sys.argv`.
ru: Элементы :data:`sys.orig_argv` являются аргументами интерпретатора Python, а элементы :data:`sys.argv` являются аргументами пользовательской программы. Аргументы, используемые самим интерпретатором, будут присутствовать в :data:`sys.orig_argv` и отсутствовать в :data:`sys.argv`.

source: A list of strings that specifies the search path for modules. Initialized from the environment variable :envvar:`PYTHONPATH`, plus an installation-dependent default.
ru: Список строк, задающий путь поиска модулей. Инициализируется из переменной среды :envvar:`PYTHONPATH`, а также значения по умолчанию, зависящего от установки.

source: By default, as initialized upon program startup, a potentially unsafe path is prepended to :data:`sys.path` (*before* the entries inserted as a result of :envvar:`PYTHONPATH`):
ru: По умолчанию, как это инициализируется при запуске программы, потенциально опасный путь добавляется к :data:`sys.path` (*перед* записями, вставленными в результате :envvar:`PYTHONPATH`):

source: ``python -m module`` command line: prepend the current working directory.
ru: ``python -m модуль`` командная строка: добавьте текущий рабочий каталог.

source: ``python script.py`` command line: prepend the script's directory. If it's a symbolic link, resolve symbolic links.
ru: Командная строка ``python script.py``: добавьте каталог сценария. Если это символическая ссылка, разрешите символические ссылки.

source: ``python -c code`` and ``python`` (REPL) command lines: prepend an empty string, which means the current working directory.
ru: Командные строки ``python -c code`` и ``python`` (REPL): добавьте в начало пустую строку, которая означает текущий рабочий каталог.

source: To not prepend this potentially unsafe path, use the :option:`-P` command line option or the :envvar:`PYTHONSAFEPATH` environment variable.
ru: Чтобы не добавлять этот потенциально небезопасный путь, используйте параметр командной строки :option:`-P` или переменную среды :envvar:`PYTHONSAFEPATH`.

source: A program is free to modify this list for its own purposes. Only strings should be added to :data:`sys.path`; all other data types are ignored during import.
ru: Программа может изменять этот список в своих целях. В :data:`sys.path` следует добавлять только строки. все остальные типы данных игнорируются во время импорта.

source: Module :mod:`site` This describes how to use .pth files to extend :data:`sys.path`.
ru: Модуль :mod:`site` Здесь описывается, как использовать файлы .pth для расширения :data:`sys.path`.

source: A list of callables that take a path argument to try to create a :term:`finder` for the path. If a finder can be created, it is to be returned by the callable, else raise :exc:`ImportError`.
ru: Список вызываемых объектов, которые принимают аргумент пути, чтобы попытаться создать :term:`finder` для пути. Если средство поиска может быть создано, оно должно быть возвращено вызываемым объектом, иначе поднимите :exc:`ImportError`.

source: Originally specified in :pep:`302`.
ru: Первоначально указано в :pep:`302`.

source: A dictionary acting as a cache for :term:`finder` objects. The keys are paths that have been passed to :data:`sys.path_hooks` and the values are the finders that are found. If a path is a valid file system path but no finder is found on :data:`sys.path_hooks` then ``None`` is stored.
ru: Словарь, действующий как кэш для объектов :term:`finder`. Ключи — это пути, которые были переданы в :data:`sys.path_hooks`, а значения — это найденные средства поиска. Если путь является допустимым путем файловой системы, но в :data:`sys.path_hooks` не найден поисковик, то сохраняется ``None``.

source: This string contains a platform identifier that can be used to append platform-specific components to :data:`sys.path`, for instance.
ru: Эта строка содержит идентификатор платформы, который можно использовать, например, для добавления компонентов, специфичных для платформы, в :data:`sys.path`.

source: For Unix systems, except on Linux and AIX, this is the lowercased OS name as returned by ``uname -s`` with the first part of the version as returned by ``uname -r`` appended, e.g. ``'sunos5'`` or ``'freebsd8'``, *at the time when Python was built*. Unless you want to test for a specific system version, it is therefore recommended to use the following idiom::
ru: Для систем Unix, за исключением Linux и AIX, это имя операционной системы в нижнем регистре, возвращаемое командой ``uname -s``, с добавленной первой частью версии, возвращаемой ``uname -r``, например ``'sunos5. '`` или ``'freebsd8'``, *во время создания Python*. Если вы не хотите протестировать конкретную версию системы, рекомендуется использовать следующую идиому:

source: For other systems, the values are:
ru: Для других систем значения следующие:

source: System
ru: Система

source: ``platform`` value
ru: Значение ``platform``

source: On Linux, :data:`sys.platform` doesn't contain the major version anymore. It is always ``'linux'``, instead of ``'linux2'`` or ``'linux3'``. Since older Python versions include the version number, it is recommended to always use the ``startswith`` idiom presented above.
ru: В Linux :data:`sys.platform` больше не содержит основную версию. Это всегда ``'linux'`` вместо ``'linux2'`` или ``'linux3'``. Поскольку более старые версии Python включают номер версии, рекомендуется всегда использовать идиому «startswith», представленную выше.

source: On AIX, :data:`sys.platform` doesn't contain the major version anymore. It is always ``'aix'``, instead of ``'aix5'`` or ``'aix7'``. Since older Python versions include the version number, it is recommended to always use the ``startswith`` idiom presented above.
ru: В AIX :data:`sys.platform` больше не содержит основную версию. Это всегда ``'aix'`` вместо ``'aix5'`` или ``'aix7'``. Поскольку более старые версии Python включают номер версии, рекомендуется всегда использовать идиому «startswith», представленную выше.

source: :data:`os.name` has a coarser granularity. :func:`os.uname` gives system-dependent version information.
ru: :data:`os.name` имеет более грубую детализацию. :func:`os.uname` предоставляет информацию о версии, зависящую от системы.

source: The :mod:`platform` module provides detailed checks for the system's identity.
ru: The :mod:`платформа` модуль обеспечивает детальную проверку идентичности системы.

source: Name of the platform-specific library directory. It is used to build the path of standard library and the paths of installed extension modules.
ru: Имя каталога библиотеки для конкретной платформы. Он используется для построения пути стандартной библиотеки и путей установленных модулей расширения.

source: It is equal to ``"lib"`` on most platforms. On Fedora and SuSE, it is equal to ``"lib64"`` on 64-bit platforms which gives the following ``sys.path`` paths (where ``X.Y`` is the Python ``major.minor`` version):
ru: На большинстве платформ он равен ``"lib"``. В Fedora и SuSE он равен ``"lib64"`` на 64-битных платформах, что дает следующие пути ``sys.path`` (где ``XY`` — это ``major.minor`` Python версия):

source: ``/usr/lib64/pythonX.Y/``: Standard library (like ``os.py`` of the :mod:`os` module)
ru: ``/usr/lib64/pythonX.Y/``: Стандартная библиотека (например, ``os.py`` модуля :mod:`os`)

source: ``/usr/lib64/pythonX.Y/lib-dynload/``: C extension modules of the standard library (like the :mod:`errno` module, the exact filename is platform specific)
ru: ``/usr/lib64/pythonX.Y/lib-dynload/``: модули расширения C стандартной библиотеки (например, модуль :mod:`errno`, точное имя файла зависит от платформы)

source: ``/usr/lib/pythonX.Y/site-packages/`` (always use ``lib``, not :data:`sys.platlibdir`): Third-party modules
ru: ``/usr/lib/pythonX.Y/site-packages/`` (всегда используйте ``lib``, а не :data:`sys.platlibdir`): сторонние модули

source: ``/usr/lib64/pythonX.Y/site-packages/``: C extension modules of third-party packages
ru: ``/usr/lib64/pythonX.Y/site-packages/``: модули расширения C сторонних пакетов.

source: A string giving the site-specific directory prefix where the platform independent Python files are installed; on Unix, the default is :file:`/usr/local`. This can be set at build time with the :option:`--prefix` argument to the :program:`configure` script. See :ref:`installation_paths` for derived paths.
ru: Строка, указывающая префикс каталога для конкретного сайта, в котором установлены независимые от платформы файлы Python; в Unix по умолчанию используется :file:`/usr/local`. Это можно установить во время сборки с помощью аргумента :option:`--prefix` скрипта :program:`configure`. См. производные пути в :ref:`installation_paths`.

source: If a :ref:`virtual environment <venv-def>` is in effect, this value will be changed in ``site.py`` to point to the virtual environment. The value for the Python installation will still be available, via :data:`base_prefix`.
ru: Если действует :ref:`виртуальная среда <venv-def>`, это значение будет изменено в ``site.py``, чтобы указать на виртуальную среду. Значение для установки Python по-прежнему будет доступно через :data:`base_prefix`.

source: Strings specifying the primary and secondary prompt of the interpreter. These are only defined if the interpreter is in interactive mode. Their initial values in this case are ``'>>> '`` and ``'... '``. If a non-string object is assigned to either variable, its :func:`str` is re-evaluated each time the interpreter prepares to read a new interactive command; this can be used to implement a dynamic prompt.
ru: Строки, определяющие основное и вторичное приглашение интерпретатора. Они определяются только в том случае, если интерпретатор находится в интерактивном режиме. Их начальные значения в данном случае — ``'>>> '`` и ``'... '``. Если любой из переменных присвоен нестроковый объект, его :func:`str` пересчитывается каждый раз, когда интерпретатор готовится прочитать новую интерактивную команду; это можно использовать для реализации динамического приглашения.

source: Set the flags used by the interpreter for :c:func:`dlopen` calls, such as when the interpreter loads extension modules. Among other things, this will enable a lazy resolving of symbols when importing a module, if called as ``sys.setdlopenflags(0)``. To share symbols across extension modules, call as ``sys.setdlopenflags(os.RTLD_GLOBAL)``. Symbolic names for the flag values can be found in the :mod:`os` module (:samp:`RTLD_{xxx}` constants, e.g. :const:`os.RTLD_LAZY`).
ru: Установите флаги, используемые интерпретатором для вызовов :c:func:`dlopen`, например, когда интерпретатор загружает модули расширения. Помимо прочего, это позволит отложенное разрешение символов при импорте модуля, если он называется sys.setdlopenflags(0)``. Чтобы использовать символы в модулях расширения, вызовите ``sys.setdlopenflags(os.RTLD_GLOBAL)``. Символические имена значений флагов можно найти в модуле :mod:`os` (константы :samp:`RTLD_{xxx}`, например :const:`os.RTLD_LAZY`).

source: Set the :ref:`integer string conversion length limitation <int_max_str_digits>` used by this interpreter. See also :func:`get_int_max_str_digits`.
ru: Установите ограничение длины преобразования целочисленной строки <int_max_str_digits>, используемое этим интерпретатором. См. также :func:`get_int_max_str_digits`.

source: Set the system's profile function, which allows you to implement a Python source code profiler in Python. See chapter :ref:`profile` for more information on the Python profiler. The system's profile function is called similarly to the system's trace function (see :func:`settrace`), but it is called with different events, for example it isn't called for each executed line of code (only on call and return, but the return event is reported even when an exception has been set). The function is thread-specific, but there is no way for the profiler to know about context switches between threads, so it does not make sense to use this in the presence of multiple threads. Also, its return value is not used, so it can simply return ``None``. Error in the profile function will cause itself unset.
ru: Установите функцию профиля системы, которая позволит вам реализовать профилировщик исходного кода Python в Python. См. главу :ref:`profile` для получения дополнительной информации о профилировщике Python. Функция профиля системы вызывается аналогично функции трассировки системы (см. :func:`settrace`), но она вызывается с разными событиями, например, она не вызывается для каждой выполняемой строки кода (только при вызове и возврате). но о возвратном событии сообщается, даже если установлено исключение). Функция зависит от потока, но профилировщик не может узнать о переключении контекста между потоками, поэтому нет смысла использовать ее при наличии нескольких потоков. Кроме того, его возвращаемое значение не используется, поэтому он может просто вернуть None. Ошибка в функции профиля приведет к отключению системы.

source: The same tracing mechanism is used for :func:`!setprofile` as :func:`settrace`. To trace calls with :func:`!setprofile` inside a tracing function (e.g. in a debugger breakpoint), see :func:`call_tracing`.
ru: Для :func:`!setprofile` используется тот же механизм трассировки, что и для :func:`settrace`. Чтобы отслеживать вызовы с помощью :func:`!setprofile` внутри функции трассировки (например, в точке останова отладчика), см. :func:`call_tracing`.

source: Profile functions should have three arguments: *frame*, *event*, and *arg*. *frame* is the current stack frame. *event* is a string: ``'call'``, ``'return'``, ``'c_call'``, ``'c_return'``, or ``'c_exception'``. *arg* depends on the event type.
ru: Функции профиля должны иметь три аргумента: *frame*, *event* и *arg*. *frame* — текущий кадр стека. *event* — это строка: ``'call'``, ``'return'``, ``'c_call'``, ``'c_return'`` или ``'c_Exception'``. *arg* зависит от типа события.

source: The events have the following meaning:
ru: События имеют следующее значение:

source: A function is called (or some other code block entered). The profile function is called; *arg* is ``None``.
ru: Вызывается функция (или вводится какой-либо другой блок кода). Вызывается функция профиля; *arg* — ``Нет``.

source: A function (or other code block) is about to return. The profile function is called; *arg* is the value that will be returned, or ``None`` if the event is caused by an exception being raised.
ru: Функция (или другой блок кода) собирается вернуться. Вызывается функция профиля; *arg* — это значение, которое будет возвращено, или ``None``, если событие вызвано возникшим исключением.

source: A C function is about to be called. This may be an extension function or a built-in. *arg* is the C function object.
ru: Функция AC скоро будет вызвана. Это может быть функция расширения или встроенная. *arg* — объект функции C.

source: A C function has returned. *arg* is the C function object.
ru: Функция переменного тока вернулась. *arg* — объект функции C.

source: A C function has raised an exception. *arg* is the C function object.
ru: Функция переменного тока вызвала исключение. *arg* — объект функции C.

source: Raises an :ref:`auditing event <auditing>` ``sys.setprofile`` with no arguments.
ru: Вызывает событие аудита <auditing>``sys.setprofile`` без аргументов.

source: Set the maximum depth of the Python interpreter stack to *limit*. This limit prevents infinite recursion from causing an overflow of the C stack and crashing Python.
ru: Установите максимальную глубину стека интерпретатора Python на *limit*. Это ограничение не позволяет бесконечной рекурсии вызвать переполнение стека C и сбой Python.

source: The highest possible limit is platform-dependent. A user may need to set the limit higher when they have a program that requires deep recursion and a platform that supports a higher limit. This should be done with care, because a too-high limit can lead to a crash.
ru: Максимально возможный предел зависит от платформы. Пользователю может потребоваться установить более высокий предел, если у него есть программа, требующая глубокой рекурсии, и платформа, поддерживающая более высокий предел. Делать это следует осторожно, поскольку слишком высокий предел может привести к сбою.

source: If the new limit is too low at the current recursion depth, a :exc:`RecursionError` exception is raised.
ru: Если новый предел слишком низок при текущей глубине рекурсии, возникает исключение :exc:`RecursionError`.

source: A :exc:`RecursionError` exception is now raised if the new limit is too low at the current recursion depth.
ru: Исключение :exc:`RecursionError` теперь вызывается, если новый предел слишком низок при текущей глубине рекурсии.

source: Set the interpreter's thread switch interval (in seconds). This floating-point value determines the ideal duration of the "timeslices" allocated to concurrently running Python threads. Please note that the actual value can be higher, especially if long-running internal functions or methods are used. Also, which thread becomes scheduled at the end of the interval is the operating system's decision. The interpreter doesn't have its own scheduler.
ru: Установите интервал переключения потоков переводчика (в секундах). Это значение с плавающей запятой определяет идеальную продолжительность «квантов времени», выделяемых для одновременно выполняемых потоков Python. Обратите внимание, что фактическое значение может быть выше, особенно если используются долго выполняющиеся внутренние функции или методы. Кроме того, решение о том, какой поток будет запланирован в конце интервала, принимается операционной системой. Интерпретатор не имеет собственного планировщика.

source: Set the system's trace function, which allows you to implement a Python source code debugger in Python. The function is thread-specific; for a debugger to support multiple threads, it must register a trace function using :func:`settrace` for each thread being debugged or use :func:`threading.settrace`.
ru: Установите функцию трассировки системы, которая позволит вам реализовать отладчик исходного кода Python в Python. Функция зависит от потока; Чтобы отладчик поддерживал несколько потоков, он должен зарегистрировать функцию трассировки, используя :func:`settrace` для каждого отлаживаемого потока, или использовать :func:`threading.settrace`.

source: Trace functions should have three arguments: *frame*, *event*, and *arg*. *frame* is the current stack frame. *event* is a string: ``'call'``, ``'line'``, ``'return'``, ``'exception'`` or ``'opcode'``. *arg* depends on the event type.
ru: Функции трассировки должны иметь три аргумента: *frame*, *event* и *arg*. *frame* — текущий кадр стека. *event* — это строка: ``'call'``, ``'line'``, ``'return'``, ``'исключение'`` или ``'код операции'``. *arg* зависит от типа события.

source: The trace function is invoked (with *event* set to ``'call'``) whenever a new local scope is entered; it should return a reference to a local trace function to be used for the new scope, or ``None`` if the scope shouldn't be traced.
ru: Функция трассировки вызывается (с параметром *event*, установленным в ``'call'``) всякий раз, когда вводится новая локальная область видимости; он должен вернуть ссылку на локальную функцию трассировки, которая будет использоваться для новой области, или «Нет», если область не должна отслеживаться.

source: The local trace function should return a reference to itself, or to another function which would then be used as the local trace function for the scope.
ru: Локальная функция трассировки должна возвращать ссылку на себя или на другую функцию, которая затем будет использоваться в качестве локальной функции трассировки для области видимости.

source: If there is any error occurred in the trace function, it will be unset, just like ``settrace(None)`` is called.
ru: Если в функции трассировки произошла какая-либо ошибка, она будет отключена, точно так же, как вызывается ``settrace(None)``.

source: Tracing is disabled while calling the trace function (e.g. a function set by :func:`!settrace`). For recursive tracing see :func:`call_tracing`.
ru: Трассировка отключается при вызове функции трассировки (например, функции, установленной :func:`!settrace`). О рекурсивной трассировке см. :func:`call_tracing`.

source: A function is called (or some other code block entered). The global trace function is called; *arg* is ``None``; the return value specifies the local trace function.
ru: Вызывается функция (или вводится какой-либо другой блок кода). Вызывается глобальная функция трассировки; *arg* — ``Нет``; возвращаемое значение указывает локальную функцию трассировки.

source: The interpreter is about to execute a new line of code or re-execute the condition of a loop. The local trace function is called; *arg* is ``None``; the return value specifies the new local trace function. See :file:`Objects/lnotab_notes.txt` for a detailed explanation of how this works. Per-line events may be disabled for a frame by setting :attr:`~frame.f_trace_lines` to :const:`False` on that :ref:`frame <frame-objects>`.
ru: Интерпретатор собирается выполнить новую строку кода или повторно выполнить условие цикла. Вызывается локальная функция трассировки; *arg* — ``Нет``; возвращаемое значение указывает новую локальную функцию трассировки. См. :file:`Objects/lnotab_notes.txt` для подробного объяснения того, как это работает. Построчные события можно отключить для кадра, установив для :attr:`~frame.f_trace_lines` значение :const:`False` для этого :ref:`frame <frame-objects>`.

source: A function (or other code block) is about to return. The local trace function is called; *arg* is the value that will be returned, or ``None`` if the event is caused by an exception being raised. The trace function's return value is ignored.
ru: Функция (или другой блок кода) собирается вернуться. Вызывается локальная функция трассировки; *arg* — это значение, которое будет возвращено, или ``None``, если событие вызвано возникшим исключением. Возвращаемое значение функции трассировки игнорируется.
