Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/sys.monitoring.po
Languages: ru

source: :mod:`!sys.monitoring` --- Execution event monitoring
ru: :mod:`!sys.monitoring` --- Мониторинг событий выполнения

source: :mod:`sys.monitoring` is a namespace within the :mod:`sys` module, not an independent module, so there is no need to ``import sys.monitoring``, simply ``import sys`` and then use ``sys.monitoring``.
ru: :mod:`sys.monitoring` — это пространство имен внутри модуля :mod:`sys`, а не независимый модуль, поэтому нет необходимости ``импортировать sys.monitoring``, просто ``импортируйте sys``, а затем используйте ``sys.monitoring``.

source: This namespace provides access to the functions and constants necessary to activate and control event monitoring.
ru: Это пространство имен обеспечивает доступ к функциям и константам, необходимым для активации и управления мониторингом событий.

source: As programs execute, events occur that might be of interest to tools that monitor execution. The :mod:`sys.monitoring` namespace provides means to receive callbacks when events of interest occur.
ru: Во время выполнения программ происходят события, которые могут представлять интерес для инструментов, отслеживающих выполнение. Пространство имен :mod:`sys.monitoring` предоставляет средства для получения обратных вызовов при возникновении интересующих событий.

source: The monitoring API consists of three components:
ru: API мониторинга состоит из трех компонентов:

source: `Tool identifiers`_
ru: `Идентификаторы инструментов`_

source: Tool identifiers
ru: Идентификаторы инструментов

source: A tool identifier is an integer and the associated name. Tool identifiers are used to discourage tools from interfering with each other and to allow multiple tools to operate at the same time. Currently tools are completely independent and cannot be used to monitor each other. This restriction may be lifted in the future.
ru: Идентификатор инструмента представляет собой целое число и связанное с ним имя. Идентификаторы инструментов используются для предотвращения взаимодействия инструментов друг с другом и для обеспечения одновременной работы нескольких инструментов. На данный момент инструменты полностью независимы и не могут использоваться для мониторинга друг друга. В будущем это ограничение может быть снято.

source: Before registering or activating events, a tool should choose an identifier. Identifiers are integers in the range 0 to 5 inclusive.
ru: Прежде чем регистрировать или активировать события, инструмент должен выбрать идентификатор. Идентификаторы представляют собой целые числа в диапазоне от 0 до 5 включительно.

source: Registering and using tools
ru: Регистрация и использование инструментов

source: Must be called before *tool_id* can be used. *tool_id* must be in the range 0 to 5 inclusive. Raises a :exc:`ValueError` if *tool_id* is in use.
ru: Должен быть вызван перед использованием *tool_id*. *tool_id* должен находиться в диапазоне от 0 до 5 включительно. Вызывает :exc:`ValueError`, если *tool_id* используется.

source: Should be called once a tool no longer requires *tool_id*.
ru: Должен вызываться, когда инструменту больше не требуется *tool_id*.

source: :func:`free_tool_id` will not disable global or local events associated with *tool_id*, nor will it unregister any callback functions. This function is only intended to be used to notify the VM that the particular *tool_id* is no longer in use.
ru: :func:`free_tool_id` не отключит глобальные или локальные события, связанные с *tool_id*, а также не отменит регистрацию каких-либо функций обратного вызова. Эта функция предназначена только для уведомления виртуальной машины о том, что конкретный *tool_id* больше не используется.

source: Returns the name of the tool if *tool_id* is in use, otherwise it returns ``None``. *tool_id* must be in the range 0 to 5 inclusive.
ru: Возвращает имя инструмента, если *tool_id* используется, в противном случае возвращается ``None``. *tool_id* должен находиться в диапазоне от 0 до 5 включительно.

source: All IDs are treated the same by the VM with regard to events, but the following IDs are pre-defined to make co-operation of tools easier::
ru: Все идентификаторы обрабатываются виртуальной машиной одинаково в отношении событий, но следующие идентификаторы предопределены для упрощения взаимодействия инструментов:

source: Events
ru: События

source: The following events are supported:
ru: Поддерживаются следующие события:

source: A conditional branch is taken (or not).
ru: Берется (или нет) условный переход.

source: A call in Python code (event occurs before the call).
ru: Вызов в коде Python (событие происходит перед вызовом).

source: An exception raised from any callable, except for Python functions (event occurs after the exit).
ru: Исключение, возникающее из любого вызываемого объекта, кроме функций Python (событие возникает после выхода).

source: Return from any callable, except for Python functions (event occurs after the return).
ru: Возврат из любого вызываемого объекта, кроме функций Python (событие происходит после возврата).

source: An exception is handled.
ru: Исключение обрабатывается.

source: A VM instruction is about to be executed.
ru: Инструкция VM скоро будет выполнена.

source: An unconditional jump in the control flow graph is made.
ru: Производится безусловный переход в графе потока управления.

source: An instruction is about to be executed that has a different line number from the preceding instruction.
ru: Скоро будет выполнена инструкция, номер строки которой отличается от номера предыдущей инструкции.

source: Resumption of a Python function (for generator and coroutine functions), except for ``throw()`` calls.
ru: Возобновление работы функции Python (для функций генератора и сопрограммы), за исключением вызовов ``throw()``.

source: Return from a Python function (occurs immediately before the return, the callee's frame will be on the stack).
ru: Возврат из функции Python (происходит непосредственно перед возвратом, кадр вызываемого объекта будет находиться в стеке).

source: Start of a Python function (occurs immediately after the call, the callee's frame will be on the stack)
ru: Запуск функции Python (происходит сразу после вызова, кадр вызываемого объекта будет в стеке)

source: A Python function is resumed by a ``throw()`` call.
ru: Функция Python возобновляется вызовом throw().

source: Exit from a Python function during exception unwinding.
ru: Выход из функции Python во время обработки исключения.

source: Yield from a Python function (occurs immediately before the yield, the callee's frame will be on the stack).
ru: Выход из функции Python (происходит непосредственно перед выходом, кадр вызываемого объекта будет в стеке).

source: An exception is raised, except those that cause a :monitoring-event:`STOP_ITERATION` event.
ru: Вызывается исключение, за исключением тех, которые вызывают событие :monitoring-event:`STOP_ITERATION`.

source: An exception is re-raised, for example at the end of a :keyword:`finally` block.
ru: Исключение возникает повторно, например, в конце блока :keyword:`finally`.

source: An artificial :exc:`StopIteration` is raised; see `the STOP_ITERATION event`_.
ru: Вызывается искусственный :exc:`StopIteration`; см. `событие STOP_ITERATION`_.

source: More events may be added in the future.
ru: В будущем могут быть добавлены и другие мероприятия.

source: These events are attributes of the :mod:`!sys.monitoring.events` namespace. Each event is represented as a power-of-2 integer constant. To define a set of events, simply bitwise or the individual events together. For example, to specify both :monitoring-event:`PY_RETURN` and :monitoring-event:`PY_START` events, use the expression ``PY_RETURN | PY_START``.
ru: Эти события являются атрибутами пространства имен :mod:`!sys.monitoring.events`. Каждое событие представлено как целочисленная константа степени 2. Чтобы определить набор событий, просто побитно или отдельные события вместе. Например, чтобы указать события :monitoring-event:`PY_RETURN` и :monitoring-event:`PY_START`, используйте выражение ``PY_RETURN | PY_START``.

source: An alias for ``0`` so users can do explicit comparisons like::
ru: Псевдоним для ``0``, чтобы пользователи могли выполнять явные сравнения, например:

source: Events are divided into three groups:
ru: События разделены на три группы:

source: Local events
ru: Местные события

source: Local events are associated with normal execution of the program and happen at clearly defined locations. All local events can be disabled. The local events are:
ru: Локальные события связаны с обычным выполнением программы и происходят в четко определенных местах. Все локальные события можно отключить. Местные мероприятия:

source: Ancillary events
ru: Вспомогательные мероприятия

source: Ancillary events can be monitored like other events, but are controlled by another event:
ru: Вспомогательные события можно отслеживать, как и другие события, но они контролируются другим событием:

source: The :monitoring-event:`C_RETURN` and :monitoring-event:`C_RAISE` events are controlled by the :monitoring-event:`CALL` event. :monitoring-event:`C_RETURN` and :monitoring-event:`C_RAISE` events will only be seen if the corresponding :monitoring-event:`CALL` event is being monitored.
ru: События :monitoring-event:`C_RETURN` и :monitoring-event:`C_RAISE` управляются событием :monitoring-event:`CALL`. События :monitoring-event:`C_RETURN` и :monitoring-event:`C_RAISE` будут видны только в том случае, если отслеживается соответствующее событие :monitoring-event:`CALL`.

source: Other events
ru: Другие события

source: Other events are not necessarily tied to a specific location in the program and cannot be individually disabled.
ru: Другие события не обязательно привязаны к определенному месту в программе и не могут быть отключены индивидуально.

source: The other events that can be monitored are:
ru: Другие события, которые можно отслеживать:

source: The STOP_ITERATION event
ru: Событие STOP_ITERATION

source: :pep:`PEP 380 <380#use-of-stopiteration-to-return-values>` specifies that a :exc:`StopIteration` exception is raised when returning a value from a generator or coroutine. However, this is a very inefficient way to return a value, so some Python implementations, notably CPython 3.12+, do not raise an exception unless it would be visible to other code.
ru: :pep:`PEP 380 <380#use-of-stopiteration-to-return-values>` указывает, что исключение :exc:`StopIteration` возникает при возврате значения из генератора или сопрограммы. Однако это очень неэффективный способ вернуть значение, поэтому некоторые реализации Python, особенно CPython 3.12+, не вызывают исключение, если оно не будет видно другому коду.

source: To allow tools to monitor for real exceptions without slowing down generators and coroutines, the :monitoring-event:`STOP_ITERATION` event is provided. :monitoring-event:`STOP_ITERATION` can be locally disabled, unlike :monitoring-event:`RAISE`.
ru: Чтобы инструменты могли отслеживать реальные исключения, не замедляя работу генераторов и сопрограмм, предусмотрено событие :monitoring-event:`STOP_ITERATION`. :monitoring-event:`STOP_ITERATION` можно отключить локально, в отличие от :monitoring-event:`RAISE`.

source: Turning events on and off
ru: Включение и выключение событий

source: In order to monitor an event, it must be turned on and a corresponding callback must be registered. Events can be turned on or off by setting the events either globally or for a particular code object.
ru: Чтобы отслеживать событие, его необходимо включить и зарегистрировать соответствующий обратный вызов. События можно включать и выключать, устанавливая их либо глобально, либо для конкретного объекта кода.

source: Setting events globally
ru: Глобальная настройка событий

source: Events can be controlled globally by modifying the set of events being monitored.
ru: Событиями можно управлять глобально, изменяя набор отслеживаемых событий.

source: Returns the ``int`` representing all the active events.
ru: Возвращает int, представляющий все активные события.

source: Activates all events which are set in *event_set*. Raises a :exc:`ValueError` if *tool_id* is not in use.
ru: Активирует все события, заданные в *event_set*. Вызывает :exc:`ValueError`, если *tool_id* не используется.

source: No events are active by default.
ru: По умолчанию ни одно событие не является активным.

source: Per code object events
ru: События объекта кода

source: Events can also be controlled on a per code object basis. The functions defined below which accept a :class:`types.CodeType` should be prepared to accept a look-alike object from functions which are not defined in Python (see :ref:`c-api-monitoring`).
ru: Событиями также можно управлять для каждого объекта кода. Определенные ниже функции, которые принимают :class:`types.CodeType`, должны быть готовы принять похожий объект из функций, которые не определены в Python (см. :ref:`c-api-monitoring`).

source: Returns all the local events for *code*
ru: Возвращает все локальные события для *кода*

source: Activates all the local events for *code* which are set in *event_set*. Raises a :exc:`ValueError` if *tool_id* is not in use.
ru: Активирует все локальные события для *code*, которые установлены в *event_set*. Вызывает :exc:`ValueError`, если *tool_id* не используется.

source: Local events add to global events, but do not mask them. In other words, all global events will trigger for a code object, regardless of the local events.
ru: Локальные события дополняют глобальные события, но не маскируют их. Другими словами, все глобальные события срабатывают для объекта кода независимо от локальных событий.

source: Disabling events
ru: Отключение событий

source: A special value that can be returned from a callback function to disable events for the current code location.
ru: Специальное значение, которое может быть возвращено функцией обратного вызова для отключения событий для текущего местоположения кода.

source: Local events can be disabled for a specific code location by returning :data:`sys.monitoring.DISABLE` from a callback function. This does not change which events are set, or any other code locations for the same event.
ru: Локальные события можно отключить для определенного места кода, вернув :data:`sys.monitoring.DISABLE` из функции обратного вызова. Это не влияет на то, какие события установлены или какие-либо другие места кода для того же события.

source: Disabling events for specific locations is very important for high performance monitoring. For example, a program can be run under a debugger with no overhead if the debugger disables all monitoring except for a few breakpoints.
ru: Отключение событий для определенных мест очень важно для обеспечения высокой производительности мониторинга. Например, программу можно запустить под отладчиком без дополнительных затрат, если отладчик отключит весь мониторинг, за исключением нескольких точек останова.

source: Enable all the events that were disabled by :data:`sys.monitoring.DISABLE` for all tools.
ru: Включите все события, которые были отключены с помощью :data:`sys.monitoring.DISABLE` для всех инструментов.

source: Registering callback functions
ru: Регистрация функций обратного вызова

source: To register a callable for events call
ru: Чтобы зарегистрировать вызываемый объект для событий, позвоните

source: Registers the callable *func* for the *event* with the given *tool_id*
ru: Регистрирует вызываемую *функцию* для *события* с заданным *tool_id*.

source: If another callback was registered for the given *tool_id* and *event*, it is unregistered and returned. Otherwise :func:`register_callback` returns ``None``.
ru: Если для заданных *tool_id* и *event* был зарегистрирован другой обратный вызов, он отменяется и возвращается. В противном случае :func:`register_callback` возвращает ``None``.

source: Functions can be unregistered by calling ``sys.monitoring.register_callback(tool_id, event, None)``.
ru: Регистрация функций может быть отменена путем вызова ``sys.monitoring.register_callback(tool_id, event, None)``.

source: Callback functions can be registered and unregistered at any time.
ru: Функции обратного вызова можно зарегистрировать и отменить регистрацию в любое время.

source: Registering or unregistering a callback function will generate a :func:`sys.audit` event.
ru: Регистрация или отмена регистрации функции обратного вызова создаст событие :func:`sys.audit`.

source: Callback function arguments
ru: Аргументы функции обратного вызова

source: A special value that is passed to a callback function to indicate that there are no arguments to the call.
ru: Специальное значение, которое передается в функцию обратного вызова, чтобы указать, что у вызова нет аргументов.

source: When an active event occurs, the registered callback function is called. Different events will provide the callback function with different arguments, as follows:
ru: При возникновении активного события вызывается зарегистрированная функция обратного вызова. Различные события предоставляют функции обратного вызова разные аргументы, а именно:

source: :monitoring-event:`PY_START` and :monitoring-event:`PY_RESUME`::
ru: :monitoring-event:`PY_START` и :monitoring-event:`PY_RESUME`::

source: :monitoring-event:`PY_RETURN` and :monitoring-event:`PY_YIELD`::
ru: :monitoring-event:`PY_RETURN` и :monitoring-event:`PY_YIELD`::

source: :monitoring-event:`CALL`, :monitoring-event:`C_RAISE` and :monitoring-event:`C_RETURN`::
ru: :monitoring-event:`CALL`, :monitoring-event:`C_RAISE` и :monitoring-event:`C_RETURN`::

source: If there are no arguments, *arg0* is set to :data:`sys.monitoring.MISSING`.
ru: Если аргументов нет, для *arg0* устанавливается значение :data:`sys.monitoring.MISSING`.

source: :monitoring-event:`RAISE`, :monitoring-event:`RERAISE`, :monitoring-event:`EXCEPTION_HANDLED`, :monitoring-event:`PY_UNWIND`, :monitoring-event:`PY_THROW` and :monitoring-event:`STOP_ITERATION`::
ru: :monitoring-event:`RAISE`, :monitoring-event:`RERAISE`, :monitoring-event:`EXCEPTION_HANDLED`, :monitoring-event:`PY_UNWIND`, :monitoring-event:`PY_THROW` и :monitoring-event: `STOP_ITERATION`::

source: :monitoring-event:`BRANCH` and :monitoring-event:`JUMP`::
ru: :monitoring-event:`BRANCH` и :monitoring-event:`JUMP`::

source: Note that the *destination_offset* is where the code will next execute. For an untaken branch this will be the offset of the instruction following the branch.
ru: Обратите внимание, что *destination_offset* — это место, где код будет выполняться в следующий раз. Для невыполненной ветви это будет смещение инструкции, следующей за ветвью.
