Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/sys.po
Languages: ru

source: This module provides access to some variables used or maintained by the interpreter and to functions that interact strongly with the interpreter. It is always available.
ru: Этот модуль обеспечивает доступ к некоторым переменным, используемым или поддерживаемым интерпретатором, а также к функциям, которые тесно взаимодействуют с интерпретатором. Он всегда доступен.

source: On POSIX systems where Python was built with the standard ``configure`` script, this contains the ABI flags as specified by :pep:`3149`.
ru: В системах POSIX, где Python был собран с помощью стандартного сценария ``configure``, он содержит флаги ABI, указанные в :pep:`3149`.

source: Default flags became an empty string (``m`` flag for pymalloc has been removed).
ru: Флаги по умолчанию стали пустой строкой (флаг ``m`` для pymalloc был удален).

source: Append the callable *hook* to the list of active auditing hooks for the current (sub)interpreter.
ru: Добавьте вызываемый *крючок* в список активных перехватчиков аудита для текущего (под)интерпретатора.

source: When an auditing event is raised through the :func:`sys.audit` function, each hook will be called in the order it was added with the event name and the tuple of arguments. Native hooks added by :c:func:`PySys_AddAuditHook` are called first, followed by hooks added in the current (sub)interpreter. Hooks can then log the event, raise an exception to abort the operation, or terminate the process entirely.
ru: Когда событие аудита вызывается через функцию :func:`sys.audit`, каждый хук будет вызываться в том порядке, в котором он был добавлен, с именем события и кортежем аргументов. Собственные перехватчики, добавленные :c:func:`PySys_AddAuditHook`, вызываются первыми, а затем перехватчики, добавленные в текущий (под)интерпретатор. Затем хуки могут зарегистрировать событие, вызвать исключение для прерывания операции или полностью завершить процесс.

source: Note that audit hooks are primarily for collecting information about internal or otherwise unobservable actions, whether by Python or libraries written in Python. They are not suitable for implementing a "sandbox". In particular, malicious code can trivially disable or bypass hooks added using this function. At a minimum, any security-sensitive hooks must be added using the C API :c:func:`PySys_AddAuditHook` before initialising the runtime, and any modules allowing arbitrary memory modification (such as :mod:`ctypes`) should be completely removed or closely monitored.
ru: Обратите внимание, что перехватчики аудита в первую очередь предназначены для сбора информации о внутренних или иным образом ненаблюдаемых действиях, выполняемых Python или библиотеками, написанными на Python. Они не подходят для реализации «песочницы». В частности, вредоносный код может тривиально отключить или обойти перехватчики, добавленные с помощью этой функции. Как минимум, все чувствительные к безопасности перехваты должны быть добавлены с использованием C API :c:func:`PySys_AddAuditHook` перед инициализацией среды выполнения, а любые модули, допускающие произвольную модификацию памяти (например, :mod:`ctypes`), должны быть полностью удалены. или тщательно контролируются.

source: Calling :func:`sys.addaudithook` will itself raise an auditing event named ``sys.addaudithook`` with no arguments. If any existing hooks raise an exception derived from :class:`RuntimeError`, the new hook will not be added and the exception suppressed. As a result, callers cannot assume that their hook has been added unless they control all existing hooks.
ru: Вызов :func:`sys.addaudithook` сам по себе вызовет событие аудита с именем ``sys.addaudithook`` без аргументов. Если какие-либо существующие перехватчики вызывают исключение, полученное из :class:`RuntimeError`, новый перехватчик не будет добавлен, а исключение будет подавлено. В результате вызывающие программы не могут предположить, что их перехват был добавлен, если они не контролируют все существующие перехватчики.

source: See the :ref:`audit events table <audit-events>` for all events raised by CPython, and :pep:`578` for the original design discussion.
ru: См. :ref:`таблицу событий аудита <audit-events>` для всех событий, создаваемых CPython, и :pep:`578` для первоначального обсуждения проекта.

source: Exceptions derived from :class:`Exception` but not :class:`RuntimeError` are no longer suppressed.
ru: Исключения, производные от :class:`Exception`, но не от :class:`RuntimeError`, больше не подавляются.

source: When tracing is enabled (see :func:`settrace`), Python hooks are only traced if the callable has a ``__cantrace__`` member that is set to a true value. Otherwise, trace functions will skip the hook.
ru: Когда трассировка включена (см. :func:`settrace`), перехватчики Python отслеживаются только в том случае, если вызываемый объект имеет член ``__cantrace__``, для которого установлено истинное значение. В противном случае функции трассировки пропустят перехват.

source: The list of command line arguments passed to a Python script. ``argv[0]`` is the script name (it is operating system dependent whether this is a full pathname or not). If the command was executed using the :option:`-c` command line option to the interpreter, ``argv[0]`` is set to the string ``'-c'``. If no script name was passed to the Python interpreter, ``argv[0]`` is the empty string.
ru: Список аргументов командной строки, передаваемых в скрипт Python. ``argv[0]`` — это имя сценария (полное это имя или нет, зависит от операционной системы). Если команда была выполнена с использованием опции командной строки :option:`-c` для интерпретатора, ``argv[0]`` устанавливается в строку ``'-c'``. Если интерпретатору Python не было передано имя сценария, ``argv[0]`` — это пустая строка.

source: To loop over the standard input, or the list of files given on the command line, see the :mod:`fileinput` module.
ru: Чтобы просмотреть стандартный ввод или список файлов, заданный в командной строке, см. модуль :mod:`fileinput`.

source: See also :data:`sys.orig_argv`.
ru: См. также :data:`sys.orig_argv`.

source: On Unix, command line arguments are passed by bytes from OS. Python decodes them with filesystem encoding and "surrogateescape" error handler. When you need original bytes, you can get it by ``[os.fsencode(arg) for arg in sys.argv]``.
ru: В Unix аргументы командной строки передаются байтами из ОС. Python декодирует их с помощью кодировки файловой системы и обработчика ошибок «surrogateescape». Если вам нужны исходные байты, вы можете получить их с помощью ``[os.fsencode(arg) for arg в sys.argv]``.

source: Raise an auditing event and trigger any active auditing hooks. *event* is a string identifying the event, and *args* may contain optional arguments with more information about the event. The number and types of arguments for a given event are considered a public and stable API and should not be modified between releases.
ru: Вызовите событие аудита и активируйте все активные перехватчики аудита. *event* — это строка, идентифицирующая событие, а *args* может содержать дополнительные аргументы с дополнительной информацией о событии. Количество и типы аргументов для данного события считаются общедоступным и стабильным API и не должны изменяться между выпусками.

source: For example, one auditing event is named ``os.chdir``. This event has one argument called *path* that will contain the requested new working directory.
ru: Например, одно событие аудита называется os.chdir. Это событие имеет один аргумент с именем *path*, который будет содержать запрошенный новый рабочий каталог.

source: :func:`sys.audit` will call the existing auditing hooks, passing the event name and arguments, and will re-raise the first exception from any hook. In general, if an exception is raised, it should not be handled and the process should be terminated as quickly as possible. This allows hook implementations to decide how to respond to particular events: they can merely log the event or abort the operation by raising an exception.
ru: :func:`sys.audit` вызовет существующие перехватчики аудита, передав имя события и аргументы, и повторно вызовет первое исключение из любого перехватчика. В общем, если возникает исключение, его не следует обрабатывать, а процесс следует завершить как можно быстрее. Это позволяет реализациям перехватчиков решать, как реагировать на определенные события: они могут просто зарегистрировать событие или прервать операцию, вызвав исключение.

source: Hooks are added using the :func:`sys.addaudithook` or :c:func:`PySys_AddAuditHook` functions.
ru: Хуки добавляются с помощью функций :func:`sys.addaudithook` или :c:func:`PySys_AddAuditHook`.

source: The native equivalent of this function is :c:func:`PySys_Audit`. Using the native function is preferred when possible.
ru: Собственный эквивалент этой функции: :c:func:`PySys_Audit`. Использование встроенной функции предпочтительнее, если это возможно.

source: See the :ref:`audit events table <audit-events>` for all events raised by CPython.
ru: См. таблицу событий аудита <audit-events>` для всех событий, создаваемых CPython.

source: Set during Python startup, before ``site.py`` is run, to the same value as :data:`exec_prefix`. If not running in a :ref:`virtual environment <venv-def>`, the values will stay the same; if ``site.py`` finds that a virtual environment is in use, the values of :data:`prefix` and :data:`exec_prefix` will be changed to point to the virtual environment, whereas :data:`base_prefix` and :data:`base_exec_prefix` will remain pointing to the base Python installation (the one which the virtual environment was created from).
ru: Во время запуска Python, перед запуском site.py, установите то же значение, что и :data:`exec_prefix`. Если вы не работаете в :ref:`виртуальной среде <venv-def>`, значения останутся прежними; если site.py обнаружит, что используется виртуальная среда, значения :data:`prefix` и :data:`exec_prefix` будут изменены, чтобы указать на виртуальную среду, тогда как :data:`base_prefix` и :data:`base_exec_prefix` по-прежнему будет указывать на базовую установку Python (ту, из которой была создана виртуальная среда).

source: Set during Python startup, before ``site.py`` is run, to the same value as :data:`prefix`. If not running in a :ref:`virtual environment <venv-def>`, the values will stay the same; if ``site.py`` finds that a virtual environment is in use, the values of :data:`prefix` and :data:`exec_prefix` will be changed to point to the virtual environment, whereas :data:`base_prefix` and :data:`base_exec_prefix` will remain pointing to the base Python installation (the one which the virtual environment was created from).
ru: Во время запуска Python, перед запуском ``site.py``, установите то же значение, что и :data:`prefix`. Если вы не работаете в :ref:`виртуальной среде <venv-def>`, значения останутся прежними; если site.py обнаружит, что используется виртуальная среда, значения :data:`prefix` и :data:`exec_prefix` будут изменены, чтобы указать на виртуальную среду, тогда как :data:`base_prefix` и :data:`base_exec_prefix` по-прежнему будет указывать на базовую установку Python (ту, из которой была создана виртуальная среда).

source: An indicator of the native byte order. This will have the value ``'big'`` on big-endian (most-significant byte first) platforms, and ``'little'`` on little-endian (least-significant byte first) platforms.
ru: Индикатор собственного порядка байтов. Оно будет иметь значение ``'big'`` на платформах с прямым порядком байтов (сначала наиболее значимый байт) и ``'little'`` на платформах с прямым порядком байтов (сначала наименее значимый байт).

source: A tuple of strings containing the names of all modules that are compiled into this Python interpreter. (This information is not available in any other way --- ``modules.keys()`` only lists the imported modules.)
ru: Кортеж строк, содержащий имена всех модулей, скомпилированных в этот интерпретатор Python. (Эта информация недоступна другим способом --- ``modules.keys()`` перечисляет только импортированные модули.)

source: See also the :data:`sys.stdlib_module_names` list.
ru: См. также список :data:`sys.stdlib_module_names`.

source: Call ``func(*args)``, while tracing is enabled. The tracing state is saved, and restored afterwards. This is intended to be called from a debugger from a checkpoint, to recursively debug or profile some other code.
ru: Вызовите func(*args)``, пока трассировка включена. Состояние трассировки сохраняется и впоследствии восстанавливается. Это предназначено для вызова из отладчика из контрольной точки для рекурсивной отладки или профилирования другого кода.

source: Tracing is suspended while calling a tracing function set by :func:`settrace` or :func:`setprofile` to avoid infinite recursion. :func:`!call_tracing` enables explicit recursion of the tracing function.
ru: Трассировка приостанавливается при вызове функции трассировки, установленной :func:`settrace` или :func:`setprofile`, чтобы избежать бесконечной рекурсии. :func:`!call_tracing` включает явную рекурсию функции трассировки.

source: A string containing the copyright pertaining to the Python interpreter.
ru: Строка, содержащая авторские права, относящиеся к интерпретатору Python.

source: Clear the internal type cache. The type cache is used to speed up attribute and method lookups. Use the function *only* to drop unnecessary references during reference leak debugging.
ru: Очистите внутренний кэш типов. Кэш типов используется для ускорения поиска атрибутов и методов. Используйте функцию *только* для удаления ненужных ссылок во время отладки утечки ссылок.

source: This function should be used for internal and specialized purposes only.
ru: Эту функцию следует использовать только для внутренних и специализированных целей.

source: Return a dictionary mapping each thread's identifier to the topmost stack frame currently active in that thread at the time the function is called. Note that functions in the :mod:`traceback` module can build the call stack given such a frame.
ru: Возвращает словарь, сопоставляющий идентификатор каждого потока с самым верхним кадром стека, активным в данный момент в этом потоке во время вызова функции. Обратите внимание, что функции в модуле :mod:`traceback` могут создавать стек вызовов по такому кадру.

source: This is most useful for debugging deadlock: this function does not require the deadlocked threads' cooperation, and such threads' call stacks are frozen for as long as they remain deadlocked. The frame returned for a non-deadlocked thread may bear no relationship to that thread's current activity by the time calling code examines the frame.
ru: Это наиболее полезно для отладки взаимоблокировки: эта функция не требует сотрудничества застрявших в тупике потоков, и стеки вызовов таких потоков замораживаются до тех пор, пока они остаются во взаимоблокировке. Кадр, возвращенный для незаблокированного потока, может не иметь никакой связи с текущей активностью этого потока к моменту, когда вызывающий код проверяет кадр.

source: Raises an :ref:`auditing event <auditing>` ``sys._current_frames`` with no arguments.
ru: Вызывает событие аудита <auditing>``sys._current_frames`` без аргументов.

source: Return a dictionary mapping each thread's identifier to the topmost exception currently active in that thread at the time the function is called. If a thread is not currently handling an exception, it is not included in the result dictionary.
ru: Возвращает словарь, сопоставляющий идентификатор каждого потока с самым верхним исключением, активным в данный момент в этом потоке на момент вызова функции. Если поток в данный момент не обрабатывает исключение, оно не включается в словарь результатов.

source: This is most useful for statistical profiling.
ru: Это наиболее полезно для статистического профилирования.

source: Raises an :ref:`auditing event <auditing>` ``sys._current_exceptions`` with no arguments.
ru: Вызывает событие аудита <auditing>``sys._current_Exceptions`` без аргументов.

source: This hook function is called by built-in :func:`breakpoint`. By default, it drops you into the :mod:`pdb` debugger, but it can be set to any other function so that you can choose which debugger gets used.
ru: Эта функция-перехватчик вызывается встроенной функцией :func:`breakpoint`. По умолчанию вы попадаете в отладчик :mod:`pdb`, но его можно настроить на любую другую функцию, чтобы вы могли выбирать, какой отладчик использовать.

source: The signature of this function is dependent on what it calls. For example, the default binding (e.g. ``pdb.set_trace()``) expects no arguments, but you might bind it to a function that expects additional arguments (positional and/or keyword). The built-in ``breakpoint()`` function passes its ``*args`` and ``**kws`` straight through. Whatever ``breakpointhooks()`` returns is returned from ``breakpoint()``.
ru: Сигнатура этой функции зависит от того, что она вызывает. Например, привязка по умолчанию (например, ``pdb.set_trace()``) не предполагает никаких аргументов, но вы можете привязать ее к функции, которая ожидает дополнительные аргументы (позиционные и/или ключевые слова). Встроенная функция Breakpoint() передает свои ``*args`` и ``**kws`` напрямую. Все, что возвращает ``breakpointhooks()``, возвращается из ``breakpoint()``.

source: The default implementation first consults the environment variable :envvar:`PYTHONBREAKPOINT`. If that is set to ``"0"`` then this function returns immediately; i.e. it is a no-op. If the environment variable is not set, or is set to the empty string, ``pdb.set_trace()`` is called. Otherwise this variable should name a function to run, using Python's dotted-import nomenclature, e.g. ``package.subpackage.module.function``. In this case, ``package.subpackage.module`` would be imported and the resulting module must have a callable named ``function()``. This is run, passing in ``*args`` and ``**kws``, and whatever ``function()`` returns, ``sys.breakpointhook()`` returns to the built-in :func:`breakpoint` function.
ru: Реализация по умолчанию сначала обращается к переменной среды :envvar:`PYTHONBREAKPOINT`. Если для этого параметра установлено значение «0», то эта функция немедленно возвращает результат; т.е. это бездействие. Если переменная среды не установлена ​​или ей присвоена пустая строка, вызывается pdb.set_trace(). В противном случае эта переменная должна называть функцию для запуска, используя номенклатуру точечного импорта Python, например ``package.subpackage.module.function``. В этом случае будет импортирован ``package.subpackage.module``, и результирующий модуль должен иметь вызываемую функцию с именем ``function()``. Он запускается, передавая ``*args`` и ``**kws``, и что бы ни возвращала ``function()``, ``sys.breakpointhook()`` возвращает встроенную функцию :func: функция «точка останова».

source: Note that if anything goes wrong while importing the callable named by :envvar:`PYTHONBREAKPOINT`, a :exc:`RuntimeWarning` is reported and the breakpoint is ignored.
ru: Обратите внимание: если что-то пойдет не так при импорте вызываемого объекта с именем :envvar:`PYTHONBREAKPOINT`, выдается сообщение :exc:`RuntimeWarning` и точка останова игнорируется.

source: Also note that if ``sys.breakpointhook()`` is overridden programmatically, :envvar:`PYTHONBREAKPOINT` is *not* consulted.
ru: Также обратите внимание, что если ``sys.breakpointhook()`` переопределяется программно, :envvar:`PYTHONBREAKPOINT` *не* обращается.

source: Print low-level information to stderr about the state of CPython's memory allocator.
ru: Выведите в stderr низкоуровневую информацию о состоянии распределителя памяти CPython.

source: If Python is :ref:`built in debug mode <debug-build>` (:option:`configure --with-pydebug option <--with-pydebug>`), it also performs some expensive internal consistency checks.
ru: Если Python :ref:`встроен в режиме отладки <debug-build>` (:option:`configure --with-pydebug option <--with-pydebug>`), он также выполняет некоторые дорогостоящие проверки внутренней согласованности.

source: This function is specific to CPython. The exact output format is not defined here, and may change.
ru: Эта функция специфична для CPython. Точный формат вывода здесь не определен и может измениться.

source: Integer specifying the handle of the Python DLL.
ru: Целое число, указывающее дескриптор библиотеки Python DLL.

source: If *value* is not ``None``, this function prints ``repr(value)`` to ``sys.stdout``, and saves *value* in ``builtins._``. If ``repr(value)`` is not encodable to ``sys.stdout.encoding`` with ``sys.stdout.errors`` error handler (which is probably ``'strict'``), encode it to ``sys.stdout.encoding`` with ``'backslashreplace'`` error handler.
ru: Если *value* не ``None``, эта функция печатает ``repr(value)`` в ``sys.stdout`` и сохраняет *value* в ``builtins._``. Если ``repr(value)`` не может быть закодирован в ``sys.stdout.encoding`` с помощью обработчика ошибок ``sys.stdout.errors`` (который, вероятно, ``строгий'``), закодируйте его в sys.stdout.encoding с обработчиком ошибок backslashreplace.

source: ``sys.displayhook`` is called on the result of evaluating an :term:`expression` entered in an interactive Python session. The display of these values can be customized by assigning another one-argument function to ``sys.displayhook``.
ru: ``sys.displayhook`` вызывается в результате оценки :term:`выражения`, введенного в интерактивном сеансе Python. Отображение этих значений можно настроить, назначив другую функцию с одним аргументом ``sys.displayhook``.

source: Pseudo-code::
ru: Псевдокод::

source: Use ``'backslashreplace'`` error handler on :exc:`UnicodeEncodeError`.
ru: Используйте обработчик ошибок backslashreplace в :exc:`UnicodeEncodeError`.

source: If this is true, Python won't try to write ``.pyc`` files on the import of source modules. This value is initially set to ``True`` or ``False`` depending on the :option:`-B` command line option and the :envvar:`PYTHONDONTWRITEBYTECODE` environment variable, but you can set it yourself to control bytecode file generation.
ru: Если это правда, Python не будет пытаться записывать файлы ``.pyc`` при импорте исходных модулей. Первоначально для этого значения установлено значение ``True`` или ``False`` в зависимости от параметра командной строки :option:`-B` и переменной среды :envvar:`PYTHONDONTWRITEBYTECODE`, но вы можете установить его самостоятельно для управления байт-кодом. генерация файлов.

source: A :term:`named tuple` holding information about the environment on the *wasm32-emscripten* platform. The named tuple is provisional and may change in the future.
ru: :term:`named tuple`, содержащий информацию об окружающей среде на платформе *wasm32-emscripten*. Именованный кортеж является предварительным и может измениться в будущем.

source: Emscripten version as tuple of ints (major, minor, micro), e.g. ``(3, 1, 8)``.
ru: Версия Emscripten в виде кортежа целых чисел (основных, второстепенных, микро), например ``(3, 1, 8)``.

source: Runtime string, e.g. browser user agent, ``'Node.js v14.18.2'``, or ``'UNKNOWN'``.
ru: Строка времени выполнения, например, пользовательский агент браузера, ``'Node.js v14.18.2'`` или ``'UNKNOWN'``.

source: ``True`` if Python is compiled with Emscripten pthreads support.
ru: ``True``, если Python скомпилирован с поддержкой Emscripten pthreads.

source: ``True`` if Python is compiled with shared memory support.
ru: ``True``, если Python скомпилирован с поддержкой общей памяти.
