Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/sys.po
Languages: ru

source: A dictionary of the various implementation-specific flags passed through the :option:`-X` command-line option. Option names are either mapped to their values, if given explicitly, or to :const:`True`. Example:
ru: Словарь различных флагов, специфичных для реализации, передается через параметр командной строки :option:`-X`. Имена опций либо сопоставляются с их значениями, если они заданы явно, либо с :const:`True`. Пример:

source: This is a CPython-specific way of accessing options passed through :option:`-X`. Other implementations may export them through other means, or not at all.
ru: Это специфический для CPython способ доступа к параметрам, передаваемым через :option:`-X`. Другие реализации могут экспортировать их другими способами или не экспортировать вообще.

source: Citations
ru: Цитаты

source: ISO/IEC 9899:1999. "Programming languages -- C." A public draft of this standard is available at https://www.open-std.org/jtc1/sc22/wg14/www/docs/n1256.pdf\ .
ru: ИСО/МЭК 9899:1999. «Языки программирования -- C». Публичный проект этого стандарта доступен по адресу https://www.open-std.org/jtc1/sc22/wg14/www/docs/n1256.pdf\.

source: object
ru: объект

source: traceback
ru: трассировка

source: module
ru: модуль

source: search
ru: поиск

source: path
ru: путь

source: interpreter prompt
ru: подсказка переводчика
