Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/sys_path_init.po
Languages: ru

source: The initialization of the :data:`sys.path` module search path
ru: Инициализация пути поиска модуля :data:`sys.path`

source: A module search path is initialized when Python starts. This module search path may be accessed at :data:`sys.path`.
ru: Путь поиска модуля инициализируется при запуске Python. Доступ к этому пути поиска модуля можно получить по адресу :data:`sys.path`.

source: The first entry in the module search path is the directory that contains the input script, if there is one. Otherwise, the first entry is the current directory, which is the case when executing the interactive shell, a :option:`-c` command, or :option:`-m` module.
ru: Первая запись в пути поиска модуля — это каталог, содержащий входной скрипт, если таковой имеется. В противном случае первой записью является текущий каталог, что имеет место при выполнении интерактивной оболочки, команды :option:`-c` или модуля :option:`-m`.

source: The :envvar:`PYTHONPATH` environment variable is often used to add directories to the search path. If this environment variable is found then the contents are added to the module search path.
ru: Переменная среды :envvar:`PYTHONPATH` часто используется для добавления каталогов в путь поиска. Если эта переменная среды найдена, ее содержимое добавляется в путь поиска модуля.

source: :envvar:`PYTHONPATH` will affect all installed Python versions/environments. Be wary of setting this in your shell profile or global environment variables. The :mod:`site` module offers more nuanced techniques as mentioned below.
ru: :envvar:`PYTHONPATH` повлияет на все установленные версии/среды Python. Будьте осторожны, устанавливая это в своем профиле оболочки или глобальных переменных среды. Модуль :mod:`site` предлагает более тонкие методы, упомянутые ниже.

source: The next items added are the directories containing standard Python modules as well as any :term:`extension module`\s that these modules depend on. Extension modules are ``.pyd`` files on Windows and ``.so`` files on other platforms. The directory with the platform-independent Python modules is called ``prefix``. The directory with the extension modules is called ``exec_prefix``.
ru: Следующие добавленные элементы — это каталоги, содержащие стандартные модули Python, а также любые модули расширения, от которых зависят эти модули. Модули расширения представляют собой файлы ``.pyd`` в Windows и файлы ``.so`` на других платформах. Каталог с независимыми от платформы модулями Python называется ``prefix``. Каталог с модулями расширения называется ``exec_prefix``.

source: The :envvar:`PYTHONHOME` environment variable may be used to set the ``prefix`` and ``exec_prefix`` locations. Otherwise these directories are found by using the Python executable as a starting point and then looking for various 'landmark' files and directories. Note that any symbolic links are followed so the real Python executable location is used as the search starting point. The Python executable location is called ``home``.
ru: Переменная среды :envvar:`PYTHONHOME` может использоваться для установки местоположений ``prefix`` и ``exec_prefix``. В противном случае эти каталоги находятся с помощью исполняемого файла Python в качестве отправной точки, а затем поиска различных «ориентировочных» файлов и каталогов. Обратите внимание, что при переходе по любым символическим ссылкам в качестве отправной точки поиска используется реальное расположение исполняемого файла Python. Местоположение исполняемого файла Python называется «home».

source: Once ``home`` is determined, the ``prefix`` directory is found by first looking for :file:`python{majorversion}{minorversion}.zip` (``python311.zip``). On Windows the zip archive is searched for in ``home`` and on Unix the archive is expected to be in :file:`lib`. Note that the expected zip archive location is added to the module search path even if the archive does not exist. If no archive was found, Python on Windows will continue the search for ``prefix`` by looking for :file:`Lib\\os.py`. Python on Unix will look for :file:`lib/python{majorversion}.{minorversion}/os.py` (``lib/python3.11/os.py``). On Windows ``prefix`` and ``exec_prefix`` are the same, however on other platforms :file:`lib/python{majorversion}.{minorversion}/lib-dynload` (``lib/python3.11/lib-dynload``) is searched for and used as an anchor for ``exec_prefix``. On some platforms :file:`lib` may be :file:`lib64` or another value, see :data:`sys.platlibdir` and :envvar:`PYTHONPLATLIBDIR`.
ru: После определения ``home`` каталог ``prefix`` находится путем поиска :file:`python{majorversion}{minorversion}.zip` (``python311.zip``). В Windows zip-архив ищется в ``home``, а в Unix ожидается, что архив будет находиться в :file:`lib`. Обратите внимание, что ожидаемое местоположение zip-архива добавляется в путь поиска модуля, даже если архив не существует. Если архив не найден, Python в Windows продолжит поиск ``prefix``, ища :file:`Lib\\os.py`. Python в Unix будет искать :file:`lib/python{majorversion}.{minorversion}/os.py` (``lib/python3.11/os.py``). В Windows ``prefix`` и ``exec_prefix`` одинаковы, однако на других платформах :file:`lib/python{majorversion}.{minorversion}/lib-dynload` (``lib/python3.11/lib -dynload``) ищется и используется в качестве привязки для ``exec_prefix``. На некоторых платформах :file:`lib` может быть :file:`lib64` или другим значением, см. :data:`sys.platlibdir` и :envvar:`PYTHONPLATLIBDIR`.

source: Once found, ``prefix`` and ``exec_prefix`` are available at :data:`sys.prefix` and :data:`sys.exec_prefix` respectively.
ru: После обнаружения ``prefix`` и ``exec_prefix`` доступны по адресу :data:`sys.prefix` и :data:`sys.exec_prefix` соответственно.

source: Finally, the :mod:`site` module is processed and :file:`site-packages` directories are added to the module search path. A common way to customize the search path is to create :mod:`sitecustomize` or :mod:`usercustomize` modules as described in the :mod:`site` module documentation.
ru: Наконец, модуль :mod:`site` обрабатывается, и в путь поиска модуля добавляются каталоги :file:`site-packages`. Распространенный способ настройки пути поиска — создание модулей :mod:`sitecustomize` или :mod:`usercustomize`, как описано в документации модуля :mod:`site`.

source: Certain command line options may further affect path calculations. See :option:`-E`, :option:`-I`, :option:`-s` and :option:`-S` for further details.
ru: Определенные параметры командной строки могут дополнительно повлиять на расчет пути. Дополнительные сведения см. в :option:`-E`, :option:`-I`, :option:`-s` и :option:`-S`.

source: Virtual environments
ru: Виртуальные среды

source: If Python is run in a virtual environment (as described at :ref:`tut-venv`) then ``prefix`` and ``exec_prefix`` are specific to the virtual environment.
ru: Если Python запускается в виртуальной среде (как описано в :ref:`tut-venv`), тогда ``prefix`` и ``exec_prefix`` относятся к виртуальной среде.

source: If a ``pyvenv.cfg`` file is found alongside the main executable, or in the directory one level above the executable, the following variations apply:
ru: Если файл ``pyvenv.cfg`` находится рядом с основным исполняемым файлом или в каталоге на один уровень выше исполняемого файла, применяются следующие варианты:

source: If ``home`` is an absolute path and :envvar:`PYTHONHOME` is not set, this path is used instead of the path to the main executable when deducing ``prefix`` and ``exec_prefix``.
ru: Если ``home`` является абсолютным путем и :envvar:`PYTHONHOME` не установлен, этот путь используется вместо пути к основному исполняемому файлу при выводе ``prefix`` и ``exec_prefix``.

source: _pth files
ru: _pth-файлы

source: To completely override :data:`sys.path` create a ``._pth`` file with the same name as the shared library or executable (``python._pth`` or ``python311._pth``). The shared library path is always known on Windows, however it may not be available on other platforms. In the ``._pth`` file specify one line for each path to add to :data:`sys.path`. The file based on the shared library name overrides the one based on the executable, which allows paths to be restricted for any program loading the runtime if desired.
ru: Чтобы полностью переопределить :data:`sys.path`, создайте файл ``._pth`` с тем же именем, что и у общей библиотеки или исполняемого файла (``python._pth`` или ``python311._pth``). Путь к общей библиотеке всегда известен в Windows, однако он может быть недоступен на других платформах. В файле ``._pth`` укажите по одной строке для каждого пути, который нужно добавить в :data:`sys.path`. Файл, основанный на имени общей библиотеки, переопределяет файл, основанный на исполняемом файле, что позволяет при желании ограничить пути для любой программы, загружающей среду выполнения.

source: When the file exists, all registry and environment variables are ignored, isolated mode is enabled, and :mod:`site` is not imported unless one line in the file specifies ``import site``. Blank paths and lines starting with ``#`` are ignored. Each path may be absolute or relative to the location of the file. Import statements other than to ``site`` are not permitted, and arbitrary code cannot be specified.
ru: Если файл существует, все переменные реестра и среды игнорируются, включается изолированный режим и :mod:`site` не импортируется, если только одна строка в файле не указывает ``import site``. Пустые пути и строки, начинающиеся с ``#``, игнорируются. Каждый путь может быть абсолютным или относительным к местоположению файла. Операторы импорта, отличные от ``site``, не допускаются, и не может быть указан произвольный код.

source: Note that ``.pth`` files (without leading underscore) will be processed normally by the :mod:`site` module when ``import site`` has been specified.
ru: Обратите внимание, что файлы ``.pth`` (без подчеркивания в начале) будут нормально обрабатываться модулем :mod:`site`, если указан ``import site``.

source: Embedded Python
ru: Встроенный Python

source: If Python is embedded within another application :c:func:`Py_InitializeFromConfig` and the :c:type:`PyConfig` structure can be used to initialize Python. The path specific details are described at :ref:`init-path-config`.
ru: Если Python встроен в другое приложение, для инициализации Python можно использовать структуру :c:func:`Py_InitializeFromConfig` и структуру :c:type:`PyConfig`. Подробности пути описаны в :ref:`init-path-config`.

source: :ref:`windows_finding_modules` for detailed Windows notes.
ru: :ref:`windows_finding_modules` для получения подробных примечаний по Windows.

source: :ref:`using-on-unix` for Unix details.
ru: :ref:`using-on-unix` для получения подробной информации о Unix.
