Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/syslog.po
Languages: uk

source: :mod:`syslog` --- Unix syslog library routines
uk: :mod:`syslog` --- Процедури бібліотеки системного журналу Unix

source: This module provides an interface to the Unix ``syslog`` library routines. Refer to the Unix manual pages for a detailed description of the ``syslog`` facility.
uk: Цей модуль забезпечує інтерфейс для процедур бібліотеки ``syslog`` Unix. Зверніться до довідкових сторінок Unix для детального опису засобу ``syslog``.

source: This module wraps the system ``syslog`` family of routines. A pure Python library that can speak to a syslog server is available in the :mod:`logging.handlers` module as :class:`SysLogHandler`.
uk: Цей модуль обгортає групу системних процедур ``syslog``. Чиста бібліотека Python, яка може спілкуватися з сервером syslog, доступна в модулі :mod:`logging.handlers` як :class:`SysLogHandler`.

source: The module defines the following functions:
uk: Модуль визначає такі функції:

source: Send the string *message* to the system logger. A trailing newline is added if necessary. Each message is tagged with a priority composed of a *facility* and a *level*. The optional *priority* argument, which defaults to :const:`LOG_INFO`, determines the message priority. If the facility is not encoded in *priority* using logical-or (``LOG_INFO | LOG_USER``), the value given in the :func:`openlog` call is used.
uk: Надішліть рядок *повідомлення* системному реєстратору. За необхідності додається символ нового рядка. Кожне повідомлення позначено тегом пріоритету, що складається з *засобу* та *рівня*. Додатковий аргумент *priority*, який за замовчуванням має значення :const:`LOG_INFO`, визначає пріоритет повідомлення. Якщо засіб не закодовано в *пріоритеті* за допомогою логічного або (``LOG_INFO | LOG_USER``), використовується значення, указане у виклику :func:`openlog`.

source: Raises an :ref:`auditing event <auditing>` ``syslog.syslog`` with arguments ``priority``, ``message``.
uk: Викликає :ref:`подію аудиту <auditing>` ``syslog.syslog`` з аргументами ``priority``, ``message``.

source: Logging options of subsequent :func:`syslog` calls can be set by calling :func:`openlog`. :func:`syslog` will call :func:`openlog` with no arguments if the log is not currently open.
uk: Параметри журналювання наступних викликів :func:`syslog` можна встановити за допомогою виклику :func:`openlog`. :func:`syslog` викличе :func:`openlog` без аргументів, якщо журнал наразі не відкритий.

source: The optional *ident* keyword argument is a string which is prepended to every message, and defaults to ``sys.argv[0]`` with leading path components stripped. The optional *logoption* keyword argument (default is 0) is a bit field -- see below for possible values to combine. The optional *facility* keyword argument (default is :const:`LOG_USER`) sets the default facility for messages which do not have a facility explicitly encoded.
uk: Необов’язковий аргумент ключового слова *ident* — це рядок, який додається до кожного повідомлення та за замовчуванням має значення ``sys.argv[0]`` з видаленими компонентами початкового шляху. Додатковий аргумент ключового слова *logoption* (за замовчуванням 0) є бітовим полем. Нижче наведено можливі значення для об’єднання. Необов’язковий аргумент ключового слова *facility* (за замовчуванням: :const:`LOG_USER`) встановлює функцію за замовчуванням для повідомлень, які не мають явно закодованої можливості.

source: Raises an :ref:`auditing event <auditing>` ``syslog.openlog`` with arguments ``ident``, ``logoption``, ``facility``.
uk: Викликає :ref:`подію аудиту <auditing>` ``syslog.openlog`` з аргументами ``ident``, ``logoption``, ``facility``.

source: Reset the syslog module values and call the system library ``closelog()``.
uk: Скиньте значення модуля syslog і викличте системну бібліотеку ``closelog()``.

source: This causes the module to behave as it does when initially imported. For example, :func:`openlog` will be called on the first :func:`syslog` call (if :func:`openlog` hasn't already been called), and *ident* and other :func:`openlog` parameters are reset to defaults.
uk: Це змушує модуль поводитись так само, як і під час початкового імпорту. Наприклад, :func:`openlog` буде викликано під час першого виклику :func:`syslog` (якщо :func:`openlog` ще не було викликано), а *ident* та інші :func:`openlog` параметри скидаються до значень за замовчуванням.

source: Raises an :ref:`auditing event <auditing>` ``syslog.closelog`` with no arguments.
uk: Викликає :ref:`подію аудиту <auditing>` ``syslog.closelog`` без аргументів.

source: Set the priority mask to *maskpri* and return the previous mask value. Calls to :func:`syslog` with a priority level not set in *maskpri* are ignored. The default is to log all priorities. The function ``LOG_MASK(pri)`` calculates the mask for the individual priority *pri*. The function ``LOG_UPTO(pri)`` calculates the mask for all priorities up to and including *pri*.
uk: Встановіть маску пріоритету на *maskpri* та поверніть попереднє значення маски. Виклики до :func:`syslog` з рівнем пріоритету, не встановленим у *maskpri*, ігноруються. За умовчанням реєструються всі пріоритети. Функція ``LOG_MASK(pri)`` обчислює маску для індивідуального пріоритету *pri*. Функція ``LOG_UPTO(pri)`` обчислює маску для всіх пріоритетів до *pri* включно.

source: Raises an :ref:`auditing event <auditing>` ``syslog.setlogmask`` with argument ``maskpri``.
uk: Викликає :ref:`подію аудиту <auditing>` ``syslog.setlogmask`` з аргументом ``maskpri``.

source: The module defines the following constants:
uk: Модуль визначає такі константи:

source: Priority levels (high to low):
uk: Рівні пріоритету (від високого до низького):

source: Facilities:
uk: Зручності:

source: :const:`LOG_KERN`, :const:`LOG_USER`, :const:`LOG_MAIL`, :const:`LOG_DAEMON`, :const:`LOG_AUTH`, :const:`LOG_LPR`, :const:`LOG_NEWS`, :const:`LOG_UUCP`, :const:`LOG_CRON`, :const:`LOG_SYSLOG`, :const:`LOG_LOCAL0` to :const:`LOG_LOCAL7`, and, if defined in ``<syslog.h>``, :const:`LOG_AUTHPRIV`.
uk: :const:`LOG_KERN`, :const:`LOG_USER`, :const:`LOG_MAIL`, :const:`LOG_DAEMON`, :const:`LOG_AUTH`, :const:`LOG_LPR`, :const:`LOG_NEWS`, :const:`LOG_UUCP`, :const:`LOG_CRON`, :const:`LOG_SYSLOG`, :const:`LOG_LOCAL0` до :const:`LOG_LOCAL7`, і, якщо визначено в ``<syslog.h>``, :const:`LOG_AUTHPRIV`.

source: Log options:
uk: Параметри журналу:

source: :const:`LOG_PID`, :const:`LOG_CONS`, :const:`LOG_NDELAY`, and, if defined in ``<syslog.h>``, :const:`LOG_ODELAY`, :const:`LOG_NOWAIT`, and :const:`LOG_PERROR`.
uk: :const:`LOG_PID`, :const:`LOG_CONS`, :const:`LOG_NDELAY` і, якщо визначено в ``<syslog.h>``, :const:`LOG_ODELAY`, :const:`LOG_NOWAIT` і :const:`LOG_PERROR`.

source: Examples
uk: Приклади

source: Simple example
uk: Простий приклад

source: A simple set of examples::
uk: Простий набір прикладів:

source: An example of setting some log options, these would include the process ID in logged messages, and write the messages to the destination facility used for mail logging::
uk: Приклад налаштування деяких параметрів журналу, які включатимуть ідентифікатор процесу в зареєстрованих повідомленнях і запис повідомлень до засобу призначення, який використовується для журналювання пошти:
