Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/tarfile.po
Languages: ru

source: Return a :class:`TarInfo` object for member *name*. If *name* can not be found in the archive, :exc:`KeyError` is raised.
ru: Верните объект :class:`TarInfo` для члена *name*. Если *name* не найдено в архиве, выдается :exc:`KeyError`.

source: If a member occurs more than once in the archive, its last occurrence is assumed to be the most up-to-date version.
ru: Если элемент встречается в архиве более одного раза, предполагается, что его последнее появление является самой последней версией.

source: Return the members of the archive as a list of :class:`TarInfo` objects. The list has the same order as the members in the archive.
ru: Вернуть элементы архива в виде списка объектов :class:`TarInfo`. Список имеет тот же порядок, что и элементы в архиве.

source: Return the members as a list of their names. It has the same order as the list returned by :meth:`getmembers`.
ru: Верните участников в виде списка их имен. Он имеет тот же порядок, что и список, возвращаемый :meth:`getmembers`.

source: Print a table of contents to ``sys.stdout``. If *verbose* is :const:`False`, only the names of the members are printed. If it is :const:`True`, output similar to that of :program:`ls -l` is produced. If optional *members* is given, it must be a subset of the list returned by :meth:`getmembers`.
ru: Распечатайте оглавление в ``sys.stdout``. Если *verbose* имеет значение :const:`False`, печатаются только имена членов. Если это :const:`True`, выводится результат, аналогичный выводу :program:`ls -l`. Если указан необязательный *members*, он должен быть подмножеством списка, возвращаемого :meth:`getmembers`.

source: Added the *members* parameter.
ru: Добавлен параметр *members*.

source: Return the next member of the archive as a :class:`TarInfo` object, when :class:`TarFile` is opened for reading. Return :const:`None` if there is no more available.
ru: Возвращает следующий элемент архива как объект :class:`TarInfo`, когда :class:`TarFile` открывается для чтения. Верните :const:`None`, если больше нет доступных.

source: Extract all members from the archive to the current working directory or directory *path*. If optional *members* is given, it must be a subset of the list returned by :meth:`getmembers`. Directory information like owner, modification time and permissions are set after all members have been extracted. This is done to work around two problems: A directory's modification time is reset each time a file is created in it. And, if a directory's permissions do not allow writing, extracting files to it will fail.
ru: Извлеките всех участников из архива в текущий рабочий каталог или каталог *путь*. Если указан необязательный *members*, он должен быть подмножеством списка, возвращаемого :meth:`getmembers`. Информация о каталоге, такая как владелец, время изменения и разрешения, устанавливается после извлечения всех участников. Это сделано для решения двух проблем: Время изменения каталога сбрасывается каждый раз, когда в нем создается файл. А если права каталога не позволяют осуществлять запись, извлечь в него файлы не удастся.

source: If *numeric_owner* is :const:`True`, the uid and gid numbers from the tarfile are used to set the owner/group for the extracted files. Otherwise, the named values from the tarfile are used.
ru: Если *numeric_owner* имеет значение :const:`True`, номера uid и gid из tar-файла используются для установки владельца/группы извлеченных файлов. В противном случае используются именованные значения из tar-файла.

source: The *filter* argument specifies how ``members`` are modified or rejected before extraction. See :ref:`tarfile-extraction-filter` for details. It is recommended to set this explicitly depending on which *tar* features you need to support.
ru: Аргумент *filter* определяет, как элементы изменяются или отклоняются перед извлечением. Подробности смотрите в :ref:`tarfile-extraction-filter`. Рекомендуется указать это явно в зависимости от того, какие функции *tar* вам необходимо поддерживать.

source: Never extract archives from untrusted sources without prior inspection. It is possible that files are created outside of *path*, e.g. members that have absolute filenames starting with ``"/"`` or filenames with two dots ``".."``.
ru: Никогда не извлекайте архивы из ненадежных источников без предварительной проверки. Возможно, что файлы создаются за пределами *path*, например, члены, абсолютные имена которых начинаются с ``"/"`` или имена файлов с двумя точками ``".."``.

source: Set ``filter='data'`` to prevent the most dangerous security issues, and read the :ref:`tarfile-extraction-filter` section for details.
ru: Установите ``filter='data'``, чтобы предотвратить наиболее опасные проблемы безопасности, и прочитайте раздел :ref:`tarfile-extraction-filter` для получения подробной информации.

source: Added the *numeric_owner* parameter.
ru: Добавлен параметр *numeric_owner*.

source: The *path* parameter accepts a :term:`path-like object`.
ru: Параметр *path* принимает объект, подобный пути.

source: Added the *filter* parameter.
ru: Добавлен параметр *filter*.

source: Extract a member from the archive to the current working directory, using its full name. Its file information is extracted as accurately as possible. *member* may be a filename or a :class:`TarInfo` object. You can specify a different directory using *path*. *path* may be a :term:`path-like object`. File attributes (owner, mtime, mode) are set unless *set_attrs* is false.
ru: Извлеките участника из архива в текущий рабочий каталог, используя его полное имя. Информация о его файле извлекается максимально точно. *member* может быть именем файла или объектом :class:`TarInfo`. Вы можете указать другой каталог, используя *path*. *path* может быть :term:`объектом, похожим на путь`. Атрибуты файла (владелец, mtime, режим) устанавливаются, если *set_attrs* не имеет значения false.

source: The *numeric_owner* and *filter* arguments are the same as for :meth:`extractall`.
ru: Аргументы *numeric_owner* и *filter* такие же, как и для :meth:`extractall`.

source: The :meth:`extract` method does not take care of several extraction issues. In most cases you should consider using the :meth:`extractall` method.
ru: Метод :meth:`extract` не решает некоторые проблемы извлечения. В большинстве случаев вам следует рассмотреть возможность использования метода :meth:`extractall`.

source: See the warning for :meth:`extractall`.
ru: См. предупреждение для :meth:`extractall`.

source: Added the *set_attrs* parameter.
ru: Добавлен параметр *set_attrs*.

source: Extract a member from the archive as a file object. *member* may be a filename or a :class:`TarInfo` object. If *member* is a regular file or a link, an :class:`io.BufferedReader` object is returned. For all other existing members, :const:`None` is returned. If *member* does not appear in the archive, :exc:`KeyError` is raised.
ru: Извлеките член из архива как файловый объект. *member* может быть именем файла или объектом :class:`TarInfo`. Если *member* является обычным файлом или ссылкой, возвращается объект :class:`io.BufferedReader`. Для всех остальных существующих членов возвращается :const:`None`. Если *member* не появляется в архиве, возникает :exc:`KeyError`.

source: Return an :class:`io.BufferedReader` object.
ru: Верните объект :class:`io.BufferedReader`.

source: The returned :class:`io.BufferedReader` object has the :attr:`!mode` attribute which is always equal to ``'rb'``.
ru: Возвращенный объект :class:`io.BufferedReader` имеет атрибут :attr:`!mode`, который всегда равен ``'rb'``.

source: If *errorlevel* is ``0``, errors are ignored when using :meth:`TarFile.extract` and :meth:`TarFile.extractall`. Nevertheless, they appear as error messages in the debug output when *debug* is greater than 0. If ``1`` (the default), all *fatal* errors are raised as :exc:`OSError` or :exc:`FilterError` exceptions. If ``2``, all *non-fatal* errors are raised as :exc:`TarError` exceptions as well.
ru: Если *errorlevel* равен ``0``, ошибки игнорируются при использовании :meth:`TarFile.extract` и :meth:`TarFile.extractall`. Тем не менее, они появляются в виде сообщений об ошибках в выходных данных отладки, когда *debug* больше 0. Если ``1`` (по умолчанию), все *фатальные* ошибки выдаются как :exc:`OSError` или :exc:` Исключения FilterError`. Если ``2``, все *нефатальные* ошибки также вызываются как исключения :exc:`TarError`.

source: Some exceptions, e.g. ones caused by wrong argument types or data corruption, are always raised.
ru: Некоторые исключения, например, вызванные неправильными типами аргументов или повреждением данных, возникают всегда.

source: Custom :ref:`extraction filters <tarfile-extraction-filter>` should raise :exc:`FilterError` for *fatal* errors and :exc:`ExtractError` for *non-fatal* ones.
ru: Пользовательские :ref:`фильтры извлечения <tarfile-extraction-filter>` должны вызывать :exc:`FilterError` для *фатальных* ошибок и :exc:`ExtractError` для *нефатальных* ошибок.

source: Note that when an exception is raised, the archive may be partially extracted. It is the user’s responsibility to clean up.
ru: Обратите внимание, что при возникновении исключения архив может быть частично извлечен. Ответственность за очистку лежит на пользователе.

source: The :ref:`extraction filter <tarfile-extraction-filter>` used as a default for the *filter* argument of :meth:`~TarFile.extract` and :meth:`~TarFile.extractall`.
ru: Фильтр извлечения :ref:`<tarfile-extraction-filter>`, используемый по умолчанию для аргумента *filter* :meth:`~TarFile.extract` и :meth:`~TarFile.extractall`.

source: The attribute may be ``None`` or a callable. String names are not allowed for this attribute, unlike the *filter* argument to :meth:`~TarFile.extract`.
ru: Атрибут может быть None или вызываемым. Для этого атрибута не допускаются строковые имена, в отличие от аргумента *filter* для :meth:`~TarFile.extract`.

source: If ``extraction_filter`` is ``None`` (the default), calling an extraction method without a *filter* argument will raise a ``DeprecationWarning``, and fall back to the :func:`fully_trusted <fully_trusted_filter>` filter, whose dangerous behavior matches previous versions of Python.
ru: Если ``extraction_filter`` имеет значение ``None`` (по умолчанию), вызов метода извлечения без аргумента *filter* вызовет ``DeprecationWarning`` и вернется к :func:`full_trusted <full_trusted_filter>` фильтр, опасное поведение которого соответствует предыдущим версиям Python.

source: In Python 3.14+, leaving ``extraction_filter=None`` will cause extraction methods to use the :func:`data <data_filter>` filter by default.
ru: В Python 3.14+ если оставить ``extraction_filter=None``, методы извлечения будут использовать фильтр :func:`data <data_filter>` по умолчанию.

source: The attribute may be set on instances or overridden in subclasses. It also is possible to set it on the ``TarFile`` class itself to set a global default, although, since it affects all uses of *tarfile*, it is best practice to only do so in top-level applications or :mod:`site configuration <site>`. To set a global default this way, a filter function needs to be wrapped in :func:`staticmethod` to prevent injection of a ``self`` argument.
ru: Атрибут может быть установлен для экземпляров или переопределен в подклассах. Также возможно установить его в самом классе TarFile, чтобы установить глобальное значение по умолчанию, хотя, поскольку это влияет на все виды использования *tarfile*, лучше всего делать это только в приложениях верхнего уровня или :mod. :`конфигурация сайта <сайт>`. Чтобы таким образом установить глобальное значение по умолчанию, функцию фильтра необходимо обернуть в :func:`staticmethod`, чтобы предотвратить внедрение аргумента ``self``.

source: Add the file *name* to the archive. *name* may be any type of file (directory, fifo, symbolic link, etc.). If given, *arcname* specifies an alternative name for the file in the archive. Directories are added recursively by default. This can be avoided by setting *recursive* to :const:`False`. Recursion adds entries in sorted order. If *filter* is given, it should be a function that takes a :class:`TarInfo` object argument and returns the changed :class:`TarInfo` object. If it instead returns :const:`None` the :class:`TarInfo` object will be excluded from the archive. See :ref:`tar-examples` for an example.
ru: Добавьте файл *имя* в архив. *имя* может быть файлом любого типа (каталог, fifo, символическая ссылка и т. д.). Если задано, *arcname* указывает альтернативное имя файла в архиве. По умолчанию каталоги добавляются рекурсивно. Этого можно избежать, установив для *recursive* значение :const:`False`. Рекурсия добавляет записи в отсортированном порядке. Если указан *filter*, это должна быть функция, которая принимает аргумент объекта :class:`TarInfo` и возвращает измененный объект :class:`TarInfo`. Если вместо этого он вернет :const:`None`, объект :class:`TarInfo` будет исключен из архива. См. пример в :ref:`tar-examples`.

source: Recursion adds entries in sorted order.
ru: Рекурсия добавляет записи в отсортированном порядке.

source: Add the :class:`TarInfo` object *tarinfo* to the archive. If *tarinfo* represents a non zero-size regular file, the *fileobj* argument should be a :term:`binary file`, and ``tarinfo.size`` bytes are read from it and added to the archive. You can create :class:`TarInfo` objects directly, or by using :meth:`gettarinfo`.
ru: Добавьте в архив объект :class:`TarInfo` *tarinfo*. Если *tarinfo* представляет собой обычный файл ненулевого размера, аргумент *fileobj* должен быть :term:`двоичным файлом`, а байты ``tarinfo.size`` считываются из него и добавляются в архив. Вы можете создавать объекты :class:`TarInfo` напрямую или с помощью :meth:`gettarinfo`.

source: *fileobj* must be given for non-zero-sized regular files.
ru: *fileobj* необходимо указывать для обычных файлов ненулевого размера.

source: Create a :class:`TarInfo` object from the result of :func:`os.stat` or equivalent on an existing file. The file is either named by *name*, or specified as a :term:`file object` *fileobj* with a file descriptor. *name* may be a :term:`path-like object`. If given, *arcname* specifies an alternative name for the file in the archive, otherwise, the name is taken from *fileobj*’s :attr:`~io.FileIO.name` attribute, or the *name* argument. The name should be a text string.
ru: Создайте объект :class:`TarInfo` из результата :func:`os.stat` или его эквивалента в существующем файле. Файлу присваивается имя *name* или указывается как :term:`file object` *fileobj* с файловым дескриптором. *имя* может быть :term:`объектом, похожим на путь`. Если задано, *arcname* указывает альтернативное имя файла в архиве, в противном случае имя берется из атрибута :attr:`~io.FileIO.name` *fileobj* или аргумента *name*. Имя должно быть текстовой строкой.

source: You can modify some of the :class:`TarInfo`’s attributes before you add it using :meth:`addfile`. If the file object is not an ordinary file object positioned at the beginning of the file, attributes such as :attr:`~TarInfo.size` may need modifying. This is the case for objects such as :class:`~gzip.GzipFile`. The :attr:`~TarInfo.name` may also be modified, in which case *arcname* could be a dummy string.
ru: Вы можете изменить некоторые атрибуты :class:`TarInfo` перед его добавлением с помощью :meth:`addfile`. Если файловый объект не является обычным файловым объектом, расположенным в начале файла, возможно, потребуется изменить такие атрибуты, как :attr:`~TarInfo.size`. Это относится к таким объектам, как :class:`~gzip.GzipFile`. :attr:`~TarInfo.name` также может быть изменен, и в этом случае *arcname* может быть фиктивной строкой.

source: Close the :class:`TarFile`. In write mode, two finishing zero blocks are appended to the archive.
ru: Закройте :class:`TarFile`. В режиме записи к архиву добавляются два завершающих нулевых блока.

source: A dictionary containing key-value pairs of pax global headers.
ru: Словарь, содержащий пары ключ-значение глобальных заголовков pax.

source: TarInfo Objects
ru: Объекты TarInfo

source: A :class:`TarInfo` object represents one member in a :class:`TarFile`. Aside from storing all required attributes of a file (like file type, size, time, permissions, owner etc.), it provides some useful methods to determine its type. It does *not* contain the file's data itself.
ru: Объект :class:`TarInfo` представляет один член :class:`TarFile`. Помимо хранения всех необходимых атрибутов файла (например, типа файла, размера, времени, разрешений, владельца и т. д.), он предоставляет несколько полезных методов для определения его типа. Он *не* содержит сами данные файла.

source: :class:`TarInfo` objects are returned by :class:`TarFile`'s methods :meth:`~TarFile.getmember`, :meth:`~TarFile.getmembers` and :meth:`~TarFile.gettarinfo`.
ru: Объекты :class:`TarInfo` возвращаются методами :class:`TarFile` :meth:`~TarFile.getmember`, :meth:`~TarFile.getmembers` и :meth:`~TarFile.gettarinfo`.

source: Modifying the objects returned by :meth:`~TarFile.getmember` or :meth:`~TarFile.getmembers` will affect all subsequent operations on the archive. For cases where this is unwanted, you can use :mod:`copy.copy() <copy>` or call the :meth:`~TarInfo.replace` method to create a modified copy in one step.
ru: Изменение объектов, возвращаемых :meth:`~TarFile.getmember` или :meth:`~TarFile.getmembers`, повлияет на все последующие операции с архивом. В случаях, когда это нежелательно, вы можете использовать :mod:`copy.copy() <copy>` или вызвать метод :meth:`~TarInfo.replace` для создания измененной копии за один шаг.

source: Several attributes can be set to ``None`` to indicate that a piece of metadata is unused or unknown. Different :class:`TarInfo` methods handle ``None`` differently:
ru: Для некоторых атрибутов можно установить значение «Нет», чтобы указать, что часть метаданных не используется или неизвестна. Различные методы :class:`TarInfo` обрабатывают ``None`` по-разному:

source: The :meth:`~TarFile.extract` or :meth:`~TarFile.extractall` methods will ignore the corresponding metadata, leaving it set to a default.
ru: Методы :meth:`~TarFile.extract` или :meth:`~TarFile.extractall` будут игнорировать соответствующие метаданные, оставляя для них значение по умолчанию.

source: :meth:`~TarFile.addfile` will fail.
ru: :meth:`~TarFile.addfile` завершится неудачно.

source: :meth:`~TarFile.list` will print a placeholder string.
ru: :meth:`~TarFile.list` напечатает строку-заполнитель.

source: Create a :class:`TarInfo` object.
ru: Создайте объект :class:`TarInfo`.

source: Create and return a :class:`TarInfo` object from string buffer *buf*.
ru: Создайте и верните объект :class:`TarInfo` из строкового буфера *buf*.

source: Raises :exc:`HeaderError` if the buffer is invalid.
ru: Вызывает :exc:`HeaderError`, если буфер недействителен.

source: Read the next member from the :class:`TarFile` object *tarfile* and return it as a :class:`TarInfo` object.
ru: Считайте следующий член из объекта :class:`TarFile` *tarfile* и верните его как объект :class:`TarInfo`.

source: Create a string buffer from a :class:`TarInfo` object. For information on the arguments see the constructor of the :class:`TarFile` class.
ru: Создайте строковый буфер из объекта :class:`TarInfo`. Информацию об аргументах смотрите в конструкторе класса :class:`TarFile`.

source: A ``TarInfo`` object has the following public data attributes:
ru: Объект TarInfo имеет следующие атрибуты общедоступных данных:

source: Name of the archive member.
ru: Имя члена архива.

source: Size in bytes.
ru: Размер в байтах.

source: Time of last modification in seconds since the :ref:`epoch <epoch>`, as in :attr:`os.stat_result.st_mtime`.
ru: Время последнего изменения в секундах с :ref:`epoch <epoch>`, например :attr:`os.stat_result.st_mtime`.

source: Can be set to ``None`` for :meth:`~TarFile.extract` and :meth:`~TarFile.extractall`, causing extraction to skip applying this attribute.
ru: Может быть установлено значение None для :meth:`~TarFile.extract` и :meth:`~TarFile.extractall`, в результате чего при извлечении пропускается применение этого атрибута.

source: Permission bits, as for :func:`os.chmod`.
ru: Биты разрешения, как для :func:`os.chmod`.

source: File type. *type* is usually one of these constants: :const:`REGTYPE`, :const:`AREGTYPE`, :const:`LNKTYPE`, :const:`SYMTYPE`, :const:`DIRTYPE`, :const:`FIFOTYPE`, :const:`CONTTYPE`, :const:`CHRTYPE`, :const:`BLKTYPE`, :const:`GNUTYPE_SPARSE`. To determine the type of a :class:`TarInfo` object more conveniently, use the ``is*()`` methods below.
ru: Тип файла. *type* обычно является одной из следующих констант: :const:`REGTYPE`, :const:`AREGTYPE`, :const:`LNKTYPE`, :const:`SYMTYPE`, :const:`DIRTYPE`, :const:`FIFOTYPE `, :const:`CONTTYPE`, :const:`CHRTYPE`, :const:`BLKTYPE`, :const:`GNUTYPE_SPARSE`. Чтобы определить тип объекта :class:`TarInfo` для более удобного использования, используйте методы ``is*()`` ниже.

source: Name of the target file name, which is only present in :class:`TarInfo` objects of type :const:`LNKTYPE` and :const:`SYMTYPE`.
ru: Имя целевого файла, которое присутствует только в объектах :class:`TarInfo` типов :const:`LNKTYPE` и :const:`SYMTYPE`.

source: For symbolic links (``SYMTYPE``), the *linkname* is relative to the directory that contains the link. For hard links (``LNKTYPE``), the *linkname* is relative to the root of the archive.
ru: Для символических ссылок (``SYMTYPE``) *linkname* относится к каталогу, в котором содержится ссылка. Для жестких ссылок (``LNKTYPE``) *linkname* относится к корню архива.

source: User ID of the user who originally stored this member.
ru: Идентификатор пользователя, который изначально сохранил этого участника.

source: Group ID of the user who originally stored this member.
ru: Идентификатор группы пользователя, который изначально сохранил этого участника.

source: User name.
ru: Имя пользователя.

source: Group name.
ru: Название группы.

source: Header checksum.
ru: Контрольная сумма заголовка.

source: Device major number.
ru: Основной номер устройства.

source: Device minor number.
ru: Младший номер устройства.

source: The tar header starts here.
ru: Заголовок tar начинается здесь.

source: The file's data starts here.
ru: Данные файла начинаются здесь.

source: Sparse member information.
ru: Скудная информация об участниках.

source: A dictionary containing key-value pairs of an associated pax extended header.
ru: Словарь, содержащий пары ключ-значение связанного расширенного заголовка pax.

source: Return a *new* copy of the :class:`!TarInfo` object with the given attributes changed. For example, to return a ``TarInfo`` with the group name set to ``'staff'``, use::
ru: Вернуть *новую* копию объекта :class:`!TarInfo` с измененными заданными атрибутами. Например, чтобы вернуть TarInfo с именем группы, установленным на «staff», используйте:

source: By default, a deep copy is made. If *deep* is false, the copy is shallow, i.e. ``pax_headers`` and any custom attributes are shared with the original ``TarInfo`` object.
ru: По умолчанию создается глубокая копия. Если *deep* имеет значение false, копия является мелкой, т. е. ``pax_headers`` и любые пользовательские атрибуты используются совместно с исходным объектом ``TarInfo``.

source: A :class:`TarInfo` object also provides some convenient query methods:
ru: Объект :class:`TarInfo` также предоставляет несколько удобных методов запроса:

source: Return :const:`True` if the :class:`TarInfo` object is a regular file.
ru: Верните :const:`True`, если объект :class:`TarInfo` является обычным файлом.

source: Same as :meth:`isfile`.
ru: То же, что и :meth:`isfile`.

source: Return :const:`True` if it is a directory.
ru: Верните :const:`True`, если это каталог.
