Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/tarfile.po
Languages: ru

source: The ancient V7 format. This is the first tar format from Unix Seventh Edition, storing only regular files and directories. Names must not be longer than 100 characters, there is no user/group name information. Some archives have miscalculated header checksums in case of fields with non-ASCII characters.
ru: Древний формат V7. Это первый формат tar седьмого издания Unix, в котором хранятся только обычные файлы и каталоги. Имена не должны быть длиннее 100 символов, информация об имени пользователя/группы отсутствует. В некоторых архивах неправильно рассчитываются контрольные суммы заголовков в случае полей с символами, отличными от ASCII.

source: The SunOS tar extended format. This format is a variant of the POSIX.1-2001 pax format, but is not compatible.
ru: Расширенный формат tar SunOS. Этот формат является вариантом формата pax POSIX.1-2001, но несовместим.

source: Unicode issues
ru: Проблемы с Юникодом

source: The tar format was originally conceived to make backups on tape drives with the main focus on preserving file system information. Nowadays tar archives are commonly used for file distribution and exchanging archives over networks. One problem of the original format (which is the basis of all other formats) is that there is no concept of supporting different character encodings. For example, an ordinary tar archive created on a *UTF-8* system cannot be read correctly on a *Latin-1* system if it contains non-*ASCII* characters. Textual metadata (like filenames, linknames, user/group names) will appear damaged. Unfortunately, there is no way to autodetect the encoding of an archive. The pax format was designed to solve this problem. It stores non-ASCII metadata using the universal character encoding *UTF-8*.
ru: Формат tar изначально был задуман для создания резервных копий на ленточных накопителях с упором на сохранение информации файловой системы. В настоящее время tar-архивы обычно используются для распространения файлов и обмена архивами по сети. Одна из проблем исходного формата (который является основой всех других форматов) заключается в том, что не существует концепции поддержки различных кодировок символов. Например, обычный tar-архив, созданный в системе *UTF-8*, не может быть правильно прочитан в системе *Latin-1*, если он содержит символы, отличные от *ASCII*. Текстовые метаданные (например, имена файлов, имена ссылок, имена пользователей/групп) будут повреждены. К сожалению, нет возможности автоматически определить кодировку архива. Формат pax был разработан для решения этой проблемы. Он хранит метаданные, отличные от ASCII, с использованием универсальной кодировки символов *UTF-8*.

source: The details of character conversion in :mod:`tarfile` are controlled by the *encoding* and *errors* keyword arguments of the :class:`TarFile` class.
ru: Детали преобразования символов в :mod:`tarfile` контролируются ключевыми аргументами *encoding* и *errors* класса :class:`TarFile`.

source: *encoding* defines the character encoding to use for the metadata in the archive. The default value is :func:`sys.getfilesystemencoding` or ``'ascii'`` as a fallback. Depending on whether the archive is read or written, the metadata must be either decoded or encoded. If *encoding* is not set appropriately, this conversion may fail.
ru: *encoding* определяет кодировку символов, которая будет использоваться для метаданных в архиве. Значением по умолчанию является :func:`sys.getfilesystemencoding` или ``'ascii'`` в качестве запасного варианта. В зависимости от того, читается или записывается архив, метаданные должны быть либо декодированы, либо закодированы. Если *кодирование* установлено неправильно, преобразование может завершиться неудачей.

source: The *errors* argument defines how characters are treated that cannot be converted. Possible values are listed in section :ref:`error-handlers`. The default scheme is ``'surrogateescape'`` which Python also uses for its file system calls, see :ref:`os-filenames`.
ru: Аргумент *errors* определяет, как обрабатываются символы, которые невозможно преобразовать. Возможные значения перечислены в разделе :ref:`error-handlers`. Схема по умолчанию — surrogateescape, которую Python также использует для вызовов файловой системы, см. :ref:`os-filenames`.

source: For :const:`PAX_FORMAT` archives (the default), *encoding* is generally not needed because all the metadata is stored using *UTF-8*. *encoding* is only used in the rare cases when binary pax headers are decoded or when strings with surrogate characters are stored.
ru: Для архивов :const:`PAX_FORMAT` (по умолчанию) *кодировка* обычно не требуется, поскольку все метаданные хранятся с использованием *UTF-8*. *encoding* используется только в редких случаях, когда декодируются двоичные заголовки pax или когда сохраняются строки с суррогатными символами.
