Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/tarfile.po
Languages: ru

source: :mod:`!tarfile` --- Read and write tar archive files
ru: :mod:`!tarfile` --- Чтение и запись файлов tar-архива.

source: **Source code:** :source:`Lib/tarfile.py`
ru: **Исходный код:** :source:`Lib/tarfile.py`

source: The :mod:`tarfile` module makes it possible to read and write tar archives, including those using gzip, bz2 and lzma compression. Use the :mod:`zipfile` module to read or write :file:`.zip` files, or the higher-level functions in :ref:`shutil <archiving-operations>`.
ru: Модуль :mod:`tarfile` позволяет читать и записывать tar-архивы, в том числе использующие сжатие gzip, bz2 и lzma. Используйте модуль :mod:`zipfile` для чтения или записи файлов :file:`.zip` или функций более высокого уровня в :ref:`shutil <archiving-operations>`.

source: Some facts and figures:
ru: Немного фактов и цифр:

source: reads and writes :mod:`gzip`, :mod:`bz2` and :mod:`lzma` compressed archives if the respective modules are available.
ru: читает и записывает сжатые архивы :mod:`gzip`, :mod:`bz2` и :mod:`lzma`, если соответствующие модули доступны.

source: read/write support for the POSIX.1-1988 (ustar) format.
ru: поддержка чтения/записи формата POSIX.1-1988 (ustar).

source: read/write support for the GNU tar format including *longname* and *longlink* extensions, read-only support for all variants of the *sparse* extension including restoration of sparse files.
ru: поддержка чтения/записи формата GNU tar, включая расширения *longname* и *longlink*, поддержка только чтения для всех вариантов расширения *sparse*, включая восстановление разреженных файлов.

source: read/write support for the POSIX.1-2001 (pax) format.
ru: поддержка чтения/записи формата POSIX.1-2001 (pax).

source: handles directories, regular files, hardlinks, symbolic links, fifos, character devices and block devices and is able to acquire and restore file information like timestamp, access permissions and owner.
ru: обрабатывает каталоги, обычные файлы, жесткие ссылки, символические ссылки, файлы Fifo, символьные и блочные устройства, а также может получать и восстанавливать информацию о файлах, такую ​​​​как отметка времени, права доступа и владелец.

source: Added support for :mod:`lzma` compression.
ru: Добавлена ​​поддержка сжатия :mod:`lzma`.

source: Archives are extracted using a :ref:`filter <tarfile-extraction-filter>`, which makes it possible to either limit surprising/dangerous features, or to acknowledge that they are expected and the archive is fully trusted. By default, archives are fully trusted, but this default is deprecated and slated to change in Python 3.14.
ru: Архивы извлекаются с помощью :ref:`filter <tarfile-extraction-filter>`, который позволяет либо ограничить неожиданные/опасные функции, либо подтвердить, что они ожидаемы и что архив полностью доверен. По умолчанию архивам полностью доверяют, но это значение по умолчанию устарело и планируется изменить в Python 3.14.

source: Return a :class:`TarFile` object for the pathname *name*. For detailed information on :class:`TarFile` objects and the keyword arguments that are allowed, see :ref:`tarfile-objects`.
ru: Верните объект :class:`TarFile` для пути *name*. Подробную информацию об объектах :class:`TarFile` и допустимых ключевых аргументах см. в разделе :ref:`tarfile-objects`.

source: *mode* has to be a string of the form ``'filemode[:compression]'``, it defaults to ``'r'``. Here is a full list of mode combinations:
ru: *mode* должен быть строкой вида ``'filemode[:compression]'``, по умолчанию это ``'r'``. Вот полный список комбинаций режимов:

source: mode
ru: режим

source: action
ru: действие

source: Open for reading with transparent compression (recommended).
ru: Открыть для чтения с прозрачным сжатием (рекомендуется).

source: Open for reading exclusively without compression.
ru: Открыть для чтения исключительно без сжатия.

source: Open for reading with gzip compression.
ru: Открыть для чтения со сжатием gzip.

source: Open for reading with bzip2 compression.
ru: Открыть для чтения со сжатием bzip2.

source: Open for reading with lzma compression.
ru: Открыть для чтения со сжатием lzma.

source: Create a tarfile exclusively without compression. Raise a :exc:`FileExistsError` exception if it already exists.
ru: Создайте tar-файл исключительно без сжатия. Вызовите исключение :exc:`FileExistsError`, если оно уже существует.

source: Create a tarfile with gzip compression. Raise a :exc:`FileExistsError` exception if it already exists.
ru: Создайте tar-файл со сжатием gzip. Вызовите исключение :exc:`FileExistsError`, если оно уже существует.

source: Create a tarfile with bzip2 compression. Raise a :exc:`FileExistsError` exception if it already exists.
ru: Создайте tar-файл со сжатием bzip2. Вызовите исключение :exc:`FileExistsError`, если оно уже существует.

source: Create a tarfile with lzma compression. Raise a :exc:`FileExistsError` exception if it already exists.
ru: Создайте tar-файл со сжатием lzma. Вызовите исключение :exc:`FileExistsError`, если оно уже существует.

source: Open for appending with no compression. The file is created if it does not exist.
ru: Открыт для добавления без сжатия. Файл создается, если он не существует.

source: Open for uncompressed writing.
ru: Открыт для несжатой записи.

source: Open for gzip compressed writing.
ru: Открыт для записи со сжатием gzip.

source: Open for bzip2 compressed writing.
ru: Открыт для записи со сжатием bzip2.

source: Open for lzma compressed writing.
ru: Открыт для записи сжатых файлов lzma.

source: Note that ``'a:gz'``, ``'a:bz2'`` or ``'a:xz'`` is not possible. If *mode* is not suitable to open a certain (compressed) file for reading, :exc:`ReadError` is raised. Use *mode* ``'r'`` to avoid this. If a compression method is not supported, :exc:`CompressionError` is raised.
ru: Обратите внимание, что ``'a:gz'``, ``'a:bz2'`` или ``'a:xz'`` невозможны. Если *режим* не подходит для открытия определенного (сжатого) файла для чтения, выдается :exc:`ReadError`. Чтобы избежать этого, используйте *mode* ``'r'``. Если метод сжатия не поддерживается, выдается :exc:`CompressionError`.

source: If *fileobj* is specified, it is used as an alternative to a :term:`file object` opened in binary mode for *name*. It is supposed to be at position 0.
ru: Если указан *fileobj*, он используется как альтернатива :term:`объекту файла`, открытому в двоичном режиме для *name*. Он должен быть в положении 0.

source: For modes ``'w:gz'``, ``'x:gz'``, ``'w|gz'``, ``'w:bz2'``, ``'x:bz2'``, ``'w|bz2'``, :func:`tarfile.open` accepts the keyword argument *compresslevel* (default ``9``) to specify the compression level of the file.
ru: Для режимов ``'w:gz'``, ``'x:gz'``, ``'w|gz'``, ``'w:bz2'``, ``'x:bz2'` `, ``'w|bz2'``, :func:`tarfile.open` принимает аргумент ключевого слова *compresslevel* (по умолчанию ``9``), чтобы указать уровень сжатия файла.

source: For modes ``'w:xz'`` and ``'x:xz'``, :func:`tarfile.open` accepts the keyword argument *preset* to specify the compression level of the file.
ru: Для режимов ``'w:xz'`` и ``'x:xz'`` :func:`tarfile.open` принимает аргумент ключевого слова *preset* для указания уровня сжатия файла.

source: For special purposes, there is a second format for *mode*: ``'filemode|[compression]'``. :func:`tarfile.open` will return a :class:`TarFile` object that processes its data as a stream of blocks. No random seeking will be done on the file. If given, *fileobj* may be any object that has a :meth:`~io.RawIOBase.read` or :meth:`~io.RawIOBase.write` method (depending on the *mode*) that works with bytes. *bufsize* specifies the blocksize and defaults to ``20 * 512`` bytes. Use this variant in combination with e.g. ``sys.stdin.buffer``, a socket :term:`file object` or a tape device. However, such a :class:`TarFile` object is limited in that it does not allow random access, see :ref:`tar-examples`. The currently possible modes:
ru: Для особых целей существует второй формат *mode*: ``'filemode|[compression]'``. :func:`tarfile.open` вернет объект :class:`TarFile`, который обрабатывает свои данные как поток блоков. В файле не будет производиться случайный поиск. Если задано, *fileobj* может быть любым объектом, имеющим метод :meth:`~io.RawIOBase.read` или :meth:`~io.RawIOBase.write` (в зависимости от *mode*), который работает с байтами. *bufsize* определяет размер блока и по умолчанию равен ``20 * 512`` байт. Используйте этот вариант в сочетании, например, с ``sys.stdin.buffer``, сокетом :term:`файловым объектом` или ленточным устройством. Однако такой объект :class:`TarFile` ограничен тем, что не допускает произвольного доступа, см. :ref:`tar-examples`. Возможные на данный момент режимы:

source: Mode
ru: Режим

source: Action
ru: Действие

source: Open a *stream* of tar blocks for reading with transparent compression.
ru: Откройте *поток* блоков tar для чтения с прозрачным сжатием.

source: Open a *stream* of uncompressed tar blocks for reading.
ru: Откройте *stream* несжатых блоков tar для чтения.

source: Open a gzip compressed *stream* for reading.
ru: Откройте *stream*, сжатый gzip, для чтения.

source: Open a bzip2 compressed *stream* for reading.
ru: Откройте сжатый *stream* bzip2 для чтения.

source: Open an lzma compressed *stream* for reading.
ru: Откройте *поток*, сжатый lzma, для чтения.

source: Open an uncompressed *stream* for writing.
ru: Откройте несжатый *поток* для записи.

source: Open a gzip compressed *stream* for writing.
ru: Откройте сжатый gzip *поток* для записи.

source: Open a bzip2 compressed *stream* for writing.
ru: Откройте сжатый *поток* bzip2 для записи.

source: Open an lzma compressed *stream* for writing.
ru: Откройте *поток*, сжатый lzma, для записи.

source: The ``'x'`` (exclusive creation) mode was added.
ru: Был добавлен режим ``'x'`` (эксклюзивное создание).

source: The *name* parameter accepts a :term:`path-like object`.
ru: Параметр *name* принимает объект, похожий на путь.

source: The *compresslevel* keyword argument also works for streams.
ru: Аргумент ключевого слова *compresslevel* также работает для потоков.

source: Class for reading and writing tar archives. Do not use this class directly: use :func:`tarfile.open` instead. See :ref:`tarfile-objects`.
ru: Класс для чтения и записи tar-архивов. Не используйте этот класс напрямую: используйте вместо него :func:`tarfile.open`. См. :ref:`tarfile-objects`.

source: Return :const:`True` if *name* is a tar archive file, that the :mod:`tarfile` module can read. *name* may be a :class:`str`, file, or file-like object.
ru: Возвращает :const:`True`, если *name* — это архивный файл tar, который может читать модуль :mod:`tarfile`. *name* может быть :class:`str`, файлом или файловоподобным объектом.

source: Support for file and file-like objects.
ru: Поддержка файлов и файловоподобных объектов.

source: The :mod:`tarfile` module defines the following exceptions:
ru: Модуль :mod:`tarfile` определяет следующие исключения:

source: Base class for all :mod:`tarfile` exceptions.
ru: Базовый класс для всех исключений :mod:`tarfile`.

source: Is raised when a tar archive is opened, that either cannot be handled by the :mod:`tarfile` module or is somehow invalid.
ru: Возникает при открытии tar-архива, который либо не может быть обработан модулем :mod:`tarfile`, либо является каким-то образом недействительным.

source: Is raised when a compression method is not supported or when the data cannot be decoded properly.
ru: Возникает, когда метод сжатия не поддерживается или когда данные не могут быть правильно декодированы.

source: Is raised for the limitations that are typical for stream-like :class:`TarFile` objects.
ru: Возникает из-за ограничений, типичных для потокоподобных объектов :class:`TarFile`.

source: Is raised for *non-fatal* errors when using :meth:`TarFile.extract`, but only if :attr:`TarFile.errorlevel`\ ``== 2``.
ru: Вызывается для *нефатальных* ошибок при использовании :meth:`TarFile.extract`, но только если :attr:`TarFile.errorlevel`\ ``== 2``.

source: Is raised by :meth:`TarInfo.frombuf` if the buffer it gets is invalid.
ru: Вызывается :meth:`TarInfo.frombuf`, если полученный буфер недействителен.

source: Base class for members :ref:`refused <tarfile-extraction-refuse>` by filters.
ru: Базовый класс для членов :ref:`refused <tarfile-extraction-refuse>` по фильтрам.

source: Information about the member that the filter refused to extract, as :ref:`TarInfo <tarinfo-objects>`.
ru: Информация об элементе, который фильтр отказался извлечь, в виде :ref:`TarInfo <tarinfo-objects>`.

source: Raised to refuse extracting a member with an absolute path.
ru: Поднят, чтобы отказаться от извлечения члена с абсолютным путем.

source: Raised to refuse extracting a member outside the destination directory.
ru: Вызывается для отказа в извлечении члена за пределы каталога назначения.

source: Raised to refuse extracting a special file (e.g. a device or pipe).
ru: Вызывается для отказа в извлечении специального файла (например, устройства или канала).

source: Raised to refuse extracting a symbolic link with an absolute path.
ru: Поднят, чтобы отказаться от извлечения символической ссылки с абсолютным путем.

source: Raised to refuse extracting a symbolic link pointing outside the destination directory.
ru: Поднят, чтобы отказаться от извлечения символической ссылки, указывающей за пределы каталога назначения.

source: The following constants are available at the module level:
ru: На уровне модуля доступны следующие константы:

source: The default character encoding: ``'utf-8'`` on Windows, the value returned by :func:`sys.getfilesystemencoding` otherwise.
ru: Кодировка символов по умолчанию: ``'utf-8'`` в Windows, в противном случае значение, возвращаемое :func:`sys.getfilesystemencoding`.

source: A regular file :attr:`~TarInfo.type`.
ru: Обычный файл :attr:`~TarInfo.type`.

source: A link (inside tarfile) :attr:`~TarInfo.type`.
ru: Ссылка (внутри tar-файла):attr:`~TarInfo.type`.

source: A symbolic link :attr:`~TarInfo.type`.
ru: Символическая ссылка :attr:`~TarInfo.type`.

source: A character special device :attr:`~TarInfo.type`.
ru: Специальное символьное устройство :attr:`~TarInfo.type`.

source: A block special device :attr:`~TarInfo.type`.
ru: Специальное блочное устройство :attr:`~TarInfo.type`.

source: A directory :attr:`~TarInfo.type`.
ru: Каталог :attr:`~TarInfo.type`.

source: A FIFO special device :attr:`~TarInfo.type`.
ru: Специальное устройство FIFO :attr:`~TarInfo.type`.

source: A contiguous file :attr:`~TarInfo.type`.
ru: Непрерывный файл :attr:`~TarInfo.type`.

source: A GNU tar longname :attr:`~TarInfo.type`.
ru: Длинное имя GNU tar :attr:`~TarInfo.type`.

source: A GNU tar longlink :attr:`~TarInfo.type`.
ru: Длинная ссылка GNU tar :attr:`~TarInfo.type`.

source: A GNU tar sparse file :attr:`~TarInfo.type`.
ru: Разреженный tar-файл GNU :attr:`~TarInfo.type`.

source: Each of the following constants defines a tar archive format that the :mod:`tarfile` module is able to create. See section :ref:`tar-formats` for details.
ru: Каждая из следующих констант определяет формат tar-архива, который может создать модуль :mod:`tarfile`. Подробности смотрите в разделе :ref:`tar-formats`.

source: POSIX.1-1988 (ustar) format.
ru: Формат POSIX.1-1988 (ustar).

source: GNU tar format.
ru: Формат GNU tar.

source: POSIX.1-2001 (pax) format.
ru: Формат POSIX.1-2001 (pax).

source: The default format for creating archives. This is currently :const:`PAX_FORMAT`.
ru: Формат по умолчанию для создания архивов. В настоящее время это :const:`PAX_FORMAT`.

source: The default format for new archives was changed to :const:`PAX_FORMAT` from :const:`GNU_FORMAT`.
ru: Формат по умолчанию для новых архивов был изменен на :const:`PAX_FORMAT` с :const:`GNU_FORMAT`.

source: Module :mod:`zipfile`
ru: Модуль :mod:`zipfile`

source: Documentation of the :mod:`zipfile` standard module.
ru: Документация стандартного модуля :mod:`zipfile`.

source: Documentation of the higher-level archiving facilities provided by the standard :mod:`shutil` module.
ru: Документация по средствам архивирования более высокого уровня, предоставляемая стандартным модулем :mod:`shutil`.

source: `GNU tar manual, Basic Tar Format <https://www.gnu.org/software/tar/manual/html_node/Standard.html>`_
ru: `Руководство по GNU tar, базовый формат Tar <https://www.gnu.org/software/tar/manual/html_node/Standard.html>`_

source: Documentation for tar archive files, including GNU tar extensions.
ru: Документация для файлов tar-архивов, включая расширения GNU tar.

source: TarFile Objects
ru: Объекты TarFile

source: The :class:`TarFile` object provides an interface to a tar archive. A tar archive is a sequence of blocks. An archive member (a stored file) is made up of a header block followed by data blocks. It is possible to store a file in a tar archive several times. Each archive member is represented by a :class:`TarInfo` object, see :ref:`tarinfo-objects` for details.
ru: Объект :class:`TarFile` предоставляет интерфейс к tar-архиву. Архив tar представляет собой последовательность блоков. Элемент архива (сохраненный файл) состоит из блока заголовка, за которым следуют блоки данных. Файл в tar-архиве можно хранить несколько раз. Каждый элемент архива представлен объектом :class:`TarInfo`, подробности см. в :ref:`tarinfo-objects`.

source: A :class:`TarFile` object can be used as a context manager in a :keyword:`with` statement. It will automatically be closed when the block is completed. Please note that in the event of an exception an archive opened for writing will not be finalized; only the internally used file object will be closed. See the :ref:`tar-examples` section for a use case.
ru: Объект :class:`TarFile` можно использовать в качестве менеджера контекста в операторе :keyword:`with`. Он автоматически закроется, когда блок будет завершен. Обратите внимание, что в случае исключения архив, открытый на запись, не будет финализирован; будет закрыт только внутренний файловый объект. См. пример использования в разделе :ref:`tar-examples`.

source: Added support for the context management protocol.
ru: Добавлена ​​поддержка протокола управления контекстом.

source: All following arguments are optional and can be accessed as instance attributes as well.
ru: Все следующие аргументы являются необязательными и к ним также можно получить доступ как к атрибутам экземпляра.

source: *name* is the pathname of the archive. *name* may be a :term:`path-like object`. It can be omitted if *fileobj* is given. In this case, the file object's :attr:`!name` attribute is used if it exists.
ru: *имя* — путь к архиву. *имя* может быть :term:`объектом, похожим на путь`. Его можно опустить, если задан *fileobj*. В этом случае используется атрибут :attr:`!name` файлового объекта, если он существует.

source: *mode* is either ``'r'`` to read from an existing archive, ``'a'`` to append data to an existing file, ``'w'`` to create a new file overwriting an existing one, or ``'x'`` to create a new file only if it does not already exist.
ru: *mode* — это либо ``'r'`` для чтения из существующего архива, ``'a'`` для добавления данных в существующий файл, ``'w'`` для создания нового файла, перезаписывающего существующий. или ``'x'``, чтобы создать новый файл, только если он еще не существует.

source: If *fileobj* is given, it is used for reading or writing data. If it can be determined, *mode* is overridden by *fileobj*'s mode. *fileobj* will be used from position 0.
ru: Если указан *fileobj*, он используется для чтения или записи данных. Если это можно определить, *mode* переопределяется режимом *fileobj*. *fileobj* будет использоваться с позиции 0.

source: *fileobj* is not closed, when :class:`TarFile` is closed.
ru: *fileobj* не закрывается, когда закрывается :class:`TarFile`.

source: *format* controls the archive format for writing. It must be one of the constants :const:`USTAR_FORMAT`, :const:`GNU_FORMAT` or :const:`PAX_FORMAT` that are defined at module level. When reading, format will be automatically detected, even if different formats are present in a single archive.
ru: *format* управляет форматом архива для записи. Это должна быть одна из констант :const:`USTAR_FORMAT`, :const:`GNU_FORMAT` или :const:`PAX_FORMAT`, определенных на уровне модуля. При чтении формат будет определен автоматически, даже если в одном архиве присутствуют разные форматы.

source: The *tarinfo* argument can be used to replace the default :class:`TarInfo` class with a different one.
ru: Аргумент *tarinfo* можно использовать для замены класса по умолчанию :class:`TarInfo` на другой.

source: If *dereference* is :const:`False`, add symbolic and hard links to the archive. If it is :const:`True`, add the content of the target files to the archive. This has no effect on systems that do not support symbolic links.
ru: Если *разыменование* имеет значение :const:`False`, добавьте в архив символические и жесткие ссылки. Если это :const:`True`, добавьте в архив содержимое целевых файлов. Это не влияет на системы, которые не поддерживают символические ссылки.

source: If *ignore_zeros* is :const:`False`, treat an empty block as the end of the archive. If it is :const:`True`, skip empty (and invalid) blocks and try to get as many members as possible. This is only useful for reading concatenated or damaged archives.
ru: Если *ignore_zeros* имеет значение :const:`False`, пустой блок рассматривается как конец архива. Если это :const:`True`, пропустите пустые (и недействительные) блоки и постарайтесь получить как можно больше членов. Это полезно только для чтения объединенных или поврежденных архивов.

source: *debug* can be set from ``0`` (no debug messages) up to ``3`` (all debug messages). The messages are written to ``sys.stderr``.
ru: *debug* может быть установлен от ``0`` (нет сообщений отладки) до ``3`` (все сообщения отладки). Сообщения записываются в ``sys.stderr``.

source: *errorlevel* controls how extraction errors are handled, see :attr:`the corresponding attribute <TarFile.errorlevel>`.
ru: *errorlevel* контролирует обработку ошибок извлечения, см. :attr:`соответствующий атрибут <TarFile.errorlevel>`.

source: The *encoding* and *errors* arguments define the character encoding to be used for reading or writing the archive and how conversion errors are going to be handled. The default settings will work for most users. See section :ref:`tar-unicode` for in-depth information.
ru: Аргументы *encoding* и *errors* определяют кодировку символов, которая будет использоваться для чтения или записи архива, а также способ обработки ошибок преобразования. Настройки по умолчанию подойдут большинству пользователей. Подробную информацию смотрите в разделе :ref:`tar-unicode`.

source: The *pax_headers* argument is an optional dictionary of strings which will be added as a pax global header if *format* is :const:`PAX_FORMAT`.
ru: Аргумент *pax_headers* — это необязательный словарь строк, который будет добавлен в качестве глобального заголовка pax, если *format* равен :const:`PAX_FORMAT`.

source: If *stream* is set to :const:`True` then while reading the archive info about files in the archive are not cached, saving memory.
ru: Если для *stream* установлено значение :const:`True`, то при чтении архива информация о файлах в архиве не кэшируется, экономя память.

source: Use ``'surrogateescape'`` as the default for the *errors* argument.
ru: Используйте ``'surrogateescape'`` в качестве значения по умолчанию для аргумента *errors*.

source: Add the *stream* parameter.
ru: Добавьте параметр *stream*.

source: Alternative constructor. The :func:`tarfile.open` function is actually a shortcut to this classmethod.
ru: Альтернативный конструктор. Функция :func:`tarfile.open` на самом деле является ярлыком этого метода класса.
