Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/tarfile.po
Languages: ru

source: Return :const:`True` if it is a symbolic link.
ru: Верните :const:`True`, если это символическая ссылка.

source: Return :const:`True` if it is a hard link.
ru: Верните :const:`True`, если это жесткая ссылка.

source: Return :const:`True` if it is a character device.
ru: Верните :const:`True`, если это символьное устройство.

source: Return :const:`True` if it is a block device.
ru: Верните :const:`True`, если это блочное устройство.

source: Return :const:`True` if it is a FIFO.
ru: Верните :const:`True`, если это FIFO.

source: Return :const:`True` if it is one of character device, block device or FIFO.
ru: Возвращает :const:`True`, если это одно из символьных устройств, блочных устройств или FIFO.

source: Extraction filters
ru: Фильтры для извлечения

source: The *tar* format is designed to capture all details of a UNIX-like filesystem, which makes it very powerful. Unfortunately, the features make it easy to create tar files that have unintended -- and possibly malicious -- effects when extracted. For example, extracting a tar file can overwrite arbitrary files in various ways (e.g. by using absolute paths, ``..`` path components, or symlinks that affect later members).
ru: Формат *tar* предназначен для сбора всех деталей UNIX-подобной файловой системы, что делает его очень мощным. К сожалению, эти функции позволяют легко создавать tar-файлы, которые при извлечении имеют непреднамеренные и, возможно, вредоносные последствия. Например, извлечение tar-файла может перезаписать произвольные файлы различными способами (например, с использованием абсолютных путей, компонентов пути ``..`` или символических ссылок, которые влияют на последующие элементы).

source: In most cases, the full functionality is not needed. Therefore, *tarfile* supports extraction filters: a mechanism to limit functionality, and thus mitigate some of the security issues.
ru: В большинстве случаев полный функционал не нужен. Таким образом, *tarfile* поддерживает фильтры извлечения: механизм ограничения функциональности и, таким образом, смягчения некоторых проблем безопасности.

source: Contains further motivation and rationale behind the design.
ru: Содержит дополнительную мотивацию и обоснование дизайна.

source: The *filter* argument to :meth:`TarFile.extract` or :meth:`~TarFile.extractall` can be:
ru: Аргумент *filter* для :meth:`TarFile.extract` или :meth:`~TarFile.extractall` может быть:

source: the string ``'fully_trusted'``: Honor all metadata as specified in the archive. Should be used if the user trusts the archive completely, or implements their own complex verification.
ru: строка ``'fully_trusted'``: учитывайте все метаданные, указанные в архиве. Следует использовать, если пользователь полностью доверяет архиву или реализует собственную сложную проверку.

source: the string ``'tar'``: Honor most *tar*-specific features (i.e. features of UNIX-like filesystems), but block features that are very likely to be surprising or malicious. See :func:`tar_filter` for details.
ru: строка ``'tar'``: учитывайте большинство функций, специфичных для *tar* (т.е. функций UNIX-подобных файловых систем), но блокируйте функции, которые могут оказаться неожиданными или вредоносными. Подробности смотрите в :func:`tar_filter`.

source: the string ``'data'``: Ignore or block most features specific to UNIX-like filesystems. Intended for extracting cross-platform data archives. See :func:`data_filter` for details.
ru: строка ``'data'``: игнорировать или блокировать большинство функций, специфичных для UNIX-подобных файловых систем. Предназначен для извлечения кроссплатформенных архивов данных. Подробности смотрите в :func:`data_filter`.

source: ``None`` (default): Use :attr:`TarFile.extraction_filter`.
ru: ``Нет`` (по умолчанию): используйте :attr:`TarFile.extraction_filter`.

source: If that is also ``None`` (the default), raise a ``DeprecationWarning``, and fall back to the ``'fully_trusted'`` filter, whose dangerous behavior matches previous versions of Python.
ru: Если это также «None» (по умолчанию), вызовите «DeprecationWarning» и вернитесь к фильтру «fully_trusted», чье опасное поведение соответствует предыдущим версиям Python.

source: In Python 3.14, the ``'data'`` filter will become the default instead. It's possible to switch earlier; see :attr:`TarFile.extraction_filter`.
ru: В Python 3.14 фильтр данных станет фильтром по умолчанию. Возможно переключение раньше; см. :attr:`TarFile.extraction_filter`.

source: A callable which will be called for each extracted member with a :ref:`TarInfo <tarinfo-objects>` describing the member and the destination path to where the archive is extracted (i.e. the same path is used for all members)::
ru: Вызываемый объект, который будет вызываться для каждого извлеченного элемента с :ref:`TarInfo <tarinfo-objects>`, описывающим элемент и путь назначения, куда извлекается архив (т.е. один и тот же путь используется для всех членов)::

source: The callable is called just before each member is extracted, so it can take the current state of the disk into account. It can:
ru: Вызываемый объект вызывается непосредственно перед извлечением каждого члена, поэтому он может учитывать текущее состояние диска. Он может:

source: return a :class:`TarInfo` object which will be used instead of the metadata in the archive, or
ru: вернуть объект :class:`TarInfo`, который будет использоваться вместо метаданных в архиве, или

source: return ``None``, in which case the member will be skipped, or
ru: верните ``None``, и в этом случае элемент будет пропущен, или

source: raise an exception to abort the operation or skip the member, depending on :attr:`~TarFile.errorlevel`. Note that when extraction is aborted, :meth:`~TarFile.extractall` may leave the archive partially extracted. It does not attempt to clean up.
ru: вызвать исключение, чтобы прервать операцию или пропустить элемент, в зависимости от :attr:`~TarFile.errorlevel`. Обратите внимание, что при прерывании извлечения :meth:`~TarFile.extractall` может оставить архив частично извлеченным. Он не пытается очистить.

source: Default named filters
ru: Именованные фильтры по умолчанию

source: The pre-defined, named filters are available as functions, so they can be reused in custom filters:
ru: Предопределенные именованные фильтры доступны как функции, поэтому их можно повторно использовать в пользовательских фильтрах:

source: Return *member* unchanged.
ru: Вернуть *member* без изменений.

source: This implements the ``'fully_trusted'`` filter.
ru: Это реализует фильтр «полностью_доверенный».

source: Implements the ``'tar'`` filter.
ru: Реализует фильтр ``'tar'``.

source: Strip leading slashes (``/`` and :data:`os.sep`) from filenames.
ru: Удалите начальные косые черты (``/`` и :data:`os.sep`) из имен файлов.

source: :ref:`Refuse <tarfile-extraction-refuse>` to extract files with absolute paths (in case the name is absolute even after stripping slashes, e.g. ``C:/foo`` on Windows). This raises :class:`~tarfile.AbsolutePathError`.
ru: :ref:`Refuse <tarfile-extraction-refuse>` для извлечения файлов с абсолютными путями (в случае, если имя является абсолютным даже после удаления косых черт, например ``C:/foo`` в Windows). Это вызывает :class:`~tarfile.AbsolutePathError`.

source: :ref:`Refuse <tarfile-extraction-refuse>` to extract files whose absolute path (after following symlinks) would end up outside the destination. This raises :class:`~tarfile.OutsideDestinationError`.
ru: :ref:`Refuse <tarfile-extraction-refuse>` для извлечения файлов, абсолютный путь которых (после перехода по символическим ссылкам) окажется за пределами места назначения. Это вызывает :class:`~tarfile.OutsideDestinationError`.

source: Clear high mode bits (setuid, setgid, sticky) and group/other write bits (:const:`~stat.S_IWGRP` | :const:`~stat.S_IWOTH`).
ru: Очистить биты верхнего режима (setuid, setgid, Sticky) и биты группы/других записей (:const:`~stat.S_IWGRP` | :const:`~stat.S_IWOTH`).

source: Return the modified ``TarInfo`` member.
ru: Верните измененный член TarInfo.

source: Implements the ``'data'`` filter. In addition to what ``tar_filter`` does:
ru: Реализует фильтр данных. В дополнение к тому, что делает tar_filter:

source: :ref:`Refuse <tarfile-extraction-refuse>` to extract links (hard or soft) that link to absolute paths, or ones that link outside the destination.
ru: :ref:`Refuse <tarfile-extraction-refuse>` для извлечения ссылок (жестких или программных), которые ссылаются на абсолютные пути или ссылки за пределами места назначения.

source: This raises :class:`~tarfile.AbsoluteLinkError` or :class:`~tarfile.LinkOutsideDestinationError`.
ru: Это вызывает :class:`~tarfile.AbsoluteLinkError` или :class:`~tarfile.LinkOutsideDestinationError`.

source: Note that such files are refused even on platforms that do not support symbolic links.
ru: Обратите внимание, что такие файлы отклоняются даже на платформах, не поддерживающих символические ссылки.

source: :ref:`Refuse <tarfile-extraction-refuse>` to extract device files (including pipes). This raises :class:`~tarfile.SpecialFileError`.
ru: :ref:`Refuse <tarfile-extraction-refuse>` для извлечения файлов устройства (включая каналы). Это вызывает :class:`~tarfile.SpecialFileError`.

source: For regular files, including hard links:
ru: Для обычных файлов, включая жесткие ссылки:

source: Set the owner read and write permissions (:const:`~stat.S_IRUSR` | :const:`~stat.S_IWUSR`).
ru: Установите права владельца на чтение и запись (:const:`~stat.S_IRUSR` | :const:`~stat.S_IWUSR`).

source: Remove the group & other executable permission (:const:`~stat.S_IXGRP` | :const:`~stat.S_IXOTH`) if the owner doesn’t have it (:const:`~stat.S_IXUSR`).
ru: Удалите группу и другие разрешения на исполняемый файл (:const:`~stat.S_IXGRP` | :const:`~stat.S_IXOTH`), если у владельца их нет (:const:`~stat.S_IXUSR`).

source: For other files (directories), set ``mode`` to ``None``, so that extraction methods skip applying permission bits.
ru: Для других файлов (каталогов) установите для параметра mode значение None, чтобы методы извлечения пропускали применение битов разрешений.

source: Set user and group info (``uid``, ``gid``, ``uname``, ``gname``) to ``None``, so that extraction methods skip setting it.
ru: Установите для информации о пользователе и группе (``uid``, ``gid``, ``uname``, ``gname``) значение ``None``, чтобы методы извлечения пропустили ее установку.

source: Filter errors
ru: Ошибки фильтрации

source: When a filter refuses to extract a file, it will raise an appropriate exception, a subclass of :class:`~tarfile.FilterError`. This will abort the extraction if :attr:`TarFile.errorlevel` is 1 or more. With ``errorlevel=0`` the error will be logged and the member will be skipped, but extraction will continue.
ru: Когда фильтр отказывается извлечь файл, он выдает соответствующее исключение, подкласс :class:`~tarfile.FilterError`. Это прервет извлечение, если :attr:`TarFile.errorlevel` равен 1 или более. При ``errorlevel=0`` ошибка будет зарегистрирована, и элемент будет пропущен, но извлечение продолжится.

source: Hints for further verification
ru: Советы для дальнейшей проверки

source: Even with ``filter='data'``, *tarfile* is not suited for extracting untrusted files without prior inspection. Among other issues, the pre-defined filters do not prevent denial-of-service attacks. Users should do additional checks.
ru: Даже с ``filter='data'`` *tarfile* не подходит для извлечения ненадежных файлов без предварительной проверки. Помимо прочего, предопределенные фильтры не предотвращают атаки типа «отказ в обслуживании». Пользователям следует выполнить дополнительные проверки.

source: Here is an incomplete list of things to consider:
ru: Вот неполный список вещей, на которые стоит обратить внимание:

source: Extract to a :func:`new temporary directory <tempfile.mkdtemp>` to prevent e.g. exploiting pre-existing links, and to make it easier to clean up after a failed extraction.
ru: Извлеките файлы в :func:`новый временный каталог <tempfile.mkdtemp>`, чтобы предотвратить, например, использование уже существующих ссылок и облегчить очистку после неудачного извлечения.

source: When working with untrusted data, use external (e.g. OS-level) limits on disk, memory and CPU usage.
ru: При работе с ненадежными данными используйте внешние (например, на уровне ОС) ограничения на использование диска, памяти и ЦП.

source: Check filenames against an allow-list of characters (to filter out control characters, confusables, foreign path separators, etc.).
ru: Проверьте имена файлов на соответствие списку разрешенных символов (чтобы отфильтровать управляющие символы, сбивающие с толку символы, внешние разделители путей и т. д.).

source: Check that filenames have expected extensions (discouraging files that execute when you “click on them”, or extension-less files like Windows special device names).
ru: Убедитесь, что имена файлов имеют ожидаемые расширения (не рекомендуется использовать файлы, которые выполняются при нажатии на них, или файлы без расширений, такие как имена специальных устройств Windows).

source: Limit the number of extracted files, total size of extracted data, filename length (including symlink length), and size of individual files.
ru: Ограничьте количество извлеченных файлов, общий размер извлеченных данных, длину имени файла (включая длину символической ссылки) и размер отдельных файлов.

source: Check for files that would be shadowed on case-insensitive filesystems.
ru: Проверьте наличие файлов, которые будут дублироваться в файловых системах, нечувствительных к регистру.

source: Also note that:
ru: Также обратите внимание, что:

source: Tar files may contain multiple versions of the same file. Later ones are expected to overwrite any earlier ones. This feature is crucial to allow updating tape archives, but can be abused maliciously.
ru: Файлы Tar могут содержать несколько версий одного и того же файла. Ожидается, что более поздние записи перезапишут более ранние. Эта функция имеет решающее значение для обновления ленточных архивов, но ею можно злоупотреблять.

source: *tarfile* does not protect against issues with “live” data, e.g. an attacker tinkering with the destination (or source) directory while extraction (or archiving) is in progress.
ru: *tarfile* не защищает от проблем с «живыми» данными, например, если злоумышленник изменяет целевой (или исходный) каталог во время извлечения (или архивирования).

source: Supporting older Python versions
ru: Поддержка старых версий Python

source: Extraction filters were added to Python 3.12, but may be backported to older versions as security updates. To check whether the feature is available, use e.g. ``hasattr(tarfile, 'data_filter')`` rather than checking the Python version.
ru: Фильтры извлечения были добавлены в Python 3.12, но их можно перенести в более старые версии в качестве обновлений безопасности. Чтобы проверить, доступна ли эта функция, используйте, например, ``hasattr(tarfile, 'data_filter')`` вместо проверки версии Python.

source: The following examples show how to support Python versions with and without the feature. Note that setting ``extraction_filter`` will affect any subsequent operations.
ru: В следующих примерах показано, как поддерживать версии Python с этой функцией и без нее. Обратите внимание, что установка «extraction_filter» повлияет на любые последующие операции.

source: Fully trusted archive::
ru: Полностью доверенный архив::

source: Use the ``'data'`` filter if available, but revert to Python 3.11 behavior (``'fully_trusted'``) if this feature is not available::
ru: Используйте фильтр ``'data'``, если он доступен, но вернитесь к поведению Python 3.11 (``'full_trusted'``), если эта функция недоступна:

source: Use the ``'data'`` filter; *fail* if it is not available::
ru: Используйте фильтр ``'данные'``; *fail*, если он недоступен::

source: or::
ru: или::

source: Use the ``'data'`` filter; *warn* if it is not available::
ru: Используйте фильтр ``'данные'``; *предупреждать*, если он недоступен::

source: Stateful extraction filter example
ru: Пример фильтра извлечения с отслеживанием состояния

source: While *tarfile*'s extraction methods take a simple *filter* callable, custom filters may be more complex objects with an internal state. It may be useful to write these as context managers, to be used like this::
ru: В то время как методы извлечения *tarfile* используют простой вызываемый *filter*, пользовательские фильтры могут представлять собой более сложные объекты с внутренним состоянием. Может быть полезно написать их как менеджеры контекста, чтобы использовать их следующим образом:

source: Such a filter can be written as, for example::
ru: Такой фильтр можно записать, например, так::

source: Command-Line Interface
ru: Интерфейс командной строки

source: The :mod:`tarfile` module provides a simple command-line interface to interact with tar archives.
ru: Модуль :mod:`tarfile` предоставляет простой интерфейс командной строки для взаимодействия с tar-архивами.

source: If you want to create a new tar archive, specify its name after the :option:`-c` option and then list the filename(s) that should be included:
ru: Если вы хотите создать новый tar-архив, укажите его имя после опции :option:`-c`, а затем перечислите имена файлов, которые следует включить:

source: Passing a directory is also acceptable:
ru: Передача каталога также приемлема:

source: If you want to extract a tar archive into the current directory, use the :option:`-e` option:
ru: Если вы хотите извлечь tar-архив в текущий каталог, используйте опцию :option:`-e`:

source: You can also extract a tar archive into a different directory by passing the directory's name:
ru: Вы также можете извлечь tar-архив в другой каталог, передав имя каталога:

source: For a list of the files in a tar archive, use the :option:`-l` option:
ru: Для получения списка файлов в tar-архиве используйте опцию :option:`-l`:

source: Command-line options
ru: Параметры командной строки

source: List files in a tarfile.
ru: Список файлов в tarfile.

source: Create tarfile from source files.
ru: Создайте tar-файл из исходных файлов.

source: Extract tarfile into the current directory if *output_dir* is not specified.
ru: Извлеките tarfile в текущий каталог, если *output_dir* не указан.

source: Test whether the tarfile is valid or not.
ru: Проверьте, действителен ли tar-файл.

source: Verbose output.
ru: Подробный вывод.

source: Specifies the *filter* for ``--extract``. See :ref:`tarfile-extraction-filter` for details. Only string names are accepted (that is, ``fully_trusted``, ``tar``, and ``data``).
ru: Указывает *фильтр* для ``--extract``. Подробности смотрите в :ref:`tarfile-extraction-filter`. Принимаются только строковые имена (т. е. «fully_trusted», «tar» и «data»).

source: Examples
ru: Примеры

source: How to extract an entire tar archive to the current working directory::
ru: Как извлечь весь tar-архив в текущий рабочий каталог::

source: How to extract a subset of a tar archive with :meth:`TarFile.extractall` using a generator function instead of a list::
ru: Как извлечь подмножество tar-архива с помощью :meth:`TarFile.extractall`, используя функцию генератора вместо списка::

source: How to create an uncompressed tar archive from a list of filenames::
ru: Как создать несжатый tar-архив из списка имен файлов::

source: The same example using the :keyword:`with` statement::
ru: Тот же пример с использованием оператора :keyword:`with`::

source: How to read a gzip compressed tar archive and display some member information::
ru: Как прочитать сжатый tar-архив gzip и отобразить некоторую информацию об участниках::

source: How to create an archive and reset the user information using the *filter* parameter in :meth:`TarFile.add`::
ru: Как создать архив и сбросить информацию о пользователе с помощью параметра *filter* в :meth:`TarFile.add`::

source: Supported tar formats
ru: Поддерживаемые форматы tar

source: There are three tar formats that can be created with the :mod:`tarfile` module:
ru: С помощью модуля :mod:`tarfile` можно создать три формата tar:

source: The POSIX.1-1988 ustar format (:const:`USTAR_FORMAT`). It supports filenames up to a length of at best 256 characters and linknames up to 100 characters. The maximum file size is 8 GiB. This is an old and limited but widely supported format.
ru: Формат ustar POSIX.1-1988 (:const:`USTAR_FORMAT`). Он поддерживает имена файлов длиной не более 256 символов и имена ссылок длиной до 100 символов. Максимальный размер файла — 8 ГиБ. Это старый и ограниченный, но широко поддерживаемый формат.

source: The GNU tar format (:const:`GNU_FORMAT`). It supports long filenames and linknames, files bigger than 8 GiB and sparse files. It is the de facto standard on GNU/Linux systems. :mod:`tarfile` fully supports the GNU tar extensions for long names, sparse file support is read-only.
ru: Формат GNU tar (:const:`GNU_FORMAT`). Он поддерживает длинные имена файлов и имена ссылок, файлы размером более 8 ГиБ и разреженные файлы. Это стандарт де-факто для систем GNU/Linux. :mod:`tarfile` полностью поддерживает расширения GNU tar для длинных имен, поддержка разреженных файлов доступна только для чтения.

source: The POSIX.1-2001 pax format (:const:`PAX_FORMAT`). It is the most flexible format with virtually no limits. It supports long filenames and linknames, large files and stores pathnames in a portable way. Modern tar implementations, including GNU tar, bsdtar/libarchive and star, fully support extended *pax* features; some old or unmaintained libraries may not, but should treat *pax* archives as if they were in the universally supported *ustar* format. It is the current default format for new archives.
ru: Формат pax POSIX.1-2001 (:const:`PAX_FORMAT`). Это самый гибкий формат практически без ограничений. Он поддерживает длинные имена файлов и имена ссылок, большие файлы и переносимые пути к файлам. Современные реализации tar, включая GNU tar, bsdtar/libarchive и star, полностью поддерживают расширенные функции *pax*; некоторые старые или неподдерживаемые библиотеки могут этого не делать, но должны обрабатывать архивы *pax* так, как если бы они были в универсально поддерживаемом формате *ustar*. Это текущий формат по умолчанию для новых архивов.

source: It extends the existing *ustar* format with extra headers for information that cannot be stored otherwise. There are two flavours of pax headers: Extended headers only affect the subsequent file header, global headers are valid for the complete archive and affect all following files. All the data in a pax header is encoded in *UTF-8* for portability reasons.
ru: Он расширяет существующий формат *ustar* дополнительными заголовками для информации, которую иначе невозможно сохранить. Существует два типа заголовков pax: расширенные заголовки влияют только на последующий заголовок файла, глобальные заголовки действительны для всего архива и влияют на все последующие файлы. Все данные в заголовке pax кодируются в *UTF-8* из соображений переносимости.

source: There are some more variants of the tar format which can be read, but not created:
ru: Есть еще несколько вариантов формата tar, которые можно прочитать, но нельзя создать:
