Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/timeit.po
Languages: ru

source: :mod:`!timeit` --- Measure execution time of small code snippets
ru: :mod:`!timeit` --- Измерение времени выполнения небольших фрагментов кода

source: **Source code:** :source:`Lib/timeit.py`
ru: **Исходный код:** :source:`Lib/timeit.py`**Исходный код:** :source:`Lib/timeit.py`

source: This module provides a simple way to time small bits of Python code. It has both a :ref:`timeit-command-line-interface` as well as a :ref:`callable <python-interface>` one. It avoids a number of common traps for measuring execution times. See also Tim Peters' introduction to the "Algorithms" chapter in the second edition of *Python Cookbook*, published by O'Reilly.
ru: Этот модуль предоставляет простой способ синхронизировать небольшие фрагменты кода Python. Он имеет как :ref:`timeit-command-line-interface`, так и :ref:`callable <python-interface>`. Это позволяет избежать ряда распространенных ловушек при измерении времени выполнения. См. также введение Тима Питерса к главе «Алгоритмы» во втором издании *Python Cookbook*, опубликованном O'Reilly.

source: Basic Examples
ru: Основные примеры

source: The following example shows how the :ref:`timeit-command-line-interface` can be used to compare three different expressions:
ru: В следующем примере показано, как можно использовать :ref:`timeit-command-line-interface` для сравнения трёх разных выражений:

source: This can be achieved from the :ref:`python-interface` with::
ru: Этого можно добиться из :ref:`python-interface` с помощью::

source: A callable can also be passed from the :ref:`python-interface`::
ru: Вызываемый объект также можно передать из :ref:`python-interface`::

source: Note however that :func:`.timeit` will automatically determine the number of repetitions only when the command-line interface is used. In the :ref:`timeit-examples` section you can find more advanced examples.
ru: Однако обратите внимание, что :func:`.timeit` автоматически определит количество повторений только при использовании интерфейса командной строки. В разделе :ref:`timeit-examples` вы можете найти более сложные примеры.

source: Python Interface
ru: Интерфейс Python

source: The module defines three convenience functions and a public class:
ru: Модуль определяет три удобные функции и публичный класс:

source: Create a :class:`Timer` instance with the given statement, *setup* code and *timer* function and run its :meth:`.timeit` method with *number* executions. The optional *globals* argument specifies a namespace in which to execute the code.
ru: Создайте экземпляр :class:`Timer` с заданным оператором, *кодом настройки* и функцией *timer* и запустите его метод :meth:`.timeit` с *количеством* выполнений. Необязательный аргумент *globals* указывает пространство имен, в котором будет выполняться код.

source: The optional *globals* parameter was added.
ru: Был добавлен необязательный параметр *globals*.

source: Create a :class:`Timer` instance with the given statement, *setup* code and *timer* function and run its :meth:`.repeat` method with the given *repeat* count and *number* executions. The optional *globals* argument specifies a namespace in which to execute the code.
ru: Создайте экземпляр :class:`Timer` с заданным оператором, кодом *setup* и функцией *timer* и запустите его метод :meth:`.repeat` с заданным числом *повторений* и *количеством* выполнений. Необязательный аргумент *globals* указывает пространство имен, в котором будет выполняться код.

source: Default value of *repeat* changed from 3 to 5.
ru: Значение по умолчанию *repeat* изменено с 3 на 5.

source: The default timer, which is always time.perf_counter(), returns float seconds. An alternative, time.perf_counter_ns, returns integer nanoseconds.
ru: Таймер по умолчанию, которым всегда является time.perf_counter(), возвращает секунды с плавающей запятой. Альтернативный вариант, time.perf_counter_ns, возвращает целые наносекунды.

source: :func:`time.perf_counter` is now the default timer.
ru: :func:`time.perf_counter` теперь является таймером по умолчанию.

source: Class for timing execution speed of small code snippets.
ru: Класс для определения скорости выполнения небольших фрагментов кода.

source: The constructor takes a statement to be timed, an additional statement used for setup, and a timer function. Both statements default to ``'pass'``; the timer function is platform-dependent (see the module doc string). *stmt* and *setup* may also contain multiple statements separated by ``;`` or newlines, as long as they don't contain multi-line string literals. The statement will by default be executed within timeit's namespace; this behavior can be controlled by passing a namespace to *globals*.
ru: Конструктор принимает оператор для синхронизации, дополнительный оператор, используемый для настройки, и функцию таймера. Оба оператора по умолчанию имеют значение ``'pass'``; функция таймера зависит от платформы (см. строку документации модуля). *stmt* и *setup* также могут содержать несколько операторов, разделенных ``;`` или символами новой строки, если они не содержат многострочных строковых литералов. По умолчанию оператор будет выполнен в пространстве имен timeit; этим поведением можно управлять, передав пространство имен в *globals*.

source: To measure the execution time of the first statement, use the :meth:`.timeit` method. The :meth:`.repeat` and :meth:`.autorange` methods are convenience methods to call :meth:`.timeit` multiple times.
ru: Чтобы измерить время выполнения первого оператора, используйте метод :meth:`.timeit`. Методы :meth:`.repeat` и :meth:`.autorange` представляют собой удобные методы для многократного вызова :meth:`.timeit`.

source: The execution time of *setup* is excluded from the overall timed execution run.
ru: Время выполнения *setup* исключается из общего времени выполнения.

source: The *stmt* and *setup* parameters can also take objects that are callable without arguments. This will embed calls to them in a timer function that will then be executed by :meth:`.timeit`. Note that the timing overhead is a little larger in this case because of the extra function calls.
ru: Параметры *stmt* и *setup* также могут принимать объекты, которые можно вызывать без аргументов. Это встроит их вызовы в функцию таймера, которая затем будет выполнена :meth:`.timeit`. Обратите внимание, что в этом случае затраты времени немного больше из-за дополнительных вызовов функций.

source: Time *number* executions of the main statement. This executes the setup statement once, and then returns the time it takes to execute the main statement a number of times. The default timer returns seconds as a float. The argument is the number of times through the loop, defaulting to one million. The main statement, the setup statement and the timer function to be used are passed to the constructor.
ru: Время *число* выполнения основного оператора. Это выполняет оператор настройки один раз, а затем возвращает время, необходимое для выполнения основного оператора несколько раз. Таймер по умолчанию возвращает секунды в виде числа с плавающей запятой. Аргументом является количество проходов цикла, по умолчанию равное одному миллиону. Основной оператор, оператор настройки и используемая функция таймера передаются конструктору.

source: By default, :meth:`.timeit` temporarily turns off :term:`garbage collection` during the timing. The advantage of this approach is that it makes independent timings more comparable. The disadvantage is that GC may be an important component of the performance of the function being measured. If so, GC can be re-enabled as the first statement in the *setup* string. For example::
ru: По умолчанию :meth:`.timeit` временно отключает :term:`сборку мусора` во время отсчета времени. Преимущество этого подхода в том, что он делает независимые тайминги более сопоставимыми. Недостаток заключается в том, что GC может быть важным компонентом производительности измеряемой функции. Если это так, GC можно снова включить в качестве первого оператора в строке *setup*. Например::

source: Automatically determine how many times to call :meth:`.timeit`.
ru: Автоматически определять, сколько раз вызывать :meth:`.timeit`.

source: This is a convenience function that calls :meth:`.timeit` repeatedly so that the total time >= 0.2 second, returning the eventual (number of loops, time taken for that number of loops). It calls :meth:`.timeit` with increasing numbers from the sequence 1, 2, 5, 10, 20, 50, ... until the time taken is at least 0.2 seconds.
ru: Это удобная функция, которая неоднократно вызывает :meth:`.timeit`, чтобы общее время >= 0,2 секунды, возвращая итоговое значение (количество циклов, время, затраченное на это количество циклов). Он вызывает :meth:`.timeit` с возрастанием чисел из последовательности 1, 2, 5, 10, 20, 50, ... до тех пор, пока затраченное время не станет хотя бы 0,2 секунды.

source: If *callback* is given and is not ``None``, it will be called after each trial with two arguments: ``callback(number, time_taken)``.
ru: Если указан *callback*, а не None, он будет вызываться после каждого испытания с двумя аргументами: ``callback(number, time_taken)``.

source: Call :meth:`.timeit` a few times.
ru: Вызовите :meth:`.timeit` несколько раз.

source: This is a convenience function that calls the :meth:`.timeit` repeatedly, returning a list of results. The first argument specifies how many times to call :meth:`.timeit`. The second argument specifies the *number* argument for :meth:`.timeit`.
ru: Это удобная функция, которая неоднократно вызывает :meth:`.timeit`, возвращая список результатов. Первый аргумент указывает, сколько раз вызывать :meth:`.timeit`. Второй аргумент указывает аргумент *number* для :meth:`.timeit`.

source: It's tempting to calculate mean and standard deviation from the result vector and report these. However, this is not very useful. In a typical case, the lowest value gives a lower bound for how fast your machine can run the given code snippet; higher values in the result vector are typically not caused by variability in Python's speed, but by other processes interfering with your timing accuracy. So the :func:`min` of the result is probably the only number you should be interested in. After that, you should look at the entire vector and apply common sense rather than statistics.
ru: Соблазнительно вычислить среднее и стандартное отклонение вектора результатов и сообщить об этом. Однако это не очень полезно. В типичном случае наименьшее значение дает нижнюю границу того, насколько быстро ваша машина может выполнить данный фрагмент кода; более высокие значения в векторе результатов обычно вызваны не изменчивостью скорости Python, а другими процессами, влияющими на точность синхронизации. Таким образом, :func:`min` результата, вероятно, единственное число, которое вас должно интересовать. После этого вам следует посмотреть на весь вектор и применить здравый смысл, а не статистику.

source: Helper to print a traceback from the timed code.
ru: Помощник для печати обратной трассировки из синхронизированного кода.

source: Typical use::
ru: Типичное применение::

source: The advantage over the standard traceback is that source lines in the compiled template will be displayed. The optional *file* argument directs where the traceback is sent; it defaults to :data:`sys.stderr`.
ru: Преимущество перед стандартной трассировкой заключается в том, что строки исходного кода в скомпилированном шаблоне будут отображаться. Необязательный аргумент *file* указывает, куда отправляется обратная трассировка; по умолчанию это :data:`sys.stderr`.

source: Command-Line Interface
ru: Интерфейс командной строки

source: When called as a program from the command line, the following form is used::
ru: При вызове программы из командной строки используется следующая форма:

source: Where the following options are understood:
ru: Где понимаются следующие варианты:

source: how many times to execute 'statement'
ru: сколько раз выполнить «оператор»

source: how many times to repeat the timer (default 5)
ru: сколько раз повторять таймер (по умолчанию 5)

source: statement to be executed once initially (default ``pass``)
ru: оператор, который будет выполнен один раз изначально (по умолчанию ``pass``)

source: measure process time, not wallclock time, using :func:`time.process_time` instead of :func:`time.perf_counter`, which is the default
ru: измеряйте время процесса, а не время настенных часов, используя :func:`time.process_time` вместо :func:`time.perf_counter`, который используется по умолчанию.

source: specify a time unit for timer output; can select ``nsec``, ``usec``, ``msec``, or ``sec``
ru: указать единицу времени для вывода таймера; можно выбрать ``nsec``, ``usec``, ``msec`` или ``sec``

source: print raw timing results; repeat for more digits precision
ru: распечатать необработанные результаты синхронизации; повторите для большей точности цифр

source: print a short usage message and exit
ru: распечатайте короткое сообщение об использовании и выйдите

source: A multi-line statement may be given by specifying each line as a separate statement argument; indented lines are possible by enclosing an argument in quotes and using leading spaces. Multiple :option:`-s` options are treated similarly.
ru: Многострочный оператор может быть задан путем указания каждой строки в качестве отдельного аргумента оператора; строки с отступом возможны, если заключить аргумент в кавычки и использовать начальные пробелы. Несколько опций :option:`-s` обрабатываются аналогично.

source: If :option:`-n` is not given, a suitable number of loops is calculated by trying increasing numbers from the sequence 1, 2, 5, 10, 20, 50, ... until the total time is at least 0.2 seconds.
ru: Если :option:`-n` не указан, подходящее количество циклов рассчитывается путем увеличения чисел из последовательности 1, 2, 5, 10, 20, 50,... до тех пор, пока общее время не составит хотя бы 0,2 секунды. .

source: :func:`default_timer` measurements can be affected by other programs running on the same machine, so the best thing to do when accurate timing is necessary is to repeat the timing a few times and use the best time. The :option:`-r` option is good for this; the default of 5 repetitions is probably enough in most cases. You can use :func:`time.process_time` to measure CPU time.
ru: На измерения :func:`default_timer` могут влиять другие программы, работающие на том же компьютере, поэтому лучшее, что можно сделать, когда необходимо точное время, — это повторить время несколько раз и использовать лучшее время. Для этого подойдет опция :option:`-r`; 5 повторений по умолчанию, вероятно, будет достаточно в большинстве случаев. Вы можете использовать :func:`time.process_time` для измерения времени процессора.

source: There is a certain baseline overhead associated with executing a pass statement. The code here doesn't try to hide it, but you should be aware of it. The baseline overhead can be measured by invoking the program without arguments, and it might differ between Python versions.
ru: Существуют определенные базовые накладные расходы, связанные с выполнением оператора pass. Код здесь не пытается это скрыть, но вы должны об этом знать. Базовые издержки можно измерить, вызвав программу без аргументов, и они могут различаться в зависимости от версии Python.

source: Examples
ru: Примеры

source: It is possible to provide a setup statement that is executed only once at the beginning:
ru: Можно предоставить оператор установки, который вначале выполняется только один раз:

source: In the output, there are three fields. The loop count, which tells you how many times the statement body was run per timing loop repetition. The repetition count ('best of 5') which tells you how many times the timing loop was repeated, and finally the time the statement body took on average within the best repetition of the timing loop. That is, the time the fastest repetition took divided by the loop count.
ru: В выводе есть три поля. Счетчик циклов, показывающий, сколько раз тело оператора выполнялось за одно повторение цикла синхронизации. Счетчик повторений («лучший из 5»), который показывает, сколько раз повторялся цикл синхронизации, и, наконец, время, которое в среднем заняло тело оператора в пределах лучшего повторения цикла синхронизации. То есть время, затраченное на самое быстрое повторение, деленное на количество циклов.

source: The same can be done using the :class:`Timer` class and its methods::
ru: То же самое можно сделать, используя класс :class:`Timer` и его методы::

source: The following examples show how to time expressions that contain multiple lines. Here we compare the cost of using :func:`hasattr` vs. :keyword:`try`/:keyword:`except` to test for missing and present object attributes:
ru: В следующих примерах показано, как синхронизировать выражения, содержащие несколько строк. Здесь мы сравниваем стоимость использования :func:`hasattr` и :keyword:`try`/:keyword:`Exception` для проверки отсутствующих и присутствующих атрибутов объекта:

source: To give the :mod:`timeit` module access to functions you define, you can pass a *setup* parameter which contains an import statement::
ru: Чтобы предоставить модулю :mod:`timeit` доступ к определяемым вами функциям, вы можете передать параметр *setup*, который содержит оператор импорта::

source: Another option is to pass :func:`globals` to the *globals* parameter, which will cause the code to be executed within your current global namespace. This can be more convenient than individually specifying imports::
ru: Другой вариант — передать :func:`globals` в параметр *globals*, что приведет к выполнению кода в вашем текущем глобальном пространстве имен. Это может быть удобнее, чем индивидуальное указание импорта:

source: Benchmarking
ru: Бенчмаркинг

source: Performance
ru: Производительность
