Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/tkinter.ttk.po
Languages: ru

source: Sequence of string or float values. If specified, the increment/decrement buttons will cycle through the items in this sequence rather than incrementing or decrementing numbers.
ru: Последовательность строковых или плавающих значений. Если указано, кнопки увеличения/уменьшения будут циклически перебирать элементы в этой последовательности, а не увеличивать или уменьшать числа.

source: wrap
ru: обернуть

source: Boolean value. If ``True``, increment and decrement buttons will cycle from the ``to`` value to the ``from`` value or the ``from`` value to the ``to`` value, respectively.
ru: Логическое значение. Если ``True``, кнопки увеличения и уменьшения будут циклически переходить от значения ``to`` к значению ``from`` или от значения ``from`` к значению ``to`` соответственно.

source: format
ru: формат

source: String value. This specifies the format of numbers set by the increment/decrement buttons. It must be in the form "%W.Pf", where W is the padded width of the value, P is the precision, and '%' and 'f' are literal.
ru: Строковое значение. Определяет формат чисел, устанавливаемый кнопками увеличения/уменьшения. Оно должно быть в форме «%W.Pf», где W — это дополненная ширина значения, P — точность, а «%» и «f» — буквальные.

source: command
ru: команда

source: Python callable. Will be called with no arguments whenever either of the increment or decrement buttons are pressed.
ru: Вызываемый Python. Будет вызываться без аргументов при каждом нажатии кнопок увеличения или уменьшения.

source: The spinbox widget generates an **<<Increment>>** virtual event when the user presses <Up>, and a **<<Decrement>>** virtual event when the user presses <Down>.
ru: Виджет счетчика генерирует виртуальное событие **<<Increment>>**, когда пользователь нажимает <Вверх>, и виртуальное событие **<<Decrement>>**, когда пользователь нажимает <Вниз>.

source: Returns the current value of the spinbox.
ru: Возвращает текущее значение счетчика.

source: Sets the value of the spinbox to *value*.
ru: Устанавливает значение счетчика в *value*.

source: Notebook
ru: Блокнот

source: Ttk Notebook widget manages a collection of windows and displays a single one at a time. Each child window is associated with a tab, which the user may select to change the currently displayed window.
ru: Виджет Ttk Notebook управляет коллекцией окон и отображает по одному за раз. Каждое дочернее окно связано с вкладкой, которую пользователь может выбрать, чтобы изменить отображаемое в данный момент окно.

source: If present and greater than zero, specifies the desired height of the pane area (not including internal padding or tabs). Otherwise, the maximum height of all panes is used.
ru: Если присутствует и больше нуля, указывает желаемую высоту области панели (не включая внутренние поля и вкладки). В противном случае используется максимальная высота всех панелей.

source: Specifies the amount of extra space to add around the outside of the notebook. The padding is a list up to four length specifications left top right bottom. If fewer than four elements are specified, bottom defaults to top, right defaults to left, and top defaults to left.
ru: Определяет объем дополнительного пространства, которое необходимо добавить снаружи записной книжки. Заполнение представляет собой список до четырех спецификаций длины слева вверху справа внизу. Если указано менее четырех элементов, нижний уровень по умолчанию — верхний, правый — левый, а верхний — левый.

source: If present and greater than zero, specified the desired width of the pane area (not including internal padding). Otherwise, the maximum width of all panes is used.
ru: Если присутствует и больше нуля, указывается желаемая ширина области панели (не включая внутренние отступы). В противном случае используется максимальная ширина всех панелей.

source: Tab Options
ru: Параметры вкладки

source: There are also specific options for tabs:
ru: Также есть специальные варианты вкладок:

source: Either "normal", "disabled" or "hidden". If "disabled", then the tab is not selectable. If "hidden", then the tab is not shown.
ru: Либо «обычный», «отключенный» или «скрытый». Если «отключено», то вкладка недоступна для выбора. Если «скрыто», то вкладка не отображается.

source: sticky
ru: липкий

source: Specifies how the child window is positioned within the pane area. Value is a string containing zero or more of the characters "n", "s", "e" or "w". Each letter refers to a side (north, south, east or west) that the child window will stick to, as per the :meth:`grid` geometry manager.
ru: Указывает, как дочернее окно позиционируется в области панели. Значение — это строка, содержащая ноль или более символов «n», «s», «e» или «w». Каждая буква относится к стороне (север, юг, восток или запад), которой будет придерживаться дочернее окно, в соответствии с менеджером геометрии :meth:`grid`.

source: Specifies the amount of extra space to add between the notebook and this pane. Syntax is the same as for the option padding used by this widget.
ru: Указывает объем дополнительного пространства, добавляемого между записной книжкой и этой панелью. Синтаксис такой же, как и для заполнения опций, используемого этим виджетом.

source: Specifies a text to be displayed in the tab.
ru: Указывает текст, который будет отображаться на вкладке.

source: Specifies an image to display in the tab. See the option image described in :class:`Widget`.
ru: Указывает изображение для отображения на вкладке. См. изображение опции, описанное в :class:`Widget`.

source: Specifies how to display the image relative to the text, in the case both options text and image are present. See `Label Options`_ for legal values.
ru: Указывает, как отображать изображение относительно текста, в случае, если присутствуют как текст, так и изображение. См. `Параметры метки`_ для получения допустимых значений.

source: Specifies the index (0-based) of a character to underline in the text string. The underlined character is used for mnemonic activation if :meth:`Notebook.enable_traversal` is called.
ru: Указывает индекс (отсчитываемый от 0) символа, который необходимо подчеркнуть в текстовой строке. Подчеркнутый символ используется для мнемонической активации, если вызывается :meth:`Notebook.enable_traversal`.

source: Tab Identifiers
ru: Идентификаторы вкладок

source: The tab_id present in several methods of :class:`ttk.Notebook` may take any of the following forms:
ru: Tab_id, присутствующий в нескольких методах :class:`ttk.Notebook`, может принимать любую из следующих форм:

source: An integer between zero and the number of tabs
ru: Целое число между нулем и количеством вкладок

source: The name of a child window
ru: Имя дочернего окна

source: A positional specification of the form "@x,y", which identifies the tab
ru: Позиционная спецификация формы «@x,y», идентифицирующая вкладку.

source: The literal string "current", which identifies the currently selected tab
ru: Литеральная строка «текущий», которая идентифицирует выбранную в данный момент вкладку.

source: The literal string "end", which returns the number of tabs (only valid for :meth:`Notebook.index`)
ru: Литеральная строка «end», которая возвращает количество вкладок (действительно только для :meth:`Notebook.index`)

source: Virtual Events
ru: Виртуальные события

source: This widget generates a **<<NotebookTabChanged>>** virtual event after a new tab is selected.
ru: Этот виджет генерирует **< >** виртуальное событие после выбора новой вкладки.

source: Adds a new tab to the notebook.
ru: Добавляет новую вкладку в блокнот.

source: If window is currently managed by the notebook but hidden, it is restored to its previous position.
ru: Если окно в настоящее время управляется блокнотом, но скрыто, оно восстанавливается в предыдущее положение.

source: See `Tab Options`_ for the list of available options.
ru: Список доступных опций см. в разделе «Параметры вкладки».

source: Removes the tab specified by *tab_id*, unmaps and unmanages the associated window.
ru: Удаляет вкладку, указанную *tab_id*, отменяет сопоставление и отменяет управление связанным окном.

source: Hides the tab specified by *tab_id*.
ru: Скрывает вкладку, указанную *tab_id*.

source: The tab will not be displayed, but the associated window remains managed by the notebook and its configuration remembered. Hidden tabs may be restored with the :meth:`add` command.
ru: Вкладка не будет отображаться, но связанное с ней окно останется управляемым записной книжкой, и его конфигурация будет сохранена. Скрытые вкладки можно восстановить с помощью команды :meth:`add`.

source: Returns the name of the tab element at position *x*, *y*, or the empty string if none.
ru: Возвращает имя элемента табуляции в позиции *x*, *y* или пустую строку, если ее нет.

source: Returns the numeric index of the tab specified by *tab_id*, or the total number of tabs if *tab_id* is the string "end".
ru: Возвращает числовой индекс вкладки, указанной *tab_id*, или общее количество вкладок, если *tab_id* — это строка «конец».

source: Inserts a pane at the specified position.
ru: Вставляет панель в указанную позицию.

source: *pos* is either the string "end", an integer index, or the name of a managed child. If *child* is already managed by the notebook, moves it to the specified position.
ru: *pos* — это строка «конец», целочисленный индекс или имя управляемого дочернего элемента. Если *child* уже управляется блокнотом, перемещает его в указанную позицию.

source: Selects the specified *tab_id*.
ru: Выбирает указанный *tab_id*.

source: The associated child window will be displayed, and the previously selected window (if different) is unmapped. If *tab_id* is omitted, returns the widget name of the currently selected pane.
ru: Соответствующее дочернее окно будет отображено, а ранее выбранное окно (если оно отличается) будет отменено. Если *tab_id* опущен, возвращается имя виджета выбранной в данный момент панели.

source: Query or modify the options of the specific *tab_id*.
ru: Запросите или измените параметры определенного *tab_id*.

source: If *kw* is not given, returns a dictionary of the tab option values. If *option* is specified, returns the value of that *option*. Otherwise, sets the options to the corresponding values.
ru: Если *kw* не указано, возвращает словарь значений параметров табуляции. Если указана *опция*, возвращается значение этой *опции*. В противном случае для параметров устанавливаются соответствующие значения.

source: Returns a list of windows managed by the notebook.
ru: Возвращает список окон, управляемых блокнотом.

source: Enable keyboard traversal for a toplevel window containing this notebook.
ru: Включите обход клавиатуры для окна верхнего уровня, содержащего этот блокнот.

source: This will extend the bindings for the toplevel window containing the notebook as follows:
ru: Это расширит привязки для окна верхнего уровня, содержащего блокнот, следующим образом:

source: :kbd:`Control-Tab`: selects the tab following the currently selected one.
ru: :kbd:`Control-Tab`: выбирает вкладку, следующую за выбранной в данный момент.

source: :kbd:`Shift-Control-Tab`: selects the tab preceding the currently selected one.
ru: :kbd:`Shift-Control-Tab`: выбирает вкладку, предшествующую выбранной в данный момент.

source: :kbd:`Alt-K`: where *K* is the mnemonic (underlined) character of any tab, will select that tab.
ru: :kbd:`Alt-K`: где *K* — мнемонический (подчеркнутый) символ любой вкладки, выберет эту вкладку.

source: Multiple notebooks in a single toplevel may be enabled for traversal, including nested notebooks. However, notebook traversal only works properly if all panes have the notebook they are in as master.
ru: Для обхода можно включить несколько блокнотов на одном верхнем уровне, включая вложенные блокноты. Однако обход записной книжки работает правильно только в том случае, если на всех панелях записная книжка, в которой они находятся, является главной.

source: Progressbar
ru: Индикатор прогресса

source: The :class:`ttk.Progressbar` widget shows the status of a long-running operation. It can operate in two modes: 1) the determinate mode which shows the amount completed relative to the total amount of work to be done and 2) the indeterminate mode which provides an animated display to let the user know that work is progressing.
ru: The :class:`ttk.Progressbar` виджет показывает статус длительной операции. Он может работать в двух режимах: 1) определенный режим, который показывает выполненный объем относительно общего объема работы, которую необходимо выполнить, и 2) неопределенный режим, который обеспечивает анимированный дисплей, информирующий пользователя о ходе работы.

source: orient
ru: ориентироваться

source: One of "horizontal" or "vertical". Specifies the orientation of the progress bar.
ru: Один из «горизонтальных» или «вертикальных». Определяет ориентацию индикатора выполнения.

source: length
ru: длина

source: Specifies the length of the long axis of the progress bar (width if horizontal, height if vertical).
ru: Указывает длину длинной оси индикатора выполнения (ширина, если горизонтально, высота, если вертикально).

source: mode
ru: режим

source: One of "determinate" or "indeterminate".
ru: Один из «определенных» или «неопределенных».

source: maximum
ru: максимальный

source: A number specifying the maximum value. Defaults to 100.
ru: Число, определяющее максимальное значение. По умолчанию 100.

source: value
ru: значение

source: The current value of the progress bar. In "determinate" mode, this represents the amount of work completed. In "indeterminate" mode, it is interpreted as modulo *maximum*; that is, the progress bar completes one "cycle" when its value increases by *maximum*.
ru: Текущее значение индикатора выполнения. В «определенном» режиме это представляет собой объем выполненной работы. В «неопределенном» режиме он интерпретируется как модуль *максимум*; то есть индикатор выполнения завершает один «цикл», когда его значение увеличивается на *максимум*.

source: variable
ru: переменная

source: A name which is linked to the option value. If specified, the value of the progress bar is automatically set to the value of this name whenever the latter is modified.
ru: Имя, связанное со значением параметра. Если указано, значение индикатора выполнения автоматически устанавливается на значение этого имени при каждом его изменении.

source: phase
ru: фаза

source: Read-only option. The widget periodically increments the value of this option whenever its value is greater than 0 and, in determinate mode, less than maximum. This option may be used by the current theme to provide additional animation effects.
ru: Опция только для чтения. Виджет периодически увеличивает значение этой опции всякий раз, когда ее значение больше 0 и, в детерминированном режиме, меньше максимального. Эта опция может использоваться текущей темой для предоставления дополнительных эффектов анимации.

source: Begin autoincrement mode: schedules a recurring timer event that calls :meth:`Progressbar.step` every *interval* milliseconds. If omitted, *interval* defaults to 50 milliseconds.
ru: Начать режим автоинкремента: планирует повторяющееся событие таймера, которое вызывает :meth:`Progressbar.step` каждые *интервал* миллисекунд. Если этот параметр опущен, *интервал* по умолчанию равен 50 миллисекундам.

source: Increments the progress bar's value by *amount*.
ru: Увеличивает значение индикатора выполнения на *количество*.

source: *amount* defaults to 1.0 if omitted.
ru: *сумма* по умолчанию равна 1,0, если опущено.

source: Stop autoincrement mode: cancels any recurring timer event initiated by :meth:`Progressbar.start` for this progress bar.
ru: Остановить режим автоинкремента: отменяет любое повторяющееся событие таймера, инициированное :meth:`Progressbar.start` для этого индикатора выполнения.

source: Separator
ru: Сепаратор

source: The :class:`ttk.Separator` widget displays a horizontal or vertical separator bar.
ru: Виджет :class:`ttk.Separator` отображает горизонтальную или вертикальную разделительную полосу.

source: It has no other methods besides the ones inherited from :class:`ttk.Widget`.
ru: У него нет других методов, кроме унаследованных от :class:`ttk.Widget`.

source: This widget accepts the following specific option:
ru: Этот виджет принимает следующую конкретную опцию:

source: One of "horizontal" or "vertical". Specifies the orientation of the separator.
ru: Один из «горизонтальных» или «вертикальных». Указывает ориентацию разделителя.

source: The :class:`ttk.Sizegrip` widget (also known as a grow box) allows the user to resize the containing toplevel window by pressing and dragging the grip.
ru: Виджет :class:`ttk.Sizegrip` (также известный как поле увеличения) позволяет пользователю изменять размер содержащего его окна верхнего уровня, нажимая и перетаскивая ручку.

source: This widget has neither specific options nor specific methods, besides the ones inherited from :class:`ttk.Widget`.
ru: Этот виджет не имеет ни особых опций, ни конкретных методов, кроме унаследованных от :class:`ttk.Widget`.

source: Platform-specific notes
ru: Примечания для конкретной платформы

source: On macOS, toplevel windows automatically include a built-in size grip by default. Adding a :class:`Sizegrip` is harmless, since the built-in grip will just mask the widget.
ru: В macOS окна верхнего уровня по умолчанию автоматически включают встроенную регулировку размера. Добавление :class:`Sizegrip` безвредно, поскольку встроенная ручка просто замаскирует виджет.

source: Bugs
ru: Баги

source: If the containing toplevel's position was specified relative to the right or bottom of the screen (e.g. ....), the :class:`Sizegrip` widget will not resize the window.
ru: Если позиция содержащего верхнего уровня была указана относительно правой или нижней части экрана (например, ....), виджет :class:`Sizegrip` не будет изменять размер окна.

source: This widget supports only "southeast" resizing.
ru: Этот виджет поддерживает только изменение размера «на юго-восток».

source: The :class:`ttk.Treeview` widget displays a hierarchical collection of items. Each item has a textual label, an optional image, and an optional list of data values. The data values are displayed in successive columns after the tree label.
ru: Виджет :class:`ttk.Treeview` отображает иерархическую коллекцию элементов. Каждый элемент имеет текстовую метку, необязательное изображение и необязательный список значений данных. Значения данных отображаются в последовательных столбцах после метки дерева.

source: The order in which data values are displayed may be controlled by setting the widget option ``displaycolumns``. The tree widget can also display column headings. Columns may be accessed by number or symbolic names listed in the widget option columns. See `Column Identifiers`_.
ru: Порядок отображения значений данных можно контролировать, установив опцию виджета displaycolumns. Виджет дерева также может отображать заголовки столбцов. Доступ к столбцам можно получить по номерам или символическим именам, указанным в столбцах параметров виджета. См. `Идентификаторы столбцов`_.

source: Each item is identified by a unique name. The widget will generate item IDs if they are not supplied by the caller. There is a distinguished root item, named ``{}``. The root item itself is not displayed; its children appear at the top level of the hierarchy.
ru: Каждый элемент идентифицируется уникальным именем. Виджет будет генерировать идентификаторы элементов, если они не предоставлены вызывающей стороной. Существует выделенный корневой элемент с именем ``{}``. Сам корневой элемент не отображается; его дочерние элементы появляются на верхнем уровне иерархии.

source: Each item also has a list of tags, which can be used to associate event bindings with individual items and control the appearance of the item.
ru: Каждый элемент также имеет список тегов, которые можно использовать для связывания привязок событий с отдельными элементами и управления внешним видом элемента.

source: The Treeview widget supports horizontal and vertical scrolling, according to the options described in `Scrollable Widget Options`_ and the methods :meth:`Treeview.xview` and :meth:`Treeview.yview`.
ru: Виджет Treeview поддерживает горизонтальную и вертикальную прокрутку в соответствии с параметрами, описанными в разделе «Параметры прокручиваемого виджета» и методами :meth:`Treeview.xview` и :meth:`Treeview.yview`.

source: columns
ru: колонки

source: A list of column identifiers, specifying the number of columns and their names.
ru: Список идентификаторов столбцов с указанием количества столбцов и их имен.

source: A list of column identifiers (either symbolic or integer indices) specifying which data columns are displayed and the order in which they appear, or the string "#all".
ru: Список идентификаторов столбцов (символических или целочисленных индексов), определяющих, какие столбцы данных отображаются и порядок их появления, или строка «#all».

source: Specifies the number of rows which should be visible. Note: the requested width is determined from the sum of the column widths.
ru: Указывает количество строк, которые должны быть видимы. Примечание. Запрошенная ширина определяется из суммы ширин столбцов.

source: Specifies the internal padding for the widget. The padding is a list of up to four length specifications.
ru: Определяет внутреннее дополнение для виджета. Заполнение представляет собой список, содержащий до четырех спецификаций длины.

source: Controls how the built-in class bindings manage the selection. One of "extended", "browse" or "none". If set to "extended" (the default), multiple items may be selected. If "browse", only a single item will be selected at a time. If "none", the selection will not be changed.
ru: Управляет тем, как встроенные привязки классов управляют выбором. Один из вариантов «расширенный», «просмотр» или «нет». Если установлено значение «расширенный» (по умолчанию), можно выбрать несколько элементов. В режиме «Обзор» одновременно будет выбран только один элемент. Если «нет», выбор не будет изменен.

source: Note that the application code and tag bindings can set the selection however they wish, regardless of the value of this option.
ru: Обратите внимание, что код приложения и привязки тегов могут устанавливать выбор по своему усмотрению, независимо от значения этой опции.

source: A list containing zero or more of the following values, specifying which elements of the tree to display.
ru: Список, содержащий ноль или более следующих значений, определяющий, какие элементы дерева отображать.

source: tree: display tree labels in column #0.
ru: дерево: отображать метки дерева в столбце №0.

source: headings: display the heading row.
ru: headings: отображение строки заголовка.

source: The default is "tree headings", i.e., show all elements.
ru: По умолчанию используются «заголовки деревьев», т. е. отображаются все элементы.

source: **Note**: Column #0 always refers to the tree column, even if show="tree" is not specified.
ru: **Примечание**. Столбец №0 всегда относится к столбцу дерева, даже если не указано значение show="tree".

source: Item Options
ru: Параметры элемента

source: The following item options may be specified for items in the insert and item widget commands.
ru: Следующие параметры элемента могут быть указаны для элементов в командах виджета вставки и элемента.

source: The textual label to display for the item.
ru: Текстовая метка, отображаемая для элемента.

source: A Tk Image, displayed to the left of the label.
ru: Изображение Tk, отображаемое слева от метки.

source: The list of values associated with the item.
ru: Список значений, связанных с элементом.
