Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/tkinter.ttk.po
Languages: ru

source: If "image" is used, *args* should contain the default image name followed by statespec/value pairs (this is the imagespec), and *kw* may have the following options:
ru: Если используется «image», *args* должен содержать имя изображения по умолчанию, за которым следуют пары спецификация состояния/значение (это спецификация изображения), а *kw* может иметь следующие параметры:

source: padding is a list of up to four integers, specifying the left, top, right, and bottom borders, respectively.
ru: padding— это список из четырех целых чисел, определяющих левую, верхнюю, правую и нижнюю границы соответственно.

source: Specifies a minimum height for the element. If less than zero, the base image's height is used as a default.
ru: Указывает минимальную высоту элемента. Если меньше нуля, высота базового изображения используется по умолчанию.

source: Specifies the element's interior padding. Defaults to border's value if not specified.
ru: Определяет внутреннее отступы элемента. По умолчанию используется значение границы, если оно не указано.

source: Specifies how the image is placed within the final parcel. spec contains zero or more characters "n", "s", "w", or "e".
ru: Указывает, как изображение помещается в конечный участок. спецификация содержит ноль или более символов «n», «s», «w» или «e».

source: Specifies a minimum width for the element. If less than zero, the base image's width is used as a default.
ru: Указывает минимальную ширину элемента. Если меньше нуля, ширина базового изображения используется по умолчанию.

source: Example::
ru: Пример::

source: If "from" is used as the value of *etype*, :meth:`element_create` will clone an existing element. *args* is expected to contain a themename, from which the element will be cloned, and optionally an element to clone from. If this element to clone from is not specified, an empty element will be used. *kw* is discarded.
ru: Если в качестве значения *etype* используется «from», :meth:`element_create` клонирует существующий элемент. Ожидается, что *args* будет содержать имя темы, из которой будет клонирован элемент, и, возможно, элемент для клонирования. Если элемент для клонирования не указан, будет использоваться пустой элемент. *kw* отбрасывается.

source: If "vsapi" is used as the value of *etype*, :meth:`element_create` will create a new element in the current theme whose visual appearance is drawn using the Microsoft Visual Styles API which is responsible for the themed styles on Windows XP and Vista. *args* is expected to contain the Visual Styles class and part as given in the Microsoft documentation followed by an optional sequence of tuples of ttk states and the corresponding Visual Styles API state value. *kw* may have the following options:
ru: Если в качестве значения *etype* используется «vsapi», :meth:`element_create` создаст новый элемент в текущей теме, внешний вид которого отрисовывается с использованием Microsoft Visual Styles API, который отвечает за тематические стили в Windows XP. и Виста. Ожидается, что *args* будет содержать класс и часть Visual Styles, как указано в документации Microsoft, за которыми следует необязательная последовательность кортежей состояний ttk и соответствующее значение состояния Visual Styles API. *kw* может иметь следующие параметры:

source: Specify the element's interior padding. *padding* is a list of up to four integers specifying the left, top, right and bottom padding quantities respectively. If fewer than four elements are specified, bottom defaults to top, right defaults to left, and top defaults to left. In other words, a list of three numbers specify the left, vertical, and right padding; a list of two numbers specify the horizontal and the vertical padding; a single number specifies the same padding all the way around the widget. This option may not be mixed with any other options.
ru: Укажите внутреннее отступы элемента. *padding* — это список из четырех целых чисел, определяющих количество заполнения слева, сверху, справа и снизу соответственно. Если указано менее четырех элементов, нижний уровень по умолчанию — верхний, правый — левый, а верхний — левый. Другими словами, список из трех чисел определяет левое, вертикальное и правое заполнение; список из двух чисел определяет горизонтальное и вертикальное заполнение; одно число определяет одинаковое дополнение по всему виджету. Эту опцию нельзя смешивать с другими опциями.

source: Specifies the elements exterior padding. *padding* is a list of up to four integers specifying the left, top, right and bottom padding quantities respectively. This option may not be mixed with any other options.
ru: Определяет внешние отступы элементов. *padding* — это список из четырех целых чисел, определяющих количество заполнения слева, сверху, справа и снизу соответственно. Эту опцию нельзя смешивать с другими опциями.

source: Specifies the width for the element. If this option is set then the Visual Styles API will not be queried for the recommended size or the part. If this option is set then *height* should also be set. The *width* and *height* options cannot be mixed with the *padding* or *margins* options.
ru: Определяет ширину элемента. Если этот параметр установлен, API визуальных стилей не будет запрашивать рекомендуемый размер или часть. Если эта опция установлена, то также должна быть установлена ​​*высота*. Параметры *ширина* и *высота* нельзя смешивать с параметрами *padding* или *margins*.

source: Specifies the height of the element. See the comments for *width*.
ru: Определяет высоту элемента. См. комментарии к *ширине*.

source: Added support of the "vsapi" element factory.
ru: Добавлена ​​поддержка фабрики элементов «vsapi».

source: Returns the list of elements defined in the current theme.
ru: Возвращает список элементов, определенных в текущей теме.

source: Returns the list of *elementname*'s options.
ru: Возвращает список параметров *имя_элемента*.

source: Create a new theme.
ru: Создайте новую тему.

source: It is an error if *themename* already exists. If *parent* is specified, the new theme will inherit styles, elements and layouts from the parent theme. If *settings* are present they are expected to have the same syntax used for :meth:`theme_settings`.
ru: Это ошибка, если *themename* уже существует. Если указан *parent*, новая тема унаследует стили, элементы и макеты от родительской темы. Если присутствуют *settings*, ожидается, что они будут иметь тот же синтаксис, что и :meth:`theme_settings`.

source: Temporarily sets the current theme to *themename*, apply specified *settings* and then restore the previous theme.
ru: Временно устанавливает текущую тему на *themename*, применяет указанные *настройки*, а затем восстанавливает предыдущую тему.

source: Each key in *settings* is a style and each value may contain the keys 'configure', 'map', 'layout' and 'element create' and they are expected to have the same format as specified by the methods :meth:`Style.configure`, :meth:`Style.map`, :meth:`Style.layout` and :meth:`Style.element_create` respectively.
ru: Каждый ключ в *settings* является стилем, и каждое значение может содержать ключи «configure», «map», «layout» и «element create», и ожидается, что они будут иметь тот же формат, который указан в методах :meth:` Style.configure`, :meth:`Style.map`, :meth:`Style.layout` и :meth:`Style.element_create` соответственно.

source: As an example, let's change the Combobox for the default theme a bit::
ru: В качестве примера давайте немного изменим Combobox для темы по умолчанию:

source: Returns a list of all known themes.
ru: Возвращает список всех известных тем.

source: If *themename* is not given, returns the theme in use. Otherwise, sets the current theme to *themename*, refreshes all widgets and emits a <<ThemeChanged>> event.
ru: Если *themename* не указано, возвращает используемую тему. В противном случае текущая тема устанавливается на *themename*, обновляются все виджеты и генерируется событие <<ThemeChanged>>.

source: Layouts
ru: Макеты

source: A layout can be just ``None``, if it takes no options, or a dict of options specifying how to arrange the element. The layout mechanism uses a simplified version of the pack geometry manager: given an initial cavity, each element is allocated a parcel.
ru: Макет может быть просто «Нет», если он не принимает никаких параметров, или набором параметров, определяющих, как расположить элемент. Механизм компоновки использует упрощенную версию менеджера геометрии пакета: учитывая начальную полость, каждому элементу выделяется участок.

source: *side*: whichside
ru: *side*: с какой стороны

source: Specifies which side of the cavity to place the element; one of top, right, bottom or left. If omitted, the element occupies the entire cavity.
ru: Указывает, на какой стороне полости разместить элемент; один из верхнего, правого, нижнего или левого. Если этот параметр опущен, элемент занимает всю полость.

source: Specifies where the element is placed inside its allocated parcel.
ru: Указывает, где элемент размещается внутри выделенного ему участка.

source: If set to 1, causes the element and all of its descendants to be treated as a single element for the purposes of :meth:`Widget.identify` et al. It's used for things like scrollbar thumbs with grips.
ru: Если установлено значение 1, элемент и все его потомки будут рассматриваться как один элемент для целей :meth:`Widget.identify` и др. Он используется для таких вещей, как большие пальцы полосы прокрутки с ручками.

source: Specifies a list of elements to place inside the element. Each element is a tuple (or other sequence type) where the first item is the layout name, and the other is a `Layout`_.
ru: Указывает список элементов для размещения внутри элемента. Каждый элемент представляет собой кортеж (или другой тип последовательности), где первый элемент — это имя макета, а второй — `Layout`_.
