Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/tkinter.ttk.po
Languages: ru

source: :mod:`!tkinter.ttk` --- Tk themed widgets
ru: :mod:`!tkinter.ttk` --- Виджеты на тему Tk

source: **Source code:** :source:`Lib/tkinter/ttk.py`
ru: **Исходный код:** :source:`Lib/tkinter/ttk.py`

source: The :mod:`tkinter.ttk` module provides access to the Tk themed widget set, introduced in Tk 8.5. It provides additional benefits including anti-aliased font rendering under X11 and window transparency (requiring a composition window manager on X11).
ru: Модуль :mod:`tkinter.ttk` обеспечивает доступ к набору виджетов на тему Tk, представленному в Tk 8.5. Он предоставляет дополнительные преимущества, включая рендеринг сглаженных шрифтов в X11 и прозрачность окон (требуется оконный менеджер композиции в X11).

source: The basic idea for :mod:`tkinter.ttk` is to separate, to the extent possible, the code implementing a widget's behavior from the code implementing its appearance.
ru: Основная идея :mod:`tkinter.ttk` заключается в том, чтобы отделить, насколько это возможно, код, реализующий поведение виджета, от кода, реализующего его внешний вид.

source: `Tk Widget Styling Support <https://core.tcl.tk/tips/doc/trunk/tip/48.md>`_
ru: `Поддержка стилей виджетов Tk <https://core.tcl.tk/tips/doc/trunk/tip/48.md>`_

source: A document introducing theming support for Tk
ru: Документ, представляющий поддержку тем для Tk.

source: Using Ttk
ru: Использование Ttk

source: To start using Ttk, import its module::
ru: Чтобы начать использовать Ttk, импортируйте его модуль::

source: To override the basic Tk widgets, the import should follow the Tk import::
ru: Чтобы переопределить базовые виджеты Tk, импорт должен следовать за импортом Tk::

source: That code causes several :mod:`tkinter.ttk` widgets (:class:`Button`, :class:`Checkbutton`, :class:`Entry`, :class:`Frame`, :class:`Label`, :class:`LabelFrame`, :class:`Menubutton`, :class:`PanedWindow`, :class:`Radiobutton`, :class:`Scale` and :class:`Scrollbar`) to automatically replace the Tk widgets.
ru: Этот код вызывает несколько виджетов :mod:`tkinter.ttk` (:class:`Button`, :class:`Checkbutton`, :class:`Entry`, :class:`Frame`, :class:`Label`, : class:`LabelFrame`, :class:`Menubutton`, :class:`PanedWindow`, :class:`Radiobutton`, :class:`Scale` и :class:`Scrollbar`) для автоматической замены виджетов Tk.

source: This has the direct benefit of using the new widgets which gives a better look and feel across platforms; however, the replacement widgets are not completely compatible. The main difference is that widget options such as "fg", "bg" and others related to widget styling are no longer present in Ttk widgets. Instead, use the :class:`ttk.Style` class for improved styling effects.
ru: Это имеет прямое преимущество использования новых виджетов, которые улучшают внешний вид на разных платформах; однако заменяющие виджеты не полностью совместимы. Основное отличие состоит в том, что такие параметры виджетов, как «fg», «bg» и другие, связанные со стилем виджетов, больше не присутствуют в виджетах Ttk. Вместо этого используйте класс :class:`ttk.Style` для улучшения эффектов стилизации.

source: `Converting existing applications to use Tile widgets <https://tktable.sourceforge.net/tile/doc/converting.txt>`_
ru: `Преобразование существующих приложений для использования виджетов Tile <https://tktable.sourceforge.net/tile/doc/converting.txt>`_

source: A monograph (using Tcl terminology) about differences typically encountered when moving applications to use the new widgets.
ru: Монография (с использованием терминологии Tcl) о различиях, которые обычно возникают при переводе приложений на использование новых виджетов.

source: Ttk Widgets
ru: Виджеты Ttk

source: Ttk comes with 18 widgets, twelve of which already existed in tkinter: :class:`Button`, :class:`Checkbutton`, :class:`Entry`, :class:`Frame`, :class:`Label`, :class:`LabelFrame`, :class:`Menubutton`, :class:`PanedWindow`, :class:`Radiobutton`, :class:`Scale`, :class:`Scrollbar`, and :class:`Spinbox`. The other six are new: :class:`Combobox`, :class:`Notebook`, :class:`Progressbar`, :class:`Separator`, :class:`Sizegrip` and :class:`Treeview`. And all them are subclasses of :class:`Widget`.
ru: Ttk поставляется с 18 виджетами, двенадцать из которых уже существуют в tkinter: :class:`Button`, :class:`Checkbutton`, :class:`Entry`, :class:`Frame`, :class:`Label`, : class:`LabelFrame`, :class:`Menubutton`, :class:`PanedWindow`, :class:`Radiobutton`, :class:`Scale`, :class:`Scrollbar` и :class:`Spinbox`. Остальные шесть являются новыми: :class:`Combobox`, :class:`Notebook`, :class:`Progressbar`, :class:`Separator`, :class:`Sizegrip` и :class:`Treeview`. И все они являются подклассами :class:`Widget`.

source: Using the Ttk widgets gives the application an improved look and feel. As discussed above, there are differences in how the styling is coded.
ru: Использование виджетов Ttk придает приложению улучшенный внешний вид. Как обсуждалось выше, существуют различия в способах кодирования стилей.

source: Tk code::
ru: Код Tk::

source: Ttk code::
ru: Код Ttk::

source: For more information about TtkStyling_, see the :class:`Style` class documentation.
ru: Дополнительную информацию о TtkStyling_ см. в документации класса :class:`Style`.

source: Widget
ru: Виджет

source: :class:`ttk.Widget` defines standard options and methods supported by Tk themed widgets and is not supposed to be directly instantiated.
ru: :class:`ttk.Widget` определяет стандартные параметры и методы, поддерживаемые виджетами на тему Tk, и не должен создавать экземпляры напрямую.

source: Standard Options
ru: Стандартные опции

source: All the :mod:`ttk` Widgets accept the following options:
ru: Все виджеты :mod:`ttk` поддерживают следующие параметры:

source: Option
ru: Опция

source: Description
ru: Описание

source: class
ru: класс

source: Specifies the window class. The class is used when querying the option database for the window's other options, to determine the default bindtags for the window, and to select the widget's default layout and style. This option is read-only, and may only be specified when the window is created.
ru: Указывает класс окна. Класс используется при запросе к базе данных параметров других параметров окна, для определения тегов привязки по умолчанию для окна и для выбора макета и стиля виджета по умолчанию. Этот параметр доступен только для чтения и может быть доступен только для чтения. указывается при создании окна.

source: cursor
ru: курсор

source: Specifies the mouse cursor to be used for the widget. If set to the empty string (the default), the cursor is inherited for the parent widget.
ru: Указывает курсор мыши, который будет использоваться для виджета. Если установлена ​​пустая строка (по умолчанию), курсор наследуется для родительского виджета.

source: Determines whether the window accepts the focus during keyboard traversal. 0, 1 or an empty string is returned. If 0 is returned, it means that the window should be skipped entirely during keyboard traversal. If 1, it means that the window should receive the input focus as long as it is viewable. And an empty string means that the traversal scripts make the decision about whether or not to focus on the window.
ru: Определяет, принимает ли окно фокус во время обхода клавиатуры. Возвращается 0, 1 или пустая строка. Если возвращается 0, это означает, что окно должно быть полностью пропущено во время обхода клавиатуры. Если 1, это означает, что окно должно получить. фокус ввода, пока он доступен для просмотра. А пустая строка означает, что сценарии обхода принимают решение о том, следует ли фокусироваться на окне.

source: style
ru: стиль

source: May be used to specify a custom widget style.
ru: Может использоваться для указания пользовательского стиля виджета.

source: Scrollable Widget Options
ru: Параметры прокручиваемого виджета

source: The following options are supported by widgets that are controlled by a scrollbar.
ru: Следующие параметры поддерживаются виджетами, управляемыми полосой прокрутки.

source: Used to communicate with horizontal scrollbars.
ru: Используется для взаимодействия с горизонтальными полосами прокрутки.

source: When the view in the widget's window change, the widget will generate a Tcl command based on the scrollcommand.
ru: Когда вид в окне виджета изменится, виджет сгенерирует команду Tcl на основе команды прокрутки.

source: Usually this option consists of the method :meth:`Scrollbar.set` of some scrollbar. This will cause the scrollbar to be updated whenever the view in the window changes.
ru: Обычно эта опция состоит из метода :meth:`Scrollbar.set` некоторой полосы прокрутки. Это приведет к обновлению полосы прокрутки при каждом изменении вида в окне.

source: Used to communicate with vertical scrollbars. For some more information, see above.
ru: Используется для взаимодействия с вертикальными полосами прокрутки. Дополнительную информацию см. выше.

source: Label Options
ru: Параметры ярлыка

source: The following options are supported by labels, buttons and other button-like widgets.
ru: Следующие параметры поддерживаются метками, кнопками и другими виджетами, похожими на кнопки.

source: text
ru: текст

source: Specifies a text string to be displayed inside the widget.
ru: Указывает текстовую строку, которая будет отображаться внутри виджета.

source: Specifies a name whose value will be used in place of the text option resource.
ru: Указывает имя, значение которого будет использоваться вместо ресурса текстового параметра.

source: underline
ru: подчеркнуть

source: If set, specifies the index (0-based) of a character to underline in the text string. The underline character is used for mnemonic activation.
ru: Если установлено, указывает индекс (отсчитываемый от 0) символа, который необходимо подчеркнуть в текстовой строке. Символ подчеркивания используется для мнемонической активации.

source: image
ru: изображение

source: Specifies an image to display. This is a list of 1 or more elements. The first element is the default image name. The rest of the list if a sequence of statespec/value pairs as defined by :meth:`Style.map`, specifying different images to use when the widget is in a particular state or a combination of states. All images in the list should have the same size.
ru: Указывает изображение для отображения. Это список из 1 или более элементов. Первый элемент — это имя изображения по умолчанию. Остальная часть списка представляет собой последовательность пар спецификация/значение, как определено :meth:`Style.map`, определяющую различные изображения, которые будут использоваться, когда виджет находится в определенном состоянии или комбинации состояний. Все изображения в списке должны иметь одинаковый размер.

source: compound
ru: соединение

source: Specifies how to display the image relative to the text, in the case both text and images options are present. Valid values are:
ru: Указывает, как отображать изображение относительно текста, если присутствуют параметры как текста, так и изображений. Допустимые значения:

source: text: display text only
ru: text: отображать только текст

source: image: display image only
ru: image: отображать только изображение

source: top, bottom, left, right: display image above, below, left of, or right of the text, respectively.
ru: top, bottom, left, right: отображение изображения выше, ниже, слева или справа от текста соответственно.

source: none: the default. display the image if present, otherwise the text.
ru: none: значение по умолчанию. отобразить изображение, если оно присутствует, в противном случае — текст.

source: width
ru: ширина

source: If greater than zero, specifies how much space, in character widths, to allocate for the text label, if less than zero, specifies a minimum width. If zero or unspecified, the natural width of the text label is used.
ru: Если больше нуля, указывает, сколько места в символах ширины следует выделить для текстовой метки, если меньше нуля, указывает минимальную ширину. Если значение равно нулю или не указано, используется естественная ширина текстовой метки.

source: Compatibility Options
ru: Параметры совместимости

source: state
ru: состояние

source: May be set to "normal" or "disabled" to control the "disabled" state bit. This is a write-only option: setting it changes the widget state, but the :meth:`Widget.state` method does not affect this option.
ru: Может быть установлен на «нормальный» или «отключен» для управления битом состояния «отключено». Эта опция доступна только для записи: ее установка меняет состояние виджета, но метод :meth:`Widget.state` не влияет на эту опцию.

source: Widget States
ru: Состояния виджета

source: The widget state is a bitmap of independent state flags.
ru: Состояние виджета представляет собой растровое изображение независимых флагов состояния.

source: Flag
ru: Флаг

source: active
ru: активный

source: The mouse cursor is over the widget and pressing a mouse button will cause some action to occur
ru: Курсор мыши находится над виджетом, и нажатие кнопки мыши приведет к выполнению некоторого действия.

source: disabled
ru: отключено

source: Widget is disabled under program control
ru: Виджет отключен под управлением программы

source: focus
ru: фокус

source: Widget has keyboard focus
ru: Виджет имеет фокус клавиатуры

source: Widget is being pressed
ru: Виджет нажимается

source: "On", "true", or "current" for things like Checkbuttons and radiobuttons
ru: "On", "true", or "current" для таких вещей, как кнопки-галочки и переключатели.

source: background
ru: фон

source: Windows and Mac have a notion of an "active" or foreground window. The *background* state is set for widgets in a background window, and cleared for those in the foreground window
ru: В Windows и Mac есть понятие «активного» окна или окна переднего плана. Состояние *background* устанавливается для виджетов в фоновом окне и очищается для виджетов в окне переднего плана.

source: readonly
ru: только для чтения

source: Widget should not allow user modification
ru: Виджет не должен позволять пользователю вносить изменения.

source: alternate
ru: альтернативный

source: A widget-specific alternate display format
ru: Альтернативный формат отображения, специфичный для виджета.

source: invalid
ru: неверный

source: The widget's value is invalid
ru: Недопустимое значение виджета.

source: A state specification is a sequence of state names, optionally prefixed with an exclamation point indicating that the bit is off.
ru: Спецификация состояния — это последовательность имен состояний, необязательно с префиксом восклицательного знака, указывающим на то, что бит выключен.

source: Besides the methods described below, the :class:`ttk.Widget` supports the methods :meth:`tkinter.Widget.cget` and :meth:`tkinter.Widget.configure`.
ru: Помимо методов, описанных ниже, :class:`ttk.Widget` поддерживает методы :meth:`tkinter.Widget.cget` и :meth:`tkinter.Widget.configure`.

source: Returns the name of the element at position *x* *y*, or the empty string if the point does not lie within any element.
ru: Возвращает имя элемента в позиции *x* *y* или пустую строку, если точка не находится внутри какого-либо элемента.

source: *x* and *y* are pixel coordinates relative to the widget.
ru: *x* и *y* — координаты пикселей относительно виджета.

source: Test the widget's state. If a callback is not specified, returns ``True`` if the widget state matches *statespec* and ``False`` otherwise. If callback is specified then it is called with args if widget state matches *statespec*.
ru: Проверьте состояние виджета. Если обратный вызов не указан, возвращает True, если состояние виджета соответствует *statespec*, и False в противном случае. Если указан обратный вызов, он вызывается с аргументами, если состояние виджета соответствует *statespec*.

source: Modify or inquire widget state. If *statespec* is specified, sets the widget state according to it and return a new *statespec* indicating which flags were changed. If *statespec* is not specified, returns the currently enabled state flags.
ru: Измените или запросите состояние виджета. Если указана *statespec*, устанавливает состояние виджета в соответствии с ним и возвращает новую *statespec*, указывающую, какие флаги были изменены. Если *statespec* не указан, возвращает текущие включенные флаги состояния.

source: *statespec* will usually be a list or a tuple.
ru: *statespec* обычно представляет собой список или кортеж.

source: Combobox
ru: Комбобокс

source: The :class:`ttk.Combobox` widget combines a text field with a pop-down list of values. This widget is a subclass of :class:`Entry`.
ru: Виджет :class:`ttk.Combobox` объединяет текстовое поле с раскрывающимся списком значений. Этот виджет является подклассом :class:`Entry`.

source: Besides the methods inherited from :class:`Widget`: :meth:`Widget.cget`, :meth:`Widget.configure`, :meth:`Widget.identify`, :meth:`Widget.instate` and :meth:`Widget.state`, and the following inherited from :class:`Entry`: :meth:`Entry.bbox`, :meth:`Entry.delete`, :meth:`Entry.icursor`, :meth:`Entry.index`, :meth:`Entry.insert`, :meth:`Entry.selection`, :meth:`Entry.xview`, it has some other methods, described at :class:`ttk.Combobox`.
ru: Помимо методов, унаследованных от :class:`Widget`: :meth:`Widget.cget`, :meth:`Widget.configure`, :meth:`Widget.identify`, :meth:`Widget.instate` и :meth :`Widget.state` и следующие элементы, унаследованные от :class:`Entry`: :meth:`Entry.bbox`, :meth:`Entry.delete`, :meth:`Entry.icursor`, :meth:` Entry.index`, :meth:`Entry.insert`, :meth:`Entry.selection`, :meth:`Entry.xview`, у него есть и другие методы, описанные в :class:`ttk.Combobox`.

source: Options
ru: Опции

source: This widget accepts the following specific options:
ru: Этот виджет принимает следующие конкретные параметры:

source: exportselection
ru: экспортный выбор

source: Boolean value. If set, the widget selection is linked to the Window Manager selection (which can be returned by invoking Misc.selection_get, for example).
ru: Логическое значение. Если установлено, выбор виджета связан с выбором диспетчера окон (который можно вернуть, например, вызвав Misc.selection_get).

source: justify
ru: выровнить

source: Specifies how the text is aligned within the widget. One of "left", "center", or "right".
ru: Указывает, как текст выравнивается внутри виджета. Один из «левых», «центральных» или «правых».

source: height
ru: высота

source: Specifies the height of the pop-down listbox, in rows.
ru: Указывает высоту раскрывающегося списка в строках.

source: A script (possibly registered with Misc.register) that is called immediately before displaying the values. It may specify which values to display.
ru: Сценарий (возможно, зарегистрированный в Misc.register), который вызывается непосредственно перед отображением значений. Он может указывать, какие значения отображать.

source: One of "normal", "readonly", or "disabled". In the "readonly" state, the value may not be edited directly, and the user can only selection of the values from the dropdown list. In the "normal" state, the text field is directly editable. In the "disabled" state, no interaction is possible.
ru: Один из вариантов «нормальный», «только для чтения» или «отключенный». В состоянии «только для чтения» значение нельзя редактировать напрямую, и пользователь может только выбирать значения из раскрывающегося списка. В «нормальном» состоянии текстовое поле доступно для непосредственного редактирования. В «отключенном» состоянии никакое взаимодействие невозможно.

source: Specifies a name whose value is linked to the widget value. Whenever the value associated with that name changes, the widget value is updated, and vice versa. See :class:`tkinter.StringVar`.
ru: Указывает имя, значение которого связано со значением виджета. Всякий раз, когда значение, связанное с этим именем, изменяется, значение виджета обновляется, и наоборот. См. :class:`tkinter.StringVar` .

source: values
ru: значение

source: Specifies the list of values to display in the drop-down listbox.
ru: Указывает список значений, отображаемых в раскрывающемся списке.

source: Specifies an integer value indicating the desired width of the entry window, in average-size characters of the widget's font.
ru: Задает целочисленное значение, указывающее желаемую ширину окна ввода в символах среднего размера шрифта виджета.

source: Virtual events
ru: Виртуальные мероприятия

source: The combobox widgets generates a **<<ComboboxSelected>>** virtual event when the user selects an element from the list of values.
ru: Виджеты со списком генерируют виртуальное событие **<<ComboboxSelected>>**, когда пользователь выбирает элемент из списка значений.

source: If *newindex* is specified, sets the combobox value to the element position *newindex*. Otherwise, returns the index of the current value or -1 if the current value is not in the values list.
ru: Если указан *newindex*, устанавливает значение поля со списком в позицию элемента *newindex*. В противном случае возвращает индекс текущего значения или -1, если текущего значения нет в списке значений.

source: Returns the current value of the combobox.
ru: Возвращает текущее значение поля со списком.

source: Sets the value of the combobox to *value*.
ru: Устанавливает значение поля со списком равным *значение*.

source: The :class:`ttk.Spinbox` widget is a :class:`ttk.Entry` enhanced with increment and decrement arrows. It can be used for numbers or lists of string values. This widget is a subclass of :class:`Entry`.
ru: Виджет :class:`ttk.Spinbox` представляет собой :class:`ttk.Entry`, дополненный стрелками увеличения и уменьшения. Его можно использовать для чисел или списков строковых значений. Этот виджет является подклассом :class:`Entry`.

source: Besides the methods inherited from :class:`Widget`: :meth:`Widget.cget`, :meth:`Widget.configure`, :meth:`Widget.identify`, :meth:`Widget.instate` and :meth:`Widget.state`, and the following inherited from :class:`Entry`: :meth:`Entry.bbox`, :meth:`Entry.delete`, :meth:`Entry.icursor`, :meth:`Entry.index`, :meth:`Entry.insert`, :meth:`Entry.xview`, it has some other methods, described at :class:`ttk.Spinbox`.
ru: Помимо методов, унаследованных от :class:`Widget`: :meth:`Widget.cget`, :meth:`Widget.configure`, :meth:`Widget.identify`, :meth:`Widget.instate` и :meth :`Widget.state` и следующие элементы, унаследованные от :class:`Entry`: :meth:`Entry.bbox`, :meth:`Entry.delete`, :meth:`Entry.icursor`, :meth:` Entry.index`, :meth:`Entry.insert`, :meth:`Entry.xview`, он имеет некоторые другие методы, описанные в :class:`ttk.Spinbox`.

source: from
ru: от

source: Float value. If set, this is the minimum value to which the decrement button will decrement. Must be spelled as ``from_`` when used as an argument, since ``from`` is a Python keyword.
ru: Плавающее значение. Если установлено, это минимальное значение, до которого будет уменьшаться кнопка уменьшения. При использовании в качестве аргумента необходимо писать как ``from_``, поскольку ``from`` — это ключевое слово Python.

source: to
ru: к

source: Float value. If set, this is the maximum value to which the increment button will increment.
ru: Плавающее значение. Если установлено, это максимальное значение, до которого будет увеличиваться кнопка увеличения.

source: increment
ru: приращение

source: Float value. Specifies the amount which the increment/decrement buttons change the value. Defaults to 1.0.
ru: Плавающее значение. Определяет величину, на которую кнопки увеличения/уменьшения изменяют значение. По умолчанию 1.0.
