Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/tkinter.po
Languages: ru, uk

source: region
ru: регион
uk: область

source: This is a string with four space-delimited elements, each of which is a legal distance (see above). For example: ``"2 3 4 5"`` and ``"3i 2i 4.5i 2i"`` and ``"3c 2c 4c 10.43c"`` are all legal regions.
ru: Это строка с четырьмя элементами, разделенными пробелами, каждый из которых является допустимым расстоянием (см. выше). Например: ``"2 3 4 5"`` и ``"3i 2i 4.5i 2i"`` и ``"3c 2c 4c 10.43c"`` являются законными регионами.
uk: Це рядок із чотирма розділеними пробілами елементами, кожен із яких є допустимою відстанню (див. вище). Наприклад: ``"2 3 4 5"`` і ``"3i 2i 4.5i 2i"`` і ``"3c 2c 4c 10.43c"`` є законними регіонами.

source: relief
ru: рельеф
uk: полегшення

source: Determines what the border style of a widget will be. Legal values are: ``"raised"``, ``"sunken"``, ``"flat"``, ``"groove"``, and ``"ridge"``.
ru: Определяет стиль границы виджета. Допустимые значения: ``"raised"``, ``"sunken"``, ``"flat"``, ``"groove"``, and ``"ridge"``.
uk: Визначає, яким буде стиль межі віджета. Допустимі значення: ``"піднятий"``, ``"заглиблений"``, ``"плоский"``, ``"канавка"`` і ``"гребінь"``.

source: scrollcommand
ru: Команда прокрутки
uk: команда прокручування

source: This is almost always the :meth:`!set` method of some scrollbar widget, but can be any widget method that takes a single argument.
ru: Почти всегда это метод :meth:`!set` какого-либо виджета полосы прокрутки, но это может быть любой метод виджета, принимающий один аргумент.
uk: Це майже завжди метод :meth:`!set` якогось віджета смуги прокрутки, але це може бути будь-який метод віджета, який приймає один аргумент.

source: wrap
ru: обернуть
uk: загорнути

source: Must be one of: ``"none"``, ``"char"``, or ``"word"``.
ru: Должно быть одно из: ``"none"``, ``"char"`` или ``"word"``.
uk: Має бути одне з: ``"none"``, ``"char"`` або ``"word"``.

source: Bindings and Events
ru: Привязки и события
uk: Прив'язки та події

source: The bind method from the widget command allows you to watch for certain events and to have a callback function trigger when that event type occurs. The form of the bind method is::
ru: Метод привязки из команды виджета позволяет вам отслеживать определенные события и запускать функцию обратного вызова при возникновении событий этого типа. Форма метода привязки:
uk: Метод прив’язки з команди віджета дозволяє спостерігати за певними подіями та запускати функцію зворотного виклику, коли відбувається подія такого типу. Форма методу прив’язки:

source: where:
ru: где:
uk: де:

source: sequence
ru: последовательность
uk: послідовність

source: func
uk: функц

source: is a Python function, taking one argument, to be invoked when the event occurs. An Event instance will be passed as the argument. (Functions deployed this way are commonly known as *callbacks*.)
ru: — это функция Python, принимающая один аргумент и вызываемая при возникновении события. Экземпляр Event будет передан в качестве аргумента. (Функции, развернутые таким образом, обычно известны как *обратные вызовы*.)
uk: це функція Python, яка приймає один аргумент, який викликається, коли відбувається подія. Екземпляр події буде передано як аргумент. (Функції, розгорнуті таким чином, широко відомі як *зворотні виклики*.)

source: add
ru: добавить
uk: додати

source: is optional, either ``''`` or ``'+'``. Passing an empty string denotes that this binding is to replace any other bindings that this event is associated with. Passing a ``'+'`` means that this function is to be added to the list of functions bound to this event type.
ru: не является обязательным, либо ``''``, либо ``'+'``. Передача пустой строки означает, что эта привязка должна заменить любые другие привязки, с которыми связано это событие. Передача ``'+'`` означает, что эта функция должна быть добавлена ​​в список функций, привязанных к этому типу события.
uk: є необов’язковим, або ``''`` або ``'+'``. Передача порожнього рядка означає, що ця прив’язка має замінити будь-які інші прив’язки, з якими пов’язана ця подія. Передача ``'+'`` означає, що цю функцію потрібно додати до списку функцій, пов’язаних із цим типом події.

source: Notice how the widget field of the event is being accessed in the ``turn_red()`` callback. This field contains the widget that caught the X event. The following table lists the other event fields you can access, and how they are denoted in Tk, which can be useful when referring to the Tk man pages.
ru: Обратите внимание, как осуществляется доступ к полю виджета события в обратном вызове ``turn_red()``. Это поле содержит виджет, который перехватил событие X. В следующей таблице перечислены другие поля событий, к которым вы можете получить доступ, и то, как они обозначаются в Tk, что может быть полезно при обращении к справочным страницам Tk.
uk: Зверніть увагу, як у зворотному виклику ``turn_red()`` здійснюється доступ до поля віджета події. Це поле містить віджет, який перехопив подію X. У наведеній нижче таблиці перераховано інші поля подій, до яких ви можете отримати доступ, і те, як вони позначаються в Tk, що може бути корисним під час звернення до довідкових сторінок Tk.

source: Tk
ru: Тк
uk: Тк

source: Tkinter Event Field
ru: Поле события Tkinter
uk: Поле подій Tkinter

source: focus
ru: фокус
uk: фокус

source: height
ru: высота
uk: висота

source: keycode
ru: ключевой код
uk: код ключа

source: state
ru: состояние
uk: стан

source: time
ru: время
uk: час

source: type
ru: тип
uk: тип

source: width
ru: ширина
uk: ширина

source: widget
ru: виджет
uk: віджет

source: y
uk: р

source: The index Parameter
ru: Параметр индекса
uk: Параметр індексу

source: A number of widgets require "index" parameters to be passed. These are used to point at a specific place in a Text widget, or to particular characters in an Entry widget, or to particular menu items in a Menu widget.
ru: Ряд виджетов требуют передачи «индексных» параметров. Они используются для указания определенного места в виджете «Текст», или определенных символов в виджете «Ввод», или определенных пунктов меню в виджете «Меню».
uk: Кілька віджетів потребують передачі параметрів "index". Вони використовуються для вказівки на певне місце у віджеті "Текст", або на певні символи у віджеті "Вхід", або на певні пункти меню у віджеті "Меню".

source: Entry widget indexes (index, view index, etc.)
ru: Индексы входных виджетов (индекс, индекс просмотра и т. д.)
uk: Індекси віджетів запису (індекс, індекс перегляду тощо)

source: Entry widgets have options that refer to character positions in the text being displayed. You can use these :mod:`tkinter` functions to access these special points in text widgets:
ru: Виджеты ввода имеют параметры, которые относятся к позициям символов в отображаемом тексте. Вы можете использовать эти функции :mod:`tkinter` для доступа к этим специальным точкам в текстовых виджетах:
uk: Віджети запису мають параметри, які стосуються позицій символів у тексті, що відображається. Ви можете використовувати ці функції :mod:`tkinter` для доступу до цих спеціальних пунктів у текстових віджетах:

source: Text widget indexes
ru: Индексы текстового виджета
uk: Індекси текстових віджетів

source: The index notation for Text widgets is very rich and is best described in the Tk man pages.
ru: Обозначение индекса для текстовых виджетов очень богато и лучше всего описано на страницах руководства Tk.
uk: Нотація покажчика для текстових віджетів дуже багата і найкраще описана на сторінках керівництва Tk.

source: Menu indexes (menu.invoke(), menu.entryconfig(), etc.)
ru: Индексы меню (menu.invoke(), menu.entryconfig() и т. д.)
uk: Індекси меню (menu.invoke(), menu.entryconfig() тощо)

source: Some options and methods for menus manipulate specific menu entries. Anytime a menu index is needed for an option or a parameter, you may pass in:
ru: Некоторые параметры и методы меню управляют конкретными пунктами меню. Каждый раз, когда для опции или параметра требуется индекс меню, вы можете передать:
uk: Деякі параметри та методи для меню маніпулюють певними записами меню. Щоразу, коли для опції чи параметра потрібен індекс меню, ви можете передати:

source: an integer which refers to the numeric position of the entry in the widget, counted from the top, starting with 0;
ru: целое число, которое относится к числовой позиции записи в виджете, считая сверху, начиная с 0;
uk: ціле число, яке відноситься до числової позиції запису у віджеті, починаючи з 0;

source: the string ``"active"``, which refers to the menu position that is currently under the cursor;
ru: строка ``"active"``, которая относится к позиции меню, которая в данный момент находится под курсором;
uk: рядок ``"active"``, який посилається на позицію меню, яка зараз знаходиться під курсором;

source: the string ``"last"`` which refers to the last menu item;
ru: строка ``"last"``, которая относится к последнему пункту меню;
uk: рядок ``"last"``, який посилається на останній пункт меню;

source: An integer preceded by ``@``, as in ``@6``, where the integer is interpreted as a y pixel coordinate in the menu's coordinate system;
ru: Целое число, которому предшествует ``@``, например ``@6``, где целое число интерпретируется как координата любого пикселя в системе координат меню;
uk: Ціле число, якому передує ``@``, як у ``@6``, де ціле число інтерпретується як координата y пікселя в системі координат меню;

source: the string ``"none"``, which indicates no menu entry at all, most often used with menu.activate() to deactivate all entries, and finally,
ru: строка ``"none"``, которая указывает на отсутствие записи в меню вообще, чаще всего используется с Menu.activate() для деактивации всех записей, и, наконец,
uk: рядок ``"none"``, який вказує на те, що в меню взагалі немає запису, найчастіше використовується з menu.activate(), щоб дезактивувати всі записи, і, нарешті,

source: a text string that is pattern matched against the label of the menu entry, as scanned from the top of the menu to the bottom. Note that this index type is considered after all the others, which means that matches for menu items labelled ``last``, ``active``, or ``none`` may be interpreted as the above literals, instead.
ru: текстовая строка, шаблон которой соответствует метке пункта меню, отсканированная сверху вниз. Обратите внимание, что этот тип индекса рассматривается после всех остальных, а это означает, что совпадения для пунктов меню, помеченных как ``last``, ``active`` или ``none``, могут вместо этого интерпретироваться как вышеуказанные литералы.
uk: текстовий рядок, який зіставляється з міткою запису меню, відсканований від верхньої частини меню донизу. Зауважте, що цей тип індексу розглядається після всіх інших, що означає, що збіги для пунктів меню, позначених як ``останній``, ``активний`` або ``жоден``, замість цього можуть інтерпретуватися як наведені вище літерали.

source: Images
ru: Изображения
uk: Зображення

source: Images of different formats can be created through the corresponding subclass of :class:`tkinter.Image`:
ru: Изображения разных форматов можно создавать с помощью соответствующего подкласса :class:`tkinter.Image`:
uk: Зображення різних форматів можна створювати за допомогою відповідного підкласу :class:`tkinter.Image`:

source: :class:`BitmapImage` for images in XBM format.
ru: :class:`BitmapImage` для изображений в формате XBM.
uk: :class:`BitmapImage` для зображень у форматі XBM.

source: :class:`PhotoImage` for images in PGM, PPM, GIF and PNG formats. The latter is supported starting with Tk 8.6.
ru: :class:`PhotoImage` для изображений в форматах PGM, PPM, GIF и PNG. Последний поддерживается начиная с Тк 8.6.
uk: :class:`PhotoImage` для зображень у форматах PGM, PPM, GIF і PNG. Останній підтримується, починаючи з Tk 8.6.

source: Either type of image is created through either the ``file`` or the ``data`` option (other options are available as well).
ru: Любой тип изображения создается либо с помощью параметра «файл», либо с помощью параметра «данные» (также доступны и другие параметры).
uk: Будь-який тип зображення створюється за допомогою параметра ``file`` або ``data`` (інші параметри також доступні).

source: The image object can then be used wherever an ``image`` option is supported by some widget (e.g. labels, buttons, menus). In these cases, Tk will not keep a reference to the image. When the last Python reference to the image object is deleted, the image data is deleted as well, and Tk will display an empty box wherever the image was used.
ru: Объект изображения затем можно использовать везде, где опция «изображение» поддерживается каким-либо виджетом (например, метками, кнопками, меню). В этих случаях Tk не будет сохранять ссылку на изображение. Когда последняя ссылка Python на объект изображения удаляется, данные изображения также удаляются, и Tk будет отображать пустое поле везде, где использовалось изображение.
uk: Потім об’єкт зображення можна використовувати скрізь, де параметр ``image`` підтримується деяким віджетом (наприклад, мітки, кнопки, меню). У цих випадках Tk не зберігатиме посилання на зображення. Коли останнє посилання Python на об’єкт зображення видаляється, дані зображення також видаляються, і Tk відображатиме порожнє поле, де б зображення не використовувалося.

source: The `Pillow <http://python-pillow.org/>`_ package adds support for formats such as BMP, JPEG, TIFF, and WebP, among others.
uk: Пакет `Pillow <http://python-pillow.org/>`_ додає підтримку таких форматів, як BMP, JPEG, TIFF і WebP, серед інших.

source: File Handlers
ru: Обработчики файлов
uk: Обробники файлів

source: Tk allows you to register and unregister a callback function which will be called from the Tk mainloop when I/O is possible on a file descriptor. Only one handler may be registered per file descriptor. Example code::
ru: Tk позволяет вам зарегистрировать и отменить регистрацию функции обратного вызова, которая будет вызываться из основного цикла Tk, когда возможен ввод-вывод в файловом дескрипторе. Для каждого файлового дескриптора может быть зарегистрирован только один обработчик. Пример кода::
uk: Tk дозволяє вам зареєструвати та скасувати реєстрацію функції зворотного виклику, яка буде викликана з основного циклу Tk, коли введення/виведення можливе для дескриптора файлу. Для кожного дескриптора файлу можна зареєструвати лише один обробник. Приклад коду::

source: This feature is not available on Windows.
ru: Эта функция недоступна в Windows.
uk: Ця функція недоступна в Windows.

source: Since you don't know how many bytes are available for reading, you may not want to use the :class:`~io.BufferedIOBase` or :class:`~io.TextIOBase` :meth:`~io.BufferedIOBase.read` or :meth:`~io.IOBase.readline` methods, since these will insist on reading a predefined number of bytes. For sockets, the :meth:`~socket.socket.recv` or :meth:`~socket.socket.recvfrom` methods will work fine; for other files, use raw reads or ``os.read(file.fileno(), maxbytecount)``.
ru: Поскольку вы не знаете, сколько байт доступно для чтения, возможно, вы не захотите использовать :class:`~io.BufferedIOBase` или :class:`~io.TextIOBase` :meth:`~io.BufferedIOBase.read ` или :meth:`~io.IOBase.readline`, поскольку они будут настаивать на чтении заранее определенного количества байтов. Для сокетов методы :meth:`~socket.socket.recv` или :meth:`~socket.socket.recvfrom` будут работать нормально; для других файлов используйте необработанное чтение или ``os.read(file.fileno(), maxbytecount)``.
uk: Оскільки ви не знаєте, скільки байтів доступно для читання, ви можете не використовувати :class:`~io.BufferedIOBase` або :class:`~io.TextIOBase` :meth:`~io.BufferedIOBase.read` або :meth:`~io.IOBase.readline` методи, оскільки вони наполягатимуть на читанні заздалегідь визначеної кількості байтів. Для сокетів добре працюватимуть методи :meth:`~socket.socket.recv` або :meth:`~socket.socket.recvfrom`; для інших файлів використовуйте необроблені читання або ``os.read(file.fileno(), maxbytecount)``.

source: Registers the file handler callback function *func*. The *file* argument may either be an object with a :meth:`~io.IOBase.fileno` method (such as a file or socket object), or an integer file descriptor. The *mask* argument is an ORed combination of any of the three constants below. The callback is called as follows::
ru: Регистрирует функцию обратного вызова обработчика файлов *func*. Аргумент *file* может быть либо объектом с методом :meth:`~io.IOBase.fileno` (например, объектом файла или сокета), либо целочисленным дескриптором файла. Аргумент *маска* представляет собой комбинацию любой из трех констант, представленных ниже, по операции ИЛИ. Обратный вызов вызывается следующим образом:
uk: Реєструє функцію зворотного виклику обробника файлів *func*. Аргумент *file* може бути або об’єктом із методом :meth:`~io.IOBase.fileno` (наприклад, об’єкт файл або сокет), або цілочисельним дескриптором файлу. Аргумент *mask* — це комбінація будь-якої з трьох констант, наведених нижче. Зворотний виклик викликається наступним чином:

source: Unregisters a file handler.
ru: Отменяет регистрацию обработчика файлов.
uk: Скасовує реєстрацію обробника файлів.

source: Constants used in the *mask* arguments.
ru: Константы, используемые в аргументах *маски*.
uk: Константи, що використовуються в аргументах *mask*.

source: Tkinter Life Preserver
ru: Спасательный круг Tkinter

source: tkinter (Python Package)
ru: tkinter (пакет Python)

source: keysym_num
ru: keyym_num
