Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/tkinter.po
Languages: ru, uk

source: :mod:`tkinter` --- Python interface to Tcl/Tk
uk: :mod:`tkinter` --- Інтерфейс Python до Tcl/Tk

source: **Source code:** :source:`Lib/tkinter/__init__.py`
ru: **Исходный код:** :source:`Lib/tkinter/__init__.py`
uk: **Вихідний код:** :source:`Lib/tkinter/__init__.py`

source: The :mod:`tkinter` package ("Tk interface") is the standard Python interface to the Tcl/Tk GUI toolkit. Both Tk and :mod:`tkinter` are available on most Unix platforms, including macOS, as well as on Windows systems.
ru: Пакет :mod:`tkinter` («интерфейс Tk») — это стандартный интерфейс Python для набора инструментов Tcl/Tk GUI. И Tk, и :mod:`tkinter` доступны на большинстве платформ Unix, включая macOS, а также в системах Windows.
uk: Пакет :mod:`tkinter` ("інтерфейс Tk") є стандартним інтерфейсом Python до інструментарію GUI Tcl/Tk. І Tk, і :mod:`tkinter` доступні на більшості платформ Unix, включаючи macOS, а також у системах Windows.

source: Running ``python -m tkinter`` from the command line should open a window demonstrating a simple Tk interface, letting you know that :mod:`tkinter` is properly installed on your system, and also showing what version of Tcl/Tk is installed, so you can read the Tcl/Tk documentation specific to that version.
ru: Запуск ``python -m tkinter`` из командной строки должен открыть окно, демонстрирующее простой интерфейс Tk, сообщающее вам, что :mod:`tkinter` правильно установлен в вашей системе, а также показывающее, какая версия Tcl/Tk установлена. установлен, поэтому вы можете прочитать документацию Tcl/Tk, относящуюся к этой версии.
uk: Запуск ``python -m tkinter`` з командного рядка має відкрити вікно, яке демонструє простий інтерфейс Tk, повідомляючи, що :mod:`tkinter` правильно встановлено у вашій системі, а також показує, яка версія Tcl/Tk встановлено, тому ви можете прочитати документацію Tcl/Tk, що стосується цієї версії.

source: Extensive tutorial on creating user interfaces with Tkinter. Explains key concepts, and illustrates recommended approaches using the modern API.
ru: Обширное руководство по созданию пользовательских интерфейсов с помощью Tkinter. Объясняет ключевые понятия и иллюстрирует рекомендуемые подходы с использованием современного API.
uk: Розширений підручник зі створення інтерфейсів користувача за допомогою Tkinter. Пояснює ключові концепції та ілюструє рекомендовані підходи за допомогою сучасного API.

source: `Tkinter 8.5 reference: a GUI for Python <https://www.tkdocs.com/shipman/>`_
ru: `Справочник по Tkinter 8.5: графический интерфейс для Python <https://www.tkdocs.com/shipman/>`_
uk: `Довідник Tkinter 8.5: графічний інтерфейс для Python <https://www.tkdocs.com/shipman/>`_

source: Reference documentation for Tkinter 8.5 detailing available classes, methods, and options.
ru: Справочная документация по Tkinter 8.5 с подробным описанием доступных классов, методов и параметров.
uk: Довідкова документація для Tkinter 8.5 із детальним описом доступних класів, методів і параметрів.

source: Tcl/Tk Resources:
ru: Ресурсы Tcl/Tk:
uk: Ресурси Tcl/Tk:

source: `Tk commands <https://www.tcl.tk/man/tcl8.6/TkCmd/contents.htm>`_
ru: `Команды Tk <https://www.tcl.tk/man/tcl8.6/TkCmd/contents.htm>`_
uk: `Tk команди <https://www.tcl.tk/man/tcl8.6/TkCmd/contents.htm>`_

source: Comprehensive reference to each of the underlying Tcl/Tk commands used by Tkinter.
ru: Полная ссылка на каждую базовую команду Tcl/Tk, используемую Tkinter.
uk: Вичерпне посилання на кожну з базових команд Tcl/Tk, що використовуються Tkinter.

source: `Tcl/Tk Home Page <https://www.tcl.tk>`_
ru: `Домашняя страница Tcl/Tk <https://www.tcl.tk>`_
uk: `Домашня сторінка Tcl/Tk <https://www.tcl.tk>`_

source: Additional documentation, and links to Tcl/Tk core development.
ru: Дополнительная документация и ссылки на разработку ядра Tcl/Tk.
uk: Додаткова документація та посилання на розробку ядра Tcl/Tk.

source: Books:
ru: Книги:
uk: Книги:

source: `Modern Tkinter for Busy Python Developers <https://tkdocs.com/book.html>`_
ru: `Современный Tkinter для занятых разработчиков Python <https://tkdocs.com/book.html>`_
uk: `Сучасний Tkinter для зайнятих розробників Python <https://tkdocs.com/book.html>`_

source: By Mark Roseman. (ISBN 978-1999149567)
ru: Марк Роузман. (ISBN 978-1999149567)
uk: Автор: Марк Розман. (ISBN 978-1999149567)

source: `Python and Tkinter Programming <https://www.packtpub.com/product/python-gui-programming-with-tkinter/9781788835886>`_
uk: `Програмування на Python і Tkinter <https://www.packtpub.com/product/python-gui-programming-with-tkinter/9781788835886>`_

source: By Alan Moore. (ISBN 978-1788835886)
uk: Автор: Алан Мур. (ISBN 978-1788835886)

source: `Programming Python <http://learning-python.com/about-pp4e.html>`_
ru: `Программирование на Python <http://learning-python.com/about-pp4e.html>`_
uk: `Програмування на Python <http://learning-python.com/about-pp4e.html>`_

source: By Mark Lutz; has excellent coverage of Tkinter. (ISBN 978-0596158101)
ru: Марк Лутц; имеет отличное покрытие Tkinter. (ISBN 978-0596158101)
uk: Марк Лутц; має чудове покриття Tkinter. (ISBN 978-0596158101)

source: `Tcl and the Tk Toolkit (2nd edition) <https://www.amazon.com/exec/obidos/ASIN/032133633X>`_
ru: `Tcl и Tk Toolkit (2-е издание) <https://www.amazon.com/exec/obidos/ASIN/032133633X>`_
uk: `Tcl і Tk Toolkit (2-е видання) <https://www.amazon.com/exec/obidos/ASIN/032133633X>`_

source: By John Ousterhout, inventor of Tcl/Tk, and Ken Jones; does not cover Tkinter. (ISBN 978-0321336330)
ru: Авторы: Джон Оустерхаут, изобретатель Tcl/Tk, и Кен Джонс; не распространяется на Tkinter. (ISBN 978-0321336330)
uk: Джон Остерхаут, винахідник Tcl/Tk, і Кен Джонс; не охоплює Tkinter. (ISBN 978-0321336330)

source: Tkinter Modules
ru: Модули Tkinter
uk: Модулі Tkinter

source: Support for Tkinter is spread across several modules. Most applications will need the main :mod:`tkinter` module, as well as the :mod:`tkinter.ttk` module, which provides the modern themed widget set and API::
ru: Поддержка Tkinter распределена по нескольким модулям. Большинству приложений потребуется основной модуль :mod:`tkinter`, а также модуль :mod:`tkinter.ttk`, который предоставляет современный набор тематических виджетов и API::
uk: Підтримка Tkinter розподілена на кілька модулів. Для більшості програм знадобиться головний модуль :mod:`tkinter`, а також модуль :mod:`tkinter.ttk`, який надає сучасний тематичний набір віджетів і API:

source: Construct a toplevel Tk widget, which is usually the main window of an application, and initialize a Tcl interpreter for this widget. Each instance has its own associated Tcl interpreter.
ru: Создайте виджет Tk верхнего уровня, который обычно является главным окном приложения, и инициализируйте интерпретатор Tcl для этого виджета. Каждый экземпляр имеет свой собственный интерпретатор Tcl.
uk: Створіть віджет Tk верхнього рівня, який зазвичай є головним вікном програми, та ініціалізуйте інтерпретатор Tcl для цього віджета. Кожен екземпляр має власний асоційований інтерпретатор Tcl.

source: The :class:`Tk` class is typically instantiated using all default values. However, the following keyword arguments are currently recognized:
ru: Класс :class:`Tk` обычно создается с использованием всех значений по умолчанию. Однако в настоящее время распознаются следующие аргументы ключевых слов:
uk: Клас :class:`Tk` зазвичай створюється з використанням усіх значень за замовчуванням. Однак наразі розпізнаються такі аргументи ключових слів:

source: When given (as a string), sets the :envvar:`DISPLAY` environment variable. (X11 only)
ru: Если задано (в виде строки), устанавливается переменная среды :envvar:`DISPLAY`. (только X11)
uk: Якщо задано (у вигляді рядка), установлює змінну середовища :envvar:`DISPLAY`. (лише X11)

source: *baseName*
uk: *базова назва*

source: Name of the profile file. By default, *baseName* is derived from the program name (``sys.argv[0]``).
ru: Имя файла профиля. По умолчанию *baseName* получается из имени программы (``sys.argv[0]``).
uk: Ім'я файлу профілю. За замовчуванням *baseName* походить від назви програми (``sys.argv[0]``).

source: *className*
uk: *назва класу*

source: Name of the widget class. Used as a profile file and also as the name with which Tcl is invoked (*argv0* in *interp*).
ru: Имя класса виджета. Используется как файл профиля, а также как имя, под которым вызывается Tcl (*argv0* в *interp*).
uk: Назва класу віджетів. Використовується як файл профілю, а також як ім’я, з яким викликається Tcl (*argv0* у *interp*).

source: If ``True``, initialize the Tk subsystem. The :func:`tkinter.Tcl() <Tcl>` function sets this to ``False``.
ru: Если ``True``, инициализируйте подсистему Tk. Функция :func:`tkinter.Tcl() <Tcl>` устанавливает для этого значения значение ``False``.
uk: Якщо ``True``, ініціалізувати підсистему Tk. Функція :func:`tkinter.Tcl() <Tcl>` встановлює значення ``False``.

source: *sync*
uk: *синхронізація*

source: If ``True``, execute all X server commands synchronously, so that errors are reported immediately. Can be used for debugging. (X11 only)
ru: Если ``True``, все команды X-сервера выполняются синхронно, поэтому об ошибках сообщается немедленно. Может использоваться для отладки. (только X11)
uk: Якщо ``True``, виконувати всі команди X-сервера синхронно, щоб повідомляти про помилки негайно. Можна використовувати для налагодження. (лише X11)

source: *use*
uk: *використання*

source: Specifies the *id* of the window in which to embed the application, instead of it being created as an independent toplevel window. *id* must be specified in the same way as the value for the -use option for toplevel widgets (that is, it has a form like that returned by :meth:`winfo_id`).
ru: Указывает *id* окна, в которое встраивается приложение, вместо того, чтобы оно создавалось как независимое окно верхнего уровня. *id* должен быть указан так же, как значение параметра -use для виджетов верхнего уровня (то есть, он имеет форму, подобную той, которую возвращает :meth:`winfo_id`).
uk: Визначає *id* вікна, у яке потрібно вставити програму, замість того, щоб воно створювалося як незалежне вікно верхнього рівня. *id* потрібно вказати так само, як значення параметра -use для віджетів верхнього рівня (тобто воно має форму, подібну до тієї, яку повертає :meth:`winfo_id`).

source: Note that on some platforms this will only work correctly if *id* refers to a Tk frame or toplevel that has its -container option enabled.
ru: Обратите внимание, что на некоторых платформах это будет работать правильно, только если *id* относится к фрейму Tk или верхнему уровню, у которого включена опция -container.
uk: Зауважте, що на деяких платформах це працюватиме належним чином, лише якщо *id* посилається на фрейм Tk або верхній рівень, для якого ввімкнено параметр -container.

source: :class:`Tk` reads and interprets profile files, named :file:`.{className}.tcl` and :file:`.{baseName}.tcl`, into the Tcl interpreter and calls :func:`exec` on the contents of :file:`.{className}.py` and :file:`.{baseName}.py`. The path for the profile files is the :envvar:`HOME` environment variable or, if that isn't defined, then :attr:`os.curdir`.
uk: :class:`Tk` читає та інтерпретує файли профілю з іменами :file:`.{className}.tcl` і :file:`.{baseName}.tcl` в інтерпретатор Tcl і викликає :func:`exec` на вміст файлів :file:`.{className}.py` і :file:`.{baseName}.py`. Шляхом до файлів профілю є змінна середовища :envvar:`HOME` або, якщо вона не визначена, то :attr:`os.curdir`.

source: The Tk application object created by instantiating :class:`Tk`. This provides access to the Tcl interpreter. Each widget that is attached the same instance of :class:`Tk` has the same value for its :attr:`tk` attribute.
ru: Объект приложения Tk, созданный путем создания экземпляра :class:`Tk`. Это обеспечивает доступ к интерпретатору Tcl. Каждый виджет, к которому прикреплен один и тот же экземпляр :class:`Tk`, имеет одинаковое значение атрибута :attr:`tk`.
uk: Об’єкт програми Tk, створений шляхом створення екземпляра :class:`Tk`. Це забезпечує доступ до інтерпретатора Tcl. Кожен віджет, до якого приєднано той самий екземпляр :class:`Tk`, має однакове значення для свого атрибута :attr:`tk`.

source: The widget object that contains this widget. For :class:`Tk`, the *master* is :const:`None` because it is the main window. The terms *master* and *parent* are similar and sometimes used interchangeably as argument names; however, calling :meth:`winfo_parent` returns a string of the widget name whereas :attr:`master` returns the object. *parent*/*child* reflects the tree-like relationship while *master*/*slave* reflects the container structure.
ru: Объект виджета, содержащий этот виджет. Для :class:`Tk` *master* имеет значение :const:`None`, поскольку это главное окно. Термины *master* и *parent* похожи и иногда используются как синонимы в качестве имен аргументов; однако вызов :meth:`winfo_parent` возвращает строку имени виджета, тогда как :attr:`master` возвращает объект. *parent*/*child* отражает древовидную связь, а *master*/*slave* отражает структуру контейнера.
uk: Об’єкт віджета, який містить цей віджет. Для :class:`Tk`, *master* є :const:`None`, оскільки це головне вікно. Терміни *master* і *parent* подібні та іноді використовуються як взаємозамінні назви аргументів; однак виклик :meth:`winfo_parent` повертає рядок назви віджета, тоді як :attr:`master` повертає об’єкт. *parent*/*child* відображає деревоподібний зв’язок, тоді як *master*/*slave* відображає структуру контейнера.

source: The immediate descendants of this widget as a :class:`dict` with the child widget names as the keys and the child instance objects as the values.
ru: Непосредственные потомки этого виджета в виде :class:`dict` с именами дочерних виджетов в качестве ключей и объектами дочерних экземпляров в качестве значений.
uk: Безпосередні нащадки цього віджета як :class:`dict` з іменами дочірніх віджетів як ключі та дочірні об’єкти екземплярів як значення.

source: The :func:`Tcl` function is a factory function which creates an object much like that created by the :class:`Tk` class, except that it does not initialize the Tk subsystem. This is most often useful when driving the Tcl interpreter in an environment where one doesn't want to create extraneous toplevel windows, or where one cannot (such as Unix/Linux systems without an X server). An object created by the :func:`Tcl` object can have a Toplevel window created (and the Tk subsystem initialized) by calling its :meth:`loadtk` method.
ru: Функция :func:`Tcl` — это фабричная функция, которая создает объект, очень похожий на объект, созданный классом :class:`Tk`, за исключением того, что она не инициализирует подсистему Tk. Чаще всего это полезно при работе интерпретатора Tcl в среде, где не требуется создавать посторонние окна верхнего уровня или где это невозможно (например, системы Unix/Linux без X-сервера). Для объекта, созданного объектом :func:`Tcl`, может быть создано окно Toplevel (и инициализирована подсистема Tk), вызвав его метод :meth:`loadtk`.
uk: Функція :func:`Tcl` є фабричною функцією, яка створює об’єкт, подібний до створеного класом :class:`Tk`, за винятком того, що вона не ініціалізує підсистему Tk. Це найчастіше корисно, коли керуєте інтерпретатором Tcl у середовищі, де не потрібно створювати сторонні вікна верхнього рівня або де це неможливо (наприклад, системи Unix/Linux без X-сервера). Для об’єкта, створеного об’єктом :func:`Tcl`, можна створити вікно верхнього рівня (та ініціалізувати підсистему Tk), викликавши його метод :meth:`loadtk`.

source: The modules that provide Tk support include:
ru: Модули, обеспечивающие поддержку Tk, включают:
uk: Модулі, які забезпечують підтримку Tk, включають:

source: Main Tkinter module.
ru: Основной модуль Tkinter.
uk: Головний модуль Tkinter.

source: Dialog to let the user choose a color.
ru: Диалоговое окно, позволяющее пользователю выбрать цвет.
uk: Діалогове вікно, у якому користувач може вибрати колір.

source: Base class for the dialogs defined in the other modules listed here.
ru: Базовый класс для диалогов, определенных в других модулях, перечисленных здесь.
uk: Базовий клас для діалогових вікон, визначених в інших модулях, перелічених тут.

source: Common dialogs to allow the user to specify a file to open or save.
ru: Общие диалоговые окна, позволяющие пользователю указать файл для открытия или сохранения.
uk: Загальні діалоги, які дозволяють користувачеві вказати файл для відкриття або збереження.

source: Utilities to help work with fonts.
ru: Утилиты, помогающие работать со шрифтами.
uk: Утиліти для допомоги в роботі зі шрифтами.

source: Access to standard Tk dialog boxes.
ru: Доступ к стандартным диалоговым окнам Tk.
uk: Доступ до стандартних діалогових вікон Tk.

source: Text widget with a vertical scroll bar built in.
ru: Текстовый виджет со встроенной вертикальной полосой прокрутки.
uk: Текстовий віджет із вбудованою вертикальною смугою прокручування.

source: Basic dialogs and convenience functions.
ru: Базовые диалоги и удобные функции.
uk: Основні діалоги та функції зручності.

source: Themed widget set introduced in Tk 8.5, providing modern alternatives for many of the classic widgets in the main :mod:`tkinter` module.
ru: Набор тематических виджетов, представленный в Tk 8.5, предоставляет современные альтернативы многим классическим виджетам в основном модуле :mod:`tkinter`.
uk: Тематичний набір віджетів, представлений у Tk 8.5, надає сучасні альтернативи для багатьох класичних віджетів у головному модулі :mod:`tkinter`.

source: Additional modules:
ru: Дополнительные модули:
uk: Додаткові модулі:

source: A binary module that contains the low-level interface to Tcl/Tk. It is automatically imported by the main :mod:`tkinter` module, and should never be used directly by application programmers. It is usually a shared library (or DLL), but might in some cases be statically linked with the Python interpreter.
ru: Бинарный модуль, содержащий низкоуровневый интерфейс для Tcl/Tk. Он автоматически импортируется основным модулем :mod:`tkinter` и никогда не должен использоваться непосредственно программистами приложений. Обычно это общая библиотека (или DLL), но в некоторых случаях она может быть статически связана с интерпретатором Python.
uk: Двійковий модуль, який містить низькорівневий інтерфейс для Tcl/Tk. Він автоматично імпортується головним модулем :mod:`tkinter` і ніколи не повинен використовуватися безпосередньо програмістами додатків. Зазвичай це спільна бібліотека (або DLL), але в деяких випадках може бути статично пов’язана з інтерпретатором Python.

source: Python's Integrated Development and Learning Environment (IDLE). Based on :mod:`tkinter`.
ru: Интегрированная среда разработки и обучения Python (IDLE). На основе :mod:`tkinter`.
uk: Інтегроване середовище розробки та навчання Python (IDLE). На основі :mod:`tkinter`.

source: Symbolic constants that can be used in place of strings when passing various parameters to Tkinter calls. Automatically imported by the main :mod:`tkinter` module.
ru: Символические константы, которые можно использовать вместо строк при передаче различных параметров в вызовы Tkinter. Автоматически импортируется основным модулем :mod:`tkinter`.
uk: Символічні константи, які можна використовувати замість рядків під час передачі різних параметрів викликам Tkinter. Автоматично імпортується основним модулем :mod:`tkinter`.

source: (experimental) Drag-and-drop support for :mod:`tkinter`. This will become deprecated when it is replaced with the Tk DND.
ru: (экспериментально) Поддержка перетаскивания для :mod:`tkinter`. Это станет устаревшим, когда оно будет заменено на Tk DND.
uk: (експериментальний) Підтримка перетягування для :mod:`tkinter`. Це стане застарілим, коли його буде замінено на Tk DND.

source: (deprecated) An older third-party Tcl/Tk package that adds several new widgets. Better alternatives for most can be found in :mod:`tkinter.ttk`.
ru: (устарело) Старый сторонний пакет Tcl/Tk, который добавляет несколько новых виджетов. Лучшие альтернативы для большинства можно найти в :mod:`tkinter.ttk`.
uk: (застаріло) Старіший сторонній пакет Tcl/Tk, який додає кілька нових віджетів. Кращі альтернативи для більшості можна знайти в :mod:`tkinter.ttk`.

source: Turtle graphics in a Tk window.
ru: Графика черепахи в окне Tk.
uk: Графіка Turtle у вікні Tk.

source: Notes:
ru: Примечания:
uk: Примітки:

source: *options*
uk: *опції*

source: For example::
ru: Например::
uk: Наприклад::

source: Handy Reference
ru: Удобная ссылка
uk: Зручний довідник

source: Setting Options
ru: Параметры настройки
uk: Параметри налаштування

source: Options control things like the color and border width of a widget. Options can be set in three ways:
ru: Параметры управляют такими вещами, как цвет и ширина границы виджета. Параметры можно установить тремя способами:
uk: Параметри контролюють такі речі, як колір і ширина рамки віджета. Параметри можна встановити трьома способами:

source: At object creation time, using keyword arguments
ru: Во время создания объекта с использованием аргументов ключевого слова
uk: Під час створення об’єкта, використовуючи ключові аргументи

source: After object creation, treating the option name like a dictionary index
ru: После создания объекта обращение с именем параметра как с индексом словаря.
uk: Після створення об’єкта назва параметра розглядається як індекс словника

source: Use the config() method to update multiple attrs subsequent to object creation
ru: Используйте метод config() для обновления нескольких атрибутов после создания объекта.
uk: Використовуйте метод config() для оновлення кількох атрибутів після створення об’єкта

source: For a complete explanation of a given option and its behavior, see the Tk man pages for the widget in question.
ru: Полное объяснение данной опции и ее поведения см. на страницах руководства Tk для рассматриваемого виджета.
uk: Щоб отримати повне пояснення даного параметра та його поведінки, перегляньте сторінки довідки Tk для відповідного віджета.

source: Note that the man pages list "STANDARD OPTIONS" and "WIDGET SPECIFIC OPTIONS" for each widget. The former is a list of options that are common to many widgets, the latter are the options that are idiosyncratic to that particular widget. The Standard Options are documented on the :manpage:`options(3)` man page.
ru: Обратите внимание, что на страницах руководства для каждого виджета перечислены «СТАНДАРТНЫЕ ОПЦИИ» и «СПЕЦИАЛЬНЫЕ ОПЦИИ ВИДЖЕТА». Первый представляет собой список параметров, общих для многих виджетов, второй — это параметры, специфичные для этого конкретного виджета. Стандартные параметры описаны на странице руководства :manpage:`options(3)`.
uk: Зауважте, що на довідкових сторінках перераховано "СТАНДАРТНІ ПАРАМЕТРИ" та "СПЕЦИФІЧНІ ПАРАМЕТРИ ВІДЖЕТА" для кожного віджета. Перший — це список параметрів, які є спільними для багатьох віджетів, другий — параметри, які є ідіосинкратичними для цього конкретного віджета. Стандартні параметри задокументовані на сторінці довідки :manpage:`options(3)`.
