Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/tkinter.po
Languages: ru, uk

source: No distinction between standard and widget-specific options is made in this document. Some options don't apply to some kinds of widgets. Whether a given widget responds to a particular option depends on the class of the widget; buttons have a ``command`` option, labels do not.
ru: В этом документе не делается различий между стандартными и специфичными для виджета опциями. Некоторые параметры не применимы к некоторым видам виджетов. Реагирует ли данный виджет на конкретную опцию, зависит от класса виджета; кнопки имеют опцию ``команда``, метки — нет.
uk: У цьому документі не робиться різниці між стандартними параметрами та параметрами, що стосуються окремих віджетів. Деякі параметри не застосовуються до деяких типів віджетів. Чи відповідає даний віджет певній опції, залежить від класу віджета; кнопки мають параметр ``команда``, а мітки — ні.

source: The options supported by a given widget are listed in that widget's man page, or can be queried at runtime by calling the :meth:`config` method without arguments, or by calling the :meth:`keys` method on that widget. The return value of these calls is a dictionary whose key is the name of the option as a string (for example, ``'relief'``) and whose values are 5-tuples.
ru: Параметры, поддерживаемые данным виджетом, перечислены на странице руководства этого виджета или могут быть запрошены во время выполнения, вызвав метод :meth:`config` без аргументов или вызвав метод :meth:`keys` для этого виджета. Возвращаемым значением этих вызовов является словарь, ключом которого является имя опции в виде строки (например, ``'relief'``), а значениями являются 5-кортежи.
uk: Параметри, які підтримує певний віджет, перераховані на сторінці довідки цього віджета, або їх можна запитати під час виконання, викликавши метод :meth:`config` без аргументів або викликавши метод :meth:`keys` у цьому віджеті. Поверненим значенням цих викликів є словник, ключем якого є ім’я опції у вигляді рядка (наприклад, ``'relief'``), а значеннями є 5-ти кортежі.

source: Some options, like ``bg`` are synonyms for common options with long names (``bg`` is shorthand for "background"). Passing the ``config()`` method the name of a shorthand option will return a 2-tuple, not 5-tuple. The 2-tuple passed back will contain the name of the synonym and the "real" option (such as ``('bg', 'background')``).
ru: Некоторые параметры, например ``bg``, являются синонимами общих опций с длинными именами (``bg`` — сокращение от слова "фон"). При передаче метода ``config()`` имя сокращенной опции вернет двухкортеж, а не пятикортеж. Переданный обратно кортеж из двух будет содержать имя синонима и «реальный» параметр (например, ``('bg', 'background')``).
uk: Деякі параметри, як-от ``bg``, є синонімами поширених параметрів із довгими назвами (``bg`` є скороченням від "фон"). Передача методу ``config()`` імені скороченого параметра поверне 2-кортеж, а не 5-кортеж. 2-кортеж, переданий назад, міститиме назву синоніму та "справжній" параметр (наприклад, ``('bg', 'background')``).

source: Index
ru: Индекс
uk: Індекс

source: Meaning
ru: Значение
uk: Значення

source: Example
ru: Пример
uk: приклад

source: option name
ru: имя опции
uk: назва опції

source: ``'relief'``
uk: ``''рельєф'``

source: option name for database lookup
ru: имя опции для поиска в базе данных
uk: назва параметра для пошуку в базі даних

source: option class for database lookup
ru: класс опций для поиска в базе данных
uk: клас параметрів для пошуку в базі даних

source: ``'Relief'``
uk: ``'Рельєф'``

source: default value
ru: значение по умолчанию
uk: значення за замовчуванням

source: ``'raised'``
uk: ``'піднятий''``

source: current value
ru: текущее значение
uk: поточне значення

source: ``'groove'``
uk: ``'канавки'``

source: Example::
ru: Пример::
uk: Приклад::

source: Of course, the dictionary printed will include all the options available and their values. This is meant only as an example.
ru: Конечно, распечатанный словарь будет включать все доступные параметры и их значения. Это предназначено только в качестве примера.
uk: Звичайно, надрукований словник міститиме всі доступні варіанти та їхні значення. Це лише як приклад.

source: The Packer
ru: Упаковщик
uk: Пакувальник

source: The packer is one of Tk's geometry-management mechanisms. Geometry managers are used to specify the relative positioning of widgets within their container - their mutual *master*. In contrast to the more cumbersome *placer* (which is used less commonly, and we do not cover here), the packer takes qualitative relationship specification - *above*, *to the left of*, *filling*, etc - and works everything out to determine the exact placement coordinates for you.
ru: Пакер — это один из механизмов управления геометрией Tk. Менеджеры геометрии используются для указания относительного расположения виджетов внутри их контейнера — их общего *мастера*. В отличие от более громоздкого *placer* (который используется реже, и мы здесь не рассматриваем), упаковщик принимает качественную спецификацию отношений — *над*, *слева от*, *заполнение* и т. д. — и работает. все для того, чтобы определить для вас точные координаты размещения.
uk: Пакер є одним із механізмів управління геометрією Tk. Менеджери геометрії використовуються для вказівки відносного розташування віджетів у їхньому контейнері - їхньому спільному *master*. На відміну від більш громіздкого *розсипу* (який використовується рідше, і ми не розглядаємо його тут), пакувальник бере якісну специфікацію зв’язку – *вгорі*, *ліворуч*, *заповнення* тощо – і працює все, щоб визначити для вас точні координати розміщення.

source: The size of any *master* widget is determined by the size of the "slave widgets" inside. The packer is used to control where slave widgets appear inside the master into which they are packed. You can pack widgets into frames, and frames into other frames, in order to achieve the kind of layout you desire. Additionally, the arrangement is dynamically adjusted to accommodate incremental changes to the configuration, once it is packed.
ru: Размер любого *главного* виджета определяется размером «ведомых виджетов» внутри него. Упаковщик используется для управления тем, где подчиненные виджеты появляются внутри главного, в который они упакованы. Вы можете упаковывать виджеты в фреймы, а фреймы в другие фреймы, чтобы добиться желаемого макета. Кроме того, компоновка динамически корректируется для внесения дополнительных изменений в конфигурацию после ее упаковки.
uk: Розмір будь-якого *головного* віджета визначається розміром "підлеглих віджетів" усередині. Пакувальник використовується для керування тим, де підпорядковані віджети з’являються всередині головного, у який вони упаковані. Ви можете запакувати віджети у фрейми, а фрейми – в інші фрейми, щоб отримати потрібний вам макет. Крім того, компонування динамічно налаштовується для врахування поступових змін конфігурації після того, як воно упаковане.

source: Note that widgets do not appear until they have had their geometry specified with a geometry manager. It's a common early mistake to leave out the geometry specification, and then be surprised when the widget is created but nothing appears. A widget will appear only after it has had, for example, the packer's :meth:`pack` method applied to it.
ru: Обратите внимание, что виджеты не отображаются до тех пор, пока их геометрия не будет указана с помощью менеджера геометрии. Распространенной ошибкой на ранних этапах является отсутствие спецификации геометрии, а затем удивление, когда виджет создается, но ничего не появляется. Виджет появится только после того, как к нему был применен, например, метод упаковщика :meth:`pack`.
uk: Зауважте, що віджети не з’являться, доки їхню геометрію не буде визначено за допомогою менеджера геометрії. Поширеною ранньою помилкою є пропуск специфікації геометрії, а потім дивуватися, коли віджет створено, але нічого не з’явиться. Віджет з’явиться лише після того, як до нього буде застосовано, наприклад, метод пакувальника :meth:`pack`.

source: The pack() method can be called with keyword-option/value pairs that control where the widget is to appear within its container, and how it is to behave when the main application window is resized. Here are some examples::
ru: Метод package() можно вызвать с парами ключевое слово-опция/значение, которые определяют, где виджет должен появиться в контейнере и как он должен вести себя при изменении размера главного окна приложения. Вот несколько примеров:
uk: Метод pack() можна викликати за допомогою пар ключове слово-параметр/значення, які визначають, де віджет має з’являтися в своєму контейнері та як він має поводитися, коли змінюється розмір головного вікна програми. Ось кілька прикладів:

source: Packer Options
ru: Параметры упаковщика
uk: Опції пакувальника

source: For more extensive information on the packer and the options that it can take, see the man pages and page 183 of John Ousterhout's book.
ru: Более подробную информацию об упаковщике и возможных для него опциях можно найти на страницах руководства и на странице 183 книги Джона Оустерхаута.
uk: Щоб отримати докладнішу інформацію про пакувальник і параметри, які він може приймати, перегляньте сторінки довідки та сторінку 183 книги Джона Оустерхаута.

source: anchor
ru: якорь
uk: якір

source: Anchor type. Denotes where the packer is to place each slave in its parcel.
ru: Тип якоря. Обозначает, где упаковщик должен разместить каждое подчиненное устройство в своей посылке.
uk: Якірний тип. Позначає, де пакувальник має розмістити кожного підлеглого у своїй посилці.

source: expand
ru: расширять
uk: розширити

source: Boolean, ``0`` or ``1``.
uk: Логічне значення, ``0`` або ``1``.

source: fill
uk: заповнити

source: Legal values: ``'x'``, ``'y'``, ``'both'``, ``'none'``.
ru: Допустимые значения: ``'x'``, ``'y'``, ``'both'``, ``'none'``.
uk: Правильні значення: ``'x'``, ``'y'``, ``'both'``, ``'none'``.

source: ipadx and ipady
ru: ipadx и ipady
uk: ipadx і ipady

source: A distance - designating internal padding on each side of the slave widget.
ru: Расстояние — обозначение внутренних отступов с каждой стороны подчиненного виджета.
uk: Відстань — позначення внутрішнього відступу з кожного боку підлеглого віджета.

source: padx and pady
ru: Падкс и Пади
uk: padx і pady

source: A distance - designating external padding on each side of the slave widget.
ru: Расстояние — обозначение внешних отступов с каждой стороны подчиненного виджета.
uk: Відстань — позначення зовнішніх відступів з кожного боку підлеглого віджета.

source: side
ru: сторона
uk: бік

source: Legal values are: ``'left'``, ``'right'``, ``'top'``, ``'bottom'``.
ru: Допустимые значения: ``'left'``, ``'right'``, ``'top'``, ``'bottom'``.
uk: Допустимі значення: ``'left'``, ``'right'``, ``'top'``, ``'bottom'``.

source: Coupling Widget Variables
ru: Связывание переменных виджета
uk: З’єднання змінних віджетів

source: The current-value setting of some widgets (like text entry widgets) can be connected directly to application variables by using special options. These options are ``variable``, ``textvariable``, ``onvalue``, ``offvalue``, and ``value``. This connection works both ways: if the variable changes for any reason, the widget it's connected to will be updated to reflect the new value.
ru: Настройки текущего значения некоторых виджетов (например, виджетов ввода текста) можно напрямую связать с переменными приложения с помощью специальных опций. Этими опциями являются ``variable``, ``textvariable``, ``onvalue``, ``offvalue`` и ``value``. Это соединение работает в обе стороны: если переменная по какой-либо причине изменится, виджет, к которому она подключена, будет обновлен, чтобы отразить новое значение.
uk: Налаштування поточного значення деяких віджетів (наприклад, віджетів для введення тексту) можна підключити безпосередньо до змінних програми за допомогою спеціальних параметрів. Ці параметри: ``variable``, ``textvariable``, ``onvalue``, ``offvalue`` і ``value``. Це підключення працює в обох напрямках: якщо змінна змінюється з будь-якої причини, віджет, до якого вона підключена, буде оновлено, щоб відобразити нове значення.

source: Unfortunately, in the current implementation of :mod:`tkinter` it is not possible to hand over an arbitrary Python variable to a widget through a ``variable`` or ``textvariable`` option. The only kinds of variables for which this works are variables that are subclassed from a class called Variable, defined in :mod:`tkinter`.
ru: К сожалению, в текущей реализации :mod:`tkinter` невозможно передать произвольную переменную Python виджету через опцию ``variable`` или ``textvariable``. Единственные типы переменных, для которых это работает, — это переменные, которые являются подклассами класса Variable, определенного в :mod:`tkinter`.
uk: На жаль, у поточній реалізації :mod:`tkinter` неможливо передати довільну змінну Python у віджет за допомогою опції ``variable`` або ``textvariable``. Єдині типи змінних, для яких це працює, це змінні, які є підкласами класу під назвою Variable, визначеного в :mod:`tkinter`.

source: There are many useful subclasses of Variable already defined: :class:`StringVar`, :class:`IntVar`, :class:`DoubleVar`, and :class:`BooleanVar`. To read the current value of such a variable, call the :meth:`get` method on it, and to change its value you call the :meth:`!set` method. If you follow this protocol, the widget will always track the value of the variable, with no further intervention on your part.
ru: Уже определено много полезных подклассов Variable: :class:`StringVar`, :class:`IntVar`, :class:`DoubleVar` и :class:`BooleanVar`. Чтобы прочитать текущее значение такой переменной, вызовите для нее метод :meth:`get`, а чтобы изменить ее значение, вы вызываете метод :meth:`!set`. Если вы будете следовать этому протоколу, виджет всегда будет отслеживать значение переменной без какого-либо дальнейшего вмешательства с вашей стороны.
uk: Уже визначено багато корисних підкласів Variable: :class:`StringVar`, :class:`IntVar`, :class:`DoubleVar` і :class:`BooleanVar`. Щоб прочитати поточне значення такої змінної, викличте для неї метод :meth:`get`, а щоб змінити її значення, викличте метод :meth:`!set`. Якщо ви дотримуєтеся цього протоколу, віджет завжди відстежуватиме значення змінної без подальшого втручання з вашого боку.

source: The Window Manager
ru: Оконный менеджер
uk: Менеджер вікон

source: In Tk, there is a utility command, ``wm``, for interacting with the window manager. Options to the ``wm`` command allow you to control things like titles, placement, icon bitmaps, and the like. In :mod:`tkinter`, these commands have been implemented as methods on the :class:`Wm` class. Toplevel widgets are subclassed from the :class:`Wm` class, and so can call the :class:`Wm` methods directly.
ru: В Tk есть служебная команда wm для взаимодействия с оконным менеджером. Параметры команды ``wm`` позволяют вам управлять такими вещами, как заголовки, размещение, растровые изображения значков и тому подобное. В :mod:`tkinter` эти команды реализованы как методы класса :class:`Wm`. Виджеты верхнего уровня являются подклассами класса :class:`Wm` и поэтому могут напрямую вызывать методы :class:`Wm`.
uk: У Tk є службова команда ``wm`` для взаємодії з менеджером вікон. Параметри команди ``wm`` дозволяють керувати такими речами, як заголовки, розташування, растрові зображення піктограм тощо. У :mod:`tkinter` ці команди реалізовано як методи класу :class:`Wm`. Віджети верхнього рівня є підкласами класу :class:`Wm`, тому можуть безпосередньо викликати методи :class:`Wm`.

source: To get at the toplevel window that contains a given widget, you can often just refer to the widget's master. Of course if the widget has been packed inside of a frame, the master won't represent a toplevel window. To get at the toplevel window that contains an arbitrary widget, you can call the :meth:`_root` method. This method begins with an underscore to denote the fact that this function is part of the implementation, and not an interface to Tk functionality.
ru: Чтобы перейти к окну верхнего уровня, содержащему данный виджет, часто можно просто обратиться к мастеру виджета. Конечно, если виджет упакован внутри фрейма, мастер не будет представлять окно верхнего уровня. Чтобы перейти к окну верхнего уровня, содержащему произвольный виджет, вы можете вызвать метод :meth:`_root`. Этот метод начинается с подчеркивания, обозначающего тот факт, что эта функция является частью реализации, а не интерфейсом к функциональности Tk.
uk: Щоб отримати доступ до вікна верхнього рівня, яке містить даний віджет, ви часто можете просто звернутися до майстра віджета. Звичайно, якщо віджет було упаковано всередину фрейму, майстер не представлятиме вікно верхнього рівня. Щоб отримати доступ до вікна верхнього рівня, яке містить довільний віджет, ви можете викликати метод :meth:`_root`. Цей метод починається з підкреслення, щоб позначити той факт, що ця функція є частиною реалізації, а не інтерфейсом до функціональності Tk.

source: Here are some examples of typical usage::
ru: Вот несколько примеров типичного использования:
uk: Ось кілька прикладів типового використання:

source: Tk Option Data Types
ru: Tk Option типы данных
uk: Типи даних параметрів Tk

source: Legal values are points of the compass: ``"n"``, ``"ne"``, ``"e"``, ``"se"``, ``"s"``, ``"sw"``, ``"w"``, ``"nw"``, and also ``"center"``.
ru: значения — это точки компаса: ``"n"``, ``"ne"``, ``"e"``, ``"se"``, ``"s"``, `` «sw», «w», «nw», а также «center».
uk: Правовими значеннями є точки компаса: ``"n"``, ``"ne"``, ``"e"``, ``"se"``, ``"s"``, ``"sw"``, ``"w"``, ``"nw"``, а також ``"center"``.

source: bitmap
ru: растровое изображение
uk: растрове зображення

source: There are eight built-in, named bitmaps: ``'error'``, ``'gray25'``, ``'gray50'``, ``'hourglass'``, ``'info'``, ``'questhead'``, ``'question'``, ``'warning'``. To specify an X bitmap filename, give the full path to the file, preceded with an ``@``, as in ``"@/usr/contrib/bitmap/gumby.bit"``.
ru: Имеется восемь встроенных именованных растровых изображений: ``'error'``, ``'gray25'``, ``'gray50'``, ``'песочные часы'``, ``'info'``, ``'questhead'``, ``'вопрос'``, ``'предупреждение'``. Чтобы указать имя файла растрового изображения X, укажите полный путь к файлу, которому предшествует ``@``, например ``"@/usr/contrib/bitmap/gumby.bit"``.
uk: Є вісім вбудованих іменованих растрових зображень: ``'error'``, ``'gray25'``, ``'gray50'``, ``'hourglass'``, ``'info'``, ``'questhead'``, ``'питання'``, ``'попередження''``. Щоб вказати ім’я файлу растрового зображення X, укажіть повний шлях до файлу, перед яким стоїть ``@``, як у ``"@/usr/contrib/bitmap/gumby.bit"``.

source: boolean
ru: логическое значение
uk: логічний

source: You can pass integers 0 or 1 or the strings ``"yes"`` or ``"no"``.
ru: Вы можете передавать целые числа 0 или 1 или строки ``"да"`` или ``"нет"``.
uk: Ви можете передати цілі числа 0 або 1 або рядки ``"yes"`` чи ``"no"``.

source: callback
ru: функция обратного вызова
uk: зворотній дзвінок

source: This is any Python function that takes no arguments. For example::
ru: Это любая функция Python, не принимающая аргументов. Например::
uk: Це будь-яка функція Python, яка не приймає аргументів. Наприклад::

source: color
ru: цвет
uk: колір

source: Colors can be given as the names of X colors in the rgb.txt file, or as strings representing RGB values in 4 bit: ``"#RGB"``, 8 bit: ``"#RRGGBB"``, 12 bit: ``"#RRRGGGBBB"``, or 16 bit: ``"#RRRRGGGGBBBB"`` ranges, where R,G,B here represent any legal hex digit. See page 160 of Ousterhout's book for details.
ru: Цвета могут быть заданы как имена X цветов в файле rgb.txt или как строки, представляющие значения RGB в 4 битах: ``"#RGB"``, 8 бит: ``"#RRGGBB"``, 12 бит : ``"#RRRGGGBBB"`` или 16-битные: ``"#RRRRGGGGBBBB"`` диапазоны, где R,G,B здесь представляют любую допустимую шестнадцатеричную цифру. Подробности см. на странице 160 книги Оустерхаута.
uk: Кольори можна вказати як назви кольорів X у файлі rgb.txt або як рядки, що представляють значення RGB у 4 бітах: ``"#RGB"``, 8 бітах: ``"#RRGGBB"``, 12 бітах : ``"#RRRGGGBBB"``, або 16 біт: ``"#RRRRGGGBBBB"`` діапазони, де R, G, B тут представляють будь-яку допустиму шістнадцяткову цифру. Подробиці дивіться на сторінці 160 книги Оустерхаута.

source: cursor
ru: курсор
uk: курсор

source: The standard X cursor names from :file:`cursorfont.h` can be used, without the ``XC_`` prefix. For example to get a hand cursor (:const:`XC_hand2`), use the string ``"hand2"``. You can also specify a bitmap and mask file of your own. See page 179 of Ousterhout's book.
ru: Можно использовать стандартные имена курсоров X из файла:cursorfont.h без префикса XC_. Например, чтобы получить курсор в виде руки (:const:`XC_hand2`), используйте строку ``"hand2"``. Вы также можете указать собственное растровое изображение и файл маски. См. страницу 179 книги Оустерхаута.
uk: Можна використовувати стандартні імена курсорів X із :file:`cursorfont.h` без префікса ``XC_``. Наприклад, щоб отримати курсор руки (:const:`XC_hand2`), використовуйте рядок ``"hand2"``. Ви також можете вказати власний растровий файл і файл маски. Дивіться сторінку 179 книги Оустерхаута.

source: distance
ru: расстояние
uk: відстань

source: Screen distances can be specified in either pixels or absolute distances. Pixels are given as numbers and absolute distances as strings, with the trailing character denoting units: ``c`` for centimetres, ``i`` for inches, ``m`` for millimetres, ``p`` for printer's points. For example, 3.5 inches is expressed as ``"3.5i"``.
ru: Расстояния до экрана могут быть указаны как в пикселях, так и в абсолютных расстояниях. Пиксели задаются в виде чисел, а абсолютные расстояния в виде строк, с конечным символом, обозначающим единицы измерения: ``c`` для сантиметров, ``i`` для дюймов, ``m`` для миллиметров, ``p`` для принтерных точек. . Например, 3,5 дюйма выражаются как ``"3.5i"``.
uk: Відстань до екрана можна вказати як у пікселях, так і в абсолютних відстанях. Пікселі подаються у вигляді чисел, а абсолютні відстані – у вигляді рядків із кінцевим символом, що позначає одиниці: ``c`` для сантиметрів, ``i`` для дюймів, ``m`` для міліметрів, ``p`` для точок принтера . Наприклад, 3,5 дюйма виражається як ``"3,5i"``.

source: font
ru: шрифт
uk: шрифт

source: Tk uses a list font name format, such as ``{courier 10 bold}``. Font sizes with positive numbers are measured in points; sizes with negative numbers are measured in pixels.
ru: Tk использует формат имени списка шрифтов, например ``{courier 10 Bold}``. Размеры шрифта с положительными числами измеряются в пунктах; размеры с отрицательными числами измеряются в пикселях.
uk: Tk використовує формат назви шрифту списку, наприклад ``{courier 10 bold}``. Розмір шрифту з додатними числами вимірюється в пунктах; розміри з від’ємними числами вимірюються в пікселях.

source: geometry
ru: геометрия
uk: геометрія

source: This is a string of the form ``widthxheight``, where width and height are measured in pixels for most widgets (in characters for widgets displaying text). For example: ``fred["geometry"] = "200x100"``.
ru: Это строка вида «ширинаxвысота», где ширина и высота для большинства виджетов измеряются в пикселях (в символах для виджетов, отображающих текст). Например: ``fred["geometry"] = "200x100"``.
uk: Це рядок у формі ``ширинаxвисота``, де ширина та висота вимірюються в пікселях для більшості віджетів (у символах для віджетів, що відображають текст). Наприклад: ``fred["geometry"] = "200x100"``.

source: justify
ru: выровнить
uk: виправдати

source: Legal values are the strings: ``"left"``, ``"center"``, ``"right"``, and ``"fill"``.
ru: Допустимыми значениями являются строки: ``"left"``, ``"center"``, ``"right"`` и ``"fill"``.
uk: Правильними значеннями є рядки: ``"left"``, ``"center"``, ``"right"`` і ``"fill"``.
