Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/tkinter.ttk.po
Languages: ru

source: Each item should have the same number of values as the widget option columns. If there are fewer values than columns, the remaining values are assumed empty. If there are more values than columns, the extra values are ignored.
ru: Каждый элемент должен иметь то же количество значений, что и столбцы параметров виджета. Если значений меньше, чем столбцов, остальные значения считаются пустыми. Если значений больше, чем столбцов, дополнительные значения игнорируются.

source: open
ru: открыть

source: ``True``/``False`` value indicating whether the item's children should be displayed or hidden.
ru: Значение ``True``/``False``, указывающее, должны ли дочерние элементы элемента отображаться или скрываться.

source: tags
ru: теги

source: Tag Options
ru: Параметры тегов

source: The following options may be specified on tags:
ru: На тегах могут быть указаны следующие параметры:

source: foreground
ru: передний план

source: Specifies the text foreground color.
ru: Определяет цвет переднего плана текста.

source: Specifies the cell or item background color.
ru: Указывает цвет фона ячейки или элемента.

source: font
ru: шрифт

source: Specifies the font to use when drawing text.
ru: Указывает шрифт, который будет использоваться при рисовании текста.

source: Specifies the item image, in case the item's image option is empty.
ru: Указывает изображение элемента, если параметр изображения элемента пуст.

source: Column Identifiers
ru: Идентификаторы столбцов

source: Column identifiers take any of the following forms:
ru: Идентификаторы столбцов могут принимать любую из следующих форм:

source: A symbolic name from the list of columns option.
ru: Символическое имя из опции списка столбцов.

source: An integer n, specifying the nth data column.
ru: Целое число n, указывающее n-й столбец данных.

source: A string of the form #n, where n is an integer, specifying the nth display column.
ru: Строка вида #n, где n — целое число, определяющее n-й столбец отображения.

source: Notes:
ru: Примечания:

source: Item's option values may be displayed in a different order than the order in which they are stored.
ru: Значения параметров элемента могут отображаться в порядке, отличном от того, в котором они хранятся.

source: Column #0 always refers to the tree column, even if show="tree" is not specified.
ru: Столбец №0 всегда относится к столбцу дерева, даже если не указано значение show="tree".

source: A data column number is an index into an item's option values list; a display column number is the column number in the tree where the values are displayed. Tree labels are displayed in column #0. If option displaycolumns is not set, then data column n is displayed in column #n+1. Again, **column #0 always refers to the tree column**.
ru: Номер столбца данных — это индекс в списке значений опций элемента; Номер столбца отображения — это номер столбца в дереве, где отображаются значения. Метки дерева отображаются в столбце №0. Если опция displaycolumns не установлена, то столбец данных n отображается в столбце #n+1. Опять же, **столбец №0 всегда относится к столбцу дерева**.

source: The Treeview widget generates the following virtual events.
ru: Виджет Treeview генерирует следующие виртуальные события.

source: Event
ru: Событие

source: Generated whenever the selection changes.
ru: Генерируется всякий раз, когда изменяется выбор.

source: Generated just before settings the focus item to open=True.
ru: Создается непосредственно перед установкой элемента фокуса на open=True.

source: Generated just after setting the focus item to open=False.
ru: Создается сразу после установки элемента фокуса на open=False.

source: The :meth:`Treeview.focus` and :meth:`Treeview.selection` methods can be used to determine the affected item or items.
ru: Методы :meth:`Treeview.focus` и :meth:`Treeview.selection` могут использоваться для определения затронутого элемента или элементов.

source: Returns the bounding box (relative to the treeview widget's window) of the specified *item* in the form (x, y, width, height).
ru: Возвращает ограничивающую рамку (относительно окна виджета в виде дерева) указанного *элемента* в форме (x, y, ширина, высота).

source: If *column* is specified, returns the bounding box of that cell. If the *item* is not visible (i.e., if it is a descendant of a closed item or is scrolled offscreen), returns an empty string.
ru: Если указан *столбец*, возвращает ограничивающую рамку этой ячейки. Если *элемент* не виден (т. е. если он является потомком закрытого элемента или прокручивается за пределы экрана), возвращает пустую строку.

source: Returns the list of children belonging to *item*.
ru: Возвращает список дочерних элементов, принадлежащих *item*.

source: If *item* is not specified, returns root children.
ru: Если *item* не указан, возвращает корневые дочерние элементы.

source: Replaces *item*'s child with *newchildren*.
ru: Заменяет дочернего элемента *item* на *newchildren*.

source: Children present in *item* that are not present in *newchildren* are detached from the tree. No items in *newchildren* may be an ancestor of *item*. Note that not specifying *newchildren* results in detaching *item*'s children.
ru: Дети, присутствующие в *item*, которых нет в *newchildren*, отделяются от дерева. Ни один элемент в *newchildren* не может быть предком *item*. Обратите внимание, что отсутствие указания *newchildren* приводит к отсоединению дочерних элементов *item*.

source: Query or modify the options for the specified *column*.
ru: Запросите или измените параметры для указанного *столбца*.

source: If *kw* is not given, returns a dict of the column option values. If *option* is specified then the value for that *option* is returned. Otherwise, sets the options to the corresponding values.
ru: Если *kw* не указано, возвращает список значений параметров столбца. Если указана *опция*, возвращается значение этой *опции*. В противном случае для параметров устанавливаются соответствующие значения.

source: The valid options/values are:
ru: Допустимые параметры/значения:

source: Returns the column name. This is a read-only option.
ru: Возвращает имя столбца. Это опция только для чтения.

source: *anchor*: One of the standard Tk anchor values.
ru: *anchor*: одно из стандартных значений привязки Tk.

source: Specifies how the text in this column should be aligned with respect to the cell.
ru: Указывает, как текст в этом столбце должен быть выровнен относительно ячейки.

source: *minwidth*: width
ru: *minwidth*: ширина

source: The minimum width of the column in pixels. The treeview widget will not make the column any smaller than specified by this option when the widget is resized or the user drags a column.
ru: Минимальная ширина столбца в пикселях. Виджет древовидного представления не будет уменьшать размер столбца, чем указано в этом параметре, когда размер виджета изменяется или пользователь перетаскивает столбец.

source: Specifies whether the column's width should be adjusted when the widget is resized.
ru: Указывает, следует ли регулировать ширину столбца при изменении размера виджета.

source: The width of the column in pixels.
ru: Ширина столбца в пикселях.

source: To configure the tree column, call this with column = "#0"
ru: Чтобы настроить столбец дерева, вызовите его с помощью столбца = «#0».

source: Delete all specified *items* and all their descendants.
ru: Удалить все указанные *элементы* и всех их потомков.

source: The root item may not be deleted.
ru: Корневой элемент не может быть удален.

source: Unlinks all of the specified *items* from the tree.
ru: Отключает все указанные *элементы* от дерева.

source: The items and all of their descendants are still present, and may be reinserted at another point in the tree, but will not be displayed.
ru: Элементы и все их потомки по-прежнему присутствуют и могут быть повторно вставлены в другую точку дерева, но не будут отображаться.

source: The root item may not be detached.
ru: Корневой элемент нельзя отсоединить.

source: Returns ``True`` if the specified *item* is present in the tree.
ru: Возвращает ``True``, если указанный *элемент* присутствует в дереве.

source: If *item* is specified, sets the focus item to *item*. Otherwise, returns the current focus item, or '' if there is none.
ru: Если указан *item*, элемент фокуса устанавливается на *item*. В противном случае возвращает текущий элемент фокуса или '', если его нет.

source: Query or modify the heading options for the specified *column*.
ru: Запросите или измените параметры заголовка для указанного *столбца*.

source: If *kw* is not given, returns a dict of the heading option values. If *option* is specified then the value for that *option* is returned. Otherwise, sets the options to the corresponding values.
ru: Если *kw* не указано, возвращает список значений параметров заголовка. Если указана *опция*, возвращается значение этой *опции*. В противном случае для параметров устанавливаются соответствующие значения.

source: *text*: text
ru: *text*: текст

source: The text to display in the column heading.
ru: Текст, который будет отображаться в заголовке столбца.

source: Specifies an image to display to the right of the column heading.
ru: Указывает изображение, отображаемое справа от заголовка столбца.

source: *anchor*: anchor
ru: *anchor*: якорь

source: Specifies how the heading text should be aligned. One of the standard Tk anchor values.
ru: Указывает, как должен быть выровнен текст заголовка. Одно из стандартных значений привязки Tk.

source: A callback to be invoked when the heading label is pressed.
ru: Обратный вызов, который будет вызываться при нажатии метки заголовка.

source: To configure the tree column heading, call this with column = "#0".
ru: Чтобы настроить заголовок столбца дерева, вызовите его со столбцом = «#0».

source: Returns a description of the specified *component* under the point given by *x* and *y*, or the empty string if no such *component* is present at that position.
ru: Возвращает описание указанного *компонента* в точке, заданной *x* и *y*, или пустую строку, если такой *компонент* отсутствует в этой позиции.

source: Returns the item ID of the item at position *y*.
ru: Возвращает идентификатор элемента в позиции *y*.

source: Returns the data column identifier of the cell at position *x*.
ru: Возвращает идентификатор столбца данных ячейки в позиции *x*.

source: The tree column has ID #0.
ru: Столбец дерева имеет идентификатор #0.

source: Returns one of:
ru: Возвращает одно из:

source: region
ru: регион

source: meaning
ru: значение

source: heading
ru: заголовок

source: Tree heading area.
ru: Область заголовка дерева.

source: separator
ru: сепаратор

source: Space between two columns headings.
ru: Пробел между заголовками двух столбцов.

source: tree
ru: дерево

source: The tree area.
ru: Область деревьев.

source: cell
ru: клетка

source: A data cell.
ru: Ячейка данных.

source: Availability: Tk 8.6.
ru: Доступность: Tk 8.6.

source: Returns the element at position *x*, *y*.
ru: Возвращает элемент в позиции *x*, *y*.

source: Returns the integer index of *item* within its parent's list of children.
ru: Возвращает целочисленный индекс *item* в списке дочерних элементов его родителя.

source: Creates a new item and returns the item identifier of the newly created item.
ru: Создает новый элемент и возвращает идентификатор вновь созданного элемента.

source: *parent* is the item ID of the parent item, or the empty string to create a new top-level item. *index* is an integer, or the value "end", specifying where in the list of parent's children to insert the new item. If *index* is less than or equal to zero, the new node is inserted at the beginning; if *index* is greater than or equal to the current number of children, it is inserted at the end. If *iid* is specified, it is used as the item identifier; *iid* must not already exist in the tree. Otherwise, a new unique identifier is generated.
ru: *parent* — это идентификатор родительского элемента или пустая строка для создания нового элемента верхнего уровня. *index* — целое число или значение «конец», указывающее, куда в списке дочерних элементов родителя вставить новый элемент. Если *index* меньше или равен нулю, новый узел вставляется в начало; если *index* больше или равен текущему количеству дочерних элементов, он вставляется в конец. Если указан *iid*, он используется как идентификатор элемента; *iid* не должен существовать в дереве. В противном случае генерируется новый уникальный идентификатор.

source: See `Item Options`_ for the list of available options.
ru: См. `Параметры элемента`_ для списка доступных опций.

source: Query or modify the options for the specified *item*.
ru: Запросите или измените параметры для указанного *элемента*.

source: If no options are given, a dict with options/values for the item is returned. If *option* is specified then the value for that option is returned. Otherwise, sets the options to the corresponding values as given by *kw*.
ru: Если параметры не указаны, возвращается словарь с параметрами/значениями для элемента. Если указана опция *option*, возвращается значение этой опции. В противном случае для параметров устанавливаются соответствующие значения, заданные *kw*.

source: Moves *item* to position *index* in *parent*'s list of children.
ru: Перемещает *item* на позицию *index* в списке дочерних элементов *родителя*.

source: It is illegal to move an item under one of its descendants. If *index* is less than or equal to zero, *item* is moved to the beginning; if greater than or equal to the number of children, it is moved to the end. If *item* was detached it is reattached.
ru: Перемещение элемента под одним из его потомков является незаконным. Если *index* меньше или равен нулю, *item* перемещается в начало; если число дочерних элементов больше или равно ему, оно перемещается в конец. Если *элемент* был отсоединен, он снова присоединяется.

source: Returns the identifier of *item*'s next sibling, or '' if *item* is the last child of its parent.
ru: Возвращает идентификатор следующего родственного элемента *item* или '', если *item* является последним дочерним элементом своего родителя.

source: Returns the ID of the parent of *item*, or '' if *item* is at the top level of the hierarchy.
ru: Возвращает идентификатор родительского объекта *item* или '', если *item* находится на верхнем уровне иерархии.

source: Returns the identifier of *item*'s previous sibling, or '' if *item* is the first child of its parent.
ru: Возвращает идентификатор предыдущего родственного элемента *item* или '', если *item* является первым дочерним элементом своего родителя.

source: An alias for :meth:`Treeview.move`.
ru: Псевдоним для :meth:`Treeview.move`.

source: Ensure that *item* is visible.
ru: Убедитесь, что *item* виден.

source: Sets all of *item*'s ancestors open option to ``True``, and scrolls the widget if necessary so that *item* is within the visible portion of the tree.
ru: Устанавливает для всех параметров открытия предков *item* значение «True» и при необходимости прокручивает виджет так, чтобы *item* находился в пределах видимой части дерева.

source: Returns a tuple of selected items.
ru: Возвращает кортеж выбранных элементов.

source: ``selection()`` no longer takes arguments. For changing the selection state use the following selection methods.
ru: ``выбор()`` больше не принимает аргументов. Для изменения состояния выбора используйте следующие методы выбора.

source: *items* becomes the new selection.
ru: *items* становится новым выбором.

source: *items* can be passed as separate arguments, not just as a single tuple.
ru: *items* можно передавать как отдельные аргументы, а не просто как один кортеж.

source: Add *items* to the selection.
ru: Добавьте *элементы* в выделение.

source: Remove *items* from the selection.
ru: Удалить *элементы* из выделения.

source: Toggle the selection state of each item in *items*.
ru: Переключить состояние выбора каждого элемента в *items*.

source: With one argument, returns a dictionary of column/value pairs for the specified *item*. With two arguments, returns the current value of the specified *column*. With three arguments, sets the value of given *column* in given *item* to the specified *value*.
ru: С одним аргументом возвращает словарь пар столбец/значение для указанного *элемента*. С двумя аргументами возвращает текущее значение указанного *столбца*. С тремя аргументами устанавливает значение данного *столбца* в данном *элементе* в указанное *значение*.

source: Bind a callback for the given event *sequence* to the tag *tagname*. When an event is delivered to an item, the callbacks for each of the item's tags option are called.
ru: Привяжите обратный вызов для данного события *последовательность* к тегу *tagname*. Когда событие доставляется элементу, вызываются обратные вызовы для каждой опции тегов элемента.

source: Query or modify the options for the specified *tagname*.
ru: Запросите или измените параметры для указанного *тэга*.

source: If *kw* is not given, returns a dict of the option settings for *tagname*. If *option* is specified, returns the value for that *option* for the specified *tagname*. Otherwise, sets the options to the corresponding values for the given *tagname*.
ru: Если *kw* не задано, возвращается описание настроек опции для *tagname*. Если указана *опция*, возвращает значение этой *опции* для указанного *имя_тега*. В противном случае устанавливает для параметров соответствующие значения для данного *имя_тега*.

source: If *item* is specified, returns 1 or 0 depending on whether the specified *item* has the given *tagname*. Otherwise, returns a list of all items that have the specified tag.
ru: Если указан *item*, возвращается 1 или 0 в зависимости от того, имеет ли указанный *item* заданное *tagname*. В противном случае возвращает список всех элементов, имеющих указанный тег.

source: Availability: Tk 8.6
ru: Доступность: Tk 8.6

source: Query or modify horizontal position of the treeview.
ru: Запросите или измените горизонтальное положение древовидного представления.

source: Query or modify vertical position of the treeview.
ru: Запросите или измените вертикальное положение древовидного представления.

source: Each widget in :mod:`ttk` is assigned a style, which specifies the set of elements making up the widget and how they are arranged, along with dynamic and default settings for element options. By default the style name is the same as the widget's class name, but it may be overridden by the widget's style option. If you don't know the class name of a widget, use the method :meth:`Misc.winfo_class` (somewidget.winfo_class()).
ru: Каждому виджету в :mod:`ttk` присвоен стиль, который определяет набор элементов, составляющих виджет, и их расположение, а также динамические настройки и настройки по умолчанию для параметров элемента. По умолчанию имя стиля совпадает с именем класса виджета, но оно может быть переопределено опцией стиля виджета. Если вы не знаете имя класса виджета, используйте метод :meth:`Misc.winfo_class` (somewidget.winfo_class()).

source: `Tcl'2004 conference presentation <https://tktable.sourceforge.net/tile/tile-tcl2004.pdf>`_
ru: `Презентация конференции Tcl'2004 <https://tktable.sourceforge.net/tile/tile-tcl2004.pdf>`_

source: This document explains how the theme engine works
ru: В этом документе объясняется, как работает движок тем.

source: This class is used to manipulate the style database.
ru: Этот класс используется для управления базой данных стилей.

source: Query or set the default value of the specified option(s) in *style*.
ru: Запросите или установите значение по умолчанию для указанных опций в *style*.

source: Each key in *kw* is an option and each value is a string identifying the value for that option.
ru: Каждый ключ в *kw* — это опция, а каждое значение — это строка, определяющая значение этой опции.

source: For example, to change every default button to be a flat button with some padding and a different background color::
ru: Например, чтобы изменить каждую кнопку по умолчанию на плоскую кнопку с некоторым отступом и другим цветом фона:

source: Query or sets dynamic values of the specified option(s) in *style*.
ru: Запрашивает или устанавливает динамические значения указанных опций в *style*.

source: Each key in *kw* is an option and each value should be a list or a tuple (usually) containing statespecs grouped in tuples, lists, or some other preference. A statespec is a compound of one or more states and then a value.
ru: Каждый ключ в *kw* является опцией, и каждое значение должно быть списком или кортежем (обычно), содержащим спецификации состояний, сгруппированные в кортежи, списки или какие-либо другие предпочтения. Спецификация состояния — это соединение одного или нескольких состояний, а затем значения.

source: An example may make it more understandable::
ru: Пример может сделать это более понятным:

source: Note that the order of the (states, value) sequences for an option does matter, if the order is changed to ``[('active', 'blue'), ('pressed', 'red')]`` in the foreground option, for example, the result would be a blue foreground when the widget were in active or pressed states.
ru: Обратите внимание, что порядок последовательностей (состояния, значения) для параметра имеет значение, если порядок изменен на ``[('активный', 'синий'), ('нажатый', 'красный')]`` в Например, при использовании опции переднего плана результатом будет синий передний план, когда виджет находится в активном или нажатом состоянии.

source: Returns the value specified for *option* in *style*.
ru: Возвращает значение, указанное для *option* в *style*.

source: If *state* is specified, it is expected to be a sequence of one or more states. If the *default* argument is set, it is used as a fallback value in case no specification for option is found.
ru: Если указано *state*, ожидается, что оно будет последовательностью одного или нескольких состояний. Если установлен аргумент *default*, он используется в качестве запасного значения в случае, если не найдена спецификация для параметра.

source: To check what font a Button uses by default::
ru: Чтобы проверить, какой шрифт кнопка использует по умолчанию:

source: Define the widget layout for given *style*. If *layoutspec* is omitted, return the layout specification for given style.
ru: Определите макет виджета для заданного *стиля*. Если *layoutspec* опущено, возвращает спецификацию макета для данного стиля.

source: *layoutspec*, if specified, is expected to be a list or some other sequence type (excluding strings), where each item should be a tuple and the first item is the layout name and the second item should have the format described in `Layouts`_.
ru: Предполагается, что *layoutspec*, если он указан, будет списком или каким-либо другим типом последовательности (за исключением строк), где каждый элемент должен быть кортежем, а первый элемент — это имя макета, а второй элемент должен иметь формат, описанный в разделе «Макеты». `_.

source: To understand the format, see the following example (it is not intended to do anything useful)::
ru: Чтобы понять формат, посмотрите следующий пример (он не несет никакой полезной цели)::

source: Create a new element in the current theme, of the given *etype* which is expected to be either "image", "from" or "vsapi". The latter is only available in Tk 8.6 on Windows.
ru: Создайте новый элемент в текущей теме заданного *etype*, который, как ожидается, будет «image», «from» или «vsapi». Последний доступен только в Tk 8.6 для Windows.
