Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/tracemalloc.po
Languages: ru

source: The result is sorted from the biggest to the smallest by: :attr:`Statistic.size`, :attr:`Statistic.count` and then by :attr:`Statistic.traceback`.
ru: Результат сортируется от наибольшего к наименьшему по: :attr:`Statistic.size`, :attr:`Statistic.count`, а затем по :attr:`Statistic.traceback`.

source: Maximum number of frames stored in the traceback of :attr:`traces`: result of the :func:`get_traceback_limit` when the snapshot was taken.
ru: Максимальное количество кадров, хранящихся в обратной трассировке :attr:`traces`: результата :func:`get_traceback_limit` при создании моментального снимка.

source: Traces of all memory blocks allocated by Python: sequence of :class:`Trace` instances.
ru: Трассировки всех блоков памяти, выделенных Python: последовательность экземпляров :class:`Trace`.

source: The sequence has an undefined order. Use the :meth:`Snapshot.statistics` method to get a sorted list of statistics.
ru: Последовательность имеет неопределенный порядок. Используйте метод :meth:`Snapshot.statistics`, чтобы получить отсортированный список статистики.

source: Statistic
ru: Статистика

source: Statistic on memory allocations.
ru: Статистика распределения памяти.

source: :func:`Snapshot.statistics` returns a list of :class:`Statistic` instances.
ru: :func:`Snapshot.statistics` возвращает список экземпляров :class:`Statistic`.

source: See also the :class:`StatisticDiff` class.
ru: См. также класс :class:`StatisticDiff`.

source: Number of memory blocks (``int``).
ru: Количество блоков памяти (``int``).

source: Total size of memory blocks in bytes (``int``).
ru: Общий размер блоков памяти в байтах (int).

source: Traceback where the memory block was allocated, :class:`Traceback` instance.
ru: Traceback, где был выделен блок памяти, экземпляр :class:`Traceback`.

source: Statistic difference on memory allocations between an old and a new :class:`Snapshot` instance.
ru: Статистическая разница в распределении памяти между старым и новым экземпляром :class:`Snapshot`.

source: :func:`Snapshot.compare_to` returns a list of :class:`StatisticDiff` instances. See also the :class:`Statistic` class.
ru: :func:`Snapshot.compare_to` возвращает список экземпляров :class:`StatisticDiff`. См. также класс :class:`Statistic`.

source: Number of memory blocks in the new snapshot (``int``): ``0`` if the memory blocks have been released in the new snapshot.
ru: Количество блоков памяти в новом снимке («int»): «0», если блоки памяти были освобождены в новом снимке.

source: Difference of number of memory blocks between the old and the new snapshots (``int``): ``0`` if the memory blocks have been allocated in the new snapshot.
ru: Разница в количестве блоков памяти между старым и новым снимками («int»): «0», если блоки памяти были выделены в новом снимке.

source: Total size of memory blocks in bytes in the new snapshot (``int``): ``0`` if the memory blocks have been released in the new snapshot.
ru: Общий размер блоков памяти в байтах в новом снимке («int»): «0», если блоки памяти были освобождены в новом снимке.

source: Difference of total size of memory blocks in bytes between the old and the new snapshots (``int``): ``0`` if the memory blocks have been allocated in the new snapshot.
ru: Разница общего размера блоков памяти в байтах между старым и новым снимками («int»): «0», если блоки памяти были выделены в новом снимке.

source: Traceback where the memory blocks were allocated, :class:`Traceback` instance.
ru: Traceback, где были выделены блоки памяти, экземпляр :class:`Traceback`.

source: Trace of a memory block.
ru: Трассировка блока памяти.

source: The :attr:`Snapshot.traces` attribute is a sequence of :class:`Trace` instances.
ru: Атрибут :attr:`Snapshot.traces` представляет собой последовательность экземпляров :class:`Trace`.

source: Size of the memory block in bytes (``int``).
ru: Размер блока памяти в байтах (int).

source: Traceback
ru: трассировка

source: Sequence of :class:`Frame` instances sorted from the oldest frame to the most recent frame.
ru: Последовательность экземпляров :class:`Frame`, отсортированная от самого старого кадра до самого последнего.

source: A traceback contains at least ``1`` frame. If the ``tracemalloc`` module failed to get a frame, the filename ``"<unknown>"`` at line number ``0`` is used.
ru: Обратная трассировка содержит как минимум 1 кадр. Если модулю ``tracemalloc`` не удалось получить кадр, используется имя файла ``"<unknown>"`` в строке с номером ``0``.

source: When a snapshot is taken, tracebacks of traces are limited to :func:`get_traceback_limit` frames. See the :func:`take_snapshot` function. The original number of frames of the traceback is stored in the :attr:`Traceback.total_nframe` attribute. That allows to know if a traceback has been truncated by the traceback limit.
ru: При создании моментального снимка обратные трассировки ограничиваются кадрами :func:`get_traceback_limit`. См. функцию :func:`take_snapshot`. Исходное количество кадров обратной трассировки хранится в атрибуте :attr:`Traceback.total_nframe`. Это позволяет узнать, была ли обратная трассировка усечена пределом трассировки.

source: The :attr:`Trace.traceback` attribute is an instance of :class:`Traceback` instance.
ru: Атрибут :attr:`Trace.traceback` является экземпляром экземпляра :class:`Traceback`.

source: Frames are now sorted from the oldest to the most recent, instead of most recent to oldest.
ru: Кадры теперь сортируются от самых старых к самым последним, а не от самых последних к самым старым.

source: Total number of frames that composed the traceback before truncation. This attribute can be set to ``None`` if the information is not available.
ru: Общее количество кадров, составлявших обратную трассировку до усечения. Для этого атрибута можно установить значение «Нет», если информация недоступна.

source: The :attr:`Traceback.total_nframe` attribute was added.
ru: Добавлен атрибут :attr:`Traceback.total_nframe`.

source: Format the traceback as a list of lines. Use the :mod:`linecache` module to retrieve lines from the source code. If *limit* is set, format the *limit* most recent frames if *limit* is positive. Otherwise, format the ``abs(limit)`` oldest frames. If *most_recent_first* is ``True``, the order of the formatted frames is reversed, returning the most recent frame first instead of last.
ru: Отформатируйте обратную трассировку как список строк. Используйте модуль :mod:`linecache` для получения строк из исходного кода. Если установлен *limit*, отформатируйте *limit* самые последние кадры, если *limit* положителен. В противном случае отформатируйте самые старые кадры abs(limit). Если *most_recent_first* имеет значение True, порядок форматируемых кадров меняется на обратный, и первым возвращается самый последний кадр, а не последний.

source: Similar to the :func:`traceback.format_tb` function, except that :meth:`.format` does not include newlines.
ru: Аналогично функции :func:`traceback.format_tb`, за исключением того, что :meth:`.format` не включает символы новой строки.

source: Example::
ru: Пример::
