Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/trace.po
Languages: ru

source: :mod:`!trace` --- Trace or track Python statement execution
ru: :mod:`!trace` --- Отслеживание или отслеживание выполнения инструкций Python

source: **Source code:** :source:`Lib/trace.py`
ru: **Исходный код:** :source:`Lib/trace.py`

source: The :mod:`trace` module allows you to trace program execution, generate annotated statement coverage listings, print caller/callee relationships and list functions executed during a program run. It can be used in another program or from the command line.
ru: Модуль :mod:`trace` позволяет отслеживать выполнение программы, генерировать аннотированные списки покрытия операторов, печатать отношения вызывающего/вызываемого объекта и перечислять функции, выполняемые во время выполнения программы. Его можно использовать в другой программе или из командной строки.

source: A popular third-party coverage tool that provides HTML output along with advanced features such as branch coverage.
ru: Популярный сторонний инструмент покрытия, который обеспечивает вывод HTML, а также расширенные функции, такие как покрытие ветвей.

source: Command-Line Usage
ru: Использование командной строки

source: The :mod:`trace` module can be invoked from the command line. It can be as simple as ::
ru: Модуль :mod:`trace` можно вызвать из командной строки. Это может быть так же просто, как::

source: The above will execute :file:`somefile.py` and generate annotated listings of all Python modules imported during the execution into the current directory.
ru: Вышеуказанное выполнит :file:`somefile.py` и сгенерирует аннотированные списки всех модулей Python, импортированных во время выполнения, в текущий каталог.

source: Display usage and exit.
ru: Отобразить использование и выйти.

source: Display the version of the module and exit.
ru: Отобразите версию модуля и выйдите.

source: Added ``--module`` option that allows to run an executable module.
ru: Добавлена ​​опция ``--module``, позволяющая запускать исполняемый модуль.

source: Main options
ru: Основные опции

source: At least one of the following options must be specified when invoking :mod:`trace`. The :option:`--listfuncs <-l>` option is mutually exclusive with the :option:`--trace <-t>` and :option:`--count <-c>` options. When :option:`--listfuncs <-l>` is provided, neither :option:`--count <-c>` nor :option:`--trace <-t>` are accepted, and vice versa.
ru: При вызове :mod:`trace` должна быть указана хотя бы одна из следующих опций. Параметр :option:`--listfuncs <-l>` является взаимоисключающим с параметрами :option:`--trace <-t>` и :option:`--count <-c>`. Если указан :option:`--listfuncs <-l>`, ни :option:`--count <-c>`, ни :option:`--trace <-t>` не принимаются, и наоборот.

source: Produce a set of annotated listing files upon program completion that shows how many times each statement was executed. See also :option:`--coverdir <-C>`, :option:`--file <-f>` and :option:`--no-report <-R>` below.
ru: После завершения программы создайте набор файлов с аннотированными списками, в которых показано, сколько раз был выполнен каждый оператор. См. также :option:`--coverdir <-C>`, :option:`--file <-f>` и :option:`--no-report <-R>` ниже.

source: Display lines as they are executed.
ru: Отображать строки по мере их выполнения.

source: Display the functions executed by running the program.
ru: Отображение функций, выполняемых при запуске программы.

source: Produce an annotated list from an earlier program run that used the :option:`--count <-c>` and :option:`--file <-f>` option. This does not execute any code.
ru: Создайте аннотированный список из более раннего запуска программы, в которой использовались опции :option:`--count <-c>` и :option:`--file <-f>`. Это не выполняет какой-либо код.

source: Display the calling relationships exposed by running the program.
ru: Отобразите отношения вызовов, выявленные при запуске программы.

source: Modifiers
ru: Модификаторы

source: Name of a file to accumulate counts over several tracing runs. Should be used with the :option:`--count <-c>` option.
ru: Имя файла для накопления значений за несколько запусков трассировки. Следует использовать с опцией :option:`--count <-c>`.

source: Directory where the report files go. The coverage report for ``package.module`` is written to file :file:`{dir}/{package}/{module}.cover`.
ru: Каталог, в котором хранятся файлы отчетов. Отчет о покрытии для package.module записывается в файл :file:`{dir}/{package}/{module}.cover`.

source: When using :option:`--count <-c>` or :option:`--report <-r>`, write a brief summary to stdout for each file processed.
ru: При использовании :option:`--count <-c>` или :option:`--report <-r>` записывайте в стандартный вывод краткую сводку для каждого обработанного файла.

source: Do not generate annotated listings. This is useful if you intend to make several runs with :option:`--count <-c>`, and then produce a single set of annotated listings at the end.
ru: Не создавайте аннотированные списки. Это полезно, если вы собираетесь выполнить несколько запусков с помощью :option:`--count <-c>`, а затем в конце создать один набор аннотированных списков.

source: Prefix each line with the time since the program started. Only used while tracing.
ru: В качестве префикса каждой строки укажите время с момента запуска программы. Используется только при трассировке.

source: Filters
ru: Фильтры

source: These options may be repeated multiple times.
ru: Эти параметры могут повторяться несколько раз.

source: Ignore each of the given module names and its submodules (if it is a package). The argument can be a list of names separated by a comma.
ru: Игнорируйте каждое из названий модулей и их подмодулей (если это пакет). Аргументом может быть список имен, разделенных запятой.

source: Ignore all modules and packages in the named directory and subdirectories. The argument can be a list of directories separated by :data:`os.pathsep`.
ru: Игнорировать все модули и пакеты в указанном каталоге и подкаталогах. Аргументом может быть список каталогов, разделенных :data:`os.pathsep`.

source: Programmatic Interface
ru: Программный интерфейс

source: Create an object to trace execution of a single statement or expression. All parameters are optional. *count* enables counting of line numbers. *trace* enables line execution tracing. *countfuncs* enables listing of the functions called during the run. *countcallers* enables call relationship tracking. *ignoremods* is a list of modules or packages to ignore. *ignoredirs* is a list of directories whose modules or packages should be ignored. *infile* is the name of the file from which to read stored count information. *outfile* is the name of the file in which to write updated count information. *timing* enables a timestamp relative to when tracing was started to be displayed.
ru: Создайте объект для отслеживания выполнения одного оператора или выражения. Все параметры являются необязательными. *count* включает подсчет номеров строк. *trace* включает трассировку выполнения строки. *countfuncs* включает список функций, вызываемых во время выполнения. *countcallers* включает отслеживание взаимосвязи вызовов. *ignoremods* — это список модулей или пакетов, которые следует игнорировать. *ignoredirs* — это список каталогов, модули или пакеты которых следует игнорировать. *infile* — имя файла, из которого считывается сохраненная информация о счетчике. *outfile* — это имя файла, в который записывается обновленная информация о счетчике. *timing* позволяет отображать временную метку, относящуюся к моменту начала трассировки.

source: Execute the command and gather statistics from the execution with the current tracing parameters. *cmd* must be a string or code object, suitable for passing into :func:`exec`.
ru: Выполните команду и соберите статистику выполнения с текущими параметрами трассировки. *cmd* должен быть строкой или объектом кода, подходящим для передачи в :func:`exec`.

source: Execute the command and gather statistics from the execution with the current tracing parameters, in the defined global and local environments. If not defined, *globals* and *locals* default to empty dictionaries.
ru: Выполните команду и соберите статистику выполнения с текущими параметрами трассировки в определенных глобальных и локальных средах. Если не определено, *globals* и *locals* по умолчанию представляют собой пустые словари.

source: Call *func* with the given arguments under control of the :class:`Trace` object with the current tracing parameters.
ru: Вызов *func* с заданными аргументами под управлением объекта :class:`Trace` с текущими параметрами трассировки.

source: Return a :class:`CoverageResults` object that contains the cumulative results of all previous calls to ``run``, ``runctx`` and ``runfunc`` for the given :class:`Trace` instance. Does not reset the accumulated trace results.
ru: Возвращает объект :class:`CoverageResults`, который содержит совокупные результаты всех предыдущих вызовов ``run``, ``runctx`` и ``runfunc`` для данного экземпляра :class:`Trace`. Не сбрасывает накопленные результаты трассировки.

source: A container for coverage results, created by :meth:`Trace.results`. Should not be created directly by the user.
ru: Контейнер для результатов покрытия, созданный :meth:`Trace.results`. Не должен создаваться непосредственно пользователем.

source: Merge in data from another :class:`CoverageResults` object.
ru: Объединить данные из другого объекта :class:`CoverageResults`.

source: Write coverage results. Set *show_missing* to show lines that had no hits. Set *summary* to include in the output the coverage summary per module. *coverdir* specifies the directory into which the coverage result files will be output. If ``None``, the results for each source file are placed in its directory.
ru: Напишите результаты покрытия. Установите *show_missing*, чтобы показывать строки, в которых не было совпадений. Установите *summary*, чтобы включить в выходные данные сводку покрытия по каждому модулю. *coverdir* указывает каталог, в который будут выводиться файлы результатов покрытия. Если «Нет», результаты для каждого исходного файла помещаются в его каталог.

source: If *ignore_missing_files* is ``True``, coverage counts for files that no longer exist are silently ignored. Otherwise, a missing file will raise a :exc:`FileNotFoundError`.
ru: Если *ignore_missing_files* имеет значение True, счетчики покрытия для файлов, которые больше не существуют, игнорируются. В противном случае отсутствующий файл вызовет ошибку :exc:`FileNotFoundError`.

source: Added *ignore_missing_files* parameter.
ru: Добавлен параметр *ignore_missing_files*.

source: A simple example demonstrating the use of the programmatic interface::
ru: Простой пример, демонстрирующий использование программного интерфейса:
