Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/tracemalloc.po
Languages: ru

source: :mod:`!tracemalloc` --- Trace memory allocations
ru: :mod:`!tracemalloc` --- Отслеживание распределения памяти

source: **Source code:** :source:`Lib/tracemalloc.py`
ru: **Исходный код:** :source:`Lib/tracemalloc.py`

source: The tracemalloc module is a debug tool to trace memory blocks allocated by Python. It provides the following information:
ru: Модуль Tracemalloc — это инструмент отладки для отслеживания блоков памяти, выделенных Python. Он предоставляет следующую информацию:

source: Traceback where an object was allocated
ru: Отслеживание места размещения объекта

source: Statistics on allocated memory blocks per filename and per line number: total size, number and average size of allocated memory blocks
ru: Статистика по выделенным блокам памяти по имени файла и по номеру строки: общий размер, количество и средний размер выделенных блоков памяти.

source: Compute the differences between two snapshots to detect memory leaks
ru: Вычисление различий между двумя снимками для обнаружения утечек памяти.

source: To trace most memory blocks allocated by Python, the module should be started as early as possible by setting the :envvar:`PYTHONTRACEMALLOC` environment variable to ``1``, or by using :option:`-X` ``tracemalloc`` command line option. The :func:`tracemalloc.start` function can be called at runtime to start tracing Python memory allocations.
ru: Чтобы отслеживать большинство блоков памяти, выделенных Python, модуль следует запустить как можно раньше, установив для переменной среды :envvar:`PYTHONTRACEMALLOC` значение ``1`` или используя :option:`-X` ``tracemalloc` `параметр командной строки. Функцию :func:`tracemalloc.start` можно вызвать во время выполнения, чтобы начать отслеживание распределения памяти Python.

source: By default, a trace of an allocated memory block only stores the most recent frame (1 frame). To store 25 frames at startup: set the :envvar:`PYTHONTRACEMALLOC` environment variable to ``25``, or use the :option:`-X` ``tracemalloc=25`` command line option.
ru: По умолчанию трассировка выделенного блока памяти сохраняет только самый последний кадр (1 кадр). Чтобы сохранить 25 кадров при запуске: установите для переменной среды :envvar:`PYTHONTRACEMALLOC` значение ``25`` или используйте параметр командной строки :option:`-X` ``tracemalloc=25``.

source: Examples
ru: Примеры

source: Display the top 10
ru: Отобразить 10 лучших

source: Display the 10 files allocating the most memory::
ru: Отображение 10 файлов, занимающих больше всего памяти::

source: Example of output of the Python test suite::
ru: Пример вывода набора тестов Python:

source: We can see that Python loaded ``4855 KiB`` data (bytecode and constants) from modules and that the :mod:`collections` module allocated ``244 KiB`` to build :class:`~collections.namedtuple` types.
ru: Мы видим, что Python загрузил данные ``4855 КиБ`` (байт-код и константы) из модулей и что модуль :mod:`collections` выделил ``244 КиБ`` для построения типов :class:`~collections.namedtuple`.

source: See :meth:`Snapshot.statistics` for more options.
ru: См. :meth:`Snapshot.statistics` для получения дополнительных опций.

source: Compute differences
ru: Вычисление различий

source: Take two snapshots and display the differences::
ru: Сделайте два снимка и отобразите различия::

source: Example of output before/after running some tests of the Python test suite::
ru: Пример вывода до/после запуска некоторых тестов набора тестов Python:

source: We can see that Python has loaded ``8173 KiB`` of module data (bytecode and constants), and that this is ``4428 KiB`` more than had been loaded before the tests, when the previous snapshot was taken. Similarly, the :mod:`linecache` module has cached ``940 KiB`` of Python source code to format tracebacks, all of it since the previous snapshot.
ru: Мы видим, что Python загрузил «8173 КиБ» данных модуля (байт-код и константы), и что это на «4428 КиБ» больше, чем было загружено до тестов, когда был сделан предыдущий снимок. Аналогичным образом, модуль :mod:`linecache` кэширует 940 КиБ исходного кода Python для форматирования обратных трассировок, причем все это со времени предыдущего снимка.

source: If the system has little free memory, snapshots can be written on disk using the :meth:`Snapshot.dump` method to analyze the snapshot offline. Then use the :meth:`Snapshot.load` method reload the snapshot.
ru: Если в системе мало свободной памяти, снимки можно записать на диск с помощью метода Snapshot.dump для анализа снимка в автономном режиме. Затем используйте метод :meth:`Snapshot.load`, чтобы перезагрузить снимок.

source: Get the traceback of a memory block
ru: Получить обратную связь блока памяти

source: Code to display the traceback of the biggest memory block::
ru: Код для отображения трассировки самого большого блока памяти::

source: Example of output of the Python test suite (traceback limited to 25 frames)::
ru: Пример вывода набора тестов Python (отслеживание ограничено 25 кадрами):

source: We can see that the most memory was allocated in the :mod:`importlib` module to load data (bytecode and constants) from modules: ``870.1 KiB``. The traceback is where the :mod:`importlib` loaded data most recently: on the ``import pdb`` line of the :mod:`doctest` module. The traceback may change if a new module is loaded.
ru: Мы видим, что большая часть памяти была выделена в модуле :mod:`importlib` для загрузки данных (байт-кода и констант) из модулей: ``870,1 КиБ``. Обратная трассировка – это место, где :mod:`importlib` загружал данные последним: в строке ``import pdb`` модуля :mod:`doctest`. Обратная трассировка может измениться, если загружен новый модуль.

source: Pretty top
ru: Довольно топ

source: Code to display the 10 lines allocating the most memory with a pretty output, ignoring ``<frozen importlib._bootstrap>`` and ``<unknown>`` files::
ru: Код для отображения 10 строк, выделяющих больше всего памяти, с красивым выводом, игнорируя файлы ``<frozen importlib._bootstrap>`` и ``<unknown>``::

source: Record the current and peak size of all traced memory blocks
ru: Запишите текущий и пиковый размер всех отслеживаемых блоков памяти.

source: The following code computes two sums like ``0 + 1 + 2 + ...`` inefficiently, by creating a list of those numbers. This list consumes a lot of memory temporarily. We can use :func:`get_traced_memory` and :func:`reset_peak` to observe the small memory usage after the sum is computed as well as the peak memory usage during the computations::
ru: Следующий код вычисляет две суммы типа «0 + 1 + 2 + ...» неэффективно, создавая список этих чисел. Этот список временно потребляет много памяти. Мы можем использовать :func:`get_traced_memory` и :func:`reset_peak` для наблюдения за небольшим использованием памяти после вычисления суммы, а также за пиковым использованием памяти во время вычислений::

source: Output::
ru: Вывод::

source: Using :func:`reset_peak` ensured we could accurately record the peak during the computation of ``small_sum``, even though it is much smaller than the overall peak size of memory blocks since the :func:`start` call. Without the call to :func:`reset_peak`, ``second_peak`` would still be the peak from the computation ``large_sum`` (that is, equal to ``first_peak``). In this case, both peaks are much higher than the final memory usage, and which suggests we could optimise (by removing the unnecessary call to :class:`list`, and writing ``sum(range(...))``).
ru: Использование :func:`reset_peak` гарантировало, что мы сможем точно записать пик во время вычисления ``small_sum``, хотя он намного меньше, чем общий пиковый размер блоков памяти с момента вызова :func:`start`. Без вызова :func:`reset_peak` `` Second_peak`` всё равно будет пиком вычисления ``large_sum`` (то есть равным ``first_peak``). В данном случае оба пика намного превышают итоговое использование памяти, что предполагает, что мы могли бы оптимизировать (удалив ненужный вызов :class:`list` и написав ``sum(range(...))`` ).

source: Functions
ru: Функции

source: Clear traces of memory blocks allocated by Python.
ru: Очистите следы блоков памяти, выделенных Python.

source: See also :func:`stop`.
ru: См. также :func:`stop`.

source: Get the traceback where the Python object *obj* was allocated. Return a :class:`Traceback` instance, or ``None`` if the :mod:`tracemalloc` module is not tracing memory allocations or did not trace the allocation of the object.
ru: Получите обратную трассировку, в которой был выделен объект Python *obj*. Возвращает экземпляр :class:`Traceback` или ``None``, если модуль :mod:`tracemalloc` не отслеживает выделение памяти или не отслеживает выделение объекта.

source: See also :func:`gc.get_referrers` and :func:`sys.getsizeof` functions.
ru: См. также функции :func:`gc.get_referrers` и :func:`sys.getsizeof`.

source: Get the maximum number of frames stored in the traceback of a trace.
ru: Получите максимальное количество кадров, хранящихся в обратной трассировке трассировки.

source: The :mod:`tracemalloc` module must be tracing memory allocations to get the limit, otherwise an exception is raised.
ru: Модуль :mod:`tracemalloc` должен отслеживать выделение памяти, чтобы получить предел, в противном случае будет выдано исключение.

source: The limit is set by the :func:`start` function.
ru: Предел устанавливается функцией :func:`start`.

source: Get the current size and peak size of memory blocks traced by the :mod:`tracemalloc` module as a tuple: ``(current: int, peak: int)``.
ru: Получите текущий размер и пиковый размер блоков памяти, отслеживаемых модулем :mod:`tracemalloc`, в виде кортежа: ``(current: int,peak: int)``.

source: Set the peak size of memory blocks traced by the :mod:`tracemalloc` module to the current size.
ru: Установите максимальный размер блоков памяти, отслеживаемых модулем :mod:`tracemalloc`, равным текущему размеру.

source: Do nothing if the :mod:`tracemalloc` module is not tracing memory allocations.
ru: Ничего не делайте, если модуль :mod:`tracemalloc` не отслеживает распределение памяти.

source: This function only modifies the recorded peak size, and does not modify or clear any traces, unlike :func:`clear_traces`. Snapshots taken with :func:`take_snapshot` before a call to :func:`reset_peak` can be meaningfully compared to snapshots taken after the call.
ru: Эта функция только изменяет размер записанного пика и не изменяет и не очищает какие-либо кривые, в отличие от :func:`clear_traces`. Снимки, сделанные с помощью :func:`take_snapshot` до вызова :func:`reset_peak`, можно осмысленно сравнивать со снимками, сделанными после вызова.

source: See also :func:`get_traced_memory`.
ru: См. также :func:`get_traced_memory`.

source: Get the memory usage in bytes of the :mod:`tracemalloc` module used to store traces of memory blocks. Return an :class:`int`.
ru: Получите использование памяти в байтах модуля :mod:`tracemalloc`, используемого для хранения следов блоков памяти. Верните :class:`int`.

source: ``True`` if the :mod:`tracemalloc` module is tracing Python memory allocations, ``False`` otherwise.
ru: ``True``, если модуль :mod:`tracemalloc` отслеживает распределение памяти Python, ``False`` в противном случае.

source: See also :func:`start` and :func:`stop` functions.
ru: См. также функции :func:`start` и :func:`stop`.

source: Start tracing Python memory allocations: install hooks on Python memory allocators. Collected tracebacks of traces will be limited to *nframe* frames. By default, a trace of a memory block only stores the most recent frame: the limit is ``1``. *nframe* must be greater or equal to ``1``.
ru: Начните отслеживать распределение памяти Python: установите перехватчики на распределители памяти Python. Собранные обратные трассировки будут ограничены кадрами *nframe*. По умолчанию трассировка блока памяти сохраняет только самый последний кадр: предел равен «1». *nframe* должен быть больше или равен ``1``.

source: You can still read the original number of total frames that composed the traceback by looking at the :attr:`Traceback.total_nframe` attribute.
ru: Вы по-прежнему можете прочитать исходное общее количество кадров, составляющих обратную трассировку, посмотрев атрибут :attr:`Traceback.total_nframe`.

source: Storing more than ``1`` frame is only useful to compute statistics grouped by ``'traceback'`` or to compute cumulative statistics: see the :meth:`Snapshot.compare_to` and :meth:`Snapshot.statistics` methods.
ru: Сохранение более одного кадра полезно только для вычисления статистики, сгруппированной по ``traceback'``, или для вычисления совокупной статистики: см. методы :meth:`Snapshot.compare_to` и :meth:`Snapshot.statistics` .

source: Storing more frames increases the memory and CPU overhead of the :mod:`tracemalloc` module. Use the :func:`get_tracemalloc_memory` function to measure how much memory is used by the :mod:`tracemalloc` module.
ru: Сохранение большего количества кадров увеличивает нагрузку на память и процессор модуля :mod:`tracemalloc`. Используйте функцию :func:`get_tracemalloc_memory`, чтобы измерить, сколько памяти используется модулем :mod:`tracemalloc`.

source: The :envvar:`PYTHONTRACEMALLOC` environment variable (``PYTHONTRACEMALLOC=NFRAME``) and the :option:`-X` ``tracemalloc=NFRAME`` command line option can be used to start tracing at startup.
ru: Переменная среды :envvar:`PYTHONTRACEMALLOC` (``PYTHONTRACEMALLOC=NFRAME``) и параметр командной строки :option:`-X` ``tracemalloc=NFRAME`` могут использоваться для запуска трассировки при запуске.

source: See also :func:`stop`, :func:`is_tracing` and :func:`get_traceback_limit` functions.
ru: См. также функции :func:`stop`, :func:`is_tracing` и :func:`get_traceback_limit`.

source: Stop tracing Python memory allocations: uninstall hooks on Python memory allocators. Also clears all previously collected traces of memory blocks allocated by Python.
ru: Прекратите отслеживать распределение памяти Python: удалите перехватчики на распределителях памяти Python. Также очищает все ранее собранные следы блоков памяти, выделенных Python.

source: Call :func:`take_snapshot` function to take a snapshot of traces before clearing them.
ru: Вызовите функцию :func:`take_snapshot`, чтобы сделать снимок трасс перед их очисткой.

source: See also :func:`start`, :func:`is_tracing` and :func:`clear_traces` functions.
ru: См. также функции :func:`start`, :func:`is_tracing` и :func:`clear_traces`.

source: Take a snapshot of traces of memory blocks allocated by Python. Return a new :class:`Snapshot` instance.
ru: Сделайте снимок следов блоков памяти, выделенных Python. Верните новый экземпляр :class:`Snapshot`.

source: The snapshot does not include memory blocks allocated before the :mod:`tracemalloc` module started to trace memory allocations.
ru: Снимок не включает блоки памяти, выделенные до того, как модуль :mod:`tracemalloc` начал отслеживать распределение памяти.

source: Tracebacks of traces are limited to :func:`get_traceback_limit` frames. Use the *nframe* parameter of the :func:`start` function to store more frames.
ru: Обратные трассировки ограничены кадрами :func:`get_traceback_limit`. Используйте параметр *nframe* функции :func:`start` для хранения большего количества кадров.

source: The :mod:`tracemalloc` module must be tracing memory allocations to take a snapshot, see the :func:`start` function.
ru: Модуль :mod:`tracemalloc` должен отслеживать распределение памяти, чтобы сделать снимок, см. функцию :func:`start`.

source: See also the :func:`get_object_traceback` function.
ru: См. также функцию :func:`get_object_traceback`.

source: Filter traces of memory blocks by their address space (domain).
ru: Фильтровать следы блоков памяти по их адресному пространству (домену).

source: If *inclusive* is ``True`` (include), match memory blocks allocated in the address space :attr:`domain`.
ru: Если *inclusive* имеет значение True (include), сопоставьте блоки памяти, выделенные в адресном пространстве :attr:`domain`.

source: If *inclusive* is ``False`` (exclude), match memory blocks not allocated in the address space :attr:`domain`.
ru: Если *inclusive* имеет значение «False» (исключить), совпадают блоки памяти, не выделенные в адресном пространстве :attr:`domain`.

source: Address space of a memory block (``int``). Read-only property.
ru: Адресное пространство блока памяти (``int``). Свойство только для чтения.

source: Filter
ru: Фильтр

source: Filter on traces of memory blocks.
ru: Фильтрация по следам блоков памяти.

source: See the :func:`fnmatch.fnmatch` function for the syntax of *filename_pattern*. The ``'.pyc'`` file extension is replaced with ``'.py'``.
ru: Синтаксис *filename_pattern* см. в функции :func:`fnmatch.fnmatch`. Расширение файла ``'.pyc'`` заменяется на ``'.py'``.

source: Examples:
ru: Примеры:

source: ``Filter(True, subprocess.__file__)`` only includes traces of the :mod:`subprocess` module
ru: ``Filter(True, subprocess.__file__)`` включает только следы модуля :mod:`subprocess`

source: ``Filter(False, tracemalloc.__file__)`` excludes traces of the :mod:`tracemalloc` module
ru: ``Filter(False,tracemalloc.__file__)`` исключает следы модуля :mod:`tracemalloc`

source: ``Filter(False, "<unknown>")`` excludes empty tracebacks
ru: ``Filter(False, "<unknown>")`` исключает пустые обратные трассировки

source: The ``'.pyo'`` file extension is no longer replaced with ``'.py'``.
ru: Расширение файла ``'.pyo'`` больше не заменяется на ``'.py'``.

source: Added the :attr:`domain` attribute.
ru: Добавлен атрибут :attr:`domain`.

source: Address space of a memory block (``int`` or ``None``).
ru: Адресное пространство блока памяти («int» или «None»).

source: tracemalloc uses the domain ``0`` to trace memory allocations made by Python. C extensions can use other domains to trace other resources.
ru: Tracemalloc использует домен ``0`` для отслеживания распределения памяти, выполняемого Python. Расширения C могут использовать другие домены для отслеживания других ресурсов.

source: If *inclusive* is ``True`` (include), only match memory blocks allocated in a file with a name matching :attr:`filename_pattern` at line number :attr:`lineno`.
ru: Если *inclusive* имеет значение ``True`` (include), сопоставлять только блоки памяти, выделенные в файле с именем, соответствующим :attr:`filename_pattern` по номеру строки :attr:`lineno`.

source: If *inclusive* is ``False`` (exclude), ignore memory blocks allocated in a file with a name matching :attr:`filename_pattern` at line number :attr:`lineno`.
ru: Если *inclusive* имеет значение False (исключить), игнорируйте блоки памяти, выделенные в файле с именем, соответствующим :attr:`filename_pattern` в номере строки :attr:`lineno`.

source: Line number (``int``) of the filter. If *lineno* is ``None``, the filter matches any line number.
ru: Номер строки (``int``) фильтра. Если *lineno* имеет значение «Нет», фильтр соответствует любому номеру строки.

source: Filename pattern of the filter (``str``). Read-only property.
ru: Шаблон имени файла фильтра (``str``). Свойство только для чтения.

source: If *all_frames* is ``True``, all frames of the traceback are checked. If *all_frames* is ``False``, only the most recent frame is checked.
ru: Если *all_frames* имеет значение True, проверяются все кадры обратной трассировки. Если *all_frames* имеет значение «False», проверяется только самый последний кадр.

source: This attribute has no effect if the traceback limit is ``1``. See the :func:`get_traceback_limit` function and :attr:`Snapshot.traceback_limit` attribute.
ru: Этот атрибут не имеет никакого эффекта, если предел трассировки равен «1». См. функцию :func:`get_traceback_limit` и атрибут :attr:`Snapshot.traceback_limit`.

source: Frame
ru: Рамка

source: Frame of a traceback.
ru: Кадр обратной трассировки.

source: The :class:`Traceback` class is a sequence of :class:`Frame` instances.
ru: Класс :class:`Traceback` представляет собой последовательность экземпляров :class:`Frame`.

source: Filename (``str``).
ru: Имя файла (``str``).

source: Line number (``int``).
ru: Номер строки (``int``).

source: Snapshot
ru: Снимок

source: Snapshot of traces of memory blocks allocated by Python.
ru: Снимок следов блоков памяти, выделенных Python.

source: The :func:`take_snapshot` function creates a snapshot instance.
ru: Функция :func:`take_snapshot` создает экземпляр моментального снимка.

source: Compute the differences with an old snapshot. Get statistics as a sorted list of :class:`StatisticDiff` instances grouped by *key_type*.
ru: Вычислите различия, используя старый снимок. Получите статистику в виде отсортированного списка экземпляров :class:`StatisticDiff`, сгруппированных по *key_type*.

source: See the :meth:`Snapshot.statistics` method for *key_type* and *cumulative* parameters.
ru: См. метод :meth:`Snapshot.statistics` для параметров *key_type* и *cumulative*.

source: The result is sorted from the biggest to the smallest by: absolute value of :attr:`StatisticDiff.size_diff`, :attr:`StatisticDiff.size`, absolute value of :attr:`StatisticDiff.count_diff`, :attr:`Statistic.count` and then by :attr:`StatisticDiff.traceback`.
ru: Результат сортируется от наибольшего к наименьшему по: абсолютному значению :attr:`StatisticDiff.size_diff`, :attr:`StatisticDiff.size`, абсолютному значению :attr:`StatisticDiff.count_diff`, :attr:`Statistic .count`, а затем :attr:`StatisticDiff.traceback`.

source: Write the snapshot into a file.
ru: Запишите снимок в файл.

source: Use :meth:`load` to reload the snapshot.
ru: Используйте :meth:`load`, чтобы перезагрузить снимок.

source: Create a new :class:`Snapshot` instance with a filtered :attr:`traces` sequence, *filters* is a list of :class:`DomainFilter` and :class:`Filter` instances. If *filters* is an empty list, return a new :class:`Snapshot` instance with a copy of the traces.
ru: Создайте новый экземпляр :class:`Snapshot` с отфильтрованной последовательностью :attr:`traces`, *filters* — это список экземпляров :class:`DomainFilter` и :class:`Filter`. Если *filters* — пустой список, верните новый экземпляр :class:`Snapshot` с копией трассировок.

source: All inclusive filters are applied at once, a trace is ignored if no inclusive filters match it. A trace is ignored if at least one exclusive filter matches it.
ru: Все включающие фильтры применяются одновременно; трассировка игнорируется, если ей не соответствует ни один включающий фильтр. Трассировка игнорируется, если ей соответствует хотя бы один эксклюзивный фильтр.

source: :class:`DomainFilter` instances are now also accepted in *filters*.
ru: Экземпляры :class:`DomainFilter` теперь также принимаются в *filters*.

source: Load a snapshot from a file.
ru: Загрузите снимок из файла.

source: See also :meth:`dump`.
ru: См. также :meth:`dump`.

source: Get statistics as a sorted list of :class:`Statistic` instances grouped by *key_type*:
ru: Получите статистику в виде отсортированного списка экземпляров :class:`Statistic`, сгруппированных по *key_type*:

source: description
ru: описание

source: filename
ru: имя файла

source: filename and line number
ru: имя файла и номер строки

source: traceback
ru: трассировка

source: If *cumulative* is ``True``, cumulate size and count of memory blocks of all frames of the traceback of a trace, not only the most recent frame. The cumulative mode can only be used with *key_type* equals to ``'filename'`` and ``'lineno'``.
ru: Если *cumulative* имеет значение True, суммируется размер и количество блоков памяти всех кадров обратной трассировки, а не только самого последнего кадра. Накопительный режим можно использовать только с *key_type*, равным ``'filename'`` и ``'lineno'``.
