Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/turtle.po
Languages: ru, uk

source: :mod:`turtle` --- Turtle graphics
ru: :mod:`turtle` --- Графика черепахи
uk: :mod:`turtle` --- Графіка черепахи

source: **Source code:** :source:`Lib/turtle.py`
ru: **Исходный код:** :source:`Lib/turtle.py`
uk: **Вихідний код:** :source:`Lib/turtle.py`

source: Introduction
ru: Введение
uk: Вступ

source: Turtle graphics is an implementation of `the popular geometric drawing tools introduced in Logo <https://en.wikipedia.org/wiki/Turtle_ (robot)>`_, developed by Wally Feurzeig, Seymour Papert and Cynthia Solomon in 1967.
ru: Черепашья графика — это реализация `популярных инструментов геометрического рисования, представленных в Logo <https://en.wikipedia.org/wiki/Turtle_ (robot)>`_, разработанных Уолли Фёрцейгом, Сеймуром Пейпертом и Синтией Соломон в 1967 году.

source: Get started
ru: Начать

source: Imagine a robotic turtle starting at (0, 0) in the x-y plane. After an ``import turtle``, give it the command ``turtle.forward(15)``, and it moves (on-screen!) 15 pixels in the direction it is facing, drawing a line as it moves. Give it the command ``turtle.right(25)``, and it rotates in-place 25 degrees clockwise.
ru: Представьте себе роботизированную черепаху, начинающуюся с точки (0, 0) в плоскости xy. После ``импорта черепахи`` дайте ей команду ``turtle.forward(15)``, и она переместится (на экране!) на 15 пикселей в направлении, в котором смотрит, рисуя линию по мере своего движения. Дайте ему команду «turtle.right(25)», и он повернется на месте на 25 градусов по часовой стрелке.

source: Turtle can draw intricate shapes using programs that repeat simple moves.
ru: Черепаха может рисовать замысловатые фигуры с помощью программ, повторяющих простые движения.
uk: Turtle може малювати складні фігури за допомогою програм, які повторюють прості рухи.

source: In Python, turtle graphics provides a representation of a physical "turtle" (a little robot with a pen) that draws on a sheet of paper on the floor.
ru: В Python графика черепахи представляет собой физическую «черепаху» (маленького робота с ручкой), которая рисует на листе бумаги на полу.

source: It's an effective and well-proven way for learners to encounter programming concepts and interaction with software, as it provides instant, visible feedback. It also provides convenient access to graphical output in general.
ru: Это эффективный и хорошо зарекомендовавший себя способ познакомиться с концепциями программирования и взаимодействия с программным обеспечением, поскольку он обеспечивает мгновенную и наглядную обратную связь. Он также обеспечивает удобный доступ к графическому выводу в целом.

source: Turtle drawing was originally created as an educational tool, to be used by teachers in the classroom. For the programmer who needs to produce some graphical output it can be a way to do that without the overhead of introducing more complex or external libraries into their work.
ru: Рисунок черепахи изначально создавался как образовательный инструмент, который учителя могли использовать в классе. Для программиста, которому необходимо создать некоторый графический результат, это может быть способом сделать это без накладных расходов на внедрение более сложных или внешних библиотек в свою работу.

source: Tutorial
ru: Руководство
uk: Підручник

source: New users should start here. In this tutorial we'll explore some of the basics of turtle drawing.
ru: Новым пользователям следует начать здесь. В этом уроке мы рассмотрим некоторые основы рисования черепахи.

source: Starting a turtle environment
ru: Запуск среды черепахи

source: In a Python shell, import all the objects of the ``turtle`` module::
ru: В оболочке Python импортируйте все объекты модуля «черепаха»:

source: from turtle import *
ru: от импорта черепах *

source: If you run into a ``No module named '_tkinter'`` error, you'll have to install the :mod:`Tk interface package <tkinter>` on your system.
ru: Если вы столкнулись с ошибкой ``Нет модуля с именем '_tkinter'`, вам придется установить в вашей системе пакет интерфейса :mod:`Tk <tkinter>`.

source: Basic drawing
ru: Базовый чертеж

source: Send the turtle forward 100 steps::
ru: Отправьте черепаху вперед на 100 шагов::

source: You should see (most likely, in a new window on your display) a line drawn by the turtle, heading East. Change the direction of the turtle, so that it turns 120 degrees left (anti-clockwise)::
ru: Вы должны увидеть (скорее всего, в новом окне на вашем дисплее) линию, нарисованную черепахой и идущую на восток. Измените направление черепахи так, чтобы она повернулась на 120 градусов влево (против часовой стрелки):

source: Let's continue by drawing a triangle::
ru: Продолжим рисовать треугольник::

source: Notice how the turtle, represented by an arrow, points in different directions as you steer it.
ru: Обратите внимание, как черепаха, изображенная стрелкой, указывает в разные стороны, когда вы ею управляете.

source: Experiment with those commands, and also with ``backward()`` and ``right()``.
ru: Поэкспериментируйте с этими командами, а также с ``backward()`` и ``right()``.

source: Pen control
ru: Управление пером
uk: Керування пером

source: Try changing the color - for example, ``color('blue')`` - and width of the line - for example, ``width(3)`` - and then drawing again.
ru: Попробуйте изменить цвет — например, «color('blue») — и ширину линии — например, «width(3)» — а затем снова нарисовать.

source: You can also move the turtle around without drawing, by lifting up the pen: ``up()`` before moving. To start drawing again, use ``down()``.
ru: Вы также можете перемещать черепаху, не рисуя, подняв перо: ``up()`` перед перемещением. Чтобы начать рисовать снова, используйте ``down()``.

source: The turtle's position
ru: Позиция черепахи

source: Send your turtle back to its starting-point (useful if it has disappeared off-screen)::
ru: Отправьте черепаху обратно в исходную точку (полезно, если она исчезла за кадром)::

source: The home position is at the center of the turtle's screen. If you ever need to know them, get the turtle's x-y coordinates with::
ru: Исходная позиция находится в центре экрана черепахи. Если вам когда-нибудь понадобится их узнать, получите координаты xy черепахи с помощью::

source: Home is at ``(0, 0)``.
ru: Дом находится в ``(0, 0)``.

source: And after a while, it will probably help to clear the window so we can start anew::
ru: И через некоторое время, вероятно, поможет очистить окно, чтобы мы могли начать заново::

source: Making algorithmic patterns
ru: Создание алгоритмических шаблонов

source: Using loops, it's possible to build up geometric patterns::
ru: С помощью циклов можно создавать геометрические узоры:

source: \ - which of course, are limited only by the imagination!
ru: \ - которые, конечно, ограничены только фантазией!

source: Let's draw the star shape at the top of this page. We want red lines, filled in with yellow::
ru: Давайте нарисуем форму звезды вверху этой страницы. Нам нужны красные линии, заполненные желтым::

source: Just as ``up()`` and ``down()`` determine whether lines will be drawn, filling can be turned on and off::
ru: Точно так же, как ``up()`` и ``down()`` определяют, будут ли рисоваться линии, заполнение можно включать и выключать:

source: Next we'll create a loop::
ru: Далее мы создадим цикл::

source: ``abs(pos()) < 1`` is a good way to know when the turtle is back at its home position.
ru: ``abs(pos()) < 1`` — хороший способ узнать, когда черепаха вернулась в исходное положение.

source: Finally, complete the filling::
ru: Наконец, завершаем заполнение::

source: (Note that filling only actually takes place when you give the ``end_fill()`` command.)
ru: (Обратите внимание, что на самом деле заполнение происходит только тогда, когда вы даете команду ``end_fill()``.)

source: How to...
ru: Как...

source: This section covers some typical turtle use-cases and approaches.
ru: В этом разделе рассматриваются некоторые типичные варианты использования и подходы к использованию черепах.

source: Get started as quickly as possible
ru: Начните работу как можно быстрее

source: One of the joys of turtle graphics is the immediate, visual feedback that's available from simple commands - it's an excellent way to introduce children to programming ideas, with a minimum of overhead (not just children, of course).
ru: Одна из прелестей черепашьей графики — немедленная визуальная обратная связь, доступная с помощью простых команд — это отличный способ познакомить детей с идеями программирования с минимальными накладными расходами (конечно, не только для детей).

source: The turtle module makes this possible by exposing all its basic functionality as functions, available with ``from turtle import *``. The :ref:`turtle graphics tutorial <turtle-tutorial>` covers this approach.
ru: Модуль черепахи делает это возможным, предоставляя все свои основные функции в виде функций, доступных с помощью ``from Turtle Import *``. Этот подход описан в :ref:`учебнике по черепашьей графике <turtle-tutorial>`.

source: It's worth noting that many of the turtle commands also have even more terse equivalents, such as ``fd()`` for :func:`forward`. These are especially useful when working with learners for whom typing is not a skill.
ru: Стоит отметить, что многие команды черепахи имеют еще более краткие эквиваленты, например, ``fd()`` для :func:`forward`. Они особенно полезны при работе с учащимися, для которых набор текста не является навыком.

source: You'll need to have the :mod:`Tk interface package <tkinter>` installed on your system for turtle graphics to work. Be warned that this is not always straightforward, so check this in advance if you're planning to use turtle graphics with a learner.
ru: Для работы черепашьей графики в вашей системе должен быть установлен пакет интерфейса Tk <tkinter>`. Имейте в виду, что это не всегда просто, поэтому проверьте это заранее, если вы планируете использовать графику черепахи с обучающимся.

source: Use the ``turtle`` module namespace
ru: Используйте пространство имен модуля «turtle»

source: Using ``from turtle import *`` is convenient - but be warned that it imports a rather large collection of objects, and if you're doing anything but turtle graphics you run the risk of a name conflict (this becomes even more an issue if you're using turtle graphics in a script where other modules might be imported).
ru: Использование ``from Turtle import *`` удобно, но имейте в виду, что оно импортирует довольно большую коллекцию объектов, и если вы делаете что-то кроме черепашьей графики, вы рискуете столкнуться с конфликтом имен (это становится еще более серьезной проблемой). если вы используете черепаховую графику в скрипте, куда могут быть импортированы другие модули).

source: The solution is to use ``import turtle`` - ``fd()`` becomes ``turtle.fd()``, ``width()`` becomes ``turtle.width()`` and so on. (If typing "turtle" over and over again becomes tedious, use for example ``import turtle as t`` instead.)
ru: Решением является использование ``import turtle`` - ``fd()`` становится ``turtle.fd()``, ``width()`` становится ``turtle.width()`` и так далее. (Если набирать слово "черепаха" снова и снова становится утомительно, используйте вместо него Например, ``import turtle as t`` ).

source: Use turtle graphics in a script
ru: Используйте графику черепахи в скрипте

source: It's recommended to use the ``turtle`` module namespace as described immediately above, for example::
ru: Рекомендуется использовать пространство имен модуля «черепаха», как описано выше, например:

source: Another step is also required though - as soon as the script ends, Python will also close the turtle's window. Add::
ru: Однако требуется еще один шаг — как только скрипт завершится, Python также закроет окно черепахи. Добавлять::

source: to the end of the script. The script will now wait to be dismissed and will not exit until it is terminated, for example by closing the turtle graphics window.
ru: до конца сценария. Сценарий теперь будет ждать закрытия и не выйдет до тех пор, пока не будет завершен, например, закрыв окно графики черепахи.

source: Use object-oriented turtle graphics
ru: Используйте объектно-ориентированную черепаховую графику

source: :ref:`Explanation of the object-oriented interface <turtle-explanation>`
ru: :ref:`Пояснение объектно-ориентированного интерфейса <turtle-explanation>`

source: Other than for very basic introductory purposes, or for trying things out as quickly as possible, it's more usual and much more powerful to use the object-oriented approach to turtle graphics. For example, this allows multiple turtles on screen at once.
ru: Помимо самых простых вводных целей или для максимально быстрого опробования, более обычным и гораздо более эффективным является использование объектно-ориентированного подхода к черепашьей графике. Например, это позволяет одновременно отображать на экране несколько черепах.

source: In this approach, the various turtle commands are methods of objects (mostly of ``Turtle`` objects). You *can* use the object-oriented approach in the shell, but it would be more typical in a Python script.
ru: В этом подходе различные команды черепахи являются методами объектов (в основном объектов «Черепаха»). Вы *можете* использовать объектно-ориентированный подход в оболочке, но он более типичен для сценария Python.

source: The example above then becomes::
ru: Приведенный выше пример становится::

source: Note the last line. ``t.screen`` is an instance of the :class:`Screen` that a Turtle instance exists on; it's created automatically along with the turtle.
ru: Обратите внимание на последнюю строку. ``t.screen`` — это экземпляр :class:`Screen`, на котором существует экземпляр Turtle; он создается автоматически вместе с черепахой.

source: The turtle's screen can be customised, for example::
ru: Экран черепахи можно настроить, например:

source: t.screen.title('Object-oriented turtle demo') t.screen.bgcolor("orange")
ru: t.screen.title('Демо-версия объектно-ориентированной черепахи') t.screen.bgcolor("оранжевый")

source: Turtle graphics reference
ru: Справочник по графике черепах

source: In the following documentation the argument list for functions is given. Methods, of course, have the additional first argument *self* which is omitted here.
ru: В следующей документации приведен список аргументов для функций. Методы, конечно, имеют дополнительный первый аргумент *self*, который здесь опущен.
uk: У наступній документації подано список аргументів для функцій. Методи, звичайно, мають додатковий перший аргумент *self*, який тут опущено.

source: Turtle methods
ru: Методы Turtle
uk: Методи черепахи

source: Turtle motion
ru: Движение Turtle
uk: Рух черепахи

source: Move and draw
ru: Двигайся и рисуй
uk: Рухайтесь і малюйте

source: Tell Turtle's state
ru: Сообщите о состоянии Черепахи
uk: Розкажіть про стан Черепахи

source: Setting and measurement
ru: Установка и измерение
uk: Налаштування та вимірювання

source: Drawing state
ru: Состояние рисования
uk: Стан малюнка

source: Color control
ru: Управление цветом
uk: Контроль кольору

source: Filling
ru: Наполнение
uk: Наповнення

source: More drawing control
ru: Больше контроля над рисованием
uk: Більше контролю малювання

source: Turtle state
ru: Состояние Turtle
uk: Держава черепахи

source: Visibility
ru: Видимость
uk: Видимість

source: Appearance
ru: Появление
uk: Зовнішній вигляд

source: Using events
ru: Использование событий
uk: Використання подій

source: Special Turtle methods
ru: специальные методы Turtle
uk: Спеціальні методи Черепахи

source: Methods of TurtleScreen/Screen
ru: Методы TurtleScreen/Screen
uk: Методи TurtleScreen/Screen

source: Window control
ru: Управление окнами
uk: Віконний контроль

source: Animation control
ru: Управление анимацией
uk: Керування анімацією

source: Using screen events
ru: Использование экранных событий
uk: Використання екранних подій

source: Settings and special methods
ru: Настройки и специальные методы
uk: Налаштування та спеціальні методи

source: Input methods
ru: Методы ввода
uk: Методи введення

source: Methods specific to Screen
ru: Методы, специфичные для Screen
uk: Методи, специфічні для Screen

source: Methods of RawTurtle/Turtle and corresponding functions
ru: Методы RawTurtle/Turtle и соответствующие функции
uk: Методи RawTurtle/Turtle та відповідні функції

source: Most of the examples in this section refer to a Turtle instance called ``turtle``.
ru: Большинство примеров в этом разделе относятся к экземпляру Turtle под названием «turtle».
uk: Більшість прикладів у цьому розділі стосуються екземпляра Turtle під назвою ``turtle``.

source: Parameters
ru: Параметры
uk: Параметри

source: a number (integer or float)
ru: число (целое или с плавающей запятой)
uk: число (ціле чи з плаваючою точкою)

source: Move the turtle forward by the specified *distance*, in the direction the turtle is headed.
ru: Переместите черепаху вперед на указанное *distance* в том направлении, в котором она движется.
uk: Перемістіть черепаху вперед на вказану *відстань*, у напрямку, куди прямує черепаха.

source: a number
ru: число
uk: число

source: Move the turtle backward by *distance*, opposite to the direction the turtle is headed. Do not change the turtle's heading.
ru: Переместите черепаху назад на *расстояние*, противоположное направлению движения черепахи. Не меняйте заголовок черепахи.
uk: Перемістіть черепаху назад на *відстань*, протилежну напрямку руху черепахи. Не змінюйте напрямок черепахи.

source: Turn turtle right by *angle* units. (Units are by default degrees, but can be set via the :func:`degrees` and :func:`radians` functions.) Angle orientation depends on the turtle mode, see :func:`mode`.
ru: Поверните черепаху вправо на *угол*. (Единицами измерения по умолчанию являются градусы, но их можно установить с помощью функций :func:`grades` и :func:`radians`.) Ориентация угла зависит от режима черепахи, см. :func:`mode`.
uk: Поверніть черепаху праворуч на одиниці *кут*. (За замовчуванням одиницями є градуси, але їх можна встановити за допомогою функцій :func:`degrees` і :func:`radians`.) Кутова орієнтація залежить від режиму черепахи, див. :func:`mode`.

source: Turn turtle left by *angle* units. (Units are by default degrees, but can be set via the :func:`degrees` and :func:`radians` functions.) Angle orientation depends on the turtle mode, see :func:`mode`.
ru: Поверните черепаху влево на *angle*. (Единицами измерения по умолчанию являются градусы, но их можно установить с помощью функций :func:`degrees` и :func:`radians`.) Ориентация угла зависит от режима черепахи, см. :func:`mode`.
uk: Поверніть черепаху ліворуч на *кут*. (За замовчуванням одиницями є градуси, але їх можна встановити за допомогою функцій :func:`degrees` і :func:`radians`.) Кутова орієнтація залежить від режиму черепахи, див. :func:`mode`.

source: a number or a pair/vector of numbers
ru: число или пара/вектор чисел
uk: число або пара/вектор чисел

source: a number or ``None``
ru: число или ``None``
uk: число або ``Жодного``

source: If *y* is ``None``, *x* must be a pair of coordinates or a :class:`Vec2D` (e.g. as returned by :func:`pos`).
ru: Если *y* равно ``None``, *x* должно быть парой координат или :class:`Vec2D` (например, как возвращается :func:`pos`).
uk: Якщо *y* має значення ``None``, *x* має бути парою координат або :class:`Vec2D` (наприклад, як повернуто :func:`pos`).

source: Move turtle to an absolute position. If the pen is down, draw line. Do not change the turtle's orientation.
ru: Переместите черепаху в абсолютное положение. Если ручка опущена, нарисуйте линию. Не меняйте ориентацию черепахи.
uk: Перемістіть черепаху в абсолютне положення. Якщо ручка опущена, намалюйте лінію. Не змінюйте орієнтацію черепахи.

source: a boolean
ru: логическое значение
uk: логічне значення

source: Move turtle to an absolute position. Unlike goto(x, y), a line will not be drawn. The turtle's orientation does not change. If currently filling, the polygon(s) teleported from will be filled after leaving, and filling will begin again after teleporting. This can be disabled with fill_gap=True, which makes the imaginary line traveled during teleporting act as a fill barrier like in goto(x, y).
ru: Переместите черепаху в абсолютное положение. В отличие от goto(x, y), линия не будет нарисована. Ориентация черепахи не меняется. Если в данный момент происходит заполнение, полигоны, из которых телепортировался(и), будут заполнены после выхода, и заполнение начнется снова после телепортации. Это можно отключить с помощью fill_gap=True, что заставляет воображаемую линию, пройденную во время телепортации, действовать как заполняющий барьер, как в goto(x, y).

source: Set the turtle's first coordinate to *x*, leave second coordinate unchanged.
ru: Установите первую координату черепахи на *x*, вторую координату оставьте без изменений.
uk: Встановіть першу координату черепахи на *x*, другу залиште без змін.

source: Set the turtle's second coordinate to *y*, leave first coordinate unchanged.
ru: Установите вторую координату черепахи на *y*, оставьте первую координату неизменной.
uk: Встановіть другу координату черепахи на *y*, залиште першу координату без змін.

source: Set the orientation of the turtle to *to_angle*. Here are some common directions in degrees:
ru: Установите ориентацию черепахи на *to_angle*. Вот некоторые распространенные направления в градусах:
uk: Встановіть орієнтацію черепахи на *to_angle*. Ось кілька поширених напрямків у градусах:

source: standard mode
ru: стандартный режим
uk: стандартний режим

source: logo mode
ru: режим логотипа
uk: режим логотипу

source: 0 - east
ru: 0 - восток
uk: 0 - схід

source: 0 - north
ru: 0 - север
uk: 0 - північ

source: 90 - north
ru: 90 - север
uk: 90 - півн

source: 90 - east
ru: 90 - восток
uk: 90 - сх

source: 180 - west
ru: 180 - запад
uk: 180 - зах

source: 180 - south
ru: 180 - юг
uk: 180 - півд

source: 270 - south
ru: 270 - юг
uk: 270 - півд

source: 270 - west
ru: 270 - запад
uk: 270 - зах

source: Move turtle to the origin -- coordinates (0,0) -- and set its heading to its start-orientation (which depends on the mode, see :func:`mode`).
ru: Переместите черепаху в начало координат — coordinates (0,0) — и установите ее курс в исходную ориентацию (которая зависит от режима, см. :func:`mode`).
uk: Перемістіть черепаху в початкову точку -- координати (0,0) -- і встановіть її напрям на початкову орієнтацію (яка залежить від режиму, див. :func:`mode`).

source: a number (or ``None``)
ru: число (или ``None``)
uk: число (або ``Жодного``)

source: an integer (or ``None``)
ru: целое число (или ``None``)
uk: ціле число (або ``Жодного``)
