Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/turtle.po
Languages: ru, uk

source: ``a * b`` inner product
ru: ``a * b`` внутренний продукт
uk: ``a * b`` скалярний добуток

source: ``k * a`` and ``a * k`` multiplication with scalar
ru: ``k * a`` и ``a * k`` умножение со скаляром
uk: Множення ``k * a`` і ``a * k`` на скаляр

source: ``abs(a)`` absolute value of a
ru: ``abs(a)`` абсолютное значение a
uk: ``abs(a)`` абсолютне значення a

source: ``a.rotate(angle)`` rotation
ru: Ротация ``a.rotate(angle)``
uk: ``a.rotate(angle)`` обертання

source: Explanation
ru: Пояснение
uk: Пояснення

source: A turtle object draws on a screen object, and there a number of key classes in the turtle object-oriented interface that can be used to create them and relate them to each other.
ru: Объект черепахи рисуется на объекте экрана, и в объектно-ориентированном интерфейсе черепахи существует ряд ключевых классов, которые можно использовать для их создания и связи друг с другом.

source: A :class:`Turtle` instance will automatically create a :class:`Screen` instance if one is not already present.
ru: Экземпляр :class:`Turtle` автоматически создаст экземпляр :class:`Screen`, если он еще не существует.

source: ``Turtle`` is a subclass of :class:`RawTurtle`, which *doesn't* automatically create a drawing surface - a *canvas* will need to be provided or created for it. The *canvas* can be a :class:`!tkinter.Canvas`, :class:`ScrolledCanvas` or :class:`TurtleScreen`.
ru: ``Turtle`` является подклассом :class:`RawTurtle`, который *не* автоматически создает поверхность рисования — для нее необходимо предоставить или создать *canvas*. *canvas* может быть :class:`!tkinter.Canvas`, :class:`ScrolledCanvas` или :class:`TurtleScreen`.

source: :class:`TurtleScreen` is the basic drawing surface for a turtle. :class:`Screen` is a subclass of ``TurtleScreen``, and includes :ref:`some additional methods <screenspecific>` for managing its appearance (including size and title) and behaviour. ``TurtleScreen``'s constructor needs a :class:`!tkinter.Canvas` or a :class:`ScrolledCanvas` as an argument.
ru: :class:`TurtleScreen` — это базовая поверхность для рисования черепахи. :class:`Screen` является подклассом ``TurtleScreen`` и включает :ref:`некоторые дополнительные методы <screenspecific>` для управления его внешним видом (включая размер и заголовок) и поведением. Конструктору TurtleScreen требуется :class:`!tkinter.Canvas` или :class:`ScrolledCanvas` в качестве аргумента.

source: The functional interface for turtle graphics uses the various methods of ``Turtle`` and ``TurtleScreen``/``Screen``. Behind the scenes, a screen object is automatically created whenever a function derived from a ``Screen`` method is called. Similarly, a turtle object is automatically created whenever any of the functions derived from a Turtle method is called.
ru: Функциональный интерфейс для черепашьей графики использует различные методы Turtle и TurtleScreen/Screen. За кулисами объект экрана автоматически создается при каждом вызове функции, производной от метода Screen. Аналогично, объект черепахи автоматически создается при каждом вызове любой функции, производной от метода Черепахи.

source: To use multiple turtles on a screen, the object-oriented interface must be used.
ru: Чтобы использовать несколько черепах на экране, необходимо использовать объектно-ориентированный интерфейс.

source: Help and configuration
ru: Помощь и настройка
uk: Допомога та налаштування

source: How to use help
ru: Как использовать помощь
uk: Як користуватися довідкою

source: The public methods of the Screen and Turtle classes are documented extensively via docstrings. So these can be used as online-help via the Python help facilities:
ru: Открытые методы классов Screen и Turtle подробно документированы в строках документации. Таким образом, их можно использовать в качестве онлайн-справки через справочные средства Python:
uk: Загальнодоступні методи класів Screen і Turtle широко задокументовані в рядках документації. Тож їх можна використовувати як онлайн-довідку через засоби довідки Python:

source: When using IDLE, tooltips show the signatures and first lines of the docstrings of typed in function-/method calls.
ru: При использовании IDLE во всплывающих подсказках отображаются подписи и первые строки строк документации введенных вызовов функций/методов.
uk: Під час використання IDLE підказки показують підписи та перші рядки рядків документації введених викликів функцій/методів.

source: Calling :func:`help` on methods or functions displays the docstrings::
ru: Вызов :func:`help` для методов или функций отображает строки документации::
uk: Виклик :func:`help` для методів або функцій відображає рядки документів::

source: The docstrings of the functions which are derived from methods have a modified form::
ru: Строки документации функций, производных от методов, имеют измененную форму:
uk: Документаційні рядки функцій, які є похідними від методів, мають змінену форму:

source: These modified docstrings are created automatically together with the function definitions that are derived from the methods at import time.
ru: Эти измененные строки документации создаются автоматически вместе с определениями функций, полученными из методов во время импорта.
uk: Ці змінені рядки документації створюються автоматично разом із визначеннями функцій, отриманими з методів під час імпорту.

source: Translation of docstrings into different languages
ru: Перевод строк документации на разные языки
uk: Переклад рядків документів різними мовами

source: There is a utility to create a dictionary the keys of which are the method names and the values of which are the docstrings of the public methods of the classes Screen and Turtle.
ru: Существует утилита для создания словаря, ключами которого являются имена методов, а значениями — строки документации публичных методов классов Screen и Turtle.
uk: Існує утиліта для створення словника, ключами якого є імена методів, а значеннями яких є рядки документів відкритих методів класів Screen і Turtle.

source: a string, used as filename
ru: строка, используемая как имя файла
uk: рядок, який використовується як ім'я файлу

source: Create and write docstring-dictionary to a Python script with the given filename. This function has to be called explicitly (it is not used by the turtle graphics classes). The docstring dictionary will be written to the Python script :file:`{filename}.py`. It is intended to serve as a template for translation of the docstrings into different languages.
ru: Создайте и запишите словарь строк документации в скрипт Python с заданным именем файла. Эту функцию необходимо вызывать явно (она не используется классами графики черепах). Словарь документации будет записан в скрипт Python :file:`{filename}.py`. Он предназначен служить шаблоном для перевода строк документации на разные языки.
uk: Створіть і запишіть docstring-dictionary у сценарій Python із вказаною назвою файлу. Цю функцію потрібно викликати явно (вона не використовується графічними класами turtle). Словник рядків документів буде записаний у сценарій Python :file:`{filename}.py`. Він призначений для того, щоб служити шаблоном для перекладу рядків документів різними мовами.

source: If you (or your students) want to use :mod:`turtle` with online help in your native language, you have to translate the docstrings and save the resulting file as e.g. :file:`turtle_docstringdict_german.py`.
ru: Если вы (или ваши ученики) хотите использовать :mod:`turtle` с онлайн-справкой на вашем родном языке, вам необходимо перевести строки документации и сохранить полученный файл, например, как :file:`turtle_docstringdict_german.py`.
uk: Якщо ви (або ваші студенти) бажаєте використовувати :mod:`turtle` з онлайн-довідкою вашою рідною мовою, вам потрібно перекласти рядки документації та зберегти отриманий файл як, напр. :file:`turtle_docstringdict_german.py`.

source: If you have an appropriate entry in your :file:`turtle.cfg` file this dictionary will be read in at import time and will replace the original English docstrings.
ru: Если у вас есть соответствующая запись в файле :file:`turtle.cfg`, этот словарь будет прочитан во время импорта и заменит исходные строки документации на английском языке.
uk: Якщо у вашому файлі :file:`turtle.cfg` є відповідний запис, цей словник буде зчитано під час імпортування та замінить оригінальні англійські рядки документів.

source: At the time of this writing there are docstring dictionaries in German and in Italian. (Requests please to glingl@aon.at.)
ru: На момент написания этой статьи существовали словари строк документации на немецком и итальянском языках. (Просьба обращаться по адресу glingl@aon.at.)
uk: На момент написання цієї статті існують словники docstring німецькою та італійською мовами. (Запити надсилайте на glingl@aon.at.)

source: How to configure Screen and Turtles
ru: Как настроить Экран и Черепахи
uk: Як налаштувати екран і черепахи

source: The built-in default configuration mimics the appearance and behaviour of the old turtle module in order to retain best possible compatibility with it.
ru: Встроенная конфигурация по умолчанию имитирует внешний вид и поведение старого модуля черепахи, чтобы сохранить с ним наилучшую совместимость.
uk: Вбудована конфігурація за замовчуванням імітує зовнішній вигляд і поведінку старого модуля Turtle, щоб зберегти найкращу сумісність із ним.

source: If you want to use a different configuration which better reflects the features of this module or which better fits to your needs, e.g. for use in a classroom, you can prepare a configuration file ``turtle.cfg`` which will be read at import time and modify the configuration according to its settings.
ru: Если вы хотите использовать другую конфигурацию, которая лучше отражает возможности этого модуля или которая лучше соответствует вашим потребностям, например, для использования в классе, вы можете подготовить файл конфигурации ``turtle.cfg``, который будет прочитан при импорте. время и измените конфигурацию в соответствии с ее настройками.
uk: Якщо ви хочете використовувати іншу конфігурацію, яка краще відображає функції цього модуля або яка краще відповідає вашим потребам, напр. для використання в класі ви можете підготувати файл конфігурації ``turtle.cfg``, який буде прочитано під час імпорту та змінено конфігурацію відповідно до його параметрів.

source: The built in configuration would correspond to the following ``turtle.cfg``:
ru: Встроенная конфигурация будет соответствовать следующему ``turtle.cfg``:

source: Short explanation of selected entries:
ru: Краткое объяснение выбранных записей:
uk: Коротке пояснення вибраних записів:

source: The first four lines correspond to the arguments of the :func:`Screen.setup <setup>` method.
ru: Первые четыре строки соответствуют аргументам метода :func:`Screen.setup <setup>`.

source: Line 5 and 6 correspond to the arguments of the method :func:`Screen.screensize <screensize>`.
ru: Строки 5 и 6 соответствуют аргументам метода :func:`Screen.screensize <screensize>`.

source: *shape* can be any of the built-in shapes, e.g: arrow, turtle, etc. For more info try ``help(shape)``.
ru: *shape* может быть любой из встроенных фигур, например: стрелка, черепаха и т. д. Для получения дополнительной информации попробуйте ``help(shape)``.
uk: *shape* може бути будь-якою вбудованою формою, наприклад: стрілка, черепаха тощо. Щоб дізнатися більше, спробуйте ``help(shape)``.

source: If you want to use no fill color (i.e. make the turtle transparent), you have to write ``fillcolor = ""`` (but all nonempty strings must not have quotes in the cfg file).
ru: Если вы хотите не использовать цвет заливки (т.е. сделать черепаху прозрачной), вам нужно написать ``fillcolor = ""`` (но все непустые строки в файле cfg не должны иметь кавычек).

source: If you want to reflect the turtle its state, you have to use ``resizemode = auto``.
ru: Если вы хотите отразить состояние черепахи, вам нужно использовать resizemode = auto.
uk: Якщо ви хочете відобразити черепаху в її стані, ви повинні використовувати ``resizemode = auto``.

source: If you set e.g. ``language = italian`` the docstringdict :file:`turtle_docstringdict_italian.py` will be loaded at import time (if present on the import path, e.g. in the same directory as :mod:`turtle`).
ru: Если вы установите, например, ``language = italian``, файл docstringdict:file:`turtle_docstringdict_italian.py` будет загружен во время импорта (если он присутствует в пути импорта, например, в том же каталоге, что и :mod:`turtle`).

source: The entries *exampleturtle* and *examplescreen* define the names of these objects as they occur in the docstrings. The transformation of method-docstrings to function-docstrings will delete these names from the docstrings.
ru: Записи *exampleturtle* и *examplescreen* определяют имена этих объектов в том виде, в котором они встречаются в строках документации. Преобразование строк документации методов в строки документации функций приведет к удалению этих имен из строк документации.
uk: Записи *exampleturtle* і *examplescreen* визначають імена цих об’єктів, як вони зустрічаються в рядках документації. Трансформація method-docstrings у function-docstrings видалить ці імена з docstrings.

source: *using_IDLE*: Set this to ``True`` if you regularly work with IDLE and its ``-n`` switch ("no subprocess"). This will prevent :func:`exitonclick` to enter the mainloop.
ru: *using_IDLE*: установите для этого параметра значение «True», если вы регулярно работаете с IDLE и его переключателем «-n» («нет подпроцесса»). Это предотвратит вход :func:`exitonclick` в основной цикл.

source: There can be a :file:`turtle.cfg` file in the directory where :mod:`turtle` is stored and an additional one in the current working directory. The latter will override the settings of the first one.
ru: В каталоге, где хранится :mod:`turtle`, может находиться файл :file:`turtle.cfg` и дополнительный файл в текущем рабочем каталоге. Последний переопределяет настройки первого.
uk: У каталозі, де зберігається :mod:`turtle`, може бути файл :file:`turtle.cfg` і додатковий у поточному робочому каталозі. Останній замінить налаштування першого.

source: The :file:`Lib/turtledemo` directory contains a :file:`turtle.cfg` file. You can study it as an example and see its effects when running the demos (preferably not from within the demo-viewer).
ru: Каталог :file:`Lib/turtledemo` содержит файл :file:`turtle.cfg`. Вы можете изучить его на примере и увидеть его эффект при запуске демо (желательно не из программы просмотра демо).
uk: Каталог :file:`Lib/turtledemo` містить файл :file:`turtle.cfg`. Ви можете вивчити його як приклад і побачити його вплив під час запуску демонстрацій (бажано не з програми перегляду демонстрацій).

source: :mod:`turtledemo` --- Demo scripts
ru: :mod:`turtledemo` --- Демо-скрипты
uk: :mod:`turtledemo` --- Демонстраційні скрипти

source: The :mod:`turtledemo` package includes a set of demo scripts. These scripts can be run and viewed using the supplied demo viewer as follows::
ru: Пакет :mod:`turtledemo` включает в себя набор демонстрационных скриптов. Эти сценарии можно запустить и просмотреть с помощью прилагаемого демонстрационного средства просмотра следующим образом:
uk: Пакет :mod:`turtledemo` містить набір демонстраційних скриптів. Ці сценарії можна запускати та переглядати за допомогою демонстраційного засобу перегляду, що входить до комплекту, наступним чином:

source: Alternatively, you can run the demo scripts individually. For example, ::
ru: Кроме того, вы можете запускать демонстрационные сценарии по отдельности. Например, ::
uk: Крім того, ви можете запускати демонстраційні сценарії окремо. Наприклад, ::

source: The :mod:`turtledemo` package directory contains:
ru: Каталог пакета :mod:`turtledem` содержит:
uk: Каталог пакунків :mod:`turtledemo` містить:

source: A demo viewer :file:`__main__.py` which can be used to view the sourcecode of the scripts and run them at the same time.
ru: Демо-просмотрщик :file:`__main__.py`, который можно использовать для просмотра исходного кода скриптов и их одновременного запуска.
uk: Демо-переглядач :file:`__main__.py`, який можна використовувати для перегляду вихідного коду сценаріїв і запуску їх одночасно.

source: Multiple scripts demonstrating different features of the :mod:`turtle` module. Examples can be accessed via the Examples menu. They can also be run standalone.
ru: Несколько скриптов, демонстрирующих различные возможности модуля :mod:`turtle`. Доступ к примерам можно получить через меню «Примеры». Их также можно запускать автономно.
uk: Кілька сценаріїв, що демонструють різні функції модуля :mod:`turtle`. Доступ до прикладів можна отримати через меню "Приклади". Їх також можна запускати автономно.

source: A :file:`turtle.cfg` file which serves as an example of how to write and use such files.
ru: Файл :file:`turtle.cfg`, который служит примером написания и использования таких файлов.
uk: Файл :file:`turtle.cfg`, який служить прикладом того, як писати та використовувати такі файли.

source: The demo scripts are:
ru: Демонстрационные скрипты:
uk: Демонстраційні сценарії:

source: Name
ru: Имя
uk: Ім'я

source: Description
ru: Описание
uk: опис

source: Features
ru: Особенности
uk: особливості

source: complex classical turtle graphics pattern
ru: сложный классический графический узор в виде черепахи
uk: складний класичний графічний візерунок черепахи

source: :func:`tracer`, delay, :func:`update`
ru: :func:`tracer`, задержка, :func:`update`
uk: :func:`tracer`, затримка, :func:`update`

source: graphs Verhulst dynamics, shows that computer's computations can generate results sometimes against the common sense expectations
ru: графики динамики Ферхюльста показывают, что компьютерные вычисления иногда могут давать результаты, противоречащие ожиданиям здравого смысла
uk: графіки динаміки Верхульста показують, що комп’ютерні обчислення можуть генерувати результати, іноді проти очікувань здорового глузду

source: world coordinates
ru: мировые координаты
uk: світові координати

source: clock
ru: часы
uk: годинник

source: analog clock showing time of your computer
ru: аналоговые часы, показывающие время вашего компьютера
uk: аналоговий годинник, який показує час вашого комп'ютера

source: turtles as clock's hands, ontimer
ru: черепахи, как стрелки часов, точно по расписанию
uk: черепахи як стрілки годинника, онтаймер

source: experiment with r, g, b
ru: поэкспериментируйте с r, g, b
uk: дослід з r, g, b

source: 3 breadth-first trees
ru: 3 дерева в ширину
uk: 3 дерева в ширину

source: randomization
ru: рандомизация
uk: рандомізація

source: Hilbert & Koch curves
ru: Кривые Гильберта и Коха
uk: Криві Гільберта і Коха

source: recursion
ru: рекурсия
uk: рекурсія

source: ethnomathematics (indian kolams)
ru: Этноматематика (индийские коламы)
uk: етноматематика (індійські колами)

source: Towers of Hanoi
ru: Башни Ханоя
uk: Ханойські вежі

source: Rectangular Turtles as Hanoi discs (shape, shapesize)
ru: Прямоугольные черепахи в виде ханойских дисков (форма, размеры)
uk: Прямокутні черепахи як ханойські диски (форма, розмір)

source: play the classical nim game with three heaps of sticks against the computer.
ru: сыграйте в классическую игру nim с тремя кучками палочек против компьютера.
uk: грати в класичну гру nim з трьома купами палиць проти комп'ютера.

source: turtles as nimsticks, event driven (mouse, keyboard)
ru: черепахи как нимтики, управляемые событиями (мышь, клавиатура)
uk: черепахи як німки, керовані подіями (миша, клавіатура)

source: super minimalistic drawing program
ru: супер минималистичная программа для рисования
uk: супер мінімалістична програма для малювання

source: peace
ru: мир
uk: мир

source: elementary
ru: элементарный
uk: елементарний

source: turtle: appearance and animation
ru: Черепаха: внешний вид и анимация
uk: черепаха: зовнішній вигляд і анімація

source: aperiodic tiling with kites and darts
ru: апериодическая мозаика с воздушными змеями и дротиками
uk: аперіодичне укладання з повітряними зміями та дротиками

source: simulation of gravitational system
ru: моделирование гравитационной системы
uk: моделювання гравітаційної системи

source: compound shapes, :class:`Vec2D`
ru: составные фигуры, :class:`Vec2D`
uk: складені форми, :class:`Vec2D`

source: rosette
ru: розетка

source: a pattern from the wikipedia article on turtle graphics
ru: шаблон из статьи Википедии о графике черепах
uk: зразок зі статті у Вікіпедії про черепахову графіку

source: dancing turtles rotating pairwise in opposite direction
ru: Танцующие черепахи, вращающиеся парами в противоположном направлении
uk: танцюючі черепахи, що обертаються попарно в протилежному напрямку

source: compound shapes, clone shapesize, tilt, get_shapepoly, update
ru: составные фигуры, клонирование shapesize, наклон, get_shapepoly, обновление
uk: складені форми, клон shapesize, нахил, get_shapepoly, оновлення

source: visual demonstration of different sorting methods
ru: наглядная демонстрация различных методов сортировки
uk: наочна демонстрація різних методів сортування

source: simple alignment, randomization
ru: Простое выравнивание, рандомизация
uk: просте вирівнювання, рандомізація

source: tree
ru: дерево
uk: дерево

source: a (graphical) breadth first tree (using generators)
ru: (графическое) дерево в ширину (с использованием генераторов)
uk: (графічне) дерево в ширину (з використанням генераторів)

source: simple design
ru: простой дизайн
uk: простий дизайн

source: turtles on two canvases
ru: черепахи на двух полотнах
uk: черепахи на двох полотнах

source: another elementary example
ru: еще один элементарный пример
uk: ще один елементарний приклад

source: Have fun!
ru: Веселитесь!
uk: весело провести час!

source: Changes since Python 2.6
ru: Изменения, произошедшие с версии Python 2.6
uk: Зміни з Python 2.6

source: The methods :func:`Turtle.tracer <tracer>`, :func:`Turtle.window_width <window_width>` and :func:`Turtle.window_height <window_height>` have been eliminated. Methods with these names and functionality are now available only as methods of :class:`Screen`. The functions derived from these remain available. (In fact already in Python 2.6 these methods were merely duplications of the corresponding :class:`TurtleScreen`/:class:`Screen` methods.)
ru: Методы :func:`Turtle.tracer <tracer>`, :func:`Turtle.window_width <window_width>` и :func:`Turtle.window_height <window_height>` были исключены. Методы с такими именами и функциями теперь доступны только как методы :class:`Screen`. Функции, производные от них, остаются доступными. (На самом деле уже в Python 2.6 эти методы были просто дубликатами соответствующих методов :class:`TurtleScreen`/:class:`Screen`.)

source: The method :func:`!Turtle.fill` has been eliminated. The behaviour of :func:`begin_fill` and :func:`end_fill` have changed slightly: now every filling process must be completed with an ``end_fill()`` call.
ru: Метод :func:`!Turtle.fill` удален. Поведение :func:`begin_fill` и :func:`end_fill` немного изменилось: теперь каждый процесс заполнения должен завершаться вызовом ``end_fill()``.

source: A method :func:`Turtle.filling <filling>` has been added. It returns a boolean value: ``True`` if a filling process is under way, ``False`` otherwise. This behaviour corresponds to a ``fill()`` call without arguments in Python 2.6.
ru: Добавлен метод :func:`Turtle.filling <filling>`. Он возвращает логическое значение: ``True``, если идет процесс заполнения, ``False`` в противном случае. Такое поведение соответствует вызову fill() без аргументов в Python 2.6.

source: Changes since Python 3.0
ru: Изменения по сравнению с Python 3.0
uk: Зміни з Python 3.0
