Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/turtle.po
Languages: ru, uk

source: Make the turtle invisible. It's a good idea to do this while you're in the middle of doing some complex drawing, because hiding the turtle speeds up the drawing observably.
ru: Сделайте черепаху невидимой. Это хорошая идея, пока вы выполняете какой-то сложный рисунок, потому что скрытие черепахи заметно ускоряет рисование.
uk: Зробіть черепаху невидимою. Бажано робити це, поки ви виконуєте якийсь складний малюнок, тому що приховання черепахи значно прискорює малювання.

source: Make the turtle visible.
ru: Сделайте черепаху видимой.
uk: Зробіть черепаху видимою.

source: Return ``True`` if the Turtle is shown, ``False`` if it's hidden.
ru: Верните True, если Черепаха отображается, и False, если она скрыта.
uk: Повертає ``True``, якщо черепаха показана, ``False``, якщо вона прихована.

source: a string which is a valid shapename
ru: строка, которая является допустимым именем фигуры
uk: рядок, який є дійсним іменем форми

source: Set turtle shape to shape with given *name* or, if name is not given, return name of current shape. Shape with *name* must exist in the TurtleScreen's shape dictionary. Initially there are the following polygon shapes: "arrow", "turtle", "circle", "square", "triangle", "classic". To learn about how to deal with shapes see Screen method :func:`register_shape`.
ru: строка, которая является допустимым именем фигуры
uk: Установити фігуру черепахи у форму з заданим *ім’ям* або, якщо ім’я не вказано, повернути назву поточної форми. Фігура з *ім’ям* має існувати в словнику форм TurtleScreen. Спочатку є такі форми багатокутників: "стрілка", "черепаха", "коло", "квадрат", "трикутник", "класика". Щоб дізнатися про те, як працювати з фігурами, перегляньте метод екрану :func:`register_shape`.

source: one of the strings "auto", "user", "noresize"
ru: одна из строк «auto», «user», «noresize»
uk: один із рядків "auto", "user", "noresize"

source: Set resizemode to one of the values: "auto", "user", "noresize". If *rmode* is not given, return current resizemode. Different resizemodes have the following effects:
ru: Установите для параметра resizemode одно из значений: «auto», «user», «noresize». Если *rmode* не задан, возвращается текущий режим изменения размера. Различные режимы изменения размера имеют следующие эффекты:
uk: Встановіть для режиму зміни розміру одне зі значень: "авто", "користувач", "норесайз". Якщо *rmode* не вказано, повертає поточний режим зміни розміру. Різні режими зміни розміру мають такі ефекти:

source: "auto": adapts the appearance of the turtle corresponding to the value of pensize.
ru: «авто»: адаптирует внешний вид черепахи в соответствии со значением pensize.
uk: "авто": адаптує зовнішній вигляд черепахи відповідно до значення pensize.

source: "user": adapts the appearance of the turtle according to the values of stretchfactor and outlinewidth (outline), which are set by :func:`shapesize`.
ru: «пользователь»: адаптирует внешний вид черепахи в соответствии со значениями фактора растяжения и ширины контура (контура), которые задаются :func:`shapesize`.
uk: "user": адаптує зовнішній вигляд черепахи відповідно до значень stretchfactor і outlinewidth (контур), які встановлюються :func:`shapesize`.

source: "noresize": no adaption of the turtle's appearance takes place.
ru: «noresize»: никакой адаптации внешнего вида черепахи не происходит.
uk: "noresize": адаптація зовнішнього вигляду черепахи не відбувається.

source: ``resizemode("user")`` is called by :func:`shapesize` when used with arguments.
ru: ``resizemode("user")`` вызывается :func:`shapesize` при использовании с аргументами.
uk: ``resizemode("user")`` викликається :func:`shapesize` при використанні з аргументами.

source: positive number
ru: положительное число
uk: позитивне число

source: Return or set the pen's attributes x/y-stretchfactors and/or outline. Set resizemode to "user". If and only if resizemode is set to "user", the turtle will be displayed stretched according to its stretchfactors: *stretch_wid* is stretchfactor perpendicular to its orientation, *stretch_len* is stretchfactor in direction of its orientation, *outline* determines the width of the shape's outline.
ru: Возвращает или устанавливает атрибуты пера x/y-stretchfactors и/или контур. Установите режим изменения размера на «пользователь». Если и только если для параметра resizemode установлено значение «user», черепаха будет отображаться растянутой в соответствии с ее коэффициентами растяжения: *stretch_wid* — коэффициент растяжения, перпендикулярный ее ориентации, *stretch_len* — коэффициент растяжения в направлении ее ориентации, *outline* определяет ширину контура фигуры.

source: number (optional)
ru: число (опционально)
uk: номер (необов'язково)

source: Set or return the current shearfactor. Shear the turtleshape according to the given shearfactor shear, which is the tangent of the shear angle. Do *not* change the turtle's heading (direction of movement). If shear is not given: return the current shearfactor, i. e. the tangent of the shear angle, by which lines parallel to the heading of the turtle are sheared.
ru: Установите или верните текущий коэффициент сдвига. Сдвиньте форму черепахи в соответствии с заданным коэффициентом сдвига, который представляет собой тангенс угла сдвига. *Не* меняйте курс черепахи (направление движения). Если сдвиг не задан: верните текущий коэффициент сдвига, т.е. тангенс угла сдвига, на который срезаются линии, параллельные направлению черепахи.
uk: Встановити або повернути поточний коефіцієнт зсуву. Зрізайте форму черепахи відповідно до заданого коефіцієнта зсуву, який є тангенсом кута зсуву. *Не* змінюйте курс (напрямок руху) черепахи. Якщо зсув не вказано: повернути поточний коефіцієнт зсуву, тобто. д. тангенс кута зсуву, за яким зрізаються лінії, паралельні курсу черепахи.

source: Rotate the turtleshape by *angle* from its current tilt-angle, but do *not* change the turtle's heading (direction of movement).
ru: Поверните фигуру черепахи на *угол* от текущего угла наклона, но *не* меняйте курс черепахи (направление движения).
uk: Поверніть форму черепахи на *кут* від її поточного кута нахилу, але *не* змінюйте напрям черепахи (напрямок руху).

source: a number (optional)
ru: число (опционально)
uk: число (необов'язково)

source: Set or return the current tilt-angle. If angle is given, rotate the turtleshape to point in the direction specified by angle, regardless of its current tilt-angle. Do *not* change the turtle's heading (direction of movement). If angle is not given: return the current tilt-angle, i. e. the angle between the orientation of the turtleshape and the heading of the turtle (its direction of movement).
ru: Установите или верните текущий угол наклона. Если задан угол, поверните фигуру черепахи так, чтобы она указывала в направлении, указанном углом, независимо от ее текущего угла наклона. *Не* меняйте курс черепахи (направление движения). Если угол не указан: верните текущий угол наклона, то есть угол между ориентацией формы черепахи и направлением черепахи (направлением ее движения).
uk: Встановити або повернути поточний кут нахилу. Якщо задано кут, обертайте фігуру черепахи в напрямку, визначеному кутом, незалежно від її поточного кута нахилу. *Не* змінюйте курс (напрямок руху) черепахи. Якщо кут не вказано: повернути поточний кут нахилу, тобто. д. кут між орієнтацією фігури черепахи та курсом черепахи (напрямок її руху).

source: Set or return the current transformation matrix of the turtle shape.
ru: Установите или верните текущую матрицу преобразования формы черепахи.
uk: Встановити або повернути поточну матрицю перетворення фігури черепахи.

source: If none of the matrix elements are given, return the transformation matrix as a tuple of 4 elements. Otherwise set the given elements and transform the turtleshape according to the matrix consisting of first row t11, t12 and second row t21, t22. The determinant t11 * t22 - t12 * t21 must not be zero, otherwise an error is raised. Modify stretchfactor, shearfactor and tiltangle according to the given matrix.
ru: Если ни один из элементов матрицы не указан, верните матрицу преобразования в виде кортежа из 4 элементов. В противном случае установите данные элементы и преобразуйте форму черепахи в соответствии с матрицей, состоящей из первой строки t11, t12 и второй строки t21, t22. Определитель t11*t22 - t12*t21 не должен быть равен нулю, иначе выдается ошибка. Измените коэффициент растяжения, коэффициент сдвига и угол наклона в соответствии с заданной матрицей.
uk: Якщо жоден з елементів матриці не задано, поверніть матрицю перетворення як кортеж із 4 елементів. В іншому випадку встановіть задані елементи та перетворіть форму черепахи відповідно до матриці, що складається з першого рядка t11, t12 і другого рядка t21, t22. Визначник t11 * t22 - t12 * t21 не повинен дорівнювати нулю, інакше виникає помилка. Змініть коефіцієнт розтягування, коефіцієнт зсуву та кут нахилу відповідно до заданої матриці.

source: Return the current shape polygon as tuple of coordinate pairs. This can be used to define a new shape or components of a compound shape.
ru: Вернуть полигон текущей формы в виде кортежа пар координат. Это можно использовать для определения новой формы или компонентов составной формы.
uk: Повертає поточний полігон форми як кортеж пар координат. Це можна використовувати для визначення нової форми або компонентів складеної форми.

source: a function with two arguments which will be called with the coordinates of the clicked point on the canvas
ru: функция с двумя аргументами, которая будет вызываться с координатами точки щелчка на холсте
uk: функція з двома аргументами, яка буде викликана з координатами вибраної точки на полотні

source: number of the mouse-button, defaults to 1 (left mouse button)
ru: номер кнопки мыши, по умолчанию 1 (левая кнопка мыши)
uk: номер кнопки миші, за замовчуванням 1 (ліва кнопка миші)

source: ``True`` or ``False`` -- if ``True``, a new binding will be added, otherwise it will replace a former binding
ru: ``True`` или ``False`` — если ``True``, будет добавлена ​​новая привязка, в противном случае она заменит предыдущую привязку.
uk: ``True`` або ``False`` - якщо ``True``, буде додано нове прив'язування, інакше воно замінить попереднє прив'язування

source: Bind *fun* to mouse-click events on this turtle. If *fun* is ``None``, existing bindings are removed. Example for the anonymous turtle, i.e. the procedural way:
ru: Привяжите *fun* к событиям щелчка мышью на этой черепахе. Если *fun* имеет значение «Нет», существующие привязки удаляются. Пример для анонимной черепахи, т.е. процедурный способ:
uk: Прив’яжіть *fun* до подій клацання миші на цій черепахі. Якщо *fun* має значення ``None``, існуючі прив’язки видаляються. Приклад для анонімної черепахи, тобто процедурний спосіб:

source: Bind *fun* to mouse-button-release events on this turtle. If *fun* is ``None``, existing bindings are removed.
ru: Привяжите *fun* к событиям отпускания кнопки мыши на этой черепахе. Если *fun* имеет значение «Нет», существующие привязки удаляются.
uk: Прив’яжіть *fun* до подій натискання кнопки миші на цій черепашці. Якщо *fun* має значення ``None``, існуючі прив’язки видаляються.

source: Bind *fun* to mouse-move events on this turtle. If *fun* is ``None``, existing bindings are removed.
ru: Привяжите *fun* к событиям перемещения мыши на этой черепахе. Если *fun* имеет значение «Нет», существующие привязки удаляются.
uk: Прив’яжіть *fun* до подій руху миші на цій черепахі. Якщо *fun* має значення ``None``, існуючі прив’язки видаляються.

source: Remark: Every sequence of mouse-move-events on a turtle is preceded by a mouse-click event on that turtle.
ru: Примечание. Каждой последовательности событий перемещения мыши на черепахе предшествует событие щелчка мыши на этой черепахе.
uk: Примітка: кожній послідовності подій переміщення миші на черепахі передує подія клацання миші на цій черепашці.

source: Subsequently, clicking and dragging the Turtle will move it across the screen thereby producing handdrawings (if pen is down).
ru: Впоследствии, щелкнув и перетащив Черепаху, она будет перемещаться по экрану, создавая тем самым рисунки от руки (если перо опущено).
uk: Згодом, клацання та перетягування Черепахи переміщуватиме її по екрану, таким чином створюючи малюнки (якщо ручка опущена).

source: Start recording the vertices of a polygon. Current turtle position is first vertex of polygon.
ru: Начните записывать вершины многоугольника. Текущая позиция черепахи — это первая вершина многоугольника.
uk: Почніть записувати вершини багатокутника. Поточна позиція черепахи є першою вершиною багатокутника.

source: Stop recording the vertices of a polygon. Current turtle position is last vertex of polygon. This will be connected with the first vertex.
ru: Прекратите запись вершин многоугольника. Текущая позиция черепахи — последняя вершина многоугольника. Это будет связано с первой вершиной.
uk: Припинення запису вершин багатокутника. Поточна позиція черепахи є останньою вершиною багатокутника. Це буде пов'язано з першою вершиною.

source: Return the last recorded polygon.
ru: Вернуть последний записанный полигон.
uk: Повернути останній записаний багатокутник.

source: Create and return a clone of the turtle with same position, heading and turtle properties.
ru: Создайте и верните клон черепахи с той же позицией, заголовком и свойствами черепахи.
uk: Створити та повернути клон черепахи з такими ж властивостями положення, заголовка та черепахи.

source: Return the Turtle object itself. Only reasonable use: as a function to return the "anonymous turtle":
ru: Верните сам объект Turtle. Единственное разумное использование: как функция, возвращающая «анонимную черепаху»:
uk: Поверніть сам об'єкт Черепаха. Лише розумне використання: як функція для повернення "анонімної черепахи":

source: Return the :class:`TurtleScreen` object the turtle is drawing on. TurtleScreen methods can then be called for that object.
ru: Верните объект :class:`TurtleScreen`, на котором рисует черепаха. Затем для этого объекта можно вызвать методы TurtleScreen.
uk: Повертає об’єкт :class:`TurtleScreen`, на якому малює черепаха. Тоді для цього об’єкта можна викликати методи TurtleScreen.

source: an integer or ``None``
ru: целое число или ``Нет``
uk: ціле число або ``Жодного``

source: Set or disable undobuffer. If *size* is an integer, an empty undobuffer of given size is installed. *size* gives the maximum number of turtle actions that can be undone by the :func:`undo` method/function. If *size* is ``None``, the undobuffer is disabled.
ru: Установите или отключите отмену буфера. Если *size* является целым числом, устанавливается пустой unobuffer заданного размера. *size* дает максимальное количество действий черепахи, которые можно отменить с помощью метода/функции :func:`undo`. Если *size* имеет значение ``None``, отмена буфера отключена.
uk: Встановити або вимкнути undobuffer. Якщо *size* є цілим числом, встановлюється порожній undobuffer заданого розміру. *size* визначає максимальну кількість дій черепахи, які можна скасувати за допомогою методу/функції :func:`undo`. Якщо *size* має значення ``None``, undobuffer вимкнено.

source: Return number of entries in the undobuffer.
ru: Возвращает количество записей в отменяющем буфере.
uk: Повертає кількість записів у undobuffer.

source: Compound shapes
ru: Сложные формы
uk: Складені форми

source: To use compound turtle shapes, which consist of several polygons of different color, you must use the helper class :class:`Shape` explicitly as described below:
ru: Чтобы использовать составные формы черепах, состоящие из нескольких многоугольников разного цвета, вы должны явно использовать вспомогательный класс :class:`Shape`, как описано ниже:
uk: Щоб використовувати складені форми черепахи, які складаються з кількох багатокутників різного кольору, ви повинні використовувати допоміжний клас :class:`Shape` явно, як описано нижче:

source: Create an empty Shape object of type "compound".
ru: Создайте пустой объект Shape типа «составной».
uk: Створіть порожній об'єкт Shape типу "compound".

source: Add as many components to this object as desired, using the :meth:`~Shape.addcomponent` method.
ru: Добавьте к этому объекту столько компонентов, сколько хотите, используя метод :meth:`~Shape.addcomComponent`.

source: For example:
ru: Например:
uk: Наприклад:

source: Now add the Shape to the Screen's shapelist and use it:
ru: Теперь добавьте фигуру в список форм экрана и используйте ее:
uk: Тепер додайте форму до списку форм екрана та використовуйте її:

source: The :class:`Shape` class is used internally by the :func:`register_shape` method in different ways. The application programmer has to deal with the Shape class *only* when using compound shapes like shown above!
ru: Класс :class:`Shape` используется внутри метода :func:`register_shape` по-разному. Программисту приложения приходится иметь дело с классом Shape *только* при использовании составных фигур, как показано выше!
uk: Клас :class:`Shape` використовується внутрішньо методом :func:`register_shape` різними способами. Програміст прикладної програми має працювати з класом Shape *тільки* під час використання складених фігур, як показано вище!

source: Methods of TurtleScreen/Screen and corresponding functions
ru: Методы TurtleScreen/Screen и соответствующие функции
uk: Методи TurtleScreen/Screen та відповідні функції

source: Most of the examples in this section refer to a TurtleScreen instance called ``screen``.
ru: Большинство примеров в этом разделе относятся к экземпляру TurtleScreen под названием screen.
uk: Більшість прикладів у цьому розділі стосуються екземпляра TurtleScreen під назвою ``screen``.

source: a color string or three numbers in the range 0..colormode or a 3-tuple of such numbers
ru: цветовая строка или три числа в диапазоне 0..colormode или кортеж из трех таких чисел
uk: кольоровий рядок або три числа в діапазоні 0..colormode або 3-кортеж таких чисел

source: Set or return background color of the TurtleScreen.
ru: Установить или вернуть цвет фона TurtleScreen.
uk: Встановити або повернути фоновий колір TurtleScreen.

source: a string, name of a gif-file or ``"nopic"``, or ``None``
ru: строка, имя gif-файла или ``"nopic"``, или ``None``
uk: рядок, назва gif-файлу або ``"nopic"``, або ``None``

source: Set background image or return name of current backgroundimage. If *picname* is a filename, set the corresponding image as background. If *picname* is ``"nopic"``, delete background image, if present. If *picname* is ``None``, return the filename of the current backgroundimage. ::
ru: Установите фоновое изображение или верните имя текущего фонового изображения. Если *picname* — это имя файла, установите соответствующее изображение в качестве фона. Если *picname* — ``"nopic"``, удалите фоновое изображение, если оно есть. Если *picname* имеет значение ``None``, верните имя файла текущего фонового изображения. ::
uk: Установити фонове зображення або повернути назву поточного фонового зображення. Якщо *picname* є назвою файлу, встановіть відповідне зображення як фонове зображення. Якщо *picname* має значення ``"nopic"``, видаліть фонове зображення, якщо воно є. Якщо *picname* має значення ``None``, повертає назву файлу поточного фонового зображення. ::

source: This TurtleScreen method is available as a global function only under the name ``clearscreen``. The global function ``clear`` is a different one derived from the Turtle method ``clear``.
ru: Этот метод TurtleScreen доступен как глобальная функция только под именем Clearscreen. Глобальная функция «clear» отличается от метода «clear» Черепахи.
uk: Цей метод TurtleScreen доступний як глобальна функція лише під назвою ``clearscreen``. Глобальна функція ``clear`` є іншою, похідною від методу Turtle ``clear``.

source: Delete all drawings and all turtles from the TurtleScreen. Reset the now empty TurtleScreen to its initial state: white background, no background image, no event bindings and tracing on.
ru: Удалите все рисунки и всех черепах с TurtleScreen. Сбросьте теперь пустой TurtleScreen в исходное состояние: белый фон, без фонового изображения, без привязок событий и включенной трассировки.
uk: Видаліть усі малюнки та всіх черепах із TurtleScreen. Скиньте тепер порожній TurtleScreen до початкового стану: білий фон, без фонового зображення, без прив’язок подій і трасування.

source: This TurtleScreen method is available as a global function only under the name ``resetscreen``. The global function ``reset`` is another one derived from the Turtle method ``reset``.
ru: Этот метод TurtleScreen доступен как глобальная функция только под именем ``resetscreen``. Глобальная функция ``reset`` — это еще одна производная от метода Turtle ``reset``.
uk: Цей метод TurtleScreen доступний як глобальна функція лише під назвою ``resetscreen``. Глобальна функція ``reset`` є ще однією похідною від методу Turtle ``reset``.

source: Reset all Turtles on the Screen to their initial state.
ru: Верните все черепахи на экране в исходное состояние.
uk: Скинути всіх Черепашок на екрані до початкового стану.

source: positive integer, new width of canvas in pixels
ru: положительное целое число, новая ширина холста в пикселях
uk: додатне ціле число, нова ширина полотна в пікселях

source: positive integer, new height of canvas in pixels
ru: положительное целое число, новая высота холста в пикселях
uk: натуральне число, нова висота полотна в пікселях

source: colorstring or color-tuple, new background color
ru: colorstring или color-tuple, новый цвет фона
uk: рядок кольорів або кортеж кольорів, новий колір тла

source: If no arguments are given, return current (canvaswidth, canvasheight). Else resize the canvas the turtles are drawing on. Do not alter the drawing window. To observe hidden parts of the canvas, use the scrollbars. With this method, one can make visible those parts of a drawing which were outside the canvas before.
ru: Если аргументы не указаны, верните текущий (ширина холста, высота холста). В противном случае измените размер холста, на котором рисуют черепахи. Не изменяйте окно рисования. Чтобы наблюдать за скрытыми частями холста, используйте полосы прокрутки. С помощью этого метода можно сделать видимыми те части рисунка, которые раньше находились за пределами холста.
uk: Якщо аргументи не вказано, повертає поточний (ширина полотна, висота полотна). Інакше змініть розмір полотна, на якому малюють черепахи. Не змінюйте вікно малювання. Щоб спостерігати за прихованими частинами полотна, використовуйте смуги прокрутки. За допомогою цього методу можна зробити видимими ті частини малюнка, які раніше були за межами полотна.

source: e.g. to search for an erroneously escaped turtle ;-)
ru: например, для поиска ошибочно сбежавшей черепахи ;-)
uk: напр. шукати черепаху, яка помилково втекла ;-)

source: a number, x-coordinate of lower left corner of canvas
ru: число, координата x нижнего левого угла холста
uk: число, х-координата нижнього лівого кута полотна

source: a number, y-coordinate of lower left corner of canvas
ru: число, координата y нижнего левого угла холста
uk: число, y-координата нижнього лівого кута полотна

source: a number, x-coordinate of upper right corner of canvas
ru: число, координата x верхнего правого угла холста
uk: число, х-координата верхнього правого кута полотна

source: a number, y-coordinate of upper right corner of canvas
ru: число, координата y верхнего правого угла холста
uk: число, y-координата верхнього правого кута полотна
