Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/turtle.po
Languages: ru, uk

source: The :class:`Turtle` methods :func:`shearfactor`, :func:`shapetransform` and :func:`get_shapepoly` have been added. Thus the full range of regular linear transforms is now available for transforming turtle shapes. :func:`tiltangle` has been enhanced in functionality: it now can be used to get or set the tilt angle.
ru: Были добавлены методы :class:`Turtle` :func:`shearfactor`, :func:`shapetransform` и :func:`get_shapepoly`. Таким образом, теперь доступен полный набор обычных линейных преобразований для преобразования форм черепах. Функциональность :func:`tiltangle` была расширена: теперь ее можно использовать для получения или установки угла наклона.

source: The :class:`Screen` method :func:`onkeypress` has been added as a complement to :func:`onkey`. As the latter binds actions to the key release event, an alias: :func:`onkeyrelease` was also added for it.
ru: Метод :class:`Screen` :func:`onkeypress` был добавлен как дополнение к :func:`onkey`. Поскольку последний связывает действия с событием выпуска ключа, для него также был добавлен псевдоним: :func:`onkeyrelease`.

source: The method :func:`Screen.mainloop <mainloop>` has been added, so there is no longer a need to use the standalone :func:`mainloop` function when working with :class:`Screen` and :class:`Turtle` objects.
ru: Добавлен метод :func:`Screen.mainloop <mainloop>`, поэтому больше нет необходимости использовать автономную функцию :func:`mainloop` при работе с :class:`Screen` и :class:`Turtle `объекты.

source: Two input methods have been added: :func:`Screen.textinput <textinput>` and :func:`Screen.numinput <numinput>`. These pop up input dialogs and return strings and numbers respectively.
ru: Добавлены два метода ввода: :func:`Screen.textinput <textinput>` и :func:`Screen.numinput <numinput>`. Они вызывают всплывающие диалоговые окна ввода и возвращают строки и числа соответственно.

source: Two example scripts :file:`tdemo_nim.py` and :file:`tdemo_round_dance.py` have been added to the :file:`Lib/turtledemo` directory.
ru: Два примера скриптов :file:`tdemo_nim.py` и :file:`tdemo_round_dance.py` были добавлены в каталог :file:`Lib/turtledemo`.
uk: Два приклади сценаріїв :file:`tdemo_nim.py` і :file:`tdemo_round_dance.py` додано до каталогу :file:`Lib/turtledemo`.

source: :func:`window_height`
uk: :func:`висота_вікна`

source: :func:`window_width`
uk: :func:`ширина_вікна`

source: an integer >= 1 (if given)
uk: ціле число >= 1 (якщо задано)

source: "fastest": 0
uk: "найшвидший": 0

source: "fast": 10
uk: "швидко": 10

source: "normal": 6
uk: "нормальний": 6

source: "slow": 3
uk: "повільно": 3

source: "slowest": 1
uk: "найповільніший": 1

source: "shown": True/False
uk: "показано": Правда/Невірно

source: "pendown": True/False
uk: "pendown": Правда/Невірно

source: "resizemode": "auto" or "user" or "noresize"
uk: "resizemode": "auto" або "user" або "noresize"

source: ``pencolor(colorstring)``
uk: pencolor(кольоровий рядок).

source: ``pencolor(r, g, b)``
uk: ``колір пера(r, g, b)``

source: ``color()``
uk: ``колір()``

source: Rotate the turtleshape to point in the direction specified by *angle*, regardless of its current tilt-angle. *Do not* change the turtle's heading (direction of movement).
uk: Обертайте фігуру черепахи, щоб вона вказувала в напрямку, визначеному *кутом*, незалежно від її поточного кута нахилу. *Не* змінюйте курс (напрямок руху) черепахи.

source: a number >= 0
uk: число >= 0

source: "standard"
uk: "стандарт"

source: *type_*
uk: *тип_*

source: chaos
uk: хаос

source: forest
uk: ліс

source: fractalcurves
uk: фрактальні криві

source: lindenmayer
uk: лінденмайер

source: L-System
uk: L-система

source: nim
uk: нім

source: paint
uk: фарба

source: penrose
uk: Пенроуз

source: planet_and_moon
uk: планета_і_місяць

source: round_dance
uk: хоровод

source: two_canvases
uk: два_полотна

source: yinyang
uk: Інь Янь
