Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/turtle.po
Languages: ru, uk

source: Draw a circle with given *radius*. The center is *radius* units left of the turtle; *extent* -- an angle -- determines which part of the circle is drawn. If *extent* is not given, draw the entire circle. If *extent* is not a full circle, one endpoint of the arc is the current pen position. Draw the arc in counterclockwise direction if *radius* is positive, otherwise in clockwise direction. Finally the direction of the turtle is changed by the amount of *extent*.
ru: Нарисуйте круг заданного *радиуса*. Центр находится в *радиусе* единицах слева от черепахи; *экстент* — угол — определяет, какая часть круга будет нарисована. Если *экстент* не указан, нарисуйте весь круг. Если *экстент* не является полным кругом, одной конечной точкой дуги является текущее положение пера. Нарисуйте дугу против часовой стрелки, если *радиус* положителен, в противном случае — по часовой стрелке. Наконец, направление черепахи меняется на величину *экстента*.
uk: Накресліть коло із заданим *радіусом*. Центр — *радіус* одиниць ліворуч від черепахи; *протяжність* -- кут -- визначає, яка частина кола буде намальована. Якщо *протяжність* не вказано, намалюйте все коло. Якщо *протяжність* не є повним колом, одна кінцева точка дуги є поточною позицією пера. Намалюйте дугу проти годинникової стрілки, якщо *радіус* додатний, інакше – за годинниковою стрілкою. Нарешті, напрямок черепахи змінюється на величину *протяжності*.

source: As the circle is approximated by an inscribed regular polygon, *steps* determines the number of steps to use. If not given, it will be calculated automatically. May be used to draw regular polygons.
ru: Поскольку окружность аппроксимируется вписанным правильным многоугольником, *steps* определяет количество используемых шагов. Если значение не указано, оно будет рассчитано автоматически. Может использоваться для рисования правильных многоугольников.
uk: Оскільки коло апроксимується вписаним правильним багатокутником, *кроки* визначають кількість кроків для використання. Якщо не вказано, воно буде розраховано автоматично. Можна використовувати для малювання правильних багатокутників.

source: a colorstring or a numeric color tuple
ru: цветовая строка или числовой кортеж цвета
uk: рядок кольорів або числовий кортеж кольорів

source: Draw a circular dot with diameter *size*, using *color*. If *size* is not given, the maximum of pensize+4 and 2*pensize is used.
ru: Нарисуйте круглую точку диаметром *size*, используя *color*. Если *size* не указано, используется максимум pensize+4 и 2*pensize.
uk: Намалюйте круглу точку діаметром *розмір*, використовуючи *колір*. Якщо *size* не вказано, використовується максимальний розмір pensize+4 і 2*pensize.

source: Stamp a copy of the turtle shape onto the canvas at the current turtle position. Return a stamp_id for that stamp, which can be used to delete it by calling ``clearstamp(stamp_id)``.
ru: Отпечатайте копию формы черепахи на холсте в текущем положении черепахи. Возвращает Stamp_id для этого штампа, который можно использовать для его удаления, вызвав ``clearstamp(stamp_id)``.
uk: Виштампуйте копію фігури черепахи на полотні в поточній позиції черепахи. Повертає stamp_id для цього штампа, який можна використати для його видалення, викликавши ``clearstamp(stamp_id)``.

source: an integer, must be return value of previous :func:`stamp` call
ru: целое число, должно быть возвращаемым значением предыдущего вызова :func:`stamp`
uk: ціле число, має бути значенням, що повертається попереднім викликом :func:`stamp`

source: Delete stamp with given *stampid*.
ru: Удалить штамп с заданным *stampid*.
uk: Видалити штамп із заданим *stampid*.

source: Delete all or first/last *n* of turtle's stamps. If *n* is ``None``, delete all stamps, if *n* > 0 delete first *n* stamps, else if *n* < 0 delete last *n* stamps.
ru: Удалите все или первые/последние *n* штампов черепахи. Если *n* равно ``None``, удалите все штампы, если *n* > 0, удалите первые *n* штампы, иначе, если *n* < 0, удалите последние *n* штампы.
uk: Видалити всі або перші/останні *n* штампів черепахи. Якщо *n* має значення ``None``, видаліть усі позначки, якщо *n* > 0 видаліть перші *n* позначок, інакше, якщо *n* < 0, видаліть останні *n* позначок.

source: Undo (repeatedly) the last turtle action(s). Number of available undo actions is determined by the size of the undobuffer.
ru: Отменить (неоднократно) последнее действие(я) черепахи. Количество доступных действий отмены определяется размером отмены буфера.
uk: Скасувати (кілька разів) останні дії черепахи. Кількість доступних дій скасування визначається розміром буфера скасування.

source: an integer in the range 0..10 or a speedstring (see below)
ru: целое число в диапазоне 0..10 или строка скорости (см. ниже)
uk: ціле число в діапазоні 0..10 або швидкісний рядок (див. нижче)

source: Set the turtle's speed to an integer value in the range 0..10. If no argument is given, return current speed.
ru: Установите скорость черепахи на целое значение в диапазоне 0..10. Если аргумент не указан, возвращает текущую скорость.
uk: Встановіть швидкість черепахи на ціле число в діапазоні 0..10. Якщо аргумент не вказано, повертає поточну швидкість.

source: If input is a number greater than 10 or smaller than 0.5, speed is set to 0. Speedstrings are mapped to speedvalues as follows:
ru: Если входное число больше 10 или меньше 0,5, скорость устанавливается на 0. Строки скорости сопоставляются со значениями скорости следующим образом:
uk: Якщо введення є числом, більшим за 10 або меншим за 0,5, швидкість встановлюється на 0. Рядки швидкості зіставляються зі значеннями швидкості таким чином:

source: Speeds from 1 to 10 enforce increasingly faster animation of line drawing and turtle turning.
ru: Скорость от 1 до 10 обеспечивает более быструю анимацию рисования линий и поворота черепахи.
uk: Швидкості від 1 до 10 забезпечують дедалі швидшу анімацію малювання ліній і обертання черепахи.

source: Attention: *speed* = 0 means that *no* animation takes place. forward/back makes turtle jump and likewise left/right make the turtle turn instantly.
ru: Внимание: *speed* = 0 означает, что анимация *нет*. вперед/назад заставляет черепаху прыгать, а влево/вправо черепаха мгновенно поворачивается.
uk: Увага: *швидкість* = 0 означає, що *немає* анімації. вперед/назад змушує черепаху стрибати, а ліворуч/праворуч змушує черепаху миттєво повертатися.

source: Return the turtle's current location (x,y) (as a :class:`Vec2D` vector).
ru: Возвращает текущее местоположение черепахи (x,y) (в виде вектора :class:`Vec2D`).
uk: Повертає поточне розташування черепахи (x,y) (як вектор :class:`Vec2D`).

source: a number or a pair/vector of numbers or a turtle instance
ru: число или пара/вектор чисел или экземпляр черепахи
uk: число або пара/вектор чисел або екземпляр черепахи

source: a number if *x* is a number, else ``None``
ru: число, если *x* — число, иначе ``None``
uk: число, якщо *x* є числом, інакше ``None``

source: Return the angle between the line from turtle position to position specified by (x,y), the vector or the other turtle. This depends on the turtle's start orientation which depends on the mode - "standard"/"world" or "logo".
ru: Возвращает угол между линией от положения черепахи до положения, заданного (x,y), вектором или другой черепахой. Это зависит от стартовой ориентации черепахи, которая зависит от режима - "стандартный"/"мир" или "логотип".
uk: Повертає кут між лінією від положення черепахи до положення, визначеного (x,y), вектором або іншою черепахою. Це залежить від початкової орієнтації черепахи, яка залежить від режиму - "стандартний"/"світ" або "логотип".

source: Return the turtle's x coordinate.
ru: Возвращает координату x черепахи.
uk: Поверніть координату x черепахи.

source: Return the turtle's y coordinate.
ru: Возвращает координату y черепахи.
uk: Поверніть координату y черепахи.

source: Return the turtle's current heading (value depends on the turtle mode, see :func:`mode`).
ru: Возвращает текущий курс черепахи (значение зависит от режима черепахи, см. :func:`mode`).
uk: Повертає поточний заголовок черепахи (значення залежить від режиму черепахи, див. :func:`mode`).

source: Return the distance from the turtle to (x,y), the given vector, or the given other turtle, in turtle step units.
ru: Возвращает расстояние от черепахи до (x,y), данного вектора или другой черепахи в единицах шага черепахи.
uk: Повертає відстань від черепахи до (x,y), даного вектора або даної іншої черепахи в одиницях кроку черепахи.

source: Settings for measurement
ru: Настройки для измерения
uk: Налаштування для вимірювання

source: Set angle measurement units, i.e. set number of "degrees" for a full circle. Default value is 360 degrees.
ru: Установите единицы измерения угла "degrees", т.е. установите количество «градусов» для полного круга. Значение по умолчанию — 360 градусов.
uk: Встановіть одиниці вимірювання кута, тобто встановіть кількість "градусів" для повного кола. Значення за замовчуванням – 360 градусів.

source: Set the angle measurement units to radians. Equivalent to ``degrees(2*math.pi)``.
ru: Установите единицы измерения угла в радианы. Эквивалентно ``градусам(2*math.pi)``.
uk: Установіть одиниці вимірювання кута в радіанах. Еквівалент ``градусів(2*math.pi)``.

source: Pull the pen down -- drawing when moving.
ru: Установите единицы измерения угла в радианы. Эквивалентно ``градусам(2*math.pi)``.
uk: Потягніть ручку вниз -- малюйте під час руху.

source: Pull the pen up -- no drawing when moving.
ru: Потяните ручку вверх — при движении рисунок не рисуется.
uk: Потягніть ручку вгору - під час руху не буде малюнка.

source: a positive number
ru: положительное число
uk: позитивне число

source: Set the line thickness to *width* or return it. If resizemode is set to "auto" and turtleshape is a polygon, that polygon is drawn with the same line thickness. If no argument is given, the current pensize is returned.
ru: Установите для толщины линии значение *width* или верните его. Если для режима изменения размера установлено значение «авто», а форма черепахи представляет собой многоугольник, этот многоугольник рисуется с одинаковой толщиной линий. Если аргумент не указан, возвращается текущий размер ручки.
uk: Встановіть товщину лінії на *width* або поверніть її. Якщо для параметра resizemode встановлено значення "auto" і turtleshape є багатокутником, цей багатокутник малюється з тією самою товщиною лінії. Якщо аргумент не задано, повертається поточний розмір пенсії.

source: a dictionary with some or all of the below listed keys
ru: словарь с некоторыми или всеми из перечисленных ниже ключей
uk: словник з деякими або всіма перерахованими нижче ключами

source: one or more keyword-arguments with the below listed keys as keywords
ru: один или несколько ключевых аргументов с указанными ниже ключами в качестве ключевых слов
uk: один або більше ключових аргументів із зазначеними нижче ключами як ключовими словами

source: Return or set the pen's attributes in a "pen-dictionary" with the following key/value pairs:
ru: Верните или установите атрибуты пера в «словаре пера» со следующими парами ключ/значение:
uk: Повертайте або встановлюйте атрибути пера в "словнику пера" з такими парами ключ/значення:

source: "pencolor": color-string or color-tuple
ru: "pencolor": строка цвета или кортеж цвета
uk: "pencolor": кольоровий рядок або колірний кортеж

source: "fillcolor": color-string or color-tuple
ru: «fillcolor»: строка цвета или кортеж цвета.
uk: "fillcolor": кольоровий рядок або колірний кортеж

source: "pensize": positive number
ru: "pensize": положительное число
uk: "pensize": позитивне число

source: "speed": number in range 0..10
ru: «speed»: число в диапазоне 0..10
uk: "швидкість": число в діапазоні 0..10

source: "stretchfactor": (positive number, positive number)
ru: «stretchfactor»: (положительное число, положительное число)
uk: "stretchfactor": (додатне число, додатне число)

source: "outline": positive number
ru: «outline»: положительное число
uk: "контур": позитивне число

source: "tilt": number
ru: «tilt»: число
uk: "нахил": число

source: This dictionary can be used as argument for a subsequent call to :func:`pen` to restore the former pen-state. Moreover one or more of these attributes can be provided as keyword-arguments. This can be used to set several pen attributes in one statement.
ru: восстановления
uk: Цей словник можна використовувати як аргумент для наступного виклику :func:`pen` для відновлення попереднього стану пера. Крім того, один або декілька з цих атрибутів можна надати як ключові аргументи. Це можна використовувати для встановлення кількох атрибутів пера в одному операторі.

source: Return ``True`` if pen is down, ``False`` if it's up.
ru: Верните True, если перо опущено, и False, если оно поднято.
uk: Повертає ``True``, якщо ручка опущена, ``False``, якщо вона піднята.

source: Return or set the pencolor.
ru: Верните или установите цвет пера.
uk: Повернути або встановити колір пера.

source: Four input formats are allowed:
ru: Допускаются четыре формата ввода:
uk: Дозволено чотири формати введення:

source: Return the current pencolor as color specification string or as a tuple (see example). May be used as input to another color/pencolor/fillcolor call.
ru: Возвращает текущий цвет пера в виде строки спецификации цвета или кортежа (см. пример). Может использоваться в качестве входных данных для другого вызова цвета/цвета пера/цвета заливки.
uk: Повертає поточний колір пера як рядок специфікації кольору або як кортеж (див. приклад). Може використовуватися як вхідні дані для іншого виклику color/pencolor/fillcolor.

source: Set pencolor to *colorstring*, which is a Tk color specification string, such as ``"red"``, ``"yellow"``, or ``"#33cc8c"``.
ru: Установите для цвета пера значение *colorstring*, которое представляет собой строку спецификации цвета Tk, например ``"red"``, ``"yellow"`` или ``"#33cc8c"``.
uk: Встановіть колір пера на *colorstring*, який є рядком специфікації кольору Tk, наприклад ``"red"``, ``"yellow"`` або ``"#33cc8c"``.

source: Set pencolor to the RGB color represented by the tuple of *r*, *g*, and *b*. Each of *r*, *g*, and *b* must be in the range 0..colormode, where colormode is either 1.0 or 255 (see :func:`colormode`).
ru: Установите цвет пера в цвет RGB, представленный кортежем *r*, *g* и *b*. Каждый из *r*, *g* и *b* должен находиться в диапазоне 0..colormode, где цветовой режим равен 1.0 или 255 (см. :func:`colormode`).
uk: Встановіть колір пера на колір RGB, представлений кортежем *r*, *g* і *b*. Кожне з *r*, *g* і *b* має бути в діапазоні 0..colormode, де colormode дорівнює 1,0 або 255 (див. :func:`colormode`).

source: Set pencolor to the RGB color represented by *r*, *g*, and *b*. Each of *r*, *g*, and *b* must be in the range 0..colormode.
ru: Установите для цвета пера цвет RGB, представленный *r*, *g* и *b*. Каждый из *r*, *g* и *b* должен находиться в диапазоне 0..colormode.
uk: Встановіть колір пера на колір RGB, представлений *r*, *g* і *b*. Кожне з *r*, *g* і *b* має бути в діапазоні 0..colormode.

source: If turtleshape is a polygon, the outline of that polygon is drawn with the newly set pencolor.
ru: Если черепаховая фигура представляет собой многоугольник, контур этого многоугольника рисуется вновь установленным цветом пера.
uk: Якщо turtleshape є багатокутником, контур цього багатокутника малюється щойно встановленим кольором пера.

source: Return or set the fillcolor.
ru: Верните или установите цвет заливки.
uk: Повернути або встановити колір заливки.

source: Return the current fillcolor as color specification string, possibly in tuple format (see example). May be used as input to another color/pencolor/fillcolor call.
ru: Возвращает текущий цвет заливки в виде строки спецификации цвета, возможно, в формате кортежа (см. пример). Может использоваться в качестве входных данных для другого вызова цвета/цвета пера/цвета заливки.
uk: Повертає поточний колір заливки як рядок специфікації кольору, можливо, у форматі кортежу (див. приклад). Може використовуватися як вхідні дані для іншого виклику color/pencolor/fillcolor.

source: Set fillcolor to *colorstring*, which is a Tk color specification string, such as ``"red"``, ``"yellow"``, or ``"#33cc8c"``.
ru: Установите для цвета fillcolor значение *colorstring*, которое представляет собой строку спецификации цвета Tk, например ``"red"``, ``"yellow"`` или ``"#33cc8c"``.
uk: Встановіть колір заливки на *colorstring*, який є рядком специфікації кольору Tk, наприклад ``"red"``, ``"yellow"`` або ``"#33cc8c"``.

source: Set fillcolor to the RGB color represented by the tuple of *r*, *g*, and *b*. Each of *r*, *g*, and *b* must be in the range 0..colormode, where colormode is either 1.0 or 255 (see :func:`colormode`).
ru: Установите для fillcolor цвет RGB, представленный кортежем *r*, *g* и *b*. Каждый из *r*, *g* и *b* должен находиться в диапазоне 0..colormode, где цветовой режим равен 1.0 или 255 (см. :func:`colormode`).
uk: Встановіть колір заливки на колір RGB, представлений кортежем *r*, *g* і *b*. Кожне з *r*, *g* і *b* має бути в діапазоні 0..colormode, де colormode дорівнює 1,0 або 255 (див. :func:`colormode`).

source: Set fillcolor to the RGB color represented by *r*, *g*, and *b*. Each of *r*, *g*, and *b* must be in the range 0..colormode.
ru: Установите для цвета заливки цвет RGB, представленный *r*, *g* и *b*. Каждый из *r*, *g* и *b* должен находиться в диапазоне 0..colormode.
uk: Встановіть колір заливки на колір RGB, представлений *r*, *g* і *b*. Кожне з *r*, *g* і *b* має бути в діапазоні 0..colormode.

source: If turtleshape is a polygon, the interior of that polygon is drawn with the newly set fillcolor.
ru: Если черепаха является многоугольником, внутренняя часть этого многоугольника рисуется с новым установленным цветом заливки.
uk: Якщо turtleshape є багатокутником, внутрішня частина цього багатокутника буде намальована новим кольором заливки.

source: Return or set pencolor and fillcolor.
ru: Возвращает или устанавливает цвет пера и цвет заливки.
uk: Повернути або встановити колір пера та колір заливки.

source: Several input formats are allowed. They use 0 to 3 arguments as follows:
ru: Допускаются несколько форматов ввода. Они используют от 0 до 3 аргументов следующим образом:
uk: Допускається кілька форматів введення. Вони використовують від 0 до 3 аргументів наступним чином:

source: Return the current pencolor and the current fillcolor as a pair of color specification strings or tuples as returned by :func:`pencolor` and :func:`fillcolor`.
ru: Возвращает текущий цвет пера и текущий цвет заливки в виде пары строк спецификации цвета или кортежей, возвращаемых :func:`pencolor` и :func:`fillcolor`.
uk: Повертає поточний колір пера та поточний колір заливки як пару рядків специфікації кольору або кортежів, які повертає :func:`pencolor` і :func:`fillcolor`.

source: Inputs as in :func:`pencolor`, set both, fillcolor and pencolor, to the given value.
ru: Входные данные, как в :func:`pencolor`, устанавливают заданное значение для цвета заливки и цвета пера.
uk: Вхідні дані, як у :func:`pencolor`, встановіть для обох, заливки та кольору пера, вказане значення.

source: Equivalent to ``pencolor(colorstring1)`` and ``fillcolor(colorstring2)`` and analogously if the other input format is used.
ru: Эквивалентно ``pencolor(colorstring1)`` и ``fillcolor(colorstring2)`` и аналогично, если используется другой формат ввода.
uk: Еквівалент ``pencolor(colorstring1)`` і ``fillcolor(colorstring2)`` і аналогічно, якщо використовується інший формат введення.

source: If turtleshape is a polygon, outline and interior of that polygon is drawn with the newly set colors.
ru: Если черепаховая фигура представляет собой многоугольник, контур и внутренняя часть этого многоугольника рисуются с использованием недавно установленных цветов.
uk: Якщо turtleshape є багатокутником, контур і внутрішня частина цього багатокутника малюються новими кольорами.

source: See also: Screen method :func:`colormode`.
ru: См. также: Метод экрана :func:`colormode`.
uk: Дивіться також: Екранний метод :func:`colormode`.

source: Return fillstate (``True`` if filling, ``False`` else).
ru: Возвращает состояние заполнения («True», если заполнение, и «False», иначе).
uk: Повернути fillstate (``True``, якщо заповнення, ``False`` інакше).

source: To be called just before drawing a shape to be filled.
ru: Вызывается непосредственно перед рисованием фигуры, которую нужно заполнить.
uk: Викликається безпосередньо перед малюванням форми, яку потрібно заповнити.

source: Fill the shape drawn after the last call to :func:`begin_fill`.
ru: Заполните фигуру, нарисованную после последнего вызова :func:`begin_fill`.
uk: Заповніть форму, намальовану після останнього виклику :func:`begin_fill`.

source: Whether or not overlap regions for self-intersecting polygons or multiple shapes are filled depends on the operating system graphics, type of overlap, and number of overlaps. For example, the Turtle star above may be either all yellow or have some white regions.
ru: Заполнение областей перекрытия для самопересекающихся многоугольников или нескольких фигур зависит от графики операционной системы, типа перекрытия и количества перекрытий. Например, звезда Черепахи выше может быть либо полностью желтой, либо иметь некоторые белые области.
uk: Чи заповнюються області перекриття для багатокутників, що перетинаються між собою, або кількох фігур, залежить від графіки операційної системи, типу перекриття та кількості перекривань. Наприклад, зірка Черепахи вище може бути або повністю жовтою, або мати деякі білі області.

source: Delete the turtle's drawings from the screen, re-center the turtle and set variables to the default values.
ru: Удалите рисунки черепахи с экрана, переместите черепаху по центру и установите для переменных значения по умолчанию.
uk: Видаліть малюнки черепахи з екрана, знову відцентруйте черепаху та встановіть для змінних значення за замовчуванням.

source: Delete the turtle's drawings from the screen. Do not move turtle. State and position of the turtle as well as drawings of other turtles are not affected.
ru: Удалите рисунки черепахи с экрана. Не перемещайте черепаху. Состояние и положение черепахи, а также рисунки других черепах не изменяются.
uk: Видаліть малюнки черепахи з екрана. Не рухай черепаху. Стан і положення черепахи, а також малюнки інших черепах не впливають.

source: object to be written to the TurtleScreen
ru: объект для записи в TurtleScreen
uk: об’єкт для запису на TurtleScreen

source: True/False
ru: Истина/Ложь
uk: Правда/Неправда

source: one of the strings "left", "center" or right"
ru: одна из строк «левая», «центральная» или правая»
uk: один із рядків "зліва", "по центру" або справа"

source: a triple (fontname, fontsize, fonttype)
ru: тройка (имя шрифта, размер шрифта, тип шрифта)
uk: трійка (назва шрифту, розмір шрифту, тип шрифту)

source: Write text - the string representation of *arg* - at the current turtle position according to *align* ("left", "center" or "right") and with the given font. If *move* is true, the pen is moved to the bottom-right corner of the text. By default, *move* is ``False``.
ru: Запишите текст — строковое представление *arg* — в текущей позиции черепахи в соответствии с *align* («left», «center» или «right») и заданным шрифтом. Если *move* имеет значение true, перо перемещается в правый нижний угол текста. По умолчанию *move* имеет значение «False».
uk: Напишіть текст - рядкове представлення *arg* - у поточній позиції черепашки відповідно до *align* ("left", "center" або "right") і з указаним шрифтом. Якщо *move* має значення true, перо переміщується в нижній правий кут тексту. За замовчуванням *move* має значення ``False``.
