Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/turtle.po
Languages: ru, uk

source: Set up user-defined coordinate system and switch to mode "world" if necessary. This performs a ``screen.reset()``. If mode "world" is already active, all drawings are redrawn according to the new coordinates.
ru: Настройте пользовательскую систему координат и при необходимости переключитесь в режим «мир». При этом выполняется ``screen.reset()``. Если режим «мир» уже активен, все рисунки перерисовываются по новым координатам.
uk: Налаштуйте визначену користувачем систему координат і за необхідності перейдіть у режим "світ". Це виконує ``screen.reset()``. Якщо режим "світ" вже активний, то всі малюнки перемальовуються відповідно до нових координат.

source: **ATTENTION**: in user-defined coordinate systems angles may appear distorted.
ru: **ВНИМАНИЕ**: в пользовательских системах координат углы могут быть искажены.
uk: **УВАГА**: у визначених користувачем системах координат кути можуть виглядати спотвореними.

source: positive integer
ru: положительный целое число
uk: натуральне число

source: Set or return the drawing *delay* in milliseconds. (This is approximately the time interval between two consecutive canvas updates.) The longer the drawing delay, the slower the animation.
ru: Установите или верните *задержку* рисунка в миллисекундах. (Это примерно временной интервал между двумя последовательными обновлениями холста.) Чем дольше задержка отрисовки, тем медленнее анимация.
uk: Встановити або повернути *затримку* малювання в мілісекундах. (Це приблизно інтервал часу між двома послідовними оновленнями полотна.) Що довша затримка малювання, то повільніша анімація.

source: Optional argument:
ru: Опциональный аргумент
uk: Необов'язковий аргумент:

source: nonnegative integer
ru: неотрицательное целое число
uk: ціле невід’ємне число

source: Turn turtle animation on/off and set delay for update drawings. If *n* is given, only each n-th regular screen update is really performed. (Can be used to accelerate the drawing of complex graphics.) When called without arguments, returns the currently stored value of n. Second argument sets delay value (see :func:`delay`).
ru: Включите/выключите анимацию черепахи и установите задержку для обновления рисунков. Если указано *n*, действительно выполняется только каждое n-е регулярное обновление экрана. (Может использоваться для ускорения рисования сложной графики.) При вызове без аргументов возвращает сохраненное в данный момент значение n. Второй аргумент устанавливает значение задержки (см. :func:`delay`).
uk: Увімкніть/вимкніть анімацію черепахи та встановіть затримку для оновлення малюнків. Якщо задано *n*, дійсно виконується лише кожне n-е регулярне оновлення екрана. (Можна використовувати для прискорення малювання складної графіки.) При виклику без аргументів повертає поточне збережене значення n. Другий аргумент встановлює значення затримки (див. :func:`delay`).

source: Perform a TurtleScreen update. To be used when tracer is turned off.
ru: Выполните обновление TurtleScreen. Используется, когда трассировщик выключен.
uk: Виконайте оновлення TurtleScreen. Використовується, коли трасувальник вимкнено.

source: See also the RawTurtle/Turtle method :func:`speed`.
ru: См. также метод RawTurtle/Turtle :func:`speed`.
uk: Дивіться також метод RawTurtle/Turtle :func:`speed`.

source: Set focus on TurtleScreen (in order to collect key-events). Dummy arguments are provided in order to be able to pass :func:`listen` to the onclick method.
ru: Установите фокус на TurtleScreen (чтобы собирать ключевые события). Фиктивные аргументы предоставляются для того, чтобы можно было передать :func:`listen` методу onclick.
uk: Встановити фокус на TurtleScreen (щоб збирати ключові події). Фіктивні аргументи надаються, щоб можна було передати :func:`listen` методу onclick.

source: a function with no arguments or ``None``
ru: функция без аргументов или ``None``
uk: функція без аргументів або ``None``

source: a string: key (e.g. "a") or key-symbol (e.g. "space")
ru: строка: ключ (например, «а») или символ ключа (например, «пробел»)
uk: рядок: клавіша (наприклад, "a") або клавіша-символ (наприклад, "пробіл")

source: Bind *fun* to key-release event of key. If *fun* is ``None``, event bindings are removed. Remark: in order to be able to register key-events, TurtleScreen must have the focus. (See method :func:`listen`.)
ru: Привяжите *fun* к событию отпускания ключа. Если *fun* имеет значение «Нет», привязки событий удаляются. Примечание: чтобы иметь возможность регистрировать ключевые события, TurtleScreen должен иметь фокус. (См. метод :func:`listen`.)
uk: Прив’яжіть *fun* до події звільнення ключа ключа. Якщо *fun* має значення ``None``, прив’язки подій видаляються. Примітка: щоб мати можливість реєструвати ключові події, TurtleScreen повинен мати фокус. (Див. метод :func:`listen`.)

source: Bind *fun* to key-press event of key if key is given, or to any key-press-event if no key is given. Remark: in order to be able to register key-events, TurtleScreen must have focus. (See method :func:`listen`.)
ru: Привяжите *fun* к событию нажатия клавиши, если клавиша задана, или к любому событию нажатия клавиши, если клавиша не задана. Примечание: чтобы иметь возможность регистрировать ключевые события, TurtleScreen должен иметь фокус. (См. метод :func:`listen`.)
uk: Прив’яжіть *fun* до події натискання клавіші key, якщо клавішу вказано, або до будь-якої події натискання клавіші, якщо клавіша не вказана. Примітка: щоб мати можливість реєструвати ключові події, TurtleScreen повинен мати фокус. (Див. метод :func:`listen`.)

source: Bind *fun* to mouse-click events on this screen. If *fun* is ``None``, existing bindings are removed.
ru: Привяжите *fun* к событиям щелчка мышью на этом экране. Если *fun* имеет значение «Нет», существующие привязки удаляются.
uk: Прив’яжіть *fun* до подій клацання миші на цьому екрані. Якщо *fun* має значення ``None``, існуючі прив’язки видаляються.

source: Example for a TurtleScreen instance named ``screen`` and a Turtle instance named ``turtle``:
ru: Пример для экземпляра TurtleScreen с именем «screen» и экземпляра Turtle с именем «turtle»:
uk: Приклад екземпляра TurtleScreen під назвою ``screen`` і примірника Turtle під назвою ``turtle``:

source: This TurtleScreen method is available as a global function only under the name ``onscreenclick``. The global function ``onclick`` is another one derived from the Turtle method ``onclick``.
ru: Этот метод TurtleScreen доступен как глобальная функция только под именем onscreenclick. Глобальная функция onclick — это еще одна производная от метода Turtle onclick.
uk: Цей метод TurtleScreen доступний як глобальна функція лише під назвою ``onscreenclick``. Глобальна функція ``onclick`` є ще однією похідною від методу Turtle ``onclick``.

source: a function with no arguments
ru: функция без аргументов
uk: функція без аргументів

source: Install a timer that calls *fun* after *t* milliseconds.
ru: Установите таймер, который вызывает *fun* через *t* миллисекунд.
uk: Встановіть таймер, який викликає *fun* через *t* мілісекунд.

source: Starts event loop - calling Tkinter's mainloop function. Must be the last statement in a turtle graphics program. Must *not* be used if a script is run from within IDLE in -n mode (No subprocess) - for interactive use of turtle graphics. ::
ru: Запускает цикл событий — вызывает функцию основного цикла Tkinter. Должен быть последним оператором в программе рисования черепах. *Не* используется, если сценарий запускается из IDLE в режиме -n (без подпроцесса) — для интерактивного использования черепашьей графики. ::
uk: Запускає цикл подій - виклик функції основного циклу Tkinter. Має бути останнім оператором у графічній програмі Turtle. Його *не* можна використовувати, якщо сценарій запускається з IDLE у режимі -n (без підпроцесу) — для інтерактивного використання черепахової графіки. ::

source: string
ru: строка
uk: рядок

source: Pop up a dialog window for input of a string. Parameter title is the title of the dialog window, prompt is a text mostly describing what information to input. Return the string input. If the dialog is canceled, return ``None``. ::
ru: Всплывающее диалоговое окно для ввода строки. Заголовок параметра — это заголовок диалогового окна, подсказка — это текст, в основном описывающий, какую информацию вводить. Верните строковый ввод. Если диалог отменен, верните ``None``. ::
uk: Відкрити діалогове вікно для введення рядка. Заголовок параметра — це заголовок діалогового вікна, підказка — це текст, який переважно описує, яку інформацію потрібно ввести. Повернути введений рядок. Якщо діалогове вікно скасовано, поверніть ``None``. ::

source: Pop up a dialog window for input of a number. title is the title of the dialog window, prompt is a text mostly describing what numerical information to input. default: default value, minval: minimum value for input, maxval: maximum value for input. The number input must be in the range minval .. maxval if these are given. If not, a hint is issued and the dialog remains open for correction. Return the number input. If the dialog is canceled, return ``None``. ::
ru: Всплывающее диалоговое окно для ввода числа. заголовок — это заголовок диалогового окна, подсказка — это текст, в основном описывающий, какую числовую информацию следует ввести. default: значение по умолчанию, minval: минимальное значение для ввода, maxval: максимальное значение для ввода. Введенное число должно находиться в диапазоне minval .. maxval, если они заданы. Если нет, выдается подсказка, и диалог остается открытым для исправления. Вернуть введенный номер. Если диалог отменен, верните ``None``. ::

source: one of the strings "standard", "logo" or "world"
ru: одна из строк «стандарт», «логотип» или «мир»
uk: один із рядків "standard", "logo" або "world"

source: Set turtle mode ("standard", "logo" or "world") and perform reset. If mode is not given, current mode is returned.
ru: Установите режим черепахи («стандартный», «логотип» или «мир») и выполните сброс. Если режим не указан, возвращается текущий режим.
uk: Встановіть режим черепахи ("стандартний", "логотип" або "світ") і виконайте скидання. Якщо режим не вказано, повертається поточний режим.

source: Mode "standard" is compatible with old :mod:`turtle`. Mode "logo" is compatible with most Logo turtle graphics. Mode "world" uses user-defined "world coordinates". **Attention**: in this mode angles appear distorted if ``x/y`` unit-ratio doesn't equal 1.
ru: Режим "стандартный" совместим со старым :mod:`turtle`. Режим «логотип» совместим с большинством изображений черепах с логотипами. Режим «мир» использует определяемые пользователем «мировые координаты». **Внимание**: в этом режиме углы искажаются, если единичное соотношение ``x/y`` не равно 1.
uk: Режим "стандартний" сумісний зі старим :mod:`turtle`. Режим "логотип" сумісний із більшістю зображень логотипів черепахи. Режим "світ" використовує визначені користувачем "світові координати". **Увага**: у цьому режимі кути виглядають спотвореними, якщо одиничне співвідношення ``x/y`` не дорівнює 1.

source: Mode
ru: Режим
uk: Режим

source: Initial turtle heading
ru: Начальный курс turtle
uk: Початковий курс черепахи

source: positive angles
ru: положительные углы
uk: позитивні кути

source: to the right (east)
ru: направо (восток)
uk: праворуч (схід)

source: counterclockwise
ru: против часовой стрелки
uk: проти годинникової стрілки

source: "logo"
ru: "логотип"
uk: "логотип"

source: upward (north)
ru: вверх (север)
uk: вгору (на північ)

source: clockwise
ru: по часовой стрелке
uk: за годинниковою стрілкою

source: one of the values 1.0 or 255
ru: одно из значений 1,0 или 255
uk: одне зі значень 1,0 або 255

source: Return the colormode or set it to 1.0 or 255. Subsequently *r*, *g*, *b* values of color triples have to be in the range 0..*cmode*.
ru: Верните цветовой режим или установите его на 1.0 или 255. Впоследствии значения *r*, *g*, *b* тройок цветов должны находиться в диапазоне 0..*cmode*.

source: Return the Canvas of this TurtleScreen. Useful for insiders who know what to do with a Tkinter Canvas.
ru: Верните холст этого TurtleScreen. Полезно для инсайдеров, которые знают, что делать с Tkinter Canvas.
uk: Поверніть Canvas цього TurtleScreen. Корисно для інсайдерів, які знають, що робити з Tkinter Canvas.

source: Return a list of names of all currently available turtle shapes.
ru: Вернуть список названий всех доступных на данный момент форм черепах.
uk: Повертає список імен усіх наявних на даний момент форм черепахи.

source: There are three different ways to call this function:
ru: Существует три разных способа вызова этой функции:
uk: Існує три різні способи виклику цієї функції:

source: *name* is the name of a gif-file and *shape* is ``None``: Install the corresponding image shape. ::
ru: *name* — это имя gif-файла, а *shape* — ``None``: установите соответствующую форму изображения. ::
uk: *name* — це ім’я gif-файлу, а *shape* — ``None``: установіть відповідну форму зображення. ::

source: Image shapes *do not* rotate when turning the turtle, so they do not display the heading of the turtle!
ru: Формы изображений *не* вращаются при повороте черепахи, поэтому на них не отображается заголовок черепахи!
uk: Фігури зображень *не* обертаються під час повороту черепахи, тому вони не відображають напрямок черепахи!

source: *name* is an arbitrary string and *shape* is a tuple of pairs of coordinates: Install the corresponding polygon shape.
ru: *name* — произвольная строка, а *shape* — кортеж пар координат: установите соответствующую форму многоугольника.
uk: *name* — це довільний рядок, а *shape* — кортеж пар координат: установіть відповідну форму багатокутника.

source: *name* is an arbitrary string and *shape* is a (compound) :class:`Shape` object: Install the corresponding compound shape.
ru: *name* — это произвольная строка, а *shape* — это (составной) объект :class:`Shape`: установите соответствующую составную фигуру.

source: Add a turtle shape to TurtleScreen's shapelist. Only thusly registered shapes can be used by issuing the command ``shape(shapename)``.
ru: Добавьте форму черепахи в список форм TurtleScreen. Только зарегистрированные таким образом фигуры можно использовать, введя команду ``shape(shapename)``.
uk: Додайте форму черепахи до списку форм TurtleScreen. Тільки таким чином зареєстровані форми можна використовувати за допомогою команди ``shape(shapename)``.

source: Return the list of turtles on the screen.
ru: Верните список черепах на экран.
uk: Поверніть список черепах на екран.

source: Return the height of the turtle window. ::
ru: Возвращает высоту окна-черепахи. ::
uk: Поверніть висоту вікна черепахи. ::

source: Return the width of the turtle window. ::
ru: Возвращает ширину окна-черепахи. ::
uk: Поверніть ширину вікна черепахи. ::

source: Methods specific to Screen, not inherited from TurtleScreen
ru: Методы, специфичные для Screen, не унаследованные от TurtleScreen
uk: Методи, специфічні для Screen, не успадковані від TurtleScreen

source: Shut the turtlegraphics window.
ru: Закройте окно черепаховой графики.
uk: Закрийте вікно turtlegraphics.

source: Bind ``bye()`` method to mouse clicks on the Screen.
ru: Привяжите метод ``bye()`` к щелчкам мыши на экране.
uk: Прив’яжіть метод ``bye()`` до клацань миші на екрані.

source: If the value "using_IDLE" in the configuration dictionary is ``False`` (default value), also enter mainloop. Remark: If IDLE with the ``-n`` switch (no subprocess) is used, this value should be set to ``True`` in :file:`turtle.cfg`. In this case IDLE's own mainloop is active also for the client script.
ru: Если значение «using_IDLE» в словаре конфигурации равно «False» (значение по умолчанию), также введите mainloop. Примечание. Если используется IDLE с ключом ``-n`` (без подпроцесса), это значение должно быть установлено в ``True`` в :file:`turtle.cfg`. В этом случае собственный основной цикл IDLE активен и для клиентского сценария.
uk: Якщо значення "using_IDLE" у словнику конфігурації має значення ``False`` (значення за замовчуванням), також введіть mainloop. Примітка: якщо використовується IDLE з перемикачем ``-n`` (без підпроцесу), це значення має бути встановлено на ``True`` у :file:`turtle.cfg`. У цьому випадку основний цикл IDLE також активний для клієнтського сценарію.

source: Set the size and position of the main window. Default values of arguments are stored in the configuration dictionary and can be changed via a :file:`turtle.cfg` file.
ru: Установите размер и положение главного окна. Значения аргументов по умолчанию хранятся в словаре конфигурации и могут быть изменены через файл :file:`turtle.cfg`.
uk: Встановіть розмір і положення головного вікна. Стандартні значення аргументів зберігаються у словнику конфігурації та можуть бути змінені за допомогою файлу :file:`turtle.cfg`.

source: if an integer, a size in pixels, if a float, a fraction of the screen; default is 50% of screen
ru: если целое число, размер в пикселях, если число с плавающей запятой, часть экрана; по умолчанию 50% экрана
uk: якщо ціле число, то розмір у пікселях, якщо число з плаваючою точкою, то частка екрана; за замовчуванням 50% екрана

source: if an integer, the height in pixels, if a float, a fraction of the screen; default is 75% of screen
ru: если целое число, высота в пикселях, если число с плавающей запятой, часть экрана; по умолчанию — 75% экрана
uk: якщо ціле число, то висота в пікселях, якщо число з плаваючою точкою, то частка екрана; за замовчуванням 75% екрана

source: if positive, starting position in pixels from the left edge of the screen, if negative from the right edge, if ``None``, center window horizontally
ru: если положительное значение, начальная позиция в пикселях от левого края экрана, если отрицательное от правого края, если «Нет», центрировать окно по горизонтали
uk: якщо позитивне, початкова позиція в пікселях від лівого краю екрана, якщо негативне від правого краю, якщо ``None``, центр вікна по горизонталі

source: if positive, starting position in pixels from the top edge of the screen, if negative from the bottom edge, if ``None``, center window vertically
ru: если положительное значение, начальная позиция в пикселях от верхнего края экрана, если отрицательное от нижнего края, если «Нет», центрировать окно по вертикали
uk: якщо додатне, початкова позиція в пікселях від верхнього краю екрана, якщо негативне від нижнього краю, якщо ``None``, центр вікна по вертикалі

source: a string that is shown in the titlebar of the turtle graphics window
ru: строка, которая отображается в заголовке графического окна черепахи
uk: рядок, який відображається в рядку заголовка графічного вікна Turtle

source: Set title of turtle window to *titlestring*.
ru: Установите для заголовка окна черепахи значение *titlestring*.
uk: Встановіть назву вікна Turtle на *titlestring*.

source: Public classes
ru: Публичные классы
uk: Публічні заняття

source: a :class:`!tkinter.Canvas`, a :class:`ScrolledCanvas` or a :class:`TurtleScreen`
ru: a :class:`!tkinter.Canvas`, a :class:`ScrolledCanvas` или :class:`TurtleScreen`

source: Create a turtle. The turtle has all methods described above as "methods of Turtle/RawTurtle".
ru: Создайте черепаху. Черепаха имеет все методы, описанные выше как «методы Turtle/RawTurtle».
uk: Створіть черепаху. Черепаха має всі методи, описані вище як "методи Turtle/RawTurtle".

source: Subclass of RawTurtle, has the same interface but draws on a default :class:`Screen` object created automatically when needed for the first time.
ru: Подкласс RawTurtle имеет тот же интерфейс, но использует объект :class:`Screen` по умолчанию, создаваемый автоматически при первой необходимости.
uk: Підклас RawTurtle має той самий інтерфейс, але використовує стандартний об’єкт :class:`Screen`, створений автоматично, коли це потрібно вперше.

source: a :class:`!tkinter.Canvas`
ru: :class:`!tkinter.Canvas`

source: Provides screen oriented methods like :func:`bgcolor` etc. that are described above.
ru: Предоставляет экранно-ориентированные методы, такие как :func:`bgcolor` и т. д., описанные выше.

source: Subclass of TurtleScreen, with :ref:`four methods added <screenspecific>`.
ru: Подкласс TurtleScreen, с добавлением :ref:`четырех методов <screenspecific>`.
uk: Підклас TurtleScreen із :ref:`чотирма доданими методами <screenspecific>`.

source: some Tkinter widget to contain the ScrolledCanvas, i.e. a Tkinter-canvas with scrollbars added
ru: некоторый виджет Tkinter, содержащий ScrolledCanvas, то есть холст Tkinter с добавленными полосами прокрутки
uk: деякий віджет Tkinter, який містить ScrolledCanvas, тобто Tkinter-полотно з доданими смугами прокрутки

source: Used by class Screen, which thus automatically provides a ScrolledCanvas as playground for the turtles.
ru: Используется классом Screen, который автоматически предоставляет ScrolledCanvas в качестве игровой площадки для черепах.
uk: Використовується класом Screen, який таким чином автоматично надає ScrolledCanvas як ігровий майданчик для черепах.

source: one of the strings "polygon", "image", "compound"
ru: одна из строк «многоугольник», «изображение», «составное»
uk: один із рядків "polygon", "image", "compound"

source: Data structure modeling shapes. The pair ``(type_, data)`` must follow this specification:
ru: Формы моделирования структуры данных. Пара ``(type_, data)`` должна соответствовать следующей спецификации:
uk: Форми моделювання структури даних. Пара ``(тип_, дані)`` має відповідати цій специфікації:

source: *data*
ru: *данные*
uk: *дані*

source: "polygon"
ru: "полигон"
uk: "багатокутник"

source: a polygon-tuple, i.e. a tuple of pairs of coordinates
ru: кортеж-полигон, т.е. кортеж пар координат
uk: полігон-кортеж, тобто кортеж пар координат

source: "image"
ru: "изображение"
uk: "зображення"

source: an image (in this form only used internally!)
ru: изображение (в этой форме используется только внутри!)
uk: зображення (у цій формі використовується лише внутрішньо!)

source: "compound"
ru: "состав"
uk: "з'єднання"

source: ``None`` (a compound shape has to be constructed using the :meth:`addcomponent` method)
ru: ``Нет`` (составная фигура должна быть построена с использованием метода :meth:`addcomComponent`)
uk: ``None`` (складена форма має бути створена за допомогою методу :meth:`addcomponent`)

source: a polygon, i.e. a tuple of pairs of numbers
ru: многоугольник, то есть набор пар чисел
uk: багатокутник, тобто кортеж пар чисел

source: a color the *poly* will be filled with
ru: цвет, которым *poly* будет заполнен
uk: колір, яким буде заповнено *poly*

source: a color for the poly's outline (if given)
ru: цвет контура полигона (если задан)
uk: колір контуру поля (якщо вказано)

source: Example:
ru: Пример:
uk: приклад:

source: See :ref:`compoundshapes`.
ru: См. :ref:`compoundshapes`.
uk: Дивіться :ref:`compoundshapes`.

source: A two-dimensional vector class, used as a helper class for implementing turtle graphics. May be useful for turtle graphics programs too. Derived from tuple, so a vector is a tuple!
ru: Двумерный векторный класс, используемый в качестве вспомогательного класса для реализации черепашьей графики. Может быть полезно и для программ черепашьей графики. Произведено от кортежа, поэтому вектор является кортежем!
uk: Двовимірний векторний клас, який використовується як допоміжний клас для реалізації графіки черепахи. Також може бути корисним для графічних програм черепах. Походить від кортежу, тому вектор є кортежем!

source: Provides (for *a*, *b* vectors, *k* number):
ru: Обеспечивает (для векторов *a*, *b*, числа *k*):
uk: Надає (для *a*, *b* векторів, *k* числа):

source: ``a + b`` vector addition
ru: ``a + b`` векторное сложение
uk: ``a + b`` додавання вектора

source: ``a - b`` vector subtraction
ru: ``a - b`` векторное вычитание
uk: Віднімання вектора ``a - b``
