Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/types.po
Languages: ru

source: This function transforms a :term:`generator` function into a :term:`coroutine function` which returns a generator-based coroutine. The generator-based coroutine is still a :term:`generator iterator`, but is also considered to be a :term:`coroutine` object and is :term:`awaitable`. However, it may not necessarily implement the :meth:`~object.__await__` method.
ru: Эта функция преобразует функцию :term:`generator` в :term:`coroutine function`, которая возвращает сопрограмму на основе генератора. Сопрограмма на основе генератора по-прежнему является :term:`итератором-генератором`, но также считается объектом :term:`сопрограммы` и является :term:`awaitable`. Однако он не обязательно реализует метод :meth:`~object.__await__`.

source: If *gen_func* is a generator function, it will be modified in-place.
ru: Если *gen_func* является функцией-генератором, она будет изменена на месте.

source: If *gen_func* is not a generator function, it will be wrapped. If it returns an instance of :class:`collections.abc.Generator`, the instance will be wrapped in an *awaitable* proxy object. All other types of objects will be returned as is.
ru: Если *gen_func* не является функцией-генератором, она будет обернута. Если он возвращает экземпляр :class:`collections.abc.Generator`, этот экземпляр будет заключен в *ожидаемый* прокси-объект. Все остальные типы объектов будут возвращены как есть.

source: built-in function
ru: встроенная функция

source: compile
ru: скомпилировать
