Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/types.po
Languages: ru

source: :mod:`!types` --- Dynamic type creation and names for built-in types
ru: :mod:`!types` --- Динамическое создание типов и имена для встроенных типов

source: **Source code:** :source:`Lib/types.py`
ru: **Исходный код:** :source:`Lib/types.py`

source: This module defines utility functions to assist in dynamic creation of new types.
ru: Этот модуль определяет служебные функции, помогающие в динамическом создании новых типов.

source: It also defines names for some object types that are used by the standard Python interpreter, but not exposed as builtins like :class:`int` or :class:`str` are.
ru: Он также определяет имена для некоторых типов объектов, которые используются стандартным интерпретатором Python, но не отображаются как встроенные функции, такие как :class:`int` или :class:`str`.

source: Finally, it provides some additional type-related utility classes and functions that are not fundamental enough to be builtins.
ru: Наконец, он предоставляет некоторые дополнительные служебные классы и функции, связанные с типами, которые недостаточно фундаментальны, чтобы быть встроенными.

source: Dynamic Type Creation
ru: Создание динамических типов

source: Creates a class object dynamically using the appropriate metaclass.
ru: Создает объект класса динамически, используя соответствующий метакласс.

source: The first three arguments are the components that make up a class definition header: the class name, the base classes (in order), the keyword arguments (such as ``metaclass``).
ru: Первые три аргумента — это компоненты, составляющие заголовок определения класса: имя класса, базовые классы (по порядку), аргументы ключевого слова (например, «метакласс»).

source: The *exec_body* argument is a callback that is used to populate the freshly created class namespace. It should accept the class namespace as its sole argument and update the namespace directly with the class contents. If no callback is provided, it has the same effect as passing in ``lambda ns: None``.
ru: Аргумент *exec_body* — это обратный вызов, который используется для заполнения пространства имен только что созданного класса. Он должен принять пространство имен класса в качестве единственного аргумента и обновить пространство имен непосредственно содержимым класса. Если обратный вызов не указан, это имеет тот же эффект, что и передача ``lambda ns: None``.

source: Calculates the appropriate metaclass and creates the class namespace.
ru: Вычисляет соответствующий метакласс и создает пространство имен класса.

source: The arguments are the components that make up a class definition header: the class name, the base classes (in order) and the keyword arguments (such as ``metaclass``).
ru: Аргументы — это компоненты, составляющие заголовок определения класса: имя класса, базовые классы (по порядку) и аргументы ключевого слова (например, «метакласс»).

source: The return value is a 3-tuple: ``metaclass, namespace, kwds``
ru: Возвращаемое значение представляет собой тройной кортеж: ``метакласс, пространство имен, kwds``

source: *metaclass* is the appropriate metaclass, *namespace* is the prepared class namespace and *kwds* is an updated copy of the passed in *kwds* argument with any ``'metaclass'`` entry removed. If no *kwds* argument is passed in, this will be an empty dict.
ru: *metaclass* — это соответствующий метакласс, *namespace* — это подготовленное пространство имен класса, а *kwds* — это обновленная копия переданного аргумента *kwds* с удаленной записью ``'metaclass'``. Если аргумент *kwds* не передан, это будет пустой словарь.

source: The default value for the ``namespace`` element of the returned tuple has changed. Now an insertion-order-preserving mapping is used when the metaclass does not have a ``__prepare__`` method.
ru: Значение по умолчанию для элемента namespace возвращаемого кортежа изменилось. Теперь отображение, сохраняющее порядок вставки, используется, когда метакласс не имеет метода ``__prepare__``.

source: Full details of the class creation process supported by these functions
ru: Полная информация о процессе создания классов, поддерживаемом этими функциями.

source: :pep:`3115` - Metaclasses in Python 3000
ru: :pep:`3115` - Метаклассы в Python 3000

source: Introduced the ``__prepare__`` namespace hook
ru: Представлен хук пространства имен ``__prepare__``.

source: Resolve MRO entries dynamically as specified by :pep:`560`.
ru: Разрешайте записи MRO динамически, как указано в :pep:`560`.

source: This function looks for items in *bases* that are not instances of :class:`type`, and returns a tuple where each such object that has an :meth:`~object.__mro_entries__` method is replaced with an unpacked result of calling this method. If a *bases* item is an instance of :class:`type`, or it doesn't have an :meth:`!__mro_entries__` method, then it is included in the return tuple unchanged.
ru: Эта функция ищет в *базах* элементы, которые не являются экземплярами :class:`type`, и возвращает кортеж, в котором каждый такой объект, имеющий метод :meth:`~object.__mro_entries__`, заменяется распакованным результатом вызова. этот метод. Если элемент *bases* является экземпляром :class:`type` или у него нет метода :meth:`!__mro_entries__`, то он включается в возвращаемый кортеж без изменений.

source: Return the tuple of objects originally given as the bases of *cls* before the :meth:`~object.__mro_entries__` method has been called on any bases (following the mechanisms laid out in :pep:`560`). This is useful for introspecting :ref:`Generics <user-defined-generics>`.
ru: Возвращает кортеж объектов, изначально заданных в качестве баз *cls* до того, как метод :meth:`~object.__mro_entries__` будет вызван на любых базах (следуя механизмам, изложенным в :pep:`560`). Это полезно для анализа :ref:`Generics <user-defined-generics>`.

source: For classes that have an ``__orig_bases__`` attribute, this function returns the value of ``cls.__orig_bases__``. For classes without the ``__orig_bases__`` attribute, :attr:`cls.__bases__ <type.__bases__>` is returned.
ru: Для классов, имеющих атрибут ``__orig_bases__``, эта функция возвращает значение ``cls.__orig_bases__``. Для классов без атрибута ``__orig_bases__`` возвращается :attr:`cls.__bases__ <type.__bases__>`.

source: Examples::
ru: Примеры::

source: :pep:`560` - Core support for typing module and generic types
ru: :pep:`560` - Основная поддержка модуля типизации и универсальных типов.

source: Standard Interpreter Types
ru: Стандартные типы интерпретаторов

source: This module provides names for many of the types that are required to implement a Python interpreter. It deliberately avoids including some of the types that arise only incidentally during processing such as the ``listiterator`` type.
ru: Этот модуль предоставляет имена для многих типов, которые необходимы для реализации интерпретатора Python. Он намеренно избегает включения некоторых типов, которые возникают случайно во время обработки, таких как тип listiterator.

source: Typical use of these names is for :func:`isinstance` or :func:`issubclass` checks.
ru: Обычно эти имена используются для проверок :func:`isinstance` или :func:`issubclass`.

source: If you instantiate any of these types, note that signatures may vary between Python versions.
ru: Если вы создаете экземпляр любого из этих типов, обратите внимание, что сигнатуры могут различаться в зависимости от версии Python.

source: Standard names are defined for the following types:
ru: Стандартные имена определены для следующих типов:

source: The type of :data:`None`.
ru: Тип :data:`Нет`.

source: The type of user-defined functions and functions created by :keyword:`lambda` expressions.
ru: Тип пользовательских функций и функций, созданных с помощью :keyword:`lambda`-выражений.

source: Raises an :ref:`auditing event <auditing>` ``function.__new__`` with argument ``code``.
ru: Вызывает :ref:`событие аудита <auditing>` ``function.__new__`` с аргументом ``code``.

source: The audit event only occurs for direct instantiation of function objects, and is not raised for normal compilation.
ru: Событие аудита возникает только при прямом создании экземпляров функциональных объектов и не возникает при обычной компиляции.

source: The type of :term:`generator`-iterator objects, created by generator functions.
ru: Тип объектов :term:`generator`-итератора, созданных функциями-генераторами.

source: The type of :term:`coroutine` objects, created by :keyword:`async def` functions.
ru: Тип объектов :term:`coroutine`, создаваемых функциями :keyword:`async def`.

source: The type of :term:`asynchronous generator`-iterator objects, created by asynchronous generator functions.
ru: Тип объектов-итераторов асинхронного генератора, созданных функциями асинхронного генератора.

source: The type of :ref:`code objects <code-objects>` such as returned by :func:`compile`.
ru: Тип :ref:`объектов кода <code-objects>`, например, возвращаемый :func:`compile`.

source: Raises an :ref:`auditing event <auditing>` ``code.__new__`` with arguments ``code``, ``filename``, ``name``, ``argcount``, ``posonlyargcount``, ``kwonlyargcount``, ``nlocals``, ``stacksize``, ``flags``.
ru: Вызывает :ref:`событие аудита <auditing>` ``code.__new__`` с аргументами ``code``, ``filename``, ``name``, ``argcount``, ``posonlyargcount`` , ``kwonlyargcount``, ``nlocals``, ``stacksize``, ``flags``.

source: Note that the audited arguments may not match the names or positions required by the initializer. The audit event only occurs for direct instantiation of code objects, and is not raised for normal compilation.
ru: Обратите внимание, что проверяемые аргументы могут не соответствовать именам или позициям, требуемым инициализатором. Событие аудита возникает только при прямом создании экземпляров объектов кода и не возникает при обычной компиляции.

source: The type for cell objects: such objects are used as containers for a function's :term:`closure variables <closure variable>`.
ru: Тип объектов ячеек: такие объекты используются в качестве контейнеров для :term:`закрывающих переменных <замыкающей переменной>`.

source: The type of methods of user-defined class instances.
ru: Тип методов экземпляров определяемого пользователем класса.

source: The type of built-in functions like :func:`len` or :func:`sys.exit`, and methods of built-in classes. (Here, the term "built-in" means "written in C".)
ru: Тип встроенных функций, таких как :func:`len` или :func:`sys.exit`, а также методы встроенных классов. (Здесь термин «встроенный» означает «написанный на C».)

source: The type of methods of some built-in data types and base classes such as :meth:`object.__init__` or :meth:`object.__lt__`.
ru: Тип методов некоторых встроенных типов данных и базовых классов, таких как :meth:`object.__init__` или :meth:`object.__lt__`.

source: The type of *bound* methods of some built-in data types and base classes. For example it is the type of :code:`object().__str__`.
ru: Тип *связанных* методов некоторых встроенных типов данных и базовых классов. Например, это тип :code:`object().__str__`.

source: The type of :data:`NotImplemented`.
ru: Тип :data:`NotImplemented`.

source: The type of methods of some built-in data types such as :meth:`str.join`.
ru: Тип методов некоторых встроенных типов данных, таких как :meth:`str.join`.

source: The type of *unbound* class methods of some built-in data types such as ``dict.__dict__['fromkeys']``.
ru: Тип *несвязанных* методов класса некоторых встроенных типов данных, таких как ``dict.__dict__['fromkeys']``.

source: The type of :term:`modules <module>`. The constructor takes the name of the module to be created and optionally its :term:`docstring`.
ru: Тип :term:`модулей <модуль>`. Конструктор принимает имя создаваемого модуля и, при необходимости, его :term:`docstring`.

source: :ref:`Documentation on module objects <module-objects>`
ru: :ref:`Документация по объектам модуля <module-objects>`

source: Provides details on the special attributes that can be found on instances of :class:`!ModuleType`.
ru: Содержит подробную информацию о специальных атрибутах, которые можно найти в экземплярах :class:`!ModuleType`.

source: Modules created using the :class:`!ModuleType` constructor are created with many of their special attributes unset or set to default values. :func:`!module_from_spec` provides a more robust way of creating :class:`!ModuleType` instances which ensures the various attributes are set appropriately.
ru: Модули, созданные с помощью конструктора :class:`!ModuleType`, создаются со многими из своих специальных атрибутов, которые не установлены или установлены в значения по умолчанию. :func:`!module_from_spec` обеспечивает более надежный способ создания экземпляров :class:`!ModuleType`, который гарантирует правильную установку различных атрибутов.

source: The type of :data:`Ellipsis`.
ru: Тип :data:`Ellipsis`.

source: The type of :ref:`parameterized generics <types-genericalias>` such as ``list[int]``.
ru: Тип параметризованных дженериков <types-genericalias>, например list[int]``.

source: ``t_origin`` should be a non-parameterized generic class, such as ``list``, ``tuple`` or ``dict``. ``t_args`` should be a :class:`tuple` (possibly of length 1) of types which parameterize ``t_origin``::
ru: ``t_origin`` должен быть непараметризованным универсальным классом, таким как ``list``, ``tuple`` или ``dict``. ``t_args`` должен быть :class:`tuple` (возможно, длиной 1) типов, которые параметризуют ``t_origin``::

source: This type can now be subclassed.
ru: Теперь этот тип можно разделить на подклассы.

source: In-depth documentation on instances of :class:`!types.GenericAlias`
ru: Подробная документация по экземплярам :class:`!types.GenericAlias`

source: :pep:`585` - Type Hinting Generics In Standard Collections
ru: :pep:`585` - Обобщенные типы хинтинга в стандартных коллекциях

source: Introducing the :class:`!types.GenericAlias` class
ru: Представляем класс :class:`!types.GenericAlias`

source: The type of :ref:`union type expressions<types-union>`.
ru: Тип :ref:`выражений типа объединения<types-union>`.

source: The type of traceback objects such as found in ``sys.exception().__traceback__``.
ru: Тип объектов трассировки, например, найденный в ``sys.Exception().__traceback__``.

source: See :ref:`the language reference <traceback-objects>` for details of the available attributes and operations, and guidance on creating tracebacks dynamically.
ru: См. :ref:`Справочник по языку <traceback-objects>` для получения подробной информации о доступных атрибутах и ​​операциях, а также рекомендаций по динамическому созданию обратных трассировок.

source: The type of :ref:`frame objects <frame-objects>` such as found in :attr:`tb.tb_frame <traceback.tb_frame>` if ``tb`` is a traceback object.
ru: Тип :ref:`frame-объектов <frame-objects>`, например, найденный в :attr:`tb.tb_frame <traceback.tb_frame>`, если ``tb`` является объектом трассировки.

source: The type of objects defined in extension modules with ``PyGetSetDef``, such as :attr:`FrameType.f_locals <frame.f_locals>` or ``array.array.typecode``. This type is used as descriptor for object attributes; it has the same purpose as the :class:`property` type, but for classes defined in extension modules.
ru: Тип объектов, определенных в модулях расширения с помощью PyGetSetDef, например :attr:`FrameType.f_locals <frame.f_locals>` или ``array.array.typecode``. Этот тип используется как дескриптор атрибутов объекта; он имеет ту же цель, что и тип :class:`property`, но для классов, определенных в модулях расширения.

source: The type of objects defined in extension modules with ``PyMemberDef``, such as ``datetime.timedelta.days``. This type is used as descriptor for simple C data members which use standard conversion functions; it has the same purpose as the :class:`property` type, but for classes defined in extension modules.
ru: Тип объектов, определенных в модулях расширения с помощью PyMemberDef, например datetime.timedelta.days. Этот тип используется в качестве дескриптора для простых членов данных C, которые используют стандартные функции преобразования; он имеет ту же цель, что и тип :class:`property`, но для классов, определенных в модулях расширения.

source: In addition, when a class is defined with a :attr:`~object.__slots__` attribute, then for each slot, an instance of :class:`!MemberDescriptorType` will be added as an attribute on the class. This allows the slot to appear in the class's :attr:`~type.__dict__`.
ru: Кроме того, если класс определен с атрибутом :attr:`~object.__slots__`, то для каждого слота в качестве атрибута класса будет добавлен экземпляр :class:`!MemberDescriptorType`. Это позволит слоту появиться в :attr:`~type.__dict__` класса.

source: In other implementations of Python, this type may be identical to ``GetSetDescriptorType``.
ru: В других реализациях Python этот тип может быть идентичен GetSetDescriptorType.

source: Read-only proxy of a mapping. It provides a dynamic view on the mapping's entries, which means that when the mapping changes, the view reflects these changes.
ru: Прокси-сервер сопоставления, доступный только для чтения. Он обеспечивает динамическое представление записей сопоставления, что означает, что при изменении сопоставления представление отражает эти изменения.

source: Updated to support the new union (``|``) operator from :pep:`584`, which simply delegates to the underlying mapping.
ru: Обновлено для поддержки нового оператора объединения (``|``) из :pep:`584`, который просто делегирует базовое сопоставление.

source: Return ``True`` if the underlying mapping has a key *key*, else ``False``.
ru: Возвращайте ``True``, если базовое сопоставление имеет ключ *key*, иначе ``False``.

source: Return the item of the underlying mapping with key *key*. Raises a :exc:`KeyError` if *key* is not in the underlying mapping.
ru: Верните элемент базового сопоставления с ключом *key*. Вызывает :exc:`KeyError`, если *key* отсутствует в базовом сопоставлении.

source: Return an iterator over the keys of the underlying mapping. This is a shortcut for ``iter(proxy.keys())``.
ru: Возвращает итератор по ключам базового сопоставления. Это ярлык для ``iter(proxy.keys())``.

source: Return the number of items in the underlying mapping.
ru: Возвращает количество элементов в базовом сопоставлении.

source: Return a shallow copy of the underlying mapping.
ru: Верните неглубокую копию базового сопоставления.

source: Return the value for *key* if *key* is in the underlying mapping, else *default*. If *default* is not given, it defaults to ``None``, so that this method never raises a :exc:`KeyError`.
ru: Возвращает значение *key*, если *key* находится в базовом сопоставлении, иначе *default*. Если *default* не задано, по умолчанию используется значение None, так что этот метод никогда не вызывает :exc:`KeyError`.

source: Return a new view of the underlying mapping's items (``(key, value)`` pairs).
ru: Возвращает новое представление элементов базового сопоставления (пары ``(ключ, значение)``).(``(key, value)`` pairs).

source: Return a new view of the underlying mapping's keys.
ru: Верните новое представление ключей базового сопоставления.

source: Return a new view of the underlying mapping's values.
ru: Верните новое представление значений базового сопоставления.

source: Return a reverse iterator over the keys of the underlying mapping.
ru: Верните обратный итератор по ключам базового сопоставления.

source: Return a hash of the underlying mapping.
ru: Возвращает хеш базового сопоставления.

source: The type of :ref:`capsule objects <capsules>`.
ru: Тип :ref:`капсульных объектов <capsules>`.

source: Additional Utility Classes and Functions
ru: Дополнительные служебные классы и функции

source: A simple :class:`object` subclass that provides attribute access to its namespace, as well as a meaningful repr.
ru: Простой подкласс :class:`object`, который обеспечивает доступ к атрибутам своего пространства имен, а также значимое представление.

source: Unlike :class:`object`, with :class:`!SimpleNamespace` you can add and remove attributes.
ru: В отличие от :class:`object`, с помощью :class:`!SimpleNamespace` вы можете добавлять и удалять атрибуты.

source: :py:class:`SimpleNamespace` objects may be initialized in the same way as :class:`dict`: either with keyword arguments, with a single positional argument, or with both. When initialized with keyword arguments, those are directly added to the underlying namespace. Alternatively, when initialized with a positional argument, the underlying namespace will be updated with key-value pairs from that argument (either a mapping object or an :term:`iterable` object producing key-value pairs). All such keys must be strings.
ru: Объекты :py:class:`SimpleNamespace` могут быть инициализированы так же, как и :class:`dict`: либо с аргументами ключевого слова, с одним позиционным аргументом, либо с обоими. При инициализации с использованием аргументов ключевого слова они напрямую добавляются в базовое пространство имен. Альтернативно, при инициализации с помощью позиционного аргумента базовое пространство имен будет обновлено парами ключ-значение из этого аргумента (либо объекта сопоставления, либо объекта :term:`iterable`, создающего пары ключ-значение). Все такие ключи должны быть строками.

source: The type is roughly equivalent to the following code::
ru: Тип примерно эквивалентен следующему коду:

source: ``SimpleNamespace`` may be useful as a replacement for ``class NS: pass``. However, for a structured record type use :func:`~collections.namedtuple` instead.
ru: ``SimpleNamespace`` может быть полезен в качестве замены ``class NS: pass``. Однако для типа структурированной записи вместо этого используйте :func:`~collections.namedtuple`.

source: :class:`!SimpleNamespace` objects are supported by :func:`copy.replace`.
ru: Объекты :class:`!SimpleNamespace` поддерживаются :func:`copy.replace`.

source: Attribute order in the repr changed from alphabetical to insertion (like ``dict``).
ru: Порядок атрибутов в представлении изменен с алфавитного на порядок вставки (как в ``dict``).

source: Added support for an optional positional argument.
ru: Добавлена ​​поддержка необязательного позиционного аргумента.

source: Route attribute access on a class to __getattr__.
ru: Направьте доступ к атрибутам класса к __getattr__.

source: This is a descriptor, used to define attributes that act differently when accessed through an instance and through a class. Instance access remains normal, but access to an attribute through a class will be routed to the class's __getattr__ method; this is done by raising AttributeError.
ru: Это дескриптор, используемый для определения атрибутов, которые действуют по-разному при доступе через экземпляр и через класс. Доступ к экземпляру остается обычным, но доступ к атрибуту через класс будет перенаправлен на метод __getattr__ класса; это делается путем поднятия AttributeError.

source: This allows one to have properties active on an instance, and have virtual attributes on the class with the same name (see :class:`enum.Enum` for an example).
ru: Это позволяет иметь активные свойства экземпляра и виртуальные атрибуты класса с тем же именем (пример см. в :class:`enum.Enum`).

source: Coroutine Utility Functions
ru: Служебные функции сопрограммы
