Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/typing.po
Languages: ja, ru

source: Type variables exist primarily for the benefit of static type checkers. They serve as the parameters for generic types as well as for generic function definitions. See :class:`Generic` for more information on generic types. Generic functions work as follows::
ja: 型変数は主として静的型検査器のために存在します。型変数はジェネリック型やジェネリック関数の定義の引数として役に立ちます。ジェネリック型についての詳細は :class:`Generic` クラスを参照してください。ジェネリック関数は以下のように動作します::

source: At runtime, ``isinstance(x, T)`` will raise :exc:`TypeError`. In general, :func:`isinstance` and :func:`issubclass` should not be used with types.
ja: 実行時に、``isinstance(x, T)`` は :exc:`TypeError` を送出するでしょう。一般的に、:func:`isinstance` と :func:`issubclass` は型に対して使用するべきではありません。

source: It is meant to be used for functions that may accept any kind of string without allowing different kinds of strings to mix. For example::
ja: 他の種類の文字列を混ぜることなく、任意の種類の文字列を許す関数によって使われることを意図しています。

source: Base class for protocol classes. Protocol classes are defined like this::
ja: プロトコルクラスの基底クラス。 プロトコルクラスは次のように定義されます::

source: See :pep:`544` for details. Protocol classes decorated with :func:`runtime_checkable` (described later) act as simple-minded runtime protocols that check only the presence of given attributes, ignoring their type signatures.
ja: 詳細については pep:`544` を参照してください。 :func:`runtime_checkable` (後で説明します) でデコレートされたプロトコルクラスは、与えられたメソッドがあることだけを確認し、その型シグネチャは全く見ない安直な動作をする実行時プロトコルとして振る舞います。

source: A helper function to indicate a distinct type to a typechecker, see :ref:`distinct`. At runtime it returns a function that returns its argument. Usage::
ja: 異なる型であることを型チェッカーに教えるためのヘルパー関数です。 :ref:`distinct` を参照してください。 実行時には、その引数を返す関数を返します。 使い方は次のようになります::

source: A generic version of :class:`dict`. Useful for annotating return types. To annotate arguments it is preferred to use an abstract collection type such as :class:`Mapping`.
ja: :class:`dict` のジェネリック版です。 返り値の型のアノテーションをつけることに便利です。 引数にアノテーションをつけるためには、 :class:`Mapping` のような抽象コレクション型を使うことが好ましいです。

source: This type can be used as follows::
ja: この型は次のように使えます::

source: :class:`builtins.dict <dict>` now supports ``[]``. See :pep:`585` and :ref:`types-genericalias`.
ja: :class:`builtins.dict <dict>` は ``[]`` をサポートするようになりました。 :pep:`585` および :ref:`types-genericalias` を参照してください。

source: Generic version of :class:`list`. Useful for annotating return types. To annotate arguments it is preferred to use an abstract collection type such as :class:`Sequence` or :class:`Iterable`.
ja: :class:`list` のジェネリック版です。 返り値の型のアノテーションをつけるのに便利です。 引数にアノテーションをつけるためには、 :class:`Sequence` や :class:`Iterable` のような抽象コレクション型を使うことが好ましいです。

source: This type may be used as follows::
ja: この型は次のように使えます::

source: :class:`builtins.list <list>` now supports ``[]``. See :pep:`585` and :ref:`types-genericalias`.
ja: :class:`builtins.list <list>` は ``[]`` をサポートするようになりました。 :pep:`585` および :ref:`types-genericalias` を参照してください。

source: A generic version of :class:`builtins.set <set>`. Useful for annotating return types. To annotate arguments it is preferred to use an abstract collection type such as :class:`AbstractSet`.
ja: :class:`builtins.set <set>` のジェネリック版です。 返り値の型のアノテーションをつけるのに便利です。 引数にアノテーションをつけるためには、 :class:`AbstractSet` のような抽象コレクション型を使うことが好ましいです。

source: :class:`builtins.set <set>` now supports ``[]``. See :pep:`585` and :ref:`types-genericalias`.
ja: :class:`builtins.set <set>` は ``[]`` をサポートするようになりました。 :pep:`585` および :ref:`types-genericalias` を参照してください。

source: A generic version of :class:`builtins.frozenset <frozenset>`.
ja: :class:`builtins.frozenset <frozenset>` のジェネリック版です。

source: :class:`builtins.frozenset <frozenset>` now supports ``[]``. See :pep:`585` and :ref:`types-genericalias`.
ja: :class:`builtins.frozenset <frozenset>` は ``[]`` をサポートするようになりました。 :pep:`585` および :ref:`types-genericalias` を参照してください。

source: A generic version of :class:`collections.defaultdict`.
ja: :class:`collections.defaultdict` のジェネリック版です。

source: :class:`collections.defaultdict` now supports ``[]``. See :pep:`585` and :ref:`types-genericalias`.
ja: :class:`collections.defaultdict` は ``[]`` をサポートするようになりました。 :pep:`585` および :ref:`types-genericalias` を参照してください。

source: A generic version of :class:`collections.OrderedDict`.
ja: :class:`collections.OrderedDict` のジェネリック版です。

source: :class:`collections.OrderedDict` now supports ``[]``. See :pep:`585` and :ref:`types-genericalias`.
ja: :class:`collections.OrderedDict` は ``[]`` をサポートするようになりました。 :pep:`585` および :ref:`types-genericalias` を参照してください。

source: A generic version of :class:`collections.ChainMap`.
ja: :class:`collections.ChainMap` のジェネリック版です。

source: :class:`collections.ChainMap` now supports ``[]``. See :pep:`585` and :ref:`types-genericalias`.
ja: :class:`collections.ChainMap` は ``[]`` をサポートするようになりました。 :pep:`585` および :ref:`types-genericalias` を参照してください。

source: A generic version of :class:`collections.Counter`.
ja: :class:`collections.Counter` のジェネリック版です。

source: :class:`collections.Counter` now supports ``[]``. See :pep:`585` and :ref:`types-genericalias`.
ja: :class:`collections.Counter` は ``[]`` をサポートするようになりました。 :pep:`585` および :ref:`types-genericalias` を参照してください。

source: A generic version of :class:`collections.deque`.
ja: :class:`collections.deque` のジェネリック版です。

source: :class:`collections.deque` now supports ``[]``. See :pep:`585` and :ref:`types-genericalias`.
ja: :class:`collections.deque` は ``[]`` をサポートするようになりました。 :pep:`585` および :ref:`types-genericalias` を参照してください。

source: These type aliases correspond to the return types from :func:`re.compile` and :func:`re.match`. These types (and the corresponding functions) are generic in ``AnyStr`` and can be made specific by writing ``Pattern[str]``, ``Pattern[bytes]``, ``Match[str]``, or ``Match[bytes]``.
ja: これらの型エイリアスは :func:`re.compile` と :func:`re.match` の返り値の型に対応します。 これらの型 (と対応する関数) は ``AnyStr`` についてジェネリックで、``Pattern[str]`` 、 ``Pattern[bytes]`` 、 ``Match[str]`` 、 ``Match[bytes]`` と書くことで具体型にできます。

source: ``Text`` is an alias for ``str``. It is provided to supply a forward compatible path for Python 2 code: in Python 2, ``Text`` is an alias for ``unicode``.
ja: ``Text`` は ``str`` のエイリアスです。これは Python 2 のコードの前方互換性を提供するために設けられています: Python 2 では ``Text`` は ``unicode`` のエイリアスです。

source: Abstract Base Classes
ja: 抽象基底クラス

source: A generic version of :class:`collections.abc.Set`.
ja: :class:`collections.abc.Set` のジェネリック版です。

source: :class:`collections.abc.Set` now supports ``[]``. See :pep:`585` and :ref:`types-genericalias`.
ja: :class:`collections.abc.Set` は ``[]`` をサポートするようになりました。 :pep:`585` および :ref:`types-genericalias` を参照してください。

source: A generic version of :class:`collections.abc.ByteString`.
ja: :class:`collections.abc.ByteString` のジェネリック版です。

source: As a shorthand for this type, :class:`bytes` can be used to annotate arguments of any of the types mentioned above.
ja: この型の省略形として、 :class:`bytes` を上に挙げた任意の型の引数にアノテーションをつけることに使えます。

source: :class:`collections.abc.ByteString` now supports ``[]``. See :pep:`585` and :ref:`types-genericalias`.
ja: :class:`collections.abc.ByteString` は ``[]`` をサポートするようになりました。 :pep:`585` および :ref:`types-genericalias` を参照してください。

source: A generic version of :class:`collections.abc.Collection`
ja: :class:`collections.abc.Collection` のジェネリック版です。

source: :class:`collections.abc.Collection` now supports ``[]``. See :pep:`585` and :ref:`types-genericalias`.
ja: :class:`collections.abc.Collection` は ``[]`` をサポートするようになりました。 :pep:`585` および :ref:`types-genericalias` を参照してください。

source: A generic version of :class:`collections.abc.Container`.
ja: :class:`collections.abc.Container` のジェネリック版です。

source: :class:`collections.abc.Container` now supports ``[]``. See :pep:`585` and :ref:`types-genericalias`.
ja: :class:`collections.abc.Container` は ``[]`` をサポートするようになりました。 :pep:`585` および :ref:`types-genericalias` を参照してください。

source: A generic version of :class:`collections.abc.ItemsView`.
ja: :class:`collections.abc.ItemsView` のジェネリック版です。

source: :class:`collections.abc.ItemsView` now supports ``[]``. See :pep:`585` and :ref:`types-genericalias`.
ja: :class:`collections.abc.ItemsView` は ``[]`` をサポートするようになりました。 :pep:`585` および :ref:`types-genericalias` を参照してください。

source: A generic version of :class:`collections.abc.KeysView`.
ja: :class:`collections.abc.KeysView` のジェネリック版です。

source: :class:`collections.abc.KeysView` now supports ``[]``. See :pep:`585` and :ref:`types-genericalias`.
ja: :class:`collections.abc.KeysView` は ``[]`` をサポートするようになりました。 :pep:`585` および :ref:`types-genericalias` を参照してください。

source: A generic version of :class:`collections.abc.Mapping`. This type can be used as follows::
ja: :class:`collections.abc.Mapping` のジェネリック版です。 この型は次のように使えます::

source: :class:`collections.abc.Mapping` now supports ``[]``. See :pep:`585` and :ref:`types-genericalias`.
ja: :class:`collections.abc.Mapping` は ``[]`` をサポートするようになりました。 :pep:`585` および :ref:`types-genericalias` を参照してください。

source: A generic version of :class:`collections.abc.MappingView`.
ja: :class:`collections.abc.MappingView` のジェネリック版です。

source: :class:`collections.abc.MappingView` now supports ``[]``. See :pep:`585` and :ref:`types-genericalias`.
ja: :class:`collections.abc.MappingView` は ``[]`` をサポートするようになりました。 :pep:`585` および :ref:`types-genericalias` を参照してください。

source: A generic version of :class:`collections.abc.MutableMapping`.
ja: :class:`collections.abc.MutableMapping` のジェネリック版です。

source: :class:`collections.abc.MutableMapping` now supports ``[]``. See :pep:`585` and :ref:`types-genericalias`.
ja: :class:`collections.abc.MutableMapping` は ``[]`` をサポートするようになりました。 :pep:`585` および :ref:`types-genericalias` を参照してください。

source: A generic version of :class:`collections.abc.MutableSequence`.
ja: :class:`collections.abc.MutableSequence` のジェネリック版です。

source: :class:`collections.abc.MutableSequence` now supports ``[]``. See :pep:`585` and :ref:`types-genericalias`.
ja: :class:`collections.abc.MutableSequence` は ``[]`` をサポートするようになりました。 :pep:`585` および :ref:`types-genericalias` を参照してください。

source: A generic version of :class:`collections.abc.MutableSet`.
ja: :class:`collections.abc.MutableSet` のジェネリック版です。

source: :class:`collections.abc.MutableSet` now supports ``[]``. See :pep:`585` and :ref:`types-genericalias`.
ja: :class:`collections.abc.MutableSet` は ``[]`` をサポートするようになりました。 :pep:`585` および :ref:`types-genericalias` を参照してください。

source: A generic version of :class:`collections.abc.Sequence`.
ja: :class:`collections.abc.Sequence` のジェネリック版です。

source: :class:`collections.abc.Sequence` now supports ``[]``. See :pep:`585` and :ref:`types-genericalias`.
ja: :class:`collections.abc.Sequence` は ``[]`` をサポートするようになりました。 :pep:`585` および :ref:`types-genericalias` を参照してください。

source: A generic version of :class:`collections.abc.ValuesView`.
ja: :class:`collections.abc.ValuesView` のジェネリック版です。

source: :class:`collections.abc.ValuesView` now supports ``[]``. See :pep:`585` and :ref:`types-genericalias`.
ja: :class:`collections.abc.ValuesView` は ``[]`` をサポートするようになりました。 :pep:`585` および :ref:`types-genericalias` を参照してください。

source: A generic version of :class:`collections.abc.Iterable`.
ja: :class:`collections.abc.Iterable` のジェネリック版です。

source: :class:`collections.abc.Iterable` now supports ``[]``. See :pep:`585` and :ref:`types-genericalias`.
ja: :class:`collections.abc.Iterable` は ``[]`` をサポートするようになりました。 :pep:`585` と :ref:`types-genericalias` を参照してください。

source: A generic version of :class:`collections.abc.Iterator`.
ja: :class:`collections.abc.Iterator` のジェネリック版です。

source: :class:`collections.abc.Iterator` now supports ``[]``. See :pep:`585` and :ref:`types-genericalias`.
ja: :class:`collections.abc.Iterator` は ``[]`` をサポートするようになりました。 :pep:`585` および :ref:`types-genericalias` を参照してください。

source: A generator can be annotated by the generic type ``Generator[YieldType, SendType, ReturnType]``. For example::
ja: ジェネレータはジェネリック型 ``Generator[YieldType, SendType, ReturnType]`` によってアノテーションを付けられます。例えば::

source: Note that unlike many other generics in the typing module, the ``SendType`` of :class:`Generator` behaves contravariantly, not covariantly or invariantly.
ja: typing モジュールの多くの他のジェネリクスと違い :class:`Generator` の ``SendType`` は共変や不変ではなく、反変として扱われることに注意してください。

source: If your generator will only yield values, set the ``SendType`` and ``ReturnType`` to ``None``::
ja: もしジェネレータが値を返すだけの場合は、 ``SendType`` と ``ReturnType`` に ``None`` を設定してください::

source: Alternatively, annotate your generator as having a return type of either ``Iterable[YieldType]`` or ``Iterator[YieldType]``::
ja: 代わりに、ジェネレータを ``Iterable[YieldType]`` や ``Iterator[YieldType]`` という返り値の型でアノテーションをつけることもできます::

source: :class:`collections.abc.Generator` now supports ``[]``. See :pep:`585` and :ref:`types-genericalias`.
ja: :class:`collections.abc.Generator` は ``[]`` をサポートするようになりました。 :pep:`585` および :ref:`types-genericalias` を参照してください。

source: An alias to :class:`collections.abc.Hashable`.
ja: :class:`collections.abc.Hashable` へのエイリアスです。

source: A generic version of :class:`collections.abc.Reversible`.
ja: :class:`collections.abc.Reversible` のジェネリック版です。

source: :class:`collections.abc.Reversible` now supports ``[]``. See :pep:`585` and :ref:`types-genericalias`.
ja: :class:`collections.abc.Reversible` は ``[]`` をサポートするようになりました。 :pep:`585` および :ref:`types-genericalias` を参照してください。

source: An alias to :class:`collections.abc.Sized`.
ja: :class:`collections.abc.Sized` へのエイリアスです。

source: A generic version of :class:`collections.abc.Coroutine`. The variance and order of type variables correspond to those of :class:`Generator`, for example::
ja: :class:`collections.abc.Coroutine` のジェネリック版です。 変性と型変数の順序は :class:`Generator` のものと対応しています。例えば次のようになります::

source: :class:`collections.abc.Coroutine` now supports ``[]``. See :pep:`585` and :ref:`types-genericalias`.
ja: :class:`collections.abc.Coroutine` は ``[]`` をサポートするようになりました。 :pep:`585` および :ref:`types-genericalias` を参照してください。

source: An async generator can be annotated by the generic type ``AsyncGenerator[YieldType, SendType]``. For example::
ja: 非同期ジェネレータはジェネリック型 ``AsyncGenerator[YieldType, SendType]`` によってアノテーションを付けられます。例えば::

source: Unlike normal generators, async generators cannot return a value, so there is no ``ReturnType`` type parameter. As with :class:`Generator`, the ``SendType`` behaves contravariantly.
ja: 通常のジェネレータと違って非同期ジェネレータは値を返せないので、``ReturnType`` 型引数はありません。:class:`Generator` と同様に、``SendType`` は反変的に振る舞います。

source: If your generator will only yield values, set the ``SendType`` to ``None``::
ja: ジェネレータが値を yield するだけなら、``SendType`` を ``None`` にします::

source: Alternatively, annotate your generator as having a return type of either ``AsyncIterable[YieldType]`` or ``AsyncIterator[YieldType]``::
ja: あるいは、ジェネレータが ``AsyncIterable[YieldType]`` と ``AsyncIterator[YieldType]`` のいずれかの戻り値型を持つとアノテートします::

source: :class:`collections.abc.AsyncGenerator` now supports ``[]``. See :pep:`585` and :ref:`types-genericalias`.
ja: :class:`collections.abc.AsyncGenerator` は ``[]`` をサポートするようになりました。 :pep:`585` および :ref:`types-genericalias` を参照してください。

source: A generic version of :class:`collections.abc.AsyncIterable`.
ja: :class:`collections.abc.AsyncIterable` のジェネリック版です。

source: :class:`collections.abc.AsyncIterable` now supports ``[]``. See :pep:`585` and :ref:`types-genericalias`.
ja: :class:`collections.abc.AsyncIterable` は ``[]`` をサポートするようになりました。 :pep:`585` および :ref:`types-genericalias` を参照してください。

source: A generic version of :class:`collections.abc.AsyncIterator`.
ja: :class:`collections.abc.AsyncIterator` のジェネリック版です。

source: :class:`collections.abc.AsyncIterator` now supports ``[]``. See :pep:`585` and :ref:`types-genericalias`.
ja: :class:`collections.abc.AsyncIterator` は ``[]`` をサポートするようになりました。 :pep:`585` および :ref:`types-genericalias` を参照してください。

source: A generic version of :class:`collections.abc.Awaitable`.
ja: :class:`collections.abc.Awaitable` のジェネリック版です。

source: :class:`collections.abc.Awaitable` now supports ``[]``. See :pep:`585` and :ref:`types-genericalias`.
ja: :class:`collections.abc.Awaitable` は ``[]`` をサポートするようになりました。 :pep:`585` および :ref:`types-genericalias` を参照してください。

source: Context manager types
ja: コンテキストマネージャ型

source: A generic version of :class:`contextlib.AbstractContextManager`.
ja: :class:`contextlib.AbstractContextManager` のジェネリック版です。

source: :class:`contextlib.AbstractContextManager` now supports ``[]``. See :pep:`585` and :ref:`types-genericalias`.
ja: :class:`contextlib.AbstractContextManager` は ``[]`` をサポートするようになりました。 :pep:`585` および :ref:`types-genericalias` を参照してください。

source: A generic version of :class:`contextlib.AbstractAsyncContextManager`.
ja: :class:`contextlib.AbstractAsyncContextManager` のジェネリック版です。

source: The ``@overload`` decorator allows describing functions and methods that support multiple different combinations of argument types. A series of ``@overload``-decorated definitions must be followed by exactly one non-``@overload``-decorated definition (for the same function/method). The ``@overload``-decorated definitions are for the benefit of the type checker only, since they will be overwritten by the non-``@overload``-decorated definition, while the latter is used at runtime but should be ignored by a type checker. At runtime, calling a ``@overload``-decorated function directly will raise :exc:`NotImplementedError`. An example of overload that gives a more precise type than can be expressed using a union or a type variable::
ja: ``@overload`` デコレータを使うと、引数の型の複数の組み合わせをサポートする関数やメソッドを書けるようになります。 ``@overload`` 付きの定義を並べた後ろに、(同じ関数やメソッドの) ``@overload`` 無しの定義が来なければなりません。 ``@overload`` 付きの定義は型チェッカーのためでしかありません。 というのも、 ``@overload`` 付きの定義は ``@overload`` 無しの定義で上書きされるからです。 後者は実行時に使われますが、型チェッカーからは無視されるべきなのです。 実行時には、 ``@overload`` 付きの関数を直接呼び出すと :exc:`NotImplementedError` を送出します。 次のコードはオーバーロードを使うことで直和型や型変数を使うよりもより正確な型が表現できる例です::

source: See :pep:`484` for details and comparison with other typing semantics.
ja: 詳細と他の型付け意味論との比較は :pep:`484` を参照してください。

source: This works as class or function :term:`decorator`. With a class, it applies recursively to all methods defined in that class (but not to methods defined in its superclasses or subclasses).
ja: これはクラス :term:`decorator` または関数 :term:`decorator` として動作します。クラス :term:`decorator` として動作する場合は、そのクラス内に定義されたすべてのメソッドに対して再帰的に適用されます。（ただしスーパークラスやサブクラス内に定義されたメソッドには適用されません。）

source: This mutates the function(s) in place.
ja: これは関数を適切に変更します。

source: Decorator to mark a class or function to be unavailable at runtime.
ja: 実行時に使えなくなるクラスや関数に印を付けるデコレータです。

source: This is often the same as ``obj.__annotations__``. In addition, forward references encoded as string literals are handled by evaluating them in ``globals`` and ``locals`` namespaces. If necessary, ``Optional[t]`` is added for function and method annotations if a default value equal to ``None`` is set. For a class ``C``, return a dictionary constructed by merging all the ``__annotations__`` along ``C.__mro__`` in reverse order.
ja: この辞書はたいてい ``obj.__annotations__`` と同じものです。 それに加えて、文字列リテラルにエンコードされた順方向参照は ``globals`` 名前空間および ``locals`` 名前空間で評価されます。 必要であれば、 ``None`` と等価なデフォルト値が設定されている場合に、関数とメソッドのアノテーションに ``Optional[t]`` が追加されます。 クラス ``C`` については、 ``C.__mro__`` の逆順に沿って全ての ``__annotations__`` を合併して構築された辞書を返します。

source: Provide basic introspection for generic types and special typing forms.
ja: ジェネリック型や特殊な型付け形式についての基本的な内観を提供します。

source: A class used for internal typing representation of string forward references. For example, ``List["SomeClass"]`` is implicitly transformed into ``List[ForwardRef("SomeClass")]``. This class should not be instantiated by a user, but may be used by introspection tools.
ja: 文字列による前方参照の内部的な型付け表現に使われるクラスです。 例えば、 ``List["SomeClass"]`` は暗黙的に ``List[ForwardRef("SomeClass")]`` に変換されます。 このクラスはユーザーがインスタンス化するべきではなく、イントロスペクションツールに使われるものです。

source: A special constant that is assumed to be ``True`` by 3rd party static type checkers. It is ``False`` at runtime. Usage::
ja: サードパーティーの静的型検査器が ``True`` と仮定する特別な定数です。 実行時には ``False`` になります。使用例::
