Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/typing.po
Languages: ja, ru

source: In this case ``MyDict`` has a single parameter, ``T``.
ja: この場合では ``MyDict`` は仮引数 ``T`` を 1 つとります。
ru: В этом случае MyDict имеет единственный параметр T.

source: Using a generic class without specifying type parameters assumes :data:`Any` for each position. In the following example, ``MyIterable`` is not generic but implicitly inherits from ``Iterable[Any]``:
ru: Использование универсального класса без указания параметров типа предполагает :data:`Any` для каждой позиции. В следующем примере MyIterable не является универсальным, а неявно наследуется от Iterable[Any]:

source: User-defined generic type aliases are also supported. Examples::
ru: Также поддерживаются определяемые пользователем псевдонимы универсального типа. Примеры::

source: For backward compatibility, generic type aliases can also be created through a simple assignment::
ru: Для обратной совместимости псевдонимы универсальных типов также можно создавать с помощью простого присваивания::

source: :class:`Generic` no longer has a custom metaclass.
ja: :class:`Generic` にあった独自のメタクラスは無くなりました。
ru: :class:`Generic` больше не имеет собственного метакласса.

source: Syntactic support for generics and type aliases is new in version 3.12. Previously, generic classes had to explicitly inherit from :class:`Generic` or contain a type variable in one of their bases.
ru: Синтаксическая поддержка обобщений и псевдонимов типов появилась в версии 3.12. Раньше универсальные классы должны были явно наследовать от :class:`Generic` или содержать переменную типа в одной из своих баз.

source: User-defined generics for parameter expressions are also supported via parameter specification variables in the form ``[**P]``. The behavior is consistent with type variables' described above as parameter specification variables are treated by the typing module as a specialized type variable. The one exception to this is that a list of types can be used to substitute a :class:`ParamSpec`::
ru: Пользовательские обобщения для выражений параметров также поддерживаются через переменные спецификации параметров в форме ``[**P]``. Поведение соответствует описанным выше переменным типа, поскольку переменные спецификации параметра обрабатываются модулем типизации как переменные специализированного типа. Единственным исключением является то, что список типов может использоваться для замены :class:`ParamSpec`::

source: Classes generic over a :class:`ParamSpec` can also be created using explicit inheritance from :class:`Generic`. In this case, ``**`` is not used::
ru: Классы, общие для :class:`ParamSpec`, также могут быть созданы с использованием явного наследования от :class:`Generic`. В этом случае ``**`` не используется::

source: Another difference between :class:`TypeVar` and :class:`ParamSpec` is that a generic with only one parameter specification variable will accept parameter lists in the forms ``X[[Type1, Type2, ...]]`` and also ``X[Type1, Type2, ...]`` for aesthetic reasons. Internally, the latter is converted to the former, so the following are equivalent::
ru: Еще одно различие между :class:`TypeVar` и :class:`ParamSpec` заключается в том, что универсальный вариант только с одной переменной спецификации параметра будет принимать списки параметров в формах ``X[[Type1, Type2, ...]]`` и также ``X[Type1, Type2, ...]`` по эстетическим соображениям. Внутренне последнее преобразуется в первое, поэтому следующие действия эквивалентны:

source: Note that generics with :class:`ParamSpec` may not have correct ``__parameters__`` after substitution in some cases because they are intended primarily for static type checking.
ru: Обратите внимание, что дженерики с :class:`ParamSpec` могут не иметь правильных __parameters__`` после замены в некоторых случаях, поскольку они предназначены в первую очередь для проверки статического типа.

source: :class:`Generic` can now be parameterized over parameter expressions. See :class:`ParamSpec` and :pep:`612` for more details.
ru: :class:`Generic` теперь можно параметризовать через выражения параметров. См. :class:`ParamSpec` и :pep:`612` для более подробной информации.

source: A user-defined generic class can have ABCs as base classes without a metaclass conflict. Generic metaclasses are not supported. The outcome of parameterizing generics is cached, and most types in the typing module are :term:`hashable` and comparable for equality.
ru: Пользовательский универсальный класс может иметь ABC в качестве базовых классов без конфликта метаклассов. Общие метаклассы не поддерживаются. Результат параметризации дженериков кэшируется, и большинство типов в модуле типизации являются :term:`hashable` и сопоставимы на предмет равенства.

source: The :data:`Any` type
ja: :data:`Any` 型
ru: Тип :data:`Any`

source: A special kind of type is :data:`Any`. A static type checker will treat every type as being compatible with :data:`Any` and :data:`Any` as being compatible with every type.
ja: :data:`Any` は特別な種類の型です。静的型検査器はすべての型を :data:`Any` と互換として扱い、 :data:`Any` をすべての型と互換として扱います。
ru: Особый тип — :data:`Any`. Средство проверки статического типа будет рассматривать каждый тип как совместимый с :data:`Any` и :data:`Any` как совместимый с каждым типом.

source: This means that it is possible to perform any operation or method call on a value of type :data:`Any` and assign it to any variable::
ja: これは、 :data:`Any` 型の値では、任意の演算やメソッドの呼び出しが行えることを意味します::
ru: Это означает, что можно выполнить любую операцию или вызов метода со значением типа :data:`Any` и присвоить его любой переменной::

source: Notice that no type checking is performed when assigning a value of type :data:`Any` to a more precise type. For example, the static type checker did not report an error when assigning ``a`` to ``s`` even though ``s`` was declared to be of type :class:`str` and receives an :class:`int` value at runtime!
ru: Обратите внимание, что при присвоении значения типа :data:`Any` более точному типу проверка типа не выполняется. Например, средство проверки статического типа не сообщило об ошибке при присвоении ``a`` значению ``s``, хотя ``s`` был объявлен как тип :class:`str` и получил :class: значение `int` во время выполнения!

source: Furthermore, all functions without a return type or parameter types will implicitly default to using :data:`Any`::
ja: さらに、返り値や引数の型のないすべての関数は暗黙的に :data:`Any` を使用します。
ru: Более того, все функции без типа возвращаемого значения или типов параметров по умолчанию будут неявно использовать :data:`Any`::

source: This behavior allows :data:`Any` to be used as an *escape hatch* when you need to mix dynamically and statically typed code.
ja: この挙動により、動的型付けと静的型付けが混在したコードを書かなければならない時に :data:`Any` を *非常口* として使用することができます。
ru: Такое поведение позволяет использовать :data:`Any` в качестве *аварийного люка*, когда вам нужно смешивать динамически и статически типизированный код.

source: Contrast the behavior of :data:`Any` with the behavior of :class:`object`. Similar to :data:`Any`, every type is a subtype of :class:`object`. However, unlike :data:`Any`, the reverse is not true: :class:`object` is *not* a subtype of every other type.
ja: :data:`Any` の挙動と :class:`object` の挙動を対比しましょう。 :data:`Any` と同様に、すべての型は :class:`object` のサブタイプです。しかしながら、 :data:`Any` と異なり、逆は成り立ちません: :class:`object` はすべての他の型のサブタイプでは *ありません*。
ru: Сравните поведение :data:`Any` с поведением :class:`object`. Подобно :data:`Any`, каждый тип является подтипом :class:`object`. Однако, в отличие от :data:`Any`, обратное неверно: :class:`object` *не* является подтипом любого другого типа.

source: That means when the type of a value is :class:`object`, a type checker will reject almost all operations on it, and assigning it to a variable (or using it as a return value) of a more specialized type is a type error. For example::
ja: これは、ある値の型が :class:`object` のとき、型検査器はこれについてのほとんどすべての操作を拒否し、これをより特殊化された変数に代入する (または返り値として利用する) ことは型エラーになることを意味します。例えば::
ru: Это означает, что когда типом значения является :class:`object`, средство проверки типа отклонит почти все операции с ним, а присвоение его переменной (или использование его в качестве возвращаемого значения) более специализированного типа является типом. ошибка. Например::

source: Use :class:`object` to indicate that a value could be any type in a typesafe manner. Use :data:`Any` to indicate that a value is dynamically typed.
ja: :class:`object` は、ある値が型安全な方法で任意の型として使えることを示すために使用します。 :data:`Any` はある値が動的に型付けられることを示すために使用します。
ru: Используйте :class:`object`, чтобы указать, что значение может быть любого типа типобезопасным образом. Используйте :data:`Any`, чтобы указать, что значение является динамически типизированным.

source: Nominal vs structural subtyping
ja: 名前的部分型 vs 構造的部分型
ru: Номинальный и структурный подтипы

source: Initially :pep:`484` defined the Python static type system as using *nominal subtyping*. This means that a class ``A`` is allowed where a class ``B`` is expected if and only if ``A`` is a subclass of ``B``.
ja: 初めは :pep:`484` は Python の静的型システムを *名前的部分型* を使って定義していました。 名前的部分型とは、クラス ``B`` が期待されているところにクラス ``A`` が許容されるのは ``A`` が ``B`` のサブクラスの場合かつその場合に限る、ということです。
ru: Первоначально :pep:`484` определял систему статических типов Python как использующую *номинальное подтипирование*. Это означает, что класс ``A`` разрешен там, где ожидается класс ``B``, тогда и только тогда, когда ``A`` является подклассом ``B``.

source: This requirement previously also applied to abstract base classes, such as :class:`~collections.abc.Iterable`. The problem with this approach is that a class had to be explicitly marked to support them, which is unpythonic and unlike what one would normally do in idiomatic dynamically typed Python code. For example, this conforms to :pep:`484`::
ja: 前出の必要条件は、:class:`~collections.abc.Iterable` などの抽象基底クラスにも当て嵌まります。 この型付け手法の問題は、この手法をサポートするためにクラスに明確な型付けを行う必要があることで、これは pythonic ではなく、普段行っている 慣用的な Python コードへの動的型付けとは似ていません。 例えば、次のコードは :pep:`484` に従ったものです ::
ru: Ранее это требование также применялось к абстрактным базовым классам, таким как :class:`~collections.abc.Iterable`. Проблема с этим подходом заключается в том, что класс должен быть явно помечен для их поддержки, что является непитоническим и отличается от того, что обычно делается в идиоматическом динамически типизированном коде Python. Например, это соответствует :pep:`484`::

source: :pep:`544` allows to solve this problem by allowing users to write the above code without explicit base classes in the class definition, allowing ``Bucket`` to be implicitly considered a subtype of both ``Sized`` and ``Iterable[int]`` by static type checkers. This is known as *structural subtyping* (or static duck-typing)::
ja: :pep:`544` によって上にあるようなクラス定義で基底クラスを明示しないコードをユーザーが書け、静的型チェッカーで ``Bucket`` が ``Sized`` と ``Iterable[int]`` 両方のサブタイプだと暗黙的に見なせるようになり、この問題が解決しました。 これは *structural subtyping (構造的部分型)* (あるいは、静的ダックタイピング) として知られています::
ru: :pep:`544` позволяет решить эту проблему, позволяя пользователям писать приведенный выше код без явных базовых классов в определении класса, что позволяет неявно считать Bucket подтипом как ``Sized``, так и `` Iterable[int]`` с помощью средств проверки статических типов. Это известно как *структурное подтипирование* (или статическая утиная типизация)::

source: Moreover, by subclassing a special class :class:`Protocol`, a user can define new custom protocols to fully enjoy structural subtyping (see examples below).
ja: さらに、特別なクラス :class:`Protocol` のサブクラスを作ることで、新しい独自のプロトコルを作って構造的部分型というものを満喫できます。
ru: Более того, создав подкласс специального класса :class:`Protocol`, пользователь может определить новые пользовательские протоколы, чтобы в полной мере воспользоваться структурным подтипированием (см. примеры ниже).

source: Module contents
ja: モジュールの内容
ru: Содержимое модуля

source: The ``typing`` module defines the following classes, functions and decorators.
ru: Модуль ``typing`` определяет следующие классы, функции и декораторы.

source: Special typing primitives
ja: 特殊型付けプリミティブ
ru: Специальные примитивы типизации

source: Special types
ja: 特殊型
ru: Специальные типы

source: These can be used as types in annotations. They do not support subscription using ``[]``.
ru: Их можно использовать в качестве типов в аннотациях. Они не поддерживают подписку с использованием ``[]``.

source: Special type indicating an unconstrained type.
ja: 制約のない型であることを示す特別な型です。
ru: Специальный тип, указывающий на неограниченный тип.

source: Every type is compatible with :data:`Any`.
ja: 任意の型は :data:`Any` と互換です。
ru: Каждый тип совместим с :data:`Any`.

source: :data:`Any` is compatible with every type.
ja: :data:`Any` は任意の型と互換です。
ru: :data:`Любой` совместим со всеми типами.

source: :data:`Any` can now be used as a base class. This can be useful for avoiding type checker errors with classes that can duck type anywhere or are highly dynamic.
ru: :data:`Any` теперь можно использовать в качестве базового класса. Это может быть полезно для предотвращения ошибок проверки типов в классах, которые могут уклоняться от ввода где угодно или являются очень динамичными.

source: A :ref:`constrained type variable <typing-constrained-typevar>`.
ru: Переменная ограниченного типа <typing-constrained-typevar>.

source: Definition::
ru: Определение::

source: ``AnyStr`` is meant to be used for functions that may accept :class:`str` or :class:`bytes` arguments but cannot allow the two to mix.
ru: ``AnyStr`` предназначен для использования с функциями, которые могут принимать аргументы :class:`str` или :class:`bytes`, но не могут допускать их смешивания.

source: For example::
ja: 例えば::
ru: Например::

source: Note that, despite its name, ``AnyStr`` has nothing to do with the :class:`Any` type, nor does it mean "any string". In particular, ``AnyStr`` and ``str | bytes`` are different from each other and have different use cases::
ru: Обратите внимание, что, несмотря на свое название, AnyStr не имеет ничего общего с типом :class:Any и не означает «любая строка». В частности, AnyStr и str | bytes`` отличаются друг от друга и имеют разные варианты использования::

source: Deprecated in favor of the new :ref:`type parameter syntax <type-params>`. Use ``class A[T: (str, bytes)]: ...`` instead of importing ``AnyStr``. See :pep:`695` for more details.
ru: Устарело в пользу нового :ref:`синтаксиса параметра типа <type-params>`. Используйте ``class A[T: (str, bytes)]: ...`` вместо импорта ``AnyStr``. См. :pep:`695` для более подробной информации.

source: In Python 3.16, ``AnyStr`` will be removed from ``typing.__all__``, and deprecation warnings will be emitted at runtime when it is accessed or imported from ``typing``. ``AnyStr`` will be removed from ``typing`` in Python 3.18.
ru: В Python 3.16 AnyStr будет удален из typing.__all__, а предупреждения об устаревании будут выдаваться во время выполнения, когда к нему обращаются или импортируют из typing. AnyStr будет удален из набора текста в Python 3.18.

source: Special type that includes only literal strings.
ru: Специальный тип, включающий только литеральные строки.

source: Any string literal is compatible with ``LiteralString``, as is another ``LiteralString``. However, an object typed as just ``str`` is not. A string created by composing ``LiteralString``-typed objects is also acceptable as a ``LiteralString``.
ru: Любой строковый литерал совместим с LiteralString, как и другой LiteralString. Однако объект, набранный просто как ``str``, таковым не является. Строка, созданная путем составления объектов типа LiteralString, также принимается как LiteralString.

source: Example:
ru: Пример:

source: ``LiteralString`` is useful for sensitive APIs where arbitrary user-generated strings could generate problems. For example, the two cases above that generate type checker errors could be vulnerable to an SQL injection attack.
ru: ``LiteralString`` полезен для чувствительных API, где произвольные строки, сгенерированные пользователем, могут вызвать проблемы. Например, два приведенных выше случая, в которых генерируются ошибки проверки типов, могут быть уязвимы для атаки с помощью SQL-инъекции.

source: See :pep:`675` for more details.
ru: См. :pep:`675` для более подробной информации.

source: :data:`!Never` and :data:`!NoReturn` represent the `bottom type <https://en.wikipedia.org/wiki/Bottom_type>`_, a type that has no members.
ru: :data:`!Never` и :data:`!NoReturn` представляют `нижний тип <https://en.wikipedia.org/wiki/Bottom_type>`_, тип, не имеющий членов.

source: They can be used to indicate that a function never returns, such as :func:`sys.exit`::
ru: Их можно использовать, чтобы указать, что функция никогда не возвращает результат, например :func:`sys.exit`::

source: Or to define a function that should never be called, as there are no valid arguments, such as :func:`assert_never`::
ru: Или определить функцию, которую никогда не следует вызывать из-за отсутствия допустимых аргументов, например :func:`assert_never`::

source: :data:`!Never` and :data:`!NoReturn` have the same meaning in the type system and static type checkers treat both equivalently.
ru: :data:`!Never` и :data:`!NoReturn` имеют одно и то же значение в системе типов, и средства проверки статических типов обрабатывают оба значения одинаково.

source: Added :data:`NoReturn`.
ru: Добавлено :data:`NoReturn`.

source: Added :data:`Never`.
ru: Добавлено :data:`Never`.

source: Special type to represent the current enclosed class.
ru: Специальный тип для представления текущего вложенного класса.

source: This annotation is semantically equivalent to the following, albeit in a more succinct fashion::
ru: Эта аннотация семантически эквивалентна следующей, хотя и в более краткой форме:

source: In general, if something returns ``self``, as in the above examples, you should use ``Self`` as the return annotation. If ``Foo.return_self`` was annotated as returning ``"Foo"``, then the type checker would infer the object returned from ``SubclassOfFoo.return_self`` as being of type ``Foo`` rather than ``SubclassOfFoo``.
ru: В общем, если что-то возвращает «self», как в приведенных выше примерах, вам следует использовать «Self» в качестве аннотации возврата. Если ``Foo.return_self`` был помечен как возвращающий ``"Foo"``, то средство проверки типов будет считать, что объект, возвращаемый из ``SubclassOfFoo.return_self``, имеет тип ``Foo``, а не `` ПодклассOfFoo``.

source: Other common use cases include:
ru: Другие распространенные случаи использования включают в себя:

source: :class:`classmethod`\s that are used as alternative constructors and return instances of the ``cls`` parameter.
ru: :class:`classmethod`\s, которые используются в качестве альтернативных конструкторов и возвращают экземпляры параметра ``cls``.

source: Annotating an :meth:`~object.__enter__` method which returns self.
ru: Аннотирование метода :meth:`~object.__enter__`, который возвращает self.

source: You should not use ``Self`` as the return annotation if the method is not guaranteed to return an instance of a subclass when the class is subclassed::
ru: Вам не следует использовать Self в качестве аннотации возврата, если метод не гарантированно возвращает экземпляр подкласса, когда класс является подклассом:

source: See :pep:`673` for more details.
ru: См. :pep:`673` для более подробной информации.

source: Special annotation for explicitly declaring a :ref:`type alias <type-aliases>`.
ru: Специальная аннотация для явного объявления :ref:`псевдонима типа <type-aliases>`.

source: ``TypeAlias`` is particularly useful on older Python versions for annotating aliases that make use of forward references, as it can be hard for type checkers to distinguish these from normal variable assignments:
ru: ``TypeAlias`` особенно полезен в старых версиях Python для аннотирования псевдонимов, использующих прямые ссылки, поскольку средствам проверки типов может быть сложно отличить их от обычных назначений переменных:

source: See :pep:`613` for more details.
ru: См. :pep:`613` для более подробной информации.

source: :data:`TypeAlias` is deprecated in favor of the :keyword:`type` statement, which creates instances of :class:`TypeAliasType` and which natively supports forward references. Note that while :data:`TypeAlias` and :class:`TypeAliasType` serve similar purposes and have similar names, they are distinct and the latter is not the type of the former. Removal of :data:`TypeAlias` is not currently planned, but users are encouraged to migrate to :keyword:`type` statements.
ru: :data:`TypeAlias` устарел в пользу оператора :keyword:`type`, который создает экземпляры :class:`TypeAliasType` и который изначально поддерживает прямые ссылки. Обратите внимание, что хотя :data:`TypeAlias` и :class:`TypeAliasType` служат схожим целям и имеют схожие имена, они различны, и последний не является типом первого. Удаление :data:`TypeAlias` в настоящее время не планируется, но пользователям рекомендуется перейти на операторы :keyword:`type`.

source: Special forms
ja: 特殊形式
ru: Специальные формы

source: These can be used as types in annotations. They all support subscription using ``[]``, but each has a unique syntax.
ru: Их можно использовать в качестве типов в аннотациях. Все они поддерживают подписку с использованием ``[]``, но каждый из них имеет уникальный синтаксис.

source: Union type; ``Union[X, Y]`` is equivalent to ``X | Y`` and means either X or Y.
ru: Тип союза; ``Union[X, Y]`` эквивалентен ``X | Y`` и означает либо X, либо Y.

source: To define a union, use e.g. ``Union[int, str]`` or the shorthand ``int | str``. Using that shorthand is recommended. Details:
ru: Чтобы определить объединение, используйте, например, ``Union[int, str]`` или сокращение ``int | ул``. Рекомендуется использовать это сокращение. Подробности:

source: The arguments must be types and there must be at least one.
ja: 引数は型でなければならず、少なくとも一つ必要です。
ru: Аргументы должны быть типами, и их должен быть хотя бы один.

source: Unions of unions are flattened, e.g.::
ja: ユニオン型のユニオン型は平滑化されます。例えば::
ru: Союзы союзов сглаживаются, например::

source: Unions of a single argument vanish, e.g.::
ja: 引数が一つのユニオン型は消えます。例えば::
ru: Объединения одного аргумента исчезают, например::

source: Redundant arguments are skipped, e.g.::
ja: 冗長な実引数は飛ばされます。例えば::
ru: Лишние аргументы пропускаются, например::

source: When comparing unions, the argument order is ignored, e.g.::
ja: ユニオン型を比較するとき引数の順序は無視されます。例えば::
ru: При сравнении объединений порядок аргументов игнорируется, например::

source: You cannot subclass or instantiate a ``Union``.
ru: Вы не можете создать подкласс или создать экземпляр ``Union``.

source: You cannot write ``Union[X][Y]``.
ja: ``Union[X][Y]`` と書くことは出来ません。
ru: Вы не можете написать ``Union[X][Y]``.

source: Don't remove explicit subclasses from unions at runtime.
ja: 明示的に書かれているサブクラスを、実行時に直和型から取り除かなくなりました。
ru: Не удаляйте явные подклассы из объединений во время выполнения.

source: Unions can now be written as ``X | Y``. See :ref:`union type expressions<types-union>`.
ru: Объединения теперь можно записать как ``X | Й``. См. :ref:`выражения типов объединения<types-union>`.

source: ``Optional[X]`` is equivalent to ``X | None`` (or ``Union[X, None]``).
ru: ``Optional[X]`` эквивалентен ``X | None`` (или ``Union[X, None]``).

source: Note that this is not the same concept as an optional argument, which is one that has a default. An optional argument with a default does not require the ``Optional`` qualifier on its type annotation just because it is optional. For example::
ja: これがデフォルト値を持つオプション引数とは同じ概念ではないということに注意してください。 デフォルト値を持つオプション引数はオプション引数であるために、型アノテーションに ``Optional`` 修飾子は必要ありません。 例えば次のようになります::
ru: Обратите внимание, что это не то же самое, что необязательный аргумент, который имеет значение по умолчанию. Необязательный аргумент со значением по умолчанию не требует квалификатора «Optional» в аннотации его типа только потому, что он не является обязательным. Например::
