Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/typing.po
Languages: ja, ru

source: This returns the value unchanged. To the type checker this signals that the return value has the designated type, but at runtime we intentionally don't check anything (we want this to be as fast as possible).
ja: この関数は値を変更せずに返します。 型検査器に対して、返り値が指定された型を持っていることを通知しますが、実行時には意図的に何も検査しません。 (その理由は、処理をできる限り速くしたかったためです。)
ru: Это возвращает значение без изменений. Для средства проверки типов это сигнализирует о том, что возвращаемое значение имеет назначенный тип, но во время выполнения мы намеренно ничего не проверяем (мы хотим, чтобы это происходило как можно быстрее).

source: Ask a static type checker to confirm that *val* has an inferred type of *typ*.
ru: Попросите средство проверки статического типа подтвердить, что *val* имеет предполагаемый тип *typ*.

source: At runtime this does nothing: it returns the first argument unchanged with no checks or side effects, no matter the actual type of the argument.
ru: Во время выполнения это ничего не дает: он возвращает первый аргумент без изменений, без каких-либо проверок или побочных эффектов, независимо от фактического типа аргумента.

source: When a static type checker encounters a call to ``assert_type()``, it emits an error if the value is not of the specified type::
ru: Когда средство проверки статического типа встречает вызов ``assert_type()``, оно выдает ошибку, если значение не относится к указанному типу:

source: This function is useful for ensuring the type checker's understanding of a script is in line with the developer's intentions::
ru: Эта функция полезна для обеспечения того, чтобы средство проверки типов понимало сценарий в соответствии с намерениями разработчика:

source: Ask a static type checker to confirm that a line of code is unreachable.
ru: Попросите средство проверки статического типа подтвердить, что строка кода недоступна.

source: Example::
ru: Пример::

source: Here, the annotations allow the type checker to infer that the last case can never execute, because ``arg`` is either an :class:`int` or a :class:`str`, and both options are covered by earlier cases.
ru: Здесь аннотации позволяют средству проверки типов сделать вывод, что последний вариант никогда не может быть выполнен, поскольку ``arg`` является либо :class:`int`, либо :class:`str`, и оба варианта охватываются более ранними случаями. .

source: If a type checker finds that a call to ``assert_never()`` is reachable, it will emit an error. For example, if the type annotation for ``arg`` was instead ``int | str | float``, the type checker would emit an error pointing out that ``unreachable`` is of type :class:`float`. For a call to ``assert_never`` to pass type checking, the inferred type of the argument passed in must be the bottom type, :data:`Never`, and nothing else.
ru: Если программа проверки типов обнаружит, что вызов ``assert_never()`` достижим, она выдаст ошибку. Например, если аннотация типа для ``arg`` вместо ``int | ул | float``, программа проверки типов выдаст ошибку, указывающую, что ``unreachable`` имеет тип :class:`float`. Чтобы вызов ``assert_never`` прошел проверку типа, предполагаемый тип переданного аргумента должен быть нижним типом, :data:`Never`, и никаким другим.

source: At runtime, this throws an exception when called.
ru: Во время выполнения при вызове выдается исключение.

source: Ask a static type checker to reveal the inferred type of an expression.
ru: Попросите средство проверки статического типа выявить предполагаемый тип выражения.

source: When a static type checker encounters a call to this function, it emits a diagnostic with the inferred type of the argument. For example::
ru: Когда средство проверки статического типа встречает вызов этой функции, оно выдает диагностику с предполагаемым типом аргумента. Например::

source: This can be useful when you want to debug how your type checker handles a particular piece of code.
ru: Это может быть полезно, если вы хотите отладить, как ваша программа проверки типов обрабатывает определенный фрагмент кода.

source: At runtime, this function prints the runtime type of its argument to :data:`sys.stderr` and returns the argument unchanged (allowing the call to be used within an expression)::
ru: Во время выполнения эта функция печатает тип времени выполнения своего аргумента в :data:`sys.stderr` и возвращает аргумент без изменений (что позволяет использовать вызов внутри выражения)::

source: Note that the runtime type may be different from (more or less specific than) the type statically inferred by a type checker.
ru: Обратите внимание, что тип среды выполнения может отличаться (более или менее конкретный) от типа, статически выведенного средством проверки типов.

source: Most type checkers support ``reveal_type()`` anywhere, even if the name is not imported from ``typing``. Importing the name from ``typing``, however, allows your code to run without runtime errors and communicates intent more clearly.
ru: Большинство средств проверки типов поддерживают ``reveal_type()`` где угодно, даже если имя не импортировано из ``типирования``. Однако импорт имени из ``набора`` позволяет вашему коду работать без ошибок во время выполнения и более четко передавать намерения.

source: Decorator to mark an object as providing :func:`dataclass <dataclasses.dataclass>`-like behavior.
ru: Декоратор, позволяющий пометить объект как обеспечивающий поведение, подобное :func:`dataclass <dataclasses.dataclass>`.

source: ``dataclass_transform`` may be used to decorate a class, metaclass, or a function that is itself a decorator. The presence of ``@dataclass_transform()`` tells a static type checker that the decorated object performs runtime "magic" that transforms a class in a similar way to :func:`@dataclasses.dataclass <dataclasses.dataclass>`.
ru: ``dataclass_transform`` может использоваться для украшения класса, метакласса или функции, которая сама является декоратором. Наличие ``@dataclass_transform()`` сообщает средству проверки статического типа, что декорированный объект выполняет "магию" во время выполнения, которая преобразует класс аналогично :func:`@dataclasses.dataclass <dataclasses.dataclass>`.

source: Example usage with a decorator function:
ru: Пример использования с функцией декоратора:

source: On a base class::
ru: В базовом классе::

source: On a metaclass::
ru: В метаклассе::

source: The ``CustomerModel`` classes defined above will be treated by type checkers similarly to classes created with :func:`@dataclasses.dataclass <dataclasses.dataclass>`. For example, type checkers will assume these classes have ``__init__`` methods that accept ``id`` and ``name``.
ru: Определенные выше классы ``CustomerModel`` будут обрабатываться средствами проверки типов аналогично классам, созданным с помощью :func:`@dataclasses.dataclass <dataclasses.dataclass>`. Например, средства проверки типов предполагают, что эти классы имеют методы ``__init__``, которые принимают ``id`` и ``name``.

source: The decorated class, metaclass, or function may accept the following bool arguments which type checkers will assume have the same effect as they would have on the :func:`@dataclasses.dataclass<dataclasses.dataclass>` decorator: ``init``, ``eq``, ``order``, ``unsafe_hash``, ``frozen``, ``match_args``, ``kw_only``, and ``slots``. It must be possible for the value of these arguments (``True`` or ``False``) to be statically evaluated.
ru: Декорированный класс, метакласс или функция могут принимать следующие логические аргументы, которые, как предполагают средства проверки типов, будут иметь тот же эффект, что и для декоратора :func:`@dataclasses.dataclass<dataclasses.dataclass>`: ``init`` , ``eq``, ``order``, ``unsafe_hash``, ``frozen``, ``match_args``, ``kw_only`` и ``slots``. Должна быть предусмотрена возможность статической оценки значения этих аргументов («True» или «False»).

source: Parameters
ru: Параметры

source: Indicates whether the ``eq`` parameter is assumed to be ``True`` or ``False`` if it is omitted by the caller. Defaults to ``True``.
ru: Указывает, будет ли параметр eq иметь значение True или False, если он опущен вызывающей стороной. По умолчанию установлено ``True``.

source: Indicates whether the ``order`` parameter is assumed to be ``True`` or ``False`` if it is omitted by the caller. Defaults to ``False``.
ru: Указывает, будет ли параметр order иметь значение True или False, если он опущен вызывающей стороной. По умолчанию установлено значение «False».

source: Indicates whether the ``kw_only`` parameter is assumed to be ``True`` or ``False`` if it is omitted by the caller. Defaults to ``False``.
ru: Указывает, будет ли параметр kw_only иметь значение True или False, если он опущен вызывающей стороной. По умолчанию установлено значение «False».

source: Indicates whether the ``frozen`` parameter is assumed to be ``True`` or ``False`` if it is omitted by the caller. Defaults to ``False``. .. versionadded:: 3.12
ru: Указывает, будет ли параметр «frozen» иметь значение «True» или «False», если он опущен вызывающей стороной. По умолчанию установлено значение «False». .. версия добавлена:: 3.12

source: Indicates whether the ``frozen`` parameter is assumed to be ``True`` or ``False`` if it is omitted by the caller. Defaults to ``False``.
ru: Указывает, будет ли параметр «frozen» иметь значение «True» или «False», если он опущен вызывающей стороной. По умолчанию установлено значение «False».

source: Specifies a static list of supported classes or functions that describe fields, similar to :func:`dataclasses.field`. Defaults to ``()``.
ru: Задает статический список поддерживаемых классов или функций, описывающих поля, аналогично :func:`dataclasses.field`. По умолчанию ``()``.

source: Arbitrary other keyword arguments are accepted in order to allow for possible future extensions.
ru: Принимаются произвольные аргументы других ключевых слов, чтобы обеспечить возможность возможных расширений в будущем.

source: Type checkers recognize the following optional parameters on field specifiers:
ru: Средства проверки типов распознают следующие дополнительные параметры в спецификаторах полей:

source: **Recognised parameters for field specifiers**
ru: **Распознанные параметры для спецификаторов полей**

source: Parameter name
ru: Имя параметра

source: Description
ru: Описание

source: Indicates whether the field should be included in the synthesized ``__init__`` method. If unspecified, ``init`` defaults to ``True``.
ru: Указывает, должно ли поле быть включено в синтезируемый метод ``__init__``. Если не указано, ``init`` по умолчанию имеет значение ``True``.

source: Provides the default value for the field.
ru: Предоставляет значение по умолчанию для поля.

source: Provides a runtime callback that returns the default value for the field. If neither ``default`` nor ``default_factory`` are specified, the field is assumed to have no default value and must be provided a value when the class is instantiated.
ru: Предоставляет обратный вызов во время выполнения, который возвращает значение по умолчанию для поля. Если ни ``default``, ни ``default_factory`` не указаны, предполагается, что поле не имеет значения по умолчанию, и ему должно быть предоставлено значение при создании экземпляра класса.

source: An alias for the ``default_factory`` parameter on field specifiers.
ru: Псевдоним параметра default_factory в спецификаторах полей.

source: Indicates whether the field should be marked as keyword-only. If ``True``, the field will be keyword-only. If ``False``, it will not be keyword-only. If unspecified, the value of the ``kw_only`` parameter on the object decorated with ``dataclass_transform`` will be used, or if that is unspecified, the value of ``kw_only_default`` on ``dataclass_transform`` will be used.
ru: Указывает, следует ли пометить поле как предназначенное только для ключевых слов. Если ``True``, поле будет содержать только ключевые слова. Если ``False``, оно не будет состоять только из ключевых слов. Если не указано, будет использоваться значение параметра kw_only для объекта, украшенного dataclass_transform, или, если оно не указано, будет использоваться значение kw_only_default для dataclass_transform. .

source: Provides an alternative name for the field. This alternative name is used in the synthesized ``__init__`` method.
ru: Предоставляет альтернативное имя для поля. Это альтернативное имя используется в синтезированном методе ``__init__``.

source: At runtime, this decorator records its arguments in the ``__dataclass_transform__`` attribute on the decorated object. It has no other runtime effect.
ru: Во время выполнения этот декоратор записывает свои аргументы в атрибут ``__dataclass_transform__`` декорируемого объекта. Никакого другого эффекта во время выполнения он не имеет.

source: See :pep:`681` for more details.
ru: См. :pep:`681` для более подробной информации.

source: Decorator for creating overloaded functions and methods.
ru: Декоратор для создания перегруженных функций и методов.

source: The ``@overload`` decorator allows describing functions and methods that support multiple different combinations of argument types. A series of ``@overload``-decorated definitions must be followed by exactly one non-``@overload``-decorated definition (for the same function/method).
ru: Декоратор @overload позволяет описывать функции и методы, которые поддерживают несколько различных комбинаций типов аргументов. За серией определений, декорированных ``@overload``, должно следовать ровно одно определение, не декорированное ``@overload`` (для той же функции/метода).

source: ``@overload``-decorated definitions are for the benefit of the type checker only, since they will be overwritten by the non-``@overload``-decorated definition. The non-``@overload``-decorated definition, meanwhile, will be used at runtime but should be ignored by a type checker. At runtime, calling an ``@overload``-decorated function directly will raise :exc:`NotImplementedError`.
ru: Определения, декорированные ``@overload``, приносят пользу только средству проверки типов, поскольку они будут перезаписаны определениями, не украшенными ``@overload``. Тем временем определение, не декорированное ``@overload``, будет использоваться во время выполнения, но должно игнорироваться средством проверки типов. Во время выполнения прямой вызов функции, декорированной ``@overload``, вызовет :exc:`NotImplementedError`.

source: An example of overload that gives a more precise type than can be expressed using a union or a type variable:
ru: Пример перегрузки, которая дает более точный тип, чем можно выразить с помощью объединения или переменной типа:

source: See :pep:`484` for more details and comparison with other typing semantics.
ru: См. :pep:`484` для получения более подробной информации и сравнения с другими семантиками ввода.

source: Overloaded functions can now be introspected at runtime using :func:`get_overloads`.
ru: Перегруженные функции теперь можно анализировать во время выполнения с помощью :func:`get_overloads`.

source: Return a sequence of :func:`@overload <overload>`-decorated definitions for *func*.
ru: Возвращает последовательность определений, оформленных :func:`@overload <overload>` для *func*.

source: *func* is the function object for the implementation of the overloaded function. For example, given the definition of ``process`` in the documentation for :func:`@overload <overload>`, ``get_overloads(process)`` will return a sequence of three function objects for the three defined overloads. If called on a function with no overloads, ``get_overloads()`` returns an empty sequence.
ru: *func* — это функциональный объект для реализации перегруженной функции. Например, учитывая определение ``process`` в документации для :func:`@overload <overload>`, ``get_overloads(process)`` вернет последовательность из трех функциональных объектов для трех определенных перегрузок. Если вызывается функция без перегрузок, get_overloads() возвращает пустую последовательность.

source: ``get_overloads()`` can be used for introspecting an overloaded function at runtime.
ru: ``get_overloads()`` можно использовать для анализа перегруженной функции во время выполнения.

source: Clear all registered overloads in the internal registry.
ru: Очистите все зарегистрированные перегрузки во внутреннем реестре.

source: This can be used to reclaim the memory used by the registry.
ru: Это можно использовать для освобождения памяти, используемой реестром.

source: Decorator to indicate final methods and final classes.
ru: Декоратор для указания финальных методов и финальных классов.

source: Decorating a method with ``@final`` indicates to a type checker that the method cannot be overridden in a subclass. Decorating a class with ``@final`` indicates that it cannot be subclassed.
ru: Украшение метода @final указывает средству проверки типов, что метод не может быть переопределен в подклассе. Украшение класса @final указывает на то, что он не может быть подклассом.

source: The decorator will now attempt to set a ``__final__`` attribute to ``True`` on the decorated object. Thus, a check like ``if getattr(obj, "__final__", False)`` can be used at runtime to determine whether an object ``obj`` has been marked as final. If the decorated object does not support setting attributes, the decorator returns the object unchanged without raising an exception.
ru: Декоратор теперь попытается установить атрибут ``__final__`` в ``True`` на декорируемом объекте. Таким образом, проверка типа ``if getattr(obj, "__final__", False)`` может использоваться во время выполнения, чтобы определить, был ли объект ``obj`` помечен как окончательный. Если декорированный объект не поддерживает установку атрибутов, декоратор возвращает объект без изменений, не вызывая исключения.

source: Decorator to indicate that annotations are not type hints.
ja: アノテーションが型ヒントでないことを示すデコレータです。
ru: Декоратор, указывающий, что аннотации не являются подсказками типа.

source: This works as a class or function :term:`decorator`. With a class, it applies recursively to all methods and classes defined in that class (but not to methods defined in its superclasses or subclasses). Type checkers will ignore all annotations in a function or class with this decorator.
ru: Это работает как класс или функция :term:`decorator`. В случае с классом он применяется рекурсивно ко всем методам и классам, определенным в этом классе (но не к методам, определенным в его суперклассах или подклассах). Средства проверки типов будут игнорировать все аннотации в функции или классе с помощью этого декоратора.

source: ``@no_type_check`` mutates the decorated object in place.
ru: ``@no_type_check`` изменяет декорированный объект на месте.

source: Decorator to give another decorator the :func:`no_type_check` effect.
ja: 別のデコレータに :func:`no_type_check` の効果を与えるデコレータです。
ru: Декоратор, чтобы дать другому декоратору эффект :func:`no_type_check`.

source: This wraps the decorator with something that wraps the decorated function in :func:`no_type_check`.
ja: これは何かの関数をラップするデコレータを :func:`no_type_check` でラップします。
ru: Это оборачивает декоратор чем-то, что оборачивает декорируемую функцию в :func:`no_type_check`.

source: No type checker ever added support for ``@no_type_check_decorator``. It is therefore deprecated, and will be removed in Python 3.15.
ru: Ни одна программа проверки типов никогда не добавляла поддержку ``@no_type_check_decorator``. Поэтому он устарел и будет удален в Python 3.15.

source: Decorator to indicate that a method in a subclass is intended to override a method or attribute in a superclass.
ru: Декоратор, указывающий, что метод в подклассе предназначен для переопределения метода или атрибута в суперклассе.

source: Type checkers should emit an error if a method decorated with ``@override`` does not, in fact, override anything. This helps prevent bugs that may occur when a base class is changed without an equivalent change to a child class.
ru: Средства проверки типов должны выдавать ошибку, если метод, украшенный @override, фактически ничего не переопределяет. Это помогает предотвратить ошибки, которые могут возникнуть при изменении базового класса без эквивалентного изменения дочернего класса.

source: There is no runtime checking of this property.
ru: Проверка этого свойства во время выполнения не выполняется.

source: The decorator will attempt to set an ``__override__`` attribute to ``True`` on the decorated object. Thus, a check like ``if getattr(obj, "__override__", False)`` can be used at runtime to determine whether an object ``obj`` has been marked as an override. If the decorated object does not support setting attributes, the decorator returns the object unchanged without raising an exception.
ru: Декоратор попытается установить атрибут ``__override__`` в ``True`` на декорируемом объекте. Таким образом, проверка типа ``if getattr(obj, "__override__", False)`` может использоваться во время выполнения, чтобы определить, был ли объект ``obj`` помечен как переопределяющий. Если декорированный объект не поддерживает установку атрибутов, декоратор возвращает объект без изменений, не вызывая исключения.

source: See :pep:`698` for more details.
ru: См. :pep:`698` для более подробной информации.

source: Decorator to mark a class or function as unavailable at runtime.
ru: Декоратор, позволяющий пометить класс или функцию как недоступные во время выполнения.

source: This decorator is itself not available at runtime. It is mainly intended to mark classes that are defined in type stub files if an implementation returns an instance of a private class::
ja: このデコレータ自身は実行時には使えません。 このデコレータは主に、実装がプライベートクラスのインスタンスを返す場合に、型スタブファイルに定義されているクラスに対して印を付けるためのものです::
ru: Этот декоратор сам по себе недоступен во время выполнения. В основном он предназначен для маркировки классов, определенных в файлах-заглушках типов, если реализация возвращает экземпляр частного класса::

source: Note that returning instances of private classes is not recommended. It is usually preferable to make such classes public.
ja: プライベートクラスのインスタンスを返すのは推奨されません。 そのようなクラスは公開クラスにするのが望ましいです。
ru: Обратите внимание, что возвращать экземпляры частных классов не рекомендуется. Обычно предпочтительнее сделать такие классы общедоступными.

source: Introspection helpers
ru: Помощники самоанализа

source: Return a dictionary containing type hints for a function, method, module or class object.
ja: 関数、メソッド、モジュールまたはクラスのオブジェクトの型ヒントを含む辞書を返します。
ru: Возвращает словарь, содержащий подсказки типов для объекта функции, метода, модуля или класса.

source: This is often the same as ``obj.__annotations__``, but this function makes the following changes to the annotations dictionary:
ru: Часто это то же самое, что obj.__annotations__, но эта функция вносит следующие изменения в словарь аннотаций:

source: Forward references encoded as string literals or :class:`ForwardRef` objects are handled by evaluating them in *globalns*, *localns*, and (where applicable) *obj*'s :ref:`type parameter <type-params>` namespace. If *globalns* or *localns* is not given, appropriate namespace dictionaries are inferred from *obj*.
ru: Прямые ссылки, закодированные как строковые литералы или объекты :class:`ForwardRef`, обрабатываются путем их оценки в *globalns*, *localns* и (где применимо) *obj* в :ref:`type параметре <type-params>` пространство имен. Если *globalns* или *localns* не заданы, соответствующие словари пространств имен извлекаются из *obj*.

source: ``None`` is replaced with :class:`types.NoneType`.
ru: ``None`` заменяется на :class:`types.NoneType`.

source: If :func:`@no_type_check <no_type_check>` has been applied to *obj*, an empty dictionary is returned.
ru: Если :func:`@no_type_check <no_type_check>` был применен к *obj*, возвращается пустой словарь.
