Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/typing.po
Languages: ja, ru

source: In fact, ``Unpack`` can be used interchangeably with ``*`` in the context of :class:`typing.TypeVarTuple <TypeVarTuple>` and :class:`builtins.tuple <tuple>` types. You might see ``Unpack`` being used explicitly in older versions of Python, where ``*`` couldn't be used in certain places::
ru: Фактически, ``Unpack`` можно использовать взаимозаменяемо с ``*`` в контексте типов :class:`typing.TypeVarTuple <TypeVarTuple>` и :class:`builtins.tuple <tuple>`. Вы можете увидеть явное использование ``Unpack`` в старых версиях Python, где ``*`` нельзя было использовать в определенных местах:

source: ``Unpack`` can also be used along with :class:`typing.TypedDict` for typing ``**kwargs`` in a function signature::
ru: ``Unpack`` также можно использовать вместе с :class:`typing.TypedDict` для ввода ``**kwargs`` в сигнатуре функции::

source: See :pep:`692` for more details on using ``Unpack`` for ``**kwargs`` typing.
ru: См. :pep:`692` для получения более подробной информации об использовании ``Unpack`` для ввода ``**kwargs``.

source: Building generic types and type aliases
ru: Создание универсальных типов и псевдонимов типов

source: The following classes should not be used directly as annotations. Their intended purpose is to be building blocks for creating generic types and type aliases.
ru: Следующие классы не следует использовать непосредственно в качестве аннотаций. Их предполагаемая цель — стать строительными блоками для создания универсальных типов и псевдонимов типов.

source: These objects can be created through special syntax (:ref:`type parameter lists <type-params>` and the :keyword:`type` statement). For compatibility with Python 3.11 and earlier, they can also be created without the dedicated syntax, as documented below.
ru: Эти объекты могут быть созданы с помощью специального синтаксиса (:ref:`списки параметров типа <type-params>` и оператор :keyword:`type`). Для совместимости с Python 3.11 и более ранними версиями их также можно создавать без специального синтаксиса, как описано ниже.

source: Abstract base class for generic types.
ja: ジェネリック型のための抽象基底クラスです。
ru: Абстрактный базовый класс для универсальных типов.

source: A generic type is typically declared by adding a list of type parameters after the class name::
ru: Универсальный тип обычно объявляется путем добавления списка параметров типа после имени класса:

source: Such a class implicitly inherits from ``Generic``. The runtime semantics of this syntax are discussed in the :ref:`Language Reference <generic-classes>`.
ru: Такой класс неявно наследуется от Generic. Семантика этого синтаксиса во время выполнения обсуждается в :ref:`Справочнике по языку <generic-classes>`.

source: This class can then be used as follows::
ja: このクラスは次のように使用することが出来ます::
ru: Затем этот класс можно использовать следующим образом:

source: Here the brackets after the function name indicate a :ref:`generic function <generic-functions>`.
ru: Здесь скобки после имени функции обозначают :ref:`универсальную функцию <generic-functions>`.

source: For backwards compatibility, generic classes can also be declared by explicitly inheriting from ``Generic``. In this case, the type parameters must be declared separately::
ru: Для обратной совместимости универсальные классы также могут быть объявлены путем явного наследования от Generic. В этом случае параметры типа необходимо объявить отдельно:

source: Type variable.
ja: 型変数です。
ru: Тип переменной.

source: The preferred way to construct a type variable is via the dedicated syntax for :ref:`generic functions <generic-functions>`, :ref:`generic classes <generic-classes>`, and :ref:`generic type aliases <generic-type-aliases>`::
ru: Предпочтительный способ создания переменной типа — использование специального синтаксиса для :ref:`универсальных функций <generic-functions>`, :ref:`универсальных классов <generic-classes>` и :ref:`универсальных псевдонимов типов <generic -type-aliases>`::

source: This syntax can also be used to create bound and constrained type variables::
ru: Этот синтаксис также можно использовать для создания переменных связанного и ограниченного типа:

source: However, if desired, reusable type variables can also be constructed manually, like so::
ru: Однако при желании переменные типа многократного использования также можно создать вручную, например:

source: Type variables exist primarily for the benefit of static type checkers. They serve as the parameters for generic types as well as for generic function and type alias definitions. See :class:`Generic` for more information on generic types. Generic functions work as follows::
ru: Переменные типа существуют в первую очередь для целей проверки статических типов. Они служат параметрами для универсальных типов, а также для определений универсальных функций и псевдонимов типов. См. :class:`Generic` для получения дополнительной информации об универсальных типах. Общие функции работают следующим образом:

source: Note that type variables can be *bound*, *constrained*, or neither, but cannot be both bound *and* constrained.
ru: Обратите внимание, что переменные типа могут быть *связанными*, *ограниченными* или ни одним из них, но не могут быть одновременно *связанными* и* ограниченными.

source: The variance of type variables is inferred by type checkers when they are created through the :ref:`type parameter syntax <type-params>` or when ``infer_variance=True`` is passed. Manually created type variables may be explicitly marked covariant or contravariant by passing ``covariant=True`` or ``contravariant=True``. By default, manually created type variables are invariant. See :pep:`484` and :pep:`695` for more details.
ru: Отклонение переменных типа выводится средствами проверки типов, когда они создаются с помощью синтаксиса параметра типа <type-params>` или когда передается ``infer_variance=True``. Переменные типа, созданные вручную, можно явно пометить как ковариантные или контравариантные, передав ``covariant=True`` или ``contravariant=True``. По умолчанию переменные типа, созданные вручную, являются инвариантными. См. :pep:`484` и :pep:`695` для более подробной информации.

source: Bound type variables and constrained type variables have different semantics in several important ways. Using a *bound* type variable means that the ``TypeVar`` will be solved using the most specific type possible::
ru: Переменные связанного типа и переменные ограниченного типа имеют разную семантику по нескольким важным причинам. Использование переменной типа *bound* означает, что TypeVar будет решен с использованием наиболее конкретного возможного типа::

source: Type variables can be bound to concrete types, abstract types (ABCs or protocols), and even unions of types::
ru: Переменные типа могут быть привязаны к конкретным типам, абстрактным типам (ABC или протоколам) и даже к объединениям типов:

source: Using a *constrained* type variable, however, means that the ``TypeVar`` can only ever be solved as being exactly one of the constraints given::
ru: Однако использование переменной типа *constrained* означает, что ``TypeVar`` может быть решена только как одно из заданных ограничений:

source: At runtime, ``isinstance(x, T)`` will raise :exc:`TypeError`.
ru: Во время выполнения ``isinstance(x, T)`` вызовет :exc:`TypeError`.

source: The name of the type variable.
ru: Имя переменной типа.

source: Whether the type var has been explicitly marked as covariant.
ru: Был ли тип var явно помечен как ковариантный.

source: Whether the type var has been explicitly marked as contravariant.
ru: Был ли тип var явно помечен как контравариантный.

source: Whether the type variable's variance should be inferred by type checkers.
ru: Должна ли дисперсия переменной типа определяться средствами проверки типов.

source: The bound of the type variable, if any.
ru: Граница переменной типа, если таковая имеется.

source: For type variables created through :ref:`type parameter syntax <type-params>`, the bound is evaluated only when the attribute is accessed, not when the type variable is created (see :ref:`lazy-evaluation`).
ru: Для переменных типа, созданных с помощью :ref:`синтаксиса параметра типа <type-params>`, привязка оценивается только при доступе к атрибуту, а не при создании переменной типа (см. :ref:`lazy-evaluation`).

source: A tuple containing the constraints of the type variable, if any.
ru: Кортеж, содержащий ограничения переменной типа, если таковые имеются.

source: For type variables created through :ref:`type parameter syntax <type-params>`, the constraints are evaluated only when the attribute is accessed, not when the type variable is created (see :ref:`lazy-evaluation`).
ru: Для переменных типа, созданных с помощью :ref:`синтаксиса параметра типа <type-params>`, ограничения оцениваются только при доступе к атрибуту, а не при создании переменной типа (см. :ref:`lazy-evaluation`).

source: The default value of the type variable, or :data:`typing.NoDefault` if it has no default.
ru: Значение по умолчанию для переменной типа или :data:`typing.NoDefault`, если у нее нет значения по умолчанию.

source: Return whether or not the type variable has a default value. This is equivalent to checking whether :attr:`__default__` is not the :data:`typing.NoDefault` singleton, except that it does not force evaluation of the :ref:`lazily evaluated <lazy-evaluation>` default value.
ru: Возвращает значение, указывающее, имеет ли переменная типа значение по умолчанию. Это эквивалентно проверке того, не является ли :attr:`__default__` синглтоном :data:`typing.NoDefault`, за исключением того, что это не приводит к принудительному вычислению :ref:`лениво оцениваемого значения <lazy-evaluation>` по умолчанию.

source: Type variables can now be declared using the :ref:`type parameter <type-params>` syntax introduced by :pep:`695`. The ``infer_variance`` parameter was added.
ru: Переменные типа теперь можно объявлять с использованием синтаксиса параметра типа <type-params>, введенного в :pep:`695`. Добавлен параметр infer_variance.

source: Support for default values was added.
ru: Добавлена ​​поддержка значений по умолчанию.

source: Type variable tuple. A specialized form of :ref:`type variable <typevar>` that enables *variadic* generics.
ru: Введите кортеж переменной. Специализированная форма :ref:`переменной типа <typevar>`, которая позволяет использовать *вариативные* дженерики.

source: Type variable tuples can be declared in :ref:`type parameter lists <type-params>` using a single asterisk (``*``) before the name::
ru: Кортежи переменных типа могут быть объявлены в списках параметров типа <type-params>`, используя одну звездочку (``*``) перед именем::

source: Or by explicitly invoking the ``TypeVarTuple`` constructor::
ru: Или явным вызовом конструктора TypeVarTuple::

source: A normal type variable enables parameterization with a single type. A type variable tuple, in contrast, allows parameterization with an *arbitrary* number of types by acting like an *arbitrary* number of type variables wrapped in a tuple. For example::
ru: Переменная обычного типа позволяет параметризовать один тип. Кортеж переменных типа, напротив, позволяет параметризовать *произвольное* количество типов, действуя как *произвольное* количество переменных типа, заключенных в кортеж. Например::

source: Note the use of the unpacking operator ``*`` in ``tuple[T, *Ts]``. Conceptually, you can think of ``Ts`` as a tuple of type variables ``(T1, T2, ...)``. ``tuple[T, *Ts]`` would then become ``tuple[T, *(T1, T2, ...)]``, which is equivalent to ``tuple[T, T1, T2, ...]``. (Note that in older versions of Python, you might see this written using :data:`Unpack <Unpack>` instead, as ``Unpack[Ts]``.)
ru: Обратите внимание на использование оператора распаковки ``*`` в ``tuple[T, *Ts]``. Концептуально, вы можете думать о «Ts» как о кортеже переменных типа «(T1, T2, ...)». ``tuple[T, *Ts]`` тогда превратится в ``tuple[T, *(T1, T2, ...)]``, что эквивалентно ``tuple[T, T1, T2, .. .]``. (Обратите внимание, что в более старых версиях Python вы можете увидеть это, написанное с использованием :data:`Unpack <Unpack>` вместо ``Unpack[Ts]``.)

source: Type variable tuples must *always* be unpacked. This helps distinguish type variable tuples from normal type variables::
ru: Кортежи переменных типа должны *всегда* быть распакованы. Это помогает отличить кортежи переменных типа от переменных обычного типа:

source: Type variable tuples can be used in the same contexts as normal type variables. For example, in class definitions, arguments, and return types::
ru: Кортежи переменных типа могут использоваться в тех же контекстах, что и переменные обычного типа. Например, в определениях классов, аргументах и ​​возвращаемых типах:

source: Type variable tuples can be happily combined with normal type variables:
ru: Кортежи переменных типа можно удачно комбинировать с переменными обычного типа:

source: However, note that at most one type variable tuple may appear in a single list of type arguments or type parameters::
ru: Однако обратите внимание, что не более одного кортежа переменных типа может присутствовать в одном списке аргументов типа или параметров типа:

source: Finally, an unpacked type variable tuple can be used as the type annotation of ``*args``::
ru: Наконец, кортеж переменных распакованного типа можно использовать в качестве аннотации типа ``*args``::

source: In contrast to non-unpacked annotations of ``*args`` - e.g. ``*args: int``, which would specify that *all* arguments are ``int`` - ``*args: *Ts`` enables reference to the types of the *individual* arguments in ``*args``. Here, this allows us to ensure the types of the ``*args`` passed to ``call_soon`` match the types of the (positional) arguments of ``callback``.
ru: В отличие от нераспакованных аннотаций ``*args`` - например, ``*args: int``, которые указывают, что *все* аргументы являются ``int`` - ``*args: *Ts`` включает ссылка на типы *индивидуальных* аргументов в ``*args``. Здесь это позволяет нам гарантировать, что типы ``*args``, передаваемые в ``call_soon``, соответствуют типам (позиционных) аргументов ``callback``.

source: See :pep:`646` for more details on type variable tuples.
ru: См. :pep:`646` для получения более подробной информации о кортежах переменных типа.

source: The name of the type variable tuple.
ru: Имя кортежа переменной типа.

source: The default value of the type variable tuple, or :data:`typing.NoDefault` if it has no default.
ru: Значение по умолчанию кортежа переменной типа или :data:`typing.NoDefault`, если у него нет значения по умолчанию.

source: Return whether or not the type variable tuple has a default value. This is equivalent to checking whether :attr:`__default__` is not the :data:`typing.NoDefault` singleton, except that it does not force evaluation of the :ref:`lazily evaluated <lazy-evaluation>` default value.
ru: Возвращает значение, указывающее, имеет ли кортеж переменной типа значение по умолчанию. Это эквивалентно проверке того, не является ли :attr:`__default__` синглтоном :data:`typing.NoDefault`, за исключением того, что это не приводит к принудительному вычислению :ref:`лениво оцениваемого значения <lazy-evaluation>` по умолчанию.

source: Type variable tuples can now be declared using the :ref:`type parameter <type-params>` syntax introduced by :pep:`695`.
ru: Кортежи переменных типа теперь могут быть объявлены с использованием синтаксиса параметра типа <type-params>, введенного в :pep:`695`.

source: Parameter specification variable. A specialized version of :ref:`type variables <typevar>`.
ru: Переменная спецификации параметра. Специализированная версия :ref:`переменных типа <typevar>`.

source: In :ref:`type parameter lists <type-params>`, parameter specifications can be declared with two asterisks (``**``)::
ru: В списках параметров типа <type-params>` спецификации параметров могут быть объявлены с помощью двух звездочек (``**``)::

source: For compatibility with Python 3.11 and earlier, ``ParamSpec`` objects can also be created as follows::
ru: Для совместимости с Python 3.11 и более ранними версиями объекты ParamSpec также можно создавать следующим образом:

source: Parameter specification variables exist primarily for the benefit of static type checkers. They are used to forward the parameter types of one callable to another callable -- a pattern commonly found in higher order functions and decorators. They are only valid when used in ``Concatenate``, or as the first argument to ``Callable``, or as parameters for user-defined Generics. See :class:`Generic` for more information on generic types.
ru: Переменные спецификации параметров существуют в первую очередь для целей проверки статических типов. Они используются для пересылки типов параметров одного вызываемого объекта в другой вызываемый объект — шаблон, обычно встречающийся в функциях и декораторах более высокого порядка. Они действительны только при использовании в ``Concatenate`` или в качестве первого аргумента ``Callable``, или в качестве параметров для пользовательских дженериков. См. :class:`Generic` для получения дополнительной информации об универсальных типах.

source: For example, to add basic logging to a function, one can create a decorator ``add_logging`` to log function calls. The parameter specification variable tells the type checker that the callable passed into the decorator and the new callable returned by it have inter-dependent type parameters::
ru: Например, чтобы добавить базовое ведение журнала к функции, можно создать декоратор add_logging для регистрации вызовов функций. Переменная спецификации параметра сообщает средству проверки типов, что вызываемый объект, переданный в декоратор, и новый вызываемый объект, возвращаемый им, имеют взаимозависимые параметры типа:

source: Without ``ParamSpec``, the simplest way to annotate this previously was to use a :class:`TypeVar` with bound ``Callable[..., Any]``. However this causes two problems:
ru: Без ``ParamSpec`` самым простым способом аннотировать это раньше было использование :class:`TypeVar` с привязкой ``Callable[..., Any]``. Однако это вызывает две проблемы:

source: The type checker can't type check the ``inner`` function because ``*args`` and ``**kwargs`` have to be typed :data:`Any`.
ru: Средство проверки типов не может проверить тип функции ``inner``, поскольку для ``*args`` и ``**kwargs`` необходимо ввести :data:`Any`.

source: :func:`~cast` may be required in the body of the ``add_logging`` decorator when returning the ``inner`` function, or the static type checker must be told to ignore the ``return inner``.
ru: :func:`~cast` может потребоваться в теле декоратора ``add_logging`` при возврате ``inner`` функции, или необходимо указать средству проверки статического типа игнорировать ``return Internal``.

source: Since ``ParamSpec`` captures both positional and keyword parameters, ``P.args`` and ``P.kwargs`` can be used to split a ``ParamSpec`` into its components. ``P.args`` represents the tuple of positional parameters in a given call and should only be used to annotate ``*args``. ``P.kwargs`` represents the mapping of keyword parameters to their values in a given call, and should be only be used to annotate ``**kwargs``. Both attributes require the annotated parameter to be in scope. At runtime, ``P.args`` and ``P.kwargs`` are instances respectively of :class:`ParamSpecArgs` and :class:`ParamSpecKwargs`.
ru: Поскольку ParamSpec захватывает как позиционные, так и ключевые параметры, P.args и P.kwargs можно использовать для разделения ParamSpec на компоненты. ``P.args`` представляет собой кортеж позиционных параметров в данном вызове и должен использоваться только для аннотации ``*args``. ``P.kwargs`` представляет собой сопоставление параметров ключевого слова с их значениями в данном вызове и должен использоваться только для аннотирования ``**kwargs``. Оба атрибута требуют, чтобы аннотированный параметр находился в области видимости. Во время выполнения P.args и P.kwargs являются экземплярами :class:`ParamSpecArgs` и :class:`ParamSpecKwargs` соответственно.

source: The name of the parameter specification.
ru: Имя спецификации параметра.

source: The default value of the parameter specification, or :data:`typing.NoDefault` if it has no default.
ru: Значение по умолчанию спецификации параметра или :data:`typing.NoDefault`, если оно не имеет значения по умолчанию.

source: Return whether or not the parameter specification has a default value. This is equivalent to checking whether :attr:`__default__` is not the :data:`typing.NoDefault` singleton, except that it does not force evaluation of the :ref:`lazily evaluated <lazy-evaluation>` default value.
ru: Возвращает значение, указывающее, имеет ли спецификация параметра значение по умолчанию. Это эквивалентно проверке того, не является ли :attr:`__default__` синглтоном :data:`typing.NoDefault`, за исключением того, что это не приводит к принудительному вычислению :ref:`лениво оцениваемого значения <lazy-evaluation>` по умолчанию.

source: Parameter specification variables created with ``covariant=True`` or ``contravariant=True`` can be used to declare covariant or contravariant generic types. The ``bound`` argument is also accepted, similar to :class:`TypeVar`. However the actual semantics of these keywords are yet to be decided.
ru: Переменные спецификации параметров, созданные с помощью ``covariant=True`` или ``contravariant=True``, могут использоваться для объявления ковариантных или контравариантных универсальных типов. Также принимается аргумент ``bound``, аналогичный :class:`TypeVar`. Однако фактическая семантика этих ключевых слов еще не определена.

source: Parameter specifications can now be declared using the :ref:`type parameter <type-params>` syntax introduced by :pep:`695`.
ru: Спецификации параметров теперь можно объявлять с использованием синтаксиса параметра типа <type-params>`, представленного в :pep:`695`.

source: Only parameter specification variables defined in global scope can be pickled.
ru: Можно травить только переменные спецификации параметров, определенные в глобальной области видимости.

source: Arguments and keyword arguments attributes of a :class:`ParamSpec`. The ``P.args`` attribute of a ``ParamSpec`` is an instance of ``ParamSpecArgs``, and ``P.kwargs`` is an instance of ``ParamSpecKwargs``. They are intended for runtime introspection and have no special meaning to static type checkers.
ru: Аргументы и атрибуты аргументов ключевого слова :class:`ParamSpec`. Атрибут P.args объекта ParamSpec является экземпляром ParamSpecArgs, а P.kwargs — экземпляром ParamSpecKwargs. Они предназначены для самоанализа во время выполнения и не имеют особого значения для средств проверки статических типов.

source: Calling :func:`get_origin` on either of these objects will return the original ``ParamSpec``:
ru: Вызов :func:`get_origin` для любого из этих объектов вернет исходный ``ParamSpec``:

source: The type of type aliases created through the :keyword:`type` statement.
ru: Тип псевдонимов типов, созданных с помощью оператора :keyword:`type`.

source: The name of the type alias:
ru: Имя псевдонима типа:

source: The module in which the type alias was defined::
ru: Модуль, в котором был определен псевдоним типа:

source: The type parameters of the type alias, or an empty tuple if the alias is not generic:
ru: Параметры типа псевдонима типа или пустой кортеж, если псевдоним не является универсальным:

source: The type alias's value. This is :ref:`lazily evaluated <lazy-evaluation>`, so names used in the definition of the alias are not resolved until the ``__value__`` attribute is accessed:
ru: Значение псевдонима типа. Это :ref:`лениво оцениваемая <lazy-evaluation>`, поэтому имена, используемые в определении псевдонима, не разрешаются до тех пор, пока не будет получен доступ к атрибуту ``__value__``:
