Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/typing.po
Languages: ja, ru

source: On the other hand, if an explicit value of ``None`` is allowed, the use of ``Optional`` is appropriate, whether the argument is optional or not. For example::
ja: それとは逆に、 ``None`` という値が許されていることが明示されている場合は、引数がオプションであろうとなかろうと、 ``Optional`` を使うのが好ましいです。 例えば次のようになります::
ru: С другой стороны, если разрешено явное значение «None», использование «Optional» уместно независимо от того, является ли аргумент необязательным или нет. Например::

source: Optional can now be written as ``X | None``. See :ref:`union type expressions<types-union>`.
ru: Необязательное теперь можно записать как ``X | Нет``. См. :ref:`выражения типов объединения<types-union>`.

source: Special form for annotating higher-order functions.
ru: Специальная форма для аннотирования функций высшего порядка.

source: ``Concatenate`` can be used in conjunction with :ref:`Callable <annotating-callables>` and :class:`ParamSpec` to annotate a higher-order callable which adds, removes, or transforms parameters of another callable. Usage is in the form ``Concatenate[Arg1Type, Arg2Type, ..., ParamSpecVariable]``. ``Concatenate`` is currently only valid when used as the first argument to a :ref:`Callable <annotating-callables>`. The last parameter to ``Concatenate`` must be a :class:`ParamSpec` or ellipsis (``...``).
ru: ``Concatenate`` можно использовать в сочетании с :ref:`Callable <annotating-callables>` и :class:`ParamSpec` для аннотирования вызываемого объекта более высокого порядка, который добавляет, удаляет или преобразует параметры другого вызываемого объекта. Использование имеет форму ``Объединить[Arg1Type, Arg2Type, ..., ParamSpecVariable]``. ``Объединение`` в настоящее время допустимо только при использовании в качестве первого аргумента для :ref:`Callable <annotating-callables>`. Последний параметр для ``Concatenate`` должен быть :class:`ParamSpec` или многоточием (``...``).

source: For example, to annotate a decorator ``with_lock`` which provides a :class:`threading.Lock` to the decorated function, ``Concatenate`` can be used to indicate that ``with_lock`` expects a callable which takes in a ``Lock`` as the first argument, and returns a callable with a different type signature. In this case, the :class:`ParamSpec` indicates that the returned callable's parameter types are dependent on the parameter types of the callable being passed in::
ru: Например, чтобы аннотировать декоратор with_lock, который предоставляет :class:`threading.Lock` декорируемой функции, можно использовать ``Concatenate``, чтобы указать, что ``with_lock`` ожидает вызываемый объект, который принимает ``Lock`` в качестве первого аргумента и возвращает вызываемый объект с сигнатурой другого типа. В этом случае :class:`ParamSpec` указывает, что типы параметров возвращаемого вызываемого объекта зависят от типов параметров вызываемого объекта, передаваемого в::

source: :pep:`612` -- Parameter Specification Variables (the PEP which introduced ``ParamSpec`` and ``Concatenate``)
ru: :pep:`612` -- Переменные спецификации параметров (PEP, в котором представлены ``ParamSpec`` и ``Concatenate``)

source: Special typing form to define "literal types".
ru: Специальная форма ввода для определения «литеральных типов».

source: ``Literal`` can be used to indicate to type checkers that the annotated object has a value equivalent to one of the provided literals.
ru: ``Литерал`` может использоваться, чтобы указать средствам проверки типов, что аннотированный объект имеет значение, эквивалентное одному из предоставленных литералов.

source: ``Literal[...]`` cannot be subclassed. At runtime, an arbitrary value is allowed as type argument to ``Literal[...]``, but type checkers may impose restrictions. See :pep:`586` for more details about literal types.
ja: ``Literal[...]`` はサブクラスにはできません。 実行時に、任意の値が ``Literal[...]`` の型引数として使えますが、型チェッカーが制約を課すことがあります。 リテラル型についてより詳しいことは :pep:`586` を参照してください。
ru: ``Literal[...]`` не может быть подклассом. Во время выполнения в качестве аргумента типа для ``Literal[...]`` допускается произвольное значение, но средства проверки типов могут налагать ограничения. См. :pep:`586` для получения более подробной информации о литеральных типах.

source: ``Literal`` now de-duplicates parameters. Equality comparisons of ``Literal`` objects are no longer order dependent. ``Literal`` objects will now raise a :exc:`TypeError` exception during equality comparisons if one of their parameters are not :term:`hashable`.
ja: ``Literal`` ではパラメータの重複を解消するようになりました。``Literal`` オブジェクトの等値比較は順序に依存しないようになりました。``Literal`` オブジェクトは、等値比較する際に、パラメータのうち 1 つでも :term:`hashable` でない場合は :exc:`TypeError` を送出するようになりました。
ru: ``Literal`` теперь устраняет дубликаты параметров. Сравнения на равенство объектов ``Literal`` больше не зависят от порядка. ``Литеральные`` объекты теперь будут вызывать исключение :exc:`TypeError` во время сравнения на равенство, если один из их параметров не :term:`hashable`.

source: Special type construct to mark class variables.
ja: クラス変数であることを示す特別な型構築子です。
ru: Конструкция специального типа для обозначения переменных класса.

source: As introduced in :pep:`526`, a variable annotation wrapped in ClassVar indicates that a given attribute is intended to be used as a class variable and should not be set on instances of that class. Usage::
ja: :pep:`526` で導入された通り、 ClassVar でラップされた変数アノテーションによって、ある属性はクラス変数として使うつもりであり、そのクラスのインスタンスから設定すべきではないということを示せます。使い方は次のようになります::
ru: Как было представлено в :pep:`526`, аннотация переменной, заключенная в ClassVar, указывает, что данный атрибут предназначен для использования в качестве переменной класса и не должен устанавливаться в экземплярах этого класса. Использование::

source: :data:`ClassVar` accepts only types and cannot be further subscribed.
ja: :data:`ClassVar` は型のみを受け入れ、それ以外は受け付けられません。
ru: :data:`ClassVar` принимает только типы и не подлежит дальнейшей подписке.

source: :data:`ClassVar` is not a class itself, and should not be used with :func:`isinstance` or :func:`issubclass`. :data:`ClassVar` does not change Python runtime behavior, but it can be used by third-party type checkers. For example, a type checker might flag the following code as an error::
ja: :data:`ClassVar` はクラスそのものではなく、:func:`isinstance` や :func:`issubclass` で使うべきではありません。 :data:`ClassVar` は Python の実行時の挙動を変えませんが、サードパーティの型検査器で使えます。 例えば、型チェッカーは次のコードをエラーとするかもしれません::
ru: :data:`ClassVar` сам по себе не является классом и не должен использоваться с :func:`isinstance` или :func:`issubclass`. :data:`ClassVar` не меняет поведение Python во время выполнения, но может использоваться сторонними средствами проверки типов. Например, средство проверки типов может пометить следующий код как ошибку:

source: :data:`ClassVar` can now be nested in :data:`Final` and vice versa.
ru: :data:`ClassVar` теперь можно вкладывать в :data:`Final` и наоборот.

source: Special typing construct to indicate final names to type checkers.
ru: Специальная конструкция типизации для указания окончательных имен для средств проверки типов.

source: Final names cannot be reassigned in any scope. Final names declared in class scopes cannot be overridden in subclasses.
ru: Окончательные имена не могут быть переназначены ни в какой области. Окончательные имена, объявленные в областях классов, не могут быть переопределены в подклассах.

source: There is no runtime checking of these properties. See :pep:`591` for more details.
ja: この機能は実行時には検査されません。詳細については :pep:`591` を参照してください。
ru: Проверка этих свойств во время выполнения не выполняется. См. :pep:`591` для более подробной информации.

source: :data:`Final` can now be nested in :data:`ClassVar` and vice versa.
ru: :data:`Final` теперь может быть вложен в :data:`ClassVar` и наоборот.

source: Special typing construct to mark a :class:`TypedDict` key as required.
ru: Специальная конструкция типизации для пометки ключа :class:`TypedDict` как необходимого.

source: This is mainly useful for ``total=False`` TypedDicts. See :class:`TypedDict` and :pep:`655` for more details.
ru: В основном это полезно для TypedDicts ``total=False``. См. :class:`TypedDict` и :pep:`655` для более подробной информации.

source: Special typing construct to mark a :class:`TypedDict` key as potentially missing.
ru: Специальная конструкция типизации, позволяющая пометить ключ :class:`TypedDict` как потенциально отсутствующий.

source: See :class:`TypedDict` and :pep:`655` for more details.
ru: См. :class:`TypedDict` и :pep:`655` для более подробной информации.

source: A special typing construct to mark an item of a :class:`TypedDict` as read-only.
ru: Специальная конструкция типизации, позволяющая пометить элемент :class:`TypedDict` как доступный только для чтения.

source: There is no runtime checking for this property.
ru: Для этого свойства не выполняется проверка во время выполнения.

source: See :class:`TypedDict` and :pep:`705` for more details.
ru: См. :class:`TypedDict` и :pep:`705` для более подробной информации.

source: Special typing form to add context-specific metadata to an annotation.
ru: Специальная форма ввода для добавления контекстно-зависимых метаданных в аннотацию.

source: Add metadata ``x`` to a given type ``T`` by using the annotation ``Annotated[T, x]``. Metadata added using ``Annotated`` can be used by static analysis tools or at runtime. At runtime, the metadata is stored in a :attr:`!__metadata__` attribute.
ru: Добавьте метаданные ``x`` к заданному типу ``T``, используя аннотацию ``Annotated[T, x]``. Метаданные, добавленные с помощью «Аннотаций», могут использоваться инструментами статического анализа или во время выполнения. Во время выполнения метаданные сохраняются в атрибуте :attr:`!__metadata__`.

source: If a library or tool encounters an annotation ``Annotated[T, x]`` and has no special logic for the metadata, it should ignore the metadata and simply treat the annotation as ``T``. As such, ``Annotated`` can be useful for code that wants to use annotations for purposes outside Python's static typing system.
ru: Если библиотека или инструмент встречает аннотацию «Annotated[T, x]» и не имеет специальной логики для метаданных, она должна игнорировать метаданные и просто рассматривать аннотацию как «T». Таким образом, Annotated может быть полезен для кода, который хочет использовать аннотации для целей, находящихся за пределами системы статической типизации Python.

source: Using ``Annotated[T, x]`` as an annotation still allows for static typechecking of ``T``, as type checkers will simply ignore the metadata ``x``. In this way, ``Annotated`` differs from the :func:`@no_type_check <no_type_check>` decorator, which can also be used for adding annotations outside the scope of the typing system, but completely disables typechecking for a function or class.
ru: Использование Annotated[T, x]`` в качестве аннотации по-прежнему позволяет выполнять статическую проверку типов ``T``, поскольку средства проверки типов просто игнорируют метаданные ``x``. Таким образом, ``Annotated`` отличается от декоратора :func:`@no_type_check <no_type_check>`, который также можно использовать для добавления аннотаций за пределами системы типизации, но полностью отключает проверку типов для функции или класса.

source: The responsibility of how to interpret the metadata lies with the tool or library encountering an ``Annotated`` annotation. A tool or library encountering an ``Annotated`` type can scan through the metadata elements to determine if they are of interest (e.g., using :func:`isinstance`).
ru: Ответственность за интерпретацию метаданных лежит на инструменте или библиотеке, обнаруживающей аннотацию «Аннотированная». Инструмент или библиотека, обнаруживающая тип ``Annotated``, может сканировать элементы метаданных, чтобы определить, представляют ли они интерес (например, используя :func:`isinstance`).

source: Here is an example of how you might use ``Annotated`` to add metadata to type annotations if you were doing range analysis:
ru: Вот пример того, как вы можете использовать Annotated для добавления метаданных в аннотации типов, если вы выполняете анализ диапазона:

source: Details of the syntax:
ru: Подробности синтаксиса:

source: The first argument to ``Annotated`` must be a valid type
ru: Первый аргумент ``Annotated`` должен быть допустимого типа.

source: Multiple metadata elements can be supplied (``Annotated`` supports variadic arguments)::
ru: Могут быть предоставлены несколько элементов метаданных (Annotated поддерживает переменные аргументы)::

source: It is up to the tool consuming the annotations to decide whether the client is allowed to add multiple metadata elements to one annotation and how to merge those annotations.
ru: Инструмент, использующий аннотации, должен решить, разрешено ли клиенту добавлять несколько элементов метаданных в одну аннотацию и как объединить эти аннотации.

source: ``Annotated`` must be subscripted with at least two arguments ( ``Annotated[int]`` is not valid)
ru: ``Annotated`` должен иметь как минимум два аргумента ( ``Annotated[int]`` недопустимо)

source: The order of the metadata elements is preserved and matters for equality checks::
ru: Порядок элементов метаданных сохраняется и имеет значение для проверок на равенство:

source: Nested ``Annotated`` types are flattened. The order of the metadata elements starts with the innermost annotation::
ru: Вложенные типы с аннотациями сглаживаются. Порядок элементов метаданных начинается с самой внутренней аннотации::

source: Duplicated metadata elements are not removed::
ru: Дублированные элементы метаданных не удаляются::

source: ``Annotated`` can be used with nested and generic aliases:
ru: ``Annotated`` можно использовать с вложенными и общими псевдонимами:

source: ``Annotated`` cannot be used with an unpacked :class:`TypeVarTuple`::
ru: ``Annotated`` нельзя использовать с распакованным :class:`TypeVarTuple`::

source: This would be equivalent to::
ru: Это будет эквивалентно::

source: where ``T1``, ``T2``, etc. are :class:`TypeVars <TypeVar>`. This would be invalid: only one type should be passed to Annotated.
ru: где ``T1``, ``T2`` и т. д. — это :class:`TypeVars <TypeVar>`. Это было бы неверно: в Annotated следует передавать только один тип.

source: By default, :func:`get_type_hints` strips the metadata from annotations. Pass ``include_extras=True`` to have the metadata preserved:
ru: По умолчанию :func:`get_type_hints` удаляет метаданные из аннотаций. Передайте ``include_extras=True``, чтобы сохранить метаданные:

source: At runtime, the metadata associated with an ``Annotated`` type can be retrieved via the :attr:`!__metadata__` attribute:
ru: Во время выполнения метаданные, связанные с типом ``Annotated``, могут быть получены через атрибут :attr:`!__metadata__`:

source: :pep:`593` - Flexible function and variable annotations
ru: :pep:`593` - Гибкие функции и аннотации переменных

source: The PEP introducing ``Annotated`` to the standard library.
ru: PEP вводит ``Annotated`` в стандартную библиотеку.

source: Special typing construct for marking user-defined type predicate functions.
ru: Специальная конструкция типизации для маркировки функций предиката определяемого пользователем типа.

source: ``TypeIs`` can be used to annotate the return type of a user-defined type predicate function. ``TypeIs`` only accepts a single type argument. At runtime, functions marked this way should return a boolean and take at least one positional argument.
ru: ``TypeIs`` может использоваться для аннотации типа возвращаемого значения функции-предиката пользовательского типа. ``TypeIs`` принимает только один аргумент типа. Во время выполнения функции, помеченные таким образом, должны возвращать логическое значение и принимать хотя бы один позиционный аргумент.

source: ``TypeIs`` aims to benefit *type narrowing* -- a technique used by static type checkers to determine a more precise type of an expression within a program's code flow. Usually type narrowing is done by analyzing conditional code flow and applying the narrowing to a block of code. The conditional expression here is sometimes referred to as a "type predicate"::
ru: Целью TypeIs является улучшение *сужения типов* — метода, используемого средствами проверки статических типов для определения более точного типа выражения в потоке кода программы. Обычно сужение типов выполняется путем анализа потока условного кода и применения сужения к блоку кода. Условное выражение здесь иногда называют «предикатом типа»::

source: Sometimes it would be convenient to use a user-defined boolean function as a type predicate. Such a function should use ``TypeIs[...]`` or :data:`TypeGuard` as its return type to alert static type checkers to this intention. ``TypeIs`` usually has more intuitive behavior than ``TypeGuard``, but it cannot be used when the input and output types are incompatible (e.g., ``list[object]`` to ``list[int]``) or when the function does not return ``True`` for all instances of the narrowed type.
ru: Иногда было бы удобно использовать определяемую пользователем логическую функцию в качестве предиката типа. Такая функция должна использовать TypeIs[...]`` или :data:`TypeGuard` в качестве типа возвращаемого значения, чтобы предупредить об этом средства проверки статического типа. ``TypeIs`` обычно имеет более интуитивное поведение, чем ``TypeGuard``, но его нельзя использовать, когда типы ввода и вывода несовместимы (например, от ``list[object]`` до ``list[int]`` ) или когда функция не возвращает True для всех экземпляров суженного типа.

source: Using ``-> TypeIs[NarrowedType]`` tells the static type checker that for a given function:
ru: Использование ``-> TypeIs[NarrowedType]`` сообщает средству проверки статического типа, что для данной функции:

source: The return value is a boolean.
ru: Возвращаемое значение является логическим.

source: If the return value is ``True``, the type of its argument is the intersection of the argument's original type and ``NarrowedType``.
ru: Если возвращаемое значение равно True, тип его аргумента является пересечением исходного типа аргумента и NarrowedType.

source: If the return value is ``False``, the type of its argument is narrowed to exclude ``NarrowedType``.
ru: Если возвращаемое значение — «False», тип его аргумента сужается, чтобы исключить «NarrowedType».

source: The type inside ``TypeIs`` must be consistent with the type of the function's argument; if it is not, static type checkers will raise an error. An incorrectly written ``TypeIs`` function can lead to unsound behavior in the type system; it is the user's responsibility to write such functions in a type-safe manner.
ru: Тип внутри TypeIs должен соответствовать типу аргумента функции; если это не так, средства проверки статического типа выдадут ошибку. Неправильно написанная функция TypeIs может привести к некорректному поведению системы типов; ответственность за написание таких функций типобезопасным образом лежит на пользователе.

source: If a ``TypeIs`` function is a class or instance method, then the type in ``TypeIs`` maps to the type of the second parameter (after ``cls`` or ``self``).
ru: Если функция TypeIs является методом класса или экземпляра, то тип в TypeIs сопоставляется с типом второго параметра (после cls или self).

source: In short, the form ``def foo(arg: TypeA) -> TypeIs[TypeB]: ...``, means that if ``foo(arg)`` returns ``True``, then ``arg`` is an instance of ``TypeB``, and if it returns ``False``, it is not an instance of ``TypeB``.
ru: Короче говоря, форма ``def foo(arg: TypeA) -> TypeIs[TypeB]: ...`` означает, что если ``foo(arg)`` возвращает ``True``, то ``arg` ` является экземпляром ``TypeB``, и если он возвращает ``False``, это не экземпляр ``TypeB``.

source: ``TypeIs`` also works with type variables. For more information, see :pep:`742` (Narrowing types with ``TypeIs``).
ru: ``TypeIs`` также работает с переменными типа. Для получения дополнительной информации см. :pep:`742` (Сужение типов с помощью ``TypeIs``).

source: Type predicate functions are user-defined functions that return whether their argument is an instance of a particular type. ``TypeGuard`` works similarly to :data:`TypeIs`, but has subtly different effects on type checking behavior (see below).
ru: Функции предиката типа — это определяемые пользователем функции, которые возвращают, является ли их аргумент экземпляром определенного типа. ``TypeGuard`` работает аналогично :data:`TypeIs`, но оказывает несколько иное влияние на поведение при проверке типов (см. ниже).

source: Using ``-> TypeGuard`` tells the static type checker that for a given function:
ru: Использование ``-> TypeGuard`` сообщает средству проверки статического типа, что для данной функции:

source: If the return value is ``True``, the type of its argument is the type inside ``TypeGuard``.
ru: Если возвращаемое значение — True, тип его аргумента — это тип внутри TypeGuard.

source: ``TypeGuard`` also works with type variables. See :pep:`647` for more details.
ru: ``TypeGuard`` также работает с переменными типа. См. :pep:`647` для более подробной информации.

source: ``TypeIs`` and ``TypeGuard`` differ in the following ways:
ru: ``TypeIs`` и ``TypeGuard`` различаются следующим образом:

source: ``TypeIs`` requires the narrowed type to be a subtype of the input type, while ``TypeGuard`` does not. The main reason is to allow for things like narrowing ``list[object]`` to ``list[str]`` even though the latter is not a subtype of the former, since ``list`` is invariant.
ru: ``TypeIs`` требует, чтобы суженный тип был подтипом входного типа, а ``TypeGuard`` этого не делает. Основная причина заключается в том, чтобы разрешить такие вещи, как сужение ``list[object]`` до ``list[str]``, хотя последний не является подтипом первого, поскольку ``list`` является инвариантным.

source: When a ``TypeGuard`` function returns ``True``, type checkers narrow the type of the variable to exactly the ``TypeGuard`` type. When a ``TypeIs`` function returns ``True``, type checkers can infer a more precise type combining the previously known type of the variable with the ``TypeIs`` type. (Technically, this is known as an intersection type.)
ru: Когда функция TypeGuard возвращает True, средства проверки типов сужают тип переменной до точного типа TypeGuard. Когда функция TypeIs возвращает True, средства проверки типов могут вывести более точный тип, сочетая ранее известный тип переменной с типом TypeIs. (Технически это называется типом пересечения.)

source: When a ``TypeGuard`` function returns ``False``, type checkers cannot narrow the type of the variable at all. When a ``TypeIs`` function returns ``False``, type checkers can narrow the type of the variable to exclude the ``TypeIs`` type.
ru: Когда функция TypeGuard возвращает False, средства проверки типов вообще не могут сузить тип переменной. Когда функция TypeIs возвращает False, средства проверки типов могут сузить тип переменной, чтобы исключить тип TypeIs.

source: Typing operator to conceptually mark an object as having been unpacked.
ru: Оператор ввода, который концептуально помечает объект как распакованный.

source: For example, using the unpack operator ``*`` on a :ref:`type variable tuple <typevartuple>` is equivalent to using ``Unpack`` to mark the type variable tuple as having been unpacked::
ru: Например, использование оператора распаковки ``*`` для кортежа переменных типа :ref:`<typevartuple>` эквивалентно использованию ``Unpack`` для пометки кортежа переменных типа как распакованного::
