Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/typing.po
Languages: ja, ru

source: The function recursively replaces all occurrences of ``Annotated[T, ...]`` with ``T``, unless *include_extras* is set to ``True`` (see :class:`Annotated` for more information).
ru: Функция рекурсивно заменяет все вхождения ``Annotated[T, ...]`` на ``T``, если только для *include_extras* не установлено значение ``True`` (см. :class:`Annotated` для получения дополнительной информации). .

source: See also :func:`inspect.get_annotations`, a lower-level function that returns annotations more directly.
ru: См. также :func:`inspect.get_annotations`, функцию нижнего уровня, которая возвращает аннотации более напрямую.

source: If any forward references in the annotations of *obj* are not resolvable or are not valid Python code, this function will raise an exception such as :exc:`NameError`. For example, this can happen with imported :ref:`type aliases <type-aliases>` that include forward references, or with names imported under :data:`if TYPE_CHECKING <TYPE_CHECKING>`.
ru: Если какие-либо прямые ссылки в аннотациях *obj* неразрешимы или не являются допустимым кодом Python, эта функция вызовет исключение, например :exc:`NameError`. Например, это может произойти с импортированными :ref:`псевдонимами типов <type-aliases>`, которые включают прямые ссылки, или с именами, импортированными в :data:`if TYPE_CHECKING <TYPE_CHECKING>`.

source: Added ``include_extras`` parameter as part of :pep:`593`. See the documentation on :data:`Annotated` for more information.
ru: Добавлен параметр ``include_extras`` как часть :pep:`593`. Дополнительную информацию смотрите в документации по :data:`Annotated`.

source: Previously, ``Optional[t]`` was added for function and method annotations if a default value equal to ``None`` was set. Now the annotation is returned unchanged.
ru: Ранее ``Optional[t]`` добавлялся для аннотаций функций и методов, если было установлено значение по умолчанию, равное ``None``. Теперь аннотация возвращается без изменений.

source: Get the unsubscripted version of a type: for a typing object of the form ``X[Y, Z, ...]`` return ``X``.
ru: Получите версию типа без индекса: для типизируемого объекта формы ``X[Y, Z, ...]`` верните ``X``.

source: If ``X`` is a typing-module alias for a builtin or :mod:`collections` class, it will be normalized to the original class. If ``X`` is an instance of :class:`ParamSpecArgs` or :class:`ParamSpecKwargs`, return the underlying :class:`ParamSpec`. Return ``None`` for unsupported objects.
ru: Если ``X`` является псевдонимом модуля типизации для встроенного класса или класса :mod:`collections`, он будет нормализован до исходного класса. Если ``X`` является экземпляром :class:`ParamSpecArgs` или :class:`ParamSpecKwargs`, верните базовый :class:`ParamSpec`. Верните None для неподдерживаемых объектов.

source: Examples:
ru: Примеры:

source: Get type arguments with all substitutions performed: for a typing object of the form ``X[Y, Z, ...]`` return ``(Y, Z, ...)``.
ru: Получите аргументы типа со всеми выполненными заменами: для типизируемого объекта формы ``X[Y, Z, ...]`` верните ``(Y, Z, ...)``.

source: If ``X`` is a union or :class:`Literal` contained in another generic type, the order of ``(Y, Z, ...)`` may be different from the order of the original arguments ``[Y, Z, ...]`` due to type caching. Return ``()`` for unsupported objects.
ru: Если ``X`` является объединением или :class:`Literal`, содержащимся в другом обобщенном типе, порядок ``(Y, Z, ...)`` может отличаться от порядка исходных аргументов `` [Y, Z, ...]`` из-за кэширования типов. Верните ``()`` для неподдерживаемых объектов.

source: Return the set of members defined in a :class:`Protocol`.
ru: Возвращает набор членов, определенный в :class:`Protocol`.

source: Raise :exc:`TypeError` for arguments that are not Protocols.
ru: Поднимите :exc:`TypeError` для аргументов, которые не являются протоколами.

source: Determine if a type is a :class:`Protocol`.
ru: Определите, является ли тип :class:`Protocol`.

source: class P(Protocol): def a(self) -> str: ... b: int is_protocol(P) # => True is_protocol(int) # => False
ru: класс P (протокол): def a(self) -> str: ... б: интервал is_protocol(P) # => Истина is_protocol(int) # => Ложь

source: Check if a type is a :class:`TypedDict`.
ru: Проверьте, является ли тип :class:`TypedDict`.

source: Class used for internal typing representation of string forward references.
ru: Класс, используемый для внутреннего представления типизации прямых ссылок на строки.

source: For example, ``List["SomeClass"]`` is implicitly transformed into ``List[ForwardRef("SomeClass")]``. ``ForwardRef`` should not be instantiated by a user, but may be used by introspection tools.
ru: Например, ``List["SomeClass"]`` неявно преобразуется в ``List[ForwardRef("SomeClass")]``. ``ForwardRef`` не должен создаваться пользователем, но может использоваться инструментами самоанализа.

source: :pep:`585` generic types such as ``list["SomeClass"]`` will not be implicitly transformed into ``list[ForwardRef("SomeClass")]`` and thus will not automatically resolve to ``list[SomeClass]``.
ru: :pep:`585` универсальные типы, такие как ``list["SomeClass"]``, не будут неявно преобразованы в ``list[ForwardRef("SomeClass")]`` и, следовательно, не будут автоматически разрешаться в ``list[ SomeClass]``.

source: A sentinel object used to indicate that a type parameter has no default value. For example:
ru: Дозорный объект, используемый для указания того, что параметр типа не имеет значения по умолчанию. Например:

source: Constant
ja: 定数
ru: Константа

source: A special constant that is assumed to be ``True`` by 3rd party static type checkers. It is ``False`` at runtime.
ru: Специальная константа, которая сторонними средствами проверки статического типа принимается за значение True. Во время выполнения это значение «False».

source: The first type annotation must be enclosed in quotes, making it a "forward reference", to hide the ``expensive_mod`` reference from the interpreter runtime. Type annotations for local variables are not evaluated, so the second annotation does not need to be enclosed in quotes.
ja: ``expensive_mod`` への参照をインタープリタランタイムから隠蔽するために、最初の型アノーテーションはシングルクォートで囲んで "前方参照" にしなければなりません。局所変数に対する型アノーテーションは評価されないので、２つめの型アノーテーションはシングルクォートで囲む必要はありません。
ru: Первая аннотация типа должна быть заключена в кавычки, что делает ее «прямой ссылкой», чтобы скрыть ссылку «expensive_mod» от среды выполнения интерпретатора. Аннотации типов для локальных переменных не оцениваются, поэтому вторую аннотацию не нужно заключать в кавычки.

source: If ``from __future__ import annotations`` is used, annotations are not evaluated at function definition time. Instead, they are stored as strings in ``__annotations__``. This makes it unnecessary to use quotes around the annotation (see :pep:`563`).
ja: ``from __future__ import annotations`` が使われた場合、アノーテーションは関数定義時に評価されません。代わりにアノーテーションは ``__annotations__`` 属性に文字列として保存されます。これによりアノーテーションをシングルクォートで囲む必要がなくなります (:pep:`563` を参照してください)。
ru: Если используется ``from __future__ import annotations``, аннотации не оцениваются во время определения функции. Вместо этого они сохраняются в виде строк в ``__annotations__``. Это делает ненужным использование кавычек вокруг аннотации (см. :pep:`563`).

source: Deprecated aliases
ru: Устаревшие псевдонимы

source: This module defines several deprecated aliases to pre-existing standard library classes. These were originally included in the typing module in order to support parameterizing these generic classes using ``[]``. However, the aliases became redundant in Python 3.9 when the corresponding pre-existing classes were enhanced to support ``[]`` (see :pep:`585`).
ru: Этот модуль определяет несколько устаревших псевдонимов уже существующих классов стандартной библиотеки. Первоначально они были включены в модуль типизации для поддержки параметризации этих универсальных классов с помощью ``[]``. Однако псевдонимы стали ненужными в Python 3.9, когда соответствующие ранее существовавшие классы были расширены для поддержки ``[]`` (см. :pep:`585`).

source: The redundant types are deprecated as of Python 3.9. However, while the aliases may be removed at some point, removal of these aliases is not currently planned. As such, no deprecation warnings are currently issued by the interpreter for these aliases.
ru: Избыточные типы устарели, начиная с Python 3.9. Однако, хотя в какой-то момент псевдонимы могут быть удалены, в настоящее время удаление этих псевдонимов не планируется. Таким образом, в настоящее время интерпретатор для этих псевдонимов не выдает никаких предупреждений об устаревании.

source: If at some point it is decided to remove these deprecated aliases, a deprecation warning will be issued by the interpreter for at least two releases prior to removal. The aliases are guaranteed to remain in the typing module without deprecation warnings until at least Python 3.14.
ru: Если в какой-то момент будет решено удалить эти устаревшие псевдонимы, интерпретатор выдаст предупреждение об устаревании как минимум для двух выпусков перед удалением. Псевдонимы гарантированно останутся в модуле ввода без предупреждений об устаревании, по крайней мере, до версии Python 3.14.

source: Type checkers are encouraged to flag uses of the deprecated types if the program they are checking targets a minimum Python version of 3.9 or newer.
ru: Специалистам по проверке типов рекомендуется отмечать использование устаревших типов, если программа, которую они проверяют, предназначена для минимальной версии Python 3.9 или новее.

source: Aliases to built-in types
ru: Псевдонимы встроенных типов

source: Deprecated alias to :class:`dict`.
ru: Устаревший псевдоним :class:`dict`.

source: Note that to annotate arguments, it is preferred to use an abstract collection type such as :class:`~collections.abc.Mapping` rather than to use :class:`dict` or :class:`!typing.Dict`.
ru: Обратите внимание, что для аннотирования аргументов предпочтительнее использовать абстрактный тип коллекции, например :class:`~collections.abc.Mapping`, а не :class:`dict` или :class:`!typing.Dict`.

source: :class:`builtins.dict <dict>` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
ru: :class:`builtins.dict <dict>` теперь поддерживает индексацию (``[]``). См. :pep:`585` и :ref:`types-genericalias`.

source: Deprecated alias to :class:`list`.
ru: Устаревший псевдоним :class:`list`.

source: Note that to annotate arguments, it is preferred to use an abstract collection type such as :class:`~collections.abc.Sequence` or :class:`~collections.abc.Iterable` rather than to use :class:`list` or :class:`!typing.List`.
ru: Обратите внимание, что для аннотирования аргументов предпочтительнее использовать абстрактный тип коллекции, например :class:`~collections.abc.Sequence` или :class:`~collections.abc.Iterable`, а не использовать :class:`list` или :class:`!typing.List`.

source: :class:`builtins.list <list>` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
ru: :class:`builtins.list <list>` теперь поддерживает индексацию (``[]``). См. :pep:`585` и :ref:`types-genericalias`.

source: Deprecated alias to :class:`builtins.set <set>`.
ru: Устаревший псевдоним :class:`builtins.set <set>`.

source: Note that to annotate arguments, it is preferred to use an abstract collection type such as :class:`collections.abc.Set` rather than to use :class:`set` or :class:`typing.Set`.
ru: Обратите внимание, что для аннотирования аргументов предпочтительнее использовать абстрактный тип коллекции, например :class:`collections.abc.Set`, а не :class:`set` или :class:`typing.Set`.

source: :class:`builtins.set <set>` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
ru: :class:`builtins.set <set>` теперь поддерживает индексацию (``[]``). См. :pep:`585` и :ref:`types-genericalias`.

source: Deprecated alias to :class:`builtins.frozenset <frozenset>`.
ru: Устаревший псевдоним :class:`builtins.frozenset <frozenset>`.

source: :class:`builtins.frozenset <frozenset>` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
ru: :class:`builtins.frozenset <frozenset>` теперь поддерживает индексацию (``[]``). См. :pep:`585` и :ref:`types-genericalias`.

source: Deprecated alias for :class:`tuple`.
ru: Устаревший псевдоним для :class:`tuple`.

source: :class:`tuple` and ``Tuple`` are special-cased in the type system; see :ref:`annotating-tuples` for more details.
ru: :class:`tuple` и ``Tuple`` имеют особый случай в системе типов; более подробную информацию см. в :ref:`annotating-tuples`.

source: :class:`builtins.tuple <tuple>` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
ru: :class:`builtins.tuple <tuple>` теперь поддерживает индексацию (``[]``). См. :pep:`585` и :ref:`types-genericalias`.

source: Deprecated alias to :class:`type`.
ru: Устаревший псевдоним :class:`type`.

source: See :ref:`type-of-class-objects` for details on using :class:`type` or ``typing.Type`` in type annotations.
ru: См. :ref:`type-of-class-objects` для получения подробной информации об использовании :class:`type` или ``typing.Type`` в аннотациях типов.

source: :class:`builtins.type <type>` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
ru: :class:`builtins.type <type>` теперь поддерживает индексацию (``[]``). См. :pep:`585` и :ref:`types-genericalias`.

source: Aliases to types in :mod:`collections`
ru: Псевдонимы для типов в :mod:`collections`

source: Deprecated alias to :class:`collections.defaultdict`.
ru: Устаревший псевдоним :class:`collections.defaultdict`.

source: :class:`collections.defaultdict` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
ru: :class:`collections.defaultdict` теперь поддерживает подписку (``[]``). См. :pep:`585` и :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.OrderedDict`.
ru: Устаревший псевдоним :class:`collections.OrderedDict`.

source: :class:`collections.OrderedDict` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
ru: :class:`collections.OrderedDict` теперь поддерживает подписку (``[]``). См. :pep:`585` и :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.ChainMap`.
ru: Устаревший псевдоним :class:`collections.ChainMap`.

source: :class:`collections.ChainMap` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
ru: :class:`collections.ChainMap` теперь поддерживает подписку (``[]``). См. :pep:`585` и :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.Counter`.
ru: Устаревший псевдоним :class:`collections.Counter`.

source: :class:`collections.Counter` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
ru: :class:`collections.Counter` теперь поддерживает подписку (``[]``). См. :pep:`585` и :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.deque`.
ru: Устаревший псевдоним :class:`collections.deque`.

source: :class:`collections.deque` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
ru: :class:`collections.deque` теперь поддерживает подписку (``[]``). См. :pep:`585` и :ref:`types-genericalias`.

source: Aliases to other concrete types
ru: Псевдонимы других типов бетона

source: Deprecated aliases corresponding to the return types from :func:`re.compile` and :func:`re.match`.
ru: Устаревшие псевдонимы, соответствующие типам возвращаемых значений из :func:`re.compile` и :func:`re.match`.

source: Classes ``Pattern`` and ``Match`` from :mod:`re` now support ``[]``. See :pep:`585` and :ref:`types-genericalias`.
ru: Классы ``Pattern`` и ``Match`` из :mod:`re` теперь поддерживают ``[]``. См. :pep:`585` и :ref:`types-genericalias`.

source: Deprecated alias for :class:`str`.
ru: Устаревший псевдоним для :class:`str`.

source: ``Text`` is provided to supply a forward compatible path for Python 2 code: in Python 2, ``Text`` is an alias for ``unicode``.
ru: ``Text`` предоставляется для предоставления прямого совместимого пути для кода Python 2: в Python 2 ``Text`` является псевдонимом для ``unicode``.

source: Use ``Text`` to indicate that a value must contain a unicode string in a manner that is compatible with both Python 2 and Python 3::
ja: ``Text`` は Python 2 と Python 3 の両方と互換性のある方法で値が unicode 文字列を含んでいなければならない場合に使用してください。
ru: Используйте ``Text``, чтобы указать, что значение должно содержать строку Юникода, совместимую как с Python 2, так и с Python 3::

source: Python 2 is no longer supported, and most type checkers also no longer support type checking Python 2 code. Removal of the alias is not currently planned, but users are encouraged to use :class:`str` instead of ``Text``.
ru: Python 2 больше не поддерживается, и большинство средств проверки типов также больше не поддерживают проверку типов кода Python 2. Удаление псевдонима в настоящее время не планируется, но пользователям рекомендуется использовать :class:`str` вместо ``Text``.

source: Aliases to container ABCs in :mod:`collections.abc`
ru: Псевдонимы контейнеров ABC в :mod:`collections.abc`

source: Deprecated alias to :class:`collections.abc.Set`.
ru: Устаревший псевдоним :class:`collections.abc.Set`.

source: :class:`collections.abc.Set` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
ru: :class:`collections.abc.Set` теперь поддерживает подписку (``[]``). См. :pep:`585` и :ref:`types-genericalias`.

source: This type represents the types :class:`bytes`, :class:`bytearray`, and :class:`memoryview` of byte sequences.
ja: この型は :class:`bytes` と :class:`bytearray` 、バイト列の :class:`memoryview` を表します。
ru: Этот тип представляет типы :class:`bytes`, :class:`bytearray` и :class:`memoryview` последовательностей байтов.

source: Prefer :class:`collections.abc.Buffer`, or a union like ``bytes | bytearray | memoryview``.
ru: Предпочитайте :class:`collections.abc.Buffer` или объединение типа ``bytes | байтаррей | просмотр памяти``.

source: Deprecated alias to :class:`collections.abc.Collection`.
ru: Устаревший псевдоним :class:`collections.abc.Collection`.

source: :class:`collections.abc.Collection` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
ru: :class:`collections.abc.Collection` теперь поддерживает подписку (``[]``). См. :pep:`585` и :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.Container`.
ru: Устаревший псевдоним :class:`collections.abc.Container`.

source: :class:`collections.abc.Container` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
ru: :class:`collections.abc.Container` теперь поддерживает подписку (``[]``). См. :pep:`585` и :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.ItemsView`.
ru: Устаревший псевдоним :class:`collections.abc.ItemsView`.

source: :class:`collections.abc.ItemsView` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
ru: :class:`collections.abc.ItemsView` теперь поддерживает подписку (``[]``). См. :pep:`585` и :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.KeysView`.
ru: Устаревший псевдоним :class:`collections.abc.KeysView`.

source: :class:`collections.abc.KeysView` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
ru: :class:`collections.abc.KeysView` теперь поддерживает подписку (``[]``). См. :pep:`585` и :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.Mapping`.
ru: Устаревший псевдоним :class:`collections.abc.Mapping`.

source: :class:`collections.abc.Mapping` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
ru: :class:`collections.abc.Mapping` теперь поддерживает подписку (``[]``). См. :pep:`585` и :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.MappingView`.
ru: Устаревший псевдоним :class:`collections.abc.MappingView`.

source: :class:`collections.abc.MappingView` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
ru: :class:`collections.abc.MappingView` теперь поддерживает подписку (``[]``). См. :pep:`585` и :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.MutableMapping`.
ru: Устаревший псевдоним :class:`collections.abc.MutableMapping`.

source: :class:`collections.abc.MutableMapping` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
ru: :class:`collections.abc.MutableMapping` теперь поддерживает подписку (``[]``). См. :pep:`585` и :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.MutableSequence`.
ru: Устаревший псевдоним :class:`collections.abc.MutableSequence`.

source: :class:`collections.abc.MutableSequence` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
ru: :class:`collections.abc.MutableSequence` теперь поддерживает подписку (``[]``). См. :pep:`585` и :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.MutableSet`.
ru: Устаревший псевдоним :class:`collections.abc.MutableSet`.

source: :class:`collections.abc.MutableSet` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
ru: :class:`collections.abc.MutableSet` теперь поддерживает подписку (``[]``). См. :pep:`585` и :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.Sequence`.
ru: Устаревший псевдоним :class:`collections.abc.Sequence`.

source: :class:`collections.abc.Sequence` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
ru: :class:`collections.abc.Sequence` теперь поддерживает подписку (``[]``). См. :pep:`585` и :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.ValuesView`.
ru: Устаревший псевдоним :class:`collections.abc.ValuesView`.

source: :class:`collections.abc.ValuesView` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
ru: :class:`collections.abc.ValuesView` теперь поддерживает подписку (``[]``). См. :pep:`585` и :ref:`types-genericalias`.

source: Aliases to asynchronous ABCs in :mod:`collections.abc`
ru: Псевдонимы асинхронных ABC в :mod:`collections.abc`

source: Deprecated alias to :class:`collections.abc.Coroutine`.
ru: Устаревший псевдоним :class:`collections.abc.Coroutine`.

source: See :ref:`annotating-generators-and-coroutines` for details on using :class:`collections.abc.Coroutine` and ``typing.Coroutine`` in type annotations.
ru: См. :ref:`annotating-generators-and-coroutines` для получения подробной информации об использовании :class:`collections.abc.Coroutine` и ``typing.Coroutine`` в аннотациях типов.

source: :class:`collections.abc.Coroutine` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
ru: :class:`collections.abc.Coroutine` теперь поддерживает подписку (``[]``). См. :pep:`585` и :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.AsyncGenerator`.
ru: Устаревший псевдоним :class:`collections.abc.AsyncGenerator`.

source: See :ref:`annotating-generators-and-coroutines` for details on using :class:`collections.abc.AsyncGenerator` and ``typing.AsyncGenerator`` in type annotations.
ru: См. :ref:`annotating-generators-and-coroutines` для получения подробной информации об использовании :class:`collections.abc.AsyncGenerator` и ``typing.AsyncGenerator`` в аннотациях типов.

source: :class:`collections.abc.AsyncGenerator` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
ru: :class:`collections.abc.AsyncGenerator` теперь поддерживает подписку (``[]``). См. :pep:`585` и :ref:`types-genericalias`.
