Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/typing.po
Languages: ja, ru

source: Other special directives
ru: Другие специальные директивы

source: These functions and classes should not be used directly as annotations. Their intended purpose is to be building blocks for creating and declaring types.
ru: Эти функции и классы не следует использовать непосредственно в качестве аннотаций. Их предполагаемая цель — стать строительными блоками для создания и объявления типов.

source: Typed version of :func:`collections.namedtuple`.
ja: :func:`collections.namedtuple` の型付き版です。
ru: Типизированная версия :func:`collections.namedtuple`.

source: Usage::
ja: 使い方::
ru: Использование::

source: This is equivalent to::
ja: これは次と等価です::
ru: Это эквивалентно::

source: To give a field a default value, you can assign to it in the class body::
ja: フィールドにデフォルト値を与えるにはクラス本体で代入してください::
ru: Чтобы присвоить полю значение по умолчанию, вы можете присвоить ему значение в теле класса:

source: Fields with a default value must come after any fields without a default.
ja: デフォルト値のあるフィールドはデフォルト値のないフィールドの後でなければなりません。
ru: Поля со значением по умолчанию должны идти после полей без значения по умолчанию.

source: The resulting class has an extra attribute ``__annotations__`` giving a dict that maps the field names to the field types. (The field names are in the ``_fields`` attribute and the default values are in the ``_field_defaults`` attribute, both of which are part of the :func:`~collections.namedtuple` API.)
ja: 最終的に出来上がるクラスには、フィールド名をフィールド型へ対応付ける辞書を提供する ``__annotations__`` 属性が追加されています。 (フィールド名は ``_fields`` 属性に、デフォルト値は ``_field_defaults`` 属性に格納されていて、両方とも :func:`~collections.namedtuple` API の一部分です。)
ru: Результирующий класс имеет дополнительный атрибут ``__annotations__``, задающий словарь, который сопоставляет имена полей с типами полей. (Имена полей находятся в атрибуте ``_fields``, а значения по умолчанию — в атрибуте ``_field_defaults``, оба из которых являются частью API :func:`~collections.namedtuple`.)

source: ``NamedTuple`` subclasses can also have docstrings and methods::
ja: ``NamedTuple`` のサブクラスは docstring やメソッドも持てます::
ru: Подклассы NamedTuple также могут иметь строки документации и методы::

source: ``NamedTuple`` subclasses can be generic::
ru: Подклассы ``NamedTuple`` могут быть общими::

source: Backward-compatible usage::
ja: 後方互換な使用法::
ru: Использование с обратной совместимостью::

source: Added support for :pep:`526` variable annotation syntax.
ja: :pep:`526` 変数アノテーションのシンタックスが追加されました。
ru: Добавлена ​​поддержка синтаксиса аннотаций переменных :pep:`526`.

source: Added support for default values, methods, and docstrings.
ja: デフォルト値、メソッド、ドキュメンテーション文字列への対応が追加されました。
ru: Добавлена ​​поддержка значений, методов и строк документации по умолчанию.

source: The ``_field_types`` and ``__annotations__`` attributes are now regular dictionaries instead of instances of ``OrderedDict``.
ja: ``_field_types`` 属性および ``__annotations__`` 属性は ``OrderedDict`` インスタンスではなく普通の辞書になりました。
ru: Атрибуты _field_types и __annotations__ теперь являются обычными словарями, а не экземплярами OrderedDict.

source: Removed the ``_field_types`` attribute in favor of the more standard ``__annotations__`` attribute which has the same information.
ja: ``_field_types`` 属性は削除されました。代わりに同じ情報を持つより標準的な ``__annotations__`` 属性を使ってください。
ru: Удален атрибут ``_field_types`` в пользу более стандартного атрибута ``__annotations__``, который содержит ту же информацию.

source: Added support for generic namedtuples.
ru: Добавлена ​​поддержка общих именованных кортежей.

source: The undocumented keyword argument syntax for creating NamedTuple classes (``NT = NamedTuple("NT", x=int)``) is deprecated, and will be disallowed in 3.15. Use the class-based syntax or the functional syntax instead.
ru: Недокументированный синтаксис аргумента ключевого слова для создания классов NamedTuple (``NT = NamedTuple("NT", x=int)``) устарел и будет запрещен в версии 3.15. Вместо этого используйте синтаксис на основе классов или функциональный синтаксис.

source: When using the functional syntax to create a NamedTuple class, failing to pass a value to the 'fields' parameter (``NT = NamedTuple("NT")``) is deprecated. Passing ``None`` to the 'fields' parameter (``NT = NamedTuple("NT", None)``) is also deprecated. Both will be disallowed in Python 3.15. To create a NamedTuple class with 0 fields, use ``class NT(NamedTuple): pass`` or ``NT = NamedTuple("NT", [])``.
ru: При использовании функционального синтаксиса для создания класса NamedTuple невозможность передать значение параметру Fields (``NT = NamedTuple("NT")``) считается устаревшей. Передача ``None`` в параметр 'fields' (``NT = NamedTuple("NT", None)``) также не рекомендуется. Оба будут запрещены в Python 3.15. Чтобы создать класс NamedTuple с 0 полями, используйте class NT(NamedTuple): pass или NT = NamedTuple("NT", [])``.

source: Helper class to create low-overhead :ref:`distinct types <distinct>`.
ru: Вспомогательный класс для создания :ref:`различных типов <distinct>` с минимальными издержками.

source: A ``NewType`` is considered a distinct type by a typechecker. At runtime, however, calling a ``NewType`` returns its argument unchanged.
ru: Средство проверки типов считает NewType отдельным типом. Однако во время выполнения вызов NewType возвращает его аргумент без изменений.

source: The module in which the new type is defined.
ru: Модуль, в котором определен новый тип.

source: The name of the new type.
ru: Имя нового типа.

source: The type that the new type is based on.
ru: Тип, на котором основан новый тип.

source: ``NewType`` is now a class rather than a function.
ru: ``NewType`` теперь является классом, а не функцией.

source: Base class for protocol classes.
ru: Базовый класс для классов протоколов.

source: Protocol classes are defined like this::
ru: Классы протоколов определяются следующим образом:

source: Such classes are primarily used with static type checkers that recognize structural subtyping (static duck-typing), for example::
ja: このようなクラスは主に構造的部分型 (静的ダックタイピング) を認識する静的型チェッカーが使います。例えば::
ru: Такие классы в основном используются со статическими средствами проверки типов, которые распознают структурные подтипы (статическую утиную типизацию), например:

source: See :pep:`544` for more details. Protocol classes decorated with :func:`runtime_checkable` (described later) act as simple-minded runtime protocols that check only the presence of given attributes, ignoring their type signatures.
ru: См. :pep:`544` для более подробной информации. Классы протоколов, украшенные :func:`runtime_checkable` (описаны позже), действуют как простодушные протоколы времени выполнения, которые проверяют только наличие заданных атрибутов, игнорируя их сигнатуры типов.

source: Protocol classes can be generic, for example::
ja: プロトコルクラスはジェネリックにもできます。例えば::
ru: Классы протоколов могут быть универсальными, например::

source: In code that needs to be compatible with Python 3.11 or older, generic Protocols can be written as follows::
ru: В коде, который должен быть совместим с Python 3.11 или более ранней версии, общие протоколы можно записать следующим образом:

source: Mark a protocol class as a runtime protocol.
ru: Отметьте класс протокола как протокол времени выполнения.

source: Such a protocol can be used with :func:`isinstance` and :func:`issubclass`. This raises :exc:`TypeError` when applied to a non-protocol class. This allows a simple-minded structural check, very similar to "one trick ponies" in :mod:`collections.abc` such as :class:`~collections.abc.Iterable`. For example::
ru: Такой протокол можно использовать с :func:`isinstance` и :func:`issubclass`. Это вызывает :exc:`TypeError` при применении к непротокольному классу. Это позволяет провести простую структурную проверку, очень похожую на «пони с одним трюком» в :mod:`collections.abc`, например :class:`~collections.abc.Iterable`. Например::

source: :func:`!runtime_checkable` will check only the presence of the required methods or attributes, not their type signatures or types. For example, :class:`ssl.SSLObject` is a class, therefore it passes an :func:`issubclass` check against :ref:`Callable <annotating-callables>`. However, the ``ssl.SSLObject.__init__`` method exists only to raise a :exc:`TypeError` with a more informative message, therefore making it impossible to call (instantiate) :class:`ssl.SSLObject`.
ru: :func:`!runtime_checkable` будет проверять только наличие необходимых методов или атрибутов, а не их сигнатуры типов или типы. Например, :class:`ssl.SSLObject` — это класс, поэтому он проходит проверку :func:`issubclass` на :ref:`Callable <annotating-callables>`. Однако метод ``ssl.SSLObject.__init__`` существует только для того, чтобы вызвать :exc:`TypeError` с более информативным сообщением, что делает невозможным вызов (создание экземпляра) :class:`ssl.SSLObject`.

source: An :func:`isinstance` check against a runtime-checkable protocol can be surprisingly slow compared to an ``isinstance()`` check against a non-protocol class. Consider using alternative idioms such as :func:`hasattr` calls for structural checks in performance-sensitive code.
ru: Проверка :func:`isinstance` по протоколу, проверяемому во время выполнения, может быть на удивление медленной по сравнению с проверкой ``isinstance()`` по непротокольному классу. Рассмотрите возможность использования альтернативных идиом, таких как вызовы :func:`hasattr` для структурных проверок в коде, чувствительном к производительности.

source: The internal implementation of :func:`isinstance` checks against runtime-checkable protocols now uses :func:`inspect.getattr_static` to look up attributes (previously, :func:`hasattr` was used). As a result, some objects which used to be considered instances of a runtime-checkable protocol may no longer be considered instances of that protocol on Python 3.12+, and vice versa. Most users are unlikely to be affected by this change.
ru: Внутренняя реализация :func:`isinstance` проверки протоколов, проверяемых во время выполнения, теперь использует :func:`inspect.getattr_static` для поиска атрибутов (ранее использовалась :func:`hasattr`). В результате некоторые объекты, которые раньше считались экземплярами протокола, проверяемого во время выполнения, больше не могут считаться экземплярами этого протокола в Python 3.12+, и наоборот. Это изменение вряд ли затронет большинство пользователей.

source: The members of a runtime-checkable protocol are now considered "frozen" at runtime as soon as the class has been created. Monkey-patching attributes onto a runtime-checkable protocol will still work, but will have no impact on :func:`isinstance` checks comparing objects to the protocol. See :ref:`"What's new in Python 3.12" <whatsnew-typing-py312>` for more details.
ru: Члены протокола, проверяемого во время выполнения, теперь считаются «замороженными» во время выполнения, как только класс был создан. Атрибуты Monkey-Patching в протоколе, проверяемом во время выполнения, по-прежнему будут работать, но не окажут влияния на проверки :func:`isinstance`, сравнивающие объекты с протоколом. Дополнительную информацию см. в разделе :ref:`"Что нового в Python 3.12" <whatsnew-typing-py312>`.

source: Special construct to add type hints to a dictionary. At runtime it is a plain :class:`dict`.
ru: Специальная конструкция для добавления подсказок типов в словарь. Во время выполнения это обычный :class:`dict`.

source: ``TypedDict`` declares a dictionary type that expects all of its instances to have a certain set of keys, where each key is associated with a value of a consistent type. This expectation is not checked at runtime but is only enforced by type checkers. Usage::
ja: ``TypedDict`` は、その全てのインスタンスにおいてキーの集合が固定されていて、各キーに対応する値が全てのインスタンスで同じ型を持つことが期待される辞書型を宣言します。 この期待は実行時にはチェックされず、型チェッカーでのみ強制されます。 使用方法は次の通りです::
ru: TypedDict объявляет тип словаря, который ожидает, что все его экземпляры будут иметь определенный набор ключей, где каждый ключ связан со значением согласованного типа. Это ожидание не проверяется во время выполнения, а обеспечивается только средствами проверки типов. Использование::

source: An alternative way to create a ``TypedDict`` is by using function-call syntax. The second argument must be a literal :class:`dict`::
ru: Альтернативный способ создания TypedDict — использование синтаксиса вызова функций. Второй аргумент должен быть буквальным :class:`dict`::

source: This functional syntax allows defining keys which are not valid :ref:`identifiers <identifiers>`, for example because they are keywords or contain hyphens::
ru: Этот функциональный синтаксис позволяет определять недопустимые ключи :ref:`identifiers <identifiers>`, например, потому что они являются ключевыми словами или содержат дефисы::

source: By default, all keys must be present in a ``TypedDict``. It is possible to mark individual keys as non-required using :data:`NotRequired`::
ru: По умолчанию все ключи должны присутствовать в TypedDict. Можно пометить отдельные ключи как необязательные, используя :data:`NotRequired`::

source: This means that a ``Point2D`` ``TypedDict`` can have the ``label`` key omitted.
ru: Это означает, что в ``Point2D`` ``TypedDict`` ключ ``label`` может быть опущен.

source: It is also possible to mark all keys as non-required by default by specifying a totality of ``False``::
ru: Также можно пометить все ключи как необязательные по умолчанию, указав совокупность ``False``::

source: This means that a ``Point2D`` ``TypedDict`` can have any of the keys omitted. A type checker is only expected to support a literal ``False`` or ``True`` as the value of the ``total`` argument. ``True`` is the default, and makes all items defined in the class body required.
ru: Это означает, что в ``Point2D`` ``TypedDict`` любой ключ может быть опущен. Ожидается, что средство проверки типов будет поддерживать только литералы «False» или «True» в качестве значения аргумента «total». ``True`` является значением по умолчанию и делает все элементы, определенные в теле класса, обязательными.

source: Individual keys of a ``total=False`` ``TypedDict`` can be marked as required using :data:`Required`::
ru: Отдельные ключи ``total=False`` ``TypedDict`` могут быть помечены как обязательные с помощью :data:`Required`::

source: It is possible for a ``TypedDict`` type to inherit from one or more other ``TypedDict`` types using the class-based syntax. Usage::
ru: Тип TypedDict может наследовать от одного или нескольких других типов TypedDict, используя синтаксис на основе классов. Использование::

source: ``Point3D`` has three items: ``x``, ``y`` and ``z``. It is equivalent to this definition::
ru: ``Point3D`` имеет три элемента: ``x``, ``y`` и ``z``. Это эквивалентно этому определению:

source: A ``TypedDict`` cannot inherit from a non-\ ``TypedDict`` class, except for :class:`Generic`. For example::
ru: TypedDict не может наследовать класс, отличный от TypedDict, за исключением :class:`Generic`. Например::

source: A ``TypedDict`` can be generic::
ru: TypedDict может быть универсальным::

source: To create a generic ``TypedDict`` that is compatible with Python 3.11 or lower, inherit from :class:`Generic` explicitly:
ru: Чтобы создать универсальный TypedDict, совместимый с Python 3.11 или ниже, явно наследуйте от :class:`Generic`:

source: A ``TypedDict`` can be introspected via annotations dicts (see :ref:`annotations-howto` for more information on annotations best practices), :attr:`__total__`, :attr:`__required_keys__`, and :attr:`__optional_keys__`.
ru: ``TypedDict`` можно изучить с помощью аннотаций (дополнительную информацию о лучших методах аннотаций см. в разделе :ref:`annotations-howto`), :attr:`__total__`, :attr:`__required_keys__` и :attr:` __optional_keys__`.

source: ``Point2D.__total__`` gives the value of the ``total`` argument. Example:
ru: ``Point2D.__total__`` возвращает значение аргумента ``total``. Пример:

source: This attribute reflects *only* the value of the ``total`` argument to the current ``TypedDict`` class, not whether the class is semantically total. For example, a ``TypedDict`` with ``__total__`` set to ``True`` may have keys marked with :data:`NotRequired`, or it may inherit from another ``TypedDict`` with ``total=False``. Therefore, it is generally better to use :attr:`__required_keys__` and :attr:`__optional_keys__` for introspection.
ru: Этот атрибут отражает *только* значение аргумента total для текущего класса TypedDict, а не то, является ли класс семантически полным. Например, ``TypedDict`` с ``__total__``, установленным в ``True``, может иметь ключи, отмеченные :data:`NotRequired`, или он может наследовать от другого ``TypedDict`` с ``total= Ложь``. Поэтому обычно лучше использовать :attr:`__required_keys__` и :attr:`__optional_keys__` для самоанализа.

source: ``Point2D.__required_keys__`` and ``Point2D.__optional_keys__`` return :class:`frozenset` objects containing required and non-required keys, respectively.
ru: ``Point2D.__required_keys__`` и ``Point2D.__optional_keys__`` возвращают объекты :class:`frozenset`, содержащие обязательные и необязательные ключи соответственно.

source: Keys marked with :data:`Required` will always appear in ``__required_keys__`` and keys marked with :data:`NotRequired` will always appear in ``__optional_keys__``.
ru: Ключи, отмеченные :data:`Required`, всегда будут отображаться в ``__required_keys__``, а ключи, отмеченные :data:`NotRequired`, всегда будут появляться в ``__optional_keys__``.

source: For backwards compatibility with Python 3.10 and below, it is also possible to use inheritance to declare both required and non-required keys in the same ``TypedDict`` . This is done by declaring a ``TypedDict`` with one value for the ``total`` argument and then inheriting from it in another ``TypedDict`` with a different value for ``total``:
ru: Для обратной совместимости с Python 3.10 и ниже также можно использовать наследование для объявления как обязательных, так и необязательных ключей в одном ``TypedDict``. Это делается путем объявления TypedDict с одним значением аргумента total и последующего наследования от него другого TypedDict с другим значением total:

source: If ``from __future__ import annotations`` is used or if annotations are given as strings, annotations are not evaluated when the ``TypedDict`` is defined. Therefore, the runtime introspection that ``__required_keys__`` and ``__optional_keys__`` rely on may not work properly, and the values of the attributes may be incorrect.
ru: Если используются аннотации импорта from __future__ или аннотации задаются в виде строк, аннотации не оцениваются, когда определен TypedDict. Таким образом, самоанализ во время выполнения, на который полагаются ``__required_keys__`` и ``__optional_keys__``, может работать некорректно, а значения атрибутов могут быть неправильными.

source: Support for :data:`ReadOnly` is reflected in the following attributes:
ru: Поддержка :data:`ReadOnly` отражена в следующих атрибутах:

source: A :class:`frozenset` containing the names of all read-only keys. Keys are read-only if they carry the :data:`ReadOnly` qualifier.
ru: :class:`frozenset`, содержащий имена всех ключей, доступных только для чтения. Ключи доступны только для чтения, если они содержат квалификатор :data:`ReadOnly`.

source: A :class:`frozenset` containing the names of all mutable keys. Keys are mutable if they do not carry the :data:`ReadOnly` qualifier.
ru: :class:`frozenset`, содержащий имена всех изменяемых ключей. Ключи являются изменяемыми, если они не содержат квалификатор :data:`ReadOnly`.

source: See :pep:`589` for more examples and detailed rules of using ``TypedDict``.
ja: 他の例や、 ``TypedDict`` を扱う詳細な規則については :pep:`589` を参照してください。
ru: См. :pep:`589` для получения дополнительных примеров и подробных правил использования ``TypedDict``.

source: Added support for marking individual keys as :data:`Required` or :data:`NotRequired`. See :pep:`655`.
ru: Добавлена ​​поддержка маркировки отдельных ключей как :data:`Required` или :data:`NotRequired`. См. :pep:`655`.

source: Added support for generic ``TypedDict``\ s.
ru: Добавлена ​​поддержка общих типов ``TypedDict``\.

source: Removed support for the keyword-argument method of creating ``TypedDict``\ s.
ru: Удалена поддержка метода ключевого слова-аргумента для создания ``TypedDict``\ s.

source: Support for the :data:`ReadOnly` qualifier was added.
ru: Добавлена ​​поддержка квалификатора :data:`ReadOnly`.

source: When using the functional syntax to create a TypedDict class, failing to pass a value to the 'fields' parameter (``TD = TypedDict("TD")``) is deprecated. Passing ``None`` to the 'fields' parameter (``TD = TypedDict("TD", None)``) is also deprecated. Both will be disallowed in Python 3.15. To create a TypedDict class with 0 fields, use ``class TD(TypedDict): pass`` or ``TD = TypedDict("TD", {})``.
ru: При использовании функционального синтаксиса для создания класса TypedDict невозможность передать значение параметру field (``TD = TypedDict("TD")``) считается устаревшей. Передача ``None`` в параметр 'fields' (``TD = TypedDict("TD", None)``) также не рекомендуется. Оба будут запрещены в Python 3.15. Чтобы создать класс TypedDict с 0 полями, используйте ``class TD(TypedDict): pass`` или ``TD = TypedDict("TD", {})``.

source: Protocols
ja: プロトコル
ru: Протоколы

source: The following protocols are provided by the typing module. All are decorated with :func:`@runtime_checkable <runtime_checkable>`.
ru: Следующие протоколы предоставляются модулем типизации. Все они украшены :func:`@runtime_checkable <runtime_checkable>`.

source: An ABC with one abstract method ``__abs__`` that is covariant in its return type.
ja: 返り値の型と共変な抽象メソッド ``__abs__`` を備えた ABC です。
ru: ABC с одним абстрактным методом ``__abs__``, ковариантным по типу возвращаемого значения.

source: An ABC with one abstract method ``__bytes__``.
ja: 抽象メソッド ``__bytes__`` を備えた ABC です。
ru: ABC с одним абстрактным методом ``__bytes__``.

source: An ABC with one abstract method ``__complex__``.
ja: 抽象メソッド ``__complex__`` を備えた ABC です。
ru: ABC с одним абстрактным методом ``__complex__``.

source: An ABC with one abstract method ``__float__``.
ja: 抽象メソッド ``__float__`` を備えた ABC です。
ru: ABC с одним абстрактным методом ``__float__``.

source: An ABC with one abstract method ``__index__``.
ja: 抽象メソッド ``__index__`` を備えた ABC です。
ru: ABC с одним абстрактным методом ``__index__``.

source: An ABC with one abstract method ``__int__``.
ja: 抽象メソッド ``__int__`` を備えた ABC です。
ru: ABC с одним абстрактным методом ``__int__``.

source: An ABC with one abstract method ``__round__`` that is covariant in its return type.
ja: 返り値の型と共変な抽象メソッド ``__round__`` を備えた ABC です。
ru: ABC с одним абстрактным методом ``__round__``, ковариантным по типу возвращаемого значения.

source: ABCs for working with IO
ru: Азбука работы с IO

source: Generic type ``IO[AnyStr]`` and its subclasses ``TextIO(IO[str])`` and ``BinaryIO(IO[bytes])`` represent the types of I/O streams such as returned by :func:`open`.
ja: ジェネリック型 ``IO[AnyStr]`` とそのサブクラスの ``TextIO(IO[str])`` および ``BinaryIO(IO[bytes])`` は、 :func:`open` 関数が返すような I/O ストリームの型を表します。
ru: Общий тип ``IO[AnyStr]`` и его подклассы ``TextIO(IO[str])`` и ``BinaryIO(IO[bytes])`` представляют типы потоков ввода-вывода, например, возвращаемые :func :`открыто`.

source: Functions and decorators
ru: Функции и декораторы

source: Cast a value to a type.
ja: 値をある型にキャストします。
ru: Приведите значение к типу.
