Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/typing.po
Languages: ja, ru

source: The ``SendType`` parameter now has a default.
ru: Параметр SendType теперь имеет значение по умолчанию.

source: Deprecated alias to :class:`collections.abc.AsyncIterable`.
ru: Устаревший псевдоним :class:`collections.abc.AsyncIterable`.

source: :class:`collections.abc.AsyncIterable` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
ru: :class:`collections.abc.AsyncIterable` теперь поддерживает подписку (``[]``). См. :pep:`585` и :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.AsyncIterator`.
ru: Устаревший псевдоним :class:`collections.abc.AsyncIterator`.

source: :class:`collections.abc.AsyncIterator` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
ru: :class:`collections.abc.AsyncIterator` теперь поддерживает подписку (``[]``). См. :pep:`585` и :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.Awaitable`.
ru: Устаревший псевдоним :class:`collections.abc.Awaitable`.

source: :class:`collections.abc.Awaitable` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
ru: :class:`collections.abc.Awaitable` теперь поддерживает подписку (``[]``). См. :pep:`585` и :ref:`types-genericalias`.

source: Aliases to other ABCs in :mod:`collections.abc`
ru: Псевдонимы других ABC в :mod:`collections.abc`

source: Deprecated alias to :class:`collections.abc.Iterable`.
ru: Устаревший псевдоним :class:`collections.abc.Iterable`.

source: :class:`collections.abc.Iterable` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
ru: :class:`collections.abc.Iterable` теперь поддерживает подписку (``[]``). См. :pep:`585` и :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.Iterator`.
ru: Устаревший псевдоним :class:`collections.abc.Iterator`.

source: :class:`collections.abc.Iterator` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
ru: :class:`collections.abc.Iterator` теперь поддерживает подписку (``[]``). См. :pep:`585` и :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.Callable`.
ru: Устаревший псевдоним :class:`collections.abc.Callable`.

source: See :ref:`annotating-callables` for details on how to use :class:`collections.abc.Callable` and ``typing.Callable`` in type annotations.
ru: См. :ref:`annotating-callables` для получения подробной информации о том, как использовать :class:`collections.abc.Callable` и ``typing.Callable`` в аннотациях типов.

source: :class:`collections.abc.Callable` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
ru: :class:`collections.abc.Callable` теперь поддерживает подписку (``[]``). См. :pep:`585` и :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.Generator`.
ru: Устаревший псевдоним :class:`collections.abc.Generator`.

source: See :ref:`annotating-generators-and-coroutines` for details on using :class:`collections.abc.Generator` and ``typing.Generator`` in type annotations.
ru: См. :ref:`annotating-generators-and-coroutines` для получения подробной информации об использовании :class:`collections.abc.Generator` и ``typing.Generator`` в аннотациях типов.

source: :class:`collections.abc.Generator` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
ru: :class:`collections.abc.Generator` теперь поддерживает подписку (``[]``). См. :pep:`585` и :ref:`types-genericalias`.

source: Default values for the send and return types were added.
ru: Были добавлены значения по умолчанию для типов отправки и возврата.

source: Deprecated alias to :class:`collections.abc.Hashable`.
ru: Устаревший псевдоним :class:`collections.abc.Hashable`.

source: Use :class:`collections.abc.Hashable` directly instead.
ru: Вместо этого используйте :class:`collections.abc.Hashable` напрямую.

source: Deprecated alias to :class:`collections.abc.Reversible`.
ru: Устаревший псевдоним :class:`collections.abc.Reversible`.

source: :class:`collections.abc.Reversible` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
ru: :class:`collections.abc.Reversible` теперь поддерживает подписку (``[]``). См. :pep:`585` и :ref:`types-genericalias`.

source: Deprecated alias to :class:`collections.abc.Sized`.
ru: Устаревший псевдоним :class:`collections.abc.Sized`.

source: Use :class:`collections.abc.Sized` directly instead.
ru: Вместо этого используйте :class:`collections.abc.Sized` напрямую.

source: Aliases to :mod:`contextlib` ABCs
ru: Псевдонимы :mod:`contextlib` ABC

source: Deprecated alias to :class:`contextlib.AbstractContextManager`.
ru: Устаревший псевдоним :class:`contextlib.AbstractContextManager`.

source: The first type parameter, ``T_co``, represents the type returned by the :meth:`~object.__enter__` method. The optional second type parameter, ``ExitT_co``, which defaults to ``bool | None``, represents the type returned by the :meth:`~object.__exit__` method.
ru: Первый параметр типа, T_co, представляет тип, возвращаемый методом :meth:`~object.__enter__`. Необязательный параметр второго типа ExitT_co, который по умолчанию имеет значение bool | None`` представляет тип, возвращаемый методом :meth:`~object.__exit__`.

source: :class:`contextlib.AbstractContextManager` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
ru: :class:`contextlib.AbstractContextManager` теперь поддерживает индексацию (``[]``). См. :pep:`585` и :ref:`types-genericalias`.

source: Added the optional second type parameter, ``ExitT_co``.
ru: Добавлен необязательный параметр второго типа ExitT_co.

source: Deprecated alias to :class:`contextlib.AbstractAsyncContextManager`.
ru: Устаревший псевдоним :class:`contextlib.AbstractAsyncContextManager`.

source: The first type parameter, ``T_co``, represents the type returned by the :meth:`~object.__aenter__` method. The optional second type parameter, ``AExitT_co``, which defaults to ``bool | None``, represents the type returned by the :meth:`~object.__aexit__` method.
ru: Первый параметр типа, ``T_co``, представляет тип, возвращаемый методом :meth:`~object.__aenter__`. Необязательный параметр второго типа, ``AExitT_co``, который по умолчанию имеет значение ``bool | None`` представляет тип, возвращаемый методом :meth:`~object.__aexit__`.

source: :class:`contextlib.AbstractAsyncContextManager` now supports subscripting (``[]``). See :pep:`585` and :ref:`types-genericalias`.
ru: :class:`contextlib.AbstractAsyncContextManager` теперь поддерживает индексацию (``[]``). См. :pep:`585` и :ref:`types-genericalias`.

source: Added the optional second type parameter, ``AExitT_co``.
ru: Добавлен необязательный параметр второго типа ``AExitT_co``.

source: Deprecation Timeline of Major Features
ru: График прекращения поддержки основных функций

source: Certain features in ``typing`` are deprecated and may be removed in a future version of Python. The following table summarizes major deprecations for your convenience. This is subject to change, and not all deprecations are listed.
ru: Некоторые функции набора текста устарели и могут быть удалены в будущих версиях Python. Для вашего удобства в следующей таблице приведены основные устаревшие версии. Это может быть изменено, и не все устаревшие перечислены.

source: Feature
ru: Особенность

source: Deprecated in
ru: Устарело в

source: Projected removal
ru: Прогнозируемое удаление

source: ``typing`` versions of standard collections
ru: ``typing`` версии стандартных коллекций

source: Undecided (see :ref:`deprecated-aliases` for more information)
ru: Не определено (см. :ref:`deprecated-aliases` для получения дополнительной информации)

source: Undecided
ru: Не определившиеся

source: :class:`typing.Hashable` and :class:`typing.Sized`
ru: :class:`typing.Hashable` и :class:`typing.Sized`

source: The Python runtime does not enforce function and variable type annotations. They can be used by third party tools such as type checkers, IDEs, linters, etc.
ja: Python ランタイムは、関数や変数の型アノテーションを強制しません。型アノテーションは、型チェッカー、IDE、linterなどのサードパーティーツールで使われます。

source: This module provides runtime support for type hints. The most fundamental support consists of the types :data:`Any`, :data:`Union`, :data:`Callable`, :class:`TypeVar`, and :class:`Generic`. For a full specification, please see :pep:`484`. For a simplified introduction to type hints, see :pep:`483`.
ja: このモジュールは型ヒントに関するランタイムへのサポートを提供します。最も基本的な型として :data:`Any` 、 :data:`Union` 、 :data:`Callable` 、 :class:`TypeVar` 、 :class:`Generic` が存在します。完全な仕様は :pep:`484` に記載があります。型ヒントへの簡潔な導入は :pep:`483` に記載があります。

source: The function below takes and returns a string and is annotated as follows::
ja: 以下の関数は文字列を受け取って文字列を返す関数で、次のようにアノテーションがつけられます::

source: In the function ``greeting``, the argument ``name`` is expected to be of type :class:`str` and the return type :class:`str`. Subtypes are accepted as arguments.
ja: 関数 ``greeting`` で、実引数 ``name`` の型は :class:`str` であり、返り値の型は :class:`str` であることが期待されます。サブタイプも実引数として許容されます。

source: New features are frequently added to the ``typing`` module. The `typing_extensions <https://pypi.org/project/typing-extensions/>`_ package provides backports of these new features to older versions of Python.
ja: ``typing`` モジュールには新しい機能が頻繁に追加されています。 `typing_extensions <https://pypi.org/project/typing-extensions/>`_ パッケージは、古いバージョンの Python への新しい機能のバックポートを提供しています。

source: Relevant PEPs
ja: 関連する PEP

source: *Introducing* syntax for annotating variables outside of function definitions, and :data:`ClassVar`
ja: 関数定義の外の変数と :data:`ClassVar` のための型アノテーションの構文の導入

source: *Introducing* :class:`Protocol` and the :func:`@runtime_checkable<runtime_checkable>` decorator
ja: :class:`Protocol` と、 :func:`@runtime_checkable<runtime_checkable>` のデコレーターの導入

source: *Introducing* :class:`types.GenericAlias` and the ability to use standard library classes as :ref:`generic types<types-genericalias>`
ja: :class:`types.GenericAlias` と、標準ライブラリのクラスを :ref:`ジェネリック型<types-genericalias>` として利用する機能の導入

source: *Introducing* :class:`TypedDict`
ja: :class:`TypedDict` の導入

source: *Introducing* :data:`Final` and the :func:`@final<final>` decorator
ja: :data:`Final` と、 :func:`@final<final>` デコレータの導入

source: A type alias is defined by assigning the type to the alias. In this example, ``Vector`` and ``list[float]`` will be treated as interchangeable synonyms::
ja: 型エイリアスは、型をエイリアスに割り当てて定義されます。 この例では、``Vector`` と ``list[float]`` が置き換え可能な同義語として扱われます::

source: Note that ``None`` as a type hint is a special case and is replaced by ``type(None)``.
ja: 型ヒントとしての ``None`` は特別なケースであり、 ``type(None)`` によって置き換えられます。

source: This also means that it is not possible to create a subtype of ``Derived`` since it is an identity function at runtime, not an actual type::
ja: これは ``Derived`` のサブタイプを作ることが出来ないということも意味しています。 ``Derived`` は実行時には恒等関数になっていて、実際の型ではないからです::

source: However, it is possible to create a :func:`NewType` based on a 'derived' ``NewType``::
ja: しかし、 'derived' である ``NewType`` をもとにした :func:`NewType` は作ることが出来ます::

source: Recall that the use of a type alias declares two types to be *equivalent* to one another. Doing ``Alias = Original`` will make the static type checker treat ``Alias`` as being *exactly equivalent* to ``Original`` in all cases. This is useful when you want to simplify complex type signatures.
ja: 型エイリアスの使用は二つの型が互いに *等価* だと宣言している、ということを思い出してください。 ``Alias = Original`` とすると、静的型検査器は ``Alias`` をすべての場合において ``Original`` と *完全に等価* なものとして扱います。これは複雑な型シグネチャを単純化したい時に有用です。

source: Callable
ja: 呼び出し可能オブジェクト

source: Frameworks expecting callback functions of specific signatures might be type hinted using ``Callable[[Arg1Type, Arg2Type], ReturnType]``.
ja: 特定のシグネチャを持つコールバック関数を要求されるフレームワークでは、 ``Callable[[Arg1Type, Arg2Type], ReturnType]`` を使って型ヒントを付けます。

source: It is possible to declare the return type of a callable without specifying the call signature by substituting a literal ellipsis for the list of arguments in the type hint: ``Callable[..., ReturnType]``.
ja: 型ヒントの実引数の型を ellipsis で置き換えることで呼び出しシグニチャを指定せずに callable の戻り値の型を宣言することができます: ``Callable[..., ReturnType]``。

source: Generics
ja: ジェネリクス

source: Since type information about objects kept in containers cannot be statically inferred in a generic way, abstract base classes have been extended to support subscription to denote expected types for container elements.
ja: コンテナ内のオブジェクトについての型情報は一般的な方法では静的に推論できないため、抽象基底クラスを継承したクラスが実装され、期待されるコンテナの要素の型を示すために添字表記をサポートするようになりました。

source: Generics can be parameterized by using a factory available in typing called :class:`TypeVar`.
ja: ジェネリクスは、 typing にある :class:`TypeVar` と呼ばれるファクトリを使ってパラメータ化することができます。

source: ``Generic[T]`` as a base class defines that the class ``LoggedVar`` takes a single type parameter ``T`` . This also makes ``T`` valid as a type within the class body.
ja: ``Generic[T]`` を基底クラスにすることで、 ``LoggedVar`` クラスが 1 つの型引数 ``T`` をとる、と定義できます。 この定義により、クラスの本体の中でも ``T`` が型として有効になります。

source: You can use multiple inheritance with :class:`Generic`::
ja: :class:`Generic` を用いて多重継承が可能です::

source: When inheriting from generic classes, some type variables could be fixed::
ja: ジェネリッククラスを継承するとき、いくつかの型変数を固定することが出来ます::

source: Using a generic class without specifying type parameters assumes :data:`Any` for each position. In the following example, ``MyIterable`` is not generic but implicitly inherits from ``Iterable[Any]``::
ja: 型引数を指定せずにジェネリッククラスを使う場合、それぞれの型引数に :data:`Any` を与えられたものとして扱います。 次の例では、``MyIterable`` はジェネリックではありませんが ``Iterable[Any]`` を暗黙的に継承しています::

source: User defined generic type aliases are also supported. Examples::
ja: ユーザ定義のジェネリック型エイリアスもサポートされています。例::

source: A user-defined generic class can have ABCs as base classes without a metaclass conflict. Generic metaclasses are not supported. The outcome of parameterizing generics is cached, and most types in the typing module are hashable and comparable for equality.
ja: ユーザーが定義したジェネリッククラスはメタクラスの衝突を起こすことなく基底クラスに抽象基底クラスをとれます。 ジェネリックメタクラスはサポートされません。 パラメータ化を行うジェネリクスの結果はキャッシュされていて、 typing モジュールのほとんどの型はハッシュ化でき、等価比較できます。

source: Notice that no typechecking is performed when assigning a value of type :data:`Any` to a more precise type. For example, the static type checker did not report an error when assigning ``a`` to ``s`` even though ``s`` was declared to be of type :class:`str` and receives an :class:`int` value at runtime!
ja: :data:`Any` 型の値をより詳細な型に代入する時に型検査が行われないことに注意してください。例えば、静的型検査器は ``a`` を ``s`` に代入する時、``s`` が :class:`str` 型として宣言されていて実行時に :class:`int` の値を受け取るとしても、エラーを報告しません。

source: The module defines the following classes, functions and decorators.
ja: このモジュールでは以下のクラス、関数、デコレータを定義します。

source: This module defines several types that are subclasses of pre-existing standard library classes which also extend :class:`Generic` to support type variables inside ``[]``. These types became redundant in Python 3.9 when the corresponding pre-existing classes were enhanced to support ``[]``.
ja: このモジュールは、既存の標準ライブラリクラスのサブクラスかつ、 ``[]`` 内の型変数をサポートするために :class:`Generic` を拡張している、いくつかの型を定義しています。 これらの型は、既存の相当するクラスが ``[]`` をサポートするように拡張されたときに Python 3.9 で廃止になりました。

source: The redundant types are deprecated as of Python 3.9 but no deprecation warnings will be issued by the interpreter. It is expected that type checkers will flag the deprecated types when the checked program targets Python 3.9 or newer.
ja: 余計な型は Python 3.9 で非推奨になりましたが、非推奨の警告はどれもインタープリタから通告されません。 型チェッカーがチェックするプログラムの対照が Python 3.9 もしくはそれ以降のときに、非推奨の型に目印を付けることが期待されています。

source: The deprecated types will be removed from the :mod:`typing` module in the first Python version released 5 years after the release of Python 3.9.0. See details in :pep:`585`—*Type Hinting Generics In Standard Collections*.
ja: 非推奨の型は、Python 3.9.0 のリリースから5年後の初めての Python バージョンで :mod:`typing` モジュールから削除されます。 詳しいことは :pep:`585`—*Type Hinting Generics In Standard Collections* を参照してください。

source: These can be used as types in annotations and do not support ``[]``.
ja: これらはアノテーションの内部の型として使えますが、``[]`` はサポートしていません。

source: Special type indicating that a function never returns. For example::
ja: 関数が返り値を持たないことを示す特別な型です。例えば次のように使います::

source: These can be used as types in annotations using ``[]``, each having a unique syntax.
ja: これらは ``[]`` を使ったアノテーションの内部の型として使え、それぞれ固有の文法があります。

source: Tuple type; ``Tuple[X, Y]`` is the type of a tuple of two items with the first item of type X and the second of type Y. The type of the empty tuple can be written as ``Tuple[()]``.
ja: タプル型; ``Tuple[X, Y]`` は、最初の要素の型が X で、2つ目の要素の型が Y であるような、2つの要素を持つタプルの型です。 空のタプルの型は ``Tuple[()]`` と書けます。

source: Example: ``Tuple[T1, T2]`` is a tuple of two elements corresponding to type variables T1 and T2. ``Tuple[int, float, str]`` is a tuple of an int, a float and a string.
ja: 例: ``Tuple[T1, T2]`` は型変数 T1 と T2 に対応する2つの要素を持つタプルです。``Tuple[int, float, str]`` は int と float、 string のタプルです。

source: To specify a variable-length tuple of homogeneous type, use literal ellipsis, e.g. ``Tuple[int, ...]``. A plain :data:`Tuple` is equivalent to ``Tuple[Any, ...]``, and in turn to :class:`tuple`.
ja: 同じ型の任意の長さのタプルを指定するには ellipsis リテラルを用います。例: ``Tuple[int, ...]``。ただの :data:`Tuple` は ``Tuple[Any, ...]`` と等価で、さらに :class:`tuple` と等価です。.

source: :class:`builtins.tuple <tuple>` now supports ``[]``. See :pep:`585` and :ref:`types-genericalias`.
ja: :class:`builtins.tuple <tuple>` は ``[]`` をサポートするようになりました。 :pep:`585` と :ref:`types-genericalias` を参照してください。

source: Union type; ``Union[X, Y]`` means either X or Y.
ja: ユニオン型; ``Union[X, Y]`` は X または Y を表します。

source: To define a union, use e.g. ``Union[int, str]``. Details:
ja: ユニオン型を定義します、例えば ``Union[int, str]`` のように使います。詳細:

source: You cannot subclass or instantiate a union.
ja: ユニオン型のサブクラスを作成したり、インスタンスを作成することは出来ません。

source: You can use ``Optional[X]`` as a shorthand for ``Union[X, None]``.
ja: ``Optional[X]`` を ``Union[X, None]`` の略記として利用することが出来ます。

source: Optional type.
ja: オプショナル型。

source: ``Optional[X]`` is equivalent to ``Union[X, None]``.
ja: ``Optional[X]`` は ``Union[X, None]`` と同値です。

source: Callable type; ``Callable[[int], str]`` is a function of (int) -> str.
ja: 呼び出し可能型; ``Callable[[int], str]`` は (int) -> str の関数です。

source: The subscription syntax must always be used with exactly two values: the argument list and the return type. The argument list must be a list of types or an ellipsis; the return type must be a single type.
ja: 添字表記は常に2つの値とともに使われなければなりません: 実引数のリストと返り値の型です。 実引数のリストは型のリストか ellipsis でなければなりません; 返り値の型は単一の型でなければなりません。

source: There is no syntax to indicate optional or keyword arguments; such function types are rarely used as callback types. ``Callable[..., ReturnType]`` (literal ellipsis) can be used to type hint a callable taking any number of arguments and returning ``ReturnType``. A plain :data:`Callable` is equivalent to ``Callable[..., Any]``, and in turn to :class:`collections.abc.Callable`.
ja: オプショナル引数やキーワード引数を表すための文法はありません; そのような関数型はコールバックの型として滅多に使われません。 ``Callable[..., ReturnType]`` (リテラルの Ellipsis) は任意の個数の引数をとり ``ReturnType`` を返す型ヒントを与えるために使えます。 普通の :data:`Callable` は ``Callable[..., Any]`` と同等で、 :class:`collections.abc.Callable` でも同様です。

source: :class:`collections.abc.Callable` now supports ``[]``. See :pep:`585` and :ref:`types-genericalias`.
ja: :class:`collections.abc.Callable` は ``[]`` をサポートするようになりました。 :pep:`585` と :ref:`types-genericalias` を参照してください。

source: A variable annotated with ``C`` may accept a value of type ``C``. In contrast, a variable annotated with ``Type[C]`` may accept values that are classes themselves -- specifically, it will accept the *class object* of ``C``. For example::
ja: ``C`` と注釈が付けされた変数は ``C`` 型の値を受理します。一方で ``Type[C]`` と注釈が付けられた変数は、そのクラス自身を受理します -- 具体的には、それは ``C`` の *クラスオブジェクト* を受理します。例::

source: Note that ``Type[C]`` is covariant::
ja: ``Type[C]`` は共変であることに注意してください::

source: The fact that ``Type[C]`` is covariant implies that all subclasses of ``C`` should implement the same constructor signature and class method signatures as ``C``. The type checker should flag violations of this, but should also allow constructor calls in subclasses that match the constructor calls in the indicated base class. How the type checker is required to handle this particular case may change in future revisions of :pep:`484`.
ja: ``Type[C]`` が共変だということは、 ``C`` の全てのサブクラスは、 ``C`` と同じシグネチャのコンストラクタとクラスメソッドを実装すべきだということになります。 型チェッカーはこの規則への違反に印を付けるべきですが、サブクラスでのコンストラクタ呼び出しで、指定された基底クラスのコンストラクタ呼び出しに適合するものは許可すべきです。 この特別な場合を型チェッカーがどう扱うべきかについては、 :pep:`484` の将来のバージョンで変更されるかもしれません。

source: The only legal parameters for :class:`Type` are classes, :data:`Any`, :ref:`type variables <generics>`, and unions of any of these types. For example::
ja: :class:`Type` で許されているパラメータは、クラス、 :data:`Any` 、 :ref:`型変数 <generics>` あるいは、それらの直和型だけです。 例えば次のようになります::

source: ``Type[Any]`` is equivalent to ``Type`` which in turn is equivalent to ``type``, which is the root of Python's metaclass hierarchy.
ja: ``Type[Any]`` は ``Type`` と等価で、同様に ``Type`` は ``type`` と等価です。``type`` は Python のメタクラス階層のルートです。

source: :class:`builtins.type <type>` now supports ``[]``. See :pep:`585` and :ref:`types-genericalias`.
ja: :class:`builtins.type <type>` は ``[]`` をサポートするようになりました。 :pep:`585` と :ref:`types-genericalias` を参照してください。

source: A type that can be used to indicate to type checkers that the corresponding variable or function parameter has a value equivalent to the provided literal (or one of several literals). For example::
ja: 型チェッカーに、変数や関数引数と対応する与えられたリテラル (あるいはいくつかあるリテラルのうちの 1 つ) が同等な値を持つことを表すのに使える型です。

source: A special typing construct to indicate to type checkers that a name cannot be re-assigned or overridden in a subclass. For example::
ja: 特別な型付けの構成要素で、名前の割り当て直しやサブクラスでのオーバーライドができないことを型チェッカーに示すためのものです。 例えば::

source: A type, introduced in :pep:`593` (``Flexible function and variable annotations``), to decorate existing types with context-specific metadata (possibly multiple pieces of it, as ``Annotated`` is variadic). Specifically, a type ``T`` can be annotated with metadata ``x`` via the typehint ``Annotated[T, x]``. This metadata can be used for either static analysis or at runtime. If a library (or tool) encounters a typehint ``Annotated[T, x]`` and has no special logic for metadata ``x``, it should ignore it and simply treat the type as ``T``. Unlike the ``no_type_check`` functionality that currently exists in the ``typing`` module which completely disables typechecking annotations on a function or a class, the ``Annotated`` type allows for both static typechecking of ``T`` (which can safely ignore ``x``) together with runtime access to ``x`` within a specific application.
ja: :pep:`593` (``Flexible function and variable annotations``) で導入された型で、コンテキストに特定のメタデータ (もしかすると、可変個引数の ``Annotated`` になるメタデータの複数の破片) を持つ既存の型を装飾します。 具体的には、型 ``T`` は ``Annotated[T, x]`` という型ヒントでメタデータ ``x`` の注釈を付けられます。 メタデータは静的解析でも実行時解析でも使用できます。 ライブラリ (あるいはツール) に型ヒント ``Annotated[T, x]`` が出てきて、メタデータ ``x`` に特別なロジックが無い場合は、メタデータ ``x`` は無視され、この型は ``T`` として扱われるだけです。 関数やクラス上のアノテーションの型検査を一切しなくなる現時点の ``typing`` モジュールにある ``no_type_check`` の機能とは違って、 ``Annotated`` 型は ``T`` の (安全に ``x`` を無視できる) 静的型検査も、特定のアプリケーション内の ``x`` への実行時のアクセスも許可されています。

source: A generic type is typically declared by inheriting from an instantiation of this class with one or more type variables. For example, a generic mapping type might be defined as::
ja: ジェネリック型は典型的にはこのクラスを1つ以上の型変数によってインスタンス化したものを継承することによって宣言されます。例えば、ジェネリックマップ型は次のように定義することが出来ます::
