Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/unittest.po
Languages: ru

source: Tests can be numerous, and their set-up can be repetitive. Luckily, we can factor out set-up code by implementing a method called :meth:`~TestCase.setUp`, which the testing framework will automatically call for every single test we run::
ru: Тестов может быть множество, а их настройка может повторяться. К счастью, мы можем выделить код настройки, реализовав метод :meth:`~TestCase.setUp`, который среда тестирования будет автоматически вызывать для каждого запускаемого нами теста:

source: The order in which the various tests will be run is determined by sorting the test method names with respect to the built-in ordering for strings.
ru: Порядок, в котором будут выполняться различные тесты, определяется путем сортировки имен тестовых методов относительно встроенного порядка строк.

source: If the :meth:`~TestCase.setUp` method raises an exception while the test is running, the framework will consider the test to have suffered an error, and the test method will not be executed.
ru: Если метод :meth:`~TestCase.setUp` вызывает исключение во время выполнения теста, платформа посчитает, что в тесте произошла ошибка, и метод теста не будет выполнен.

source: Similarly, we can provide a :meth:`~TestCase.tearDown` method that tidies up after the test method has been run::
ru: Аналогичным образом мы можем предоставить метод :meth:`~TestCase.tearDown`, который наводит порядок после запуска тестового метода::

source: If :meth:`~TestCase.setUp` succeeded, :meth:`~TestCase.tearDown` will be run whether the test method succeeded or not.
ru: Если :meth:`~TestCase.setUp` завершился успешно, :meth:`~TestCase.tearDown` будет запущен независимо от того, удался тестовый метод или нет.

source: Such a working environment for the testing code is called a :dfn:`test fixture`. A new TestCase instance is created as a unique test fixture used to execute each individual test method. Thus :meth:`~TestCase.setUp`, :meth:`~TestCase.tearDown`, and :meth:`~TestCase.__init__` will be called once per test.
ru: Такая рабочая среда для тестируемого кода называется тестовым приспособлением. Новый экземпляр TestCase создается как уникальное тестовое приспособление, используемое для выполнения каждого отдельного метода тестирования. Таким образом, :meth:`~TestCase.setUp`, :meth:`~TestCase.tearDown` и :meth:`~TestCase.__init__` будут вызываться один раз для каждого теста.

source: It is recommended that you use TestCase implementations to group tests together according to the features they test. :mod:`unittest` provides a mechanism for this: the :dfn:`test suite`, represented by :mod:`unittest`'s :class:`TestSuite` class. In most cases, calling :func:`unittest.main` will do the right thing and collect all the module's test cases for you and execute them.
ru: Рекомендуется использовать реализации TestCase для группировки тестов в соответствии с проверяемыми ими функциями. :mod:`unittest` предоставляет для этого механизм: :dfn:`test suite`, представленный классом :class:`TestSuite` :mod:`unittest`. В большинстве случаев вызов :func:`unittest.main` поступит правильно: соберет для вас все тестовые примеры модуля и выполнит их.

source: However, should you want to customize the building of your test suite, you can do it yourself::
ru: Однако если вы захотите настроить построение своего набора тестов, вы можете сделать это самостоятельно:

source: You can place the definitions of test cases and test suites in the same modules as the code they are to test (such as :file:`widget.py`), but there are several advantages to placing the test code in a separate module, such as :file:`test_widget.py`:
ru: Вы можете поместить определения тестовых примеров и наборов тестов в те же модули, что и тестируемый код (например, :file:`widget.py`), но размещение тестового кода в отдельном модуле имеет несколько преимуществ: например :file:`test_widget.py`:

source: The test module can be run standalone from the command line.
ru: Тестовый модуль можно запустить автономно из командной строки.

source: The test code can more easily be separated from shipped code.
ru: Тестовый код легче отделить от поставляемого кода.

source: There is less temptation to change test code to fit the code it tests without a good reason.
ru: Меньше соблазна без уважительной причины изменить тестовый код, чтобы он соответствовал тестируемому коду.

source: Test code should be modified much less frequently than the code it tests.
ru: Тестовый код следует изменять гораздо реже, чем код, который он тестирует.

source: Tested code can be refactored more easily.
ru: Протестированный код можно легче реорганизовать.

source: Tests for modules written in C must be in separate modules anyway, so why not be consistent?
ru: Тесты для модулей, написанных на C, в любом случае должны быть в отдельных модулях, так почему бы не быть последовательными?

source: If the testing strategy changes, there is no need to change the source code.
ru: Если стратегия тестирования изменится, нет необходимости менять исходный код.

source: Re-using old test code
ru: Повторное использование старого тестового кода

source: Some users will find that they have existing test code that they would like to run from :mod:`unittest`, without converting every old test function to a :class:`TestCase` subclass.
ru: Некоторые пользователи обнаружат, что у них уже есть тестовый код, который они хотели бы запустить из :mod:`unittest`, без преобразования каждой старой тестовой функции в подкласс :class:`TestCase`.

source: For this reason, :mod:`unittest` provides a :class:`FunctionTestCase` class. This subclass of :class:`TestCase` can be used to wrap an existing test function. Set-up and tear-down functions can also be provided.
ru: По этой причине :mod:`unittest` предоставляет класс :class:`FunctionTestCase`. Этот подкласс :class:`TestCase` можно использовать для обертывания существующей тестовой функции. Также могут быть предусмотрены функции установки и демонтажа.

source: Given the following test function::
ru: Учитывая следующую тестовую функцию::

source: one can create an equivalent test case instance as follows, with optional set-up and tear-down methods::
ru: можно создать эквивалентный экземпляр тестового примера следующим образом, с дополнительными методами настройки и удаления:

source: Even though :class:`FunctionTestCase` can be used to quickly convert an existing test base over to a :mod:`unittest`\ -based system, this approach is not recommended. Taking the time to set up proper :class:`TestCase` subclasses will make future test refactorings infinitely easier.
ru: Несмотря на то, что :class:`FunctionTestCase` можно использовать для быстрого преобразования существующей тестовой базы в систему на основе :mod:`unittest`\, этот подход не рекомендуется. Потратив время на настройку правильных подклассов :class:`TestCase`, вы значительно упростите будущие рефакторинги тестов.

source: In some cases, the existing tests may have been written using the :mod:`doctest` module. If so, :mod:`doctest` provides a :class:`DocTestSuite` class that can automatically build :class:`unittest.TestSuite` instances from the existing :mod:`doctest`\ -based tests.
ru: В некоторых случаях существующие тесты могут быть написаны с использованием модуля :mod:`doctest`. Если да, то :mod:`doctest` предоставляет класс :class:`DocTestSuite`, который может автоматически создавать экземпляры :class:`unittest.TestSuite` из существующих тестов на основе :mod:`doctest`\.

source: Skipping tests and expected failures
ru: Пропуск тестов и ожидаемые сбои

source: Unittest supports skipping individual test methods and even whole classes of tests. In addition, it supports marking a test as an "expected failure," a test that is broken and will fail, but shouldn't be counted as a failure on a :class:`TestResult`.
ru: Unittest поддерживает пропуск отдельных методов тестирования и даже целых классов тестов. Кроме того, он поддерживает пометку теста как «ожидаемого сбоя», теста, который не работает и завершится неудачно, но не должен считаться сбоем в :class:`TestResult`.

source: Skipping a test is simply a matter of using the :func:`skip` :term:`decorator` or one of its conditional variants, calling :meth:`TestCase.skipTest` within a :meth:`~TestCase.setUp` or test method, or raising :exc:`SkipTest` directly.
ru: Пропустить тест можно просто с помощью :func:`skip` :term:`decorator` или одного из его условных вариантов, вызывая :meth:`TestCase.skipTest` внутри :meth:`~TestCase.setUp` или тестовый метод или вызов :exc:`SkipTest` напрямую.

source: Basic skipping looks like this::
ru: Базовый пропуск выглядит так::

source: This is the output of running the example above in verbose mode::
ru: Это результат выполнения приведенного выше примера в подробном режиме:

source: Classes can be skipped just like methods::
ru: Классы можно пропускать так же, как и методы::

source: :meth:`TestCase.setUp` can also skip the test. This is useful when a resource that needs to be set up is not available.
ru: :meth:`TestCase.setUp` также может пропустить тест. Это полезно, когда ресурс, который необходимо настроить, недоступен.

source: Expected failures use the :func:`expectedFailure` decorator. ::
ru: Ожидаемые сбои используют декоратор :func:`expectedFailure`. ::

source: It's easy to roll your own skipping decorators by making a decorator that calls :func:`skip` on the test when it wants it to be skipped. This decorator skips the test unless the passed object has a certain attribute::
ru: Легко создавать собственные декораторы пропуска, создав декоратор, который вызывает :func:`skip` в тесте, когда он хочет, чтобы его пропустили. Этот декоратор пропускает проверку, если переданный объект не имеет определенного атрибута::

source: The following decorators and exception implement test skipping and expected failures:
ru: Следующие декораторы и исключения реализуют пропуск тестов и ожидаемые сбои:

source: Unconditionally skip the decorated test. *reason* should describe why the test is being skipped.
ru: Безоговорочно пропустите оформленный тест. *причина* должна описывать, почему тест пропускается.

source: Skip the decorated test if *condition* is true.
ru: Пропустить декорированный тест, если *условие* истинно.

source: Skip the decorated test unless *condition* is true.
ru: Пропустить декорированный тест, если *условие* не истинно.

source: Mark the test as an expected failure or error. If the test fails or errors in the test function itself (rather than in one of the :dfn:`test fixture` methods) then it will be considered a success. If the test passes, it will be considered a failure.
ru: Отметьте тест как ожидаемый сбой или ошибку. Если тест не пройден или возникли ошибки в самой тестовой функции (а не в одном из методов :dfn:`test приспособления`), то он будет считаться успешным. Если тест пройден успешно, это будет считаться неудачным.

source: This exception is raised to skip a test.
ru: Это исключение вызывается для пропуска теста.

source: Usually you can use :meth:`TestCase.skipTest` or one of the skipping decorators instead of raising this directly.
ru: Обычно вы можете использовать :meth:`TestCase.skipTest` или один из пропущенных декораторов вместо того, чтобы вызывать это напрямую.

source: Skipped tests will not have :meth:`~TestCase.setUp` or :meth:`~TestCase.tearDown` run around them. Skipped classes will not have :meth:`~TestCase.setUpClass` or :meth:`~TestCase.tearDownClass` run. Skipped modules will not have :func:`setUpModule` or :func:`tearDownModule` run.
ru: Пропущенные тесты не будут выполняться вокруг них :meth:`~TestCase.setUp` или :meth:`~TestCase.tearDown`. Пропущенные классы не будут запускаться :meth:`~TestCase.setUpClass` или :meth:`~TestCase.tearDownClass`. Пропущенные модули не будут запускаться :func:`setUpModule` или :func:`tearDownModule`.

source: Distinguishing test iterations using subtests
ru: Различение итераций теста с помощью подтестов

source: When there are very small differences among your tests, for instance some parameters, unittest allows you to distinguish them inside the body of a test method using the :meth:`~TestCase.subTest` context manager.
ru: Если между вашими тестами есть очень небольшие различия, например некоторые параметры, unittest позволяет вам различать их внутри тела метода тестирования с помощью контекстного менеджера :meth:`~TestCase.subTest`.

source: For example, the following test::
ru: Например, следующий тест:

source: will produce the following output::
ru: выдаст следующий результат::

source: Without using a subtest, execution would stop after the first failure, and the error would be less easy to diagnose because the value of ``i`` wouldn't be displayed::
ru: Без использования подтеста выполнение остановилось бы после первого сбоя, и ошибку было бы труднее диагностировать, поскольку значение ``i`` не будет отображаться:

source: Classes and functions
ru: Классы и функции

source: This section describes in depth the API of :mod:`unittest`.
ru: В этом разделе подробно описывается API :mod:`unittest`.

source: Test cases
ru: Тестовые примеры

source: Instances of the :class:`TestCase` class represent the logical test units in the :mod:`unittest` universe. This class is intended to be used as a base class, with specific tests being implemented by concrete subclasses. This class implements the interface needed by the test runner to allow it to drive the tests, and methods that the test code can use to check for and report various kinds of failure.
ru: Экземпляры класса :class:`TestCase` представляют собой логические тестовые модули во вселенной :mod:`unittest`. Этот класс предназначен для использования в качестве базового класса, при этом конкретные тесты реализуются конкретными подклассами. Этот класс реализует интерфейс, необходимый средству запуска тестов, чтобы позволить ему управлять тестами, а также методы, которые тестовый код может использовать для проверки и сообщения о различных типах сбоев.

source: Each instance of :class:`TestCase` will run a single base method: the method named *methodName*. In most uses of :class:`TestCase`, you will neither change the *methodName* nor reimplement the default ``runTest()`` method.
ru: Каждый экземпляр :class:`TestCase` будет запускать один базовый метод: метод с именем *methodName*. В большинстве случаев использования :class:`TestCase` вы не будете ни менять *methodName*, ни переопределять метод по умолчанию ``runTest()``.

source: :class:`TestCase` can be instantiated successfully without providing a *methodName*. This makes it easier to experiment with :class:`TestCase` from the interactive interpreter.
ru: :class:`TestCase` может быть успешно создан без указания *methodName*. Это упрощает эксперименты с :class:`TestCase` из интерактивного интерпретатора.

source: :class:`TestCase` instances provide three groups of methods: one group used to run the test, another used by the test implementation to check conditions and report failures, and some inquiry methods allowing information about the test itself to be gathered.
ru: Экземпляры :class:`TestCase` предоставляют три группы методов: одна группа используется для запуска теста, другая используется реализацией теста для проверки условий и сообщения об ошибках, а также некоторые методы запроса, позволяющие собирать информацию о самом тесте.

source: Methods in the first group (running the test) are:
ru: Методы первой группы (проведение теста):

source: Method called to prepare the test fixture. This is called immediately before calling the test method; other than :exc:`AssertionError` or :exc:`SkipTest`, any exception raised by this method will be considered an error rather than a test failure. The default implementation does nothing.
ru: Метод, вызываемый для подготовки тестового приспособления. Он вызывается непосредственно перед вызовом тестового метода; кроме :exc:`AssertionError` или :exc:`SkipTest`, любое исключение, вызванное этим методом, будет считаться ошибкой, а не провалом теста. Реализация по умолчанию ничего не делает.

source: Method called immediately after the test method has been called and the result recorded. This is called even if the test method raised an exception, so the implementation in subclasses may need to be particularly careful about checking internal state. Any exception, other than :exc:`AssertionError` or :exc:`SkipTest`, raised by this method will be considered an additional error rather than a test failure (thus increasing the total number of reported errors). This method will only be called if the :meth:`setUp` succeeds, regardless of the outcome of the test method. The default implementation does nothing.
ru: Метод вызывается сразу после вызова тестового метода и записи результата. Он вызывается, даже если тестовый метод вызвал исключение, поэтому при реализации в подклассах может потребоваться особая осторожность при проверке внутреннего состояния. Любое исключение, кроме :exc:`AssertionError` или :exc:`SkipTest`, вызванное этим методом, будет считаться дополнительной ошибкой, а не сбоем теста (таким образом увеличивая общее количество зарегистрированных ошибок). Этот метод будет вызываться только в том случае, если :meth:`setUp` завершится успешно, независимо от результата метода тестирования. Реализация по умолчанию ничего не делает.

source: A class method called before tests in an individual class are run. ``setUpClass`` is called with the class as the only argument and must be decorated as a :func:`classmethod`::
ru: Метод класса, вызываемый перед запуском тестов в отдельном классе. ``setUpClass`` вызывается с классом в качестве единственного аргумента и должен быть оформлен как :func:`classmethod`::

source: See `Class and Module Fixtures`_ for more details.
ru: См. «Фикстуры классов и модулей» для более подробной информации.

source: A class method called after tests in an individual class have run. ``tearDownClass`` is called with the class as the only argument and must be decorated as a :meth:`classmethod`::
ru: Метод класса, вызываемый после выполнения тестов в отдельном классе. ``tearDownClass`` вызывается с классом в качестве единственного аргумента и должен быть оформлен как :meth:`classmethod`::

source: Run the test, collecting the result into the :class:`TestResult` object passed as *result*. If *result* is omitted or ``None``, a temporary result object is created (by calling the :meth:`defaultTestResult` method) and used. The result object is returned to :meth:`run`'s caller.
ru: Запустите тест, собрав результат в объект :class:`TestResult`, переданный как *result*. Если *result* опущен или ``None``, создается временный объект результата (путем вызова метода :meth:`defaultTestResult`) и используется. Объект результата возвращается вызывающей стороне :meth:`run`.

source: The same effect may be had by simply calling the :class:`TestCase` instance.
ru: Тот же эффект можно получить, просто вызвав экземпляр :class:`TestCase`.

source: Previous versions of ``run`` did not return the result. Neither did calling an instance.
ru: Предыдущие версии ``run`` не возвращали результат. Как и вызов экземпляра.

source: Calling this during a test method or :meth:`setUp` skips the current test. See :ref:`unittest-skipping` for more information.
ru: Вызов этого метода во время тестового метода или :meth:`setUp` пропускает текущий тест. Дополнительную информацию см. в разделе :ref:`unittest-skipping`.

source: Return a context manager which executes the enclosed code block as a subtest. *msg* and *params* are optional, arbitrary values which are displayed whenever a subtest fails, allowing you to identify them clearly.
ru: Верните менеджер контекста, который выполняет вложенный блок кода в качестве подтеста. *msg* и *params* — необязательные произвольные значения, которые отображаются при сбое подтеста, что позволяет четко их идентифицировать.

source: A test case can contain any number of subtest declarations, and they can be arbitrarily nested.
ru: Тестовый пример может содержать любое количество объявлений подтестов, и они могут быть произвольно вложены.

source: See :ref:`subtests` for more information.
ru: Дополнительную информацию см. в разделе :ref:`subtests`.

source: Run the test without collecting the result. This allows exceptions raised by the test to be propagated to the caller, and can be used to support running tests under a debugger.
ru: Запустите тест, не собирая результат. Это позволяет распространять исключения, вызванные тестом, на вызывающую сторону и может использоваться для поддержки запуска тестов в отладчике.

source: The :class:`TestCase` class provides several assert methods to check for and report failures. The following table lists the most commonly used methods (see the tables below for more assert methods):
ru: Класс :class:`TestCase` предоставляет несколько методов проверки для проверки и сообщения об ошибках. В следующей таблице перечислены наиболее часто используемые методы (дополнительные методы утверждения см. в таблицах ниже):

source: Method
ru: Метод

source: Checks that
ru: Проверяет, что

source: New in
ru: Новое в

source: All the assert methods accept a *msg* argument that, if specified, is used as the error message on failure (see also :data:`longMessage`). Note that the *msg* keyword argument can be passed to :meth:`assertRaises`, :meth:`assertRaisesRegex`, :meth:`assertWarns`, :meth:`assertWarnsRegex` only when they are used as a context manager.
ru: Все методы утверждения принимают аргумент *msg*, который, если он указан, используется в качестве сообщения об ошибке в случае сбоя (см. также :data:`longMessage`). Обратите внимание, что аргумент ключевого слова *msg* можно передать в :meth:`assertRaises`, :meth:`assertRaisesRegex`, :meth:`assertWarns`, :meth:`assertWarnsRegex` только тогда, когда они используются в качестве контекстного менеджера.

source: Test that *first* and *second* are equal. If the values do not compare equal, the test will fail.
ru: Проверьте, что *первый* и *второй* равны. Если значения не сравниваются равными, тест завершится неудачей.

source: In addition, if *first* and *second* are the exact same type and one of list, tuple, dict, set, frozenset or str or any type that a subclass registers with :meth:`addTypeEqualityFunc` the type-specific equality function will be called in order to generate a more useful default error message (see also the :ref:`list of type-specific methods <type-specific-methods>`).
ru: Кроме того, если *first* и * Second* имеют один и тот же тип и один из списка, кортежа, dict, set, FrozesetSet или Str или любого типа, который регистрируется подклассом с помощью :meth:`addTypeEqualityFunc`, функция равенства для конкретного типа будет вызываться для генерации более полезного сообщения об ошибке по умолчанию (см. также :ref:`список методов, специфичных для типа <type-dependent-methods>`).

source: Added the automatic calling of type-specific equality function.
ru: Добавлен автоматический вызов функции равенства для конкретного типа.

source: :meth:`assertMultiLineEqual` added as the default type equality function for comparing strings.
ru: :meth:`assertMultiLineEqual` добавлен как функция равенства типов по умолчанию для сравнения строк.

source: Test that *first* and *second* are not equal. If the values do compare equal, the test will fail.
ru: Проверьте, что *первый* и *второй* не равны. Если значения сравниваются равными, тест не пройден.

source: Test that *expr* is true (or false).
ru: Проверьте, что *выражение* истинно (или ложно).
