Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/unittest.po
Languages: ru

source: This attribute controls the maximum length of diffs output by assert methods that report diffs on failure. It defaults to 80*8 characters. Assert methods affected by this attribute are :meth:`assertSequenceEqual` (including all the sequence comparison methods that delegate to it), :meth:`assertDictEqual` and :meth:`assertMultiLineEqual`.
ru: Этот атрибут управляет максимальной длиной вывода различий с помощью методов утверждения, которые сообщают о различиях в случае сбоя. По умолчанию он равен 80*8 символов. Методы подтверждения, на которые влияет этот атрибут: :meth:`assertSequenceEqual` (включая все методы сравнения последовательностей, которые ему делегируют), :meth:`assertDictEqual` и :meth:`assertMultiLineEqual`.

source: Setting ``maxDiff`` to ``None`` means that there is no maximum length of diffs.
ru: Установка ``maxDiff`` в ``None`` означает, что не существует максимальной длины различий.

source: Testing frameworks can use the following methods to collect information on the test:
ru: Платформы тестирования могут использовать следующие методы для сбора информации о тесте:

source: Return the number of tests represented by this test object. For :class:`TestCase` instances, this will always be ``1``.
ru: Возвращает количество тестов, представленных этим тестовым объектом. Для экземпляров :class:`TestCase` это всегда будет ``1``.

source: Return an instance of the test result class that should be used for this test case class (if no other result instance is provided to the :meth:`run` method).
ru: Возвращает экземпляр класса результата теста, который следует использовать для этого класса тестового примера (если методу :meth:`run` не предоставлен другой экземпляр результата).

source: For :class:`TestCase` instances, this will always be an instance of :class:`TestResult`; subclasses of :class:`TestCase` should override this as necessary.
ru: Для экземпляров :class:`TestCase` это всегда будет экземпляр :class:`TestResult`; подклассы :class:`TestCase` должны переопределять это при необходимости.

source: Return a string identifying the specific test case. This is usually the full name of the test method, including the module and class name.
ru: Возвращает строку, идентифицирующую конкретный тестовый пример. Обычно это полное имя метода тестирования, включая имя модуля и класса.

source: Returns a description of the test, or ``None`` if no description has been provided. The default implementation of this method returns the first line of the test method's docstring, if available, or ``None``.
ru: Возвращает описание теста или None, если описание не было предоставлено. Реализация этого метода по умолчанию возвращает первую строку документации тестового метода, если она доступна, или «Нет».

source: In 3.1 this was changed to add the test name to the short description even in the presence of a docstring. This caused compatibility issues with unittest extensions and adding the test name was moved to the :class:`TextTestResult` in Python 3.2.
ru: В версии 3.1 это было изменено: к краткому описанию добавлялось имя теста даже при наличии строки документации. Это вызвало проблемы совместимости с расширениями unittest, и добавление имени теста было перенесено в :class:`TextTestResult` в Python 3.2.

source: Add a function to be called after :meth:`tearDown` to cleanup resources used during the test. Functions will be called in reverse order to the order they are added (:abbr:`LIFO (last-in, first-out)`). They are called with any arguments and keyword arguments passed into :meth:`addCleanup` when they are added.
ru: Добавьте функцию, которая будет вызываться после :meth:`tearDown` для очистки ресурсов, использованных во время теста. Функции будут вызываться в порядке, обратном порядку их добавления (:abbr:`LIFO (last-in, first-out)`). Они вызываются с любыми аргументами и ключевыми словами, передаваемыми в :meth:`addCleanup` при их добавлении.

source: If :meth:`setUp` fails, meaning that :meth:`tearDown` is not called, then any cleanup functions added will still be called.
ru: Если :meth:`setUp` завершается сбоем, то есть :meth:`tearDown` не вызывается, то любые добавленные функции очистки все равно будут вызываться.

source: Enter the supplied :term:`context manager`. If successful, also add its :meth:`~object.__exit__` method as a cleanup function by :meth:`addCleanup` and return the result of the :meth:`~object.__enter__` method.
ru: Введите предоставленный :term:`контекстный менеджер`. В случае успеха также добавьте его метод :meth:`~object.__exit__` в качестве функции очистки с помощью :meth:`addCleanup` и верните результат метода :meth:`~object.__enter__`.

source: This method is called unconditionally after :meth:`tearDown`, or after :meth:`setUp` if :meth:`setUp` raises an exception.
ru: Этот метод вызывается безоговорочно после :meth:`tearDown` или после :meth:`setUp`, если :meth:`setUp` вызывает исключение.

source: It is responsible for calling all the cleanup functions added by :meth:`addCleanup`. If you need cleanup functions to be called *prior* to :meth:`tearDown` then you can call :meth:`doCleanups` yourself.
ru: Он отвечает за вызов всех функций очистки, добавленных :meth:`addCleanup`. Если вам нужно, чтобы функции очистки вызывались *до* :meth:`tearDown`, вы можете вызвать :meth:`doCleanups` самостоятельно.

source: :meth:`doCleanups` pops methods off the stack of cleanup functions one at a time, so it can be called at any time.
ru: :meth:`doCleanups` извлекает методы из стека функций очистки по одному, поэтому его можно вызвать в любое время.

source: Add a function to be called after :meth:`tearDownClass` to cleanup resources used during the test class. Functions will be called in reverse order to the order they are added (:abbr:`LIFO (last-in, first-out)`). They are called with any arguments and keyword arguments passed into :meth:`addClassCleanup` when they are added.
ru: Добавьте функцию, которая будет вызываться после :meth:`tearDownClass` для очистки ресурсов, используемых во время тестового класса. Функции будут вызываться в порядке, обратном порядку их добавления (:abbr:`LIFO (last-in, first-out)`). Они вызываются с любыми аргументами и ключевыми словами, передаваемыми в :meth:`addClassCleanup` при их добавлении.

source: If :meth:`setUpClass` fails, meaning that :meth:`tearDownClass` is not called, then any cleanup functions added will still be called.
ru: Если :meth:`setUpClass` завершается сбоем, то есть :meth:`tearDownClass` не вызывается, то любые добавленные функции очистки все равно будут вызываться.

source: Enter the supplied :term:`context manager`. If successful, also add its :meth:`~object.__exit__` method as a cleanup function by :meth:`addClassCleanup` and return the result of the :meth:`~object.__enter__` method.
ru: Введите предоставленный :term:`контекстный менеджер`. В случае успеха также добавьте его метод :meth:`~object.__exit__` в качестве функции очистки с помощью :meth:`addClassCleanup` и верните результат метода :meth:`~object.__enter__`.

source: This method is called unconditionally after :meth:`tearDownClass`, or after :meth:`setUpClass` if :meth:`setUpClass` raises an exception.
ru: Этот метод вызывается безоговорочно после :meth:`tearDownClass` или после :meth:`setUpClass`, если :meth:`setUpClass` вызывает исключение.

source: It is responsible for calling all the cleanup functions added by :meth:`addClassCleanup`. If you need cleanup functions to be called *prior* to :meth:`tearDownClass` then you can call :meth:`doClassCleanups` yourself.
ru: Он отвечает за вызов всех функций очистки, добавленных :meth:`addClassCleanup`. Если вам нужно, чтобы функции очистки вызывались *до* :meth:`tearDownClass`, вы можете вызвать :meth:`doClassCleanups` самостоятельно.

source: :meth:`doClassCleanups` pops methods off the stack of cleanup functions one at a time, so it can be called at any time.
ru: :meth:`doClassCleanups` извлекает методы из стека функций очистки по одному, поэтому его можно вызвать в любое время.

source: This class provides an API similar to :class:`TestCase` and also accepts coroutines as test functions.
ru: Этот класс предоставляет API, аналогичный :class:`TestCase`, а также принимает сопрограммы в качестве тестовых функций.

source: Method called to prepare the test fixture. This is called after :meth:`setUp`. This is called immediately before calling the test method; other than :exc:`AssertionError` or :exc:`SkipTest`, any exception raised by this method will be considered an error rather than a test failure. The default implementation does nothing.
ru: Метод, вызываемый для подготовки тестового приспособления. Это вызывается после :meth:`setUp`. Он вызывается непосредственно перед вызовом тестового метода; кроме :exc:`AssertionError` или :exc:`SkipTest`, любое исключение, вызванное этим методом, будет считаться ошибкой, а не провалом теста. Реализация по умолчанию ничего не делает.

source: Method called immediately after the test method has been called and the result recorded. This is called before :meth:`tearDown`. This is called even if the test method raised an exception, so the implementation in subclasses may need to be particularly careful about checking internal state. Any exception, other than :exc:`AssertionError` or :exc:`SkipTest`, raised by this method will be considered an additional error rather than a test failure (thus increasing the total number of reported errors). This method will only be called if the :meth:`asyncSetUp` succeeds, regardless of the outcome of the test method. The default implementation does nothing.
ru: Метод вызывается сразу после вызова тестового метода и записи результата. Это вызывается перед :meth:`tearDown`. Он вызывается, даже если тестовый метод вызвал исключение, поэтому при реализации в подклассах может потребоваться особая осторожность при проверке внутреннего состояния. Любое исключение, кроме :exc:`AssertionError` или :exc:`SkipTest`, вызванное этим методом, будет считаться дополнительной ошибкой, а не сбоем теста (таким образом увеличивая общее количество зарегистрированных ошибок). Этот метод будет вызываться только в том случае, если :meth:`asyncSetUp` завершится успешно, независимо от результата метода тестирования. Реализация по умолчанию ничего не делает.

source: This method accepts a coroutine that can be used as a cleanup function.
ru: Этот метод принимает сопрограмму, которую можно использовать в качестве функции очистки.

source: Enter the supplied :term:`asynchronous context manager`. If successful, also add its :meth:`~object.__aexit__` method as a cleanup function by :meth:`addAsyncCleanup` and return the result of the :meth:`~object.__aenter__` method.
ru: Введите предоставленный :term:`асинхронный контекстный менеджер`. В случае успеха также добавьте его метод :meth:`~object.__aexit__` в качестве функции очистки с помощью :meth:`addAsyncCleanup` и верните результат метода :meth:`~object.__aenter__`.

source: Sets up a new event loop to run the test, collecting the result into the :class:`TestResult` object passed as *result*. If *result* is omitted or ``None``, a temporary result object is created (by calling the :meth:`defaultTestResult` method) and used. The result object is returned to :meth:`run`'s caller. At the end of the test all the tasks in the event loop are cancelled.
ru: Устанавливает новый цикл событий для запуска теста, собирая результат в объект :class:`TestResult`, передаваемый как *result*. Если *result* опущен или ``None``, создается временный объект результата (путем вызова метода :meth:`defaultTestResult`) и используется. Объект результата возвращается вызывающей стороне :meth:`run`. В конце теста все задачи в цикле событий отменяются.

source: An example illustrating the order::
ru: Пример, иллюстрирующий порядок::

source: After running the test, ``events`` would contain ``["setUp", "asyncSetUp", "test_response", "asyncTearDown", "tearDown", "cleanup"]``.
ru: После запуска теста ``events`` будет содержать ``["setUp", "asyncSetUp", "test_response", "asyncTearDown", "tearDown", "cleanup"]``.

source: This class implements the portion of the :class:`TestCase` interface which allows the test runner to drive the test, but does not provide the methods which test code can use to check and report errors. This is used to create test cases using legacy test code, allowing it to be integrated into a :mod:`unittest`-based test framework.
ru: Этот класс реализует часть интерфейса :class:`TestCase`, которая позволяет исполнителю теста управлять тестом, но не предоставляет методы, которые тестовый код может использовать для проверки и сообщения об ошибках. Это используется для создания тестовых примеров с использованием устаревшего тестового кода, что позволяет интегрировать его в тестовую среду на основе :mod:`unittest`.

source: Deprecated aliases
ru: Устаревшие псевдонимы

source: Method Name
ru: Название метода

source: Deprecated alias
ru: Устаревший псевдоним

source: Grouping tests
ru: Группировка тестов

source: This class represents an aggregation of individual test cases and test suites. The class presents the interface needed by the test runner to allow it to be run as any other test case. Running a :class:`TestSuite` instance is the same as iterating over the suite, running each test individually.
ru: Этот класс представляет собой совокупность отдельных тестовых примеров и наборов тестов. Класс представляет интерфейс, необходимый средству запуска тестов, чтобы его можно было запускать как любой другой тестовый пример. Запуск экземпляра :class:`TestSuite` аналогичен перебору пакета, при котором каждый тест выполняется отдельно.

source: If *tests* is given, it must be an iterable of individual test cases or other test suites that will be used to build the suite initially. Additional methods are provided to add test cases and suites to the collection later on.
ru: Если указано *tests*, это должна быть итерация отдельных тестовых случаев или других наборов тестов, которые будут использоваться для первоначального создания набора. Предоставляются дополнительные методы для последующего добавления тестовых примеров и наборов в коллекцию.

source: :class:`TestSuite` objects behave much like :class:`TestCase` objects, except they do not actually implement a test. Instead, they are used to aggregate tests into groups of tests that should be run together. Some additional methods are available to add tests to :class:`TestSuite` instances:
ru: Объекты :class:`TestSuite` ведут себя так же, как объекты :class:`TestCase`, за исключением того, что они фактически не реализуют тест. Вместо этого они используются для объединения тестов в группы тестов, которые следует запускать вместе. Доступны некоторые дополнительные методы для добавления тестов в экземпляры :class:`TestSuite`:

source: Add a :class:`TestCase` or :class:`TestSuite` to the suite.
ru: Добавьте в комплект :class:`TestCase` или :class:`TestSuite`.

source: Add all the tests from an iterable of :class:`TestCase` and :class:`TestSuite` instances to this test suite.
ru: Добавьте в этот набор тестов все тесты из итерации экземпляров :class:`TestCase` и :class:`TestSuite`.

source: This is equivalent to iterating over *tests*, calling :meth:`addTest` for each element.
ru: Это эквивалентно перебору *tests* с вызовом :meth:`addTest` для каждого элемента.

source: :class:`TestSuite` shares the following methods with :class:`TestCase`:
ru: :class:`TestSuite` разделяет с :class:`TestCase` следующие методы:

source: Run the tests associated with this suite, collecting the result into the test result object passed as *result*. Note that unlike :meth:`TestCase.run`, :meth:`TestSuite.run` requires the result object to be passed in.
ru: Запустите тесты, связанные с этим набором, собрав результаты в объект результата теста, передаваемый как *result*. Обратите внимание, что в отличие от :meth:`TestCase.run`, :meth:`TestSuite.run` требует передачи объекта результата.

source: Run the tests associated with this suite without collecting the result. This allows exceptions raised by the test to be propagated to the caller and can be used to support running tests under a debugger.
ru: Запустите тесты, связанные с этим пакетом, без сбора результатов. Это позволяет распространять исключения, вызванные тестом, на вызывающую сторону и может использоваться для поддержки запуска тестов в отладчике.

source: Return the number of tests represented by this test object, including all individual tests and sub-suites.
ru: Возвращает количество тестов, представленных этим тестовым объектом, включая все отдельные тесты и поднаборы.

source: Tests grouped by a :class:`TestSuite` are always accessed by iteration. Subclasses can lazily provide tests by overriding :meth:`!__iter__`. Note that this method may be called several times on a single suite (for example when counting tests or comparing for equality) so the tests returned by repeated iterations before :meth:`TestSuite.run` must be the same for each call iteration. After :meth:`TestSuite.run`, callers should not rely on the tests returned by this method unless the caller uses a subclass that overrides :meth:`TestSuite._removeTestAtIndex` to preserve test references.
ru: Доступ к тестам, сгруппированным по :class:`TestSuite`, всегда осуществляется путем итерации. Подклассы могут лениво предоставлять тесты, переопределяя :meth:`!__iter__`. Обратите внимание, что этот метод может вызываться несколько раз для одного набора (например, при подсчете тестов или сравнении на равенство), поэтому тесты, возвращаемые повторными итерациями перед :meth:`TestSuite.run`, должны быть одинаковыми для каждой итерации вызова. После :meth:`TestSuite.run` вызывающие программы не должны полагаться на тесты, возвращаемые этим методом, если только вызывающая сторона не использует подкласс, который переопределяет :meth:`TestSuite._removeTestAtIndex` для сохранения ссылок на тесты.

source: In earlier versions the :class:`TestSuite` accessed tests directly rather than through iteration, so overriding :meth:`!__iter__` wasn't sufficient for providing tests.
ru: В более ранних версиях :class:`TestSuite` обращался к тестам напрямую, а не посредством итерации, поэтому переопределения :meth:`!__iter__` было недостаточно для предоставления тестов.

source: In earlier versions the :class:`TestSuite` held references to each :class:`TestCase` after :meth:`TestSuite.run`. Subclasses can restore that behavior by overriding :meth:`TestSuite._removeTestAtIndex`.
ru: В более ранних версиях :class:`TestSuite` содержал ссылки на каждый :class:`TestCase` после :meth:`TestSuite.run`. Подклассы могут восстановить это поведение, переопределив :meth:`TestSuite._removeTestAtIndex`.

source: In the typical usage of a :class:`TestSuite` object, the :meth:`run` method is invoked by a :class:`TestRunner` rather than by the end-user test harness.
ru: При типичном использовании объекта :class:`TestSuite` метод :meth:`run` вызывается :class:`TestRunner`, а не тестовой программой конечного пользователя.

source: Loading and running tests
ru: Загрузка и запуск тестов

source: The :class:`TestLoader` class is used to create test suites from classes and modules. Normally, there is no need to create an instance of this class; the :mod:`unittest` module provides an instance that can be shared as :data:`unittest.defaultTestLoader`. Using a subclass or instance, however, allows customization of some configurable properties.
ru: Класс :class:`TestLoader` используется для создания наборов тестов из классов и модулей. Обычно нет необходимости создавать экземпляр этого класса; Модуль :mod:`unittest` предоставляет экземпляр, который можно использовать как :data:`unittest.defaultTestLoader`. Однако использование подкласса или экземпляра позволяет настраивать некоторые настраиваемые свойства.

source: :class:`TestLoader` objects have the following attributes:
ru: Объекты :class:`TestLoader` имеют следующие атрибуты:

source: A list of the non-fatal errors encountered while loading tests. Not reset by the loader at any point. Fatal errors are signalled by the relevant method raising an exception to the caller. Non-fatal errors are also indicated by a synthetic test that will raise the original error when run.
ru: Список нефатальных ошибок, возникших при загрузке тестов. Не сбрасывается загрузчиком в любой момент. Фатальные ошибки сигнализируются соответствующим методом, вызывающим исключение. Нефатальные ошибки также определяются синтетическим тестом, который при запуске выявляет исходную ошибку.

source: :class:`TestLoader` objects have the following methods:
ru: Объекты :class:`TestLoader` имеют следующие методы:

source: Return a suite of all test cases contained in the :class:`TestCase`\ -derived :class:`testCaseClass`.
ru: Возвращает набор всех тестовых случаев, содержащихся в :class:`TestCase`\ -производном :class:`testCaseClass`.

source: A test case instance is created for each method named by :meth:`getTestCaseNames`. By default these are the method names beginning with ``test``. If :meth:`getTestCaseNames` returns no methods, but the :meth:`runTest` method is implemented, a single test case is created for that method instead.
ru: Экземпляр тестового примера создается для каждого метода, названного :meth:`getTestCaseNames`. По умолчанию это имена методов, начинающиеся с ``test``. Если :meth:`getTestCaseNames` не возвращает никаких методов, но метод :meth:`runTest` реализован, вместо этого для этого метода создается один тестовый пример.

source: Return a suite of all test cases contained in the given module. This method searches *module* for classes derived from :class:`TestCase` and creates an instance of the class for each test method defined for the class.
ru: Возвращает набор всех тестовых примеров, содержащихся в данном модуле. Этот метод ищет в *модуле* классы, производные от :class:`TestCase`, и создает экземпляр класса для каждого тестового метода, определенного для этого класса.

source: While using a hierarchy of :class:`TestCase`\ -derived classes can be convenient in sharing fixtures and helper functions, defining test methods on base classes that are not intended to be instantiated directly does not play well with this method. Doing so, however, can be useful when the fixtures are different and defined in subclasses.
ru: Хотя использование иерархии классов, производных от :class:`TestCase`\, может быть удобно для совместного использования фикстур и вспомогательных функций, определение тестовых методов в базовых классах, которые не предназначены для непосредственного создания экземпляров, не очень хорошо работает с этим методом. Однако это может быть полезно, когда фикстуры различны и определены в подклассах.

source: If a module provides a ``load_tests`` function it will be called to load the tests. This allows modules to customize test loading. This is the `load_tests protocol`_. The *pattern* argument is passed as the third argument to ``load_tests``.
ru: Если модуль предоставляет функцию load_tests, он будет вызван для загрузки тестов. Это позволяет модулям настраивать тестовую загрузку. Это протокол load_tests_. Аргумент *pattern* передается в качестве третьего аргумента в ``load_tests``.

source: Support for ``load_tests`` added.
ru: Добавлена ​​поддержка load_tests.

source: Return a suite of all test cases given a string specifier.
ru: Возвращает набор всех тестовых примеров с заданным строковым спецификатором.
