Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/unittest.po
Languages: ru

source: This method is the main public interface to the ``TextTestRunner``. This method takes a :class:`TestSuite` or :class:`TestCase` instance. A :class:`TestResult` is created by calling :func:`_makeResult` and the test(s) are run and the results printed to stdout.
ru: Этот метод является основным общедоступным интерфейсом TextTestRunner. Этот метод принимает экземпляр :class:`TestSuite` или :class:`TestCase`. :class:`TestResult` создается путем вызова :func:`_makeResult`, запускаются тесты и выводятся результаты на стандартный вывод.

source: A command-line program that loads a set of tests from *module* and runs them; this is primarily for making test modules conveniently executable. The simplest use for this function is to include the following line at the end of a test script::
ru: Программа командной строки, которая загружает набор тестов из *модуля* и запускает их; это прежде всего сделано для того, чтобы сделать тестовые модули удобными для выполнения. Простейшее использование этой функции — включение следующей строки в конец тестового сценария:

source: You can run tests with more detailed information by passing in the verbosity argument::
ru: Вы можете запустить тесты с более подробной информацией, передав аргумент verbosity::

source: The *defaultTest* argument is either the name of a single test or an iterable of test names to run if no test names are specified via *argv*. If not specified or ``None`` and no test names are provided via *argv*, all tests found in *module* are run.
ru: Аргумент *defaultTest* — это либо имя одного теста, либо итерация имен тестов, которые будут выполняться, если имена тестов не указаны через *argv*. Если не указано или ``Нет`` и имена тестов не указаны через *argv*, запускаются все тесты, найденные в *module*.

source: The *argv* argument can be a list of options passed to the program, with the first element being the program name. If not specified or ``None``, the values of :data:`sys.argv` are used.
ru: Аргумент *argv* может представлять собой список параметров, передаваемых программе, где первым элементом является имя программы. Если не указано или «Нет», используются значения :data:`sys.argv`.

source: The *testLoader* argument has to be a :class:`TestLoader` instance, and defaults to :data:`defaultTestLoader`.
ru: Аргумент *testLoader* должен быть экземпляром :class:`TestLoader` и по умолчанию имеет значение :data:`defaultTestLoader`.

source: ``main`` supports being used from the interactive interpreter by passing in the argument ``exit=False``. This displays the result on standard output without calling :func:`sys.exit`::
ru: ``main`` поддерживает использование из интерактивного интерпретатора, передавая аргумент ``exit=False``. Это отображает результат в стандартном выводе без вызова :func:`sys.exit`::

source: The *failfast*, *catchbreak* and *buffer* parameters have the same effect as the same-name `command-line options`_.
ru: Параметры *failfast*, *catchbreak* и *buffer* имеют тот же эффект, что и одноименные `параметры командной строки`_.

source: The *warnings* argument specifies the :ref:`warning filter <warning-filter>` that should be used while running the tests. If it's not specified, it will remain ``None`` if a :option:`!-W` option is passed to :program:`python` (see :ref:`Warning control <using-on-warnings>`), otherwise it will be set to ``'default'``.
ru: Аргумент *warnings* указывает :ref:`фильтр предупреждений <warning-filter>`, который следует использовать при запуске тестов. Если он не указан, он останется ``None``, если параметр :option:`!-W` будет передан в :program:`python` (см. :ref:`Управление предупреждениями <using-on-warnings>`) , в противном случае будет установлено значение ``'default'``.

source: The *exit* parameter was added.
ru: Добавлен параметр *exit*.

source: The *verbosity*, *failfast*, *catchbreak*, *buffer* and *warnings* parameters were added.
ru: Были добавлены параметры *verbosity*, *failfast*, *catchbreak*, *buffer* и *warnings*.

source: The *defaultTest* parameter was changed to also accept an iterable of test names.
ru: Параметр *defaultTest* был изменен, чтобы также принимать итерацию имен тестов.

source: load_tests Protocol
ru: Протокол load_tests

source: Modules or packages can customize how tests are loaded from them during normal test runs or test discovery by implementing a function called ``load_tests``.
ru: Модули и пакеты могут настраивать способ загрузки тестов из них во время обычных запусков тестов или обнаружения тестов, реализуя функцию под названием load_tests.

source: If a test module defines ``load_tests`` it will be called by :meth:`TestLoader.loadTestsFromModule` with the following arguments::
ru: Если тестовый модуль определяет ``load_tests``, он будет вызван :meth:`TestLoader.loadTestsFromModule` со следующими аргументами:

source: where *pattern* is passed straight through from ``loadTestsFromModule``. It defaults to ``None``.
ru: где *pattern* передается напрямую из loadTestsFromModule. По умолчанию установлено значение «Нет».

source: It should return a :class:`TestSuite`.
ru: Он должен вернуть :class:`TestSuite`.

source: *loader* is the instance of :class:`TestLoader` doing the loading. *standard_tests* are the tests that would be loaded by default from the module. It is common for test modules to only want to add or remove tests from the standard set of tests. The third argument is used when loading packages as part of test discovery.
ru: *loader* — это экземпляр :class:`TestLoader`, выполняющий загрузку. *standard_tests* — это тесты, которые по умолчанию загружаются из модуля. Обычно тестовые модули хотят только добавлять или удалять тесты из стандартного набора тестов. Третий аргумент используется при загрузке пакетов в рамках обнаружения тестов.

source: A typical ``load_tests`` function that loads tests from a specific set of :class:`TestCase` classes may look like::
ru: Типичная функция load_tests, которая загружает тесты из определенного набора классов :class:`TestCase`, может выглядеть так:

source: If discovery is started in a directory containing a package, either from the command line or by calling :meth:`TestLoader.discover`, then the package :file:`__init__.py` will be checked for ``load_tests``. If that function does not exist, discovery will recurse into the package as though it were just another directory. Otherwise, discovery of the package's tests will be left up to ``load_tests`` which is called with the following arguments::
ru: Если обнаружение запускается в каталоге, содержащем пакет, либо из командной строки, либо путем вызова :meth:`TestLoader.discover`, то пакет :file:`__init__.py` будет проверен на наличие ``load_tests``. Если эта функция не существует, обнаружение будет повторяться в пакете, как если бы это был просто другой каталог. В противном случае обнаружение тестов пакета будет оставлено на усмотрение ``load_tests``, которое вызывается со следующими аргументами:

source: This should return a :class:`TestSuite` representing all the tests from the package. (``standard_tests`` will only contain tests collected from :file:`__init__.py`.)
ru: Это должно вернуть :class:`TestSuite`, представляющий все тесты из пакета. (``standard_tests`` будет содержать только тесты, собранные из :file:`__init__.py`.)

source: Because the pattern is passed into ``load_tests`` the package is free to continue (and potentially modify) test discovery. A 'do nothing' ``load_tests`` function for a test package would look like::
ru: Поскольку шаблон передается в load_tests, пакет может продолжать (и потенциально изменять) обнаружение тестов. Функция ``load_tests``, ничего не делающая для тестового пакета, будет выглядеть так:

source: Discovery no longer checks package names for matching *pattern* due to the impossibility of package names matching the default pattern.
ru: Discovery больше не проверяет имена пакетов на соответствие *шаблону* из-за невозможности соответствия имен пакетов шаблону по умолчанию.

source: Class and Module Fixtures
ru: Фикстуры классов и модулей

source: Class and module level fixtures are implemented in :class:`TestSuite`. When the test suite encounters a test from a new class then :meth:`tearDownClass` from the previous class (if there is one) is called, followed by :meth:`setUpClass` from the new class.
ru: Фикстуры уровня класса и модуля реализованы в :class:`TestSuite`. Когда набор тестов встречает тест из нового класса, вызывается :meth:`tearDownClass` из предыдущего класса (если он есть), а затем :meth:`setUpClass` из нового класса.

source: Similarly if a test is from a different module from the previous test then ``tearDownModule`` from the previous module is run, followed by ``setUpModule`` from the new module.
ru: Аналогично, если тест происходит из модуля, отличного от предыдущего теста, то запускается ``tearDownModule`` из предыдущего модуля, а затем ``setUpModule`` из нового модуля.

source: After all the tests have run the final ``tearDownClass`` and ``tearDownModule`` are run.
ru: После запуска всех тестов запускаются последние ``tearDownClass`` и ``tearDownModule``.

source: Note that shared fixtures do not play well with [potential] features like test parallelization and they break test isolation. They should be used with care.
ru: Обратите внимание, что общие фикстуры плохо сочетаются с [потенциальными] функциями, такими как распараллеливание тестов, и они нарушают изоляцию тестов. Их следует использовать с осторожностью.

source: The default ordering of tests created by the unittest test loaders is to group all tests from the same modules and classes together. This will lead to ``setUpClass`` / ``setUpModule`` (etc) being called exactly once per class and module. If you randomize the order, so that tests from different modules and classes are adjacent to each other, then these shared fixture functions may be called multiple times in a single test run.
ru: По умолчанию порядок тестов, созданных загрузчиками тестов unittest, заключается в группировке всех тестов из одних и тех же модулей и классов. Это приведет к тому, что ``setUpClass``/``setUpModule`` (и т. д.) будет вызываться ровно один раз для каждого класса и модуля. Если вы рандомизируете порядок, чтобы тесты из разных модулей и классов находились рядом друг с другом, то эти общие функции фиксации могут вызываться несколько раз за один запуск теста.

source: Shared fixtures are not intended to work with suites with non-standard ordering. A ``BaseTestSuite`` still exists for frameworks that don't want to support shared fixtures.
ru: Общие светильники не предназначены для работы с люксами с нестандартным порядком. BaseTestSuite все еще существует для фреймворков, которые не хотят поддерживать общие приспособления.

source: If there are any exceptions raised during one of the shared fixture functions the test is reported as an error. Because there is no corresponding test instance an ``_ErrorHolder`` object (that has the same interface as a :class:`TestCase`) is created to represent the error. If you are just using the standard unittest test runner then this detail doesn't matter, but if you are a framework author it may be relevant.
ru: Если во время одной из функций общего устройства возникают какие-либо исключения, о тесте сообщается как об ошибке. Поскольку соответствующего тестового экземпляра нет, для представления ошибки создается объект ``_ErrorHolder`` (который имеет тот же интерфейс, что и :class:`TestCase`). Если вы просто используете стандартный модуль запуска тестов unittest, эта деталь не имеет значения, но если вы являетесь автором фреймворка, это может быть актуально.

source: setUpClass and tearDownClass
ru: setUpClass и tearDownClass

source: These must be implemented as class methods::
ru: Они должны быть реализованы как методы класса::

source: If you want the ``setUpClass`` and ``tearDownClass`` on base classes called then you must call up to them yourself. The implementations in :class:`TestCase` are empty.
ru: Если вы хотите, чтобы ``setUpClass`` и ``tearDownClass`` вызывались в базовых классах, вы должны вызвать их самостоятельно. Реализации в :class:`TestCase` пусты.

source: If an exception is raised during a ``setUpClass`` then the tests in the class are not run and the ``tearDownClass`` is not run. Skipped classes will not have ``setUpClass`` or ``tearDownClass`` run. If the exception is a :exc:`SkipTest` exception then the class will be reported as having been skipped instead of as an error.
ru: Если во время ``setUpClass`` возникает исключение, то тесты в классе не запускаются и ``tearDownClass`` не запускается. Пропущенные классы не будут запускаться ``setUpClass`` или ``tearDownClass``. Если исключение представляет собой исключение :exc:`SkipTest`, то о классе будет сообщено как о пропущенном, а не как об ошибке.

source: setUpModule and tearDownModule
ru: setUpModule и tearDownModule

source: These should be implemented as functions::
ru: Они должны быть реализованы как функции::

source: If an exception is raised in a ``setUpModule`` then none of the tests in the module will be run and the ``tearDownModule`` will not be run. If the exception is a :exc:`SkipTest` exception then the module will be reported as having been skipped instead of as an error.
ru: Если в ``setUpModule`` возникает исключение, ни один из тестов в модуле не будет запущен, и ``tearDownModule`` не будет запущен. Если исключением является исключение :exc:`SkipTest`, то о модуле будет сообщено как о пропущенном, а не как об ошибке.

source: To add cleanup code that must be run even in the case of an exception, use ``addModuleCleanup``:
ru: Чтобы добавить код очистки, который должен быть запущен даже в случае исключения, используйте addModuleCleanup:

source: Add a function to be called after :func:`tearDownModule` to cleanup resources used during the test class. Functions will be called in reverse order to the order they are added (:abbr:`LIFO (last-in, first-out)`). They are called with any arguments and keyword arguments passed into :meth:`addModuleCleanup` when they are added.
ru: Добавьте функцию, которая будет вызываться после :func:`tearDownModule` для очистки ресурсов, используемых во время тестового класса. Функции будут вызываться в порядке, обратном порядку их добавления (:abbr:`LIFO (last-in, first-out)`). Они вызываются с любыми аргументами и ключевыми словами, передаваемыми в :meth:`addModuleCleanup` при их добавлении.

source: If :meth:`setUpModule` fails, meaning that :func:`tearDownModule` is not called, then any cleanup functions added will still be called.
ru: Если :meth:`setUpModule` завершается сбоем, то есть :func:`tearDownModule` не вызывается, то любые добавленные функции очистки все равно будут вызываться.

source: Enter the supplied :term:`context manager`. If successful, also add its :meth:`~object.__exit__` method as a cleanup function by :func:`addModuleCleanup` and return the result of the :meth:`~object.__enter__` method.
ru: Введите предоставленный :term:`контекстный менеджер`. В случае успеха также добавьте его метод :meth:`~object.__exit__` в качестве функции очистки с помощью :func:`addModuleCleanup` и верните результат метода :meth:`~object.__enter__`.

source: This function is called unconditionally after :func:`tearDownModule`, or after :func:`setUpModule` if :func:`setUpModule` raises an exception.
ru: Эта функция вызывается безоговорочно после :func:`tearDownModule` или после :func:`setUpModule`, если :func:`setUpModule` вызывает исключение.

source: It is responsible for calling all the cleanup functions added by :func:`addModuleCleanup`. If you need cleanup functions to be called *prior* to :func:`tearDownModule` then you can call :func:`doModuleCleanups` yourself.
ru: Он отвечает за вызов всех функций очистки, добавленных :func:`addModuleCleanup`. Если вам нужно, чтобы функции очистки вызывались *до* :func:`tearDownModule`, вы можете вызвать :func:`doModuleCleanups` самостоятельно.

source: :func:`doModuleCleanups` pops methods off the stack of cleanup functions one at a time, so it can be called at any time.
ru: :func:`doModuleCleanups` извлекает методы из стека функций очистки по одному, поэтому их можно вызвать в любое время.

source: Signal Handling
ru: Обработка сигналов

source: The control-c handling signal handler attempts to remain compatible with code or tests that install their own :const:`signal.SIGINT` handler. If the ``unittest`` handler is called but *isn't* the installed :const:`signal.SIGINT` handler, i.e. it has been replaced by the system under test and delegated to, then it calls the default handler. This will normally be the expected behavior by code that replaces an installed handler and delegates to it. For individual tests that need ``unittest`` control-c handling disabled the :func:`removeHandler` decorator can be used.
ru: Обработчик сигнала control-c пытается оставаться совместимым с кодом или тестами, которые устанавливают собственный обработчик :const:`signal.SIGINT`. Если обработчик ``unittest`` вызывается, но *не* является установленным обработчиком :const:`signal.SIGINT`, т.е. он был заменен тестируемой системой и делегирован ей, то он вызывает обработчик по умолчанию. Обычно это ожидаемое поведение кода, который заменяет установленный обработчик и делегирует ему полномочия. Для отдельных тестов, которым требуется отключить обработку control-c unittest, можно использовать декоратор :func:`removeHandler`.

source: There are a few utility functions for framework authors to enable control-c handling functionality within test frameworks.
ru: Для авторов фреймворков существует несколько служебных функций, позволяющих включить функциональность обработки control-c в тестовых средах.

source: Install the control-c handler. When a :const:`signal.SIGINT` is received (usually in response to the user pressing control-c) all registered results have :meth:`~TestResult.stop` called.
ru: Установите обработчик control-c. Когда получен :const:`signal.SIGINT` (обычно в ответ на нажатие пользователем control-c), для всех зарегистрированных результатов вызывается :meth:`~TestResult.stop`.

source: Register a :class:`TestResult` object for control-c handling. Registering a result stores a weak reference to it, so it doesn't prevent the result from being garbage collected.
ru: Зарегистрируйте объект :class:`TestResult` для обработки control-c. При регистрации результата сохраняется слабая ссылка на него, поэтому это не предотвращает сбор мусора.

source: Registering a :class:`TestResult` object has no side-effects if control-c handling is not enabled, so test frameworks can unconditionally register all results they create independently of whether or not handling is enabled.
ru: Регистрация объекта :class:`TestResult` не имеет побочных эффектов, если обработка control-c не включена, поэтому среды тестирования могут безоговорочно регистрировать все результаты, которые они создают, независимо от того, включена ли обработка.

source: Remove a registered result. Once a result has been removed then :meth:`~TestResult.stop` will no longer be called on that result object in response to a control-c.
ru: Удалить зарегистрированный результат. Как только результат будет удален, :meth:`~TestResult.stop` больше не будет вызываться для этого объекта результата в ответ на control-c.

source: When called without arguments this function removes the control-c handler if it has been installed. This function can also be used as a test decorator to temporarily remove the handler while the test is being executed::
ru: При вызове без аргументов эта функция удаляет обработчик control-c, если он был установлен. Эту функцию также можно использовать в качестве декоратора теста для временного удаления обработчика во время выполнения теста:
