Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/unittest.po
Languages: ru

source: The specifier *name* is a "dotted name" that may resolve either to a module, a test case class, a test method within a test case class, a :class:`TestSuite` instance, or a callable object which returns a :class:`TestCase` or :class:`TestSuite` instance. These checks are applied in the order listed here; that is, a method on a possible test case class will be picked up as "a test method within a test case class", rather than "a callable object".
ru: Спецификатор *name* — это «имя, разделенное точками», которое может разрешаться либо в модуль, либо в класс тестового примера, либо в тестовый метод внутри класса тестового примера, либо в экземпляр :class:`TestSuite`, либо в вызываемый объект, который возвращает: экземпляр class:`TestCase` или :class:`TestSuite`. Эти проверки применяются в порядке, указанном здесь; то есть метод возможного класса тестового примера будет выбран как «тестовый метод в классе тестового сценария», а не как «вызываемый объект».

source: For example, if you have a module :mod:`SampleTests` containing a :class:`TestCase`\ -derived class :class:`SampleTestCase` with three test methods (:meth:`test_one`, :meth:`test_two`, and :meth:`test_three`), the specifier ``'SampleTests.SampleTestCase'`` would cause this method to return a suite which will run all three test methods. Using the specifier ``'SampleTests.SampleTestCase.test_two'`` would cause it to return a test suite which will run only the :meth:`test_two` test method. The specifier can refer to modules and packages which have not been imported; they will be imported as a side-effect.
ru: Например, если у вас есть модуль :mod:`SampleTests`, содержащий :class:`TestCase`\ - производный класс :class:`SampleTestCase` с тремя методами тестирования (:meth:`test_one`, :meth:`test_two` и :meth:`test_three`), спецификатор ``'SampleTests.SampleTestCase'`` приведет к тому, что этот метод вернет набор, который будет запускать все три метода тестирования. Использование спецификатора SampleTests.SampleTestCase.test_two приведет к возврату набора тестов, который будет запускать только тестовый метод :meth:`test_two`. Спецификатор может ссылаться на модули и пакеты, которые не были импортированы; они будут импортированы как побочный эффект.

source: The method optionally resolves *name* relative to the given *module*.
ru: Метод опционально разрешает *name* относительно данного *модуля*.

source: If an :exc:`ImportError` or :exc:`AttributeError` occurs while traversing *name* then a synthetic test that raises that error when run will be returned. These errors are included in the errors accumulated by self.errors.
ru: Если при обходе *name* возникает ошибка :exc:`ImportError` или :exc:`AttributeError`, то будет возвращен синтетический тест, который выдает эту ошибку при запуске. Эти ошибки включены в список ошибок, накопленных self.errors.

source: Similar to :meth:`loadTestsFromName`, but takes a sequence of names rather than a single name. The return value is a test suite which supports all the tests defined for each name.
ru: Похож на :meth:`loadTestsFromName`, но принимает последовательность имен, а не одно имя. Возвращаемое значение — это набор тестов, который поддерживает все тесты, определенные для каждого имени.

source: Return a sorted sequence of method names found within *testCaseClass*; this should be a subclass of :class:`TestCase`.
ru: Возвращает отсортированную последовательность имен методов, найденных в *testCaseClass*; это должен быть подкласс :class:`TestCase`.

source: Find all the test modules by recursing into subdirectories from the specified start directory, and return a TestSuite object containing them. Only test files that match *pattern* will be loaded. (Using shell style pattern matching.) Only module names that are importable (i.e. are valid Python identifiers) will be loaded.
ru: Найдите все тестовые модули, рекурсивно пройдя по подкаталогам указанного начального каталога, и верните содержащий их объект TestSuite. Будут загружены только тестовые файлы, соответствующие *шаблону*. (Используя сопоставление шаблонов в стиле оболочки.) Будут загружены только имена модулей, которые можно импортировать (т. е. являются действительными идентификаторами Python).

source: If importing a module fails, for example due to a syntax error, then this will be recorded as a single error and discovery will continue. If the import failure is due to :exc:`SkipTest` being raised, it will be recorded as a skip instead of an error.
ru: Если импортировать модуль не удалось, например, из-за синтаксической ошибки, это будет записано как одна ошибка, и обнаружение продолжится. Если ошибка импорта вызвана вызовом :exc:`SkipTest`, это будет записано как пропуск, а не как ошибка.

source: If a package (a directory containing a file named :file:`__init__.py`) is found, the package will be checked for a ``load_tests`` function. If this exists then it will be called ``package.load_tests(loader, tests, pattern)``. Test discovery takes care to ensure that a package is only checked for tests once during an invocation, even if the load_tests function itself calls ``loader.discover``.
ru: Если пакет (каталог, содержащий файл с именем :file:`__init__.py`) найден, пакет будет проверен на наличие функции ``load_tests``. Если он существует, то он будет называться ``package.load_tests(loader,tests,pattern)``. Обнаружение тестов заботится о том, чтобы пакет проверялся на наличие тестов только один раз во время вызова, даже если сама функция load_tests вызывает ``loader.discover``.

source: If ``load_tests`` exists then discovery does *not* recurse into the package, ``load_tests`` is responsible for loading all tests in the package.
ru: Если ``load_tests`` существует, то обнаружение *не* повторяется в пакете, ``load_tests`` отвечает за загрузку всех тестов в пакете.

source: *start_dir* can be a dotted module name as well as a directory.
ru: *start_dir* может быть именем модуля, разделенным точками, а также каталогом.

source: Modules that raise :exc:`SkipTest` on import are recorded as skips, not errors.
ru: Модули, которые вызывают :exc:`SkipTest` при импорте, записываются как пропуски, а не как ошибки.

source: *start_dir* can be a :term:`namespace packages <namespace package>`.
ru: *start_dir* может быть :term:`namespace packages <namespace package>`.

source: Paths are sorted before being imported so that execution order is the same even if the underlying file system's ordering is not dependent on file name.
ru: Пути сортируются перед импортом, поэтому порядок выполнения одинаков, даже если порядок базовой файловой системы не зависит от имени файла.

source: Found packages are now checked for ``load_tests`` regardless of whether their path matches *pattern*, because it is impossible for a package name to match the default pattern.
ru: Найденные пакеты теперь проверяются на наличие ``load_tests`` независимо от того, соответствует ли их путь *шаблону*, поскольку невозможно, чтобы имя пакета соответствовало шаблону по умолчанию.

source: *start_dir* can not be a :term:`namespace packages <namespace package>`. It has been broken since Python 3.7 and Python 3.11 officially remove it.
ru: *start_dir* не может быть :term:`namespace packages <namespace package>`. Он был сломан с тех пор, как Python 3.7 и Python 3.11 официально удалили его.

source: The following attributes of a :class:`TestLoader` can be configured either by subclassing or assignment on an instance:
ru: Следующие атрибуты :class:`TestLoader` могут быть настроены либо путем создания подкласса, либо путем присвоения экземпляру:

source: String giving the prefix of method names which will be interpreted as test methods. The default value is ``'test'``.
ru: Строка, дающая префикс имен методов, которые будут интерпретироваться как методы тестирования. Значение по умолчанию — ``'test'``.

source: This affects :meth:`getTestCaseNames` and all the ``loadTestsFrom*`` methods.
ru: Это влияет на :meth:`getTestCaseNames` и все методы ``loadTestsFrom*``.

source: Function to be used to compare method names when sorting them in :meth:`getTestCaseNames` and all the ``loadTestsFrom*`` methods.
ru: Функция, которая будет использоваться для сравнения имен методов при их сортировке в :meth:`getTestCaseNames` и всех методах ``loadTestsFrom*``.

source: Callable object that constructs a test suite from a list of tests. No methods on the resulting object are needed. The default value is the :class:`TestSuite` class.
ru: Вызываемый объект, который создает набор тестов из списка тестов. Никакие методы результирующего объекта не требуются. Значением по умолчанию является класс :class:`TestSuite`.

source: This affects all the ``loadTestsFrom*`` methods.
ru: Это влияет на все методы loadTestsFrom*.

source: List of Unix shell-style wildcard test name patterns that test methods have to match to be included in test suites (see ``-k`` option).
ru: Список шаблонов имен тестов с подстановочными знаками в стиле оболочки Unix, которым должны соответствовать методы тестирования, чтобы их можно было включить в наборы тестов (см. параметр ``-k``).

source: If this attribute is not ``None`` (the default), all test methods to be included in test suites must match one of the patterns in this list. Note that matches are always performed using :meth:`fnmatch.fnmatchcase`, so unlike patterns passed to the ``-k`` option, simple substring patterns will have to be converted using ``*`` wildcards.
ru: Если этот атрибут отличается от «Нет» (по умолчанию), все методы тестирования, включаемые в наборы тестов, должны соответствовать одному из шаблонов в этом списке. Обратите внимание, что совпадения всегда выполняются с использованием :meth:`fnmatch.fnmatchcase`, поэтому в отличие от шаблонов, передаваемых с опцией ``-k``, простые шаблоны подстрок придется конвертировать с использованием подстановочных знаков ``*``.

source: This class is used to compile information about which tests have succeeded and which have failed.
ru: Этот класс используется для сбора информации о том, какие тесты прошли успешно, а какие — нет.

source: A :class:`TestResult` object stores the results of a set of tests. The :class:`TestCase` and :class:`TestSuite` classes ensure that results are properly recorded; test authors do not need to worry about recording the outcome of tests.
ru: Объект :class:`TestResult` хранит результаты набора тестов. Классы :class:`TestCase` и :class:`TestSuite` обеспечивают правильную запись результатов; авторам тестов не нужно беспокоиться о записи результатов тестов.

source: Testing frameworks built on top of :mod:`unittest` may want access to the :class:`TestResult` object generated by running a set of tests for reporting purposes; a :class:`TestResult` instance is returned by the :meth:`TestRunner.run` method for this purpose.
ru: Средам тестирования, построенным на основе :mod:`unittest`, может потребоваться доступ к объекту :class:`TestResult`, сгенерированному путем запуска набора тестов для целей отчетности; Для этой цели метод :meth:`TestRunner.run` возвращает экземпляр :class:`TestResult`.

source: :class:`TestResult` instances have the following attributes that will be of interest when inspecting the results of running a set of tests:
ru: Экземпляры :class:`TestResult` имеют следующие атрибуты, которые будут представлять интерес при проверке результатов запуска набора тестов:

source: A list containing 2-tuples of :class:`TestCase` instances and strings holding formatted tracebacks. Each tuple represents a test which raised an unexpected exception.
ru: Список, содержащий два кортежа экземпляров :class:`TestCase` и строк, содержащих форматированные обратные трассировки. Каждый кортеж представляет собой тест, вызвавший неожиданное исключение.

source: A list containing 2-tuples of :class:`TestCase` instances and strings holding formatted tracebacks. Each tuple represents a test where a failure was explicitly signalled using the :ref:`assert\* methods <assert-methods>`.
ru: Список, содержащий два кортежа экземпляров :class:`TestCase` и строк, содержащих форматированные обратные трассировки. Каждый кортеж представляет собой тест, в котором сбой был явно сигнализирован с использованием методов :ref:`assert\* <assert-methods>`.

source: A list containing 2-tuples of :class:`TestCase` instances and strings holding the reason for skipping the test.
ru: Список, содержащий 2 кортежа экземпляров :class:`TestCase` и строк, содержащих причину пропуска теста.

source: A list containing 2-tuples of :class:`TestCase` instances and strings holding formatted tracebacks. Each tuple represents an expected failure or error of the test case.
ru: Список, содержащий два кортежа экземпляров :class:`TestCase` и строк, содержащих форматированные обратные трассировки. Каждый кортеж представляет собой ожидаемый сбой или ошибку тестового примера.

source: A list containing :class:`TestCase` instances that were marked as expected failures, but succeeded.
ru: Список, содержащий экземпляры :class:`TestCase`, которые были помечены как ожидаемые неудачные, но завершились успешно.

source: Set to ``True`` when the execution of tests should stop by :meth:`stop`.
ru: Установите значение True, когда выполнение тестов должно остановиться на :meth:`stop`.

source: The total number of tests run so far.
ru: Общее количество тестов, проведенных на данный момент.

source: If set to true, ``sys.stdout`` and ``sys.stderr`` will be buffered in between :meth:`startTest` and :meth:`stopTest` being called. Collected output will only be echoed onto the real ``sys.stdout`` and ``sys.stderr`` if the test fails or errors. Any output is also attached to the failure / error message.
ru: Если установлено значение true, ``sys.stdout`` и ``sys.stderr`` будут буферизованы между вызовами :meth:`startTest` и :meth:`stopTest`. Собранные выходные данные будут отражены в реальных файлах ``sys.stdout`` и ``sys.stderr`` только в случае сбоя или ошибки теста. Любой вывод также прилагается к сообщению о сбое/ошибке.

source: If set to true :meth:`stop` will be called on the first failure or error, halting the test run.
ru: Если установлено значение true, :meth:`stop` будет вызываться при первом сбое или ошибке, останавливая выполнение теста.

source: If set to true then local variables will be shown in tracebacks.
ru: Если установлено значение true, локальные переменные будут отображаться в обратных трассировках.

source: Return ``True`` if all tests run so far have passed, otherwise returns ``False``.
ru: Возвращает ``True``, если все выполненные на данный момент тесты прошли успешно, в противном случае возвращает ``False``.

source: Returns ``False`` if there were any :attr:`unexpectedSuccesses` from tests marked with the :func:`expectedFailure` decorator.
ru: Возвращает ``False``, если были какие-либо :attr:`unexpectedSuccesses` из тестов, отмеченных декоратором :func:`expectedFailure`.

source: This method can be called to signal that the set of tests being run should be aborted by setting the :attr:`shouldStop` attribute to ``True``. :class:`TestRunner` objects should respect this flag and return without running any additional tests.
ru: Этот метод можно вызвать, чтобы сигнализировать о том, что выполняемый набор тестов должен быть прерван, установив для атрибута :attr:`shouldStop` значение ``True``. Объекты :class:`TestRunner` должны учитывать этот флаг и возвращаться без выполнения каких-либо дополнительных тестов.

source: For example, this feature is used by the :class:`TextTestRunner` class to stop the test framework when the user signals an interrupt from the keyboard. Interactive tools which provide :class:`TestRunner` implementations can use this in a similar manner.
ru: Например, эта функция используется классом :class:`TextTestRunner` для остановки тестовой среды, когда пользователь сигнализирует о прерывании с клавиатуры. Интерактивные инструменты, предоставляющие реализации :class:`TestRunner`, могут использовать это аналогичным образом.

source: The following methods of the :class:`TestResult` class are used to maintain the internal data structures, and may be extended in subclasses to support additional reporting requirements. This is particularly useful in building tools which support interactive reporting while tests are being run.
ru: Следующие методы класса :class:`TestResult` используются для поддержки внутренних структур данных и могут быть расширены в подклассах для поддержки дополнительных требований к отчетности. Это особенно полезно при создании инструментов, поддерживающих интерактивную отчетность во время выполнения тестов.

source: Called when the test case *test* is about to be run.
ru: Вызывается, когда скоро будет запущен тестовый пример *test*.

source: Called after the test case *test* has been executed, regardless of the outcome.
ru: Вызывается после выполнения тестового примера *test*, независимо от результата.

source: Called once before any tests are executed.
ru: Вызывается один раз перед выполнением каких-либо тестов.

source: Called once after all tests are executed.
ru: Вызывается один раз после выполнения всех тестов.

source: Called when the test case *test* raises an unexpected exception. *err* is a tuple of the form returned by :func:`sys.exc_info`: ``(type, value, traceback)``.
ru: Вызывается, когда тестовый пример *test* вызывает неожиданное исключение. *err* — это кортеж формы, возвращаемый :func:`sys.exc_info`: ``(type, value,traceback)``.

source: The default implementation appends a tuple ``(test, formatted_err)`` to the instance's :attr:`errors` attribute, where *formatted_err* is a formatted traceback derived from *err*.
ru: Реализация по умолчанию добавляет кортеж (test, formatted_err) к атрибуту :attr:`errors` экземпляра, где *formatted_err* — это форматированная обратная трассировка, полученная из *err*.

source: Called when the test case *test* signals a failure. *err* is a tuple of the form returned by :func:`sys.exc_info`: ``(type, value, traceback)``.
ru: Вызывается, когда тестовый пример *test* сигнализирует об ошибке. *err* — это кортеж формы, возвращаемый :func:`sys.exc_info`: ``(type, value,traceback)``.

source: The default implementation appends a tuple ``(test, formatted_err)`` to the instance's :attr:`failures` attribute, where *formatted_err* is a formatted traceback derived from *err*.
ru: Реализация по умолчанию добавляет кортеж ``(test, formatted_err)`` к атрибуту :attr:`failures` экземпляра, где *formatted_err* — это форматированная обратная трассировка, полученная из *err*.

source: Called when the test case *test* succeeds.
ru: Вызывается, когда тестовый пример *test* завершается успешно.

source: The default implementation does nothing.
ru: Реализация по умолчанию ничего не делает.

source: Called when the test case *test* is skipped. *reason* is the reason the test gave for skipping.
ru: Вызывается, когда тестовый пример *test* пропускается. *причина* — причина пропуска теста.

source: The default implementation appends a tuple ``(test, reason)`` to the instance's :attr:`skipped` attribute.
ru: Реализация по умолчанию добавляет кортеж ``(test, Reason)`` к атрибуту :attr:`skiped` экземпляра.

source: Called when the test case *test* fails or errors, but was marked with the :func:`expectedFailure` decorator.
ru: Вызывается, когда тестовый пример *test* завершается неудачно или с ошибкой, но помечен декоратором :func:`expectedFailure`.

source: The default implementation appends a tuple ``(test, formatted_err)`` to the instance's :attr:`expectedFailures` attribute, where *formatted_err* is a formatted traceback derived from *err*.
ru: Реализация по умолчанию добавляет кортеж (test, formatted_err) к атрибуту :attr:`expectedFailures` экземпляра, где *formatted_err* — это форматированная обратная трассировка, полученная из *err*.

source: Called when the test case *test* was marked with the :func:`expectedFailure` decorator, but succeeded.
ru: Вызывается, когда тестовый пример *test* был помечен декоратором :func:`expectedFailure`, но завершился успешно.

source: The default implementation appends the test to the instance's :attr:`unexpectedSuccesses` attribute.
ru: Реализация по умолчанию добавляет тест к атрибуту :attr:`unexpectedSuccesses` экземпляра.

source: Called when a subtest finishes. *test* is the test case corresponding to the test method. *subtest* is a custom :class:`TestCase` instance describing the subtest.
ru: Вызывается по завершении подтеста. *test* — тестовый пример, соответствующий методу тестирования. *subtest* — это пользовательский экземпляр :class:`TestCase`, описывающий подтест.

source: If *outcome* is :const:`None`, the subtest succeeded. Otherwise, it failed with an exception where *outcome* is a tuple of the form returned by :func:`sys.exc_info`: ``(type, value, traceback)``.
ru: Если *outcome* равен :const:`None`, подтест пройден успешно. В противном случае он завершился ошибкой с исключением, где *outcome* представляет собой кортеж формы, возвращаемой :func:`sys.exc_info`: ``(type, value, Traceback)``.

source: The default implementation does nothing when the outcome is a success, and records subtest failures as normal failures.
ru: Реализация по умолчанию ничего не делает, если результат успешен, и записывает неудачи подтестов как обычные неудачи.

source: Instance of the :class:`TestLoader` class intended to be shared. If no customization of the :class:`TestLoader` is needed, this instance can be used instead of repeatedly creating new instances.
ru: Экземпляр класса :class:`TestLoader`, предназначенный для совместного использования. Если никакая настройка :class:`TestLoader` не требуется, этот экземпляр можно использовать вместо многократного создания новых экземпляров.

source: A basic test runner implementation that outputs results to a stream. If *stream* is ``None``, the default, :data:`sys.stderr` is used as the output stream. This class has a few configurable parameters, but is essentially very simple. Graphical applications which run test suites should provide alternate implementations. Such implementations should accept ``**kwargs`` as the interface to construct runners changes when features are added to unittest.
ru: Базовая реализация средства запуска тестов, которая выводит результаты в поток. Если *stream* имеет значение None, в качестве выходного потока по умолчанию используется :data:`sys.stderr`. Этот класс имеет несколько настраиваемых параметров, но по сути он очень прост. Графические приложения, в которых выполняются наборы тестов, должны предоставлять альтернативные реализации. Такие реализации должны принимать ``**kwargs`` в качестве интерфейса для создания изменений бегунов при добавлении функций в unittest.

source: The default stream is set to :data:`sys.stderr` at instantiation time rather than import time.
ru: Поток по умолчанию устанавливается на :data:`sys.stderr` во время создания экземпляра, а не во время импорта.

source: This method returns the instance of ``TestResult`` used by :meth:`run`. It is not intended to be called directly, but can be overridden in subclasses to provide a custom ``TestResult``.
ru: Этот метод возвращает экземпляр TestResult, используемый :meth:`run`. Он не предназначен для прямого вызова, но может быть переопределен в подклассах для предоставления собственного TestResult.

source: ``_makeResult()`` instantiates the class or callable passed in the ``TextTestRunner`` constructor as the ``resultclass`` argument. It defaults to :class:`TextTestResult` if no ``resultclass`` is provided. The result class is instantiated with the following arguments::
ru: ``_makeResult()`` создает экземпляр класса или вызываемого объекта, переданного в конструкторе ``TextTestRunner`` в качестве аргумента ``resultclass``. По умолчанию используется :class:`TextTestResult`, если ``resultclass`` не указан. Класс результата создается со следующими аргументами:
