Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/unittest.po
Languages: ru

source: **Source code:** :source:`Lib/unittest/__init__.py`
ru: **Исходный код:** :source:`Lib/unittest/__init__.py`

source: (If you are already familiar with the basic concepts of testing, you might want to skip to :ref:`the list of assert methods <assert-methods>`.)
ru: (Если вы уже знакомы с основными концепциями тестирования, возможно, вам захочется перейти к :ref:`списку методов утверждения <assert-methods>`.)

source: The :mod:`unittest` unit testing framework was originally inspired by JUnit and has a similar flavor as major unit testing frameworks in other languages. It supports test automation, sharing of setup and shutdown code for tests, aggregation of tests into collections, and independence of the tests from the reporting framework.
ru: Среда модульного тестирования :mod:`unittest` изначально была вдохновлена ​​JUnit и имеет сходство с основными средами модульного тестирования на других языках. Он поддерживает автоматизацию тестирования, совместное использование кода настройки и завершения тестов, объединение тестов в коллекции и независимость тестов от системы отчетности.

source: To achieve this, :mod:`unittest` supports some important concepts in an object-oriented way:
ru: Чтобы добиться этого, :mod:`unittest` поддерживает некоторые важные концепции объектно-ориентированным способом:

source: test fixture
ru: испытательное приспособление

source: A :dfn:`test fixture` represents the preparation needed to perform one or more tests, and any associated cleanup actions. This may involve, for example, creating temporary or proxy databases, directories, or starting a server process.
ru: :dfn:`test приспособление` представляет собой подготовку, необходимую для выполнения одного или нескольких тестов, а также любых связанных с ними действий по очистке. Это может включать, например, создание временных или прокси-баз данных, каталогов или запуск серверного процесса.

source: test case
ru: тестовый пример

source: A :dfn:`test case` is the individual unit of testing. It checks for a specific response to a particular set of inputs. :mod:`unittest` provides a base class, :class:`TestCase`, which may be used to create new test cases.
ru: :dfn:`Тестовый пример` — это отдельная единица тестирования. Он проверяет конкретный ответ на определенный набор входных данных. :mod:`unittest` предоставляет базовый класс :class:`TestCase`, который можно использовать для создания новых тестовых случаев.

source: test suite
ru: тестовый набор

source: A :dfn:`test suite` is a collection of test cases, test suites, or both. It is used to aggregate tests that should be executed together.
ru: :dfn:`test suite` — это набор тестовых примеров, наборов тестов или того и другого. Он используется для объединения тестов, которые должны выполняться вместе.

source: A :dfn:`test runner` is a component which orchestrates the execution of tests and provides the outcome to the user. The runner may use a graphical interface, a textual interface, or return a special value to indicate the results of executing the tests.
ru: :dfn:`test runner` — это компонент, который организует выполнение тестов и предоставляет результаты пользователю. Бегун может использовать графический интерфейс, текстовый интерфейс или возвращать специальное значение для обозначения результатов выполнения тестов.

source: Module :mod:`doctest`
ru: Модуль :mod:`doctest`

source: Another test-support module with a very different flavor.
ru: Еще один модуль поддержки тестирования с совершенно другим вкусом.

source: `Simple Smalltalk Testing: With Patterns <https://web.archive.org/web/20150315073817/http://www.xprogramming.com/testfram.htm>`_
ru: `Простое тестирование Smalltalk: с шаблонами <https://web.archive.org/web/20150315073817/http://www.xprogramming.com/testfram.htm>`_

source: Kent Beck's original paper on testing frameworks using the pattern shared by :mod:`unittest`.
ru: Оригинальная статья Кента Бека о тестировании фреймворков с использованием шаблона, предоставленного :mod:`unittest`.

source: Third-party unittest framework with a lighter-weight syntax for writing tests. For example, ``assert func(10) == 42``.
ru: Сторонняя среда модульного тестирования с облегченным синтаксисом для написания тестов. Например, ``assert func(10) == 42``.

source: `The Python Testing Tools Taxonomy <https://wiki.python.org/moin/PythonTestingToolsTaxonomy>`_
ru: `Таксономия инструментов тестирования Python <https://wiki.python.org/moin/PythonTestingToolsTaxonomy>`_

source: An extensive list of Python testing tools including functional testing frameworks and mock object libraries.
ru: Обширный список инструментов тестирования Python, включая платформы функционального тестирования и библиотеки макетов объектов.

source: `Testing in Python Mailing List <http://lists.idyll.org/listinfo/testing-in-python>`_
ru: `Тестирование в списке рассылки Python <http://lists.idyll.org/listinfo/testing-in-python>`_

source: A special-interest-group for discussion of testing, and testing tools, in Python.
ru: Группа по особым интересам для обсуждения тестирования и инструментов тестирования на Python.

source: The script :file:`Tools/unittestgui/unittestgui.py` in the Python source distribution is a GUI tool for test discovery and execution. This is intended largely for ease of use for those new to unit testing. For production environments it is recommended that tests be driven by a continuous integration system such as `Buildbot <https://buildbot.net/>`_, `Jenkins <https://www.jenkins.io/>`_, `GitHub Actions <https://github.com/features/actions>`_, or `AppVeyor <https://www.appveyor.com/>`_.
ru: Сценарий :file:`Tools/unittestgui/unittestgui.py` в дистрибутиве исходного кода Python представляет собой инструмент с графическим интерфейсом для обнаружения и выполнения тестов. Это предназначено в основном для простоты использования для новичков в модульном тестировании. Для производственных сред рекомендуется, чтобы тесты проводились с помощью системы непрерывной интеграции, такой как `Buildbot <https://buildbot.net/>`_, `Jenkins <https://www.jenkins.io/>`_, ` Действия GitHub <https://github.com/features/actions>`_ или `AppVeyor <https://www.appveyor.com/>`_.

source: Basic example
ru: Основной пример

source: The :mod:`unittest` module provides a rich set of tools for constructing and running tests. This section demonstrates that a small subset of the tools suffice to meet the needs of most users.
ru: Модуль :mod:`unittest` предоставляет богатый набор инструментов для создания и запуска тестов. В этом разделе показано, что небольшого набора инструментов достаточно для удовлетворения потребностей большинства пользователей.

source: Here is a short script to test three string methods::
ru: Вот короткий скрипт для проверки трех строковых методов:

source: A testcase is created by subclassing :class:`unittest.TestCase`. The three individual tests are defined with methods whose names start with the letters ``test``. This naming convention informs the test runner about which methods represent tests.
ru: Тестовый пример создается путем создания подкласса :class:`unittest.TestCase`. Три отдельных теста определяются методами, имена которых начинаются с букв «test». Это соглашение об именах информирует исполнителя тестов о том, какие методы представляют тесты.

source: The crux of each test is a call to :meth:`~TestCase.assertEqual` to check for an expected result; :meth:`~TestCase.assertTrue` or :meth:`~TestCase.assertFalse` to verify a condition; or :meth:`~TestCase.assertRaises` to verify that a specific exception gets raised. These methods are used instead of the :keyword:`assert` statement so the test runner can accumulate all test results and produce a report.
ru: Суть каждого теста — это вызов :meth:`~TestCase.assertEqual` для проверки ожидаемого результата; :meth:`~TestCase.assertTrue` или :meth:`~TestCase.assertFalse` для проверки условия; или :meth:`~TestCase.assertRaises`, чтобы убедиться, что возникло конкретное исключение. Эти методы используются вместо оператора :keyword:`assert`, поэтому программа, запускающая тесты, может аккумулировать все результаты тестирования и создать отчет.

source: The :meth:`~TestCase.setUp` and :meth:`~TestCase.tearDown` methods allow you to define instructions that will be executed before and after each test method. They are covered in more detail in the section :ref:`organizing-tests`.
ru: Методы :meth:`~TestCase.setUp` и :meth:`~TestCase.tearDown` позволяют вам определять инструкции, которые будут выполняться до и после каждого метода тестирования. Более подробно они описаны в разделе :ref:`organizing-tests`.

source: The final block shows a simple way to run the tests. :func:`unittest.main` provides a command-line interface to the test script. When run from the command line, the above script produces an output that looks like this::
ru: Последний блок показывает простой способ запуска тестов. :func:`unittest.main` предоставляет интерфейс командной строки для тестового сценария. При запуске из командной строки приведенный выше сценарий выдает следующий результат:

source: Passing the ``-v`` option to your test script will instruct :func:`unittest.main` to enable a higher level of verbosity, and produce the following output::
ru: Передача опции ``-v`` в ваш тестовый скрипт даст указание :func:`unittest.main` включить более высокий уровень детализации и выдать следующий результат:

source: The above examples show the most commonly used :mod:`unittest` features which are sufficient to meet many everyday testing needs. The remainder of the documentation explores the full feature set from first principles.
ru: В приведенных выше примерах показаны наиболее часто используемые функции :mod:`unittest`, которых достаточно для удовлетворения многих повседневных потребностей тестирования. Остальная часть документации исследует полный набор функций с первых принципов.

source: The behavior of returning a value from a test method (other than the default ``None`` value), is now deprecated.
ru: Поведение возврата значения из тестового метода (кроме значения по умолчанию None) теперь считается устаревшим.

source: Command-Line Interface
ru: Интерфейс командной строки

source: The unittest module can be used from the command line to run tests from modules, classes or even individual test methods::
ru: Модуль unittest можно использовать из командной строки для запуска тестов из модулей, классов или даже отдельных методов тестирования:

source: You can pass in a list with any combination of module names, and fully qualified class or method names.
ru: Вы можете передать список с любой комбинацией имен модулей и полными именами классов или методов.

source: Test modules can be specified by file path as well::
ru: Тестовые модули также могут быть указаны по пути к файлу::

source: This allows you to use the shell filename completion to specify the test module. The file specified must still be importable as a module. The path is converted to a module name by removing the '.py' and converting path separators into '.'. If you want to execute a test file that isn't importable as a module you should execute the file directly instead.
ru: Это позволяет вам использовать завершение имени файла оболочки для указания тестового модуля. Указанный файл по-прежнему должен быть доступен для импорта как модуль. Путь преобразуется в имя модуля путем удаления «.py» и преобразования разделителей пути в «.». Если вы хотите выполнить тестовый файл, который нельзя импортировать как модуль, вместо этого вам следует выполнить файл напрямую.

source: You can run tests with more detail (higher verbosity) by passing in the -v flag::
ru: Вы можете запускать тесты с большей детализацией (более подробной информацией), передав флаг -v::

source: When executed without arguments :ref:`unittest-test-discovery` is started::
ru: При выполнении без аргументов запускается :ref:`unittest-test-discovery`::

source: For a list of all the command-line options::
ru: Список всех параметров командной строки:

source: In earlier versions it was only possible to run individual test methods and not modules or classes.
ru: В более ранних версиях можно было запускать только отдельные методы тестирования, а не модули или классы.

source: Command-line options
ru: Параметры командной строки

source: :program:`unittest` supports these command-line options:
ru: :program:`unittest` поддерживает следующие параметры командной строки:

source: The standard output and standard error streams are buffered during the test run. Output during a passing test is discarded. Output is echoed normally on test fail or error and is added to the failure messages.
ru: Потоки стандартного вывода и стандартных ошибок буферизуются во время выполнения теста. Вывод во время прохождения теста отбрасывается. Выходные данные обычно отображаются в случае сбоя или ошибки теста и добавляются к сообщениям об ошибках.

source: :kbd:`Control-C` during the test run waits for the current test to end and then reports all the results so far. A second :kbd:`Control-C` raises the normal :exc:`KeyboardInterrupt` exception.
ru: :kbd:`Control-C` во время выполнения теста ожидает завершения текущего теста, а затем сообщает обо всех результатах на данный момент. Второе нажатие :kbd:`Control-C` вызывает обычное исключение :exc:`KeyboardInterrupt`.

source: See `Signal Handling`_ for the functions that provide this functionality.
ru: См. «Обработка сигналов» для функций, обеспечивающих эту функциональность.

source: Stop the test run on the first error or failure.
ru: Остановите тестовый прогон при первой ошибке или сбое.

source: Only run test methods and classes that match the pattern or substring. This option may be used multiple times, in which case all test cases that match any of the given patterns are included.
ru: Запускайте только тестовые методы и классы, соответствующие шаблону или подстроке. Эту опцию можно использовать несколько раз, и в этом случае будут включены все тестовые примеры, соответствующие любому из заданных шаблонов.

source: Patterns that contain a wildcard character (``*``) are matched against the test name using :meth:`fnmatch.fnmatchcase`; otherwise simple case-sensitive substring matching is used.
ru: Шаблоны, содержащие подстановочный знак (``*``), сопоставляются с именем теста с помощью :meth:`fnmatch.fnmatchcase`; в противном случае используется простое сопоставление подстрок с учетом регистра.

source: Patterns are matched against the fully qualified test method name as imported by the test loader.
ru: Шаблоны сопоставляются с полным именем метода тестирования, импортированным загрузчиком тестов.

source: For example, ``-k foo`` matches ``foo_tests.SomeTest.test_something``, ``bar_tests.SomeTest.test_foo``, but not ``bar_tests.FooTest.test_something``.
ru: Например, ``-k foo`` соответствует ``foo_tests.SomeTest.test_something``, ``bar_tests.SomeTest.test_foo``, но не ``bar_tests.FooTest.test_something``.

source: Show local variables in tracebacks.
ru: Показывать локальные переменные в обратных трассировках.

source: The command-line options ``-b``, ``-c`` and ``-f`` were added.
ru: Были добавлены параметры командной строки ``-b``, ``-c`` и ``-f``.

source: The command-line option ``--locals``.
ru: Опция командной строки ``--locals``.

source: The command-line option ``-k``.
ru: Опция командной строки ``-k``.

source: The command line can also be used for test discovery, for running all of the tests in a project or just a subset.
ru: Командную строку также можно использовать для обнаружения тестов, для запуска всех тестов в проекте или только их подмножества.

source: Test Discovery
ru: Открытие тестов

source: Unittest supports simple test discovery. In order to be compatible with test discovery, all of the test files must be :ref:`modules <tut-modules>` or :ref:`packages <tut-packages>` importable from the top-level directory of the project (this means that their filenames must be valid :ref:`identifiers <identifiers>`).
ru: Unittest поддерживает простое обнаружение тестов. Чтобы быть совместимыми с обнаружением тестов, все тестовые файлы должны быть :ref:`modules <tut-modules>` или :ref:`packages <tut-packages>`, которые можно импортировать из каталога верхнего уровня проекта ( это означает, что имена их файлов должны быть действительными :ref:`identifiers <identifiers>`).

source: Test discovery is implemented in :meth:`TestLoader.discover`, but can also be used from the command line. The basic command-line usage is::
ru: Обнаружение тестов реализовано в :meth:`TestLoader.discover`, но его также можно использовать из командной строки. Основное использование командной строки:

source: As a shortcut, ``python -m unittest`` is the equivalent of ``python -m unittest discover``. If you want to pass arguments to test discovery the ``discover`` sub-command must be used explicitly.
ru: В качестве сокращения ``python -m unittest`` эквивалентен ``python -m unittest Discover``. Если вы хотите передать аргументы для проверки обнаружения, подкоманду Discover необходимо использовать явно.

source: The ``discover`` sub-command has the following options:
ru: Подкоманда ``discover`` имеет следующие параметры:

source: Verbose output
ru: Подробный вывод

source: Directory to start discovery (``.`` default)
ru: Каталог для начала обнаружения (``.`` по умолчанию)

source: Pattern to match test files (``test*.py`` default)
ru: Шаблон для соответствия тестовым файлам (по умолчанию ``test*.py``)

source: Top level directory of project (defaults to start directory)
ru: Каталог верхнего уровня проекта (по умолчанию — начальный каталог)

source: The :option:`-s`, :option:`-p`, and :option:`-t` options can be passed in as positional arguments in that order. The following two command lines are equivalent::
ru: Параметры :option:`-s`, :option:`-p` и :option:`-t` могут передаваться как позиционные аргументы в указанном порядке. Следующие две командные строки эквивалентны:

source: As well as being a path it is possible to pass a package name, for example ``myproject.subpackage.test``, as the start directory. The package name you supply will then be imported and its location on the filesystem will be used as the start directory.
ru: Помимо пути, в качестве начального каталога можно передать имя пакета, например ``myproject.subpackage.test``. Указанное вами имя пакета будет импортировано, а его местоположение в файловой системе будет использоваться в качестве начального каталога.

source: Test discovery loads tests by importing them. Once test discovery has found all the test files from the start directory you specify it turns the paths into package names to import. For example :file:`foo/bar/baz.py` will be imported as ``foo.bar.baz``.
ru: Обнаружение тестов загружает тесты путем их импорта. Как только обнаружение тестов обнаружит все тестовые файлы из указанного вами начального каталога, оно преобразует пути в имена пакетов для импорта. Например, :file:`foo/bar/baz.py` будет импортирован как ``foo.bar.baz``.

source: If you have a package installed globally and attempt test discovery on a different copy of the package then the import *could* happen from the wrong place. If this happens test discovery will warn you and exit.
ru: Если у вас глобально установлен пакет и вы пытаетесь выполнить тестовое обнаружение в другой копии пакета, импорт *может* произойти не из того места. Если это произойдет, Test Discovery предупредит вас и завершит работу.

source: If you supply the start directory as a package name rather than a path to a directory then discover assumes that whichever location it imports from is the location you intended, so you will not get the warning.
ru: Если вы указываете начальный каталог в качестве имени пакета, а не пути к каталогу, то Discover предполагает, что какое бы расположение он ни импортировал, это именно то место, которое вы намеревались использовать, поэтому вы не получите предупреждение.

source: Test modules and packages can customize test loading and discovery by through the `load_tests protocol`_.
ru: Тестовые модули и пакеты могут настраивать загрузку и обнаружение тестов с помощью протокола load_tests_.

source: Test discovery supports :term:`namespace packages <namespace package>` for the start directory. Note that you need to specify the top level directory too (e.g. ``python -m unittest discover -s root/namespace -t root``).
ru: Обнаружение тестов поддерживает :term:`пакеты пространства имен <пакет пространства имен>` для начального каталога. Обратите внимание, что вам также необходимо указать каталог верхнего уровня (например, ``python -m unittest Discover -s root/namespace -t root``).

source: :mod:`unittest` dropped the :term:`namespace packages <namespace package>` support in Python 3.11. It has been broken since Python 3.7. Start directory and subdirectories containing tests must be regular package that have ``__init__.py`` file.
ru: :mod:`unittest` прекратил поддержку :term:`namespace packages <namespace package>` в Python 3.11. Он был сломан начиная с Python 3.7. Начальный каталог и подкаталоги, содержащие тесты, должны представлять собой обычный пакет с файлом ``__init__.py``.

source: Directories containing start directory still can be a namespace package. In this case, you need to specify start directory as dotted package name, and target directory explicitly. For example::
ru: Каталоги, содержащие стартовый каталог, по-прежнему могут быть пакетом пространства имен. В этом случае вам необходимо указать начальный каталог в виде имени пакета, разделенного точками, и явно указать целевой каталог. Например::

source: Organizing test code
ru: Организация тестового кода

source: The basic building blocks of unit testing are :dfn:`test cases` --- single scenarios that must be set up and checked for correctness. In :mod:`unittest`, test cases are represented by :class:`unittest.TestCase` instances. To make your own test cases you must write subclasses of :class:`TestCase` or use :class:`FunctionTestCase`.
ru: Основными строительными блоками модульного тестирования являются тестовые примеры — отдельные сценарии, которые необходимо настроить и проверить на корректность. В :mod:`unittest` тестовые случаи представлены экземплярами :class:`unittest.TestCase`. Чтобы создать свои собственные тестовые примеры, вы должны написать подклассы :class:`TestCase` или использовать :class:`FunctionTestCase`.

source: The testing code of a :class:`TestCase` instance should be entirely self contained, such that it can be run either in isolation or in arbitrary combination with any number of other test cases.
ru: Код тестирования экземпляра :class:`TestCase` должен быть полностью автономным, чтобы его можно было запускать либо изолированно, либо в произвольной комбинации с любым количеством других тестовых случаев.

source: The simplest :class:`TestCase` subclass will simply implement a test method (i.e. a method whose name starts with ``test``) in order to perform specific testing code::
ru: Самый простой подкласс :class:`TestCase` просто реализует тестовый метод (т.е. метод, имя которого начинается с ``test``) для выполнения конкретного кода тестирования:

source: Note that in order to test something, we use one of the :ref:`assert\* methods <assert-methods>` provided by the :class:`TestCase` base class. If the test fails, an exception will be raised with an explanatory message, and :mod:`unittest` will identify the test case as a :dfn:`failure`. Any other exceptions will be treated as :dfn:`errors`.
ru: Обратите внимание: чтобы что-то протестировать, мы используем один из методов :ref:`assert\* <assert-methods>`, предоставляемых базовым классом :class:`TestCase`. Если тест не пройден, будет выдано исключение с поясняющим сообщением, и :mod:`unittest` идентифицирует тестовый пример как :dfn:`failure`. Любые другие исключения будут рассматриваться как :dfn:`errors`.
