Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/unittest.mock-examples.po
Languages: ru

source: An exception to this rule are the non-callable mocks. Attributes use the callable variant because otherwise non-callable mocks couldn't have callable methods.
ru: Исключением из этого правила являются невызываемые макеты. Атрибуты используют вызываемый вариант, потому что в противном случае невызываемые макеты не могли бы иметь вызываемые методы.

source: Mocking imports with patch.dict
ru: Имитирующий импорт с помощью patch.dict

source: One situation where mocking can be hard is where you have a local import inside a function. These are harder to mock because they aren't using an object from the module namespace that we can patch out.
ru: Одна из ситуаций, когда издевательство может быть трудным, — это локальный импорт внутри функции. Их сложнее имитировать, поскольку они не используют объект из пространства имен модуля, который мы можем исправить.

source: Generally local imports are to be avoided. They are sometimes done to prevent circular dependencies, for which there is *usually* a much better way to solve the problem (refactor the code) or to prevent "up front costs" by delaying the import. This can also be solved in better ways than an unconditional local import (store the module as a class or module attribute and only do the import on first use).
ru: Обычно следует избегать местного импорта. Иногда это делается для предотвращения циклических зависимостей, для которых *обычно* есть гораздо лучший способ решить проблему (рефакторинг кода) или предотвратить «предварительные затраты» путем задержки импорта. Эту проблему также можно решить лучше, чем безусловный локальный импорт (сохраните модуль как атрибут класса или модуля и выполняйте импорт только при первом использовании).

source: That aside there is a way to use ``mock`` to affect the results of an import. Importing fetches an *object* from the :data:`sys.modules` dictionary. Note that it fetches an *object*, which need not be a module. Importing a module for the first time results in a module object being put in ``sys.modules``, so usually when you import something you get a module back. This need not be the case however.
ru: Помимо этого, есть способ использовать «mock», чтобы повлиять на результаты импорта. При импорте извлекается *объект* из словаря :data:`sys.modules`. Обратите внимание, что он извлекает *объект*, который не обязательно должен быть модулем. Импорт модуля в первый раз приводит к тому, что объект модуля помещается в ``sys.modules``, поэтому обычно, когда вы что-то импортируете, вы получаете модуль обратно. Однако это не обязательно так.

source: This means you can use :func:`patch.dict` to *temporarily* put a mock in place in :data:`sys.modules`. Any imports whilst this patch is active will fetch the mock. When the patch is complete (the decorated function exits, the with statement body is complete or ``patcher.stop()`` is called) then whatever was there previously will be restored safely.
ru: Это означает, что вы можете использовать :func:`patch.dict`, чтобы *временно* разместить макет в :data:`sys.modules`. Любой импорт, пока этот патч активен, приведет к получению макета. Когда исправление завершено (завершается декорированная функция, тело оператора with завершено или вызывается patcher.stop()), то все, что было ранее, будет безопасно восстановлено.

source: Here's an example that mocks out the 'fooble' module.
ru: Вот пример, который имитирует модуль «fooble».

source: As you can see the ``import fooble`` succeeds, but on exit there is no 'fooble' left in :data:`sys.modules`.
ru: Как вы можете видеть, импорт fooble завершился успешно, но при выходе в :data:`sys.modules` не осталось никакого ``fooble''.

source: This also works for the ``from module import name`` form:
ru: Это также работает для формы ``from module import name`` form:

source: With slightly more work you can also mock package imports:
ru: Немного поработав, вы также можете имитировать импорт пакетов:

source: Tracking order of calls and less verbose call assertions
ru: Отслеживание порядка вызовов и менее подробные утверждения вызовов

source: The :class:`Mock` class allows you to track the *order* of method calls on your mock objects through the :attr:`~Mock.method_calls` attribute. This doesn't allow you to track the order of calls between separate mock objects, however we can use :attr:`~Mock.mock_calls` to achieve the same effect.
ru: Класс :class:`Mock` позволяет вам отслеживать *порядок* вызовов методов ваших макетных объектов через атрибут :attr:`~Mock.method_calls`. Это не позволяет отслеживать порядок вызовов между отдельными макетными объектами, однако мы можем использовать :attr:`~Mock.mock_calls` для достижения того же эффекта.

source: Because mocks track calls to child mocks in ``mock_calls``, and accessing an arbitrary attribute of a mock creates a child mock, we can create our separate mocks from a parent one. Calls to those child mock will then all be recorded, in order, in the ``mock_calls`` of the parent:
ru: Поскольку макеты отслеживают вызовы дочерних макетов в ``mock_calls``, а доступ к произвольному атрибуту макета создает дочерний макет, мы можем создавать отдельные макеты из родительского. Все вызовы этих дочерних макетов будут по порядку записаны в ``mock_calls`` родительского объекта:

source: We can then assert about the calls, including the order, by comparing with the ``mock_calls`` attribute on the manager mock:
ru: Затем мы можем утверждать о вызовах, включая их порядок, путем сравнения с атрибутом ``mock_calls`` в макете менеджера:

source: If ``patch`` is creating, and putting in place, your mocks then you can attach them to a manager mock using the :meth:`~Mock.attach_mock` method. After attaching calls will be recorded in ``mock_calls`` of the manager. ::
ru: Если ``patch`` создает и размещает ваши макеты, вы можете прикрепить их к макету менеджера, используя метод :meth:`~Mock.attach_mock`. После прикрепления звонки будут записываться в ``mock_calls`` менеджера. ::

source: If many calls have been made, but you're only interested in a particular sequence of them then an alternative is to use the :meth:`~Mock.assert_has_calls` method. This takes a list of calls (constructed with the :data:`call` object). If that sequence of calls are in :attr:`~Mock.mock_calls` then the assert succeeds.
ru: Если было сделано много вызовов, но вас интересует только определенная их последовательность, альтернативой является использование метода :meth:`~Mock.assert_has_calls`. Для этого требуется список вызовов (созданный с помощью объекта :data:`call`). Если эта последовательность вызовов находится в :attr:`~Mock.mock_calls`, тогда утверждение будет успешным.

source: Even though the chained call ``m.one().two().three()`` aren't the only calls that have been made to the mock, the assert still succeeds.
ru: Несмотря на то, что связанный вызов m.one().two().three() — не единственные вызовы, которые были сделаны для макета, утверждение все равно завершается успешно.

source: Sometimes a mock may have several calls made to it, and you are only interested in asserting about *some* of those calls. You may not even care about the order. In this case you can pass ``any_order=True`` to ``assert_has_calls``:
ru: Иногда к макету может быть сделано несколько вызовов, и вас интересует только утверждение о *некоторых* из этих вызовов. Возможно, вас даже не волнует порядок. В этом случае вы можете передать ``any_order=True`` в ``assert_has_calls``:

source: More complex argument matching
ru: Более сложное сопоставление аргументов

source: Using the same basic concept as :data:`ANY` we can implement matchers to do more complex assertions on objects used as arguments to mocks.
ru: Используя ту же базовую концепцию, что и :data:`ANY`, мы можем реализовать сопоставители для выполнения более сложных утверждений для объектов, используемых в качестве аргументов для макетов.

source: Suppose we expect some object to be passed to a mock that by default compares equal based on object identity (which is the Python default for user defined classes). To use :meth:`~Mock.assert_called_with` we would need to pass in the exact same object. If we are only interested in some of the attributes of this object then we can create a matcher that will check these attributes for us.
ru: Предположим, мы ожидаем, что некоторый объект будет передан в макет, который по умолчанию сравнивает равные на основе идентичности объекта (что является стандартом Python по умолчанию для пользовательских классов). Чтобы использовать :meth:`~Mock.assert_known_with`, нам нужно будет передать тот же самый объект. Если нас интересуют только некоторые атрибуты этого объекта, мы можем создать средство сопоставления, которое будет проверять эти атрибуты за нас.

source: You can see in this example how a 'standard' call to ``assert_called_with`` isn't sufficient:
ru: В этом примере вы можете видеть, что «стандартного» вызова ``assert_called_with`` недостаточно:

source: A comparison function for our ``Foo`` class might look something like this:
ru: Функция сравнения для нашего класса Foo может выглядеть примерно так:

source: And a matcher object that can use comparison functions like this for its equality operation would look something like this:
ru: И объект сопоставления, который может использовать подобные функции сравнения для операции равенства, будет выглядеть примерно так:

source: Putting all this together:
ru: Собираем все это вместе:

source: The ``Matcher`` is instantiated with our compare function and the ``Foo`` object we want to compare against. In ``assert_called_with`` the ``Matcher`` equality method will be called, which compares the object the mock was called with against the one we created our matcher with. If they match then ``assert_called_with`` passes, and if they don't an :exc:`AssertionError` is raised:
ru: Экземпляр ``Matcher`` создается с помощью нашей функции сравнения и объекта ``Foo``, с которым мы хотим сравнить. В ``assert_called_with`` будет вызван метод равенства ``Matcher``, который сравнивает объект, с которым был вызван макет, с тем, с которым мы создали наш сопоставитель. Если они совпадают, то ``assert_called_with`` проходит, а если нет, то возникает :exc:`AssertionError`:

source: With a bit of tweaking you could have the comparison function raise the :exc:`AssertionError` directly and provide a more useful failure message.
ru: После небольшой настройки вы могли бы заставить функцию сравнения напрямую вызывать :exc:`AssertionError` и выдавать более полезное сообщение об ошибке.

source: As of version 1.5, the Python testing library `PyHamcrest <https://pyhamcrest.readthedocs.io/>`_ provides similar functionality, that may be useful here, in the form of its equality matcher (`hamcrest.library.integration.match_equality <https://pyhamcrest.readthedocs.io/en/release-1.8/integration/#module-hamcrest.library.integration.match_equality>`_).
ru: Начиная с версии 1.5, библиотека тестирования Python `PyHamcrest <https://pyhamcrest.readthedocs.io/>`_ предоставляет аналогичную функциональность, которая может быть здесь полезна, в форме средства сопоставления равенства (`hamcrest.library.integration. match_equality <https://pyhamcrest.readthedocs.io/en/release-1.8/integration/#module-hamcrest.library.integration.match_equality>`_).
