Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/unittest.mock-examples.po
Languages: ru

source: We can do that in a slightly nicer way using the :meth:`~Mock.configure_mock` method to directly set the return value for us::
ru: Мы можем сделать это немного более удобным способом, используя метод :meth:`~Mock.configure_mock`, чтобы напрямую установить для нас возвращаемое значение:

source: With these we monkey patch the "mock backend" in place and can make the real call::
ru: С их помощью мы исправим «фиктивный бэкэнд» и сможем сделать настоящий вызов:

source: Using :attr:`~Mock.mock_calls` we can check the chained call with a single assert. A chained call is several calls in one line of code, so there will be several entries in ``mock_calls``. We can use :meth:`call.call_list` to create this list of calls for us::
ru: Используя :attr:`~Mock.mock_calls`, мы можем проверить цепочку вызовов с помощью одного утверждения. Связанный вызов — это несколько вызовов в одной строке кода, поэтому в ``mock_calls`` будет несколько записей. Мы можем использовать :meth:`call.call_list`, чтобы создать для нас этот список вызовов:

source: Partial mocking
ru: Частичное издевательство

source: In some tests I wanted to mock out a call to :meth:`datetime.date.today` to return a known date, but I didn't want to prevent the code under test from creating new date objects. Unfortunately :class:`datetime.date` is written in C, and so I couldn't just monkey-patch out the static :meth:`datetime.date.today` method.
ru: В некоторых тестах я хотел имитировать вызов :meth:`datetime.date.today` для возврата известной даты, но я не хотел препятствовать тестируемому коду создавать новые объекты даты. К сожалению, :class:`datetime.date` написан на C, и поэтому я не мог просто исправить статический :meth:`datetime.date.today` метод.

source: I found a simple way of doing this that involved effectively wrapping the date class with a mock, but passing through calls to the constructor to the real class (and returning real instances).
ru: Я нашел простой способ сделать это, который включал в себя эффективную упаковку класса даты в макет, но передачу вызовов конструктора реальному классу (и возврат реальных экземпляров).

source: The :func:`patch decorator <patch>` is used here to mock out the ``date`` class in the module under test. The :attr:`~Mock.side_effect` attribute on the mock date class is then set to a lambda function that returns a real date. When the mock date class is called a real date will be constructed and returned by ``side_effect``. ::
ru: Декоратор :func:`patch <patch>` используется здесь для макетирования класса ``date`` в тестируемом модуле. Атрибут :attr:`~Mock.side_effect` в классе ложной даты затем устанавливается в лямбда-функцию, которая возвращает реальную дату. Когда вызывается класс ложной даты, реальная дата будет создана и возвращена ``side_effect``. ::

source: Note that we don't patch :class:`datetime.date` globally, we patch ``date`` in the module that *uses* it. See :ref:`where to patch <where-to-patch>`.
ru: Обратите внимание, что мы не обновляем :class:`datetime.date` глобально, мы исправляем ``date`` в модуле, который *использует* его. См. :ref:`где исправлять <где-исправить>`.

source: When ``date.today()`` is called a known date is returned, but calls to the ``date(...)`` constructor still return normal dates. Without this you can find yourself having to calculate an expected result using exactly the same algorithm as the code under test, which is a classic testing anti-pattern.
ru: Когда вызывается ``date.today()``, возвращается известная дата, но вызовы конструктора ``date(...)`` по-прежнему возвращают обычные даты. Без этого вам придется вычислять ожидаемый результат, используя тот же алгоритм, что и тестируемый код, что является классическим антишаблоном тестирования.

source: Calls to the date constructor are recorded in the ``mock_date`` attributes (``call_count`` and friends) which may also be useful for your tests.
ru: Вызовы конструктора даты записываются в атрибуты ``mock_date`` (``call_count`` и его друзья), которые также могут быть полезны для ваших тестов.

source: An alternative way of dealing with mocking dates, or other builtin classes, is discussed in `this blog entry <https://williambert.online/2011/07/how-to-unit-testing-in-django-with-mocking-and-patching/>`_.
ru: Альтернативный способ работы с ложными датами или другими встроенными классами обсуждается в этой записи блога <https://williambert.online/2011/07/how-to-unit-testing-in-django-with-mocking- и-исправление/>`_.

source: Mocking a Generator Method
ru: Издевательство над методом генератора

source: A Python generator is a function or method that uses the :keyword:`yield` statement to return a series of values when iterated over [#]_.
ru: Генератор Python — это функция или метод, который использует оператор :keyword:`yield` для возврата серии значений при повторении. [#]_ .

source: A generator method / function is called to return the generator object. It is the generator object that is then iterated over. The protocol method for iteration is :meth:`~container.__iter__`, so we can mock this using a :class:`MagicMock`.
ru: Метод/функция генератора вызывается для возврата объекта генератора. Затем выполняется итерация объекта-генератора. Метод протокола для итерации — :meth:`~container.__iter__`, поэтому мы можем имитировать его, используя :class:`MagicMock`.

source: Here's an example class with an "iter" method implemented as a generator:
ru: Вот пример класса с методом «iter», реализованным как генератор:

source: How would we mock this class, and in particular its "iter" method?
ru: Как бы мы высмеивали этот класс и, в частности, его метод «iter»?

source: To configure the values returned from the iteration (implicit in the call to :class:`list`), we need to configure the object returned by the call to ``foo.iter()``.
ru: Чтобы настроить значения, возвращаемые в результате итерации (неявно при вызове :class:`list`), нам нужно настроить объект, возвращаемый вызовом ``foo.iter()``.

source: There are also generator expressions and more `advanced uses <http://www.dabeaz.com/coroutines/index.html>`_ of generators, but we aren't concerned about them here. A very good introduction to generators and how powerful they are is: `Generator Tricks for Systems Programmers <http://www.dabeaz.com/generators/>`_.
ru: Существуют также выражения-генераторы и более `продвинутые возможности использования <http://www.dabeaz.com/coroutines/index.html>`_ генераторов, но они здесь нас не интересуют. Очень хорошее введение в генераторы и их мощь: «Советы с генераторами для системных программистов <http://www.dabeaz.com/generators/>»_.

source: Applying the same patch to every test method
ru: Применение одного и того же патча к каждому методу тестирования

source: If you want several patches in place for multiple test methods the obvious way is to apply the patch decorators to every method. This can feel like unnecessary repetition. Instead, you can use :func:`patch` (in all its various forms) as a class decorator. This applies the patches to all test methods on the class. A test method is identified by methods whose names start with ``test``::
ru: Если вам нужно несколько патчей для нескольких методов тестирования, очевидный способ — применить декораторы патчей к каждому методу. Это может показаться ненужным повторением. Вместо этого вы можете использовать :func:`patch` (во всех его различных формах) в качестве декоратора класса. При этом исправления применяются ко всем методам тестирования в классе. Метод тестирования идентифицируется методами, имена которых начинаются с ``test``::

source: An alternative way of managing patches is to use the :ref:`start-and-stop`. These allow you to move the patching into your ``setUp`` and ``tearDown`` methods. ::
ru: Альтернативный способ управления патчами — использование :ref:`start-and-stop`. Они позволяют вам переместить исправления в ваши методы ``setUp`` и ``tearDown``. ::

source: If you use this technique you must ensure that the patching is "undone" by calling ``stop``. This can be fiddlier than you might think, because if an exception is raised in the setUp then tearDown is not called. :meth:`unittest.TestCase.addCleanup` makes this easier::
ru: Если вы используете этот метод, вы должны убедиться, что исправление «отменено», вызвав ``stop``. Это может быть сложнее, чем вы думаете, потому что если в setUp возникает исключение, то TearDown не вызывается. :meth:`unittest.TestCase.addCleanup` делает это проще::

source: Mocking Unbound Methods
ru: Издевательство над несвязанными методами

source: Whilst writing tests today I needed to patch an *unbound method* (patching the method on the class rather than on the instance). I needed self to be passed in as the first argument because I want to make asserts about which objects were calling this particular method. The issue is that you can't patch with a mock for this, because if you replace an unbound method with a mock it doesn't become a bound method when fetched from the instance, and so it doesn't get self passed in. The workaround is to patch the unbound method with a real function instead. The :func:`patch` decorator makes it so simple to patch out methods with a mock that having to create a real function becomes a nuisance.
ru: Сегодня, когда я писал тесты, мне нужно было исправить *несвязанный метод* (исправив метод в классе, а не в экземпляре). Мне нужно было передать self в качестве первого аргумента, потому что я хочу утверждать, какие объекты вызывали этот конкретный метод. Проблема в том, что вы не можете исправить это с помощью макета, потому что если вы замените несвязанный метод макетом, он не станет связанным методом при извлечении из экземпляра, и поэтому он не будет передан самостоятельно. Обходной путь — заменить несвязанный метод реальной функцией. Декоратор :func:`patch` настолько упрощает исправление методов с помощью макета, что необходимость создания реальной функции становится обременительной.

source: If you pass ``autospec=True`` to patch then it does the patching with a *real* function object. This function object has the same signature as the one it is replacing, but delegates to a mock under the hood. You still get your mock auto-created in exactly the same way as before. What it means though, is that if you use it to patch out an unbound method on a class the mocked function will be turned into a bound method if it is fetched from an instance. It will have ``self`` passed in as the first argument, which is exactly what I wanted:
ru: Если вы передадите ``autospec=True`` для исправления, то исправление будет выполнено с использованием *реального* функционального объекта. Этот объект функции имеет ту же сигнатуру, что и тот, который он заменяет, но под капотом делегирует макет. Вы по-прежнему автоматически создаете макет точно так же, как и раньше. Однако это означает, что если вы используете его для исправления несвязанного метода в классе, имитируемая функция будет превращена в связанный метод, если она будет получена из экземпляра. В качестве первого аргумента будет передано ``self``, и это именно то, что я хотел:

source: If we don't use ``autospec=True`` then the unbound method is patched out with a Mock instance instead, and isn't called with ``self``.
ru: Если мы не используем autospec=True, то несвязанный метод вместо этого исправляется с помощью Mock-экземпляра и не вызывается с ``self``.

source: Checking multiple calls with mock
ru: Проверка нескольких вызовов с помощью макета

source: mock has a nice API for making assertions about how your mock objects are used.
ru: У макета есть хороший API для создания утверждений о том, как используются ваши макетные объекты.

source: If your mock is only being called once you can use the :meth:`~Mock.assert_called_once_with` method that also asserts that the :attr:`~Mock.call_count` is one.
ru: Если ваш макет вызывается только один раз, вы можете использовать метод :meth:`~Mock.assert_known_once_with`, который также утверждает, что :attr:`~Mock.call_count` является таковым.

source: Both ``assert_called_with`` and ``assert_called_once_with`` make assertions about the *most recent* call. If your mock is going to be called several times, and you want to make assertions about *all* those calls you can use :attr:`~Mock.call_args_list`:
ru: И ``assert_called_with``, и ``assert_called_once_with`` делают утверждения о *самом последнем* вызове. Если ваш макет будет вызываться несколько раз, и вы хотите сделать утверждения обо всех * этих вызовах, вы можете использовать :attr:`~Mock.call_args_list`:

source: The :data:`call` helper makes it easy to make assertions about these calls. You can build up a list of expected calls and compare it to ``call_args_list``. This looks remarkably similar to the repr of the ``call_args_list``:
ru: Помощник :data:`call` позволяет легко делать утверждения об этих вызовах. Вы можете создать список ожидаемых вызовов и сравнить его с call_args_list. Это очень похоже на воспроизведение ``call_args_list``:

source: Coping with mutable arguments
ru: Как справиться с изменчивыми аргументами

source: Another situation is rare, but can bite you, is when your mock is called with mutable arguments. ``call_args`` and ``call_args_list`` store *references* to the arguments. If the arguments are mutated by the code under test then you can no longer make assertions about what the values were when the mock was called.
ru: Другая ситуация встречается редко, но может вас укусить — это когда ваш макет вызывается с изменяемыми аргументами. ``call_args`` и ``call_args_list`` хранят *ссылки* на аргументы. Если аргументы изменяются тестируемым кодом, вы больше не можете делать утверждения о том, какими были значения при вызове макета.

source: Here's some example code that shows the problem. Imagine the following functions defined in 'mymodule'::
ru: Вот пример кода, который показывает проблему. Представьте себе следующие функции, определенные в mymodule::

source: When we try to test that ``grob`` calls ``frob`` with the correct argument look what happens::
ru: Когда мы попытаемся проверить, что ``grob`` вызывает ``frob`` с правильным аргументом, посмотрите, что происходит:

source: One possibility would be for mock to copy the arguments you pass in. This could then cause problems if you do assertions that rely on object identity for equality.
ru: Одной из возможностей может быть копирование переданных вами аргументов. Это может вызвать проблемы, если вы выполняете утверждения, которые для равенства полагаются на идентичность объекта.

source: Here's one solution that uses the :attr:`~Mock.side_effect` functionality. If you provide a ``side_effect`` function for a mock then ``side_effect`` will be called with the same args as the mock. This gives us an opportunity to copy the arguments and store them for later assertions. In this example I'm using *another* mock to store the arguments so that I can use the mock methods for doing the assertion. Again a helper function sets this up for me. ::
ru: Вот одно решение, использующее функциональность :attr:`~Mock.side_effect`. Если вы предоставите функцию Side_effect для макета, то Side_effect будет вызываться с теми же аргументами, что и макет. Это дает нам возможность скопировать аргументы и сохранить их для последующих утверждений. В этом примере я использую *другой* макет для хранения аргументов, чтобы можно было использовать методы макета для выполнения утверждения. Опять же, вспомогательная функция устанавливает это для меня. ::

source: ``copy_call_args`` is called with the mock that will be called. It returns a new mock that we do the assertion on. The ``side_effect`` function makes a copy of the args and calls our ``new_mock`` with the copy.
ru: ``copy_call_args`` вызывается с макетом, который будет вызван. Он возвращает новый макет, на котором мы делаем утверждение. Функция Side_effect создает копию аргументов и вызывает наш new_mock с копией.

source: If your mock is only going to be used once there is an easier way of checking arguments at the point they are called. You can simply do the checking inside a ``side_effect`` function.
ru: Если ваш макет будет использоваться только один раз, есть более простой способ проверки аргументов в момент их вызова. Вы можете просто выполнить проверку внутри функции Side_effect.

source: An alternative approach is to create a subclass of :class:`Mock` or :class:`MagicMock` that copies (using :func:`copy.deepcopy`) the arguments. Here's an example implementation:
ru: Альтернативный подход — создать подкласс :class:`Mock` или :class:`MagicMock`, который копирует (с использованием :func:`copy.deepcopy`) аргументы. Вот пример реализации:

source: When you subclass ``Mock`` or ``MagicMock`` all dynamically created attributes, and the ``return_value`` will use your subclass automatically. That means all children of a ``CopyingMock`` will also have the type ``CopyingMock``.
ru: Когда вы создаете подкласс Mock или MagicMock, все динамически создаваемые атрибуты и return_value будут автоматически использовать ваш подкласс. Это означает, что все дочерние элементы CopyingMock также будут иметь тип CopyingMock.

source: Nesting Patches
ru: Вложение патчей

source: Using patch as a context manager is nice, but if you do multiple patches you can end up with nested with statements indenting further and further to the right::
ru: Использовать патч в качестве менеджера контекста — это хорошо, но если вы сделаете несколько патчей, вы можете получить вложенные операторы, отступающие все дальше и дальше вправо::

source: With unittest ``cleanup`` functions and the :ref:`start-and-stop` we can achieve the same effect without the nested indentation. A simple helper method, ``create_patch``, puts the patch in place and returns the created mock for us::
ru: С помощью функций очистки unittest и :ref:`start-and-stop` мы можем добиться того же эффекта без вложенных отступов. Простой вспомогательный метод create_patch устанавливает патч на место и возвращает нам созданный макет:

source: Mocking a dictionary with MagicMock
ru: Издевательство над словарем с помощью MagicMock

source: You may want to mock a dictionary, or other container object, recording all access to it whilst having it still behave like a dictionary.
ru: Возможно, вы захотите имитировать словарь или другой объект-контейнер, записывая весь доступ к нему, сохраняя при этом его поведение как словарь.

source: We can do this with :class:`MagicMock`, which will behave like a dictionary, and using :data:`~Mock.side_effect` to delegate dictionary access to a real underlying dictionary that is under our control.
ru: Мы можем сделать это с помощью :class:`MagicMock`, который будет вести себя как словарь, и используя :data:`~Mock.side_effect` для делегирования доступа к словарю реальному базовому словарю, который находится под нашим контролем.

source: When the :meth:`~object.__getitem__` and :meth:`~object.__setitem__` methods of our ``MagicMock`` are called (normal dictionary access) then ``side_effect`` is called with the key (and in the case of ``__setitem__`` the value too). We can also control what is returned.
ru: Когда вызываются методы :meth:`~object.__getitem__` и :meth:`~object.__setitem__` нашего ``MagicMock`` (обычный доступ к словарю), тогда ``side_effect`` вызывается с ключом (и в в случае ``__setitem__`` значение тоже). Мы также можем контролировать то, что возвращается.

source: After the ``MagicMock`` has been used we can use attributes like :data:`~Mock.call_args_list` to assert about how the dictionary was used:
ru: После использования MagicMock мы можем использовать такие атрибуты, как :data:`~Mock.call_args_list`, чтобы утверждать, как использовался словарь:

source: An alternative to using ``MagicMock`` is to use ``Mock`` and *only* provide the magic methods you specifically want:
ru: Альтернативой использованию MagicMock является использование Mock и *только* предоставление тех магических методов, которые вам нужны:

source: A *third* option is to use ``MagicMock`` but passing in ``dict`` as the *spec* (or *spec_set*) argument so that the ``MagicMock`` created only has dictionary magic methods available:
ru: Третий вариант — использовать MagicMock, но передав dict в качестве аргумента *spec* (или *spec_set*), чтобы созданный MagicMock имел только доступные словарные магические методы:

source: With these side effect functions in place, the ``mock`` will behave like a normal dictionary but recording the access. It even raises a :exc:`KeyError` if you try to access a key that doesn't exist.
ru: При наличии этих функций побочного эффекта ``mock`` будет вести себя как обычный словарь, но записывает доступ. Он даже выдает ошибку :exc:`KeyError`, если вы пытаетесь получить доступ к несуществующему ключу.

source: After it has been used you can make assertions about the access using the normal mock methods and attributes:
ru: После его использования вы можете делать утверждения о доступе, используя обычные фиктивные методы и атрибуты:

source: Mock subclasses and their attributes
ru: Мокирующие подклассы и их атрибуты

source: There are various reasons why you might want to subclass :class:`Mock`. One reason might be to add helper methods. Here's a silly example:
ru: Существуют различные причины, по которым вы можете захотеть создать подкласс :class:`Mock`. Одной из причин может быть добавление вспомогательных методов. Вот глупый пример:

source: The standard behaviour for ``Mock`` instances is that attributes and the return value mocks are of the same type as the mock they are accessed on. This ensures that ``Mock`` attributes are ``Mocks`` and ``MagicMock`` attributes are ``MagicMocks`` [#]_. So if you're subclassing to add helper methods then they'll also be available on the attributes and return value mock of instances of your subclass.
ru: Стандартное поведение экземпляров ``Mock`` заключается в том, что атрибуты и макеты возвращаемого значения имеют тот же тип, что и макет, к которому они обращаются. Это гарантирует, что атрибуты ``Mock`` будут ``Mocks``, а ``MagicMock`` будут ``MagicMocks``. [#]_ . Поэтому, если вы создаете подкласс для добавления вспомогательных методов, они также будут доступны в атрибутах и ​​макете возвращаемого значения экземпляров вашего подкласса.

source: Sometimes this is inconvenient. For example, `one user <https://code.google.com/archive/p/mock/issues/105>`_ is subclassing mock to created a `Twisted adaptor <https://twisted.org/documents/11.0.0/api/twisted.python.components.html>`_. Having this applied to attributes too actually causes errors.
ru: Иногда это неудобно. Например, `один пользователь <https://code.google.com/archive/p/mock/issues/105>`_ создает подкласс подкласса для создания `Twisted адаптера <https://twisted.org/documents/11.0 .0/api/twisted.python.comComponents.html>`_. Применение этого и к атрибутам фактически приводит к ошибкам.

source: ``Mock`` (in all its flavours) uses a method called ``_get_child_mock`` to create these "sub-mocks" for attributes and return values. You can prevent your subclass being used for attributes by overriding this method. The signature is that it takes arbitrary keyword arguments (``**kwargs``) which are then passed onto the mock constructor:
ru: ``Mock`` (во всех его вариантах) использует метод под названием ``_get_child_mock`` для создания этих "под-макетов" для атрибутов и возвращаемых значений. Вы можете запретить использование вашего подкласса для атрибутов, переопределив этот метод. Сигнатура заключается в том, что он принимает произвольные аргументы ключевого слова (``**kwargs``), которые затем передаются в макетный конструктор:
