Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/unittest.po
Languages: ru

source: Note that this is equivalent to ``bool(expr) is True`` and not to ``expr is True`` (use ``assertIs(expr, True)`` for the latter). This method should also be avoided when more specific methods are available (e.g. ``assertEqual(a, b)`` instead of ``assertTrue(a == b)``), because they provide a better error message in case of failure.
ru: Обратите внимание, что это эквивалентно ``bool(expr) is True``, а не ``expr is True`` (для последнего используйте ``assertIs(expr, True)``). Этого метода также следует избегать, когда доступны более конкретные методы (например, ``assertEqual(a, b)`` вместо ``assertTrue(a == b)``), поскольку они обеспечивают лучшее сообщение об ошибке в случае сбоя. .

source: Test that *first* and *second* are (or are not) the same object.
ru: Проверьте, что *первый* и *второй* являются (или не являются) одним и тем же объектом.

source: Test that *expr* is (or is not) ``None``.
ru: Проверьте, что *expr* равно (или нет) ``None``.

source: Test that *member* is (or is not) in *container*.
ru: Проверьте, что *member* находится (или нет) в *container*.

source: Test that *obj* is (or is not) an instance of *cls* (which can be a class or a tuple of classes, as supported by :func:`isinstance`). To check for the exact type, use :func:`assertIs(type(obj), cls) <assertIs>`.
ru: Проверьте, что *obj* является (или не является) экземпляром *cls* (который может быть классом или кортежем классов, что поддерживается :func:`isinstance`). Чтобы проверить точный тип, используйте :func:`assertIs(type(obj), cls) <assertIs>`.

source: It is also possible to check the production of exceptions, warnings, and log messages using the following methods:
ru: Также можно проверить создание исключений, предупреждений и сообщений журнала следующими методами:

source: ``fun(*args, **kwds)`` raises *exc* and the message matches regex *r*
ru: ``fun(*args, **kwds)`` вызывает *exc* и сообщение соответствует регулярному выражению *r*

source: ``fun(*args, **kwds)`` raises *warn*
ru: ``fun(*args, **kwds)`` вызывает *warn*

source: ``fun(*args, **kwds)`` raises *warn* and the message matches regex *r*
ru: ``fun(*args, **kwds)`` выдает *warn* и сообщение соответствует регулярному выражению *r*

source: The ``with`` block logs on *logger* with minimum *level*
ru: Блок ``with`` регистрируется в *logger* с минимальным *уровнем*.

source: The ``with`` block does not log on
ru: Блок ``with`` не входит в систему

source: *logger* with minimum *level*
ru: *логгер* с минимальным *уровнем*

source: Test that an exception is raised when *callable* is called with any positional or keyword arguments that are also passed to :meth:`assertRaises`. The test passes if *exception* is raised, is an error if another exception is raised, or fails if no exception is raised. To catch any of a group of exceptions, a tuple containing the exception classes may be passed as *exception*.
ru: Проверьте, возникает ли исключение при вызове *callable* с любыми позиционными или ключевыми аргументами, которые также передаются в :meth:`assertRaises`. Тест проходит успешно, если возникло *исключение*, является ошибкой, если возникло другое исключение, или завершается неудачно, если исключение не возникло. Чтобы перехватить любое исключение из группы, кортеж, содержащий классы исключений, может быть передан как *Exception*.

source: If only the *exception* and possibly the *msg* arguments are given, return a context manager so that the code under test can be written inline rather than as a function::
ru: Если заданы только аргументы *исключение* и, возможно, *msg*, верните диспетчер контекста, чтобы тестируемый код можно было записать встроенным, а не в виде функции::

source: When used as a context manager, :meth:`assertRaises` accepts the additional keyword argument *msg*.
ru: При использовании в качестве менеджера контекста :meth:`assertRaises` принимает дополнительный аргумент ключевого слова *msg*.

source: The context manager will store the caught exception object in its :attr:`exception` attribute. This can be useful if the intention is to perform additional checks on the exception raised::
ru: Менеджер контекста сохранит перехваченный объект исключения в своем атрибуте :attr:`Exception`. Это может быть полезно, если предполагается выполнить дополнительные проверки возникшего исключения:

source: Added the ability to use :meth:`assertRaises` as a context manager.
ru: Добавлена ​​возможность использовать :meth:`assertRaises` в качестве контекстного менеджера.

source: Added the :attr:`exception` attribute.
ru: Добавлен атрибут :attr:`Exception`.

source: Added the *msg* keyword argument when used as a context manager.
ru: Добавлен аргумент ключевого слова *msg* при использовании в качестве менеджера контекста.

source: Like :meth:`assertRaises` but also tests that *regex* matches on the string representation of the raised exception. *regex* may be a regular expression object or a string containing a regular expression suitable for use by :func:`re.search`. Examples::
ru: Подобно :meth:`assertRaises`, но также проверяет соответствие *regex* строковому представлению возникшего исключения. *regex* может быть объектом регулярного выражения или строкой, содержащей регулярное выражение, подходящее для использования :func:`re.search`. Примеры::

source: or::
ru: или::

source: Added under the name ``assertRaisesRegexp``.
ru: Добавлен под названием «assertRaisesRegexp».

source: Renamed to :meth:`assertRaisesRegex`.
ru: Переименовано в :meth:`assertRaisesRegex`.

source: Test that a warning is triggered when *callable* is called with any positional or keyword arguments that are also passed to :meth:`assertWarns`. The test passes if *warning* is triggered and fails if it isn't. Any exception is an error. To catch any of a group of warnings, a tuple containing the warning classes may be passed as *warnings*.
ru: Проверьте, что предупреждение выдается, когда *callable* вызывается с любыми позиционными или ключевыми аргументами, которые также передаются в :meth:`assertWarns`. Тест проходит успешно, если срабатывает *предупреждение*, и завершается неудачей, если нет. Любое исключение является ошибкой. Чтобы перехватить любое предупреждение из группы, кортеж, содержащий классы предупреждений, можно передать как *предупреждения*.

source: If only the *warning* and possibly the *msg* arguments are given, return a context manager so that the code under test can be written inline rather than as a function::
ru: Если заданы только аргументы *warning* и, возможно, *msg*, верните диспетчер контекста, чтобы тестируемый код можно было написать в строке, а не в виде функции::

source: When used as a context manager, :meth:`assertWarns` accepts the additional keyword argument *msg*.
ru: При использовании в качестве менеджера контекста :meth:`assertWarns` принимает дополнительный аргумент ключевого слова *msg*.

source: The context manager will store the caught warning object in its :attr:`warning` attribute, and the source line which triggered the warnings in the :attr:`filename` and :attr:`lineno` attributes. This can be useful if the intention is to perform additional checks on the warning caught::
ru: Менеджер контекста сохранит перехваченный объект предупреждения в своем атрибуте :attr:`warning`, а исходную строку, вызвавшую предупреждение, в атрибутах :attr:`filename` и :attr:`lineno`. Это может быть полезно, если предполагается выполнить дополнительные проверки пойманного предупреждения:

source: This method works regardless of the warning filters in place when it is called.
ru: Этот метод работает независимо от фильтров предупреждений, установленных при его вызове.

source: Like :meth:`assertWarns` but also tests that *regex* matches on the message of the triggered warning. *regex* may be a regular expression object or a string containing a regular expression suitable for use by :func:`re.search`. Example::
ru: Подобно :meth:`assertWarns`, но также проверяет соответствие *regex* сообщению сработавшего предупреждения. *regex* может быть объектом регулярного выражения или строкой, содержащей регулярное выражение, подходящее для использования :func:`re.search`. Пример::

source: A context manager to test that at least one message is logged on the *logger* or one of its children, with at least the given *level*.
ru: Менеджер контекста для проверки того, что хотя бы одно сообщение зарегистрировано в *регистраторе* или одном из его дочерних элементов, по крайней мере, с заданным *уровнем*.

source: If given, *logger* should be a :class:`logging.Logger` object or a :class:`str` giving the name of a logger. The default is the root logger, which will catch all messages that were not blocked by a non-propagating descendent logger.
ru: Если задано, *logger* должен быть объектом :class:`logging.Logger` или :class:`str`, указывающим имя регистратора. По умолчанию используется корневой регистратор, который будет перехватывать все сообщения, которые не были заблокированы нераспространяющимся дочерним регистратором.

source: If given, *level* should be either a numeric logging level or its string equivalent (for example either ``"ERROR"`` or :const:`logging.ERROR`). The default is :const:`logging.INFO`.
ru: Если задано, *logger* должен быть объектом :class:`logging.Logger` или :class:`str`, указывающим имя регистратора. По умолчанию используется корневой регистратор, который будет перехватывать все сообщения, которые не были заблокированы нераспространяющимся дочерним регистратором.

source: The test passes if at least one message emitted inside the ``with`` block matches the *logger* and *level* conditions, otherwise it fails.
ru: Тест считается пройденным, если хотя бы одно сообщение, отправленное внутри блока ``with``, соответствует условиям *logger* и *level*, в противном случае он не пройден.

source: The object returned by the context manager is a recording helper which keeps tracks of the matching log messages. It has two attributes:
ru: Объект, возвращаемый диспетчером контекста, является помощником записи, который отслеживает соответствующие сообщения журнала. Он имеет два атрибута:

source: A list of :class:`logging.LogRecord` objects of the matching log messages.
ru: Список объектов :class:`logging.LogRecord` соответствующих сообщений журнала.

source: A list of :class:`str` objects with the formatted output of matching messages.
ru: Список объектов :class:`str` с форматированным выводом соответствующих сообщений.

source: Example::
ru: Пример::

source: A context manager to test that no messages are logged on the *logger* or one of its children, with at least the given *level*.
ru: Менеджер контекста, проверяющий, что никакие сообщения не регистрируются в *регистраторе* или одном из его дочерних элементов, по крайней мере, с заданным *уровнем*.

source: If given, *logger* should be a :class:`logging.Logger` object or a :class:`str` giving the name of a logger. The default is the root logger, which will catch all messages.
ru: Если задано, *logger* должен быть объектом :class:`logging.Logger` или :class:`str`, указывающим имя регистратора. По умолчанию используется корневой регистратор, который будет перехватывать все сообщения.

source: Unlike :meth:`assertLogs`, nothing will be returned by the context manager.
ru: В отличие от :meth:`assertLogs`, контекстный менеджер ничего не вернет.

source: There are also other methods used to perform more specific checks, such as:
ru: Существуют также другие методы, используемые для выполнения более конкретных проверок, например:

source: *a* and *b* have the same elements in the same number, regardless of their order.
ru: *a* и *b* содержат одинаковые элементы в одном и том же номере, независимо от их порядка.

source: Test that *first* and *second* are approximately (or not approximately) equal by computing the difference, rounding to the given number of decimal *places* (default 7), and comparing to zero. Note that these methods round the values to the given number of *decimal places* (i.e. like the :func:`round` function) and not *significant digits*.
ru: Проверьте, что *первый* и *второй* приблизительно (или не приблизительно) равны, вычислив разницу, округлив ее до заданного количества десятичных *знаков* (по умолчанию 7) и сравнив ее с нулем. Обратите внимание, что эти методы округляют значения до заданного количества *десятичных знаков* (т.е. как функция :func:`round`), а не до *значащих цифр*.

source: If *delta* is supplied instead of *places* then the difference between *first* and *second* must be less or equal to (or greater than) *delta*.
ru: Если вместо *мест* указано *дельта*, то разница между *первым* и *вторым* должна быть меньше или равна (или больше) *дельта*.

source: Supplying both *delta* and *places* raises a :exc:`TypeError`.
ru: Указание *delta* и *places* вызывает ошибку :exc:`TypeError`.

source: :meth:`assertAlmostEqual` automatically considers almost equal objects that compare equal. :meth:`assertNotAlmostEqual` automatically fails if the objects compare equal. Added the *delta* keyword argument.
ru: :meth:`assertAlmostEqual` автоматически считает почти равные объекты, которые сравниваются равными. :meth:`assertNotAlmostEqual` автоматически завершается с ошибкой, если объекты сравниваются равными. Добавлен аргумент ключевого слова *delta*.

source: Test that *first* is respectively >, >=, < or <= than *second* depending on the method name. If not, the test will fail::
ru: Проверьте, что *first* равен соответственно >, >=, < или <=, чем * Second*, в зависимости от имени метода. В противном случае тест завершится неудачно::

source: Test that a *regex* search matches (or does not match) *text*. In case of failure, the error message will include the pattern and the *text* (or the pattern and the part of *text* that unexpectedly matched). *regex* may be a regular expression object or a string containing a regular expression suitable for use by :func:`re.search`.
ru: Проверьте, что поиск по *регулярному* выражению* соответствует (или не соответствует) *тексту*. В случае неудачи сообщение об ошибке будет содержать шаблон и *текст* (или шаблон и часть *текста*, которые неожиданно совпали). *regex* может быть объектом регулярного выражения или строкой, содержащей регулярное выражение, подходящее для использования :func:`re.search`.

source: Added under the name ``assertRegexpMatches``.
ru: Добавлен под названием «assertRegexpMatches».

source: The method ``assertRegexpMatches()`` has been renamed to :meth:`.assertRegex`.
ru: Метод ``assertRegexpMatches()`` был переименован в :meth:`.assertRegex`.

source: Test that sequence *first* contains the same elements as *second*, regardless of their order. When they don't, an error message listing the differences between the sequences will be generated.
ru: Проверьте, что последовательность *first* содержит те же элементы, что и * Second*, независимо от их порядка. Если этого не произойдет, будет сгенерировано сообщение об ошибке со списком различий между последовательностями.

source: Duplicate elements are *not* ignored when comparing *first* and *second*. It verifies whether each element has the same count in both sequences. Equivalent to: ``assertEqual(Counter(list(first)), Counter(list(second)))`` but works with sequences of unhashable objects as well.
ru: Повторяющиеся элементы *не* игнорируются при сравнении *первого* и *второго*. Он проверяет, имеет ли каждый элемент одинаковое количество в обеих последовательностях. Эквивалентно: ``assertEqual(Counter(list(first)), Counter(list( Second)))``, но также работает с последовательностями нехэшируемых объектов.

source: The :meth:`assertEqual` method dispatches the equality check for objects of the same type to different type-specific methods. These methods are already implemented for most of the built-in types, but it's also possible to register new methods using :meth:`addTypeEqualityFunc`:
ru: Метод :meth:`assertEqual` отправляет проверку равенства объектов одного и того же типа различным методам, зависящим от типа. Эти методы уже реализованы для большинства встроенных типов, но также можно зарегистрировать новые методы с помощью :meth:`addTypeEqualityFunc`:

source: Registers a type-specific method called by :meth:`assertEqual` to check if two objects of exactly the same *typeobj* (not subclasses) compare equal. *function* must take two positional arguments and a third msg=None keyword argument just as :meth:`assertEqual` does. It must raise :data:`self.failureException(msg) <failureException>` when inequality between the first two parameters is detected -- possibly providing useful information and explaining the inequalities in details in the error message.
ru: Регистрирует специфичный для типа метод, вызываемый :meth:`assertEqual`, чтобы проверить, равны ли два объекта одного и того же *typeobj* (не подклассов). *функция* должна принимать два позиционных аргумента и третий аргумент ключевого слова msg=None, как и :meth:`assertEqual`. Он должен вызвать :data:`self.failureException(msg) <failureException>` при обнаружении неравенства между первыми двумя параметрами - возможно, предоставляя полезную информацию и подробно объясняя неравенства в сообщении об ошибке.

source: The list of type-specific methods automatically used by :meth:`~TestCase.assertEqual` are summarized in the following table. Note that it's usually not necessary to invoke these methods directly.
ru: Список методов для конкретного типа, автоматически используемых :meth:`~TestCase.assertEqual`, обобщен в следующей таблице. Обратите внимание, что обычно нет необходимости вызывать эти методы напрямую.

source: Used to compare
ru: Используется для сравнения

source: strings
ru: строки

source: sequences
ru: последовательности

source: lists
ru: списки

source: tuples
ru: кортежи

source: sets or frozensets
ru: наборы или замороженные наборы

source: dicts
ru: словари

source: Test that the multiline string *first* is equal to the string *second*. When not equal a diff of the two strings highlighting the differences will be included in the error message. This method is used by default when comparing strings with :meth:`assertEqual`.
ru: Проверьте, что многострочная строка *first* равна строке * Second*. Если они не равны, в сообщение об ошибке будет включена разница между двумя строками, подчеркивающими различия. Этот метод используется по умолчанию при сравнении строк с помощью :meth:`assertEqual`.

source: Tests that two sequences are equal. If a *seq_type* is supplied, both *first* and *second* must be instances of *seq_type* or a failure will be raised. If the sequences are different an error message is constructed that shows the difference between the two.
ru: Проверяет, что две последовательности равны. Если указан *seq_type*, *first* и * Second* должны быть экземплярами *seq_type*, иначе будет выдана ошибка. Если последовательности различаются, создается сообщение об ошибке, показывающее разницу между ними.

source: This method is not called directly by :meth:`assertEqual`, but it's used to implement :meth:`assertListEqual` and :meth:`assertTupleEqual`.
ru: Этот метод не вызывается напрямую из :meth:`assertEqual`, но он используется для реализации :meth:`assertListEqual` и :meth:`assertTupleEqual`.

source: Tests that two lists or tuples are equal. If not, an error message is constructed that shows only the differences between the two. An error is also raised if either of the parameters are of the wrong type. These methods are used by default when comparing lists or tuples with :meth:`assertEqual`.
ru: Проверяет, что два списка или кортежа равны. В противном случае создается сообщение об ошибке, показывающее только различия между ними. Ошибка также возникает, если какой-либо из параметров имеет неверный тип. Эти методы используются по умолчанию при сравнении списков или кортежей с помощью :meth:`assertEqual`.

source: Tests that two sets are equal. If not, an error message is constructed that lists the differences between the sets. This method is used by default when comparing sets or frozensets with :meth:`assertEqual`.
ru: Проверяет, что два набора равны. В противном случае создается сообщение об ошибке, в котором перечислены различия между наборами. Этот метод используется по умолчанию при сравнении наборов или замороженных наборов с помощью :meth:`assertEqual`.

source: Fails if either of *first* or *second* does not have a :meth:`set.difference` method.
ru: Ошибка, если ни один из *first* или * Second* не имеет метода :meth:`set.difference`.

source: Test that two dictionaries are equal. If not, an error message is constructed that shows the differences in the dictionaries. This method will be used by default to compare dictionaries in calls to :meth:`assertEqual`.
ru: Проверьте, что два словаря равны. Если нет, создается сообщение об ошибке, показывающее различия в словарях. Этот метод будет использоваться по умолчанию для сравнения словарей при вызовах :meth:`assertEqual`.

source: Finally the :class:`TestCase` provides the following methods and attributes:
ru: Наконец, :class:`TestCase` предоставляет следующие методы и атрибуты:

source: Signals a test failure unconditionally, with *msg* or ``None`` for the error message.
ru: Безоговорочно сигнализирует о сбое теста, используя *msg* или ``None`` для сообщения об ошибке.

source: This class attribute gives the exception raised by the test method. If a test framework needs to use a specialized exception, possibly to carry additional information, it must subclass this exception in order to "play fair" with the framework. The initial value of this attribute is :exc:`AssertionError`.
ru: Этот атрибут класса выдает исключение, вызванное тестовым методом. Если среда тестирования должна использовать специализированное исключение, возможно, для передачи дополнительной информации, она должна создать подкласс этого исключения, чтобы «играть честно» с платформой. Начальное значение этого атрибута — :exc:`AssertionError`.

source: This class attribute determines what happens when a custom failure message is passed as the msg argument to an assertXYY call that fails. ``True`` is the default value. In this case, the custom message is appended to the end of the standard failure message. When set to ``False``, the custom message replaces the standard message.
ru: Этот атрибут класса определяет, что происходит, когда пользовательское сообщение об ошибке передается в качестве аргумента msg в вызов AssertXYY, который завершился неудачей. ``True`` — значение по умолчанию. В этом случае специальное сообщение добавляется в конец стандартного сообщения об ошибке. Если установлено значение «False», пользовательское сообщение заменяет стандартное сообщение.

source: The class setting can be overridden in individual test methods by assigning an instance attribute, self.longMessage, to ``True`` or ``False`` before calling the assert methods.
ru: Параметр класса можно переопределить в отдельных методах тестирования, присвоив атрибуту экземпляра self.longMessage значение True или False перед вызовом методов утверждения.

source: The class setting gets reset before each test call.
ru: Настройка класса сбрасывается перед каждым тестовым вызовом.
