Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/unittest.mock-examples.po
Languages: ru

source: :mod:`!unittest.mock` --- getting started
ru: :mod:`!unittest.mock` --- начало работы

source: Using Mock
ru: Использование макета

source: Mock Patching Methods
ru: Методы ложного исправления

source: Common uses for :class:`Mock` objects include:
ru: Обычное использование объектов :class:`Mock` включает в себя:

source: Patching methods
ru: Методы исправления

source: Recording method calls on objects
ru: Запись вызовов методов на объектах

source: You might want to replace a method on an object to check that it is called with the correct arguments by another part of the system:
ru: Возможно, вы захотите заменить метод объекта, чтобы проверить, что он вызывается с правильными аргументами из другой части системы:

source: Once our mock has been used (``real.method`` in this example) it has methods and attributes that allow you to make assertions about how it has been used.
ru: После использования нашего макета (в этом примере «real.method») у него появляются методы и атрибуты, которые позволяют вам делать утверждения о том, как он использовался.

source: In most of these examples the :class:`Mock` and :class:`MagicMock` classes are interchangeable. As the ``MagicMock`` is the more capable class it makes a sensible one to use by default.
ru: В большинстве этих примеров классы :class:`Mock` и :class:`MagicMock` взаимозаменяемы. Поскольку MagicMock является более функциональным классом, его разумнее использовать по умолчанию.

source: Once the mock has been called its :attr:`~Mock.called` attribute is set to ``True``. More importantly we can use the :meth:`~Mock.assert_called_with` or :meth:`~Mock.assert_called_once_with` method to check that it was called with the correct arguments.
ru: После вызова макета его атрибуту :attr:`~Mock.called` присваивается значение ``True``. Что еще более важно, мы можем использовать метод :meth:`~Mock.assert_ Called_with` или :meth:`~Mock.assert_collect_once_with`, чтобы проверить, что он был вызван с правильными аргументами.

source: This example tests that calling ``ProductionClass().method`` results in a call to the ``something`` method:
ru: В этом примере проверяется, что вызов метода ProductionClass().method приводит к вызову метода Something:

source: Mock for Method Calls on an Object
ru: Макет для вызовов методов объекта

source: In the last example we patched a method directly on an object to check that it was called correctly. Another common use case is to pass an object into a method (or some part of the system under test) and then check that it is used in the correct way.
ru: В последнем примере мы исправили метод непосредственно на объекте, чтобы проверить правильность его вызова. Другой распространенный вариант использования — передать объект в метод (или некоторую часть тестируемой системы), а затем проверить, правильно ли он используется.

source: The simple ``ProductionClass`` below has a ``closer`` method. If it is called with an object then it calls ``close`` on it.
ru: Простой «ProductionClass» ниже имеет метод «Closer». Если он вызывается с объектом, он вызывает для него `` close``.

source: So to test it we need to pass in an object with a ``close`` method and check that it was called correctly.
ru: Итак, чтобы протестировать, нам нужно передать объект с помощью метода close и проверить, правильно ли он был вызван.

source: We don't have to do any work to provide the 'close' method on our mock. Accessing close creates it. So, if 'close' hasn't already been called then accessing it in the test will create it, but :meth:`~Mock.assert_called_with` will raise a failure exception.
ru: Нам не нужно ничего делать, чтобы предоставить метод close в нашем макете. Доступ к close создает его. Таким образом, если «закрыть» еще не было вызвано, то доступ к нему в тесте создаст его, но :meth:`~Mock.assert_known_with` вызовет исключение сбоя.

source: A common use case is to mock out classes instantiated by your code under test. When you patch a class, then that class is replaced with a mock. Instances are created by *calling the class*. This means you access the "mock instance" by looking at the return value of the mocked class.
ru: Распространенный вариант использования — макетирование классов, экземпляры которых создаются тестируемым кодом. Когда вы исправляете класс, этот класс заменяется макетом. Экземпляры создаются путем *вызова класса*. Это означает, что вы получаете доступ к «фиктивному экземпляру», просматривая возвращаемое значение имитируемого класса.

source: In the example below we have a function ``some_function`` that instantiates ``Foo`` and calls a method on it. The call to :func:`patch` replaces the class ``Foo`` with a mock. The ``Foo`` instance is the result of calling the mock, so it is configured by modifying the mock :attr:`~Mock.return_value`. ::
ru: В примере ниже у нас есть функция some_function, которая создает экземпляр Foo и вызывает для него метод. Вызов :func:`patch` заменяет класс ``Foo`` на макет. Экземпляр ``Foo`` является результатом вызова макета, поэтому он настраивается путем изменения макета :attr:`~Mock.return_value`. ::

source: Naming your mocks
ru: Назовите свои mocks

source: It can be useful to give your mocks a name. The name is shown in the repr of the mock and can be helpful when the mock appears in test failure messages. The name is also propagated to attributes or methods of the mock:
ru: Может быть полезно дать вашим макетам имя. Имя отображается в копии макета и может быть полезно, когда макет появляется в сообщениях о сбоях теста. Имя также передается атрибутам или методам макета:

source: Tracking all Calls
ru: Отслеживание всех вызовов

source: Often you want to track more than a single call to a method. The :attr:`~Mock.mock_calls` attribute records all calls to child attributes of the mock - and also to their children.
ru: Часто требуется отслеживать более одного вызова метода. Атрибут :attr:`~Mock.mock_calls` записывает все вызовы дочерних атрибутов макета, а также их дочерних элементов.

source: If you make an assertion about ``mock_calls`` and any unexpected methods have been called, then the assertion will fail. This is useful because as well as asserting that the calls you expected have been made, you are also checking that they were made in the right order and with no additional calls:
ru: Если вы сделаете утверждение о ``mock_calls`` и будут вызваны какие-либо неожиданные методы, то утверждение завершится неудачно. Это полезно, поскольку вы не только подтверждаете, что ожидаемые вами вызовы были сделаны, но и проверяете, что они были сделаны в правильном порядке и без каких-либо дополнительных вызовов:

source: You use the :data:`call` object to construct lists for comparing with ``mock_calls``:
ru: Вы используете объект :data:`call` для создания списков для сравнения с ``mock_calls``:

source: However, parameters to calls that return mocks are not recorded, which means it is not possible to track nested calls where the parameters used to create ancestors are important:
ru: Однако параметры вызовов, возвращающих макеты, не записываются, а это означает, что невозможно отслеживать вложенные вызовы, в которых важны параметры, используемые для создания предков:

source: Setting Return Values and Attributes
ru: Установка возвращаемых значений и атрибутов

source: Setting the return values on a mock object is trivially easy:
ru: Установить возвращаемые значения для фиктивного объекта тривиально просто:

source: Of course you can do the same for methods on the mock:
ru: Конечно, вы можете сделать то же самое для методов макета:

source: The return value can also be set in the constructor:
ru: Возвращаемое значение также можно установить в конструкторе:

source: If you need an attribute setting on your mock, just do it:
ru: Если вам нужна настройка атрибута в макете, просто сделайте это:

source: Sometimes you want to mock up a more complex situation, like for example ``mock.connection.cursor().execute("SELECT 1")``. If we wanted this call to return a list, then we have to configure the result of the nested call.
ru: Иногда вам нужно смоделировать более сложную ситуацию, например ``mock.connection.cursor().execute("SELECT 1")``. Если мы хотим, чтобы этот вызов возвращал список, нам нужно настроить результат вложенного вызова.

source: We can use :data:`call` to construct the set of calls in a "chained call" like this for easy assertion afterwards:
ru: Мы можем использовать :data:`call` для создания набора вызовов в «цепочке вызовов», например, для облегчения последующего утверждения:

source: It is the call to ``.call_list()`` that turns our call object into a list of calls representing the chained calls.
ru: Именно вызов ``.call_list()`` превращает наш объект вызова в список вызовов, представляющий связанные вызовы.

source: Raising exceptions with mocks
ru: Вызов исключений с помощью макетов

source: A useful attribute is :attr:`~Mock.side_effect`. If you set this to an exception class or instance then the exception will be raised when the mock is called.
ru: Полезным атрибутом является :attr:`~Mock.side_effect`. Если вы установите для этого класса или экземпляра исключения, тогда исключение будет вызвано при вызове макета.

source: Side effect functions and iterables
ru: Функции и итерации побочных эффектов

source: ``side_effect`` can also be set to a function or an iterable. The use case for ``side_effect`` as an iterable is where your mock is going to be called several times, and you want each call to return a different value. When you set ``side_effect`` to an iterable every call to the mock returns the next value from the iterable:
ru: ``side_effect`` также может быть установлен как функция или итерируемый объект. Вариант использования Side_effect в качестве итерируемого объекта заключается в том, что ваш макет будет вызываться несколько раз, и вы хотите, чтобы каждый вызов возвращал другое значение. Когда вы устанавливаете ``side_effect`` для итерируемого объекта, каждый вызов макета возвращает следующее значение из итерируемого объекта:

source: For more advanced use cases, like dynamically varying the return values depending on what the mock is called with, ``side_effect`` can be a function. The function will be called with the same arguments as the mock. Whatever the function returns is what the call returns:
ru: Для более сложных случаев использования, таких как динамическое изменение возвращаемых значений в зависимости от того, с чем вызывается макет, Side_effect может быть функцией. Функция будет вызываться с теми же аргументами, что и макет. Что бы ни возвращала функция, это то, что возвращает вызов:

source: Since Python 3.8, ``AsyncMock`` and ``MagicMock`` have support to mock :ref:`async-iterators` through ``__aiter__``. The :attr:`~Mock.return_value` attribute of ``__aiter__`` can be used to set the return values to be used for iteration.
ru: Начиная с Python 3.8, AsyncMock и MagicMock поддерживают имитацию async-итераторов через __aiter__. Атрибут :attr:`~Mock.return_value` ``__aiter__`` может использоваться для установки возвращаемых значений, которые будут использоваться для итерации.

source: Since Python 3.8, ``AsyncMock`` and ``MagicMock`` have support to mock :ref:`async-context-managers` through ``__aenter__`` and ``__aexit__``. By default, ``__aenter__`` and ``__aexit__`` are ``AsyncMock`` instances that return an async function.
ru: Начиная с Python 3.8, AsyncMock и MagicMock поддерживают имитацию async-context-manager через __aenter__ и __aexit__. По умолчанию __aenter__ и __aexit__ являются экземплярами AsyncMock, которые возвращают асинхронную функцию.

source: Creating a Mock from an Existing Object
ru: Создание a Mock из существующего объекта

source: One problem with over use of mocking is that it couples your tests to the implementation of your mocks rather than your real code. Suppose you have a class that implements ``some_method``. In a test for another class, you provide a mock of this object that *also* provides ``some_method``. If later you refactor the first class, so that it no longer has ``some_method`` - then your tests will continue to pass even though your code is now broken!
ru: Одна из проблем с чрезмерным использованием макетов заключается в том, что они связывают ваши тесты с реализацией макетов, а не с вашим реальным кодом. Предположим, у вас есть класс, реализующий ``some_method``. В тесте для другого класса вы предоставляете макет этого объекта, который *также* предоставляет ``some_method``. Если позже вы выполните рефакторинг первого класса так, что он больше не будет иметь ``some_method`` - тогда ваши тесты продолжат проходить, даже если ваш код теперь сломан!

source: :class:`Mock` allows you to provide an object as a specification for the mock, using the *spec* keyword argument. Accessing methods / attributes on the mock that don't exist on your specification object will immediately raise an attribute error. If you change the implementation of your specification, then tests that use that class will start failing immediately without you having to instantiate the class in those tests.
ru: :class:`Mock` позволяет вам предоставить объект в качестве спецификации макета, используя аргумент ключевого слова *spec*. Доступ к методам/атрибутам макета, которые не существуют в вашем объекте спецификации, немедленно вызовет ошибку атрибута. Если вы измените реализацию своей спецификации, то тесты, использующие этот класс, сразу же начнут давать сбой, и вам не придется создавать экземпляр класса в этих тестах.

source: Using a specification also enables a smarter matching of calls made to the mock, regardless of whether some parameters were passed as positional or named arguments::
ru: Использование спецификации также обеспечивает более разумное сопоставление вызовов макета, независимо от того, были ли некоторые параметры переданы как позиционные или именованные аргументы:

source: If you want this smarter matching to also work with method calls on the mock, you can use :ref:`auto-speccing <auto-speccing>`.
ru: Если вы хотите, чтобы это более разумное сопоставление также работало с вызовами методов в макете, вы можете использовать :ref:`auto-speccing <auto-speccing>`.

source: If you want a stronger form of specification that prevents the setting of arbitrary attributes as well as the getting of them then you can use *spec_set* instead of *spec*.
ru: Если вам нужна более строгая форма спецификации, которая предотвращает установку произвольных атрибутов, а также их получение, вы можете использовать *spec_set* вместо *spec*.

source: Using side_effect to return per file content
ru: Использование Side_effect для возврата содержимого файла

source: :func:`mock_open` is used to patch :func:`open` method. :attr:`~Mock.side_effect` can be used to return a new Mock object per call. This can be used to return different contents per file stored in a dictionary::
ru: :func:`mock_open` используется для исправления метода :func:`open`. :attr:`~Mock.side_effect` можно использовать для возврата нового объекта Mock при каждом вызове. Это можно использовать для возврата различного содержимого для каждого файла, хранящегося в словаре::

source: Patch Decorators
ru: Патч-декораторы

source: With :func:`patch` it matters that you patch objects in the namespace where they are looked up. This is normally straightforward, but for a quick guide read :ref:`where to patch <where-to-patch>`.
ru: При использовании :func:`patch` важно исправлять объекты в пространстве имен, в котором они просматриваются. Обычно это просто, но для краткого руководства прочтите :ref:`where to patch <where-to-patch>`.

source: A common need in tests is to patch a class attribute or a module attribute, for example patching a builtin or patching a class in a module to test that it is instantiated. Modules and classes are effectively global, so patching on them has to be undone after the test or the patch will persist into other tests and cause hard to diagnose problems.
ru: Обычно в тестах требуется исправить атрибут класса или атрибут модуля, например, исправить встроенную функцию или исправить класс в модуле, чтобы проверить, что он создан. Модули и классы по сути являются глобальными, поэтому исправления для них необходимо отменить после теста, иначе исправление сохранится в других тестах и ​​вызовет трудности для диагностики проблем.

source: mock provides three convenient decorators for this: :func:`patch`, :func:`patch.object` and :func:`patch.dict`. ``patch`` takes a single string, of the form ``package.module.Class.attribute`` to specify the attribute you are patching. It also optionally takes a value that you want the attribute (or class or whatever) to be replaced with. 'patch.object' takes an object and the name of the attribute you would like patched, plus optionally the value to patch it with.
ru: макет предоставляет для этого три удобных декоратора: :func:`patch`, :func:`patch.object` и :func:`patch.dict`. ``patch`` принимает одну строку в форме ``package.module.Class.attribute`` для указания атрибута, который вы исправляете. Он также необязательно принимает значение, которым вы хотите заменить атрибут (или класс или что-то еще). «patch.object» принимает объект и имя атрибута, который вы хотите исправить, а также, возможно, значение для его исправления.

source: If you are patching a module (including :mod:`builtins`) then use :func:`patch` instead of :func:`patch.object`:
ru: Если вы исправляете модуль (включая :mod:`builtins`), используйте :func:`patch` вместо :func:`patch.object`:

source: The module name can be 'dotted', in the form ``package.module`` if needed::
ru: При необходимости имя модуля может быть разделено точками в виде package.module:

source: A nice pattern is to actually decorate test methods themselves:
ru: Хороший шаблон — украсить сами методы тестирования:

source: If you want to patch with a Mock, you can use :func:`patch` with only one argument (or :func:`patch.object` with two arguments). The mock will be created for you and passed into the test function / method:
ru: Если вы хотите использовать патч с помощью Mock, вы можете использовать :func:`patch` только с одним аргументом (или :func:`patch.object` с двумя аргументами). Мок будет создан для вас и передан в тестовую функцию/метод:

source: You can stack up multiple patch decorators using this pattern::
ru: Вы можете объединить несколько декораторов патчей, используя этот шаблон:

source: When you nest patch decorators the mocks are passed in to the decorated function in the same order they applied (the normal *Python* order that decorators are applied). This means from the bottom up, so in the example above the mock for ``test_module.ClassName2`` is passed in first.
ru: Когда вы вкладываете декораторы патчей, макеты передаются декорируемой функции в том же порядке, в котором они были применены (обычный порядок *Python*, в котором применяются декораторы). Это означает, что снизу вверх, поэтому в приведенном выше примере сначала передается макет для ``test_module.ClassName2``.

source: There is also :func:`patch.dict` for setting values in a dictionary just during a scope and restoring the dictionary to its original state when the test ends:
ru: Существует также :func:`patch.dict` для установки значений в словаре только во время проверки и восстановления словаря в исходное состояние после завершения теста:

source: ``patch``, ``patch.object`` and ``patch.dict`` can all be used as context managers.
ru: ``patch``, ``patch.object`` и ``patch.dict`` могут использоваться в качестве менеджеров контекста.

source: Where you use :func:`patch` to create a mock for you, you can get a reference to the mock using the "as" form of the with statement:
ru: Если вы используете :func:`patch` для создания макета, вы можете получить ссылку на макет, используя форму «as» оператора with:

source: As an alternative ``patch``, ``patch.object`` and ``patch.dict`` can be used as class decorators. When used in this way it is the same as applying the decorator individually to every method whose name starts with "test".
ru: В качестве альтернативы ``patch``, ``patch.object`` и ``patch.dict`` могут использоваться в качестве декораторов классов. При таком использовании это то же самое, что применять декоратор индивидуально к каждому методу, имя которого начинается с «test».

source: Further Examples
ru: Другие примеры

source: Here are some more examples for some slightly more advanced scenarios.
ru: Вот еще несколько примеров для некоторых более сложных сценариев.

source: Mocking chained calls
ru: Mocking цепочки вызовов

source: Mocking chained calls is actually straightforward with mock once you understand the :attr:`~Mock.return_value` attribute. When a mock is called for the first time, or you fetch its ``return_value`` before it has been called, a new :class:`Mock` is created.
ru: Имитировать связанные вызовы с помощью макета на самом деле просто, если вы понимаете атрибут :attr:`~Mock.return_value`. Когда макет вызывается в первый раз или вы получаете его ``return_value`` до его вызова, создается новый :class:`Mock`.

source: This means that you can see how the object returned from a call to a mocked object has been used by interrogating the ``return_value`` mock:
ru: Это означает, что вы можете увидеть, как объект, возвращенный в результате вызова имитируемого объекта, использовался, опрашивая макет ``return_value``:

source: From here it is a simple step to configure and then make assertions about chained calls. Of course another alternative is writing your code in a more testable way in the first place...
ru: Отсюда можно легко настроить и затем сделать утверждения о связанных вызовах. Конечно, другой альтернативой является написание кода более тестируемым способом...

source: So, suppose we have some code that looks a little bit like this:
ru: Итак, предположим, что у нас есть код, который выглядит примерно так:

source: Assuming that ``BackendProvider`` is already well tested, how do we test ``method()``? Specifically, we want to test that the code section ``# more code`` uses the response object in the correct way.
ru: Предполагая, что BackendProvider уже хорошо протестирован, как нам протестировать метод()? В частности, мы хотим проверить, что раздел кода ``# more code`` правильно использует объект ответа.

source: As this chain of calls is made from an instance attribute we can monkey patch the ``backend`` attribute on a ``Something`` instance. In this particular case we are only interested in the return value from the final call to ``start_call`` so we don't have much configuration to do. Let's assume the object it returns is 'file-like', so we'll ensure that our response object uses the builtin :func:`open` as its ``spec``.
ru: Поскольку эта цепочка вызовов создается из атрибута экземпляра, мы можем обезьяньим образом исправить атрибут ``backend`` в экземпляре ``Something``. В данном конкретном случае нас интересует только возвращаемое значение от последнего вызова start_call, поэтому нам не нужно ничего настраивать. Предположим, что возвращаемый объект похож на файл, поэтому мы обеспечим, чтобы наш объект ответа использовал встроенную функцию :func:`open` в качестве своей ``спецификации``.

source: To do this we create a mock instance as our mock backend and create a mock response object for it. To set the response as the return value for that final ``start_call`` we could do this::
ru: Для этого мы создаем фиктивный экземпляр в качестве нашего фиктивного бэкэнда и создаем для него фиктивный объект ответа. Чтобы установить ответ в качестве возвращаемого значения для финального ``start_call``, мы могли бы сделать следующее:

source: mock_backend.get_endpoint.return_value.create_call.return_value.start_call.return_value = mock_response
ru: ock_backend.get_endpoint.return_value.create_call.return_value.start_call.return_value = макет_ответа
