Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/uuid.po
Languages: ru

source: :mod:`!uuid` --- UUID objects according to :rfc:`4122`
ru: :mod:`!uuid` --- объекты UUID согласно :rfc:`4122`

source: **Source code:** :source:`Lib/uuid.py`
ru: **Исходный код:** :source:`Lib/uuid.py`

source: This module provides immutable :class:`UUID` objects (the :class:`UUID` class) and the functions :func:`uuid1`, :func:`uuid3`, :func:`uuid4`, :func:`uuid5` for generating version 1, 3, 4, and 5 UUIDs as specified in :rfc:`4122`.
ru: Этот модуль предоставляет неизменяемые объекты :class:`UUID` (класс :class:`UUID`) и функции :func:`uuid1`, :func:`uuid3`, :func:`uuid4`, :func:`uuid5 ` для генерации UUID версий 1, 3, 4 и 5, как указано в :rfc:`4122`.

source: If all you want is a unique ID, you should probably call :func:`uuid1` or :func:`uuid4`. Note that :func:`uuid1` may compromise privacy since it creates a UUID containing the computer's network address. :func:`uuid4` creates a random UUID.
ru: Если вам нужен только уникальный идентификатор, вам, вероятно, следует вызвать :func:`uuid1` или :func:`uuid4`. Обратите внимание, что :func:`uuid1` может поставить под угрозу конфиденциальность, поскольку создает UUID, содержащий сетевой адрес компьютера. :func:`uuid4` создает случайный UUID.

source: Depending on support from the underlying platform, :func:`uuid1` may or may not return a "safe" UUID. A safe UUID is one which is generated using synchronization methods that ensure no two processes can obtain the same UUID. All instances of :class:`UUID` have an :attr:`~UUID.is_safe` attribute which relays any information about the UUID's safety, using this enumeration:
ru: В зависимости от поддержки базовой платформы :func:`uuid1` может возвращать или не возвращать «безопасный» UUID. Безопасный UUID — это тот, который генерируется с использованием методов синхронизации, которые гарантируют, что никакие два процесса не смогут получить один и тот же UUID. Все экземпляры :class:`UUID` имеют атрибут :attr:`~UUID.is_safe`, который передает любую информацию о безопасности UUID, используя это перечисление:

source: The UUID was generated by the platform in a multiprocessing-safe way.
ru: UUID был сгенерирован платформой безопасным для многопроцессорной обработки способом.

source: The UUID was not generated in a multiprocessing-safe way.
ru: UUID не был сгенерирован безопасным для многопроцессорной обработки способом.

source: The platform does not provide information on whether the UUID was generated safely or not.
ru: Платформа не предоставляет информацию о том, был ли UUID сгенерирован безопасно или нет.

source: Create a UUID from either a string of 32 hexadecimal digits, a string of 16 bytes in big-endian order as the *bytes* argument, a string of 16 bytes in little-endian order as the *bytes_le* argument, a tuple of six integers (32-bit *time_low*, 16-bit *time_mid*, 16-bit *time_hi_version*, 8-bit *clock_seq_hi_variant*, 8-bit *clock_seq_low*, 48-bit *node*) as the *fields* argument, or a single 128-bit integer as the *int* argument. When a string of hex digits is given, curly braces, hyphens, and a URN prefix are all optional. For example, these expressions all yield the same UUID::
ru: Создайте UUID из строки из 32 шестнадцатеричных цифр, строки из 16 байтов в порядке с прямым порядком байтов в качестве аргумента *bytes*, строки из 16 байтов в порядке с прямым порядком байтов в качестве аргумента *bytes_le* или кортежа из шести целые числа (32-битные *time_low*, 16-битные *time_mid*, 16-битные *time_hi_version*, 8-битные * clock_seq_hi_variant*, 8-битные * clock_seq_low*, 48-битные *node*) в качестве аргумента *fields* или одно 128-битное целое число в качестве аргумента *int*. Если указана строка шестнадцатеричных цифр, фигурные скобки, дефисы и префикс URN являются необязательными. Например, все эти выражения дают один и тот же UUID::

source: Exactly one of *hex*, *bytes*, *bytes_le*, *fields*, or *int* must be given. The *version* argument is optional; if given, the resulting UUID will have its variant and version number set according to :rfc:`4122`, overriding bits in the given *hex*, *bytes*, *bytes_le*, *fields*, or *int*.
ru: Должно быть указано ровно одно из значений *hex*, *bytes*, *bytes_le*, *fields* или *int*. Аргумент *версия* является необязательным; если он указан, то результирующий UUID будет иметь вариант и номер версии, установленные в соответствии с :rfc:`4122`, переопределяя биты в заданных *hex*, *bytes*, *bytes_le*, *fields* или *int*.

source: Comparison of UUID objects are made by way of comparing their :attr:`UUID.int` attributes. Comparison with a non-UUID object raises a :exc:`TypeError`.
ru: Сравнение объектов UUID производится путем сравнения их атрибутов :attr:`UUID.int`. Сравнение с объектом, отличным от UUID, вызывает ошибку :exc:`TypeError`.

source: ``str(uuid)`` returns a string in the form ``12345678-1234-5678-1234-567812345678`` where the 32 hexadecimal digits represent the UUID.
ru: ``str(uuid)`` возвращает строку в форме ``12345678-1234-5678-1234-567812345678``, где 32 шестнадцатеричные цифры представляют UUID.

source: :class:`UUID` instances have these read-only attributes:
ru: Экземпляры :class:`UUID` имеют следующие атрибуты, доступные только для чтения:

source: The UUID as a 16-byte string (containing the six integer fields in big-endian byte order).
ru: ``str(uuid)`` возвращает строку в форме ``12345678-1234-5678-1234-567812345678``, где 32 шестнадцатеричные цифры представляют UUID.

source: The UUID as a 16-byte string (with *time_low*, *time_mid*, and *time_hi_version* in little-endian byte order).
ru: UUID в виде 16-байтовой строки (с *time_low*, *time_mid* и *time_hi_version* в порядке байтов с прямым порядком байтов).

source: A tuple of the six integer fields of the UUID, which are also available as six individual attributes and two derived attributes:
ru: Кортеж из шести целочисленных полей UUID, которые также доступны в виде шести отдельных атрибутов и двух производных атрибутов:

source: Field
ru: Поле

source: Meaning
ru: Значение

source: The first 32 bits of the UUID.
ru: Первые 32 бита UUID.

source: The next 16 bits of the UUID.
ru: Следующие 16 бит UUID.

source: The next 8 bits of the UUID.
ru: Следующие 8 бит UUID.

source: The last 48 bits of the UUID.
ru: Последние 48 бит UUID.

source: The 60-bit timestamp.
ru: 60-битная временная метка.

source: The 14-bit sequence number.
ru: 14-битный порядковый номер.

source: The UUID as a 32-character lowercase hexadecimal string.
ru: UUID в виде 32-значной шестнадцатеричной строки в нижнем регистре.

source: The UUID as a 128-bit integer.
ru: UUID в виде 128-битного целого числа.

source: The UUID as a URN as specified in :rfc:`4122`.
ru: UUID в виде URN, как указано в :rfc:`4122`.

source: The UUID variant, which determines the internal layout of the UUID. This will be one of the constants :const:`RESERVED_NCS`, :const:`RFC_4122`, :const:`RESERVED_MICROSOFT`, or :const:`RESERVED_FUTURE`.
ru: Вариант UUID, определяющий внутреннюю структуру UUID. Это будет одна из констант :const:`RESERVED_NCS`, :const:`RFC_4122`, :const:`RESERVED_MICROSOFT` или :const:`RESERVED_FUTURE`.

source: The UUID version number (1 through 5, meaningful only when the variant is :const:`RFC_4122`).
ru: Номер версии UUID (от 1 до 5, имеет значение только в том случае, если используется вариант :const:`RFC_4122`).

source: An enumeration of :class:`SafeUUID` which indicates whether the platform generated the UUID in a multiprocessing-safe way.
ru: Перечисление :class:`SafeUUID`, которое указывает, сгенерировала ли платформа UUID безопасным для многопроцессорной обработки способом.

source: The :mod:`uuid` module defines the following functions:
ru: Модуль :mod:`uuid` определяет следующие функции:

source: Get the hardware address as a 48-bit positive integer. The first time this runs, it may launch a separate program, which could be quite slow. If all attempts to obtain the hardware address fail, we choose a random 48-bit number with the multicast bit (least significant bit of the first octet) set to 1 as recommended in :rfc:`4122`. "Hardware address" means the MAC address of a network interface. On a machine with multiple network interfaces, universally administered MAC addresses (i.e. where the second least significant bit of the first octet is *unset*) will be preferred over locally administered MAC addresses, but with no other ordering guarantees.
ru: Получите аппаратный адрес как 48-битное положительное целое число. При первом запуске может запуститься отдельная программа, которая может работать довольно медленно. Если все попытки получить аппаратный адрес терпят неудачу, мы выбираем случайное 48-битное число с битом многоадресной рассылки (младший значащий бит первого октета), установленным в 1, как рекомендовано в :rfc:`4122`. «Аппаратный адрес» означает MAC-адрес сетевого интерфейса. На машине с несколькими сетевыми интерфейсами универсально администрируемые MAC-адреса (т. е. где второй наименее значимый бит первого октета *не установлен*) будут предпочтительнее локально администрируемых MAC-адресов, но без каких-либо других гарантий порядка.

source: Universally administered MAC addresses are preferred over locally administered MAC addresses, since the former are guaranteed to be globally unique, while the latter are not.
ru: Универсально администрируемые MAC-адреса предпочтительнее локально администрируемых MAC-адресов, поскольку первые гарантированно будут глобально уникальными, а вторые — нет.

source: Generate a UUID from a host ID, sequence number, and the current time. If *node* is not given, :func:`getnode` is used to obtain the hardware address. If *clock_seq* is given, it is used as the sequence number; otherwise a random 14-bit sequence number is chosen.
ru: Создайте UUID из идентификатора хоста, порядкового номера и текущего времени. Если *node* не указан, для получения аппаратного адреса используется :func:`getnode`. Если задан *lock_seq*, он используется как порядковый номер; в противном случае выбирается случайный 14-битный порядковый номер.

source: Generate a UUID based on the MD5 hash of a namespace identifier (which is a UUID) and a name (which is a :class:`bytes` object or a string that will be encoded using UTF-8).
ru: Сгенерируйте UUID на основе MD5-хэша идентификатора пространства имен (который является UUID) и имени (которое представляет собой объект :class:`bytes` или строку, которая будет закодирована с использованием UTF-8).

source: Generate a random UUID.
ru: Создайте случайный UUID.

source: Generate a UUID based on the SHA-1 hash of a namespace identifier (which is a UUID) and a name (which is a :class:`bytes` object or a string that will be encoded using UTF-8).
ru: Сгенерируйте UUID на основе хэша SHA-1 идентификатора пространства имен (который является UUID) и имени (которое представляет собой объект :class:`bytes` или строку, которая будет закодирована с использованием UTF-8).

source: The :mod:`uuid` module defines the following namespace identifiers for use with :func:`uuid3` or :func:`uuid5`.
ru: Модуль :mod:`uuid` определяет следующие идентификаторы пространства имен для использования с :func:`uuid3` или :func:`uuid5`.

source: When this namespace is specified, the *name* string is a fully qualified domain name.
ru: Если указано это пространство имен, строка *name* представляет собой полное доменное имя.

source: When this namespace is specified, the *name* string is a URL.
ru: Если указано это пространство имен, строка *name* является URL-адресом.

source: When this namespace is specified, the *name* string is an ISO OID.
ru: Если указано это пространство имен, строка *name* является ISO OID.

source: When this namespace is specified, the *name* string is an X.500 DN in DER or a text output format.
ru: Если указано это пространство имен, строка *name* представляет собой DN X.500 в DER или текстовый формат вывода.

source: The :mod:`uuid` module defines the following constants for the possible values of the :attr:`~UUID.variant` attribute:
ru: Модуль :mod:`uuid` определяет следующие константы для возможных значений атрибута :attr:`~UUID.variant`:

source: Reserved for NCS compatibility.
ru: Зарезервировано для совместимости с NCS.

source: Specifies the UUID layout given in :rfc:`4122`.
ru: Указывает макет UUID, указанный в :rfc:`4122`.

source: Reserved for Microsoft compatibility.
ru: Зарезервировано для совместимости с Microsoft.

source: Reserved for future definition.
ru: Зарезервировано для будущего определения.

source: :rfc:`4122` - A Universally Unique IDentifier (UUID) URN Namespace
ru: :rfc:`4122` — универсально уникальный идентификатор (UUID) пространства имен URN.

source: This specification defines a Uniform Resource Name namespace for UUIDs, the internal format of UUIDs, and methods of generating UUIDs.
ru: Эта спецификация определяет пространство имен унифицированного имени ресурса для UUID, внутренний формат UUID и методы генерации UUID.

source: Command-Line Usage
ru: Использование командной строки

source: The :mod:`uuid` module can be executed as a script from the command line.
ru: Модуль :mod:`uuid` можно запустить как скрипт из командной строки.

source: The following options are accepted:
ru: Принимаются следующие варианты:

source: Show the help message and exit.
ru: Покажите справочное сообщение и выйдите.

source: Specify the function name to use to generate the uuid. By default :func:`uuid4` is used.
ru: Укажите имя функции, которая будет использоваться для генерации uuid. По умолчанию используется :func:`uuid4`.

source: The namespace is a ``UUID``, or ``@ns`` where ``ns`` is a well-known predefined UUID addressed by namespace name. Such as ``@dns``, ``@url``, ``@oid``, and ``@x500``. Only required for :func:`uuid3` / :func:`uuid5` functions.
ru: Пространство имен представляет собой UUID или @ns, где ns — это хорошо известный предопределенный UUID, к которому обращается имя пространства имен. Например, ``@dns``, ``@url``, ``@oid`` и ``@x500``. Требуется только для функций :func:`uuid3` / :func:`uuid5`.

source: The name used as part of generating the uuid. Only required for :func:`uuid3` / :func:`uuid5` functions.
ru: Имя, используемое при создании uuid. Требуется только для функций :func:`uuid3` / :func:`uuid5`.

source: Example
ru: Пример

source: Here are some examples of typical usage of the :mod:`uuid` module::
ru: Вот несколько примеров типичного использования модуля :mod:`uuid`::

source: Command-Line Example
ru: Пример командной строки

source: Here are some examples of typical usage of the :mod:`uuid` command line interface:
ru: Вот несколько примеров типичного использования интерфейса командной строки :mod:`uuid`:
