Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/weakref.po
Languages: ru

source: :mod:`weakref` --- Weak references
ru: :mod:`weakref` --- Слабые ссылки

source: **Source code:** :source:`Lib/weakref.py`
ru: **Исходный код:** :source:`Lib/weakref.py`

source: The :mod:`weakref` module allows the Python programmer to create :dfn:`weak references` to objects.
ru: Модуль :mod:`weakref` позволяет программисту Python создавать :dfn:`слабые ссылки` на объекты.

source: In the following, the term :dfn:`referent` means the object which is referred to by a weak reference.
ru: Далее термин :dfn:`referent` означает объект, на который ссылается слабая ссылка.

source: A weak reference to an object is not enough to keep the object alive: when the only remaining references to a referent are weak references, :term:`garbage collection` is free to destroy the referent and reuse its memory for something else. However, until the object is actually destroyed the weak reference may return the object even if there are no strong references to it.
ru: Слабой ссылки на объект недостаточно, чтобы сохранить объект в живых: когда единственные оставшиеся ссылки на референт являются слабыми ссылками, :term:`сборка мусора` может уничтожить референт и повторно использовать его память для чего-то другого. Однако до тех пор, пока объект не будет фактически уничтожен, слабая ссылка может возвращать объект, даже если на него нет сильных ссылок.

source: A primary use for weak references is to implement caches or mappings holding large objects, where it's desired that a large object not be kept alive solely because it appears in a cache or mapping.
ru: Основное использование слабых ссылок заключается в реализации кэшей или отображений, содержащих большие объекты, где желательно, чтобы большой объект не оставался активным только потому, что он появляется в кэше или сопоставлении.

source: For example, if you have a number of large binary image objects, you may wish to associate a name with each. If you used a Python dictionary to map names to images, or images to names, the image objects would remain alive just because they appeared as values or keys in the dictionaries. The :class:`WeakKeyDictionary` and :class:`WeakValueDictionary` classes supplied by the :mod:`weakref` module are an alternative, using weak references to construct mappings that don't keep objects alive solely because they appear in the mapping objects. If, for example, an image object is a value in a :class:`WeakValueDictionary`, then when the last remaining references to that image object are the weak references held by weak mappings, garbage collection can reclaim the object, and its corresponding entries in weak mappings are simply deleted.
ru: Например, если у вас есть несколько больших объектов двоичного изображения, вы можете захотеть связать имя с каждым. Если вы использовали словарь Python для сопоставления имен с изображениями или изображений с именами, объекты изображений оставались бы живыми только потому, что они появлялись в словарях как значения или ключи. Классы :class:`WeakKeyDictionary` и :class:`WeakValueDictionary`, предоставляемые модулем :mod:`weakref`, являются альтернативой, использующей слабые ссылки для создания отображений, которые не поддерживают активность объектов только потому, что они появляются в объектах сопоставления. . Если, например, объект изображения является значением в :class:`WeakValueDictionary`, то, когда последние оставшиеся ссылки на этот объект изображения являются слабыми ссылками, содержащимися в слабых сопоставлениях, сборщик мусора может вернуть объект и соответствующие ему записи. в слабых отображениях просто удаляются.

source: :class:`WeakKeyDictionary` and :class:`WeakValueDictionary` use weak references in their implementation, setting up callback functions on the weak references that notify the weak dictionaries when a key or value has been reclaimed by garbage collection. :class:`WeakSet` implements the :class:`set` interface, but keeps weak references to its elements, just like a :class:`WeakKeyDictionary` does.
ru: :class:`WeakKeyDictionary` и :class:`WeakValueDictionary` используют слабые ссылки в своей реализации, настраивая функции обратного вызова для слабых ссылок, которые уведомляют слабые словари, когда ключ или значение были возвращены сборщиком мусора. :class:`WeakSet` реализует интерфейс :class:`set`, но сохраняет слабые ссылки на его элементы, как это делает :class:`WeakKeyDictionary`.

source: :class:`finalize` provides a straight forward way to register a cleanup function to be called when an object is garbage collected. This is simpler to use than setting up a callback function on a raw weak reference, since the module automatically ensures that the finalizer remains alive until the object is collected.
ru: :class:`finalize` предоставляет простой способ регистрации функции очистки, которая будет вызываться при сборке мусора. Это проще в использовании, чем настройка функции обратного вызова для необработанной слабой ссылки, поскольку модуль автоматически гарантирует, что финализатор остается активным до тех пор, пока объект не будет собран.

source: Most programs should find that using one of these weak container types or :class:`finalize` is all they need -- it's not usually necessary to create your own weak references directly. The low-level machinery is exposed by the :mod:`weakref` module for the benefit of advanced uses.
ru: Большинство программ обнаружит, что использование одного из этих слабых типов контейнеров или :class:`finalize` — это все, что им нужно; обычно нет необходимости напрямую создавать свои собственные слабые ссылки. Механизмы низкого уровня доступны с помощью модуля :mod:`weakref` для удобства расширенного использования.

source: Not all objects can be weakly referenced. Objects which support weak references include class instances, functions written in Python (but not in C), instance methods, sets, frozensets, some :term:`file objects <file object>`, :term:`generators <generator>`, type objects, sockets, arrays, deques, regular expression pattern objects, and code objects.
ru: Не на все объекты можно слабо ссылаться. Объекты, поддерживающие слабые ссылки, включают экземпляры классов, функции, написанные на Python (но не на C), методы экземпляра, наборы, замороженные наборы, некоторые :term:`file object <file object>`, :term:`generators <generator>`, объекты типов, сокеты, массивы, деки, объекты шаблонов регулярных выражений и объекты кода.

source: Added support for thread.lock, threading.Lock, and code objects.
ru: Добавлена ​​поддержка объектов thread.lock, threading.Lock и кода.

source: Several built-in types such as :class:`list` and :class:`dict` do not directly support weak references but can add support through subclassing::
ru: Некоторые встроенные типы, такие как :class:`list` и :class:`dict`, не поддерживают слабые ссылки напрямую, но могут добавить поддержку посредством создания подклассов:

source: Other built-in types such as :class:`tuple` and :class:`int` do not support weak references even when subclassed.
ru: Другие встроенные типы, такие как :class:`tuple` и :class:`int`, не поддерживают слабые ссылки, даже если они являются подклассами.

source: Extension types can easily be made to support weak references; see :ref:`weakref-support`.
ru: Типы расширений можно легко создать для поддержки слабых ссылок; см. :ref:`weakref-support`.

source: When ``__slots__`` are defined for a given type, weak reference support is disabled unless a ``'__weakref__'`` string is also present in the sequence of strings in the ``__slots__`` declaration. See :ref:`__slots__ documentation <slots>` for details.
ru: Когда для данного типа определены ``__slots__``, поддержка слабых ссылок отключается, если только строка ``'__weakref__'`` также не присутствует в последовательности строк в объявлении ``__slots__``. Подробности смотрите в :ref:`__slots__ документации <slots>`.

source: Return a weak reference to *object*. The original object can be retrieved by calling the reference object if the referent is still alive; if the referent is no longer alive, calling the reference object will cause :const:`None` to be returned. If *callback* is provided and not :const:`None`, and the returned weakref object is still alive, the callback will be called when the object is about to be finalized; the weak reference object will be passed as the only parameter to the callback; the referent will no longer be available.
ru: Верните слабую ссылку на *object*. Исходный объект можно получить, вызвав ссылочный объект, если референт еще жив; если референт больше не существует, вызов ссылочного объекта приведет к возврату :const:`None`. Если указан *callback*, а не :const:`None`, и возвращенный объект слабой ссылки все еще активен, обратный вызов будет вызван, когда объект вот-вот будет финализирован; объект слабой ссылки будет передан в качестве единственного параметра обратного вызова; референт больше не будет доступен.

source: It is allowable for many weak references to be constructed for the same object. Callbacks registered for each weak reference will be called from the most recently registered callback to the oldest registered callback.
ru: Для одного и того же объекта допускается создание множества слабых ссылок. Обратные вызовы, зарегистрированные для каждой слабой ссылки, будут вызываться от самого последнего зарегистрированного обратного вызова до самого старого зарегистрированного обратного вызова.

source: Exceptions raised by the callback will be noted on the standard error output, but cannot be propagated; they are handled in exactly the same way as exceptions raised from an object's :meth:`~object.__del__` method.
ru: Исключения, вызванные обратным вызовом, будут отмечены в стандартном выводе ошибок, но не могут быть распространены; они обрабатываются точно так же, как исключения, возникающие из метода :meth:`~object.__del__` объекта.

source: Weak references are :term:`hashable` if the *object* is hashable. They will maintain their hash value even after the *object* was deleted. If :func:`hash` is called the first time only after the *object* was deleted, the call will raise :exc:`TypeError`.
ru: Слабые ссылки являются :term:`хешируемыми`, если *объект* хэшируемый. Они сохранят свое хеш-значение даже после удаления *объекта*. Если :func:`hash` вызывается в первый раз только после удаления *объекта*, вызов вызовет :exc:`TypeError`.

source: Weak references support tests for equality, but not ordering. If the referents are still alive, two references have the same equality relationship as their referents (regardless of the *callback*). If either referent has been deleted, the references are equal only if the reference objects are the same object.
ru: Слабые ссылки поддерживают проверку на равенство, но не на порядок. Если референты все еще живы, две ссылки имеют те же отношения равенства, что и их референты (независимо от *обратного вызова*). Если любой из референтов был удален, ссылки равны, только если ссылочные объекты являются одним и тем же объектом.

source: This is a subclassable type rather than a factory function.
ru: Это подклассифицированный тип, а не фабричная функция.

source: This read-only attribute returns the callback currently associated to the weakref. If there is no callback or if the referent of the weakref is no longer alive then this attribute will have value ``None``.
ru: Этот атрибут только для чтения возвращает обратный вызов, связанный в данный момент со слабой ссылкой. Если обратного вызова нет или референт слабой ссылки больше не активен, тогда этот атрибут будет иметь значение None.

source: Added the :attr:`__callback__` attribute.
ru: Добавлен атрибут :attr:`__callback__`.

source: Return a proxy to *object* which uses a weak reference. This supports use of the proxy in most contexts instead of requiring the explicit dereferencing used with weak reference objects. The returned object will have a type of either ``ProxyType`` or ``CallableProxyType``, depending on whether *object* is callable. Proxy objects are not :term:`hashable` regardless of the referent; this avoids a number of problems related to their fundamentally mutable nature, and prevents their use as dictionary keys. *callback* is the same as the parameter of the same name to the :func:`ref` function.
ru: Верните прокси объекту *object*, который использует слабую ссылку. Это поддерживает использование прокси в большинстве контекстов вместо необходимости явного разыменования, используемого со слабыми ссылочными объектами. Возвращенный объект будет иметь тип ProxyType или CallableProxyType, в зависимости от того, является ли *object* вызываемым. Прокси-объекты не являются :term:`хешируемыми` независимо от референта; это позволяет избежать ряда проблем, связанных с их принципиально изменчивой природой, и предотвращает их использование в качестве ключей словаря. *callback* аналогичен одноименному параметру функции :func:`ref`.

source: Accessing an attribute of the proxy object after the referent is garbage collected raises :exc:`ReferenceError`.
ru: Доступ к атрибуту прокси-объекта после того, как референт был очищен от мусора, вызывает ошибку :exc:`ReferenceError`.

source: Extended the operator support on proxy objects to include the matrix multiplication operators ``@`` and ``@=``.
ru: Расширена поддержка операторов прокси-объектов за счет включения операторов матричного умножения ``@`` и ``@=``.

source: Return the number of weak references and proxies which refer to *object*.
ru: Возвращает количество слабых ссылок и прокси, ссылающихся на *объект*.

source: Return a list of all weak reference and proxy objects which refer to *object*.
ru: Возвращает список всех слабых ссылок и прокси-объектов, которые ссылаются на *object*.

source: Mapping class that references keys weakly. Entries in the dictionary will be discarded when there is no longer a strong reference to the key. This can be used to associate additional data with an object owned by other parts of an application without adding attributes to those objects. This can be especially useful with objects that override attribute accesses.
ru: Класс сопоставления, который слабо ссылается на ключи. Записи в словаре будут отброшены, если на ключ больше не будет сильной ссылки. Это можно использовать для связывания дополнительных данных с объектом, принадлежащим другим частям приложения, без добавления атрибутов к этим объектам. Это может быть особенно полезно для объектов, которые переопределяют доступ к атрибутам.

source: Note that when a key with equal value to an existing key (but not equal identity) is inserted into the dictionary, it replaces the value but does not replace the existing key. Due to this, when the reference to the original key is deleted, it also deletes the entry in the dictionary::
ru: Обратите внимание: когда в словарь вставляется ключ со значением, равным существующему ключу (но не с равным идентификатором), он заменяет значение, но не заменяет существующий ключ. Благодаря этому при удалении ссылки на исходный ключ удаляется и запись в словаре::

source: A workaround would be to remove the key prior to reassignment::
ru: Обходным решением было бы удалить ключ перед переназначением::

source: Added support for ``|`` and ``|=`` operators, as specified in :pep:`584`.
ru: Добавлена ​​поддержка операторов ``|`` и ``|=``, как указано в :pep:`584`.

source: :class:`WeakKeyDictionary` objects have an additional method that exposes the internal references directly. The references are not guaranteed to be "live" at the time they are used, so the result of calling the references needs to be checked before being used. This can be used to avoid creating references that will cause the garbage collector to keep the keys around longer than needed.
ru: Объекты :class:`WeakKeyDictionary` имеют дополнительный метод, который напрямую предоставляет внутренние ссылки. Не гарантируется, что ссылки будут «живыми» в момент их использования, поэтому перед использованием необходимо проверить результат вызова ссылок. Это можно использовать, чтобы избежать создания ссылок, из-за которых сборщик мусора будет хранить ключи дольше, чем необходимо.

source: Return an iterable of the weak references to the keys.
ru: Верните итерацию слабых ссылок на ключи.

source: Mapping class that references values weakly. Entries in the dictionary will be discarded when no strong reference to the value exists any more.
ru: Класс сопоставления, слабо ссылающийся на значения. Записи в словаре будут отброшены, если сильная ссылка на значение больше не существует.

source: :class:`WeakValueDictionary` objects have an additional method that has the same issues as the :meth:`WeakKeyDictionary.keyrefs` method.
ru: Объекты :class:`WeakValueDictionary` имеют дополнительный метод, имеющий те же проблемы, что и метод :meth:`WeakKeyDictionary.keyrefs`.

source: Return an iterable of the weak references to the values.
ru: Возвращает итерацию слабых ссылок на значения.

source: Set class that keeps weak references to its elements. An element will be discarded when no strong reference to it exists any more.
ru: Установите класс, который хранит слабые ссылки на свои элементы. Элемент будет отброшен, если на него больше не существует сильной ссылки.

source: A custom :class:`ref` subclass which simulates a weak reference to a bound method (i.e., a method defined on a class and looked up on an instance). Since a bound method is ephemeral, a standard weak reference cannot keep hold of it. :class:`WeakMethod` has special code to recreate the bound method until either the object or the original function dies::
ru: Пользовательский подкласс :class:`ref`, который имитирует слабую ссылку на связанный метод (т. е. метод, определенный в классе и просматриваемый в экземпляре). Поскольку связанный метод эфемерен, стандартная слабая ссылка не может его удержать. :class:`WeakMethod` имеет специальный код для воссоздания привязанного метода до тех пор, пока объект или исходная функция не умрут::

source: *callback* is the same as the parameter of the same name to the :func:`ref` function.
ru: *callback* аналогичен одноименному параметру функции :func:`ref`.

source: Return a callable finalizer object which will be called when *obj* is garbage collected. Unlike an ordinary weak reference, a finalizer will always survive until the reference object is collected, greatly simplifying lifecycle management.
ru: Возвращает вызываемый объект финализатора, который будет вызываться при сборке мусора *obj*. В отличие от обычной слабой ссылки, финализатор всегда будет работать до тех пор, пока не будет собран ссылочный объект, что значительно упрощает управление жизненным циклом.

source: A finalizer is considered *alive* until it is called (either explicitly or at garbage collection), and after that it is *dead*. Calling a live finalizer returns the result of evaluating ``func(*arg, **kwargs)``, whereas calling a dead finalizer returns :const:`None`.
ru: Финализатор считается *живым* до тех пор, пока он не будет вызван (явно или при сборке мусора), а после этого он *мертв*. Вызов действующего финализатора возвращает результат вычисления func(*arg, **kwargs)``, тогда как вызов мертвого финализатора возвращает :const:`None`.

source: Exceptions raised by finalizer callbacks during garbage collection will be shown on the standard error output, but cannot be propagated. They are handled in the same way as exceptions raised from an object's :meth:`~object.__del__` method or a weak reference's callback.
ru: Исключения, вызванные обратными вызовами финализатора во время сборки мусора, будут отображаться в стандартном выводе ошибок, но не могут быть распространены. Они обрабатываются так же, как исключения, возникающие из метода :meth:`~object.__del__` объекта или обратного вызова слабой ссылки.

source: When the program exits, each remaining live finalizer is called unless its :attr:`atexit` attribute has been set to false. They are called in reverse order of creation.
ru: При выходе из программы вызывается каждый оставшийся активный финализатор, если только его атрибут :attr:`atexit` не установлен в значение false. Они вызываются в порядке, обратном созданию.

source: A finalizer will never invoke its callback during the later part of the :term:`interpreter shutdown` when module globals are liable to have been replaced by :const:`None`.
ru: Финализатор никогда не будет вызывать свой обратный вызов во время поздней части завершения работы интерпретатора, когда глобальные переменные модуля могут быть заменены на :const:`None`.

source: If *self* is alive then mark it as dead and return the result of calling ``func(*args, **kwargs)``. If *self* is dead then return :const:`None`.
ru: Если *self* жив, то пометьте его как мертвый и верните результат вызова ``func(*args, **kwargs)``. Если *self* мертв, верните :const:`None`.

source: If *self* is alive then mark it as dead and return the tuple ``(obj, func, args, kwargs)``. If *self* is dead then return :const:`None`.
ru: Если *self* жив, отметьте его как мертвый и верните кортеж ``(obj, func, args, kwargs)``. Если *self* мертв, верните :const:`None`.

source: If *self* is alive then return the tuple ``(obj, func, args, kwargs)``. If *self* is dead then return :const:`None`.
ru: Если *self* жив, верните кортеж ``(obj, func, args, kwargs)``. Если *self* мертв, верните :const:`None`.

source: Property which is true if the finalizer is alive, false otherwise.
ru: Свойство, которое истинно, если финализатор активен, и ложно в противном случае.

source: A writable boolean property which by default is true. When the program exits, it calls all remaining live finalizers for which :attr:`.atexit` is true. They are called in reverse order of creation.
ru: Доступное для записи логическое свойство, которое по умолчанию имеет значение true. Когда программа завершает работу, она вызывает все оставшиеся активные финализаторы, для которых :attr:`.atexit` имеет значение true. Они вызываются в порядке, обратном созданию.

source: It is important to ensure that *func*, *args* and *kwargs* do not own any references to *obj*, either directly or indirectly, since otherwise *obj* will never be garbage collected. In particular, *func* should not be a bound method of *obj*.
ru: Важно гарантировать, что *func*, *args* и *kwargs* не содержат никаких ссылок на *obj*, ни прямо, ни косвенно, поскольку в противном случае *obj* никогда не будет подвергнут сборке мусора. В частности, *func* не должен быть связанным методом *obj*.

source: The type object for weak references objects.
ru: Тип объекта для объектов слабых ссылок.

source: The type object for proxies of objects which are not callable.
ru: Тип объекта для прокси объектов, которые не могут быть вызваны.

source: The type object for proxies of callable objects.
ru: Тип объекта для прокси вызываемых объектов.

source: Sequence containing all the type objects for proxies. This can make it simpler to test if an object is a proxy without being dependent on naming both proxy types.
ru: Последовательность, содержащая все объекты типов для прокси. Это может упростить проверку того, является ли объект прокси, не прибегая к именованию обоих типов прокси.

source: :pep:`205` - Weak References
ru: :pep:`205` - Слабые ссылки

source: The proposal and rationale for this feature, including links to earlier implementations and information about similar features in other languages.
ru: Предложение и обоснование этой функции, включая ссылки на более ранние реализации и информацию о подобных функциях на других языках.

source: Weak Reference Objects
ru: Слабые эталонные объекты
