Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/weakref.po
Languages: ru

source: Weak reference objects have no methods and no attributes besides :attr:`ref.__callback__`. A weak reference object allows the referent to be obtained, if it still exists, by calling it:
ru: Слабые ссылочные объекты не имеют методов и атрибутов, кроме :attr:`ref.__callback__`. Слабый ссылочный объект позволяет получить референт, если он все еще существует, вызвав его:

source: If the referent no longer exists, calling the reference object returns :const:`None`:
ru: Если референт больше не существует, вызов ссылочного объекта возвращает :const:`None`:

source: Testing that a weak reference object is still live should be done using the expression ``ref() is not None``. Normally, application code that needs to use a reference object should follow this pattern::
ru: Проверка работоспособности объекта слабой ссылки должна выполняться с использованием выражения ``ref() is not None``. Обычно код приложения, которому необходимо использовать ссылочный объект, должен следовать следующему шаблону:

source: Using a separate test for "liveness" creates race conditions in threaded applications; another thread can cause a weak reference to become invalidated before the weak reference is called; the idiom shown above is safe in threaded applications as well as single-threaded applications.
ru: Использование отдельного теста на «живучесть» создает условия гонки в многопоточных приложениях; другой поток может привести к тому, что слабая ссылка станет недействительной до того, как слабая ссылка будет вызвана; показанная выше идиома безопасна как для многопоточных, так и для однопоточных приложений.

source: Specialized versions of :class:`ref` objects can be created through subclassing. This is used in the implementation of the :class:`WeakValueDictionary` to reduce the memory overhead for each entry in the mapping. This may be most useful to associate additional information with a reference, but could also be used to insert additional processing on calls to retrieve the referent.
ru: Специализированные версии объектов :class:`ref` могут быть созданы посредством создания подклассов. Это используется в реализации :class:`WeakValueDictionary` для уменьшения накладных расходов памяти для каждой записи в сопоставлении. Это может быть наиболее полезно для связывания дополнительной информации со ссылкой, но также может использоваться для вставки дополнительной обработки вызовов для получения референта.

source: This example shows how a subclass of :class:`ref` can be used to store additional information about an object and affect the value that's returned when the referent is accessed::
ru: В этом примере показано, как подкласс :class:`ref` можно использовать для хранения дополнительной информации об объекте и влияния на значение, возвращаемое при обращении к референту::

source: Example
ru: Пример

source: This simple example shows how an application can use object IDs to retrieve objects that it has seen before. The IDs of the objects can then be used in other data structures without forcing the objects to remain alive, but the objects can still be retrieved by ID if they do.
ru: Этот простой пример показывает, как приложение может использовать идентификаторы объектов для извлечения объектов, которые оно видело раньше. Идентификаторы объектов затем можно использовать в других структурах данных, не заставляя объекты оставаться активными, но объекты все равно можно получить по идентификатору, если они это сделают.

source: Finalizer Objects
ru: финализатор Объекты

source: The main benefit of using :class:`finalize` is that it makes it simple to register a callback without needing to preserve the returned finalizer object. For instance
ru: Основное преимущество использования :class:`finalize` заключается в том, что он упрощает регистрацию обратного вызова без необходимости сохранения возвращаемого объекта финализатора. Например

source: The finalizer can be called directly as well. However the finalizer will invoke the callback at most once.
ru: Финализатор также можно вызвать напрямую. Однако финализатор вызовет обратный вызов не более одного раза.

source: You can unregister a finalizer using its :meth:`~finalize.detach` method. This kills the finalizer and returns the arguments passed to the constructor when it was created.
ru: Вы можете отменить регистрацию финализатора, используя его метод :meth:`~finalize.detach`. Это убивает финализатор и возвращает аргументы, переданные конструктору при его создании.

source: Unless you set the :attr:`~finalize.atexit` attribute to :const:`False`, a finalizer will be called when the program exits if it is still alive. For instance
ru: Если вы не установите для атрибута :attr:`~finalize.atexit` значение :const:`False`, финализатор будет вызываться при выходе из программы, если она еще жива. Например

source: Comparing finalizers with :meth:`~object.__del__` methods
ru: Сравнение финализаторов с методами :meth:`~object.__del__`

source: Suppose we want to create a class whose instances represent temporary directories. The directories should be deleted with their contents when the first of the following events occurs:
ru: Предположим, мы хотим создать класс, экземпляры которого представляют временные каталоги. Каталоги должны быть удалены вместе с их содержимым при возникновении первого из следующих событий:

source: the object is garbage collected,
ru: объект убран сборщиком мусора,

source: the object's :meth:`!remove` method is called, or
ru: вызывается метод :meth:`!remove` объекта, или

source: the program exits.
ru: программа завершает работу.

source: We might try to implement the class using a :meth:`~object.__del__` method as follows::
ru: Мы могли бы попытаться реализовать класс, используя метод :meth:`~object.__del__` следующим образом:

source: Starting with Python 3.4, :meth:`~object.__del__` methods no longer prevent reference cycles from being garbage collected, and module globals are no longer forced to :const:`None` during :term:`interpreter shutdown`. So this code should work without any issues on CPython.
ru: Начиная с Python 3.4, методы :meth:`~object.__del__` больше не предотвращают сбор мусора ссылочных циклов, а глобальные переменные модуля больше не принудительно :const:`None` во время :term:`interpreter Shutdown`. Таким образом, этот код должен работать без проблем на CPython.

source: However, handling of :meth:`~object.__del__` methods is notoriously implementation specific, since it depends on internal details of the interpreter's garbage collector implementation.
ru: Однако обработка методов :meth:`~object.__del__`, как известно, зависит от конкретной реализации, поскольку она зависит от внутренних деталей реализации сборщика мусора интерпретатора.

source: A more robust alternative can be to define a finalizer which only references the specific functions and objects that it needs, rather than having access to the full state of the object::
ru: Более надежной альтернативой может быть определение финализатора, который ссылается только на конкретные функции и объекты, которые ему нужны, вместо того, чтобы иметь доступ к полному состоянию объекта:

source: Defined like this, our finalizer only receives a reference to the details it needs to clean up the directory appropriately. If the object never gets garbage collected the finalizer will still be called at exit.
ru: При таком определении наш финализатор получает только ссылку на детали, необходимые для соответствующей очистки каталога. Если объект никогда не собирает мусор, финализатор все равно будет вызываться при выходе.

source: The other advantage of weakref based finalizers is that they can be used to register finalizers for classes where the definition is controlled by a third party, such as running code when a module is unloaded::
ru: Другое преимущество финализаторов на основе слабых ссылок заключается в том, что их можно использовать для регистрации финализаторов для классов, определение которых контролируется третьей стороной, например, для запуска кода при выгрузке модуля:

source: If you create a finalizer object in a daemonic thread just as the program exits then there is the possibility that the finalizer does not get called at exit. However, in a daemonic thread :func:`atexit.register`, ``try: ... finally: ...`` and ``with: ...`` do not guarantee that cleanup occurs either.
ru: Если вы создаете объект финализатора в демоническом потоке сразу после выхода из программы, существует вероятность того, что финализатор не будет вызван при выходе. Однако в демоническом потоке :func:`atexit.register` ``try: ...finally: ...`` и ``with: ...`` также не гарантируют, что очистка произойдет.
