Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/winreg.po
Languages: ru, uk

source: Retrieves the unnamed value for a key, as a string.
ru: Получает безымянное значение ключа в виде строки.
uk: Отримує безіменне значення для ключа у вигляді рядка.

source: *sub_key* is a string that holds the name of the subkey with which the value is associated. If this parameter is ``None`` or empty, the function retrieves the value set by the :func:`SetValue` method for the key identified by *key*.
ru: *sub_key* — это строка, содержащая имя подраздела, с которым связано значение. Если этот параметр равен None или пуст, функция получает значение, установленное методом :func:`SetValue` для ключа, идентифицированного *key*.
uk: *sub_key* — це рядок, який містить назву підрозділу, з яким пов’язане значення. Якщо цей параметр ``None`` або порожній, функція отримує значення, встановлене методом :func:`SetValue` для ключа, визначеного *key*.

source: Values in the registry have name, type, and data components. This method retrieves the data for a key's first value that has a ``NULL`` name. But the underlying API call doesn't return the type, so always use :func:`QueryValueEx` if possible.
ru: Значения в реестре имеют имя, тип и компоненты данных. Этот метод извлекает данные для первого значения ключа, имеющего имя NULL. Но базовый вызов API не возвращает тип, поэтому всегда используйте :func:`QueryValueEx`, если это возможно.
uk: Значення в реєстрі мають назву, тип і компоненти даних. Цей метод отримує дані для першого значення ключа, яке має назву ``NULL``. Але основний виклик API не повертає тип, тому завжди використовуйте :func:`QueryValueEx`, якщо це можливо.

source: Raises an :ref:`auditing event <auditing>` ``winreg.QueryValue`` with arguments ``key``, ``sub_key``, ``value_name``.
ru: Вызывает :ref:`событие аудита <auditing>``winreg.QueryValue`` с аргументами ``key``, ``sub_key``, ``имя_значения``.
uk: Викликає :ref:`подію аудиту <auditing>` ``winreg.QueryValue`` з аргументами ``key``, ``sub_key``, ``value_name``.

source: Retrieves the type and data for a specified value name associated with an open registry key.
ru: Извлекает тип и данные для указанного имени значения, связанного с открытым ключом реестра.
uk: Отримує тип і дані для вказаного імені значення, пов’язаного з відкритим розділом реєстру.

source: *value_name* is a string indicating the value to query.
ru: *имя_значения* — это строка, указывающая значение для запроса.
uk: *value_name* — це рядок, що вказує на значення для запиту.

source: The result is a tuple of 2 items:
ru: В результате получается кортеж из двух элементов:
uk: Результатом є кортеж із 2 елементів:

source: The value of the registry item.
ru: Значение элемента реестра.
uk: Значення елемента реєстру.

source: An integer giving the registry type for this value (see table in docs for :meth:`SetValueEx`)
ru: Целое число, указывающее тип реестра для этого значения (см. таблицу в документации для :meth:`SetValueEx`)
uk: Ціле число, що вказує тип реєстру для цього значення (див. таблицю в документах для :meth:`SetValueEx`)

source: Saves the specified key, and all its subkeys to the specified file.
ru: Сохраняет указанный ключ и все его подразделы в указанный файл.
uk: Зберігає вказаний ключ і всі його підключі у вказаний файл.

source: *file_name* is the name of the file to save registry data to. This file cannot already exist. If this filename includes an extension, it cannot be used on file allocation table (FAT) file systems by the :meth:`LoadKey` method.
ru: *имя_файла* — имя файла, в который сохраняются данные реестра. Этот файл не может уже существовать. Если это имя файла включает расширение, его нельзя использовать в файловых системах таблицы размещения файлов (FAT) методом :meth:`LoadKey`.
uk: *ім’я_файлу* — це ім’я файлу, у який потрібно зберегти дані реєстру. Цей файл уже не може існувати. Якщо це ім’я файлу містить розширення, його не можна використовувати у файлових системах таблиці розподілу файлів (FAT) методом :meth:`LoadKey`.

source: If *key* represents a key on a remote computer, the path described by *file_name* is relative to the remote computer. The caller of this method must possess the :const:`SeBackupPrivilege` security privilege. Note that privileges are different than permissions -- see the `Conflicts Between User Rights and Permissions documentation <https://msdn.microsoft.com/en-us/library/ms724878%28v=VS.85%29.aspx>`__ for more details.
uk: Якщо *key* представляє ключ на віддаленому комп’ютері, шлях, описаний *file_name*, відноситься до віддаленого комп’ютера. Виклик цього методу повинен мати привілей безпеки :const:`SeBackupPrivilege`. Зауважте, що привілеї відрізняються від дозволів — дивіться `Документацію про конфлікти між правами користувача та дозволами <https://msdn.microsoft.com/en-us/library/ms724878%28v=VS.85%29.aspx>`__ для отримання додаткової інформації.

source: This function passes ``NULL`` for *security_attributes* to the API.
ru: Эта функция передает NULL для *security_attributes* в API.
uk: Ця функція передає ``NULL`` для *security_attributes* в API.

source: Raises an :ref:`auditing event <auditing>` ``winreg.SaveKey`` with arguments ``key``, ``file_name``.
ru: Вызывает :ref:`событие аудита <auditing>` ``winreg.SaveKey`` с аргументами ``key``, ``file_name``.
uk: Викликає :ref:`подію аудиту <auditing>` ``winreg.SaveKey`` з аргументами ``key``, ``file_name``.

source: Associates a value with a specified key.
ru: Связывает значение с указанным ключом.
uk: Пов’язує значення з указаним ключем.

source: *sub_key* is a string that names the subkey with which the value is associated.
ru: *sub_key* — это строка, содержащая имя подраздела, с которым связано значение.
uk: *sub_key* — це рядок, що називає підрозділ, з яким пов’язане значення.

source: *type* is an integer that specifies the type of the data. Currently this must be :const:`REG_SZ`, meaning only strings are supported. Use the :func:`SetValueEx` function for support for other data types.
ru: *type* — целое число, указывающее тип данных. В настоящее время это должно быть :const:`REG_SZ`, что означает, что поддерживаются только строки. Используйте функцию :func:`SetValueEx` для поддержки других типов данных.
uk: *type* — це ціле число, яке визначає тип даних. Наразі це має бути :const:`REG_SZ`, тобто підтримуються лише рядки. Використовуйте функцію :func:`SetValueEx` для підтримки інших типів даних.

source: *value* is a string that specifies the new value.
ru: *значение* — это строка, определяющая новое значение.
uk: *value* — це рядок, який визначає нове значення.

source: If the key specified by the *sub_key* parameter does not exist, the SetValue function creates it.
ru: Если ключ, указанный параметром *sub_key*, не существует, функция SetValue создает его.
uk: Якщо ключ, визначений параметром *sub_key*, не існує, функція SetValue створює його.

source: Value lengths are limited by available memory. Long values (more than 2048 bytes) should be stored as files with the filenames stored in the configuration registry. This helps the registry perform efficiently.
ru: Длина значений ограничена доступной памятью. Длинные значения (более 2048 байт) следует хранить в виде файлов, имена которых хранятся в реестре конфигурации. Это помогает реестру работать эффективно.
uk: Довжина значень обмежена доступною пам'яттю. Довгі значення (понад 2048 байт) слід зберігати як файли з іменами файлів, які зберігаються в реєстрі конфігурації. Це сприяє ефективній роботі реєстру.

source: The key identified by the *key* parameter must have been opened with :const:`KEY_SET_VALUE` access.
ru: Ключ, указанный параметром *key*, должен быть открыт с доступом :const:`KEY_SET_VALUE`.
uk: Ключ, визначений параметром *key*, має бути відкритий із доступом :const:`KEY_SET_VALUE`.

source: Raises an :ref:`auditing event <auditing>` ``winreg.SetValue`` with arguments ``key``, ``sub_key``, ``type``, ``value``.
ru: Вызывает :ref:`событие аудита <auditing>` ``winreg.SetValue`` с аргументами ``key``, ``sub_key``, ``type``, ``value``.
uk: Викликає :ref:`подію аудиту <auditing>` ``winreg.SetValue`` з аргументами ``key``, ``sub_key``, ``type``, ``value``.

source: Stores data in the value field of an open registry key.
ru: Сохраняет данные в поле значения открытого ключа реестра.
uk: Зберігає дані в полі значення відкритого ключа реєстру.

source: *value_name* is a string that names the subkey with which the value is associated.
ru: *имя_значения* — это строка, содержащая имя подраздела, с которым связано значение.
uk: *value_name* — це рядок, що називає підрозділ, з яким пов’язане значення.

source: *reserved* can be anything -- zero is always passed to the API.
ru: *reserved* может быть любым — в API всегда передается ноль.
uk: *reserved* може бути будь-яким - нуль завжди передається в API.

source: *type* is an integer that specifies the type of the data. See :ref:`Value Types <value-types>` for the available types.
ru: *type* — целое число, указывающее тип данных. См. :ref:`Типы значений <value-types>` для доступных типов.
uk: *type* — це ціле число, яке визначає тип даних. Перегляньте :ref:`Типи значень <value-types>` для доступних типів.

source: This method can also set additional value and type information for the specified key. The key identified by the key parameter must have been opened with :const:`KEY_SET_VALUE` access.
ru: Этот метод также может установить дополнительное значение и информацию о типе для указанного ключа. Ключ, определенный параметром key, должен быть открыт с доступом :const:`KEY_SET_VALUE`.
uk: Цей метод також може встановити додаткове значення та інформацію про тип для вказаного ключа. Ключ, визначений параметром ключа, має бути відкрито з доступом :const:`KEY_SET_VALUE`.

source: To open the key, use the :func:`CreateKey` or :func:`OpenKey` methods.
ru: Чтобы открыть ключ, используйте методы :func:`CreateKey` или :func:`OpenKey`.
uk: Щоб відкрити ключ, використовуйте методи :func:`CreateKey` або :func:`OpenKey`.

source: Disables registry reflection for 32-bit processes running on a 64-bit operating system.
ru: Отключает отражение реестра для 32-битных процессов, работающих в 64-битной операционной системе.
uk: Вимикає відображення реєстру для 32-розрядних процесів, запущених у 64-розрядній операційній системі.

source: Will generally raise :exc:`NotImplementedError` if executed on a 32-bit operating system.
ru: Обычно вызывает :exc:`NotImplementedError`, если выполняется в 32-битной операционной системе.
uk: Зазвичай викликає помилку :exc:`NotImplementedError`, якщо її виконувати в 32-розрядній операційній системі.

source: If the key is not on the reflection list, the function succeeds but has no effect. Disabling reflection for a key does not affect reflection of any subkeys.
ru: Если ключа нет в списке отражений, функция завершается успешно, но не оказывает никакого эффекта. Отключение отражения для ключа не влияет на отражение каких-либо подразделов.
uk: Якщо ключ відсутній у списку відображення, функція виконується успішно, але не має ефекту. Вимкнення відображення для ключа не впливає на відображення будь-яких підключів.

source: Raises an :ref:`auditing event <auditing>` ``winreg.DisableReflectionKey`` with argument ``key``.
ru: Вызывает :ref:`событие аудита <auditing>``winreg.DisableReflectionKey`` с аргументом ``key``.
uk: Викликає :ref:`подію аудиту <auditing>` ``winreg.DisableReflectionKey`` з аргументом ``key``.

source: Restores registry reflection for the specified disabled key.
ru: Восстанавливает отражение реестра для указанного отключенного ключа.
uk: Відновлює відображення реєстру для вказаного вимкненого ключа.

source: Restoring reflection for a key does not affect reflection of any subkeys.
ru: Восстановление отражения ключа не влияет на отражение каких-либо подразделов.
uk: Відновлення відображення для ключа не впливає на відображення будь-яких підключів.

source: Raises an :ref:`auditing event <auditing>` ``winreg.EnableReflectionKey`` with argument ``key``.
ru: Вызывает :ref:`событие аудита <auditing>``winreg.EnableReflectionKey`` с аргументом ``key``.
uk: Викликає :ref:`подію аудиту <auditing>` ``winreg.EnableReflectionKey`` з аргументом ``key``.

source: Determines the reflection state for the specified key.
ru: Определяет состояние отражения для указанного ключа.
uk: Визначає стан відображення для вказаного ключа.

source: Returns ``True`` if reflection is disabled.
ru: Возвращает True, если отражение отключено.
uk: Повертає ``True``, якщо відображення вимкнено.

source: Raises an :ref:`auditing event <auditing>` ``winreg.QueryReflectionKey`` with argument ``key``.
ru: Вызывает :ref:`событие аудита <auditing>``winreg.QueryReflectionKey`` с аргументом ``key``.
uk: Викликає :ref:`подію аудиту <auditing>` ``winreg.QueryReflectionKey`` з аргументом ``key``.

source: Constants
ru: Константы
uk: Константи

source: The following constants are defined for use in many :mod:`_winreg` functions.
uk: Наступні константи визначені для використання в багатьох функціях :mod:`_winreg`.

source: HKEY_* Constants
ru: HKEY_* константы
uk: HKEY_* Константи

source: Registry entries subordinate to this key define types (or classes) of documents and the properties associated with those types. Shell and COM applications use the information stored under this key.
ru: Записи реестра, подчиненные этому ключу, определяют типы (или классы) документов и свойства, связанные с этими типами. Приложения оболочки и COM используют информацию, хранящуюся под этим ключом.
uk: Записи реєстру, підпорядковані цьому ключу, визначають типи (або класи) документів і властивості, пов’язані з цими типами. Додатки Shell і COM використовують інформацію, що зберігається під цим ключем.

source: Registry entries subordinate to this key define the preferences of the current user. These preferences include the settings of environment variables, data about program groups, colors, printers, network connections, and application preferences.
ru: Записи реестра, подчиненные этому ключу, определяют предпочтения текущего пользователя. Эти настройки включают настройки переменных среды, данные о группах программ, цветах, принтерах, сетевых подключениях и настройках приложений.
uk: Записи реєстру, підпорядковані цьому ключу, визначають уподобання поточного користувача. Ці параметри включають параметри змінних середовища, дані про групи програм, кольори, принтери, мережеві підключення та параметри програми.

source: Registry entries subordinate to this key define the physical state of the computer, including data about the bus type, system memory, and installed hardware and software.
ru: Записи реестра, подчиненные этому ключу, определяют физическое состояние компьютера, включая данные о типе шины, системной памяти, а также установленном аппаратном и программном обеспечении.
uk: Записи реєстру, підпорядковані цьому ключу, визначають фізичний стан комп'ютера, включаючи дані про тип шини, системну пам'ять, а також встановлене обладнання та програмне забезпечення.

source: Registry entries subordinate to this key define the default user configuration for new users on the local computer and the user configuration for the current user.
ru: Записи реестра, подчиненные этому разделу, определяют конфигурацию пользователя по умолчанию для новых пользователей на локальном компьютере и конфигурацию пользователя для текущего пользователя.
uk: Записи реєстру, підпорядковані цьому розділу, визначають конфігурацію користувача за замовчуванням для нових користувачів на локальному комп’ютері та конфігурацію користувача для поточного користувача.

source: Registry entries subordinate to this key allow you to access performance data. The data is not actually stored in the registry; the registry functions cause the system to collect the data from its source.
ru: Записи реестра, подчиненные этому ключу, позволяют получить доступ к данным о производительности. Данные фактически не хранятся в реестре; функции реестра заставляют систему собирать данные из источника.
uk: Записи реєстру, підпорядковані цьому ключу, дозволяють отримати доступ до даних продуктивності. Дані фактично не зберігаються в реєстрі; функції реєстру змушують систему збирати дані з джерела.

source: Contains information about the current hardware profile of the local computer system.
ru: Содержит информацию о текущем профиле оборудования локальной компьютерной системы.
uk: Містить інформацію про поточний профіль апаратного забезпечення локальної комп’ютерної системи.

source: This key is not used in versions of Windows after 98.
ru: Этот ключ не используется в версиях Windows после 98.
uk: Цей ключ не використовується у версіях Windows після 98.

source: Access Rights
ru: Права доступа
uk: Права доступу

source: For more information, see `Registry Key Security and Access <https://msdn.microsoft.com/en-us/library/ms724878%28v=VS.85%29.aspx>`__.
ru: Дополнительные сведения см. в разделе «Безопасность и доступ к ключу реестра <https://msdn.microsoft.com/en-us/library/ms724878%28v=VS.85%29.aspx>»__.
uk: Щоб отримати додаткові відомості, перегляньте `Безпека ключа реєстру та доступ <https://msdn.microsoft.com/en-us/library/ms724878%28v=VS.85%29.aspx>`__.

source: Combines the STANDARD_RIGHTS_REQUIRED, :const:`KEY_QUERY_VALUE`, :const:`KEY_SET_VALUE`, :const:`KEY_CREATE_SUB_KEY`, :const:`KEY_ENUMERATE_SUB_KEYS`, :const:`KEY_NOTIFY`, and :const:`KEY_CREATE_LINK` access rights.
ru: Сочетает права доступа STANDARD_RIGHTS_REQUIRED, :const:`KEY_QUERY_VALUE`, :const:`KEY_SET_VALUE`, :const:`KEY_CREATE_SUB_KEY`, :const:`KEY_ENUMERATE_SUB_KEYS`, :const:`KEY_NOTIFY` и :const:`KEY_CREATE_LINK`.
uk: Поєднує права доступу STANDARD_RIGHTS_REQUIRED, :const:`KEY_QUERY_VALUE`, :const:`KEY_SET_VALUE`, :const:`KEY_CREATE_SUB_KEY`, :const:`KEY_ENUMERATE_SUB_KEYS`, :const:`KEY_NOTIFY` і :const:`KEY_CREATE_LINK`.

source: Combines the STANDARD_RIGHTS_WRITE, :const:`KEY_SET_VALUE`, and :const:`KEY_CREATE_SUB_KEY` access rights.
ru: Сочетает права доступа STANDARD_RIGHTS_WRITE, :const:`KEY_SET_VALUE` и :const:`KEY_CREATE_SUB_KEY`.
uk: Поєднує права доступу STANDARD_RIGHTS_WRITE, :const:`KEY_SET_VALUE` і :const:`KEY_CREATE_SUB_KEY`.

source: Combines the STANDARD_RIGHTS_READ, :const:`KEY_QUERY_VALUE`, :const:`KEY_ENUMERATE_SUB_KEYS`, and :const:`KEY_NOTIFY` values.
ru: Объединяет значения STANDARD_RIGHTS_READ, :const:`KEY_QUERY_VALUE`, :const:`KEY_ENUMERATE_SUB_KEYS` и :const:`KEY_NOTIFY`.
uk: Поєднує значення STANDARD_RIGHTS_READ, :const:`KEY_QUERY_VALUE`, :const:`KEY_ENUMERATE_SUB_KEYS` і :const:`KEY_NOTIFY`.

source: Equivalent to :const:`KEY_READ`.
ru: Эквивалент :const:`KEY_READ`.
uk: Еквівалент :const:`KEY_READ`.

source: Required to query the values of a registry key.
ru: Требуется для запроса значений ключа реестра.
uk: Необхідний для запиту значень розділу реєстру.

source: Required to create, delete, or set a registry value.
ru: Требуется для создания, удаления или установки значения реестра.
uk: Необхідний для створення, видалення або встановлення значення реєстру.

source: Required to create a subkey of a registry key.
ru: Требуется для создания подраздела раздела реестра.
uk: Необхідний для створення підрозділу розділу реєстру.

source: Required to enumerate the subkeys of a registry key.
ru: Требуется для перечисления подразделов раздела реестра.
uk: Необхідний для перерахування підрозділів розділу реєстру.

source: Required to request change notifications for a registry key or for subkeys of a registry key.
ru: Требуется для запроса уведомлений об изменении раздела реестра или подразделов раздела реестра.
uk: Необхідний для запиту сповіщень про зміни для розділу реєстру або для підрозділів розділу реєстру.

source: Reserved for system use.
ru: Зарезервировано для использования системой.
uk: Зарезервовано для системного використання.

source: 64-bit Specific
ru: 64-битная специфика
uk: Спеціально для 64-біт

source: For more information, see `Accessing an Alternate Registry View <https://msdn.microsoft.com/en-us/library/aa384129(v=VS.85).aspx>`__.
ru: Дополнительные сведения см. в разделе «Доступ к альтернативному представлению реестра <https://msdn.microsoft.com/en-us/library/aa384129(v=VS.85).aspx>»__.
uk: Для отримання додаткової інформації див. `Доступ до альтернативного подання реєстру <https://msdn.microsoft.com/en-us/library/aa384129(v=VS.85).aspx>`__.

source: Indicates that an application on 64-bit Windows should operate on the 64-bit registry view.
uk: Вказує на те, що програма в 64-розрядній ОС Windows повинна працювати в 64-розрядному поданні реєстру.

source: Indicates that an application on 64-bit Windows should operate on the 32-bit registry view.
uk: Вказує на те, що програма в 64-розрядній ОС Windows повинна працювати в 32-розрядному поданні реєстру.

source: Value Types
ru: Типы значений
uk: Типи значень

source: For more information, see `Registry Value Types <https://msdn.microsoft.com/en-us/library/ms724884%28v=VS.85%29.aspx>`__.
ru: Дополнительные сведения см. в разделе `Типы значений реестра <https://msdn.microsoft.com/en-us/library/ms724884%28v=VS.85%29.aspx>`__.
uk: Щоб отримати додаткові відомості, перегляньте `Типи значень реєстру <https://msdn.microsoft.com/en-us/library/ms724884%28v=VS.85%29.aspx>`__.

source: Binary data in any form.
ru: Двоичные данные в любой форме.
uk: Двійкові дані в довільній формі.

source: 32-bit number.
ru: 32-битное число.
uk: 32-розрядне число.

source: A 32-bit number in little-endian format. Equivalent to :const:`REG_DWORD`.
ru: 32-битное число в формате с прямым порядком байтов. Эквивалентно :const:`REG_DWORD`.
uk: 32-розрядне число у форматі little-endian. Еквівалент :const:`REG_DWORD`.

source: A 32-bit number in big-endian format.
ru: 32-битное число в формате с обратным порядком байтов.
uk: 32-розрядне число у форматі старшого порядку.

source: Null-terminated string containing references to environment variables (``%PATH%``).
ru: Строка с нулевым завершением, содержащая ссылки на переменные среды (``%PATH%``).
uk: Рядок із нульовим завершенням, що містить посилання на змінні середовища (``%PATH%``).

source: A Unicode symbolic link.
ru: Символическая ссылка Unicode.
uk: Символьне посилання Unicode.

source: A sequence of null-terminated strings, terminated by two null characters. (Python handles this termination automatically.)
ru: Последовательность строк с нулевым символом в конце, завершающаяся двумя нулевыми символами. (Python обрабатывает это завершение автоматически.)
uk: Послідовність рядків із закінченням нулем, що завершується двома символами нуль. (Python обробляє це завершення автоматично.)

source: No defined value type.
ru: Нет определенного типа значения.
uk: Немає визначеного типу значення.

source: A 64-bit number.
ru: 64-битное число.
uk: 64-розрядне число.

source: A 64-bit number in little-endian format. Equivalent to :const:`REG_QWORD`.
ru: 64-битное число в формате с прямым порядком байтов. Эквивалентно :const:`REG_QWORD`.
uk: 64-розрядне число у форматі little-endian. Еквівалент :const:`REG_QWORD`.

source: A device-driver resource list.
ru: Список ресурсов драйвера устройства.
uk: Список ресурсів драйверів пристроїв.

source: A hardware setting.
ru: Настройка оборудования.
uk: Налаштування обладнання.

source: A hardware resource list.
ru: Список аппаратных ресурсов.
uk: Список апаратних ресурсів.

source: A null-terminated string.
ru: Нуль-терминированная строка.
uk: Рядок із закінченням нулем.

source: Registry Handle Objects
ru: Объекты управления реестром
uk: Об’єкти обробки реєстру
