Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/winreg.po
Languages: ru, uk

source: :mod:`winreg` --- Windows registry access
uk: :mod:`winreg` --- доступ до реєстру Windows

source: These functions expose the Windows registry API to Python. Instead of using an integer as the registry handle, a :ref:`handle object <handle-object>` is used to ensure that the handles are closed correctly, even if the programmer neglects to explicitly close them.
ru: Эти функции предоставляют Python API реестра Windows. Вместо целого числа в качестве дескриптора реестра используется :ref:`handle object <handle-object>`, чтобы гарантировать правильное закрытие дескрипторов, даже если программист пренебрегает их явным закрытием.
uk: Ці функції надають Python API реєстру Windows. Замість використання цілого числа як дескриптора реєстру :ref:`об’єкт дескриптора <handle-object>` використовується для забезпечення правильного закриття дескрипторів, навіть якщо програміст нехтує їх явним закриттям.

source: Several functions in this module used to raise a :exc:`WindowsError`, which is now an alias of :exc:`OSError`.
ru: Несколько функций в этом модуле раньше вызывали ошибку :exc:`WindowsError`, которая теперь является псевдонимом :exc:`OSError`.
uk: Кілька функцій у цьому модулі викликали помилку :exc:`WindowsError`, яка тепер є псевдонімом :exc:`OSError`.

source: Functions
ru: Функции
uk: Функції

source: This module offers the following functions:
ru: Этот модуль предлагает следующие функции:
uk: Цей модуль пропонує такі функції:

source: Closes a previously opened registry key. The *hkey* argument specifies a previously opened key.
ru: Закрывает ранее открытый раздел реестра. Аргумент *hkey* указывает ранее открытый ключ.
uk: Закриває раніше відкритий розділ реєстру. Аргумент *hkey* визначає раніше відкритий ключ.

source: If *hkey* is not closed using this method (or via :meth:`hkey.Close() <PyHKEY.Close>`), it is closed when the *hkey* object is destroyed by Python.
ru: Если *hkey* не закрывается с помощью этого метода (или с помощью :meth:`hkey.Close() <PyHKEY.Close>`), он закрывается, когда объект *hkey* уничтожается Python.
uk: Якщо *hkey* не закривається за допомогою цього методу (або через :meth:`hkey.Close() <PyHKEY.Close>`), він закривається, коли об’єкт *hkey* знищується Python.

source: Establishes a connection to a predefined registry handle on another computer, and returns a :ref:`handle object <handle-object>`.
ru: Устанавливает соединение с предопределенным дескриптором реестра на другом компьютере и возвращает объект :ref:`handle <handle-object>`.
uk: Встановлює підключення до попередньо визначеного дескриптора реєстру на іншому комп’ютері та повертає :ref:`об’єкт дескриптора <handle-object>`.

source: *computer_name* is the name of the remote computer, of the form ``r"\\computername"``. If ``None``, the local computer is used.
ru: *имя_компьютера* — это имя удаленного компьютера в форме ``r"\\имя_компьютера"``. Если «Нет», используется локальный компьютер.
uk: *ім’я_комп’ютера* — це ім’я віддаленого комп’ютера у формі ``r"\\ім’я комп’ютера``. Якщо ``None``, використовується локальний комп’ютер.

source: *key* is the predefined handle to connect to.
ru: *key* — это предопределенный дескриптор для подключения.
uk: *key* — це попередньо визначений маркер для підключення.

source: The return value is the handle of the opened key. If the function fails, an :exc:`OSError` exception is raised.
ru: Возвращаемое значение — это дескриптор открытого ключа. Если функция завершается сбоем, возникает исключение :exc:`OSError`.
uk: Поверненим значенням є дескриптор відкритого ключа. Якщо функція не виконується, виникає виняток :exc:`OSError`.

source: Raises an :ref:`auditing event <auditing>` ``winreg.ConnectRegistry`` with arguments ``computer_name``, ``key``.
ru: Вызывает :ref:`событие аудита <auditing>` ``winreg.ConnectRegistry`` с аргументами ``имя_компьютера``, ``ключ``.
uk: Викликає :ref:`подію аудиту <auditing>` ``winreg.ConnectRegistry`` з аргументами ``computer_name``, ``key``.

source: See :ref:`above <exception-changed>`.
ru: См. :ref:`above <exception-changed>`.
uk: Дивіться :ref:`вище <exception-changed>`.

source: Creates or opens the specified key, returning a :ref:`handle object <handle-object>`.
ru: Создает или открывает указанный ключ, возвращая :ref:`дескриптор объекта <handle-object>`.
uk: Створює або відкриває вказаний ключ, повертаючи :ref:`об’єкт дескриптора <handle-object>`.

source: *key* is an already open key, or one of the predefined :ref:`HKEY_* constants <hkey-constants>`.
ru: *key* — это уже открытый ключ или одна из предопределенных констант :ref:`HKEY_* <hkey-constants>`.
uk: *key* — це вже відкритий ключ або одна з попередньо визначених :ref:`HKEY_* констант <hkey-constants>`.

source: *sub_key* is a string that names the key this method opens or creates.
ru: *sub_key* — это строка, которая называет ключ, который открывает или создает этот метод.
uk: *sub_key* — це рядок, який називає ключ, який відкриває або створює цей метод.

source: If *key* is one of the predefined keys, *sub_key* may be ``None``. In that case, the handle returned is the same key handle passed in to the function.
ru: Если *key* является одним из предопределенных ключей, *sub_key* может быть ``None``. В этом случае возвращаемый дескриптор является тем же дескриптором ключа, который был передан в функцию.
uk: Якщо *key* є одним із попередньо визначених ключів, *sub_key* може мати значення ``None``. У цьому випадку повернутий дескриптор є тим самим дескриптором ключа, переданим у функцію.

source: If the key already exists, this function opens the existing key.
ru: Если ключ уже существует, эта функция открывает существующий ключ.
uk: Якщо ключ уже існує, ця функція відкриває наявний ключ.

source: Raises an :ref:`auditing event <auditing>` ``winreg.CreateKey`` with arguments ``key``, ``sub_key``, ``access``.
ru: Вызывает :ref:`событие аудита <auditing>` ``winreg.CreateKey`` с аргументами ``key``, ``sub_key``, ``access``.
uk: Викликає :ref:`подію аудиту <auditing>` ``winreg.CreateKey`` з аргументами ``key``, ``sub_key``, ``access``.

source: Raises an :ref:`auditing event <auditing>` ``winreg.OpenKey/result`` with argument ``key``.
ru: Вызывает :ref:`событие аудита <auditing>``winreg.OpenKey/result`` с аргументом ``key``.
uk: Викликає :ref:`подію аудиту <auditing>` ``winreg.OpenKey/result`` з аргументом ``key``.

source: *reserved* is a reserved integer, and must be zero. The default is zero.
ru: *reserved* — зарезервированное целое число, которое должно быть равно нулю. Значение по умолчанию — ноль.
uk: *reserved* є зарезервованим цілим числом і має дорівнювати нулю. За умовчанням дорівнює нулю.

source: *access* is an integer that specifies an access mask that describes the desired security access for the key. Default is :const:`KEY_WRITE`. See :ref:`Access Rights <access-rights>` for other allowed values.
ru: *access* — это целое число, определяющее маску доступа, описывающую желаемый безопасный доступ для ключа. По умолчанию используется :const:`KEY_WRITE`. См. :ref:`Access Rights <access-rights>` для получения информации о других допустимых значениях.
uk: *access* — це ціле число, що вказує маску доступу, яка описує бажаний доступ безпеки для ключа. Типовим є :const:`KEY_WRITE`. Перегляньте :ref:`Права доступу <access-rights>` для інших дозволених значень.

source: Deletes the specified key.
ru: Удаляет указанный ключ.
uk: Видаляє вказаний ключ.

source: *sub_key* is a string that must be a subkey of the key identified by the *key* parameter. This value must not be ``None``, and the key may not have subkeys.
ru: *sub_key* — это строка, которая должна быть подразделом ключа, определенного параметром *key*. Это значение не должно быть «Нет», и ключ не может иметь подразделов.
uk: *sub_key* – це рядок, який має бути підключем ключа, визначеного параметром *key*. Це значення не має бути ``None``, і ключ не може мати підключів.

source: *This method can not delete keys with subkeys.*
ru: *Этот метод не позволяет удалять ключи с подключами.*
uk: *Цей метод не може видалити ключі з підключами.*

source: If the method succeeds, the entire key, including all of its values, is removed. If the method fails, an :exc:`OSError` exception is raised.
ru: Если метод завершается успешно, весь ключ, включая все его значения, удаляется. Если метод завершается неудачей, возникает исключение :exc:`OSError`.
uk: Якщо метод завершується успішно, весь ключ, включаючи всі його значення, видаляється. Якщо метод не вдається, виникає виняток :exc:`OSError`.

source: Raises an :ref:`auditing event <auditing>` ``winreg.DeleteKey`` with arguments ``key``, ``sub_key``, ``access``.
ru: Вызывает :ref:`событие аудита <auditing>` ``winreg.DeleteKey`` с аргументами ``key``, ``sub_key``, ``access``.
uk: Викликає :ref:`подію аудиту <auditing>` ``winreg.DeleteKey`` з аргументами ``key``, ``sub_key``, ``access``.

source: The :func:`DeleteKeyEx` function is implemented with the RegDeleteKeyEx Windows API function, which is specific to 64-bit versions of Windows. See the `RegDeleteKeyEx documentation <https://msdn.microsoft.com/en-us/library/ms724847%28VS.85%29.aspx>`__.
uk: Функція :func:`DeleteKeyEx` реалізована за допомогою функції Windows API RegDeleteKeyEx, яка є специфічною для 64-розрядних версій Windows. Перегляньте `документацію RegDeleteKeyEx <https://msdn.microsoft.com/en-us/library/ms724847%28VS.85%29.aspx>`__.

source: *sub_key* is a string that must be a subkey of the key identified by the *key* parameter. This value must not be ``None``, and the key may not have subkeys.
ru: *sub_key* — это строка, которая должна быть подразделом ключа, определенного параметром *key*. Это значение не должно быть «Нет», и ключ не может иметь подразделов.
uk: *sub_key* – це рядок, який має бути підключем ключа, визначеного параметром *key*. Це значення не має бути ``None``, і ключ не може мати підключів.

source: *access* is an integer that specifies an access mask that describes the desired security access for the key. Default is :const:`KEY_WOW64_64KEY`. See :ref:`Access Rights <access-rights>` for other allowed values.
uk: *access* — це ціле число, що вказує маску доступу, яка описує бажаний доступ безпеки для ключа. Типовим є :const:`KEY_WOW64_64KEY`. Перегляньте :ref:`Права доступу <access-rights>` для інших дозволених значень.

source: On unsupported Windows versions, :exc:`NotImplementedError` is raised.
ru: В неподдерживаемых версиях Windows возникает :exc:`NotImplementedError`.
uk: У непідтримуваних версіях Windows виникає :exc:`NotImplementedError`.

source: Removes a named value from a registry key.
ru: Удаляет именованное значение из раздела реестра.
uk: Видаляє назване значення з розділу реєстру.

source: *value* is a string that identifies the value to remove.
ru: *значение* — это строка, определяющая значение, которое необходимо удалить.
uk: *value* — це рядок, який визначає значення, яке потрібно видалити.

source: Raises an :ref:`auditing event <auditing>` ``winreg.DeleteValue`` with arguments ``key``, ``value``.
ru: Вызывает :ref:`событие аудита <auditing>``winreg.DeleteValue`` с аргументами ``key``, ``value``.
uk: Викликає :ref:`подію аудиту <auditing>` ``winreg.DeleteValue`` з аргументами ``key``, ``value``.

source: Enumerates subkeys of an open registry key, returning a string.
ru: Перечисляет подразделы открытого раздела реестра, возвращая строку.
uk: Перераховує підрозділи відкритого ключа реєстру, повертаючи рядок.

source: *index* is an integer that identifies the index of the key to retrieve.
ru: *index* — целое число, определяющее индекс извлекаемого ключа.
uk: *index* — це ціле число, яке визначає індекс ключа, який потрібно отримати.

source: The function retrieves the name of one subkey each time it is called. It is typically called repeatedly until an :exc:`OSError` exception is raised, indicating, no more values are available.
ru: Функция извлекает имя одного подраздела при каждом вызове. Обычно он вызывается повторно до тех пор, пока не возникнет исключение :exc:`OSError`, указывающее, что больше нет доступных значений.
uk: Функція отримує ім'я одного підключа під час кожного виклику. Зазвичай він викликається неодноразово, доки не виникне виняток :exc:`OSError`, що вказує на відсутність більше доступних значень.

source: Raises an :ref:`auditing event <auditing>` ``winreg.EnumKey`` with arguments ``key``, ``index``.
ru: Вызывает :ref:`событие аудита <auditing>` ``winreg.EnumKey`` с аргументами ``key``, ``index``.
uk: Викликає :ref:`подію аудиту <auditing>` ``winreg.EnumKey`` з аргументами ``key``, ``index``.

source: Enumerates values of an open registry key, returning a tuple.
ru: Перечисляет значения открытого ключа реестра, возвращая кортеж.
uk: Перераховує значення відкритого ключа реєстру, повертаючи кортеж.

source: *index* is an integer that identifies the index of the value to retrieve.
ru: *index* — целое число, определяющее индекс извлекаемого значения.
uk: *index* — це ціле число, яке визначає індекс значення, яке потрібно отримати.

source: The function retrieves the name of one subkey each time it is called. It is typically called repeatedly, until an :exc:`OSError` exception is raised, indicating no more values.
ru: Функция извлекает имя одного подраздела при каждом вызове. Обычно он вызывается повторно, пока не возникнет исключение :exc:`OSError`, указывающее на отсутствие дополнительных значений.
uk: Функція отримує ім'я одного підключа під час кожного виклику. Зазвичай він викликається неодноразово, доки не буде викликано виняток :exc:`OSError`, що вказує на відсутність більше значень.

source: The result is a tuple of 3 items:
ru: В результате получается кортеж из трех элементов:
uk: Результатом є кортеж із 3 елементів:

source: Index
ru: Индекс
uk: Індекс

source: Meaning
ru: Значение
uk: Значення

source: A string that identifies the value name
ru: Строка, идентифицирующая имя значения.
uk: Рядок, який ідентифікує назву значення

source: An object that holds the value data, and whose type depends on the underlying registry type
ru: Объект, содержащий данные значения, тип которого зависит от базового типа реестра.
uk: Об’єкт, який містить дані значення, тип якого залежить від базового типу реєстру

source: An integer that identifies the type of the value data (see table in docs for :meth:`SetValueEx`)
ru: Целое число, которое идентифицирует тип данных значения (см. таблицу в документации для :meth:`SetValueEx`)
uk: Ціле число, яке визначає тип даних значення (див. таблицю в документах для :meth:`SetValueEx`)

source: Raises an :ref:`auditing event <auditing>` ``winreg.EnumValue`` with arguments ``key``, ``index``.
ru: Вызывает :ref:`событие аудита <auditing>` ``winreg.EnumValue`` с аргументами ``key``, ``index``.
uk: Викликає :ref:`подію аудиту <auditing>` ``winreg.EnumValue`` з аргументами ``key``, ``index``.

source: Expands environment variable placeholders ``%NAME%`` in strings like :const:`REG_EXPAND_SZ`::
ru: Расширяет заполнители переменных среды ``%NAME%`` в строки типа :const:`REG_EXPAND_SZ`::
uk: Розгортає заповнювачі змінної середовища ``%NAME%`` у рядках на зразок :const:`REG_EXPAND_SZ`::

source: Raises an :ref:`auditing event <auditing>` ``winreg.ExpandEnvironmentStrings`` with argument ``str``.
ru: Вызывает :ref:`событие аудита <auditing>``winreg.ExpandEnvironmentStrings`` с аргументом ``str``.
uk: Викликає :ref:`подію аудиту <auditing>` ``winreg.ExpandEnvironmentStrings`` з аргументом ``str``.

source: Writes all the attributes of a key to the registry.
ru: Записывает все атрибуты ключа в реестр.
uk: Записує всі атрибути ключа до реєстру.

source: It is not necessary to call :func:`FlushKey` to change a key. Registry changes are flushed to disk by the registry using its lazy flusher. Registry changes are also flushed to disk at system shutdown. Unlike :func:`CloseKey`, the :func:`FlushKey` method returns only when all the data has been written to the registry. An application should only call :func:`FlushKey` if it requires absolute certainty that registry changes are on disk.
ru: Нет необходимости вызывать :func:`FlushKey`, чтобы изменить ключ. Изменения реестра сбрасываются на диск реестром с помощью ленивой программы очистки. Изменения реестра также сбрасываются на диск при завершении работы системы. В отличие от :func:`CloseKey`, метод :func:`FlushKey` возвращает значение только тогда, когда все данные записаны в реестр. Приложению следует вызывать :func:`FlushKey` только в том случае, если ему требуется абсолютная уверенность в том, что изменения реестра находятся на диске.
uk: Щоб змінити ключ, не потрібно викликати :func:`FlushKey`. Зміни реєстру скидаються на диск реєстром за допомогою відкладеного очищувача. Зміни реєстру також скидаються на диск під час завершення роботи системи. На відміну від :func:`CloseKey`, метод :func:`FlushKey` повертається лише тоді, коли всі дані були записані до реєстру. Програма має викликати :func:`FlushKey`, лише якщо вона вимагає абсолютної впевненості, що зміни реєстру є на диску.

source: If you don't know whether a :func:`FlushKey` call is required, it probably isn't.
ru: Если вы не знаете, требуется ли вызов :func:`FlushKey`, возможно, это не так.
uk: Якщо ви не знаєте, чи потрібен виклик :func:`FlushKey`, можливо, ні.

source: Creates a subkey under the specified key and stores registration information from a specified file into that subkey.
ru: Создает подраздел под указанным ключом и сохраняет регистрационную информацию из указанного файла в этом подразделе.
uk: Створює підрозділ у вказаному розділі та зберігає реєстраційну інформацію з указаного файлу в цьому підрозділі.

source: *key* is a handle returned by :func:`ConnectRegistry` or one of the constants :const:`HKEY_USERS` or :const:`HKEY_LOCAL_MACHINE`.
ru: *key* — это дескриптор, возвращаемый :func:`ConnectRegistry` или одной из констант :const:`HKEY_USERS` или :const:`HKEY_LOCAL_MACHINE`.
uk: *key* — це дескриптор, який повертає :func:`ConnectRegistry` або одна з констант :const:`HKEY_USERS` або :const:`HKEY_LOCAL_MACHINE`.

source: *sub_key* is a string that identifies the subkey to load.
ru: *sub_key* — это строка, определяющая загружаемый подраздел.
uk: *sub_key* — це рядок, який визначає підключ для завантаження.

source: *file_name* is the name of the file to load registry data from. This file must have been created with the :func:`SaveKey` function. Under the file allocation table (FAT) file system, the filename may not have an extension.
ru: *имя_файла* — имя файла, из которого загружаются данные реестра. Этот файл должен быть создан с помощью функции :func:`SaveKey`. В файловой системе таблицы размещения файлов (FAT) имя файла может не иметь расширения.
uk: *ім’я_файлу* — це ім’я файлу, з якого потрібно завантажити дані реєстру. Цей файл має бути створено за допомогою функції :func:`SaveKey`. У файловій системі таблиці розподілу файлів (FAT) назва файлу може не мати розширення.

source: A call to :func:`LoadKey` fails if the calling process does not have the :const:`SE_RESTORE_PRIVILEGE` privilege. Note that privileges are different from permissions -- see the `RegLoadKey documentation <https://msdn.microsoft.com/en-us/library/ms724889%28v=VS.85%29.aspx>`__ for more details.
uk: Виклик :func:`LoadKey` завершується помилкою, якщо процес виклику не має привілею :const:`SE_RESTORE_PRIVILEGE`. Зауважте, що привілеї відрізняються від дозволів — див. `документацію RegLoadKey <https://msdn.microsoft.com/en-us/library/ms724889%28v=VS.85%29.aspx>`__ для отримання додаткової інформації.

source: If *key* is a handle returned by :func:`ConnectRegistry`, then the path specified in *file_name* is relative to the remote computer.
ru: Если *key* — это дескриптор, возвращаемый :func:`ConnectRegistry`, то путь, указанный в *file_name*, относится к удаленному компьютеру.
uk: Якщо *key* — це дескриптор, повернутий :func:`ConnectRegistry`, тоді шлях, указаний у *file_name*, є відносно віддаленого комп’ютера.

source: Raises an :ref:`auditing event <auditing>` ``winreg.LoadKey`` with arguments ``key``, ``sub_key``, ``file_name``.
ru: Вызывает :ref:`событие аудита <auditing>` ``winreg.LoadKey`` с аргументами ``key``, ``sub_key``, ``file_name``.
uk: Викликає :ref:`подію аудиту <auditing>` ``winreg.LoadKey`` з аргументами ``key``, ``sub_key``, ``file_name``.

source: Opens the specified key, returning a :ref:`handle object <handle-object>`.
ru: Открывает указанный ключ, возвращая :ref:`дескриптор объекта <handle-object>`.
uk: Відкриває вказаний ключ, повертаючи :ref:`об’єкт дескриптора <handle-object>`.

source: *sub_key* is a string that identifies the sub_key to open.
ru: *sub_key* — это строка, определяющая открываемый дополнительный_ключ.
uk: *sub_key* — це рядок, який визначає sub_key, який потрібно відкрити.

source: *reserved* is a reserved integer, and must be zero. The default is zero.
ru: *reserved* — зарезервированное целое число, которое должно быть равно нулю. Значение по умолчанию — ноль.
uk: *reserved* є зарезервованим цілим числом і має дорівнювати нулю. За умовчанням дорівнює нулю.

source: *access* is an integer that specifies an access mask that describes the desired security access for the key. Default is :const:`KEY_READ`. See :ref:`Access Rights <access-rights>` for other allowed values.
ru: *access* — это целое число, определяющее маску доступа, описывающую желаемый безопасный доступ для ключа. По умолчанию используется :const:`KEY_READ`. См. :ref:`Access Rights <access-rights>` для получения информации о других допустимых значениях.
uk: *access* — це ціле число, що вказує маску доступу, яка описує бажаний доступ безпеки для ключа. Типовим є :const:`KEY_READ`. Перегляньте :ref:`Права доступу <access-rights>` для інших дозволених значень.

source: The result is a new handle to the specified key.
ru: Результатом является новый дескриптор указанного ключа.
uk: Результатом є новий дескриптор зазначеного ключа.

source: If the function fails, :exc:`OSError` is raised.
ru: Если функция завершается неудачей, возникает :exc:`OSError`.
uk: Якщо функція не виконується, виникає :exc:`OSError`.

source: Raises an :ref:`auditing event <auditing>` ``winreg.OpenKey`` with arguments ``key``, ``sub_key``, ``access``.
ru: Вызывает :ref:`событие аудита <auditing>` ``winreg.OpenKey`` с аргументами ``key``, ``sub_key``, ``access``.
uk: Викликає :ref:`подію аудиту <auditing>` ``winreg.OpenKey`` з аргументами ``key``, ``sub_key``, ``access``.

source: Allow the use of named arguments.
ru: Разрешить использование именованных аргументов.
uk: Дозволити використання іменованих аргументів.

source: Returns information about a key, as a tuple.
ru: Возвращает информацию о ключе в виде кортежа.
uk: Повертає інформацію про ключ у вигляді кортежу.

source: An integer giving the number of sub keys this key has.
ru: Целое число, указывающее количество дополнительных ключей, которые имеет этот ключ.
uk: Ціле число, що вказує кількість підключів, які має цей ключ.

source: An integer giving the number of values this key has.
ru: Целое число, указывающее количество значений этого ключа.
uk: Ціле число, що вказує кількість значень, які має цей ключ.

source: An integer giving when the key was last modified (if available) as 100's of nanoseconds since Jan 1, 1601.
ru: Целое число, указывающее дату последнего изменения ключа (если доступно) в виде сотен наносекунд с 1 января 1601 года.
uk: Ціле число, яке вказує дату останньої зміни ключа (якщо доступно) як 100 наносекунд з 1 січня 1601 року.

source: Raises an :ref:`auditing event <auditing>` ``winreg.QueryInfoKey`` with argument ``key``.
ru: Вызывает :ref:`событие аудита <auditing>``winreg.QueryInfoKey`` с аргументом ``key``.
uk: Викликає :ref:`подію аудиту <auditing>` ``winreg.QueryInfoKey`` з аргументом ``key``.
