Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/winreg.po
Languages: ru, uk

source: This object wraps a Windows HKEY object, automatically closing it when the object is destroyed. To guarantee cleanup, you can call either the :meth:`~PyHKEY.Close` method on the object, or the :func:`CloseKey` function.
ru: Этот объект оборачивает объект Windows HKEY, автоматически закрывая его при уничтожении объекта. Чтобы гарантировать очистку, вы можете вызвать для объекта либо метод :meth:`~PyHKEY.Close`, либо функцию :func:`CloseKey`.
uk: Цей об’єкт огортає об’єкт HKEY Windows, автоматично закриваючи його, коли об’єкт знищується. Щоб гарантувати очищення, ви можете викликати або метод :meth:`~PyHKEY.Close` для об’єкта, або функцію :func:`CloseKey`.

source: All registry functions in this module return one of these objects.
ru: Все функции реестра в этом модуле возвращают один из этих объектов.
uk: Усі функції реєстру в цьому модулі повертають один із цих об’єктів.

source: All registry functions in this module which accept a handle object also accept an integer, however, use of the handle object is encouraged.
ru: Все функции реестра в этом модуле, которые принимают объект дескриптора, также принимают целое число, однако использование объекта дескриптора приветствуется.
uk: Усі функції реєстру в цьому модулі, які приймають об’єкт-дескриптор, також приймають ціле число, проте використання об’єкта-дескриптора заохочується.

source: Handle objects provide semantics for :meth:`__bool__` -- thus ::
uk: Об’єкти-дескриптори забезпечують семантику для :meth:`__bool__` -- таким чином:

source: will print ``Yes`` if the handle is currently valid (has not been closed or detached).
ru: напечатает ``Да``, если дескриптор в данный момент действителен (не был закрыт или отсоединен).
uk: надрукує ``Так``, якщо дескриптор наразі дійсний (не був закритий або від’єднаний).

source: The object also support comparison semantics, so handle objects will compare true if they both reference the same underlying Windows handle value.
ru: Объект также поддерживает семантику сравнения, поэтому объекты дескрипторов будут сравниваться с true, если они оба ссылаются на одно и то же базовое значение дескриптора Windows.
uk: Об’єкт також підтримує семантику порівняння, тому об’єкти-дескриптори порівнюватимуться як істинні, якщо вони обидва посилаються на одне базове значення маркера Windows.

source: Handle objects can be converted to an integer (e.g., using the built-in :func:`int` function), in which case the underlying Windows handle value is returned. You can also use the :meth:`~PyHKEY.Detach` method to return the integer handle, and also disconnect the Windows handle from the handle object.
ru: Объекты-дескрипторы можно преобразовать в целое число (например, с помощью встроенной функции :func:`int`), и в этом случае возвращается базовое значение дескриптора Windows. Вы также можете использовать метод :meth:`~PyHKEY.Detach` для возврата целочисленного дескриптора, а также отключить дескриптор Windows от объекта дескриптора.
uk: Об’єкти дескриптора можна перетворити на ціле число (наприклад, за допомогою вбудованої функції :func:`int`), у цьому випадку повертається базове значення дескриптора Windows. Ви також можете використати метод :meth:`~PyHKEY.Detach`, щоб повернути цілочисельний дескриптор, а також від’єднати дескриптор Windows від об’єкта дескриптора.

source: Closes the underlying Windows handle.
ru: Закрывает базовый дескриптор Windows.
uk: Закриває основний маркер Windows.

source: If the handle is already closed, no error is raised.
ru: Если дескриптор уже закрыт, ошибка не возникает.
uk: Якщо ручка вже закрита, помилка не виникає.

source: Detaches the Windows handle from the handle object.
ru: Отсоединяет дескриптор Windows от объекта дескриптора.
uk: Від’єднує маркер Windows від об’єкта маркера.

source: The result is an integer that holds the value of the handle before it is detached. If the handle is already detached or closed, this will return zero.
ru: Результатом является целое число, которое содержит значение дескриптора до его отсоединения. Если дескриптор уже отсоединен или закрыт, это вернет ноль.
uk: Результатом є ціле число, яке містить значення дескриптора до його від’єднання. Якщо ручка вже від'єднана або закрита, це поверне нуль.

source: After calling this function, the handle is effectively invalidated, but the handle is not closed. You would call this function when you need the underlying Win32 handle to exist beyond the lifetime of the handle object.
ru: После вызова этой функции дескриптор фактически становится недействительным, но не закрывается. Вы можете вызвать эту функцию, если вам нужно, чтобы базовый дескриптор Win32 существовал после времени существования объекта дескриптора.
uk: Після виклику цієї функції дескриптор фактично стає недійсним, але дескриптор не закривається. Ви можете викликати цю функцію, якщо вам потрібно, щоб основний дескриптор Win32 існував після закінчення терміну служби об’єкта дескриптора.

source: Raises an :ref:`auditing event <auditing>` ``winreg.PyHKEY.Detach`` with argument ``key``.
ru: Вызывает :ref:`событие аудита <auditing>``winreg.PyHKEY.Detach`` с аргументом ``key``.
uk: Викликає :ref:`подію аудиту <auditing>` ``winreg.PyHKEY.Detach`` з аргументом ``key``.

source: The HKEY object implements :meth:`~object.__enter__` and :meth:`~object.__exit__` and thus supports the context protocol for the :keyword:`with` statement::
ru: Объект HKEY реализует :meth:`~object.__enter__` и :meth:`~object.__exit__` и, таким образом, поддерживает протокол контекста для оператора :keyword:`with`::
uk: Об’єкт HKEY реалізує :meth:`~object.__enter__` і :meth:`~object.__exit__` і таким чином підтримує контекстний протокол для оператора :keyword:`with`::

source: will automatically close *key* when control leaves the :keyword:`with` block.
ru: автоматически закроет *key*, когда элемент управления покинет блок :keyword:`with`.
uk: автоматично закриє *key*, коли керування залишить блок :keyword:`with`.
