Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/xml.sax.handler.po
Languages: ru

source: :mod:`!xml.sax.handler` --- Base classes for SAX handlers
ru: :mod:`!xml.sax.handler` --- Базовые классы для обработчиков SAX

source: **Source code:** :source:`Lib/xml/sax/handler.py`
ru: **Исходный код:** :source:`Lib/xml/sax/handler.py`

source: The SAX API defines five kinds of handlers: content handlers, DTD handlers, error handlers, entity resolvers and lexical handlers. Applications normally only need to implement those interfaces whose events they are interested in; they can implement the interfaces in a single object or in multiple objects. Handler implementations should inherit from the base classes provided in the module :mod:`xml.sax.handler`, so that all methods get default implementations.
ru: SAX API определяет пять типов обработчиков: обработчики контента, обработчики DTD, обработчики ошибок, преобразователи сущностей и лексические обработчики. Приложениям обычно необходимо реализовать только те интерфейсы, события которых их интересуют; они могут реализовать интерфейсы в одном объекте или в нескольких объектах. Реализации обработчиков должны наследовать базовые классы, представленные в модуле :mod:`xml.sax.handler`, чтобы все методы получили реализации по умолчанию.

source: This is the main callback interface in SAX, and the one most important to applications. The order of events in this interface mirrors the order of the information in the document.
ru: Это основной интерфейс обратного вызова в SAX, наиболее важный для приложений. Порядок событий в этом интерфейсе отражает порядок информации в документе.

source: Handle DTD events.
ru: Обработка событий DTD.

source: This interface specifies only those DTD events required for basic parsing (unparsed entities and attributes).
ru: Этот интерфейс определяет только те события DTD, которые необходимы для базового анализа (неанализируемые сущности и атрибуты).

source: Basic interface for resolving entities. If you create an object implementing this interface, then register the object with your Parser, the parser will call the method in your object to resolve all external entities.
ru: Базовый интерфейс для разрешения сущностей. Если вы создадите объект, реализующий этот интерфейс, а затем зарегистрируете объект в своем парсере, синтаксический анализатор вызовет метод вашего объекта для разрешения всех внешних объектов.

source: Interface used by the parser to present error and warning messages to the application. The methods of this object control whether errors are immediately converted to exceptions or are handled in some other way.
ru: Интерфейс, используемый анализатором для представления приложению сообщений об ошибках и предупреждений. Методы этого объекта контролируют, будут ли ошибки немедленно преобразовываться в исключения или обрабатываться каким-либо другим способом.

source: Interface used by the parser to represent low frequency events which may not be of interest to many applications.
ru: Интерфейс, используемый анализатором для представления низкочастотных событий, которые могут не представлять интереса для многих приложений.

source: In addition to these classes, :mod:`xml.sax.handler` provides symbolic constants for the feature and property names.
ru: онстанты

source: value: ``"http://xml.org/sax/features/namespaces"``
ru: Значение: ``"http://xml.org/sax/features/namespaces"``

source: true: Perform Namespace processing.
ru: true: выполнить обработку пространства имен.

source: false: Optionally do not perform Namespace processing (implies namespace-prefixes; default).
ru: false: опционально не выполнять обработку пространства имен (подразумеваются префиксы пространства имен; по умолчанию).

source: access: (parsing) read-only; (not parsing) read/write
ru: доступ: (парсинг) только чтение; (не анализировать) чтение/запись

source: value: ``"http://xml.org/sax/features/namespace-prefixes"``
ru: Значение: ``"http://xml.org/sax/features/namespace-prefixes"``

source: true: Report the original prefixed names and attributes used for Namespace declarations.
ru: true: сообщить исходные имена с префиксами и атрибуты, используемые для объявлений пространств имен.

source: false: Do not report attributes used for Namespace declarations, and optionally do not report original prefixed names (default).
ru: false: не сообщать атрибуты, используемые для объявлений пространства имен, и, при необходимости, не сообщать исходные имена с префиксом (по умолчанию).

source: value: ``"http://xml.org/sax/features/string-interning"``
ru: Значение: ``"http://xml.org/sax/features/string-interning"``

source: true: All element names, prefixes, attribute names, Namespace URIs, and local names are interned using the built-in intern function.
ru: true: все имена элементов, префиксы, имена атрибутов, URI пространства имен и локальные имена интернируются с помощью встроенной функции intern.

source: false: Names are not necessarily interned, although they may be (default).
ru: false: имена не обязательно интернируются, хотя могут быть (по умолчанию).

source: value: ``"http://xml.org/sax/features/validation"``
ru: Значение: ``"http://xml.org/sax/features/validation"``

source: true: Report all validation errors (implies external-general-entities and external-parameter-entities).
ru: true: сообщать обо всех ошибках проверки (подразумеваются внешние общие сущности и внешние сущности-параметры).

source: false: Do not report validation errors.
ru: false: не сообщать об ошибках проверки.

source: value: ``"http://xml.org/sax/features/external-general-entities"``
ru: Значение: ``"http://xml.org/sax/features/external-general-entities"``

source: true: Include all external general (text) entities.
ru: true: включить все внешние общие (текстовые) объекты.

source: false: Do not include external general entities.
ru: false: не включать внешние общие сущности.

source: value: ``"http://xml.org/sax/features/external-parameter-entities"``
ru: Значение: ``"http://xml.org/sax/features/external-parameter-entities"``

source: true: Include all external parameter entities, including the external DTD subset.
ru: true: включить все объекты внешних параметров, включая подмножество внешнего DTD.

source: false: Do not include any external parameter entities, even the external DTD subset.
ru: false: не включайте никакие внешние объекты параметров, даже подмножество внешнего DTD.

source: List of all features.
ru: Список всех функций.

source: value: ``"http://xml.org/sax/properties/lexical-handler"``
ru: Значение: ``"http://xml.org/sax/properties/lexical-handler"``

source: data type: xml.sax.handler.LexicalHandler (not supported in Python 2)
ru: тип данных: xml.sax.handler.LexicalHandler (не поддерживается в Python 2)

source: description: An optional extension handler for lexical events like comments.
ru: описание: дополнительный обработчик расширения для лексических событий, таких как комментарии.

source: access: read/write
ru: доступ: чтение/запись

source: value: ``"http://xml.org/sax/properties/declaration-handler"``
ru: Значение: ``"http://xml.org/sax/properties/declaration-handler"``

source: data type: xml.sax.sax2lib.DeclHandler (not supported in Python 2)
ru: тип данных: xml.sax.sax2lib.DeclHandler (не поддерживается в Python 2)

source: description: An optional extension handler for DTD-related events other than notations and unparsed entities.
ru: описание: Необязательный обработчик расширения для событий, связанных с DTD, кроме нотаций и неанализируемых сущностей.

source: value: ``"http://xml.org/sax/properties/dom-node"``
ru: Значение: ``"http://xml.org/sax/properties/dom-node"``

source: data type: org.w3c.dom.Node (not supported in Python 2)
ru: тип данных: org.w3c.dom.Node (не поддерживается в Python 2)

source: description: When parsing, the current DOM node being visited if this is a DOM iterator; when not parsing, the root DOM node for iteration.
ru: описание: при синтаксическом анализе посещаемый текущий узел DOM, если это итератор DOM; если не анализировать, корневой узел DOM для итерации.

source: value: ``"http://xml.org/sax/properties/xml-string"``
ru: Значение: ``"http://xml.org/sax/properties/xml-string"``

source: data type: Bytes
ru: тип данных: Байты

source: description: The literal string of characters that was the source for the current event.
ru: описание: буквальная строка символов, которая была источником текущего события.

source: access: read-only
ru: доступ: только для чтения

source: List of all known property names.
ru: Список всех известных названий свойств.

source: ContentHandler Objects
ru: Объекты ContentHandler

source: Users are expected to subclass :class:`ContentHandler` to support their application. The following methods are called by the parser on the appropriate events in the input document:
ru: Ожидается, что пользователи создадут подкласс :class:`ContentHandler` для поддержки своего приложения. Следующие методы вызываются парсером при соответствующих событиях во входном документе:

source: Called by the parser to give the application a locator for locating the origin of document events.
ru: Вызывается анализатором, чтобы предоставить приложению указатель для определения источника событий документа.

source: SAX parsers are strongly encouraged (though not absolutely required) to supply a locator: if it does so, it must supply the locator to the application by invoking this method before invoking any of the other methods in the DocumentHandler interface.
ru: Синтаксическим анализаторам SAX настоятельно рекомендуется (хотя и не обязательно) предоставлять локатор: в этом случае он должен предоставить локатор приложению, вызвав этот метод перед вызовом любого другого метода в интерфейсе DocumentHandler.

source: The locator allows the application to determine the end position of any document-related event, even if the parser is not reporting an error. Typically, the application will use this information for reporting its own errors (such as character content that does not match an application's business rules). The information returned by the locator is probably not sufficient for use with a search engine.
ru: Локатор позволяет приложению определять конечную позицию любого события, связанного с документом, даже если анализатор не сообщает об ошибке. Обычно приложение использует эту информацию для сообщения о собственных ошибках (например, о символьном содержимом, не соответствующем бизнес-правилам приложения). Информации, возвращаемой локатором, вероятно, недостаточно для использования поисковой системой.

source: Note that the locator will return correct information only during the invocation of the events in this interface. The application should not attempt to use it at any other time.
ru: Обратите внимание, что локатор вернет правильную информацию только во время вызова событий в этом интерфейсе. Приложение не должно пытаться использовать его в любое другое время.

source: Receive notification of the beginning of a document.
ru: Получите уведомление о начале документа.

source: The SAX parser will invoke this method only once, before any other methods in this interface or in DTDHandler (except for :meth:`setDocumentLocator`).
ru: Анализатор SAX вызовет этот метод только один раз, перед любыми другими методами в этом интерфейсе или в DTDHandler (за исключением :meth:`setDocumentLocator`).

source: Receive notification of the end of a document.
ru: Получите уведомление об окончании документа.

source: The SAX parser will invoke this method only once, and it will be the last method invoked during the parse. The parser shall not invoke this method until it has either abandoned parsing (because of an unrecoverable error) or reached the end of input.
ru: Анализатор SAX вызовет этот метод только один раз, и это будет последний метод, вызываемый во время анализа. Анализатор не должен вызывать этот метод до тех пор, пока он не прекратит анализ (из-за неисправимой ошибки) или не достигнет конца ввода.

source: Begin the scope of a prefix-URI Namespace mapping.
ru: Начало области сопоставления пространства имен префикса-URI.

source: The information from this event is not necessary for normal Namespace processing: the SAX XML reader will automatically replace prefixes for element and attribute names when the ``feature_namespaces`` feature is enabled (the default).
ru: Информация из этого события не требуется для обычной обработки пространства имен: средство чтения XML SAX автоматически заменит префиксы для имен элементов и атрибутов, когда функция Feature_namespaces включена (по умолчанию).

source: There are cases, however, when applications need to use prefixes in character data or in attribute values, where they cannot safely be expanded automatically; the :meth:`startPrefixMapping` and :meth:`endPrefixMapping` events supply the information to the application to expand prefixes in those contexts itself, if necessary.
ru: Однако бывают случаи, когда приложениям необходимо использовать префиксы в символьных данных или значениях атрибутов, где их невозможно безопасно автоматически расширить; События :meth:`startPrefixMapping` и :meth:`endPrefixMapping` предоставляют приложению информацию для расширения префиксов в этих контекстах, если это необходимо.

source: Note that :meth:`startPrefixMapping` and :meth:`endPrefixMapping` events are not guaranteed to be properly nested relative to each-other: all :meth:`startPrefixMapping` events will occur before the corresponding :meth:`startElement` event, and all :meth:`endPrefixMapping` events will occur after the corresponding :meth:`endElement` event, but their order is not guaranteed.
ru: Обратите внимание, что события :meth:`startPrefixMapping` и :meth:`endPrefixMapping` не гарантируют, что они будут правильно вложены друг относительно друга: все события :meth:`startPrefixMapping` будут происходить до соответствующего события :meth:`startElement`, и все события :meth:`endPrefixMapping` произойдут после соответствующего события :meth:`endElement`, но их порядок не гарантирован.

source: End the scope of a prefix-URI mapping.
ru: Завершите область сопоставления префикса-URI.

source: See :meth:`startPrefixMapping` for details. This event will always occur after the corresponding :meth:`endElement` event, but the order of :meth:`endPrefixMapping` events is not otherwise guaranteed.
ru: Подробности смотрите в :meth:`startPrefixMapping`. Это событие всегда будет происходить после соответствующего события :meth:`endElement`, но порядок событий :meth:`endPrefixMapping` в противном случае не гарантируется.

source: Signals the start of an element in non-namespace mode.
ru: Сигнализирует о начале элемента в режиме без пространства имен.

source: The *name* parameter contains the raw XML 1.0 name of the element type as a string and the *attrs* parameter holds an object of the :class:`~xml.sax.xmlreader.Attributes` interface (see :ref:`attributes-objects`) containing the attributes of the element. The object passed as *attrs* may be re-used by the parser; holding on to a reference to it is not a reliable way to keep a copy of the attributes. To keep a copy of the attributes, use the :meth:`copy` method of the *attrs* object.
ru: Параметр *name* содержит необработанное имя типа элемента XML 1.0 в виде строки, а параметр *attrs* содержит объект интерфейса :class:`~xml.sax.xmlreader.Attributes` (см. :ref:`attributes). -objects`), содержащий атрибуты элемента. Объект, переданный как *attrs*, может быть повторно использован анализатором; сохранение ссылки на него не является надежным способом сохранить копию атрибутов. Чтобы сохранить копию атрибутов, используйте метод :meth:`copy` объекта *attrs*.

source: Signals the end of an element in non-namespace mode.
ru: Сигнализирует об окончании элемента в режиме без пространства имен.

source: The *name* parameter contains the name of the element type, just as with the :meth:`startElement` event.
ru: Параметр *name* содержит имя типа элемента, как и в случае с событием :meth:`startElement`.

source: Signals the start of an element in namespace mode.
ru: Сигнализирует начало элемента в режиме пространства имен.

source: The *name* parameter contains the name of the element type as a ``(uri, localname)`` tuple, the *qname* parameter contains the raw XML 1.0 name used in the source document, and the *attrs* parameter holds an instance of the :class:`~xml.sax.xmlreader.AttributesNS` interface (see :ref:`attributes-ns-objects`) containing the attributes of the element. If no namespace is associated with the element, the *uri* component of *name* will be ``None``. The object passed as *attrs* may be re-used by the parser; holding on to a reference to it is not a reliable way to keep a copy of the attributes. To keep a copy of the attributes, use the :meth:`copy` method of the *attrs* object.
ru: Параметр *name* содержит имя типа элемента в виде кортежа ``(uri, localname)``, параметр *qname* содержит необработанное имя XML 1.0, используемое в исходном документе, а параметр *attrs* содержит экземпляр интерфейса :class:`~xml.sax.xmlreader.AttributesNS` (см. :ref:`attributes-ns-objects`), содержащий атрибуты элемента. Если с элементом не связано никакое пространство имен, компонент *uri* *name* будет иметь значение «None». Объект, переданный как *attrs*, может быть повторно использован анализатором; сохранение ссылки на него не является надежным способом сохранить копию атрибутов. Чтобы сохранить копию атрибутов, используйте метод :meth:`copy` объекта *attrs*.

source: Parsers may set the *qname* parameter to ``None``, unless the ``feature_namespace_prefixes`` feature is activated.
ru: Парсеры могут установить для параметра *qname* значение None, если не активирована функция Feature_namespace_prefixes.

source: Signals the end of an element in namespace mode.
ru: Сигнализирует об окончании элемента в режиме пространства имен.

source: The *name* parameter contains the name of the element type, just as with the :meth:`startElementNS` method, likewise the *qname* parameter.
ru: Параметр *name* содержит имя типа элемента, как и в случае с методом :meth:`startElementNS`, а также параметр *qname*.

source: Receive notification of character data.
ru: Получите уведомление о данных персонажа.

source: The Parser will call this method to report each chunk of character data. SAX parsers may return all contiguous character data in a single chunk, or they may split it into several chunks; however, all of the characters in any single event must come from the same external entity so that the Locator provides useful information.
ru: Парсер вызовет этот метод, чтобы сообщить о каждом фрагменте символьных данных. Анализаторы SAX могут возвращать все смежные символьные данные в одном фрагменте или разбивать их на несколько фрагментов; однако все символы в любом отдельном событии должны происходить из одного и того же внешнего объекта, чтобы локатор предоставлял полезную информацию.

source: *content* may be a string or bytes instance; the ``expat`` reader module always produces strings.
ru: *content* может быть экземпляром строки или байтов; модуль чтения ``expat`` всегда создает строки.

source: The earlier SAX 1 interface provided by the Python XML Special Interest Group used a more Java-like interface for this method. Since most parsers used from Python did not take advantage of the older interface, the simpler signature was chosen to replace it. To convert old code to the new interface, use *content* instead of slicing content with the old *offset* and *length* parameters.
ru: В более раннем интерфейсе SAX 1, предоставленном специальной группой по интересам Python XML, для этого метода использовался более похожий на Java интерфейс. Поскольку большинство парсеров, используемых из Python, не использовали преимущества старого интерфейса, для его замены была выбрана более простая сигнатура. Чтобы преобразовать старый код в новый интерфейс, используйте *content* вместо нарезки содержимого со старыми параметрами *offset* и *length*.

source: Receive notification of ignorable whitespace in element content.
ru: Получите уведомление об игнорируемых пробелах в содержимом элемента.

source: Validating Parsers must use this method to report each chunk of ignorable whitespace (see the W3C XML 1.0 recommendation, section 2.10): non-validating parsers may also use this method if they are capable of parsing and using content models.
ru: Проверяющие парсеры должны использовать этот метод для сообщения о каждом куске игнорируемых пробелов (см. рекомендацию W3C XML 1.0, раздел 2.10): непроверяющие парсеры также могут использовать этот метод, если они способны анализировать и использовать модели контента.

source: SAX parsers may return all contiguous whitespace in a single chunk, or they may split it into several chunks; however, all of the characters in any single event must come from the same external entity, so that the Locator provides useful information.
ru: Парсеры SAX могут возвращать все смежные пробелы в одном фрагменте или разбивать его на несколько фрагментов; однако все символы в любом отдельном событии должны происходить от одного и того же внешнего объекта, чтобы локатор предоставлял полезную информацию.

source: Receive notification of a processing instruction.
ru: Получите уведомление об инструкции по обработке.

source: The Parser will invoke this method once for each processing instruction found: note that processing instructions may occur before or after the main document element.
ru: Анализатор будет вызывать этот метод один раз для каждой найденной инструкции обработки: обратите внимание, что инструкции обработки могут появляться до или после основного элемента документа.

source: A SAX parser should never report an XML declaration (XML 1.0, section 2.8) or a text declaration (XML 1.0, section 4.3.1) using this method.
ru: Анализатор SAX никогда не должен сообщать об объявлении XML (XML 1.0, раздел 2.8) или текстовом объявлении (XML 1.0, раздел 4.3.1), используя этот метод.

source: Receive notification of a skipped entity.
ru: Получите уведомление о пропущенном объекте.

source: The Parser will invoke this method once for each entity skipped. Non-validating processors may skip entities if they have not seen the declarations (because, for example, the entity was declared in an external DTD subset). All processors may skip external entities, depending on the values of the ``feature_external_ges`` and the ``feature_external_pes`` properties.
ru: Парсер будет вызывать этот метод один раз для каждого пропущенного объекта. Непроверяющие процессоры могут пропускать сущности, если они не видели объявлений (например, потому что сущность была объявлена ​​во внешнем подмножестве DTD). Все процессоры могут пропускать внешние объекты, в зависимости от значений свойств Feature_external_ges и Feature_external_pes.

source: DTDHandler Objects
ru: Объекты DTDHandler

source: :class:`DTDHandler` instances provide the following methods:
ru: Экземпляры :class:`DTDHandler` предоставляют следующие методы:

source: Handle a notation declaration event.
ru: Обработка события объявления нотации.

source: Handle an unparsed entity declaration event.
ru: Обработка события объявления неразобранного объекта.

source: EntityResolver Objects
ru: Объекты EntityResolver

source: Resolve the system identifier of an entity and return either the system identifier to read from as a string, or an InputSource to read from. The default implementation returns *systemId*.
ru: Разрешите системный идентификатор сущности и верните либо системный идентификатор для чтения в виде строки, либо источник ввода для чтения. Реализация по умолчанию возвращает *systemId*.

source: ErrorHandler Objects
ru: Объекты ErrorHandler
