Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/xml.sax.handler.po
Languages: ru

source: Objects with this interface are used to receive error and warning information from the :class:`~xml.sax.xmlreader.XMLReader`. If you create an object that implements this interface, then register the object with your :class:`~xml.sax.xmlreader.XMLReader`, the parser will call the methods in your object to report all warnings and errors. There are three levels of errors available: warnings, (possibly) recoverable errors, and unrecoverable errors. All methods take a :exc:`~xml.sax.SAXParseException` as the only parameter. Errors and warnings may be converted to an exception by raising the passed-in exception object.
ru: Объекты с этим интерфейсом используются для получения информации об ошибках и предупреждениях от :class:`~xml.sax.xmlreader.XMLReader`. Если вы создадите объект, реализующий этот интерфейс, а затем зарегистрируете его в своем :class:`~xml.sax.xmlreader.XMLReader`, синтаксический анализатор вызовет методы вашего объекта, чтобы сообщить обо всех предупреждениях и ошибках. Доступны три уровня ошибок: предупреждения, (возможно) исправимые ошибки и неисправимые ошибки. Все методы принимают :exc:`~xml.sax.SAXParseException` в качестве единственного параметра. Ошибки и предупреждения могут быть преобразованы в исключение путем вызова переданного объекта исключения.

source: Called when the parser encounters a recoverable error. If this method does not raise an exception, parsing may continue, but further document information should not be expected by the application. Allowing the parser to continue may allow additional errors to be discovered in the input document.
ru: Вызывается, когда анализатор обнаруживает устранимую ошибку. Если этот метод не вызывает исключение, синтаксический анализ может продолжаться, но приложению не следует ожидать дополнительной информации о документе. Разрешение синтаксическому анализатору продолжить работу может позволить обнаружить дополнительные ошибки во входном документе.

source: Called when the parser encounters an error it cannot recover from; parsing is expected to terminate when this method returns.
ru: Вызывается, когда синтаксический анализатор обнаруживает ошибку, которую он не может исправить; Ожидается, что синтаксический анализ завершится, когда этот метод вернется.

source: Called when the parser presents minor warning information to the application. Parsing is expected to continue when this method returns, and document information will continue to be passed to the application. Raising an exception in this method will cause parsing to end.
ru: Вызывается, когда анализатор предоставляет приложению второстепенную предупреждающую информацию. Ожидается, что анализ продолжится, когда этот метод вернется, и информация о документе будет продолжать передаваться в приложение. Вызов исключения в этом методе приведет к завершению синтаксического анализа.

source: LexicalHandler Objects
ru: Объекты LexicalHandler

source: Optional SAX2 handler for lexical events.
ru: Дополнительный обработчик SAX2 для лексических событий.

source: This handler is used to obtain lexical information about an XML document. Lexical information includes information describing the document encoding used and XML comments embedded in the document, as well as section boundaries for the DTD and for any CDATA sections. The lexical handlers are used in the same manner as content handlers.
ru: Этот обработчик используется для получения лексической информации о XML-документе. Лексическая информация включает в себя информацию, описывающую используемую кодировку документа и комментарии XML, встроенные в документ, а также границы разделов для DTD и любых разделов CDATA. Лексические обработчики используются так же, как и обработчики контента.

source: Set the LexicalHandler of an XMLReader by using the setProperty method with the property identifier ``'http://xml.org/sax/properties/lexical-handler'``.
ru: Установите LexicalHandler XMLReader с помощью метода setProperty с идентификатором свойства http://xml.org/sax/properties/lexical-handler.

source: Reports a comment anywhere in the document (including the DTD and outside the document element).
ru: Сообщает о комментарии в любом месте документа (включая DTD и вне элемента документа).

source: Reports the start of the DTD declarations if the document has an associated DTD.
ru: Сообщает о начале объявлений DTD, если документ имеет связанное DTD.

source: Reports the end of DTD declaration.
ru: Сообщает об окончании объявления DTD.

source: Reports the start of a CDATA marked section.
ru: Сообщает о начале раздела, отмеченного CDATA.

source: The contents of the CDATA marked section will be reported through the characters handler.
ru: Содержимое раздела, отмеченного CDATA, будет передано через обработчик символов.

source: Reports the end of a CDATA marked section.
ru: Сообщает об окончании раздела, отмеченного CDATA.
