Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/xml.sax.utils.po
Languages: ru

source: :mod:`!xml.sax.saxutils` --- SAX Utilities
ru: :mod:`!xml.sax.saxutils` --- Утилиты SAX

source: **Source code:** :source:`Lib/xml/sax/saxutils.py`
ru: **Исходный код:** :source:`Lib/xml/sax/saxutils.py`

source: The module :mod:`xml.sax.saxutils` contains a number of classes and functions that are commonly useful when creating SAX applications, either in direct use, or as base classes.
ru: Модуль :mod:`xml.sax.saxutils` содержит ряд классов и функций, которые обычно полезны при создании приложений SAX, как при непосредственном использовании, так и в качестве базовых классов.

source: Escape ``'&'``, ``'<'``, and ``'>'`` in a string of data.
ru: Экранируйте ``'&'``, ``'<'`` и ``'>'`` в строке данных.

source: You can escape other strings of data by passing a dictionary as the optional *entities* parameter. The keys and values must all be strings; each key will be replaced with its corresponding value. The characters ``'&'``, ``'<'`` and ``'>'`` are always escaped, even if *entities* is provided.
ru: Вы можете экранировать другие строки данных, передав словарь в качестве необязательного параметра *entities*. Все ключи и значения должны быть строками; каждый ключ будет заменен соответствующим значением. Символы ``'&'``, ``'<'`` и ``'>'`` всегда экранируются, даже если указаны *entities*.

source: This function should only be used to escape characters that can't be used directly in XML. Do not use this function as a general string translation function.
ru: Эту функцию следует использовать только для экранирования символов, которые нельзя использовать непосредственно в XML. Не используйте эту функцию как функцию общего перевода строк.

source: Unescape ``'&amp;'``, ``'&lt;'``, and ``'&gt;'`` in a string of data.
ru: Отменить экранирование ``'&amp;'``, ``'<'`` и ``'>'`` в строке данных.

source: You can unescape other strings of data by passing a dictionary as the optional *entities* parameter. The keys and values must all be strings; each key will be replaced with its corresponding value. ``'&amp'``, ``'&lt;'``, and ``'&gt;'`` are always unescaped, even if *entities* is provided.
ru: Вы можете отменить экранирование других строк данных, передав словарь в качестве необязательного параметра *entities*. Все ключи и значения должны быть строками; каждый ключ будет заменен соответствующим значением. ``'&amp'``, ``'<'`` и ``'>'`` всегда не экранируются, даже если указаны *entities*.

source: Similar to :func:`escape`, but also prepares *data* to be used as an attribute value. The return value is a quoted version of *data* with any additional required replacements. :func:`quoteattr` will select a quote character based on the content of *data*, attempting to avoid encoding any quote characters in the string. If both single- and double-quote characters are already in *data*, the double-quote characters will be encoded and *data* will be wrapped in double-quotes. The resulting string can be used directly as an attribute value::
ru: Аналогично :func:`escape`, но также подготавливает *данные* для использования в качестве значения атрибута. Возвращаемое значение представляет собой заключенную в кавычки версию *данных* со всеми необходимыми дополнительными заменами. :func:`quoteattr` выберет символ кавычки на основе содержимого *data*, пытаясь избежать кодирования символов кавычек в строке. Если символы как одинарных, так и двойных кавычек уже находятся в *data*, символы двойных кавычек будут закодированы, а *data* будут заключены в двойные кавычки. Полученную строку можно использовать непосредственно как значение атрибута:

source: This function is useful when generating attribute values for HTML or any SGML using the reference concrete syntax.
ru: Эта функция полезна при создании значений атрибутов для HTML или любого SGML с использованием ссылочного конкретного синтаксиса.

source: This class implements the :class:`~xml.sax.handler.ContentHandler` interface by writing SAX events back into an XML document. In other words, using an :class:`XMLGenerator` as the content handler will reproduce the original document being parsed. *out* should be a file-like object which will default to *sys.stdout*. *encoding* is the encoding of the output stream which defaults to ``'iso-8859-1'``. *short_empty_elements* controls the formatting of elements that contain no content: if ``False`` (the default) they are emitted as a pair of start/end tags, if set to ``True`` they are emitted as a single self-closed tag.
ru: Этот класс реализует интерфейс :class:`~xml.sax.handler.ContentHandler` путем записи событий SAX обратно в XML-документ. Другими словами, использование :class:`XMLGenerator` в качестве обработчика контента будет воспроизводить анализируемый исходный документ. *out* должен быть файлоподобным объектом, который по умолчанию будет иметь значение *sys.stdout*. *encoding* — это кодировка выходного потока, которая по умолчанию равна ``'iso-8859-1'``. *short_empty_elements* управляет форматированием элементов, не содержащих содержимого: если установлено значение «False» (по умолчанию), они создаются как пара начальных/конечных тегов, если установлено значение «True», они создаются как одиночный тег. -закрытый тег.

source: Added the *short_empty_elements* parameter.
ru: Добавлен параметр *short_empty_elements*.

source: This class is designed to sit between an :class:`~xml.sax.xmlreader.XMLReader` and the client application's event handlers. By default, it does nothing but pass requests up to the reader and events on to the handlers unmodified, but subclasses can override specific methods to modify the event stream or the configuration requests as they pass through.
ru: Этот класс предназначен для размещения между :class:`~xml.sax.xmlreader.XMLReader` и обработчиками событий клиентского приложения. По умолчанию он не делает ничего, кроме передачи запросов читателю и событий обработчикам без изменений, но подклассы могут переопределять определенные методы для изменения потока событий или запросов конфигурации по мере их прохождения.

source: This function takes an input source and an optional base URL and returns a fully resolved :class:`~xml.sax.xmlreader.InputSource` object ready for reading. The input source can be given as a string, a file-like object, or an :class:`~xml.sax.xmlreader.InputSource` object; parsers will use this function to implement the polymorphic *source* argument to their :meth:`~xml.sax.xmlreader.XMLReader.parse` method.
ru: Эта функция принимает источник входных данных и необязательный базовый URL-адрес и возвращает полностью разрешенный объект :class:`~xml.sax.xmlreader.InputSource`, готовый для чтения. Источник входных данных может быть задан как строка, файлоподобный объект или объект :class:`~xml.sax.xmlreader.InputSource`; синтаксические анализаторы будут использовать эту функцию для реализации полиморфного аргумента *source* в своем методе :meth:`~xml.sax.xmlreader.XMLReader.parse`.
