Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/library/xml.sax.po
Languages: ru

source: :mod:`!xml.sax` --- Support for SAX2 parsers
ru: :mod:`!xml.sax` --- Поддержка парсеров SAX2

source: **Source code:** :source:`Lib/xml/sax/__init__.py`
ru: **Исходный код:** :source:`Lib/xml/sax/__init__.py`

source: The :mod:`xml.sax` package provides a number of modules which implement the Simple API for XML (SAX) interface for Python. The package itself provides the SAX exceptions and the convenience functions which will be most used by users of the SAX API.
ru: Пакет :mod:`xml.sax` предоставляет ряд модулей, которые реализуют интерфейс Simple API for XML (SAX) для Python. Сам пакет предоставляет исключения SAX и удобные функции, которые будут наиболее часто использоваться пользователями SAX API.

source: The :mod:`xml.sax` module is not secure against maliciously constructed data. If you need to parse untrusted or unauthenticated data see :ref:`xml-vulnerabilities`.
ru: Модуль :mod:`xml.sax` не защищен от вредоносно созданных данных. Если вам нужно проанализировать ненадежные или неаутентифицированные данные, см. :ref:`xml-vulnerabilities`.

source: The SAX parser no longer processes general external entities by default to increase security. Before, the parser created network connections to fetch remote files or loaded local files from the file system for DTD and entities. The feature can be enabled again with method :meth:`~xml.sax.xmlreader.XMLReader.setFeature` on the parser object and argument :data:`~xml.sax.handler.feature_external_ges`.
ru: Синтаксический анализатор SAX больше не обрабатывает общие внешние объекты по умолчанию для повышения безопасности. Раньше анализатор создавал сетевые подключения для получения удаленных файлов или загружал локальные файлы из файловой системы для DTD и сущностей. Эту функцию можно снова включить с помощью метода :meth:`~xml.sax.xmlreader.XMLReader.setFeature` для объекта синтаксического анализатора и аргумента :data:`~xml.sax.handler.feature_external_ges`.

source: The convenience functions are:
ru: Удобные функции:

source: Create and return a SAX :class:`~xml.sax.xmlreader.XMLReader` object. The first parser found will be used. If *parser_list* is provided, it must be an iterable of strings which name modules that have a function named :func:`create_parser`. Modules listed in *parser_list* will be used before modules in the default list of parsers.
ru: Создайте и верните объект SAX :class:`~xml.sax.xmlreader.XMLReader`. Будет использован первый найденный парсер. Если указан *parser_list*, он должен быть итерацией строк, именующих модули, имеющие функцию с именем :func:`create_parser`. Модули, перечисленные в *parser_list*, будут использоваться перед модулями в списке парсеров по умолчанию.

source: The *parser_list* argument can be any iterable, not just a list.
ru: Аргумент *parser_list* может быть любым итерируемым объектом, а не только списком.

source: Create a SAX parser and use it to parse a document. The document, passed in as *filename_or_stream*, can be a filename or a file object. The *handler* parameter needs to be a SAX :class:`~handler.ContentHandler` instance. If *error_handler* is given, it must be a SAX :class:`~handler.ErrorHandler` instance; if omitted, :exc:`SAXParseException` will be raised on all errors. There is no return value; all work must be done by the *handler* passed in.
ru: Создайте парсер SAX и используйте его для анализа документа. Документ, передаваемый как *filename_or_stream*, может быть именем файла или файловым объектом. Параметр *handler* должен быть экземпляром SAX :class:`~handler.ContentHandler`. Если указан *error_handler*, это должен быть экземпляр SAX :class:`~handler.ErrorHandler`; если опущено, :exc:`SAXParseException` будет вызываться при всех ошибках. Возвращаемого значения нет; вся работа должна выполняться переданным *обработчиком*.

source: Similar to :func:`parse`, but parses from a buffer *string* received as a parameter. *string* must be a :class:`str` instance or a :term:`bytes-like object`.
ru: Аналогично :func:`parse`, но анализирует буферную *строку*, полученную в качестве параметра. *строка* должна быть экземпляром :class:`str` или :term:`байтоподобным объектом`.

source: Added support of :class:`str` instances.
ru: Добавлена ​​поддержка экземпляров :class:`str`.

source: A typical SAX application uses three kinds of objects: readers, handlers and input sources. "Reader" in this context is another term for parser, i.e. some piece of code that reads the bytes or characters from the input source, and produces a sequence of events. The events then get distributed to the handler objects, i.e. the reader invokes a method on the handler. A SAX application must therefore obtain a reader object, create or open the input sources, create the handlers, and connect these objects all together. As the final step of preparation, the reader is called to parse the input. During parsing, methods on the handler objects are called based on structural and syntactic events from the input data.
ru: Типичное приложение SAX использует три типа объектов: считыватели, обработчики и источники ввода. «Читатель» в этом контексте — это еще один термин для обозначения синтаксического анализатора, т. е. некоторого фрагмента кода, который считывает байты или символы из источника входных данных и создает последовательность событий. Затем события распределяются по объектам-обработчикам, т. е. читатель вызывает метод обработчика. Поэтому приложение SAX должно получить объект чтения, создать или открыть источники ввода, создать обработчики и соединить эти объекты вместе. На последнем этапе подготовки считыватель вызывается для анализа входных данных. Во время синтаксического анализа методы объектов-обработчиков вызываются на основе структурных и синтаксических событий из входных данных.

source: For these objects, only the interfaces are relevant; they are normally not instantiated by the application itself. Since Python does not have an explicit notion of interface, they are formally introduced as classes, but applications may use implementations which do not inherit from the provided classes. The :class:`~xml.sax.xmlreader.InputSource`, :class:`~xml.sax.xmlreader.Locator`, :class:`~xml.sax.xmlreader.Attributes`, :class:`~xml.sax.xmlreader.AttributesNS`, and :class:`~xml.sax.xmlreader.XMLReader` interfaces are defined in the module :mod:`xml.sax.xmlreader`. The handler interfaces are defined in :mod:`xml.sax.handler`. For convenience, :class:`~xml.sax.xmlreader.InputSource` (which is often instantiated directly) and the handler classes are also available from :mod:`xml.sax`. These interfaces are described below.
ru: Для этих объектов важны только интерфейсы; они обычно не создаются самим приложением. Поскольку в Python нет явного понятия интерфейса, они формально представлены как классы, но приложения могут использовать реализации, которые не наследуются от предоставленных классов. :class:`~xml.sax.xmlreader.InputSource`, :class:`~xml.sax.xmlreader.Locator`, :class:`~xml.sax.xmlreader.Attributes`, :class:`~xml. Интерфейсы sax.xmlreader.AttributesNS` и :class:`~xml.sax.xmlreader.XMLReader` определены в модуле :mod:`xml.sax.xmlreader`. Интерфейсы обработчика определены в :mod:`xml.sax.handler`. Для удобства :class:`~xml.sax.xmlreader.InputSource` (который часто создается напрямую) и классы-обработчики также доступны из :mod:`xml.sax`. Эти интерфейсы описаны ниже.

source: In addition to these classes, :mod:`xml.sax` provides the following exception classes.
ru: В дополнение к этим классам :mod:`xml.sax` предоставляет следующие классы исключений.

source: Encapsulate an XML error or warning. This class can contain basic error or warning information from either the XML parser or the application: it can be subclassed to provide additional functionality or to add localization. Note that although the handlers defined in the :class:`~xml.sax.handler.ErrorHandler` interface receive instances of this exception, it is not required to actually raise the exception --- it is also useful as a container for information.
ru: Инкапсулируйте ошибку или предупреждение XML. Этот класс может содержать базовую информацию об ошибках или предупреждениях либо от анализатора XML, либо от приложения: его можно разделить на подклассы, чтобы обеспечить дополнительную функциональность или добавить локализацию. Обратите внимание: хотя обработчики, определенные в интерфейсе :class:`~xml.sax.handler.ErrorHandler`, получают экземпляры этого исключения, фактически вызывать исключение не требуется --- оно также полезно в качестве контейнера для информации.

source: When instantiated, *msg* should be a human-readable description of the error. The optional *exception* parameter, if given, should be ``None`` or an exception that was caught by the parsing code and is being passed along as information.
ru: При создании экземпляра *msg* должно представлять собой удобочитаемое описание ошибки. Необязательный параметр *Exception*, если он указан, должен иметь значение None или исключение, которое было обнаружено кодом синтаксического анализа и передано в качестве информации.

source: This is the base class for the other SAX exception classes.
ru: Это базовый класс для других классов исключений SAX.

source: Subclass of :exc:`SAXException` raised on parse errors. Instances of this class are passed to the methods of the SAX :class:`~xml.sax.handler.ErrorHandler` interface to provide information about the parse error. This class supports the SAX :class:`~xml.sax.xmlreader.Locator` interface as well as the :class:`SAXException` interface.
ru: Подкласс :exc:`SAXException`, возникающий при ошибках синтаксического анализа. Экземпляры этого класса передаются методам интерфейса SAX :class:`~xml.sax.handler.ErrorHandler` для предоставления информации об ошибке синтаксического анализа. Этот класс поддерживает интерфейс SAX :class:`~xml.sax.xmlreader.Locator`, а также интерфейс :class:`SAXException`.

source: Subclass of :exc:`SAXException` raised when a SAX :class:`~xml.sax.xmlreader.XMLReader` is confronted with an unrecognized feature or property. SAX applications and extensions may use this class for similar purposes.
ru: Подкласс :exc:`SAXException` возникает, когда SAX :class:`~xml.sax.xmlreader.XMLReader` сталкивается с нераспознанной функцией или свойством. Приложения и расширения SAX могут использовать этот класс для аналогичных целей.

source: Subclass of :exc:`SAXException` raised when a SAX :class:`~xml.sax.xmlreader.XMLReader` is asked to enable a feature that is not supported, or to set a property to a value that the implementation does not support. SAX applications and extensions may use this class for similar purposes.
ru: Подкласс :exc:`SAXException` возникает, когда SAX :class:`~xml.sax.xmlreader.XMLReader` запрашивается для включения функции, которая не поддерживается, или для установки свойства в значение, которое не поддерживается реализацией. . Приложения и расширения SAX могут использовать этот класс для аналогичных целей.

source: `SAX: The Simple API for XML <http://www.saxproject.org/>`_
ru: `SAX: Простой API для XML <http://www.saxproject.org/>`_

source: This site is the focal point for the definition of the SAX API. It provides a Java implementation and online documentation. Links to implementations and historical information are also available.
ru: Этот сайт является центром определения API SAX. Он предоставляет реализацию Java и онлайн-документацию. Также доступны ссылки на реализации и историческую информацию.

source: Module :mod:`xml.sax.handler`
ru: Модуль :mod:`xml.sax.handler`

source: Definitions of the interfaces for application-provided objects.
ru: Определения интерфейсов для объектов, предоставляемых приложением.

source: Module :mod:`xml.sax.saxutils`
ru: Модуль :mod:`xml.sax.saxutils`

source: Convenience functions for use in SAX applications.
ru: Удобные функции для использования в приложениях SAX.

source: Module :mod:`xml.sax.xmlreader`
ru: Модуль :mod:`xml.sax.xmlreader`

source: Definitions of the interfaces for parser-provided objects.
ru: Определения интерфейсов для объектов, предоставляемых анализатором.

source: SAXException Objects
ru: Объекты SAXException

source: The :class:`SAXException` exception class supports the following methods:
ru: Класс исключений :class:`SAXException` поддерживает следующие методы:

source: Return a human-readable message describing the error condition.
ru: Возвращает удобочитаемое сообщение с описанием состояния ошибки.

source: Return an encapsulated exception object, or ``None``.
ru: Вернуть инкапсулированный объект исключения или None.
