Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/installing/index.po
Languages: es_es

source: Installing Python Modules
es_es: Instalación de módulos Python

source: Email
es_es: Correo electrónico

source: As a popular open source development project, Python has an active supporting community of contributors and users that also make their software available for other Python developers to use under open source license terms.
es_es: Como un proyecto de desarrollo de código abierto popular, Python cuenta con una comunidad activa de colaboradores y usuarios que también ponen su software a disposición de otros desarrolladores de Python bajo los términos de una licencia de código abierto.

source: This allows Python users to share and collaborate effectively, benefiting from the solutions others have already created to common (and sometimes even rare!) problems, as well as potentially contributing their own solutions to the common pool.
es_es: Esto permite a los usuarios de Python compartir y colaborar de manera efectiva, beneficiándose de las soluciones que otros ya han creado para problemas comunes (¡y a veces incluso raros!), así como potencialmente contribuir con sus propias soluciones al conjunto común.

source: For corporate and other institutional users, be aware that many organisations have their own policies around using and contributing to open source software. Please take such policies into account when making use of the distribution and installation tools provided with Python.
es_es: Para usuarios corporativos y otras instituciones, tenga en cuenta que muchas organizaciones tienen sus propias políticas sobre el uso y contribución de software de código abierto. Por favor, tenga en cuenta estas políticas al utilizar las herramientas de distribución e instalación proporcionadas con Python.

source: Key terms
es_es: Términos clave

source: ``pip`` is the preferred installer program. Starting with Python 3.4, it is included by default with the Python binary installers.
es_es: ``pip`` es el programa instalador preferido. A partir de Python 3.4, se incluye por defecto con los instaladores binarios de Python.

source: A *virtual environment* is a semi-isolated Python environment that allows packages to be installed for use by a particular application, rather than being installed system wide.
es_es: Un *entorno virtual* es un entorno Python semi-aislado que permite que los paquetes sean instalados para ser usados por una aplicación en particular, en lugar de ser instalados en todo el sistema.

source: ``venv`` is the standard tool for creating virtual environments, and has been part of Python since Python 3.3. Starting with Python 3.4, it defaults to installing ``pip`` into all created virtual environments.
es_es: ``venv`` es la herramienta estándar para crear entornos virtuales, y ha formado parte de Python desde Python 3.3. A partir de Python 3.4, instala por defecto ``pip`` en todos los entornos virtuales creados.

source: ``virtualenv`` is a third party alternative (and predecessor) to ``venv``. It allows virtual environments to be used on versions of Python prior to 3.4, which either don't provide ``venv`` at all, or aren't able to automatically install ``pip`` into created environments.
es_es: ``virtualenv`` es una alternativa de terceros (y predecesora) a ``venv``. Permite utilizar entornos virtuales en versiones de Python anteriores a la 3.4, que o bien no proporcionan ``venv`` en absoluto, o bien no son capaces de instalar automáticamente ``pip`` en los entornos creados.

source: The `Python Package Index <https://pypi.org>`__ is a public repository of open source licensed packages made available for use by other Python users.
es_es: El `Python Package Index <https://pypi.org>`__ es un repositorio público de paquetes con licencia de código abierto a disposición de otros usuarios de Python.

source: ``distutils`` is the original build and distribution system first added to the Python standard library in 1998. While direct use of ``distutils`` is being phased out, it still laid the foundation for the current packaging and distribution infrastructure, and it not only remains part of the standard library, but its name lives on in other ways (such as the name of the mailing list used to coordinate Python packaging standards development).
es_es: ``distutils`` es el sistema original de compilación y distribución que se añadió por primera vez a la biblioteca estándar de Python en 1998. Aunque el uso directo de ``distutils`` está desapareciendo, sentó las bases de la actual infraestructura de empaquetado y distribución, y no sólo sigue formando parte de la biblioteca estándar, sino que su nombre perdura de otras formas (como el nombre de la lista de correo utilizada para coordinar el desarrollo de los estándares de empaquetado de Python).

source: The use of ``venv`` is now recommended for creating virtual environments.
es_es: Actualmente se recomienda el uso de ``venv`` para crear entornos virtuales.

source: `Python Packaging User Guide: Creating and using virtual environments <https://packaging.python.org/installing/#creating-virtual-environments>`__
es_es: `Guía del usuario de empaquetado de Python: Creación y uso de entornos virtuales <https://packaging.python.org/installing/#creating-virtual-environments>`__

source: Basic usage
es_es: Uso básico

source: The standard packaging tools are all designed to be used from the command line.
es_es: Todas las herramientas de empaquetado estándar están diseñadas para utilizarse desde la línea de comandos.

source: The following command will install the latest version of a module and its dependencies from the Python Package Index::
es_es: El siguiente comando instalará la última versión de un módulo y sus dependencias desde el índice de paquetes de Python::

source: For POSIX users (including macOS and Linux users), the examples in this guide assume the use of a :term:`virtual environment`.
es_es: Para los usuarios de POSIX (incluidos los usuarios de macOS y Linux), los ejemplos de esta guía asumen el uso de un :term:`virtual environment`.

source: For Windows users, the examples in this guide assume that the option to adjust the system PATH environment variable was selected when installing Python.
es_es: Para los usuarios de Windows, los ejemplos de esta guía asumen que la opción de ajustar la variable de entorno PATH del sistema se seleccionó al instalar Python.

source: It's also possible to specify an exact or minimum version directly on the command line. When using comparator operators such as ``>``, ``<`` or some other special character which get interpreted by shell, the package name and the version should be enclosed within double quotes::
es_es: También es posible especificar una versión exacta o mínima directamente en la línea de órdenes. Cuando se utilizan operadores de comparación como ``>``, ``<`` o algún otro carácter especial que sea interpretado por el shell, el nombre del paquete y la versión deben ir entre comillas dobles::

source: Normally, if a suitable module is already installed, attempting to install it again will have no effect. Upgrading existing modules must be requested explicitly::
es_es: Normalmente, si un módulo adecuado ya está instalado, intentar instalarlo de nuevo no tendrá ningún efecto. La actualización de los módulos existentes debe solicitarse explícitamente::

source: More information and resources regarding ``pip`` and its capabilities can be found in the `Python Packaging User Guide <https://packaging.python.org>`__.
es_es: Encontrará más información y recursos sobre ``pip`` y sus funciones en la `Guía del usuario de empaquetado de Python <https://packaging.python.org>`__.

source: Creation of virtual environments is done through the :mod:`venv` module. Installing packages into an active virtual environment uses the commands shown above.
es_es: La creación de entornos virtuales se realiza a través del módulo :mod:`venv`. La instalación de paquetes en un entorno virtual activo utiliza los comandos mostrados anteriormente.

source: `Python Packaging User Guide: Installing Python Distribution Packages <https://packaging.python.org/installing/>`__
es_es: `Guía del usuario de paquetes Python: Instalación de paquetes de distribución de Python <https://packaging.python.org/installing/>`__

source: How do I ...?
es_es: ¿Cómo puedo...?

source: These are quick answers or links for some common tasks.
es_es: Estas son respuestas rápidas o enlaces para algunas tareas comunes.

source: ... install ``pip`` in versions of Python prior to Python 3.4?
es_es: ... instalar ``pip`` en versiones de Python anteriores a Python 3.4?

source: Python only started bundling ``pip`` with Python 3.4. For earlier versions, ``pip`` needs to be "bootstrapped" as described in the Python Packaging User Guide.
es_es: Python sólo empezó a empaquetar ``pip`` con Python 3.4. Para versiones anteriores, ``pip`` necesita ser "bootstrapped" como se describe en la Python Packaging User Guide.

source: `Python Packaging User Guide: Requirements for Installing Packages <https://packaging.python.org/installing/#requirements-for-installing-packages>`__
es_es: `Guía del usuario de empaquetado de Python: Requisitos para instalar paquetes <https://packaging.python.org/installing/#requirements-for-installing-packages>`__

source: ... install packages just for the current user?
es_es: ... instalar paquetes sólo para el usuario actual?

source: Passing the ``--user`` option to ``python -m pip install`` will install a package just for the current user, rather than for all users of the system.
es_es: Si se pasa la opción ``--user`` a ``python -m pip install``, se instalará un paquete sólo para el usuario actual, en lugar de para todos los usuarios del sistema.

source: ... install scientific Python packages?
es_es: ... instalar paquetes científicos de Python?

source: A number of scientific Python packages have complex binary dependencies, and aren't currently easy to install using ``pip`` directly. At this point in time, it will often be easier for users to install these packages by `other means <https://packaging.python.org/science/>`__ rather than attempting to install them with ``pip``.
es_es: Varios paquetes científicos de Python tienen dependencias binarias complejas, y actualmente no son fáciles de instalar usando ``pip`` directamente. En este momento, a menudo será más fácil para los usuarios instalar estos paquetes por `otros medios <https://packaging.python.org/science/>`__ en lugar de intentar instalarlos con ``pip``.

source: `Python Packaging User Guide: Installing Scientific Packages <https://packaging.python.org/science/>`__
es_es: `Guía del usuario de empaquetado de Python: Instalación de paquetes científicos <https://packaging.python.org/science/>`__

source: ... work with multiple versions of Python installed in parallel?
es_es: ... trabajar con varias versiones de Python instaladas en paralelo?

source: On Linux, macOS, and other POSIX systems, use the versioned Python commands in combination with the ``-m`` switch to run the appropriate copy of ``pip``::
es_es: En Linux, macOS y otros sistemas POSIX, utilice los comandos versionados de Python en combinación con el modificador ``-m`` para ejecutar la copia apropiada de ``pip``::

source: Appropriately versioned ``pip`` commands may also be available.
es_es: También pueden estar disponibles los comandos ``pip`` debidamente versionados.

source: On Windows, use the ``py`` Python launcher in combination with the ``-m`` switch::
es_es: En Windows, utilice el lanzador de Python ``py`` en combinación con el interruptor ``-m``::

source: Common installation issues
es_es: Problemas comunes de instalación

source: Installing into the system Python on Linux
es_es: Instalar en el sistema Python en Linux

source: On Linux systems, a Python installation will typically be included as part of the distribution. Installing into this Python installation requires root access to the system, and may interfere with the operation of the system package manager and other components of the system if a component is unexpectedly upgraded using ``pip``.
es_es: En los sistemas Linux, normalmente se incluirá una instalación de Python como parte de la distribución. La instalación en esta instalación de Python requiere acceso root al sistema, y puede interferir con el funcionamiento del gestor de paquetes del sistema y otros componentes del sistema si un componente se actualiza inesperadamente utilizando ``pip``.

source: On such systems, it is often better to use a virtual environment or a per-user installation when installing packages with ``pip``.
es_es: En estos sistemas, suele ser mejor utilizar un entorno virtual o una instalación por usuario al instalar paquetes con ``pip``.

source: Pip not installed
es_es: Pip no instalado

source: It is possible that ``pip`` does not get installed by default. One potential fix is::
es_es: Es posible que ``pip`` no se instale por defecto. Una posible solución es::

source: Installing binary extensions
es_es: Instalación de extensiones binarias

source: Python has typically relied heavily on source based distribution, with end users being expected to compile extension modules from source as part of the installation process.
es_es: Por lo general, Python ha dependido en gran medida de la distribución basada en fuentes, y se esperaba que los usuarios finales compilaran los módulos de extensión a partir de las fuentes como parte del proceso de instalación.

source: With the introduction of support for the binary ``wheel`` format, and the ability to publish wheels for at least Windows and macOS through the Python Package Index, this problem is expected to diminish over time, as users are more regularly able to install pre-built extensions rather than needing to build them themselves.
es_es: Con la introducción de la compatibilidad con el formato binario ``wheel`` y la posibilidad de publicar giros al menos para Windows y macOS a través del índice de paquetes de Python, se espera que este problema disminuya con el tiempo, ya que los usuarios podrán instalar con mayor regularidad extensiones precompiladas en lugar de tener que compilarlas ellos mismos.

source: Some of the solutions for installing `scientific software <https://packaging.python.org/science/>`__ that are not yet available as pre-built ``wheel`` files may also help with obtaining other binary extensions without needing to build them locally.
es_es: Algunas de las soluciones para instalar `software científico <https://packaging.python.org/science/>`__ que aún no está disponible como archivos precompilados ``wheel`` también pueden ayudar a obtener otras extensiones binarias sin necesidad de compilarlas localmente.

source: `Python Packaging User Guide: Binary Extensions <https://packaging.python.org/extensions/>`__
es_es: Guía del usuario de empaquetado de Python: Extensiones binarias <https://packaging.python.org/extensions/>`__
