Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/about.po
Languages: es_es, it_it, ru

source: About these documents
es_es: Sobre estos documentos:
it_it: A proposito di questi documenti
ru: Об этой документации

source: These documents are generated from `reStructuredText`_ sources by `Sphinx`_, a document processor specifically written for the Python documentation.
es_es: Estos documentos han sido generados procedentes de `reStructuredText`_ sources, programas fuentes, por 'Sphinx', un procesador de documentos específicamente escrito para la documentación de Python.
it_it: Questi documenti sono stati generati da `reStructuredText`_ sources by `Sphinx`_, un processatore di documenti scritto appositamente per la documentazione di Python.
ru: Эта документация сгенерирована из файлов `reStructuredText`_ с помощью `Sphinx`_, генератора документации, созданного специально для Python.

source: Development of the documentation and its toolchain is an entirely volunteer effort, just like Python itself. If you want to contribute, please take a look at the :ref:`reporting-bugs` page for information on how to do so. New volunteers are always welcome!
es_es: El desarrollo de la documentación así como el de sus diversas herramientas ha sido posible gracias a un esfuerzo de voluntarios, así como el propio lenguaje Python. Si quiere contribuir eche un vistazo a la página con la referencia `reporting-bugs' donde encontrará información de cómo hacerlo. ¡Los nuevos voluntarios son siempre bienvenidos!
it_it: Lo sviluppo della documentazione e il suo toolchain è interamente un impegno dei volontari, come Python stesso. Se vuoi contribuire, per piacere dai un'occhiata alla pagina :ref:`reporting-bugs` per informazioni su come farlo. Nuovi volontari sono sempre ben accetti!
ru: Разработка и совершенствование данной документации и ее инструментов, как и весь проект Python поддерживается добровольцами. Вся информация о том как внести свой вклад в развитие проекта находится на странице :ref:`reporting-bugs`. Мы всегда рады новым людям!

source: Many thanks go to:
es_es: Nuesto agradecimiento a :
it_it: I ringraziamenti vanno a:
ru: Мы благодарны:

source: Fred L. Drake, Jr., the creator of the original Python documentation toolset and writer of much of the content;
es_es: Fred L. Drake, el creador de conjunto de documentación original de la documentación Python y escritor de gran parte de su contenido;
it_it: Fred L. Drake, Jr., il creatore del set di strumenti della documentazione originale di Python a scrittore della maggior parte del contenuto;
ru: Fred L. Drake, Jr., создателю оригинального набора инструментов для документации Python и автору большей части контента;

source: the `Docutils <http://docutils.sourceforge.net/>`_ project for creating reStructuredText and the Docutils suite;
es_es: Las utilidades de documentación 'Docutils <http://docutils.sourceforge.net/>`_, proyecto para la creación de reStructuredText y del conjunto Docutils
it_it: Il progetto `Docutils <http://docutils.sourceforge.net/>`_ per la creazione di reStructuredext e la suite Docutils;

source: Fredrik Lundh for his `Alternative Python Reference <http://effbot.org/zone/pyref.htm>`_ project from which Sphinx got many good ideas.
es_es: Fredik Lundh por su proyecto ' `Alternative Python Reference <http://effbot.org/zone/pyref.htm>`_ del cual Sphinx extrajo muchas buenas ideas.
it_it: Fredrik Lundh per il suo progetto `Alternative Python Reference <http://effbot.org/zone/pyref.htm>`_ dal quale Sphinx ha preso tante buone idee.

source: Contributors to the Python Documentation
es_es: Colaboradores que han contribuido a la documentación de Python.
it_it: Contributori alla documentazione di Python
ru: Контрибьюторы документации Python

source: Many people have contributed to the Python language, the Python standard library, and the Python documentation. See :source:`Misc/ACKS` in the Python source distribution for a partial list of contributors.
es_es: Muchas personas han contribuido al lenguaje Python, a la librería standard de Python y a la documentación de Python. Ver:source:`Misc/ACKS` en la distribución del código fuente de Python si se desea obtener una lista parcial de colaboradores
it_it: Tante persone hanno contribuito al linguaggio Python, alla libreria standard di Python, e alla documentazione di Python. Vedi :source:`Misc/ACKS` nella distribuzione del sorgente di Python per un elenco parziale dei contributori.
ru: Множество людей внесли свой вклад в развитие языка Python, стандартной библиотеки и документации Python. Частичный список контрибьюторов можно найти здесь: :source:`Misc/ACKS`.

source: It is only with the input and contributions of the Python community that Python has such wonderful documentation -- Thank You!
es_es: Es tan sólo debido a las entradas y contribuciones de la comunidad de Python que Python tenga tan extensa y maravillosa documentación. ¡Gracias!
it_it: È solo con la forza e con i contributi della community Python che quest'ultimo ha una così meravigliosa documentazione -- Grazie!
ru: Только благодаря вкладу и участию сообщества у Python есть такая замечательная документация - Спасибо Вам!

source: the `Docutils <https://docutils.sourceforge.io/>`_ project for creating reStructuredText and the Docutils suite;
ru: проекту `Docutils <https://docutils.sourceforge.io/>`_ за создание reStructuredText и библиотеки Docutils;

source: Fredrik Lundh for his Alternative Python Reference project from which Sphinx got many good ideas.
ru: Fredrik Lundh за его проект Alternative Python Reference, из которого Sphinx получил много хороших идей.
