Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/bugs.po
Languages: id, ru

source: Dealing with Bugs
id: Berurusan dengan Bugs
ru: Исправление ошибок

source: Python is a mature programming language which has established a reputation for stability. In order to maintain this reputation, the developers would like to know of any deficiencies you find in Python.
id: Python merupakan sebuah bahasa pemrograman yang matang dan telah membangun reputasi stabil. Untuk mempertahankan reputasi ini, pengembang ingin mengatahui semua kekurangan yang kamu temui di Phyton.
ru: Python - это продуманный язык программирования, завоевавший репутацию благодаря своей стабильности. Для поддержания такой репутации разработчики хотели бы знать о любых найденных вами в Python недочётах.

source: It can be sometimes faster to fix bugs yourself and contribute patches to Python as it streamlines the process and involves less people. Learn how to :ref:`contribute <contributing-to-python>`.
id: Terkadang akan lebih cepat untuk memperbaiki bug sendiri dan kontribusi patch ke Python, karena dapat menyederhanakan proses dengan sedikit orang yang terlibat. Pelajari caranya :ref:`contribute `.
ru: Иногда бывает быстрее самостоятельно исправить ошибки и внести патчи в Python, так как это упрощает процесс и вовлекает меньше людей. Узнайте, как :ref:`внести свой вклад<contributing-to-python>`.

source: Documentation bugs
id: Dokumentasi *bugs*
ru: Ошибки в документации

source: If you find a bug in this documentation or would like to propose an improvement, please submit a bug report on the :ref:`tracker <using-the-tracker>`. If you have a suggestion on how to fix it, include that as well.
id: Jika Anda menemukan *bug* di dalam dokumentasi atau berkeinginan untuk mengusulkan sebuah perbaikan, mohon untuk mengajukan sebuah laporan tentang bug di dalam :ref:`tracker <using-the-tracker>`. Jika Anda memiliki sebuah saran bagaimana cara untuk memperbaikinya, lampirkan juga.
ru: Если вы обнаружили ошибку в этой документации или хотите предложить улучшение, пожалуйста, отправьте отчет об ошибке на :ref:`трекер <using-the-tracker>`. Если у вас есть предложение по исправлению, включите и его тоже.

source: You can also open a discussion item on our `Documentation Discourse forum <https://discuss.python.org/c/documentation/26>`_.
id: Anda juga dapat membuka item diskusi di forum `Documentation Discourse kami <https://discuss.python.org/c/documentation/26>`_.
ru: Вы также можете открыть обсуждение на нашем `форуме Documentation Discourse <https://discuss.python.org/c/documentation/26>`_.

source: If you find a bug in the theme (HTML / CSS / JavaScript) of the documentation, please submit a bug report on the `python-doc-theme bug tracker <https://github.com/python/python-docs-theme>`_.
id: Jika Anda menemukan bug pada tema (HTML / CSS / JavaScript) dokumentasi, silakan kirimkan laporan bug pada `python-doc-theme bug tracker <https://github.com/python/python-docs-theme>`_.

source: If you're short on time, you can also email documentation bug reports to docs@python.org (behavioral bugs can be sent to python-list@python.org). 'docs@' is a mailing list run by volunteers; your request will be noticed, though it may take a while to be processed.
id: Jika kamu tidak mempunyai banyak waktu, kamu juga dapat mengirimkan laporan bug dokumentasi melalui email di docs@python.orgÂ (perilaku bug dapat dikirim ke python-list@python.org). 'docs@' ini adalah sebuah daftar mail yang dijalankan oleh relawan; Permintaan mu akan diperhatikan meskipun akan membutuhkan sedikit waktu untuk diproses.
ru: Если у вас мало времени, вы также можете отправить отчеты об ошибках в документации по электронной почте на адрес docs@python.org (поведенческие ошибки можно отправить на python-list@python.org). 'docs@' - это список рассылки, управляемый добровольцами; ваш запрос будет принят, хотя может потребоваться некоторое время для его обработки.

source: `Documentation bugs`_
id: `Dokumentasi *bugs*`_
ru: `Ошибки в документации`_

source: A list of documentation bugs that have been submitted to the Python issue tracker.
id: Daftar dokumentasi *bugs* yang telah dikirimkan ke pelacak isu *issue tracker* Python.
ru: Список ошибок в документации, которые были отправлены в Python issue tracker.

source: Overview of the process involved in reporting an improvement on the tracker.
id: Tinjauan dari proses yang terlibat dalam pelaporan perbaikan pada pelacak.
ru: Обзор процесса, связанного с сообщением об улучшении на трекере.

source: `Helping with Documentation <https://devguide.python.org/docquality/#helping-with-documentation>`_
id: `Membantu dengan Dokumentasi <https://devguide.python.org/docquality/#helping-with-documentation>`_
ru: `Помощь с документацией <https://devguide.python.org/docquality/#helping-with-documentation>`_

source: Comprehensive guide for individuals that are interested in contributing to Python documentation.
id: Panduan komprehensif untuk pribadi yang tertarik untuk berkontribusi dalam dokumentasi Python.
ru: Полное руководство для тех, кто заинтересован в том, чтобы внести свой вклад в документацию Python.

source: `Documentation Translations <https://devguide.python.org/documentation/translating/>`_
id: `Penerjemahan Dokumentasi <https://devguide.python.org/documentation/translating/>`_
ru: `Переводы документации <https://devguide.python.org/documentation/translating/>`_

source: A list of GitHub pages for documentation translation and their primary contacts.
id: Daftar halaman GitHub untuk penerjemahan dokumentasi dan kontak utamanya.
ru: Список страниц GitHub для перевода документации и их основные контакты.

source: Using the Python issue tracker
id: Menggunakan pelacak issue Python.
ru: Использование трекера проблем Python

source: Issue reports for Python itself should be submitted via the GitHub issues tracker (https://github.com/python/cpython/issues). The GitHub issues tracker offers a web form which allows pertinent information to be entered and submitted to the developers.
id: Laporan masalah Python harus dikirimkan melalui pelacak masalah di GitHub (https://github.com/python/cpython/issues). Pelacak masalah di GitHub terdapat formulir web yang memungkinkan informasi terkait untuk bisa dimasukkan dan diserahkan kepada pengembang.
ru: Отчеты об ошибках для самого Python должны быть отправлены через трекер проблем GitHub (https://github.com/python/cpython/issues). Трекер проблем GitHub предлагает веб-форму, которая позволяет вводить соответствующую информацию и отправлять ее разработчикам.

source: The first step in filing a report is to determine whether the problem has already been reported. The advantage in doing so, aside from saving the developers' time, is that you learn what has been done to fix it; it may be that the problem has already been fixed for the next release, or additional information is needed (in which case you are welcome to provide it if you can!). To do this, search the tracker using the search box at the top of the page.
id: Langkah pertama dalam mengajukan laporan adalah menentukan apakah masalah tersebut sudah pernah dilaporkan. Keuntungannya, selain menghemat waktu pengembang, Anda juga dapat mengetahui apa yang telah dilakukan untuk memperbaikinya; mungkin saja masalahnya sudah diperbaiki untuk rilis berikutnya, atau informasi tambahan diperlukan (dalam hal ini Anda dipersilakan untuk memberikannya jika mungkin). Untuk melakukan hal ini, carilah menggunakan kotak pencarian di bagian atas halaman.
ru: Первый шаг при подаче отчета - определить, было ли уже сообщено об этой проблеме. Этот шаг не только помогает сэкономить время разработчикам, но и позволяет понять, какие усилия были приложены для устранения проблемы; возможно, проблема уже была исправлена для следующего релиза, или требуется дополнительная информация (в этом случае, если у вас есть возможность, пожалуйста, предоставьте её!). Для этого воспользуйтесь поиском в трекере, используя поле поиска в верхней части страницы.

source: If the problem you're reporting is not already in the list, log in to GitHub. If you don't already have a GitHub account, create a new account using the "Sign up" link. It is not possible to submit a bug report anonymously.
id: Jika masalah yang Anda laporkan belum ada di dalam daftar, masuklah ke GitHub. Jika Anda belum memiliki akun GitHub, buatlah akun baru menggunakan tautan "Daftar". Anda tidak dapat mengirimkan laporan bug secara anonim.
ru: Если проблема, о которой вы сообщаете, еще не указана в списке, войдите в GitHub. Если у вас еще нет учетной записи GitHub, создайте новую учетную запись, перейдя по ссылке "Sign up". Невозможно отправить отчет об ошибке анонимно.

source: Being now logged in, you can submit an issue. Click on the "New issue" button in the top bar to report a new issue.
id: Setelah masuk, Anda dapat mengirimkan masalah. Klik tombol "Masalah baru" di bilah atas untuk melaporkan masalah baru.
ru: Теперь, будучи авторизованным, вы можете отправить сообщение о проблеме. Нажмите на кнопку "New issue" в верхней панели, чтобы сообщить о новой проблеме.

source: The submission form has two fields, "Title" and "Comment".
id: Formulir pengajuan memiliki dua kolom, "Judul" dan "Komentar".
ru: Форма отправки имеет два поля: "Title" и "Comment".

source: For the "Title" field, enter a *very* short description of the problem; fewer than ten words is good.
id: Untuk kolom "Judul", masukkan deskripsi yang *sangat* singkat tentang masalah Anda; kurang dari sepuluh kata, cukup.
ru: В поле "Title" введите *очень* краткое описание проблемы; меньше десяти слов - это хорошо.

source: In the "Comment" field, describe the problem in detail, including what you expected to happen and what did happen. Be sure to include whether any extension modules were involved, and what hardware and software platform you were using (including version information as appropriate).
id: Pada kolom "Comment", Jelaskan masalah secara detail, termasuk apa yang kamu harapkan dan apa yang terjadi. Pastikan untuk menyertakan apakah ada ekstensi modul yang terlibat, dan apa saja platform perangkat keras dan perangkat lunak yang kamu gunakan (termasuk versi informasi yang sesuai).
ru: В поле "Comment" подробно опишите проблему, включая то, что вы ожидали, и что произошло на самом деле. Обязательно укажите, были ли задействованы какие-либо модули расширений, а также информацию о используемом аппаратном и программном обеспечении (включая соответствующую версию).

source: Each issue report will be reviewed by a developer who will determine what needs to be done to correct the problem. You will receive an update each time an action is taken on the issue.
id: Setiap laporan masalah akan ditinjau oleh pengembang yang akan menentukan apa yang perlu dilakukan untuk memperbaiki masalah tersebut. Anda akan menerima pembaruan setiap kali ada tindakan yang diambil untuk mengatasi masalah tersebut.
ru: Каждый отчет о проблеме будет рассмотрен разработчиком, который определит, что нужно сделать для устранения проблемы. Вы будете получать обновления каждый раз, когда будет предпринято какое-либо действие для решения проблемы.

source: `How to Report Bugs Effectively <https://www.chiark.greenend.org.uk/~sgtatham/bugs.html>`_
id: `Bagaimana Melaporkan Bug Secara Efektif <https://www.chiark.greenend.org.uk/~sgtatham/bugs.html>`_
ru: `Как эффективно сообщать об ошибках <https://www.chiark.greenend.org.uk/~sgtatham/bugs-ru.html>`_

source: Article which goes into some detail about how to create a useful bug report. This describes what kind of information is useful and why it is useful.
id: Artikel yang memuat beberapa detail tentang bagaimana membuat laporan bug yang berguna. Ini menjelaskan informasi apa saja yang berguna dan mengapa menjadi berguna.
ru: Статья, которая подробно описывает, как создать полезный отчет об ошибке. В ней описывается, какая информация является полезной и почему.

source: `Bug Writing Guidelines <https://bugzilla.mozilla.org/page.cgi?id=bug-writing.html>`_
id: `Pedoman Penulisan Bug <https://bugzilla.mozilla.org/page.cgi?id=bug-writing.html>`_
ru: `Руководство по написанию отчетов об ошибках <https://bugzilla.mozilla.org/page.cgi?id=bug-writing.html>`_

source: Information about writing a good bug report. Some of this is specific to the Mozilla project, but describes general good practices.
id: Informasi seputar penulisan laporan bug yang baik. Beberapa diantaranya merupakan project Mozilla, tapi dapat menggambarkan praktik umum yang baik.
ru: Информация о том, как написать хороший отчет об ошибке. Некоторые рекомендации относятся к проекту Mozilla, но описывают общую передовую практику.

source: Getting started contributing to Python yourself
id: Mulai konstribusi pada Python mu sendiri.
ru: Начните самостоятельно вносить вклад в развитие Python

source: Beyond just reporting bugs that you find, you are also welcome to submit patches to fix them. You can find more information on how to get started patching Python in the `Python Developer's Guide`_. If you have questions, the `core-mentorship mailing list`_ is a friendly place to get answers to any and all questions pertaining to the process of fixing issues in Python.
id: Selain melaporkan bug yang kamu temukan, kamu pula dipersilahkan untuk mengirimkan solusi untuk memperbaikinya. Kamu dapat menukan informasi bagaiamana cara memulai menambal Python di `Python Developer's Guide`_. Jika kamu mempunyai pertanyaan, `core-mentorship mailing list`_ merupakan tempat yang ramah untuk menjawab pertanyaan-pertanyaan mu yang berkaitan dengan proses memperbaiki masalah dengan Python.
ru: Помимо отправки сообщений об обнаруженных вами ошибках, вы также можете предложить исправления для них. Более подробную информацию о том, как начать исправлять ошибки в Python, вы можете найти в `Руководстве разработчика Python`_. Если у вас возникнут вопросы, `список рассылки core-mentorship`_ - дружелюбное место, где можно получить ответы на любые вопросы, касающиеся процесса исправления ошибок в Python.

source: `Issue Tracking <https://devguide.python.org/tracker/>`_
ru: `Отслеживание ошибок <https://devguide.python.org/tracker/>`_
