Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/glossary.po
Languages: ru

source: Coroutines are a more generalized form of subroutines. Subroutines are entered at one point and exited at another point. Coroutines can be entered, exited, and resumed at many different points. They can be implemented with the :keyword:`async def` statement. See also :pep:`492`.
ru: Сопрограммы — это более обобщенная форма подпрограмм. Вход в подпрограммы осуществляется в одной точке, а выход — в другой. В сопрограммы можно входить, выходить и возобновлять работу в самых разных точках. Их можно реализовать с помощью оператора :keyword:`async def`. См. также :pep:`492`.

source: coroutine function
ru: корутинная функция

source: A function which returns a :term:`coroutine` object. A coroutine function may be defined with the :keyword:`async def` statement, and may contain :keyword:`await`, :keyword:`async for`, and :keyword:`async with` keywords. These were introduced by :pep:`492`.
ru: Функция, которая возвращает объект :term:`coroutine`. Функция сопрограммы может быть определена с помощью оператора :keyword:`async def` и может содержать ключевые слова :keyword:`await`, :keyword:`async for` и :keyword:`async with`. Их представил :pep:`492`.

source: The canonical implementation of the Python programming language, as distributed on `python.org <https://www.python.org>`_. The term "CPython" is used when necessary to distinguish this implementation from others such as Jython or IronPython.
ru: Каноническая реализация языка программирования Python, распространяемая на `python.org <https://www.python.org>`_. Термин «CPython» используется, когда необходимо отличить эту реализацию от других, таких как Jython или IronPython.

source: decorator
ru: декоратор

source: A function returning another function, usually applied as a function transformation using the ``@wrapper`` syntax. Common examples for decorators are :func:`classmethod` and :func:`staticmethod`.
ru: Функция, возвращающая другую функцию, обычно применяется как преобразование функции с использованием синтаксиса @wrapper. Типичными примерами декораторов являются :func:`classmethod` и :func:`staticmethod`.

source: The decorator syntax is merely syntactic sugar, the following two function definitions are semantically equivalent::
ru: Синтаксис декоратора — это всего лишь синтаксический сахар, следующие два определения функций семантически эквивалентны:

source: The same concept exists for classes, but is less commonly used there. See the documentation for :ref:`function definitions <function>` and :ref:`class definitions <class>` for more about decorators.
ru: Та же концепция существует и для классов, но используется там реже. Дополнительную информацию о декораторах смотрите в документации по :ref:`определениям функций <function>` и :ref:`определениям классов <class>`.

source: descriptor
ru: дескриптор

source: Any object which defines the methods :meth:`~object.__get__`, :meth:`~object.__set__`, or :meth:`~object.__delete__`. When a class attribute is a descriptor, its special binding behavior is triggered upon attribute lookup. Normally, using *a.b* to get, set or delete an attribute looks up the object named *b* in the class dictionary for *a*, but if *b* is a descriptor, the respective descriptor method gets called. Understanding descriptors is a key to a deep understanding of Python because they are the basis for many features including functions, methods, properties, class methods, static methods, and reference to super classes.
ru: Любой объект, который определяет методы :meth:`~object.__get__`, :meth:`~object.__set__` или :meth:`~object.__delete__`. Если атрибут класса является дескриптором, его особое поведение привязки запускается при поиске атрибута. Обычно использование *ab* для получения, установки или удаления атрибута ищет объект с именем *b* в словаре класса для *a*, но если *b* является дескриптором, вызывается соответствующий метод дескриптора. Понимание дескрипторов является ключом к глубокому пониманию Python, поскольку они являются основой для многих функций, включая функции, методы, свойства, методы классов, статические методы и ссылки на суперклассы.

source: For more information about descriptors' methods, see :ref:`descriptors` or the :ref:`Descriptor How To Guide <descriptorhowto>`.
ru: Для получения дополнительной информации о методах дескрипторов см. :ref:`descriptors` или :ref:`Descriptor How To Guide <descriptorhowto>`.

source: dictionary
ru: словарь

source: An associative array, where arbitrary keys are mapped to values. The keys can be any object with :meth:`~object.__hash__` and :meth:`~object.__eq__` methods. Called a hash in Perl.
ru: Ассоциативный массив, в котором произвольные ключи сопоставляются значениям. Ключами может быть любой объект с методами :meth:`~object.__hash__` и :meth:`~object.__eq__`. Вызывается хешем в Perl.

source: dictionary comprehension
ru: включение из словаря

source: A compact way to process all or part of the elements in an iterable and return a dictionary with the results. ``results = {n: n ** 2 for n in range(10)}`` generates a dictionary containing key ``n`` mapped to value ``n ** 2``. See :ref:`comprehensions`.
ru: Компактный способ обработки всех или части элементов в итерации и возврата словаря с результатами. ``results = {n: n ** 2 for n in range(10)}`` генерирует словарь, содержащий ключ ``n``, сопоставленный со значением ``n ** 2``. См. :ref:`понимания`.

source: dictionary view
ru: представление словаря

source: The objects returned from :meth:`dict.keys`, :meth:`dict.values`, and :meth:`dict.items` are called dictionary views. They provide a dynamic view on the dictionary’s entries, which means that when the dictionary changes, the view reflects these changes. To force the dictionary view to become a full list use ``list(dictview)``. See :ref:`dict-views`.
ru: Объекты, возвращаемые из :meth:`dict.keys`, :meth:`dict.values` и :meth:`dict.items`, называются представлениями словаря. Они обеспечивают динамическое представление записей словаря, а это означает, что при изменении словаря представление отражает эти изменения. Чтобы заставить представление словаря стать полным списком, используйте list(dictview). См. :ref:`dict-views`.

source: docstring
ru: строка документации

source: duck-typing
ru: утиная типизация

source: A programming style which does not look at an object's type to determine if it has the right interface; instead, the method or attribute is simply called or used ("If it looks like a duck and quacks like a duck, it must be a duck.") By emphasizing interfaces rather than specific types, well-designed code improves its flexibility by allowing polymorphic substitution. Duck-typing avoids tests using :func:`type` or :func:`isinstance`. (Note, however, that duck-typing can be complemented with :term:`abstract base classes <abstract base class>`.) Instead, it typically employs :func:`hasattr` tests or :term:`EAFP` programming.
ru: Стиль программирования, который не рассматривает тип объекта, чтобы определить, имеет ли он правильный интерфейс; вместо этого метод или атрибут просто вызывается или используется («Если он выглядит как утка и крякает как утка, значит, это и есть утка».) Делая акцент на интерфейсах, а не на конкретных типах, хорошо спроектированный код повышает свою гибкость, позволяя полиморфное замещение. Утиная типизация позволяет избежать тестов с использованием :func:`type` или :func:`isinstance`. (Однако обратите внимание, что утиная типизация может быть дополнена :term:`абстрактными базовыми классами <abstract base class>`.) Вместо этого обычно используются :func:`hasattr` тесты или :term:`EAFP`.

source: Easier to ask for forgiveness than permission. This common Python coding style assumes the existence of valid keys or attributes and catches exceptions if the assumption proves false. This clean and fast style is characterized by the presence of many :keyword:`try` and :keyword:`except` statements. The technique contrasts with the :term:`LBYL` style common to many other languages such as C.
ru: Легче попросить прощения, чем разрешения. Этот распространенный стиль кодирования Python предполагает наличие допустимых ключей или атрибутов и перехватывает исключения, если предположение оказывается ложным. Этот чистый и быстрый стиль характеризуется наличием множества операторов :keyword:`try` и :keyword:`Exception`. Этот метод контрастирует со стилем :term:`LBYL`, общим для многих других языков, таких как C.

source: expression
ru: выражение

source: A piece of syntax which can be evaluated to some value. In other words, an expression is an accumulation of expression elements like literals, names, attribute access, operators or function calls which all return a value. In contrast to many other languages, not all language constructs are expressions. There are also :term:`statement`\s which cannot be used as expressions, such as :keyword:`while`. Assignments are also statements, not expressions.
ru: Часть синтаксиса, которая может быть оценена как некоторое значение. Другими словами, выражение представляет собой совокупность элементов выражения, таких как литералы, имена, доступ к атрибутам, операторы или вызовы функций, которые возвращают значение. В отличие от многих других языков, не все языковые конструкции являются выражениями. Существуют также :term:`statement`\s, которые нельзя использовать в качестве выражений, например :keyword:` while`. Присвоения также являются утверждениями, а не выражениями.

source: extension module
ru: модуль расширения

source: A module written in C or C++, using Python's C API to interact with the core and with user code.
ru: Модуль, написанный на C или C++, использующий C API Python для взаимодействия с ядром и пользовательским кодом.

source: f-string
ru: f-строка

source: String literals prefixed with ``'f'`` or ``'F'`` are commonly called "f-strings" which is short for :ref:`formatted string literals <f-strings>`. See also :pep:`498`.
ru: Строковые литералы с префиксом ``'f'`` или ``'F'`` обычно называются "f-строками", что является сокращением от форматированных строковых литералов <f-strings>`. См. также :pep:`498`.

source: file object
ru: файловый объект

source: An object exposing a file-oriented API (with methods such as :meth:`!read` or :meth:`!write`) to an underlying resource. Depending on the way it was created, a file object can mediate access to a real on-disk file or to another type of storage or communication device (for example standard input/output, in-memory buffers, sockets, pipes, etc.). File objects are also called :dfn:`file-like objects` or :dfn:`streams`.
ru: Объект, предоставляющий файлово-ориентированный API (с такими методами, как :meth:`!read` или :meth:`!write`) базовому ресурсу. В зависимости от способа создания файловый объект может обеспечивать доступ к реальному файлу на диске или к другому типу устройства хранения или связи (например, стандартному вводу/выводу, буферам в памяти, сокетам, каналам и т. д.). . Файловые объекты также называются :dfn:`файлоподобными объектами` или :dfn:`streams`.

source: There are actually three categories of file objects: raw :term:`binary files <binary file>`, buffered :term:`binary files <binary file>` and :term:`text files <text file>`. Their interfaces are defined in the :mod:`io` module. The canonical way to create a file object is by using the :func:`open` function.
ru: На самом деле существует три категории файловых объектов: необработанные :term:`бинарные файлы <двоичный файл>`, буферизованные :term:`бинарные файлы <двоичный файл>` и :term:`текстовые файлы <текстовый файл>`. Их интерфейсы определены в модуле :mod:`io`. Канонический способ создания файлового объекта — использование функции :func:`open`.

source: file-like object
ru: файлообразный объект

source: A synonym for :term:`file object`.
ru: Синоним для :term:`file object`.

source: filesystem encoding and error handler
ru: кодировка файловой системы и обработчик ошибок

source: Encoding and error handler used by Python to decode bytes from the operating system and encode Unicode to the operating system.
ru: Обработчик кодирования и ошибок, используемый Python для декодирования байтов из операционной системы и кодирования Unicode в операционную систему.

source: The filesystem encoding must guarantee to successfully decode all bytes below 128. If the file system encoding fails to provide this guarantee, API functions can raise :exc:`UnicodeError`.
ru: Кодировка файловой системы должна гарантировать успешное декодирование всех байтов ниже 128. Если кодировка файловой системы не может обеспечить эту гарантию, функции API могут вызвать ошибку :exc:`UnicodeError`.

source: The :func:`sys.getfilesystemencoding` and :func:`sys.getfilesystemencodeerrors` functions can be used to get the filesystem encoding and error handler.
ru: Функции :func:`sys.getfilesystemencoding` и :func:`sys.getfilesystemencodeerrors` можно использовать для получения кодировки файловой системы и обработчика ошибок.

source: The :term:`filesystem encoding and error handler` are configured at Python startup by the :c:func:`PyConfig_Read` function: see :c:member:`~PyConfig.filesystem_encoding` and :c:member:`~PyConfig.filesystem_errors` members of :c:type:`PyConfig`.
ru: :term:`Кодировка файловой системы и обработчик ошибок` настраиваются при запуске Python с помощью :c:func:`PyConfig_Read` функция: см. :c:member:`~PyConfig.filesystem_encoding` и :c:member:`~PyConfig.filesystem_errors` члены :c:type:`PyConfig` .

source: See also the :term:`locale encoding`.
ru: См. также :term:`кодировку локали`.

source: finder
ru: искатель

source: An object that tries to find the :term:`loader` for a module that is being imported.
ru: Объект, который пытается найти :term:`loader` для импортируемого модуля.

source: floor division
ru: целочисленное деление с округлением вниз

source: Mathematical division that rounds down to nearest integer. The floor division operator is ``//``. For example, the expression ``11 // 4`` evaluates to ``2`` in contrast to the ``2.75`` returned by float true division. Note that ``(-11) // 4`` is ``-3`` because that is ``-2.75`` rounded *downward*. See :pep:`238`.
ru: Математическое деление, округляющее до ближайшего целого числа. Оператор разделения этажей — ``//``. Например, выражение ``11 // 4`` оценивается как ``2`` в отличие от ``2,75``, возвращаемого делением float true. Обратите внимание, что ``(-11) // 4`` равно ``-3``, потому что это ``-2,75`` округлено *в меньшую сторону*. См. :pep:`238`.

source: function
ru: функция

source: A series of statements which returns some value to a caller. It can also be passed zero or more :term:`arguments <argument>` which may be used in the execution of the body. See also :term:`parameter`, :term:`method`, and the :ref:`function` section.
ru: Ряд операторов, которые возвращают некоторую ценность вызывающему объекту. Ему также может быть передано ноль или более :term:`argument <argument>`, которые могут использоваться при выполнении тела. См. также раздел :term:`parameter`, :term:`method` и :ref:`function`.

source: function annotation
ru: функциональная аннотация

source: An :term:`annotation` of a function parameter or return value.
ru: :term:`аннотация` параметра функции или возвращаемого значения.

source: Function annotations are usually used for :term:`type hints <type hint>`: for example, this function is expected to take two :class:`int` arguments and is also expected to have an :class:`int` return value::
ru: Аннотации к функциям обычно используются для :term:`typehints <typehint>`: например, ожидается, что эта функция будет принимать два аргумента :class:`int`, а также будет иметь возвращаемое значение :class:`int` ::

source: Function annotation syntax is explained in section :ref:`function`.
ru: Синтаксис аннотации функции описан в разделе :ref:`function`.

source: See :term:`variable annotation` and :pep:`484`, which describe this functionality. Also see :ref:`annotations-howto` for best practices on working with annotations.
ru: См. :term:`variable annotation` и :pep:`484`, которые описывают эту функциональность. Также см. :ref:`annotations-howto` для получения рекомендаций по работе с аннотациями.

source: A :ref:`future statement <future>`, ``from __future__ import <feature>``, directs the compiler to compile the current module using syntax or semantics that will become standard in a future release of Python. The :mod:`__future__` module documents the possible values of *feature*. By importing this module and evaluating its variables, you can see when a new feature was first added to the language and when it will (or did) become the default::
ru: Оператор :ref:`future <future>`, ``from __future__ import <feature>``, предписывает компилятору скомпилировать текущий модуль, используя синтаксис или семантику, которые станут стандартными в будущей версии Python. Модуль :mod:`__future__` документирует возможные значения *feature*. Импортировав этот модуль и оценив его переменные, вы сможете увидеть, когда новая функция была впервые добавлена ​​в язык и когда она станет (или станет) функцией по умолчанию:

source: garbage collection
ru: сбор мусора

source: The process of freeing memory when it is not used anymore. Python performs garbage collection via reference counting and a cyclic garbage collector that is able to detect and break reference cycles. The garbage collector can be controlled using the :mod:`gc` module.
ru: Процесс освобождения памяти, когда она больше не используется. Python выполняет сбор мусора посредством подсчета ссылок и циклического сборщика мусора, который способен обнаруживать и прерывать циклы ссылок. Сборщиком мусора можно управлять с помощью модуля :mod:`gc`.

source: generator
ru: генератор

source: A function which returns a :term:`generator iterator`. It looks like a normal function except that it contains :keyword:`yield` expressions for producing a series of values usable in a for-loop or that can be retrieved one at a time with the :func:`next` function.
ru: Функция, которая возвращает :term:`итератор-генератор`. Она выглядит как обычная функция, за исключением того, что она содержит выражения :keyword:`yield` для создания серии значений, которые можно использовать в цикле for или которые можно получать по одному с помощью функции :func:`next`.

source: Usually refers to a generator function, but may refer to a *generator iterator* in some contexts. In cases where the intended meaning isn't clear, using the full terms avoids ambiguity.
ru: Обычно относится к функции-генератору, но в некоторых контекстах может относиться к *итератору-генератору*. В случаях, когда предполагаемое значение неясно, использование полных терминов позволяет избежать двусмысленности.

source: generator iterator
ru: генератор-итератор

source: An object created by a :term:`generator` function.
ru: Объект, созданный функцией :term:`generator`.

source: Each :keyword:`yield` temporarily suspends processing, remembering the location execution state (including local variables and pending try-statements). When the *generator iterator* resumes, it picks up where it left off (in contrast to functions which start fresh on every invocation).
ru: Каждый :keyword:`yield` временно приостанавливает обработку, запоминая состояние выполнения местоположения (включая локальные переменные и ожидающие операторы try). Когда *итератор-генератор* возобновляет работу, он продолжает работу с того места, где остановился (в отличие от функций, которые начинаются заново при каждом вызове).

source: generator expression
ru: генерирующее выражение

source: An expression that returns an iterator. It looks like a normal expression followed by a :keyword:`!for` clause defining a loop variable, range, and an optional :keyword:`!if` clause. The combined expression generates values for an enclosing function::
ru: Выражение, возвращающее итератор. Оно выглядит как обычное выражение, за которым следует предложение :keyword:`!for`, определяющее переменную цикла, диапазон, и необязательное предложение :keyword:`!if`. Комбинированное выражение генерирует значения для включающей функции::

source: generic function
ru: общая функция

source: A function composed of multiple functions implementing the same operation for different types. Which implementation should be used during a call is determined by the dispatch algorithm.
ru: Функция, состоящая из нескольких функций, реализующих одну и ту же операцию для разных типов. Какая реализация должна использоваться во время вызова, определяется алгоритмом диспетчеризации.

source: See also the :term:`single dispatch` glossary entry, the :func:`functools.singledispatch` decorator, and :pep:`443`.
ru: См. также статью в глоссарии :term:`single send`, декоратор :func:`functools.singledispatch` и :pep:`443`.

source: generic type
ru: обобщённый

source: A :term:`type` that can be parameterized; typically a :ref:`container class<sequence-types>` such as :class:`list` or :class:`dict`. Used for :term:`type hints <type hint>` and :term:`annotations <annotation>`.
ru: A :term:`type` который можно параметризовать; обычно это :ref:`container class<sequence-types>` , например :class:`list` или :class:`dict`. Используется для :term:`typehints <typehint>` и :term:`annotations <annotation>`.

source: For more details, see :ref:`generic alias types<types-genericalias>`, :pep:`483`, :pep:`484`, :pep:`585`, and the :mod:`typing` module.
ru: Дополнительные сведения см. в разделах :ref:`generic alias type<types-genericalias>`, :pep:`483`, :pep:`484`, :pep:`585` и модуле :mod:`typing`.

source: See :term:`global interpreter lock`.
ru: Смотри :term:`global interpreter lock`.

source: global interpreter lock
ru: глобальная блокировка интерпретатора

source: The mechanism used by the :term:`CPython` interpreter to assure that only one thread executes Python :term:`bytecode` at a time. This simplifies the CPython implementation by making the object model (including critical built-in types such as :class:`dict`) implicitly safe against concurrent access. Locking the entire interpreter makes it easier for the interpreter to be multi-threaded, at the expense of much of the parallelism afforded by multi-processor machines.
ru: Механизм, используемый интерпретатором :term:`CPython` для обеспечения того, чтобы только один поток выполнял Python :term:`bytecode` одновременно. Это упрощает реализацию CPython, делая объектную модель (включая важные встроенные типы, такие как :class:`dict`) неявно защищенной от одновременного доступа. Блокировка всего интерпретатора упрощает его многопоточную работу за счет большей части параллелизма, обеспечиваемого многопроцессорными машинами.

source: However, some extension modules, either standard or third-party, are designed so as to release the GIL when doing computationally intensive tasks such as compression or hashing. Also, the GIL is always released when doing I/O.
ru: Однако некоторые модули расширения, как стандартные, так и сторонние, разработаны таким образом, чтобы освобождать GIL при выполнении ресурсоемких задач, таких как сжатие или хеширование. Кроме того, GIL всегда освобождается при выполнении ввода-вывода.

source: Past efforts to create a "free-threaded" interpreter (one which locks shared data at a much finer granularity) have not been successful because performance suffered in the common single-processor case. It is believed that overcoming this performance issue would make the implementation much more complicated and therefore costlier to maintain.
ru: Предыдущие попытки создать интерпретатор со свободным потоком (тот, который блокирует общие данные с гораздо большей степенью детализации) не увенчались успехом, поскольку в обычном однопроцессорном случае снизилась производительность. Считается, что решение этой проблемы с производительностью сделает реализацию намного более сложной и, следовательно, более дорогостоящей в обслуживании.
