Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/glossary.po
Languages: ru

source: The term "named tuple" applies to any type or class that inherits from tuple and whose indexable elements are also accessible using named attributes. The type or class may have other features as well.
ru: Термин «именованный кортеж» применяется к любому типу или классу, который наследуется от кортежа и чьи индексируемые элементы также доступны с использованием именованных атрибутов. Тип или класс могут иметь и другие особенности.

source: Several built-in types are named tuples, including the values returned by :func:`time.localtime` and :func:`os.stat`. Another example is :data:`sys.float_info`::
ru: Несколько встроенных типов называются кортежами, включая значения, возвращаемые :func:`time.localtime` и :func:`os.stat`. Другой пример: :data:`sys.float_info`::

source: Some named tuples are built-in types (such as the above examples). Alternatively, a named tuple can be created from a regular class definition that inherits from :class:`tuple` and that defines named fields. Such a class can be written by hand, or it can be created by inheriting :class:`typing.NamedTuple`, or with the factory function :func:`collections.namedtuple`. The latter techniques also add some extra methods that may not be found in hand-written or built-in named tuples.
ru: Некоторые именованные кортежи являются встроенными типами (например, приведенные выше примеры). В качестве альтернативы именованный кортеж можно создать из определения обычного класса, который наследуется от :class:`tuple` и определяет именованные поля. Такой класс можно написать вручную или создать путем наследования :class:`typing.NamedTuple` или с помощью фабричной функции :func:`collections.namedtuple`. Последние методы также добавляют некоторые дополнительные методы, которых нет в рукописных или встроенных именованных кортежах.

source: namespace
ru: пространство имён

source: The place where a variable is stored. Namespaces are implemented as dictionaries. There are the local, global and built-in namespaces as well as nested namespaces in objects (in methods). Namespaces support modularity by preventing naming conflicts. For instance, the functions :func:`builtins.open <.open>` and :func:`os.open` are distinguished by their namespaces. Namespaces also aid readability and maintainability by making it clear which module implements a function. For instance, writing :func:`random.seed` or :func:`itertools.islice` makes it clear that those functions are implemented by the :mod:`random` and :mod:`itertools` modules, respectively.
ru: Место, где хранится переменная. Пространства имен реализованы как словари. Существуют локальные, глобальные и встроенные пространства имен, а также вложенные пространства имен в объектах (в методах). Пространства имен поддерживают модульность, предотвращая конфликты имен. Например, функции :func:`builtins.open <.open>` и :func:`os.open` различаются своими пространствами имен. Пространства имен также повышают читаемость и удобство обслуживания, поскольку ясно показывают, какой модуль реализует ту или иную функцию. Например, запись :func:`random.seed` или :func:`itertools.islice` дает понять, что эти функции реализуются модулями :mod:`random` и :mod:`itertools` соответственно.

source: namespace package
ru: пакет пространства имен

source: A :pep:`420` :term:`package` which serves only as a container for subpackages. Namespace packages may have no physical representation, and specifically are not like a :term:`regular package` because they have no ``__init__.py`` file.
ru: :pep:`420` :term:`package`, который служит только контейнером для подпакетов. Пакеты пространства имен могут не иметь физического представления и, в частности, не похожи на :term:`обычный пакет`, поскольку у них нет файла ``__init__.py``.

source: See also :term:`module`.
ru: см. также :term:`module`.

source: nested scope
ru: вложенная область видимости

source: The ability to refer to a variable in an enclosing definition. For instance, a function defined inside another function can refer to variables in the outer function. Note that nested scopes by default work only for reference and not for assignment. Local variables both read and write in the innermost scope. Likewise, global variables read and write to the global namespace. The :keyword:`nonlocal` allows writing to outer scopes.
ru: Возможность ссылаться на переменную во включающем определении. Например, функция, определенная внутри другой функции, может ссылаться на переменные внешней функции. Обратите внимание, что вложенные области по умолчанию работают только для ссылки, а не для назначения. Локальные переменные читают и записывают в самой внутренней области. Аналогично, глобальные переменные читают и записывают в глобальное пространство имен. :keyword:`nonlocal` позволяет выполнять запись во внешние области.

source: new-style class
ru: класс нового стиля

source: Old name for the flavor of classes now used for all class objects. In earlier Python versions, only new-style classes could use Python's newer, versatile features like :attr:`~object.__slots__`, descriptors, properties, :meth:`~object.__getattribute__`, class methods, and static methods.
ru: Старое название разновидности классов теперь используется для всех объектов классов. В более ранних версиях Python только классы нового стиля могли использовать новые универсальные функции Python, такие как :attr:`~object.__slots__`, дескрипторы, свойства, :meth:`~object.__getattribute__`, методы класса и статические методы.

source: object
ru: объект

source: Any data with state (attributes or value) and defined behavior (methods). Also the ultimate base class of any :term:`new-style class`.
ru: Любые данные с состоянием (атрибутами или значением) и определенным поведением (методами). Также окончательный базовый класс любого класса нового стиля.

source: package
ru: пакет

source: A Python :term:`module` which can contain submodules or recursively, subpackages. Technically, a package is a Python module with a ``__path__`` attribute.
ru: Python :term:`module`, который может содержать подмодули или рекурсивно подпакеты. Технически пакет представляет собой модуль Python с атрибутом ``__path__``.

source: See also :term:`regular package` and :term:`namespace package`.
ru: см. также :term:`regular package` и :term:`namespace package`.

source: parameter
ru: параметр

source: A named entity in a :term:`function` (or method) definition that specifies an :term:`argument` (or in some cases, arguments) that the function can accept. There are five kinds of parameter:
ru: Именованный объект в определении :term:`функции` (или метода), который определяет :term:`аргумент` (или, в некоторых случаях, аргументы), которые может принимать функция. Существует пять типов параметров:

source: :dfn:`positional-or-keyword`: specifies an argument that can be passed either :term:`positionally <argument>` or as a :term:`keyword argument <argument>`. This is the default kind of parameter, for example *foo* and *bar* in the following::
ru: :dfn:`positional-or-keyword`: определяет аргумент, который может быть передан либо :term:`позиционно <аргумент>`, либо как :term:`ключевой аргумент <аргумент>`. Это параметр по умолчанию, например *foo* и *bar* в следующем::

source: :dfn:`positional-only`: specifies an argument that can be supplied only by position. Positional-only parameters can be defined by including a ``/`` character in the parameter list of the function definition after them, for example *posonly1* and *posonly2* in the following::
ru: :dfn:`positional-only`: указывает аргумент, который может быть передан только по позиции. Параметры, предназначенные только для позиции, можно определить, включив символ ``/`` в список параметров определения функции после них, например *posonly1* и *posonly2* в следующем:

source: :dfn:`keyword-only`: specifies an argument that can be supplied only by keyword. Keyword-only parameters can be defined by including a single var-positional parameter or bare ``*`` in the parameter list of the function definition before them, for example *kw_only1* and *kw_only2* in the following::
ru: :dfn:`keyword-only`: указывает аргумент, который может быть передан только по ключевому слову. Параметры только по ключевому слову могут быть определены путем включения одного позиционного параметра или пустого ``*`` в список параметров определения функции перед ними, например *kw_only1* и *kw_only2* в следующем::

source: :dfn:`var-positional`: specifies that an arbitrary sequence of positional arguments can be provided (in addition to any positional arguments already accepted by other parameters). Such a parameter can be defined by prepending the parameter name with ``*``, for example *args* in the following::
ru: :dfn:`var-positional`: указывает, что может быть предоставлена ​​произвольная последовательность позиционных аргументов (в дополнение к любым позиционным аргументам, уже принятым другими параметрами). Такой параметр можно определить, добавив к имени параметра ``*``, например *args*, в следующем:

source: :dfn:`var-keyword`: specifies that arbitrarily many keyword arguments can be provided (in addition to any keyword arguments already accepted by other parameters). Such a parameter can be defined by prepending the parameter name with ``**``, for example *kwargs* in the example above.
ru: :dfn:`var-keyword`: указывает, что может быть предоставлено произвольное количество аргументов ключевого слова (в дополнение к любым аргументам ключевого слова, уже принятым другими параметрами). Такой параметр можно определить, добавив к имени параметра ``**``, например *kwargs* в приведенном выше примере.

source: Parameters can specify both optional and required arguments, as well as default values for some optional arguments.
ru: Параметры могут указывать как необязательные, так и обязательные аргументы, а также значения по умолчанию для некоторых необязательных аргументов.

source: See also the :term:`argument` glossary entry, the FAQ question on :ref:`the difference between arguments and parameters <faq-argument-vs-parameter>`, the :class:`inspect.Parameter` class, the :ref:`function` section, and :pep:`362`.
ru: См. также статью глоссария :term:`argument`, вопрос часто задаваемых вопросов по :ref:`разнице между аргументами и параметрами <faq-argument-vs-parameter>`, класс :class:`inspect.Parameter`, класс : раздел ref:`function` и :pep:`362`.

source: path entry
ru: элемент пути

source: A single location on the :term:`import path` which the :term:`path based finder` consults to find modules for importing.
ru: Единственное место на пути импорта, к которому обращается средство поиска на основе пути, чтобы найти модули для импорта.

source: path entry finder
ru: искатель в элементе пути

source: A :term:`finder` returned by a callable on :data:`sys.path_hooks` (i.e. a :term:`path entry hook`) which knows how to locate modules given a :term:`path entry`.
ru: A :term:`finder` , возвращаемый вызываемым объектом :data:`sys.path_hooks` (i.e. a :term:`path entry hook`) который знает, как найти модули по :term:`path входу`.

source: See :class:`importlib.abc.PathEntryFinder` for the methods that path entry finders implement.
ru: См. :class:`importlib.abc.PathEntryFinder` для получения информации о методах, которые реализуют средства поиска записей пути.

source: path entry hook
ru: перехватчик элемента пути

source: A callable on the :data:`sys.path_hooks` list which returns a :term:`path entry finder` if it knows how to find modules on a specific :term:`path entry`.
ru: Вызываемая функция в списке :data:`sys.path_hooks``, которая возвращает :term:`path entry finder` если он знает, как найти модули по определенной :term:`записи пути`.

source: path based finder
ru: искатель в путях

source: One of the default :term:`meta path finders <meta path finder>` which searches an :term:`import path` for modules.
ru: Один из средств поиска метапутей :term:`meta path finders <meta path finder>`, который ищет модули по пути импорта.

source: path-like object
ru: путеподобный объект

source: An object representing a file system path. A path-like object is either a :class:`str` or :class:`bytes` object representing a path, or an object implementing the :class:`os.PathLike` protocol. An object that supports the :class:`os.PathLike` protocol can be converted to a :class:`str` or :class:`bytes` file system path by calling the :func:`os.fspath` function; :func:`os.fsdecode` and :func:`os.fsencode` can be used to guarantee a :class:`str` or :class:`bytes` result instead, respectively. Introduced by :pep:`519`.
ru: Объект, представляющий путь к файловой системе. Объект, подобный пути, — это либо объект :class:`str` или :class:`bytes`, представляющий путь, либо объект, реализующий протокол :class:`os.PathLike`. Объект, поддерживающий протокол :class:`os.PathLike`, можно преобразовать в путь файловой системы :class:`str` или :class:`bytes`, вызвав функцию :func:`os.fspath`; Вместо этого можно использовать :func:`os.fsdecode` и :func:`os.fsencode`, чтобы гарантировать результат :class:`str` или :class:`bytes` соответственно. Представлено :pep:`519`.

source: Python Enhancement Proposal. A PEP is a design document providing information to the Python community, or describing a new feature for Python or its processes or environment. PEPs should provide a concise technical specification and a rationale for proposed features.
ru: Предложение по улучшению Python. PEP — это проектный документ, предоставляющий информацию сообществу Python или описывающий новую функцию Python, его процессов или среды. Политические деятели должны предоставить краткую техническую спецификацию и обоснование предлагаемых функций.

source: PEPs are intended to be the primary mechanisms for proposing major new features, for collecting community input on an issue, and for documenting the design decisions that have gone into Python. The PEP author is responsible for building consensus within the community and documenting dissenting opinions.
ru: PEP призваны стать основными механизмами предложения крупных новых функций, сбора мнений сообщества по проблеме и документирования проектных решений, вошедших в Python. Автор PEP отвечает за достижение консенсуса внутри сообщества и документирование несогласных мнений.

source: See :pep:`1`.
ru: Смотри :pep:`1`.

source: portion
ru: порция

source: A set of files in a single directory (possibly stored in a zip file) that contribute to a namespace package, as defined in :pep:`420`.
ru: Набор файлов в одном каталоге (возможно, хранящихся в zip-файле), которые составляют пакет пространства имен, как определено в :pep:`420`.

source: positional argument
ru: позиционный аргумент

source: provisional API
ru: предварительный API

source: A provisional API is one which has been deliberately excluded from the standard library's backwards compatibility guarantees. While major changes to such interfaces are not expected, as long as they are marked provisional, backwards incompatible changes (up to and including removal of the interface) may occur if deemed necessary by core developers. Such changes will not be made gratuitously -- they will occur only if serious fundamental flaws are uncovered that were missed prior to the inclusion of the API.
ru: Временный API — это API, который был намеренно исключен из гарантий обратной совместимости стандартной библиотеки. Хотя серьезных изменений в таких интерфейсах не ожидается, пока они помечены как временные, могут произойти обратно несовместимые изменения (вплоть до удаления интерфейса), если основные разработчики сочтут это необходимым. Такие изменения не будут вноситься безвозмездно — они произойдут только в том случае, если будут обнаружены серьезные фундаментальные недостатки, которые были упущены до включения API.

source: Even for provisional APIs, backwards incompatible changes are seen as a "solution of last resort" - every attempt will still be made to find a backwards compatible resolution to any identified problems.
ru: Даже для предварительных API изменения, несовместимые с предыдущими версиями, рассматриваются как «решение последней инстанции» — все равно будут предприняты все попытки найти обратно совместимое решение для любых выявленных проблем.

source: This process allows the standard library to continue to evolve over time, without locking in problematic design errors for extended periods of time. See :pep:`411` for more details.
ru: Этот процесс позволяет стандартной библиотеке продолжать развиваться с течением времени, не допуская проблемных ошибок проектирования на длительные периоды времени. См. :pep:`411` для более подробной информации.

source: provisional package
ru: предварительный пакет

source: See :term:`provisional API`.
ru: Смотри :term:`provisional API`.

source: Nickname for the Python 3.x release line (coined long ago when the release of version 3 was something in the distant future.) This is also abbreviated "Py3k".
ru: Псевдоним для линейки выпуска Python 3.x (придуман давно, когда выпуск версии 3 был чем-то отдаленным). Это также сокращенно «Py3k».

source: Pythonic
ru: идиоматический

source: An idea or piece of code which closely follows the most common idioms of the Python language, rather than implementing code using concepts common to other languages. For example, a common idiom in Python is to loop over all elements of an iterable using a :keyword:`for` statement. Many other languages don't have this type of construct, so people unfamiliar with Python sometimes use a numerical counter instead::
ru: Идея или фрагмент кода, который точно соответствует наиболее распространенным идиомам языка Python, а не реализует код с использованием концепций, общих для других языков. Например, распространенной идиомой в Python является цикл по всем элементам итерируемого объекта с использованием оператора :keyword:`for`. Многие другие языки не имеют конструкции такого типа, поэтому люди, незнакомые с Python, иногда вместо этого используют числовой счетчик:

source: As opposed to the cleaner, Pythonic method::
ru: В отличие от более чистого, идиоматического метода::

source: qualified name
ru: полное имя

source: A dotted name showing the "path" from a module's global scope to a class, function or method defined in that module, as defined in :pep:`3155`. For top-level functions and classes, the qualified name is the same as the object's name::
ru: Имя с точками, показывающее «путь» от глобальной области видимости модуля к классу, функции или методу, определенному в этом модуле, как определено в :pep:`3155`. Для функций и классов верхнего уровня полное имя совпадает с именем объекта::

source: When used to refer to modules, the *fully qualified name* means the entire dotted path to the module, including any parent packages, e.g. ``email.mime.text``::
ru: При использовании для ссылки на модули *полное имя* означает полный путь к модулю, включая все родительские пакеты, например ``email.mime.text``::

source: reference count
ru: счётчик ссылок

source: regular package
ru: обычный пакет

source: A traditional :term:`package`, such as a directory containing an ``__init__.py`` file.
ru: Традиционный :term:`пакет`, например каталог, содержащий файл __init__.py``.

source: See also :term:`namespace package`.
ru: см. также :term:`namespace package`.

source: A declaration inside a class that saves memory by pre-declaring space for instance attributes and eliminating instance dictionaries. Though popular, the technique is somewhat tricky to get right and is best reserved for rare cases where there are large numbers of instances in a memory-critical application.
ru: Объявление внутри класса, которое экономит память за счет предварительного объявления места для атрибутов экземпляра и исключения словарей экземпляра. Несмотря на свою популярность, этот метод несколько сложен в освоении, и его лучше использовать в редких случаях, когда в приложении, критически важном к памяти, имеется большое количество экземпляров.

source: sequence
ru: последовательность

source: The :class:`collections.abc.Sequence` abstract base class defines a much richer interface that goes beyond just :meth:`~object.__getitem__` and :meth:`~object.__len__`, adding :meth:`!count`, :meth:`!index`, :meth:`~object.__contains__`, and :meth:`~object.__reversed__`. Types that implement this expanded interface can be registered explicitly using :func:`~abc.ABCMeta.register`. For more documentation on sequence methods generally, see :ref:`Common Sequence Operations <typesseq-common>`.
ru: Абстрактный базовый класс :class:`collections.abc.Sequence` определяет гораздо более богатый интерфейс, который выходит за рамки просто :meth:`~object.__getitem__` и :meth:`~object.__len__`, добавляя :meth:`!count `, :meth:`!index`, :meth:`~object.__contains__` и :meth:`~object.__reversed__`. Типы, реализующие этот расширенный интерфейс, могут быть зарегистрированы явно с помощью :func:`~abc.ABCMeta.register`. Дополнительную документацию по методам последовательности см. в разделе «Общие операции с последовательностями <typesseq-common>».

source: set comprehension
ru: установленное включение

source: A compact way to process all or part of the elements in an iterable and return a set with the results. ``results = {c for c in 'abracadabra' if c not in 'abc'}`` generates the set of strings ``{'r', 'd'}``. See :ref:`comprehensions`.
ru: Компактный способ обработки всех или части элементов в итерации и возврата набора с результатами. ``results = {c for c в 'abracadabra', если c не в 'abc'}`` генерирует набор строк ``{'r', 'd'}``. См. :ref:`понимания`.

source: single dispatch
ru: одиночная диспетчеризация

source: A form of :term:`generic function` dispatch where the implementation is chosen based on the type of a single argument.
ru: Форма отправки :term:`generic function`, где реализация выбирается на основе типа одного аргумента.

source: slice
ru: срез

source: An object usually containing a portion of a :term:`sequence`. A slice is created using the subscript notation, ``[]`` with colons between numbers when several are given, such as in ``variable_name[1:3:5]``. The bracket (subscript) notation uses :class:`slice` objects internally.
ru: Объект, обычно содержащий часть :term:`последовательности`. Срез создается с использованием индексной записи ``[]`` с двоеточиями между числами, если их несколько, например, в ``имя_переменной[1:3:5]``. В скобках (индексе) внутри используются объекты :class:`slice`.

source: special method
ru: специальный метод

source: A method that is called implicitly by Python to execute a certain operation on a type, such as addition. Such methods have names starting and ending with double underscores. Special methods are documented in :ref:`specialnames`.
ru: Метод, который Python неявно вызывает для выполнения определенной операции над типом, например сложения. Такие методы имеют имена, начинающиеся и заканчивающиеся двойным подчеркиванием. Специальные методы описаны в :ref:`specialnames`.

source: statement
ru: инструкция

source: A statement is part of a suite (a "block" of code). A statement is either an :term:`expression` or one of several constructs with a keyword, such as :keyword:`if`, :keyword:`while` or :keyword:`for`.
ru: Оператор является частью пакета («блока» кода). Оператор представляет собой либо :term:`expression`, либо одну из нескольких конструкций с ключевым словом, например :keyword:`if`, :keyword:` while` или :keyword:`for`.

source: static type checker
ru: проверка статического типа

source: An external tool that reads Python code and analyzes it, looking for issues such as incorrect types. See also :term:`type hints <type hint>` and the :mod:`typing` module.
ru: Внешний инструмент, который читает код Python и анализирует его, выявляя такие проблемы, как неправильные типы. См. также :term:`typehints <typehint>` и модуль :mod:`typing`.
