Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/glossary.po
Languages: ru

source: strong reference
ru: сильная ссылка

source: In Python's C API, a strong reference is a reference to an object which is owned by the code holding the reference. The strong reference is taken by calling :c:func:`Py_INCREF` when the reference is created and released with :c:func:`Py_DECREF` when the reference is deleted.
ru: В API C Python сильная ссылка — это ссылка на объект, владельцем которого является код, содержащий ссылку. Сильная ссылка берется путем вызова :c:func:`Py_INCREF` при создании ссылки и освобождается с помощью :c:func:`Py_DECREF` при удалении ссылки.

source: The :c:func:`Py_NewRef` function can be used to create a strong reference to an object. Usually, the :c:func:`Py_DECREF` function must be called on the strong reference before exiting the scope of the strong reference, to avoid leaking one reference.
ru: Функцию :c:func:`Py_NewRef` можно использовать для создания сильной ссылки на объект. Обычно функцию :c:func:`Py_DECREF` необходимо вызывать для сильной ссылки перед выходом из области действия сильной ссылки, чтобы избежать утечки одной ссылки.

source: See also :term:`borrowed reference`.
ru: См. также :term:`borrowed reference`.

source: text encoding
ru: кодировка текста

source: A string in Python is a sequence of Unicode code points (in range ``U+0000``--``U+10FFFF``). To store or transfer a string, it needs to be serialized as a sequence of bytes.
ru: Строка в Python представляет собой последовательность кодовых точек Unicode (в диапазоне ``U+0000``--``U+10FFFF``). Чтобы сохранить или передать строку, ее необходимо сериализовать как последовательность байтов.

source: Serializing a string into a sequence of bytes is known as "encoding", and recreating the string from the sequence of bytes is known as "decoding".
ru: Сериализация строки в последовательность байтов называется «кодированием», а воссоздание строки из последовательности байтов называется «декодированием».

source: There are a variety of different text serialization :ref:`codecs <standard-encodings>`, which are collectively referred to as "text encodings".
ru: Существует множество различных сериализаций текста :ref:`кодеков <standard-encodings>`, которые в совокупности называются «текстовыми кодировками».

source: text file
ru: текстовый файл

source: A :term:`file object` able to read and write :class:`str` objects. Often, a text file actually accesses a byte-oriented datastream and handles the :term:`text encoding` automatically. Examples of text files are files opened in text mode (``'r'`` or ``'w'``), :data:`sys.stdin`, :data:`sys.stdout`, and instances of :class:`io.StringIO`.
ru: Объект :term:`file`, способный читать и записывать объекты :class:`str`. Часто текстовый файл фактически обращается к байтовому потоку данных и автоматически обрабатывает кодировку текста. Примерами текстовых файлов являются файлы, открытые в текстовом режиме (``'r'`` или ``'w'``), :data:`sys.stdin`, :data:`sys.stdout` и экземпляры: класс:`io.StringIO`.

source: See also :term:`binary file` for a file object able to read and write :term:`bytes-like objects <bytes-like object>`.
ru: См. также :term:`двоичный файл` для описания файлового объекта, способного читать и записывать :term:`байтоподобные объекты <байтоподобный объект>`.

source: triple-quoted string
ru: строка в тройных кавычках

source: A string which is bound by three instances of either a quotation mark (") or an apostrophe ('). While they don't provide any functionality not available with single-quoted strings, they are useful for a number of reasons. They allow you to include unescaped single and double quotes within a string and they can span multiple lines without the use of the continuation character, making them especially useful when writing docstrings.
ru: Строка, которая связана тремя экземплярами кавычки (") или апострофа ('). Хотя они не предоставляют каких-либо функций, недоступных для строк в одинарных кавычках, они полезны по ряду причин. Они позволяют вы можете включать в строку неэкранированные одинарные и двойные кавычки, и они могут охватывать несколько строк без использования символа продолжения, что делает их особенно полезными при написании строк документации.

source: type
ru: тип

source: type alias
ru: псевдоним типа

source: A synonym for a type, created by assigning the type to an identifier.
ru: Синоним типа, созданный путем присвоения этому типу идентификатора.

source: Type aliases are useful for simplifying :term:`type hints <type hint>`. For example::
ru: Псевдонимы типов полезны для упрощения :term:`typehints <typehint>`. Например::

source: could be made more readable like this::
ru: можно было бы сделать более читабельным вот так::

source: type hint
ru: введите подсказку

source: An :term:`annotation` that specifies the expected type for a variable, a class attribute, or a function parameter or return value.
ru: :term:`annotation`, указывающая ожидаемый тип переменной, атрибута класса или параметра функции или возвращаемого значения.

source: Type hints are optional and are not enforced by Python but they are useful to :term:`static type checkers <static type checker>`. They can also aid IDEs with code completion and refactoring.
ru: Type hints are optional and are not enforced by Python but they are useful to :term:`static type checkers <static type checker>`. They can also aid IDEs with code completion and refactoring. Подсказки типов не являются обязательными и не применяются Python, но они полезны для :term:`static type checkers <static type checker>``. Они также могут помочь IDE в дополнении кода и рефакторинге.

source: Type hints of global variables, class attributes, and functions, but not local variables, can be accessed using :func:`typing.get_type_hints`.
ru: Доступ к подсказкам типов глобальных переменных, атрибутов классов и функций, но не локальных переменных, можно получить с помощью :func:`typing.get_type_hints`.

source: universal newlines
ru: универсальные переводы строк

source: A manner of interpreting text streams in which all of the following are recognized as ending a line: the Unix end-of-line convention ``'\n'``, the Windows convention ``'\r\n'``, and the old Macintosh convention ``'\r'``. See :pep:`278` and :pep:`3116`, as well as :func:`bytes.splitlines` for an additional use.
ru: Способ интерпретации текстовых потоков, при котором все следующее распознается как завершение строки: соглашение Unix о конце строки ``'\n'``, соглашение Windows ``'\r\n'``, и старое соглашение Macintosh ``'\r'``. См. :pep:`278` и :pep:`3116`, а также :func:`bytes.splitlines` для дополнительного использования.

source: variable annotation
ru: переменная аннотация

source: An :term:`annotation` of a variable or a class attribute.
ru: :term:`annotation` к переменной или атрибуту класса.

source: When annotating a variable or a class attribute, assignment is optional::
ru: При аннотации переменной или атрибута класса присвоение не является обязательным::

source: Variable annotations are usually used for :term:`type hints <type hint>`: for example this variable is expected to take :class:`int` values::
ru: Аннотации переменных обычно используются для :term:`typehints <typehint>`: например, ожидается, что эта переменная будет принимать значения :class:`int`::

source: Variable annotation syntax is explained in section :ref:`annassign`.
ru: Синтаксис аннотаций переменных описан в разделе :ref:`annassign`.

source: See :term:`function annotation`, :pep:`484` and :pep:`526`, which describe this functionality. Also see :ref:`annotations-howto` for best practices on working with annotations.
ru: См. :term:`function annotation`, :pep:`484` и :pep:`526`, которые описывают эту функциональность. Также см. :ref:`annotations-howto` для получения рекомендаций по работе с аннотациями.

source: virtual environment
ru: виртуальное окружение

source: A cooperatively isolated runtime environment that allows Python users and applications to install and upgrade Python distribution packages without interfering with the behaviour of other Python applications running on the same system.
ru: См. :term:`function annotation`, :pep:`484` и :pep:`526`, которые описывают эту функциональность. Также см. :ref:`annotations-howto` для получения рекомендаций по работе с аннотациями.

source: See also :mod:`venv`.
ru: см. также :mod:`venv`.

source: virtual machine
ru: виртуальная машина

source: A computer defined entirely in software. Python's virtual machine executes the :term:`bytecode` emitted by the bytecode compiler.
ru: Компьютер полностью определяется программным обеспечением. Виртуальная машина Python выполняет :term:`байт-код`, созданный компилятором байт-кода.

source: Zen of Python
ru: Дзен Python

source: Listing of Python design principles and philosophies that are helpful in understanding and using the language. The listing can be found by typing "``import this``" at the interactive prompt.
ru: Список принципов и философий проектирования Python, которые помогут понять и использовать язык. Список можно найти, набрав «``import this``» в интерактивной подсказке.

source: C-contiguous
ru: С-непрерывный

source: Fortran contiguous
ru: Непрерывность Fortran

source: magic
ru: магия

source: special
ru: особенный
