Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/glossary.po
Languages: ru

source: hash-based pyc
ru: pyc на основе хэша

source: A bytecode cache file that uses the hash rather than the last-modified time of the corresponding source file to determine its validity. See :ref:`pyc-invalidation`.
ru: Файл кэша байт-кода, который использует хэш, а не время последнего изменения соответствующего исходного файла для определения его достоверности. См. :ref:`pyc-invalidation`.

source: hashable
ru: хэшируемый

source: An object is *hashable* if it has a hash value which never changes during its lifetime (it needs a :meth:`~object.__hash__` method), and can be compared to other objects (it needs an :meth:`~object.__eq__` method). Hashable objects which compare equal must have the same hash value.
ru: Объект является *хешируемым*, если он имеет хеш-значение, которое никогда не меняется в течение его существования (для этого требуется метод :meth:`~object.__hash__`) и его можно сравнивать с другими объектами (для этого нужен :meth:`~ метод object.__eq__`). Хешируемые объекты, которые сравниваются равными, должны иметь одинаковое значение хеш-функции.

source: Hashability makes an object usable as a dictionary key and a set member, because these data structures use the hash value internally.
ru: Хешируемость делает объект пригодным для использования в качестве ключа словаря и члена множества, поскольку эти структуры данных внутренне используют хеш-значение.

source: Most of Python's immutable built-in objects are hashable; mutable containers (such as lists or dictionaries) are not; immutable containers (such as tuples and frozensets) are only hashable if their elements are hashable. Objects which are instances of user-defined classes are hashable by default. They all compare unequal (except with themselves), and their hash value is derived from their :func:`id`.
ru: Большинство неизменяемых встроенных объектов Python являются хешируемыми; изменяемые контейнеры (такие как списки или словари) — нет; неизменяемые контейнеры (такие как кортежи и замороженные наборы) хешируются только в том случае, если их элементы хешируются. Объекты, являющиеся экземплярами пользовательских классов, по умолчанию хешируются. Все они сравниваются неравными (кроме самих себя), а их хеш-значение получается из их :func:`id`.

source: An Integrated Development and Learning Environment for Python. :ref:`idle` is a basic editor and interpreter environment which ships with the standard distribution of Python.
ru: Большинство неизменяемых встроенных объектов Python являются хешируемыми; изменяемые контейнеры (такие как списки или словари) — нет; неизменяемые контейнеры (такие как кортежи и замороженные наборы) хешируются только в том случае, если их элементы хешируются. Объекты, являющиеся экземплярами пользовательских классов, по умолчанию хешируются. Все они сравниваются неравными (кроме самих себя), а их хеш-значение получается из их :func:`id`.

source: immutable
ru: неизменяемый

source: An object with a fixed value. Immutable objects include numbers, strings and tuples. Such an object cannot be altered. A new object has to be created if a different value has to be stored. They play an important role in places where a constant hash value is needed, for example as a key in a dictionary.
ru: Объект с фиксированной стоимостью. Неизменяемые объекты включают числа, строки и кортежи. Такой объект невозможно изменить. Если необходимо сохранить другое значение, необходимо создать новый объект. Они играют важную роль там, где требуется постоянное значение хеш-функции, например, в качестве ключа в словаре.

source: import path
ru: путь импорта

source: A list of locations (or :term:`path entries <path entry>`) that are searched by the :term:`path based finder` for modules to import. During import, this list of locations usually comes from :data:`sys.path`, but for subpackages it may also come from the parent package's ``__path__`` attribute.
ru: Список местоположений (или записей :term:`path <path input>`), в которых с помощью средства поиска на основе пути :term:`path` выполняется поиск модулей для импорта. Во время импорта этот список расположений обычно берется из :data:`sys.path`, но для подпакетов он также может быть получен из атрибута ``__path__`` родительского пакета.

source: importing
ru: импортирование

source: The process by which Python code in one module is made available to Python code in another module.
ru: Процесс, посредством которого код Python в одном модуле становится доступным для кода Python в другом модуле.

source: importer
ru: импортер

source: An object that both finds and loads a module; both a :term:`finder` and :term:`loader` object.
ru: Объект, который находит и загружает модуль; оба объекта :term:`finder` и :term:`loader`.

source: interactive
ru: интерактивный

source: Python has an interactive interpreter which means you can enter statements and expressions at the interpreter prompt, immediately execute them and see their results. Just launch ``python`` with no arguments (possibly by selecting it from your computer's main menu). It is a very powerful way to test out new ideas or inspect modules and packages (remember ``help(x)``).
ru: Python имеет интерактивный интерпретатор, что означает, что вы можете вводить операторы и выражения в приглашении интерпретатора, немедленно выполнять их и видеть результаты. Просто запустите Python без аргументов (возможно, выбрав его в главном меню вашего компьютера). Это очень мощный способ протестировать новые идеи или проверить модули и пакеты (помните ``help(x)``).

source: interpreted
ru: интерпретированный

source: Python is an interpreted language, as opposed to a compiled one, though the distinction can be blurry because of the presence of the bytecode compiler. This means that source files can be run directly without explicitly creating an executable which is then run. Interpreted languages typically have a shorter development/debug cycle than compiled ones, though their programs generally also run more slowly. See also :term:`interactive`.
ru: Python — это интерпретируемый язык, а не компилируемый, хотя различие может быть размытым из-за наличия компилятора байт-кода. Это означает, что исходные файлы можно запускать напрямую, без явного создания исполняемого файла, который затем запускается. Интерпретируемые языки обычно имеют более короткий цикл разработки/отладки, чем скомпилированные, хотя их программы обычно работают медленнее. См. также:term:`интерактивный`.

source: interpreter shutdown
ru: остановка интерпретатора

source: When asked to shut down, the Python interpreter enters a special phase where it gradually releases all allocated resources, such as modules and various critical internal structures. It also makes several calls to the :term:`garbage collector <garbage collection>`. This can trigger the execution of code in user-defined destructors or weakref callbacks. Code executed during the shutdown phase can encounter various exceptions as the resources it relies on may not function anymore (common examples are library modules or the warnings machinery).
ru: Когда интерпретатор Python получает запрос на выключение, он переходит в специальную фазу, в которой он постепенно освобождает все выделенные ресурсы, такие как модули и различные важные внутренние структуры. Он также выполняет несколько вызовов :term:`сборщика мусора <сборка мусора>`. Это может вызвать выполнение кода в пользовательских деструкторах или обратных вызовах слабых ссылок. Код, выполняемый на этапе завершения работы, может столкнуться с различными исключениями, поскольку ресурсы, на которые он опирается, могут больше не функционировать (обычными примерами являются библиотечные модули или механизмы предупреждений).

source: The main reason for interpreter shutdown is that the ``__main__`` module or the script being run has finished executing.
ru: Основная причина завершения работы интерпретатора заключается в том, что модуль ``__main__`` или выполняемый скрипт завершили выполнение.

source: iterable
ru: итерируемый объект

source: An object capable of returning its members one at a time. Examples of iterables include all sequence types (such as :class:`list`, :class:`str`, and :class:`tuple`) and some non-sequence types like :class:`dict`, :term:`file objects <file object>`, and objects of any classes you define with an :meth:`~iterator.__iter__` method or with a :meth:`~object.__getitem__` method that implements :term:`sequence` semantics.
ru: Объект, способный возвращать свои члены по одному. Примеры итераций включают все типы последовательностей (такие как :class:`list`, :class:`str` и :class:`tuple`) и некоторые не-последовательные типы, такие как :class:`dict`, :term:` файловые объекты <file object>` и объекты любых классов, которые вы определяете с помощью метода :meth:`~iterator.__iter__` или с помощью метода :meth:`~object.__getitem__`, который реализует семантику :term:`sequence`.

source: Iterables can be used in a :keyword:`for` loop and in many other places where a sequence is needed (:func:`zip`, :func:`map`, ...). When an iterable object is passed as an argument to the built-in function :func:`iter`, it returns an iterator for the object. This iterator is good for one pass over the set of values. When using iterables, it is usually not necessary to call :func:`iter` or deal with iterator objects yourself. The :keyword:`for` statement does that automatically for you, creating a temporary unnamed variable to hold the iterator for the duration of the loop. See also :term:`iterator`, :term:`sequence`, and :term:`generator`.
ru: Итерации можно использовать в цикле :keyword:`for` и во многих других местах, где необходима последовательность (:func:`zip`, :func:`map`, ...). Когда итерируемый объект передается в качестве аргумента встроенной функции :func:`iter`, она возвращает итератор для объекта. Этот итератор хорош для одного прохода по набору значений. При использовании итераторов обычно нет необходимости вызывать :func:`iter` или самостоятельно работать с объектами-итераторами. Оператор :keyword:`for` делает это автоматически, создавая временную безымянную переменную для хранения итератора на протяжении всего цикла. См. также :term:`iterator`, :term:`sequence` и :term:`generator`.

source: iterator
ru: итератор

source: An object representing a stream of data. Repeated calls to the iterator's :meth:`~iterator.__next__` method (or passing it to the built-in function :func:`next`) return successive items in the stream. When no more data are available a :exc:`StopIteration` exception is raised instead. At this point, the iterator object is exhausted and any further calls to its :meth:`!__next__` method just raise :exc:`StopIteration` again. Iterators are required to have an :meth:`~iterator.__iter__` method that returns the iterator object itself so every iterator is also iterable and may be used in most places where other iterables are accepted. One notable exception is code which attempts multiple iteration passes. A container object (such as a :class:`list`) produces a fresh new iterator each time you pass it to the :func:`iter` function or use it in a :keyword:`for` loop. Attempting this with an iterator will just return the same exhausted iterator object used in the previous iteration pass, making it appear like an empty container.
ru: Объект, представляющий поток данных. Повторные вызовы метода итератора :meth:`~iterator.__next__` (или передача его встроенной функции :func:`next`) возвращают последовательные элементы в потоке. Когда больше нет доступных данных, вместо этого возникает исключение :exc:`StopIteration`. На этом этапе объект итератора исчерпан, и любые дальнейшие вызовы его метода :meth:`!__next__` просто снова вызовут :exc:`StopIteration`. Итераторы должны иметь метод :meth:`~iterator.__iter__`, который возвращает сам объект итератора, поэтому каждый итератор также является итерируемым и может использоваться в большинстве мест, где принимаются другие итераторы. Одним заметным исключением является код, который пытается выполнить несколько итераций. Объект-контейнер (например, :class:`list`) создает новый новый итератор каждый раз, когда вы передаете его функции :func:`iter` или используете его в цикле :keyword:`for`. Попытка сделать это с помощью итератора просто вернет тот же самый исчерпанный объект итератора, который использовался на предыдущем проходе итерации, делая его похожим на пустой контейнер.

source: More information can be found in :ref:`typeiter`.
ru: Более подробную информацию можно найти по ссылке :ref:`typeiter`.

source: CPython does not consistently apply the requirement that an iterator define :meth:`~iterator.__iter__`.
ru: CPython не всегда последовательно применяет требование, чтобы итератор определял :meth:`~iterator.__iter__`.

source: key function
ru: функция ключа

source: A key function or collation function is a callable that returns a value used for sorting or ordering. For example, :func:`locale.strxfrm` is used to produce a sort key that is aware of locale specific sort conventions.
ru: Ключевая функция или функция сопоставления — это вызываемый объект, который возвращает значение, используемое для сортировки или упорядочивания. Например, :func:`locale.strxfrm` используется для создания ключа сортировки, который учитывает соглашения о сортировке, специфичные для локали.

source: A number of tools in Python accept key functions to control how elements are ordered or grouped. They include :func:`min`, :func:`max`, :func:`sorted`, :meth:`list.sort`, :func:`heapq.merge`, :func:`heapq.nsmallest`, :func:`heapq.nlargest`, and :func:`itertools.groupby`.
ru: Ряд инструментов Python поддерживают ключевые функции для управления упорядочением или группировкой элементов. К ним относятся :func:`min`, :func:`max`, :func:`sorted`, :meth:`list.sort`, :func:`heapq.merge`, :func:`heapq.nsmallest`, :func:`heapq.nlargest` и :func:`itertools.groupby`.

source: There are several ways to create a key function. For example. the :meth:`str.lower` method can serve as a key function for case insensitive sorts. Alternatively, a key function can be built from a :keyword:`lambda` expression such as ``lambda r: (r[0], r[2])``. Also, :func:`operator.attrgetter`, :func:`operator.itemgetter`, and :func:`operator.methodcaller` are three key function constructors. See the :ref:`Sorting HOW TO <sortinghowto>` for examples of how to create and use key functions.
ru: Существует несколько способов создания ключевой функции. Например. метод :meth:`str.lower` может служить ключевой функцией для сортировок без учета регистра. Альтернативно, ключевая функция может быть построена из выражения :keyword:`lambda`, например ``lambda r: (r[0], r[2])``. Кроме того, :func:`operator.attrgetter`, :func:`operator.itemgetter` и :func:`operator.methodcaller` являются тремя ключевыми конструкторами функций. См. :ref:`Sorting HOW TO <sortinghowto>` для примеров того, как создавать и использовать ключевые функции.

source: keyword argument
ru: именованный аргумент

source: See :term:`argument`.
ru: Смотри :term:`argument`.

source: lambda
ru: лямбда

source: An anonymous inline function consisting of a single :term:`expression` which is evaluated when the function is called. The syntax to create a lambda function is ``lambda [parameters]: expression``
ru: Анонимная встроенная функция, состоящая из одного :term:`expression`, которое вычисляется при вызове функции. Синтаксис для создания лямбда-функции: ``лямбда [параметры]: выражение``.

source: Look before you leap. This coding style explicitly tests for pre-conditions before making calls or lookups. This style contrasts with the :term:`EAFP` approach and is characterized by the presence of many :keyword:`if` statements.
ru: Посмотрите, прежде чем прыгнуть. Этот стиль кодирования явно проверяет предварительные условия перед выполнением вызовов или поиска. Этот стиль контрастирует с подходом :term:`EAFP` и характеризуется наличием множества операторов :keyword:`if`.

source: In a multi-threaded environment, the LBYL approach can risk introducing a race condition between "the looking" and "the leaping". For example, the code, ``if key in mapping: return mapping[key]`` can fail if another thread removes *key* from *mapping* after the test, but before the lookup. This issue can be solved with locks or by using the EAFP approach.
ru: В многопоточной среде подход LBYL может привести к возникновению состояния гонки между «смотрением» и «прыжком». Например, код ``if key in Mapping: return Mapping[key]`` может привести к сбою, если другой поток удалит *key* из *mapping* после теста, но до поиска. Эту проблему можно решить с помощью блокировок или с помощью подхода EAFP.

source: list
ru: список

source: A built-in Python :term:`sequence`. Despite its name it is more akin to an array in other languages than to a linked list since access to elements is *O*\ (1).
ru: Встроенный Python :term:`sequence`. Несмотря на свое название, в других языках он больше похож на массив, чем на связанный список, поскольку доступ к элементам осуществляется через *O*\ (1).

source: list comprehension
ru: списковое включение

source: A compact way to process all or part of the elements in a sequence and return a list with the results. ``result = ['{:#04x}'.format(x) for x in range(256) if x % 2 == 0]`` generates a list of strings containing even hex numbers (0x..) in the range from 0 to 255. The :keyword:`if` clause is optional. If omitted, all elements in ``range(256)`` are processed.
ru: Компактный способ обработки всех или части элементов последовательности и возврата списка с результатами. ``result = ['{:#04x}'.format(x) for x in range(256) if x % 2 == 0]`` генерирует список строк, содержащих четные шестнадцатеричные числа (0x..) в диапазон от 0 до 255. Предложение :keyword:`if` не является обязательным. Если этот параметр опущен, обрабатываются все элементы в диапазоне (256).

source: loader
ru: загрузчик

source: locale encoding
ru: кодировка локали

source: On Unix, it is the encoding of the LC_CTYPE locale. It can be set with :func:`locale.setlocale(locale.LC_CTYPE, new_locale) <locale.setlocale>`.
ru: В Unix это кодировка локали LC_CTYPE. Его можно установить с помощью :func:`locale.setlocale(locale.LC_CTYPE, new_locale) <locale.setlocale>`.

source: On Windows, it is the ANSI code page (ex: ``"cp1252"``).
ru: В Windows это кодовая страница ANSI (например: ``"cp1252"``).

source: On Android and VxWorks, Python uses ``"utf-8"`` as the locale encoding.
ru: В Android и VxWorks Python использует «utf-8» в качестве кодировки локали.

source: :func:`locale.getencoding` can be used to get the locale encoding.
ru: :func:`locale.getencoding` можно использовать для получения кодировки локали.

source: See also the :term:`filesystem encoding and error handler`.
ru: См. также :term:`кодирование файловой системы и обработчик ошибок`.

source: magic method
ru: магический метод

source: An informal synonym for :term:`special method`.
ru: Неформальный синоним термина «специальный метод».

source: mapping
ru: сопоставление

source: A container object that supports arbitrary key lookups and implements the methods specified in the :class:`collections.abc.Mapping` or :class:`collections.abc.MutableMapping` :ref:`abstract base classes <collections-abstract-base-classes>`. Examples include :class:`dict`, :class:`collections.defaultdict`, :class:`collections.OrderedDict` and :class:`collections.Counter`.
ru: Объект-контейнер, который поддерживает поиск по произвольным ключам и реализует методы, указанные в :class:`collections.abc.Mapping` или :class:`collections.abc.MutableMapping` :ref:`abstract базовых классах <collections-abstract-base- классы>`. Примеры: :class:`dict`, :class:`collections.defaultdict`, :class:`collections.OrderedDict` и :class:`collections.Counter`.

source: meta path finder
ru: искатель в мета-пути

source: A :term:`finder` returned by a search of :data:`sys.meta_path`. Meta path finders are related to, but different from :term:`path entry finders <path entry finder>`.
ru: A :term:`finder` r возвращается при поиске :data:`sys.meta_path`. Средства поиска метапутей связаны с :term:`path entry finders <path entry finder>`, но отличаются от них.

source: See :class:`importlib.abc.MetaPathFinder` for the methods that meta path finders implement.
ru: См. :class:`importlib.abc.MetaPathFinder` для получения информации о методах, которые реализуют средства поиска метапутей.

source: metaclass
ru: метакласс

source: The class of a class. Class definitions create a class name, a class dictionary, and a list of base classes. The metaclass is responsible for taking those three arguments and creating the class. Most object oriented programming languages provide a default implementation. What makes Python special is that it is possible to create custom metaclasses. Most users never need this tool, but when the need arises, metaclasses can provide powerful, elegant solutions. They have been used for logging attribute access, adding thread-safety, tracking object creation, implementing singletons, and many other tasks.
ru: Класс класса. Определения классов создают имя класса, словарь классов и список базовых классов. Метакласс отвечает за принятие этих трех аргументов и создание класса. Большинство объектно-ориентированных языков программирования предоставляют реализацию по умолчанию. Что делает Python особенным, так это возможность создавать собственные метаклассы. Большинству пользователей этот инструмент никогда не понадобится, но когда возникает необходимость, метаклассы могут предоставить мощные и элегантные решения. Они использовались для регистрации доступа к атрибутам, добавления потокобезопасности, отслеживания создания объектов, реализации синглтонов и многих других задач.

source: More information can be found in :ref:`metaclasses`.
ru: Больше информации можно найти по ссылке :ref:`metaclasses`.

source: method
ru: метод

source: A function which is defined inside a class body. If called as an attribute of an instance of that class, the method will get the instance object as its first :term:`argument` (which is usually called ``self``). See :term:`function` and :term:`nested scope`.
ru: Функция, определенная внутри тела класса. Если метод вызывается как атрибут экземпляра этого класса, метод получит объект экземпляра в качестве своего первого аргумента (который обычно называется self). См. :term:`function` и :term:`вложенная область видимости`.

source: method resolution order
ru: порядок разрешения методов

source: module
ru: модуль

source: An object that serves as an organizational unit of Python code. Modules have a namespace containing arbitrary Python objects. Modules are loaded into Python by the process of :term:`importing`.
ru: Объект, служащий организационной единицей кода Python. Модули имеют пространство имен, содержащее произвольные объекты Python. Модули загружаются в Python в процессе импорта.

source: See also :term:`package`.
ru: см. также :term:`package`.

source: module spec
ru: спецификация модуля

source: A namespace containing the import-related information used to load a module. An instance of :class:`importlib.machinery.ModuleSpec`.
ru: Пространство имен, содержащее информацию, связанную с импортом, используемую для загрузки модуля. Экземпляр :class:`importlib.machinery.ModuleSpec`.

source: See :term:`method resolution order`.
ru: Смотри :term:`method resolution order`.

source: mutable
ru: изменяемый

source: Mutable objects can change their value but keep their :func:`id`. See also :term:`immutable`.
ru: Изменяемые объекты могут менять свое значение, но сохраняют свой :func:`id`. См. также :term:`immutable`.

source: named tuple
ru: именованный кортеж
