Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/glossary.po
Languages: ru

source: Glossary
ru: Глоссарий

source: The default Python prompt of the interactive shell. Often seen for code examples which can be executed interactively in the interpreter.
ru: Приглашение Python по умолчанию интерактивной оболочки. Часто встречается в примерах кода, которые можно выполнить в интерпретаторе в интерактивном режиме.

source: Can refer to:
ru: Может относиться к:

source: The default Python prompt of the interactive shell when entering the code for an indented code block, when within a pair of matching left and right delimiters (parentheses, square brackets, curly braces or triple quotes), or after specifying a decorator.
ru: Запрос Python интерактивной оболочки по умолчанию при вводе кода для блока кода с отступом, если он находится внутри пары совпадающих левого и правого разделителей (круглых, квадратных, фигурных скобок или тройных кавычек) или после указания декоратора.

source: The :const:`Ellipsis` built-in constant.
ru: Встроенная константа :const:`Ellipsis`.

source: A tool that tries to convert Python 2.x code to Python 3.x code by handling most of the incompatibilities which can be detected by parsing the source and traversing the parse tree.
ru: Инструмент, который пытается преобразовать код Python 2.x в код Python 3.x, обрабатывая большинство несовместимостей, которые можно обнаружить путем анализа источника и обхода дерева разбора.

source: 2to3 is available in the standard library as :mod:`lib2to3`; a standalone entry point is provided as :file:`Tools/scripts/2to3`. See :ref:`2to3-reference`.
ru: 2to3 доступен в стандартной библиотеке как :mod:`lib2to3`; отдельная точка входа предоставляется в виде :file:`Tools/scripts/2to3`. См. :ref:`2to3-reference`.

source: abstract base class
ru: абстрактный базовый класс

source: Abstract base classes complement :term:`duck-typing` by providing a way to define interfaces when other techniques like :func:`hasattr` would be clumsy or subtly wrong (for example with :ref:`magic methods <special-lookup>`). ABCs introduce virtual subclasses, which are classes that don't inherit from a class but are still recognized by :func:`isinstance` and :func:`issubclass`; see the :mod:`abc` module documentation. Python comes with many built-in ABCs for data structures (in the :mod:`collections.abc` module), numbers (in the :mod:`numbers` module), streams (in the :mod:`io` module), import finders and loaders (in the :mod:`importlib.abc` module). You can create your own ABCs with the :mod:`abc` module.
ru: Абстрактные базовые классы дополняют «утиную типизацию», предоставляя способ определения интерфейсов, когда другие методы, такие как :func:`hasattr` было бы неуклюже или слегка неправильно (например, с :ref:`магическими методами `). ABC вводит виртуальные подклассы — классы, которые не наследуются от класса, но по-прежнему распознаются :func:`isinstance` и :func:`issubclass` ; увидеть :mod:`abc` документация модуля. Python поставляется со множеством встроенных азбук для структур данных (в :mod:`collections.abc` module), numbers (in the :mod:`numbers` module), streams (in the :mod:`io` module), import finders and loaders (in the :mod:`importlib.abc` module). You can create your own ABCs with the :mod:`abc` модуль.

source: annotation
ru: аннотация

source: A label associated with a variable, a class attribute or a function parameter or return value, used by convention as a :term:`type hint`.
ru: Метка, связанная с переменной, атрибутом класса или параметром функции или возвращаемым значением, используемая по соглашению как подсказка типа.

source: Annotations of local variables cannot be accessed at runtime, but annotations of global variables, class attributes, and functions are stored in the :attr:`__annotations__` special attribute of modules, classes, and functions, respectively.
ru: Доступ к аннотациям локальных переменных недоступен во время выполнения, но аннотации глобальных переменных, атрибутов классов и функций хранятся в :attr:`__аннотации__` специальный атрибут модулей, классов и функций соответственно.

source: See :term:`variable annotation`, :term:`function annotation`, :pep:`484` and :pep:`526`, which describe this functionality. Also see :ref:`annotations-howto` for best practices on working with annotations.
ru: Доступ к аннотациям локальных переменных недоступен во время выполнения, но аннотации глобальных переменных, атрибутов классов и функций хранятся в :attr:`__аннотации__` специальный атрибут модулей, классов и функций соответственно.

source: argument
ru: аргумент

source: A value passed to a :term:`function` (or :term:`method`) when calling the function. There are two kinds of argument:
ru: Значение, передаваемое в :term:`функцию` (или :term:`метод`) при вызове функции. Есть два вида аргументов:

source: :dfn:`keyword argument`: an argument preceded by an identifier (e.g. ``name=``) in a function call or passed as a value in a dictionary preceded by ``**``. For example, ``3`` and ``5`` are both keyword arguments in the following calls to :func:`complex`::
ru: Доступ к аннотациям локальных переменных недоступен во время выполнения, но аннотации глобальных переменных, атрибутов классов и функций хранятся в :attr:`__аннотации__` специальный атрибут модулей, классов и функций соответственно.

source: :dfn:`positional argument`: an argument that is not a keyword argument. Positional arguments can appear at the beginning of an argument list and/or be passed as elements of an :term:`iterable` preceded by ``*``. For example, ``3`` and ``5`` are both positional arguments in the following calls::
ru: :dfn:`позиционный аргумент`: аргумент, который не является аргументом ключевого слова. Позиционные аргументы могут появляться в начале списка аргументов и/или передаваться как элементы :term:`iterable`, которым предшествует ``*``. Например, ``3`` и ``5`` являются позиционными аргументами в следующих вызовах:

source: Arguments are assigned to the named local variables in a function body. See the :ref:`calls` section for the rules governing this assignment. Syntactically, any expression can be used to represent an argument; the evaluated value is assigned to the local variable.
ru: Аргументы присваиваются именованным локальным переменным в теле функции. Правила, регулирующие это назначение, см. в разделе :ref:`calls`. Синтаксически для представления аргумента можно использовать любое выражение; вычисленное значение присваивается локальной переменной.

source: See also the :term:`parameter` glossary entry, the FAQ question on :ref:`the difference between arguments and parameters <faq-argument-vs-parameter>`, and :pep:`362`.
ru: См. также статью глоссария :term:`parameter`, вопрос часто задаваемых вопросов о :ref:`разнице между аргументами и параметрами <faq-argument-vs-parameter>` и :pep:`362`.

source: asynchronous context manager
ru: асинхронный контекстный менеджер

source: An object which controls the environment seen in an :keyword:`async with` statement by defining :meth:`~object.__aenter__` and :meth:`~object.__aexit__` methods. Introduced by :pep:`492`.
ru: Объект, который управляет средой, видимой в операторе :keyword:`async with`, путем определения методов :meth:`~object.__aenter__` и :meth:`~object.__aexit__`. Представлено :pep:`492`.

source: asynchronous generator
ru: асинхронный генератор

source: A function which returns an :term:`asynchronous generator iterator`. It looks like a coroutine function defined with :keyword:`async def` except that it contains :keyword:`yield` expressions for producing a series of values usable in an :keyword:`async for` loop.
ru: Функция, которая возвращает :term:`итератор асинхронного генератора`. Она выглядит как функция сопрограммы, определенная с помощью :keyword:`async def`, за исключением того, что она содержит выражения :keyword:`yield` для создания серии значений, которые можно использовать в цикле :keyword:`async for`.

source: Usually refers to an asynchronous generator function, but may refer to an *asynchronous generator iterator* in some contexts. In cases where the intended meaning isn't clear, using the full terms avoids ambiguity.
ru: Значение, передаваемое в :term:`функцию` (или :term:`метод`) при вызове функции. Есть два вида аргументов:

source: An asynchronous generator function may contain :keyword:`await` expressions as well as :keyword:`async for`, and :keyword:`async with` statements.
ru: Функция асинхронного генератора может содержать выражения :keyword:`await`, а также операторы :keyword:`async for` и :keyword:`async with`.

source: asynchronous generator iterator
ru: итератор асинхронного генератора

source: An object created by a :term:`asynchronous generator` function.
ru: Объект, созданный функцией асинхронного генератора.

source: This is an :term:`asynchronous iterator` which when called using the :meth:`~object.__anext__` method returns an awaitable object which will execute the body of the asynchronous generator function until the next :keyword:`yield` expression.
ru: Это :term:`асинхронный итератор`, который при вызове с использованием метода :meth:`~object.__anext__` возвращает ожидаемый объект, который будет выполнять тело функции асинхронного генератора до следующего выражения :keyword:`yield`.

source: Each :keyword:`yield` temporarily suspends processing, remembering the location execution state (including local variables and pending try-statements). When the *asynchronous generator iterator* effectively resumes with another awaitable returned by :meth:`~object.__anext__`, it picks up where it left off. See :pep:`492` and :pep:`525`.
ru: Каждый :keyword:`yield` временно приостанавливает обработку, запоминая состояние выполнения местоположения (включая локальные переменные и ожидающие операторы try). Когда *итератор асинхронного генератора* эффективно возобновляет работу с другим ожидаемым объектом, возвращаемым :meth:`~object.__anext__`, он возобновляет работу с того места, где остановился. См. :pep:`492` и :pep:`525`.

source: asynchronous iterable
ru: асинхронный итерируемый объект

source: An object, that can be used in an :keyword:`async for` statement. Must return an :term:`asynchronous iterator` from its :meth:`~object.__aiter__` method. Introduced by :pep:`492`.
ru: Объект, который можно использовать в операторе :keyword:`async for`. Должен возвращать :term:`асинхронный итератор` из своего :meth:`~object.__aiter__` метода. Представлено :pep:`492`.

source: asynchronous iterator
ru: асинхронный итератор

source: An object that implements the :meth:`~object.__aiter__` and :meth:`~object.__anext__` methods. :meth:`~object.__anext__` must return an :term:`awaitable` object. :keyword:`async for` resolves the awaitables returned by an asynchronous iterator's :meth:`~object.__anext__` method until it raises a :exc:`StopAsyncIteration` exception. Introduced by :pep:`492`.
ru: Объект, реализующий методы :meth:`~object.__aiter__` и :meth:`~object.__anext__`. :meth:`~object.__anext__` должен возвращать объект :term:`awaitable`. :keyword:`async for` разрешает ожидаемые объекты, возвращаемые методом :meth:`~object.__anext__` асинхронного итератора, пока не вызовет исключение :exc:`StopAsyncIteration`. Представлено :pep:`492`.

source: attribute
ru: атрибут

source: A value associated with an object which is usually referenced by name using dotted expressions. For example, if an object *o* has an attribute *a* it would be referenced as *o.a*.
ru: Значение, связанное с объектом, на который обычно ссылаются по имени, используя выражения, разделенные точками. Например, если объект *o* имеет атрибут *a*, на него будет ссылаться как *oa*.

source: It is possible to give an object an attribute whose name is not an identifier as defined by :ref:`identifiers`, for example using :func:`setattr`, if the object allows it. Such an attribute will not be accessible using a dotted expression, and would instead need to be retrieved with :func:`getattr`.
ru: Можно присвоить объекту атрибут, имя которого не является идентификатором, как определено в :ref:`identifiers`, например, используя :func:`setattr`, если объект это позволяет. Такой атрибут не будет доступен с помощью выражения, разделенного точками, и вместо этого его необходимо будет получить с помощью :func:`getattr`.

source: awaitable
ru: ожидаемый объект

source: An object that can be used in an :keyword:`await` expression. Can be a :term:`coroutine` or an object with an :meth:`~object.__await__` method. See also :pep:`492`.
ru: Объект, который можно использовать в выражении :keyword:`await`. Может быть :term:`coroutine` или объектом с :meth:`~object.__await__`. См. также :pep:`492`.

source: Benevolent Dictator For Life, a.k.a. `Guido van Rossum <https://gvanrossum.github.io/>`_, Python's creator.
ru: Доброжелательный диктатор на всю жизнь, он же `Гвидо ван Россум <https://gvanrossum.github.io/>`_, создатель Python.

source: binary file
ru: бинарный файл

source: A :term:`file object` able to read and write :term:`bytes-like objects <bytes-like object>`. Examples of binary files are files opened in binary mode (``'rb'``, ``'wb'`` or ``'rb+'``), :data:`sys.stdin.buffer <sys.stdin>`, :data:`sys.stdout.buffer <sys.stdout>`, and instances of :class:`io.BytesIO` and :class:`gzip.GzipFile`.
ru: :term:`файловый объект`, способный читать и записывать :term:`байтоподобные объекты <байтоподобный объект>`. Примерами двоичных файлов являются файлы, открытые в двоичном режиме (``'rb'``, ``'wb'`` или ``'rb+'``), :data:`sys.stdin.buffer <sys.stdin> `, :data:`sys.stdout.buffer <sys.stdout>` и экземпляры :class:`io.BytesIO` и :class:`gzip.GzipFile`.

source: See also :term:`text file` for a file object able to read and write :class:`str` objects.
ru: См. также :term:`text file` для файлового объекта, способного читать и записывать объекты :class:`str`.

source: borrowed reference
ru: заимствованная ссылка

source: In Python's C API, a borrowed reference is a reference to an object, where the code using the object does not own the reference. It becomes a dangling pointer if the object is destroyed. For example, a garbage collection can remove the last :term:`strong reference` to the object and so destroy it.
ru: В API C Python заимствованная ссылка — это ссылка на объект, при этом код, использующий этот объект, не владеет ссылкой. Он становится висячим указателем, если объект уничтожается. Например, сборщик мусора может удалить последнюю :term:`строгую ссылку` на объект и тем самым уничтожить его.

source: Calling :c:func:`Py_INCREF` on the :term:`borrowed reference` is recommended to convert it to a :term:`strong reference` in-place, except when the object cannot be destroyed before the last usage of the borrowed reference. The :c:func:`Py_NewRef` function can be used to create a new :term:`strong reference`.
ru: Вызов :c:func:`Py_INCREF` для :term:`заимствованной ссылки` рекомендуется преобразовать в :term:`строгую ссылку` на месте, за исключением случаев, когда объект не может быть уничтожен до последнего использования заимствованной ссылки. ссылка. Функцию :c:func:`Py_NewRef` можно использовать для создания новой :term:`сильной ссылки`.

source: bytes-like object
ru: байто-подобный объект

source: An object that supports the :ref:`bufferobjects` and can export a C-:term:`contiguous` buffer. This includes all :class:`bytes`, :class:`bytearray`, and :class:`array.array` objects, as well as many common :class:`memoryview` objects. Bytes-like objects can be used for various operations that work with binary data; these include compression, saving to a binary file, and sending over a socket.
ru: Объект, который поддерживает :ref:`bufferobjects` и может экспортировать C-:term:`непрерывный` буфер. Сюда входят все объекты :class:`bytes`, :class:`bytearray` и :class:`array.array`, а также многие распространенные объекты :class:`memoryview`. Байтоподобные объекты можно использовать для различных операций, работающих с двоичными данными; к ним относятся сжатие, сохранение в двоичный файл и отправка через сокет.

source: Some operations need the binary data to be mutable. The documentation often refers to these as "read-write bytes-like objects". Example mutable buffer objects include :class:`bytearray` and a :class:`memoryview` of a :class:`bytearray`. Other operations require the binary data to be stored in immutable objects ("read-only bytes-like objects"); examples of these include :class:`bytes` and a :class:`memoryview` of a :class:`bytes` object.
ru: Для некоторых операций необходимо, чтобы двоичные данные были изменяемыми. В документации они часто называются «байтовыми объектами, подобными чтению и записи». Примеры изменяемых буферных объектов включают :class:`bytearray` и :class:`memoryview` :class:`bytearray`. Другие операции требуют, чтобы двоичные данные хранились в неизменяемых объектах («байтоподобные объекты только для чтения»); примеры таких объектов включают :class:`bytes` и :class:`memoryview` объекта :class:`bytes`.

source: bytecode
ru: байт-код

source: Python source code is compiled into bytecode, the internal representation of a Python program in the CPython interpreter. The bytecode is also cached in ``.pyc`` files so that executing the same file is faster the second time (recompilation from source to bytecode can be avoided). This "intermediate language" is said to run on a :term:`virtual machine` that executes the machine code corresponding to each bytecode. Do note that bytecodes are not expected to work between different Python virtual machines, nor to be stable between Python releases.
ru: Исходный код Python компилируется в байт-код — внутреннее представление программы Python в интерпретаторе CPython. Байт-код также кэшируется в файлах ``.pyc``, чтобы второй раз выполнить тот же файл быстрее (перекомпиляции из исходного кода в байт-код можно избежать). Говорят, что этот «промежуточный язык» работает на «виртуальной машине», которая выполняет машинный код, соответствующий каждому байт-коду. Обратите внимание, что байт-коды не должны работать между разными виртуальными машинами Python и не должны быть стабильными между выпусками Python.

source: A list of bytecode instructions can be found in the documentation for :ref:`the dis module <bytecodes>`.
ru: Список инструкций байт-кода можно найти в документации к :ref:`модулю dis <bytecodes>`.

source: callable
ru: вызываемый объект

source: A callable is an object that can be called, possibly with a set of arguments (see :term:`argument`), with the following syntax::
ru: Вызываемый объект — это объект, который можно вызвать, возможно, с набором аргументов (см. :term:`argument`), используя следующий синтаксис::

source: A :term:`function`, and by extension a :term:`method`, is a callable. An instance of a class that implements the :meth:`~object.__call__` method is also a callable.
ru: :term:`function` и, как следствие, :term:`method` являются вызываемыми. Экземпляр класса, реализующего метод :meth:`~object.__call__`, также является вызываемым.

source: callback
ru: функция обратного вызова

source: A subroutine function which is passed as an argument to be executed at some point in the future.
ru: Подпрограмма, которая передается в качестве аргумента для выполнения в какой-то момент в будущем.

source: class
ru: класс

source: A template for creating user-defined objects. Class definitions normally contain method definitions which operate on instances of the class.
ru: Шаблон для создания пользовательских объектов. Определения классов обычно содержат определения методов, которые работают с экземплярами класса.

source: class variable
ru: переменная класса

source: A variable defined in a class and intended to be modified only at class level (i.e., not in an instance of the class).
ru: Переменная, определенная в классе и предназначенная для изменения только на уровне класса (т. е. не в экземпляре класса).

source: complex number
ru: комплексное число

source: An extension of the familiar real number system in which all numbers are expressed as a sum of a real part and an imaginary part. Imaginary numbers are real multiples of the imaginary unit (the square root of ``-1``), often written ``i`` in mathematics or ``j`` in engineering. Python has built-in support for complex numbers, which are written with this latter notation; the imaginary part is written with a ``j`` suffix, e.g., ``3+1j``. To get access to complex equivalents of the :mod:`math` module, use :mod:`cmath`. Use of complex numbers is a fairly advanced mathematical feature. If you're not aware of a need for them, it's almost certain you can safely ignore them.
ru: Расширение знакомой системы действительных чисел, в которой все числа выражаются как сумма действительной и мнимой частей. Мнимые числа — это действительные кратные мнимой единицы (квадратный корень из «-1»), часто обозначаемой «i» в математике или «j» в технике. Python имеет встроенную поддержку комплексных чисел, которые записываются с использованием этой последней записи; мнимая часть записывается с суффиксом j, например, 3+1j. Чтобы получить доступ к сложным эквивалентам модуля :mod:`math`, используйте :mod:`cmath`. Использование комплексных чисел — довольно сложная математическая функция. Если вы не осознаете их необходимости, вы почти наверняка можете их спокойно игнорировать.

source: context manager
ru: контекстный менеджер

source: An object which controls the environment seen in a :keyword:`with` statement by defining :meth:`~object.__enter__` and :meth:`~object.__exit__` methods. See :pep:`343`.
ru: Объект, который управляет средой, видимой в операторе :keyword:`with`, путем определения методов :meth:`~object.__enter__` и :meth:`~object.__exit__`. См. :pep:`343`.

source: context variable
ru: контекстная переменная

source: A variable which can have different values depending on its context. This is similar to Thread-Local Storage in which each execution thread may have a different value for a variable. However, with context variables, there may be several contexts in one execution thread and the main usage for context variables is to keep track of variables in concurrent asynchronous tasks. See :mod:`contextvars`.
ru: Переменная, которая может иметь разные значения в зависимости от контекста. Это похоже на локальное хранилище потоков, в котором каждый поток выполнения может иметь другое значение переменной. Однако при использовании контекстных переменных в одном потоке выполнения может быть несколько контекстов, и основное использование контекстных переменных — отслеживание переменных в одновременных асинхронных задачах. См. :mod:`contextvars`.

source: contiguous
ru: непрерывный

source: A buffer is considered contiguous exactly if it is either *C-contiguous* or *Fortran contiguous*. Zero-dimensional buffers are C and Fortran contiguous. In one-dimensional arrays, the items must be laid out in memory next to each other, in order of increasing indexes starting from zero. In multidimensional C-contiguous arrays, the last index varies the fastest when visiting items in order of memory address. However, in Fortran contiguous arrays, the first index varies the fastest.
ru: Буфер считается непрерывным, если он *C-непрерывен* или *Fortran непрерывен*. Нульмерные буферы являются смежными в C и Fortran. В одномерных массивах элементы должны располагаться в памяти рядом друг с другом в порядке возрастания индексов, начиная с нуля. В многомерных C-непрерывных массивах последний индекс меняется быстрее всего при посещении элементов в порядке адреса памяти. Однако в смежных массивах Фортрана первый индекс меняется быстрее всего.

source: coroutine
ru: корутина
