Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/license.po
Languages: ru

source: The XML-RPC client interface is Copyright (c) 1999-2002 by Secret Labs AB Copyright (c) 1999-2002 by Fredrik Lundh By obtaining, using, and/or copying this software and/or its associated documentation, you agree that you have read, understood, and will comply with the following terms and conditions: Permission to use, copy, modify, and distribute this software and its associated documentation for any purpose and without fee is hereby granted, provided that the above copyright notice appears in all copies, and that both that copyright notice and this permission notice appear in supporting documentation, and that the name of Secret Labs AB or the author not be used in advertising or publicity pertaining to distribution of the software without specific, written prior permission. SECRET LABS AB AND THE AUTHOR DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE, INCLUDING ALL IMPLIED WARRANTIES OF MERCHANT- ABILITY AND FITNESS. IN NO EVENT SHALL SECRET LABS AB OR THE AUTHOR BE LIABLE FOR ANY SPECIAL, INDIRECT OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
ru: Клиентский интерфейс XML-RPC Авторские права (c) 1999–2002 гг., Secret Labs AB. Авторские права (c) 1999–2002 гг., Фредрик Лунд. Получая, используя и/или копируя это программное обеспечение и/или его соответствующую документацию, вы соглашаетесь, что прочитали, поняли, и будет соблюдать следующие условия: Разрешение на использование, копирование, изменение и распространение этого программного обеспечения и соответствующая документация для любых целей и бесплатно настоящим предоставляется при условии, что указанное выше уведомление об авторских правах появится в все копии, и что и это уведомление об авторских правах, и это разрешение уведомление появляется в сопроводительной документации, и что имя Secret Labs AB или автор не могут быть использованы в рекламе или рекламе. относящееся к распространению программного обеспечения без конкретных письменных предварительное разрешение. SECRET LABS AB И АВТОР ОТКАЗЫВАЮТСЯ ОТ ВСЕХ ГАРАНТИЙ В ОТНОШЕНИИ К ЭТОМУ ПРОГРАММНОМУ ОБЕСПЕЧЕНИЮ, ВКЛЮЧАЯ ВСЕ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ ПРОДАВЦА- СПОСОБНОСТИ И ФИТНЕСНОСТЬ. НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ СЕКРЕТНЫЕ ЛАБОРАТОРИИ AB ИЛИ АВТОР НЕ ДОЛЖНЫ НЕСЕТЕ ОТВЕТСТВЕННОСТИ ЗА ЛЮБЫЕ СПЕЦИАЛЬНЫЕ, КОСВЕННЫЕ ИЛИ КОСВЕННЫЕ УБЫТКИ ИЛИ ЛЮБЫЕ УБЫТКИ, ЯВЛЯЮЩИЕСЯ ОТ ПОТЕРИ ИСПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ПРИБЫЛИ, БЫЛО В ДЕЙСТВИИ ДОГОВОРА, НЕБРЕЖНОСТИ ИЛИ ДРУГОМ ВРЕДНОСТИ ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCEЭТОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ.

source: The :mod:`!test.test_epoll` module contains the following notice::
ru: Модуль :mod:`!test.test_epoll` содержит следующее уведомление::

source: Copyright (c) 2001-2006 Twisted Matrix Laboratories. Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions: The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software. THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
ru: Авторские права (c) 2001–2006 гг., Twisted Matrix Laboratories. Разрешение настоящим предоставляется бесплатно любому лицу, получившему копию этого программного обеспечения и связанных с ним файлов документации (файл «Программное обеспечение»), иметь дело с Программным обеспечением без ограничений, в том числе без ограничений права на использование, копирование, изменение, объединение, публикацию, распространять, сублицензировать и/или продавать копии Программного обеспечения, а также разрешать лицам, которым предоставлено Программное обеспечение, делать это при условии, что следующие условия: Вышеупомянутое уведомление об авторских правах и настоящее уведомление о разрешении должны быть включены во все копии или существенные части Программного обеспечения. ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ «КАК ЕСТЬ», БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ, ЯВНЫЕ ИЛИ ПОДРАЗУМЕВАЕМЫЕ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ГАРАНТИИ ТОРГОВАЯ ПРИГОДНОСТЬ, ПРИГОДНОСТЬ ДЛЯ ОПРЕДЕЛЕННОЙ ЦЕЛИ И НЕНАРУШЕНИЕ ПРАВ. НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ АВТОРЫ ИЛИ ОБЛАДАТЕЛИ АВТОРСКИХ ПРАВ НЕ ДОЛЖНЫ БЫТЬ ОТВЕТСТВЕННОСТЬ ЗА ЛЮБЫЕ ПРЕТЕНЗИИ, УБЫТКИ ИЛИ ДРУГУЮ ОТВЕТСТВЕННОСТЬ, КАК В ИСКУ ДОГОВОРА, ПРАВИЛЬНОГО ПРАВОНАРУШЕНИЯ ИЛИ ДРУГИХ ПРОИСХОЖДЕНИЙ, ВЫТЕКАЮЩИХ ИЗ, В СВЯЗИ ИЛИ В СВЯЗИ С ПРОГРАММНЫМ ОБЕСПЕЧЕНИЕМ ИЛИ ИСПОЛЬЗОВАНИЕМ ИЛИ ДРУГИМИ ДЕЛАМИ С ПРОГРАММНЫМ ОБЕСПЕЧЕНИЕМ.

source: Select kqueue
ru: Выберите kqueue

source: The :mod:`select` module contains the following notice for the kqueue interface::
ru: Модуль :mod:`select` содержит следующее уведомление для интерфейса kqueue:

source: Copyright (c) 2000 Doug White, 2006 James Knight, 2007 Christian Heimes All rights reserved. Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met: 1. Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer. 2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution. THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
ru: Авторские права (c) 2000 г. Дуг Уайт, 2006 г. Джеймс Найт, 2007 г. Кристиан Хаймс Все права защищены. Распространение и использование в исходной и двоичной форме, с или без модификация разрешена при условии соблюдения следующих условий встречаются: 1. При повторном распространении исходного кода необходимо сохранять вышеуказанные авторские права. уведомление, этот список условий и следующий отказ от ответственности. 2. Распространения в бинарной форме должны воспроизводить вышеуказанные авторские права. уведомление, этот список условий и следующий отказ от ответственности в документация и/или другие материалы, поставляемые вместе с дистрибутивом. ЭТО ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЕНО АВТОРОМ И УЧАСТНИКАМИ «КАК ЕСТЬ» И ЛЮБЫЕ ЯВНЫЕ ИЛИ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ ТОВАРНОЙ ГОДНОСТИ И ПРИГОДНОСТИ ДЛЯ ОПРЕДЕЛЕННОЙ ЦЕЛИ ОТКАЗЫВАЮТСЯ. НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ АВТОР ИЛИ УЧАСТНИКИ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ ДЛЯ ЛЮБЫХ ПРЯМЫХ, КОСВЕННЫХ, СЛУЧАЙНЫХ, СПЕЦИАЛЬНЫХ, ПРИМЕРНЫХ ИЛИ КОСВЕННЫХ УЩЕРБ (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ), ПРИОБРЕТЕНИЕ ТОВАРА-ЗАМЕНИТЕЛЯ ИЛИ УСЛУГИ; ПОТЕРЯ ИСПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ПРИБЫЛИ; ИЛИ ПЕРЕРЫВ БИЗНЕСА) КАКАЯ бы она ни была вызвана, И НА ЛЮБОЙ ТЕОРИИ ОТВЕТСТВЕННОСТИ, БЫ В ДОГОВОРЕ, СТРОГО LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAYOUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OFТАКОЙ ПОВРЕЖДЕНИЕ.

source: The file :file:`Python/pyhash.c` contains Marek Majkowski' implementation of Dan Bernstein's SipHash24 algorithm. It contains the following note::
ru: Файл :file:`Python/pyhash.c` содержит реализацию Мареком Майковски алгоритма SipHash24 Дэна Бернштейна. Он содержит следующее примечание:

source: <MIT License> Copyright (c) 2013 Marek Majkowski <marek@popcount.org> Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions: The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software. </MIT License> Original location: https://github.com/majek/csiphash/ Solution inspired by code from: Samuel Neves (supercop/crypto_auth/siphash24/little) djb (supercop/crypto_auth/siphash24/little2) Jean-Philippe Aumasson (https://131002.net/siphash/siphash24.c)
ru: <Лицензия MIT> Copyright (c) 2013 Марек Майковски <marek@popcount.org> Разрешение настоящим предоставляется бесплатно любому лицу, получившему копию. данного программного обеспечения и связанных с ним файлов документации («Программное обеспечение») для решения в Программном обеспечении без ограничений, включая, помимо прочего, права использовать, копировать, изменять, объединять, публиковать, распространять, сублицензировать и/или продавать копий Программного обеспечения и разрешать лицам, которым Программное обеспечение предоставлено для этого при соблюдении следующих условий: Вышеупомянутое уведомление об авторских правах и настоящее уведомление о разрешении должны быть включены в все копии или существенные части Программного обеспечения. </Лицензия MIT> Исходное местоположение: https://github.com/majek/csiphash/ Решение, вдохновленное кодом из: Сэмюэл Невес (supercop/crypto_auth/siphash24/little) djb (supercop/crypto_auth/siphash24/little2) Жан-Филипп Омассон (https://131002.net/siphash/siphash24.c)

source: strtod and dtoa
ru: strtod и dtoa

source: The file :file:`Python/dtoa.c`, which supplies C functions dtoa and strtod for conversion of C doubles to and from strings, is derived from the file of the same name by David M. Gay, currently available from https://web.archive.org/web/20220517033456/http://www.netlib.org/fp/dtoa.c. The original file, as retrieved on March 16, 2009, contains the following copyright and licensing notice::
ru: Файл :file:`Python/dtoa.c`, который предоставляет функции C dtoa и strtod для преобразования двойных чисел C в строки и обратно, получен из одноименного файла Дэвида М. Гэя, который в настоящее время доступен по https: //web.archive.org/web/20220517033456/http://www.netlib.org/fp/dtoa.c. Исходный файл, полученный 16 марта 2009 г., содержит следующее уведомление об авторских правах и лицензии:

source: /**************************************************************** * * The author of this software is David M. Gay. * * Copyright (c) 1991, 2000, 2001 by Lucent Technologies. * * Permission to use, copy, modify, and distribute this software for any * purpose without fee is hereby granted, provided that this entire notice * is included in all copies of any software which is or includes a copy * or modification of this software and in all copies of the supporting * documentation for such software. * * THIS SOFTWARE IS BEING PROVIDED "AS IS", WITHOUT ANY EXPRESS OR IMPLIED * WARRANTY. IN PARTICULAR, NEITHER THE AUTHOR NOR LUCENT MAKES ANY * REPRESENTATION OR WARRANTY OF ANY KIND CONCERNING THE MERCHANTABILITY * OF THIS SOFTWARE OR ITS FITNESS FOR ANY PARTICULAR PURPOSE. * ***************************************************************/
ru: /**************************************************************** * * Автором этого программного обеспечения является Дэвид М. Гей. * * Авторские права (c) 1991, 2000, 2001 гг. принадлежат Lucent Technologies. * * Разрешение на использование, копирование, изменение и распространение этого программного обеспечения для любых * назначение без платы настоящим предоставляется при условии, что все это уведомление * включен во все копии любого программного обеспечения, которое является или включает копию * или модификацию этого программного обеспечения и во всех копиях поддерживающих * документация к такому программному обеспечению. * * ЭТО ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ «КАК ЕСТЬ», БЕЗ КАКОГО-ЛИБО ЯВНОГО ИЛИ ПОДРАЗУМЕВАЕМОГО. * ГАРАНТИЯ. В ЧАСТНОСТИ, НИ АВТОР, НИ LUCENT НЕ ДЕЛАЮТ НИКАКИХ * ЗАВЕРЕНИЕ ИЛИ ГАРАНТИИ ЛЮБОГО РОДА ОТНОСИТЕЛЬНО ТОВАРНОЙ ЦЕННОСТИ * ЭТОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ ИЛИ ЕГО ПРИГОДНОСТИ ДЛЯ ЛЮБЫХ КОНКРЕТНЫХ ЦЕЛЕЙ. * ***************************************************************/

source: The modules :mod:`hashlib`, :mod:`posix`, :mod:`ssl`, :mod:`crypt` use the OpenSSL library for added performance if made available by the operating system. Additionally, the Windows and macOS installers for Python may include a copy of the OpenSSL libraries, so we include a copy of the OpenSSL license here. For the OpenSSL 3.0 release, and later releases derived from that, the Apache License v2 applies::
ru: Модули :mod:`hashlib`, :mod:`posix`, :mod:`ssl`, :mod:`crypt` используют библиотеку OpenSSL для повышения производительности, если она доступна операционной системой. Кроме того, установщики Python для Windows и macOS могут включать копию библиотек OpenSSL, поэтому мы включаем сюда копию лицензии OpenSSL. К выпуску OpenSSL 3.0 и более поздним выпускам, созданным на его основе, применяется лицензия Apache v2:
