Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/license.po
Languages: ru

source: History and License
ru: История и лицензия

source: History of the software
ru: История создания программного обеспечения

source: Python was created in the early 1990s by Guido van Rossum at Stichting Mathematisch Centrum (CWI, see https://www.cwi.nl/) in the Netherlands as a successor of a language called ABC. Guido remains Python's principal author, although it includes many contributions from others.
ru: Python был создан в начале 1990-х годов Гвидо ван Россумом в Stichting Mathematich Centrum (CWI, см. https://www.cwi.nl/) в Нидерландах как преемник языка под названием ABC. Гвидо остается основным автором Python, хотя в него включено множество вкладов других авторов.

source: In 1995, Guido continued his work on Python at the Corporation for National Research Initiatives (CNRI, see https://www.cnri.reston.va.us/) in Reston, Virginia where he released several versions of the software.
ru: В 1995 году Гвидо продолжил свою работу над Python в Корпорации национальных исследовательских инициатив (CNRI, см. https://www.cnri.reston.va.us/) в Рестоне, штат Вирджиния, где он выпустил несколько версий программного обеспечения.

source: In May 2000, Guido and the Python core development team moved to BeOpen.com to form the BeOpen PythonLabs team. In October of the same year, the PythonLabs team moved to Digital Creations (now Zope Corporation; see https://www.zope.org/). In 2001, the Python Software Foundation (PSF, see https://www.python.org/psf/) was formed, a non-profit organization created specifically to own Python-related Intellectual Property. Zope Corporation is a sponsoring member of the PSF.
ru: В мае 2000 года Гвидо и основная группа разработчиков Python переехали на BeOpen.com, чтобы сформировать команду BeOpen PythonLabs. В октябре того же года команда PythonLabs переехала в Digital Creations (ныне Zope Corporation; см. https://www.zope.org/). В 2001 году был создан Фонд программного обеспечения Python (PSF, см. https://www.python.org/psf/), некоммерческая организация, созданная специально для владения интеллектуальной собственностью, связанной с Python. Zope Corporation является членом-спонсором PSF.

source: All Python releases are Open Source (see https://opensource.org/ for the Open Source Definition). Historically, most, but not all, Python releases have also been GPL-compatible; the table below summarizes the various releases.
ru: Все выпуски Python имеют открытый исходный код (см. https://opensource.org/ для определения открытого исходного кода). Исторически сложилось так, что большинство (но не все) выпусков Python также были совместимы с GPL; В таблице ниже приведены различные выпуски.

source: Release
ru: Релиз

source: Derived from
ru: Произведенный от

source: Year
ru: Год

source: Owner
ru: Владелец

source: GPL compatible?
ru: Совместимость с GPL?

source: 0.9.0 thru 1.2
ru: С 0.9.0 по 1.2

source: yes
ru: да

source: 1.3 thru 1.5.2
ru: С 1.3 по 1.5.2

source: no
ru: нет

source: 2.2 and above
ru: 2.2 и выше

source: 2001-now
ru: 2001-настоящее время

source: GPL-compatible doesn't mean that we're distributing Python under the GPL. All Python licenses, unlike the GPL, let you distribute a modified version without making your changes open source. The GPL-compatible licenses make it possible to combine Python with other software that is released under the GPL; the others don't.
ru: Совместимость с GPL не означает, что мы распространяем Python под лицензией GPL. Все лицензии Python, в отличие от GPL, позволяют распространять модифицированную версию, не делая изменений открытым исходным кодом. Лицензии, совместимые с GPL, позволяют комбинировать Python с другим программным обеспечением, выпускаемым под лицензией GPL; другие нет.

source: Thanks to the many outside volunteers who have worked under Guido's direction to make these releases possible.
ru: Спасибо множеству сторонних добровольцев, которые работали под руководством Гвидо, чтобы сделать эти релизы возможными.

source: Terms and conditions for accessing or otherwise using Python
ru: Условия доступа или иного использования Python

source: Python software and documentation are licensed under the :ref:`PSF License Agreement <PSF-license>`.
ru: Программное обеспечение и документация Python лицензируются по :ref:`Лицензионному соглашению PSF <PSF-license>`.

source: Starting with Python 3.8.6, examples, recipes, and other code in the documentation are dual licensed under the PSF License Agreement and the :ref:`Zero-Clause BSD license <BSD0>`.
ru: Начиная с Python 3.8.6, примеры, рецепты и другой код в документации лицензируются по двойной лицензии в соответствии с лицензионным соглашением PSF и лицензией BSD с нулевыми пунктами <BSD0>.

source: Some software incorporated into Python is under different licenses. The licenses are listed with code falling under that license. See :ref:`OtherLicenses` for an incomplete list of these licenses.
ru: Некоторое программное обеспечение, включенное в Python, находится под разными лицензиями. Лицензии перечислены с указанием кода, подпадающего под эту лицензию. См. неполный список этих лицензий в разделе :ref:`OtherLicenses`.

source: PSF LICENSE AGREEMENT FOR PYTHON |release|
ru: ЛИЦЕНЗИОННОЕ СОГЛАШЕНИЕ PSF ДЛЯ PYTHON |выпустить|

source: 1. This LICENSE AGREEMENT is between the Python Software Foundation ("PSF"), and the Individual or Organization ("Licensee") accessing and otherwise using Python |release| software in source or binary form and its associated documentation. 2. Subject to the terms and conditions of this License Agreement, PSF hereby grants Licensee a nonexclusive, royalty-free, world-wide license to reproduce, analyze, test, perform and/or display publicly, prepare derivative works, distribute, and otherwise use Python |release| alone or in any derivative version, provided, however, that PSF's License Agreement and PSF's notice of copyright, i.e., "Copyright © 2001-2023 Python Software Foundation; All Rights Reserved" are retained in Python |release| alone or in any derivative version prepared by Licensee. 3. In the event Licensee prepares a derivative work that is based on or incorporates Python |release| or any part thereof, and wants to make the derivative work available to others as provided herein, then Licensee hereby agrees to include in any such work a brief summary of the changes made to Python |release|. 4. PSF is making Python |release| available to Licensee on an "AS IS" basis. PSF MAKES NO REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED. BY WAY OF EXAMPLE, BUT NOT LIMITATION, PSF MAKES NO AND DISCLAIMS ANY REPRESENTATION OR WARRANTY OF MERCHANTABILITY OR FITNESS FOR ANY PARTICULAR PURPOSE OR THAT THE USE OF PYTHON |release| WILL NOT INFRINGE ANY THIRD PARTY RIGHTS. 5. PSF SHALL NOT BE LIABLE TO LICENSEE OR ANY OTHER USERS OF PYTHON |release| FOR ANY INCIDENTAL, SPECIAL, OR CONSEQUENTIAL DAMAGES OR LOSS AS A RESULT OF MODIFYING, DISTRIBUTING, OR OTHERWISE USING PYTHON |release|, OR ANY DERIVATIVE THEREOF, EVEN IF ADVISED OF THE POSSIBILITY THEREOF. 6. This License Agreement will automatically terminate upon a material breach of its terms and conditions. 7. Nothing in this License Agreement shall be deemed to create any relationship of agency, partnership, or joint venture between PSF and Licensee. This License Agreement does not grant permission to use PSF trademarks or trade name in a trademark sense to endorse or promote products or services of Licensee, or any third party. 8. By copying, installing or otherwise using Python |release|, Licensee agrees to be bound by the terms and conditions of this License Agreement.
ru: 1. Настоящее ЛИЦЕНЗИОННОЕ СОГЛАШЕНИЕ заключено между Python Software Foundation («PSF») и физическое лицо или организация («Лицензиат»), получающие доступ к Python и иным образом использующие его |выпустить| программное обеспечение в исходной или двоичной форме и связанная с ним документация. 2. В соответствии с условиями настоящего Лицензионного соглашения PSF настоящим предоставляет Лицензиату неисключительную, безвозмездную, действующую во всем мире лицензию на воспроизведение, анализировать, тестировать, выполнять и/или демонстрировать публично, готовить производные работы, распространять и иным образом использовать Python |выпустить| отдельно или в любой производной версию, однако при условии, что Лицензионное соглашение PSF и уведомление PSF о авторское право, т. е. «Авторское право © Python Software Foundation, 2001–2023; Все права». Зарезервировано» сохраняются в Python. |выпустить| отдельно или в любой производной версии подготовлено Лицензиатом. 3. В случае, если Лицензиат готовит производную работу, основанную на или включает Python |выпустить| или любую его часть, и хочет сделать derivative work available to others as provided herein, then Licensee hereby agrees to include in any such work a brief summary of the changes made to Python |release|.4. PSF is making Python |release| available to Licensee on an "AS IS" basis. PSF MAKES NO REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED. BY WAY OF EXAMPLE, BUT NOT LIMITATION, PSF MAKES NO AND DISCLAIMS ANY REPRESENTATION OR WARRANTY OF MERCHANTABILITY OR FITNESS FOR ANY PARTICULAR PURPOSE OR THAT THE USE OF PYTHON |release| WILL NOT INFRINGE ANY THIRD PARTY RIGHTS.5. PSF SHALL NOT BE LIABLE TO LICENSEE OR ANY OTHER USERS OF PYTHON |release| FOR ANY INCIDENTAL, SPECIAL, OR CONSEQUENTIAL DAMAGES OR LOSS AS A RESULT OF MODIFYING, DISTRIBUTING, OR OTHERWISE USING PYTHON |release|, OR ANY DERIVATIVE THEREOF, EVEN IF ADVISED OF THE POSSIBILITY THEREOF.6. This License Agreement will automatically terminate upon a material breach of its terms and conditions.7. Nothing in this License Agreement shall be deemed to create any relationship of agency, partnership, or joint venture between PSF and Licensee. This License Agreement does not grant permission to use PSF trademarks or trade name in a trademark sense to endorse or promote products or services of Licensee, or any third party.8. By copying, installing or otherwise using Python |release|, Licensee agrees быть связанным условиями настоящего Лицензионного соглашения.

source: BEOPEN.COM LICENSE AGREEMENT FOR PYTHON 2.0
ru: ЛИЦЕНЗИОННОЕ СОГЛАШЕНИЕ BEOPEN.COM ДЛЯ PYTHON 2.0

source: BEOPEN PYTHON OPEN SOURCE LICENSE AGREEMENT VERSION 1
ru: ЛИЦЕНЗИОННОЕ СОГЛАШЕНИЕ С ОТКРЫТЫМ ИСТОЧНИКОМ BEOPEN PYTHON, ВЕРСИЯ 1

source: 1. This LICENSE AGREEMENT is between BeOpen.com ("BeOpen"), having an office at 160 Saratoga Avenue, Santa Clara, CA 95051, and the Individual or Organization ("Licensee") accessing and otherwise using this software in source or binary form and its associated documentation ("the Software"). 2. Subject to the terms and conditions of this BeOpen Python License Agreement, BeOpen hereby grants Licensee a non-exclusive, royalty-free, world-wide license to reproduce, analyze, test, perform and/or display publicly, prepare derivative works, distribute, and otherwise use the Software alone or in any derivative version, provided, however, that the BeOpen Python License is retained in the Software, alone or in any derivative version prepared by Licensee. 3. BeOpen is making the Software available to Licensee on an "AS IS" basis. BEOPEN MAKES NO REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED. BY WAY OF EXAMPLE, BUT NOT LIMITATION, BEOPEN MAKES NO AND DISCLAIMS ANY REPRESENTATION OR WARRANTY OF MERCHANTABILITY OR FITNESS FOR ANY PARTICULAR PURPOSE OR THAT THE USE OF THE SOFTWARE WILL NOT INFRINGE ANY THIRD PARTY RIGHTS. 4. BEOPEN SHALL NOT BE LIABLE TO LICENSEE OR ANY OTHER USERS OF THE SOFTWARE FOR ANY INCIDENTAL, SPECIAL, OR CONSEQUENTIAL DAMAGES OR LOSS AS A RESULT OF USING, MODIFYING OR DISTRIBUTING THE SOFTWARE, OR ANY DERIVATIVE THEREOF, EVEN IF ADVISED OF THE POSSIBILITY THEREOF. 5. This License Agreement will automatically terminate upon a material breach of its terms and conditions. 6. This License Agreement shall be governed by and interpreted in all respects by the law of the State of California, excluding conflict of law provisions. Nothing in this License Agreement shall be deemed to create any relationship of agency, partnership, or joint venture between BeOpen and Licensee. This License Agreement does not grant permission to use BeOpen trademarks or trade names in a trademark sense to endorse or promote products or services of Licensee, or any third party. As an exception, the "BeOpen Python" logos available at http://www.pythonlabs.com/logos.html may be used according to the permissions granted on that web page. 7. By copying, installing or otherwise using the software, Licensee agrees to be bound by the terms and conditions of this License Agreement.
ru: 1. Настоящее ЛИЦЕНЗИОННОЕ СОГЛАШЕНИЕ заключено между компанией BeOpen.com («BeOpen»), имеющей офис по адресу: 160 Saratoga Avenue, Санта-Клара, Калифорния 95051, и физическое лицо или организация («Лицензиат»), получающий доступ к этому программному обеспечению и иным образом использующий его в исходном или двоичном виде. форму и связанную с ней документацию («Программное обеспечение»). 2. В соответствии с условиями настоящего Лицензионного соглашения BeOpen Python, BeOpen настоящим предоставляет Лицензиату неисключительную, бесплатную, действующую по всему миру лицензию. воспроизводить, анализировать, тестировать, выполнять и/или демонстрировать публично, готовить производные работает, распространяет и иным образом использует Программное обеспечение отдельно или в любых производных версию, однако при условии, что лицензия BeOpen Python сохраняется в Программное обеспечение отдельно или в любой производной версии, подготовленной Лицензиатом. 3. BeOpen предоставляет Лицензиату Программное обеспечение на условиях «КАК ЕСТЬ». Компания BEOPEN НЕ ДАЕТ НИКАКИХ ЗАВЕРЕНИЙ ИЛИ ГАРАНТИЙ, ЯВНЫХ ИЛИ ПОДРАЗУМЕВАЕМЫХ. ПОсредством ПРИМЕР, НО НЕ ОГРАНИЧЕНИЕ: BEOPEN НЕ ДЕЛАЕТ И ОТКАЗЫВАЕТСЯ ОТ ЛЮБЫХ ЗАВЕРЕНИЙ ИЛИ ГАРАНТИЯ ТОВАРНОСТИ ИЛИ ПРИГОДНОСТИ ДЛЯ ЛЮБОЙ КОНКРЕТНОЙ ЦЕЛИ ИЛИ ТОГО, ИСПОЛЬЗОВАНИЕ ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ НЕ НАРУШАЕТ ПРАВА ТРЕТЬИХ ЛИЦ. 4. BEOPEN НЕ НЕСЕТ ОТВЕТСТВЕННОСТИ ПЕРЕД ЛИЦЕНЗИАТОМ ИЛИ ДРУГИМИ ПОЛЬЗОВАТЕЛЯМИ ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ ЗА ANY INCIDENTAL, SPECIAL, OR CONSEQUENTIAL DAMAGES OR LOSS AS A RESULT OF USING, MODIFYING OR DISTRIBUTING THE SOFTWARE, OR ANY DERIVATIVE THEREOF, EVEN IF ADVISED OF THE POSSIBILITY THEREOF.5. This License Agreement will automatically terminate upon a material breach of its terms and conditions.6. This License Agreement shall be governed by and interpreted in all respects by the law of the State of California, excluding conflict of law provisions. Nothing in this License Agreement shall be deemed to create any relationship of agency, partnership, or joint venture between BeOpen and Licensee. This License Agreement does not grant permission to use BeOpen trademarks or trade names in a trademark sense to endorse or promote products or services of Licensee, or any third party. As an exception, the "BeOpen Python" logos available at http://www.pythonlabs.com/logos.html may be used according to the permissions granted on that web page.7. By copying, installing or otherwise using the software, Licensee agrees to be связаны условиями настоящего Лицензионного соглашения.

source: CNRI LICENSE AGREEMENT FOR PYTHON 1.6.1
ru: ЛИЦЕНЗИОННОЕ СОГЛАШЕНИЕ CNRI ДЛЯ PYTHON 1.6.1

source: 1. This LICENSE AGREEMENT is between the Corporation for National Research Initiatives, having an office at 1895 Preston White Drive, Reston, VA 20191 ("CNRI"), and the Individual or Organization ("Licensee") accessing and otherwise using Python 1.6.1 software in source or binary form and its associated documentation. 2. Subject to the terms and conditions of this License Agreement, CNRI hereby grants Licensee a nonexclusive, royalty-free, world-wide license to reproduce, analyze, test, perform and/or display publicly, prepare derivative works, distribute, and otherwise use Python 1.6.1 alone or in any derivative version, provided, however, that CNRI's License Agreement and CNRI's notice of copyright, i.e., "Copyright © 1995-2001 Corporation for National Research Initiatives; All Rights Reserved" are retained in Python 1.6.1 alone or in any derivative version prepared by Licensee. Alternately, in lieu of CNRI's License Agreement, Licensee may substitute the following text (omitting the quotes): "Python 1.6.1 is made available subject to the terms and conditions in CNRI's License Agreement. This Agreement together with Python 1.6.1 may be located on the internet using the following unique, persistent identifier (known as a handle): 1895.22/1013. This Agreement may also be obtained from a proxy server on the internet using the following URL: http://hdl.handle.net/1895.22/1013." 3. In the event Licensee prepares a derivative work that is based on or incorporates Python 1.6.1 or any part thereof, and wants to make the derivative work available to others as provided herein, then Licensee hereby agrees to include in any such work a brief summary of the changes made to Python 1.6.1. 4. CNRI is making Python 1.6.1 available to Licensee on an "AS IS" basis. CNRI MAKES NO REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED. BY WAY OF EXAMPLE, BUT NOT LIMITATION, CNRI MAKES NO AND DISCLAIMS ANY REPRESENTATION OR WARRANTY OF MERCHANTABILITY OR FITNESS FOR ANY PARTICULAR PURPOSE OR THAT THE USE OF PYTHON 1.6.1 WILL NOT INFRINGE ANY THIRD PARTY RIGHTS. 5. CNRI SHALL NOT BE LIABLE TO LICENSEE OR ANY OTHER USERS OF PYTHON 1.6.1 FOR ANY INCIDENTAL, SPECIAL, OR CONSEQUENTIAL DAMAGES OR LOSS AS A RESULT OF MODIFYING, DISTRIBUTING, OR OTHERWISE USING PYTHON 1.6.1, OR ANY DERIVATIVE THEREOF, EVEN IF ADVISED OF THE POSSIBILITY THEREOF. 6. This License Agreement will automatically terminate upon a material breach of its terms and conditions. 7. This License Agreement shall be governed by the federal intellectual property law of the United States, including without limitation the federal copyright law, and, to the extent such U.S. federal law does not apply, by the law of the Commonwealth of Virginia, excluding Virginia's conflict of law provisions. Notwithstanding the foregoing, with regard to derivative works based on Python 1.6.1 that incorporate non-separable material that was previously distributed under the GNU General Public License (GPL), the law of the Commonwealth of Virginia shall govern this License Agreement only as to issues arising under or with respect to Paragraphs 4, 5, and 7 of this License Agreement. Nothing in this License Agreement shall be deemed to create any relationship of agency, partnership, or joint venture between CNRI and Licensee. This License Agreement does not grant permission to use CNRI trademarks or trade name in a trademark sense to endorse or promote products or services of Licensee, or any third party. 8. By clicking on the "ACCEPT" button where indicated, or by copying, installing or otherwise using Python 1.6.1, Licensee agrees to be bound by the terms and conditions of this License Agreement.
ru: 1. Настоящее ЛИЦЕНЗИОННОЕ СОГЛАШЕНИЕ заключено между Корпорацией национальных исследований. Инициативы, офис по адресу: 1895 Preston White Drive, Рестон, Вирджиния, 20191. («CNRI»), а также физическое лицо или организация («Лицензиат»), получающие доступ и в противном случае используйте программное обеспечение Python 1.6.1 в исходной или двоичной форме и его сопутствующая документация. 2. В соответствии с условиями настоящего Лицензионного соглашения CNRI настоящим предоставляет Лицензиату неисключительную, безвозмездную, действующую во всем мире лицензию на воспроизведение, анализировать, тестировать, выполнять и/или демонстрировать публично, готовить производные работы, распространять и иным образом использовать Python 1.6.1 отдельно или в любой производной версии, при условии, однако, что Лицензионное соглашение CNRI и уведомление CNRI об авторских правах, т.е. «Авторское право © Корпорация национальных исследовательских инициатив, 1995–2001 гг.; Все Права защищены» сохраняются только в Python 1.6.1 или в любой производной версии. подготовлено Лицензиатом. Альтернативно, вместо Лицензионного соглашения CNRI, Лицензиат может заменить следующий текст (без кавычек): «Python 1.6.1 предоставляется в соответствии с условиями лицензии CNRI. Соглашение. Настоящее Соглашение вместе с Python 1.6.1 может быть расположено на сайте в Интернете, используя следующий уникальный постоянный идентификатор (известный как дескриптор): 1895.22/1013. This Agreement may also be obtained from a proxy server on the internet using the following URL: http://hdl.handle.net/1895.22/1013."3. In the event Licensee prepares a derivative work that is based on or incorporates Python 1.6.1 or any part thereof, and wants to make the derivative work available to others as provided herein, then Licensee hereby agrees to include in any such work a brief summary of the changes made to Python 1.6.1.4. CNRI is making Python 1.6.1 available to Licensee on an "AS IS" basis. CNRI MAKES NO REPRESENTATIONS OR WARRANTIES, EXPRESS OR IMPLIED. BY WAY OF EXAMPLE, BUT NOT LIMITATION, CNRI MAKES NO AND DISCLAIMS ANY REPRESENTATION OR WARRANTY OF MERCHANTABILITY OR FITNESS FOR ANY PARTICULAR PURPOSE OR THAT THE USE OF PYTHON 1.6.1 WILL NOT INFRINGE ANY THIRD PARTY RIGHTS.5. CNRI SHALL NOT BE LIABLE TO LICENSEE OR ANY OTHER USERS OF PYTHON 1.6.1 FOR ANY INCIDENTAL, SPECIAL, OR CONSEQUENTIAL DAMAGES OR LOSS AS A RESULT OF MODIFYING, DISTRIBUTING, OR OTHERWISE USING PYTHON 1.6.1, OR ANY DERIVATIVE THEREOF, EVEN IF ADVISED OF THE POSSIBILITY THEREOF.6. This License Agreement will automatically terminate upon a material breach of its terms and conditions.7. This License Agreement shall be governed by the federal intellectual property law of the United States, including without limitation the federal copyright law, and, to the extent such U.S. federal law does not apply, by the law of the Commonwealth of Virginia, excluding Virginia's conflict of law provisions. Notwithstanding the foregoing, with regard to derivative works based on Python 1.6.1 that incorporate non-separable material that was previously distributed under the GNU General Public License (GPL), the law of the Commonwealth of Virginia shall govern this License Agreement only as to issues arising under or with respect to Paragraphs 4, 5, and 7 of this License Agreement. Nothing in this License Agreement shall be deemed to create any relationship of agency, partnership, or joint venture between CNRI and Licensee. This License Agreement does not grant permission to use CNRI trademarks or trade name in a trademark sense to endorse or promote products or services of Licensee, or any third party.8. By clicking on the "ACCEPT" button where indicated, or by copying, installing or otherwise using Python 1.6.1, Licensee agrees to be bound by the terms and условиях настоящего Лицензионного соглашения.

source: CWI LICENSE AGREEMENT FOR PYTHON 0.9.0 THROUGH 1.2
ru: ЛИЦЕНЗИОННОЕ СОГЛАШЕНИЕ CWI ДЛЯ PYTHON 0.9.0 ДО 1.2
