Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/license.po
Languages: ru

source: Copyright © 1991 - 1995, Stichting Mathematisch Centrum Amsterdam, The Netherlands. All rights reserved. Permission to use, copy, modify, and distribute this software and its documentation for any purpose and without fee is hereby granted, provided that the above copyright notice appear in all copies and that both that copyright notice and this permission notice appear in supporting documentation, and that the name of Stichting Mathematisch Centrum or CWI not be used in advertising or publicity pertaining to distribution of the software without specific, written prior permission. STICHTING MATHEMATISCH CENTRUM DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE, INCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS, IN NO EVENT SHALL STICHTING MATHEMATISCH CENTRUM BE LIABLE FOR ANY SPECIAL, INDIRECT OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
ru: Авторские права © 1991–1995, Stichting Mathematich Centrum Amsterdam, The Нидерланды. Все права защищены. Разрешение на использование, копирование, изменение и распространение данного программного обеспечения и его документация для любых целей и бесплатно предоставляется при условии, что вышеуказанное уведомление об авторских правах присутствует во всех копиях, и что оба авторских права уведомление и данное уведомление о разрешении появляются в сопроводительной документации, и что название Stichting Mathematich Centrum или CWI не должно использоваться в рекламе или реклама, относящаяся к распространению программного обеспечения, без конкретных письменных предварительное разрешение. ФОНД МАТЕМАТИЧЕСКОГО ЦЕНТРА ОТКАЗЫВАЕТСЯ ОТ ВСЕХ ГАРАНТИЙ В ОТНОШЕНИИ ЭТОГО ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ, ВКЛЮЧАЯ ВСЕ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ ТОВАРНОСТИ И ПРИГОДНОСТИ, НЕТ. ФОНД МАТЕМАТИЧЕСКОГО ЦЕНТРА НЕСЕТ ОТВЕТСТВЕННОСТЬ ЗА ЛЮБЫЕ СПЕЦИАЛЬНЫЕ, КОСВЕННЫЕ ИЛИ КОСВЕННЫЙ УБЫТ ИЛИ ЛЮБЫЕ УБЫТКИ, ЯВЛЕННЫЕ В РЕЗУЛЬТАТЕ ПОТЕРИ ИСПОЛЬЗОВАНИЯ, ДАННЫЕ ИЛИ ПРИБЫЛЬ, БЫ В ДЕЙСТВИИ ПО КОНТРАКТУ, НЕБРЕЖНОСТИ ИЛИ ДРУГОМ ВРЕДНОСТИ ДЕЙСТВИЯ, ВОЗНИКАЮЩИЕ ИЗ ИЛИ В СВЯЗИ С ИСПОЛЬЗОВАНИЕМ ИЛИ ВЫПОЛНЕНИЕМ НАСТОЯЩЕГО ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ.

source: ZERO-CLAUSE BSD LICENSE FOR CODE IN THE PYTHON |release| DOCUMENTATION
ru: ЛИЦЕНЗИЯ BSD С НУЛЕВЫМИ ПУНКТАМИ ДЛЯ КОДА НА PYTHON |выпустить| ДОКУМЕНТАЦИЯ

source: Permission to use, copy, modify, and/or distribute this software for any purpose with or without fee is hereby granted. THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
ru: Разрешение на использование, копирование, изменение и/или распространение этого программного обеспечения для любых Цель с оплатой или без оплаты настоящим предоставляется. ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ «КАК ЕСТЬ», А АВТОР ОТКАЗЫВАЕТСЯ ОТ ВСЕХ ГАРАНТИЙ. ОТНОШЕНИЕ К ЭТОМУ ПРОГРАММНОМУ ОБЕСПЕЧЕНИЮ, ВКЛЮЧАЯ ВСЕ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ ТОВАРНОЙ ПРИГОДНОСТИ И ФИТНЕС. АВТОР НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ НЕ НЕСЕТ ОТВЕТСТВЕННОСТИ ЗА КАКИЕ-ЛИБО СПЕЦИАЛЬНЫЕ, ПРЯМЫЕ, КОСВЕННЫЙ ИЛИ КОСВЕННЫЙ УБЫТ ИЛИ ЛЮБЫЕ УБЫТКИ, ЯВЛЯЮЩИЕСЯ В РЕЗУЛЬТАТЕ ПОТЕРЯ ИСПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ПРИБЫЛИ В ДЕЙСТВИЯХ КОНТРАКТА, НЕБРЕЖНОСТИ ИЛИ ДРУГИЕ ВРЕДИТЕЛЬНЫЕ ДЕЙСТВИЯ, ВОЗНИКАЮЩИЕ В РЕЗУЛЬТАТЕ ИЛИ В СВЯЗИ С ИСПОЛЬЗОВАНИЕМ ИЛИ ПРОИЗВОДИТЕЛЬНОСТЬ ЭТОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ.

source: Licenses and Acknowledgements for Incorporated Software
ru: Лицензии и подтверждения для встроенного программного обеспечения

source: This section is an incomplete, but growing list of licenses and acknowledgements for third-party software incorporated in the Python distribution.
ru: Этот раздел представляет собой неполный, но постоянно растущий список лицензий и подтверждений стороннего программного обеспечения, включенного в дистрибутив Python.

source: The :mod:`!_random` C extension underlying the :mod:`random` module includes code based on a download from http://www.math.sci.hiroshima-u.ac.jp/~m-mat/MT/MT2002/emt19937ar.html. The following are the verbatim comments from the original code::
ru: Расширение C :mod:`!_random`, лежащее в основе модуля :mod:`random`, включает код, основанный на загрузке с http://www.math.sci.hiroshima-u.ac.jp/~m-mat/MT. /MT2002/emt19937ar.html. Ниже приведены дословные комментарии исходного кода:

source: A C-program for MT19937, with initialization improved 2002/1/26. Coded by Takuji Nishimura and Makoto Matsumoto. Before using, initialize the state by using init_genrand(seed) or init_by_array(init_key, key_length). Copyright (C) 1997 - 2002, Makoto Matsumoto and Takuji Nishimura, All rights reserved. Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met: 1. Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer. 2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution. 3. The names of its contributors may not be used to endorse or promote products derived from this software without specific prior written permission. THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE. Any feedback is very welcome. http://www.math.sci.hiroshima-u.ac.jp/~m-mat/MT/emt.html email: m-mat @ math.sci.hiroshima-u.ac.jp (remove space)
ru: C-программа для MT19937 с улучшенной инициализацией 26 января 2002 г. Код написан Такудзи Нисимурой и Макото Мацумото. Перед использованием инициализируйте состояние, используя init_genrand(seed) или init_by_array(init_key, key_length). Copyright (C) 1997–2002 гг., Макото Мацумото и Такудзи Нисимура. Все права защищены. Распространение и использование в исходной и двоичной форме, с или без модификация разрешена при условии соблюдения следующих условий встречаются: 1. При повторном распространении исходного кода необходимо сохранять вышеуказанные авторские права. уведомление, этот список условий и следующий отказ от ответственности. 2. Распространения в бинарной форме должны воспроизводить вышеуказанные авторские права. уведомление, этот список условий и следующий отказ от ответственности в документация и/или другие материалы, поставляемые вместе с дистрибутивом. 3. Имена участников не могут использоваться для поддержки или продвижения. продукты, полученные на основе этого программного обеспечения, без специального предварительного письменного разрешение. ДАННОЕ ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЕНО ОБЛАДАТЕЛЯМИ АВТОРСКИХ ПРАВ И УЧАСТНИКАМИ. «КАК ЕСТЬ» И ЛЮБЫЕ ЯВНЫЕ ИЛИ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ ​​ПОДРАЗУМЕВАЕМЫМИ ГАРАНТИЯМИ ТОВАРНОЙ ГОДНОСТИ И ПРИГОДНОСТИ ДЛЯ КОНКРЕТНАЯ ЦЕЛЬ ОТКАЗЫВАЕТСЯ. НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ ВЛАДЕЛЕЦ АВТОРСКИХ ПРАВ ИЛИ CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, ORPROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OFLIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDINGNEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THISSOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.Any feedback is very welcome.http://www.math.sci.hiroshima-u.ac.jp/~m-mat/MT/emt.htmlэлектронная почта: m-mat @ math.sci.hiroshima-u.ac.jp (убрать пробел)

source: Sockets
ru: Сокеты

source: The :mod:`socket` module uses the functions, :c:func:`!getaddrinfo`, and :c:func:`!getnameinfo`, which are coded in separate source files from the WIDE Project, https://www.wide.ad.jp/. ::
ru: Модуль :mod:`socket` использует функции :c:func:`!getaddrinfo` и :c:func:`!getnameinfo`, которые закодированы в отдельных исходных файлах из проекта WIDE, https://www. .wide.ad.jp/. ::

source: Copyright (C) 1995, 1996, 1997, and 1998 WIDE Project. All rights reserved. Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met: 1. Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer. 2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution. 3. Neither the name of the project nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission. THIS SOFTWARE IS PROVIDED BY THE PROJECT AND CONTRIBUTORS ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE PROJECT OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
ru: Авторское право (C) WIDE Project, 1995, 1996, 1997 и 1998 годы. Все права защищены. Распространение и использование в исходной и двоичной форме, с или без модификация разрешена при условии соблюдения следующих условий встречаются: 1. При повторном распространении исходного кода необходимо сохранять вышеуказанные авторские права. уведомление, этот список условий и следующий отказ от ответственности. 2. Распространения в бинарной форме должны воспроизводить вышеуказанные авторские права. уведомление, этот список условий и следующий отказ от ответственности в документация и/или другие материалы, поставляемые вместе с дистрибутивом. 3. Ни названия проекта, ни имен его участников. может использоваться для одобрения или продвижения продуктов, созданных на основе этого программного обеспечения. без специального предварительного письменного разрешения. ЭТО ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ ПРОЕКТОМ И УЧАСТНИКАМИ «КАК ЕСТЬ» И ЛЮБЫЕ ЯВНЫЕ ИЛИ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ ТОВАРНОЙ ГОДНОСТИ И ПРИГОДНОСТИ ДЛЯ ОПРЕДЕЛЕННОЙ ЦЕЛИ ОТКАЗЫВАЮТСЯ. НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ ПРОЕКТ ИЛИ УЧАСТНИКИ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ ДЛЯ ЛЮБЫХ ПРЯМЫХ, КОСВЕННЫХ, СЛУЧАЙНЫХ, СПЕЦИАЛЬНЫХ, ПРИМЕРНЫХ ИЛИ КОСВЕННЫХ DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODSOR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICTLIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAYOUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OFТАКОЙ ПОВРЕЖДЕНИЕ.

source: Asynchronous socket services
ru: Службы асинхронных сокетов

source: The :mod:`!test.support.asynchat` and :mod:`!test.support.asyncore` modules contain the following notice::
ru: Модули :mod:`!test.support.asynchat` и :mod:`!test.support.asyncore` содержат следующее уведомление:

source: Copyright 1996 by Sam Rushing All Rights Reserved Permission to use, copy, modify, and distribute this software and its documentation for any purpose and without fee is hereby granted, provided that the above copyright notice appear in all copies and that both that copyright notice and this permission notice appear in supporting documentation, and that the name of Sam Rushing not be used in advertising or publicity pertaining to distribution of the software without specific, written prior permission. SAM RUSHING DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE, INCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS, IN NO EVENT SHALL SAM RUSHING BE LIABLE FOR ANY SPECIAL, INDIRECT OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
ru: Авторские права: Сэм Рашинг, 1996 г. Все права защищены Разрешение на использование, копирование, изменение и распространение этого программного обеспечения и его документация для любых целей и бесплатно настоящим разрешено, при условии, что указанное выше уведомление об авторских правах появится во всех копии и что и это уведомление об авторских правах, и настоящее разрешение уведомление появляется в сопроводительной документации, и что имя Сэма Спешка не должна использоваться в рекламе или рекламе, относящейся к распространение программного обеспечения без специального письменного предварительного уведомления. разрешение. СЭМ РАШИНГ ОТКАЗЫВАЕТСЯ ОТ ВСЕХ ГАРАНТИЙ В ОТНОШЕНИИ ЭТОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ. ВКЛЮЧАЯ ВСЕ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ ТОВАРНОЙ ГОДНОСТИ И ПРИГОДНОСТИ, В НИ ОДНО СОБЫТИЕ СЭМ РАШИНГ НЕ НЕСЕТ ОТВЕТСТВЕННОСТИ ЗА КАКИЕ-ЛИБО ОСОБЫЕ, КОСВЕННЫЕ ИЛИ КОСВЕННЫЙ УБЫТ ИЛИ ЛЮБЫЕ УБЫТКИ, ЯВЛЕННЫЕ В РЕЗУЛЬТАТЕ ПОТЕРИ ИСПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ПРИБЫЛИ, БЫ В ДЕЙСТВИИ КОНТРАКТА, НЕБРЕЖНОСТЬ ИЛИ ДРУГИЕ ВРЕДИТЕЛЬНЫЕ ДЕЙСТВИЯ, ВОЗНИКАЮЩИЕ ИЗ ИЛИ В СВЯЗЬ С ИСПОЛЬЗОВАНИЕМ ИЛИ ФУНКЦИОНИРОВАНИЕМ ЭТОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ.

source: Cookie management
ru: Управление файлами cookie

source: The :mod:`http.cookies` module contains the following notice::
ru: Модуль :mod:`http.cookies` содержит следующее уведомление::

source: Copyright 2000 by Timothy O'Malley <timo@alum.mit.edu> All Rights Reserved Permission to use, copy, modify, and distribute this software and its documentation for any purpose and without fee is hereby granted, provided that the above copyright notice appear in all copies and that both that copyright notice and this permission notice appear in supporting documentation, and that the name of Timothy O'Malley not be used in advertising or publicity pertaining to distribution of the software without specific, written prior permission. Timothy O'Malley DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE, INCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS, IN NO EVENT SHALL Timothy O'Malley BE LIABLE FOR ANY SPECIAL, INDIRECT OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
ru: Авторские права принадлежат Тимоти О'Мэлли, 2000 г. <timo@alum.mit.edu> Все права защищены Разрешение на использование, копирование, изменение и распространение этого программного обеспечения. и его документация для любых целей и бесплатно настоящим разрешено, при условии, что указанное выше уведомление об авторских правах появится во всех копии и что и это уведомление об авторских правах, и настоящее разрешение уведомление появляется в сопроводительной документации, и что имя Тимоти О'Мэлли не будет использоваться в рекламе или рекламе. относящееся к распространению программного обеспечения без конкретных письменных предварительное разрешение. Тимоти О'Мэлли ОТКАЗЫВАЕТСЯ ОТ ВСЕХ ГАРАНТИЙ В ОТНОШЕНИИ ЭТОГО ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ, ВКЛЮЧАЯ ВСЕ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ ТОВАРНОЙ ЦЕННОСТИ И ФИТНЕС, НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ Тимоти О'Мэлли НЕ НЕСЕТ ОТВЕТСТВЕННОСТИ ЗА ЛЮБЫЕ ОСОБЫЕ, КОСВЕННЫЕ ИЛИ КОСВЕННЫЕ УБЫТКИ ИЛИ ЛЮБЫЕ УБЫТКИ КАКОЕ-ЛИБО ВСЯКОЕ В РЕЗУЛЬТАТЕ ПОТЕРИ ИСПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ПРИБЫЛИ, БЫЛО В ДЕЙСТВИИ ДОГОВОРА, НЕБРЕЖНОСТИ ИЛИ ДРУГОМ ВРЕДНОСТИ ДЕЙСТВИЯ, ВОЗНИКАЮЩИЕ ИЗ ИЛИ В СВЯЗИ С ИСПОЛЬЗОВАНИЕМ ИЛИ ПРОИЗВОДИТЕЛЬНОСТЬ ЭТОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ.

source: Execution tracing
ru: Отслеживание выполнения

source: The :mod:`trace` module contains the following notice::
ru: Модуль :mod:`trace` содержит следующее уведомление::

source: portions copyright 2001, Autonomous Zones Industries, Inc., all rights... err... reserved and offered to the public under the terms of the Python 2.2 license. Author: Zooko O'Whielacronx http://zooko.com/ mailto:zooko@zooko.com Copyright 2000, Mojam Media, Inc., all rights reserved. Author: Skip Montanaro Copyright 1999, Bioreason, Inc., all rights reserved. Author: Andrew Dalke Copyright 1995-1997, Automatrix, Inc., all rights reserved. Author: Skip Montanaro Copyright 1991-1995, Stichting Mathematisch Centrum, all rights reserved. Permission to use, copy, modify, and distribute this Python software and its associated documentation for any purpose without fee is hereby granted, provided that the above copyright notice appears in all copies, and that both that copyright notice and this permission notice appear in supporting documentation, and that the name of neither Automatrix, Bioreason or Mojam Media be used in advertising or publicity pertaining to distribution of the software without specific, written prior permission.
ru: авторские права на части принадлежат 2001 г., Autonomous Zones Industries, Inc., все права... эээ... зарезервировано и предложено публике в соответствии с условиями Лицензия Python 2.2. Автор: Зуко О'Уилакрокс http://zooko.com/ почта:zooko@zooko.com Авторские права принадлежат Mojam Media, Inc., 2000 г., все права защищены. Автор: Скип Монтанаро Авторское право 1999, Bioreason, Inc., все права защищены. Автор: Эндрю Далк Авторские права Automatrix, Inc., 1995–1997 гг., все права защищены. Автор: Скип Монтанаро Авторские права 1991–1995, Stichting Mathematich Centrum, все права защищены. Разрешение на использование, копирование, изменение и распространение данного программного обеспечения Python и сопутствующая документация для любых целей без оплаты настоящим предоставлено, при условии, что вышеуказанное уведомление об авторских правах присутствует во всех копиях, и что это уведомление об авторских правах и это уведомление о разрешении появляются в подтверждающую документацию, и что ни имя Automatrix, ни Bioreason или Mojam Media могут использоваться в рекламе или рекламе, относящейся к распространение программного обеспечения без специального предварительного письменного разрешения.

source: UUencode and UUdecode functions
ru: Функции UUencode и UUdecode

source: The :mod:`uu` module contains the following notice::
ru: Модуль :mod:`uu` содержит следующее уведомление::

source: Copyright 1994 by Lance Ellinghouse Cathedral City, California Republic, United States of America. All Rights Reserved Permission to use, copy, modify, and distribute this software and its documentation for any purpose and without fee is hereby granted, provided that the above copyright notice appear in all copies and that both that copyright notice and this permission notice appear in supporting documentation, and that the name of Lance Ellinghouse not be used in advertising or publicity pertaining to distribution of the software without specific, written prior permission. LANCE ELLINGHOUSE DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE, INCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS, IN NO EVENT SHALL LANCE ELLINGHOUSE CENTRUM BE LIABLE FOR ANY SPECIAL, INDIRECT OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE. Modified by Jack Jansen, CWI, July 1995: - Use binascii module to do the actual line-by-line conversion between ascii and binary. This results in a 1000-fold speedup. The C version is still 5 times faster, though. - Arguments more compliant with Python standard
ru: Авторские права принадлежат Лэнсу Эллингхаусу, 1994 г. Кафедральный город, Калифорнийская Республика, Соединенные Штаты Америки. Все права защищены Разрешение на использование, копирование, изменение и распространение данного программного обеспечения и его документация для любых целей и бесплатно предоставляется, при условии, что вышеуказанное уведомление об авторских правах присутствует во всех копиях и что и это уведомление об авторских правах, и это уведомление о разрешении появляются в подтверждающую документацию и что имя Лэнса Эллингхауса не использоваться в рекламе или рекламе, связанной с распространением программного обеспечения без специального предварительного письменного разрешения. ЛЭНС ЭЛЛИНГХАУС ОТКАЗЫВАЕТСЯ ОТ ВСЕХ ГАРАНТИЙ В ОТНОШЕНИИ ДАННОЕ ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ, ВКЛЮЧАЯ ВСЕ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ ТОВАРНОСТИ И ФИТНЕС, НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ LANCE ELLINGHOUSE CENTRUM НЕ НЕСЕТ ОТВЕТСТВЕННОСТИ ЗА ЛЮБЫЕ ОСОБЫЕ, КОСВЕННЫЕ ИЛИ КОСВЕННЫЕ УБЫТКИ ИЛИ ЛЮБЫЕ УБЫТКИ КАКИЕ-ЛИБО ПОТЕРИ ИСПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ПРИБЫЛИ, БЫ В ДЕЙСТВИЯ ПО ДОГОВОРУ, НЕБРЕЖНОСТИ ИЛИ ДРУГИЕ ВРЕДИТЕЛЬНЫЕ ДЕЙСТВИЯ, ВЫТЕКАЮЩИЕ ИЗ ИЛИ В СВЯЗИ С ИСПОЛЬЗОВАНИЕМ ИЛИ ФУНКЦИОНИРОВАНИЕМ ЭТОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ. Изменено Джеком Янсеном, CWI, июль 1995 г.: - Используйте модуль binascii для фактического построчного преобразования. between ascii and binary. This results in a 1000-fold speedup. The C version is still 5 times faster, though.— Аргументы, более соответствующие стандарту Python.

source: XML Remote Procedure Calls
ru: Удаленные вызовы процедур XML

source: The :mod:`xmlrpc.client` module contains the following notice::
ru: Модуль :mod:`xmlrpc.client` содержит следующее уведомление::
