Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/license.po
Languages: ru

source: Copyright (c) 1996-2008 Red Hat, Inc and others. Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the ``Software''), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions: The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software. THE SOFTWARE IS PROVIDED ``AS IS'', WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
ru: Авторские права (c) 1996–2008 гг. Red Hat, Inc и другие. Разрешение настоящим предоставляется бесплатно любому лицу, получившему копию этого программного обеспечения и связанных с ним файлов документации (файл ``Программное обеспечение''), иметь дело с Программным обеспечением без ограничений, включая без ограничений права на использование, копирование, изменение, объединение, публикацию, распространять, сублицензировать и/или продавать копии Программного обеспечения, а также разрешать лицам, которым предоставлено Программное обеспечение, делать это при условии, что следующие условия: Вышеупомянутое уведомление об авторских правах и настоящее уведомление о разрешении должны быть включены. во всех копиях или существенных частях Программного обеспечения. ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ «КАК ЕСТЬ», БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ, ЯВНЫЕ ИЛИ ПОДРАЗУМЕВАЕМЫЕ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ГАРАНТИИ ТОРГОВАЯ ПРИГОДНОСТЬ, ПРИГОДНОСТЬ ДЛЯ ОПРЕДЕЛЕННОЙ ЦЕЛИ И НЕНАРУШЕНИЕ ПРАВ. НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ АВТОРЫ ИЛИ АВТОРСКИЕ ПРАВА НЕ ДОЛЖНЫ ВЛАДЕЛЬЦЫ НЕСУТ ОТВЕТСТВЕННОСТЬ ЗА ЛЮБЫЕ ПРЕТЕНЗИИ, УБЫТКИ ИЛИ ДРУГУЮ ОТВЕТСТВЕННОСТЬ, БЫ В ДЕЙСТВИИ КОНТРАКТА, ПРАВИЛЬНЫХ ПРАВИЛ ИЛИ ДРУГИХ ОБРАЗНЫХ УСЛОВИЯХ, ВЫТЕКАЮЩИХ ИЗ: ВНЕ ИЛИ В СВЯЗИ С ПРОГРАММНЫМ ОБЕСПЕЧЕНИЕМ ИЛИ ИСПОЛЬЗОВАНИЕМ ИЛИ ДРУГИМ ДЕЛА В ПРОГРАММНОМ ОБЕСПЕЧЕНИИ.

source: The :mod:`zlib` extension is built using an included copy of the zlib sources if the zlib version found on the system is too old to be used for the build::
ru: Расширение :mod:`zlib` создается с использованием включенной копии исходного кода zlib, если версия zlib, найденная в системе, слишком стара, чтобы ее можно было использовать для сборки::

source: Copyright (C) 1995-2011 Jean-loup Gailly and Mark Adler This software is provided 'as-is', without any express or implied warranty. In no event will the authors be held liable for any damages arising from the use of this software. Permission is granted to anyone to use this software for any purpose, including commercial applications, and to alter it and redistribute it freely, subject to the following restrictions: 1. The origin of this software must not be misrepresented; you must not claim that you wrote the original software. If you use this software in a product, an acknowledgment in the product documentation would be appreciated but is not required. 2. Altered source versions must be plainly marked as such, and must not be misrepresented as being the original software. 3. This notice may not be removed or altered from any source distribution. Jean-loup Gailly Mark Adler jloup@gzip.org madler@alumni.caltech.edu
ru: Copyright (C) 1995-2011 Жан-Лу Гайи и Марк Адлер. Данное программное обеспечение предоставляется «как есть», без каких-либо явных или подразумеваемых гарантия. Ни при каких обстоятельствах авторы не несут ответственности за какой-либо ущерб. возникшие в результате использования данного программного обеспечения. Разрешение предоставляется каждому на использование этого программного обеспечения для любых целей, включая коммерческие приложения, а также изменять его и распространять свободно, с соблюдением следующих ограничений: 1. Запрещается искажать происхождение этого программного обеспечения; ты не должен утверждайте, что вы написали оригинальное программное обеспечение. Если вы используете это программное обеспечение в продукте подтверждение в документации по продукту будет иметь вид приветствуется, но не является обязательным. 2. Измененные исходные версии должны быть четко обозначены как таковые и не должны быть ошибочно представлено как оригинальное программное обеспечение. 3. Это уведомление не может быть удалено или изменено из любого исходного дистрибутива. Жан-Лу Гайи Марк Адлер jloup@gzip.org madler@alumni.caltech.edu

source: The implementation of the hash table used by the :mod:`tracemalloc` is based on the cfuhash project::
ru: Реализация хеш-таблицы, используемой :mod:`tracemalloc`, основана на проекте cfuhash::

source: Copyright (c) 2005 Don Owens All rights reserved. This code is released under the BSD license: Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met: * Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer. * Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution. * Neither the name of the author nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission. THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
ru: Авторские права (c) 2005 г. Дон Оуэнс Все права защищены. Этот код выпущен под лицензией BSD: Распространение и использование в исходной и двоичной форме, с или без модификация разрешена при условии соблюдения следующих условий встречаются: * При повторном распространении исходного кода необходимо сохранять вышеуказанные авторские права. уведомление, этот список условий и следующий отказ от ответственности. * Распространения в бинарной форме должны воспроизводить вышеизложенное. уведомление об авторских правах, этот список условий и следующее отказ от ответственности в документации и/или других предоставленных материалах с раздачей. * Ни имя автора, ни имена его участники могут быть использованы для одобрения или продвижения продуктов, созданных из этого программного обеспечения без специального предварительного письменного разрешения. ДАННОЕ ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЕНО ОБЛАДАТЕЛЯМИ АВТОРСКИХ ПРАВ И УЧАСТНИКАМИ. «КАК ЕСТЬ» И ЛЮБЫЕ ЯВНЫЕ ИЛИ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ ​​ПОДРАЗУМЕВАЕМЫМИ ГАРАНТИЯМИ ТОВАРНОЙ ГОДНОСТИ И ПРИГОДНОСТИ ДЛЯ КОНКРЕТНЫХ ЦЕЛЕЙ ОТКАЗЫВАЮТСЯ. НИ В КОЕМ СЛУЧАЕ НЕ ДОЛЖНО ВЛАДЕЛЕЦ АВТОРСКИХ ПРАВ ИЛИ УЧАСТНИКИ НЕСУТ ОТВЕТСТВЕННОСТЬ ЗА ЛЮБЫЕ ПРЯМЫЕ, КОСВЕННЫЕ, СЛУЧАЙНЫЕ, ОСОБЫЕ, ПРИМЕРНЫЕ ИЛИ КОСВЕННЫЕ УБЫТКИ (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ЗАКУПКУ ТОВАРОВ-ЗАМЕНИТЕЛЕЙ ИЛИ SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISEDО ВОЗМОЖНОСТИ ТАКОГО ПОВРЕЖДЕНИЯ.

source: The :mod:`!_decimal` C extension underlying the :mod:`decimal` module is built using an included copy of the libmpdec library unless the build is configured ``--with-system-libmpdec``::
ru: Расширение C :mod:`!_decimal` C, лежащее в основе модуля :mod:`decimal`, создается с использованием включенной копии библиотеки libmpdec, если только сборка не настроена ``--with-system-libmpdec``::

source: Copyright (c) 2008-2020 Stefan Krah. All rights reserved. Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met: 1. Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer. 2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution. THIS SOFTWARE IS PROVIDED BY THE AUTHOR AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
ru: Copyright (c) 2008-2020 Стефан Кра. Все права защищены. Распространение и использование в исходной и двоичной форме, с или без модификация разрешена при условии соблюдения следующих условий встречаются: 1. При повторном распространении исходного кода необходимо сохранять вышеуказанные авторские права. уведомление, этот список условий и следующий отказ от ответственности. 2. Распространения в бинарной форме должны воспроизводить вышеуказанные авторские права. уведомление, этот список условий и следующий отказ от ответственности в документация и/или другие материалы, поставляемые вместе с дистрибутивом. ЭТО ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ АВТОРОМ И УЧАСТНИКАМИ «КАК ЕСТЬ» И ЛЮБЫЕ ЯВНЫЕ ИЛИ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ ТОВАРНОЙ ГОДНОСТИ И ПРИГОДНОСТИ ДЛЯ ОПРЕДЕЛЕННОЙ ЦЕЛИ ОТКАЗЫВАЮТСЯ. НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ АВТОР ИЛИ УЧАСТНИКИ НЕ НЕСУТ ОТВЕТСТВЕННОСТИ ДЛЯ ЛЮБЫХ ПРЯМЫХ, КОСВЕННЫХ, СЛУЧАЙНЫХ, СПЕЦИАЛЬНЫХ, ПРИМЕРНЫХ ИЛИ КОСВЕННЫХ УЩЕРБ (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ), ПРИОБРЕТЕНИЕ ТОВАРА-ЗАМЕНИТЕЛЯ ИЛИ УСЛУГИ; ПОТЕРЯ ИСПОЛЬЗОВАНИЯ, ДАННЫХ ИЛИ ПРИБЫЛИ; ИЛИ ПЕРЕРЫВ БИЗНЕСА) КАКАЯ бы она ни была вызвана, И НА ЛЮБОЙ ТЕОРИИ ОТВЕТСТВЕННОСТИ, БЫ В ДОГОВОРЕ, СТРОГО ОТВЕТСТВЕННОСТЬ ИЛИ ПРАВОНАРУШЕНИЕ (ВКЛЮЧАЯ НЕБРЕЖНОСТЬ ИЛИ ДРУГОЕ), ВОЗНИКАЮЩИЕ ЛЮБЫМ ОБРАЗОМ OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OFТАКОЙ ПОВРЕЖДЕНИЕ.

source: W3C C14N test suite
ru: Набор тестов W3C C14N

source: The C14N 2.0 test suite in the :mod:`test` package (``Lib/test/xmltestdata/c14n-20/``) was retrieved from the W3C website at https://www.w3.org/TR/xml-c14n2-testcases/ and is distributed under the 3-clause BSD license::
ru: Набор тестов C14N 2.0 в пакете :mod:`test` (``Lib/test/xmltestdata/c14n-20/``) был получен с веб-сайта W3C по адресу https://www.w3.org/TR/xml. -c14n2-testcases/ и распространяется по лицензии BSD из 3 пунктов:

source: Copyright (c) 2013 W3C(R) (MIT, ERCIM, Keio, Beihang), All Rights Reserved. Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met: * Redistributions of works must retain the original copyright notice, this list of conditions and the following disclaimer. * Redistributions in binary form must reproduce the original copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution. * Neither the name of the W3C nor the names of its contributors may be used to endorse or promote products derived from this work without specific prior written permission. THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
ru: Авторские права (c) 2013 W3C(R) (MIT, ERCIM, Кейо, Бэйхан), Все права защищены. Распространение и использование в исходной и двоичной форме, с или без модификация разрешена при условии соблюдения следующих условий встречаются: * При повторном распространении произведений должно сохраняться оригинальное уведомление об авторских правах, этот список условий и следующий отказ от ответственности. * Распространение в двоичной форме должно воспроизводить исходные авторские права. уведомление, этот список условий и следующий отказ от ответственности в документация и/или другие материалы, поставляемые вместе с дистрибутивом. * Ни название W3C, ни имена его участников не могут быть используется для одобрения или продвижения продуктов, полученных в результате этой работы, без конкретное предварительное письменное разрешение. ДАННОЕ ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЕНО ОБЛАДАТЕЛЯМИ АВТОРСКИХ ПРАВ И УЧАСТНИКАМИ. «КАК ЕСТЬ» И ЛЮБЫЕ ЯВНЫЕ ИЛИ ПОДРАЗУМЕВАЕМЫЕ ГАРАНТИИ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ ​​ПОДРАЗУМЕВАЕМЫМИ ГАРАНТИЯМИ ТОВАРНОЙ ГОДНОСТИ И ПРИГОДНОСТИ ДЛЯ КОНКРЕТНАЯ ЦЕЛЬ ОТКАЗЫВАЕТСЯ. НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ АВТОРСКИЕ ПРАВА ВЛАДЕЛЕЦ ИЛИ УЧАСТНИКИ НЕСУТ ОТВЕТСТВЕННОСТЬ ЗА ЛЮБЫЕ ПРЯМЫЕ, КОСВЕННЫЕ, СЛУЧАЙНЫЕ, ОСОБЫЙ, ПРИМЕРНЫЙ ИЛИ КОСВЕННЫЙ УЩЕРБ (ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЕТСЯ ЗАКУПКАМИ ТОВАРОВ-ЗАМЕНИТЕЛЕЙ ИЛИ УСЛУГ; ПОТЕРЯ ИСПОЛЬЗОВАНИЯ, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANYTHEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USEЭТОГО ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, ДАЖЕ ЕСЛИ ПРЕДУПРЕЖДЕНО О ВОЗМОЖНОСТИ ТАКОГО ПОВРЕЖДЕНИЯ.

source: The audioop module uses the code base in g771.c file of the SoX project. https://sourceforge.net/projects/sox/files/sox/12.17.7/sox-12.17.7.tar.gz
ru: Модуль audioop использует базу кода из файла g771.c проекта SoX. https://sourceforge.net/projects/sox/files/sox/12.17.7/sox-12.17.7.tar.gz

source: This source code is a product of Sun Microsystems, Inc. and is provided for unrestricted use. Users may copy or modify this source code without charge.
ru: Этот исходный код является продуктом Sun Microsystems, Inc. и предоставляется для неограниченного использования. Пользователи могут копировать или изменять этот исходный код бесплатно.

source: SUN SOURCE CODE IS PROVIDED AS IS WITH NO WARRANTIES OF ANY KIND INCLUDING THE WARRANTIES OF DESIGN, MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE, OR ARISING FROM A COURSE OF DEALING, USAGE OR TRADE PRACTICE.
ru: ИСХОДНЫЙ КОД SUN ПРЕДОСТАВЛЯЕТСЯ «КАК ЕСТЬ» БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ, ВКЛЮЧАЯ ГАРАНТИИ ДИЗАЙНА, ТОВАРНОСТИ И ПРИГОДНОСТИ ДЛЯ ОПРЕДЕЛЕННОЙ ЦЕЛИ ИЛИ ВЫТЕКАЮЩИХ В РЕЗУЛЬТАТЕ ДЕЛОВОЙ ДЕЯТЕЛЬНОСТИ, ИСПОЛЬЗОВАНИЯ ИЛИ ТОРГОВОЙ ПРАКТИКИ.

source: Sun source code is provided with no support and without any obligation on the part of Sun Microsystems, Inc. to assist in its use, correction, modification or enhancement.
ru: Исходный код Sun предоставляется без какой-либо поддержки и без каких-либо обязательств со стороны Sun Microsystems, Inc. по оказанию помощи в его использовании, исправлении, модификации или расширении.

source: SUN MICROSYSTEMS, INC. SHALL HAVE NO LIABILITY WITH RESPECT TO THE INFRINGEMENT OF COPYRIGHTS, TRADE SECRETS OR ANY PATENTS BY THIS SOFTWARE OR ANY PART THEREOF.
ru: SUN MICROSYSTEMS, INC. НЕ НЕСЕТ НИКАКОЙ ОТВЕТСТВЕННОСТИ ЗА НАРУШЕНИЕ АВТОРСКИХ ПРАВ, КОММЕРЧЕСКИХ ТАЙН ИЛИ ЛЮБЫХ ПАТЕНТОВ ДАННЫМ ПРОГРАММНЫМ ОБЕСПЕЧЕНИЕМ ИЛИ ЛЮБОЙ ЕГО ЧАСТЬЮ.

source: In no event will Sun Microsystems, Inc. be liable for any lost revenue or profits or other special, indirect and consequential damages, even if Sun has been advised of the possibility of such damages.
ru: Ни при каких обстоятельствах компания Sun Microsystems, Inc. не несет ответственности за любую упущенную выгоду или прибыль, а также за другие особые, косвенные и косвенные убытки, даже если компания Sun была уведомлена о возможности таких убытков.

source: Sun Microsystems, Inc. 2550 Garcia Avenue Mountain View, California 94043
ru: Sun Microsystems, Inc. 2550 Garcia Avenue Mountain View, Калифорния 94043

source: Parts of the :mod:`asyncio` module are incorporated from `uvloop 0.16 <https://github.com/MagicStack/uvloop/tree/v0.16.0>`_, which is distributed under the MIT license::
ru: Части модуля :mod:`asyncio` взяты из `uvloop 0.16 <https://github.com/MagicStack/uvloop/tree/v0.16.0>`_, который распространяется по лицензии MIT::

source: Copyright (c) 2015-2021 MagicStack Inc. http://magic.io Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the "Software"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions: The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software. THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
ru: Авторские права (c) 2015–2021 гг. MagicStack Inc. http://magic.io Разрешение настоящим предоставляется бесплатно любому лицу, получившему копию этого программного обеспечения и связанных с ним файлов документации (файл «Программное обеспечение»), иметь дело с Программным обеспечением без ограничений, в том числе без ограничений права на использование, копирование, изменение, объединение, публикацию, распространять, сублицензировать и/или продавать копии Программного обеспечения, а также разрешать лицам, которым предоставлено Программное обеспечение, делать это при условии, что следующие условия: Вышеупомянутое уведомление об авторских правах и настоящее уведомление о разрешении должны быть включены во все копии или существенные части Программного обеспечения. ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ ПРЕДОСТАВЛЯЕТСЯ «КАК ЕСТЬ», БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ, ЯВНЫЕ ИЛИ ПОДРАЗУМЕВАЕМЫЕ, ВКЛЮЧАЯ, НО НЕ ОГРАНИЧИВАЯСЬ, ГАРАНТИИ ТОРГОВАЯ ПРИГОДНОСТЬ, ПРИГОДНОСТЬ ДЛЯ ОПРЕДЕЛЕННОЙ ЦЕЛИ И НЕНАРУШЕНИЕ ПРАВ. НИ ПРИ КАКИХ ОБСТОЯТЕЛЬСТВАХ АВТОРЫ ИЛИ ОБЛАДАТЕЛИ АВТОРСКИХ ПРАВ НЕ ДОЛЖНЫ БЫТЬ ОТВЕТСТВЕННОСТЬ ЗА ЛЮБЫЕ ПРЕТЕНЗИИ, УБЫТКИ ИЛИ ДРУГУЮ ОТВЕТСТВЕННОСТЬ, КАК В ИСКУ ДОГОВОРА, ПРАВИЛЬНОГО ПРАВОНАРУШЕНИЯ ИЛИ ДРУГИХ ПРОИСХОЖДЕНИЙ, ВЫТЕКАЮЩИХ ИЗ, В СВЯЗИ ИЛИ В СВЯЗИ С ПРОГРАММНЫМ ОБЕСПЕЧЕНИЕМ ИЛИ ИСПОЛЬЗОВАНИЕМ ИЛИ ДРУГИМИ ДЕЛАМИ С ПРОГРАММНЫМ ОБЕСПЕЧЕНИЕМ.
