Repository: rffontenelle/python-docs-tx-translations
Catalog: */LC_MESSAGES/sphinx.po
Languages: id, pl, ru

source: This Page
id: Halaman Ini
pl: Ta strona
ru: Эта страница

source: Report a Bug
id: Laporkan Bug
pl: Zgłoś błąd
ru: Сообщить об ошибке

source: Show Source
id: Perlihatkan Sumber
pl: Pokaż źródło
ru: Показать источник

source: Download
id: Unduh
pl: Pobieranie
ru: Скачать

source: Download Python %(dl_version)s Documentation
ru: Скачать Питон %(dl_version)с Документация

source: Last updated on: %(last_updated)s.
pl: Ostatnia aktualizacja: %(last_updated)s.
ru: Последнее обновление: %(последнее_обновление)с .

source: To download an archive containing all the documents for this version of Python in one of various formats, follow one of links in this table.
pl: Aby pobrać archiwum zawierające pełną dokumentację dla tej wersji Pythona w jednym z wielu formatów, wybierz jeden z linków w tej tabeli.
ru: Чтобы скачать архив со всеми документами для данной версии Python в одном из различных форматов, перейдите по одной из ссылок в этой таблице.

source: Format
ru: Формат

source: Packed as .zip
pl: Spakowane jako .zip
ru: Упаковано как .zip

source: Packed as .tar.bz2
pl: Spakowane jako .tar.bz2
ru: Упаковано как .tar.bz2.

source: <a href="%(dl_base)s/python-%(dl_version)s-docs-pdf-a4.zip">Download</a> (ca. %(download_size)s MiB)
ru: <a href=" %(dl_base)с /python- %(dl_version)с -docs-pdf-a4.zip">Загрузить</a> (ок. %(download_size)с МиБ)

source: <a href="%(dl_base)s/python-%(dl_version)s-docs-pdf-a4.tar.bz2">Download</a> (ca. %(download_size)s MiB)
ru: <a href=" %(dl_base)с /python- %(dl_version)с -docs-pdf-a4.tar.bz2">Загрузить</a> (ок. %(download_size)с МиБ)

source: <a href="%(dl_base)s/python-%(dl_version)s-docs-html.zip">Download</a> (ca. %(download_size)s MiB)
ru: <a href=" %(dl_base)с /python- %(dl_version)с -docs-html.zip">Загрузить</a> (ок. %(download_size)с МиБ)

source: <a href="%(dl_base)s/python-%(dl_version)s-docs-html.tar.bz2">Download</a> (ca. %(download_size)s MiB)
ru: <a href=" %(dl_base)с /python- %(dl_version)с -docs-html.tar.bz2">Загрузить</a> (ок. %(download_size)с МиБ)

source: Plain text
pl: Zwykły tekst
ru: Обычный текст

source: <a href="%(dl_base)s/python-%(dl_version)s-docs-text.zip">Download</a> (ca. %(download_size)s MiB)
ru: <a href=" %(dl_base)с /python- %(dl_version)с -docs-text.zip">Загрузить</a> (ок. %(download_size)с МиБ)

source: <a href="%(dl_base)s/python-%(dl_version)s-docs-text.tar.bz2">Download</a> (ca. %(download_size)s MiB)
ru: <a href=" %(dl_base)с /python- %(dl_version)с -docs-text.tar.bz2">Загрузить</a> (ок. %(download_size)с МиБ)

source: Texinfo
ru: Техинфо

source: <a href="%(dl_base)s/python-%(dl_version)s-docs-texinfo.zip">Download</a> (ca. %(download_size)s MiB)
ru: <a href=" %(dl_base)с /python- %(dl_version)с -docs-texinfo.zip">Загрузить</a> (ок. %(download_size)с МиБ)

source: <a href="%(dl_base)s/python-%(dl_version)s-docs-texinfo.tar.bz2">Download</a> (ca. %(download_size)s MiB)
ru: <a href=" %(dl_base)с /python- %(dl_version)с -docs-texinfo.tar.bz2">Загрузить</a> (ок. %(download_size)с МиБ)

source: <a href="%(dl_base)s/python-%(dl_version)s-docs.epub">Download</a> (ca. %(download_size)s MiB)
ru: <a href=" %(dl_base)с /python- %(dl_version)с -docs.epub">Загрузить</a> (ок. %(download_size)с МиБ)

source: These archives contain all the content in the documentation.
pl: Archiwa te zawierają całą zawartość dokumentacji.
ru: Эти архивы содержат все содержимое документации.

source: Unpacking
pl: Rozpakowywanie
ru: Распаковка

source: Unix users should download the .tar.bz2 archives; these are bzipped tar archives and can be handled in the usual way using tar and the bzip2 program. The <a href="https://infozip.sourceforge.net">Info-ZIP</a> unzip program can be used to handle the ZIP archives if desired. The .tar.bz2 archives provide the best compression and fastest download times.
pl: Użytkownicy systemów Unix powinni pobrać archiwa .tar.bz2; są to archiwa tar kompresowane algorytmem bzip i mogą być obsługiwane w zwykły sposób przy użyciu tar i programu bzip2. Można użyć programu rozpakowującego <a href="https://infozip.sourceforge.net">Info-ZIP</a> do obsługi archiwów ZIP. Archiwa .tar.bz2 zapewniają najlepszą kompresję i najszybszy czas pobierania.
ru: Пользователям Unix следует загрузить архивы .tar.bz2; это сжатый tar архивы и могут обрабатываться обычным способом, используя tar и bzip2. программа. Программа распаковки <a href="https://infozip.sourceforge.net">Info-ZIP</a> может быть при необходимости используется для обработки ZIP-архивов. Архивы .tar.bz2 предоставляют лучшее сжатие и самое быстрое время загрузки.

source: Windows users can use the ZIP archives since those are customary on that platform. These are created on Unix using the Info-ZIP zip program.
pl: Użytkownicy systemu Windows mogą korzystać z archiwów ZIP, ponieważ są one zwyczajowo używane na tej platformie. Są one tworzone na Uniksie przy użyciu programu Info-ZIP.
ru: Пользователи Windows могут использовать ZIP-архивы, так как они там приняты. платформа. Они создаются в Unix с помощью zip-программы Info-ZIP.

source: Problems
pl: Problemy
ru: Проблемы

source: If you have comments or suggestions for the Python documentation, please send email to <a href="mailto:docs@python.org">docs@python.org</a>.
pl: Jeśli masz komentarz lub sugestie dotyczące dokumentacji Python, wyślij e-mail na adres <a href="mailto:docs@python.org">docs@python.org</a>.
ru: Если у вас есть комментарии или предложения по документации Python, отправьте отправьте электронное письмо по адресу <a href="mailto:docs@python.org">docs@python.org</a>.

source: CPython implementation detail:
id: Detail implementasi CPython:
pl: Szczegół implementacyjny CPythona:
ru: Подробная информация о реализации CPython:

source: Deprecated since version {deprecated}, will be removed in version {removed}
id: Tidak digunakan lagi karena versi {deprecated}, akan dihapus dalam versi {removed}
pl: Zdezaprobowane w wersji {deprecated}, zostanie usunięte w wersji {removed}
ru: Устарело с версии {deprecated}, будет удалено в версии {removed}

source: Deprecated since version {deprecated}, removed in version {removed}
id: Tidak digunakan lagi karena versi {deprecated}, akan dihapus dalam versi {removed}
pl: Zdezaprobowane w wersji {deprecated}, usunięte w wersji {removed}
ru: Устарело с версии {deprecated}, удалено в версии {removed}

source: Part of the
pl: Część
ru: Часть

source: Limited API
pl: ograniczonego API
ru: Ограниченный API

source: Stable ABI
pl: stabilnego ABI
ru: Стабильный ABI

source: (as an opaque struct)
pl: (jako nieprzezroczysta struktura)
ru: (как непрозрачная структура)

source: (including all members)
pl: (w tym wszystkie składniki)
ru: (включая всех участников)

source: since version %s
pl: od wersji %s
ru: начиная с версии %s

source: (Only some members are part of the stable ABI.)
pl: (tylko niektóre składniki są częścią stabilnego ABI)
ru: (Только некоторые участники являются частью стабильного ABI.)

source: This is
pl: To jest
ru: Это

source: Unstable API
pl: niestabilne API
ru: Нестабильный API

source: . It may change without warning in minor releases.
pl: . Może ulec zmianie bez ostrzeżenia w wydaniach minor.
ru: . В небольших выпусках это может измениться без предупреждения.

source: Return value: Always NULL.
pl: Wartość zwracana: zawsze NULL.
ru: Возвращаемое значение: Всегда NULL.

source: Return value: New reference.
pl: Wartość zwracana: nowa referencja.
ru: Возвращаемое значение: Новая ссылка.

source: Return value: Borrowed reference.
pl: Wartość zwracana: pożyczona referencja.
ru: Возвращаемое значение: Заимствованная ссылка.

source: in development
pl: w rozwoju
ru: в разработке

source: pre-release
pl: przedpremiera
ru: пререлиз

source: stable
pl: stabilny
ru: стабильный

source: security-fixes
pl: poprawki bezpieczeństwa
ru: исправления безопасности

source: Welcome! This is the official documentation for Python %(release)s.
pl: Witamy! To jest oficjalna dokumentacja Pythona %(release)s.
ru: Добро пожаловать! Это официальная документация для Python. %(выпуск)с .

source: Documentation sections:
pl: Sekcje dokumentacji:
ru: Разделы документации:

source: What's new in Python %(version)s?
id: Apa yang baru di Python %(version)s?
pl: Co nowego w Pythonie %(version)s?
ru: Что нового в Python %(version)s?

source: Or <a href="%(whatsnew_index)s">all "What's new" documents since Python 2.0</a>
pl: Lub <a href="%(whatsnew_index)s">wszystkie dokumenty „Co nowego”</a> od 2.0
ru: Или <a href=" %(whatsnew_index)s ">все документы "Что нового", начиная с Python 2.0</a>

source: Tutorial
ru: Руководство

source: Start here: a tour of Python's syntax and features
pl: Zacznij tutaj: wycieczka po składni i funkcjach Pythona
ru: Начните здесь: обзор синтаксиса и возможностей Python.

source: Standard library and builtins
pl: Biblioteka standardowa i funkcje wbudowane
ru: Стандартная библиотека и встроенные функции

source: Language reference
ru: Справочник по языку

source: Syntax and language elements
ru: Синтаксис и языковые элементы

source: Python setup and usage
ru: Настройка и использование Python

source: How to install, configure, and use Python
ru: Как установить, настроить и использовать Python

source: Python HOWTOs
id: HOWTOs Python
pl: Pythonowe „Jak to zrobić?”
ru: Python КакСде

source: In-depth topic manuals
ru: Подробные тематические руководства

source: Installing Python modules
ru: Установка модулей Python

source: Third-party modules and PyPI.org
ru: Сторонние модули и PyPI.org

source: Distributing Python modules
ru: Распространение модулей Python

source: Publishing modules for use by other people
ru: Публикация модулей для использования другими людьми

source: Extending and embedding
ru: Расширение и встраивание

source: For C/C++ programmers
ru: Для программистов C/C++

source: Python's C API
ru: API C Python

source: C API reference
ru: Справочник по API C

source: Frequently asked questions (with answers!)
ru: Часто задаваемые вопросы (с ответами!)

source: Deprecations
ru: Устаревания

source: Deprecated functionality
ru: Устаревшая функциональность

source: Indices, glossary, and search:
ru: Индексы, глоссарий и поиск:

source: Global module index
ru: Глобальный индекс модуля

source: All modules and libraries
ru: Все модули и библиотеки

source: General index
ru: Общий индекс

source: All functions, classes, and terms
ru: Все функции, классы и термины

source: Glossary
id: Ikhtisar
pl: Glosariusz
ru: Глоссарий

source: Terms explained
ru: Объяснение терминов

source: Search page
id: Halaman pencarian
pl: Strona wyszukiwania
ru: Страница поиска

source: Search this documentation
ru: Искать в этой документации

source: Complete table of contents
ru: Полное содержание

source: Lists all sections and subsections
ru: Перечисляет все разделы и подразделы

source: Project information:
ru: Информация о проекте:

source: Reporting issues
ru: Сообщение о проблемах

source: Contributing to Docs
pl: Rozwijanie dokumentacji
ru: Участие в документации

source: Download the documentation
ru: Скачать документацию

source: History and license of Python
ru: История и лицензия Python

source: Copyright
id: Hak Cipta
pl: Prawa autorskie
ru: Авторское право

source: About the documentation
id: Tentang Dokumentasi
pl: O dokumentacji
ru: О документации

source: Download these documents
id: Unduh dokumen-dokumen ini
pl: Pobierz te dokumenty
ru: Загрузите эти документы

source: Docs by version
id: Dokumen menurut versi
pl: Dokumentacja według wersji
ru: Документы по версии

source: Stable
pl: Stabilna
ru: Стабильный

source: In development
pl: W rozwoju
ru: В разработке

source: All versions
id: Semua versi
pl: Wszystkie wersje
ru: Все версии

source: Other resources
id: Sumber daya lain
pl: Inne zasoby
ru: Другие ресурсы

source: PEP Index
id: Indeks PEP
ru: Индекс PEP

source: Beginner's Guide
id: Panduan Pemula
pl: Przewodnik dla początkujących
ru: Руководство для начинающих

source: Book List
id: Daftar Buku
pl: Lista książek
ru: Список книг

source: Audio/Visual Talks
id: Perbincangan Audio/Visual
pl: Nagrania audio/wideo
ru: Аудио/визуальные обсуждения

source: Python Developer’s Guide
ru: Руководство разработчика на Python

source: This document is for an old version of Python that is no longer supported. You should upgrade, and read the
ru: Этот документ предназначен для старой версии Python, которая больше не поддерживается. Вам следует обновиться и прочитать

source: Python documentation for the current stable release
ru: Документация Python для текущей стабильной версии

source: This is a deploy preview created from a <a href="%(repository_url)s/pull/%(pr_id)s">pull request</a>. For authoritative documentation, see
ru: Это предварительный просмотр развертывания, созданный на основе <a href=" %(repository_url)s /тянуть/ %(pr_id)с ">запрос на извлечение</a>. Авторитетную документацию см.

source: the current stable release
ru: текущая стабильная версия

source: Download Python %(release)s Documentation
pl: Pobierz dokumentację Pythona %(release)s

source: PDF (US-Letter paper size)
pl: PDF (rozmiar papieru US-Letter)

source: <a href="%(dlbase)s/python-%(release)s-docs-pdf-letter.zip">Download</a> (ca. %(download_size)s MiB)
pl: <a href="%(dlbase)s/python-%(release)s-docs-pdf-letter.zip">Pobierz</a> (ok. %(download_size)s MiB)

source: <a href="%(dlbase)s/python-%(release)s-docs-pdf-letter.tar.bz2">Download</a> (ca. %(download_size)s MiB)
pl: <a href="%(dlbase)s/python-%(release)s-docs-pdf-letter.tar.bz2">Pobierz</a> (ok. %(download_size)s MiB)

source: PDF (A4 paper size)
pl: PDF (format papieru A4)

source: <a href="%(dlbase)s/python-%(release)s-docs-pdf-a4.zip">Download</a> (ca. %(download_size)s MiB)
pl: <a href="%(dlbase)s/python-%(release)s-docs-pdf-a4.zip">Pobierz</a> (ok. %(download_size)s MiB)

source: <a href="%(dlbase)s/python-%(release)s-docs-pdf-a4.tar.bz2">Download</a> (ca. %(download_size)s MiB)
pl: <a href="%(dlbase)s/python-%(release)s-docs-pdf-a4.tar.bz2">Pobierz</a> (ok. %(download_size)s MiB)

source: <a href="%(dlbase)s/python-%(release)s-docs-html.zip">Download</a> (ca. %(download_size)s MiB)
pl: <a href="%(dlbase)s/python-%(release)s-docs-html.zip">Pobierz</a> (ok. %(download_size)s MiB)

source: <a href="%(dlbase)s/python-%(release)s-docs-html.tar.bz2">Download</a> (ca. %(download_size)s MiB)
pl: <a href="%(dlbase)s/python-%(release)s-docs-html.tar.bz2">Pobierz</a> (ok. %(download_size)s MiB)

source: <a href="%(dlbase)s/python-%(release)s-docs-text.zip">Download</a> (ca. %(download_size)s MiB)
pl: <a href="%(dlbase)s/python-%(release)s-docs-text.zip">Pobierz</a> (ok. %(download_size)s MiB)

source: <a href="%(dlbase)s/python-%(release)s-docs-text.tar.bz2">Download</a> (ca. %(download_size)s MiB)
pl: <a href="%(dlbase)s/python-%(release)s-docs-text.tar.bz2">Pobierz</a> (ok. %(download_size)s MiB)

source: <a href="%(dlbase)s/python-%(release)s-docs-texinfo.zip">Download</a> (ca. %(download_size)s MiB)
pl: <a href="%(dlbase)s/python-%(release)s-docs-texinfo.zip">Pobierz</a> (ok. %(download_size)s MiB)

source: <a href="%(dlbase)s/python-%(release)s-docs-texinfo.tar.bz2">Download</a> (ca. %(download_size)s MiB)
pl: <a href="%(dlbase)s/python-%(release)s-docs-texinfo.tar.bz2">Pobierz</a> (ok. %(download_size)s MiB)

source: <a href="%(dlbase)s/python-%(release)s-docs.epub">Download</a> (ca. %(download_size)s MiB)
pl: <a href="%(dlbase)s/python-%(release)s-docs.epub">Pobierz</a> (ok. %(download_size)s MiB)

source: EOL
pl: niewspierany

source: Library reference
pl: Dokumentacja biblioteki

source: FAQs
pl: Często zadawane pytania

source: Welcome! This is the documentation for Python %(release)s.
id: Selamat datang! Ini adalah dokumentasi untuk%(release)s.

source: Parts of the documentation:
id: Bagian dari dokumentasi:

source: or <a href="%(whatsnew_index)s">all "What's new" documents</a> since 2.0
id: atau <a href="%(whatsnew_index)s">semua dokumen "Apa yang baru"</a> sejak 2.0

source: start here
id: mulai di sini

source: Library Reference
id: Referensi Pustaka

source: keep this under your pillow
id: simpan ini di bawah bantalmu

source: Language Reference
id: Referensi Bahasa

source: describes syntax and language elements
id: menjelaskan sintaks dan elemen bahasa

source: Python Setup and Usage
id: Pengaturan dan Penggunaan Python

source: how to use Python on different platforms
id: cara menggunakan Python di berbagai platform

source: in-depth documents on specific topics
id: dokumen mendalam tentang topik tertentu

source: Installing Python Modules
id: Memasang Modul-modul Python

source: installing from the Python Package Index &amp; other sources
id: instalasi dari Python Package Index &amp; sumber lain

source: Distributing Python Modules
id: Mendistribusikan Modul Python

source: publishing modules for installation by others
id: menerbitkan modul untuk instalasi oleh orang lain

source: Extending and Embedding
id: Memperluas dan Menanamkan

source: tutorial for C/C++ programmers
id: tutorial untuk programmer C/C++

source: Python/C API
id: API Python/C

source: reference for C/C++ programmers
id: referensi untuk programmer C/C++

source: frequently asked questions (with answers!)
id: pertanyaan yang sering diajukan (dengan jawaban!)

source: Indices and tables:
id: Indeks dan tabel:

source: Global Module Index
id: Indeks Modul Global

source: quick access to all modules
id: akses cepat ke semua modul

source: General Index
id: Indeks Umum

source: all functions, classes, terms
id: semua fungsi, kelas, istilah

source: the most important terms explained
id: istilah yang paling penting dijelaskan

source: search this documentation
id: cari dokumentasi ini

source: Complete Table of Contents
id: Daftar Isi Lengkap

source: lists all sections and subsections
id: daftar semua bagian dan subbagian

source: Meta information:
id: Informasi meta:

source: Reporting bugs
id: Melaporkan bug

source: History and License of Python
id: Sejarah dan Lisensi Python

source: Python Developerâ€™s Guide
id: Pandungan Pengembang Python

source: This document is for an old version of Python that is no longer supported. You should upgrade, and read the
id: Dokumen ini untuk versi lama Python yang tidak didukung lagi. Anda harus memutakhirkan, dan membaca

source: Python documentation for the current stable release
id: Dokumentasi Python untuk rilis stabil saat ini

source: Documentation
id: Dokumentasi
